{
  "source": "https://www.techradar.com/news/you-can-now-have-thousands-more-people-in-your-microsoft-teams-call",
  "title": "You can now have thousands more people in your Microsoft Teams call",
  "category": "computing",
  "updated": "2021-08-03T03:00:44Z",
  "author": "anthony-spadafora",
  "summary": "US government organizations will soon be able to add up to 25,000 members to a Teams call",
  "article": [
    "Microsoft is raising the maximum number of participants in video conferences held in Teams for US government organizations according to a new update to the Microsoft 365 roadmap.",
    "Beginning in October of this year, the US Department of Defense (DoD) will be able to add up to 25,000 members to Teams' calls on desktop.",
    "Likewise, in September of this year, Government Community Cloud (GCC) High customers will also be able to add up to 25,000 members per team in video calls made on the company's online collaboration platform.",
    "While you need to be a member of the DoD to use Microsoft 365 DoD, GCC High was created for both DoD and federal contractors that must meet the stringent cybersecurity compliance requirements of NIST 800-171, FedRAM High and ITAR according to Agile IT.",
    "In addition to raising the maximum number of participants for US government organizations, Microsoft is also bringing native notifications for macOS to Teams for GCC, GCC High and DoD customers.",
    "Users will now be able to choose how they receive Microsoft Teams notifications in macOS. While some users may want to receive notifications via Teams' built-in notifications, they now also have the option to use macOS native notifications instead.",
    "When a user decides to choose native notifications, Teams will inherit the operation system's notifications settings and will also support quite hours, action center triaging and do not disturb (DND).",
    "macOS native notifications will begin rolling out to GCC, GCC High and DoD customers using Teams later this month while business and education customers can enable this feature now."
  ],
  "headers": {
    "4": "macOS native notifications"
  },
  "links": {
    "video conferences": "https://www.techradar.com/best/best-video-conferencing-software",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Microsoft 365 roadmap": "https://www.techradar.com/news/microsoft-teams-can-now-be-used-for-work-and-play-simultaneously",
    "DoD": "https://www.techradar.com/news/google-cloud-scores-huge-department-of-defense-computing-contract",
    "online collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Agile IT": "https://www.agileit.com/news/what-is-gcc-high/",
    "native notifications": "https://www.techradar.com/news/microsoft-teams-for-macos-is-getting-some-love",
    "DND": "https://www.techradar.com/news/windows-10-preview-beefs-up-do-not-disturb-feature-and-sharpens-edge-browser"
  }
}