{
  "source": "https://www.techradar.com/news/dell-adds-on-hybrid-cloud-management-to-its-client-computing-software",
  "title": "Dell adds on hybrid cloud management to its client computing software",
  "category": "computing",
  "updated": "2021-03-10T11:59:20Z",
  "author": "mayank-sharma",
  "summary": "Dell Hybrid Client can be managed through the cloud",
  "article": [
    "In a bid to support the work from home anywhere environment, Dell has released an updated version of its Dell Hybrid Client app that allows secure access to applications and data wherever they are located.",
    "Originally released in September 2020, the latest iteration of the Dell Hybrid Client (DHC) extends the hybrid management tool to a wider range of devices and more cloud computing options.",
    "“For employees, Dell Hybrid Client delivers the same, personalised experience regardless of the device you chose to work on. Everything you need is at your fingertips. For IT, we’ve opened access to multiple clouds enabling experiences to be scaled and customised for workforces at rapid pace,” said Brooke Huling, vice president, Modern Computing Solutions Group, Dell Technologies.",
    "According to Dell, DHC bundles useful productivity applications, including a VPN client, user file encryption, secure boot, and more, all of which can be managed through the cloud to facilitate remote working.",
    "The latest release works with multiple cloud vendors, including Google Cloud and Microsoft Azure.",
    "The service uses single sign-on authentication to log the user into their personalized environment, which the company notes remains consistent across all supported desktop interfaces.",
    "Furthermore, DHC is designed to integrate with locally installed instances of Zoom and Microsoft Teams.",
    "While the DHC was previously available with OptiPlex 7070 Ultra and Wyse 5070 thin clients, it now also works with the Latitude 3320, as well as the OptiPlex 3090 and 7090 Ultra workstations."
  ],
  "headers": {
    "3": "More features"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "secure access": "https://www.techradar.com/news/best-access-control-systems",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "productivity applications": "https://www.techradar.com/best/best-productivity-apps",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Microsoft Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "single sign-on authentication": "https://www.techradar.com/best/best-identity-management-software",
    "OptiPlex 7070 Ultra": "https://www.techradar.com/news/dells-optiplex-7070-ultra-is-a-minimalists-modular-all-in-one-pc-dream"
  }
}