{
  "source": "https://www.techradar.com/news/lg-phones-are-over-heres-our-memories-of-its-top-phones-from-the-last-25-years",
  "title": "LG phones are over - here are our memories of its top phones from the last 25 years",
  "category": "phones",
  "updated": "2021-04-06T14:39:01.733Z",
  "author": "techradar-team",
  "summary": "A selection of our favorite LG phones",
  "article": [
    "LG has confirmed it will stop making smartphones, and that means we won't be seeing devices like the LG Rollable, V70 or Velvet 2 hit the market as we had previously been expecting.",
    "Instead, the company will be leaving the mobile phone market for good after 25 years of making handsets. LG was there making feature phones right at the beginning, and it was one of the first big electronic companies to enter the mobile phone business.",
    "LG has been known for making mobile phones for that whole period, and the company has been a major player in the smartphone market too, making Android handsets since 2009 with its debut LG GW620 handset.",
    "We've put together a variety of our favorite mobile phone choices over the last twenty-five years. These may not be the absolute best phones the company has ever made, but they're the ones we have the fondest memories of at TechRadar.",
    "The LG C1100 flip phone was a cheap little thing, but that’s the kind of phone LG did best - it was a flip phone, and the first mobile I ever owned.",
    "It was a tiny handset with a small screen, hard-to-press number pad, and frail little form, but I loved it, and the size is probably to blame for my preference in small-form phones ever since.",
    "It didn’t have a camera (who needs one), it only had one game (but it was the best game so who cares) and it only played little monophonic ringtones that were really annoying to download (but I had a cute rendition of The Automatic’s Monster that I used for every ringtone).",
    "Best of all, it gave an upbeat little WOOP when you opened it up, and a downbeat sad WEWP when you closed it, which I never tired of after years of use. This feature alone is cool enough to justify a comeback for flip phones.",
    "Upon hearing news of LG mobile’s death I dug out my old C1100, to maybe start using it again, but for the life of me I can’t find any kind of charger to use for it - it’s also locked to Orange, which doesn’t actually operate in my country any more. Sad.",
    "By Tom Bedford",
    "The very fact I refuse to throw this phone away - nearly a decade and a half after release - shows the love I have for it. This phone had a 5MP camera, Xenon flash, DVD(ish) quality video recording, a manual zoom button - and a touchscreen.",
    "For all you kids out there, you don’t know how exciting this was to use when you’d been only used to tapping away at keys. A keyboard that could move and become a movie screen? Amazing! (Skipping past the fact there was very little video content out there to actually watch).",
    "There was a stylus that you could attach with a little cord (although that quickly got annoying) and I’m certain that if I fired up the phone now, the resistive touchscreen would drive me up the wall (where it senses pressure over spotting the electrical conduct in your fingertips) by inaccurately guessing which part of the screen I wanted to prod.",
    "It was rumored that this phone actually outsold the initial iPhone, thanks to the higher spec, lower price (and the fact Apple wasn’t officially reporting sales figures…) and while that lead didn’t last long, it was entirely deserved in my eyes.",
    "By Gareth Beavis",
    "When the LG Cookie launched in 2008, it took youngsters by storm. I know that, because I was one, and it marked the first phone I could actually call my own. In hindsight, the Cookie wasn’t all that spectacular, and in fact, LG used it to target the entry-level touchscreen market by keeping the cost of the device as low as possible.",
    "That scrimping resulted in a 3-inch, 240 x 400 pixel touchscreen powered by an ARM9E CPU with a clock rate of 175 MHz. It also had a 3.15 MP camera capable of capturing videos at 12 frame/s, and no flash option.",
    "Pretty impressive, right? No, not really, but the combination of super cool looks (yes, I had the white version) and a neat little stylus hidden away in the phone’s body meant the LG Cookie was, for me, the height of style and innovation during my formative years.",
    "By Axel Metz",
    "There have been a few smartphones over the years that have almost exquisitely got the blend of features, hardware and price right, and the LG G2 (or Optimus G2 in some regions, as the company inexplicably kept jamming a clunky extra word into the title) was just that.",
    "This was just a great handset. A 5.2-inch screen was huge at the time, and the 13MP camera was right in the race for the best out there, with loads of great features to tweak and some top snaps being possible. The shiny, rounded plastic shell felt robust in the hand and the overall interface was brimming with clever little tweaks to improve the basic Android experience.",
    "But the main star was the placement of the rear buttons - a power key that was flanked above and below by the volume buttons on the back of the phone!",
    "The idea was that this would be more of a natural, ergonomic fit in the hand given its ‘huge’ size and therefore you’d be less likely to drop it. Some reviewers found that it was too hard to reprogram the brain to look for the unlock key there, but they weren’t using it for long enough. I sometimes still yearn for it now, and keep wondering why phone brands aren’t using the rear of the phone for some kind of touch interface.",
    "Of course, I’m pretty sure the annals of time are making me remember this phone with a rosy hue - Android overlays were often buggy back then, the fiddly camera settings probably irked and the buttons probably fell off or something. But I remember this phone with true fondness - for a time, it looked like the success of this phone was going to keep LG at the top table of the smartphone world for years to come, but sadly that never materialized.",
    "By Gareth Beavis",
    "The most human phone ever. That was LG’s slogan for the wonderfully barmy LG G Flex - a handset which featured a ‘flexible’ display and ‘self-healing’ back.",
    "The device itself was also ‘flexible’. The G Flex had a natural curvature, which LG said allowed it to sit more comfortably against your face, and position the microphone closer to your mouth - who remembers the Nokia 8110 ‘banana phone’?",
    "However, as I said in my review of the phone; “don't get too excited about its flexible abilities...you can't actually go about folding it up.",
    "“Lay the LG G Flex face down on a flat surface and at its most curved point the screen is still just a few millimetres above the surface - but then comes the fun part. Apply a decent amount of pressure to the rear of the G Flex and you can flatten the handset out.”",
    "And the reaction it got when I showed people this flexible feat? “I was met - without fail - by a sea of wincing faces as the G Flex made seriously concerning creaking and crunching sounds. Sure the handset does flex, slightly, but it never sounds like it's enjoying the workout.”",
    "Then there was the ‘self-healing’ back which was able to soak up minor bumps and knocks - but it certainly wasn’t immune to a scratch or two. The LG G Flex wasn’t the best phone, and it was extremely expensive, but it did what LG did best - something different, something unique, something wild. And that’s what I love.",
    "By John McCann",
    "2013 was a big year for LG in the smartphone world. Alongside its G2 flagship and its first bendy phone, it was invited to make the next iteration of Google's Nexus line of smartphones.",
    "Nexus was a project from Google that brought in Android phone manufacturers to make hardware designed to show off what the software can do in its purest form. The Nexus 5 was one of the best handsets in the series, and a big part of that is down to LG's impact.",
    "The Nexus 5 had a lot of similarities with the LG G2 we've mentioned above, but this used Android software in a way that Google intended, it felt even sleeker than the LG G2 and it had an affordable price too.",
    "As one of the first smartphones I used as a technology journalist, I began to see what Google was aiming for with its Nexus line on the Nexus 5. I also spotted what LG was capable of in one of the best time periods for LG smartphones, and I'll always have a fondness for this specific phone because of that.",
    "By James Peckham",
    "The LG Wing was supposed to be unlike any other smartphone the world had ever seen. It was the first device in LG’s 'Explorer' series of devices, which would have been a series of products meant to explore unconventional form-factors – such as the LG Rollable.",
    "The LG Wing broke every rule of the textbook, with a big and bulky design, far too many moving parts, at a premium price point for mid-range specs. While it was not really the best phone for the price, it was among the most enjoyable devices that I ever laid my hands on.",
    "It was a cool party trick to reveal the second display with just a swipe, in what was probably the most polarizing design of its time. Notably, even for a first-gen product with an unfamiliar form factor, it was surprisingly not bad, with a decent number of features and third-party apps optimized to make use of the dual-screen approach.",
    "The Wing is a fitting swansong for LG’s smartphone journey, cementing its place in the history books as one of the most innovative brands in this space, being unafraid of experimenting and going against the norms; while serving as a reminder of how unforgiving the smartphone market can be.",
    "By Aakash Jhaveri"
  ],
  "headers": {
    "4": "LG C1100, 2004",
    "10": "LG KU990 Viewty, 2007",
    "15": "LG Cookie, 2008",
    "19": "LG G2, 2013",
    "25": "LG G Flex, 2013",
    "32": "Nexus 5, 2013",
    "37": "LG Wing, 2020"
  },
  "links": {
    "stop making smartphones": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "LG G2": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g2-1171025/review",
    "LG G Flex": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g-flex-1225525/review",
    "who remembers the Nokia 8110 ‘banana phone’": "https://www.techradar.com/news/nokia-8110-vs-nokia-8110-4g-retro-meets-the-reboot",
    "LG Wing": "https://www.techradar.com/reviews/lg-wing-5g-review",
    "Explorer": "https://www.techradar.com/news/did-lg-just-tease-yet-another-extendable-smartphone"
  }
}