{
  "source": "https://www.techradar.com/news/ios-15-will-include-this-important-security-feature-for-the-first-time",
  "title": "iOS 15 will include this important security feature for the first time",
  "category": "computing",
  "updated": "2021-06-08T15:04:34Z",
  "author": "mayank-sharma",
  "summary": "Built-in 2FA is coming to iOS 15",
  "article": [
    "Apple's newly-announced iOS 15 will include built-in a two factor verification code generator for the first time, the company has confirmed.",
    "Two-factor authentication (2FA), also known as two-step verification, is a security process that requires users to provide two different identification factors to authenticate themselves. The scheme usually involves providing a security token in addition to their password.",
    "At its recent WWDC 2021, Apple announced iOS 15 will include a built-in authenticator that will help generate verification codes for online services that support 2FA, eliminating the need to download a third-party app, like Google Authenticator or Authy.",
    "Using multiple authenticators helps protect accounts against compromised passwords by adding an additional layer of security to the authentication process.",
    "Reports suggest that iOS 15 will enable users to hook up their online accounts in the Settings app, just like passwords.",
    "Once you’ve set up your online accounts, iOS 15 will go one step further and very conveniently will actually autofill the 2FA codes when it detects you are signing into a registered account.",
    "This feature will be available in ‌iOS 15‌, iPadOS 15, and macOS Monterey.",
    "Via 9to5Mac"
  ],
  "headers": {
    "3": "Added security"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "password": "https://www.techradar.com/best/password-manager",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "9to5Mac": "https://9to5mac.com/2021/06/07/ios-15-ipados-15-and-macos-monterey-gain-built-in-two-factor-code-generator-and-autofill/"
  }
}