{
  "source": "https://www.techradar.com/news/your-smartwatch-could-detect-covid-19-before-you-do",
  "title": "Your smartwatch could detect Covid-19 before you do",
  "category": "wearables",
  "updated": "2021-01-18T16:37:30Z",
  "author": "axel-metz",
  "summary": "Could an Apple Watch save your life?",
  "article": [
    "Smartwatches including the Apple Watch may be able to detect the signs of Covid-19 before you know you're sick, a recent study has found.",
    "In a study titled “Warrior Watch”, researchers at the Mount Sinai medical center found that the Apple Watch is able to detect small changes to a user’s heartbeat which may indicate they’ve contracted Covid-19 up to seven days before they develop visible symptoms.",
    "Specifically, the study analyzed a metric called heart rate variability (HRV) — the variation in time between each heartbeat — which is also a measure of how well a person's immune system is working. The participants wore Apple Watches equipped with special apps that measured changes in their HRV.",
    "\"We already knew that heart rate variability markers change as inflammation develops in the body, and Covid is an incredibly inflammatory event,\" Dr. Robert Hirten, assistant professor at the Icahn School of Medicine in New York City and author of the study, told CBS. \"It allows us to predict that people are infected before they know it.\"",
    "A similar study conducted by Stanford University found that 81% of Covid-19-positive participants wearing a variety of smartwatches — from Apple, Fitbit, Garmin and others — were informed of an irregularity in their HRV up to nine days prior to the onset of major symptoms.",
    "Perhaps the most challenging aspect of managing the global pandemic has been identifying those individuals who contract Covid-19 but remain asymptomatic, meaning they have no symptoms but are still contagious (and thus unwittingly transmit the virus).",
    "Studies such as these have revealed that seemingly-commonplace consumer technology could have a big part to play in the future management of the pandemic by allowing people to easily identify early signs of invisible symptoms.",
    "“Developing a way to identify people who might be sick even before they know they are infected would really be a breakthrough in the management of Covid-19,” Dr. Hirten said. “This technology allows us not only to track and predict health outcomes, but also to intervene in a timely and remote manner, which is essential during a pandemic that requires people to stay apart.”",
    "A company called NeuTigers is even developing a custom wearable dedicated to the early detection of Covid-19.",
    "Recognising that symptoms can be picked up by the humble consumer smartwatch, the company has used research from Princeton University to develop an artificial intelligence product called CovidDeep, which can help inform those in clinical environments and care homes of their transmission risk.",
    "Called the Empatica E4, the patient monitoring wearable takes a variety of regular skin, heart-rate and blood pressure readings with the sole purpose of detecting Covid-19 symptoms early. The patient data is then transferred to the CovidDeep system, which detects the virus at a rate of 90% — that’s more accurate than your typical shop-entrance temperature screening.",
    "In terms of when these research developments will make their way into the hands (or onto the wrists) of the general public remains unknown, but companies are working quickly to bring their findings to market. NeuTigers, for example, has committed to producing an in-house app that could work with Apple, Fitbit, Samsung and many other smartwatch brands.",
    "Could this mark a major step in the global fight against Covid-19? With vaccines beginning to roll out worldwide, the next priority must be the early identification of infection. Your smartwatch might soon become more than an annoying reminder to get your steps in.",
    "Via CBS News"
  ],
  "headers": {
    "8": "Custom Covid-19 wearable"
  },
  "links": {
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-3-review",
    "a recent study": "https://health.mountsinai.org/blog/mount-sinai-reseachers-use-apple-watch-to-predict-covid-19/",
    "CBS": "https://www.cbsnews.com/news/covid-symptoms-smart-watch/",
    "NeuTigers": "https://www.neutigers.com/coviddeep/",
    "CBS News": "https://www.cbsnews.com/news/covid-symptoms-smart-watch/"
  }
}