{
  "source": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
  "title": "Shang-Chi is the best MCU movie since Avengers: Endgame",
  "category": "entertainment",
  "updated": "2021-09-01T15:28:55Z",
  "author": "tom-power",
  "summary": "Shang-Chi is the finest Marvel origins story for a while",
  "article": [
    "There’s a specific scene about an hour into Shang-Chi and the Legend of the Ten Rings that succinctly sums up Marvel’s latest superhero movie offering. It’s a sequence that we won’t spoil here, apart from the fact that it’s a hilarious cameo.",
    "It’s a moment that’s so wonderfully absurd, though, that it’ll make even the hardiest soul laugh out loud. And, ultimately, it underlines what kind of movie Shang-Chi is: an unexpected delight built on the core aspects of previous Marvel movies that also delivers a fresh approach to its origin story formula.",
    "Shang-Chi is the first Marvel film to introduce a new superhero since 2019’s Captain Marvel, but it’s much more than that: it’s also the best MCU movie since Avengers: Endgame.",
    "Set in the present day, the film opens with Shang-Chi (Simu Liu) masquerading as Shaun, a San Francisco-based citizen who works as a valet driver alongside best friend Katy (Awkwafina).",
    "When a group of assassins unexpectedly attacks Shang-Chi and steal his mother’s pendant, he’s forced to return home to confront his murky past, reunite with sister Xialing (Meng'er Zhang) and deal with his estranged father Xu Wenwu (Tony Leung). Shang-Chi also comes into contact with the mysterious Ten Rings organization, who have lurked in the shadows since 2008’s Iron Man and have been led by Wenwu – who wields the titular all-powerful bracelets.",
    "While its opening act isn’t dissimilar to that of 2018’s Black Panther – viewers get some historical context that helps to set up the movie’s plot – Shang-Chi doesn’t initially feel like a Marvel film.",
    "From its wuxia-inspired action sequences, such as those seen in Crouching Tiger, Hidden Dragon, to its humor that’s reminiscent of buddy comedy films like Bill & Ted, Shang-Chi is a film that could realistically exist outside of the MCU. There are callbacks and nods to previous Marvel movies throughout, but Shang-Chi’s non-superhero influences ensure that it feels grounded (at least early on) compared to the MCU’s more recent cosmic occurrences.",
    "Much of that down-to-earth feel is owed to the camaraderie that Liu and Awkwafina bring to Shang-Chi and Katy’s friendship.",
    "The duo, who previously worked on the latter’s self-titled Awkwafina Is Nora from Queens TV series, have a natural rapport that lends a genuine believability to their characters’ longtime bond. It makes their intimate conversations hit harder from an emotional perspective, and it means the pair’s wisecracks aimed at one another feel authentic.",
    "Speaking of humor, Shang-Chi is a lot funnier than you might assume from the trailers. Marvel movies have always come packaged with their fair share of humor, but Shang-Chi is one of the more amusing entries in recent memory.",
    "It makes for a pleasant surprise, given that the trailers make it out to be a serious flick. As the movie barrels towards its final (and typical) CGI-laden climax, the pacing of jokes helps to break the tension at key moments, too.",
    "That isn’t to say that Shang-Chi is a complete joke-fest. It also deals with some difficult and at-times dark topics that will resonate with audiences. Yes, it walks Marvel’s well trodden path of exploring father-son issues, but other themes – family succession and gender discrimination, to name two – provide a thematic balance to proceedings.",
    "Humor and emotion are present, then, but how does the movie fare with action and set pieces? Without meaning to embellish it, Shang-Chi’s close quarters combat is some of the best we can recall seeing in a Marvel movie.",
    "Its intimate fight sequences – grounded in various martial styles including Hong Quan, Muay Thai and Jiu-Jitsu – are a spectacle to behold. The intensity, speed, precision and inventiveness of these encounters are impressive and stylish, making for a welcome change from so many MCU battles that require lots of VFX to bring them to life.",
    "Liu, in particular, brings a level of physicality that few Marvel superheroes can match up close. Shang-Chi is an expert fighter in the comics, so it’s great to see this element adapted (and built upon) so comprehensively on screen.",
    "Shang-Chi’s large-scale set pieces, too, are great fun to watch. The film’s final battle is a bit frenetic and over the top at times but, by and large, it makes for a fitting crescendo that takes in new locations that we hope to potentially explore in future Marvel productions.",
    "Issues with Shang-Chi are few and far between, but there are some.",
    "For one, some of its CGI is a bit hit and miss. There’s a moment in a bus fight sequence, which has been teased in Shang-Chi’s trailers, where green screen use is more noticeable than usual – it's a tad disappointing for a movie with this budget.",
    "One of the film’s final scenes, too, doesn’t make much sense from a wider MCU perspective. Without spoiling anything, humanity should be accustomed to alien invasions, AI uprisings and other potentially world-ending events by now.",
    "And yet there’s a moment in Shang-Chi where, for some reason, the prospect of other worlds and extraterrestrial beings seems like a far-fetched idea to some. If Shang-Chi was an earlier Marvel movie, such as Thor or Doctor Strange where cosmic or magical events weren’t public knowledge, you could understand why some citizens may scoff at such possibilities.",
    "Certain characters’ reactions to events, though, make it feel like this is the first time that anything otherworldly has happened on, or to, Earth. Some viewers may be able to look past this oversight, but we’re 13 years into the MCU at this point. The planet's human population should be more open minded about potentially catastrophic events regularly occurring by now.",
    "With its exciting action sequences, plethora of funny moments and at-times deeply moving story, Shang-Chi and the Legend of the Ten Rings is a spectacle to rival any Marvel movie.",
    "Its complex characters – complete with a tragic villain, something that the MCU needs more of – and the story’s pacing make it a highly enjoyable watch. The numerous references and cameos within, too, will be lapped up by movie and comic book fans alike.",
    "Admittedly, Spider-Man: Far From Home and Black Widow are the only other films to arrive since Endgame, so there haven’t been many Marvel movies to recently rival Shang-Chi as the studio’s best offering.",
    "But to simply say that Shang-Chi is Marvel’s finest movie since Endgame because of a lack of competition is to do it a disservice. It’s not just a superhero movie – it’s a celebration of Asian (and Asian-American) traditions, cultures and societal values in much the same way that Black Panther honored Black communities and shone a light on their experiences.",
    "Shang-Chi, then, brings further diversity to a cinematic universe that, with its global audience, is starting to better reflect the world around us – and that, while wrapped up in a thrilling, humorous and emotive superhero movie, is a fantastic thing.",
    "Shang-Chi and the Legend of the Ten Rings arrives exclusively in theaters on Friday, September 3."
  ],
  "headers": {
    "21": "What we think"
  },
  "links": {
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie"
  }
}