{
  "source": "https://www.techradar.com/news/why-ultra-wide-monitor-support-matters-to-the-developers-of-greak",
  "title": "Why ultra-wide monitor support matters to the developers of Greak",
  "category": "computing",
  "updated": "2021-09-01T09:08:24Z",
  "author": "daryl-baxter",
  "summary": "Family matters",
  "article": [
    "Ultra-wide monitors have risen in popularity in recent years, with games natively supporting resolutions that could easily show a display that’s almost three monitors long.",
    "While there've been some great examples in simulation and racing games, platformers have yet to take advantage of this wide perspective, which is where Greak: Memories of Azur comes in.",
    "Released in August for PC, Nintendo Switch, Sony PlayStation and Xbox consoles, the team at Navegante wanted to make sure that the family-focused platformer was able to run on the widest of wide-screen monitors currently available.",
    "For PC Gaming Week, we spoke to Rodrigo Fernandez, programmer and co-creator of the game over at Navegante, which is an independent video game studio based in Mexico.",
    "As Greak is an indie-title, we wanted to know just how long the team was developing Greak for, and when ultra-wide came in as an idea.",
    "“We started as a company just learning how to make games, and as we’re based in Mexico we just played around with Unity 5 until we were confident enough to create one.” Fernandez tells us. “We always had the character in mind but not the crux of the game. We were fans of Lord of the Rings on the SNES, which also had a similar mechanic to Greak.",
    "We knew the game would have multiple characters but weren't sure how to approach it, so we just kept iterating over the idea and came up with the finished product.”",
    "“With ultra-wide, it was something we had in mind for a while, especially when designing the UI. It was one of the key parts when considering this, alongside how the game works really fits well to the environment of Greak.” Fernandez explained.",
    "“When it comes to ultra-wide the UI can suffer, due to it reducing in size as the resolution gets bigger and wider. Another aspect was the camera, so we had to make sure that it could zoom out without compromising the gameplay and the graphics.”",
    "“With Unity 5 (a game engine development suite) we’re able to simulate just how the game looks in many resolutions, ultra-wide included, so while we did test it on some real-world ultra-wide monitors, we were able to make sure that a player could go from the start of Greak to the end in an ultra-wide resolution.” Fernandez tells us.",
    "There’s also roadblocks when factoring in ultra-wide for a game, so we wanted to see how this factored in as Greak is a platformer, not a racing game.",
    "“As it’s a platformer, a game in this genre can usually glitch out when in ultra-wide, but as Greak has lots of panoramic landscapes, we wanted to take advantage of it. After a lot of testing, the team were really happy about the result, but it’s just the start.” Fernandez adds.",
    "“We kept refining the game to see whether any objects were being left out, but it did work out in the end.”",
    "With the Steam Deck now official and pre-orders falling as far back as the middle of the next year, we wondered whether Navegante is looking to bring Greak to the handheld.",
    "“While we haven't approached Valve about the Steam Deck, we’d love to spend some time with it, as we’re definitely interested in bringing Greak to the platform. It runs on Linux but we don’t see why it would stop us from bringing the game to the handheld.” Fernandez explains.",
    "Players have been enjoying the game in the weeks since its release, but they’ve been vocal in requesting local co-op, especially as you can switch between characters. We asked if this was something the team was considering.",
    "“We’ve been requested by a lot of people that local co-op play is something they’d like to see, especially when coupled with ultra-wide support.” Fernandez continued.",
    "“It makes sense, especially with multiple characters, but it’s difficult as it’s a single player co-op game, especially when you’re alternating between characters in a Metroidvania landscape. So it could be tough to add co-op, but we’re definitely thinking about all the requests, and it fits well.”",
    "The story heavily involves the aspect of family, and being there for one another. In regards to this, we asked why this was a factor in making it an important part of Greak.",
    "“You have to be able to be comfortable about the story you’re trying to tell, but we also wanted a simple message so we could tackle it properly.” Fernandez adds. “Pretty much the concept of families sticking together, and it’s something we’re very strongly about. My sister is the producer on the team for example, so it’s something we understood super well.”",
    "“Especially with this conflict in Greak, we wanted to find just how the first character could get help, and we thought it made sense to make it a family affair.”",
    "With many more games bringing in accessibility features, we wanted to know if this was something the team wanted to implement with Greak, and if they were thinking of bringing in more features in regards to this.",
    "“We tried to make Greak very accessible difficulty-wise. There’s many fringes of skill throughout the game, so we wanted to make sure that the areas didn’t require a heavy amount of it so players could just enjoy the game without feeling frustrated or anxious.” Fernandez tells us.",
    "“We added in plenty of different configurations for controllers, but we also took in a lot of feedback from the demo, so there’s plenty that we’ve implemented, but we’re always listening to others who may want a feature to help them play the game as best as possible.",
    "Especially as Greak factors around family, we wanted to make sure it was accessible for all, so we’re always wanting to hear from players about their thoughts.”"
  ],
  "headers": {
    "4": "A certain point of ultra-wide view",
    "10": "Challenges in ultra-wide",
    "13": "A Steam Deck appearance?",
    "15": "Local co-op?",
    "18": "In the family",
    "21": "A Greak accessibility"
  },
  "links": {
    "Ultra-wide monitors": "https://www.techradar.com/news/ultrawide-monitor",
    "Greak: Memories of Azur": "https://store.steampowered.com/app/1311070/",
    "PC Gaming Week,": "https://www.techradar.com/news/welcome-to-techradars-pc-gaming-week-2021"
  }
}