{
  "source": "https://www.techradar.com/news/the-best-star-wars-animated-series-is-coming-to-disney-plus-in-april",
  "title": "The best Star Wars animated series is coming to Disney Plus in April",
  "category": "entertainment",
  "updated": "2021-06-28T14:53:03Z",
  "author": "samuel-roberts",
  "summary": "Clone Wars returns next month",
  "article": [
    "Disney Plus has announced what's coming to the streaming service in April, and there are a few nice surprises for Star Wars fans in there – most notably the 2D animated Clone Wars series, which was created by Samurai Jack's Genndy Tartakovsky.",
    "Both volumes of the animated shorts, set between Episodes II and III and released in 2003-2005, will arrive on the service on April 2. Lucasfilm hasn't talked about it all that much in recent years, so it's great to see the series get a comeback.",
    "It'll be joined on the same day by more obscure offerings from the back catalogue: nice-to-have but best-forgotten TV movies Caravan of Courage and Ewoks: The Battle for Endor are also coming to Disney Plus, along with both seasons of animated kids' show Ewoks.",
    "Perhaps the biggest shocker, though, is that the short animated movie The Story of the Faithful Wookiee is coming to the streamer on April 2. Airing as part of the notoriously awful Holiday Special in 1978, it's best-known for marking the debut of Boba Fett – no doubt Lucasfilm wants to have it on the service in advance of The Book of Boba Fett releasing later this year.",
    "Still, it sounds like the rest of the Holiday Special will remain lost to time – or indeed, a bootleg VHS tape near you.",
    "While this announcement was specifically related to Disney Plus US content, we've reached out to Disney Plus UK to check the shows are rolling out universally for subscribers.",
    "The Falcon and the Winter Soldier, which begins on March 19, remains the biggest attraction on Disney Plus in the US next month – as a big blockbuster series that's been anticipated for well over a year, you can see why the service doesn't need anything else on that scale to get people excited.",
    "Still, you'll also get new episodes of The Mighty Ducks: Game Changers, and a new John Stamos show about a basketball coach working at an all-girls school called Big Shot, which kicks off on Friday, April 16. There's also a nice documentary about whales coming from National Geographic.",
    "Clone Wars, then, is one of the clear highlights."
  ],
  "headers": {
    "6": "Otherwise a quiet month for Disney Plus"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know"
  }
}