{
  "source": "https://www.techradar.com/news/this-oculus-quest-2-update-is-about-to-make-vr-fitness-easier-than-ever",
  "title": "This Oculus Quest 2 update is about to make VR fitness easier than ever",
  "category": "vr",
  "updated": "2021-08-23T10:44:55Z",
  "author": "rhys-wood",
  "summary": "Oculus Quest’s next update will get you on your feet",
  "article": [
    "Oculus Quest 2 owners are about to receive a nice upgrade to Oculus Move, the VR headset’s fitness tracking software, including being able to track goals while playing games as well as share your progress on Facebook.",
    "Not only that, but v32 will bring improved media sharing options to Oculus Quest devices. The update will allow users to sync screenshots and recordings taken with the headset to a separate device like your phone or tablet.",
    "As reported by Upload VR, Facebook CEO Mark Zuckerberg confirmed the details of v32 in a post, stating: \"New Quest V32 update coming soon with Oculus Move improvements to help you track fitness goals in VR and share your stats on Facebook, Messenger, or in Groups [...] Also new tools to easily sync screenshots and screen recordings to your phone.\"",
    "While we’re not exactly thrilled by the vagueness of Zuckerberg’s “coming soon” comment, we at least know that v32 is somewhere on the horizon. However, new Oculus Quest builds typically release towards the end of every month, so if that schedule is being upheld, expect v32 to drop anytime between now and the end of August.",
    "It should be a very welcome update for those of you who like to take a lot of screenshots, too. Currently, the easiest way to pull screenshots from the Oculus Quest headset to other devices is through third-party software like SideQuest, so it’s nice to finally see the feature be supported in some official capacity.",
    "There’s never really been a better time to own an Oculus Quest 2. Not only does its relatively low price tag (at least compared to Valve Index and HTC Vive) make it one of the more accessible VR headsets on the market, the constant support through firmware updates have only served to make the Quest 2 even better on a monthly basis.",
    "The current version, v31, for example, made it much easier to connect and play multiplayer games with friends by adding dedicated ‘Invite’ menus to the Oculus dashboard. Before that, a new multitasking interface was introduced in v30, allowing users to run multiple 2D apps at the same time, positioning Quest 2 as more than just a gaming device.",
    "As for the upcoming v32, we certainly won’t say no to improved fitness tracking. VR can be a physically intense experience, especially with highly kinetic games like Beat Saber and Superhot VR. Much like Nintendo’s prior successes with Ring Fit Adventure and Wii Fit before that, gamifying exercise through fun experiences and stat tracking could sway more people into trying out the Quest 2 for themselves."
  ],
  "headers": {
    "5": "Analysis: Oculus Quest 2 updates keep the headset going strong"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Move": "https://www.techradar.com/news/oculus-move-vr-could-sync-with-apple-health-heres-why-that-matters",
    "Upload VR": "https://uploadvr.com/oculus-quest-v32-improvements/",
    "end of every month": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-3471903495799132000&murl=https%3A%2F%2Fsupport.oculus.com%2Frelease-notes%2F",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "play multiplayer games with friends": "https://www.techradar.com/news/this-oculus-vr-update-makes-virtual-reality-a-whole-lot-less-lonely",
    "a new multitasking interface": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-5509127363307069000&murl=https%3A%2F%2Fwww.oculus.com%2Fblog%2Fmultitasking-accessibility-improvements-and-air-link-for-quest-1-in-the-latest-oculus-software-update",
    "Ring Fit Adventure": "https://www.techradar.com/news/im-a-socially-anxious-person-so-i-bought-this-ring-fit-adventure-bundle-to-keep-fit-at-home"
  }
}