{
  "source": "https://www.techradar.com/news/razers-best-gaming-chair-just-dropped-to-its-lowest-price-ever-over-at-amazon",
  "title": "Razer's best gaming chair just dropped to its lowest price ever over at Amazon",
  "category": "news",
  "updated": "2021-11-24T18:14:52Z",
  "author": "john-loeffler",
  "summary": "Get the Razer Iskur Fabric for just $349 right now",
  "article": [
    "The Razer Iskur gaming chair was one of the best gaming chairs we ever tested, and while we're still reviewing the newer Razer Iskur Fabric, we can tell already that it's even better than the original - which is why we're so excited to see the Razer Iskur Fabric for just $349 at Amazon.",
    "Sure, Black Friday deals are rolling out all over the place, but we didn't expect to see anything on the Iskur Fabric since it hasn't been on the market for very long and is a very popular gaming chair. Getting it for 30% off makes this one of the best Black Friday PC gaming deals we've seen so far.",
    "(Not in the US? Scroll down for deals in your region).",
    "The Razer Iskur Fabric is the next generation of Razer's flagship gaming chair. With an ergonomic lumbar support system, breathable, ultrasoft and spill-resistant fabric, high-density foam cushions, and armrests with four degrees of adjustment, there is very little to complain about with this chair except for its steep $499 retail price.",
    "So getting this gaming chair for $149 off makes this a very easy purchase to recommend for Black Friday. At this price, we don't expect it to sell for much lower, so don't worry about missing a better price; this is about as good a Black Friday gaming chair deal as you're going to find all year.",
    "No matter where you live, you'll find all the lowest prices for the Razer Iskur Fabric from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Razer Iskur Fabric Black Friday deals",
    "5": "More Razer Iskur Fabric deals",
    "6": "More Black Friday deals"
  },
  "links": {
    "Razer Iskur gaming chair": "https://www.techradar.com/reviews/razer-iskur-gaming-chair-review",
    "best gaming chairs": "https://www.techradar.com/news/best-pc-gaming-chair-5-best-chairs-to-game-in-comfort",
    "Razer Iskur Fabric for just $349 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FRazer-Iskur-Fabric-Gaming-Chair%2Fdp%2FB09CLMYLWN%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7215313509372895000-20",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday gaming chair deal": "https://www.techradar.com/news/black-friday-gaming-chair-deals-2021-what-to-expect"
  }
}