{
  "source": "https://www.techradar.com/news/bitcoin-rigs-steamroller-video-malaysia",
  "title": "Watch 1,000 illegal bitcoin rigs get smashed into bits – with a steamroller – by Malaysian police",
  "category": "computing",
  "updated": "2021-07-22T21:33:05Z",
  "author": "john-loeffler",
  "summary": "Gamers aren't the only ones who've had it with crypto mining",
  "article": [
    "Malaysian authorities have taken to an extreme measure to prove the point that it is illegal to steal electricity in order to run cryptomining rigs: crush them with a steamroller.",
    "The video making the rounds shows what looks like Antminers laid out and filling a parking lot at a police headquarters before the ruthless hands of justice drove an actual, honest-to-God steam roller over the entire lot of them.",
    "The 47-second video doesn't show each and every device getting crushed, but according to PC Gamer, none of the 1,069 illicit mining rig was spared, which is definitely not nice.",
    "The offending computers were seized in six raids conducted jointly by Malaysian police and Sarawak Energy Berhad (SEB) around an airport in the Sarawak region, where miners had allegedly tapped into SEB power lines to divert as much as $2 million in electricity to power the rigs.",
    "In addition to the outrageous prices being charged online for graphics cards like the RTX 3080 and RTX 3090 – even among legitimate retailers – there is a much greater cost to the cryptomining craze of the past few years.",
    "Despite what cryptocurrency advocates claim, actual scientists who study the effects of cryptomining on the environment are pretty much in agreement that it's an ecological disaster.",
    "Cryptomining, globally, requires 110,000,000,000 kilowatt-hours of electricity each year, while all of the solar panels in the United States produced only 90,000,000,000 kilowatt-hours in 2020.",
    "You can say that this energy diversion is well spent if you believe cryptocurrencies have utility beyond holding critical national infrastructure hostage for ransom, buying drugs online, or money laundering, but it is energy diversion.",
    "It might not be as explicit as in this case in Malaysia where miners literally tapped into a power line and diverted electricity from legitimate use, but a single watt of electricity used to process blockchain transactions and generate bitcoin anywhere is one less watt available for everything else.",
    "We don't stop powering our homes for some discrete amount of time in order to mine bitcoin. We power our world and we mine bitcoin. This isn't going to change, so no matter how much crypto advocates try to green up crypto, it is still an increasingly heavy anchor on our efforts to combat climate change.",
    "All one needs to do is look out the window of a New York City office this week and see the hazy smoke from west coast wildfires to know that this is untenable if we want a reasonably livable planet in the years to come. Against that reality, crushing 1,069 mining rigs beneath a steamroller is woefully insufficient, but it's a start."
  ],
  "headers": {
    "4": "Analysis: the staggering cost of cryptomining isn't just an expensive graphics card"
  },
  "links": {
    "PC Gamer": "https://www.pcgamer.com/watch-1000-illegal-bitcoin-pcs-get-literally-steamrolled-experience-justice/",
    "outrageous prices": "https://www.techradar.com/news/graphics-card-prices-are-finally-crashing-but-hold-fire-on-buying-one",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "produced only 90,000,000,000 kilowatt-hours": "https://www.statista.com/statistics/183447/us-energy-generation-from-solar-sources-from-2000/"
  }
}