{
  "source": "https://www.techradar.com/news/virtual-keyboard-apps-pulled-from-stores-following-data-privacy-fear",
  "title": "Virtual keyboard apps pulled from stores over data privacy fears",
  "category": "computing",
  "updated": "2021-06-11T11:10:12Z",
  "author": "mayank-sharma",
  "summary": "List included apps from several reputable developers",
  "article": [
    "Chinese app stores have once again removed several mobile apps citing violation of its new user data collection policy.",
    "Most of the apps were apparently developed by supposedly reputable companies including the likes Sogou and iFlytek. The affected tools have been zapped from both Apple’s App Store and the Android stores operated by various smartphone makers such as Huawei.",
    "Some of the removed apps were input-method apps that served as virtual keyboards. In a statement, iFlytek admitted that its app was removed due to violations of personal data collection rules.",
    "In April, China issued draft guidelines seeking to limit the scope of mobile apps' collection of personal data. The crackdown follows the implementation of steps that were introduced by the country’s top regulators to dissuade mobile app developers from collecting excessive details about their users.",
    "This isn’t the first time China has removed apps following the implementation of its new user data collection policy.",
    "In May 2021, China’s Ministry of Industry and Information Technology (MIIT) ordered the takedown of some 90 apps that it found to be in violation of the new policy.",
    "Interestingly, even the fact that iFlytek is a partially state-owned company didn’t stop the regulators from deplatforming its apps.",
    "However, this isn’t surprising since the regulator showed the same ruthlessness last month when it delisted official apps of some of the most well-known and widely-used reputable platforms in the country, for flouting the norms.",
    "In its statement, iFlytek said it has already modified its apps to adhere to the new policy and is currently waiting for approval from the regulators for relisting.",
    "Via Reuters"
  ],
  "headers": {
    "4": "Strict compliance"
  },
  "links": {
    "mobile apps": "https://www.techradar.com/best/best-android-apps-2021",
    "user data collection policy": "https://www.techradar.com/news/china-is-apparently-easing-up-on-collecting-mobile-app-data",
    "App Store": "https://www.techradar.com/best/best-iphone-apps-2021",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Huawei": "https://www.techradar.com/news/best-huawei-phones",
    "mobile app developers": "https://www.techradar.com/best/best-mobile-app-development-software",
    "takedown of some 90 apps": "https://www.techradar.com/news/chinese-government-orders-90-apps-removed-in-data-collection-crackdown",
    "Reuters": "https://www.reuters.com/technology/virtual-keyboard-apps-removed-chinese-app-stores-2021-06-11/"
  }
}