{
  "source": "https://www.techradar.com/news/huaweis-ipad-pro-rival-will-launch-on-june-2-but-theres-a-better-reason-to-tune-in",
  "title": "Huawei's iPad Pro rival will launch on June 2, but there's a better reason to tune in",
  "category": "tablets",
  "updated": "2021-05-28T08:49:33Z",
  "author": "tom-bedford",
  "summary": "HarmonyOS is appearing",
  "article": [
    "It's tablet season, because not long after the iPad Pro (2021) launch and just the week after the Samsung Galaxy Tab S7 FE unveiling, Huawei is set to show off its new MatePad Pro 2, a top-end tablet that'll succeed the original MatePad Pro.",
    "Huawei has posted the above teaser on Chinese social media platform Weibo, showing the M-Pencil (a tablet stylus, like the Apple Pencil or S Pen). It's not exactly vague, strongly implying the anticipated MatePad Pro 2 will show up on June 2.",
    "This June 2 event is already known to us, as the Huawei Watch 3 will likely show up too - the company has teased as much. The actual point of the event, though, is to show off HarmonyOS.",
    "While the MatePad Pro 2 might be interesting, as could the Watch 3, they're not exactly huge headline-grabbing products. HarmonyOS, on the other hand, is really worth paying attention to.",
    "HarmonyOS is Huawei's alternative to Android, and it's an operating system the company currently uses for its TVs. The June 2 launch event is set to extend HarmonyOS to smartwatches, tablets and smartphones.",
    "Both the Huawei MatePad Pro 2 and Watch 3 are expected to launch with HarmonyOS, and be the first products of their type to use the operating system.",
    "Huawei has already stated that other phone brands are open to use HarmonyOS over Android if they choose, and rumors suggest companies including Xiaomi and Oppo are considering it.",
    "So HarmonyOS could soon become the third big mobile operating system, alongside Android and iOS - if so, the June 2 launch would really be worth tuning in to.",
    "When the date of the event draws near, and on the day itself, we'll be covering everything you need to know, including what's launching and how you can watch along, so stay tuned for that."
  ],
  "headers": {
    "4": "Huawei's HarmonyOS"
  },
  "links": {
    "iPad Pro (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Samsung Galaxy Tab S7 FE": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-fe",
    "MatePad Pro": "https://www.techradar.com/reviews/huawei-matepad-pro",
    "Weibo": "https://m.weibo.cn/detail/4641737844719701",
    "Apple Pencil": "https://www.techradar.com/how-to/apple-pencil-on-ipad-our-full-guide-on-how-to-use-it",
    "Huawei Watch 3": "https://www.techradar.com/reviews/huawei-watch-3",
    "the company has teased as much": "https://www.techradar.com/news/huawei-watch-3-is-coming-very-soon-and-it-could-give-us-some-huawei-p50-clues",
    "open to use HarmonyOS over Android if they choose": "https://www.techradar.com/news/android-exodus-more-phone-makers-may-turn-to-huaweis-harmonyos"
  }
}