{
  "source": "https://www.techradar.com/news/microsoft-is-making-it-harder-for-some-users-to-get-windows-10-support",
  "title": "Microsoft is making it harder for some users to get Windows 10 update support",
  "category": "computing",
  "updated": "2021-02-19T11:30:40Z",
  "author": "mayank-sharma",
  "summary": "The change will come in with the upcoming release of Windows 10 21H2",
  "article": [
    "Some Windows 10 Enterprise users may need to check their service agreements after Microsoft revealed it will be halving the support period for Long Term Servicing Channel (LTSC) releases soon.",
    "Starting with Windows 10 21H2, scheduled for release later this year, the Enterprise LTSC releases will only be supported for five years instead of the earlier commitment of ten years.",
    "Microsoft argues that the move is the result of extensive conversations with clients of the Enterprise LTSC release, which is designed for mission-critical systems that operate in an air-gapped environment and can’t be updated.",
    "In a blog post, senior product manager for Microsoft 365, Joe Lurie describes the intended target for the LTSC release as “regulated devices that cannot accept feature updates for years at a time, process control devices on the manufacturing floor that never touch the internet, and specialty systems that must stay locked in time and require a long-term support channel.”",
    "Microsoft has reduced the support cycle after many LTSC customers reported they don’t require a shorter support cycle. This argument resonated with the company as it found it challenging to deliver an enhanced user-experience on a decade-old installation.",
    "However the move is surely going to irk some users who were banking on the ten-year support guarantee of the LTSC release.",
    "Lurie however argues that such users who need the extended period of support usually run Windows on edge and Internet of Things (IoT) devices. These use cases are better served with the Windows 10 IoT Enterprise LTSC, which will continue to be supported for a decade.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Reacting to customer demand"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Windows 10 21H2": "https://www.techradar.com/news/windows-10s-new-look-leaks-again",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2827652274444024300&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fwindows-it-pro-blog%2Fthe-next-windows-10-long-term-servicing-channel-ltsc-release%2Fba-p%2F2147232&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-making-it-harder-for-some-users-to-get-windows-10-support",
    "Microsoft 365": "https://www.techradar.com/news/buy-microsoft-office-prices",
    "Internet of Things (IoT)": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "ZDNet": "https://www.zdnet.com/article/microsoft-is-cutting-windows-10-enterprise-ltsc-support-from-ten-years-to-five/"
  }
}