{
  "source": "https://www.techradar.com/news/the-sandman-teaser-reveals-first-look-at-tom-sturridges-dream",
  "title": "The Sandman teaser reveals first look at Tom Sturridge's Dream",
  "category": "entertainment",
  "updated": "2021-09-25T17:26:16Z",
  "author": "tom-power",
  "summary": "There's still no release date for The Sandman, though",
  "article": [
    "The first clip from Netflix's adaptation of The Sandman has finally arrived – and it looks like it'll be a wholly authentic take on Neil Gaiman's beloved comic series.",
    "Until now, we've only received a behind-the-scenes look at a couple of the TV show's sets. However, a first-look teaser was revealed during Tudum, Netflix's first-ever global fan event, on September 25, and it seems like fans will be happy with what was shown.",
    "Take a look at The Sandman's first official clip below:",
    "Based on Neil Gaiman's beloved comic book series of the same name, The Sandman tells the story of Dream, also known as the king of stories who is also known as Morpheus. In 1916, Dream gets captured during an occult ritual, which traps him for over a century. Eventually breaking out of his prison in 2021, Dream sets out to restore order to his kingdom of the Dreaming.",
    "Netflix's adaptation of The Sandman stars Tom Sturridge (Sweetbitter, Velvet Buzzsaw) as the titular character, as well as a host of big name actors. Game of Thrones' Gwendoline Christie and Charles Dance appear as Lucifer and Roderick Burgess respectively. Boyd Holbrook (Logan), Kirby Howell-Baptiste (Killing Eve, Infinity Train), Stephen Fry (Blackadder, Q.I) and Jenna Coleman (Doctor Who) are among the show's other stars.",
    "Alongside the show's first clip, Netflix released the first batch of character posters for its adaptation, which include looks at Sturridge's Dream, Howell-Baptiste's Death and Mason Alexander Park's Desire:",
    "Speaking ahead of the clip and posters' unveilings, Gaiman said: \"The team at Netflix, Alan, David and I have been able to make something that was true to the comics, while still being fantastic television.",
    "\"And honestly, I think this is how it was always supposed to happen: with these actors, with this production, with this weird and wonderful team of people who have had their minds lost in the Dreaming since I put it on the page.\"",
    "Sturridge added: “When I found out I’d been asked to play Dream, I was terrified of a moment like this because I know how important he is to you, simply because of how important he is to me.”",
    "There's still no release date for The Sandman. However, filming wrapped on the series in August so, hopefully, it won't be too long before we get an official trailer and a confirmed launch date. 2022 seems a dead cert at this point."
  ],
  "headers": {},
  "links": {}
}