{
  "source": "https://www.techradar.com/news/star-trek-discovery-leaves-netflix-for-paramount-plus-and-fans-arent-happy",
  "title": "Star Trek: Discovery leaves Netflix for Paramount Plus – and fans aren’t happy",
  "category": "entertainment",
  "updated": "2021-11-22T12:00:35Z",
  "author": "axel-metz",
  "summary": "‘Highly illogical’",
  "article": [
    "Bad news, Trekkies: Netflix has officially lost the rights to Star Trek: Discovery, with the show now exclusive to Paramount Plus in every region.",
    "The popular sci-fi series has always been exclusive to ViacomCBS’ new streamer in the US, but international viewers had been able to enjoy seasons 1 to 3 on Netflix – under the Netflix original banner – given the absence of Paramount Plus overseas.",
    "It was hoped that season 4 would continue that arrangement, but a new deal means Star Trek: Discovery will henceforth be a Paramount Plus exclusive across the globe. The problem, though, is that the service won’t be rolling out to Europe and other markets until 2022 – leaving many Star Trek fans reeling with the wrath of Khan.",
    "To make matters worse, the announcement was made just days before new episodes of the show were due to land on Netflix, with non-US Star Trek fans now forced to wait a still-unknown amount of time before they, too, can access Star Trek: Discovery season 4.",
    "“A confounding and hugely misjudged decision,” one fan wrote on Twitter. “A huge amount of non-US fans will now pirate the season. Revealing this THREE DAYS before the series premieres, after months of fans expecting it this week, is hugely disrespectful.”",
    "“Paywalling it behind a service non-US fans can’t use? Ugly, nasty, greedy. So un-Star Trek,” said another.",
    "Not only does the move mean Star Trek fans outside of the US won’t get to see Star Trek: Discovery season 4 as early as their counterparts across the pond, it also speaks to a growing frustration surrounding the confusing nature of streaming services in 2021.",
    "With rival platforms locked in a constant battle for audience share, popular IP is now scattered between a headache-inducing number of services – each with their own subscription cost.",
    "Fancy watching some Marvel, Star Wars or Disney content? You’ll want a Disney Plus subscription. Popular sitcoms like Friends or Seinfeld? Netflix is your best bet. The latest Warner Bros. blockbusters? HBO Max is the answer. Star Trek fans? Well, we don’t need to repeat ourselves. Even James Bond is soon to become a Prime Video exclusive, and we haven’t even mentioned the likes of Apple TV Plus, Shudder or Hulu yet.",
    "The point being, if audiences hope to enjoy a truly extensive range of movies and TV shows nowadays, it’s no longer adequate to subscribe to a single streaming service. And since the average cost of a monthly subscription for any given platform sits at around $10 / £10, streaming bills can quickly reach into triple figures – on top of existing cable subscriptions.",
    "Nobody expects on-demand entertainment to come cheap, but when sci-fi fans are forced to navigate five different services in order to access some of the most beloved franchises in pop culture history, there’s clearly a problem."
  ],
  "headers": {
    "7": "The streaming multiverse of madness"
  },
  "links": {
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Star Trek: Discovery": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Paramount Plus": "https://www.techradar.com/deals/paramount-plus-cost-price-plans-deals",
    "announcement": "https://twitter.com/StarTrek/status/1460714353682833411",
    "Twitter": "https://twitter.com/ajblackwriter/status/1460721090251173898",
    "said another": "https://twitter.com/PositiveLad/status/1460892299429388288?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1460892299429388288%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.bbc.co.uk%2Fnews%2Fentertainment-arts-59316606",
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Marvel": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Disney Plus": "https://www.techradar.com/best/best-disney-plus-shows",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "James Bond is soon to become": "https://www.techradar.com/news/amazon-is-buying-james-bond-studio-mgm",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Shudder": "https://www.techradar.com/best/best-shudder-movies",
    "Hulu": "https://www.techradar.com/reviews/hulu"
  }
}