{
  "source": "https://www.techradar.com/news/msi-has-announced-a-mini-itx-compatible-rtx-3000-series-gpu",
  "title": "MSI has announced a Mini-ITX compatible RTX 3000 series GPU",
  "category": "computing",
  "updated": "2021-01-29T11:50:31Z",
  "author": "jess-weatherbed",
  "summary": "A smol GPU for smol PCs",
  "article": [
    "The Nvidia GeForce RTX 30 series of graphics cards contains currently some of the most powerful GPUs on the market, sharing their crown with the AMD 'Big Navi' line. In order to house that power, the size of the video card needs to accommodate for ventilation and cooling, which has so far resulted in some pretty chunky hardware. This isn't ideal for fans of super-compact PC builds, but MSI has fortunately announced the GeForce RTX 3060Ti Aero ITX, a Mini-ITX compatible graphics card for small-form gaming rigs. This is the first Ampere-powered GPU to be announced for miniature computer builds, and is clocked at 1665 MHz and is fitted with 8 GB of GDDR6 RAM.",
    "For anyone unfamiliar with motherboard sizing, there are four options that you will typically find listed online: ATX, E-ATX, MicroATX and Mini-ITX. ATX stands for 'Advanced Technology eXtended' and will be the most common, having been introduced back in 1995 by Intel. This has since become the industry standard, and is also known as a 'full-sized board'. The E-ATX is less common and generally not recommended due to case compatibility, but is a larger motherboard that can accommodate dual CPUs and up to four GPUs. MicroATX (or mATX) was introduced in 1997, removing some non-essential features and reducing available slots to create a smaller sized board for compact builds. For some, that wasn't small enough though. The Mini-ITX (Mini Information Technology eXtended) is the smallest motherboard available and came onto the scene in 2001, initially designed for home theater builds or fanless applications.",
    "The challenge of building tiny gaming computers using Mini-ITX motherboards is appealing to some PC gamers and hobbyists as many of these smaller rigs can still perform as well as larger, standard-sized builds. Small, yet powerful gaming PCs are an excellent choice for anyone who lacks enough room for a standard sized computer, or even people who frequently travel to LAN or gaming events. The new MSI GeForce RTX 3060 Ti Aero ITX measures in at just 172 x 125 x 43 mm, making it 40 percent smaller and 50 percent lighter than a full-size graphics card. We haven't located any benchmarks, but the GPU can allegedly deliver the same performance that you would expect in a full-sized RTX 3060 Ti. The Aero ITX will include a single HDMI port that can support 4K 120Hz display rates, along with three DisplayPort 1.4a connectors. There has been no confirmed pricing announced with this new MSI GPU, but with the Nvidia Ampere range being so scarce and demand so high, we're hoping there will be enough inventory to go around at a fair price.",
    "Via NoteBook Check"
  ],
  "headers": {
    "1": "A powerful little package"
  },
  "links": {
    "Nvidia GeForce RTX 30": "https://www.techradar.com/news/nvidia-ampere",
    "AMD 'Big Navi'": "https://www.techradar.com/news/amd-big-navi",
    "GeForce RTX 3060Ti Aero ITX": "https://www.msi.com/Graphics-Card/GeForce-RTX-3060-Ti-AERO-ITX",
    "home theater": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "NoteBook Check": "https://www.notebookcheck.net/MSI-one-of-the-first-to-launch-a-long-awaited-Mini-ITX-compatible-RTX-30-series-card.517443.0.html"
  }
}