{
  "source": "https://www.techradar.com/news/lg-has-reportedly-made-its-last-smartphone",
  "title": "LG has reportedly made its last smartphone",
  "category": "phones",
  "updated": "2021-06-01T08:54:29Z",
  "author": "james-rogerson",
  "summary": "But software support lives on",
  "article": [
    "LG has reportedly stopped making smartphones. We knew this day was coming, after the company announced a couple of months ago that it was quitting the smartphone industry, but apparently it manufactured its final phone on Monday, May 31.",
    "That’s according to Asia Business Daily (a South Korean financial newspaper), with LG apparently waiting until now to shut down its smartphone manufacturing because it had to fulfill contracts with telecoms companies.",
    "None of this has been officially confirmed by LG at the time of writing, but we knew that it was only a matter of time until the company stopped making phones, so this news is likely accurate.",
    "The newspaper adds that a Vietnamese factory where many of LG’s phones were built will apparently be converted into a manufacturing plant for household appliances, so at least the workers there hopefully won’t be out of a job.",
    "Still, it’s sad news, with exciting phones like the LG Velvet 2 Pro and the LG Rollable – the latter once set to be the first ever rollable smartphone - not getting a release despite seemingly being more or less finished. Indeed, LG reportedly sold off stock of these two phones to its employees.",
    "LG has long been one of the most innovative players in the smartphone space too, so its quitting of the industry is a significant loss.",
    "Those who own an LG handset won’t be abandoned though, as the company has promised that its G series, V series, Velvet and Wing smartphones released in 2019 or later will get three years of operating system updates – which is actually more than the industry standard, so that’s quite generous under the circumstances.",
    "Via Engadget"
  ],
  "headers": {
    "4": "The end of an era"
  },
  "links": {
    "quitting the smartphone industry": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "sold off stock of these two phones": "https://www.techradar.com/news/lg-velvet-2-pro-and-lg-rollable-up-for-sale-but-you-cant-buy-one",
    "the company has promised": "https://www.techradar.com/news/lgs-android-phones-will-get-three-years-of-updates",
    "Engadget": "https://www.engadget.com/lg-smartphone-production-ended-183050001.html"
  }
}