{
  "source": "https://www.techradar.com/news/windows-11-could-be-here-sooner-than-you-think",
  "title": "Windows 11 could be here sooner than you think",
  "category": "computing",
  "updated": "2021-08-05T10:42:06Z",
  "author": "darren-allan",
  "summary": "If rumors are right, Microsoft’s OS might just arrive in October",
  "article": [
    "Windows 11 could come out in late October, or possibly November, at least if the latest rumor is on or near the mark.",
    "That’s the theoretical launch timeframe Microsoft is currently looking at going by clues which were recently uncovered by Windows Latest. The latest hint comes in the form of a Microsoft post on the subject of Windows 11 driver submissions, giving hardware makers a deadline to get drivers in for inclusion in the initial release of the OS.",
    "Microsoft notes: “Partners looking to achieve compatibility for systems shipping with Windows 11, version 21H2 Release may factory-install drivers for components that achieved compatibility with Windows 10, version 2004 until September 24, 2021.”",
    "Microsoft wants drivers to be provided well ahead of the release of Windows 11, naturally, to ensure that they’re ready and to leave a suitable amount of time for testing.",
    "As Windows Latest observes, typically we might expect this schedule to point to a Windows 11 release around four weeks or so later, or in other words, the end of October.",
    "Furthermore, the other potentially telling aspect here is that this timeframe ties in with hints spotted elsewhere, namely a leaked Intel document (graphics driver release notes, to be precise) which labels the initial version of Windows 11 the ‘October 2021 Update’. Walmart also previously posted an October date for the Windows 11 launch in a product listing.",
    "We’ve now seen a number of hints that late October is the intended release date for Windows 11, or at least this is Microsoft’s apparent plan. Obviously enough, even if this is the current intention, the operating system could slide and end up arriving in November (or maybe even later).",
    "This is exactly why Microsoft has kept its only official comment on the release date as Windows 11 arriving for the ‘holiday season’, which is just a broad indication of availability coming late in 2021.",
    "Typically, we expect that to mean December, or possibly late November, and perhaps that’s the safe expectation Microsoft wants us to hold onto, rather than thinking we might get Windows 11 much earlier – the late stages of October – and then it doesn’t arrive. Clearly, it’s better to leave users pleasantly surprised by an ‘early’ arrival, than disappointed by the OS not turning up when expected; that’s simple common sense.",
    "As always in these scenarios, everything depends on how the final phase of testing goes. If a major show-stopper of a bug turns up at the last minute – and this has certainly happened before with Windows 10 updates, which are less complex than the current undertaking – then we can expect a delay as that problem is ironed out.",
    "Still, the number of hints about a later in October launch gives us at least some measure of confidence that we might see Windows 11 arrive then, or in November. Also, there is one final piece of the puzzle that fits here: the rumor that next-gen Alder Lake CPUs from Intel will launch at the end of October, and that Windows 11 has been tweaked to make improvements for these processors and their hybrid design, with both products potentially being released together as a result."
  ],
  "headers": {
    "6": "Analysis: Hints aplenty, including Alder Lake link-up"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows Latest": "https://www.windowslatest.com/2021/08/03/windows-11-release-date-hinted-by-microsoft-in-a-new-document/",
    "post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7007494348807422000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fwindows-hardware-certification%2Fnow-accepting-windows-11-version-21h2-submissions%2Fba-p%2F2483049&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-11-could-be-here-sooner-than-you-think",
    "Microsoft has kept its only official comment": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Alder Lake CPUs": "https://www.techradar.com/news/intel-12th-gen-alder-lake-cpu-release-time-table",
    "will launch at the end of October": "https://www.techradar.com/news/intel-hints-at-october-27-launch-for-alder-lake-cpus-so-amd-might-want-to-get-its-skates-on",
    "both products potentially being released together": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows"
  }
}