{
  "source": "https://www.techradar.com/news/huawei-just-revealed-its-first-ever-desktop-monitor",
  "title": "Huawei just revealed its first ever desktop monitor",
  "category": "computing",
  "updated": "2021-04-01T15:47:57Z",
  "author": "mike-moore",
  "summary": "Another string to the Huawei bow",
  "article": [
    "Huawei has launched into the desktop monitor game with the unveiling of a new 23.8in offering.",
    "The Huawei Display 23.8\" offers yet another aspect to the Chinese giant's tech offerings, and comes as the company looks to diversify its product suite as its smartphone division faces challenges across the world.",
    "The Huawei Display 23.8” has a screen-to-body ratio of 90% and is compatible with PCs, laptops and mobile devices. The company says it has taken its experience in creating the \"bezel-less\" laptop displays seen in its Matebook devices and transported this to the new monitors.",
    "This means that the Huawei Display has just three bezels measuring 5.7mm, giving the illusion of true edge-to-edge screen cover that should make it fit in nicely in any home office. It comes with a single VGA, HDMI and DC input each, with a 1.5m HDMI cable bundled in the box.",
    "The IPS panel supports a Full HD resolution (1920x1080), 60Hz refresh rate, 72% of the NTSC colour gamut, a contrast ratio of 1000:1 and a wide viewing angle of 178 degrees. There's also a special eye protection feature that protects against low blue light and flickering, meaning it's also ideal for watching movies as well as home use thanks to its typical 250 nit brightness.",
    "Huawei says that setup is quick and easy thanks to a compact base, and the display can also be mounted on compatible platforms - with 5° depression / 22° elevation tilt support to make sure you get the most comfortable view possible.",
    "At 538.5mm wide, 425mm high and 170mm deep, the monitor should be able to squeeze into most home offices, and at around 4.05kg, it's not too heavy to shift around if you need to.",
    "The Huawei Display 23.8” will be available from the Huawei Store from April 14, costing £149.99 in the UK - and will also go on sale in France, Germany, Malaysia, Thailand and The Philippines.",
    "The monitor is also bundled with the MateStation S, Huawei's new desktop PC that was revealed recently, and which should be coming to markets around the world soon."
  ],
  "headers": {
    "3": "Huawei Display"
  },
  "links": {
    "monitor": "https://www.techradar.com/news/best-business-monitor",
    "MateStation S": "https://www.techradar.com/news/huaweis-matestation-s-is-the-perfect-pc-for-working-from-home"
  }
}