{
  "source": "https://www.techradar.com/news/nvidia-gtx-1060-might-be-brought-out-of-retirement-to-mine-crypto",
  "title": "Nvidia GTX 1060 might be brought out of retirement to mine crypto",
  "category": "computing",
  "updated": "2021-03-01T17:24:34Z",
  "author": "carly-page",
  "summary": "EEC filings suggest the four-year-old GPU could make a comeback",
  "article": [
    "The Nvidia GTX 1060 could be making a comeback as yet another GPU designed with cryptocurrency mining in mind.",
    "That’s according to PC Gamer, which reports that GPU maker Palit has registered 12 P106 cards with the Eurasian Economics Commission (EEC). The original Nvidia P106, which was first introduced four years ago, was designed solely for mining Ethereum using the same Pascal-based GPU that powered the Nvidia GTX 1060 - the GP106 GPU.",
    "PC Gamer notes that Palit’s original P106 cards had slightly different product codes, with these newly registered versions sporting a similar designation to the GTX 16-series cards. However, it’s unlikely the cards will be updated to a new GPU architecture, the report notes, otherwise we’d be seeing a “P116” listing rather than “P106”.",
    "Rather, it’s more likely that Palit is simply looking to capitalise on the cryptomining boom by selling off previously unsold P160 cards.",
    "Nvidia has recently jumped on the cryptomining bandwagon itself with the release of its new line of Cryptocurrency Mining Processors (CMP), as a way to take the pressure off the GeForce market in order to try and try remedy the ongoing stock issues affecting its latest RTX 3000-series GPUs.",
    "The CMP cards, which will be based on Nvidia’s last-generation Turing architecture, will be useless for gamers since they'll lack any display output. The company also said that CMPs will also have a lower peak core voltage and frequency in a bid to reduce their running costs.",
    "In term of hash rates, it looks like the P106 will be able to hold its own against the newly-unveiled CMP cards. Nvidia’s lower-spec GPU comes with a hash Tate of 26MH/s, while the aging P106 has a listed hash rate of 24MH/s.",
    "Of course, as noted by PC Gamer, EEC listings are by no means reliable, so while this suggests that the P106 could be making an unexpected comeback, we’re yet to see any concrete details."
  ],
  "headers": {},
  "links": {
    "Nvidia GTX 1060": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/nvidia-geforce-gtx-1060-1325075/review",
    "PC Gamer": "https://www.pcgamer.com/nvidia-gtx-1060-back-palit-p106/",
    "Cryptocurrency Mining Processors (CMP)": "https://www.techradar.com/news/nvidia-accidentally-reveals-some-big-news-about-its-new-mining-gpus"
  }
}