{
  "source": "https://www.techradar.com/news/a-quiet-revolution-is-currently-happening-in-the-cheap-phone-market",
  "title": "A quiet revolution is currently happening in the cheap phone market",
  "category": "phones",
  "updated": "2021-07-12T12:20:43Z",
  "author": "tom-bedford",
  "summary": "Right under your noses",
  "article": [
    "A few years ago, even the best cheap phones were utilitarian devices with plenty of compromises, and although nowadays you can get a great budget handset if you know where to look, the best is yet to come.",
    "One of the biggest areas of compromise was in performance power, with lower-cost phones being noticeably slower than mid-range rivals when navigating around menus or apps. You'd have to wait a while for a social media app to load, or sit and watch after swiping between pages for the animation to stutteringly play out.",
    "In early 2021, though, something changed. It started with an announcement from a tech company you might not have heard of, but it could lead to a total overhaul of the cheap phone market.",
    "On January 19, in a blog post on its website, Qualcomm - the company that makes processors for most flagship phones - unveiled a new chipset, the Snapdragon 870. The 800-series is Qualcomm's top-end line, offering powerful chipsets, but each year there's only usually one model unveiled (not including tweaked versions of that original), and in 2021 that was the Snapdragon 888 which we saw in the Xiaomi Mi 11, OnePlus 9 and more.",
    "The 'point' of this second chipset - the 870 - wasn't immediately clear. It was, in effect, a tweaked version of 2020's Snapdragon 865, which was used in the flagships of that year. However the 870 isn't as powerful as the 888, making its importance initially unclear.",
    "In the initial announcement Motorola, Oppo, OnePlus and Xiaomi all announced they'd be using the chipset in future phones, but their provided testimonials were all full of marketing jargon, with no real meaning behind the words. Hundreds of words still didn't illuminate what the point of the Snapdragon 870 was.",
    "We had to wait for Motorola to explain it to us.",
    "The Snapdragon 870 first showed up in the Motorola Edge S - if you haven't heard of that phone, it's understandable, because the name was only used in China. Elsewhere, the device was known as the Moto G100.",
    "Motorola's popular and affordable Moto G series has never had powerful phones in its ranks - as budget devices, that's not exactly a surprise - and as a reviewer, it's standard to test one of them expecting a cheap and cheery device. That wasn't the case with the Moto G100.",
    "In our review of the phone, we said \"The Moto G100 is a pretty great phone in its own right,\" complimenting how the phone was \"great for gaming, running titles much more smoothly, and at higher graphics settings, than lots of rivals, even relatively high-end games\" thanks to the chipset.",
    "We were surprised to find such processing power in a budget phone, given such performance was usually exclusive to the top-tier, top-cost flagships. And then more Snapdragon 870 phones kept coming.",
    "Since the Moto G100, we've seen a few more smartphones with the Snapdragon 870, including a number of budget devices. The OnePlus 9R, Black Shark 4, Vivo X60 series, Xiaomi Poco F3 and more all used the chipset.",
    "To give some context as to how powerful the chipset is, we can turn to Geekbench, a popular benchmark website that we use for our reviews. By comparing multi-core scores, we can see these low-cost phones have straddled the distance between what you'd expect from a budget phone, and what you'd normally see in a premium one.",
    "Typically, budget phones using a Snapdragon 600- or 700-series chipset, or an equivalent from MediaTek, would get a multi-core score on the benchmark in the mid-1,000s. The mid-range Motorola Edge got 1,732, for example, and the Xiaomi Poco X3 NFC got 1,799.",
    "Compare that to flagships - Snapdragon 888 phones like the Xiaomi Mi 11, OnePlus 9 and Nubia Red Magic 6 got 3,569, 3,654 and 3,606 respectively. That's around double the scores of mid-rangers.",
    "So how does the Snapdragon 870 line up? From our tests the Moto G100 got 2,875, the Poco F3 got 3,369 and the Vivo X60 Pro got 3,381 - that's not too far behind the Snapdragon 888 at all (well, except for the Moto phone).",
    "Bear in mind that, at these top-tier figures, variations of tens or even hundreds doesn't make a noticeable different to the phone. A game will play identically, and video or photo rendering will only be milliseconds different. So for all intents and purposes, the Snapdragon 870 matches the 888 from a user experience point of view.",
    "Perhaps the biggest selling point of phones like the Moto G100 and Poco F3 is the price - they don't cost the huge sums of the Xiaomi, OnePlus or Samsung flagships, with prices that make them easy to pick up for the average consumer.",
    "The Snapdragon 870 effectively makes high-performance smartphones an accessible technology, so everyone can enjoy snappy gaming, fast navigation and powerful photo and video editing tools.",
    "So, half a year after its launch, we can finally tell what the 'point' of the Snapdragon 870 is - it's a low-cost alternative to the top-end Snapdragon 888, which gives similar power, but lets companies keep the prices of their phones lower.",
    "Just a year ago, the thought of a super-powerful phone that doesn't break the bank would have been inconceivable. Now, it's a reality - and in the future, hopefully it'll be commonplace.",
    "At the time of writing, there are only a few Snapdragon 870 phones on the market, but more manufacturers are announcing devices with it all the time.",
    "In fact, some premium phones are using it now too - the Black Shark 4 uses it, despite the Black Shark 3 using the top-end chipset of its year, and the Vivo X60 series uses the 870 despite premium pricing.",
    "It's the affordable handset market where the use of the Snapdragon 870 is exciting, though, as it offers buyers great value for money. It makes sense that Motorola and Xiaomi would use it, as they're the two top players on the cheap-phone scene, and we'd also like to see Realme and perhaps HMD Global (makers of Nokia phones) embrace it too.",
    "The introduction of the Snapdragon 870 might have passed many phone fans by - processors aren't quite as flashy as fancy cameras or giant, high-res displays - but it could make a meaningful change.",
    "The future of smartphones is a mystery, but the Snapdragon 870 has made top processing power much more accessible, and it only makes sense that this would continue in future years. Hopefully soon, every new phone, no matter how much you pay for it, will be a processing powerhouse."
  ],
  "headers": {
    "3": "Enter Snapdragon",
    "7": "Hello, Moto",
    "11": "Vivo and Mi",
    "17": "The dragon goes cheap",
    "21": "The revolution will be telephones"
  },
  "links": {
    "best cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "blog post": "https://www.qualcomm.com/news/releases/2021/01/19/qualcomm-announces-boosted-snapdragon-870-5g-mobile-platform",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "OnePlus 9R": "https://www.techradar.com/reviews/oneplus-9r",
    "Black Shark 4": "https://www.techradar.com/news/xiaomi-black-shark-4-and-4-pro",
    "Vivo X60 series": "https://www.techradar.com/reviews/vivo-x60-india",
    "Xiaomi Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Xiaomi Poco X3 NFC": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
    "Nubia Red Magic 6": "https://www.techradar.com/reviews/nubia-red-magic-6",
    "Black Shark 3": "https://www.techradar.com/reviews/xiaomi-black-shark-3-review"
  }
}