{
  "source": "https://www.techradar.com/news/iphone-13s-in-screen-touch-id-sensor-more-likely-thanks-to-new-report",
  "title": "iPhone 13’s in-screen Touch ID sensor more likely thanks to new report",
  "category": "phones",
  "updated": "2021-01-29T23:54:36Z",
  "author": "david-lumb",
  "summary": "The 2021 iPhones could finally get in-screen fingerprint sensors",
  "article": [
    "Another report suggests the iPhone 13 will get in-screen fingerprint sensors, which would finally help top-tier iPhone owners who have been unable to rely on Face ID after wearing masks through nearly a year of Covid-19.",
    "Apple is incorporating in-screen fingerprint sensors to future iPhones according to former Apple employees speaking to the Wall Street Journal. Given how this supports Bloomberg’s mid-January report that Touch ID is coming to iPhone displays, we could see this appear in the iPhone 13.",
    "Yes, Apple could wait another year (or more) to implement Touch ID, as neither of the above reports indicated a time frame for in-screen fingerprint sensors coming to iPhones. Two things suggest it could come in the iPhone 13, though: we haven’t heard rumors focus on other new features nearly as much as this one, and we’ve been hearing that iPhones will get in-screen fingerprint sensors for years.",
    "Those rumors have intensified in 2020 to suggest Touch ID in displays is coming in 2021 iPhones, however, like this October leak.",
    "The iPhone 12 series was the first to support 5G, though phones that came out a year before already had, like the Samsung Galaxy S10 5G. Apple phones are even more behind in adopting in-screen fingerprint sensors, which Android phones have had for years.",
    "There’s another feature common in flagship Android phones that’s rumored to come to the iPhone 13: 120Hz displays. Noted Apple analyst Ming-Chi Kuo predicted the brand’s phones would get faster refresh rate displays in September, and the Wall Street Journal report corroborates the assertion.",
    "The 120hz rate makes browsing websites and navigating app menus much smoother than the 60Hz norm, though refreshing the screen twice as fast drains battery faster, too. As the WSJ report notes, the Samsung Galaxy S20 series has countered that with a variable refresh rate screen that raises and lowers the rate based on what you’re doing (120Hz for gaming, 40Hz for scrolling through photos); if the iPhone 13 incorporates a faster refresh rate, it still might be behind Samsung’s tech and suffer worse battery life if it doesn’t opt to manage the 120Hz drain.",
    "Via 9to5Mac"
  ],
  "headers": {
    "4": "Any other iPhone 13 hints?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Wall Street Journal": "https://www.wsj.com/articles/whats-in-the-next-iphone-check-samsungs-new-galaxy-s21-11611931084?mod=searchresults_pos3&page=1",
    "report": "https://www.techradar.com/news/apple-reportedly-developing-a-foldable-iphone-flip-though-it-could-be-years-away",
    "leak": "https://www.techradar.com/news/move-over-iphone-12-apples-iphone-13-may-feature-under-display-touch-id",
    "predicted": "https://www.techradar.com/news/iphone-12-and-ipad-air-4-reportedly-get-a-few-crucial-changes",
    "9to5Mac": "https://9to5mac.com/2021/01/29/under-screen-touch-id-iphone/"
  }
}