{
  "source": "https://www.techradar.com/news/battlefield-6-tipped-for-may-reveal",
  "title": "Battlefield 6 tipped for May reveal",
  "category": "gaming",
  "updated": "2021-06-11T16:57:27Z",
  "author": "vic-hood",
  "summary": "Battlefield 6 could be officially announced soon",
  "article": [
    "Battlefield 6 (now confirmed to be Battlefield 2042) could be officially revealed sometime in May. That's according to GamesBeat's Jeff Grubb, who revealed in a live stream last week that, as far as he understands, EA is likely planning to announce the new Battlefield before June.",
    "In response to a fan who asked when Battlefield 6 will be revealed, Grubb answered: \"May\". \"Let's add some color to that, probably May,\" Grubb continued. \"Things are still fluid, they haven't announced anything publicly yet, but my understanding is that they're [EA] probably looking at May.\"",
    "\"I think Battlefield 2021 should get revealed before the general E3 timeframe, so before June. I think that means May,\" Grubb said. \"That's not a guarantee or anything, but probably May.\"",
    "While, as Grubb points out, this isn't a \"guarantee\", an announcement in May does line up with EA's previous confirmation that Battlefield 6 will be revealed \"in the Spring\". With May falling within that time period, a May reveal does look quite likely.",
    "Developed by EA Dice, Battlefield 6 is still something of a mystery but EA has wasted no time in teasing big things. EA CEO Andrew Wilson has expressed hopes that the latest consoles will “bring massive and immersive battles to life with more players than ever”, mentioned maps “with unprecedented scale” and said that “the next vision of Battlefield takes all the destruction, player agency, and vehicle and weapon combat that the franchise is known for and elevates it to another level.”",
    "Add to that the rumors that the game could feature 128-player maps, Battle Royale and a modern setting and we can't wait to see what EA has in store for the official reveal – whenever that may be."
  ],
  "headers": {
    "3": "It lines up"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "live stream": "https://www.youtube.com/watch?v=GA6HEUDtRUM",
    "has expressed": "https://www.techradar.com/news/battlefield-6-will-feature-massive-immersive-battles-on-ps5-and-xbox-series-x",
    "rumors": "https://www.techradar.com/news/battlefield-6-is-cross-gen-and-will-feature-128-player-maps-according-to-leak"
  }
}