{
  "source": "https://www.techradar.com/news/motorola-edge-s-smartphone-is-launching-soon-is-this-the-new-motorola-edge-2",
  "title": "Motorola Edge S smartphone is launching soon - is this the new Motorola Edge 2?",
  "category": "phones",
  "updated": "2021-01-20T13:52:22Z",
  "author": "jitendra-soni",
  "summary": "Ready for a January 26 launch",
  "article": [
    "A few days after the Motorola Edge's successor was teased by the company, Motorola has confirmed the launch date of this new Motorola Edge S smartphone, which seems to be the Edge 2 in all but name.",
    "On Chinese social media site Weibo, the company posted an announcement stating the new smartphone is coming January 26. This seems to be a Chinese teaser, and it's not clear if the phone will launch globally or just in that country.",
    "The launch announcement confirms the phone will run the newly-unveiled Snapdragon 870 chipset and will be 5G-compatible, but other than that we don't know much about the Motorola Edge S.",
    "Since late 2020, we'd been hearing loads of leaks about a phone code-named the Motorola Nio, and some have been speculating that this phone is the Edge S.",
    "A recent leak showed a phone with two front-facing cameras and four rear ones, and which in several areas matched leaked specs of the Motorola Nio. However, in the settings menu the phone called itself the Motorola Edge Plus (a phone which confusingly has already launched and looks completely different).",
    "Still, that might mean the phone that we presumed was the Motorola Nio is actually the Motorola Edge Plus 2, or another entry in the Edge range, and that Nio may just be a codename.",
    "However, leaked Nio pictures show it to be a phone with a flat display, whereas the titular feature of the Edge phones was a display that curved dramatically at the edges.",
    "So it seems unlikely the Motorola Nio is the Edge S, the Edge Plus 2, or any other Edge model, but we can't totally rule it out until Motorola shows off this new phone. That's happening January 26 - we don't have an exact time yet - and TechRadar will be sure to cover the launch as it happens."
  ],
  "headers": {
    "3": "Are Moto Edge S and Moto Nio the same?"
  },
  "links": {
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Motorola Edge S": "https://www.techradar.com/reviews/moto-g100-review",
    "Weibo": "https://weibo.com/1645915085/JDWQFEqUi?from=page_1006061645915085_profile&wvr=6&mod=weibotime&type=comment#_rnd1611132782724",
    "Snapdragon 870 chipset": "https://www.techradar.com/news/this-new-top-smartphone-chipset-is-coming-to-motorola-oneplus-and-xiaomi-phones",
    "recent leak": "https://www.techradar.com/news/live-images-of-moto-nio-spotted-ahead-of-the-launch"
  }
}