{
  "source": "https://www.techradar.com/news/ios-145-lets-you-ditch-apple-music-on-your-iphone-and-default-to-spotify",
  "title": "iOS 14.5 lets you ditch Apple Music on your iPhone and default to Spotify",
  "category": "phones",
  "updated": "2021-02-09T08:28:21Z",
  "author": "james-rogerson",
  "summary": "Or any other music player",
  "article": [
    "If you’re one of the many people who owns an iPhone but doesn’t use Apple Music, then iOS 14.5 looks set to have a feature you’ll find useful – the ability to switch to a different default music player.",
    "It’s a feature that has been spotted by Reddit users in the iOS 14.5 beta, and specifically it will ask what app you want to use the first time you request a song from Siri, then whatever you select will be set as the default, meaning in future you can just ask Siri to play a song without specifying the app.",
    "Users who don’t have Apple Music installed noted that it didn’t even ask them which app to use the first time they requested a track, instead just defaulting to the main music player they use, be that Spotify or anything else.",
    "This is a feature that’s previously been announced for HomePod, but not yet fully rolled out, as at the time of writing Pandora is the only player you can switch to. But perhaps the support for Spotify and other default players here means more will be added to HomePod too.",
    "That said, at the moment this feature sounds a bit buggy. Some users have reported that it only works if you phrase your song request in specific ways, or that it will sometimes just revert back to Apple Music. But hopefully that’s just because it’s still in beta. Bugs are forgivable and expected there, we just hope it works smoothly by the time iOS 14.5 launches.",
    "This isn’t the only new feature coming with iOS 14.5 either, as we already know that both mask support for Face ID, and an App Tracking Transparency feature are in the works too, so this looks set to be a bigger update than some of the 14.x ones have been.",
    "As for when the iOS 14.5 update will actually land, that we’re not sure of, but with it in beta now we wouldn’t expect the wait will be too much longer.",
    "Via PhoneArena"
  ],
  "headers": {
    "3": "A work in progress"
  },
  "links": {
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Reddit": "https://www.reddit.com/r/iOSBeta/comments/ldzar3/siri_asking_which_music_service_to_use_afterwards/",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "mask support for Face ID": "https://www.techradar.com/news/ios-145-will-provide-a-great-excuse-to-buy-an-apple-watch-mask-support-for-face-id",
    "App Tracking Transparency": "https://www.techradar.com/news/ios-145-will-bring-a-big-privacy-feature-to-iphone",
    "PhoneArena": "https://www.phonearena.com/news/ios-14.5-beta-Spotify-default-music-player_id129982"
  }
}