{
  "source": "https://www.techradar.com/news/intel-arc-alchemist-gpus-might-not-beat-rtx-3070-but-it-doesnt-matter",
  "title": "Intel Arc Alchemist GPUs might not beat RTX 3070 – but it doesn't matter",
  "category": "computing",
  "updated": "2021-09-08T21:00:58Z",
  "author": "jackie-thomas",
  "summary": "An untapped market",
  "article": [
    "Intel Arc graphics cards are still a little while away, likely landing in Q1 2022, but we're starting to see all kinds of leaks and rumors about the upcoming chips. And – well, regardless of whether they're legit – this isn't like the usual run-up to a graphics launch.",
    "Most recently, we've seen two conflicting rumors about the top-end GPU in the Intel Arc stack, which is rumored to be a 512 EU (Execution Unit) part. Leaker @greymon55 apparently saw an internal slide from Intel that shows Intel's high-end part is going to be targeting the RTX 3070, as spotted by HotHardware.",
    "Meanwhile, a leaked Geekbench result pegs an unnamed Intel GPU with 512 compute units with performance much lower than what the RTX 3070 is capable of, as pointed out by our friends at Tom's Hardware. And for the next few months, that's just going to be the way things go.",
    "Intel Arc didn't just come out of thin air. We've been hearing rumblings about Intel launching fully-fledged graphics cards to take on the likes of Nvidia and AMD Radeon for years now, and it's only recently that we got a glimpse of the Intel Xe-powered DG1 at CES 2020.",
    "And at that show, when we first saw these GPUs in action, it was powering a laptop that was locked behind a giant glass box, struggling to run Destiny 2 – but even that was impressive, given how early the GPU was in development. Fast forward to now, and Intel Xe LP graphics are now powering both laptop and desktop integrated graphics.",
    "It's pretty unlikely that the benchmarks we're seeing at this point are in any way going to reflect what any graphics card based on this architecture will be able to do.",
    "Even if Intel's flagship Alchemist GPU fails to match the Nvidia GeForce RTX 3070, it doesn't actually matter that much, and it's because not many people can afford a GPU at that level anyways – especially with the way graphics cards are priced right now.",
    "Looking again at the Steam Hardware survey, the most powerful graphics cards in the top 10 GPUs is the Nvidia GeForce RTX 2070 Super, and even that GPU only accounts for 2.10% of Steam users. And, those top ten GPUs make up for 47.04% of all of Steam's users.",
    "And so it makes sense that with its first run of enthusiast-class graphics cards, Intel would go for the mainstream market, where it can stand to take the most market share from AMD and Nvidia. Because, while the Nvidia GeForce RTX 3090 and the AMD Radeon RX 6900 XT are incredibly powerful graphics cards and we love them – both Team Green and Team Red have completely forgotten about the budget segment.",
    "Again, even though it's been nearly a year since both Nvidia and AMD have released their current-generation GPU lineups, we still don't have anything for budget gamers. And that means that Intel has a clear segment of the market that is basically being ignored right now.",
    "Neither the Nvidia GeForce RTX 1650 Super or the AMD Radeon RX 5500 XT have been replaced, which leaves a massive gap. So, while it might be disappointing if Intel doesn't have something to take on the RTX 3080, it doesn't make much sense for the company to go after the high end right now – but that doesn't mean it won't.",
    "Just remember that during the Intel Architecture Day, Intel revealed the codenames for four generations of its Xe Arc graphics processors. So, while we might not see an RTX 3080 (or even an RTX 3070) competitor right away, it's unlikely that Intel will never challenge the top-end of either AMD or Nvidia's product stack. Now we just have to wait and see what happens."
  ],
  "headers": {
    "3": "This is still the beginning",
    "6": "However..."
  },
  "links": {
    "Intel Arc": "https://www.techradar.com/news/intel-arc",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "HotHardware": "https://hothardware.com/news/intel-arc-alchemist-perf-target-rx-6700-xt-rtx-3070",
    "Geekbench": "https://browser.geekbench.com/v5/compute/3331258",
    "Tom's Hardware": "https://www.tomshardware.com/news/intel-arc-alchemist-512-eu-mobile-gpu-nvidia-geforce-gtx-1650-max-q-geekbench-5",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "locked behind a giant glass box, struggling to run Destiny 2": "https://www.techradar.com/news/we-played-destiny-2-on-the-intel-xe-dg1-at-ces-2020",
    "Steam Hardware survey": "https://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam",
    "Nvidia GeForce RTX 2070 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
    "Nvidia GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "AMD Radeon RX 5500 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5500-xt"
  }
}