{
  "source": "https://www.techradar.com/news/new-tv-shows-2021-what-to-watch-on-netflix-disney-plus-and-more-before-the-year-ends",
  "title": "New TV shows 2021: what to watch on Netflix, Disney Plus and more before the year ends",
  "category": "entertainment",
  "updated": "2021-08-12T11:56:23Z",
  "author": "samuel-roberts",
  "summary": "Your new TV preview for the rest of 2021",
  "article": [
    "2021's big TV season is just about to kick off – and it's the best state television has been in for a long time. Production has finally caught up after the pandemic put filming on ice for a lot of our favorites last year, and it basically means we're going to get a hell of a lot of good TV in a short space of time.",
    "Honestly, there's so much to check out before the end of the year that you probably won't have time to watch all of it. So, to try and help you plan your watch list in advance, we've picked out the obvious highlights in the bunch for this 2021 preview. All these shows are ordered chronologically by release date below, while a few at the bottom of the list are still waiting for an official launch date.",
    "Release date: August 18 (US) Available on: Hulu (US), Prime Video (UK)",
    "This drama about a fictional wellness retreat comes from Nicole Kidman and Big Little Lies creator David E Kelley, marking their third collaboration after last year's The Undoing on HBO.",
    "Kidman plays Masha Dmitrichenko, the facility's overseer, and the show follows a group of people coming from the city to this remote location for a 10-day retreat – but all is not what it seems in this idyllic resort, as you might expect. Melissa McCarthy and Michael Shannon co-star.",
    "Release date: August 20 (Worldwide) Available on: Netflix",
    "The Chair stars Sandra Oh as Dr. Ji-Yoon Kim, the new Chair of English at a respected university – and the first woman to take on the job. It looks like it's not particularly heavy stuff, based on the trailer above, and critics seem to rate this lighthearted-looking comedy drama so far.",
    "Other recognizable faces in the trailer include Jay Duplass and Bob Balaban. This is notable as one of the projects produced by Game of Thrones co-creators DB Weiss and David Benioff under their expensive Netflix contract.",
    "Release date: August 31 (US and UK) Available on: Hulu (US), Disney Plus (UK)",
    "TV shows sure love true crime podcasts these days. If it isn't adapting them (see The Shrink Next Door further down this list) it's making a series all about them (Apple's Truth Be Told, for example). This one is an all-out comedy, though, about three true crime fans who inadvertently get caught up in a real murder case – and decide to investigate the truth behind it to make their own podcast. Steve Martin, Martin Short and Selena Gomez star, with Martin also the credited co-creator. The trailer makes it look like a lot of fun.",
    "US and UK viewers can both watch this one on the same day.",
    "Release date: September 7 (US) Available on: Hulu",
    "After a wait of more than three years, the greatest of producer Ryan Murphy's many TV shows finally returns for a hotly-anticipated season about the Bill Clinton/Monica Lewinsky scandal.",
    "We're fascinated to see the cast of this latest anthology instalment in action – Booksmart's Beanie Feldstein plays Lewinsky, while Clive Owen of all actors has the tricky role of portraying Clinton (we can't wait to hear the voice). The Sopranos' Edie Falco is playing Hillary, and Murphy regular Sarah Paulson also features in the cast as Linda Tripp. With Lewinsky on-board as a co-producer, this show should offer a fairer look at her version of events than the media of the '90s was prepared to give her.",
    "The BBC has the rights to show the series in the UK, but hasn't revealed when it'll broadcast it.",
    "Release date: September 13 (US) Available on: Hulu (US), Disney Plus (UK)",
    "After spending more than a decade of development hell as both movie and TV producers tried to figure out how to adapt Brian K Vaughan and Pia Guerra's acclaimed post-apocalyptic comic, we're finally getting FX's TV adaptation next month. In Y: The Last Man, every creature with a Y chromosome on Earth is dead, except for Yorick (Ben Schnetzer) and his pet monkey. The show explores a new world ruled by women as they try to piece society back together. The source material was extraordinary – let's hope this TV version is worthy of it.",
    "Release date: September 17 (Worldwide) Available on: Apple TV Plus",
    "Apple finally offers up the second season of its flagship prestige drama starring Reese Witherspoon and Jennifer Aniston, which is about the tumultuous behind-the-scenes events of a morning news show. Be wary of watching the above if you don't want the events of the surprisingly great first season spoiled – the show co-stars Steve Carrell and Billy Crudup, the latter of whom won an Emmy for his work on the show.",
    "Release date: September 24 (US) Available on: Apple TV Plus",
    "Apple is making a big swing into large-scale sci-fi with David S Goyer's adaptation of Isaac Asimov's Foundation series of books. How it'll be boiled down into an enjoyable weekly drama is the big challenge, here – but it's been positioned as a story about a group of exiles who attempt to rebuild civilization after an empire falls, which is a simple enough pitch. The great ensemble cast helps, too: Jarred Harris and Lee Pace are among the recognizable names here.",
    "Release date: October 13 (US) Available on: Hulu (US), Disney Plus (UK)",
    "This all-star miniseries is about the rise of the opioid crisis in the US, which is a tough subject matter. The trailer promises an unsparing look at the key players that made it happen – and the reason to tune in here is the cast: Michael Keaton, Rosario Dawson, Michael Stuhlbarg and Will Poulter are among the many big names featured.",
    "UK subscribers will get to enjoy Dopesick on Disney Plus via Star – we're just not sure when yet.",
    "Release date: October 6 (US) Available on: CBS (US)",
    "The original Las Vegas-set CSI has been lined up for a comeback in the streaming era, with original series stars William Petersen and Jorja Fox reprising their roles as Gil Grissom and Sara Sidle. The teaser above doesn't reveal much, but expect grisly murders, confusing forensic terminology and an older Petersen wearing a nice hat. This is the first time CSI has been back on TV in more than five years – and it's still a name that carries a lot of weight in this era of fractured viewing habits.",
    "Release date: November 7 (US) Available on: Showtime (US), Sky/Now (UK)",
    "Dexter was a genuine smash hit when it aired, but its finale is famously regarded as one of the worst of a modern day TV show – giving viewers an ending that didn't sit right with the character as they came to know him. Star Michael C Hall agreed, and as interest in this series about a serial killer who only murders criminals persisted, original showrunner Clyde Phillips figured out a way to bring him back without rewriting that terrible ending. Read our guide to Dexter: New Blood for more on what's coming.",
    "Release date: November 12 (Worldwide) Available on: Apple TV Plus",
    "Anchorman co-stars Will Ferrell and Paul Rudd reunite in this dark comedy drama, which is about the boundary-crossing power dynamics between a therapist (Rudd) and his patient (Ferrell). Based on the 2019 podcast of the same name, itself covering real-life events, it's another example of Apple using its weight to land big stars to lead its new shows. This could be a low-key highlight before 2021 wraps up.",
    "Release date: November 19 (US) Available on: Hulu (US)",
    "We're pleased Hulu went for another round of The Great, which comes from The Favourite screenwriter Tony McNamara – and like that film, it's a dark comedy vaguely based on a real period of history starring Nicholas Hoult. It's about the growing power struggle between Catherine (Elle Fanning) and Peter III (Hoult); real history will tell you where the story is going, which makes Peter's toxic pettiness and Catherine's hatred of him all the more appealing.",
    "It's unclear how it'll release in the UK, where season 1 came to both Channel 4 and Starzplay.",
    "Release date: November 24 (Worldwide) Available on: Disney Plus",
    "After Loki, Marvel is giving us a break until its next MCU show rolls out. Hawkeye offers Clint Barton (Jeremy Renner) the only natural story route he has left: training up a next-generation successor in Hailee Steinfeld's Kate Bishop. Rumors suggest the show will also feature Florence Pugh's Yelena Belova from the Black Widow movie. Much of this series remains a mystery right now.",
    "Release date: November 25 Available on: Disney Plus",
    "Peter Jackson isn't really the go-to guy for short movies, as anyone who tried a combined Hobbit/The Lord of the Rings movie marathon last year discovered. That's partly why his documentary about The Beatles has spilled out from being a movie into a three-part TV show, to be released over Thanksgiving. Get Back covers the making of the album Let it Be in 1970, with tons of never-before-seen footage – anyone in your life who can't let The Beatles go should be happy with this one.",
    "Release date: December 17 Available on: Netflix",
    "The phenomenal arrival of fantasy drama The Witcher felt like the last major thing that happened on TV before the entire world shut down in early 2020. Now, two years later, it's back – with a new season that sees Geralt of Rivia (Henry Cavill) escorting Ciri (Freya Allan) to Kaer Morhan, home of the witchers in this universe, where it looks like she's training for combat. Episode one will adapt the short story A Grain of Truth from Andrzej Sapkowski's The Witcher books.",
    "Release date: December (Worldwide) Available on: Disney Plus",
    "We're not getting any new episodes of The Mandalorian this year, but this spin-off starring Temuera Morrison as the newly Sarlacc-free Boba Fett and Ming-Na Wen as Fennec Shand is already confirmed for release in December 2021. We only really know what the epilogue told us: that Fett has taken control of Jabba the Hutt's palace, executing Bib Fortuna and taking the throne of Tatooine's underworld. Hopefully, we'll see a few more Star Wars bounty hunters make the cut for this new series.",
    "Release date: Fall 2021 (US and UK) Available on: HBO Max (US), Sky/Now (UK)",
    "It's pretty cruel that we've had to wait two years for Succession to follow up on its season 2 finale twist, where Kendall Roy (Jeremy Strong) turned on his cold, calculating father Logan (Brian Cox), but HBO has confirmed we'll see it land before the end of the year. Like every season of the show, it's going to be about the Roy siblings fighting for ultimate control of their father's business, Waystar Royco, with spectacular double-crossings and searing one-liners at each others' expense. We can't wait.",
    "Release date: December Available on: Netflix (worldwide)",
    "Cobra Kai season 4 is taking us back to the All Valley Karate Tournament in its next season, as the charming, middle-aged former karate kids return for another season on Netflix. Thomas Ian Griffith's Terry Silver, last seen in Karate Kid Part 3, will be among the new faces in this highly-anticipated series."
  ],
  "headers": {
    "2": "Nine Perfect Strangers",
    "5": "The Chair",
    "8": "Only Murders in the Building",
    "11": "Impeachment: American Crime Story",
    "15": "Y: The Last Man",
    "17": "The Morning Show season 2",
    "19": "Foundation",
    "21": "Dopesick",
    "24": "CSI Vegas",
    "26": "Dexter: New Blood",
    "28": "The Shrink Next Door",
    "30": "The Great season 2",
    "33": "Hawkeye",
    "35": "The Beatles: Get Back",
    "37": "The Witcher season 2",
    "39": "The Book of Boba Fett",
    "41": "Succession season 3",
    "43": "Cobra Kai season 4"
  },
  "links": {
    "Dexter: New Blood": "https://www.techradar.com/news/dexter-new-blood-release-date-cast-trailer-and-everything-we-know",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-has-finished-filming-but-is-clint-bartons-story-done",
    "Yelena Belova from the Black Widow movie": "https://www.techradar.com/news/black-widow-post-credits-scene-explained",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Cobra Kai season 4": "https://www.techradar.com/news/cobra-kai-season-4"
  }
}