{
  "source": "https://www.techradar.com/news/many-smbs-are-struggling-to-deploy-much-needed-smart-building-tech",
  "title": "Many SMBs are struggling to deploy much-needed smart building tech",
  "category": "computing",
  "updated": "2021-07-19T10:52:09Z",
  "author": "sead-fadilpasic",
  "summary": "Smart building technology can bring many benefits to SMBs",
  "article": [
    "Business decision-makers understand the value of smart building technologies but struggle to deploy them due to shrinking budgets and senior leadership woes, a new report has found.",
    "Research from smart buildings company Johnson Controls based on interviews with 100 building decision-makers across the UK & Ireland found that while almost all decision-makers (99%) understand the value of this technology, just a third (34%) installed them on their premises. Budget constraints were cited as the key roadblock for almost two-thirds (64%) of the respondents, while almost half (42%) couldn’t get senior buy-in.",
    "Drilling deeper into these two problems, Johnson Controls found that commercial space organizations need to spend up to $3.7m per building when, oftentimes, they have $1.8m at their disposal.",
    "Senior leaders, on the other hand, face a different challenge: do they become early adopters and face all the challenges that status brings, or will they be “forced to make urgent improvements down the line”.",
    "At the moment, occupant health and safety are their main concerns, and smart tech helped almost all (87% of the respondents) during the difficult Covid-19 pandemic. In the future, however, the focus on climate change will only grow, and with it - the importance of smart building tech. In five years, energy efficiency will probably be the number one priority. In a decade, it might pivot towards sustainability and net zero.",
    "“Smart buildings haven’t only helped businesses get through the pandemic – they’re also essential to achieving ambitious sustainability targets like Carbon Net Zero,” said Andy Ellis, VP and General Manager, Johnson Controls UK&I.",
    "“Smart solutions that integrate with your fire, security, controls, HVAC, and occupancy systems can look across a whole building to see in real-time where efficiencies can be made. Without technologies like these to do the hard work for building staff, achieving new levels of sustainability targets and creating healthy workspaces – that support both the environment and employees – will be hard.”",
    "Besides keeping employees safe and healthy, and minding the environment, there are many other benefits of smart building technologies for small and medium-sized businesses. Improved building efficiency, through - for example - smart lighting, can lead to reduced energy consumption and, consequently, more savings. What's more, predictive maintenance can reduce the costs of expensive repairs."
  ],
  "headers": {
    "4": "Smart building benefits"
  },
  "links": {}
}