{
  "source": "https://www.techradar.com/news/you-might-want-to-wait-to-install-windows-11-on-your-gaming-pc",
  "title": "You might want to wait to install Windows 11 on your gaming PC",
  "category": "computing",
  "updated": "2021-10-06T18:56:41Z",
  "author": "jackie-thomas",
  "summary": "Opinion: avoid any unnecessary slowdowns, and stick to what already works",
  "article": [
    "Windows 11 is finally here, and while it's genuinely pretty great, it's still early days for the new operating system with some kinks to work out – especially when it comes to PC gaming.",
    "Tom's Hardware did a whole load of tests around gaming performance on Windows 11, primarily surrounding two security features: VBS and HVCI. Both involve virtualization, so they're particularly heavy on CPU performance and can cut your gaming PC performance by as much as 8% according to Tom's Hardware's testing.",
    "That's certainly not enough to make your gaming PC suddenly worthless, and in many games it's probably not even enough to notice, but you don't want to sacrifice any performance if you don't have to. Generally, our advice is usually to avoid new versions of Windows for at least the first couple of weeks either way, but even otherwise tech savvy gamers might want to wait.",
    "Luckily, it doesn't seem like these features will be enabled by default when you upgrade your own PC, but it looks like some PC manufacturers are being pushed by Microsoft to enable them.",
    "PC gaming is such a broad and complicated world that it's almost impossible to come up with one value judgement that somehow fits everyone, and even accounting for a performance loss. There are going to be people who are right at that 60 fps threshold in their favorite game, and losing as much as 8% could bump them down into the low 50s.",
    "However, if your gaming PC is already overkill for the games you usually play – I know my RTX 3090 and Ryzen 9 3900X is way more than I'll ever need for Final Fantasy XIV – you may not even notice. I upgraded to Windows 11 mostly because it was a shiny new thing that was shoved in my face as well as securely feeling I have powerful enough hardware that I never really have to worry about not being able to hit that 60 fps threshold - but I know I'm pretty alone in that.",
    "Most people don't have that level of PC hardware at their disposal, though. And if you have a system with like an Intel Core i5-9600K, 8GB of RAM and an Nvidia GeForce GTX 1060, that performance loss could be a huge deal.",
    "Over the next few weeks and months, Windows 11 is only going to get more feature-packed and rich, which will make it harder to resist upgrading. At the same time, though, Microsoft will also be working performance optimizations into the operating system as it adds in more features.",
    "Right now, there is only one feature that's a huge deal for gamers and that's DirectStorage, which will bring SSD speeds rivaling the Xbox Series X. That's definitely exciting stuff, but it's not like there are any games even using that yet on PC, so it's not really a reason to jump to upgrade.",
    "Right now, sticking to Windows 10 isn't going to shut you off from playing any upcoming PC game, that I know of at least. And, I don't know how much DirectStorage is even going to be necessary at first anyways.",
    "Because at the end of the day, PC games were supporting Windows 7 and Windows 8 for years into Windows 10's lifespan, and it was only when DirectX 12 came out that it became actually important for PC gamers to upgrade their OS. I can't predict the future right now, but I can assume that it's going to basically go the same way for Windows 11.",
    "Right now you don't have to upgrade and Windows 10 is both faster and more stable – so if all you care about is playing the best PC games without sacrificing frame rate, it's probably best to just stay on the established software for now. After all, it's not going anywhere for quite a while."
  ],
  "headers": {
    "4": "Is 5-8% really that big a deal?",
    "7": "Patience, please"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Tom's Hardware": "https://www.tomshardware.com/news/windows-11-security-gaming-application-performance-benchmarks",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Ryzen 9 3900X": "https://www.techradar.com/reviews/amd-ryzen-9-3900x"
  }
}