{
  "source": "https://www.techradar.com/news/apple-tv-plus-ps4",
  "title": "Apple TV Plus on PS4: How to get it and start watching now",
  "category": "entertainment",
  "updated": "2021-04-06T10:56:36Z",
  "author": "kieron-moore",
  "summary": "Stream the latest shows and movies from your console",
  "article": [
    "Apple TV Plus is the premium video on demand streaming service from Apple. Subscription costs $4.99 per month, or you might find yourself with a year’s free subscription after buying a new Apple product, like an iPhone. As well as these Apple products, you'll also be able to watch Apple TV Plus on PS4.",
    "If you want to watch series or movies on Apple TV Plus on PS4, you may be wondering how you can access it. Read our guide to find out how to access Apple TV Plus on PS4.",
    "Yes, the Apple TV app was added to the PS4 in November 2020. Through this app, you can buy or rent a range of films and series and access Apple TV Plus if you have a subscription - and if you don't, why not head to Apple TV Plus' website and sign up now?",
    "On the PS4 home page, scroll to the TV and Video icon. On this menu, you should see the Apple TV Plus logo. Select it, and follow the prompts to download the Apple TV Plus app. Once it’s downloaded and installed, the icon in the TV and Video menu will take you straight to the Apple TV Plus app.",
    "Within the app, the next step is to log into your Apple ID. You can enter your credentials with the PS4 controller or use a mobile device.",
    "With the mobile device option, you are given either a QR code to scan with your phone’s camera or an alphanumeric code to type into a web page: activate.apple.com",
    "If you don’t already have an account, you will be able to set one up directly with Apple TV Plus.",
    "You’ll now be able to browse the Apple TV Plus app. There’s a tab on the top bar for Apple TV Plus, which shows you all the content that you can access as part of your subscription.",
    "The selection of films and TV on Apple TV Plus isn’t as broad as Netflix and Amazon Prime, but there are a few things worth checking out including some of the best Apple TV shows.",
    "A highlight is comedy series Ted Lasso, starring Jason Sudeikis as an American college football coach who moves to Britain to train a Premier League soccer team, despite having no experience with the sport.",
    "If you’re a fan of the genre, there’s a psychological horror series Servant, executive produced by M. Night Shyamalan, in which a couple in mourning are haunted by a mysterious force.",
    "Movie highlights include Greyhound, a WWII story starring Tom Hanks as a US navy commander, and On the Rocks with Bill Murray and Rashida Jones as a father and daughter who team up to tail her possibly unfaithful husband.",
    "If Apple TV Plus on PS4 isn’t enough for you, you might want to look at the other streaming services available, including:",
    "If you don’t have a PS4 but want to watch Apple TV Plus, there are several other devices that you can access it on, including Apple TV Plus on Chromecast and Apple TV Plus on Roku. You can also get Apple TV Plus on other gaming consoles including PS5, Xbox One, Xbox Series X and Xbox Series S. Other devices include Amazon Fire TV and Fire Sticks, iPhone and iPads, Mac and via web browsers on your device."
  ],
  "headers": {
    "2": "Is Apple TV Plus on PS4 yet?",
    "3": "How to install Apple TV Plus on PS4",
    "8": "What can I watch on Apple TV Plus with PS4?",
    "12": "What other streaming services are available on PS4?",
    "13": "What other devices can I watch Apple TV Plus on?"
  },
  "links": {
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "activate.apple.com": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4898307429316862000&sharedId=trd-us&u=https%3A%2F%2Factivate.apple.com%2F",
    "set one up directly with Apple TV Plus": "https://tv.apple.com/channel/tvs.sbd.4000?at=1001l369U&ct=trd-us-1578548443452004600&itscg=30200&itsct=Future_TV",
    "best Apple TV shows": "https://www.techradar.com/best/best-apple-tv-shows",
    "Apple TV Plus on Chromecast": "https://www.techradar.com/how-to/how-to-get-apple-tv-plus-on-your-google-chromecast-with-google-tv",
    "Apple TV Plus on Roku": "https://www.techradar.com/news/apple-tv-plus-roku"
  }
}