{
  "source": "https://www.techradar.com/news/google-pixel-fold-may-have-been-cancelled-before-it-was-even-announced",
  "title": "Google Pixel Fold may have been cancelled before it was even announced",
  "category": "phones",
  "updated": "2021-11-16T13:23:26Z",
  "author": "david-lumb",
  "summary": "But could it come later?",
  "article": [
    "The Google Pixel Fold may have died before it was even announced, as a new report suggests the foldable has been canceled for now – if not permanently.",
    "The hint comes from a report by Ross Young of Display Supply Chain Consultants, who cited supply chain sources as saying Google has canceled part orders and abandoned plans to bring the foldable to market in 2021 or even in the first half of 2022. This could mean it’s not coming out until later, or it could mean the Google Pixel Fold has been abandoned entirely.",
    "Why? The sources told DSCC that Google didn’t believe the Pixel Fold would compete well in its niche. Given the strong showing by the Samsung Galaxy Fold 3 and Samsung Galaxy Flip 3 that launched back in August, we aren’t surprised to hear that reasoning.",
    "This year kicked off with some exciting concepts shown off at CES 2021, leading some at TechRadar (as in, this writer) to declare 2021 the year of the rollables. We know how that played out: the LG Rollable died when LG exited the smartphone business in April, and while TCL introduced the ambitious Fold N’ Roll that same month, we haven’t heard a peep about it since.",
    "With LG’s exit, we have no more phones like the LG G8X and LG V60 that came with the Dual Screen peripheral, and news in June suggested the Motorola Razr 2021 was cancelled, too. The first Honor foldable could be launching soon, and Oppo has one reportedly coming in December, but with only a month left to go in the year, those launches could easily roll into 2022.",
    "So while it looks like the Pixel was warned off by even less competition than there could have been with only the Samsung Z Fold 3 and Z Flip 3 coming out this year (and with limited availability, the Royole Flexpai 2), Google would have still had to outperform third-generation foldables released by the company most experienced in that phone niche. Combined with the ongoing supply chain issues, it’s not surprising that Google pressed pause on the Pixel Fold – if the company hasn’t quietly cancelled it entirely."
  ],
  "headers": {
    "3": "Analysis: a weak year for foldables – for everyone but Samsung"
  },
  "links": {
    "Google Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "Display Supply Chain Consultants": "https://www.displaysupplychain.com/blog/has-google-dropped-the-pixel-fold",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "rollables": "https://www.techradar.com/news/ces-2021-convinced-me-rollable-phones-are-the-next-big-frontier",
    "Fold N’ Roll": "https://www.techradar.com/news/tcls-fold-n-roll-is-both-a-rollable-and-a-foldable-phone-so-when-do-we-get-one",
    "suggested": "https://www.techradar.com/news/motorola-razr-2021-might-be-canceled-but-xiaomi-and-honor-could-fill-the-void",
    "soon": "https://www.techradar.com/news/the-first-honor-foldable-phone-could-be-launching-soon",
    "coming": "https://www.techradar.com/news/oppo-foldable-smartphone-may-launch-as-early-as-december-heres-what-we-know",
    "Royole Flexpai 2": "https://www.techradar.com/news/royole-flexpai-2-is-the-sequel-to-the-first-foldable-phone-heres-what-its-like-to-use"
  }
}