{
  "source": "https://www.techradar.com/news/apple-fitness-plus-gets-a-big-update-with-help-from-lady-gaga-and-stephen-fry",
  "title": "Apple Fitness Plus gets a big update, with help from Lady Gaga and Stephen Fry",
  "category": "fitness",
  "updated": "2021-06-25T08:59:35Z",
  "author": "cat-ellis",
  "summary": "New music-led workouts and Time to Walk stories",
  "article": [
    "Apple Fitness Plus has received a major update, with new playlist-focused workouts from big name artists, plus a fresh batch of celebrity-led Time to Walk stories.",
    "There's no shortage of on-demand workout services available now, but Apple has always been able to set itself apart thanks to its existing deals with record labels for iTunes. Rival service Peloton found itself in serious trouble with music publishers last year for its unlicensed use of tunes (a matter that was settled out of court), and Les Mills works around the problem by combining licensed music with covers and original tracks to cut costs.",
    "Apple, on the other hand, simply needs to renegotiate its existing deals with the labels to cover Fitness Plus, giving it some of the best workout soundtracks around.",
    "Its latest update adds a new Artist Spotlight Series, with workouts featuring whole playlists by individual artists. The first batch includes sessions soundtracked by Lady Gaga, Alicia Keys, Keith Urban, and Jennifer Lopez.",
    "If none of those take your fancy, we expect many more artists and genres will be added to the mix over the coming months.",
    "Time to Walk, which launched earlier this year, is an app that encourages you to make time for a stroll, while listening to personal stories from celebrities. The idea is to give you a walking companion, so you can get out of the house and stretch your legs without feeling lonely. It's available as an Apple Watch app to Fitness Plus subscribers.",
    "Apple has now launched its second series of Time to Walk stories, with tales from boxer and Olympic gold medalist Anthony Joshua; model Naomi Campbell; actress, singer, songwriter and producer Cynthia Erivo; winner of the first ever women's Olympic marathon Joan Benoit Samuelson; comedian and writer Stephen Fry; and many more.",
    "You can download these new stories to your Apple Watch through the Fitness app on your iPhone, and listen with Bluetooth headphones as you stroll."
  ],
  "headers": {
    "5": "You'll never walk alone"
  },
  "links": {
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Time to Walk": "https://www.techradar.com/news/your-apple-watch-is-about-to-get-a-new-time-to-walk-feature",
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "in serious trouble with music publisher": "https://variety.com/2020/digital/news/peloton-settles-music-publishers-lawsuit-1203517495/",
    "Apple Watch app": "https://www.techradar.com/news/best-apple-watch-apps-2021",
    "Bluetooth headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344"
  }
}