{
  "source": "https://www.techradar.com/news/the-creator-of-the-ipod-says-products-are-designed-all-wrong-these-days",
  "title": "The creator of the iPod says products are designed all wrong these days",
  "category": "computing",
  "updated": "2021-12-01T21:05:09Z",
  "author": "joel-khalili",
  "summary": "‘Stop trying to impress the engineers,’ says Tony Fadell",
  "article": [
    "Tony Fadell, inventor of the Apple iPod and smart thermostat Nest, has said he believes too many companies approach product design with the wrong priorities.",
    "During a panel at Slush 2021, attended by TechRadar Pro, Fadell explained he thinks even some of the brightest entrepreneurs lack the sense of timing necessary to build truly iconic products.",
    "“It’s vital to understand what people need, or will need. You’ve got to make sure you’re solving a problem that people are just beginning to have,” he said.",
    "“It’s no good coming in two decades early, even if the technology is there. People need to understand the problems you’re trying to solve.”",
    "Fadell says his advice for budding founders is to “stop trying to create something that impresses the engineers”, and to focus instead on creating something that “gives super powers to every person”.",
    "Fadell also used the startup conference, which was live again in Helsinki after a one-year hiatus, to unveil his latest project: a manual for the next generation of product designers, called Build.",
    "Although precious little was revealed about the book itself, which won’t hit the shelves until May 2022, it was presented as “an unorthodox guide to making things worth making” that will help entrepreneurs take the big leaps necessary to bring about dramatic change.",
    "“Over the years, working with all these entrepreneurs, I’ve realized something: the only reason I'm on this stage is because someone helped me to get here. They mentored and believed in me,” said Fadell.",
    "\"But a lot of my mentors have now passed away, so that baton of mentorship has been passed from them to me. The only way I can give back is to give back to the [startup] community.”",
    "Another way in which Fadell will endeavor to support up-and-coming talent is by taking calculated risks on emerging deep tech companies, via his venture capital firm Future Shape.",
    "The investment house specializes in startups that are tackling difficult technical problems that most VCs won’t go near, Fadell explained - and it’s looking to add to its 200-strong portfolio. Presumably, though, Fadell is only interested in founders that can demonstrate that all-important sense of timing."
  ],
  "headers": {
    "5": "The next generation of entrepreneurs"
  },
  "links": {
    "Apple iPod": "https://www.techradar.com/deals/cheap-ipod-touch-sale-prices-deals",
    "smart thermostat": "https://www.techradar.com/news/best-smart-thermostat",
    "Slush 2021": "https://www.techradar.com/news/live/slush-2021-live-blog-all-the-latest-updates-from-the-startup-conference",
    "budding founders": "https://www.techradar.com/how-to/the-basics-of-starting-a-business"
  }
}