{
  "source": "https://www.techradar.com/news/payday-3-and-painkiller-are-coming-but-from-a-new-publisher-youve-never-heard-of",
  "title": "Payday 3 and Painkiller are coming – but from a new publisher you’ve never heard of",
  "category": "gaming",
  "updated": "2021-06-11T20:14:30Z",
  "author": "samuel-tolbert",
  "summary": "Prime crime",
  "article": [
    "As part of Summer Game Fest 2021 and E3 2021, Koch Media, one of the many divisions under Embracer Group, announced a new publishing label: Prime Matter. One of the first games announced for Prime Matter is Payday 3, which will be developed in partnership with Starbreeze Studios.",
    "There aren't many further details for the game at this time except that Payday 3 is being aimed for a 2023 release window on consoles and PC.",
    "“Prime Matter is a new home for premium games, offering both current and future partners all the expertise of the Koch Media Group alongside a new and dynamic team dedicated to maximising their true potential,” said Koch Media’s CEO Klemens Kundratitz.",
    "Other games announced for the Prime Matter label include King's Bounty 2, a new Painkiller game, Crossfire: Legion, several new IP and a Nintendo Switch port of Kingdom Come: Deliverance.",
    "The Payday games are a series of co-op heist games where players work together to rob banks. Initially the games were developed by Overkill Software, a studio that was then acquired by Starbreeze Studios in 2012.",
    "Embracer Group currently consists of eight distinct groups with 68 different studios. As of May 2021, the company is reportedly in late-stage talks to with more than 20 additional companies for possible acquisitions. Some of Embracer Group's other labels Saber Interactive, THQ Nordic, Gearbox Entertainment and Coffee Stain Holding."
  ],
  "headers": {
    "4": "Embracing the world"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "announced": "https://www.kochmedia.com/en/2021/06/10/prime-matter-koch-medias-new-premium-gaming-label/",
    "reportedly": "https://www.gamesindustry.biz/articles/2021-05-20-embracer-group-has-had-acquisition-talks-with-150-more-companies"
  }
}