{
  "source": "https://www.techradar.com/news/google-sets-hard-deadline-for-classic-sites-migration",
  "title": "Google sets hard deadline for classic Sites migration",
  "category": "computing",
  "updated": "2021-04-21T10:41:42Z",
  "author": "anthony-spadafora",
  "summary": "It's the end of an era for classic Google Sites",
  "article": [
    "Google's classic Sites website builder will be made defunct and users have been given until September 1 to migrate to the new Sites experience.",
    "First launched in 2008, Google Sites was built using technology from JotSpot, a hosted wiki service the search giant acquired in 2006. Users initially had to purchase their own domain name, but Google made its new website building service completely free later that year.",
    "After eight years, though, the Google Sites platform was in need of a refresh and the company announced the launch of new Google Sites in 2016. The free drag-and-drop website builder and web hosting service was put in place to help its users create an online presence.",
    "Google informed its users in an email that it will be ending support for the service and sites that would like to remain visible are required to convert and republish on the new Google Sites.",
    "Google also announced that any content posted on the classic Sites will no longer be visible by January 1, 2022 and from May 15, 2021 it will remove the ability to create new websites on the classic Sites builder.",
    "Google first revealed it will be replacing classic Sites in a blog post back in 2017, which was followed by the launch of tools a year later for site owners to migrate.",
    "To help users with the migration process, Google created an aid called Classic Sites Manager for converting existing classic Sites to new Google Sites as unpublished drafts.",
    "The Classic Sites Manager's capabilities also include the ability to archive old sites and delete sites no longer needed.",
    "While Google has set a hard deadline for classic Sites migration, if users choose to take no action, all classic Sites in a Google account will be automatically downloaded as an archive and saved to Google Drive and replaced with a draft in the new Google Sties platform."
  ],
  "headers": {
    "4": "Converting classic Sites to new Sites"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Google Sites": "https://www.techradar.com/reviews/new-google-sites",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "new Google Sites": "https://www.techradar.com/reviews/new-google-sites",
    "blog post": "https://workspaceupdates.googleblog.com/2017/05/an-update-on-classic-google-sites.html",
    "Classic Sites Manager": "https://sites.google.com/classicsitesmanager",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite"
  }
}