{
  "source": "https://www.techradar.com/news/hpe-is-launching-a-computer-into-space-to-help-accelerate-research",
  "title": "HPE is launching a computer into orbit to accelerate space research",
  "category": "computing",
  "updated": "2021-02-11T13:01:27Z",
  "author": "joel-khalili",
  "summary": "HPE’s Spaceborne Computer-2 will be installed on the International Space Station (ISS)",
  "article": [
    "Hewlett Packard Enterprise (HPE) is launching a computing system into space for the second time, in support of NASA’s ongoing mission to enable extended human space travel.",
    "The new edge computing system is the successor to HPE’s original Spaceborne Computer, which was installed on the International Space Station (ISS) in 2017, and will allow for real-time data processing in space for the first time.",
    "According to HPE, Spaceborne Computer-2 (SBC-2) will accelerate time-to-insight from months to just minutes across a variety of space applications, such as medical imaging, DNA sequencing and analyzing data captured by sensors and satellites.",
    "It will also allow ground teams to monitor the status and health of astronauts on the ISS in real-time, accelerating diagnoses by processing medical data in-situ.",
    "SBC-2 will be shot into orbit on February 20, as part of the 15th Northrop Grumman Resupply Mission to Space Station (NG-15), and will be available for use on the ISS for the next two to three years.",
    "\"Space is the very edge of the edge, so if we can achieve reliable edge computing in space, we will advance exploration,\" Dr. Mark Fernandez, HPE solution architect, told TechRadar Pro and other media during a briefing call.",
    "\"Self-sufficient computing enables self-sufficient explorers and that's what we're going to need on the Moon and Mars.\"",
    "The original Spaceborne Computer was commissioned by NASA to test whether off-the-shelf server hardware could withstand the trauma associated with rocket launch and the harsh conditions of space.",
    "The second generation system, SBC-2, offers both twice the computing power and edge computing facilities, which allows for data to be processed closer to the source, eliminating latency issues linked with transmission between space and Earth.",
    "The system is powered by two identical lockers, each of which contains an HPE Proliant DL360 server and an Edgeline EL4000 Converged Edge system, which is also equipped with a GPU to help process image-intensive data and support AI workloads.",
    "The dual-locker set-up also offers full redundancy, as compared with the first generation Spaceborne Computer.",
    "“The most important benefit to delivering reliable in-space computing with Spaceborne Computer-2 is making real-time insights a reality. Space explorers can now transform how they conduct research based on readily available data and improve decision-making,” explained Fernandez.",
    "“We are honored to make edge computing in space possible. Through our longstanding partnerships with NASA and the International Space Station US National Laboratory, we look forward to powering new, exciting research opportunities to make breakthrough discoveries for humanity,” he added."
  ],
  "headers": {
    "7": "HPE Spaceborne Computer-2"
  },
  "links": {}
}