{
  "source": "https://www.techradar.com/news/disney-plus-ps4",
  "title": "Disney Plus on PS4: how to get it and start watching now",
  "category": "televisions",
  "updated": "2021-03-03T11:02:12Z",
  "author": "tom-johnson",
  "summary": "How to quickly install and watch Disney Plus on PS4",
  "article": [
    "When it comes to streaming services, Disney Plus might be the new kid on the block, but there are plenty of great movies and TV shows for kids and grownups alike. What’s more, it’s easy to watch Disney Plus on PS4.",
    "In this article, we’ll explain how to access Disney Plus on the gaming console and the content you’ll be able to watch. Whether you’re a hardcore fan of the Marvel Cinematic Universe or prefer to explore the real world with National Geographic, Disney Plus is a treasure trove of content.",
    "If you own a PS4 then you’ll be glad to know that yes, you can watch Disney Plus. However, if you’ve got a PS3 then unfortunately Disney Plus isn’t currently available on your console, and it’s unlikely that will change.",
    "Fortunately for PS4 users, the installation process is pretty straightforward. So even if you’re a parent looking to surprise your kids with a Disney Plus subscription, and you’re unfamiliar with using a PS4, you won’t have any difficulty.",
    "The installation process is simple, but if you’ve not got an account already you might prefer to sign up to Disney Plus using a computer or laptop, because typing out email addresses, passwords, and credit card information can be frustrating on gaming consoles.",
    "Once you’ve got an account with Disney Plus, start up your PS4 and head to the PlayStation Store, which is the furthest left, and push the X button.",
    "Once you’re in, push Up and then Right to highlight the search function and push X again. Now you’ll be presented with a keyboard, and if you type 'Disney' you’ll see the Disney Plus app appear on the right-hand side.",
    "Keep pushing Right until the keyboard disappears and Disney Plus is highlighted, then push X and the app’s page will come up. The Download button should be highlighted automatically, so push X again to download.",
    "It shouldn’t take long to install the app, but this can vary depending on your internet speed. Once it’s downloaded, simply push Start and log in with your account details. Simple.",
    "For those who've managed to buy a PS5, you'll be happy to know you'll be able to reap all the nostalgia of Disney Plus content from your gaming console, as well as being able to dive into all the new content being released every month. Simply follow the instructions above but on your PS5 and you'll be away.",
    "With Disney Plus on PS4, you can watch all the great content that Disney has to offer, and there’s a lot. For example, you can watch Wandavision, the immensely popular new TV series that is sure to delight Marvel fans. Sci-fi enthusiasts can also watch all the Star Wars movies and the critically-acclaimed The Mandolorian.",
    "Meanwhile, anyone looking for TV nostalgia can watch the original five series of The Muppet Show, as well as every episode of The Simpsons ever made. Then of course there are the family favorites, such as the Pixar films—and all the Pixar shorts—and Disney classics like The Lion King, The Jungle Book, and Aristocats.",
    "Star on Disney Plus brings a surge of both old and new more mature content to customers in the UK, Australia, Canada and other territories, including Grey's Anatomy and The X Files, as well as Star Originals exclusive to Disney Plus. Speaking of new content, you'll also be able to pay for access to brand new films fresh out of Walt Disney Studios with Disney Plus Premier Access.",
    "PS4s are good for more than just playing video games as almost every streaming service is available via the console, which is great if you want to stream shows and movies on a non-smart TV. Some of the other streaming services that you can download from the PlayStation Store include:",
    "Since its launch in 2019, the popularity of Disney Plus has skyrocketed, which is partly due to its accessibility. Alongside PS4, you can also watch Disney Plus on PS5, as well as Xbox One, Xbox Series X, and Xbox Series S.",
    "When it comes to streaming devices, you can get Disney Plus on Roku, as well as Disney Plus on Chromecast and Fire Stick. For those locked into the Apple ecosystem, Disney Plus on Apple TV is also available.",
    "It'll be downloadable on most Smart TVs, on top of both iOS and Android devices, too."
  ],
  "headers": {
    "2": "Is Disney Plus on PS4 yet?",
    "4": "How to install Disney Plus on PS4",
    "9": "Is Disney Plus on PS5?",
    "10": "What can I watch on Disney Plus with PS4?",
    "13": "What other streaming services are available on PS4?",
    "14": "What other devices can I watch Disney Plus on?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "sign up to Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-9343316653293670000&sharedId=trd-us&u=http%3A%2F%2Fwww.disneyplus.com%2F",
    "buy a PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "Disney Plus on Chromecast": "https://www.techradar.com/news/disney-plus-chromecast",
    "Disney Plus on Apple TV": "https://www.techradar.com/news/disney-plus-apple-tv"
  }
}