{
  "source": "https://www.techradar.com/news/new-ipad-pro-2021-release-date-listed-by-apple",
  "title": "New iPad Pro 2021 release date listed by Apple",
  "category": "tablets",
  "updated": "2021-04-30T14:03:39Z",
  "author": "james-rogerson",
  "summary": "May 21 looks to be the date",
  "article": [
    "We’re now almost certain the new iPad Pro 2021 range will be in stores on May 21. We’re confident of this because the slates are now available to pre-order, and if you go through that process in the UK then at the time of writing you get a delivery window of May 21-27.",
    "In the US, things are slightly less clear, with some models being shown with a window of 2-3 weeks (rather than specific dates). Two weeks would only take us to May 14, so it’s possible that the release date is earlier than May 21, but once you enter a ZIP code on the site it gives a more precise window - every single one that we tested came back with May 21-27.",
    "In Australia the wait might be a bit longer – the store page again lists 2-3 weeks, but we entered a Sydney postcode and were told it wouldn’t be delivered before June 3.",
    "That May 21 date applies to both the new iPad Pro 11 and the iPad Pro 12.9 in both the US and UK – though currently we’re only seeing that for select models of the larger slate in the US, with others shipping in June.",
    "So availability dates are still a bit unclear, and may shift further into the future as more people place orders. But with May 21 being the earliest date we can see, and previous rumors putting forward that same date, we wouldn’t count on getting a new iPad Pro in your hands before then.",
    "With Apple talking about potential supply constraints for its iPad ranges as the year goes on, it’s possible that availability could soon become tight. So if you’re set on buying one of these new tablets it might be worth doing so now – though if you’re not in a hurry you should consider waiting for our full review."
  ],
  "headers": {
    "3": "May 21 in both sizes"
  },
  "links": {
    "new iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "previous rumors": "https://www.techradar.com/news/new-ipad-pro-2021-release-date-may-have-just-leaked",
    "potential supply constraints": "https://www.techradar.com/news/ipad-pro-2021-and-new-imac-may-have-limited-stock-this-year"
  }
}