{
  "source": "https://www.techradar.com/news/whatsapp-unleashes-a-six-pack-of-sticker-sets",
  "title": "WhatsApp unleashes a six-pack of sticker sets",
  "category": "phones",
  "updated": "2021-05-04T16:24:46Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Liven up your chats with brand new stickers",
  "article": [
    "WhatsApp has launched six new sticker packs, full of fun cartoon images to add to your chats.",
    "WhatsApp may be primarily about text, video and voice-based chat, but image-based is also important. We're not just talking the photos you send back and forth with friends and family, but also the emoji and stickers that can be used to liven up a conversation.",
    "Like many messaging platforms, WhatsApp supports the sending of stickers in chats, and there are a host of these fun addition available to download from – of course – the WhatsApp Sticker Store. New sticker collections are added all the time, and now six new packs have made their way to the store for you to grab.",
    "Weighing in at less than 5MB a pack, these whimsical stickers can help you convey and idea or feeling when mere words simply won't cut it. As sticker fans have become used to, there is a element of the nonsensical and the surreal to the sticker packs, but this just helps to add to their appeal.",
    "Things kick off with 'A Burdensome Pigeon Named Eagle', and there's a second helping of the dancing bear in 'Betakkuma 2'. Best of friends 'Egg and Chup' are new additions, as is 'Realistic Rabbit'. Rounding things off are the slightly SpongeBob-like 'Square Cheese’s Daily Life' and the frankly weird 'Woman Cactus'.",
    "The sticker can be accessed by Android and iOS users via the WhatsApp Sticker Store, and the links are below. All six sticker packs are available to download free of charge and once you have installed them via your mobile device, they'll also be accessible in the web or desktop version of the app if you have these installed.",
    "Those all-important links are:",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "Sticker freebies!"
  },
  "links": {
    "voice-based chat": "https://www.techradar.com/news/new-whatsapp-feature-helps-you-avoid-making-a-fool-of-yourself",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-is-releasing-6-new-sticker-packs-today/"
  }
}