{
  "source": "https://www.techradar.com/news/how-to-watch-brooklyn-nine-nines-last-ever-episode-from-anywhere",
  "title": "How to watch Brooklyn Nine-Nine's last ever episode from anywhere",
  "category": "computing",
  "updated": "2021-09-16T22:01:35Z",
  "author": "alex-hughes",
  "summary": "Hold the tears, Brooklyn Nine-Nine is coming to an end",
  "article": [
    "8 years, 153 episodes and a whole lot of pop-culture references - Brooklyn Nine-Nine has had a long and lovable life on our TV screens and now finally, it's time to say goodbye. Read on to see how to watch the Brooklyn Nine-Nine's last ever episode online.",
    "Titled 'The Last Day', the big finale will actually be two episodes airing on the same day. This is only the second time in its entire history the show has done a two part episode.",
    "Rosa has left and become a private eye, Holt has rejected his retirement and taken a deputy commissioner position with Amy becoming a chief alongside him. Now, with this double-bill episode, we should get conclusions on the lives of all of the Nine-Nine's detectives.",
    "A lot of fans of the show are taking the 'Last Day' title of the finale to mean Jake's last day on the force. After talking to Amy about her promotion, the show hinted that this could be how it would end.",
    "No matter where you are in the world, we've broken down everything you need to know about how to watch the Brooklyn Nine-Nine's last ever episode online including prices, streaming platforms and times.",
    "If you're going to be out of the country when the Brooklyn Nine-Nine finale airs then you will find the content is geo-blocked. Luckily, there is an easy way to get around this - a VPN.",
    "A VPN allows you to watch your favorite show from anywhere in the world. It does this by changing your IP address to one in the country you live in normally. Here's everything you need to know to get started:",
    "Three simple steps to using a VPN to bypass geo-restrictions:",
    "1. Download and install a VPN - our recommendation is ExpressVPN",
    "2. Connect to the relevant server location - launch the VPN app, click on 'choose location' and select the right location, i.e. US for Hulu, or Australia for SBS' free stream",
    "3. Head to the chosen broadcaster's live stream - so if you're from Australia, just head to SBS On Demand"
  ],
  "headers": {
    "5": "How to watch Brooklyn Nine-Nine's last ever episode from outside your country",
    "11": "How to watch Brooklyn Nine-Nine's last ever episode online in Canada"
  },
  "links": {
    "a VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "head to SBS On Demand": "https://www.sbs.com.au/ondemand/"
  }
}