{
  "source": "https://www.techradar.com/news/linkedins-new-service-could-be-the-tool-to-book-your-next-freelance-gig",
  "title": "LinkedIn's new service could be the tool to book your next freelance gig",
  "category": "computing",
  "updated": "2021-02-22T15:47:08Z",
  "author": "mayank-sharma",
  "summary": "New LinkedIn service set to debut in September",
  "article": [
    "Freelance workers may soon be able to find their next gigs through a new LinkedIn service that’s currently under development.",
    "LinkedIn Marketplaces will enable users on the Microsoft-owned professional social networking platform to find, connect, hire, and pay freelancers all on the platform itself.",
    "Reports quote LinkedIn spokeswoman Suzi Owens as saying that the platform has noticed a rise in people searching and requesting services from others during the pandemic. “In the future we'll be building new ways to share more about the services you [could] offer directly through your LinkedIn profile,” Owens told The Information.",
    "The Covid-19 pandemic has spruced up the gig economy, as work from home and remote working become the norm for working professionals.",
    "LinkedIn’s move isn’t surprising since it is reported that Upwork and Fiverr, the two behemoths in the freelance marketplace field, together generated about $550 million in revenue last year. With over 700 million professionals already on its network, it stands to reason that LinkedIn wants to have a share of the pie as well.",
    "However, what apparently sets Marketplaces apart from the existing functionality is that it’ll be tied to the LinkedIn digital wallet that is also supposedly in the works. The wallet will enable LinkedIn to facilitate transactions between the employers and the freelancers, making the platform an attractive end-to-end solution in the gig economy.",
    "If reports are to be believed, LinkedIn has been working on the Marketplaces feature since October 2019, and it’s set to go public later this year in September.",
    "Via: The Information"
  ],
  "headers": {
    "3": "LinkedIn Marketplaces"
  },
  "links": {
    "Freelance": "https://www.techradar.com/best/best-freelance-websites",
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "LinkedIn": "https://www.techradar.com/news/linkedin-sales-insights-can-help-your-business-spot-all-the-latest-opportunities",
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1242749456957476900&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Fmicrosofts-new-gig-a-linkedin-freelancer-market-rivaling-upwork-fiverr&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Flinkedins-new-service-could-be-the-tool-to-book-your-next-freelance-gig"
  }
}