{
  "source": "https://www.techradar.com/news/new-oculus-quest-2-avatars-will-be-all-over-facebook-soon",
  "title": "New Oculus Quest 2 avatars will be all over Facebook soon",
  "category": "wearables",
  "updated": "2021-04-27T13:01:47Z",
  "author": "rhys-wood",
  "summary": "Be your best virtual self",
  "article": [
    "Facebook has begun rolling out Oculus Avatars 2.0, its updated player-created avatar system, to Oculus Quest devices. The intention is to eventually have Oculus Avatars 2.0 across all Facebook platforms, including Messenger, Instagram and the Facebook social network app.",
    "The new Oculus Avatars 2.0 gives created avatars a visual facelift over the previous iteration, with improved facial features and animations, RoadToVR reports. The avatars will also be integrated into games developed for the Oculus Quest 2 and other Facebook VR devices.",
    "Three Oculus games already feature Oculus Avatars 2.0 integration – Epic Roller Coasters, Topgolf with Pro Putt and PokerStars VR. In future, the avatars will also be added to more games, including ForeVR Bowling and Synth Riders, via updates.",
    "Oculus Avatars 2.0 looks to be hitting a sweet spot in between rival tech companies’ avatar offerings. Nintendo’s Miis are widely used across its games and apps, but use very simple detail. On the opposite end of the spectrum are Xbox Avatars, which are highly detailed and rich with appearance, clothing and accessory options, but lack the widespread integration that Miis enjoy.",
    "The new Oculus Avatars have an impressive amount of detail, and it seems that Facebook and Oculus have big plans for them in the near future. As well as the aforementioned games, avatars that you've created in Oculus Avatars 2.0 can be used in Facebook Horizon, the social media giant’s own VR app which is currently in a closed beta state.",
    "Custom-made avatars could be having something of a resurgence, then. The rollout of Oculus Avatars 2.0 follows close on the heels of Sony’s renewal of the PlayStation Home trademark. While that could be just a renewal and nothing more, it’s certainly brought PlayStation’s social media experiment back into the conversation as a predecessor to popular apps like VRChat and Rec Room, both of which are compatible with Oculus Quest devices."
  ],
  "headers": {
    "3": "New Oculus, new me"
  },
  "links": {
    "RoadToVR reports": "https://www.roadtovr.com/oculus-avatars-2-0-launch-facebook-messenger-instagram/",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Epic Roller Coasters": "https://www.techradar.com/news/gaming/10-best-vr-rollercoasters-for-the-vive-oculus-cardboard-and-gear-vr-1318108",
    "PokerStars VR": "https://www.techradar.com/news/i-hate-poker-but-pokerstars-vr-made-me-a-high-roller",
    "PlayStation Home trademark": "https://www.techradar.com/news/an-upcoming-ps5-exclusive-could-be-a-weird-defunct-ps3-app"
  }
}