{
  "source": "https://www.techradar.com/news/hitman-3-dlc-is-coming-and-it-could-put-a-new-spin-on-some-old-maps",
  "title": "Hitman 3 DLC is coming and it could put a new spin on some old maps",
  "category": "gaming",
  "updated": "2021-02-01T17:08:44Z",
  "author": "emma-boyle",
  "summary": "“This time around, we can use the whole trilogy”",
  "article": [
    "Hitman 3 developer IO Interactive is planning on releasing some DLC for its hugely popular stealth game but, unlike previous DLC releases, it might not introduce any new locations.",
    "In an interview with The Gamer, IO Interactive executive producer Forest Swartout Large confirmed that the team is “definitely going to be doing some DLC, but we haven’t defined what that is,” adding “I think for now we are not looking at new maps like the bank and the island.\"",
    "Large went on to explain that rather than creating entirely new locations to Hitman 3's DLC, “We’re more looking at using existing locations and reimagining them, twisting them. And this time around, we can use the whole trilogy. We can look back at Hitman 2016 maps, Hitman 2 maps - we have all the locations.”",
    "Having already looked back at some of our favorite Hitman levels from across the series, with some of the most notable being in the very first instalment, we can certainly think of a few locations we wouldn’t mind revisiting with new challenges and twists.",
    "DLC isn’t the only thing in Hitman 3’s future to look forward to; IO has previously confirmed that Elusive Targets will be returning at some point with a change to the formula and Xbox Series X and Series S players can look forward to the addition of ray tracing down the line.",
    "We had a great time with Hitman 3 and in our full review we said that \"As a final bow to this trilogy of excellent games, Hitman 3 offers some all-time classic levels and a thrilling storyline.\"",
    "Of course, IO Interactive is also currently at work on a new James Bond game, dubbed Project 007, but thanks to the studio’s multi-team approach it seems there’s space for both projects and according to Large IO Interactive is “continuously working on Hitman so we are already looking to the future.”"
  ],
  "headers": {
    "4": "More to come"
  },
  "links": {
    "Hitman 3": "https://www.techradar.com/reviews/hitman-3",
    "The Gamer": "https://www.thegamer.com/hitman-4/",
    "some of our favorite Hitman levels": "https://www.techradar.com/best/best-hitman-levels",
    "previously confirmed": "https://www.ioi.dk/hitman-3-game-modes/",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "addition of ray tracing down the line": "https://www.techradar.com/news/hitman-3-will-get-ray-tracing-on-xbox-series-x-in-a-future-update-but-what-about-ps5",
    "full review": "https://www.techradar.com/reviews/hitman-3",
    "Project 007": "https://www.techradar.com/news/project-007-release-date-trailers-news-and-everything-we-know"
  }
}