{
  "source": "https://www.techradar.com/news/amd-rx-6900-xt-gpu-breaks-another-overclock-record-leaving-nvidia-in-its-dust",
  "title": "AMD RX 6900 XT GPU breaks another overclock record, leaving Nvidia in its dust",
  "category": "computing",
  "updated": "2021-05-14T15:03:28Z",
  "author": "darren-allan",
  "summary": "Team OGS achieves a new record speed – and a jaw-dropping 3DMark result",
  "article": [
    "The AMD Radeon RX 6900 XT has been pushed even further with a massive overclock, hitting the giddy heights of 3.3GHz – with exotic cooling, naturally.",
    "The Big Navi flagship has previously been overclocked to 3.225GHz by well-known overclocker Der8auer – and remember, this was already some 200MHz faster than the previous record held by an Nvidia card (the 1080 Ti).",
    "However, as highlighted on Twitter (and spotted by Wccftech), Greek outfit Team OGS has managed to achieve a new speed record of 3321MHz using liquid nitrogen cooling with a PowerColor RX 6900 XT Liquid Devil Ultimate (the same card Der8auer set his record with, in fact, less than a month ago).",
    "The really interesting bit is that while Der8auer didn’t run any benchmarks with his 3.2GHz overclock, Team OGS did, with some record-setting results witnessed (the GPU was run in a rig with a Ryzen 5950X CPU).",
    "That includes the PowerColor graphics card blowing past 41,000 in the Graphics score for the 3DMark Fire Strike Extreme benchmark, with an overall score of 37,618. That’s a new world record for a single GPU in this benchmark, no less.",
    "Remember that this PowerColor Liquid Devil Ultimate is a revamped RX 6900 XT model which uses the refreshed XTXH version of the Navi 21 GPU – meaning it’s a higher-binned GPU (with the potential to run faster), and it has the clock limit raised to 4GHz to allow for overclocking past the previous 3GHz ceiling.",
    "To illustrate just how hard these expert overclockers are pushing the RX 6900 XT here, the rated boost speed of the PowerColor graphics card is 2.25GHz.",
    "While this new record clock speed, and that 3DMark result, are seriously impressive, it might not be long before we see those fall, given that Der8auer previously commented that he believed this PowerColor card could be pushed to reach 3.5GHz."
  ],
  "headers": {
    "5": "Limit lifted"
  },
  "links": {
    "AMD Radeon RX 6900 XT": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "Wccftech": "https://wccftech.com/amd-radeon-rx-6900-xt-overclocked-record-breaking-3-3-ghz-over-41000-points-3dmark-fire-strike-extreme-benchmark/",
    "Der8auer set his record with, in fact, less than a month ago": "https://www.techradar.com/news/amd-radeon-rx-6900-xt-topples-nvidia-to-claim-gpu-clock-speed-record",
    "overclocking": "https://www.techradar.com/how-to/how-to-get-started-with-overclocking"
  }
}