{
  "source": "https://www.techradar.com/news/ori-director-slams-cyberpunk-2077-and-no-mans-sky-over-lies-and-deception",
  "title": "Cyberpunk 2077 and No Man’s Sky slammed by Ori director over ‘lies and deception’",
  "category": "gaming",
  "updated": "2021-02-05T16:38:51Z",
  "author": "adam-vjestica",
  "summary": "Mahler has since apologized",
  "article": [
    "Ori and the Will of the Wisps director Thomas Mahler has weighed in on video game releases that fail to live up to expectations at launch, such as Cyberpunk 2077 and No Man’s Sky.",
    "Mahler took issue with companies overhyping their games and disappointing consumers, with the game director taking to the popular gaming forum Resetera to air out his grievances.",
    "In a lengthy post, Mahler expresses his displeasure at the “gaming snake oil salesmen”, claiming that it all started with Peter Molyneux of Dungeon Keeper and Fable fame, who had a history of over-embellishing what players could achieve in the titles he worked on.",
    "“It all started with Molyneux. He was the master of 'Instead of telling you what my product is, let me just go wild with what I think it could be and get you all excited',” Mahler wrote. “And that was fine, until you actually put your money down and then the game was nothing like what Peter was hyping it up to be.",
    "“He pulled this sh** for a good decade or more with journalists and gamers loving listening to Uncle Peter and the amazing things he's doing for the industry. It took him to release some pretty damn shoddy games for press and gamers to finally not listen to the lies anymore.”",
    "Mahler then turns his attention to Hello Games founder and managing director Sean Murray, the studio behind No Man’s Sky – a game which was notoriously underwhelming at launch compared to the hype surrounding the game.",
    "“Then came Sean Murray, who apparently had learned straight from the Peter Molyneux handbook. This guy apparently just loooooved the spotlight,” Mahler wrote.",
    "“Even days before No Man's Sky released, he hyped up the Multiplayer that didn't even exist and was all too happy to let people think that No Man's Sky was 'Minecraft in Space', where you could literally do everything (you being able to do everything is generally a common theme behind the gaming snake oil salesmen, cause hey, that sorta attracts everybody!).\"",
    "“Obviously there was massive backlash when No Man's Sky finally released and the product being nothing like what Murray hyped it up to be,” Mahler continues. “But what happened then? They released a bunch of updates, so let's forget about the initial lies and deception and hey, let's actually shower him with awards again, cause he finally kinda sorta delivered on what he said the game would be years earlier.”",
    "Mahler naturally cites Cyberpunk 2077, as the latest game that’s fallen foul of creating unrealistic expectations before launch, to the point where the game is no longer available to buy from the PlayStation Store due to countless bugs and performance issues.",
    "“And then came Cyberpunk. Made by the guys that made Witcher 3, so this sh** had to be good. Here's our Cyberpunk universe and – trust us – you can do f**king everything! Here the entire CDPR PR department took all the cues from what worked for Molyneux and Murray and just went completely apesh** with it,” Mahler wrote. “Gamers were to believe that this is 'Sci-Fi GTA in First Person'. What's not to love? Every video released by CDPR was carefully crafted to create a picture in players minds that was just insanely compelling.”",
    "Mahler also notes that not only is this sort of practice damaging for consumers and the industry as a whole, but it also impacts developers.",
    "“And let me also say, from the perspective of a developer, all of this just sucks. Back in 2014, I remember some journalist from some big publication telling us that Ori almost got the cover article of some magazine I read frequently, but ultimately they had to pick No Man's Sky cause it was the 'bigger game',” Mahler said. “I kinda agreed back then, thinking to myself: 'Ok, I get it, they have to promote the bigger game, they obviously have to go for the clicks. Sucks, but that's how the game is played.'",
    "“But then I really felt bamboozled once No Man's Sky came out and it became clear that all this hype was really just built on lies and the honest guy who just showed his actual product really got kicked in the balls because the lying guy was able to make up some tall tales that held absolutely no substance.”",
    "Perhaps somewhat predictably, Mahler has since apologized for his impassioned post on Twitter, stating that “we should always remain respectful with each other. And I wasn’t yesterday.”",
    "While Mahler's delivery undoubtedly overstepped in its tone and delivery, video game companies do have a tendency to get carried away. Cyberpunk 2077 and No Man's Sky are sadly just a few example of games that have seriously let down players at launch. Ubisoft's Watch Dogs and Gearbox Software's Alien: Colonial Marines are two other titles that are now infamous for how different the final experience turned out to be.",
    "We can't blame a company or developer for hyping up their own games, but some hype that's closer to reality would be greatly appreciated. It would help avoid the kind of outrage that occurs when a game ends up woefully short of a developer's lofty goals, and also give consumers more confidence when it comes to pre-ordering a title.",
    "But with development costs increasing with every generation, and the margin for success more narrow than ever, we honestly don't expect to see a change in direction anytime soon."
  ],
  "headers": {
    "9": "Cyberflunk",
    "14": "Backtrack"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "No Man’s Sky": "https://www.techradar.com/news/games-of-the-generation-no-mans-sky-does-exploration-in-the-best-possible-way",
    "Resetera": "https://www.resetera.com/threads/why-are-gamers-so-eager-to-trust-and-even-forgive-the-snake-oil-salesmen.372420/",
    "Fable": "https://www.techradar.com/news/fable-4-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "Minecraft": "https://www.techradar.com/how-to/how-to-download-minecraft-for-pc",
    "no longer available to buy from the PlayStation Store": "https://www.techradar.com/news/sony-pulls-cyberpunk-2077-from-playstation-store-offers-full-refund",
    "Witcher 3": "https://www.techradar.com/news/the-witcher-3-is-headed-to-ps5-and-xbox-series-x-and-you-could-even-get-it-for-free",
    "GTA": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "Watch Dogs": "https://www.techradar.com/news/gaming/consoles/did-ubisoft-mislead-gamers-about-watch-dogs-next-gen-graphics-1234788",
    "Alien: Colonial Marines": "https://www.techradar.com/news/gaming/the-most-disappointing-games-of-the-decade-1324724"
  }
}