{
  "source": "https://www.techradar.com/news/galax-rtx-3090-hall-of-fame-edition-cpb-photos-leaked-online",
  "title": "Galax RTX 3090 Hall of Fame Edition PCB photos leaked online",
  "category": "computing",
  "updated": "2021-01-26T19:27:24Z",
  "author": "john-loeffler",
  "summary": "Perfect for overclockers with money to burn",
  "article": [
    "Leaked photos of Galax's upcoming Nvidia GeForce RTX 3090 Hall of Fame Edition graphics card have appeared online, giving us a glimpse of what this edition aimed at extreme overclockers might be able to do.",
    "The photos, posted online by Videocardz, shows the graphics card's printed circuit board, or PCB, with additional electronic components installed on the board. The card was first teased during Galax's virtual expo in November – which you can explore for yourself here – but provided little in the way of details.",
    "Looking at the CPB gives us some clues, however. It appears to be using 26 phase voltage regulator modules (VRMs), which would make it the most of any RTX 3090 card to date. it isn't clear how many of these are used by the GPU and how many are used by the memory. Heat sinks cover the power stages beside the modules.",
    "The photos show that the card will have three 8-pin power connectors, as well as an overclocking BIOS button and voltage monitoring sensors, which will definitely help overclockers push the card to the limit.",
    "The card also has 24 GDDR6 memory modules installed on both sides of the card in addition to the GA102-300 GPU and the NVLink fingers, so the card is almost certain to be an RTX 3090 and not an RTX 3080 Ti or RTX 3080 Super.",
    "The Galax Hall of Fame lineup of cards are built with the graphics card overclocker in mind, and several well known overclockers are said to have worked on the design of this card. So, if you don't have a liquid nitrogen cooling system setup on your rig, this probably isn't the card for you.",
    "Given that the RTX 3090 is already pretty expensive, it's a fairly niche product to begin with. The RTX 3090 Hall of Fame Edition will be even more so, but we won't have long to wait before we find out just how exclusive a graphics card this one will end up being. Galax is expected to officially announce its line up of RTX 30-series Hall of Fame Edition cards in February."
  ],
  "headers": {
    "5": "Casual users need not apply"
  },
  "links": {
    "Videocardz": "https://videocardz.com/newz/galax-geforce-rtx-3090-hof-pcb-pictured-with-monstrous-vrm-design",
    "here": "https://www.virtual-gx.com/VirtualShow_GALAX.html"
  }
}