{
  "source": "https://www.techradar.com/news/dont-expect-to-see-cyberpunk-2077-on-xbox-game-pass-anytime-soon",
  "title": "Don’t expect to see Cyberpunk 2077 on Xbox Game Pass anytime soon",
  "category": "gaming",
  "updated": "2021-12-02T11:16:50Z",
  "author": "emma-boyle",
  "summary": "“There are no Game Pass plans for Cyberpunk 2077”",
  "article": [
    "Cyberpunk 2077 developer, CD Projekt Red, has stated that it isn’t currently planning to bring the game to Xbox Game Pass.",
    "This announcement comes in response to recent reports that Cyberpunk 2077 might soon launch on Xbox’s subscription service. Hopes were raised when a brief clip of the game was spotted in a recent promotional video for Xbox Cloud Gaming’s launch on consoles. Pointing out that Game Pass videos usually only include footage of games that you can get on the service, Reddit users speculated that this could be a sign of an impending announcement.",
    "In response to a tweet about the possibility of an Xbox Game Pass launch, however, CD Projekt Red's Global PR Director, Radek Grabowksi, shut down the rumors, saying that “there are no Game Pass plans for Cyberpunk 2077.”",
    "It’s pretty hard to find a loophole in that statement. While it doesn’t mean Cyberpunk 2077 will never come to Xbox Game Pass, we’d say subscribers to the service shouldn’t expect to see Cyberpunk 2077 in its library anytime in the near future.",
    "So if Cyberpunk 2077 isn’t gearing up for an Xbox Game Pass debut, what is happening with the game? Well, it was only last month that it emerged that CD Projekt Red has updated its post-launch roadmap and pushed all of its updates and DLC into 2022, alongside the Xbox Series X and PS5 upgrades. That means the rest of 2021 is a quiet one for Cyberpunk players.",
    "We’re hoping that this means CD Projekt Red is putting its head down to make absolutely sure that it gets the next-gen versions of Cyberpunk 2077 just right. If that is the approach the studio is taking, it’s perhaps not all that surprising that an Xbox Game Pass launch isn’t on the cards. At least not for a long while yet.",
    "For its part, Xbox Game Pass is doing well regardless, with the recent launch of Xbox Cloud Gaming on consoles for those with a Game Pass Ultimate subscription. This is a pretty great addition for those playing on Xbox One especially, as it means that they can now play next-gen games like Recompile and The Medium without an Xbox Series X or Xbox Series S.",
    "If, even without Cyberpunk 2077, you’re increasingly tempted by an Xbox Game Pass subscription then it could be a good time to take the plunge; around Black Friday 2021 we’re likely to see retailers offering Xbox Game Pass deals so you might be able to pick up a subscription for less.",
    "Black Friday could also be a good time to pick up Cyberpunk 2077 at a discount if the less-than-positive reception put you off picking it up at full price. The game returned to the PlayStation Store earlier this year and it’s been discounted by 50% as part of the PlayStation Black Friday sale."
  ],
  "headers": {
    "4": "Analysis: So, what is happening with Cyberpunk 2077?"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Reddit users": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/qwrsro/cyberpunk_2077_may_be_coming_to_game_pass/?utm_term=1627165284&utm_medium=post_embed&utm_source=embed&utm_name=&utm_content=header",
    "only last month": "https://www.techradar.com/news/cyberpunk-2077-pushes-all-updates-and-dlc-into-2022",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "recent launch": "https://www.techradar.com/news/you-can-now-play-xbox-series-x-games-on-your-xbox-one",
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Xbox Game Pass deals": "https://www.techradar.com/deals/cheapest-xbox-game-pass-deals-prices",
    "returned to the PlayStation Store": "https://www.techradar.com/news/cyberpunk-2077-is-finally-returning-to-the-playstation-store",
    "PlayStation Black Friday sale": "https://www.techradar.com/news/playstation-announces-black-friday-sale-with-discounts-on-recent-ps5-releases"
  }
}