{
  "source": "https://www.techradar.com/news/pressure-to-be-good-at-games-is-ruining-my-ability-to-enjoy-them",
  "title": "Pressure to be good at games is ruining my ability to enjoy them",
  "category": "gaming",
  "updated": "2021-09-20T16:44:44Z",
  "author": "jess-weatherbed",
  "summary": "Opinion: A farewell to free time",
  "article": [
    "Video games are designed to be many things – they can evoke fear in horror titles, push your problem-solving abilities with puzzles and create a sense of team spirit between you and your close friends. It's easy to see why gaming has become such a popular hobby, growing every decade since they first appeared back in the 1950's, but something that most games have in common is that they're designed to be fun...so why does logging into a public gaming lobby fill me with such a sense of dread?",
    "It wasn't always this way. I'll say off the bat that this article isn't a complaint that video games are too difficult, but rather that I, like many others, have changed as a person since my early years of gaming. There's a sense of nostalgia that I feel I've been trying to capture for the last few years of my life, and I doubt I'm alone. This is essentially a begrudging acceptance that I'm an adult.",
    "Multiplayer video games are amongst the most popular genres these days, having come a long way since titles like Quake appeared on the scene. I was born in 1993, a little too young to have appreciated how Quake helped to pioneer arena shooters, but I remember my own transition between couch co-op and online multiplayer thanks to Halo 3 and Call of Duty 2 on the Xbox 360.",
    "I’m weirdly fond of those memories, but they introduced me to the world of online trolls and general toxicity within the gaming community that I hadn’t previously been exposed to. As someone who was new to competitive FPS games at the time, the difference between playing with people I knew in real life, and the intense strangers I would encounter was intense.",
    "I’ve never been good at multiplayer games. That doesn’t mean I can’t understand how they’re fun, other industries like sports are founded on an ‘us vs them’ nature and it’s healthy to enjoy competition. But it’s important to feel like you’re a part of your team, and in competitive online gaming communities, it’s easy to feel unwelcome.",
    "Online gaming has a glaring issue with toxic players, many of which are happy to call you out as being too soft if you complain about being subjected to trolls in gaming lobbies with comments that vary from playground taunts, escalating up to threats of violence and intense, targeted harassment campaigns. This can be especially prevalent if you’re recognizably female through mic chat or if you have a feminine gaming ID.",
    "A survey of 900 female gamers from Reach3 Insights and Lenovo revealed that 59% of women hide their gender while playing online games to avoid harassment and that 77% of women surveyed said they had experienced gender-specific discrimination online.",
    "I struggle with feeling like I'm contributing towards a stereotype that ‘girls can’t play games’, and the alternative is to grit my teeth and endure harassment over voice chat out of spite, or simply ...stop playing competitive online games.",
    "Regardless of your gender, you’ve likely encountered a situation in a game where some poor sap is the target of abuse because they’re a new player learning the ropes and playing poorly, but there’s a bizarre expectation for new players to willingly subject themselves to this behavior from other players in order to master the mechanics, gain skills and ultimately feel welcome.",
    "That must be what happens because otherwise how would these hugely popular games like Fortnite or Apex Legends have such a large player base? Exposing yourself to that environment and the behavior that comes with it no longer appeals to me, but it does hold value for many other ‘bad’ gamers – and that's okay. I’m not here to wage a one-woman war against gaming communities.",
    "It has made me realize that I need to let go of the idea that I need to prove my worth in competitive games, to win the approval of hostile, anonymous strangers that were never going to respect me in the first place. It’s been festering within me for the last few years that I’m somehow unqualified to be a part of the wider gaming community because I can’t claim to have a ‘Diamond’ or ‘Platinum’ rank in anything. A more accurate and deserved rank for my skills would be ‘Aluminum’.",
    "It isn’t just this twisted sense of anxiety that keeps me from spending several hours a week training to become a beast at League of Legends (despite my best efforts) – my humblebrag is that I have many other hobbies and commitments that take up the precious free time I have.",
    "I enjoy tabletop RPGs, 3D printing and painting miniatures, digital illustration and a bunch of other time-consuming things that make my life feel richer. Finding a balance to include all of these hobbies into my week is a challenge, and trying to improve my gaming skills would require me to sacrifice something else I enjoy in order to chase validation I don't actually need.",
    "Growing older doesn’t mean you can’t play games anymore, but as every year that passes, the less time I have to spend on doing the things I love, so you have to start picking your activities wisely.",
    "Despite what some people might think, my job doesn’t involve me playing games on my computer from 9-5 to ‘test’ PC gaming hardware, and like many adults, I have a range of commitments that need attention the minute I sign off. There are dogs to walk, errands to run, food to cook and things to clean in a seemingly endless cycle. Over the last 12 months I’ve managed to fit in around four hours of gaming a week, and despite this, I absolutely still consider myself to be a ‘gamer’.",
    "The memories I have of playing Halo 3 for four-six hours every day are long behind me and unless something fairly drastic changes in my life in the future, I’ll never have the available time needed to improve my skills in genres like MOBA’s or Battle Royal's enough to feel comfortable playing them.",
    "I’m grateful that single-player titles continue to thrive, giving me an environment to enjoy myself without having to care about how my performance will impact other people playing the game. Geralt doesn’t care how many times I miscalculate a dodge in the Witcher 3, and DOOM guy is happy to let me take as many stabs at fighting the legions of hell as I need.",
    "Learning to let go of this expectation to be great at every game I play has been a challenge, but I’m on the right path, and it’s one that I doubt I'm walking alone. If you’re in a similar mental space as I was, always remember – gaming is supposed to be fun. If you’re not having fun then do whatever you need to find that joy again and please, don’t be too hard on yourself."
  ],
  "headers": {
    "5": "Noob anxiety is a roadblock",
    "11": "Being a busy bee"
  },
  "links": {
    "A survey of 900 female gamers": "https://www.gamesindustry.biz/articles/2021-05-19-survey-says-59-percent-of-women-hide-gender-to-avoid-harassment-while-gaming-online",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review"
  }
}