{
  "source": "https://www.techradar.com/news/bluetooth-shipments-to-reach-6-billion-by-2025",
  "title": "Bluetooth shipments to reach six billion by 2025",
  "category": "phones",
  "updated": "2021-03-30T16:01:00Z",
  "author": "steve-mccaskill",
  "summary": "Shipments were flat in 2020",
  "article": [
    "Annual shipments of Bluetooth-enabled devices are set to top six billion by 2025, according to the technology’s industry body.",
    "Shipments remained flat at four billion during 2020 as the technology industry faced challenging conditions caused by the economic and social impacts of coronavirus-related lockdowns and social distancing measures.",
    "However, the Bluetooth Special Interest Group (SIG), which oversees the specification, certification, and promotion of the wireless standard, says the recovery of traditional device markets coupled with demand for new products will be a key source of growth.",
    "The pandemic had affected sales of some products such as smartphones in 2020 due to supply issues, retail closures, and macroeconomic factors.",
    "However, some categories received a boost from changing consumption habits. The shift to remote working saw a spike in demand for PC accessories, while a focus on health and fitness saw wearable shipments increase. Other long-term growth areas include connected lighting systems and connected health applications, as well as Low Energy audio devices that can also help people with hearing loss.",
    "This combination of emerging product categories, coupled with a recovery in the smartphone market, is cause for optimism among the Bluetooth SIG’s 36,000 members.",
    "“We are all very proud of how the Bluetooth member community rose to the challenges of 2020, and appreciate that so many members are working tirelessly to develop innovations that help manage the pandemic,” said Mark Powell, CEO, Bluetooth SIG.",
    "“This rally to help is the latest example of our community bringing innovators together for a common cause — to develop technology advancements that create a safer, more connected world.”"
  ],
  "headers": {
    "3": "Bluetooth demand growth"
  },
  "links": {}
}