{
  "source": "https://www.techradar.com/news/china-now-has-over-a-billion-citizens-connected-to-the-internet",
  "title": "China now has over a billion citizens connected to the internet",
  "category": "computing",
  "updated": "2021-08-30T12:29:05Z",
  "author": "mayank-sharma",
  "summary": "Majority use a smartphone to go online",
  "article": [
    "More than a billion Chinese citizens now use the internet, majority via their smartphones, according to the latest round of figures released by the China Internet Network Information Centre.",
    "Parsing their latest edition of the usage written in Chinese, The Register notes that the country got an additional 21.75 million people online in Q1 2021, helping it surpass the billion-user mark.",
    "Of the 1.011 billion Chinese that are online, virtually all (1.007 billion) access the internet via mobile devices.",
    "No surprise then that the country sold 174 million smartphones in the first half of the year, 128 million of which were 5G phones, more than doubling the number on an year-on-year basis.",
    "While the total number of the Chinese population that’s currently online sure is eye-popping, their usage pattern is pretty much on expected lines.",
    "Some of the most popular uses of the internet include instant messaging (983 million), watching short videos (888 million), and online shopping (812 million).",
    "The report also notes that just about half of the users (469 million) use their connection to the internet to order food online. Interestingly, it also emerged as one of the fastest growing sectors in the country by adding over 49 million more customers in the first half of 2021.",
    "Connectivity speed isn’t an issue either, with the report pointing out that 91% of all users get over 100 megabits per second, even when 297 million internet users are rural.",
    "In all, the average Chinese citizen spends about 26.9 hours online every week. Interestingly, the figure is down from a peak of over 30 years a week in 2020, which The Register attributes to the lockdowns in the first half of last year.",
    "Via The Register"
  ],
  "headers": {
    "4": "The usual suspects"
  },
  "links": {
    "internet": "https://www.techradar.com/news/internet",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "instant messaging": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "online shopping": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "The Register": "https://www.theregister.com/2021/08/30/china_billionth_netizen/"
  }
}