{
  "source": "https://www.techradar.com/news/cant-afford-philips-hue-this-floor-lamp-lights-up-your-smart-home-on-the-cheap",
  "title": "Can’t afford Philips Hue? This floor lamp lights up your smart home on the cheap",
  "category": "smart-home",
  "updated": "2021-06-18T08:04:05Z",
  "author": "rhys-wood",
  "summary": "The Govee Lyra illuminates for less",
  "article": [
    "Smart home device maker Govee has announced the Lyra, a new floor lamp from the company that offers millions of color options alongside numerous creative flourishes. This could make the lamp a more accessible alternative to a Philips Hue setup.",
    "The Govee Lyra will be available to buy on the company’s website on June 20 for $149 (around £109 / AU$199). A Govee spokesperson told TechRadar that “Lyra will be available to purchase on the UK market in the next few months,\" while adding that UK pricing would be \"the same as in the US\" (so, likely £149).",
    "With the Lyra debuting on June 20, then, it’s unlikely that the smart home device will make an appearance during Amazon’s Prime Day 2021 sales. It certainly could be one to look out for after the fact, however, as a potential alternative to expensive (and increasingly hard to come by) Philips Hue products, like the broadly sold-out Signe floor lamp.",
    "The Govee Lyra features some novel modes that could make it a unique smart home fixture. Chief among them is fully customizable RGBIC tech. This means that the device can display a wide range of ultra bright colors all on a single light strip. Users can also choose from a total of 16 million colors that, similar to Philips Hue, means you should be able to match the lighting to the current mood and/or setting.",
    "The Lyra can mix things up with 25 different lighting effects to suit your surroundings. However, perhaps more interesting is its compatibility with Govee’s Home app. Here, you can finger sketch your own light patterns and, intriguingly, share them with the wider community that use the app for them to download and try out themselves.",
    "Finally, the Govee Lyra also features reactive music modes that sync up to your favorite playlists, as well as compatibility with voice assistants like Alexa and Google Assistant. All round, it’s possible that the Govee Lyra could make for a solid entry-level smart home lamp that – for its robust feature set – comes at a fairly affordable price when compared to the more expensive Philips Hue range."
  ],
  "headers": {
    "3": "Is it right for hue?"
  },
  "links": {
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Alexa": "https://www.techradar.com/best/80-amazon-alexa-easter-eggs-fun-tips-and-tricks-for-your-echo-speaker",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you"
  }
}