{
  "source": "https://www.techradar.com/news/cloud-spending-toppled-on-prem-data-centers-in-2020-for-the-first-time",
  "title": "Cloud spending toppled on-prem data centers in 2020 for the first time",
  "category": "computing",
  "updated": "2021-03-22T10:42:08Z",
  "author": "mayank-sharma",
  "summary": "Pandemic accelerated trend towards cloud",
  "article": [
    "Enterprises increased their spending on cloud infrastructure by almost 35% to reach almost $130 billion in 2020, far outpacing their spending on on-prem data centers, according to a new research.",
    "While an increasing number of businesses had been steadily increasing their reliance on cloud computing services, the pandemic seems to have accelerated the momentum.",
    "The findings from Synergy Research Group comes on the heels of forecasts by data and analytics company GlobalData, which suggests that cloud data centers will soon become as indispensable as any other utility.",
    "“60% of the servers now being sold are going into cloud providers’ data centers and not those of enterprises,” said John Dinsdale, a Chief Analyst at Synergy Research Group, confirming the trend.",
    "The trend towards the move to the public cloud is very apparent looking at historic data pooled by the research. 2019 was the first time when the spending on cloud platforms edged past the resources spent on acquiring servers and software for on-prem data centers.",
    "In 2020, the gap between the two has widened quite dramatically with enterprise spending on data center hardware and software dropping by 6% to under $90 billion in 2020.",
    "“Clearly companies have been voting with their wallets on what makes the most sense for them,” says Dinsdale.",
    "While Dinsdale doesn’t expect to see such a dramatic decline in the spending on enterprise data centers over the next half a decade, the growth for the cloud infrastructure will continue to accelerate aggressively he believes.",
    "Via: TechCrunch"
  ],
  "headers": {
    "4": "The rise of the cloud"
  },
  "links": {
    "cloud infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "forecasts": "https://www.techradar.com/news/data-centre-industry-to-become-trillion-dollar-fifth-utility-by-end-of-decade",
    "cloud providers’": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "cloud platforms": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "TechCrunch": "https://techcrunch.com/2021/03/19/cloud-infrastructure-spending-passed-on-prem-data-centers-in-2020/"
  }
}