{
  "source": "https://www.techradar.com/news/zoom-escaper-give-you-the-perfect-excuse-to-bail-out-of-your-next-video-call",
  "title": "Zoom Escaper gives you the perfect excuse to bail out of your next video call",
  "category": "computing",
  "updated": "2021-03-20T11:10:04Z",
  "author": "joel-khalili",
  "summary": "If you’re looking to make a swift exit from your next Zoom call, here’s how",
  "article": [
    "At this stage of the pandemic, Zoom calls have lost almost all of their original novelty appeal. But thanks to a new tool called Zoom Escaper, it’s now easier than ever to drop out of a video call without having to come up with an excuse.",
    "As per the website, Zoom Escaper is designed to “help you escape Zoom meetings and other video conferencing scenarios. It allows you to self-sabotage your audio stream, making your presence unbearable to others”.",
    "By following a few simple steps, users can apply interference to their own audio feed, such as echo or connection choppiness. Beyond these more traditional effects, the tool can also feed the sound of an upset baby, crying man or barking dog through the user’s microphone. It can even simulate the sound of urination.",
    "Developer Sam Lavigne is also responsible for another similar utility, called Zoom Deleter. The program “continually checks for the presence of Zoom on your computer and, if found, immediately deletes it.”",
    "Almost a year since lockdown measures substituted in-person interaction for virtual forms of communication, collective video conferencing fatigue is only growing more acute.",
    "At the start of the pandemic, people gorged themselves on Zoom calls for every possible purpose, from business meetings and family catch-ups to exercise classes, virtual quizzes and more. Some people even held their weddings over Zoom. But now, the phrase “let’s jump on a Zoom call” is enough to send a shiver down the spine.",
    "However, by torturing the ears drums of fellow attendees, Zoom Escaper offers an excellent route out of drawn out video conferencing sessions, whilst also allowing the user to save face (unless they opt for one of the more eccentric audio effects).",
    "The comments section of the Zoom Escaper video tutorial is filled with praise for the creation. One commenter called for Lavigne to be given a Nobel prize, another referred to the creation as “genius”, and a third pointed out that “not all heroes wear capes”.",
    "The main caveat, however, is that the more popular the tool becomes and the greater its notoriety, the less effective it is likely to be. So, you’d better make use of it while you can."
  ],
  "headers": {
    "4": "Zoom fatigue"
  },
  "links": {
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "Zoom Escaper": "https://zoomescaper.com/",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Zoom Escaper video tutorial": "https://www.youtube.com/watch?v=r_LhwsMAaAc"
  }
}