{
  "source": "https://www.techradar.com/news/hdds-are-enjoying-a-mini-renaissance",
  "title": "HDDs are enjoying a mini-renaissance",
  "category": "computing",
  "updated": "2021-08-17T22:33:08Z",
  "author": "anthony-spadafora",
  "summary": "67.6m HDDs were shipped during the second quarter of 2021",
  "article": [
    "Despite fact that most laptops and desktop PCs now ship with solid state drives (SSDs), hard disk drives (HDDs) saw a resurgence in sales during the second quarter of this year.",
    "According to a new report from Trendfocus, Seagate, Toshiba and Western Digital shipped a record of 350.7 exabytes of HDD storage during Q2 2021. However, while Seagate retained the top spot, Western Digital almost managed to catch up with more than nine percent quarter over quarter growth.",
    "A total of 67.6m HDDs were shipped during the second quarter of 2021 according to Trendfocus' data though Nidec, which is the world's largest independent producer of hard drive motors, estimates that the industry shipped 64m units during the second quarter though the difference between both companies' figures is currently hard to explain.",
    "One possible explanation is due to the fact that two out of the three largest HDD suppliers do not publish detailed unit shipments while only one publishes exabyte shipments according to Tom's Hardware.",
    "When it comes to the number of HDDs shipped during Q2, Seagate shipped 28.17m while Western Digital came close to its biggest rival in the space with 25.4m units shipped and Toshiba shipped 13.98m. As a result Seagate has a 41 percent market share followed by Western Digital with 37 percent and Toshiba at 20 percent.",
    "In a press release detailing how Toshiba's nearline HDDs were able to set new records in Q2, VP at Trendfocus John Chen provided further insight on why demand for HDDs rose last quarter, saying:",
    "\"Demand for HDDs, specifically Nearline HDDs, have been on an upward trend due to strong cloud and OEM demand, while the initial launch of the Chia cryptocurrency fueled new incremental channel requirements.”",
    "Although the storage-based cryptocurrency Chia helped increase demand somewhat, nearline and enterprise HDD demand was actually responsible for increased shipments of HDDS during the second quarter.",
    "Via Tom's Hardware"
  ],
  "headers": {
    "4": "HDD resurgence"
  },
  "links": {
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "HDDs": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "Trendfocus": "https://www.techradar.com/news/phsions-new-ssd-platform-enables-unprecedented-capacities-in-a-25-inch-form-factor",
    "Seagate": "https://www.techradar.com/news/seagate-may-have-just-unveiled-the-worlds-fastest-hdd",
    "Western Digital": "https://www.techradar.com/news/western-digital-ships-16tb-and-18tb-eamr-hard-drives-preps-20tb-hdds",
    "Nidec": "https://www.nidec.com/-/media/www-nidec-com/ir/news/2021/0721-01/210721-01e.pdf",
    "Tom's Hardware": "https://www.tomshardware.com/uk/news/hdd-shipments-in-q2-2021",
    "press release": "https://www.businesswire.com/news/home/20210809005605/en/Toshiba-Nearline-HDD-Shipment-Capacity-Sets-New-Company-Record-In-2CQ21",
    "Chia": "https://www.techradar.com/news/exclusive-seagate-exploring-possible-new-line-of-crypto-specific-hard-drives"
  }
}