{
  "source": "https://www.techradar.com/news/thoma-bravo-is-buying-proofpoint-in-dollar123-billion-all-cash-deal",
  "title": "Thoma Bravo is buying Proofpoint in a $12.3 billion all-cash deal",
  "category": "computing",
  "updated": "2021-04-26T23:30:09Z",
  "author": "anthony-spadafora",
  "summary": "Proofpoint will become a private company once the deal closes",
  "article": [
    "The cybersecurity and compliance firm Proofpoint has announced that it has entered into a definitive agreement to be acquired by Thoma Bravo in an all-cash transaction which values the company at approximately $12.3bn.",
    "Under the terms of the agreement, Proofpoint shareholders will receive $176 per share in cash and this represents a 34 percent premium over the company's closing share price on April 23.",
    "Chairman and CEO of Proofpoint, Gary Steele explained in a press release how the deal is a testament to its successes over the past few years with 2020 marking a high point for the company, saying:",
    "“Today’s announcement is a testament to the strength of Proofpoint’s people-centric approach to cybersecurity and compliance and underscores our important role preventing, defending and responding to today’s threats. We have made tremendous strides in expanding the sophistication and scale of our offerings, and in 2020 we generated more than $1 billion in annual revenue – making Proofpoint the first SaaS-based cybersecurity and compliance company to reach that milestone.”",
    "Once the deal is complete, Proofpoint will become a private company and will be delisted from the NASDAQ exchange where its shares have been traded since it first went public back in 2012 following its IPO.",
    "The firm will continue to protect people and organizations around the world though it will now benefit from the operating capabilities, capital support and deep sector expertise of Thoma Bravo. Managing partner at Thoma Bravo, Seth Boro believes that Proofpoint will have even more room to grow as a public company, saying:",
    "“Proofpoint’s opportunity as a privately held company is incredibly compelling, and we look forward to working closely with them to drive continued business growth and deliver world-class advanced threat protection to even more customers in even more ways.”",
    "This is Thoma Bravo's second major acquisition in the cybersecurity space in recent years as back in 2019, the firm acquired Sophos for $3.9bn."
  ],
  "headers": {
    "4": "Proofpoint acquisition"
  },
  "links": {
    "Proofpoint": "https://www.techradar.com/news/phishing-threats-return-ahead-of-tax-season-in-the-us",
    "Thoma Bravo": "https://www.techradar.com/news/mailgun-acquires-mailjet-to-expand-its-end-to-end-email-platform",
    "press release": "https://www.proofpoint.com/us/newsroom/press-releases/proofpoint-enters-definitive-agreement-be-acquired-thoma-bravo-123-billion",
    "NASDAQ": "https://www.techradar.com/news/sec-steps-in-to-prevent-investors-from-buying-the-wrong-zoom",
    "acquired Sophos for $3.9bn": "https://www.techradar.com/news/sophos-sold-in-dollar39bn-deal"
  }
}