{
  "source": "https://www.techradar.com/news/garmins-latest-watch-is-built-specially-for-divers-and-runners-surfers-climbers",
  "title": "Garmin's latest watch is built specially for divers (and runners, surfers, climbers...)",
  "category": "fitness",
  "updated": "2021-05-25T09:09:50.773Z",
  "author": "cat-ellis",
  "summary": "For below and above the surface",
  "article": [
    "Garmin has launched a new compact diving watch specifically for women and those with smaller wrists, with features for both underwater and on dry land.",
    "Although perhaps best known for its GPS running watches and cycle computers, Garmin also has a long history of making equipment for watersports, including sailing, fishing, and diving.",
    "The original Descent dive computer launched in 2017, and was followed by the Descent Mk2 in 2020. The latest addition to the line packs the same features as the Mk2 into a much smaller case, measuring 43mm in diameter compared to the original watch's 52mm.",
    "The watch supports single and multiple gas dives, marks entry and exit points using GPS and GLONASS, and features an underwater three-axis compass for navigation. It stores data from up to 200 dives, which also sync with the Garmin Dive app.",
    "On dry land, the Descent Mk2S offers most of the same features as the Garmin Fenix 6 (which is also available in both large and small versions).",
    "In addition to all the usual sports tracking modes, such as cycling, running, swimming, skiing and golfing, it also offers several new sports profiles not included with the original Mk2, such as surfing (with tracking for maximum speed and longest wave) and indoor climbing (including vertical distance climbed and number of routes).",
    "Garmin has been expanding its range of smaller watches in recent years, with 'S' versions of many of its most popular models. These include the Fenix, Forerunner and Vivoactive lines, plus the recently released Garmin Venu 2.",
    "It's also been gradually adding more features specifically for women. Earlier this year the company launched the female-focused Garmin Lily, but its mainstream sports watches like the Descent Mk2S. Menstrual tracking and pregnancy tracking have been part of the company's mobile app for some time now, but the new watch is Garmin's first dive computer to include them both as standard.",
    "The Descent Mk2S is available now direct from Garmin for $999.99 / £949.99 / AU$1,499 – slightly less than the original 52mm Descent Mk2."
  ],
  "headers": {
    "6": "That shrinking feeling"
  },
  "links": {
    "running watches": "https://www.techradar.com/best/running-watches",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Garmin Venu 2": "https://www.techradar.com/reviews/garmin-venu-2",
    "Garmin Lily": "https://www.techradar.com/reviews/garmin-lily",
    "direct from Garmin": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8286245829685674000/https://buy.garmin.com/en-US/US/p/701618"
  }
}