{
  "source": "https://www.techradar.com/news/oneplus-9-specs-leak-shows-disappointing-lack-of-upgrades-from-oneplus-8-and-8t",
  "title": "OnePlus 9 specs leak shows disappointing lack of upgrades from OnePlus 8 and 8T",
  "category": "phones",
  "updated": "2021-02-19T15:59:30Z",
  "author": "tom-bedford",
  "summary": "OnePlus 9 Pro is the one to watch, then.",
  "article": [
    "While we've heard lots of OnePlus 9 leaks before, a new one covers loads of different specs of the upcoming OnePlus phone. However instead of getting us excited, this new leak suggests the phone won't get many upgrades over its predecessors.",
    "This new OnePlus 9 leak comes from @TechDroider, who has shown themselves to be fairly reliable for smartphone news. The Twitter user has posted four screenshots, seemingly from a smartphone, that purportedly show the specs of the OnePlus 9.",
    "Most of the specs shown, which we'll investigate below, seem the same as the specs of the OnePlus 8 and OnePlus 8T from 2020. It's worth pointing out that this list doesn't detail every aspect of the OnePlus 9, so there might be some yet-to-be-revealed details that renew enthusiasm in the phone - or perhaps the handset's design or feature list will include some big changes.",
    "But if this list is representative of the OnePlus 9 as a whole, we might have to save our interest for the OnePlus 9 Pro, which will hopefully bring big upgrades over the OnePlus 8 Pro.",
    "TechDroider's leaked spec list includes lots of information which isn't too useful to us, or is perhaps a bit too technical, so we've reduced it to the most important specs and listed them below, alongside the equivalents for the OnePlus 8 and 8T.",
    "It seems the OnePlus 9 camera resolutions are lower than we'd expect, so the resolutions listed are likely after quad pixel binning, which combines four pixels together to create a super-pixel to take better pictures. As a result, we expect the actual resolution of the front and back cameras are four times higher, and we've listed the results in those boxes.",
    "The rear camera resolution seemingly only lists the main camera, not any extra sensors or lenses.",
    "Overall, though, it seems the OnePlus 9 has the same specs as the OnePlus 8T, and very similar ones to the OnePlus 8 - the difference between the 8 and the 8T was largely in the design department.",
    "Hopefully when the OnePlus 9 phone is unveiled - likely sometime in March or April - we'll find out some more specs that differentiate the new phone from its predecessors in some larger way."
  ],
  "headers": {
    "4": "OnePlus 9 specs"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "@TechDroider": "https://twitter.com/techdroider/status/1362642536578256897",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro"
  }
}