{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-disney-plus-hbo-max-and-more-this-weekend",
  "title": "7 new movies and TV shows on Netflix, Disney Plus, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-04-27T10:24:51Z",
  "author": "samuel-roberts",
  "summary": "What's worth streaming over the next few days?",
  "article": [
    "Wondering what's new on Netflix and company this weekend? Well, the past week has been a particularly sporty affair. We’ve had the riotous rejection of new football (sorry, soccer) proposals, major Formula One crashes and the smashing of long-standing basketball records, to name just a few news-hogging incidents.",
    "You’ll be relieved to learn, then, that the likes of Netflix, HBO Max and Disney Plus have decided to leave the sports drama to reality and opt for a decidedly fantastical crop of new movies and TV shows headed for their respective streaming services. And yes, we’re mostly talking about Mortal Kombat.",
    "In addition to that head-rolling, limb-chopping action flick, though, below we round up seven of the biggest highlights coming to streamers this weekend – from magical epics to relaxing nature documentaries. We'll explain how to stream each one in the US and the UK, too.",
    "The week's big movie, HBO Max treats its subscribers to another limited-time brand new release at the same time it theaters in the US – following in the footsteps of Godzilla Vs Kong and Wonder Woman 1984. This adaptation of the Mortal Kombat fighting games hasn't exactly dazzled critics, but it has plenty of the violence and overall silly vibes the series is well-known for. Check out our features on Mortal Kombat's ending and potential sequels when you're done watching.",
    "We're not sure when you'll be able to watch it in the UK, unfortunately – or how.",
    "Now streaming on HBO Max in the US",
    "A passenger inadvertently boards a spaceship heading for Mars, and after a series of incidents, it becomes clear there's not enough oxygen for everyone to survive in this new Netflix thriller. Familiar faces in this one include Daniel Dae Kim, Toni Collette and Anna Kendrick. Critics mostly like Stowaway – it's at 77% positive on Rotten Tomatoes right now, so it's worth a look this weekend if the premise grabs you.",
    "Now streaming on Netflix",
    "This Netflix TV adaptation of the Grishaverse – a series of YA fantasy books by author Leigh Bardugo – makes a few changes to the source material that's actually welcome. It's essentially a story about a young woman who wields great power, and has the ability to help stop a dark power that divides her world, but there's much more to it than that – and a vast cast of characters to meet. Check out our Shadow and Bone review for more, as well as our interview with the show's creators for more on why it's worth a watch this weekend.",
    "Now streaming on Netflix",
    "The acclaimed, Emmy-nominated sketch show returns to HBO for another season after an almost two-year, pandemic-induced wait. Critics have praised the show's rapid-fire jokes and the chemistry of the show's cast – the trailer above features plenty of solid laughs and fun-looking skits.",
    "It looks like UK viewers will be able to watch it on Sky beginning on April 26, but US viewers can stream it this weekend.",
    "Available on HBO Max from Saturday, airing on HBO Friday 11PM",
    "Three years of filming went into this whale-related documentary on Disney Plus, which you can stream now on the service. Learn about how whales behave with the aid of gorgeous underwater photography in this four-part series that's executive produced by James Cameron – it might make a nice contrast to just using Disney Plus to binge Simpsons episodes or Marvel content.",
    "Now streaming on Disney Plus",
    "Marvel's second Disney Plus show wraps up this weekend. While it's been a mixed affair compared to the more consistent WandaVision, The Falcon and the Winter Soldier has done its best to throw Sam Wilson and Bucky Barnes into a global-feeling adventure – it's just been weighed down by a few too many characters. You've got just over a month off MCU shows until Loki arrives in June.",
    "Now streaming on Disney Plus",
    "This new documentary series presented by the legendary David Attenborough explores the different ways animals use color – to attract mates, or escape from predators that want to eat them. There are all kinds of reasons, basically. This show uses new cameras to show how animals see color in the wild, so expect a treat for the eyes.",
    "Now streaming on Netflix in the US and BBC iPlayer in the UK"
  ],
  "headers": {
    "3": "Mortal Kombat (HBO Max)",
    "6": "Stowaway (Netflix)",
    "8": "Shadow and Bone (Netflix)",
    "10": "A Black Lady Sketch Show (HBO Max)",
    "13": "Secrets of the Whales (Disney Plus)",
    "15": "The Falcon and the Winter Soldier episode 6 (Disney Plus)",
    "17": "Life in Colour with David Attenborough (Netflix)"
  },
  "links": {
    "Mortal Kombat": "https://www.techradar.com/news/how-to-watch-mortal-kombat-online-see-where-to-stream-new-movie",
    "Mortal Kombat's ending": "https://www.techradar.com/news/mortal-kombat-ending-explained-who-is-cole-young",
    "potential sequels": "https://www.techradar.com/news/mortal-kombat-may-get-a-sequel-but-what-does-it-depend-on",
    "Shadow and Bone review": "https://www.techradar.com/news/netflixs-shadow-and-bone-is-a-faithful-fantasy-tv-adaptation-to-rival-the-witcher",
    "interview with the show's creators": "https://www.techradar.com/news/netflixs-shadow-and-bone-is-a-faithful-fantasy-tv-adaptation-to-rival-the-witcher/news/shadow-and-bone-is-netflixs-new-fantasy-series-that-borrows-from-doctor-strange",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more"
  }
}