{
  "source": "https://www.techradar.com/news/epic-amazon-sale-has-blink-home-security-camera-deals-starting-at-just-dollar2499",
  "title": "Epic Amazon sale has Blink home security camera deals starting at just $24.99",
  "category": "smart-home",
  "updated": "2021-09-08T13:07:43Z",
  "author": "mackenzie-frazier",
  "summary": "Record-low prices on Amazon's Blink home security cameras",
  "article": [
    "Secure your home and save money from today's Amazon sale, which includes incredible deals on the Blink home security camera. You can score record-low prices on the Blink indoor and outdoor security cameras and the all-new Blink Mini.",
    "The Blink security cameras provide security to your home day and night with built-in infrared night vision, customizable motion detection, and live view recording. You'll get alerts sent to your smartphone when motion is detected so you can monitor your home from anywhere. The Blink cameras also feature two-way audio so you can see, hear and speak to people in your home and work with Amazon Alexa for hands-free control. Discounts on the Blink security cameras are rare, and we won't see record-low prices like this until the upcoming Black Friday deals event. We don't know how long Amazon will have the Blink cameras on sale, so you should take advantage now before it's too late.",
    "You can find more home security sales with the best cheap home security camera deals that are currently available. You can also shop more smart home deals with the best cheap smart home devices and gadget deals. You can also look forward to upcoming offers during the 2021 Black Friday deals event."
  ],
  "headers": {
    "1": "Amazon Blink home security camera deals",
    "2": "More Blink security camera deals"
  },
  "links": {
    "Amazon sale": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts",
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "best cheap home security camera deals": "https://www.techradar.com/deals/the-best-home-security-camera-deals",
    "best cheap smart home devices and gadget deals": "https://www.techradar.com/news/the-best-cheap-smart-home-gadgets-of-2019"
  }
}