{
  "source": "https://www.techradar.com/news/hyperx-unleashes-a-compact-but-perfectly-formed-mechanical-gaming-keyboard",
  "title": "HyperX unleashes a compact but perfectly formed mechanical gaming keyboard",
  "category": "computing",
  "updated": "2021-02-17T15:31:50Z",
  "author": "darren-allan",
  "summary": "Alloy Origins 60 is small and pretty affordable to boot",
  "article": [
    "HyperX has revealed a new compact gaming keyboard as part of the virtual CES 2021 event, as well as making announcements on a bunch of other peripherals that are becoming available globally.",
    "HyperX’s Alloy Origins 60 mechanical gaming keyboard is only 60% of the size of a standard keyboard (hence the numerical reference in the name), which means it will easily fit on your desk. Moreover, your mouse and keyboard will be closer together, and therefore more comfortable to use.",
    "We have a small tenkeyless (meaning it does away with the number pad) keyboard ourselves, and find it great in terms of comfort, but the Alloy Origins 60 goes further, also doing away with the other blocks of keys on the right (arrow keys, page up and down, etc – all those functions are still present, mind you, but as secondary functions on other keys).",
    "As well as its space-saving nature, HyperX’s keyboard benefits from red mechanical switches which have a shorter actuation point and travel time, meaning they are responsive to your demands when playing fast action games like shooters (even if they might not be quite so ideal for typing – although as ever, keyboard action is a subjective thing).",
    "The Alloy Origins 60 also provides LED lighting (which can be customized – you can also set up individual profiles and macros), and PBT double-shot keycaps (meaning even after heavy use over the years, the key characters won’t start to fade away).",
    "The Alloy Origins 60 mechanical gaming keyboard will retail at $99.99 direct from HyperX and will go on sale in the US and Europe from February 22.",
    "HyperX also announced that its Pulsefire Haste Gaming Mouse, Cloud II Wireless Gaming Headset and Cloud Revolver Gaming Headset are now out globally, after only being available to buy in the US previously.",
    "The Pulsefire Haste Gaming Mouse will be on sale in Europe from today priced at £49.99 or €59.99 in the HyperX online store, as will the Cloud Revolver Gaming Headset priced at £139.99 or €159.99. The Cloud II Wireless Gaming Headset will also be available from today in the UK at £149.99, with it coming to Europe in February at €169.99.",
    "Finally, HyperX also unveiled a charging station for Microsoft’s Xbox consoles. The ChargePlay Duo is for Xbox Series X/S and Xbox One wireless controllers, featuring a design facilitating the quick docking of controllers, and two 1400mAH rechargeable battery packs. It’ll be out in the US in February costing $39.99."
  ],
  "headers": {
    "6": "Gaming mouse and headsets"
  },
  "links": {
    "gaming keyboard": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights"
  }
}