{
  "source": "https://www.techradar.com/news/bts-new-cybersecurity-solution-is-based-on-the-study-of-human-viruses",
  "title": "BT's new cybersecurity solution is based on the study of human viruses",
  "category": "computing",
  "updated": "2021-11-15T15:10:43Z",
  "author": "mayank-sharma",
  "summary": "BT claims its solution can prevent cyberattacks before they compromise a network",
  "article": [
    "BT has developed a new cybersecurity prototype that it claims uses the spread of viruses in humans to inform its artificial intelligence (AI) model.",
    "Dubbed Inflame, BT says that its epidemiology-based prototype uses deep reinforcement learning to enable businesses to automatically detect and respond to cyberattacks before they compromise a network.",
    "“Epidemiological testing has played a vital role in curbing the spread of infection during the pandemic, and Inflame uses the same principles to understand how current and future digital viruses spread through networks,” says Howard Watson, Chief Technology Officer, BT.",
    "BT says Inflame, which will be offered as part of its Eagle-i cyber defense platform. uses the principles of epidemiology to understand how computer viruses and cyberattacks spread across enterprise networks in order to prevent them from happening in the first place.",
    "To develop the technology, security researchers at the BT Labs in Ipswich, UK, first built models of enterprise networks that were then used to test various scenarios based on differing R rates of the cyber-infection. The R rate in epidemiology helps quantify the spread of infectious diseases in a population, explains BT.",
    "Thanks to this testing, the researchers were able to understand how the threats penetrate and compromise a network, which helped them develop optimal automated responses that could contain and prevent the spread of viruses.",
    "Furthermore, BT adds that these responses were underpinned by ‘attack lifecycle’ modelling, which assesses real-time security alerts against established patterns in order to understand the current stage of an ongoing cyberattack.",
    "This insight, BT claims, helps the prototype predict the next stages of an attack, which it uses to identify the best response that will prevent the attack from progressing any further.",
    "Meanwhile, you can use these best firewall apps and services to build a digital moat around your network, and protect your computers with these best antivirus software"
  ],
  "headers": {
    "4": "Inspired by the pandemic"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "BT": "https://www.techradar.com/broadband/bt-broadband-deals",
    "best firewall apps and services": "https://www.techradar.com/best/firewall",
    "best antivirus software": "https://www.techradar.com/best/best-antivirus"
  }
}