{
  "source": "https://www.techradar.com/news/amd-cpu-sales-get-even-stronger-as-ryzen-5000-stock-issues-ease",
  "title": "AMD CPU sales get even stronger as Ryzen 5000 stock issues ease",
  "category": "computing",
  "updated": "2021-01-08T20:05:12Z",
  "author": "darren-allan",
  "summary": "Going by stats from just a single European retailer, mind you",
  "article": [
    "AMD’s Ryzen processors are going from strength to strength following the launch of Ryzen 5000 CPUs, at least according to the latest figures from one German retailer.",
    "Mindfactory’s sales figures are reported every month by Redditor Ingebor, and for December 2020, AMD managed to creep up towards the 40,000 units mark, taking a healthy step on from the 35,000 units recorded in November – which was already a big leap on previous months in 2020.",
    "In terms of market share for units sold, AMD held a very dominant 83%, although that was actually slightly down on the 85% market share witnessed in the previous month. However, AMD pushed forward when it came to revenue, grabbing 86% of the cash being splashed on processors at Mindfactory, up a percentage point on November.",
    "As Ingebor observes, this could point to a softening of Intel’s asking prices – albeit a very slight one – while AMD is driving home its obvious current advantage with desktop silicon (Intel really needs Rocket Lake to arrive in a hurry – theoretically 11th-gen chips should be here in March, most likely).",
    "The bestselling AMD chips are the new Ryzen 5000 models and Ryzen 3000 processors, with the latter still accounting for the majority, with 54% of CPUs sold in December. Ryzen 5000 grabbed a 26% share of units shifted, meaning these models represented 80% of sales in total.",
    "Ingebor notes that Ryzen 5000 stock was better in December, although there were still shortages that held sales back, at least with the top-end models, AMD’s Ryzen 5900X and 5950X. The 5600X and 5800X both benefited from better stock levels (and indeed are in stock at Mindfactory at the time of writing).",
    "In terms of individual sales, the Ryzen 3600 has been knocked off its perch as the top seller in November, and is now back in third position, with December’s figures showing that the Ryzen 5600X is now selling slightly more – but both are beaten out by the Ryzen 3700X which is the number one CPU for Mindfactory. Intel’s bestselling processor also changed, with the Core i5-10400F narrowly dethroning the 10700K – but both were way back in positions 12 and 13 respectively, with AMD owning the entire top 10.",
    "Interestingly, having a quick peek at the bestselling processors over at Amazon US, that top 10 is also dominated by AMD, with the Ryzen 3600 topping the charts – and Intel only managing one entry, with the older Core i7-9700K (Coffee Lake Refresh) which takes fourth place.",
    "Via Wccftech"
  ],
  "headers": {
    "5": "Ryzen 5000 stock improving"
  },
  "links": {
    "AMD’s Ryzen processors": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Ryzen 5000 CPUs": "https://www.techradar.com/news/amd-ryzen-5000",
    "35,000 units recorded in November": "https://www.techradar.com/news/amd-cpu-sales-skyrocket-with-ryzen-5000-launch-leaving-intel-in-the-dust",
    "Ingebor observes": "https://imgur.com/gallery/Uvor6ep#8EMeiCZ",
    "11th-gen chips should be here in March": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "10700K": "https://www.techradar.com/news/intel-core-i7-10700k-vs-intel-core-i7-9700k-how-does-intels-10th-gen-chip-stack-up",
    "Wccftech": "https://wccftech.com/amds-ryzen-5000-ryzen-3000zen-3-zen-2-desktop-cpus-demolish-all-sales-records/"
  }
}