{
  "source": "https://www.techradar.com/news/facebook-is-hiring-10000-new-workers-to-help-build-the-metaverse",
  "title": "Facebook is hiring 10,000 new workers to help build the metaverse",
  "category": "computing",
  "updated": "2021-10-18T12:18:28Z",
  "author": "sead-fadilpasic",
  "summary": "Facebook betting big on the virtual realm",
  "article": [
    "Facebook is looking to hire some 10,000 new employees to help it build its own “metaverse”.",
    "While the “metaverse” itself does seem to be the upcoming trend across the globe (numerous other companies, including Microsoft, have said to be working on their own versions, too), some in the media have dubbed Facebook’s latest move as more of a PR stunt.",
    "The social media giant is tapping into the EU talent pool for its new recruitment, looking for “highly skilled” engineers across the bloc - including in France, Germany, Ireland, Italy, the Netherlands, Poland and Spain.",
    "Further explaining its reasoning behind choosing the EU, Facebook said the large customer base it has there, as well as “bleeding-edge” pros in various fields, were the key motivators. “First-class” university education, as well as EU’s \"leading\" policies on issues like freedom of speech, privacy, and transparency, were also mentioned.",
    "Facebook also took the opportunity to “remind” the EU of its financial contribution to the bloc.",
    "If the mention of the metaverse prompts a question mark over your head, you’re probably not alone. The term was coined to describe virtual reality, in which people would be able to talk, work and collaborate.",
    "It includes numerous devices, virtual reality (VR), and augmented reality, and was made possible with the proliferation of high-detail screens, holograms, VR headsets, and augmented reality glasses.",
    "Facebook has been hinting at a move on the metaverse for quite some time now. This past summer, during a conference call with investors, CEO Mark Zuckerberg described the metaverse as the \"next generation of the internet and next chapter\" for the firm.",
    "Throw in Diem, Facebook’s digital currency, into the mix, and you get a virtual reality realm in which people can meet, collaborate, pay, and get paid - without ever leaving their room/office/country.",
    "Via: Euronews"
  ],
  "headers": {
    "5": "What is the metaverse?"
  },
  "links": {
    "metaverse": "https://www.techradar.com/news/is-the-future-of-online-events-in-the-metaverse",
    "virtual reality": "https://www.techradar.com/news/the-best-vr-headset",
    "Euronews": "https://www.euronews.com/next/2021/10/18/facebook-to-become-a-metaverse-company-as-it-seeks-place-in-sci-fi-future"
  }
}