{
  "source": "https://www.techradar.com/news/iphone-14-pro-looks-even-more-likely-to-have-under-display-face-id",
  "title": "iPhone 14 Pro looks even more likely to have under-display Face ID",
  "category": "phones",
  "updated": "2021-09-09T08:59:47Z",
  "author": "james-rogerson",
  "summary": "But we're still not certain",
  "article": [
    "The iPhone 13 isn’t even here yet, but iPhone 14 leaks are rolling in, and hot on the heels of unofficial renders showing an iPhone 14 Pro Max with no notch, another reputable source has now also suggested that the notch might be on the way out.",
    "Ross Young, a leaker with a good track record – especially when it comes to things related to smartphone displays – tweeted a reminder that he first predicted under-display Face ID for the iPhone 14 Pro and iPhone 14 Pro Max (a move which would allow the company to remove the notch) back in June.",
    "This would seem to suggest that he still believes this is happening, but in a follow-up tweet he clarified that under-display Face ID is apparently still being worked on and isn’t final yet, but that it’s supposedly easier to implement than an under-display camera. So it sounds like he thinks there’s a good chance it could be done in time for the iPhone 14 range.",
    "His mention that it’s easier to achieve than an under-display camera would also explain why the leaked renders show the iPhone 14 Pro Max with a punch-hole camera, rather than bringing everything under the display.",
    "There’s nothing else new here, but Young’s claims back in June included quite detailed specs for the entire iPhone 14 range, as you can see in the tweet above. Notably, Young’s earlier claims include mention of larger batteries, which fits with the thicker design seen in the unofficial renders.",
    "So between these specs and the unofficial renders, we already have a surprisingly good idea of what to expect from Apple’s 2022 phones – if any of this is accurate.",
    "While there are now multiple sources pointing to the possibility of under-display Face ID - and with it the removal of the notch - in the iPhone 14 Pro range, it’s still by no means a certainty.",
    "Young sounds a lot less confident of it than Jon Prosser (the source of the iPhone 14 Pro Max renders), and Apple has never been one to rush things, so if this tech is still being worked on, there’s every chance Apple won’t be happy with it in time for it to land on the iPhone 14 range.",
    "Plus it’s very early for iPhone 14 rumors, so it’s worth being extra skeptical of anything you hear. Early rumors are often wrong, or they’re about details that haven’t yet been finalized (and therefore could change).",
    "That said, it’s clear that Apple wants to head in this direction. Many people are critical of the notch it uses, and the company is expected to shrink this for the iPhone 13 range, so removing it altogether is an obvious next step. It’s just a step that could be tricky, and might therefore be multiple years away.",
    "Via Apple Insider"
  ],
  "headers": {
    "6": "Analysis: this is an obvious direction for Apple, but don’t count on seeing it in 2022"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "unofficial renders": "https://www.techradar.com/news/iphone-14-pro-could-finally-ditch-the-notch",
    "Ross Young": "https://twitter.com/DSCCRoss/status/1435687093930319873",
    "a follow-up tweet": "https://twitter.com/DSCCRoss/status/1435688952241917955",
    "Apple Insider": "https://appleinsider.com/articles/21/09/08/sub-display-face-id-again-tipped-for-iphone-14?utm_medium=rss"
  }
}