{
  "source": "https://www.techradar.com/news/improving-profitability-when-selling-on-amazon",
  "title": "Improving profitability when selling on Amazon",
  "category": "computing",
  "updated": "2021-09-30T14:13:32Z",
  "author": "alan-chester",
  "summary": "Improve sales and profitability when selling on Amazon",
  "article": [
    "Prior to the pandemic, malls were brimming with shoppers wanting to touch and feel products before making a purchase. Since the onset of Covid-19 shopping behaviors have changed, perhaps forever. In fact, in the UK alone, approximately 75% of consumers have swapped the brick and mortar stores of high street for e-shopping. Brands that were solely brick and mortar had to quickly put an eCommerce strategy in place and those that already were selling online needed to up their game. With the change in sales strategies, brands encountered and are still confronting challenges.",
    "Selling more than 12 million products and with 197 million people around the world shopping on Amazon each month, it’s a technology giant that far exceeds its top three competitors combined. Known to be everything for everybody, Amazon is the platform that brands need to be on for an eCommerce presence. However, selling on Amazon isn’t as easy and straightforward as one would assume. In fact, selling on Amazon comes with its own set of challenges that brands need to overcome to remain profitable.",
    "Creating a positive brand image takes time and effort, and while the pandemic may have been the catalyst for many brands to sell online, that doesn’t mean they have to lose control of the brand they worked so hard to create. Nowhere is this more felt than in pricing, regardless of whether a brand is selling direct to Amazon (known as 1st party vendor or 1P) or they’re using the platform to self-retail (3P). For brands that are using the 1P program, Amazon acts as a retailer with the ability to independently implement price adjustments, while 3P brands face stiff competition on both price and reputation. With the possibility of losing control of the brand regardless of the program, many brands are combining 1P and 3P to create a hybrid sales model that enables them to retain pricing autonomy and ultimately gain control of their brand.",
    "It is important to be able to set an average order value (AoV) that aligns with the brand’s pricing strategy. Selling on Amazon results in diminished pricing control, which can negatively affect margins and profitability, sometimes to the point where the brand makes very little, and in some cases no profits on certain items. By putting both short- and long-term plans in place, eCommerce decision makers are seeking to reduce margin pressures, enter new markets, and add new products to their Amazon offerings.",
    "According to Euromonitor International, by 2025 eCommerce is expected to account for half the growth of the global retail sector, expanding by an additional USD 1.4 trillion. It’s only through digital transformation that eCommerce brands will be able to capture unprecedented opportunities to gain more market share and increase profitability. At the helm of driving digital transformation through the eCommerce industry are large organizations like Amazon. To keep pace with the changing eCommerce environment and increasing consumer expectations, brands need to prepare for further technology advancements across artificial intelligence (AI), virtual reality (VR), algorithmic measurement, and control over online sales to improve the digital customer experience.",
    "Although high quality content is an essential for successful trading on Amazon, competing listings mean more brands are looking to advertise. To improve content and listings, a majority of eCommerce decision makers will need to consider increasing their budgets for Amazon Advertising and Demand-side Platform (DSP). By advertising on Amazon, brands are able to decrease sales cycle time, improve brand awareness and product visibility, acquire customer insights for more targeted campaigns, better understand the shoppers’ journey, know when shifts in buyer behavior is taking place, and track advertising results.",
    "Although selling on Amazon has its share of challenges, it is essential for a brand’s long-term survival, and a broader strategy will be needed to increase sales and improve profitability.",
    "While the inherent complexities of Amazon’s platform are creating barriers for brands to reach their goals, the challenges of selling on the Amazon platform aren’t insurmountable. To survive and thrive in the eCommerce world, brands need the right Amazon strategy. For many brands this means harnessing the power of a combined 1P/3P sales strategy.",
    "In order to gain a level of autonomy not afforded by 1P selling alone, an increasing number of brands are turning to a hybrid 1P and 3P model. The flexibility of this approach provides brands with control over their products and pricing, while at the same time enabling them to protect their 1P relationship. As part of this strategy, many brands are partnering with an Amazon specialist to help them take back ownership of their Amazon business and future-proof their business against the ever-changing eCommerce landscape."
  ],
  "headers": {
    "2": "1. Retain control of your brand",
    "3": "2. Use competitive pricing strategies to sustain profitability",
    "4": "3. Embrace the ever changing eCommerce landscape",
    "5": "4. Reach target customers with effective advertisements",
    "7": "Overcome challenges with the right strategies"
  },
  "links": {
    "eCommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Amazon": "https://www.techradar.com/best/best-amazon-fire-tablets",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "virtual reality": "https://www.techradar.com/news/the-best-vr-headset",
    "customer experience": "https://www.techradar.com/best/cx-tools",
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools"
  }
}