{
  "source": "https://www.techradar.com/news/wwdc-2021-three-devs-give-their-thoughts-on-what-was-announced",
  "title": "WWDC 2021: Three devs give their thoughts on what was announced",
  "category": "computing",
  "updated": "2021-06-12T12:00:00Z",
  "author": "daryl-baxter",
  "summary": "Three devs give their verdict",
  "article": [
    "Another year and another WWDC from Apple has concluded, with announcements for iOS 15, macOS 12 Monterey, iPadOS 15 and more.",
    "However, it also means the start of what developers can work with from these new announcements, and figuring out how they can implement these new features into their apps.",
    "We followed up with three developers we talked to from last week to find out what they were excited to hear about from WWDC the most.",
    "Shortened from the term ‘Application Programming Interface’, this is what developers use to create features for their applications. For example, a new ScreenTime API allows developers to have a choice of parental controls for users to pick from, while a GroupActivities allows the new SharePlay feature to be used in other applications as well.",
    "Ben McCarthy, developer of the camera app Obscura, tells us that while there was no Night Mode API, there were some great improvements to other areas. “Swift Concurrency will result in cleaner code, buttons are easier to style, and In-App-Purchases are easier to handle.”",
    "Becky Hansmeyer, the developer of YarnBuddy and Scribblet, also was in praise for Swift this year, the programming language introduced by Apple back in 2014. “I was glad to see a lot of great additions to SwiftUI this year such as native search bars, better accessibility support, and new button styles. I was also really impressed by Object Capture, which allows designers and developers to create photorealistic 3D models by taking a series of photos of an object from every angle.,” she explains.",
    "Shihab Mehboob, developer of Vinyls, Aviary and many more applications, is tempted to drop support for older iOS versions for his apps, as there’s been substantial improvements to how he codes his suite of apps.",
    "“I mentioned wanting new MusicKit APIs, and we got it! Although, it is just a reimagining of the previous Apple Music web API, and doesn’t add anything new.” he tells us. He’s already added some new features to Vinyls and Aviary. “ShazamKit is great! I’ve already added it into my app Vinyls to recognise external music and start playback of it within the app.”",
    "This API allows the Shazam app to be built into apps with iOS 15 and above. There’s also a new user interface function that’s been added to Aviary. “New medium sized sheet detents are great! I’ve already added them to Aviary for the photo picker.”",
    "Finally, Shihab is very glad that Focus and Keyboard shortcuts API’s are official. “These are incredible. This saves me so much work that I was planning to do, but now I don't have to. Again, added it to Aviary already, and it was a breeze to do so.”",
    "While this year’s update was more of a collection of useful refinements, it didn’t stop Hansmeyer from being excited for the focus of privacy and work/life balance. “I loved this focus, with a lot more customization surrounding notifications, Do Not Disturb, photo memories and more.” She tells us. “My favorite feature though is actually Live Text. The ability to copy text, call a phone number, or look up an address from a photo is pretty mind-blowing.”",
    "McCarthy was pleased to see part of his wish come true. “We did get a new sheet style of multi-stage cards, which work like the share sheet. It’s not exactly what I envisioned but this is still a nice improvement.” They explain. “It’ll be great for things like Colour Pickers, allowing you to select a colour without covering what you were doing. Less interrupting. Nice.”",
    "Mehboob is a big fan of the new look for Maps this year, telling me, “They’re also very reminiscent of a Nintendo game, but I wish Apple focused more on bringing basics to other countries before going all-in on one region.”",
    "He’s also a big fan of the new Focus mode for notifications, alongside Live Text. “Whilst it may have existed in other formats and flavours on other platforms already, it seems much more intuitive and quicker on iOS. Coupled with the Apple ecosystem, this is a great new feature to have.”",
    "He’s also glad to see SharePlay arrive, with many still unable to meet family and friends during the pandemic. “SharePlay seems like a big win for the social (and pandemic) era! I wish this was something that existed a while back, but I’m glad we’ve got it now. Also particularly useful for screen sharing with elder family members and helping them out.”",
    "While multitasking and widgets were finally updated for the iPad, it was another refinement release here, but that didn’t mean that Hansmeyer wasn’t glad to finally see these features redesigned. “By far, the highlight of iPadOS 15 for me is the clarity of the multitasking system,” she explains. “There's an obvious focus indicator for the active app, a set of real buttons and keyboard shortcuts for arranging apps on screen, and the ability to easily drag apps from anywhere to enter split screen or replace the current app.”",
    "McCarthy agrees, explaining that multitasking is certainly better than how it was before.",
    "“We didn’t get the multi-display support or customisable keyboard shortcuts, but the improvements to multitasking look superb. I think the iPad still has a way to go to get me to give up my laptop, but I’m more optimistic than ever about its future.”",
    "Mehboob was also in agreement with multitasking in iPadOS 15, explaining how they feel much more natural this time. “They’re much easier to activate and use this time, and coupled with this, we’ve finally got a shelf on iPad! (Although it’s just for app windows within the app itself).” He was also glad to see widgets on the home screen at last explaining, “The ability to place widgets anywhere on the Home Screen is a big win, and despite it coming at the cost of reshuffled icon layout and sizing, I think it’s a welcome addition.”",
    "Finally, he was quick to mention Quick Notes, a feature exclusive to the iPad. “Launching this from the bottom corner of the iPad display is very reminiscent of sticky notes on other platforms, and will be great for quickly jotting things down.”",
    "Another refinement release for macOS this year, which isn’t a surprise after last year’s Big Sur release brought a redesigned user interface, and support for Apple Silicon chips. However, for developers, Apple was sure to dedicate part of Monday’s keynote to them, announcing some big features.",
    "“After last year's big redesign, I'm glad Apple went a little lighter on the new macOS features this year.” Hansmeyer tells us. “But I’m also excited because I got my two big wishes, Shortcuts and TestFlight on the Mac!”",
    "While there wasn’t a redesign of Notification Center in macOS, McCarthy was glad to see other updates in Monterey. “While I don’t think there were any changes to the layout of Notification Center, there were at least lots of improvements to notifications themselves, helping to prioritise important messages and updates,” they explained. “The new Focus features seem like they’ll be great and I especially appreciate that they sync across devices.”",
    "Mehboob was pleased to see Low Power Mode appear in both iPadOS and macOS Monterey, but it was Universal Control that caught his eye. “This blew my mind, and looks to be another great ‘Apple ecosystem’ addition which unifies all platforms.”",
    "He was also in agreement with Hansmeyer about Shortcuts, telling us that “Having them on macOS is great! I’m so glad that we’re finally getting them there now, and slowly phasing out Automator.”",
    "Finally, seeing AirPlay on the Mac was another good feature Mehboob was pleased to see, as “Being able to AirPlay to a Mac from an iPhone or an iPad is great! I think this is the closest we’ll come to Target Display Mode now.”",
    "A week on, the consensus from the developers we spoke to is that we did indeed see more refinements than anything else from Apple at this year’s WWDC, with a big focus on notifications and privacy. While iPadOS 15 wasn’t the huge improvement some were hoping for, it did finally bring widgets to the home screen properly, while TestFlight for Mac is a big win for developers in helping their apps be tested much more easily on macOS now.",
    "As we look back on WWDC this year, it looks as though Apple is giving developers more ways to give users better privacy and refined choices in how their information is shown. Time will tell whether future beta releases between now and September will show even more refinements, or even features that could disappear, but for a year of refinements, developers have a great pick n’ mix bag of useful features to now implement in their apps."
  ],
  "headers": {
    "3": "API",
    "10": "iOS 15",
    "15": "iPadOS 15",
    "20": "macOS 12 Monterey"
  },
  "links": {
    "we talked to from last week": "https://www.techradar.com/news/apples-wwdc-2021-what-three-iphone-mac-and-ipad-developers-want-to-see",
    "ScreenTime API": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1090369672654734300&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fvideos%2Fplay%2Fwwdc2021%2F10123%2F",
    "GroupActivities": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8390342171270737000&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fdocumentation%2FGroupActivities",
    "developer": "https://twitter.com/JPEGuin",
    "camera app": "https://obscura.studio",
    "Obscura": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3391535632430183000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fid1290342794",
    "YarnBuddy": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1284775982981884000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fyarnbuddy-knit-and-crochet%2Fid1267678125",
    "Scribblet": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4830754404865865000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fscribblet%2Fid1533589690",
    "Vinyls": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1434880542571468800&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fid1556054655",
    "Aviary": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5426014228143128000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fid1522043420",
    "TestFlight": "https://www.techradar.com/news/apples-testflight-finally-comes-to-the-mac-but-what-is-it"
  }
}