{
  "source": "https://www.techradar.com/news/pentax-k-3-mark-iii-could-be-the-last-new-dslr-and-its-priced-accordingly",
  "title": "Pentax K-3 Mark III could be the last new DSLR – and it's priced accordingly",
  "category": "cameras",
  "updated": "2021-04-01T09:31:47Z",
  "author": "mark-wilson",
  "summary": "Rare breed comes with a premium price tag",
  "article": [
    "The Pentax K-3 Mark III DSLR has finally arrived following a drawn-out launch that stretches back to its development announcement in late 2019 – and it might just be the last new DSLR ever made.",
    "The APS-C DSLR was expected to launch at the CP+ camera show in February, but after some issues with product part shortages it's now available to buy – for a not inconsiderable $1,999/ £1,899 body-only price tag.",
    "Why would you spend that much on an APS-C DSLR when you could buy the Sony A7 III with a 28-70mm lens for the same price? It's a tough question to answer, and the K-3 Mark III does indeed appear to be out of step with today's camera tech – unless you're a die-hard DSLR fan with a collection of K-Mount lenses.",
    "To be fair, the K-3 Mark III does serve up a compelling menu of features for those who do prefer the large grips, lengthy battery lives and optical viewfinders of DSLRs to the all-digital shooting experience of mirrorless cameras.",
    "It pairs a new 25.7MP sensor with a Prime V processor, and supports that with an in-body image stabilization system that provides up to 5.5-stops of compensation. The combination of this feature and the K-3 Mark III's ludicrous maximum ISO figure of 1.6 million mean it should, in theory, be something of a low-light monster.",
    "The camera also promises to be competitive in the autofocus stakes, thanks to the combination of an AF system with 101 AF points and some new object-tracking algorithms. Whether or not that can live with the speedy AF systems on similarly-priced mirrorless cameras, which now include features like Bird Eye AF, remains to be seen.",
    "In other ways, the K-3 Mark III is more of a blast from the past. While it does shoot 4K/30p video in Live View, this uses the inferior contrast-only autofocus. Its rear screen is also completely fixed, in contrast to the tilting or fully-articulating screens that make most of today's mirrorless cameras such versatile hybrid shooters.",
    "This feature-set means the Pentax K-3 Mark III is still very much a stills-focused camera – and one that will likely be the last of its kind.",
    "In recent months, we've seen Nikon discontinue two of its most popular entry-level DSLRS – the Nikon D3500 and D5600 – in Japan, before ominously stating that it would \"consider the optimal timing for discontinuation based on the needs of the market and customers.\"",
    "And more recently, we've seen Canon start to discontinue some of its DSLR-friendly EF Mount lenses, such as the 85mm f/1.2L USM II and the 70-200mm f/4L IS USM II.",
    "This is a slight shame for photographers who value having the choice of different tools or prefer the DSLR format – after all, there's still a market for tough, weather-sealed cameras with large grips, otherwise the K-3 Mark III wouldn't exist.",
    "But there's no doubt that all of the major camera manufacturers are transitioning to a mirrorless-only camera world, and the K-3 Mark III's premium price tag is likely to make it a niche choice with so many compelling mirrorless alternatives.",
    "For example, for the same price as Pentax's new DSLR you can get a Fujifilm X-T4 with an XF18-55mm lens (a camera that's currently top of our best camera guide) or a body-only Nikon Z6 II, which combines the benefits of DSLR-style handling with the latest mirrorless tech."
  ],
  "headers": {
    "7": "Photo finish"
  },
  "links": {
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Nikon discontinue two of its most popular entry-level DSLRS": "https://www.techradar.com/news/is-this-the-end-of-the-beginner-dslr-this-nikon-d3500-statement-suggests-so",
    "best camera": "https://www.techradar.com/news/best-camera"
  }
}