{
  "source": "https://www.techradar.com/news/apple-could-have-a-clever-trick-to-ensure-your-macbook-is-always-charged-when-you-need-it",
  "title": "Apple could have a clever trick to ensure your MacBook is always charged when you need it",
  "category": "computing",
  "updated": "2021-02-19T10:14:14Z",
  "author": "darren-allan",
  "summary": "For those who leave their laptop plugged in the majority of the time",
  "article": [
    "Apple might be planning to make macOS Big Sur smart enough to ensure that a MacBook is fully charged up just before the owner is going to be taking off with it for a meeting, at least for folks who often keep their laptop plugged into the mains when using it at home (or work).",
    "This is tied up in the macOS Optimized Battery Charging feature which learns how you use your MacBook, and adjusts how it charges appropriately – meaning that if as mentioned, you’re the kind of user who leaves their notebook plugged in most of the time, the battery will only get charged to 80%. This is because it’s a bad idea to have a constantly fully-charged 100% battery if plugged in a lot, in terms of battery care and longevity.",
    "The downside of the latter scenario is, of course, that if you do unplug your MacBook and go somewhere with it, the portable won’t be at 100%. So, the theory is that the new feature, spotted in the second beta of macOS 11.3 by a MacRumors contributor, Steve Moser, means that the OS will look at scheduled calendar events as part of the battery optimization feature.",
    "If a meeting is indeed present in the calendar on a given day, macOS Big Sur will then be able to ensure that the laptop gets charged to 100% three hours before the event begins (perhaps – the exact timing could be different). You get the idea of what the feature is apparently trying to do, though, and it could certainly make a nifty addition to macOS.",
    "Naturally, the presence of this code in a beta doesn’t mean that this functionality will actually make the cut and be introduced to the release version of macOS Big Sur. It could remain a concept Apple is experimenting with, and nothing more (although even if it doesn’t appear in version 11.3 of Big Sur, it could still turn up further down the line).",
    "Remember that Optimized Battery Charging tailors how your battery will be charged depending on your usage pattern, so it doesn’t limit the charge level with an artificial ceiling in cases where it doesn’t make sense (meaning folks who are constantly on the move with their MacBook, and only plug it in to charge when low on battery).",
    "The battery optimization feature is also optional, so if you don’t want anything messing with your charging settings under any circumstances, you can turn it off (in System Preferences, click on Battery, and you’ll see Optimized Battery Charging under the various settings, where you can untick the box)."
  ],
  "headers": {
    "4": "No promises"
  },
  "links": {
    "macOS Big Sur": "https://www.techradar.com/how-to/macos-11-big-sur-problems-how-to-fix-the-most-common-issues",
    "MacRumors contributor": "https://www.macrumors.com/2021/02/18/macos-11-3-optimized-battery-charging-meetings/",
    "MacBook": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}