{
  "source": "https://www.techradar.com/news/why-do-smart-tvs-make-it-so-hard-to-connect-to-my-headphones",
  "title": "Why do smart TVs make it so hard to connect to my headphones?",
  "category": "televisions",
  "updated": "2021-09-18T16:00:50Z",
  "author": "henry-st-leger",
  "summary": "Sounding the alarm",
  "article": [
    "Another day, another frustrating attempt to connect headphones to a smart TV.",
    "As a TV reviewer, a lot of screens come my way, and the biggest pain of the testing process is no doubt getting my various gear – games consoles, streaming devices, audio accessories, and streaming service accounts – all set up and good to go. And I can’t help but wonder why connecting wireless headphones, in particular, is usually so much of a bother.",
    "While some smart TVs these days still come with cabled headphone outputs, it’s an increasingly rare sight – and rightly so, given the rise of wireless audio and the fact that wired headphones rarely come with a cable long enough to watch TV comfortably at the same time.",
    "There are plenty of wireless headphones to choose from, including dedicated headphones for TV watching that can carry 5.1 (or even 7.1) channel audio as well as active noise cancellation to keep out the sound of your family, friends and home. But it’s perfectly possible to connect bog-standard wireless earbuds or over-ear cans and enjoy some solo audio time.",
    "It’s possible, that is, but not always intuitive. I’ve had plenty of issues just trying to find the correct settings – which tend to be hidden far away from the Audio settings you’d think they would be housed in. Anker projectors like the Nebula Solar Portable (which features Android TV) keep the connection options under Remotes & Accessories, rather than Audio – while new Panasonic OLED TVs with HomeMyScreen keep them under a Setup submenu (Setup > Bluetooth Setup > Bluetooth Audio) rather than Sound.",
    "If you’re familiar with this quirk of connection settings, it’s not too hard to figure out what to do – though even then the experience isn’t always seamless.",
    "TV reviewer and calibration specialist Vincent Teoh, from HDTVTest, says that “I don't think it's a priority for TV manufacturers,” and that “if it's not a priority, TV manufacturers generally won't allocate resources to implement it.”",
    "That somewhat echoes the official response from Anker, which tells us that “Bluetooth isn’t an essential feature,” with only “around a quarter” of their customers tending to use it with their projector range.",
    "When connecting to Panasonic TVs, it’s important to set the sound to 'Bluetooth Only' to ensure the TV remote is controlling the headphones themselves. But we found that the touch controls on our high-end, over-ear Sony WH-1000XM4 cans simply wouldn’t work when they were connected to the Panasonic JZ2000, which felt like an odd ability to lose in that context.",
    "And it’s clear that the lack of interest in Bluetooth connectivity in TVs – partially from manufacturers, and partially from users, most of whom don’t use the feature regularly if at all – is causing occasional blind spots like these, where compatibility with headphones only goes so far. Sometimes, as with the LG E9 OLED we reviewed back in 2019, the Bluetooth connectivity simply won’t work at all.",
    "To Panasonic’s credit, it did include a new dual Bluetooth feature in its 2021 TV range, allowing you to have separate volume settings for two connected headphones – and dual connection is now the norm on the new Apple TV 4K for the Apple AirPods too.",
    "But there’s clearly a long way to go before Bluetooth implementation in smart TVs is as seamless and easily accessible as it is to switch between picture presets at the press of a button.",
    "For those who want to watch TV and films with their headphones, there are avenues available to do so – just don’t expect it to be as simple as it should be for a good while yet."
  ],
  "headers": {
    "6": "Let’s connect"
  },
  "links": {
    "smart TV": "https://www.techradar.com/news/best-tv",
    "streaming devices": "https://www.techradar.com/best/streaming-device",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "headphones for TV watching": "https://www.techradar.com/best/headphones-for-tv-watching",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "projectors": "https://www.techradar.com/best/4k-projector",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "HDTVTest": "https://www.youtube.com/user/hdtvtest",
    "LG E9 OLED": "https://www.techradar.com/reviews/lg-e9-oled",
    "new Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review"
  }
}