{
  "source": "https://www.techradar.com/news/audacity-fans-are-absolutely-furious-right-now-heres-why",
  "title": "Audacity users are seriously angry right now - here’s why",
  "category": "computing",
  "updated": "2021-07-05T16:39:17Z",
  "author": "joel-khalili",
  "summary": "Audacity privacy policy update has caused an outcry",
  "article": [
    "An update to the Audacity privacy policy has raised concerns the audio editor may be used to harvest a wealth of user data under its new ownership.",
    "Audacity was purchased earlier this year by a company called Muse Group, which owns various music and audio software, such as Ultimate Guitar, MuseScore and Tonebridge.",
    "When the acquisition was announced, Muse Group promised the software would remain free and open source. However, sections of the community believe the new privacy policy runs counter to philosophies and ambitions of the open source movement; some have gone as far as to call Audacity “spyware”.",
    "Under the new privacy policy, Audacity will collect information such as OS version, CPU and error codes, but also the location of the user. According to the policy, this information is required for analytics purposes and to improve the application, although it’s unclear where location data slots into this picture.",
    "The policy goes on to state that Audacity will collect “data necessary for law enforcement, litigation and authorities’ requests”, but does not expand on what type of information this clause might cover, leading to speculation it could be used to justify an unacceptable breach of user privacy.",
    "Ever since the Audacity acquisition, relations between Muse Group and the open source community have been strained.",
    "The company ruffled feathers with a new Contributor License Agreement (CLA) for Audacity, which contributors were required to sign if they wanted to continue to work on the project. This new agreement also stipulated that Muse Group must be given unrestricted rights to all contributions.",
    "A significant portion of the community felt the new CLA compromised the values of the open source ecosystem, built around the concepts of transparency and collaboration, by allowing Muse Group to use code submitted by contributors in other non-open source projects.",
    "For others, the privacy policy update was the final straw. Contributors have taken to both GitHub and Reddit to call for a fork of the software, which would see developers break away to develop a new audio editor, using Audacity code as the backbone.",
    "TechRadar Pro asked Muse Group for specific details about the data collection activities covered by the privacy policy and for a perspective on the community outcry, but the company has not yet responded.",
    "Via FOSS Post"
  ],
  "headers": {
    "5": "Audacity outcry"
  },
  "links": {
    "audio editor": "https://www.techradar.com/news/the-best-free-audio-editor",
    "new privacy policy": "https://www.audacityteam.org/about/desktop-privacy-notice/",
    "Audacity": "https://www.techradar.com/reviews/audacity",
    "new Contributor License Agreement (CLA) for Audacity": "https://github.com/audacity/audacity/discussions/932",
    "FOSS Post": "https://fosspost.org/audacity-is-now-a-spyware/"
  }
}