{
  "source": "https://www.techradar.com/news/the-global-cloud-market-will-be-worth-almost-half-a-trillion-dollars-in-2022",
  "title": "The global cloud market will be worth almost half a trillion dollars in 2022",
  "category": "computing",
  "updated": "2021-11-11T13:24:22Z",
  "author": "sead-fadilpasic",
  "summary": "Although spending is slowing down, Gartner says",
  "article": [
    "With information technology spending showing no signs of slowing down, a new report from Gartner expects the cloud computing industry to grow a trillion-dollar value in 2022.",
    "In the EMEA region (Europe, Middle East, Asia), software spending is expected to grow the most next year, fueled mostly by cloud spending. Spending on cloud infrastructure will take up 12.5% of total enterprise IT spending next year, as businesses increasingly turn towards Infrastructure-as-a-Service (IaaS), and Desktop-as-a-Service (DaaS) solutions. These two are expected to grow by almost a third, each.",
    "“The rise of enterprise application software, infrastructure software and managed services and cloud infrastructure services demonstrates that digital business is not just a one- or two-year trend – it is systemic and long-term,” said John Lovelock, distinguished research vice president at Gartner.",
    "Overall, IT spending for EMEA is on course to hit $1.3 trillion next year, up 4.7% from this year, but down from the 6.3% growth rate recorded between 2020 and 2021.",
    "Gartner adds that the biggest upcoming change is that it will no longer be a question of how much IT is financed with - but rather, how it is financed.",
    "“IT is transitioning from supporting the business to being the business — which means spending on technology shifts from a cost of operations (selling, general and administrative [SGA]) to a cost of revenue (COR), or possibly cost of goods sold (COGS),” added Lovelock.",
    "Gartner's report also noted it believes IT spending in the UK will outpace that for the rest of the EMEA region, being expected to hit $223.3 billion in 2022, up 6% from the same period the year before.",
    "Be sure to also check out our list of the best cloud VPS hosting providers right now"
  ],
  "headers": {
    "3": "Spending slowing down"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud infrastructure": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "best cloud VPS hosting": "https://www.techradar.com/best/cloud-vps-hosting"
  }
}