{
  "source": "https://www.techradar.com/news/diablo-immortal-will-be-a-mobile-mmo-developers-reveal-at-blizzcon-2021",
  "title": "Diablo Immortal will be a mobile MMO, developers reveal at BlizzCon 2021",
  "category": "phones",
  "updated": "2021-02-20T05:39:43Z",
  "author": "david-lumb",
  "summary": "After its technical outfit, Diablo Immortal is shaping up to be a mobile gaming MMO",
  "article": [
    "At BlizzCon 2021, we’ve learned more about Diablo Immortal, Blizzard’s mobile entry in the iconic action RPG franchise. After a technical alpha that ended in January, we’ve got a clearer view of how the game’s shaping up – and by the developers’ own accounts, Diablo Immortal is a mobile MMO with tone and gameplay in line with the franchise but could have a few tricks all its own.",
    "Important things out of the way first: there’s no release date yet, and it looks like the next phase will be another alpha, according to a Q&A with press held during BlizzConline 2021. Blizzard isn’t announcing when that next alpha will take place (though we did get more info on what’s coming – more on that later).",
    "But based on answers given by Diablo Immortal lead designer Wyatt Chang and combat designer Julian Love, we know more about how the game has been built to be an MMO on mobile, but also what tweaks to the Diablo formula have been made to make it mobile-friendly while still feeling like a game in the franchise.",
    "Here’s the top insights we gained from the Q&A:",
    "The big revelation seems to be that the Diablo Immortal team has been designing the game to be a mobile MMO – or at least be an action RPG with MMO elements like voice chat, public events, and dedicated dungeons to take on with your friends.",
    "We weren’t able to get all the specifics in the short Q&A, but we did learn that the technical alpha did implement the four-person dungeons we’d heard about before. The Diablo Immortal team affirmed that they would also like to have events with more than four players, which could be larger raid-like events in the game – though these are still aspirational, and the game could launch without these events.",
    "But the technical alpha did have extensive voice chat – not just in your party, but in public channels, too. To address the public, you can leave voice memos: hold down a dedicated ‘record’ button to save a message and a speech-to-text tool will translate and show other players a summary of your missive, which they can click on to hear your audio. This functionality is in the technical alpha that just wrapped up.",
    "The team is also working to implement guilds into the game: “we want you to feel like your membership and participation in a guild matters,” Chang said.",
    "Players will operate out of the hub city of Westmarch, and may pass “dozens” of players as they wander around. But more crucial to the MMO experience is “that the world exists outside of you,” as Chang put it, and much like World of Warcraft, the Diablo Immortal world is a persistent place that marches on with or without you.",
    "Since the game was announced at Blizzcon 2018, players have been mystified how the mobile game will recreate the Diablo experience – or diverge from it. In the BlizzConline 2021 Q&A, the team leads talked about the changes to both gameplay and the look and feel of the world to make it work on smartphones.",
    "The Immortal team admitted the challenge in adapting the action RPG to mobile phone controls within the display, which means fingers will cover up some of the action, though they noted that it was easy for players to ‘melt right into the game,’ as Chang described it. But a more interesting adjustment was in shaping the game to be playable in short bursts, which suits mobile gaming.",
    "As Chang explained, the Immortal team designed activities for one minute or three minutes or five minutes so it would be satisfying for players who picked up and put down the game for brief sessions – and yet also make it fun for folks playing marathon sessions of three or four hours, as they do with the PC and console Diablo games.",
    "They also brightened up the game – literally – to make it easier to see for folks playing on their phones in different lighting conditions.",
    "“It does benefit the game to not be so dark, because you’ve got players playing in a bunch of different ambient light situations and they can really struggle to see anything” Love said. “It’s the kind of problem where a gamma knob slider doesn’t really fix the problem. You really need enough ambient contrast in order to make sure that the visceral action remains present and people can distinguish what’s going on. It’s a very fast-paced game.”",
    "So expect a brighter game, but also one with a tone somewhere between Diablo 2 and Diablo 3, the devs said. Presumably, that means a more colorful game than the former’s extensively dark palette, but less vibrant than the latter, which was lambasted at launch for veering away from Diablo 2’s dim, grim vibes.",
    "But with these tweaks, the Immortal team is trying to keep the game ‘feeling’ like its PC and console predecessors – though it will likely take trial-and-error to nail the right approach.",
    "“The biggest thing I care about is ‘Does It Feel Like Diablo,’ and only way to find out is push it into public and see if it’s on the right track,” Love said.",
    "Lastly, one of the more frequent player requests in the technical alpha was for controller support, which the Diablo team said it is working on.",
    "While the Diablo Immortal team hasn’t finalized its PvP plans, there was a glimpse of what kind of content they’re making to pit characters against each other in the technical alpha.",
    "In one area found in the early alpha version of the game, a treasure chest would spawn every three hours which would only open to the last player standing – essentially creating a king-of-the-hill arena around it for the bold to conquer. Whichever player remained got to loot the chest.",
    "That’s just a preview, Chang said: “Our PVP plans are definitely more ambitious than that.”",
    "As has been previously revealed, Diablo Immortal will be a free-to-play game with microtransactions, but players won’t be able to buy equipment, which will have to be looted traditionally, e.g. off the bodies of your foes. Instead, in-game purchases will let players buy gems and things related to charms. They’re also planning to have a battle pass system with free and paid tracks.",
    "The game will launch with six core classes and the Immortal team plans to add more, along with extra areas and content – which will all be free to every player. No classes, zones, or other content will be paywalled, according to the team’s current plans.",
    "“In-game purchases should never circumvent gameplay. We want to structure our purchases so it’s a bonus and you feel good about it,” Chang said.",
    "While Diablo Immortal is adhering to the beloved setting, characters, and gameplay loop established in the PC and console games, and zealously recreating the experience for mobile, developing for the platform surprisingly gives the team the opportunity to develop some new elements that wouldn’t be possible in prior games.",
    "One of these is a feature that Love has wanted to put in Diablo games for a decade, he says, but because every smartphone player is using the same control scheme, the Immortal team has an opportunity to establish new monster effects – like allowing enemies to freeze the ground, causing players to slip all over the place, and combo that with other environmental effects like wind.",
    "“You’ve got this whole new problem for players: the ground is slippery, and there’s a wind blowing against you this way, and if I move with the wind I’m faster but slipping all over the place, but if I fight the wind, I don’t have traction,” Love said. “These are whole new problems for the player to solve.”",
    "It’s unclear how prevalent this effect, or effects like it, are in Immortal, but it’s interesting to see how the design space opens up given the apparent limitations – or really, opportunities – of mobile.",
    "The technical alpha that finished in early January allowed players access to five zones and progress up to level 45 in order to test the mid-game of character progression. A future alpha period – should allow players to climb to the game’s final intended cap: level 60.",
    "In other words, players will likely run into at least some of the end-game content in Immortal. That’s not the end of character growth, of course, as there are prestige points and loot grinding to do. Future alpha phases will also have more questing zones and, of course, the two classes that haven’t been included yet: the necromancer and the crusader.",
    "An announcement on the next technical alpha is coming 'soon':"
  ],
  "headers": {
    "4": "1. It’s designed to be a mobile MMO",
    "9": "2. Its gameplay is suited for short sessions",
    "18": "3. It’ll have unique PvP experiences, like mini-King of the Hill events",
    "21": "4. It will have microtransactions, but all new classes and content will be free",
    "24": "5. It could have gameplay not featured in other Diablo games",
    "28": "6. The next technical alpha will likely have end-game content"
  },
  "links": {
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "Diablo Immortal": "https://www.techradar.com/news/diablo-immortal-release-date-news-trailers-phones"
  }
}