{
  "source": "https://www.techradar.com/news/microsoft-vs-google-browser-fight-gets-ugly-with-edge-pop-up-chrome-diss",
  "title": "Microsoft vs Google browser fight gets ugly with Edge pop-up Chrome diss",
  "category": "computing",
  "updated": "2021-12-02T17:39:55Z",
  "author": "darren-allan",
  "summary": "Pop-up suggests Chrome is a has-been browser and ‘so 2008’",
  "article": [
    "Microsoft has fired more flak at the Chrome browser, trying to persuade those who are attempting to download Google’s web browser that Edge is a superior piece of software.",
    "As Neowin spotted, in the scenario that you are using Microsoft Edge, and you head over to download Google Chrome, Edge will serve a pop-up promoting itself – there are actually several messages which have been spotted on both Windows 10 and Windows 11 systems.",
    "One of them insists: “Microsoft Edge runs on the same technology as Chrome, with the added trust of Microsoft.”",
    "And another pop-up really goes for the throat, stating: “That browser is so 2008! Do you know what’s new? Microsoft Edge.”",
    "Do you know what isn’t new? Microsoft badgering users who are already using one of its products (Windows) to use its other products like Edge and OneDrive – and this practice was getting old some time ago.",
    "As we’ve said before, this kind of promotional activity inevitably puts us in mind of the nag-fest days when Windows 10 was first launched, and Microsoft set about trying to convince Windows 7 and 8 users to take the free upgrade. It felt unnecessarily heavy-handed back then, and it still does now.",
    "I suppose one thing we can be thankful for – sort of – is at least the pop-ups are gaining something of a sense of humor. Calling Chrome ‘so 2008’ did elicit a chuckle from us, but we guess you could argue this perhaps serves to remind people that Google has been working to refine and hone its browser for 13 years now. And just because something is ‘new’ does not equate to it being good (that said, we do think Edge is a good browser, in fairness).",
    "As for: “Microsoft Edge runs on the same technology as Chrome, with the added trust of Microsoft.” Well, it does indeed use Chromium – along with a number of other browsers – but as to the ‘trust’ of Microsoft, that’s a pretty bizarre angle to throw in. What is Microsoft trying to suggest? That Google is anything less than unimpeachable in the browser world? Tsk, tsk, whatever next…",
    "To be honest, we are wondering what on earth Microsoft will do to promote Edge next, as the gloves are seemingly coming off. But the real shame here is that Edge promotes itself quite well on its own merits, and any perception of verging towards desperation to drive adoption will surely backfire.",
    "Via Windows Central"
  ],
  "headers": {
    "5": "Analysis: The heavy hand of Microsoft"
  },
  "links": {
    "Chrome browser": "https://www.techradar.com/news/browser-wars-google-chrome-just-received-a-major-performance-boost",
    "Neowin": "https://www.neowin.net/news/microsoft-says-its-own-edge-browser-is-more-trustworthy-than-so-2008-google-chrome/",
    "Edge": "https://www.techradar.com/news/microsofts-back-to-its-old-tricks-by-persuading-outlookcom-users-to-switch-to-edge",
    "OneDrive": "https://www.techradar.com/news/fed-up-of-microsoft-edge-ads-here-have-some-more-this-time-in-onedrive",
    "it still does now": "https://www.techradar.com/news/microsoft-edge-is-bombarding-people-with-ads",
    "Edge is a good browser": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Windows Central": "https://www.windowscentral.com/microsoft-calls-chrome-so-2008-part-ongoing-browser-war"
  }
}