{
  "source": "https://www.techradar.com/news/battlefield-2042s-final-multiplayer-mode-hazard-zone-is-a-battle-royale-for-pacifists-and-it-looks-fantastic",
  "title": "Battlefield 2042’s Hazard Zone isn't a battle royale - and it looks fantastic",
  "category": "gaming",
  "updated": "2021-10-14T17:57:03Z",
  "author": "hamish-hector",
  "summary": "Opinion: Hazard Zone will reward only the best",
  "article": [
    "Dice has finally unveiled the last multiplayer mode appearing in Battlefield 2042 at launch: Hazard Zone. The long-rumored battle royale mode has defied expectations and looks set to be 2042’s best multiplayer game type - not least of which because it isn’t actually a battle royale.",
    "Instead, Hazard Zone is an objective-based game mode where squads of players must work together to locate satellites, collect their data drives and extract the spoils before time runs out. To make this more challenging, other enemy squads are after the same limited rewards and AI-controlled forces will be defending the territory too - you’ll also have to watch out for tornadoes if your task didn’t sound difficult enough already.",
    "What’s more, players won’t win by being the last team standing like in a traditional battle royale. Instead, you'll have to successfully extract, at least one player from the match with whatever your team has been able to gather. Extractions are limited to two squads per game - with one extraction happening halfway through the match and one right before time runs out.",
    "This means that you could theoretically win a game of Hazard Zone without eliminating a single enemy. A non-violent playstyle would certainly make it more difficult to win Hazard Zone, but we expect there will be several pacifist-run videos popping up on YouTube when Battlefield 2042 launches.",
    "If you choose to play more violently you will be rewarded though, as enemy players will be eliminated from the match once killed - there are no automatic respawns - giving you better odds at fending off attackers. The only way to revive killed players will be for their squadmates to find a ‘reinforcement uplink’ which will allow them to bring players back into the action.",
    "When Battlefield 2042 launches Hazard Zone will use all seven maps already confirmed for All-Out Warfare. On PS4 and Xbox One Hazard Zone will allow 24 players (or six squads) while PS5, Xbox Series X/S and PC owners will have to compete against 32 players (or eight squads).",
    "Battlefield 2042 will launch on Xbox One, Xbox Series X/S, PS4, PS5 and PC on November 19, 2021.",
    "Hazard Zone will be a genuinely cool reinvention of the traditional battle royale format.",
    "It takes all the best aspects of the genre - like semi-permanent death and tense win conditions - and combines them with objective-based gameplay to create a mode that we’re sure both pros and more casual players will enjoy.",
    "However, we can already see some downsides to the mode that has us worried it could quickly lose its appeal; in particular that Hazard Zone will be denominated by just a select few squads.",
    "Given the importance Dice stressed on strategy this won’t be a mode where mic-less teams of random players will have much luck. Teams will want to tactically pick their specialists, insertion points based on early game info, then mix up plans on the fly depending on where random future drops appear.",
    "Extracting will be another point where consensus is required, given how infrequent the ability to leave is teams will need their full might to steal a seat on the extraction vehicle. And despite Dice’s emphasis on this being a game where killing is not the priority, we all know some players will nevertheless place K/D above all else.",
    "If your team isn’t able to effectively communicate and agree, we suspect you’ll be swiftly picked off by the mode’s many hazards.",
    "Further adding to the problem is the ability to use Dark Market credits to purchase tactical upgrades. We’ll have to try it out for ourselves to pass final judgment, but what Dice has said so far has us nervous that players who own Battlefield 2042 from day one could quickly gain huge advantages over players who join later.",
    "Thanks to the Hazard Zone upgrades, over time squads will get stronger and newer players might struggle to keep up.",
    "While this kind of mechanic has appeared in previous Battlefield games - where players unlock rewards based on experience giving avid fans better items and abilities - it may be especially hard to keep up in Hazard Zone as to earn credits quickly players must gather drives and extract.",
    "This objective is considerably harder to achieve against tougher enemies who are also in search of the same limited resources. Conversely, in previous games simply playing would net you experience that could help you rank up.",
    "Hopefully, Dice has thought ahead to find ways to combat these issues as otherwise, Battlefield 2042’s best mode could end up being it's least popular."
  ],
  "headers": {
    "7": "Opinion: Hazard Zone might only be great for a select few"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "tornadoes": "https://www.techradar.com/news/battlefield-2042-tornadoes-ruin-the-experience-according-to-leaker",
    "All-Out Warfare": "https://www.techradar.com/reviews/battlefield-2042#section-battlefield-2042-multiplayer-modes",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X/S": "https://www.techradar.com/news/xbox-series-x-vs-xbox-series-s-which-xbox-will-be-right-for-you"
  }
}