{
  "source": "https://www.techradar.com/news/microsofts-windows-11-update-push-is-slowly-gathering-steam",
  "title": "Microsoft's Windows 11 update push is slowly gathering steam",
  "category": "computing",
  "updated": "2021-10-29T10:12:42Z",
  "author": "mike-moore",
  "summary": "Migration to Windows 11 is progressing, but slowly",
  "article": [
    "The number of Windows 11 users is continuing to grow steadily as the rollout of the software continues, new figures have shown.",
    "According to AdDuplex, 4.8% of \"modern PC\" users are now running the latest version of Microsoft's software, an impressive growth seeing as it has only been available for a few weeks.",
    "The news comes as Microsoft appeared to launch a further rollout of Windows 11 to more devices, with WindowsLatest noting that the option to upgrade has appeared on a number of its older test devices.",
    "\"The availability of Windows 11 has been increased and we are leveraging our latest generation machine learning model to offer the upgrade to an expanded set of eligible devices,\" a Microsoft blog post noted.",
    "\"We recommend that you upgrade your devices to Windows 11 to take advantage of the latest features and advanced protections from security threats.\"",
    "Surveying around 60,000 PCs for its report, AdDuplex noted that over 90% of PCs running Windows 10 or 11 are now on 2020-2021 versions of Windows.",
    "Windows 11 Insiders running beta or test versions of the software made up a further 0.3% of users, pushing the total user base for the newest version above the 5% mark.",
    "However Windows 10 builds still unsurprisingly dominate the user base surveyed by AdDuplex, which found the Windows 10 M21U (21H1) version released in May 2021 leading the way with 37.6%, just ahead of Windows 10 O20U (20H2) released back in October 2020.",
    "If you want to see if your PC is ready to upgrade to Windows 11, Microsoft has provided the following recommended system requirements:",
    "Processor: 1 gigahertz (GHz) or faster with 2 or more cores on a compatible 64-bit processor or System on a Chip (SoC)",
    "RAM: 4GB",
    "Storage: 64GB or larger",
    "System firmware: UEFI, Secure Boot capable",
    "TPM: Trusted Platform Module (TPM) version 2.0",
    "Graphics card: Compatible with DirectX 12 or later with WDDM 2.0 driver",
    "Display: 9in or larger display with HD (720P) resolution or more",
    "Internet connection and Microsoft accounts: Internet connection to download and set up the device. A Microsoft account is required for some features.",
    "The company also offers a PC Health Check tool to assess your machine's suitability for Windows 11 - although this hasn't proved popular with all users.",
    "If you're looking for something different, we've picked the best Microsoft Office alternatives around today."
  ],
  "headers": {
    "3": "Windows 11 update process"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "AdDuplex": "https://reports.adduplex.com/#/r/2021-10",
    "WindowsLatest": "https://www.windowslatest.com/2021/10/28/windows-11-upgrade-is-now-rolling-out-to-more-pcs/",
    "Microsoft blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-3947320318030264300&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-au%2Fwindows%2Frelease-health%2Fstatus-windows-11-21h2",
    "PC Health Check": "https://www.techradar.com/news/microsoft-finally-updates-the-windows-11-health-check-app",
    "hasn't proved popular": "https://www.techradar.com/news/microsoft-is-apparently-force-installing-this-annoying-windows-11-upgrade-tool",
    "best Microsoft Office alternatives": "https://www.techradar.com/news/best-microsoft-office-alternative"
  }
}