{
  "source": "https://www.techradar.com/news/the-digital-twin-from-conception-to-the-modern-day",
  "title": "The digital twin: from conception to the modern day",
  "category": "computing",
  "updated": "2021-04-26T14:04:13Z",
  "author": "david-king",
  "summary": "History of the digital twin",
  "article": [
    "A digital twin is a 3D virtual copy of a physical system or object. It can be scrutinized, edited and tested to examine the impact any given change would have on its real-life counterpart. Crucially, this reduces risk as ideas can be safely trialed in the digital replica without adversely affecting the physical version. Only when you’re happy with how a solution performs in the simulation do you bring it into the real world.",
    "This technique has been used across a broad range of industries – from aeronautics to automotive – for over 50 years and is now increasingly being adopted within the data center sector. Vitally, it is giving control back to design and operations teams. Empowering them to ascertain the best possible configuration for space and energy efficiency; as well as easing the implementation of new technologies such as liquid cooling. Before we dive further into modern day applications, let’s take a look at where the concept of the digital twin originated.",
    "Digital twins have their roots in the pairing technology pioneered by NASA in the 1960s. At this early stage, NASA’s engineers physically duplicated systems in space and had versions at ground level. This allowed them to remotely work out how issues, such as those encountered on Apollo 13, could be resolved hundreds of thousands of miles away.",
    "Fast forward 60 years and NASA is using digital twins to drive new innovations, and they’re not alone. The life cycle management methodology is used in wind farms to establish the most effective way to arrange turbines, and in healthcare to predict how a patient will respond to a procedure. It’s also being deployed in the connected car sector to help self-driving cars learn how to safely navigate challenging road set-ups.",
    "Digital twins can be used in a similar way within data centers. Armed with an in-built Computational Fluid Dynamics (CFD) engine, the digital twin has an unparalleled understanding of airflow and cooling. As such, stakeholders are empowered to collectively track airflow, temperature, compliance and cost factors; and understand the impact a change in configuration would have on these. The digital twin does this by providing IT management and facilities teams with a centralized, collaborative database made up of all the data center’s IT assets. This circumvents the issues that would occur if stakeholders were operating blind and without an awareness of one another.",
    "A common challenge in modern data centers is the deployment of high-density racks. Without a digital twin available, facility engineers often rely on spreadsheets, experience, and judgement to accommodate these loads, which are often outside the original design envelope of the facility. These are hard decisions and naturally take time, delaying projects. Cautious engineers may insist on extra mitigations for potential cooling issues (such as containment or supplementary cooling) upfront or issues post deployment may warrant their use. Either way, the net result is unforeseen cost increases for the project and in the second case possible service impact.",
    "With a digital twin in place the consequences of the deployment can be understood by the facilities team while procurement is still haggling over prices with the vendor, enabling those involved to collaborate on a more effective solution. This is key to controlling project costs and preventing all manner of unintended, but significant, impacts including data center outages. As a matter of fact, organizations who have deployed a digital twin are three times less likely to have a data center outage each year than those who have not introduced the software, according to an independent report commissioned by Future Facilities.",
    "Beyond the practical problems that the digital twin solves, it also provides solutions to high-level challenges. Such as how to reach sustainable development goals.",
    "Last year, and at the beginning of 2021, individuals and organizations in both the private and public sectors recognized the importance of putting environmental considerations front and center. For example, David Attenborough warned about what will happen to the planet if we don’t adopt change and the UK government shared a Ten Point Plan for a Green Industrial Revolution. However, a key challenge many organizations face is reconciling environmental aspirations with more immediate priorities. With this in mind, it’s crucial to look at technologies and processes that can bring alignment. The digital twin helps to do just this amid the context of an increasing dependence on data centers.",
    "The popularity of on-demand entertainment, such as Netflix and Disney+, is driving an increase in data center usage. Some of these centers are powered and cooled via clean energy sources, but, at present, this has to be heavily supplemented with carbon-based energy to meet the level of demand. The industry must work hard to curtail its footprint. Particularly if it’s going to meet pressure from The International Telecommunication Union (ITU) to reduce its greenhouse gas emissions by 45% over the next decade. Reviewing capacity planning will be key to achieving this, and the digital twin has a vital role to play here. Using the digital twin, operations teams can establish the most energy efficient and safe data center configuration. Not only is this beneficial in of itself, but it also forgoes the need to build new centers until absolutely necessary. This minimizes the industry’s carbon footprint and helps it on the route to achieving sustainability goals.",
    "In its early iterations, the digital twin helped aeronautics agencies minimize risk in space. Now, the methodology is offering a solution to tackle the climate change risk. The data center industry must capitalize on its potential to improve utilization, while driving energy efficiency, if it is to future-proof itself against sustainability requirements now and in the years to come."
  ],
  "headers": {
    "2": "The roots of the digital twin",
    "4": "The benefits it can deliver for data centers",
    "7": "Tackling high-level challenges through the digital twin",
    "10": "A journey of risk mitigation"
  },
  "links": {
    "3D": "https://www.techradar.com/best/best-3d-modelling-software",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "self-driving cars": "https://www.techradar.com/news/self-driving-cars",
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "spreadsheets": "https://www.techradar.com/best/spreadsheet-software"
  }
}