{
  "source": "https://www.techradar.com/news/nokia-achieves-private-5g-record-110gbps-speed",
  "title": "Nokia achieves private 5G record 110Gbps speed",
  "category": "computing",
  "updated": "2021-10-13T10:29:47Z",
  "author": "steve-mccaskill",
  "summary": "Nokia reaches record with new edge platform",
  "article": [
    "Nokia has achieved a record transmission rate of 110Gbps on a Private 5G network, a milestone that it believes demonstrates the viability of industrial-grade wireless for mission critical applications.",
    "Many industrial customers that will rely on high performance and low latency will turn to Private 5G, which offers dedicated connectivity using either licensed, unlicensed, or shared spectrum, with no resources shared by any third party.",
    "By pursuing this route, customers can define the scale, pace of rollout, and technology used, while guaranteeing a certain level of performance. Edge computing, which processes data as close as possible to the point of collection, is also a critical factor in making this happen.",
    "The hope is that Private 5G will not only make it easier to handle current connectivity demands, but also enable entirely new applications in the fields of Internet of Things (IoT), real-time analytic,s and Machine Learning.",
    "Nokia, which is increasingly targeting the enterprise space, achieved the record using a single Nokia MX Industrial Edge server, a new ‘off-the-shelf’ on-premise, cloud-native platformthat combines high performance compute, storage, networking with a simplified management layer.",
    "The company says the scalability of its edge platform, coupled with the capabilities of its Digital Automation Cloud (DAC) and 5G networking equipment, mean it is ready to support customers with their digitisation initiatives.",
    "“This milestone achievement is a testament to our continued investment in providing customers with the best solution capabilities to meet their evolving needs,” declared Janne Parantainen, CTO for Enterprise Solutions at Nokia.",
    "“The results from the test are truly promising, as they demonstrate that private wireless networking and digitalisation application workloads can be consolidated into a single server providing significant cost savings and operation simplification.",
    "“Our customers can feel assured that the MX Industrial Edge and Nokia Digital Automation Cloud systems can not only handle the demands of Industry 4.0 traffic today, but in the future when technology requiring more bandwidth – like AR – become common-place.”"
  ],
  "headers": {
    "3": "Nokia private 5G"
  },
  "links": {}
}