{
  "source": "https://www.techradar.com/news/mobile-video-calling-exploded-in-usage-last-year",
  "title": "Mobile video calling exploded in usage last year",
  "category": "computing",
  "updated": "2021-02-15T22:30:52Z",
  "author": "barclay-ballard",
  "summary": "And the growth is expected to continue",
  "article": [
    "A new study from Juniper Research has highlighted the rapid growth of mobile video calling as a result of the COVID-19 pandemic. Unsurprisingly given the restrictions on in-person meetings launched in many markets, it appears that laptops, desktop PCs, and smartphones have come to the rescue.",
    "According to the research, the number of times mobile video calling services were used last year totaled 1.8 billion globally, up from 1.2 billion in 2019.",
    "Boasting a growth rate of 50% services such as video conferencing have skyrocketed in popularity, with digital solutions, like Microsoft Teams, Zoom, and Google Meet all displaying record user figures. This expansion is predicted to continue, with the number of users of video calling platforms expected to reach 4.5 billion by 2025.",
    "Juniper also identifies two key regions that are likely to drive the uptake of video calling solutions in the coming years. By 2025, more than 70% of mobile subscribers are predicted to use mobile video calling solutions in Europe and North America, with the ubiquity of smartphone ownership meaning that video calling will remain important in these markets, even when the COVID-19 pandemic has come to an end.",
    "With mobile video calling set to continue its growth, there remains an opportunity for technology firms to grasp. Integrating mobile voice and video call solutions into smart speakers, for example, could be one way of generating new revenue streams for software engineers.",
    "“Innovation in the mobile voice and video space will come from consumer devices beyond smartphones, enabled by the IP-based nature of video calling services,” George Crabtree, co-author of the research, explained. “This provides the perfect platform for the development and rollout of new video calling services over the next four years.”",
    "Similarly, the report claims that voice over LTE, or VoLTE, services are likely to grow in popularity over the next few years, driven by the increased adoption of 5G subscriptions."
  ],
  "headers": {
    "4": "Growth opportunities"
  },
  "links": {
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "desktop PCs": "https://www.techradar.com/news/best-business-desktop-pcs",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "research": "https://www.juniperresearch.com/researchstore/operators-providers/mobile-voice-video-calling-research-report?utm_campaign=pr1_mobilevoice_providers_operators_feb21&utm_source=businesswire&utm_medium=pr",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "smart speakers": "https://www.techradar.com/news/smart-home-devices",
    "explained": "https://www.businesswire.com/news/home/20210214005007/en/Juniper-Research-Users-of-Mobile-Video-Calling-Reached-1.8-billion-in-2020-Growing-by-600-million-Globally",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}