{
  "source": "https://www.techradar.com/news/lgs-first-qned-mini-led-tvs-set-to-launch-in-australia-this-july",
  "title": "LG's first QNED Mini LED TVs set to launch in Australia this July",
  "category": "televisions",
  "updated": "2021-05-20T06:03:22Z",
  "author": "stephen-lambrechts",
  "summary": "LG to offer a more affordable alternative to OLED",
  "article": [
    "Although it still considers OLED to be the pinnacle of television technology for the time being, LG has announced that its new QNED Mini LED TV tech will make its Australian debut this July.",
    "Three QNED Mini LED models will be available to purchase from leading Australian retailers, starting with the QNED91 4K, followed by the QNED96 8K and the QNED99 8K.",
    "QNED is an entirely new category for LG, in that it combines LG's LCD NanoCell colour filtering with quantum dot colour and all-new Mini LED backlight technology to deliver exceptional blacks, vibrant colours and higher levels of brightness.",
    "It's worth noting that Mini LED technology is still based on traditional LCD LED display tech – that makes it more affordable than LG's OLED range, which uses self-lighting pixels.",
    "Unlike traditional LED backlights, Mini LEDs are minuscule, allowing for televisions with thousands of dimming zones, as opposed to hundreds. The result is greater lighting accuracy, less light bleed and near-OLED contrast levels.",
    "Kicking off the range is LG's QNED91 4K, which will be available in 65-inch (AU$4,799), 75-inch (AU$5,999) and 86-inch (AU$8,399) versions.",
    "That's followed by the QNED96 8K, launching in 65-inch (AU$5,399) and 75-inch (AU$6,599) options, and the the QNED99 8K, which is coming in 65 inches (AU$5,999), 75 inches (AU$7,799) and 86 inches (AU$10,799).",
    "LG's QNED Mini LED TVs will join its existing 2021 Aussie lineup, which includes new OLED models in the C1, Z1 and G1 ranges. Here's how much LG's 2021 OLEDs will cost in Australia."
  ],
  "headers": {
    "4": "LG QNED Mini LED TVs: here's how much they'll cost"
  },
  "links": {
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "Here's how much LG's 2021 OLEDs will cost in Australia.": "https://www.techradar.com/news/heres-how-much-lgs-2021-oleds-will-cost-in-australia"
  }
}