{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-screen-and-battery-could-both-be-smaller-than-the-s21",
  "title": "Samsung Galaxy S22 screen and battery could both be smaller than the S21",
  "category": "phones",
  "updated": "2021-09-18T11:00:54Z",
  "author": "david-nield",
  "summary": "Samsung is downsizing",
  "article": [
    "We've seen the iPhone 13 now, so what does the Samsung Galaxy S22 have to offer? A screen size and battery capacity that are both smaller than what we currently have with the standard Galaxy S21 model, according to the latest leaks.",
    "Well-known tipster Ice Universe says that the base Galaxy S22 model is going to come with a 6.06-inch display, whereas the S21 equivalent has a 6.2-inch screen (with a 1080 x 2400 pixel resolution, 20:9 aspect ratio, and 120Hz refresh rate).",
    "That's perhaps slightly surprising, considering that Apple's own attempts at shrinking screen sizes – with the 5.4-inch iPhone 12 mini – have reportedly not generated the kind of sales that Apple would have been hoping for from its smallest flagship.",
    "Ice Universe has more to say on the Galaxy S22, predicting that it's going to come with a battery capacity of 3,700mAh, which is significantly less than the 4,000mAh battery capacity that its predecessor the Galaxy S21 offers.",
    "In fact, the tipster says that the Galaxy S22 is going to be \"Samsung's smallest flagship phone in recent years\", with a length, width and thickness that are \"a little smaller\" than what the standard iPhone 13 offers.",
    "We have heard several rumors around the battery capacities of the Galaxy S22 phones: it was only yesterday that a separate source revealed the same battery capacity of 3,700mAh, so it looks likely that this information is indeed correct.",
    "If the information revealed in this leak is accurate – and given the track record of the source, there's good reason to believe that it is – then it looks as though fans of compact phones have something to look forward to when the Galaxy S22 arrives (which will probably be in January).",
    "A screen size of a little over 6 inches isn't quite into iPhone 12 mini territory, as we mentioned above. The Google Pixel 5 only comes with a 6-inch display, and it's a perfectly capable smartphone. Remember too that the Galaxy S22 Plus and Ultra models will offer large screen sizes.",
    "We're always keen to hear leaks and rumors around what phone companies could be planning in the future, but it's worth remembering that the raw specs don't matter to a large extent – it's the quality and the user experience of the finished phone that's most important.",
    "It's the same with the battery capacity: if the dimensions of the Galaxy S22 are shrinking, then battery life could still be perfectly fine. We will of course let you know what we think of the new smartphone once it's available to buy."
  ],
  "headers": {
    "3": "Battery capacity",
    "6": "Opinion: size isn't everything"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1438825020860502020",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "the kind of sales": "https://www.techradar.com/news/apple-may-stop-production-of-the-iphone-12-mini-and-for-good-reason",
    "separate source": "https://www.techradar.com/news/samsung-galaxy-s22-could-have-at-least-one-serious-issue",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Galaxy S22 Plus": "https://www.techradar.com/news/samsung-galaxy-s22-plus-might-be-a-downgrade-in-terms-of-battery"
  }
}