{
  "source": "https://www.techradar.com/news/chromecast-with-google-tvs-best-feature-is-being-delayed",
  "title": "Chromecast with Google TV's best feature is being delayed",
  "category": "televisions",
  "updated": "2021-12-06T11:37:56Z",
  "author": "rhys-wood",
  "summary": "Now arriving \"in the coming months\"",
  "article": [
    "One of the most useful and anticipated Chromecast with Google TV features, that being individual user profiles, has now been pushed back into next year, Google confirms. Due to release last month, Chromecast with Google TV users will now have to wait a bit longer for the feature to arrive.",
    "As reported by The Verge, individual user profiles were slated to launch in November 2021. However, plans seem to have changed, as Google spokesperson Ivy Hunt told The Verge that the feature is now rolling out \"in the coming months,\" giving no concrete reason behind the sudden delay.",
    "That's a bit of a shame, as the feature is set to offer custom profiles and personalized recommendations for movies and TV shows on an individual basis. However, given the wealth of varying options and features that could be set between individual profiles, it makes sense that Google might need more time to fine-tune the change before release.",
    "Individual user profiles for Chromecast with Google TV will let users make their own customizable profile, which will then attempt to tailor their viewing experience based on the kinds of movies and shows they already watch.",
    "Not only that, but the profiles features is also going to be compatible with Google Assistant, meaning the service will likely have to account for a range of voices in a multi-user household. Previously, Google Assistant functionality was tied to the primary account holder, but individual user profiles is making the voice assistant available to all registered on the device.",
    "Following the user profiles implementation, Google is set to add a \"glanceable cards\" feature, too, that can show quick cards of information like the weather, news and other recommendations when your smart TV is left idle. This, too, will all be on a per-profile basis, and perhaps is another feature Google wishes to iron out before it can launch its new profiles.",
    "Sure, profiles might not be all that important to your Chromecast with Google TV experience if you're living by yourself or with one other person, but they can be especially useful in a household with multiple people.",
    "Being able to switch profiles on a per-person basis will make browsing your favorite content (and content you might like) much easier than having one, universal profile governed by the account holder.",
    "Of course, individual profiles already exist within streaming apps like Netflix, but having them available for a wider service like Chromecast with Google TV will likely help users find content on apps they might be more unfamiliar with, broadening the amount of shows and apps for users to be familiar with.",
    "Individuals profiles are overall a good thing, then, and while we don't know any one reason behind the delay, we're happy for Google to take its time getting the feature right, especially as it will have a range of apps and Google Assistant integrations to account for."
  ],
  "headers": {
    "6": "Analysis: Are profiles really all that useful?"
  },
  "links": {
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "The Verge": "https://www.theverge.com/2021/12/3/22816719/google-tv-profiles-delayed",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review"
  }
}