{
  "source": "https://www.techradar.com/news/these-useful-new-microsoft-teams-updates-are-live-from-today",
  "title": "These super useful new Microsoft Teams updates are live from today",
  "category": "computing",
  "updated": "2021-01-07T14:33:11Z",
  "author": "barclay-ballard",
  "summary": "More new features are coming to Teams",
  "article": [
    "It looks as though updates will just keep on coming for Microsoft Teams users in 2021, after Microsoft announced the rollout of further upgrades. Earlier this week, the Redmond-based firm confirmed that its December 2020 feature update was now available for all users, encompassing a host of exciting new features.",
    "One of the biggest additions is support for virtual breakout rooms, which will enable meeting organizers to set up different rooms or groups for individuals to brainstorm before re-joining a larger session. The feature is currently only available in Government environments but is expected to launch for other Teams users in the coming weeks.",
    "Other new features include a five-minute notification in advance of a meeting ending and a pre-join experience that lets users tweak audio and visual settings before entering a meeting, as well as minor improvements to video playback performance and other functions.",
    "Other noteworthy new features that have recently come to Microsoft Teams include real-time translation for languages including French, Spanish, Italian, Hindi, and more. In addition, Cortana voice assistance will now allow individuals to join and manage meetings with voice controls.",
    "The last year saw Microsoft continually add updates to its Teams platform, with user figures surging as a result of the coronavirus pandemic. At the same time, many competing video conferencing and collaboration tools, including Zoom and Cisco’s Webex, also experienced a huge popularity increase.",
    "Microsoft has said that in addition to the new features confirmed in its December update, it is also working on several other additions, including a new history menu and an enhanced search experience. Expect those features, as well as others that have yet to be announced, to appear at some point in 2021.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "More updates on the way"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Windows Latest": "https://www.windowslatest.com/2021/01/06/whats-new-in-microsoft-teams-big-december-2020-update/"
  }
}