{
  "source": "https://www.techradar.com/news/china-is-apparently-easing-up-on-collecting-mobile-app-data",
  "title": "China is apparently easing up on collecting mobile app data",
  "category": "computing",
  "updated": "2021-03-23T16:15:42Z",
  "author": "mayank-sharma",
  "summary": "The move comes as China tests new system to Apple’s upcoming privacy protocols",
  "article": [
    "A group of China’s top regulators have released a document asking mobile app developers not to collect excessive details about their users.",
    "Reportedly, the move was in the making for a few months with Chinese authorities taking steps to crack down on the unscrupulous data collection by app developers.",
    "“Extraneous data is most often used for advertising purposes, such as serving up localized ads or ads based on the user’s interests,” pointed out Todd Kuhns, marketing manager at app distribution platform AppInChina, speaking to TechCrunch.",
    "Apparently, Chinese apps often mandatorily require users to provide sensitive personal information, many of which are unnecessary given the app’s purpose.",
    "Late last year, Chinese cybersecurity watchdog sought comment on what appears to be a proposed data protection law, that specifies over three dozen app types and the data they are allowed to collect. It isn’t sure if the new document is related to the proposed privacy law.",
    "Kuhns suggests that even with the document the apps could perhaps still request the users for the additional details. The users though can now safely decline sharing the unnecessary details, and still continue to use the app, getting served less relevant ads in return.",
    "Ironically however, the document, which is reportedly more a set of guidelines in the absence of details about enforcement, comes around the same time when some of China’s tech giants are testing a new system to bypass Apple’s upcoming stringent privacy protocols on its App Store.",
    "Via: TechCrunch"
  ],
  "headers": {
    "3": "Give and take"
  },
  "links": {
    "mobile app developers": "https://www.techradar.com/best/best-mobile-app-development-software",
    "testing a new system": "https://www.techradar.com/news/some-of-chinas-biggest-technology-companies-are-trying-to-bypass-apples-new-privacy-rules",
    "privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "App Store": "https://www.techradar.com/best/best-iphone-apps-2021",
    "TechCrunch": "https://techcrunch.com/2021/03/22/china-regulation-data-collection-may-starts/"
  }
}