{
  "source": "https://www.techradar.com/news/a-new-oppo-smartphone-may-have-a-trick-to-hide-the-rear-camera-entirely",
  "title": "A new Oppo smartphone may have a trick to hide the rear camera entirely",
  "category": "phones",
  "updated": "2021-02-04T09:37:36Z",
  "author": "jitendra-soni",
  "summary": "It could still house a dual-camera setup",
  "article": [
    "Chinese smartphone maker Oppo is known for its innovative smartphone designs with the company just recently showcasing a rollable phone and a whole host of concept foldable phones.",
    "The company has not shied away from experimenting with its cameras and when other smartphone brands were busy introducing pop-up camera phones, Oppo introduced one with a Shark-fin design camera module.",
    "Continuing the trend, Oppo has applied for a patent of a new pop-up camera module that itself, if Oppo can successfully bring out, would allow the company to hide all its cameras from the rear of the phone.",
    "This patent was awarded to Oppo late last year and according to LetsGoDigital, this smartphone will have a dual-camera setup that would pop-up when required. That means the company can ensure there isn't a camera on the rear of the phone.",
    "While we have seen smartphones with dual-selfie camera pop-ups, the design that Oppo intends to make is slightly different.",
    "According to the patent, the company wants to place two camera sensors (ideally a primary and an ultra-wide shooter) inside the body of the phone.",
    "How will this work? The pop-up module itself wouldn't house the camera sensors. Instead it would have two prisms (using mirrors) that each point at either side of the device allowing users to capture a selfie or an image from the rear of the phone when the module has popped up.",
    "These prisms will be placed in a way that the light coming from outside will get reflected on to the sensor, and from there the information will be read and processed.",
    "This is somewhat similar to the periscopic camera setup that a lot of smartphones come equipped with and offer impressive telescopic zoom features crammed into a tiny module.",
    "Since this is a patent the details and practical implementations are not very clear yet, but it seems that both the prisms can be used to capture one image, which means that this could work as a dual-camera setup.",
    "We’re not sure if this camera module will ever make its way out of test labs into a smartphone you can readily buy. If it does, it would be a very interesting implementation and may allow Oppo to introduce more bold new smartphone designs."
  ],
  "headers": {},
  "links": {
    "Oppo": "https://www.techradar.com/news/best-oppo-phones",
    "rollable phone": "https://www.techradar.com/news/oppos-next-foldable-phone-will-have-a-rollable-oled-display-but-you-cant-buy-it",
    "concept foldable phones": "https://www.techradar.com/news/concept-foldable-phones-check-out-these-folding-and-rolling-smartphones",
    "Shark-fin design camera module": "https://www.techradar.com/reviews/oppo-reno-2",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/oppo-reno-smartphone-2021/"
  }
}