{
  "source": "https://www.techradar.com/news/nearly-all-companies-plan-on-a-hybrid-workforce-post-pandemic",
  "title": "Nearly all companies plan on a hybrid workforce post-pandemic",
  "category": "computing",
  "updated": "2021-06-23T10:50:34Z",
  "author": "sead-fadilpasic",
  "summary": "Benefits outweigh the negatives for many",
  "article": [
    "With most managers in the UK convinced of the positives of remote working, it seems as the practice is here to stay.",
    "A new report from Owl Labs based on a poll of 500 business leaders from the UK, states that 84% of the respondents plan on keeping either hybrid, flexible or remote workers once the pandemic subsides.",
    "Just 16% expect all of their employees to return to the offices, full-time, and those that do return to the office can expect a few changes.",
    "Just 9% plan on getting rid of their office space permanently, while the majority (32%) will keep the same footprint, but with fewer desks, in order to keep up with the social distancing measures. Onsite Covid-19 testing facilities will be present at roughly a third of all businesses, while a quarter contemplate enforcing vaccine passports and allowing only the vaccinated onto their premises.",
    "Hybrid working brings numerous benefits, to both businesses and employees, the report further notes. Business leaders believe it makes companies more profitable and allows them to hire more people based on their skills, rather than proximity to the office. At the same time, it makes employees healthier, more satisfied, and keener to remain with the team, rather than looking for a new position, elsewhere. It also drives business costs down.",
    "As a result, most business leaders are looking to change their working policies to reflect the new realities. That could include allowing employees to work from anywhere, having unlimited holidays, and working a four-day workweek. The right to disconnect is also something many business owners are contemplating, it was said.",
    "To make sure employees are empowered to work in such a way, new technologies are needed. Almost half (46%) of business leaders are investing in new solutions, with communications tools and at-home office equipment being the most popular choices.",
    "“It’s encouraging to see the majority of UK business leaders embrace hybrid work post-pandemic and start adopting more progressive policies such as working from anywhere,” said Frank Weishaupt, CEO of Owl Labs.",
    "“As organizations have adapted to working remotely, they’ve seen how profitability and productivity remain positive. The UK is leading the way in investing in new technology which will continue to play a key role in supporting this permanent shift to hybrid work. Businesses that successfully make the long-term transition to hybrid working will be the ones who adopt the infrastructure and workplace policies that enable their employees to maintain high levels of creativity and collaboration, wherever they dial-in from.”"
  ],
  "headers": {
    "5": "Updating remote working policies"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/these-are-the-essential-tools-for-remote-workers",
    "desks": "https://www.techradar.com/best/best-office-desks",
    "communications tools": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}