{
  "source": "https://www.techradar.com/news/windows-10-update-will-solve-the-single-most-annoying-copy-and-paste-problem",
  "title": "Windows 10 update will solve the single most annoying copy-and-paste problem",
  "category": "computing",
  "updated": "2021-02-22T12:01:46Z",
  "author": "joel-khalili",
  "summary": "An upcoming Windows 10 update will wave goodbye to eccentric copy-and-paste formatting",
  "article": [
    "Microsoft is working on an update for Windows 10 that will address a long-standing problem with one of the operating system’s most foundational features: copy-and-paste.",
    "When copying text content, especially from a web page, Windows 10 users often find the formatting is misaligned with the document they are trying to paste to.",
    "However, an upcoming Windows 10 update will introduce a new option to the clipboard menu (Win + V), allowing users to “paste as plain text”, overriding any unwanted formatting.",
    "Microsoft is also said to be working on an entirely new panel for the menu that will make inserting GIFs and emoji into chat applications simpler. Instead of searching for multimedia content online, users will be able to streamline the process by selecting material via an in-menu search function.",
    "These features are still under development, but should roll out to all Windows 10 users as part of a public build in the near future.",
    "While most users will be familiar with the Ctrl + C and Ctrl + V keyboard shortcuts, which allow for highlighted material to be copied from a source and pasted into another location, fewer people will be aware of Win + V.",
    "This shortcut brings up the clipboard menu, which keeps a running log of the material the user has copied. From within this menu, users can also pin specific items to the clipboard for easy access, or delete them entirely.",
    "Unlike with the standard Windows 10 copy-and-paste shortcuts, which transfer the formatting of the original source, users will soon be able to use the clipboard menu to eliminate any unwanted formatting quirks.",
    "However, this is not the only change Microsoft has made to the venerable Windows 10 copy-and-paste function in recent months. The firm has delivered a number of small optimizations, some of which are well worth keeping on your radar.",
    "In August, the company revealed an upgrade to the clipboard panel designed to make it easier for users to paste multimedia content into messages, documents and emails.",
    "Later in the year, Microsoft announced improvements to the Cloud Clipboard utility, which allows users to copy-and-paste items across multiple devices. Instead of synchronizing clipboard content across Windows 10 devices exclusively, users of the Microsoft-owned SwiftKey Keyboard for Android can also now take advantage of the tool.",
    "The company’s flagship web browser, Edge, also received a new Link Format feature, which lets users specify whether a URL copied from the address bar is pasted as a link or in plain-text, depending on preference.",
    "The copy-and-paste feature may seem insignificant at face value, but actually plays a central role in many aspects of the computing experience. As both recent and future updates attest, Microsoft is eager to squeeze every ounce of value from the feature, which power users especially will applaud.",
    "Via Windows Latest"
  ],
  "headers": {
    "5": "Windows 10 copy-and-paste updates"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "upgrade to the clipboard panel": "https://www.techradar.com/news/windows-10-update-copy-and-paste-will-never-be-the-same-again",
    "Cloud Clipboard": "https://www.techradar.com/news/windows-10-update-will-take-copy-and-paste-to-new-heights",
    "web browser": "https://www.techradar.com/best/browser",
    "Link Format feature": "https://www.techradar.com/news/windows-10-update-will-debut-another-huge-copy-and-paste-change",
    "Windows Latest": "https://www.windowslatest.com/2021/02/19/windows-10-clipboard-update-will-take-copy-and-paste-to-new-heights/"
  }
}