{
  "source": "https://www.techradar.com/news/the-boys-season-3-will-be-the-tv-shows-bloodiest-yet-heres-why",
  "title": "The Boys season 3 will be the TV show's bloodiest yet - here's why",
  "category": "entertainment",
  "updated": "2021-04-29T15:09:26Z",
  "author": "tom-power",
  "summary": "Prepare for the most gruesome season yet",
  "article": [
    "The Boys season 3 is currently in production for Amazon Prime Video, and we imagine you can't wait for its arrival. Neither can we! By the sounds of it, we should be preparing ourselves for the bloodiest entry in the R-rated superhero TV show yet.",
    "That's according to actor Laz Alonso, who plays Mother's Milk in Amazon's adaptation of The Boys. During an interview with Collider, Alonso was asked how season 3's development was going amid the ongoing Covid-19 pandemic.",
    "Without giving too much away, Alonso revealed that season 3 was \"between a quarter to halfway through\" filming, before adding that viewers should ready themselves for a slew of gory and gruesome content when season 3 eventually lands on Amazon's streaming platform.",
    "\"I was talking to the head makeup artist and she's in charge of ordering the blood - that's one of her many jobs,\" Alonso said. \"She told me that all of Season 2... When you talk about bulk, I don't think they used over a gallon of blood in Season 2, believe it or not. Season 3, we're already at three and a half gallons of blood. So that should give you a little indication of where it's going.\"",
    "According to Alonso, showrunner Eric Kripke is going \"darker and darker\" with season 3's content, so it isn't surprising to hear that there'll be blood, gore and other grisly elements in the upcoming season.",
    "Some of that will be down to the arrival of Soldier Boy, who will portrayed by Supernatural alum Jensen Ackles, in season 3. Alonso says that Soldier Boy's introduction \"allowed Kripke to not only bring in a character historically who's pretty dark, but it also makes all of the other ensemble Supes darker as well\".",
    "In The Boys graphic novels, Soldier Boy was the mantle given to two superpowered individuals - but it's the first iteration of that character who is the more dangerous of the two.",
    "The first Soldier Boy was the first celebrity superhero and one who fought in World War II. He killed dozens of German soldiers and destroyed numerous enemy tanks, so he's well versed in taking action and killing without a second thought. Unbeknownst to the US public, however, Soldier Boy also killed his own superhero group - The Avenging Squad - and American soldiers during the global conflict, which leads to his death at the hands of Lieutenant Greg Mallory.",
    "By contrast, Soldier Boy Mk II is a cowardly and naive Supe, albeit one who still possesses superhuman strength, speed, endurance and agility. It's unlikely, though, that this iteration of the character will be used in The Boys season 3, given that Ackles' portrayal is deemed to be dangerous by Alonso and Kripke.",
    "As for why else season 3 will be darker, Kripke has previously confirmed that The Boys season 3 will adapt the Herogasm storyline from the comics, which is as Not Safe for Work (NSFW) as it sounds. Soldier Boy Mk II doesn't take part in the so-called herogasm, but he is pressured into having sex with Homelander to allegedly join the Seven. It's possible, then, that Ackles' World War II veteran take on the character will have to participate in a similar scene in season 3 - but there's always the chance the series could diverge from the books with this part, as it has done previously with some more controversial moments.",
    "As The Boys season 2 finale showed, Homelander (Anthony Starr) is losing his mind after Stormfront's death, being blackmailed by Queen Maeve (Dominique McElligott) and having to allow Starlight (Erin Moriarty) back into the Seven. With Homelander going off the rails, too, season 3 sounds like it's gearing up to be the series' most macabre entry so far."
  ],
  "headers": {
    "4": "Why will The Boys season 3 be such a violent instalment?"
  },
  "links": {
    "The Boys season 3": "https://www.techradar.com/news/the-boys-season-3",
    "Collider": "https://collider.com/the-boys-season-3-blood-jensen-ackles-laz-alonso-interview/",
    "previously confirmed": "https://twitter.com/therealKripke/status/1350915496795799552?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1350915496795799552%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.gamesradar.com%2Fuk%2Fthe-boys-creator-confirms-season-3-will-include-herogasm-which-is-as-nsfw-as-it-sounds%2F"
  }
}