{
  "source": "https://www.techradar.com/news/new-ipad-pro-in-2021-could-come-alongside-a-redesigned-magic-keyboard",
  "title": "New iPad Pro in 2021 could come alongside a redesigned Magic Keyboard",
  "category": "tablets",
  "updated": "2021-01-04T09:48:15Z",
  "author": "tom-bedford",
  "summary": "But we don't know what's new",
  "article": [
    "Alongside the new iPad Pro 2020 models, Apple unveiled the Magic Keyboard, a brand-new keyboard peripheral with a magnetic stand and mouse trackpad. It now sounds like the anticipated iPad Pro 2021 might come with an upgrade version of this purchasable extra.",
    "This comes from Patently Apple, which spotted a series of Magic Keyboard patents granted by the Hong Kong Patent and Trademark Office - this contains a series of photos and sketches showing the iPad Pro peripheral.",
    "Now these images don't necessarily show us anything new as the 'revamped' Magic Keyboard looks identical in design to the iPad Pro 2020's version, and no new features are listed. However, the very presence of the patent suggests Apple is looking for ways to tweak the upcoming iPad's useful add-on.",
    "We earlier heard the new Magic Keyboard could ditch the touchpad, and instead opt for touch-sensitive strips on the sides of the keyboard. According to the new patents this isn't the case.",
    "That earlier patent did suggest the updated keyboard could come with a microphone, making voice or video calls on the iPad just a bit better, and intriguingly the new Magic Keyboard patent was classified as 'Equipment for the Recording or Reproduction of Sounds and Pictures', so that seems likely.",
    "It's possible a new Magic Keyboard could be made from a more durable material to better protect the enclosed iPad - Apple's iPad keyboard folios previously haven't been great as cases, and most people would like something protective to look after the pricey iPad.",
    "We're expecting to hear about the new iPad Pro some time in early 2021, according to leaks and rumors, so we'll have to wait until then to see what's new with this Magic Keyboard 2.0."
  ],
  "headers": {
    "3": "What could we see?"
  },
  "links": {
    "new iPad Pro 2020": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "iPad Pro 2021": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2021/01/apple-has-won-5-design-patents-presented-in-photo-line-art-forms-covering-the-ipad-pro-magic-keyboard-combination.html",
    "new Magic Keyboard could ditch the touchpad": "https://www.techradar.com/news/looks-like-apples-already-planning-changes-for-the-ipad-pros-magic-keyboard"
  }
}