{
  "source": "https://www.techradar.com/news/the-sony-wf-1000xm4-are-the-best-wireless-earbuds-but-dont-buy-them-on-prime-day",
  "title": "The Sony WF-1000XM4 are the best wireless earbuds – but don’t buy them on Prime Day",
  "category": "audio-visual",
  "updated": "2021-06-12T17:00:45Z",
  "author": "olivia-tambini",
  "summary": "Save your money with the Sony WF-1000XM3",
  "article": [
    "If you’re looking for a pair of noise-cancelling earbuds this Prime Day, you may have your eye on the new Sony WF-1000XM4 – and we don’t blame you.",
    "The latest in Sony’s WF-1000X range, these excellent buds have taken the top spot of the best true wireless earbuds you can buy in 2021, thanks to their combination of incredible sound, brilliant app, useful features, and good noise cancellation.",
    "While other true wireless earbuds may beat them in specific areas (the Bose QuietComfort Earbuds provide better noise cancellation, for instance), no other pair of in-ear headphones offer such a well-rounded suite of features.",
    "However, you shouldn’t buy them this Prime Day. Instead, consider their predecessors, the Sony WF-1000XM3.",
    "Amazon Prime Day is kicking off on Monday, June 21, though we’re already starting to see early offers emerging.",
    "Initially launched as a way for the company to mitigate the mid-year spending slump, Prime Day has become a huge sales event in its own right, giving you a chance to save your cash on tech ahead of Black Friday and Cyber Monday.",
    "While you’ll be able to find deals on all sorts of products, Prime Day is a fantastic time to pick up personal audio devices at a low price. And now that the Sony WF-1000XM3 have been usurped by a newer model, you can almost guarantee that they’ll be heavily discounted, too.",
    "Costing $230 / £220 / AU$399 at launch, the Sony WF-1000XM3 were slashed in price during last year’s Prime Day sales. We saw prices drop to $178 in the US, while the earbuds hovered at around £170 in the UK.",
    "Since then, the Sony WF-1000XM3 prices have fluctuated, but have recently settled on levels similar to those we saw last Prime Day – and that means they could be discounted even further in 2021.",
    "Ever since their launch in 2019, the Sony WF-1000XM3 have consistently remained at the top of our buying guides, and were our favorite pair of wireless earbuds – that is, until the Sony WF-1000XM4 came onto the scene.",
    "These newer earbuds come with a range of upgrades, including superior noise cancellation technology, DSEE Extreme audio upscaling for low-res audio files, anIPX4 water resistance rating, and a more compact design.",
    "However, you shouldn’t write off their predecessors. For starters, the new Sony WF-1000XM4 cost $279.99 / £250 / AU$449.95 – pricier than the WF-1000XM3s’ launch price, and much more expensive when you take into account the discounts that are readily available for the older buds.",
    "In spite of all the new features that come with the newer model, the Sony WF-1000XM3 are still easily among the best true wireless earbuds you can buy, thanks to their excellent audio quality and efficient noise cancellation.",
    "At a fundamental level, both of these earbuds offer the same things, including some level of audio upscaling and ANC, decent battery lives, and comfortable designs. To some, the new features offered by the Sony WF-1000XM4 will be enough to convince them to splash their cash. But, for most, the differences are negligible, and that means it’s wise to save your money and pick up the older Sony earbuds at a discount this Prime Day.",
    "We’re not saying you shouldn’t consider buying the Sony WF-1000XM4 at all – there’s a reason why we’ve crowned them the best wireless earbuds of 2021.",
    "If you’re someone who needs particularly strong noise cancellation or you’re an audiophile looking for the best audio quality you can afford, then you may well want to buy the newest Sony earbuds.",
    "They also come with an IPX4 water resistance rating, which means they’re suitable for working out with – the Sony WF-1000XM3 don’t come with the same assurance.",
    "Whether they’ll be discounted this Prime Day? Well, that’s not clear. We wouldn’t usually expect brand new devices to be included in the biggest Prime Day deals, but it’s entirely possible that the price will come down slightly during the sales event.",
    "For that reason, we’d recommend waiting until June 21 to buy them – you never know if Amazon will decide to surprise us with a huge discount.",
    "If it does, you can expect any Sony WF-1000XM4 deals to sell out very quickly indeed. Never fear though; we’ll be here bringing you all the best Prime Day deals throughout the sales event, and we’ll be keeping a very close eye on Sony headphones this year.",
    "Can't wait until Prime Day? Check out the best Sony headphones deals we've found today:"
  ],
  "headers": {
    "4": "When is Amazon Prime Day 2021?",
    "9": "Should I buy the Sony WF-1000XM3?",
    "14": "What about the Sony WF-1000XM4?"
  },
  "links": {
    "noise-cancelling earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Sony headphones": "https://www.techradar.com/best/sony-headphones"
  }
}