{
  "source": "https://www.techradar.com/news/godaddy-builds-a-permanent-home-for-all-pro-specific-tools",
  "title": "GoDaddy builds a permanent home for all pro-specific tools",
  "category": "computing",
  "updated": "2021-04-22T09:40:30Z",
  "author": "anthony-spadafora",
  "summary": "Manage all sites from a single dashboard with GoDaddy Pro's new Hub",
  "article": [
    "Popular web hosting company GoDaddy aims to help web designers and developers manage all of their projects more efficiently with the the launch of the Hub by GoDaddy Pro.",
    "The Hub is a new and free site experience that brings together all of GoDaddy Pro's tools and solutions into a single dashboard. It can also be used to manage client sites and new tools such as to-do lists and timelines have been added to assist in keeping track of projects.",
    "Thanks to capabilities like bulk updates across hundreds of sites for WordPress Core, plugins and themes, the Hub is optimized to save GoDaddy Pro users valuable time.",
    "According to Pro users that have already tested it out, the Hub has helped them save an average of three hours per site each month by using its included site maintenance tools.",
    "GoDaddy Pro users will also have the ability to use the Hub to collaborate more easily with clients as the company added account delegation and shared shopping features.",
    "For instance, web designers and developers can access all of their client accounts with a single sign on and work on their sites from the Hub's dashboard.",
    "Getting in touch with GoDaddy Pro's customer support team is set to be faster too, as support ticketing is available directly through the Hub. Pro users will also be able to connect with the broader web design and developer community and exchange insights using the Hub.",
    "Senior director of product management at GoDaddy, Tara Wellington explained in a press release how the Hub will allow GoDaddy Pro users to more effectively run their businesses, saying:",
    "“At GoDaddy, we know how important it is to save time for website designers and developers who are busy managing the everyday tasks for their clients,\" she added.",
    "\"With the launch of the Hub, we’re providing our GoDaddy Pro members with a new and improved way to more effectively run their businesses, as well as grow their community and strengthen their website design and development skills.”"
  ],
  "headers": {
    "4": "Collaboration and support"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "keeping track of projects": "https://www.techradar.com/best/best-project-management-software",
    "WordPress Core": "https://www.techradar.com/news/wordpress-at-15-inside-the-webs-most-popular-hosting-service",
    "collaborate": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}