{
  "source": "https://www.techradar.com/news/macos-12-monterey-public-beta-is-now-available-but-its-missing-its-most-exciting-feature",
  "title": "macOS 12 Monterey public beta is now available – but it’s missing its most exciting feature",
  "category": "computing",
  "updated": "2021-07-01T17:29:47Z",
  "author": "matt-hanson",
  "summary": "Still have to wait for Universal Control",
  "article": [
    "Following on from the release of the iOS 15, iPad OS 15 and watchOS 8 public betas, Apple has now made the macOS 12 Monterey public beta available for anyone with a compatible Mac or MacBook to try out.",
    "Announced at WWDC 2021, macOS 12 Monterey is the follow up to last year’s macOS 11 Big Sur, and will be officially released as a free upgrade towards the end of 2021 (probably around September). The public beta that’s been released today lets people try out an early version of the operating system before the launch.",
    "While this allows people to get a feel for macOS 12 Monterey and some (but not all – more on that in a moment) of its new features, it’s also useful for Apple, as people using the public beta are encouraged to report and share any issues they encounter. Apple’s devs can then work on fixing those issues before the final release is made available.",
    "Because of this, it’s recommended that you only download the macOS 12 Monterey public beta on a device that you don’t rely on every day, as it’s likely there will be bugs.",
    "While the macOS 12 Monterey public beta will allow you to try out some of the new features coming to Macs thanks to the upcoming operating system, one of the most exciting features, Universal Control, is still missing (as it wasn’t included in the earlier Developer Preview either).",
    "Universal Control allows you to seamlessly use a Mac or MacBook’s mouse, trackpad and keyboard to control other Macs and even iPads. All you need to do is place them near each other, and then by moving your mouse cursor to the edge of the screen, then beyond, it will then appear on the next device.",
    "The feature was demonstrated at WWDC and it looked incredibly cool. It could be a genuinely useful feature for people who use multiple Apple devices and we can’t wait to try it out.",
    "While Universal Control takes elements of existing features, such as Continuity and Handoff, implementing it may be a bit more complex, which is why it’s not included in the Public Beta.",
    "Apple usually releases several betas before its official release, so Universal Control could come later. However, if this was the feature you were desperate to try out, then you’re better off waiting instead.",
    "Unlike the Developer Preview, which was only available to people who were part of the Apple’s Developer Program (and which costs money to join), the public beta is available to everyone as long as they have a compatible Mac.",
    "If you want to try it out, first make sure to back up your Mac. This is an early version of the operating system, so some bugs may be present, and if there are problems, your important data will at least be safe. For information on how to do this, head over to our ultimate guide to backing up your Mac.",
    "Once done, you’ll need to enrol in the Apple Beta Software Program. Once you’ve signed up to it, you should get a notification in your Mac that a new public beta is available.",
    "Open up System Preferences and then select ‘Software Update’. The macOS 12 Monterey public beta should be there. Click on it and follow the instructions to download and install.",
    "For more guidance, check out our how to install macOS 12 Monterey guide."
  ],
  "headers": {
    "4": "Oh, Universal Control where art thou?",
    "9": "How to download the macOS 12 Monterey public beta"
  },
  "links": {
    "from the release of the iOS 15, iPad OS 15 and watchOS 8 public betas": "https://www.techradar.com/news/ios-15-public-beta-is-here-along-with-ipados-15-and-watchos-8-early-looks",
    "macOS 12 Monterey": "https://www.techradar.com/news/macos-12",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "Apple’s Developer Program": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1150953294880950500&u=https%3A%2F%2Fdeveloper.apple.com%2Fprograms%2Fenroll%2F",
    "ultimate guide to backing up your Mac": "https://www.techradar.com/how-to/computing/the-ultimate-guide-to-backing-up-your-mac-1318501",
    "Apple Beta Software Program": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4723842924294838000&sharedId=trd-us&u=https%3A%2F%2Fbeta.apple.com%2Fsp%2Fbetaprogram%2F",
    "how to install macOS 12 Monterey": "https://www.techradar.com/how-to/how-to-download-and-install-macos-12-monterey"
  }
}