{
  "source": "https://www.techradar.com/news/google-assistant-mispronouncing-your-name-thats-about-to-change",
  "title": "Google Assistant mispronouncing your name? That's about to change",
  "category": "smart-home",
  "updated": "2021-04-29T03:06:28.424Z",
  "author": "jasmine-gearie",
  "summary": "Plus improvements to setting timers and alarms",
  "article": [
    "Do you have a name that Google Assistant consistently mispronounces? The tech giant’s latest update to its voice assistant will (hopefully) fix that problem by allowing you to teach it how to pronounce difficult names (yours or your contacts').",
    "As shown in the video below, it works by you saying the name out loud, which Google Assistant will listen to and remember. The next time you say the name aloud, the virtual voice will be able to recognize and repeat it back to you correctly.",
    "It’s currently only available in English, though according to Google’s blog post, it’s looking to support other languages soon.",
    "Google also wants you to have more ‘natural conversations’ with Google Assistant, which should become possible thanks to the addition of the search giant’s neural network-based Bidirectional Encoder Representations from Transformers (BERT) technology. This allows Assistant to process a whole bunch of words together, rather than one by one.",
    "For example, if you stop mid-sentence and change your mind during a request like, “Ok Google, set a timer for five, no wait, nine minutes,” Assistant will now know to ignore the first request. This update will come first to alarms and timers.",
    "The voice assistant would also previously run into problems when you had multiple timers on the go, and if you asked to cancel one, it would struggle to know which you were referring to. With the new update, Assistant will be able to infer what you mean when you ask, “Ok Google, cancel my second timer.”",
    "This might seem like a small change, but Google says it “fully rebuilt Assistant’s natural language understanding” so it could respond to alarm and timer requests “nearly 100 percent accurately.”",
    "These updates are currently only rolling out to smart speakers set to the English language in the US only. Google says it will be rolled out to smartphones and smart displays soon, though there’s no indication of global availability as of yet.",
    "According to Google, machine learning has also improved your ability to have a flowing conversation with Google Assistant when using your phone or smart display. It’s able to understand what’s currently being displayed on the device, and better interpret your follow-up questions.",
    "The example Google gives is Miami: you can ask, “what’s the weather in Miami this weekend?” and then follow up with, “show me the nicest beaches”, and Assistant will know you want to see beaches in Miami."
  ],
  "headers": {
    "3": "Right on time",
    "8": "A flowing conversation"
  },
  "links": {
    "blog post": "https://blog.google/products/assistant/loud-and-clear-ai-improving-assistant-conversations/"
  }
}