{
  "source": "https://www.techradar.com/news/google-docs-is-finally-solving-this-major-editing-pain",
  "title": "Google Docs is finally solving this major editing pain",
  "category": "computing",
  "updated": "2021-12-09T18:30:17Z",
  "author": "anthony-spadafora",
  "summary": "Working with tables just got a whole lot easier in Docs",
  "article": [
    "Google is currently working on a new update for its office software that will make customizing tables in Google Docs more intuitive and easier to do.",
    "While Google Workspace includes its own spreadsheet software in Sheets, many people prefer to use Docs to add inline tables to their documents.",
    "According to a new post in the Google Workspace blog, the search giant is adding several new ways to customize tables in Google Docs to give users more ways to present information to their readers.",
    "This new update is rolling out now and will be available to all Google Workspace customers as well as G Suite Basic and Business customers and even those with personal Google Accounts.",
    "First off, Google is adding a new sidebar to Docs to make it easier for users to manage a table's rows, columns, alignment and other properties. Just like when editing an image in Docs, all of these edits are “reflected in your document in real time”.",
    "At the same time, the company is adding a new, intuitive button for creating new rows or columns in a table that will appear as an overlay as you hover over a table in Docs.",
    "When it comes to pages, Google Docs users can now pin a table header row to repeat on each page to make it easier to see column headers for long tables while navigating a document as well as designate that a row should not be split across pages.",
    "Finally, Google is making it possible to sort the rows of a table in either an ascending or descending order. However, any pinned table headers will still remain at the top of your tables.",
    "Now that Google is making it easier to use tables in Docs, we'll likely see more users incorporating them into their documents to present information as opposed to linking to a separate spreadsheet in Sheets.",
    "We've also rounded up the best free office software and best online collaboration tools",
    "Via 9To5Google"
  ],
  "headers": {
    "4": "Customizing and editing tables in Docs"
  },
  "links": {
    "office software": "https://www.techradar.com/best/free-office-software",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "Sheets": "https://www.techradar.com/reviews/google-sheets",
    "new post": "https://workspaceupdates.googleblog.com/2021/12/new-ways-to-customize-tables-in-google.html",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "editing an image": "https://www.techradar.com/news/google-docs-is-finally-getting-a-much-awaited-feature",
    "best free office software": "https://www.techradar.com/best/free-office-software",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "9To5Google": "https://9to5google.com/2021/12/07/google-docs-customize-tables/"
  }
}