{
  "source": "https://www.techradar.com/news/personal-safety-app-for-women-sees-surge-in-downloads-following-london-killing",
  "title": "Personal safety app for women sees surge in downloads after London killing",
  "category": "phones",
  "updated": "2021-03-17T10:54:00Z",
  "author": "olivia-tambini",
  "summary": "The app that 'shouldn't have to exist'",
  "article": [
    "[Update: WalkSafe is now approaching 300,000 downloads as of March 17. The original story follows below.]",
    "A personal safety app designed for women has seen 100,000 downloads in a mere five days, shooting to the top of the free apps chart on the Apple App Store.",
    "WalkSafe, which is reportedly being downloaded 1,000 times every 10 minutes at the time of writing, features a map that shows crime figures taken from monthly police reports in the area, including sexual assault, mugging, knife crime, and pickpocketing.",
    "Users can then choose to avoid crime hotspots where possible, and the app will alert you when you're near these locations.",
    "There's also a HomeSafe feature, which lets you set an estimated time of arrival when you set off, and will send your location to an emergency contact if you don't complete your journey in time. It's a handy feature, and saves you having to text a friend or loved one every time you leave your home. You can also set a reminder for emergency contacts to check in with you at a specific time.",
    "Finally, a TapSafe feature allows you to check in with your friends or loved ones if you're feeling worried while out and about. These contacts will be notified as soon as you open the feature.",
    "There are two buttons you can tap – 'OK', which requires you to check in every 30 seconds, and 'Nervous', which needs to be tapped every 10 seconds before your loved ones are alerted again and shown your location.",
    "While we haven't tested the app for ourselves yet, this feature seems particularly useful, as there isn't always time to make a call or send a text when you're in a potentially dangerous situation, or just feeling unsafe while walking home.",
    "Personal safety apps like WalkSafe can be hugely reassuring to those who don't always feel safe while walking alone, but as co-founder Emma Kay concedes, it's unfortunate that there's a need for them at all.",
    "“This app should not have to exist, but if creating it helps just one person avoid a bad situation, it’s worth it,\" she says.",
    "WalkSafe is certainly growing in popularity – and with the surge in downloads taking place over the last week, it's not hard to see a link between that and the recent disappearance and killing of London woman Sarah Everard, which has put a renewed focus on the issue of women's safety both in the UK and beyond.",
    "The company told TechRadar that it had noticed a correlation, saying the increase in downloads \"is in direct relation to the conversation on women’s safety\".",
    "\"We have had thousands of shares across all of our social accounts from women encouraging other women to be as safe as they can with a recommendation to use our app.\"",
    "WalkSafe isn't the only personal safety app that's particularly geared towards women. Hollie Guard, which was created in memory of Hollie Gazzard, who was murdered at her workplace by her ex-boyfriend in 2014, sends an alert to your emergency contacts when you shake your phone.",
    "According to the Hollie Gazzard Trust, the app has now been downloaded by over 200,000 people, with \"a significant number\" coming after the death of Sarah Everard\".",
    "In addition to these apps, many smartphones and smartwatches can be set up to send your last-known location to emergency contacts when you're unable to talk on the phone. Some features even allow you to call the emergency services without having to type in the number.",
    "Of course, even the best apps and cleverest smartphone features can't protect against every eventuality, and nor should they have to.",
    "As Fiona Dwyer, CEO of domestic abuse charity SolaceAid said in a statement about the death of Sarah Everard: \"By all accounts, Sarah had planned her walk home based on what we as women learn from an early age – wear bright clothes, walk down well-lit main streets and keep in contact with others – this is an everyday occurrence for all women and this needs to change as it is not enough to protect women.\"",
    "For now, it makes good sense to use technology if it helps to make you feel safer when you're walking alone – but hopefully, there will be a time when it's no longer needed."
  ],
  "headers": {
    "8": "Growing concerns"
  },
  "links": {
    "WalkSafe": "https://www.walksafe.io/",
    "Hollie Guard": "https://hollieguard.com/#home",
    "Hollie Gazzard Trust": "https://holliegazzard.org/hollie-guard-reaches-200000-downloads/",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "send your last-known location to emergency contacts": "https://www.techradar.com/how-to/how-to-use-emergency-sos-features-on-your-iphone-android-phone-or-smartwatch",
    "best apps": "https://www.techradar.com/best/best-android-apps-2021",
    "SolaceAid": "https://www.solacewomensaid.org/"
  }
}