{
  "source": "https://www.techradar.com/news/google-pixel-6-chipset-could-rival-the-snapdragon-870",
  "title": "Google Pixel 6 chipset could rival the Snapdragon 870",
  "category": "phones",
  "updated": "2021-05-25T12:59:42Z",
  "author": "james-rogerson",
  "summary": "But not the Snapdragon 888",
  "article": [
    "Recently a leaker claimed that the Google Pixel 6’s rumored Whitechapel chipset would be less powerful than the flagship Snapdragon 888, and we theorized at the time that it might be in line with the Snapdragon 870. Now a new leak suggests we might be right.",
    "According to @heyitsyogesh (a data engineer and leaker), current performance from the Whitechapel chipset is close to the Snapdragon 870. The Snapdragon 870 is a fairly high-end but not top-end chipset, found in the likes of the Moto G100 and the Xiaomi Poco F3. So as with the Pixel 5, the Pixel 6 probably won’t quite have flagship power.",
    "The source claims that Whitechapel’s performance is reaching this sort of level on PVT (Production Validation Test) units. PVT units are intended to be the final build, so don’t expect the performance to improve by the time the Pixel 6 launches.",
    "Other details about the chipset are in line what we’ve already heard – it’s apparently a 5nm one (like the Snapdragon 888), and is said to put a focus on machine learning and AI performance. Apparently it matches “other leading mobile chips” for raw AI performance, and its GPU is said to perform well under stress.",
    "It sounds like a solid chipset then, and for most users the fact that it possibly won’t quite match the Snapdragon 888 likely won’t really matter or be noticeable – that extra power mostly comes into play for demanding games and video editing and the like.",
    "Plus, presumably the use of a slightly lower end chipset will mean a lower cost for the Google Pixel 6 itself.",
    "And aside from the chipset, the Pixel 6 range sounds like it could compete with the best phones around. That’s particularly true in the case of the Pixel 6 Pro, which based on previous rumors might have a 6.67-inch QHD AMOLED screen with a 120Hz refresh rate, a 5,000mAh battery, and a triple-lens camera.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "less powerful than the flagship Snapdragon 888": "https://www.techradar.com/news/google-pixel-6-might-have-a-disappointing-chipset-and-an-upgraded-camera",
    "@heyitsyogesh": "https://twitter.com/heyitsyogesh/status/1396754062528241666",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Xiaomi Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "GSMArena": "https://www.gsmarena.com/further_pixel_6_details__whitechapel_matches_sd870_120hz_display_5000mah_battery-news-49284.php"
  }
}