{
  "source": "https://www.techradar.com/news/honor-50-release-date-confirmed-to-be-june-16",
  "title": "Honor 50 launch confirmed to be June 16 - but you'll have to wait to buy it",
  "category": "phones",
  "updated": "2021-06-01T10:41:34Z",
  "author": "james-rogerson",
  "summary": "A global launch is later",
  "article": [
    "Update: after we wrote this story, Honor confirmed that the June 16 event is a China-only launch. Therefore you shouldn't expect global launch information, and the price will only be in Yuan.",
    "However, Honor teased that a global launch would be on the cards for later in the year, so if you're interested in Honor's next phone, you might actually be able to buy it - but while this June 16 event will show you what it's like, you'll have to wait longer to buy it.",
    "The original article follows below:",
    "The wait for the Honor 50 range is almost over, as we now know that it’s being announced on June 16. It’s a date that’s not terribly surprising, given that the company had previously said we’d hear more about the Honor 50 at some point in June.",
    "Bhavya Siddappa (a senior global PR manager at Honor) revealed the date in a tweet. Oddly, the Honor Global account itself doesn’t seem to have shared this date at the time of writing, but the announcement date has also been posted by Honor on Weibo (a Chinese social network), as spotted by GSMArena.",
    "Given that Siddappa works for Honor Global it’s also very likely that the Honor 50 range will get a wide release, rather than being limited to China – though the lack of any post on the official Honor Global account is a slight concern on that front.",
    "Siddappa’s tweet doesn’t really provide any additional clues about the range, though the two circles on the included image possibly represent the big circular camera blocks on the Honor 50.",
    "Indeed, the post on Weibo includes a video highlighting at least one circular camera block, so this aspect of the design is now confirmed, and the focus on it suggests photography will be a major feature of the Honor 50 range.",
    "We also know that at least model in the range will use the mid-range Snapdragon 778G chipset, but rumors suggest there could also be an Honor 50 Pro Plus with some truly top-end specs, including a Snapdragon 888 chipset and a 120Hz QHD screen.",
    "With the full range presumably being unveiled on June 16 we’ll know for sure soon, and TechRadar will cover the announcement in full, so check back then for all the details."
  ],
  "headers": {},
  "links": {
    "Honor 50": "https://www.techradar.com/reviews/honor-50-review",
    "in a tweet": "https://twitter.com/bhavis/status/1399599535077220356",
    "GSMArena": "https://www.gsmarena.com/honor_50_series_launch_date-news-49393.php",
    "will use the mid-range Snapdragon 778G chipset": "https://www.techradar.com/news/honor-50-release-date-is-likely-june-and-you-might-actually-be-able-to-buy-it"
  }
}