{
  "source": "https://www.techradar.com/news/amd-has-more-stock-of-its-own-rx-6000-graphics-cards-coming-soon",
  "title": "AMD has more stock of its own RX 6000 graphics cards coming soon",
  "category": "components",
  "updated": "2021-02-02T17:47:54Z",
  "author": "darren-allan",
  "summary": "Exec confirms availability of reference boards in Q1",
  "article": [
    "AMD is planning to ensure that additional RX 6000 series graphics cards are available in the first quarter of 2021, which we’ve heard reported before – but now an executive has confirmed this will be the case with the firm’s reference boards.",
    "Riche Corpus, Senior Director at Radeon Technologies Group, AMD, spoke with BabelTechReviews (as spotted by VideoCardz), and confirmed that: “Based on the response to our AMD Radeon RX 6800 Series and Radeon RX 6900 XT reference design graphics cards, we are extending production to make them available to as many gamers as possible on AMD.com at SEP.",
    "“Additional reference cards are expected to be available in the first quarter of 2021. We will also continue supporting our partners in the development of their custom AMD Radeon RX 6000 Series graphics card designs.”",
    "‘SEP’ refers to the recommended price, and as we saw before, while AMD intended to curtail production of its own reference boards for these Big Navi GPUs, as would normally happen, the stock issues which have hit the graphics cards – and the hiked up prices for third-party boards as a result – led to the decision to keep production of AMD’s own cards rolling.",
    "AMD made that decision back in December 2020, and then another report emerged in January 2021 which asserted that AMD said its Radeon RX 6800, 6800 XT and 6900 XT reference boards would be available on its own website at their sticker prices during the first quarter.",
    "So, it’s good to get confirmation from AMD that these cards are ‘expected’ to be coming in additional quantities in Q1, so that could hopefully mean we get some availability perhaps later in February, with any luck.",
    "How long those stocks will last when pegged at the recommended retail price is another matter – they surely won’t be hanging around for long. Supplying as “many gamers as possible” is a rather vague sounding target (that we’ve heard from AMD before), so it remains to be seen exactly what kind of quantities we will witness with these reference cards going forward.",
    "Given that vagueness and the fact that AMD has made noises about the ‘tightness’ of supply in terms of ‘consumer, PC, and gaming product lines’ during the first half of 2021, we wouldn’t get too excited yet – but still, any (relatively) affordably priced RX 6000 stock pitching up is obviously a boon."
  ],
  "headers": {
    "5": "Vague expectations"
  },
  "links": {
    "we’ve heard reported before": "https://www.techradar.com/news/nvidia-rtx-3000-stock-may-not-improve-until-may-and-amds-gpu-outlook-isnt-great-either",
    "BabelTechReviews": "https://babeltechreviews.com/amd-on-the-future-of-vr-interview/",
    "VideoCardz": "https://videocardz.com/newz/amd-promises-additional-rx-6900-6800-reference-cards-to-be-available-in-the-first-quarter",
    "Big Navi GPUs": "https://www.techradar.com/news/amd-big-navi",
    "decision to keep production of AMD’s own cards rolling": "https://www.techradar.com/news/amd-changes-its-mind-about-killing-off-reference-design-rx-6000-gpus",
    "another report emerged": "https://www.techradar.com/news/nvidia-rtx-3000-stock-may-not-improve-until-may-and-amds-gpu-outlook-isnt-great-either",
    "6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "AMD": "https://www.techradar.com/news/nvidia-rtx-3000-stock-may-not-improve-until-may-and-amds-gpu-outlook-isnt-great-either",
    "noises": "https://www.techradar.com/news/amd-ryzen-cpus-help-drive-record-breaking-revenue-but-the-news-isnt-all-good"
  }
}