{
  "source": "https://www.techradar.com/news/samsung-is-going-to-ditch-the-ads-it-shows-in-its-mobile-apps",
  "title": "Samsung is going to ditch the ads it shows in its mobile apps",
  "category": "phones",
  "updated": "2021-08-19T11:08:39Z",
  "author": "david-nield",
  "summary": "So long and thanks for nothing",
  "article": [
    "It's unlikely that you'd find anyone who's a fan of the adverts that Samsung pushes through its stock mobile apps – including Samsung Weather and Samsung Pay – and the company has now confirmed that the ad slots will be pulled before the end of the year.",
    "As first reported by Yonap, Samsung president TM Roh was the first to intimate that the default Samsung apps would soon be going ad-free. His words were later backed up by an official Samsung statement given to The Verge.",
    "\"Samsung has made a decision to cease the advertisement on proprietary apps including Samsung Weather, Samsung Pay, and Samsung Theme,\" the statement reads. \"The update will be ready by later this year.\"",
    "Even top-tier, super-expensive handsets like the Samsung Galaxy S21 Ultra carry these ads at the moment, and while they no doubt help boost Samsung's profits, they inevitably get in the way of the user experience.",
    "Samsung usually pushes out a major update to its One UI software every November or December, so it's possible that the ads will disappear then – though Samsung hasn't specifically said they'll be going from every single app it develops.",
    "\"Our priority is to deliver innovative mobile experiences for our consumers based on their needs and wants,\" Samsung says. \"We value feedback from our users and continue our commitment to provide them with the best possible experience from our Galaxy products and services.\"",
    "We understand that Samsung needs to make money, just like every other company, but putting ads inside its mobile apps has always felt like a bad call – especially considering they show up on devices that can cost four-figure sums.",
    "Samsung is far from alone here: Google makes much of its money from ads, Amazon will knock down Kindle prices if you let it put adverts on the home screen, and even Apple has been known to dabble in a bit of intrusive marketing with its push notifications for new shows on Apple TV Plus.",
    "What's more, many third-party mobile apps and games use embedded adverts so the developers can make their money back. It just seems that Samsung is losing a lot of user goodwill in return for what we assume isn't a huge revenue stream.",
    "By cutting out the adverts in future versions of these stock apps, Samsung is going to get something back of great value – happier customers. It's going to make users far less likely to immediately switch to other apps as soon as they boot up their new Samsung devices."
  ],
  "headers": {
    "3": "Death of a sales slot",
    "6": "Analysis: fewer ads means happier users"
  },
  "links": {
    "Yonap": "https://www.yna.co.kr/view/AKR20210817140800017",
    "The Verge": "https://www.theverge.com/2021/8/18/22630332/samsung-ads-default-stock-apps-weather-pay-theme-confirmed",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus"
  }
}