{
  "source": "https://www.techradar.com/news/after-airtags-launch-tile-to-ask-congress-to-look-into-apple-over-antitrust-concerns",
  "title": "After AirTags launch, Tile to ask Congress to look into Apple over antitrust concerns",
  "category": "phones",
  "updated": "2021-04-20T23:40:42Z",
  "author": "david-lumb",
  "summary": "AirTags vs. Tile is on",
  "article": [
    "After years of rumors, the Apple AirTags were finally revealed during the Spring Ahead Apple Event on April 20, which are expected to function much like Tile trackers that can harness the network of iPhones and other devices to help locate them. Now the CEO of Tile has made a statement that, among other things, calls on US Congress to investigate Apple over antitrust concerns.",
    "“We welcome competition, as long as it is fair competition. Unfortunately, given Apple’s well-documented history of using its platform advantage to unfairly limit competition for its products, we’re skeptical,” Tile CEO CJ Prober said in a statement, according to TechCrunch.",
    "“And given our prior history with Apple, we think it is entirely appropriate for Congress to take a closer look at Apple’s business practices specific to its entry into this category. We welcome the opportunity to discuss these issues further in front of Congress tomorrow.”",
    "Prober had already been slated to testify in front of US Congress on Wednesday, April 21, alongside other companies like Spotify and Match to discuss Google and Apple’s app store policies, per Bloomberg. All three of the former are part of the Coalition for App Fairness (CAF), which has been critical of what they call antitrust policies in Google and Apple’s respective app stores.",
    "Another member of CAF is Epic Games, which filed lawsuits against Google and Apple for their app store policies. While the former suit was seemingly settled, the latter is set to proceed in a legal clash over whether other other app stores are allowed on Apple products.",
    "All members of CAF, including Tile, have argued against Apple’s policy of taking up to a 30% cut of in-app revenue as a requirement to be downloaded on the App Store – and functionally to be on iPhones and iPads at all.",
    "Earlier in April, Apple opened up its Find My network to third parties, though these products would have to work within the Find My app. As TechCrunch reports, Tile seemingly doesn’t want to give up its customer relationships and interactions through its own app, and claims Apple’s advantages – its ecosystem of devices that populate the Find My network, along with the advantage of owning the platform – amount to antitrust advantage.",
    "Apple rebutted these claims in a statement to TechCrunch, asserting that Find My was introduced over a decade ago to “help users locate and manage lost devices in a private and secure way” and has opened the service up to third-party devices since then.",
    "“We have always embraced competition as the best way to drive great experiences for our customers, and we have worked hard to build a platform in iOS that enables third-party developers to thrive,” the statement concluded.",
    "Via 9to5Mac"
  ],
  "headers": {
    "6": "Apple vs. Tile"
  },
  "links": {
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "TechCrunch": "https://techcrunch.com/2021/04/20/tile-bashes-apples-new-airtag-as-unfair-competition/",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-19/senate-to-call-spotify-match-at-apple-google-antitrust-hearing?sref=HrWXCALa",
    "legal clash": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "opened": "https://www.techradar.com/news/apple-airtags-rumors-find-new-life-as-find-my-app-gets-a-big-update",
    "9to5Mac": "https://9to5mac.com/2021/04/20/tile-spooked-by-airtags-competition/"
  }
}