{
  "source": "https://www.techradar.com/news/the-best-smart-tv-platform-is-coming-to-a-whole-new-range-of-tvs",
  "title": "LG's webOS smart platform is coming to a lot more TVs",
  "category": "televisions",
  "updated": "2021-02-24T12:32:10Z",
  "author": "henry-st-leger",
  "summary": "LG's webOS interface spreads its wings",
  "article": [
    "One of the biggest perks of LG TVs is set to make a move to the competition, after LG Electronics announced its webOS smart TV platform was becoming hardware agnostic and being licensed by a host of other television manufacturers.",
    "That means the webOS interface will soon be landing on non-LG televisions, bringing the sleek design and ease of use of the OS to other TV hardware, ostensibly slightly more budget brands that could bring the platform to a wider range of viewers.",
    "A press release for the announcements states that \"Over twenty TV manufacturers from around the world have already committed to the webOS partnership, including brands such as RCA, Ayonz and Konka with more partners expected to join in the future.\"",
    "It's not an unprecedented move, given there are a few TV operating systems that are used across different TV brands, such as Roku OS (used by TCL and Hisense), Fire TV (used by Toshiba and Insignia) or Android TV (Sony, Philips, Hisense).",
    "But webOS is certainly one of best smart TV platforms out there, and arguably the best of the lot.",
    "That's thanks to a sleek horizontal overlay of apps and inputs, great app support, and impressive overall speed, making it easy to navigate as well as easy on the eyes (something that some competing platforms could take a lesson from).",
    "The announcement comes shortly after LG unveiled a new sixth iteration of the platform, titled webOS 6.0 – which expands the home screen and overhauls the app layout to fit more on the screen at one time.",
    "Possibly the most exciting part of the announcement, though, is that \"Compatible TV models also include the dedicated Magic Motion remote controller.\"",
    "For those who don't know, LG's Magic Remote is a unique piece of clicking hardware that allows you to point directly at the button, app, or part of the screen you want to navigate you, much like a laser pointer or Wii Remote.",
    "This addition suggests viewers will be getting a fleshed-out webOS experience, rather than simply a basic iteration of it.",
    "The Magic Remote has been upgraded for 2021 too, boasting \"simpler controls when using voice recognition\" and one-touch NFC functionality for easy casting to a TV screen – though we're yet to hear whether all of these capabilities will be available on every set.",
    "The webOS platform is compatible with Amazon Alexa, Google Assistant, and LG's ThinQ AI assistant, meaning you also have all the important options for voice commands (sorry Bixby).",
    "LG's new webOS 6.0 home screen and Magic Remote will be available across the company's 2021 OLED, QNED Mini LED, NanoCell and UHD smart TVs – and while we're yet to year of any specific third-party models, you can be sure that they're not far behind."
  ],
  "headers": {
    "7": "Magic in the air"
  },
  "links": {
    "LG TVs": "https://www.techradar.com/best/best-lg-tv",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "best smart TV": "https://www.techradar.com/news/best-tv",
    "new sixth iteration of the platform": "https://www.techradar.com/news/lg-debuts-updated-smart-tv-platform-with-more-intuitive-and-user-friendly-ui",
    "Amazon Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Bixby": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QNED": "https://www.techradar.com/news/what-is-qned",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv"
  }
}