{
  "source": "https://www.techradar.com/news/steam-deck-kills-total-war-saga-troy-linux-port-but-what-does-this-mean-for-other-games",
  "title": "Steam Deck kills Total War Saga: Troy Linux port – but what does this mean for other games?",
  "category": "gaming",
  "updated": "2021-07-29T15:06:20Z",
  "author": "darren-allan",
  "summary": "Valve’s big push with Proton could work out for the best in the end",
  "article": [
    "Total War Saga: Troy won’t be ported to Linux, with the potential native version of the game having been officially canned by Feral Interactive – and doubt being cast on further conversions to Linux.",
    "Feral is well-known for porting big-name games across to Linux, but with Troy it’s only doing a Mac version to follow the release of the strategy game on Steam (following its exclusivity period with Epic expiring).",
    "When a tweet (flagged up by Gaming on Linux) about the macOS version made no mention of a Linux port, a Twitter denizen observed that “basically Linux ports are not a thing anymore”, and Feral replied to clarify that Troy had reached the end of the line with a potential Linux spin.",
    "As per that tweet, Feral says that going forward, it’ll “assess the feasibility of porting games to Linux”, but the observation about there being “less demand” for Linux ports since Valve bust onto the scene with Proton is a telling hint of a gloomy picture in the future, at least in terms of the viability of native conversions. (Note also that Feral clarified that it will “continue to support existing products as necessary” regarding Linux ports).",
    "Proton is Valve’s compatibility layer for running Windows games on Linux, which offers an alternative way of getting any given title onto Linux. The downside is the performance overhead in doing this, but the obvious upside is that no work has to be done on a native conversion, and lots of games (not all, note – there are still potential issues with some titles, and in particular games with anti-cheat software) can be enjoyed via Proton just as-is using the Windows version. Not just a very limited amount of titles that outfits like Feral decide to port.",
    "At this point, you might be asking: what has the Steam Deck got to do with killing off Troy or potentially other future Linux ports? Well, Valve’s portable gaming PC runs a custom version of the Linux-based Steam OS and uses Proton for compatibility with Windows games. And the reason Proton has been pushed so much since its inception – at the potential expense of native Linux ports – we can now see is because Valve’s end goal was the release of the Steam Deck.",
    "Firstly, we shouldn’t get carried away here. Troy is a bit of an outlier in that Epic initially gave it away free for a day, and it worked on Linux via Wine (plus DXVK, a translation layer) off the bat, so that suggests limited mileage in terms of sales of a port anyway (lots of gamers having grabbed it speculatively at no cost).",
    "However, as we’ve outlined above, Feral’s tweet sounds pretty ominous for the future of native Linux ports – but looking into this more deeply, there’s potentially both good and bad news here.",
    "It’s true enough that if native ports dwindle or die off, Linux gamers are losing some obvious advantages. For example, with ports, stuff like DRM which Windows versions have may be removed for Linux. Also, the ported game will run at full speed with no performance overhead (that the Proton compatibility layer introduces), and there should be – if the port is done well, of course – less likelihood of glitches or issues which can be hit with Proton (for example, a multiplayer game not working due to anti-cheat).",
    "However, Valve has promised it is working to tackle current compatibility issues around anti-cheat ahead of the Steam Deck’s launch, and in general, the company will obviously now be pushing as hard as it can to refine Proton and ensure the best experience when its handheld arrives. This kind of overdrive development could in theory mean many more games working better on Linux via Proton right away when they’re released on Windows, with no need to wait for devs like Feral to go through a lengthy process of porting.",
    "So, there are elements of a double-edged sword here, but when you consider that native Linux ports aren’t always executed as well as they could be, the direction Valve is now ushering Linux gaming in could well work out for the best ultimately.",
    "Via Rock Paper Shotgun"
  ],
  "headers": {
    "6": "Analysis: Proton torpedoes native ports?"
  },
  "links": {
    "Total War Saga: Troy": "https://www.techradar.com/news/total-war-saga-troy-will-be-an-epic-games-store-exclusive-and-free-for-24-hours",
    "well-known for porting big-name games across to Linux": "https://www.techradar.com/news/hitman-sneaks-onto-linux-to-strengthen-its-library-of-games",
    "Gaming on Linux": "https://www.gamingonlinux.com/2021/07/feral-no-longer-porting-a-total-war-saga-troy-to-linux-citing-less-demand-since-proton",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Steam OS": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/steamos-1209037/review",
    "Rock Paper Shotgun": "https://www.rockpapershotgun.com/steam-decks-proton-a-total-war-saga"
  }
}