{
  "source": "https://www.techradar.com/news/outlook-down-microsofts-email-service-failing-to-receive-messages",
  "title": "Outlook down: Microsoft's email service slowly recovering",
  "category": "computing",
  "updated": "2021-04-22T17:44:38Z",
  "author": "joel-khalili",
  "summary": "Microsoft's email service appears to be suffering an outage.",
  "article": [
    "Update: While some users are still reporting issues, the number of complaints has now fallen off drastically. Microsoft is still yet to formally acknowledge the outage, suggesting a quick fix has resolved the problems for many users.",
    "Original story: Email service Outlook appears to be suffering an outage, predominantly affecting users in the United States.",
    "According to data from DownDetector, issues began at roughly 11am ET/4pm BST, preventing users from receiving messages and, in some cases, logging into their accounts.",
    "Currently, however, the Microsoft status portal is reporting no issues whatsover, so the source of the problems is unclear. Neither has Microsoft acknowledged an issue via social channels.",
    "We'll update this page as new information emerges...",
    "On Twitter, Outlook users are reporting various different problems, ranging from mail delivery issues to errors affecting email signatures.",
    "Others are complaining about the poor timing of the outage, just as users in the US enter the thick of their working day.",
    "An account attached to Arizona State University claims Microsoft has been made aware of the issue and is currently investigating, although it's unclear where this information has come from.",
    "Although users from across the US have reported Outlook issues, the greatest number of reports appear to be coming from major cities in the east, such as New York and Atlanta.",
    "It's worth noting that complaints appear to be tailing off, suggesting Microsoft may have rectified the problems - at least for some areas."
  ],
  "headers": {
    "5": "Outlook outage"
  },
  "links": {
    "Email": "https://www.techradar.com/news/best-email-provider",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "DownDetector": "https://downdetector.com/status/outlook/",
    "status portal": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1099214855974033000&xs=1&url=https%3A%2F%2Fportal.office.com%2Fservicestatus&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Foutlook-down-microsofts-email-service-failing-to-receive-messages",
    "account": "https://twitter.com/asuoutages"
  }
}