{
  "source": "https://www.techradar.com/news/netflix-is-finally-moving-ahead-with-russian-doll-season-2",
  "title": "Netflix is finally moving ahead with Russian Doll season 2",
  "category": "entertainment",
  "updated": "2021-03-10T09:58:17Z",
  "author": "samuel-roberts",
  "summary": "Annie Murphy from Schitt's Creek joins the second season",
  "article": [
    "Two years after the show debuted on Netflix, Russian Doll season 2 has begun filming in New York City. In addition, the show has cast Schitt's Creek actress Annie Murphy for its next run of episodes.",
    "Murphy's role in the show is being kept under wraps, according to Variety – as are story details on season 2. But the return of one of Netflix's best originals to date is definitely great news for fans of good television.",
    "Russian Doll is co-created by star Natasha Lyonne, Parks and Rec's Amy Poehler and Leslye Headland – who is working on Star Wars TV show The Acolyte.",
    "Not much has been said about Russian Doll season 2 publicly, but back in July 2019, Lyonne said the following about the direction of the show to Entertainment Tonight. \"I'm very moved that people are interested into the deep end and that was the revelation of Russian Doll connecting, so I guess my intention in our plans are to continue to dig deep in a way that is aesthetically enjoyable and feels funny on your insides.\"",
    "Season 2 was originally meant to film back in 2020, but like so many TV shows and movies, the pandemic bumped those plans back. We're expecting Russian Doll season 2's release date to be some time early next year on Netflix – but we'll have to wait and see on that front.",
    "Nadia (Natasha Lyonne) is a game designer who's stuck in a time loop, reliving her 36th birthday party over and over again – except she's not alone, as she's joined by Alan (Charlie Barnett), who's also stuck in a time loop. Both characters are forced to reconcile with their own personal issues as the day loops over and over again, something we can certainly relate to right now.",
    "This show is funny, sometimes dark and an innovative spin on the well-worn Groundhog Day concept. In recent years, this format has become particularly popular in Hollywood, with Tom Cruise action movie Edge of Tomorrow and last year's Andy Samberg comedy Palm Springs putting their own nerdy twists on the idea of repeating a day over and over again.",
    "If you haven't seen Russian Doll yet, then, now's a good time to check it out."
  ],
  "headers": {
    "5": "Why you should watch Russian Doll (if you haven't already)"
  },
  "links": {
    "Variety": "https://variety.com/2021/tv/news/schitts-creek-annie-murphy-russian-doll-season-2-1234925630/",
    "Star Wars TV show": "https://www.techradar.com/news/new-star-wars-movies-and-tv-shows",
    "Entertainment Tonight": "https://www.etonline.com/natasha-lyonne-on-russian-dolls-13-emmy-nominations-and-what-to-expect-in-season-2-exclusive-128674",
    "something we can certainly relate to right now": "https://www.techradar.com/news/russian-doll-is-the-perfect-netflix-show-for-our-repetitive-times",
    "Palm Springs": "https://www.techradar.com/news/how-to-watch-palm-springs-online-stream-hulu"
  }
}