{
  "source": "https://www.techradar.com/news/iphone-13-pro-final-design-leaked-in-high-quality-renders",
  "title": "iPhone 13 Pro design leaked in high-quality renders",
  "category": "phones",
  "updated": "2021-05-24T09:41:50Z",
  "author": "james-rogerson",
  "summary": "Smaller notch, bigger cameras",
  "article": [
    "We’ve already seen a few images of the possible iPhone 13 Pro design, but now we’re getting our first look at what’s apparently the ‘finalized version’, meaning this should be exactly what the phone looks like when it ships in September.",
    "That’s according to LeaksApplePro, who shared a few unofficial renders of this apparently final model. Tthey added that some things could still be changed during mass production, but that they don’t think this is likely.",
    "In any case, the design shown here looks similar to what we’ve seen in previous leaks, albeit possibly with a slightly smaller camera bump. LeaksApplePro claims that the notch has been heavily reduced, as rumored, and that the stainless steel frame will be less prone to picking up fingerprints than on the iPhone 12 Pro.",
    "They also claim that the camera bump is getting larger but flatter, and that the camera sensors are increasing in size too.",
    "While we’d take all of this with a pinch of salt, given that we’re seeing roughly the same design in every recent leak it’s likely that this is broadly accurate, suggesting that not much will visually be changing from the iPhone 12 range.",
    "Indeed, most leaks so far paint the upcoming models more as ‘S’ phones than big upgrades, so there’s a chance they’ll actually land as the iPhone 12S range. We’ll likely find out for sure in September, as that’s probably when the new phones will land.",
    "Via NotebookCheck"
  ],
  "headers": {},
  "links": {
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13",
    "LeaksApplePro": "https://twitter.com/LeaksApplePro/status/1395850889903083520",
    "slightly smaller camera bump": "https://www.techradar.com/news/iphone-13-leak-suggests-a-big-camera-bump-heres-why-it-could-be-a-good-thing",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "NotebookCheck": "https://www.notebookcheck.net/Apple-iPhone-13-Pro-High-resolution-renders-purport-to-show-the-device-s-finalised-design.540681.0.html"
  }
}