{
  "source": "https://www.techradar.com/news/the-dexter-reboot-release-date-has-been-announced-see-the-first-trailer-now",
  "title": "The Dexter reboot release date has been announced – see the first trailer now",
  "category": "entertainment",
  "updated": "2021-07-26T10:56:31Z",
  "author": "rhys-wood",
  "summary": "Dexter will be returning very soon",
  "article": [
    "The Dexter reboot's release date was announced during the show’s Comic-Con 2021 panel, confirming the serial killer drama's return is only a few months away.",
    "The reboot, titled Dexter: New Blood, premieres on November 7, 2021 on Showtime. The release date was confirmed on Showtime's official Twitter account alongside the teaser trailer shown during a Comic-Con panel this past weekend, focusing on the titular killer played by Michael C. Hall.",
    "New Blood will be the show’s ninth season, with Hall returning to play Dexter, as well as Jennifer Carpenter and John Lithgow returning as Deb and the Trinity Killer respectively, although it’s unclear what their characters' roles will be in the new season. New additions to the cast will include Jack Alcott (The Good Lord Bird), Alano Miller (Sylvie’s Love), Julia Jones (Twilight) and Clancy Brown (Highlander).",
    "During the show’s Comic-Con 2021 panel, star Michael C. Hall was frank about the reception towards the series' original finale: \"It deserved a better ending. The ending was mystifying at best… confounding, exasperating, frustrating on down the line of negative adjectives.\"",
    "Dexter fans have been left out to dry for the better part of a decade, after season 8 ended on an infamously underwhelming note. It seems that the cast and crew of Dexter: New Blood want to rectify that, though, providing a more satisfying conclusion over a new 10-episode arc.",
    "With a host of returning characters and lingering plot threads making a return for the new season, Dexter: New Blood certainly presents an ample opportunity to both get people nostalgic for the hit series. Crucially, showrunner Clyde Phillips has returned for this reboot – he oversaw the acclaimed first four seasons of the show, which makes us optimistic about this new run.",
    "Dexter: New Blood will focus on the antihero hiding from his past after the events of the last season, as he adopts a new alias in upstate New York. According to co-star Julia Jones, Dexter will be in a new relationship with her character, and the two will “definitely have a journey,” implying that their relationship will form a substantial part of the plot.",
    "Besides that, details on the new season were left understandably vague during the panel, but both cast and crew seem to be largely confident that Dexter: New Blood will deliver the closure fans have been waiting for. We’ll just have to wait until November 7 to see if the series is able to give the show a much-needed redemption."
  ],
  "headers": {
    "4": "Analysis: will Dexter fans finally have closure?"
  },
  "links": {
    "was frank": "https://www.gamespot.com/articles/dexter-is-coming-back-because-it-deserved-a-better-ending/1100-6494370/"
  }
}