{
  "source": "https://www.techradar.com/news/godaddy-and-google-extend-partnership-to-help-smbs-boost-online-sales",
  "title": "GoDaddy and Google extend partnership to help SMBs boost online sales",
  "category": "computing",
  "updated": "2021-07-13T17:00:10Z",
  "author": "anthony-spadafora",
  "summary": "New integration makes it easier for SMBs to get discovered across Google surfaces",
  "article": [
    "SMBs can now seamlessly reach millions of new customers through Google as GoDaddy has announced a new integration with the search giant.",
    "As a result of its expanded Google integration, the web hosting company's customers will be able to easily scale their businesses as they can get discovered across Google surfaces right from their existing online store.",
    "Without even having to leave their GoDaddy Online Store, customers are now able to automatically create a Google Merchant account, sync their catalog to create free product listings on Google and promote their products on Google.",
    "VP of commerce products at GoDaddy, Greg Goldfarb provided further insight on this new integration in a press release, saying:",
    "\"Our customers' success is our core motivation, we know that providing powerful ways to engage large buyer audiences is a key driver. Expanding our work with Google simplifies creating an ecommerce presence across Google surfaces and jumpstarts sales momentum by leveraging their best in class automated advertising solutions.\"",
    "In addition to free listings, the new integration also enables GoDaddy customers to launch Smart Shopping campaigns to promote their products across multiple surfaces on Google including Google Search, Google Images, Google Maps, YouTube and Gmail.",
    "With Google Smart Shopping campaigns, SMBs can simplify their marketing spend while maximizing their conversion value across Google properties to deliver strong sales growth.",
    "Google's director of channel partnerships Adrian Maharaj explained how the new integration will make it easier for SMBs to get discovered across Google surfaces, saying:",
    "\"We are working hard to build an open and healthy commerce ecosystem where businesses and their products are easily discoverable, and where shoppers have the most choice. By teaming up with GoDaddy, we are able to give even more merchants a way to get discovered across Google surfaces.\"",
    "To help SMBs leverage this new integration, Google is offering eligible GoDaddy customers up to $150 in ad credits when they start their first Smart Shopping campaign."
  ],
  "headers": {
    "5": "Smart Shopping campaigns"
  },
  "links": {
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "online store": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "press release": "https://aboutus.godaddy.net/newsroom/press-releases/press-release-details/2021/GoDaddy-and-Google-Team-up-to-Help-Boost-Small-Businesses-Reach-and-Ecommerce-Sales/",
    "Smart Shopping": "https://www.techradar.com/news/google-is-making-it-easier-for-retailers-to-promote-their-holiday-deals",
    "eligible GoDaddy customers": "https://www.anrdoezrs.net/click-6361382-11774111?url=https://www.godaddy.com/offers/websites-marketing/online-store-google&sid=trd-us-1268868483891698000"
  }
}