{
  "source": "https://www.techradar.com/news/intel-imacs-are-heavily-discounted-on-day-two-of-amazon-prime-day",
  "title": "Intel iMacs are heavily discounted on day two of Amazon Prime Day",
  "category": "computing",
  "updated": "2021-06-22T19:17:00Z",
  "author": "bryan-m-wolfe",
  "summary": "Plan on making your purchase soon, however.",
  "article": [
    "Prime Day deals continue, and nowhere is this more apparent than when it comes to Prime Day Apple deals. Amazon is currently offering great sales on the iPad Air (2020), AirPods Pro, and 13-inch MacBook Pro (2020, M1), among other products.",
    "If you're in the market for a late-generation iMac with Intel-based chips inside, these are also on sale.",
    "In 2020, Apple announced plans to transition its Macs from Intel-based processors to those created in-house. The first three Apple silicon-based Macs were introduced at the end of last year, including the iMac (2020), MacBook Air (2020, M1), and already mentioned 13-inch MacBook Pro (2020, M1). In 2021, it launched a brand new 24-inch iMac with the Apple M1 SoC inside.",
    "Apple's still selling the Intel-based 27-inch iMac, which launched in 2020, and Amazon has inventory for the final 21.5-inch iMac released. Both are high-quality products that Apple will support for many years to come.",
    "First announced in March 2019, the iMac offered by Amazon includes a 21.5-inch (diagonal) 4096-by-2304 Retina 4K display with a 3.6GHz quad-core 8th-generation Intel Core i3, AMD Radeon Pro 555X graphics, and 256GB of ultrafast SSD storage. In addition, on the back of the machine are two Thunderbolt 3 (USB-C) ports.",
    "This is a great choice for a desktop computer and works well doing everyday tasks like web browsing, email, and productivity apps. It's also capable of handling more demanding apps, although this is an entry-level computer.",
    "Apple's likely to replace this model soon for one with Apple silicon inside. That could happen later this year or in 2022. Despite this, the company has promised to support Intel-based Macs for many years to come. This model features a 27-inch (diagonal) 5120-by-2880 Retina 5K display, 3.1GHz 6-core 10th-generation Intel Core i5, and AMD Radeon Pro 5300 graphics. It ships with 256GB of ultrafast SSD storage and two Thunderbolt 3 (USB-C) ports.",
    "Well-received when it first launched, this model offers some big improvements over the previous models and is almost certainly the best Intel-based iMac the company has ever created. Upgrades on this model include a better webcam and microphones and more."
  ],
  "headers": {
    "2": "Intel vs. Apple silicon",
    "8": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Prime Day Apple deals": "https://www.techradar.com/news/the-best-apple-prime-day-deals-weve-found-so-far",
    "iPad Air (2020)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-iPad-Air-10-9-inch-Wi-Fi-64GB%2Fdp%2FB08J61FCVN%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7287302945386968000-20",
    "AirPods Pro": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MWP22AM-A-AirPods-Pro%2Fdp%2FB07ZPC9QD4%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2287732208401132300-20",
    "13-inch MacBook Pro (2020, M1)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MacBook-13-inch-256GB-Storage%2Fdp%2FB08N5N6RSS%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1150397910390489600-20",
    "Well-received": "https://www.techradar.com/reviews/apple-imac-27-inch-2020"
  }
}