{
  "source": "https://www.techradar.com/news/microsoft-could-be-about-to-save-you-millions-on-software-procurement",
  "title": "Microsoft could be about to save you millions on software procurement",
  "category": "computing",
  "updated": "2021-07-29T10:44:50Z",
  "author": "mike-moore",
  "summary": "Snaps up Suplari to strengthen procurement offering",
  "article": [
    "Microsoft has moved to boost its procurement offerings with the acquisition of Seattle-based start-up Suplari.",
    "The company currently uses a variety of AI tools and analytics to help businesses track and manage their software costs and cash flow, as well as providing future predictions and trend tracking.",
    "Already managing millions of transactions valued at more than $180bn in spend per month, Suplari's systems, particularly the Suplari Spend Intelligence Cloud, will now be combined with the capabilities of Microsoft Dynamics 365 to help customers save on software procurement using AI to automate the analysis of current and historical data patterns.",
    "Microsoft noted that the deal would provide mid-size and larger businesses across multiple sectors with valuable new insight about their processes, helping save money and resources in the long term.",
    "\"In a world where efficiency is more important than ever, companies are turning to new ways to unlock actionable insights to improve their businesses from the massive amounts of data they manage across their many data silos,\" Frank Weigel, Vice President, Dynamics 365 Insights Product Group wrote in a Microsoft blog post announcing the deal.",
    "\"This move to a new breed of “data-first” applications, which we introduced for other business processes through apps like Microsoft Dynamics 365 Customer Insights, is now coming to the supplier spend domain.\"",
    "\"By bringing Suplari’s spend intelligence insights together with the existing Microsoft Dynamics 365 capabilities, Microsoft is further helping organizations become insight-driven and enabling business leaders to take strategic action.\"",
    "Weigel added that Suplari's customers won't see any changes to their services, with the Spend Intelligence Cloud remaining on the market.",
    "Founded in 2016, Suplari said that the deal would also keep the company's workforce together, with CEO Nikesh Parekh saying he was \"excited for the new road ahead with Microsoft\".",
    "\"Customers can continue to expect the same great product experience from Suplari going forward as part of Microsoft,\" he wrote. \"Given Microsoft’s AI, cloud and data investments, customers can expect that Suplari will continue to deliver more AI-driven, predictive & prescriptive insights and integrated workflows for finance, procurement, & supply chain teams.\"",
    "Via Geekwire"
  ],
  "headers": {
    "3": "Microsoft Suplari"
  },
  "links": {
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Microsoft Dynamics 365": "https://www.techradar.com/reviews/microsoft-dynamics-365-crm",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7146397347595886000&xs=1&url=https%3A%2F%2Fcloudblogs.microsoft.com%2Fdynamics365%2Fbdm%2F2021%2F07%2F28%2Fmicrosoft-acquires-suplari-to-strengthen-business-insight-for-finance-and-procurement-leaders%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-could-be-about-to-save-you-millions-on-software-procurement",
    "wrote": "https://suplari.com/to-the-data-driven-future-suplari-has-been-acquired-by-microsoft/",
    "Geekwire": "https://www.geekwire.com/2021/microsoft-acquires-seattle-startup-suplari-uses-ai-analyze-corporate-spending/"
  }
}