{
  "source": "https://www.techradar.com/news/american-express-boosts-digital-receipts-tool-with-new-amazon-partnership",
  "title": "American Express boosts Digital Receipts tool with new Amazon partnership",
  "category": "computing",
  "updated": "2021-07-07T15:50:29Z",
  "author": "rob-clymo",
  "summary": "Amazon transactions can now be tracked through Digital Receipts service",
  "article": [
    "American Express is expanding its Digital Receipts feature, allowing purchases made on Amazon in the US to be included as part of the service.",
    "The Amex Digital Receipts service was launched earlier this year and offers US card members the option of viewing detailed transaction information directly from their smartphones.",
    "This latest expansion comes as new data has revealed that total online retail sales in the US during Amazon’s annual Prime Day sales extravaganza exceeded $11 billion. The figure represents a 6.1% increase compared to overall e-commerce transactions generated during the 2020 event.",
    "It also underlines just how much attention consumers are paying to their finances, especially in the wake of the chaos created by the coronavirus pandemic. Along with a growing uptake of money tracking apps, consumers are looking for easier ways to manage their finances and keep on top of transactions. The Digital Receipts option has so far proved popular with American Express card members, with the majority of customers questioned reporting that they find the idea useful.",
    "In fact, a total of 81% of those questioned for Amex Trendex, a trend report from American Express, felt that using Digital Receipts would allow them to more easily distinguish between legitimate and fraudulent charges on their card account. Meanwhile, 75% reckoned that Digital Receipts helped improve the overall customer experience and a further 72% thought that it would make them less likely to dispute a charge.",
    "“We know our customers value transparency and rely on us to introduce new products and services that make their lives easier,” said Ramesh Devaraj, Vice President, Global Merchant Processing and Policy at American Express.",
    "“With this in mind, we rolled out Digital Receipts with a select group of Merchants earlier this year and are excited to continue to evolve the product today with Amazon. Digital Receipts is one of the many ways we are evolving to assist with our customers’ changing needs and we are excited to continue building on this progress and expand to more Merchants in the future.”"
  ],
  "headers": {
    "4": "Digital Receipts"
  },
  "links": {
    "Digital Receipts": "https://www.techradar.com/news/american-express-launches-new-digital-receipts-feature",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "e-commerce transactions": "https://www.techradar.com/best/best-payment-gateways",
    "finances": "https://www.techradar.com/best/best-personal-finance-software",
    "money tracking apps": "https://www.techradar.com/best/best-expense-trackers",
    "fraudulent charges": "https://www.techradar.com/news/world-of-tech/roundup/the-small-business-guide-to-preventing-online-fraud-1101869"
  }
}