{
  "source": "https://www.techradar.com/news/microsofts-windows-10-cloud-pc-set-for-summer-launch",
  "title": "Windows 10 PC-as-a-Service is right around the corner",
  "category": "computing",
  "updated": "2021-04-21T16:48:39Z",
  "author": "joel-khalili",
  "summary": "Microsoft’s 'Cloud PC' is set for a summer launch",
  "article": [
    "It appears the wait for Microsoft's highly anticipated Windows 10 PC-as-a-Service is coming to an end, with the new offering expected to land within the next handful of months.",
    "Although there has been no official word from Microsoft, ZDNet sources have suggested the company is aiming for a June-July release window, ahead of the annual Inspire conference.",
    "At the moment, the Cloud PC website serves an error message that explains the service is currently unavailable, which suggests testing is still going on behind the scenes.",
    "Information about Microsoft’s new Cloud PC service first came to light last summer, when eagle-eyed journalist Mary Jo Foley discovered a job description that contained details about the project.",
    "“Microsoft Cloud PC is a strategic, new offering that is built on top of Windows Virtual Desktop. At its core, Cloud PC provides business customers a modern, elastic, cloud-based Windows experience and will allow organizations to stay current in a more simplistic and scalable manner,” the listing stated.",
    "In essence, Cloud PC will allow users to access a remote Windows 10 desktop and Office 365 software, using their own device as a thin client. The service will be distinct from the existing Windows Virtual Desktop offering, in that customers will be charged a flat rate per-user price, as opposed to fees based on resource consumption.",
    "In February, it emerged Microsoft will offer several different “service plans” for customers to choose from, each offering a different level of performance and storage capacity.",
    "In a more recent job listing, Microsoft explained the new Azure-based service “allows all users to be productive from anywhere, on any device with a cloud-powered, secure and always up to date Windows experience.”",
    "“It also seamlessly allows endpoint managers to instantly provision cloud hosted PCs and manage physical and virtual devices through a unified portal.”",
    "The implications for businesses could be significant, allowing companies to cut down on both hardware costs and administrative burden, while still providing employees with the necessary applications.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Windows 10 Cloud PC"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "came to light last summer": "https://www.techradar.com/news/microsoft-develops-cloud-pc-as-a-service",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "thin client": "https://www.techradar.com/best/best-thin-client",
    "several different “service plans”": "https://www.techradar.com/news/microsoft-drops-fresh-details-about-upcoming-windows-10-pc-as-a-service",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "ZDNet": "https://www.zdnet.com/article/microsoft-marches-toward-launching-its-cloud-pc-service-possibly-this-summer/"
  }
}