{
  "source": "https://www.techradar.com/news/china-wants-e-commerce-sites-to-stop-spam-ahead-of-singles-day",
  "title": "China wants e-commerce sites to stop spam ahead of Singles Day",
  "category": "computing",
  "updated": "2021-10-28T10:24:32Z",
  "author": "sead-fadilpasic",
  "summary": "Major companies should \"check and correct” text message marketing activities",
  "article": [
    "The Chinese government wants e-commerce sites and retailers to take it easy on text message and email promotions for the upcoming Singles' Day event.",
    "Reuters reports that the country’s Ministry of Industry and Information Technology (MIIT) held a meeting on October 25, with the country’s e-commerce giants, namely Alibaba Group Holding Ltd, JD.com, Meituan, and Pinduoduo Inc.",
    "MIIT explained in a social media post that during the meeting, it told attendees that different vendors often abuse the platforms to send text message promotions to registered users without consent, and thus violate their consumer rights. In other words, they use the shortcomings of the platforms to spam the users.",
    "MIIT, which also regulates China's technology and online retail industries, told the e-commerce giants to “check and correct” text message marketing activities, and to make sure only users who explicitly gave consent be contacted this way.",
    "Held on November 11 (11.11) as an \"anti-Valentine's Day Singles' Day is China’s version of the Western Black Friday and Cyber Monday events. Originally, people would come up with various mischievous ways to “ruin” romantic outings on the day, such as to reserve every other seat in a movie theater, to prevent couples from enjoying the movie together.",
    "Since 2009, it has increasingly transformed into an e-commerce event, with retailers offering discounts, deals and offers in the days and weeks leading up to it, as well as on the day.",
    "Today, it’s the largest single commerce day in the world - with the 2020 event bringing in $25 billion in sales in just 24 hours according to National Today,.",
    "In 2018, Alibaba generated $30 billion on the day, while the first two minutes usually generate more than a billion in sales.",
    "Reuters reminds that the country’s regulators are pressing on e-commerce giants hard, as they seek more regulation and more restrictions for the sector. In April, Alibaba was fined a record $2.8 billion for its “anti-competitive behavior”.",
    "Make sure to also check out our list of the best ID theft protection companies."
  ],
  "headers": {
    "4": "Celebrating singles"
  },
  "links": {
    "email": "https://www.techradar.com/news/best-email-hosting-providers",
    "Reuters": "https://www.reuters.com/world/china/china-calls-e-commerce-sites-curb-spam-ahead-singles-day-shopping-fest-2021-10-28/",
    "abuse the platforms": "https://www.itproportal.com/features/best-identity-theft-companies/",
    "spam": "https://www.techradar.com/best/best-secure-email-providers",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best ID theft protection": "https://www.itproportal.com/features/best-identity-theft-companies/"
  }
}