{
  "source": "https://www.techradar.com/news/blizzcon-2021-is-canceled",
  "title": "BlizzCon 2021 is canceled",
  "category": "gaming",
  "updated": "2021-05-26T17:47:22Z",
  "author": "samuel-tolbert",
  "summary": "No BlizzCon later this year",
  "article": [
    "Blizzard Entertainment announced that there will not be a BlizzCon 2021 event later this year. This follows after there was no BlizzCon 2020 the prior year due to the global pandemic. Instead, the company held BlizzConline 2021 earlier this year, a digital event with news and updates, forgoing the traditional fan gathering in-person event that Blizzard previously cultivated.",
    "\"The ongoing complexities and uncertainties of the pandemic have impacted our ability to properly move forward on many of these fronts, and ultimately we’re now past the point where we’d be able to develop the kind of event we’d want to create for you in November,\" writes Saralyn Smith, Executive Producer of BlizzCon.",
    "Smith also notes that, much like for BlizzConline 2021, an online event will be held in early 2022 but with \"smaller in-person gatherings\" of some kind as well. More details on this 2022 event will be shared at a later date.",
    "Blizzard's next big games are still a ways off, as Activision-Blizzard confirmed earlier this year via conference call that Overwatch 2 and Diablo 4 are not being released in 2021. Blizzard Entertainment vice president and Overwatch game director Jeff Kaplan recently departed the company, with Aaron Keller filling his role.",
    "In the near future, Diablo fans can look forward to the Diablo 2: Resurrected remaster, which is aimed for release later in 2021. It's going to feature new graphics, higher-quality audio, cross-progression and maybe skateboards. It's coming to PC, Xbox Series X, Xbox Series S, Xbox One, PS4, PS5 and Nintendo Switch."
  ],
  "headers": {
    "3": "The Blizzard winds are changing direction"
  },
  "links": {
    "announced": "https://blizzcon.com/en-us/news/23655116",
    "Overwatch 2": "https://www.techradar.com/news/overwatch-2-release-date-features-and-rumors",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "not being released in 2021": "https://www.techradar.com/news/overwatch-2-and-diablo-4-release-dates-slip-beyond-2021",
    "recently departed": "https://www.techradar.com/news/jeff-kaplan-leaves-blizzard-entertainment-ahead-of-overwatch-2",
    "maybe skateboards": "https://www.windowscentral.com/diablo-2-resurrected-remaster-cross-progression-maybe-skateboards",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}