{
  "source": "https://www.techradar.com/news/why-businesses-need-to-opt-for-remote-first",
  "title": "Why businesses need to opt for remote-first",
  "category": "computing",
  "updated": "2021-06-03T08:13:15Z",
  "author": "callum-adamson",
  "summary": "A truly flexible approach to work goes beyond hybrid working",
  "article": [
    "Tech solves problems; that’s its raison d’être. Silicon Valley has a reputation for pre-empting trends so frequently that, by the time the rest of the world has caught up, it’s already onto the ‘next big thing’. But when it comes to remote working, Big Tech is in a state of flux. Normally a rebel-rouser, which frequently upturns the status quo, it looks as though it’s losing its edge.",
    "Despite some seismic statements last summer about the death of the 9 to 5 in corporate buildings and never making their employees come back to the office, some businesses have clearly got cold feet. The biggest U-turn came recently from Google, which has invited employees back into the office, with no WFH longer than two weeks allowed. Not only that, LinkedIn has announced it will simply give its workers a week off.",
    "And they’re not alone. Instead of leading the way to the future of work, what many businesses are offering up as game-changing policies are just thinly veiled rehashes of office perks.",
    "In our opinion, a truly flexible approach goes beyond providing hybrid working as the silver bullet solution. In fact, for me, remote working is the only viable approach to the future of work.",
    "As we went into the first UK lockdown last March, we heard a lot of concern about productivity levels as laptops were packed up and taken home for the foreseeable future. But, since then, workers have proven to their bosses that they are both capable and willing to work efficiently and effectively from home – with 58% reportedly feeling more productive since working remotely. So why are companies like Google in such a rush to get everyone back into the office once more?",
    "IBM even announced its proposed system of remote working in March 2021, which leaves 80% of their workforce working at least three days a week in the office. This was, apparently, based on a fear that it will affect employees’ career trajectory as remote workers would not be able to manage people effectively or help build company culture.",
    "This, ironically, reveals attitudes which could instead cause even more damage to workers’ career progression. It risks reverting back to old stereotypes of not trusting employees and not giving them credit to work effectively and efficiently – like adults – without being micromanaged.",
    "Furthermore, it reduces the pool of talent employers have access to. Forcing employees to work from one centralized location limits the workforce to those from the periphery – so businesses are not leveraging talent, not only from the rest of the UK, but the world. It also indirectly hinders the diversity of your workforce, by enforcing bygone and unnecessary restrictions on who can work for you, i.e. only those who can commit to the office 24/7, without any other pulls on their time, family or otherwise.",
    "Supporters for a hybrid-style of working have dominated the conversation for the past few months. Many businesses are calling this their new approach, extolling its virtues of the best of both worlds. But it has only been theoretical up until now. What’s more, each business’ definition of hybrid working differs from one to the other. Whatever the definition, in practice, it creates more problems than it solves. Managing part-remote workforces and helping them to build a successful culture in a hybrid environment creates a disadvantaged party in those that are remote.",
    "It’s an unnecessary burden for employers and employees alike. That’s why remote-first is the best solution. The pandemic shone a light on the best ways of working and encouraged leaders to reflect. Work that was once “only” ever meant to be done in the office, is now fine to do remotely and is considered the norm for many. The success of the transition to remote working encouraged the likes of Spotify and Twitter to put their hats in the “work wherever” ring early on, with even more traditional businesses such as HSBC and JP Morgan announcing they will allow thousands to permanently move away from the office.",
    "The flexibility and better work-life balance offered by remote working does not only come from the ability to work wherever is most comfortable, without needing to commute. The money saved from overheads or rent could even go towards new, improved and more meaningful employee perks that offer a replacement for the in-person interaction in a better way: a summer beach break, ski trip etc.",
    "Choosing this way of working also avoids a split, or even tiered system, between those in the office, and those not, when it comes to using resources, networking and collaborating. It is not about putting everyone at a disadvantage. Businesses simply need to work to make remote working a better approach for everyone.",
    "Key to building a remote-first working model is trusting and empowering your employees to meet up for in-person collaboration when necessary, rather than forcing it with permanent office space. The ability to do this only comes from thinking through a remote-first lens as those that adopt a hybrid approach would consider the office a natural meeting spot. Taking a remote-first approach also means businesses can make budget available for flexible collaboration space to meet the needs of the employees at any time and wherever they are.",
    "When done well, the benefits of remote working are substantial, according to WEF, including higher job satisfaction thanks to the greater flexibility, greater trust between employers and employees to effectively do their job, teamed with the greater ease of doing so, through growing adaptability using digital tools that enable remote work.",
    "By embracing remote systems, companies are setting themselves up for future success. Through building the processes that allow for staff to really use remote work to their advantage and enrich all areas of their lives. For example, once “where” employees are working has been addressed, the next logical step is “when” best suits them. While it’s important to promote a good work/life balance, more flexibility around when employees open up their laptops gives businesses additional opportunities to employ a broader, more diverse workforce.",
    "The pandemic has emphasized the less than sustainable ways of working, and how there are more options available than ever before. Businesses now have the option and capabilities to offer freedom to move away from the regular 9 to 5 and offer the ability to live and work anywhere. Only by providing access to self-determined career paths, paired with regular team meetups, are these businesses truly forward- and flexibility- focused. And with the technology to back it up, there is little excuse to offer a better style of working, now and into the future."
  ],
  "headers": {
    "4": "The office as a hindrance",
    "8": "It’s time for businesses to realize remote is best",
    "11": "Recognizing remote working rewards",
    "15": "Looking ahead"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "office": "https://www.techradar.com/best/best-office-desks",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "networking": "https://www.techradar.com/best/best-business-networking-apps",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}