{
  "source": "https://www.techradar.com/news/apple-watch-7-tipped-to-have-new-watch-faces-to-fit-its-larger-display",
  "title": "Apple Watch 7 tipped to have new watch faces to fit its larger display",
  "category": "wearables",
  "updated": "2021-08-30T09:33:07Z",
  "author": "david-nield",
  "summary": "Time for a change",
  "article": [
    "We've heard plenty of rumors around the Apple Watch 7 in recent weeks, but now one of the most reliable tipsters in the business has weighed in – and it sounds as though brand new watch faces are on the way, to match the wearable's larger display.",
    "That's as per Mark Gurman in his Power On newsletter. Gurman has got plenty of Apple predictions right in the past, and has previously stated that this year's Apple Watch (due in September) is going to come with a flatter, larger display – a redesign that has appeared in leaked renders.",
    "\"I'm told that Apple will bundle multiple new watch faces to take advantage of the bigger screen, including an updated Infograph Modular face,\" writes Gurman (via 9to5Mac). The two Apple Watch 7 sizes are reported to be 41mm and 45mm, up from 40mm and 44mm with the Apple Watch 6.",
    "Gurman also says that there won't be any more sensors added to the Apple Watch this year, after the introduction of the blood oxygen sensor in last year's refresh. In 2021, the focus is going to be on the new look and the new sizes for the smartwatch.",
    "It's possible that a body temperature sensor is going to be added with the Apple Watch 8 in 2022, according to Gurman, but the Apple Watch 7 is aiming to tempt users into a purchase with a fairly significant redesign – and perhaps some new colors.",
    "The Apple Watch 7 should also come with an upgraded processor, and will no doubt arrive running watchOS 8. Also in the pipeline, if the rumor mill is correct, is a Time to Run feature that gives you a library of guided running exercises (Time to Walk is already out).",
    "The Apple Watch has been a major success, but as we're now past six years since the first model appeared on the scene, Apple knows that it needs to keep innovating with the annual updates in order to keep up interest and maintain strong sales.",
    "And so we're set for the first significant design to the Apple Watch in its history, as well as the first screen size change since the Apple Watch 4 introduced a bigger display than the Apple Watch 3. There aren't going to be massive changes to the internal components this time around – it's all about the aesthetics.",
    "It's a redesign that makes a lot of sense too, bringing the wearable in line with the look of the iPhone 12 and the iPad Pro. From what we've seen in the leaked renders that have appeared to date, it looks as though Apple has pulled off the challenge of redesigning its iconic smartwatch rather well.",
    "Remember that after years of Wear OS inactivity, Google is pushing out a big update to its smartwatch operating system, with new hardware from Samsung and Fossil in tow. The competition is getting its act together, and Apple knows it needs to respond."
  ],
  "headers": {
    "3": "No more sensors yet",
    "6": "Analysis: Apple tries to keep the Apple Watch momentum going"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Power On": "https://www.bloomberg.com/account/newsletters/power-on",
    "leaked renders": "https://www.techradar.com/news/see-this-apple-watch-7-leak-with-a-wild-looking-flat-edged-design",
    "9to5Mac": "https://9to5mac.com/2021/08/29/apple-watch-series-7-size-faces-report/",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "some new colors": "https://www.techradar.com/news/see-this-apple-watch-7-leak-with-a-wild-looking-flat-edged-design",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "is a Time to Run feature": "https://www.techradar.com/news/iphone-13-apple-watch-7-and-new-ipads-all-detailed-in-a-big-leak",
    "Time to Walk": "https://www.techradar.com/news/apple-time-to-walk-lets-you-take-a-stroll-with-a-new-celebrity-guest-every-week",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "a big update": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Samsung": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Fossil": "https://www.techradar.com/news/fossil-gen-6-smartwatch-release-date-price-news-and-features"
  }
}