{
  "source": "https://www.techradar.com/news/the-latest-psvr-showcase-proved-vr-is-for-everyone",
  "title": "The latest PSVR showcase proved VR is for everyone",
  "category": "gaming",
  "updated": "2021-06-05T10:00:55Z",
  "author": "hamish-hector",
  "summary": "From puzzle-solving to action-movie antics",
  "article": [
    "Sony’s latest VR showcase has delivered yet another batch of trailers for games that are coming soon to PSVR and other systems. What was shown off looked not only like a cut above what we’ve seen before but it showed that VR is a platform that anyone can enjoy.",
    "For those that want high-octane action, Fracked will place you in your own action movie as you ski, climb, and shoot your way through levels. At the complete opposite end of the spectrum, Winds & Leaves offers a more serene experience where you must plant your own arboretum to prevent an impending cataclysm.",
    "Both of these PSVR-exclusive games (as well as everything else that was shown off during the event) offer diverse experiences that we can't wait to try out. If you’ve been on the fence about getting a VR headset, unsure if there’s a game that’ll you’ll enjoy, it’s well worth taking a look at some of these as you might finally see something that convinces you to take the plunge.",
    "Here’s a quick rundown of every game that was announced at the PSVR showcase on June 3rd, along with their release dates and the platforms they’ll be coming to.",
    "Created by M Theory and Oddboy, this VR experience will put you in your own puzzle-filled time travel adventure as you attempt to rewrite the past and reshape your current time. It looks like there’ll be a combination of exploration and narrative in a game that is set to deliver an escape room-like experience that you can enjoy at home.",
    "We don’t have a release date yet, just a broad “Summer 2021” (so likely sometime between June and August) but this is one we’ll definitely be on the lookout for. If you don’t want to wait, you might also want to check out The Room VR: A Dark Matter which offers a similarly puzzling adventure.",
    "Fans of Rebellion’s long-running FPS franchise will have an idea of what to expect with Sniper Elite VR. But while the classic shooting and stealth mechanics make a comeback, as do the iconic X-Ray cam moments, the studio promises this game will give fans a World War 2 story that comes with a “new perspective” on the action.",
    "Whether you’re playing on PSVR, Quest or PC VR devices, Sniper Elite VR is set to release on July 8 this year.",
    "If you loved Ghost of Tsushima, this PSVR exclusive title could be the one for you. Set in feudal Japan you’ll take on the role of a ninja on a quest for vengeance. From a first-person perspective, you can carry out stealthy assassinations, attempt parkour feats and engage in hand-to-hand combat.",
    "Unfortunately for most VR users, Arashi: Castle of Sin looks set to be a PSVR exclusive but there’s a chance it might release on other platforms sometime after its “Summer 2021” release date.",
    "From the creators of Arizona Sunshine is yet another VR shooter set in a zombie apocalypse, complete with Left 4 Dead-style co-op gameplay. Team up with friends as you take on a terrifying horde of monsters mutated by the relentless cold covering Los Angeles.",
    "This post-apocalyptic action-adventure will launch this \"Summer\" on PSVR, Quest and PC VR devices."
  ],
  "headers": {
    "3": "The announced PSVR games at a glance",
    "4": "Wanderer",
    "6": "Sniper Elite VR",
    "8": "Arashi: Castles of Sin",
    "10": "After the Fall"
  },
  "links": {
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset"
  }
}