{
  "source": "https://www.techradar.com/news/ps5-stock-tips-and-mr-beast-burger-review-noise-cancelling-podcast-episode-54",
  "title": "PS5 stock tips and Mr Beast Burger review: Noise Cancelling podcast episode 54",
  "category": "phones",
  "updated": "2021-03-05T09:31:09Z",
  "author": "adam-vjestica",
  "summary": "Episode 54 of our tech podcast is here",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's episode is presented by Gareth Beavis, Global Editor-in-Chief of TechRadar and Sherri L. Smith, Editor-in-Chief of Laptop Mag.",
    "Our guests are Matt Swider, Managing Editor at TechRadar, and Vic Hood, Gaming Editor at TechRadar, who join us (remotely, of course) to talk about the last seven days in tech.",
    "As usual, we're talking about a variety of topics from the world of tech. We begin the show with this week's Big Question: which celebrity burger would you be excited to eat?",
    "In the news section, we induct another gadget into our hall of fame, share our DJI FPV Drone impressions and provide PS5 stock hunting tips to help you find Sony's shiny new console. We also touch on the rumored Apple Event, and share why we think Netflix has overstayed its welcome.",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 54:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/",
    "Tom's Guide": "https://www.tomsguide.com/",
    "DJI FPV Drone": "https://www.techradar.com/reviews/dji-fpv-drone",
    "PS5 stock": "https://www.techradar.com/news/where-to-buy-ps5",
    "Apple Event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1122689089990007400&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}