{
  "source": "https://www.techradar.com/news/iphone-13-and-iphone-13-pro-design-leaked-in-dummy-unit-photos",
  "title": "iPhone 13 and iPhone 13 Pro design leaked in dummy unit photos",
  "category": "phones",
  "updated": "2021-06-30T10:10:25Z",
  "author": "james-rogerson",
  "summary": "Seen it all before",
  "article": [
    "The problem with making a phone that millions of people want is that it’s very hard to keep it a secret, which is a problem Apple is finding with the iPhone 13 range. These phones have been leaked extensively and repeatedly, and now we’re getting another look at the likely design of the iPhone 13 and the iPhone 13 Pro.",
    "This time the leak takes the form of photos of dummy units – that is, non-working handsets that are designed to look like the real phone. These units - which exactly match up with previous leaks - were originally shared on Weibo (a Chinese social network) and were spotted by leaker DuanRui and posted on Twitter.",
    "They show a diagonally arranged dual-lens camera on the iPhone 13, and a triple-lens camera on the iPhone 13 Pro. You can also see the slightly shrunken notch that’s been rumored many times, and what appears to be a slightly more prominent camera bump on the iPhone 13 Pro than on the standard model.",
    "Both phones appear to be shown here in white, though possibly slightly different shades, unless it’s just the light playing tricks. Our guess is that the iPhone 13 is in white and the iPhone 13 Pro is actually in silver, as that’s in line with color options for the iPhone 12 range. However, there’s no guarantee that these colors are accurate.",
    "Indeed, there’s no guarantee that any of this is accurate, and there’s every chance that these dummy units are just based on leaks and rumors anyway. But we’ve seen this design enough at this point that we’d think this is broadly what the iPhone 13 range will look like.",
    "We should know for sure soon, as we’re expecting the phones to launch in September. Stick with TechRadar for all the details when they are announced, and all the credible leaks until then.",
    "Via MacRumors"
  ],
  "headers": {},
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "previous leaks": "https://www.techradar.com/news/iphone-13-colorized-renders-show-smaller-notch-and-rearranged-rear-cameras",
    "DuanRui": "https://twitter.com/duanrui1205/status/1409860293958635524",
    "rumored many times": "https://www.techradar.com/news/iphone-13-mockup-shows-changes-that-might-be-coming-to-the-notch",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "MacRumors": "https://www.macrumors.com/2021/06/29/iphone-13-dual-lens-diagonal-array/"
  }
}