{
  "source": "https://www.techradar.com/news/now-could-be-a-much-better-time-to-get-your-hands-on-a-new-pc",
  "title": "Now could be a much better time to get your hands on a new PC",
  "category": "computing",
  "updated": "2021-01-18T12:46:58Z",
  "author": "barclay-ballard",
  "summary": "PC demand skyrocketed in the fourth quarter of last year",
  "article": [
    "Global demand for new PCs surged in the fourth quarter of 2020, suggesting that now is the time to splash out on a new device. With working from home set to continue for the foreseeable future at least, many employees might be getting frustrated with their current home office setup.",
    "Gartner reports that PC shipments totaled 79.4 million units in the fourth quarter of last year, representing a 10.7% increase when compared with the same period in 2019.",
    "Across the entirety of 2020, PC sales totaled 275 million units, a 4.8% increase year-on-year.",
    "Overall, the top three vendors remained unchanged from the previous quarter, with Lenovo leading the way ahead of HP and Dell.",
    "However Lenovo continued to widen its lead over HP, shipping nearly 21.5 million units during 2020 to take 24.7% of the total market. HP shipped 15.6 million units for a 19.8% market share, with Dell taking 16.6% thanks to its 13.1 million units shipped.",
    "Reflecting the trend seen throughout 2020, consumer-oriented vendors such as Apple, Acer and Asus gained market share, with the former seeing a 31/3% year-on-year growth compared to 2019.",
    "The coronavirus pandemic had a huge impact on PC sales last year. With many employees forced to work remotely, new PCs and laptops had to be purchased en masse. With economic output depressed, however, many regions are now seeing slower PC sales, apart from those where an economic rebound is already underway.",
    "Looking at the regional breakdown in more detail, the US PC market had a particularly strong end to the year, posting a 20.6% growth in PC sales for the fourth quarter.",
    "The COVID-19 pandemic also saw consumer PC demand reach its highest level since 2010. It’s likely that all kinds of home office equip registered a similar boost, from office chairs to webcams.",
    "“The worldwide PC market saw a strong finish to 2020, recording a third consecutive quarter of year over year growth, although there continued to be supply shortages due to this high demand,” Mikako Kitagawa, research director at Gartner, said.",
    "“Robust consumer PC demand again drove sales, particularly in regions where governments maintain stay-at-home orders as the COVID-19 pandemic persists. Prior to 2020, consumers had been shifting to a phone-first focus, yet the pandemic reversed this trend. PCs have resurfaced as an essential device as consumers, including younger children, are relying on them for work, school, socializing and entertainment from their homes.”"
  ],
  "headers": {
    "3": "A home office revamp"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}