{
  "source": "https://www.techradar.com/news/x-men-the-animated-series-is-being-revived-for-disney-plus",
  "title": "X-Men: The Animated Series is being revived for Disney Plus",
  "category": "entertainment",
  "updated": "2021-11-12T16:44:41Z",
  "author": "tom-power",
  "summary": "Get the iconic theme music on repeat!",
  "article": [
    "Marvel's iconic X-Men: The Animated Series is being revived for Disney Plus – and it'll star the voice cast from the original series.",
    "Officially announced on Disney Plus Day, Marvel Studios and Disney revealed that the show's official title will be X-Men 97. However, it'll be a while before we see the animated series return to our screens, with Disney revealing that X-Men 97 won't arrive until 2023.",
    "Check out the confirmation via the tweet below:",
    "According to The Wrap, X-Men 97 will pick up straight after the events of the beloved 1990s animated series, and several members of the original show's cast are set to return. That includes, but isn't limited to, Cal Dodd, Lenore Zann, George Buza, Adrian Hough, Christopher Britton and Catherine Disher.",
    "A number of new voice actors have also reportedly been drafted for the series, including Jennifer Hale, Ray Chase, Matthew Waterson and Holly Chou. There's no word on who they'll be lending their voices too, though.",
    "X-Men 97 is being written and developed by Beau DeMayo (The Witcher: Nightmare of the Wolf). X-Men: The Animated Series writers Eric and Julia Lewald, as well as original director Larry Houston, will also consult on the TV show.",
    "X-Men: The Animated Series ran from 1992 to 1997, and consisted of 76 episodes. All seasons are currently available to stream on Disney Plus, too. So if you haven't had a chance to catch this iconic series, now is as good a time as any to do so.",
    "For more Marvel Studios content, check out Marvel Phase 4 hub. Alternatively, check out what we thought of Eternals."
  ],
  "headers": {},
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Disney Plus Day": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
    "The Wrap": "https://www.thewrap.com/x-men-97-1990s-x-men-animated-series-2023/",
    "Marvel Phase 4 hub": "https://www.techradar.com/news/marvel-phase-4",
    "what we thought of Eternals": "https://www.techradar.com/news/eternals-is-unlike-any-other-mcu-movie-so-far-and-thats-a-good-thing"
  }
}