{
  "source": "https://www.techradar.com/news/dont-upgrade-your-apple-homepod-with-the-new-beta-software",
  "title": "Don't upgrade your Apple HomePod with the new beta software – it could overheat",
  "category": "audio-visual",
  "updated": "2021-07-05T09:02:46Z",
  "author": "olivia-tambini",
  "summary": "Users are reporting a host of issues",
  "article": [
    "If you have an Apple HomePod or HomePod mini, you might want to avoid updating it with the latest beta software.",
    "According to 9to5Mac, the new software is causing a host of problems for users, with some finding that their wireless speaker overheats and powers off, while others are reporting issues with Siri being unable to pause music using voice commands.",
    "Unlike the iPhone, iPad, Mac, Apple TV, and Apple Watch, for which Apple offers developer and public betas, allowing users to try out new features before new software is officially released, the Apple HomePod software beta is only available to invited users.",
    "However, the software can be found via a quick Google search – and that means many customers are tempted to try it out for themselves.",
    "In general, it's a good idea to avoid downloading software betas to your primary devices, just in case something goes wrong – though publics betas like iOS 15 are usually fine, and can give you an exciting glimpse of what's coming next to your device.",
    "Having first gone on sale at the start of 2018, the Apple HomePod smart speaker has been discontinued, with Apple turning all of its attention to the smaller (and cheaper) HomePod Mini instead.",
    "As proven by this beta software, the original HomePod will still get updates, so it won't become totally obsolete.",
    "In fact, both the HomePod and the HomePod mini will be given support for Lossless Audio on Apple Music with the HomePod OS 15 software update – which could be why many users were so keen to try the beta version.",
    "According to Apple, subscribers to the streaming platform will \"be able to hear the exact same thing that artists created in the studio\".",
    "It starts at CD quality (16 bit / 44.1kHz), and goes up to 24 but / 48 kHz, – and, for audiophiles, there's Hi-Resolution Lossless, which goes all the way up to 24 bit / 192kHz.",
    "So, what difference does that actually make? Well, the increased bit depth of HRA improves the dynamic range of your music, basically giving you more detail and clarity from the recording, and bringing the reproduction much closer to how it sounded in the studio.",
    "That means the HomePod and the HomePod mini are set to sound even better for those with Apple Music subscriptions – and as Apple hasn't put up its prices for this new streaming tier, it won't cost existing users a penny."
  ],
  "headers": {
    "5": "Bye bye, HomePod"
  },
  "links": {
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "9to5Mac": "https://9to5mac.com/2021/07/04/homepod-overheating-software-15-problems/#more-734916",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "it won't cost existing users a penny": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming"
  }
}