{
  "source": "https://www.techradar.com/news/curse-of-strahd-gets-a-sequel-with-new-dandd-book-for-horror-games",
  "title": "Dungeons & Dragons 5E gets a dose of horror with new 2021 sourcebook",
  "category": "gaming",
  "updated": "2021-02-24T10:09:40Z",
  "author": "henry-st-leger",
  "summary": "Featuring the return of Ravenloft",
  "article": [
    "D&D fans, meet horror fans. There’s a new 5E sourcebook for Dungeons & Dragons (also known as D&D, or DND), and it looks set to inject a good dose of gothic horror into the long-running TTRPG.",
    "Van Richten’s Guide to Ravenloft, as it’s called, builds on the success of Curse of Strahd, one of the most popular D&D campaign books yet to be put into print. But where Curse of Strahd concerned vampires, swirling mists, and gothic castles, Van Richten’s Guide to Ravenloft – itself a classic setting in the D&D canon since its first edition – is packed with a huge number of different locations, monsters and storylines for the budding horror DM, from Frankenstein-esque monsters and haunted houses to zombie hordes and more.",
    "The book contains 30 such \"Domains of Dread\", ensuring what senior game designer Wes Schneider calls a wide variety of “Cosmic horror, ghost horror, dark fantasies, psychological horror – whatever your favorite flavor of horror might be.”",
    "There are even \"rules and advice for DMs to create custom domains\", and the book includes a dedicated campaign that weaves through different domains in a single dread-hopping adventure too.",
    "There are also some new character creation options that eagle-eyed players may have spotted in Unearthed Arcana (Wizard of the Coast’s means for playtesting official D&D content before release) earlier this year.",
    "There’s a new Bard subclass, College of Spirits, with a supernatural slant, giving players means of contacting spirits and using their abilities as your own. Budding warlocks can also pick a new Undead patron, such as a vampire or lich, with the monstrous powers that will be bestowed on you.",
    "If you ever wanted to play as a part-vampire, you now can, with a new ‘Dhampir’ race option – while you can also play as a hag-descended ‘Hexblood’ or a resurrected ‘Reborn’, each with their own distinctive horror flavor.",
    "The 256-page hardback of Van Richten’s Guide to Ravenloft releases on May 18. It's the most recent 5E sourcebook since Candlekeep Mysteries, which launched earlier in 2021.",
    "As much fun as it can be to be, well, absolutely terrified now and again, it’s also important to make sure players are somewhat in control of the experience.",
    "The guide makes sure to run through ensuring your players feel safe and are supported throughout, along with a dedicated passage on the importance of ‘session zero’ – the game before the game – where the DM and their players can outline no-go topics and ways to halt or course-correct the campaign where needed."
  ],
  "headers": {
    "8": "Playing it safe"
  },
  "links": {
    "Candlekeep Mysteries": "https://www.techradar.com/news/theres-a-new-dandd-sourcebook-just-for-short-games-and-its-coming-soon"
  }
}