{
  "source": "https://www.techradar.com/news/apple-m1x-macbook-pro-might-drop-as-early-as-october",
  "title": "Apple M1X MacBook Pro might drop as early as October",
  "category": "computing",
  "updated": "2021-09-02T16:21:39Z",
  "author": "john-loeffler",
  "summary": "The new MacBook Pro is said to have an enhanced M1 chip",
  "article": [
    "Apple might be set to announce their newest MacBook Pro models featuring the enhanced Apple M1X chip and mini-LED backlighting as early as October.",
    "The reports first appeared in Digitimes, indicating that the ongoing chip shortage had pushed back the intended September launch to at least October and maybe even November.",
    "We've been expecting a beefier 16-inch MacBook Pro ever since the launch of the MacBook Pro 13-inch (M1) back in November of last year, and its widely expected that Apple will introduce a more powerful M1X chip with the 16-inch MacBook Pro since it's going to need more power than the M1 chip can provide.",
    "There is also the question of a 14-inch MacBook Pro, as 9to5Mac notes. There has been a lot of buzz about the 14-inch Apple laptop as either a upgrade from the 13-inch model or an entirely new entry alongside the currently available sizes. If we do get a 14-inch MacBook Pro announcement, we'll be interested to see if it comes sporting the Apple M1 chip or the more powerful Apple M1X.",
    "With the ongoing chip shortage plaguing everyone from carmakers to electronics manufacturers to PC manufacturers, you have to expect some product delays.",
    "Both AMD and Nvidia have been slowly rolling out new graphics cards but getting the actual products into the hands of gamers has been a monumental challenge. There's even talk that Intel might be delaying parts of its Alder Lake launch until CES 2022 over concerns about chip supply.",
    "So, if it turns out that Apple had to push back its typical September launch window for new MacBooks to October or November, that's barely a delay at all, so we definitely hope this turns out to be the case.",
    "We've been eager to see what Apple has in store for its next generation of Apple silicon, and the sooner the better as far as we're concerned."
  ],
  "headers": {
    "4": "Analysis: A month delay isn't bad in the context of the global chip shortage"
  },
  "links": {
    "Apple M1X chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "Digitimes": "https://www.digitimes.com/news/a20210902PD210.html",
    "MacBook Pro 13-inch (M1)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "14-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "9to5Mac": "https://9to5mac.com/2021/09/02/apple-watch-series-7-macbook-pro-production/",
    "AMD and Nvidia": "https://www.techradar.com/news/computing-components/graphics-cards/amd-vs-nvidia-who-makes-the-best-graphics-cards-699480",
    "delaying parts of its Alder Lake launch until CES 2022": "https://www.techradar.com/news/intel-12th-gen-alder-lake-cpu-release-time-table"
  }
}