{
  "source": "https://www.techradar.com/news/spotify-launches-podcast-subscriptions-to-rival-apple",
  "title": "Spotify launches podcast subscriptions to rival Apple",
  "category": "audio-visual",
  "updated": "2021-04-28T08:57:30Z",
  "author": "olivia-tambini",
  "summary": "The streaming giants do battle in the world of podcasts",
  "article": [
    "Spotify has launched a new podcast subscription service, just over a week after Apple Podcasts Subscriptions was announced at the tech giant's spring event.",
    "Spotify's new subscription model allows podcast creators to charge fans extra for exclusive content via its podcast production platform Anchor, and it's launching in the US immediately before being rolled out globally.",
    "Unlike Apple, Spotify says it won't take a cut from these creators for two years (aside from transaction fees), and will only require 5% of the revenue after this.",
    "For comparison, Apple will be taking a 30% cut of creator-led subscriptions in the first year, and 15% in the second, so Spotify's model could be more attractive to podcast makers.",
    "None of this means that your favorite podcasts are going to disappear behind a paywall. However, a lot of podcasts are likely to start offering bonus episodes and early access to downloads for paying members – something that creators already do through platforms such as Patreon.",
    "You'll should be able to easily tell which podcasts come with a price tag on Spotify. While the subscriber-only content will be searchable and discoverable within the Spotify app, these shows will be marked with a lock icon where you'd usually see the play button.",
    "If you do choose to pay for extra content, you'll need to head to its Anchor profile page or via a link in the show notes in the Spotify app. As Engadget notes, you won't be able to subscribe directly in the Spotify app, which means Spotify won't have to pay Apple a cut of in-app purchases.",
    "In a sense, this is nothing new, with a lot of podcasts already offering paid-for extras for a select few. However, it's a sign of both Apple and Spotify wanting to take more control over a previously open and even ecosystem (while making more money at the same time).",
    "As for how much you're going to have to pay, again that will be up to the podcast makers themselves – but it's unlikely that listeners are going to want to stump up for another big subscription on top of their ones for cloud storage, video streaming, music and so on.",
    "Asking listeners to pay more for their content is a hot topic for Spotify at the moment, with subscriptions to the music streaming service due to get more expensive in the US and UK.",
    "The biggest price jump is coming to Premium Family, which is rising from $14.99 / £14.99 to $15.99 / £16.99 per month. Spotify says that this is \"so we can continue to bring you new content and features that you can enjoy as a family and as individuals\".",
    "While the Family plan is the only affected service in the US, the price of a monthly subscription is being increased across the board in the UK: Premium Student is being raised from £4.99 to £5.99, and Premium Duo is going from £12.99 to £13.99.",
    "Spotify Premium remains unchanged, and still costs $9.99 / £9.99 per month in both regions.",
    "Whether Spotify users will be happy to stump up more cash remains to be seen. However, the fact that the company isn't taking a cut from podcast creators for the first two years – which means you can pretty much be sure your money is going to support the shows you love – may convince enough listeners to stick with the streaming giant rather than jumping ship to Apple."
  ],
  "headers": {
    "9": "Rising costs"
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Podcasts Subscriptions": "https://www.techradar.com/news/apple-podcasts-subscriptions",
    "favorite podcasts": "https://www.techradar.com/news/best-podcasts",
    "Engadget": "https://www.engadget.com/spotify-podcast-subscription-platform-120040301.html",
    "more expensive in the US and UK": "https://www.techradar.com/news/bad-news-for-spotify-family-subscribers-as-price-hike-looms"
  }
}