{
  "source": "https://www.techradar.com/news/htc-vive-flow-could-be-a-portable-vr-headset-to-rival-the-oculus-go",
  "title": "HTC Vive Flow could be a portable VR headset to rival the Oculus Go",
  "category": "gaming",
  "updated": "2021-10-04T16:15:04Z",
  "author": "axel-metz",
  "summary": "Go with the Flow",
  "article": [
    "It’s been a busy year for HTC and virtual reality (VR), but recent teaser images suggest the Taiwanese company has yet another product up its sleeve in 2021.",
    "Ahead of the brand’s cryptic ‘Go with the Flow’ event on October 14, HTC tweeted the date, a link to its Vive website and an image showing a mysterious-looking canister sitting next to a laptop.",
    "The company then followed up by sharing further tweets that seem to hint at a wellness-focused VR product, which recent trademark filings suggest could be called the Vive Flow – and we think, if it’s a headset, it’ll be a rival to the portable Oculus Go.",
    "HTC’s latest mixed reality product, the HTC Vive Focus 3, was an impressive but business-focused VR headset that catered to a niche market, and while the HTC Vive still ranks among our picks for the best VR headset you can buy today, it could be time for the company to launch a new cheaper, wireless VR option for casual consumers.",
    "Well, if these teaser images are anything to go by, the Vive Flow could be just that.",
    "According to a recent report by UploadVR – which, incidentally, was retweeted by HTC itself – the speculatively named Vive Flow has been attributed with the same Statement of Use trademark as the aforementioned Vive Focus, suggesting HTC is gearing up to release an entirely new headset or, at least, some new controllers.",
    "Interestingly, Vive China President Alvin Wang Graylin also teased that the event will deliver “big news in a small package,” accompanying his tweet with an image revealing key art that appears to show two lens-like shapes. You can check it out below.",
    "That’s about all we have so far for official teasers, but could we see HTC unveil a wireless VR headset small enough to be enclosed (and possibly charged) in a portable case? The combination of images we have so far suggests so.",
    "Exactly (or even remotely) how the Vive Flow touches upon the work and wellbeing iconography hinted at by HTC in this cryptic marketing material, though, remains unclear.",
    "Still, you’d best believe we’ll be tuning in on October 14 to find out – especially as the event comes just two weeks prior to Facebook’s own Oculus-related showcase."
  ],
  "headers": {},
  "links": {
    "tweeted": "https://twitter.com/htcvive/status/1442627923576561677?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1442627923576561677%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fvrscout.com%2Fnews%2Fwhat-is-the-vive-flow-htcs-mysterious-new-device%2F",
    "Vive website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1020356448340059100&xs=1&url=https%3A%2F%2Fwww.vive.com%2Fuk%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhtc-vive-flow-could-be-a-portable-vr-headset-to-rival-the-oculus-go",
    "tweets": "https://twitter.com/htcvive/status/1443984199527145514",
    "recent trademark filings": "https://trademarks.justia.com/909/04/vive-90904710.html",
    "Oculus Go": "https://www.techradar.com/reviews/oculus-go",
    "HTC Vive Focus 3": "https://www.techradar.com/reviews/htc-vive-focus-3",
    "business-focused VR headset": "https://www.techradar.com/news/best-business-vr-headset",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "best VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "UploadVR": "https://uploadvr.com/htc-vive-teasing-flow-announcement/",
    "teased": "https://twitter.com/AGraylin/status/1442640826786402308"
  }
}