{
  "source": "https://www.techradar.com/news/whatsapp-now-allows-for-disappearing-messages-but-whats-the-point",
  "title": "WhatsApp now allows for disappearing messages - but what's the point?",
  "category": "computing",
  "updated": "2021-12-07T11:57:20Z",
  "author": "daryl-baxter",
  "summary": "Bang, and the messages are gone?",
  "article": [
    "While the feature was introduced earlier this year, WhatsApp has now expanded disappearing messages by allowing you to switch it on by default for all chats, alongside more changes.",
    "The company has been introducing many features to the messaging app over the course of the year, with a refined appearance, multi-device support so you don't need to use your phone to manage chats, and more to better rival other apps such as Telegram and iMessage.",
    "However, its new privacy policy has been a source of contention with users, giving WhatsApp the ability to read messages without your consent. While this expanded feature gives you greater control for certain chats, it could encourage abusers to use the app to better hide any conversations that could bring attention to law enforcement.",
    "In a blog post where the company is advocating the feature for better control over your chats, you can change the expiration timer to 24 hours, 7 days or 90 days.",
    "This way, any messages are deleted after a certain time from when they're sent.",
    "While the feature is slowly rolling out to devices, you can find it by going to Settings > Privacy > Disappearing Messages, and you can set the expiration to one of the three timers.",
    "This applies to both iOS and Android, and the setting you choose will also apply to other devices you use WhatsApp on, such as the web, Windows 11, and iPad.",
    "Data is an important commodity in today's age, especially when it comes to social media and messaging apps. Users want to feel safe in what they post and what they share, but disappearing messages, especially if it's switched on by the recipient, and the sender doesn't know them, may struggle to quell anxiety in what's being discussed.",
    "While WhatsApp has published a further post in explaining the disappearing messages, it still won't satisfy others who think that this is a feature that could be taken advantage of.",
    "Indeed, the same post explicitly states that users should 'Only use disappearing messages with trusted individuals.'",
    "It's a feature that doesn't bring much advantage to the user - the main reason of messaging apps is to keep in touch with friends and family. If we're now given the ability to remove messages, it brings in certain scenarios that weren't possible before, such as fraud and more incriminating situations.",
    "Disappearing messages is an example of a feature that is useful in theory, but flawed in execution, and perhaps WhatsApp should roll back this feature for now."
  ],
  "headers": {
    "3": "How to activate the new WhatsApp feature",
    "7": "Analysis: A cocktail of blunders to come"
  },
  "links": {
    "was introduced": "https://www.techradar.com/news/whatsapp-is-bringing-even-more-options-to-disappearing-messages",
    "WhatsApp": "https://www.techradar.com/news/whatsapp-tests-feature-that-lets-you-hide-the-last-seen-status-from-your-boss",
    "many features": "https://www.techradar.com/news/we-speak-to-whatsapp-about-the-new-features-coming-up-for-your-device",
    "multi-device support": "https://www.techradar.com/news/whatsapp-update-shows-how-multi-device-linking-will-look",
    "blog post": "https://blog.whatsapp.com/more-control-and-privacy-with-default-disappearing-messages-and-multiple-durations",
    "further post": "https://faq.whatsapp.com/general/chats/about-disappearing-messages/?lang=en"
  }
}