{
  "source": "https://www.techradar.com/news/what-time-is-mortal-kombat-released-on-hbo-max",
  "title": "What time is Mortal Kombat released on HBO Max?",
  "category": "entertainment",
  "updated": "2021-04-21T09:34:46Z",
  "author": "tom-power",
  "summary": "Here's when Mortal Kombat lands on HBO Max",
  "article": [
    "Mortal Kombat, Warner Bros.' upcoming movie reboot of the beloved-and-violent video game series, is ready to blow fans' minds. The R-rated action fantasy film arrives on Friday, April 23, and US-based movie aficionados will want to know what time it launches on HBO Max.",
    "Simon McQuoid's feature film debut has almost earned $20 million in international markets ahead of its simultaneous theatrical and HBO Max release, and it's hoped that this figure will be boosted by US audiences watching it on the big screen.",
    "However, HBO Max subscribers won't pay extra for the privilege of watching it at time, and it'll be safer to watch in the comfort of your own home anyway due to the ongoing Covid-19 pandemic. Knowing when Mortal Kombat will arrive on Warner's streaming service, then, is something you'll want clarification on.",
    "Wonder Woman 1984 and Godzilla vs Kong have already pulled in large viewing figures on HBO Max, and Warner Bros. will no doubt hope Mortal Kombat does the same.",
    "The studio has released footage of the movie's first seven minutes online, too, in a bid to drum up some last-minute interest in it. If you want to get a taste for what Mortal Kombat's bloody action will be like before its HBO Max arrival, you can check out the video below:",
    "If you're ready to find out what time Mortal Kombat will officially drop on HBO Max this Friday, read on.",
    "Mortal Kombat will be released on HBO Max on Friday, April 23 at 12AM PT/3AM ET. It will also launch in theaters on the same date and at the same time, but the movie will be free for a limited time to all HBO Max subscribers.",
    "Those who already have an HBO Max subscription can watch Mortal Kombat as many times as they want, at no extra cost, in the film's first 31-day release window.",
    "This is due to a stance that Warner Bros. took in the wake of the Covid-19 pandemic. With cinema chain doors locked and the movie industry unable to distribute its films in the normal way, Warner Bros. took the decision to release its 2021 slate on HBO Max and in select theaters. This allows audiences to view movies in the safety of their own home if they can't get to a cinema.",
    "Those of you who don't have an HBO Max subscription will need to either sign up for a paying subscription, or upgrade an existing HBO subscription that includes Max as part of its package.",
    "Warner Bros. won't be pursuing this avenue from 2022 onwards, though, so the only way to see new film releases from next year will be in a cinema. For the time being, all of Warner Bros.' new movies, including Mortal Kombat, will be available on HBO Max until a month after their domestic theatrical release dates."
  ],
  "headers": {
    "6": "When does Mortal Kombat release on HBO Max?"
  },
  "links": {
    "Mortal Kombat": "https://www.techradar.com/news/how-to-watch-mortal-kombat-online-see-where-to-stream-new-movie",
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-1082548939310824600&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhat-time-is-mortal-kombat-released-on-hbo-max",
    "Wonder Woman 1984": "https://www.techradar.com/news/why-wonder-woman-1984-is-disappointing",
    "Godzilla vs Kong": "https://www.techradar.com/news/godzilla-vs-kong-mechagodzilla-explained",
    "first 31-day release window": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-1207301066252514000&url=https%3A%2F%2Fwww.hbomax.com%2Fsame-day-premieres%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhat-time-is-mortal-kombat-released-on-hbo-max"
  }
}