{
  "source": "https://www.techradar.com/news/best-buy-nvidia-rtx-3080-restock-line-and-store-locations",
  "title": "Best Buy’s Nvidia RTX 3080 restock has 75 people in line. Only two aren’t resellers",
  "category": "gaming",
  "updated": "2021-12-09T12:08:11Z",
  "author": "matt-swider",
  "summary": "And the person who wants the RTX 3080 for AI research says he went from No. 3 in line to No. 10 due to resellers showing up",
  "article": [
    "Best Buy will restock the Nvidia RTX 3080 GPU, among other Nvidia graphics cards today, Friday, October 1.",
    "There are already lines for the RTX 3080 at Best Buy stores nationwide, according to our on-the-ground reporting, and we did an early survey in New York City: of the 75 people in line for the GPU, only two people aren't resellers. That's right, everyone else in line at this Best Buy is just waiting to resell the RTX 3080 on eBay or StockX for double the retail price of $699.99.",
    "The two Best Buy customers who actually legitimately want to buy the hard-to-buy Nvidia RTX 3080 at MSRP – if they even get the sought-after GPU at this point – want it for different purposes.",
    "One AI research student wants the graphics card for research purposes at New York University, and the other customer wants it for gaming with her husband.",
    "The problem, as we've seen with these Best Buy restock lines in the past, is that the RTX 3080-seeking student went from an alleged third spot in line the night before (Wednesday night) to the tenth (and will probably do far worse come time to hand out the paper tickets for graphics cards on Friday morning).",
    "People constantly rush the line having \"come back from the bathroom\" or other excuses – again, just to resell the RTX 3080. We've also seen this scenario play out during PS5 restock in-store events at Best Buy last week.",
    "The Best Buy will have the RTX 3080 in stock in select stores throughout the United States today, October 1. Paper tickets will be handed out at 7:30am local time.",
    "Don't think that showing up at the posted 7:30am time will get you a GPU, however. As we've witnessed in the past, this can happen as soon as 7am since people are in line right now – and have been since Wednesday morning at some Best Buy store locations.",
    "Best Buy's in-store restock locator for GPUs is much better than the one used by GameStop for its PS5 restock, however, we've still laid out the store list below.",
    "Because not every Best Buy will have the RTX 3080 in stock for this in-store event, do not show up at your local Best Buy before checking this list.",
    "Editor's Note: We included the store locations that had last week's Best Buy PS5 in-store restock and crossed them off to demonstrate how few stores will have the RTX 3080 in stock. The PS5 was more widely available, according to our research. In fact, two states, Mississippi and Washington D.C. as well as Puerto Rico won't get a GPU restock whatsoever today despite having the PS5 before.",
    "A total of 117 Best Buy store locations will have the RTX 3080 today:",
    "Alaska",
    "Alabama",
    "Arkansas",
    "Arizona",
    "California",
    "Colorado",
    "Connecticut",
    "Washington, D.C.",
    "Delaware",
    "Florida",
    "Georgia",
    "Hawaii",
    "Iowa",
    "Idaho",
    "Illinois",
    "Indiana",
    "Kansas",
    "Kentucky",
    "Louisiana",
    "Massachusetts",
    "Maryland",
    "Maine",
    "Michigan",
    "Minnesota",
    "Missouri",
    "Mississippi",
    "Montana",
    "North Carolina",
    "North Dakota",
    "Nebraska",
    "New Hampshire",
    "New Jersey",
    "New Mexico",
    "Nevada",
    "New York",
    "Ohio",
    "Oklahoma",
    "Oregon",
    "Pennsylvania",
    "Puerto Rico",
    "Rhode Island",
    "South Carolina",
    "South Dakota",
    "Tennessee",
    "Texas",
    "Utah",
    "Virgina",
    "Vermont",
    "Washington",
    "Wisconsin",
    "West Virginia",
    "Wyoming",
    "No, the RTX 3080 Ti, RTX 3070 and RTX 3090 should also be available at most stores, but everyone we've talked to so far is waiting in line for the coveted RTX 3080.",
    "And of the two people who we interviewed who wanted the RTX 3080 for legitimate purposes (AI research and gaming), one person, the NYU researcher, said that he'll get another graphics card if he has to, but resell it because he's really after the 3080.",
    "Considering he went from third in line to tenth and will probably slip further, that means the person who wanted a GPU for gaming may be the only person who actually purchases an RTX and keeps it from this 75-strong line at Best Buy in New York City today.",
    "Frustrated online customers, unable to buy the RTX 3080, think a Best Buy in-store restock is great news when the retailer's website is constantly besieged by resellers who use bots to scoop up the RTX inventory before everyone else. This happened on Wednesday, September 29, the date of the latest Best Buy RTX restock online.",
    "The grass is no greener. It's pure chaos each time in certain cities, as we've tweeted about before:",
    "In New York City, the same resellers show up, plant themselves first in line and buy all of the inventory. How fast did these GPUs resell? Before the purchase was even made. They're always pre-sold on StockX or eBay and no one gets the GPU they want for gaming or AI research.",
    "During the last RTX 3080 restock, through our on-the-ground reporting, we identified the first person in line who actually wanted the coveted RTX 3080 (the most popular graphics card on sale at Best Buy that day) for gaming purposes. They for No. 20 in line and actually had a chance to buy it – or so it seemed.",
    "Moments before the first paper tickets were being handed out by Best Buy managers, that No. 20 customer in line became No. 40 in line due to last-second line jumpers – \"friends\" of the people waiting it out in the front of the line, all of whom claimed to have always been there. It turned into a chaotic scene that was not only unfair (an 11-year-old cried) but involved a lot of pushing, shoving and shouting.",
    "The profit margins on the PS5 and Xbox Series X are big, but not as dramatic as Nvidia GPUs. So we'll have to see how this Best Buy in-store restock goes when it comes to ensuring everyone gets their console of choice fairly and safely."
  ],
  "headers": {
    "6": "Best Buy RTX 3080 restock time today",
    "9": "Best Buy RTX 3080 GPU restock store locations list",
    "64": "Will it be just the RTX 3080?",
    "67": "Best Buy restock line is 'pure chaos' each time"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "in-store restock locator": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-3939691741498200600&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fclp-computers-tablets%2Fnvidia-geforce-rtx-graphics-cards%2Fpcmcat1619723841347.c%3Fid%3Dpcmcat1619723841347%26ref%3Drdr%26loc%3DNVIDIAGraphicsCard&article_name=Best%20Buy%E2%80%99s%20Nvidia%20RTX%203080%20restock%20has%2075%20people%20in%20line.%20Only%20two%20aren%E2%80%99t%20resellers&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fbest-buy-nvidia-rtx-3080-restock-line-and-store-locations",
    "Best Buy PS5 in-store restock": "https://www.techradar.com/news/exclusive-ps5-xbox-restock-best-buy-in-store-september-23",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}