{
  "source": "https://www.techradar.com/news/wi-fi-6e-the-future-of-connected-business",
  "title": "Wi-Fi 6E: The future of connected business?",
  "category": "computing",
  "updated": "2021-09-30T10:14:54Z",
  "author": "simon-wilson",
  "summary": "Simon Wilson explores what Wi-Fi 6E means for business",
  "article": [
    "Despite the pandemic, the sprint from wires to Wi-Fi has continued at pace, and with good reason. As organizations speed up their transition to the cloud, increase their use of bandwidth-devouring video and battle a rocketing number of devices, the demand for Wi-Fi connectivity has reached a whole new level. In fact, according to the Wi-Fi alliance, there are as many as 16.4 bn clients and IoT devices now in use.",
    "The pandemic has undoubtedly been a catalyst for faster, more agile connectivity. However, even before the events of the past year and a half, wireless networks were already strained; for years, WLAN has been under increasing pressure due to the growth in the number of solely wireless devices demanding more and more data.",
    "The emergence of latency-critical applications such as AR and VR only adds to this. Meaning that ultimately, wireless networks will at some point become oversubscribed, leading to sub-par application performance, negative user experiences and lagging productivity.",
    "Now the latest networking development, Wi-Fi 6E, is widely regarded as the solution for this, promising to make Wi-Fi technology faster and more powerful than ever before.",
    "But what progress has Europe made towards Wi-Fi 6E adoption over the past year? And what does this mean for businesses considering technology investments in the near future?",
    "While the regulatory body in North America (the FCC) were quick to open up the full spectrum of 1,200 MHz offered within the 6 GHz band, others including Europe have taken a more cautious approach. With the continent adopting a bandwidth of 5925-6425 MHz, this means that so far only the lower 500 MHz has been opened up.",
    "While not quite what the technology world wanted, it still offers a huge opportunity and supports Europe's political drive to become a gigabit society by 2030.",
    "All the while, European approval at the current level means that manufacturers are busy developing products to support broader adoption and availability of Wi-Fi 6E. IDC predict more than 338 million devices will enter the market, but just 20% of all Wi-Fi 6 device shipments will support 6 GHz by 2022. Regulators in Europe must continue collaborating with industry representatives to open up the final 6425-7125 MHz band to ensure growing capacity demands are met.",
    "It’s worth remembering that Wi-Fi 6E is still very new and as a result, not many client devices support it just yet and businesses should not dive straight into an upgrade just because they can. However, the small cost delta and longer lifespan means 6E should be a serious consideration for new builds and pilot projects.",
    "Like any new technological advancement, there are several considerations and, like most things, it’s not a ‘one fits all’ approach, the needs and requirements of the business will determine the best route forwards.",
    "Fundamentally organizations must ensure their country has adopted 6 GHz. The UK and most of Europe has adopted 6GHz ¬¬(at the time of writing), but countries such as Oman, Turkey and Jordon are all still in the consultation process. Businesses based in such locations will be unable to buy or implement 6E, as such they could try to lobby their local regulator – however the reality is that they will have to wait until a decision has been made. Assuming country adoption is in place, organizations should then consider areas such as what the additional bandwidth will be used for, where it’s needed, and what’s already in place. Businesses most suited to 6E are those looking to expand into high-definition video, VR and AR technologies, those with low latency requirements as well as those planning a refresh of anything older than Wi-Fi6. In addition, organizations wanting to future-proof their business by protecting technology investments will also be viable candidates for 6E adoption. With the new band, product refresh cycles can be extended from five to six years to eight to 10, meaning that upgrades could last up to 50% longer.",
    "It’s also important to note that 6 GHz is only currently available indoors, so companies that require outdoor connectivity won’t benefit from it at this stage. Companies operating in primarily outdoor environments and organizations based in locations that have already announced they won’t be adopting the new 6 GHz band, will have to stick to Wi-Fi 6 for the time being.",
    "It’s an age-old argument – will Wi-Fi still be necessary in a 5G world? The truth of the matter is that whilst both are different, they are equally complimentary. The same applies to 5G and Wi-Fi 6E; together, they provide increased speeds, higher capacity, and lower latency.",
    "Businesses don’t need to (and shouldn’t) take a ‘one or the other’ approach. Currently, around 60% of cellular traffic is offloaded to Wi-Fi and that number is only increasing, making it all the more important. Wi-Fi is also cheaper to deploy, maintain, and scale; without the ability to offload traffic to Wi-Fi, 4G and 5G networks would become considerably more expensive. This is especially true for those in the UK where service providers have made the decision to re-introduce roaming charges – Brexit now means travelers will likely prefer free Wi-Fi over having to fork up cash to cover roaming charges.",
    "In addition, mobile operators would need to invest more into network densification to increase network capacity. It makes sense, therefore, for the two technologies to work in tandem to ensure a robust user experience.",
    "The benefits of Wi-Fi 6E are clear and, alongside other important networking advancements, it is set to enable businesses to become more connected than ever before. Wave goodbye to sluggish connections and poor user experiences and replace them with powerful, high-speed networks.",
    "However, they must make the right choice for them. Not every company is immediately suited to Wi-Fi 6E, and an incorrect investment could be a costly mistake at a time when every pound counts. Instead, businesses should spend time assessing their business needs both now, and for the future, to ensure they embark along the right path for their digital transformation journey. For those utilizing AR/VR and wishing to take advantage of next-generation devices, Wi-Fi 6E will be an obvious choice."
  ],
  "headers": {
    "5": "Expanding Europe’s airwaves",
    "8": "Wi-Fi 6 vs. Wi-Fi 6E",
    "12": "Hang on, what about 5G?"
  },
  "links": {
    "Wi-Fi": "https://www.techradar.com/news/the-best-wi-fi-extenders",
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "application": "https://www.techradar.com/best/best-android-apps-2021",
    "VR": "https://www.techradar.com/news/the-best-vr-headset",
    "AR": "https://www.techradar.com/news/best-ar-apps",
    "5G": "https://www.techradar.com/best/best-5g-phones"
  }
}