{
  "source": "https://www.techradar.com/news/climate-change-drove-woolly-mammoth-extinct-not-humans",
  "title": "Climate change drove woolly mammoth extinct, not humans",
  "category": "appliances",
  "updated": "2021-10-20T15:00:00Z",
  "author": "john-loeffler",
  "summary": "DNA research shows the world got too wet for woolly mammoths",
  "article": [
    "For the last century, the woolly mammoth has been a species of endless fascination and debate, especially around what drove this hairy cousin of the elephant to extinction. New research now hopes to settle the debate once and for all in favor of climate change, not human activity.",
    "The research, published today in the journal Nature, argues that even though woolly mammoths made up an important staple in early humans' diet and were an important cultural touchstone for our ancestors, we weren't the culprit when it came to mammoth extinction as one side of the extinction debate has argued.",
    "Mammoths were important prey for early humans since even as mammoth meat kept ancient hunter-gatherer bands of humans alive, their skeletons were used as building material in human shelters, their tusks were carved into harpoons, and the earliest human musical instrument ever found was a flute carved out of a mammoth bone.",
    "But we weren't responsible for hunting the famous megafauna out of existence. For that, we should blame melting icebergs coming out of the last ice age, which ended about 12,000 years ago.",
    "\"Scientists have argued for 100 years about why mammoths went extinct,\" said Professor Eske Willerslev, director of The Lundbeck Foundation GeoGenetics Centre, University of Copenhagen, and a Fellow of St John’s College, University of Cambridge.",
    "\"Humans have been blamed because the animals had survived for millions of years without climate change killing them off before, but when they lived alongside humans they didn’t last long and we were accused of hunting them to death.",
    "“We have finally been able to prove was that it was not just the climate changing that was the problem, but the speed of it that was the final nail in the coffin – they were not able to adapt quickly enough when the landscape dramatically transformed and their food became scarce.\"",
    "In order to do this, the research team, led by professor Willerslev, used a technique that breaks up a genome into smaller DNA samples to be sequenced individually on plant and animal remains taken from soil samples collected over a 20 year period from Arctic sites where mammoth remains had been previously found.",
    "They discovered that as the world came out of the last ice age, the plants that mammoths relied on for food became more scarce as wetlands replaced snow covered tundra.",
    "“We zoomed into the intricate detail of the environmental DNA and mapped out the population spread of these mammals and show how it becomes smaller and smaller and their genetic diversity gets smaller and smaller too, which made it even harder for them to survive,\" said Dr Yucheng Wang, a research associate at the Department of Zoology, University of Cambridge, and first author on the new paper.",
    "“When the climate got wetter and the ice began to melt it led to the formation of lakes, rivers, and marshes. The ecosystem changed and the biomass of the vegetation reduced and would not have been able to sustain the herds of mammoths.\"",
    "\"We have shown that climate change, specifically precipitation, directly drives the change in the vegetation – humans had no impact on them at all based on our models,\" Dr. Wang added.",
    "While some might be tempted to pat humanity on the back for not completely annihilating the woolly mammoth, our species has had a bloody hand in the extinctions of countless species in our relatively short time on this earth.",
    "Fossil records show that once humans landed in Australia, the population of the continent's megafauna plummeted and eventually went extinct from a combination of human hunting and climate change. There's evidence that other human species like Homo Neanderthal were also victims of prolonged interaction with Homo Sapiens.",
    "Then, of course, there's the modern era, with human activity since the Industrial Revolution being blamed for the so-called Anthropocene extinction event, which is just the sixth mass extinction event in the history of life on this planet.",
    "“[Wolly mammoth extinction from climate change] is a stark lesson from history and shows how unpredictable climate change is,\" professor Willerslev said, \"once something is lost, there is no going back. Precipitation was the cause of the extinction of woolly mammoths through the changes to plants. The change happened so quickly that they could not adapt and evolve to survive.",
    "“It shows nothing is guaranteed when it comes to the impact of dramatic changes in the weather. The early humans would have seen the world change beyond all recognition – that could easily happen again and we cannot take for granted that we will even be around to witness it. The only thing we can predict with any certainty is that the change will be massive.”"
  ],
  "headers": {
    "12": "Analysis: this doesn't let humans off the hook in the slightest"
  },
  "links": {
    "Nature": "https://doi.org/10.1038/s41586-021-04016-x",
    "combination of human hunting and climate change": "https://theconversation.com/did-people-or-climate-kill-off-the-megafauna-actually-it-was-both-127803",
    "prolonged interaction with Homo Sapiens": "https://www.bbc.com/future/article/20201102-did-neanderthals-go-to-war-with-our-ancestors",
    "Anthropocene extinction event": "https://www.theguardian.com/environment/2017/jul/10/earths-sixth-mass-extinction-event-already-underway-scientists-warn"
  }
}