{
  "source": "https://www.techradar.com/news/motorola-space-charging-video-shows-it-over-the-air-recharging-4-phones-at-once",
  "title": "Motorola 'Space Charging' video shows it over-the-air recharging 4 phones at once",
  "category": "phones",
  "updated": "2021-09-09T00:09:53Z",
  "author": "david-lumb",
  "summary": "Charging every phone in the room?",
  "article": [
    "Motorola showed off its over-the-air (OTA) wireless “Space Charging” tech in an unlisted and supposed demo video – and while it still seems a ways off from being production-ready, the company demonstrated that one of its charging stations can remotely juice up four phones at once.",
    "The station itself (or the prototype shown in the video, at least) looks like a WiFi router – a gray plastic rectangle on a stand with blinking lights on the side and a Motorola logo emblazoned in the middle.",
    "The video shows the station charging up to four phones (what appear to be Motorola Edge flagship devices, presumably with wireless charging coils) at a distance of one meter, and shows the station recharging a phone at up to three meters. Whether it can juice up multiple devices at that range is unclear, and it seems to have a maximum charging rate of 5W according to Android Central, which first found the video.",
    "That’s a paltry rate compared to other wireless chargers on the market, which exceed 15W in even affordable models; of course, those only charge if devices are placed directly over the charger. It’s much easier, if slower, to have one station in the center of a room recharge a phone in a pocket or in hand.",
    "Most flagship phones pack wireless charging these days, but as previously mentioned, the ‘wireless’ part only means there isn’t a wire between the phone and charger – it still requires extremely close proximity to transfer power.",
    "The advantage for over the air charging is obvious, but it’s unclear how close we are to getting a fully-functioning version, let alone phones that are compatible if they need more than stock wireless charging cables. Not many phonemakers seem to be ahead with over the air charging, however – only Motorola, Xiaomi, and Oppo have claimed they’re working on the tech.",
    "Motorola is working with the company GuRu to develop its Space Charging tech, using radio waves to recharge devices at a distance, while Xiaomi’s Mi Air Charge is an in-house solution with five phase interference antennas to locate and distantly charge phones. Oppo’s solution opts for magnetic resonance to juice up phones, but has less range than Xiaomi’s option, at least for now.",
    "All this tech still seems far from ready to hit the market, but at least they’re on the way – which is more than we can say for a possible Samsung OTA option, which has only shown up in a patent."
  ],
  "headers": {
    "4": "Analysis: over the air charging, the next frontier?"
  },
  "links": {
    "video": "https://www.youtube.com/watch?v=CguBCyvB0Vg",
    "Android Central": "https://www.androidcentral.com/motorolas-new-space-charging-tech-can-charge-four-devices-simultaneously",
    "Space Charging": "https://www.techradar.com/news/motorolas-over-the-air-charging-tech-for-smartphones-could-be-available-soon",
    "Mi Air Charge": "https://www.techradar.com/news/xiaomis-new-wireless-charging-can-charge-a-phone-from-the-other-side-of-the-room",
    "patent": "https://www.techradar.com/news/samsung-files-new-patent-for-over-the-air-charging"
  }
}