{
  "source": "https://www.techradar.com/news/why-ill-never-give-up-my-echo-spot",
  "title": "Why I’ll never give up my Echo Spot",
  "category": "smart-home",
  "updated": "2021-01-30T15:00:01Z",
  "author": "carrie-ann-skinner",
  "summary": "Opinion: Amazon's smallest smart display is also its best",
  "article": [
    "When it comes to Amazon Echo smart speakers, there’s plenty of choice. From the discreet Echo Dot to the booming Echo Studio and the Echo Show with its built-in display, it seems like there’s an Amazon smart speaker for everyone.",
    "For me, the Echo Spot remains my favourite Amazon smart speaker. Launched in late 2017, it was the second Amazon smart speaker to feature a screen. However, unlike the Echo Show, it had a spherical design with a petite 2.5-inch display.",
    "Amazon branded the device a ‘smart alarm clock’ claiming it was best suited on a bedside tablet, but considering it also included a 0.3MP camera and boasted of the 'drop-ins' feature where others with Echo speakers could start a video call with you in seconds, some found it to be a little creepy",
    "The Echo Spot is my favourite Echo device of all time. In fact, even though I have several smart speakers in my home, it's the one I use most. Here's why I think it's the best compact smart display Amazon has made to date.",
    "I’ll be honest, my Echo Spot has never been near my bedroom. Instead, it resides in the kitchen as it really is the perfect smart companion when I’m preparing food.",
    "First off, its compact size and shape means it fits perfectly on my kitchen windowsill. Yes, the Echo Show 5 also fits in the same spot, but the Echo Spot wins here thanks to its plastic casing. I can simply wipe it clean, ensuring its sleek look isn’t ruined by a splash of tomato sauce. Unfortunately, the same isn’t true for the Echo Show 5's fabric covering, which may look good but certainly doesn't survive spills.",
    "The Echo Show 5 may have five microphones, compared to four on the Echo spot, but the spherical design of the Spot means the microphones can be placed further apart making its ability to pick up my voice much better. No matter where I am in the kitchen, whether the exactor fan is running at full pelt or the washing machine is in it’s fastest spin cycle, the Echo Spot can pick up my voice. I found the Echo Show 5 frustrating to use in the kitchen, as I end up getting more and more irritated, and my voice rising several decibels each time Alexa misheard me, or worse didn’t acknowledge me at all.",
    "At 2.5-inches, I’ll admit the Echo Spot's display is small, but it’s perfect for use in the kitchen. If I’m following a recipe, I can quickly glance at the screen to see the step if I want more than just Alexa’s audible guidance.",
    "Similarly, when I ask “How long left on the timer” not only does Alexa tell me, she’ll also show me (and she’ll do it for every timer I have set). This information fits perfectly on the small display. I’ve no plans to watch music videos or TV clips while I’m cooking, so a bigger screen is a waste.",
    "There is one small issue with the Echo Spot - the price. It’s £119.99 / $160 / AU$ 210, and the lowest it’s been discounted to is £79.99 / $110 / AU$140, which is also the list price as the Echo Show 5. However, the Echo Show 5 has been as low as £39.99 / $55 / AU$70 during Black Friday 2020 and is currently selling for £59.99 / $80 / AU$105. That makes it an expensive device to covert.",
    "Sadly, two years after it's launch Amazon quietly discontinued the Echo Spot in most regions except the UK, where it’s still on sale today, although it doesn’t appear in the line-up of Echo devices at the top of Amazon's homepage - you’ll have to search for it instead.",
    "However for me, it's hard to envisage anything more perfect for me and the way I use Alexa than the Echo Spot, so I won’t be giving it up any time soon."
  ],
  "headers": {
    "4": "Kitchen companion",
    "7": "Small but perfectly formed"
  },
  "links": {
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "Echo Spot": "https://www.techradar.com/reviews/amazon-echo-spot",
    "Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5"
  }
}