{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-martian-manhunter-explained",
  "title": "Zack Snyder’s Justice League: Martian Manhunter explained",
  "category": "entertainment",
  "updated": "2021-03-19T18:23:26Z",
  "author": "tom-power",
  "summary": "Get the lowdown on the Snyder Cut’s superhero cameo",
  "article": [
    "Spoilers follow for Zack Snyder’s Justice League.",
    "If you've reached the end of Zack Snyder’s Justice League, you might be wondering who the green guy floating in front of Bruce Wayne's lakeside house at the end is. DC Comics fans already know the answer: this is the Martian Manhunter, played by Harry Lennix. In this guide, we'll explain who he is, and the significance of his appearance in the Snyder Cut.",
    "The Martian Manhunter cameo is among the many major changes Snyder has made to his version of the 2017 film, alongside a very different ending and a new Knightmare epilogue sequence. Below, we'll tell you everything you need to know about this new superhero, as well as a little about his origins in DC's comics.",
    "Like we said at the top of the page, there are big spoilers for the Snyder Cut incoming. If you’ve somehow opened this page without making it to the end credits, you really should turn back.",
    "Zack Snyder had teased that his movie would end with a massive cameo, but rather than hitting us with a big surprise, it turns out that this character had already been revealed by the director pre-release.",
    "That may come as a disappointment to some fans, but for anyone who hasn’t been keeping up with Snyder’s various interviews, they might not see it coming. After Bruce Wayne wakes from his nightmare of a Darkseid-ravaged future, he heads outside to see what appears to be Superman floating down to meet him - only it isn’t the son of Krypton.",
    "It’s Martian Manhunter, another superhero who has been hiding in plain sight throughout Snyder’s DCEU movies. He’s been masquerading as General Calvin Swanwick, played by Harry Lennix, who viewers will recognize from Man of Steel and Batman v Superman.",
    "Martian Manhunter reveals his true identity to Bruce Wayne, who seems taken aback by his arrival. The alien superhero, who also goes by the name J’onn J’onzz, tells Bruce that the Justice League needs to find the Anti-Life Equation before Darkseid does, and that he’s prepared to help after hiding in the shadows for too long. He says he’ll be in touch with Bruce soon and flies into the distance as the screen turns black.",
    "We’ll never know how prominent a role Martian Manhunter would have played in Snyder’s Justice League sequels, since there are no plans to make them. Given his reveal in this movie, however, we can predict that he would have played a much greater role down the line. What could've been, huh?",
    "For those unfamiliar with the character, in the comics Martian Manhunter is a Mars law enforcement officer who ends up being marooned on Earth. He becomes a police detective and superhero when he realizes he can’t return home, and helps to found the Justice League in his new home.",
    "Martian Manhunter made his comic debut in Detective Comics #225 in November 1955. Created by writer Joseph Samachson and illustrator Joe Certa, Martian Manhunter is a green-skinned humanoid alien who accidentally arrives on Earth when a scientific experiment goes wrong.",
    "Pulled to our world by an experimental teleportation beam, J’onzz is permanently stuck on Earth when the project’s lead scientist dies of shock over the superhero’s arrival. Until a time when Martian technology can bring him home, Martian Manhunter adopts the human moniker John Jones, becomes a police detective, and uses his superpowers to aid humanity.",
    "Speaking of abilities, Martian Manhunter has a few. They’re all pretty similar to Superman’s so, if you’re clued up on the Man of Steel’s powers, J’onn J’onzz superpowers won’t be unfamiliar. They include flight, superhuman strength, regeneration, durability, and heat vision. Unlike Superman, Martian Manhunter is able to turn invisible, and use telekinesis and telepathy, but he doesn’t possess superhuman breath like his alien counterpart.",
    "Martian Manhunter is also able to shapeshift, which is an ability we glimpse in Zack Snyder’s Justice League. After visiting Lois Lane, Superman’s adopted mother Martha leaves the former’s apartment - only it isn’t the Martha we know from Man of Steel and Batman v Superman.",
    "As Martha’s eyes begin to glow red, a cape drapes around her and her clothes change. It turns out that Martian Manhunter was masquerading as Clark Kent’s mom to persuade Lois to move on with her life after Superman’s death. J’onn J’onzz then shapeshifts into General Swanwick before leaving the building.",
    "What of his involvement in the Justice League’s comic history, then? Martian Manhunter helped to form the Justice League of America alongside Batman, Superman, Wonder Woman, The Flash, Aquaman, and Green Lantern. Its formation occurred in The Brave and the Bold #28 in March 1960, and he’s appeared in standalone and Justice League comics in the 66 years since his creation.",
    "Martian Manhunter was installed as Justice League chairman during DC Comics’ relaunching of its comic book lines in 2016. He’s also a member of the newest incarnation of the Justice League, which arrived as part of DC’s Infinite Frontier relaunch in March 2021.",
    "If you’re hungry for more on Zack Snyder’s Justice League, we’ve got plenty to keep you busy. Check out why the movie utilizes a 4:3 picture format over its widescreen counterpart, and our review to see if it lines up with your thoughts on the movie."
  ],
  "headers": {
    "4": "Zack Snyder’s Justice League: who is Martian Manhunter?",
    "9": "Zack Snyder’s Justice League: Martian Manhunter’s comic history explained"
  },
  "links": {
    "Zack Snyder’s Justice League": "https://www.techradar.com/news/how-to-watch-justice-league-zack-snyder-cut-online",
    "very different ending": "https://www.techradar.com/news/zack-snyders-justice-league-ending-explained",
    "new Knightmare epilogue sequence": "https://www.techradar.com/news/zack-snyders-justice-league-epilogue-explained-what-the-knightmare-means",
    "massive cameo": "https://www.techradar.com/news/zack-snyders-justice-league-will-end-with-a-massive-dc-cameo-but-who-will-it-be",
    "4:3 picture format": "https://www.techradar.com/news/justice-league-aspect-ratio-why-the-snyder-cut-isnt-in-widescreen",
    "our review": "https://www.techradar.com/reviews/zack-snyders-justice-league"
  }
}