{
  "source": "https://www.techradar.com/news/iphone-12-vs-iphone-6s-see-the-difference-in-game-graphics-youre-missing-out-on",
  "title": "iPhone 12 vs iPhone 6S: see the difference in game graphics you're missing out on",
  "category": "phones",
  "updated": "2021-03-09T18:00:40Z",
  "author": "david-lumb",
  "summary": "iPhone gaming: the difference in playing on new vs. old models",
  "article": [
    "The iPhone 12 Pro is undoubtedly the most powerful phone Apple has ever released, and on sheer digital muscle, it ranks at the top of benchmarks in our testing. But what does that mean for gaming? We chatted with a handful of devs about how their upcoming high-profile games will play on an iPhone 12 – and what you might miss out on if you don’t upgrade.",
    "Broadly speaking, iPhones get better and better internals every year, with better specs powering better graphics. Playing the newest games on older phones means you’ll miss out on effects that add graphical polish, like advanced lighting, depth of field, and environmental touches like clouds or shadows. Gaming on new phones means a superior visual experience, and these days, mobile game graphics aren’t too far behind consoles.",
    "When it comes to older and lower-spec phones, developers prioritize something other than graphical flourishes. To preserve playability, they strive for a consistent framerate, explains Ethan Young, development director of Realm of Champions, which launched in December 2020. A spinoff of Kabam’s previous hit one-on-one fighting mobile game Marvel Contest of Champions, the new Realm of Champions has players team up with two other gamers in 3-on-3 arena fights.",
    "“We always prioritize a stable frame rate in order to level the playing field and keep our games running smoothly on all tiers of devices,” Young told TechRadar. “To accomplish this, we built a rendering system with scalable quality levels for our shaders, lighting, shadows, post-effects, and more. This system allows our games to look great on all supported devices, and really shine on the newest models.”",
    "The game analyzes which device you’re using and uses a priority system to rank which effects are most important to show, Young explained. The scalable quality levels are driven by a device’s GPU, as well as frame rate data collected and monitored over time, and the game serves up the best graphics possible – even on an older iPhone.",
    "“Devices are tuned in such a way that no matter how new or old they are, they will receive the best possible visuals while maintaining a stable frame rate,” Young assured.",
    "We put these claims into action, but given most of these games haven’t come out yet. Of the games in this article, we were only able to test Marvel Realm of Champions across multiple devices. We pitted an iPhone 12 Pro against an iPhone 6S and observed the differences – which weren’t as huge as you’d think.",
    "Kabam’s claim about maintaining stable frame rates held up: while playing the game in identical conditions (home WiFi), it ran seamlessly on both the iPhone 12 Pro and iPhone 6S. Despite tons of effects going off at once, which didn’t seem to be more prevalent on the newer and more powerful iPhone, the game was responsive on both phones and didn’t suffer any slowdown – which is key in a real-time arena combat game.",
    "The big difference lies in the graphics – and while the iPhone 6S is no slouch here, it does show lower-resolution character models and maps, which are especially clear in side-by-side images. You’ll notice in these end-of-match screens that the characters in the first image (of the 6S) is noticeably grainier, while the second (iPhone 12 Pro) are much smoother – and other effects, like depth of field blurring the background, are present.",
    "(In the comparison photos below, remember that the iPhone 6S has chunky top and bottom bezels with a big home button, while the iPhone 12 Pro has an edge-to-edge display. All photo galleries show the iPhone 6S first, then the iPhone 12 Pro.)",
    "This graphical divide extends throughout the game, with the iPhone 12 Pro having overall smoother character models, richer colors, and vivid environmental effects. Some of this is for obvious reasons (the 12 Pro’s newer A14 Bionic chipset vs. the 6S’s A9 chipset), but also due to differences between the new iPhone 12 Pro’s higher-resolution (2532 x 1170) 6.1-inch OLED display with HDR10 vs. the iPhone 6S’s lower-resolution (1334 x 750) 4.7-inch IPS LCD display.",
    "Suffice to say that the additional screen real estate in the newer iPhone 12 Pro also makes it a bit easier to see what’s going on as your thumbs will be less in the way of the action, and thus a superior gaming experience. That extra screen area didn’t exactly mean we played better, of course, but it’s certainly more enjoyable to play.",
    "How else did the iPhone 12 Pro’s better specs help? Noticeably lower load times: in a side by side comparison, the iPhone 6S took 2-3 seconds longer to load into matches. Again, you’d only catch this if you set up both phones at the starting line and have them launch into games at the same time, but for every normal person who won’t have these extreme ends of the current iPhone lineup handy to test, it’s nice to know what upgrading gets you.",
    "It makes sense that developers would prioritize framerate for smooth gameplay, but it takes on even greater importance when player performance depends on it in competitive matches. And nothing is expected to be more competitive than the upcoming League of Legends: Wild Rift mobile game, which takes the popular mobile battle arena (MOBA) and shrinks it down to be playable on smartphones.",
    "It does need to be playable on a range of iPhones, too – and most importantly, retain a consistent framerate, explains Riot Games’ Trent Campbell, Principal Technical Project Manager on Wild Rift. (Currently, the game is in open beta in several Southeast Asian and other countries, and is coming to the Americas in March. It's had open play on Android phones and limited tests on iOS devices.)",
    "“On devices like the iPhone 6S (our minimum spec on iOS), our data shows a consistent framerate of near 30fps, and players have the option to change graphic quality settings to match their needs,” Campbell stated in an emailed reply to TechRadar’s questions. “We think the game still looks and feels great at the lowest graphics setting!”",
    "Riot Games has experience making games run on low-specced devices: the joke goes that its mainstay title, League of Legends, could run on a toaster. Its wide compatibility with lower-performance computers has contributed to its popularity as arguably the leading esport around the world. Making it easier for the game’s mobile version, which is slowly rolling out in beta around the world (live in Southeast Asian countries, coming to the Americas in March), has been a priority, Campbell noted.",
    "“We want to ensure players have a good experience playing Wild Rift on all supported devices, and we think it’s super important for Wild Rift to support a very wide range of them,” Campbell said. “For players using high-end devices like the iPhone 12, we want to wow them with incredible visuals and animations, but also ensure that the game is as accessible as it can be for those that don’t have access to high-end phones.”",
    "Shortly after Wild Rift launched in beta, the team working on it posted expected minimum specs to play - including, yes, the iPhone 6S as the oldest iPhone capable of running the game. This shouldn’t be too surprising given that’s the threshold for devices that will run iOS 14, the latest version of the operating system.",
    "Unlike Android phones that vary in hardware performance, iPhones have universally gotten more powerful with each generation, with the latest iPhone 12 lineup’s A14 Bionic chipsets outperforming any previous model. But the aging older models are still capable of running the newest games - though they’ll generally analyze and automatically set the graphics level according to the phone’s limits.",
    "Even non-competitive games use this kind of auto-analysis – like the upcoming Crash Bandicoot: On The Run!, a Temple Run-style game built in the famous franchise’s world by King Games, best known for the Candy Crush mobile games.",
    "“The way we do it is to automatically detect a quality level based on a database where we have relative performance differences between the devices,” Robert Woodburn, senior producer at King Games, told TechRadar over email. “With this data we can slot each device into a quality level slot: Ultra Low, Low, Medium and High. Knowing what quality level a device has makes it possible to tweak the graphics settings and change shaders.”",
    "This database is key to setting graphical levels: should Apple release a less powerful iPhone, its specs will be compared with readings on the database and graphics set accordingly - hence why an older iPhone running Crash Bandicoot won’t have the same graphics as an iPhone 12 Pro running the upcoming game.",
    "“The users on an iPhone 6 will not have the same graphical fidelity in terms of image resolution, shader quality, texture quality, lod distance,” Woodburn said. “The main goal has been to make the game playable at all supported phones while still enjoying a Crash experience.”",
    "What this ultimately means is that the potential for mobile gaming may be restricted by requiring games to support the lowest spec, but that minimum is so low – reaching back six years to the iPhone 6S, in these cases – that it’s accessible to many more users. Around 90% of iPhone users have a 6S or newer, according to a DeviceAtlas survey circa December 2020, and all will be able to play some form of the games above – they just won’t be as easy on the eyes as playing on a new iPhone 12."
  ],
  "headers": {
    "6": "iPhone 12 Pro vs. iPhone 6s in action: Marvel Realm of Champions",
    "13": "Even on mobile, framerate is king - especially in League of Legends",
    "19": "Automatic graphics"
  },
  "links": {
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Wild Rift": "https://www.techradar.com/news/league-of-legends-mobile",
    "DeviceAtlas": "https://deviceatlas.com/blog/most-popular-iphones"
  }
}