{
  "source": "https://www.techradar.com/news/magic-leap-2-is-real-and-raises-the-bar-for-pro-ar-headsets",
  "title": "Magic Leap 2 is real and raises the bar for pro AR headsets",
  "category": "vr",
  "updated": "2021-10-12T09:43:52Z",
  "author": "axel-metz",
  "summary": "One giant leap for AR",
  "article": [
    "After a prolonged period of radio silence, augmented reality (AR) startup Magic Leap has re-entered the fold with the announcement of an all-new workplace-focused headset, the Magic Leap 2.",
    "The move comes as the company’s CEO Peggy Johnson revealed Magic Leap has raised $500 million in investor funding to allow for the development of the new AR device, which marks the first major hardware upgrade to its inaugural headset offering, the Magic Leap One.",
    "Designed to be the industry’s “smallest and lightest device built for enterprise adoption,” the Magic Leap 2 will boast several design and feature improvements over its predecessor – with the most notable being its capacity for use “all day, every day.”",
    "For starters, users of the Magic Leap 2 won’t look like Vin Diesel’s Riddick (an unfortunate consequence of wearing the Magic Leap One). Instead, the headset has been smartly redesigned to appear much more compact, which the company says will promote a more comfortable user experience.",
    "That’s important, because no mixed reality headset on the market right now (AR or VR) has proven comfortable to wear all day, save for a few low-functionality products like Facebook’s Ray-Ban Stories.",
    "Magic Leap hasn’t yet shared details of the Magic Leap 2’s battery life, but if its claims of “all day” use prove accurate, the new headset marks a tremendous – and potentially game-changing – improvement over the measly three hours managed by the Magic Leap One.",
    "The hardware itself has improved, too. CEO Johnson has claimed the Magic Leap 2 will benefit from segmented dimming technology, a “first-to-market innovation” allowing the device to be used in brightly lit settings.",
    "The headset will also boast improved color fidelity, text legibility and image quality, as well as “double the field-of-view” of its predecessor – a welcome upgrade, given the extremely restrictive FOV of the Magic Leap One.",
    "Interestingly, much of this larger FOV seems to come upwards rather than outwards (see the company-provided illustration below), which suggests the device won’t actually do much to improve a user’s spatial awareness. Still, as similar products go, the Magic Leap 2 will sport the “largest field of view in the industry.”",
    "All in all, then, Magic Leap looks to have made welcome improvements to the Magic Leap 2 in all the right areas. If indeed the headset can live up to its promise of being “a device that you can put on your head in the morning and wear all day long,” it really could prove a game-changer for workers in a whole host of industries – from medicine to construction.",
    "The company says it plans to launch the Magic Leap 2 in 2022, though “select customers” are already trialling the product through an early access program.",
    "Via RoadtoVR"
  ],
  "headers": {
    "6": "Giant leaps"
  },
  "links": {
    "revealed": "https://www.magicleap.com/en-us/news/op-ed/my-first-year-at-magic-leap-and-the-opportunity-ahead",
    "Magic Leap One": "https://www.techradar.com/reviews/magic-leap-one",
    "VR": "https://www.techradar.com/news/the-best-vr-headset",
    "Ray-Ban Stories": "https://www.techradar.com/reviews/ray-ban-stories-facebook-smart-glasses",
    "RoadtoVR": "https://www.roadtovr.com/magic-leap-2-specs-release-date-500-million-investment/"
  }
}