{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-launch-teaser-hints-at-new-camera-features-and-more",
  "title": "Samsung Galaxy S21 launch teaser hints at new camera features and more",
  "category": "phones",
  "updated": "2021-01-12T10:49:32Z",
  "author": "tom-bedford",
  "summary": "Some last-minute information",
  "article": [
    "We're expecting the Samsung Galaxy S21 launch to occur during the Samsung Unpacked event on January 14; a new teaser trailer makes this seem even more likely, and also hints at some new camera features of the phone.",
    "Samsung's official YouTube channel posted this video (which you can also view below), and while it's only 27 seconds long, there's lots to read into.",
    "We can see snaps of the camera array, a graphic of the chipset, a side-on view of the phone - and lots of people dancing and jumping off things, because that's sure to get you excited for the new phone. Of course, there's also the reiteration of the time and date of the Samsung Unpacked event.",
    "While it may seem that this is merely a 'hype trailer' for the upcoming Galaxy S21, though, if you read between the lines there are some new features hinted at here.",
    "At some points in the video, certain new camera modes are teased, or even explicitly shown off, though they can be easy to miss.",
    "Jump to 0:12 - just a clip of people recording video, right? Well if you look again, you'll see it's recording from both the rear and front cameras. This shows us Samsung is going the way of Huawei, Xiaomi, Apple and loads of other phone companies, in offering a mode where you can record from both cameras at once.",
    "Then at 0:15 we see people jumping off a car, with pictures being taken of them. Is this an innocent example of photographs being taken? We'd think not, since the pictures come in such a quick succession that wouldn't really be possible through normal photography modes.",
    "Either this is a hint at a new form of Single Take (where you record a short video of an object or person, and the phone pulls out the best still photos of it, from all cameras) that works well with action, or it's hinting at video stills. For the Samsung Galaxy S20 line, a big selling point was that you could record 8K video and subsequently save 32MP stills from it - maybe we'll see an improved version of that in the Galaxy S21.",
    "Finally, at 0:17 we're shown a panning video of someone in a dark alley, which then cuts to a well-lit photo of them. This seems to be teasing an improved version of night mode photography, that can make dark settings look brighter and more detailed than a standard photo would. Perhaps we'll see a Portrait Mode version of this too.",
    "Those are seemingly all the camera features teased in the video, although we may have missed some. The Samsung Galaxy S21 is expected to launch on January 14, and TechRadar will be covering the event in full, so check back then for all the details."
  ],
  "headers": {
    "4": "Watching with a beady eye"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Unpacked": "https://www.techradar.com/news/samsung-galaxy-s21-launch-date",
    "official YouTube channel": "https://www.youtube.com/watch?v=o3rodmgjBV8",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review"
  }
}