{
  "source": "https://www.techradar.com/news/logitech-launches-new-wireless-technology-for-the-enterprise-aimed-at-hybrid-work",
  "title": "Logitech launches new wireless technology for the enterprise, aimed at hybrid work",
  "category": "computing",
  "updated": "2021-09-01T19:30:23Z",
  "author": "anthony-spadafora",
  "summary": "Strong, secure wireless connectivity with near universal platform compatibility",
  "article": [
    "Logitech is expanding its enterprise offerings by introducing a new high-performance, secure wireless technology called Logi Bolt for its wireless keyboards, mice and other business accessories.",
    "Logi Bolt aims to provide a solution to key imperatives for enterprise IT by delivering a secure wireless connection, a robust wireless signal and cross-platform compatibility for mice and keyboards.",
    "As Logitech designed Logi Bolt for hybrid work, the new secure wireless technology is able to conquer IT challenges that can arise when employees are working from home or if they have already returned to the office.",
    "GM of B2B for creativity and productivity at Logitech, Joseph Mingori explained how the company is bringing its expertise when it comes to creating consumer products to the enterprise in a press release, saying:",
    "“For decades, consumers have trusted Logitech to deliver products that help them create, communicate, work and learn at home and on-the-go. Now we look to expand that expertise to employers and offer a stellar employee experience as they evolve their requirements in a rapidly changing landscape. We have redefined our enterprise offering to support individual work setup solutions on a global scale while launching our new, wireless technology solution – Logi Bolt – enabling secure and robust connections to meet today’s evolving business needs. These offerings prioritize the needs of enterprise IT to keep their diverse workforces productive, collaborative and secure no matter where they work.”",
    "Security is at the heart of Logi Bolt and the new offering delivers a secure level of wireless connectivity for Logitech's mice and keyboards by using Bluetooth Low Energy Security Mode 1 Level 4 (also known as Secure Connections Only Mode) when paired with a Logi Bolt USB receiver.",
    "Logi Bolt USB receivers can also provide a strong, reliable and drop off free connection for up to 33ft (10m) even in congested wireless environments such as large offices with up to eight times lower average latency when compared to other commonly deployed wireless protocols in congested, noisy enterprise environments.",
    "At the same time, Logi Bolt devices are more universally compatible than peripherals from other device makers and they work with just about every operating system and platform including Windows, macOS, iOS, iPadOS, Linux, Chrome OS and Android. Users can also connect their Logitech devices via Logi Bolt USB receivers when security and signal strength are paramount but they can also use Bluetooth Low Energy wireless technology for convenience.",
    "Logitech devices that feature the company's new Logi Bolt technology are available for pre-order now through its global resellers."
  ],
  "headers": {
    "5": "Logi Bolt"
  },
  "links": {
    "Logi Bolt": "https://logitech.cfzu.net/c/221109/499820/8585?subId1=trd-us-1065789478952842500&sharedId=trd-us&u=https%3A%2F%2Fwww.logitech.com%2Fen-us%2Fbusiness%2Fwork-setups%2Flogi-bolt-wireless-technology.html",
    "keyboards": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011/best/best-business-keyboards",
    "mice": "https://www.techradar.com/news/best-wireless-mouse",
    "business accessories": "https://www.techradar.com/news/the-best-business-technology-and-productivity-gadgets",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "press release": "https://logitech-emea.pxf.io/c/221109/857541/11966?subId1=trd-us-7253219465617483000&sharedId=trd-us&u=https%3A%2F%2Fir.logitech.com%2Fpress-releases%2Fpress-release-details%2F2021%2FLogitech-Expands-Commitment-to-Enterprise-Launches-New-Wireless-Technology-Logi-Bolt%2Fdefault.aspx",
    "operating system": "https://www.techradar.com/news/best-alternative-operating-systems"
  }
}