{
  "source": "https://www.techradar.com/news/what-if-nearly-spawned-its-own-spinoff-show",
  "title": "What If nearly spawned its own spinoff show",
  "category": "entertainment",
  "updated": "2021-10-07T09:14:35Z",
  "author": "tom-power",
  "summary": "What If... T'Challa Star-Lord had his own series?",
  "article": [
    "What If...? nearly gave rise to a T'Challa Star-Lord spinoff show, according to the showrunners of Marvel's animated anthology TV series.",
    "Speaking to Variety after What If...?'s season 1 finale, director Bryan Andrews revealed that there were plans for a TV show that followed T'Challa Star-Lord and the Ravagers across their Marvel universe.",
    "Development on the show, though, was paused in the wake of Chadwick Boseman's death, who passed away after a four-year battle with bowel cancer in August 2020.",
    "As part of a response to a question about whether Boseman recorded any lines for What If...? season 2, Andrews explained that T'Challa Star-Lord may have starred in his own series before Boseman's death.",
    "\"I don’t know if he [Boseman] knew this, but there was planning to have Star Lord T’Challa spin off into his own show with that universe and crew,\" Andrews admitted. \"We were all very excited. We know he would have loved it, too. And then, you know, he passed, and so all that’s in limbo. So, who knows? Maybe one day.\"",
    "Even though What If...? represented Boseman's final ever performance, the actor continues to inspire and have a positive impact on many peoples' lives. Recently, Netflix and Howard University – the Washington-based university where Boseman graduated – created a $5.4 million scholarship in honor of the late actor.",
    "It's bittersweet to hear that T'Challa Star-Lord would have received his own Disney Plus spinoff show.",
    "Boseman's portrayal of T'Challa in the MCU is as iconic a performance as you're likely to find. And yet, according to the likes of Andrews and What If...? head writer A.C. Bradley, he had more fun voicing T'Challa Star-Lord in Marvel's animated anthology series.",
    "Given that T'Challa Star-Lord's What If...? episode was a popular season 1 entry, it's unsurprising to learn that a spinoff show was in development. It's clear that Boseman had a blast portraying a completely different version of T'Challa, so seeing him go on a new adventure every week would have been a wild ride.",
    "The show would surely have pulled in lots of viewers on a weekly basis, too. Boseman was a hugely popular figure due to his humbleness and selflessness, and it may have been fun to explore a new concern of the Marvel multiverse alongside him.",
    "Now, it wouldn't feel right if Marvel Studios pressed on with a T'Challa Star-Lord spinoff series. Sure, they could bring in a voice actor who might be able to do a good impression of Boseman's T'Challa, but it wouldn't feel right.",
    "The backlash from fans is something that Marvel and Disney wouldn't want to face, either. Marvel Studios president Kevin Feige has confirmed that Boseman's T'Challa won't be brought back using VFX in Black Panther 2 – a move that's been welcomed by MCU fans.",
    "So hiring someone else to voice his character in a spinoff show is very unlikely to happen. Marvel won't want to tarnish their reputation, or Boseman's legacy, by pushing ahead with a T'Challa Star-Lord TV show without the iconic star. Providing it hasn't already done so, Marvel would be doing the right thing if it cancelled T'Challa's spinoff show completely."
  ],
  "headers": {
    "6": "A What If...? question that will never be answered"
  },
  "links": {
    "Variety": "https://variety.com/2021/tv/news/marvel-what-if-season-1-finale-tchalla-spin-off-chadwick-boseman-1235082366/",
    "created a $5.4 million scholarship": "https://www.techradar.com/news/netflixs-tribute-to-chadwick-boseman-is-actually-pretty-great"
  }
}