{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-spotted-on-shelves",
  "title": "Nvidia GeForce RTX 3080 Ti spotted on shelves",
  "category": "computing",
  "updated": "2021-05-05T10:27:52Z",
  "author": "jess-weatherbed",
  "summary": "And apparently available for purchase",
  "article": [
    "There have been frequent appearances of products alleging to be Nvidia's rumored upcoming graphics card, the GeForce RTX 3080 Ti, suggesting that an official announcement could be on the horizon. An MSI Suprim X version of the anticipated GPU has already been photographed on a few occasions, with new information now suggesting that some of the unreleased hardware may have mistakenly hit the shelves a few weeks earlier than intended.",
    "Reddit user FaisalKhatib claims that they've received images from a local retailer in Abu Dhabi that's already made the card available for purchase for an estimated $3500/£2500/AU$4500. While it's important to note that we can't substantiate these claims, this wouldn't be the first time that Middle Eastern retails have jumped the gun on sale embargoes.",
    "The Suprim X range are flagship models of MSI’s cards, so we expect the MSI GeForce RTX 3080 Ti Ventus 3X to pack some serious power when the hardware is available to buy in a more official capacity. We previously anticipated that the MSRP will sit somewhere around $999 (about £780/AU$1,400), though pricing leaks suggest that this could wildly vary between different third-party models and regions. The Suprim X isn't the only version of the GPU that has been snapped in photographs either, with a Gigabyte model also being reported by Twitter user Moore's Law Is Dead. Where there is always a chance that the product boxes could be fakes – and convincing ones if so – the consistent appearances are adding weight to the card's existence.",
    "Rumors suggest it’ll come with 12GB GDDR6X 384-bit memory, a decent increase over the RTX 3080’s 10GB GDDR6X 320-bit memory, as well as a total of 10,240 CUDA cores and 80 SM units, with a clock speed of 1,365MHz and 1,665MHz boost.",
    "We expect that Nvidia's updated hash rate limiter will be included in the models in a bid to get more of the GPUs into the hands of gamers, rather than snapped up by cryptominers, but we still expect these cards to be incredibly scarce.",
    "An official announcement event is likely to occur as soon as May 31, with a hard launch currently expected for June 2. We're also expected that Nvidia will announce the RTX 3070 Ti at the same event with an anticipated release date of June 9."
  ],
  "headers": {
    "3": "I spy with my Ti..."
  },
  "links": {
    "FaisalKhatib": "https://www.reddit.com/r/nvidia/comments/n4ws7w/msi_3080ti_surprim_x_spotted_at_a_store_in_uae/?ref=share&ref_source=embed&utm_content=title&utm_medium=post_embed&utm_name=e760363800b14ce5ace6d599726c8196&utm_source=embedly&utm_term=n4ws7w",
    "though pricing leaks": "https://www.techradar.com/news/custom-nvidia-rtx-3080-ti-card-listings-suggest-official-launch-is-imminent",
    "Moore's Law Is Dead.": "https://twitter.com/mooreslawisdead",
    "Rumors suggest it’ll come with 12GB GDDR6X": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-could-arrive-in-april-with-12gb-vram",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "updated hash rate limiter": "https://www.techradar.com/news/nvidia-is-making-life-difficult-for-cryptominers-buying-geforce-rtx-30s-gpus",
    "RTX 3070 Ti": "https://www.techradar.com/news/nvidia-rtx-3080-ti-and-rtx-3070-ti-cards-may-launch-in-early-june"
  }
}