{
  "source": "https://www.techradar.com/news/exclusive-ps5-xbox-restock-best-buy-in-store-september-23",
  "title": "Exclusive: Best Buy PS5 and Xbox Series X restock today and where to get it next",
  "category": "gaming",
  "updated": "2021-12-09T11:10:34Z",
  "author": "matt-swider",
  "summary": "TechRadar reported exclusively on the PS5 and Xbox Series X Best Buy in-store restock – the first in 2021 – and it saw some success.",
  "article": [
    "The Best Buy PS5 and Xbox Series X restock was today at 7:30am local time, and Best Buy saw thousands of people around the United States lined up outside of stores early in the morning, many waiting as long as 17 hours and in rainy weather. The PS5 Disc and Digital were most popular compared to the Xbox Series X, but all consoles sold out before the store opened. There's a Walmart PS5 and Halo Infinite Xbox Series X tonight 9pm EDT, too.",
    "Alaska",
    "Alabama",
    "Arkansas",
    "Arizona",
    "California",
    "Colorado",
    "Connecticut",
    "Washington, D.C.",
    "Delaware",
    "Florida",
    "Georgia",
    "Hawaii",
    "Iowa",
    "Idaho",
    "Illinois",
    "Indiana",
    "Kansas",
    "Kentucky",
    "Louisiana",
    "Massachusetts",
    "Maryland",
    "Maine",
    "Michigan",
    "Minnesota",
    "Missouri",
    "Mississippi",
    "Montana",
    "North Carolina",
    "North Dakota",
    "Nebraska",
    "New Hampshire",
    "New Jersey",
    "New Mexico",
    "Nevada",
    "New York",
    "Ohio",
    "Oklahoma",
    "Oregon",
    "Pennsylvania",
    "Puerto Rico",
    "Rhode Island",
    "South Carolina",
    "South Dakota",
    "Tennessee",
    "Texas",
    "Utah",
    "Virgina",
    "Vermont",
    "Washington",
    "Wisconsin",
    "West Virginia",
    "Wyoming",
    "The last PS5 restock date at Best Buy was August 12, which was 42 days ago, as of today, Thursday, September 23. This gap came after the retailer had almost weekly stock of the Sony console, fooling everyone into thinking Best Buy restocked every week. It's been ever longer since it has sold Microsoft's Xbox Series X if you don't count the Halo Infinite-themed console, last selling the regular Xbox Series X on July 14.",
    "It turns out, those overdue shipments of both consoles started filtering into stores late last week, in time for 7am local time today, September 23.",
    "How it worked before: Best Buy would normally hold PS5 and Xbox at regional warehouses and ship to stores only after online purchases were made. Customers, after ordering online, would pick up their consoles three to five days later in Best Buy stores. There was transit and processing lag stemming from when it went from warehouse and to store.",
    "The process today: Customers can line up outside of select Best Buy stores across the US (sorry, Best Buy Canada doesn't seem to be included for September 23), and some people are already in line. This process makes it harder for bots to scoop up the PS5 and Xbox console inventory from Best Buy's vulnerable online ordering system (it's among the worst, right up there with Walmart).",
    "Best Buy's order system made it the most frustrating store when trying to buy a next-gen console. Its directions were never clear (\"We're having everyone go through one more step\" without telling you that the one more step is just to wait without refreshing the page. Oops.). Bots didn't have any problem with this: reseller bots were able to open multiple windows, dive into page source code and determine the best page with the lowest secret queue timer to scoop up and checkout with hundreds of consoles. The add-to-cart odds weren't in your favor.",
    "So how will it work now? The process will mimic how Best Buy restock Nvidia GPU cards three times over the summer. Select Best Buy stores will have stock of PS5 Disc, PS5 Digital and Xbox Series X, according to our sources. One of the stores we checked in with had just over 50 PS5 Disc and Xbox Series X, and we're told by other stores that seems like a low number compared to stores in major metropolitan areas.",
    "Best Buy PS5 / Xbox Series X restock process:",
    "First, no, Best Buy will not ship the PS5 and Xbox Series X consoles to your doorstep. That hasn't happened in 2021 at the retailer, and we don't expect things to change in 2021. Best Buy already has enough problems with bots given its vulnerable ordering system, so not having people show up to claim their console would be even more problematic than the previous order online with in-store pick-up process.",
    "There's been talk of a revamped online ordering system to buy the PS5 and Xbox and then claim it in person in stores, but it's not ready for Thursday, September 23.",
    "If Best Buy went down this route, it would act more like Target with same-day pickups, which would be an improvement since the three- to five-day wait to ship consoles from warehouses would be flattened given the fact that TechRadar can confirm that consoles are in stock in the backrooms of Best Buy stores right now.",
    "But right now, we're being told that people will have to wait in line early in the morning, by 7am or 7:30am local time, like so many did for Nvidia GPU restocks. If that information changes, we'll update this article and notify you on Twitter.",
    "No more resellers and bots, right? It seems great at first blush, and everyone who gets shut out of Best Buy PS5 and Xbox restocks asks us why they're not held in person.",
    "Here's the reason: it's no better. The grass is no greener. Each time we've attended a Best Buy restock of GPUs (remember, it hasn't had the PS5 and Xbox Series X on sale in stores in 2021, which is why this is big news today), there's pure chaos, as evidenced by our PS5 restock and Xbox Series X restock tracker tweet below:",
    "For some parts of the United States, things went smoothly. For others, like New York City, resellers showed up, planted themselves first in line and bought all of the inventory. How fast did these GPUs sell? Before the purchase was even made. They were pre-sold on StockX or eBay and no one got the GPU they wanted for gaming.",
    "Through our on-the-ground reporting, we identified the first person in line who actually wanted the coveted RTX 3080 (the most popular graphics card on sale at Best Buy that day) for gaming purposes. They for No. 20 in line and had a chance.",
    "Moments before the first paper tickets were being handed out by Best Buy managers, that No. 20 in line became No. 40 in line due to last-second line jumpers – \"friends\" of the people waiting it out in the front of the line, all of whom claimed to have always been there. It turned into a chaotic scene that was not only unfair (an 11-year-old cried) but involved a lot of pushing, shoving and shouting.",
    "The profit margins on the PS5 and Xbox Series X are big, but not as dramatic as Nvidia GPUs. So we'll have to see how this Best Buy in-store restock goes when it comes to ensuring everyone gets their console of choice fairly and safely."
  ],
  "headers": {
    "1": "Prior reporting: Best Buy restock store list today",
    "53": "Best Buy hasn't had a PS5 restock in 42 days – no wonder",
    "57": "How to buy PS5 and Xbox from Best Buy today",
    "60": "Will Best Buy ship consoles? Can I buy it online?",
    "64": "Expect the Best Buy restock line to be chaos"
  },
  "links": {
    "Walmart PS5 and Halo Infinite Xbox Series X tonight 9pm EDT": "https://www.techradar.com/news/walmart-ps5-halo-finite-xbox-series-x-restock-today",
    "Best Buy restock Nvidia GPU cards": "https://www.techradar.com/news/best-buy-stores-nvidia-rtx-3080-in-stock-date-and-time",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}