{
  "source": "https://www.techradar.com/news/what-time-is-the-friends-reunion-released-on-hbo-max-and-sky",
  "title": "What time is the Friends Reunion released on HBO Max and Sky?",
  "category": "entertainment",
  "updated": "2021-05-27T21:53:38Z",
  "author": "tom-power",
  "summary": "Reunite with your favorite Friends on HBO Max and Sky right now",
  "article": [
    "Update: Friends: The Reunion is now available on HBO Max in the US and Sky in the UK. Here's how to watch the Friends reunion online now, if you're looking to stream it, and you can read our Friends: The Reunion review for our thoughts on the special.",
    "Don't miss our countdown of the best Friends episodes, either.",
    "Original story: Friends: The Reunion is finally here. Long-time fans of the pop-cultural phenomenon are gearing up to reunite with their six favorite fictional buddies, with 'The One Where They Got Back Together' set to arrive in less than 24 hours.",
    "Jennifer Aniston, Courtney Cox-Arquette, Lisa Kudrow, Matt Le Blanc, Matthew Perry and David Schwimmer are returning for the unscripted special, which will look back at the series' best moments and why it was such a universal hit in the late 1990s and early 2000s.",
    "The one-off episode, which will also see guest appearances, table reads and a lengthy sit-down chat with host James Corden, is due to be released on HBO Max and Sky on Thursday, May 27.",
    "You might be wondering, then, when you should settle into your La-Z Boy recliner chair to take a trip down memory lane with Rachel, Monica, Phoebe, Joey, Chandler and Ross.",
    "For US viewers, Friends: The Reunion will launch on HBO Max on Thursday, May 27 at 12AM PT/3AM ET.",
    "That means you'll have to stay up until midnight (or into the early hours) if you want to watch the special as soon as it drops on HBO Max.",
    "Friends: The Reunion will only be available to HBO Max subscribers. If you wish to watch it when it does arrive on HBO's streaming platform, you will need to sign up for a subscription. A monthly subscription will cost you $14.99, which you can sign up for using our handy HBO Max price widget below.",
    "For UK audiences, Friends: The Reunion will be available for viewing on Thursday, May 27 at 8:02am BST.",
    "The one-off episode wasn't supposed to land on Sky's NOW TV service until 8pm BST, but that release time has been moved forward so UK-based viewers won't have the special spoiled for them on social media by their US counterparts.",
    "For those who wish to watch the Friends Reunion before they head to work (or as soon as it arrives, if you've taken the day off), it'll cost you £9.99 a month to subscribe to NOW TV.",
    "Friends: The Reunion will also be available in other territories on the same day. The special will launch on HBO Go in Southeast Asia, Hong Kong and Taiwan at 3:01pm SGT. Additionally, Australian fans can catch it on Binge at 5:02pm AEST on May 27, too.",
    "Finally, Canadian audiences can catch the special episode on Crave. A subscription will costs you $9.99, but there is a seven-day free trial that you can sign up for to watch it. The one-off special will launch at the same time as in the US as well.",
    "There is currently no release date for the Friends Reunion in India."
  ],
  "headers": {
    "6": "What time is Friends: The Reunion released on HBO Max?",
    "9": "When is the Friends reunion launching on Sky?"
  },
  "links": {
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-5472443039008879000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhat-time-is-the-friends-reunion-released-on-hbo-max-and-sky",
    "how to watch the Friends reunion online": "https://www.techradar.com/news/how-to-watch-friends-the-reunion-stream-online-today",
    "Friends: The Reunion review": "https://www.techradar.com/news/friends-the-reunion-is-little-more-than-a-fancy-dvd-extra-but-maybe-thats-enough",
    "best Friends episodes": "https://www.techradar.com/best/best-friends-episodes"
  }
}