{
  "source": "https://www.techradar.com/news/creator-of-the-nes-and-snes-masayuki-uemura-has-passed-away",
  "title": "Creator of the NES and SNES, Masayuki Uemura, has passed away",
  "category": "gaming",
  "updated": "2021-12-09T14:24:10Z",
  "author": "adam-vjestica",
  "summary": "Uemura-san passed away on December 6, aged 78",
  "article": [
    "Masayuki Uemura, the lead architect of the NES and SNES consoles, passed away on December 6, at the age of 78.",
    "The long-serving Nintendo employee, who worked at the company from 1971 to 2004, was responsible for the creation of the Nintendo Entertainment System and Super Nintendo Entertainment, commonly known as the NES and SNES. The consoles were known as the Famicom and Super Famicom in Japan.",
    "He worked alongside Gunpei Yokoi and Genyo Takeda on Nintendo’s early light-gun games, before spearheading the company’s transition into making video game consoles, which began with the Color-TV series in 1977. Uemura-san began working on the NES in 1981 and was also served as a producer on titles such as Ice Climber and Golf.",
    "Uemura-san retired from Nintendo in 2004 but continued to be involved in the industry. He was the director for the Center for Game Studies at Ritsumeikan University in Japan and previously visited the National Video Game Museum in Sheffield, UK.",
    "\"When I developed the Famicom, I put all the basic functions that were necessary to make it as a gaming device,\" Uemura-san told Eurogamer while visiting the National Videogame Museum in February 2020. \"For the Switch, it's inherited all that over the years. All the successes and failures of the Famicom are inherited by the next generation of consoles and onward.\"",
    "The NES sold a total of 61.91 million units and the SNES sold 49.1 million units. Nintendo went on to create miniature versions of both machines – the NES Classic Mini and SNES Classic Mini – that included a selection of pre-installed games.",
    "As Uemera-san noted, the DNA of both these consoles can be found today in everything Nintendo creates. Super Smash Bros. creator Masahiro Sakurai is one of many members of the industry who has shared their heartfelt sympathies on Twitter today.",
    "“It has been announced that Masayuki Uemura, the creator of the Family Computer, has passed away.” Sakurai-san wrote. “I pray for your soul... NES is the game console that I was most influenced by. Without this, it wouldn't be there.”",
    "Everyone at TechRadar would like to extend their sincere condolences to Uemura-san’s friends and family, and express their extreme gratitude for the incredible legacy Uemera-san has left behind."
  ],
  "headers": {},
  "links": {
    "NES Classic Mini": "https://www.techradar.com/reviews/nintendo-classic-mini-nes",
    "SNES Classic Mini": "https://www.techradar.com/reviews/snes-classic-mini"
  }
}