{
  "source": "https://www.techradar.com/news/this-could-be-a-great-time-to-buy-a-new-work-pc",
  "title": "This could be a great time to buy a new work PC",
  "category": "computing",
  "updated": "2021-08-26T19:11:00.430Z",
  "author": "mike-moore",
  "summary": "PC sales on the rise, but tablets stagnate",
  "article": [
    "Sales of PCs are continuing to rise in the US as buyer confidence returns following the initial struggles during the pandemic.",
    "The latest quarterly PC sales figures from analyst firm Canalys found that sales for the Q2 2021 were up 16.6% compared to the same period last year with nearly 37 million units shipped across the country.",
    "However sales of tablet devices failed to excite, with figures showing a slight decline year-on-year as US consumers and businesses appeared to prefer spending on larger products.",
    "Canalys found that HP retained its place at top spot for the second quarter in a row, as the company shipped just over eight million units for a 21.9% market share. This figure was up just over 20% from the same period in 2020, and represented a 0.7% growth in market share too.",
    "Apple maintained its position in second, with its 7.6m shipments giving the company 20.6% share - although this was a drop of 2.8% compared to the same period last year.",
    "Dell took third place with 15.6% market share (up 10.5% from the year before), with Lenovo following with 12.4% (up 25.2%) and Samsung with 8.2% completing the top five. The latter saw the highest year-on-year growth however, boasting a 51.4% increase on 2020's figures.",
    "“It is clear now that pandemic-related use cases will extend well into the future,” said Brian Lynch, Research Analyst at Canalys. “This points toward a significant refresh opportunity in the future – fantastic news for PC vendors and their channel and ecosystem partners. The commercial and education segments have exploded, triggering tremendous refresh potential. The US economy has bounced back well from its pandemic woes and small businesses are recovering, which will lead to a wave of purchasing from the segment.”",
    "Tablet sales across the US totalled 11.3 million units shipped in Q2 2021, a 1% drop from the 2020 figure. Apple unsurprisingly led the way with 45% of the market, ahead of Amazon on 22% and Samsung on 18% market share.",
    "“The US PC industry is set for a bright future. Whether it be work, school or leisure at home, PCs are in users’ hands more than ever. The integration of devices into everyday life points toward a rosy future for the market,” said Lynch."
  ],
  "headers": {
    "3": "PC sales soar"
  },
  "links": {
    "PCs": "https://www.techradar.com/news/best-business-desktop-pcs",
    "Canalys": "https://www.canalys.com/newsroom/us-pc-shipments-q2-2021?ctid=2188-341e8f4ea5ad6bc6ab1cb69aa884215e",
    "tablet devices": "https://www.techradar.com/news/best-business-tablets"
  }
}