{
  "source": "https://www.techradar.com/news/whatsapp-comes-to-windows-11-and-10-as-uwp-app-heres-how-to-try-it-out",
  "title": "WhatsApp comes to Windows 11 and 10 as an app - here's how to try it out",
  "category": "computing",
  "updated": "2021-11-30T20:34:26Z",
  "author": "daryl-baxter",
  "summary": "WhatsApp on the desktop",
  "article": [
    "With WhatsApp bringing out many new features this year, such as disappearing messages, an updated look and more, users had been wondering what else could be coming from the company",
    "They didn't have long to wait, as a beta version of a native app on the Microsoft Store has been released for both Windows 10 and Windows 11.",
    "You can try it right now and decide whether you'll prefer to use WhatsApp on your laptop or tablet device instead. But so far the app has a lot of features that you most likely use on your smartphone each day anyway, so you may prefer to keep using the app.",
    "However, the question will be, whether a dedicated app on Windows is necessary, when your phone is an arms-length away, alongside being able to use WhatsApp on your web browser.",
    "While we ironically use our web browsers for more than just browsing the web, having a dedicated app for WhatsApp can enable more features compared to using a web page.",
    "The app in testing showcases this, with handwriting features and notifications that work with Windows 10 and 11, alongside Focus Assist.",
    "There's plenty of apps coming to the Microsoft Store, and that's not forgetting about Android apps coming to it soon thanks to Amazon.",
    "It could be very helpful if you use WhatsApp more than others, saving you to use your smartphone, and instead replying to a message through your laptop.",
    "However, time will tell if users will be more comfortable in using an app on the desktop, rather than through a web browser, or again, through their phone."
  ],
  "headers": {
    "4": "Analysis: Turning the WhatsApp dial to 11"
  },
  "links": {
    "beta version of a native app on the Microsoft Store has been released": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1334194792976470800&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fapp%2F9NBDXK71NK08%3Factivetab%3Dpivot%3Aoverviewtab%23",
    "Focus Assist": "https://www.techradar.com/how-to/how-to-reduce-distractions-in-windows-11"
  }
}