{
  "source": "https://www.techradar.com/news/concept-foldable-phones-check-out-these-folding-and-rolling-smartphones",
  "title": "Concept foldable phones: check out these future folding and rolling smartphones",
  "category": "phones",
  "updated": "2021-01-12T14:56:06Z",
  "author": "tom-bedford",
  "summary": "Form over function.",
  "article": [
    "The foldable phones market isn't a very busy one, but we see plenty of folding and rolling smartphones unveiled by companies that never see the light of day.",
    "These are called 'concept' phones, handsets companies design to show off new tech with no intent to sell the phones themselves. Instead, they're an idea of what we could see in the future.",
    "Lots of these concept designs are for rollable or foldable smartphones, and to give you a glimpse of what's out there, we've collected the major ones you should know about. These are devices that for the most part probably won't ever get full releases, not global ones at least, but tease future projects.",
    "We're not mentioning any rumored foldable phones, or ones we've seen in patents filed by companies - there are loads of those from nearly every tech company, and many seem either fake or ludicrously impractical. Instead, we're only listing phones that companies have actively revealed to us.",
    "Some of these we've got hands-on with, others we've just seen via live stream or official teases.",
    "So read on for all the significant foldable phone concepts.",
    "The third rollable phone concept unveiled, but the most recent, is from LG, called the LG Rollable.",
    "LG has confirmed this unfurling phone, shown off at CES 2021, will be available to buy some time in 2021, though it's not clear if this is a full roll-out or just a limited launch.",
    "We don't know much about this phone right now - the CES 'unveil' was more or literally just that, with an image of the phone and not much else, but we can hope for more information soon.",
    "Here's what you need to know about the LG Rollable.",
    "The Oppo X Nendo was a collaboration between smartphone company Oppo and design brand Nendo, and it's... something? We found it hard to describe in our initial coverage, likening it most to a car key, and in the time since we still haven't thought of any good adjectives.",
    "The Oppo X Nendo folds on three hinges, so you can turn it from short and stubby, to long and thin, and with some stages in between. It seems 'the point' of this folding mechanism, if we can call it that, is that you can partially open the phone to leave a little preview window open. This lets you check notifications, or change music, without fully opening the device.",
    "This is one of the most novel foldable phones we've seen, a real joy for people that like weird tech, though it's definitely a case of 'form over function', with the curious design being the Oppo X Nendo's main selling point. We don't imagine this will ever go on sale, though we could be wrong.",
    "Check out our initial coverage of the Oppo X Nendo.",
    "At various tech conferences TCL has shown off a range of concept phones, including two foldables that you can see above. One has a single hinge, and folds in half like a book, and the other has two, and folds in a Z shape.",
    "The important part of the TCL foldable concept is the price - both of these were designed to be 'affordable foldable phones', to counter the high-price rivals. Sure, they won't go on sale, but they're proof that bending phones don't need to cost a lot.",
    "If we see a TLC foldable phone that actually can be bought, it could be a big deal for this very reason, so we're crossing our fingers for such a device.",
    "Here's our preview of the TCL foldable phone.",
    "The Oppo X 2021 is Oppo's rollable phone, which stretches from a 6.7-inch smartphone to a 7.4-inch... slightly larger smartphone. It was unveiled as part of Oppo's Inno Day 2020, which the company uses to show off its new tech, and it's going on sale in China, but nowhere else.",
    "That the Oppo X 2021 is going on sale anywhere shows the company is confident in its rollable tech, so it's possible we'll see a future version (Oppo X 2022?) get a wider release.",
    "For now, though, the phone stands as proof that rollable smartphones could end up as popular as foldable ones.",
    "Check out our initial coverage of the Oppo X 2021.",
    "A Xiaomi folding phone has been teased in several brief videos. They show a device with two folding hinges, rather than a single central fold. We heard a lot about this device in 2019, though things went silent after that.",
    "Don't get too excited just yet though, as this is little more than a concept device for now.",
    "As while Lin Bin, the co-founder of Xiaomi, has posted on social media that the \"Xiaomi double folding mobile phone is coming,\" he also said \"if you like it, we will consider making a mass production machine in the future.\"",
    "This might not be the only foldable from Xiaomi though, as the company has also patented a device that looks more like the Galaxy Z Flip or Motorola Razr.",
    "Check out our coverage of Xiaomi's foldable phone teaser.",
    "As well as showing off several foldable phones, TCL has a rollable one, in which the screen extends if you pull out a segment. This takes the display size from 6.75 inches to 7.8, making for a pretty big extension.",
    "The TCL rollable was a very early concept device when we tested it - the screen was literally just a piece of plastic - but since we got hands-on with the device in early 2020, TCL has confirmed it's still working on the thing. Maybe soon we'll see a version with a real screen.",
    "We last heard about the TCL rollable phone at CES 2021, where the company confirmed it would be launching in 2021.",
    "Check out our initial impressions of the TCL rollable smartphone.",
    "The Royole Flexpai 2 is, of all the foldable phones on this list, the one that's most likely to go on sale.",
    "Long ago in the year 2018, the Royole Flexpai was unveiled, and it was technically the first ever commercially-available foldable phone, though it wasn't easy to find. Royole has confirmed that device's successor, and after its September 2020 launch in China we're expecting global availability sometime soon.",
    "The Flexpai 2 has a 7.8-inch screen that folds down to a 5.5-inch one, plus four rear cameras with a 64MP main one, a Snapdragon 865 chipset, and 5G connectivity.",
    "Given that Royole has had time, and a previous product, we'd hope this would be a masterful take on the foldable phone formula, or at least one that's durable and hardy.",
    "What you need to know about the Royole Flexpai 2.",
    "In early 2019 Energizer - yes, the battery company, as it also makes smartphones and feature phones - showed off its own foldable phone at MWC 2019.",
    "This is the Energizer Power Max 8100S, and it has a smartphone-sized screen when folded and a tablet-sized one when unfolded. It was shown off behind glass and we didn't get to touch it, so for all we know it could have been paper mache.",
    "According to Energizer, folds aside, the highlight of this phone is likely its 10,000mAh battery, but it also has a 48MP main camera, a 12MP secondary lens and a 24MP selfie camera, plus a Snapdragon 855 chipset and 8GB of RAM.",
    "We haven't heard about the Energizer Power Max 8100S since its early-2019 reveal, so don't expect it to ever go on sale.",
    "Check out our initial impressions of the Energizer Power Max 8100S."
  ],
  "headers": {
    "6": "LG Rollable",
    "10": "Oppo X Nendo",
    "14": "TCL's two foldable phones",
    "18": "Oppo X 2021",
    "22": "Xiaomi foldable phone",
    "27": "TCL rollable phone",
    "31": "Royole Flexpai 2",
    "36": "Energizer Power Max 8100S"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "initial coverage of the Oppo X Nendo": "https://www.techradar.com/news/oppos-new-foldable-smartphone-looks-like-a-car-key-and-its-really-really-weird",
    "preview of the TCL foldable phone": "https://www.techradar.com/news/tcl-foldable-phone-concept",
    "initial coverage of the Oppo X 2021": "https://www.techradar.com/news/oppos-next-foldable-phone-will-have-a-rollable-oled-display-but-you-cant-buy-it",
    "Xiaomi folding phone": "https://www.techradar.com/news/the-xiaomi-foldable-phone-concept-looks-incredible-in-new-teaser-video",
    "been teased": "https://www.techradar.com/news/is-this-xiaomis-foldable-tablet",
    "several": "https://www.techradar.com/news/heres-another-look-at-the-dual-hinged-xiaomi-foldable-phone",
    "patented a device": "https://www.techradar.com/news/xiaomi-could-have-a-clamshell-foldable-phone-to-rival-the-motorola-razr",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Motorola Razr": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "coverage of Xiaomi's foldable phone teaser": "https://www.techradar.com/news/heres-another-look-at-the-dual-hinged-xiaomi-foldable-phone",
    "confirmed it would be launching in 2021": "https://www.techradar.com/news/tcl-confirms-it-will-launch-a-rollable-or-foldable-phone-this-year",
    "initial impressions of the TCL rollable smartphone": "https://www.techradar.com/news/this-is-the-best-foldable-phone-concept-weve-seen-so-far",
    "Royole Flexpai": "https://www.techradar.com/reviews/hands-on-royole-flexpai-review",
    "Royole Flexpai 2": "https://www.techradar.com/news/royole-flexpai-2-foldable-phone-release-date-price-news-and-features",
    "Energizer Power Max 8100S": "https://www.techradar.com/news/the-latest-foldable-phone-comes-courtesy-of-energizer",
    "initial impressions of the Energizer Power Max 8100S": "https://www.techradar.com/news/the-latest-foldable-phone-comes-courtesy-of-energizer"
  }
}