{
  "source": "https://www.techradar.com/news/blade-mcu-movie-has-a-supposed-release-date-but-were-not-convinced",
  "title": "Blade MCU movie has a supposed release date – but we're not convinced",
  "category": "entertainment",
  "updated": "2021-10-05T16:01:10Z",
  "author": "tom-power",
  "summary": "Has someone at Marvel jumped the gun (or blade)?",
  "article": [
    "Blade's MCU debut may be here sooner than we think, if an unconfirmed (but potentially official) release date from Marvel Studios is to be believed.",
    "According to a post on the official Marvel India Twitter account, Marvel Studios' Blade movie is slated to land in theaters on October 7, 2022. If true, that would place the vampiric anti-hero's next big screen outing between Black Panther: Wakanda Forever and The Marvels, which will arrive in July and November 2022.",
    "The tweet in question has been deleted, but various other accounts, including FanDom and Culture Crave, managed to screenshot it before it was removed:",
    "Curiously, other international Marvel Studios accounts haven't tweeted out a similar revised release schedule. That's a red flag in our book, so we would advise you to take this apparent announcement with a giant helping of salt for the time being.",
    "We've reached out to Disney and Marvel for official comment, and we'll update this news story if we hear back.",
    "Little is know about Blade's MCU movie. Right now, the only information we have is helmed by Bassam Tariq. The Mogul Mowgli director confirmed his involvement in an interview earlier this year.",
    "Unlike most Marvel Studios leaks, there may be some truth to this rumor based on its source. It's highly unusual for an verified Marvel Studios social media account to jump the gun when it comes to launch dates. In this instance, however, that appears to be the case.",
    "Even so, we're unconvinced about this date. For one, Marvel Studios has never released two movies within the space of a month. Ordinarily, Marvel waits two to three months between feature film releases. That's been the standard practice for the studio dating back to 2011 when it started to release two or more movies per year.",
    "The closest that Marvel came to launching two MCU flicks in close proximity was in 2019. Back then, Captain Marvel and Avengers: Endgame launched within seven weeks of one another, but that was necessitated by Captain Marvel's role in the fourth Avengers flick.",
    "As of May 2021, Marvel's Blade wasn't due to start filming until 2022 either. According to a report from The Hollywood Reporter at the time, principal photography on Blade was pushed from September 2021 to July 2022. This was down to the studio's desire to work alongside screenwriter Stacey Osei-Kuffour on shaping its script.",
    "It would be impossible for Blade to be filmed, and for post-production work to be carried out, within a three-month window if its October 2022 release is to be met. Marvel movies require a lengthy post-production period for VFX, edits and potential reshoots after their initial filming periods. So this would be a no-go from the get-go.",
    "It's possible, then, that Marvel India's social media team has simply made a mistake. If someone thought that Blade was due to start filming this year, it's plausible that they'd think an October 2022 launch would be doable. Hence stating as much in its MCU release date tweet.",
    "Marvel's 2022 slate is already packed enough as it is, too. The studio is planning to release four movies and four Disney Plus shows next year, which is already enough content to keep MCU fans happy. All in all, the evidence points towards a simple error on Marvel India's part, so we can't see Blade landing as soon as 2022."
  ],
  "headers": {
    "6": "Analysis: sticking the knife in"
  },
  "links": {
    "confirmed his involvement": "https://www.techradar.com/news/blade-movie-lands-its-director-and-its-another-indie-hire-for-the-mcu",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/black-superman-ta-nehisi-coates-warner-bros-movie-1234947599/"
  }
}