{
  "source": "https://www.techradar.com/news/battlefield-2042-reveals-three-massive-multiplayer-maps-ahead-of-launch",
  "title": "Battlefield 2042 reveals three massive multiplayer maps ahead of launch",
  "category": "gaming",
  "updated": "2021-10-28T16:57:31Z",
  "author": "rhys-wood",
  "summary": "It's time to prepare for all-out warfare",
  "article": [
    "EA DICE has released deep-diving details on three enormous maps coming to the all multiplayer Battlefield 2042 at launch. While today's action-packed trailer feels like it's over in a flash, it does give us a better look at some never-before-seen gameplay highlighting landmarks and characteristics of each map ahead of game's launch on November 19, 2021.",
    "The three maps showcased are named Renewal, Breakaway and Discarded. Each offer wildly different climates and battle zones, playing into Battlefield 2042's dynamic weather feature. The maps will be playable in All-Out Warfare and Hazard Zone multiplayer modes, as well as accessible through the Battlefield Portal creation hub.",
    "The descriptions of each map, provided by an EA press release, are as follows:",
    "While the Battlefield series has typically always been very good, many fans were disappointed by the last outing, Battlefield 5, which arguably traded the grittier aesthetic of the series with something more generic. The World War 2 setting felt a little overdone, and a poor campaign was hardly salvaged by a multiplayer suite that felt like it was going through the motions.",
    "Battlefield 2042 at least appears like it doesn't want to replicate those missteps. The series is going back to its modern warfare highs, and the addition of dynamic (and disastrous) weather conditions appear to be adding some much-needed unpredictability to the large-scale matches. That's one impression we got from the open beta, at least.",
    "The above trailer also showcases the impressive amount of level destruction the series is known for. But this time, it appears that the weather is causing environmental damage as well as the players. Ultimately, Battlefield 2042 continues to look like good chaotic fun, and could be the shot in the arm the series has needed to maintain its relevancy in a genre arguably still dominated by rival franchise Call of Duty, and no shortage of popular battle royales like Fortnite and Apex Legends."
  ],
  "headers": {
    "3": "Analysis: Is Battlefield back on the right track?"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Hazard Zone": "https://www.techradar.com/news/battlefield-2042s-final-multiplayer-mode-hazard-zone-is-a-battle-royale-for-pacifists-and-it-looks-fantastic",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "open beta": "https://www.techradar.com/news/battlefield-2042-open-beta-is-overwhelming-chaos-in-the-best-possible-way",
    "Call of Duty": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review"
  }
}