{
  "source": "https://www.techradar.com/news/new-world-is-still-bricking-nvidia-graphics-cards-with-no-fix-on-the-horizo",
  "title": "New World is still bricking Nvidia graphics cards with no fix on the horizon",
  "category": "computing",
  "updated": "2021-09-30T18:52:50Z",
  "author": "allisa-james",
  "summary": "Trouble’s brewing in the New World",
  "article": [
    "Amazon Games’ latest MMO New World is a hot commodity, with queues as long as up to 469 hours. But there’s trouble brewing in this New World, as the title is still frying graphics cards – and this time it’s not just EVGA RTX 3090 cards",
    "According to multiple online reports on the game’s subreddit, it seems other GPU models have been suffering the same fate. Some examples include the RTX 3080 Ti, RTX 3080, RTX 3060 Ti, and the RTX 3000 laptop GPU. Even some AMD users have been complaining of overheating and crashing issues with their Sapphire 5700 XT models, though there doesn’t seem to be any reports of them fully breaking down like their Nvidia counterparts.",
    "These GPU breakdowns were first attributed to a soldering issue found with Nvidia’s most powerful model, the Nvidia GeForce RTX 3090, as complications such as the framerate skyrocketing in the main menu and extremely long wait times both resulting in massive overheating. EVGA even conducted its own investigation and verified them to be victims of “poor workmanship,” and replaced any models broken by New World.",
    "Amazon Games so far hasn’t commented on the issues at this time. Originally the company suggested players troubleshoot the initial problem by using an FPS limiter in the game’s menu. Now that the situation has been exacerbated, Reddit users have suggested players use their own FPS limiter tools such as the Rivatuner Statistics Server, which is a part of MSI Afterburner.",
    "Currently, the only way to remedy an already broken GPU is to contact the manufacturer and arrange for a replacement. We’ve reached out to Amazon and Nvidia for comment on this issue, and we’ll update this story if and when we hear anything."
  ],
  "headers": {},
  "links": {
    "up to 469 hours": "https://www.techradar.com/news/want-to-play-amazons-new-world-be-prepared-to-wait-up-to-469-hours",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "subreddit": "https://www.reddit.com/r/newworldgame/",
    "RTX 3080 Ti": "https://www.reddit.com/r/newworldgame/comments/px2dhy/new_world_fried_my_graphics_card_3080ti_anyone/",
    "RTX 3080": "https://www.reddit.com/r/newworldgame/comments/pxk20j/annnnd_there_goes_my_gpu_rtx_3080_limiters_in/",
    "RTX 3060 Ti": "https://www.reddit.com/r/newworldgame/comments/pxnkb2/well_that_was_a_fun_five_minutes_playing_this/",
    "RTX 3000 laptop GPU": "https://www.reddit.com/r/newworldgame/comments/pxqvne/laptop_gpu_3060_bricked",
    "overheating and crashing": "https://www.reddit.com/r/newworldgame/comments/pxvce6/sapphire_5700_xt_amd_3700x_overheating_during/",
    "conducted its own investigation": "https://www.techradar.com/news/evgas-broken-rtx-3090-graphics-cards-were-victims-of-poor-workmanship",
    "replaced any models": "https://www.techradar.com/news/evga-is-replacing-the-nvidia-rtx-3090-gpus-broken-by-amazons-new-world",
    "MSI Afterburner": "https://www.techradar.com/how-to/how-to-use-msi-afterburner-from-fps-monitoring-to-overclocking"
  }
}