{
  "source": "https://www.techradar.com/news/dark-web-tool-helps-cybercriminals-shift-stolen-funds-more-safely",
  "title": "Dark web tool helps cybercriminals shift stolen funds more safely",
  "category": "computing",
  "updated": "2021-08-16T16:00:48Z",
  "author": "mayank-sharma",
  "summary": "The tool isn’t very accurate...yet",
  "article": [
    "Cybersecurity experts have run into a new darknet tool that offers criminals a way to check whether their cryptocurrency holdings are linked to known criminal activity.",
    "Reporting on the tool, the BBC notes that although cryptocurrencies are thought to be anonymous, law enforcement agencies from around the world have made arrests by tracing tainted cryptocurrency through the public blockchain.",
    "\"We're seeing criminals start to fight back against blockchain analytics and this service is a first,\" said Dr.Tom Robinson, Chief Scientist and founder at analysis provider Elliptic, who discovered the website.",
    "The tool is named Antinalysis and it offers criminals a means to check the extent to which their cryptocurrency is “dirty”.",
    "Speaking to Brian Krebs, crypto tracing expert Nick Bax said he believes Antinalysis is just a clone of AMLBot, described as an anti- anti-money laundering intelligence service that first came online in 2019.",
    "According to reports, money laundering through the use of cryptocurrency is fast becoming a major headache for governments around the world, particularly China, the UAE and the UK.",
    "However, according to Dr. Robinson, Antinalysis, which charges $3 to check a single bitcoin address, isn't working very well at the moment. This isn’t surprising, since providing accurate blockchain analytics requires significant investment in technology and data collection over long periods of time, he noted.",
    "“Regardless, the tool represents a significant new capability for crypto launderers. They can now test their own laundering methods, be it the use of mixers or layering techniques, by screening their own Bitcoin wallet, before taking the risk of making a deposit at an exchange or other service provider,” Dr. Robinson concluded, warning compliance professionals to keep an eye on this growing trend.",
    "Via BBC"
  ],
  "headers": {
    "4": "Rising trend"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "Nick Bax said": "https://krebsonsecurity.com/2021/08/new-anti-anti-money-laundering-services-for-crooks/",
    "Bitcoin wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "BBC": "https://www.bbc.com/news/technology-58176113"
  }
}