{
  "source": "https://www.techradar.com/news/dyson-v15-detect-vs-dyson-v11-which-cordless-vacuum-is-best-for-you",
  "title": "Dyson V15 Detect vs Dyson V11: Which cordless vacuum is best for you?",
  "category": "appliances",
  "updated": "2021-08-05T12:34:56Z",
  "author": "carrie-ann-skinner",
  "summary": "Is the Dyson V15 Detect really the Absolute best cordless vacuum?",
  "article": [
    "Dyson’s most innovative cordless vacuum to-date, the Dyson V15 Detect, has gone on sale and while it may look similar to the Dyson V11 range of cleaners (which was launched in 2019 and is still available to buy) there have been a few notable improvements.",
    "The biggest upgrade (and most fun) is the inclusion of a laser in one of the cleaning heads to highlight microscopic dust particles that would otherwise be invisible to the naked eye.",
    "The cordless vacuum can even monitor the dust particles it collects, displaying the information on the LCD screen so you have visual evidence you’ve thoroughly cleaned your home.",
    "But aside from the different cleaning heads, you’re probably wondering exactly what the differences are - and we’ve tested them both to give you all you need to know.",
    "Check out our new interactive cordless vacuums video below",
    "Read on to find out just how these cordless vacuums compare – or, if you know which Dyson cleaner device you want, check out the best prices right now for both products below:",
    "The Dyson V15 Detect, which is known as the V15 Detect Absolute in the UK and the V15 Detect Total Clean in Australia, is priced at $699.99 / £599.99 / AU$1,399. It’s available to buy now worldwide.",
    "A second model is also available. In the US and the UK, it has a larger 0.5-gallon / 1.9-litre dust bin although it can’t count and sort the dust particles it collects. Known as the Dyson Outsize Absolute+ in the US, it also comes with two batteries and is priced at $899.99 (around £650 / AU$1,200). In the UK it's called the Dyson Outsize Absolute and is priced at £699.99 (around $990 / AU$1,275), although it only comes with one battery.",
    "Australia, meanwhile, also has the choice of the Dyson V15 Detect Absolute Extra, which builds on the V15 Detect with a free-standing dock and an extra HEPA to trap even more microscopic particles and costs AU$1,449 (around $1,125 / £800).",
    "In contrast, the Dyson V11 is available in three different versions in the US, with four options on offer in the UK and Australia. The Dyson V11 Animal is the entry-level model, which is priced at $599.99 / £499.99 / AU$1,099. In the UK and Australia this version doesn’t come with the High Torque Cleaner head that automatically adjusts the suction to suit the floor type, while in the US this model has the High Torque cleaner head but doesn’t come with a LCD display… are you keeping up so far?",
    "Next up is the Dyson V11 Torque Drive, which is available in the US with the High Torque Cleaner head, along with a soft cleaning head designed for hard floors.",
    "Confusingly in the UK, this model only has the High Torque cleaning head, and is not available in Australia at all. It’s priced at $699.99 / £549.99 (around AU$900)",
    "The UK and Australia also have the choice of a model with the moniker V11 Absolute, although in Australia it’s called the V11 Absolute Extra because, presumably, Dyson wants to make our lives impossibly hard when explaining this to you.",
    "Both come with the High Torque and soft cleaning head for hard floors along with five other tools, and cost £599.99 / AU$1,199 (around $930)",
    "Australia also gets the V11 Complete Pro that builds on the Absolute Extra with three additional tools and will set you back AU$1,299 (around $1,000 / £700).",
    "Finally, all three territories have the V11 Outsize, which comes with a larger 0.5 gallon / 1.7-liter canister and costs $799.99 / £649.99 / AU$1,099.",
    "The Dyson V15 Detect and the Dyson V11 range are very similar when it comes to looks; with the motor and the cyclones, which generate centrifugal force to keep dust and dirt in the canister, encased in plastic.",
    "Below this sits a 0.2 gallon / 0.75-liter dust canister, although the V11 Outsize has a larger 0.5 gallon / 1.7-liter canister.",
    "Both cordless vacuums can be used in stick mode, with a wand and cleaning head attached to the canister, or coveted into handheld mode and used with any of the arsenal of tools they come with.",
    "You’ll get a 1-inch / 2.5 cm LCD display on the top of both vacuums that shows the power setting selected and the remaining runtime, while the handle features a click-in batteries that mean less interruptions to your cleaning session, if you purchase an additional battery of course.",
    "The runtimes of each vacuum are evenly matched too - with both offering up to 60 minutes on the lowest power setting. During testing, the V15 Detect lasted a respectable 59 minutes between charges, while the V11 Absolute lasted the full 60 minutes.",
    "The V15 Detect’s motor generates 230 Air Watts, which is 24% more suction power than 185 Air Watts generated by the V11 range. More suction power means the vacuum is better at sucking up ground-in dirt, making cleaning your floors a much quicker task, but this doesn’t come at the expense of the battery run time, as our tests proved - just another reasons why the V15 Detect really is the best cordless vacuum you can right now.",
    "The V15 Detect’s 14 cyclones also generate 100,000g of centrifugal force compared to the 79,000g created by the 14 cyclones in the V11 This means the V15 is better at trapping dust and dirt in the canister, rather than letting it creep into the vacuum itself, which subsequently reduces the vacuum's suction over time.",
    "The V15 Detect’s laser dust detection feature is one area where the vacuum cleaner has had a hefty upgrade over the V11 Absolute. Both vacuums come with two cleaner heads, one of which is best-suited to hard floors because it has a soft roller brush that won’t damage the flooring.",
    "However on the V15 Detect the hard-floor cleaning head also features a laser diode mounted at an angle of 1.5 degree and 7.2mm off the ground.",
    "This diode shines a beam of green light in front of the head, and on test we were impressed at just how much dust this actually highlighted that we couldn’t see with the naked eye.",
    "The V15 Detect is also fitted with an acoustic piezo sensor that can count and identify the size of the dust particles it collects, displaying the information on the LCD screen - not something the V11 range offers but a handy feature if you want evidence just how thorough your clean has been.",
    "Finally, the V15 Detect also ships with an improved cleaning head and a completely new tool. The High Torque cleaning head, which is also found on the V11 range and will automatically adjust the suction level based of the floop type you’re cleaning, now comes with 56 polycarbonate teeth that shred hair into small sections, so they won’t get tangled around the bristles of the cleaning head.",
    "On top of that, the Anti-tangle hair screw is a small conical brush that has tufts of bristles angled in such a way that strands of pet and human hair automatically move towards the slimmer end of the tool rather than getting caught around the brush bar itself.",
    "On test, we deliberately left a clump of human hair removed from a hair brush on a sofa, and used this tool to suck it up. Whereas with some other vacuum cleaners it would have tangled around the brush, we were impressed to see the hair went straight into the canister without tangling around the tool.",
    "When it comes to suction power the Dyson V15 Detect is more powerful than the V11 range - which means it's more efficient at removing ground-in dust and dirt, and giving your carpets a thorough clean. No wonder we crowned it the best vacuum cleaner of 2021. But for everyday cleaning and sucking up recently spilled dry stains - both vacuums whip away dirt and debris super quickly.",
    "However, if you have hard floors or want proof that your vacuuming sessions really are thorough, then the laser cleaning head along with the acoustic piezo sensor on the V15 Detect is going to be a real draw.",
    "In the US and the UK, the V11 Torque Drive and V11 Absolute Absolute respectively ship with similar cleaning heads and tools, albeit without the laser or polycarbonate teeth, are the same price as the V15 Detect so there’s no extra cost to consider, although in Australia this model is AU$200 cheaper than the Dyson V15 Detect, which may make a difference."
  ],
  "headers": {
    "5": "Best Dyson V15 Detect and Dyson V11 deals",
    "6": "Price",
    "16": "Design",
    "23": "Features",
    "30": "Verdict"
  },
  "links": {
    "cordless vacuum": "https://www.techradar.com/news/best-cordless-vacuum-cleaner",
    "Dyson V15 Detect": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
    "Dyson V11": "https://www.techradar.com/reviews/dyson-v11-absolute",
    "V11 Outsize": "https://www.techradar.com/reviews/dyson-v11-outsize",
    "best vacuum cleaner of 2021": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}