{
  "source": "https://www.techradar.com/news/amd-zen-4-could-disappoint-those-hoping-for-a-24-core-cpu",
  "title": "AMD Zen 4 could disappoint those hoping for a 24-core CPU",
  "category": "computing",
  "updated": "2021-07-14T09:01:06Z",
  "author": "darren-allan",
  "summary": "AMD looks to be sticking with a 16-core flagship",
  "article": [
    "AMD’s Zen 4 processors, the next-generation silicon set to debut next year, will top out at 16-cores, which is the same as the current Ryzen 5000 range, going by the latest from the rumor mill.",
    "This is notable because previous speculation contended that AMD might push for a bigger core count on the flagship Zen 4 CPU, with the idea being floated that a 24-core monster could head up what might be the Ryzen 6000 range.",
    "This won’t be the case according to ExecutableFix on Twitter, though, and another well-known hardware leaker, Patrick Schur, backs this up (adding that the flagship’s TDP could be 170W). Even in the past, rumor peddlers have cast doubt on the possibility that AMD may push for something bigger than 16-cores.",
    "There’s a few reasons for that, including the fact that 16-cores is plenty enough, and there’s really no need to push to 24 – especially given that Zen 4 is a whole new architecture that’s expected to make big gains on the performance front (with something like a 20% uptick in IPC or Instructions per Clock).",
    "The other major problem with a theoretical 24-core flagship is the cost to make such a chip, which would translate into a seriously hefty price tag for the CPU, one that probably wouldn’t make much sense in the consumer world.",
    "It’s not as if the Ryzen 9 5950X isn’t pricey as it is at $799 (or £750), and a 24-core model would likely break the $1,000/£1,000 barrier, becoming prohibitively expensive.",
    "Other rumors around Zen 4 (supposedly to be built on 5nm) theorize that AMD will introduce integrated Navi graphics on board these desktop CPUs, which would be a major change and one perhaps aimed at grabbing more of the business market (where an integrated GPU, which is fine for basic computing, could be a serious money-saver in terms of dispensing with the need for discrete cards across multiple machines).",
    "If the rumor mill is right, Zen 4 chips will emerge at the end of 2022, and could be going head-to-head with Intel’s Raptor Lake CPUs (the successor to next-gen Alder Lake). Interestingly, the current word from the grapevine is that Raptor Lake chips might come with a 24-core flagship, but the major caveat there is that the majority of those, 16-cores, would be low-power ones, with 8-cores being full-power.",
    "Via VideoCardz"
  ],
  "headers": {
    "4": "Cost matters"
  },
  "links": {
    "AMD’s Zen 4 processors": "https://www.techradar.com/news/amd-zen-4-rumor-could-be-bad-news-for-intel",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "idea being floated": "https://www.techradar.com/news/amd-zen-4-rumor-suggests-much-faster-ryzen-cpus-for-2022-and-even-a-24-core-monster",
    "backs this up": "https://twitter.com/patrickschur_/status/1415065218087100422",
    "rumor peddlers have cast doubt on the possibility": "https://www.techradar.com/news/amd-zen-4-rumor-suggests-much-faster-ryzen-cpus-for-2022-and-even-a-24-core-monster",
    "Ryzen 9 5950X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-9-5900x-and-5950x-find-stock-here",
    "end of 2022": "https://www.techradar.com/news/amd-zen-4-rumor-suggests-late-2022-release-a-year-after-intel-alder-lake-debuts",
    "going head-to-head with Intel’s Raptor Lake CPUs": "https://www.techradar.com/news/intels-raptor-lake-with-24-core-cpu-could-take-on-amd-zen-4-in-2022",
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-cpu-spotted-in-first-game-benchmark",
    "VideoCardz": "https://videocardz.com/newz/amd-raphael-zen4-desktop-cpus-likely-limited-to-16-cores"
  }
}