{
  "source": "https://www.techradar.com/news/how-much-does-a-pos-system-cost-what-you-need-to-know-about-software-and-hardware-prices",
  "title": "How much does a POS system cost? What you need to know about point of sale prices",
  "category": "computing",
  "updated": "2021-08-03T14:54:28Z",
  "author": "francesca-nicasio",
  "summary": "Need a new POS? Learn the costs and factors to consider when buying a point of sale system.",
  "article": [
    "The best POS systems are much more than a simple cash register these days. Yes, they can process customer orders, but some have evolved to the point that they’ve become multi-functional hubs for businesses across myriad types of industries.",
    "The quickly-evolving POS platforms today can offer a wide range of features and functionalities — everything from employee management and CRM to menu creation and inventory management.",
    "That’s why the POS market has exploded to the tune of reaching $16 billion in 2020, and it’s expected to reach $29.09 billion by 2025.",
    "Continues below...",
    "Choosing the right POS system for your business is a huge decision, and one thing that factors into that decision is price. However, there is no “one-size-fits-all” answer as to how much you’ll pay for your POS because every business has different needs.",
    "When deciding on which system to purchase, consider making a list that divides features into categories like “essential,” “nice to have,” and “unnecessary.”",
    "To get you started, we’ll explore the types of POS systems, the factors you need to consider, and estimated costs that will help you make a more informed decision.",
    "A good place to start is by looking at the two types of POS systems, their components, and how those components can affect the price.",
    "On-premise POS",
    "As the name suggests, on-premise POS systems are a network of terminals or computers that are located and connected at your actual place of business. It operates within your company’s internal network and stores data like inventory levels and sales performance on a local database — usually your computer’s hard drive.",
    "For a visual, picture something like a desktop computer complete with monitor and keyboard, usually found on top of a cash drawer. While a great solution for retail operations, there are additional smaller pieces of hardware that are compatible and necessary to run the system that need to be purchased for each POS terminal.",
    "Because of this, it’s often more expensive to implement and can broadly run from $3,000-$50,000 annually — and you often have to rebuy the software if there’s an available update.",
    "Cloud-based POS",
    "Unlike on-premise POS systems, a cloud-based POS runs in “the cloud,” or a remote online server that only requires an internet connection.",
    "Whereas on-premise requires proprietary hardware or a desktop computer as a terminal, cloud-based POS software usually runs on a tablet, like an iPad or Android device. This allows you to be more mobile and complete transactions throughout the store.",
    "And because it requires less set-up, it often costs less to implement the hardware and software, ranging anywhere from $50 to $100 per month and a one-time set-up fee ranging from $1,000-$1,500.",
    "This is the choice of many small businesses because in addition to the lower cost, it allows you to access information from any remote location, ideal if you have multiple stores.",
    "In addition, all your data is automatically backed up online safe and secure. And unlike on-premise point of sale systems, cloud-based POS solutions are automatically updated and maintained for you.",
    "When using a cloud-based POS, there are three ways that software can be sold:",
    "A lot goes into deciding what kind of software you can afford and what you need, and the following data points should be considered:",
    "Size",
    "How many products do you sell? How large is your store?",
    "Terminals",
    "How many checkout terminals does your store need?",
    "Locations",
    "Do you run a single location or do you have multiple locations?",
    "Users",
    "Depending on your provider, you may be charged based on the number users or “seats” in your POS system.",
    "Hardware compatibility",
    "While the majority of POS software will be compatible with most point of sale hardware, there are instances when a POS vendors' software includes proprietary hardware.",
    "Customer support",
    "Some providers may charge more for “premium support”. And if you’re using on-premise systems, things like customer support have to be purchased separately and can run up to hundreds of dollars each month, depending on your package.",
    "Whether you’re using on-premise or cloud-based, you will need to buy hardware.",
    "The costs will vary greatly between the two systems. With on-premise POS systems, things add up quickly when you consider you need additional things like keyboards and monitors for each terminal.",
    "And because some hardware may be proprietary — meaning it’s licensed from the same software company — you have to buy it from them, which is more expensive and could run you between $3,000-$5,000 when you also factor in yearly maintenance fees.",
    "If you’re using a cloud-based system, it’s relatively inexpensive seeing as you’re using commodity hardware like tablets and stands that can be bought on Amazon or Best Buy for a few hundred dollars.",
    "In order to keep your business running smoothly from the cloud, there are additional items you may have to purchase along with the tablets and stands:",
    "Along with paying for the software, hardware, customer support, and the system itself, you might also be subject to set-up fees that will depend on your vendor. However, one thing you can count on is payment processing fees, which is usually a third-party service.",
    "Every time a customer uses a credit card to make a purchase, you have to pay to process the payment. This is usually a flat fee and/or percentage for every sale made, often in the ballpark of 2%-3%.",
    "As you can see, the cost of a POS system depends on a variety of factors that make it impossible to arrive at one single answer.",
    "Some businesses will pay $3,000 a year while others will have to pay more than $10,000 depending on the size of the business, the industry, revenue stream, hardware requirements, and more.",
    "However, there’s a lot of flexibility and options that make it possible to find a solution that works for you, your business, and your bottom line.",
    "If you're looking to learn more about POS systems, read our articles about How to choose the right POS system for your business, 9 inspiring ideas on how to use POS system customer data, or our guide to the best POS systems for restaurants, small businesses, and retail."
  ],
  "headers": {
    "7": "Types of POS systems",
    "18": "Costs of software",
    "19": "Other software factors to consider",
    "32": "Costs of hardware",
    "36": "Other hardware considerations",
    "37": "Payment processing fees",
    "39": "The bottom line",
    "42": "Further reading"
  },
  "links": {
    "best POS systems": "https://www.techradar.com/news/the-best-pos-system",
    "POS platforms": "https://www.techradar.com/news/how-to-choose-the-right-pos-system-for-your-business",
    "$16 billion": "https://www.mordorintelligence.com/industry-reports/point-of-sale-terminal-market",
    "Choosing the right POS system": "https://www.techradar.com/news/how-to-choose-the-right-pos-system-for-your-business",
    "How to choose the right POS system for your business": "https://www.techradar.com/news/how-to-choose-the-right-pos-system-for-your-business",
    "POS system customer data": "https://www.techradar.com/news/9-inspiring-ideas-on-how-to-use-pos-system-customer-data"
  }
}