{
  "source": "https://www.techradar.com/news/this-privacy-focused-vpn-is-getting-a-major-refresh",
  "title": "This privacy-focused VPN is getting a major refresh",
  "category": "computing",
  "updated": "2021-02-25T20:59:02Z",
  "author": "anthony-spadafora",
  "summary": "TorGuard's apps are getting a new and improved UI",
  "article": [
    "The developers behind the popular VPN service TorGuard have been hard at work developing new features, network upgrades, a brand new website design and even an improved user interface for the VPN's mobile apps.",
    "According to a new blog post, the company's long-awaited TorGuard app re-design will be rolling out early next month with the release of a new version of the service's mobile app for iOS and updated browser extensions.",
    "The app's new user interface puts VPN settings front and center and users will be able to quickly connect and disconnect, change their VPN location, select HTTP or SSL and even choose which port they want to connect from. The new iOS app design will roll out first and TorGuard's Android and desktop apps will be updated with the new UI in the coming weeks.",
    "In terms of new features, the company has been working on adding popular feature requests to its desktop and mobile apps. The most requested of these new features is Split Tunneling which allows users to include or exclude websites, IP's or specific apps from the VPN tunnel. TorGuard is also making it easier for users to pay for its VPN service by offering in-app payments in iOS though it also plans to offer this functionality in its Android app as well.",
    "In addition to UI and software updates, TorGuard's team has also been busy upgrading all of its servers to support 10GB speeds while simultaneously upgrading its server hardware to keep its network running as fast as possible.",
    "At the same time though, the company plans to increase bandwidth availability in its residential IP locations and these upgrades will begin with TorGuard's LA residential location at the beginning of March.",
    "TorGuard has also begun to move some of its virtually routed VPN locations to physical data centers in the stated VPN endpoint's location. These locations include South Africa and South Korea where the company has upgraded its servers which are now hosted inside secure data centers within these countries. TorGuard has also moved its Bangalore India servers to Mumbai due to popular demand and its servers in Israel, Taiwan, and Manchester have been upgraded to 10GB speeds.",
    "Finally, TorGuard is now selling gift cards which are available from its sister company PrivateRouter and for a limited time, it is offering a free $20 gift card with the purchase of select VPN routers from the site's store."
  ],
  "headers": {
    "4": "TorGuard network"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "TorGuard": "https://www.techradar.com/reviews/pc-mac/software/utilities/torguard-1325674/review",
    "blog post": "https://torguard.net/blog/torguard-2021-update-discounts/",
    "browser extensions": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "VPN tunnel": "https://www.techradar.com/vpn/vpn-tunnels-explained-how-to-keep-your-internet-data-secure",
    "in-app payments": "https://www.techradar.com/news/google-follows-apples-lead-with-new-stricter-play-store-payment-rules",
    "VPN locations": "https://www.techradar.com/vpn/how-to-find-the-true-location-of-your-vpn-servers",
    "PrivateRouter": "https://privaterouter.com/en/",
    "VPN routers": "https://www.techradar.com/news/best-vpn-routers"
  }
}