{
  "source": "https://www.techradar.com/news/no-the-steam-deck-wont-run-every-game-in-your-library-but-does-that-matter",
  "title": "No, the Steam Deck won’t run every game in your library – but does that matter?",
  "category": "computing",
  "updated": "2021-09-07T10:55:02Z",
  "author": "matt-hanson",
  "summary": "Temper your expectations",
  "article": [
    "Many of us are getting very excited about the Steam Deck, the upcoming handheld game console from Valve that will allow us to play PC games while on the go, but we’ve been getting conflicting information about how many games the Steam Deck will be able to run.",
    "As RockPaperShotGun reports, a recent interview with Valve’s Pierre-Loup Griffais for IGN appears to have been misinterpreted by some over-eager corners of the internet, with the line “All the games we wanted to be playable is, really, the entire Steam library. We haven't really found something we could throw at this device that it couldn't handle,” making people think that this means the Steam Deck would be able to play any game in Steam’s vast library.",
    "However, according to James B. Ramey, CodeWeaver’s president, that quote doesn’t mean that every game on Steam will actually be playable on the Steam Deck – at least, initially.",
    "First of all, while James B. Ramey might not be a name you’re familiar with, he should have a pretty good idea of what can and can’t be run on the Steam Deck, as CodeWeaver worked with Vale to co-develop Proton, the software compatibility layer that means the Linux-based Steam Deck can run Windows 10 games – which the vast majority of Steam games are.",
    "In a chat on the Boiling Steam podcast, Ramey explains that “when Pierre-Loup made his announcement and stated that the Steam Deck can support any and all games… I think he was trying to state that the device itself, the hardware specs on this device, can support any game.”",
    "So, while the Steam Deck’s hardware should be powerful enough to run any game on Steam – an impressive feat in itself – when the device launches there may still be titles that won’t run on it, as the Proton compatibility may not be there.",
    "This clarification makes a lot of sense. There are a huge amount of games on Steam, so not every title will be tested to run via Proton. If there are issues, then that could mean the game won’t be playable on the Steam Deck when it launches.",
    "This news isn’t that bad, however. Because it’s a software issue, not a hardware one, it means it could be relatively easy to fix with patches along the way. As Ramey explains, “there is a lot of effort being poured into Proton to support a broader range of games even that is available then currently today. So you’re going to see that when the Steam Deck is released and Proton is put on the Steam Deck that there is going to be a greater number of titles that are supported.”",
    "This means that while there may be some games that won’t run at first, they could be patched to run later on. If this had been an issue with the hardware, then that would have been a lot harder to fix.",
    "So, there’s a good chance that the Steam Deck will run your favorite games when it launches. The list of games playable on Linux via Proton is steadily growing, and the Steam Deck’s launch will likely spur this on. If there’s a game that can’t be run, then hopefully Proton compatibility will be added at some point.",
    "We’ve also heard from Valve that the Steam Deck will run like a PC, and that means allowing users to install other operating systems. So, if a game won’t run on the Steam Deck’s Steam OS Linux distribution, you could always install Windows 10 on it, which in theory would fix any compatibility issues.",
    "So, this news may not be as bad as it first seems. It certainly hasn’t dimmed our excitement for the Steam Deck."
  ],
  "headers": {
    "3": "Who he?",
    "6": "Don’t worry – software can be fixed"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "RockPaperShotGun reports": "https://www.rockpapershotgun.com/the-steam-deck-wont-actually-run-your-entire-steam-library-proton-president-reminds-everyone",
    "for IGN": "https://www.youtube.com/watch?v=e3HnDR7A8yE",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Boiling Steam": "https://boilingsteam.com/podcast-15-with-james-ramey-from-codeweavers-steam-deck-proton-2021-and-beyond/"
  }
}