{
  "source": "https://www.techradar.com/news/apple-will-keep-all-its-chinese-customer-data-stored-in-china",
  "title": "Apple will keep all its Chinese customer data stored in China",
  "category": "computing",
  "updated": "2021-05-18T13:35:37Z",
  "author": "mayank-sharma",
  "summary": "A state-owned Chinese firm managed Apple’s data centers in China",
  "article": [
    "Apple has apparently given in to the demands of Chinese authorities to keep the personal data of its Chinese customers within the country’s borders, according to reports.",
    "The iPhone maker is building two new data centers in China to house the data, as the company seems to have reportedly ceded to the country’s law that requires all personal information and data collected in China, to not leave its borders.",
    "The New York Times (NYT) has pieced together details of Apple dancing to the tune of Chinese regulators in order to do business in the country, based on internal Apple documents.",
    "It claims the computers inside the data center, which will also house the iCloud data of its Chinese customers, are run and managed by a state-owned Chinese firm. And while the data inside them is encrypted, the keys are housed within the data center itself.",
    "“We have never compromised the security of our users or their data in China or anywhere we operate,” Apple told the NYT.",
    "A spokesperson for the company stressed that the Chinese data center uses the most advanced encryption technology available, which is more advanced than what Apple uses in other countries.",
    "In fact, he added that Apple still controls the keys that protect the data of its Chinese customers.",
    "Reportedly, there was a long negotiation between Apple and the Chinese authorities over the digital keys that can decrypt the data. Apple wanted to keep them in the US, while Chinese officials wanted them in China.",
    "Apple initially resisted, but had to give in eventually, and the encryption keys ended up in China.",
    "While there is no evidence to suggest that the Chinese government has direct access to the data, security experts have said that it wouldn’t be too much of a chore.",
    "In case the Chinese authorities can demand the data as it does regularly from Chinese companies, usually for law-enforcement investigations.",
    "More worryingly, the experts told the NYT, the country can simply access the data without asking Apple, especially since the keys reside in a data center managed by a Chinese firm.",
    "Via New York Times"
  ],
  "headers": {
    "5": "Key point"
  },
  "links": {
    "Apple": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "data centers": "https://www.techradar.com/news/internet/data-centre",
    "iCloud": "https://www.techradar.com/reviews/apple-icloud",
    "New York Times": "https://www.nytimes.com/2021/05/17/technology/apple-china-censorship-data.html"
  }
}