{
  "source": "https://www.techradar.com/news/a-new-splinter-cell-is-finally-in-the-works-according-to-a-new-report",
  "title": "A new Splinter Cell is finally in the works, according to a new report",
  "category": "gaming",
  "updated": "2021-10-20T15:40:01Z",
  "author": "vic-hood",
  "summary": "And it's not VR this time",
  "article": [
    "Update: Ubisoft has said \"no comment on rumor or speculation\" in response to TechRadar's request for comment on this story. Original story continues below:",
    "A new mainline Splinter Cell game is in the works, according to a new report.",
    "According to a report by notable leaker Tom Henderson at VGC, Ubisoft has greenlit its first mainline Splinter Cell game in almost a decade, with the long-running series' next title currently in early production - and a possibility it could be revealed in 2022.",
    "VGC's development sources allegedly claim that the new Splinter Cell game is being produced in an effort to win back fans who have grown frustrated by the series' move in recent years into mobile and VR spaces.",
    "Sources \"with knowledge of Ubisoft’s plans\" also suggest that development is being led by a studio outside of Ubisoft Montreal, the studio which has previously headed up development of the Splinter Cell series.",
    "While it's always worth taking reports like this with a big pinch of salt, Henderson is a well-known leaker who has been accurate in his leaks regarding Call of Duty and Battlefield.",
    "The last mainline Splinter Cell game, Splinter Cell: Blacklist, was released back in 2013, meaning it's been eight years since we've seen a new mainline entry in the stealth-action series.",
    "Since then, fans have been crying out for a new Splinter Cell game, but have consistently been disappointed. The series' protagonist Sam Fisher has appeared in Rainbow Six Siege as an Operator and, last year, Ubisoft announced a new Splinter Cell VR game - but there's been no official word on a fully-fledged new series entry.",
    "However, back in 2019, Ubisoft CEO Yves Guillemot did suggest in an interview with IGN that the publisher was ready to revive the series again.",
    "\"The last time we did a Splinter Cell, we had lots of pressure from all the fans actually saying, ‘Don’t change it, don’t do this, don’t do that,’ so some of the teams were more anxious to work on the brand,\" Guillemot told the publication.",
    "\"Now there are some things and some people that are now looking at the brand, taking care of the brand, so at one point you will see something, but I can’t say more than that.\"",
    "VGC's report suggests Ubisoft may finally be taking the plunge to give fans what they've been asking for all these years.",
    "TechRadar has contacted Ubisoft for comment."
  ],
  "headers": {
    "6": "Analysis: it's a long time coming"
  },
  "links": {
    "VGC": "https://www.videogameschronicle.com/news/a-decade-later-ubisoft-has-finally-greenlit-a-new-splinter-cell-sources-claim/",
    "interview": "https://www.ign.com/articles/2019/04/08/tom-clancy-games-changed-ubisoft-says-ceo-a-ign-unfiltered"
  }
}