{
  "source": "https://www.techradar.com/news/the-next-amazon-echo-could-use-radar-to-track-your-sleep",
  "title": "The next Amazon Echo could use radar to track your sleep",
  "category": "smart-home",
  "updated": "2021-07-11T09:30:32Z",
  "author": "david-nield",
  "summary": "Anything Google can do...",
  "article": [
    "The latest Google Nest Hub smart display has the ability to track your sleeping habits using radar, and now it would seem that Amazon is prepping a similar feature for its Echo devices, according to a regulatory filing.",
    "As reported by Bloomberg, Amazon has applied to the Federal Communications Commission (FCC) in the US for permission to use a radar sensor in its future products, in order to sense motion and \"enable contactless sleep tracing functionalities\".",
    "The same motion-sensing technology could also be used to control an Echo device using hand gestures – again something you can go with the Google Nest Hub and indeed the Google Pixel 4 phones, thanks to the miniaturized radar sensors on board.",
    "\"The use of Radar Sensors in sleep tracking could improve awareness and management of sleep hygiene, which in turn could produce significant health benefits for many Americans,\" reads the filing. \"Radar Sensors will allow consumers to recognize potential sleep issues.\"",
    "The FCC actually makes a mention of Google's radar-sensing products in granting permission for Amazon to offer the same tech in its gadgets – tech which will have to comply with all the usual health and safety regulations in order to be used.",
    "Google's own system was originally called Project Soli before it appeared in the Pixel 4. While radar sensors weren't included in the Pixel 5, Google has promised that it's committed to the technology, and that it's going to show up in future products.",
    "The filing that Amazon has lodged with the FCC doesn't reveal many other details about how Amazon intends to deploy radar sensors in its upcoming devices, or what we can expect from the next Echo smart speaker, but it seems clear that it wants to match up with what the latest Google Nest Hub offers.",
    "The most recently launched Echo was the Echo Show 10, which featured a rotating screen, but devices of other sizes – specifically the Amazon Echo Show 8 and the Echo Show 5 – could also be in line for the sleep tracking and gesture control tech when it appears."
  ],
  "headers": {
    "4": "Common sensors"
  },
  "links": {
    "Google Nest Hub smart display": "https://www.techradar.com/reviews/google-nest-hub-2nd-generation-review",
    "Echo devices": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-07-09/amazon-com-wants-to-monitor-you-in-your-sleep-for-your-benefit",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "has promised": "https://www.techradar.com/news/pixel-5-lacks-motion-sense-tech-but-it-will-return-google-says",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Amazon Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5"
  }
}