{
  "source": "https://www.techradar.com/news/some-google-pay-users-can-now-send-money-overseas",
  "title": "Some Google Pay users can now send money overseas",
  "category": "phones",
  "updated": "2021-05-12T11:50:04Z",
  "author": "srivatsa-ramesh",
  "summary": "However destinations are limited for now",
  "article": [
    "Users of Google Pay will soon be able to send funds to contacts overseas following an update to the money transfer app.",
    "The upgrade, available to Google Pay customers in the US, sees the app team up with financial experts Western Union and Wise (formerly TransferWise)",
    "However users will initially only be able to send money to contacts in India and Singapore - although Google says there are plans to expand this further within the next few years.",
    "Google says the expansion was motivated by the huge growth in international payments seen during the pandemic as users look to help friends and relatives in their home countries pay for essential expenditures like healthcare, education, bills and more.",
    "It says that by the end of the year, Google Pay users will be able to send money to people in more than 200 countries and territories through Western Union and to more than 80 countries through Wise.",
    "As a part of the introductory offer, Google Pay will allow unlimited free transfers until June 16 when sending money with Western Union and with Wise for new customers on transfers up to $500.",
    "\"For some, sending money back to their home countries is a regular activity and we are making it more accessible by adding it to the app that you use for your everyday money tasks,\" Google wrote in a blog post announcing the news.",
    "\"Working with Western Union and Wise, we’re now able to give those with family abroad a simple, safe and reliable way to send money abroad.\""
  ],
  "headers": {
    "3": "Google Pay expands",
    "8": "How to transfer money from US to India via Google Pay"
  },
  "links": {
    "money transfer app": "https://www.techradar.com/best/best-money-transfer-apps",
    "Google Pay": "https://www.techradar.com/how-to/how-to-use-google-pay",
    "blog post": "https://blog.google/products/google-pay/send-money-loved-ones-abroad/"
  }
}