{
  "source": "https://www.techradar.com/news/amds-64-core-threadripper-pro-cpu-is-now-out-with-a-truly-wallet-ripping-price",
  "title": "AMD’s 64-core Threadripper Pro CPU is now out – with a truly wallet-ripping price",
  "category": "computing",
  "updated": "2021-03-02T16:13:45Z",
  "author": "darren-allan",
  "summary": "Monster Threadripper Pro 3995WX processor will set you back $5,500",
  "article": [
    "AMD has announced that three Ryzen Threadripper Pro CPUs are now available to buy as standalone products from online retailers across the globe.",
    "The freshly unleashed models are the AMD Ryzen Threadripper Pro 3995WX, 3975WX and 3955WX, which are seriously powerful processors aimed at workstation PCs and professional use. Previously, these chips were only available in prebuilt workstations, but you can now buy them separately to put in your own dream machine.",
    "These Ryzen Threadripper Pro CPUs offer 8 channels of memory alongside 128 lanes of PCIe 4.0, plus various bits of AMD Pro Security tech. The latter includes AMD Secure Processor, a dedicated security system, plus AMD Memory Guard which provides real-time encryption of system RAM, all of which should help keep your sensitive data safe.",
    "Spearheading the range, AMD’s Threadripper Pro 3995WX bristles with 64-cores (and 128-threads), having a base clock of 2.7GHz and boost of up to 4.2GHz (with a TDP of 280W).",
    "The 3975WX offers 32-cores (and 64-threads) with a higher base clock of 3.5GHz (and the same boost as the 3995WX), whereas the 3955WX is a 16-core (32-thread) CPU clocked at 3.9GHz with boost to 4.3GHz.",
    "Naturally, all this performance doesn’t come cheap. Indeed, the recommended pricing for these processors over in the US is $5,489 for the Threadripper Pro 3995WX, and $2,749 for the 3975WX, with the 3955WX running to $1,149.",
    "In the UK, Scan is selling the 3995WX at a penny under £5,000, with the 3975WX commanding half that at £2,500, and the 3955WX making a £1,050 dent in your wallet (note that the latter CPU is still on pre-order, though, at least at Scan).",
    "As mentioned, these processors are aimed at professional users, and not suitable for consumer PCs, as you probably guessed from the eye-watering prices – although these price tags are competitive compared to rival Intel workstation-targeted chips.",
    "For example, Intel’s Xeon W-3275, a 28-core pro creator targeted workstation CPU, has a recommended price of $4,449, so the 64-core 3995WX is only a grand more, comfortably outdoing the Xeon in various content creation tasks, as evidenced by benchmarks AMD has provided."
  ],
  "headers": {
    "5": "Pricey proposition"
  },
  "links": {
    "Ryzen Threadripper Pro CPUs": "https://www.techradar.com/news/amd-piles-pressure-on-xeon-with-ryzen-threadripper-pro-cpus-higher-clocks-more-memory",
    "recommended pricing for these processors": "https://www.techradar.com/news/amd-threadripper-pro-64-core-processor-will-cost-a-massive-dollar5489",
    "Scan": "https://www.awin1.com/awclick.php?awinmid=15473&awinaffid=103504&clickref=trd-us-3020714104753656000&p=https%3A%2F%2Fwww.scan.co.uk%2Fshops%2Famd%2Fryzen-threadripper-pro",
    "provided": "https://www.amd.com/en/processors/ryzen-threadripper-pro"
  }
}