{
  "source": "https://www.techradar.com/news/how-to-pick-the-best-ultra-wide-monitor-for-gaming",
  "title": "How to pick the best ultra-wide monitor for gaming",
  "category": "computing",
  "updated": "",
  "author": "daryl-baxter",
  "summary": "Ultra-wide in style",
  "article": [
    "So, you’ve decided to upgrade your monitor to an ultra-wide one, but where do you start? Picking an ultra-wide monitor can be a challenge, as you need to factor in other features beyond the display features compared to standard monitors.",
    "Ultra-wide promises something that no normal monitor can give - a very wide perspective of the game you’re playing in a 21:9 view to keep you even more immersed.",
    "While they can also be a benefit when working, enabling the use of three full-size browser windows at once, playing Deathloop or Greak in ultra-wide will also be an experience you’ll want to keep on your desk for the foreseeable.",
    "There are other benefits as well, such as being able to manage a stream while playing a game at the same time, without managing multiple monitors at once. Plus, while many games don’t support ultra-wide just yet, many are already being updated by developers or communities to make it a viable option, such as Sonic Mania and Tomb Raider.",
    "With this in mind, we’ve picked out the best factors to consider when looking for an ultra-wide monitor so you can bring your gaming setup into the ultra-wide future.",
    "There’s no escape from the ultra-wide view of these monitors. From a 21:9 perspective, it’s a hefty monitor to make space for on your desk, while having a height and angle that fits when you’re sitting in your gaming chair.",
    "Due to the length of these monitors, most of them are curved to make it even more immersive for gaming, especially for simulation and racing games where you’re in a cockpit, for example.",
    "We recommend looking for a monitor that can be easily adjustable, so it can meet your eye view and you can have the best position for viewing the content that the monitor is showing.",
    "For an ultra-wide monitor, size matters over all. This can decide how much real-estate you want the monitor to cover on your desk, and it may even cause you to look for a new desk to accommodate for the ultra-wide lifestyle.",
    "While you can investigate varying sizes when looking at a normal monitor, for an ultra-wide variant for gaming, we recommend starting at 30 inches and working from there.",
    "Some monitors can go as high as 50 inches, so depending on your budget and the size of your desk, look for a size that’s not only best for you, but best for your surroundings.",
    "This is where the horizontal space will be a big consideration for the best resolution. Red Dead Redemption 2, No Man's Sky and Forza Horizon 5 are just some examples that can support ultra-wide monitors natively, but there will be others which may look stretched, so some extra effort will be required to make them look as good as possible on these displays.",
    "When you’re looking for an ultra-wide monitor that’s solely for gaming, one should aim for a resolution of 3440×1440 or higher. The refresh rate is also something else to consider here. It boils down to how often an image appears on a screen every second. The higher the refresh rate that’s stated, the smoother the game will look. So if you see a 120Hz display, as long as the game supports this, you will be able to play at 120 frames per second.",
    "However, it’s going to take a hefty graphics card to render a game at this resolution to begin with, before the refresh rate is taken into account, so look for a monitor that can render at 60Hz at minimum.",
    "An ultra-wide monitor doesn’t come cheap, so be prepared to spend $700 / £500 / AUS$600 at minimum. But there is light at the end of the ultra-wide tunnel, as deals from Amazon for Black Friday are starting to introduce these monitors as limited lightning deals, which have seen as much as 15% discount from the normal price in past sale events.",
    "So if you can hold off a little longer, research into what the limited sales holidays offer and by how much.",
    "However, there is an influx of cheaper ultra-wide monitors that you can buy for under $300 / £400 / AUS$400 at the expense of ports and refresh rate. These also won’t be curved, so while this price range won’t be as immersive, you will still have some benefit of size and resolution at 21:9 that can showcase certain games in a glory that’s still better than a normal 1440p resolution on a 24-inch standard monitor."
  ],
  "headers": {
    "5": "1. Ergonomics",
    "8": "2. Size",
    "11": "3. Resolution",
    "14": "4. Price"
  },
  "links": {}
}