{
  "source": "https://www.techradar.com/news/oneplus-10-will-come-with-new-snapdragon-8-gen-1",
  "title": "OnePlus 10 will come with new Snapdragon 8 Gen 1",
  "category": "phones",
  "updated": "2021-12-01T22:03:38Z",
  "author": "james-peckham",
  "summary": "The next flagship OnePlus will sport a top-end chip",
  "article": [
    "Less than 24 hours after the reveal of the Snapdragon 8 Gen 1 we've already had five confirmed manufacturers that will be including the new chipset in flagship phones over the next few months.",
    "The latest name to join that list is OnePlus, and it's set to feature in a handset that we expect to be called the OnePlus 10.",
    "OnePlus CEO Pete Lau confirmed on Weibo, a Chinese social networking site, that the \"next-generation\" of OnePlus products would feature the new chipset. Lau didn't confirm the name of the products, but we believe them to be called the OnePlus 10.",
    "It's widely expected that the next flagship phones from the company will be called the OnePlus 10 and OnePlus 10 Pro.",
    "Leaks suggest the handsets may be introduced in China near the start of 2022, and then they'll come to the rest of the world around March or April.",
    "Oppo – OnePlus' sister brand – also confirmed it would be including the new Snapdragon chipset in the Oppo Find X4 series (or whatever the company calls its next flagship device).",
    "Other confirmed devices include the Realme GT 2 Pro, the Xiaomi 12 and a new Motorola Edge handset. That last device is set to launch on December 9, but it's expected to be exclusive to China."
  ],
  "headers": {
    "3": "The latest to reveal"
  },
  "links": {
    "Snapdragon 8 Gen 1": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "Weibo": "https://weibo.com/liuzuohu",
    "Oppo Find X4": "https://www.techradar.com/news/oppo-find-x4",
    "Realme GT 2 Pro": "https://www.techradar.com/news/realme-gt-2-looks-weirdly-like-the-google-pixel-6-according-to-leaked-renders",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12"
  }
}