{
  "source": "https://www.techradar.com/news/foundation-episode-10-recap-clone-wars-and-family-reunions",
  "title": "Foundation episode 10 recap: clone wars and family reunions",
  "category": "entertainment",
  "updated": "2021-11-19T12:00:51Z",
  "author": "tom-power",
  "summary": "Major Foundation episode 10 spoilers follow",
  "article": [
    "Huge spoilers follow for Foundation episodes 1 to 10. You’ve been warned.",
    "It’s been more than three years since Apple took a gamble and announced its TV adaptation of Isaac Asimov’s Foundation book series. The complex nature of Asimov’s seminal works led many to believe it was unadaptable and, given how much Apple TV Plus’ latest big-budget show has diverged from its source material, you could argue that those initial beliefs were correct.",
    "The Leap – Foundation episode 10’s actual title – seems allegorical, then, given the leap of faith that Apple took in greenlighting David S. Goyer’s small-screen adaptation. But it’s been justified, with Foundation growing stronger with each passing week.",
    "Wrapping up a season’s worth of plot threads while also laying the groundwork for season 2 may have been difficult for Goyer and company to pull off. After all, plenty has happened across its multiple storylines. However, Foundation episode 10 does a great job at both, delivering last-minute shocks and glimpses into the show’s future narrative arcs.",
    "So what’s the state of play on Trantor? The Leap picks up where episode 9 left off, with Brother Day, having returned from Maiden, meeting with Brother Dusk to discuss the fate of Brother Dawn and Azura.",
    "The conversation is tense, with Dusk strongly advising that the pair should be killed for their crimes. He goads Day for leaving, too, but Day bats away Dusk’s thorny comments with relative ease.",
    "Day’s mettle is tested more when he meets Dawn afterward. Playing the good and bad cop, Day removes Dawn’s handcuffs before chastising him for conspiring with the enemy. Dawn bites back saying it’s Cleon I’s fault – that is, his desire to create a clone army to rule the Galactic Empire long after his death – for originally putting them in this unsolicited position.",
    "It’s a valid point. The themes of choice and fate have been revisited time and again throughout Foundation. While Dawn and Day wouldn’t exist if they hadn’t been created by Cleon I’s cloning program, they clearly question their place in the universe based on what they’ve experienced in season 1. They appear to be going through an existential crisis, which is unexpected for clones that don’t possess free will or a soul.",
    "All of this makes for a pretty emotional scene and, given that their shared screen time has been limited so far, it’s also enjoyable to see Lee Pace and Cassian Bilton trade barbs. It feels like an argument a father and son would have – a point forced home by Dawn’s claim that he’s longed to call Day his ‘father’, even though they’re both clones of the same man. If that’s not an unsettlingly warped relationship, we don’t know what is.",
    "Instead of taking his frustrations out on Dawn or Dusk, it’s Azura who bears the brunt of Day’s pent-up anger later on.",
    "Initially, Day walks a similar good cop, bad cop line with Azura as he did with Dawn, but it doesn’t last. Mocking her about the so-called legacy she’ll leave behind, Day eventually reveals how he’ll punish her for her crimes: every person that Azura has ever known, including her family, friends, former lover and colleagues, will be killed. That amounts to 1551 innocent people! With a flick of Day’s wrist, the horrifying deed is done. Everyone Azura loved is wiped out in an instant – upon her own death, then, her legacy dies with her.",
    "It’s an incredibly ruthless decision. Does the punishment fit the crime? In Day’s eyes, yes. And, as viewers, you can kind of understand his stance from a ‘preserving the status quo’ perspective. Still, it’s extremely harsh and is a reminder of the totalitarian attitude of the Empire’s rulers.",
    "As for Azura? She’s locked away, constrained by shackles to stop her from committing suicide, and sensory shrouded for the rest of her days. Oh, and she’ll be kept alive by an intravenous drip. So that’s the last we’ll see of her.",
    "And yet that isn’t even the biggest jaw-dropping moment to occur on Trantor. Two more big shocks arrive in this narrative’s last main sequence, both setting up some tantalizing plot threads to be explored in the future.",
    "With Azura’s fate sealed, it’s Dawn’s turn to face the music. Brought before his elder ‘brothers’, Dawn is told by Dusk that, due to his differences and transgressions, he’d already be dead if it was up to Dusk. With Day presiding over the Empire’s key middle throne, though, it’ll be him that decides Dawn’s fate.",
    "Astonishingly, Day reveals that Dawn will be allowed to live. Delivering his verdict, Day suggests that his Great Spiral walk and meeting with other pilgrims on Maiden (which we saw in episode 8) did leave a lasting impression on him. He also explains that Halima’s doctrine – “a soul incapable of change is a soul doomed to stagnation” – and Hari Seldon’s take on a similar belief system earlier in season 1 have reshaped how he views the Cleonic dynasty. Change, as Day puts it, is a good thing and it’s time for the clones to embrace it.",
    "Furious, Dusk blasts Day for destroying Cleon’s legacy, and egotistically claims that history should bow to them. The duo fight as Dawn cowers in Eto Demerzel’s arms. It’s clear that Day, who was Brother Dawn in episodes 1 and 2, was deeply affected by events he saw in those entries, hence his empathetic stance towards Dawn.",
    "It’s a courageous stance to take but, ultimately, one that doesn’t matter. As Day and Dusk row, Demerzel snaps Dawn’s neck, killing him instantly. As a stunned Day and Dusk watch on, she tells them that she’s loyal to the Cleonic dynasty and, as such, their pure bloodline must be maintained. Dawn, then, had to die.",
    "Shocking as it is, it’s the culmination of events that have festered for some time. Ironically, it’s Demerzel’s programming, rewired so that she’s loyal to the Empire, that condemned Dawn to death. It also speaks to how much faith she’s lost in Day after their Maiden trip. Symbolically, it’s representative of a father losing his son, too: we saw how familial Day and Dawn’s relationship was earlier in episode 10 and Day’s distress at Dawn’s death is further evidence of this.",
    "Distraught, Day burns Dawn’s body using the Empire’s disintegration device, before Shadow Master Obrecht arrives with more bleak news.",
    "As it happens, Azura’s gang didn’t just change Dawn’s genetic makeup – they altered every clone’s DNA, meaning that Day and Dusk could also be impure. Enraged, Day destroys the original Cleon’s glass tomb, symbolizing the start of the Cleonic dynasty’s destruction. Meanwhile, Dusk wrecks Dawn’s part of the Empire’s mural, and Demerzel rips off her human face in anguish for what she’s done, revealing her subsurface robotic makeup. Fault lines have formed in the Empire’s usually tight-knit group and they may never be the same again.",
    "By contrast, things on Terminus couldn’t be more harmonious. Following his release from the Vault, Hari Seldon’s digital construct tells the assembled Terminus, Thespis and Anacreon crowd (and viewers by extension) why the latter two have been at odds for thousands of years. Simply put, Cleon’s first clone – Cleon II – killed Anacreon’s grand huntress millennia ago and blamed it on Thespis’ king to pit the planets against one another. That, Hari explains, prevented both kingdoms from leading a revolution against the Empire, which maintained the latter’s hold on everyone they continue to rule.",
    "Next, Hari explains why he’s an AI construct of his former self. It’s a pretty convoluted explanation but, basically, the night before Raych murdered him, he swallowed a pill that contained millions of tiny self-replicating machines (we see Hari ingest the pill in episode 2). Upon his death and ejection from the Foundation’s main ship, these machines rebuilt his body with synthetic and natural materials to turn him into a digital construct.",
    "It’s a lengthy exposition dump, but it’s necessary to understand Hari’s master plan. He adds it was always his plan to unite Terminus, Thespis and Anacreon. Now that they have the Invictus, they can use it to trick the Empire into thinking that the planets wiped each other out. This means that they’ll no longer concern themselves with what’s actually happening on all three worlds. That, Hari says, means that the trio of planets are free of Imperial rule and they can start building a fleet of battleships to go to war with the Empire in the distant future.",
    "Admittedly, it’s all a bit fanciful from a plot perspective. Clearly, Hari is a very intelligent man with the ability to foresee things: it’s psychohistory, after all, which he’s studied extensively.",
    "Not for the first time, though, Foundation installs him as some messianic figure who’s 10 steps ahead of the Empire and, as such, his plan can’t fail. That reduces the stakes somewhat leading into season 2 and beyond, then, as we know everything has already been mapped out by Hari. Of course, any future Seldon Crises could throw a wrench in the works. But, for now, it’s slightly absurd that one man’s predictions hold the key to overthrowing a tyrannical dynasty that’s ruled for centuries.",
    "Regardless, inspired by Hari, the three races band together and, over the next few months, set his plan in motion.",
    "For Salvor Hardin, though, questions remain. Having asked Hari about why he’s been guiding her in her dreams before he returns to the Vault – he has no answers for her – Salvor is none the wiser about why she’s special.",
    "That is, until she has another vision months later. Salvor deduces that the two children she’s seen in her visions are Raych and Gaal and, following a conversation with her mother Mari, realizes that she must be Raych and Gaal’s child. Back in episode 2, we watched Gaal put her embryo in cryostasis. After Gaal is jettisoned from the Foundation’s main ship during episode 2’s finale, Mari ends up being a surrogate for Gaal’s embryo – i.e. Salvor.",
    "Salvor decides to search for Gaal to get answers about her abilities, but not before she has touching goodbyes with Mari and Hugo. Based on these farewells, you get the sense that Salvor may never see them again. And that’s definitely the case, based on how Foundation’s season 1 finale ends.",
    "Episode 10’s final sequence reunites us with Gaal. Her stasis pod, which left the Raven spaceship in episode 7, touches down on Synnax and she uses a self-assembling canoe to sail back home.",
    "Tragically, though, her entire village has been destroyed. As Gaal had predicted earlier in the season, Synnax’s rising oceans would destroy its inhabitants if they didn’t change their habits, and that’s what plays out. It’s a poignant moment: much like Demerzel, it seems that Gaal is the last of her kind.",
    "Or so she thinks. A light catches her eye beneath the surface and, swimming down, Gaal discovers another stasis pod with someone inside. Rescuing the unknown individual, she takes them topside with the view of waking them up.",
    "The following night, the individual wakes up and recognizes Gaal. Perhaps unsurprisingly, the person who was in the pod is none other than Salvor, who explains that she’s been asleep for over a century waiting for Gaal. She reveals that she’s Gaal’s daughter and then, removing her blanket, that she’s in possession of Hari’s Prime Radiant. She goes to hand it to Gaal but, after the camera switches to a wide shot, the screen cuts to black. If nothing else, it’s exciting to see two of Foundation’s main characters finally meet. And we suspect that their journey together will form a major part of Foundation season 2.",
    "The Leap is an enthralling final entry in Foundation’s first season. It simultaneously puts a cap on the series’ most tantalizing storylines and lays the foundations for plot points still to come. For a show that makes a big deal about some of its characters’ abilities to see into the future, that latter aspect will only become increasingly more important in season 2 and beyond.",
    "If the past 10 entries have taught us anything, it’s that every word uttered or action taken has a purpose to it. And, as a culmination of everything that’s come before, Foundation episode 10 proves this to be the case. Everything in this show has a consequence, or a cause and effect, and that’ll continue to be a key strength of Apple’s adaptation moving forward.",
    "It’ll be interesting to see where season 2 takes these characters and the direction that its plot goes in. Aside from a few key story elements, Foundation has fully diverged from the source material – so much so that it’ll be difficult to relate back to Asimov’s works in the future. Apple's adaptation has become its own thing at this point but, as it charts its own path forward, it remains to be seen whether that’ll be a good or bad thing.",
    "For now, Apple can take comfort in the fact that Foundation’s first season was an overall success. Lacking Hari and Gaal’s foresight, it’s impossible for us to determine where Foundation goes from here. And that, whichever way you look at it, is exciting.",
    "Foundation will return on Apple TV Plus for its second season. No release date has been confirmed as yet."
  ],
  "headers": {
    "34": "Our verdict",
    "38": "Foundational facts"
  },
  "links": {}
}