{
  "source": "https://www.techradar.com/news/jbl-unveils-noise-cancelling-wireless-earbuds-to-rival-the-apple-airpods-pro",
  "title": "JBL unveils noise-cancelling wireless earbuds to rival the Apple AirPods Pro",
  "category": "audio-visual",
  "updated": "2021-01-07T14:10:11Z",
  "author": "olivia-tambini",
  "summary": "The new wireless earbuds were announced during CES 2021",
  "article": [
    "CES 2021 may have moved online this year, but there are still plenty of product announcements to get excited about – not least the latest wireless earbuds from JBL, which come with active noise cancellation to rival the likes of the Apple AirPods Pro and the Sony WF-1000XM3.",
    "The JBL Live Pro+ boast adaptive noise cancellation as well as a 'Smart Ambient' mode, which allows you to hear your surroundings without removing the earbuds – handy if you need to have a quick conversation and don't want to interrupt your music. There's also an auto-pause feature, which means your music will stop as soon as you take out your buds.",
    "Your calls should sound clear too, thanks to three inbuilt microphones with echo-cancelling technology, while controlling your playback can be done hands-free with support for Google Assistant and Alexa.",
    "An IPX4 water-resistance rating means you should be able to work out using the JBL Live Pro+ without worrying that a little sweat or rain will cause them to stop working. Meanwhile, battery life comes in at seven hours of playback from the buds themselves, with a further 21 hours provided by the wireless charging case – that's longer than the AirPods Pro, though not the best battery life we've ever seen.",
    "At £169.99, they're cheaper than Apple's premium earbuds too – though you'll have to wait until April to get your hands on them. Global pricing is still to be confirmed, but that works out at around $230 / AU$300.",
    "The new wireless earbuds are joined by two more noise-cancelling models, including a pair of over-ear headphones and a pair of on-ear headphones.",
    "The JBL Live 660NC over-ear headphones come with up to 40 hours of battery life with ANC turned on, jumping to 50 hours when that feature is switched off, making them ideal for commuting (or more likely these days, working from home).",
    "If you tend to switch between your laptop and smartphone when it comes to music playback, support for multi-point connectivity should make listening on multiple devices hassle-free.",
    "Like the JBL Live Pro+, these noise-cancelling cans support Google Assistant and Alexa, either via voice commands or by pressing and holding one of the earcups. However, the JBL Live 660NC are slightly cheaper than their true wireless counterparts, and will set you back £159.99 (about $220 / AU$280) when they're released in March.",
    "If you prefer the on-ear form factor there's the JBL Live 460NC, the cheapest headphones in the new line-up at £119.99 (about $160 / AU$210). Despite the lower price, they still come with adaptive noise cancellation, JBL's Smart Ambient mode, support for voice assistants, and up to 50 hours of battery life.",
    "So far, the brand hasn't revealed much about the kind of audio performance we can expect from any of the new noise-cancelling headphones – aside from saying that they'll come with JBL's 'Signature Sound'.",
    "We're hoping for good things. JBL has a long and pretty distinguished history in the world of home audio (and beyond – its speakers powered Woodstock in 1969), and many of the JBL headphones we’ve tested recently have impressed."
  ],
  "headers": {
    "5": "Signature sound"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "on-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-on-ear-headphones-1304537",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490"
  }
}