{
  "source": "https://www.techradar.com/news/google-pixel-5-and-older-phones-can-now-read-your-heart-rate",
  "title": "Google Pixel 5 and older phones can now read your heart rate",
  "category": "phones",
  "updated": "2021-03-09T09:26:23Z",
  "author": "james-rogerson",
  "summary": "Through their cameras",
  "article": [
    "The Google Pixel range has just picked up a useful new skill, as from this week (March 8), supported models are getting an update that allows them to read your heart rate and respiration rate through the Google Fit app.",
    "Google has already announced this feature, but the information that it’s coming now specifically comes from Android Police where Google confirmed the feature is rolling out from now. Bear in mind it may take a while, so it might be several days before all compatible handsets get the update.",
    "In any case, once the feature’s enabled, your Pixel will be able to measure your heart rate when you place a fingertip over the rear camera, by analyzing color changes in your skin to pick up a reading, and Google claims this is accurate to within 2%.",
    "For your respiration meanwhile you’ll need to have your head and torso in view of the front-facing camera, and it will monitor your chest movements to assess how many breaths you take per minute. This Google claims is accurate to within one breath per minute.",
    "It’s not totally clear which Pixel phones these features are actually coming to. They’re headed to “supported” phones, which presumably means ones that Google still supports. In which case, those with a Pixel 3 through Pixel 5 can expect to get it, but Google hasn’t actually named every compatible model.",
    "Pixel phones are just the start though, as after an undefined period of exclusivity these features will be made available to other phones too – though it will presumably be down to individual device manufacturers to support them.",
    "Of course, if you really care about tracking your heart and respiration rates, you’re probably better off with a dedicated fitness tracker or a smartwatch, as they in many cases can constantly and automatically monitor these things. But for the occasional reading this update could certainly prove useful."
  ],
  "headers": {},
  "links": {
    "Google Pixel range": "https://www.techradar.com/news/best-pixel-phones",
    "Android Police": "https://www.androidpolice.com/2021/03/05/pixels-get-that-fancy-new-camera-based-heart-and-respiratory-rate-monitor-on-monday/",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers"
  }
}