{
  "source": "https://www.techradar.com/news/6g-is-a-trillion-dollar-opportunity-for-the-mobile-industry",
  "title": "6G is a 'trillion dollar' opportunity for the mobile industry",
  "category": "phones",
  "updated": "2021-02-22T14:26:40Z",
  "author": "steve-mccaskill",
  "summary": "If you like 5G, you'll love 6G",
  "article": [
    "The development and deployment of 6G networking technology represents a “trillion dollar opportunity” for the mobile industry according to a new study.",
    "The immediate focus in the mobile industry is the rollout of 5G phone technology but the race to be the leader in the even more nascent field of 6G has already begun.",
    "China has already started its research and development activities, while the €251 million 6Genesis programme is already well underway in Northern Finland. The US also has 6G ambitions.",
    "IDTechEX believes the market for new applications, devices, and network infrastructure (such as smart surfaces and satellites) to support 6G will drive business across the industry.",
    "Although it is too early predict the final form the 6G standard will take and which technologies will be included, there are some plausible assumptions about its capabilities and the challenges that operators, manufacturers and researchers face.",
    "Naturally, 6G networks will deliver huge advances in speed, capacity, and low latency, while it is also expected they will be much more intelligent and reliable. This will deliver superior mobile broadband but also enable advanced services such as truly immersive extended reality (XR), high-fidelity mobile holograms and digital twins.",
    "Central to these applications will be the ability of 6G to compensate for current constraints – such as the limited processing capability of mobile devices – and the integration of intelligence into the network.",
    "IDTechEX says that if the most ambitious targets are met, then 6G will offer 100 times the capacity of 5G and will be able to support 10 million devices per square kilometre.",
    "Signals would extend 10,000 metres above the surface, enabling ‘3D coverage’ in the skies, space and underwater. All these capabilities would allow for intelligent sensing, positioning, edge computing, and high-definition imaging.",
    "However, one of the biggest challenges is likely to be spectrum. 6G will use even higher frequencies in order to maximise the capacity gains, but it is probably that sub-THz airwaves will be used in the initial phase because they are far more familiar.",
    "Experiments with 1THz will continue but such frequencies are narrow, weak and are stopped by almost any object. A more likely use for this spectrum will likely be local and satellite connections, with smart surfaces used to reflect signals.",
    "“That upper, ultimate THz frequency is unlikely to be higher than 1THz because, just after that, atmospheric attenuation of the beam jumps up to severe levels, and components also become extremely challenging,” said the analysts.",
    "Other predictions claim 6G will use THz spectrum to deliver terabit speeds and anticipate the first commercial networks will be launched by 2030. But just as 5G will take some time to usurp 4G, 6G will unlikely become the dominant standard until later in the decade."
  ],
  "headers": {
    "3": "6G potential"
  },
  "links": {
    "6G": "https://www.techradar.com/news/6g",
    "5G phone": "https://www.techradar.com/best/best-5g-phones"
  }
}