{
  "source": "https://www.techradar.com/news/snapchat-deals-with-sony-music-to-add-to-snaps",
  "title": "Snapchat agrees deal with Sony Music to add your favorite artists to a snap",
  "category": "computing",
  "updated": "2021-11-16T11:15:10Z",
  "author": "balakumar-k",
  "summary": "More tracks in a Sony snap",
  "article": [
    "Snapchat has agreed a deal with Sony Music Entertainment to include its artists’ music in the app’s library for creators to use in their video creations. Snap now has tie-ups with three top music labels - Sony Music, Warner Music and Universal Music.",
    "After Snap redesigned its app to a less than positive reception in 2018, users flocked to Instagram and TikTok to share their short content. But Snap has seen something of a renaissance in recent years, with an improved design and a new focus on students and teenagers, which has resulted in Snapchat avoiding irrelevance.",
    "With music now being an option for snaps and only growing, this new deal will allow Snapchat users to unleash their creative potential through huge library of music, and also help artists to get more direct promotional benefit in the app.",
    "\"With over 200 million Snapchatters engaging with augmented reality every day, we know they love using our Lenses to express themselves.\" Snap said in its announcement. \"So we’re expanding the music experience on Snapchat by adding Sounds into our AR Lenses available in the Lens Carousel and experimenting with new formats.\"",
    "Sony Music had previously used Snap’s AR tools as part of a partnership for the launch of Kygo’s collaboration with Whitney Houston for her unreleased version of Higher Love.",
    "Snapchat’s Sounds feature, which lets users add music to their Snaps, was launched in October last year.",
    "Videos created with music from Sounds on the platform have collectively resulted in nearly 1.2 billion videos that have had around 77 billion views. Nearly 40% of videos created with music from Sounds were shared directly with friends through chat.",
    "Snap's competitor TikTok is also using music as an important part of the app experience. So it makes smart sense for Snap provide more engaging music-related options.",
    "Snap is also working on two new lens products that will incorporate new music formats and tools.",
    "\"Rolling out soon, we’ll feature Sound Lenses with a pre-selected song embedded into the Lens, a Lens that transforms pictures of anyone to appear as if they are singing a song,\" Snap said.",
    "The second feature is Cameo Sound Lenses that apply visual effects to put users and their friends as the stars of their own animated music video. To find Lenses with Sounds, users need to look for Lenses that have a musical note icon on the Lens icon.",
    "\"These new Sound Lenses will make for a more immersive music experience, and open a proven and powerful way for artists to share music on Snapchat,\" it added.",
    "Snap did something that few social media companies achieved - carved its own niche after almost crashing and burning.",
    "It's no understatement that its redesign in 2018 turned away a lot of users, with the user interface making it harder to share content with friends and family, alongside additional taps to access other options, adding to more frustrations.",
    "But with a focus on younger users, an updated design and high advertising revenue in recent years, Snapchat shows no sign of fading away.",
    "Deals with the music heavyweights only adds to this. While you could already do this with Instagram Stories and TikTok, seeing Sony agree to a deal with Snap only shows that its aware of Snapchat's young userbase, in-turn helping users find and use their favorite artists to snaps.",
    "While Instagram lets you view and post content on a web browser, Snap currently has no plans to do the same, but it could be a benefit, especially if it's just to view content on an iPad or Surface tablet.",
    "However, Snap are currently making the right decisions, so time will tell if we will see the app grow even more, or perhaps be bought by another company to help it take on Instagram or TikTok."
  ],
  "headers": {
    "3": "More music-related options from Snap soon",
    "8": "New lens features are incoming",
    "12": "Analysis: Snap is still winning its comeback tour"
  },
  "links": {
    "Snapchat": "https://www.techradar.com/news/snapchat-is-down",
    "less than positive reception": "https://www.techradar.com/news/snapchats-redesign-is-not-the-end-of-the-world",
    "Instagram": "https://www.techradar.com/how-to/get-instagram-dark-mode",
    "TikTok": "https://www.techradar.com/news/tiktok-is-now-the-most-downloaded-app-worldwide",
    "its announcement": "https://newsroom.snap.com/en-GB/sounds-sony",
    "view and post content on a web browser": "https://www.techradar.com/news/instagram-will-finally-let-you-post-a-photo-or-video-on-the-web"
  }
}