{
  "source": "https://www.techradar.com/news/microsoft-surface-pro-7-is-a-2-in-1-designed-for-remote-learning-and-work",
  "title": "Microsoft Surface Pro 7+ is a 2-in-1 designed for remote learning and work",
  "category": "computing",
  "updated": "2021-01-11T15:06:17Z",
  "author": "carly-page",
  "summary": "Faster, 4G-enabled device will enable more flexibility",
  "article": [
    "Microsoft has introduced the Surface Pro 7+ for Business, a device designed to support customers' growing need for flexibility.",
    "Unveiled at CES 2021, the Microsoft Surface Pro 7+ for Business is a device built to for the future of working and learning, which Microsoft says requires more flexibility with employees now commonly working remotely and sharing limited space with others.",
    "According to figures cited by the firm, 82% of managers say they will have more flexible work from home policies post-pandemic.",
    "In a bid to fuel productivity, the upgraded Surface Pro 7 is three times faster than the previous model, according to Microsoft. It packs Intel's new 11th-gen processors up to the Core i70116G57, which also equips the 2-in-1 with Intel Xe graphics, and boasts up to 15-hours of battery life from a single charge.",
    "Unlike the original, the Surface Pro 7+ also features optional LTE Advanced to facilitate more flexible working, a removable SSD to give users more control over their data, and support for the latest Wi-Fi 6 standard.",
    "As a device designed for businesses and educators, the Surface Pro 7+ will ship with Windows 10 Pro, equipping the laptop-tablet-hybrid with Microsoft 365 Apps and a 30-day free trial to Microsoft 365 Business Standard or Microsoft 365 Business Premium.",
    "Elsewhere, it’s business as usual. The Surface Pro 7+ for Business ships with the same 12.3-inch PixelSense display as its predecessor, and it sports the same flexible chassis that enables it to transform between tablet, laptop and drawing modes. You'll also find both a 5MP front camera and 8MP rear camera for high-quality video calls, stereo speakers with Dolby Atmos support, and both USB-A and USB-C ports,",
    "The Surface Pro 7+ for Business, which will be available in Platinum and Matte Black options, will be available from $899 (£660, AU$1,160) in a Wi-Fi only configuration, while pricing for the LTE Advanced model begins at $1,149 (£850, AU$1,480).",
    "The device is available for commercial and education markets in Asia, Europe and North America starting to buy today, with shipping set to begin this week."
  ],
  "headers": {},
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Intel's new 11th-gen processors": "https://www.techradar.com/news/intel-11th-generation-processors-launch-window-may-have-just-leaked-from-msi",
    "Wi-Fi 6": "https://www.techradar.com/news/the-real-benefits-of-wifi-6"
  }
}