{
  "source": "https://www.techradar.com/news/microsoft-teams-20-is-set-for-some-huge-changes-on-windows-11",
  "title": "Microsoft Teams 2.0 is set for some huge changes on Windows 11",
  "category": "computing",
  "updated": "2021-06-25T12:09:22Z",
  "author": "mike-moore",
  "summary": "Microsoft reveals a whole new engineering platform for Teams 2.0",
  "article": [
    "Microsoft Teams is getting a major overhaul for the release of Windows 11, the company has revealed.",
    "With the video conferencing service set to play a much more central role in the new software when it rolls out later this year, more details have emerged about what the next generation of Microsoft Teams will look like.",
    "Namely, it seems that Microsoft has given the service a major revamp, including a whole new engineering base that it hopes will make Teams more intuitive and easier to use.",
    "The upgrade was detailed on Twitter by Rish Tandon, CVP Engineering for Microsoft Teams, who revealed that the company is moving from the Electron platform to Edge Webview 2, and also switching from Angular to \"100%\" on React.js for the new version of Teams.",
    "\"With this change, we are taking a major step in #MicrosoftTeams Teams architecture,\" Tandon noted, adding that Teams will remain a hybrid app, but one that is powered by Edge.",
    "He went on to note that the change will mean to what he called, \"Microsoft Teams 2.0\", which will consume half the memory of the same consumer account than the current platform. It will also allow the software to support features such as multiple accounts, work-life scenarios, release predictability, and the ability to quickly scale up for those clients that need it.",
    "\"It will be a journey but with #Windows11 we have taken key first steps,\" Tandon concluded.",
    "The news came after Microsoft Teams was given particular focus in the Windows 11 launch event - with the app now being built directly into the taskbar.",
    "Users will now be able to launch into chats and calls with a single click or touch via an icon in the taskbar positioned in the middle of the screen, similar to the macOS dock. From here, users will also be able to perform actions such as muting their microphone and launching into a presentation.",
    "The launch could mean the end for Skype, with the much-loved video calling platform seemingly done for following the growth of Teams. Although the consumer version of Skype will remain active for now, Skype for Business Online will be retired by July 31 2021, after which date business customers will be forced to migrate to Microsoft Teams.",
    "Windows 11 will be available as a free upgrade for qualifying Windows 10 PCs and will begin rolling out in the winter.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Microsoft Teams 2.0"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "detailed on Twitter": "https://twitter.com/rishmsft/status/1408085784016539653",
    "Microsoft Teams was given particular focus": "https://www.techradar.com/news/windows-11-will-make-microsoft-teams-impossible-to-ignore",
    "MSPowerUser": "https://mspoweruser.com/microsoft-teams-will-be-abandoning-electron-with-big-improvements-expected/"
  }
}