{
  "source": "https://www.techradar.com/news/avira-now-lets-you-secure-your-mac-with-one-click",
  "title": "Avira now lets you secure your Mac with one click",
  "category": "computing",
  "updated": "2021-11-11T13:37:44Z",
  "author": "anthony-spadafora",
  "summary": "New all-in-one security solution comes in both a free and paid version",
  "article": [
    "The German cybersecurity company Avira has released a new all-in-one security solution for Mac that is available in both a free version as well as a premium version.",
    "Avira Security for Mac blocks and removes threats, enables safe browsing, includes real-time protection for shopping and payments and protects user data with VPN encryption. Avira has also redesigned its new security solution from the ground up and its is built using the latest Apple Swift, SwiftUI and Combine frameworks alongside its own protection technologies which include SAVAPI and APC.",
    "VP of product at Avira, Stephan Brenner explained that Avira Security for Mac can already run natively on Apple's new M1 Macs in a press release, saying:",
    "\"Combining Avira's protection engine with Apple's own technology makes the product a powerful, fast and future-proof security application that runs smoothly on macOS. Most of the application's components already run natively on the latest Apple Silicon M1 processors, and we are expecting to update the app to run fully native to Apple Silicon in the near future.”",
    "Regardless of whether you're a Free user or upgrade to the paid version called Prime, Avira Security for Mac offers a wide range of security features from a single interface powered by a one-click Smart Scan.",
    "Avira's Smart Scan is able to detect and block viruses, delete unwanted cookies and flag any other issues found on your Mac. As it's an all-in-one solution, Avira Security for Mac includes an antivirus, VPN, password manager, cookie cleaner and a junk cleaner to detect old and unused files. The software also includes a dark mode and a light mode so you can check in on your system regardless of the current lighting conditions.",
    "The free version of Avira Security for Mac does not contain any advertising and it can protect against viruses and threats in real time. However, users that need advanced online privacy and performance features such as Avira's Tracker Remover and Junk Cleaner can sign up for a Prime subscription which also unlocks the company's unlimited VPN and password manager.",
    "Avira's Prime subscription costs €99.95 per year (around $118) and for the price it can protect up to five devices running Windows, Mac, Android or iOS."
  ],
  "headers": {
    "4": "Smart Scan"
  },
  "links": {
    "Avira": "https://www.techradar.com/reviews/avira-2020-antivirus-solutions",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "M1 Macs": "https://www.techradar.com/news/apple-m1-chip",
    "press release": "https://www.prf.hn/click/camref:1011ldAfo/pubref:trd-us-8574804324235023000/destination:https%3A%2F%2Fwww.avira.com%2Fen%2Fpress%2Favira-security-for-mac-en",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "password manager": "https://www.techradar.com/best/password-manager"
  }
}