{
  "source": "https://www.techradar.com/news/why-the-xbox-series-s-is-the-perfect-covid-travel-companion",
  "title": "Why the Xbox Series S is the perfect staycation companion",
  "category": "gaming",
  "updated": "2021-08-07T14:00:00Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Microsoft’s Xbox Series S is surprisingly portable",
  "article": [
    "I never thought of the Xbox Series S as a portable console – and fundamentally, it isn’t designed to be one. But after taking Microsoft’s smallest ever Xbox with me on holiday, it’s actually far more viable than you might think.",
    "In fact, I was rather shocked by just how easy it is to pack up the Xbox Series S and take it on the move. And while it obviously won’t be a replacement for the Nintendo Switch or upcoming Steam Deck, it’s suddenly become my go-to console whenever I know I’m going to be away for a few nights. At least for now...",
    "As it stands, Covid-19 travel restrictions continue to make the idea of hopping on a plane an anxiety-inducing and costly event that I’d rather do without. That’s why since the pandemic, my holidays have centered around booking nearby staycations, instead of sunning myself on a sandy beach with a cocktail in hand.",
    "Even though a change of scenery is always welcome, it’s hard not to miss your home comforts when you are basically staying in… well... just another home, albeit a fancier one. And with no pool, beach or hotel entertainment to preoccupy me in the evenings, taking the Xbox Series S on holiday suddenly made sense. After all, I knew that there would be a TV, one which would hopefully have an HDMI port.",
    "What’s more, I’ve also stayed at quite a few places which didn’t have Netflix or Amazon Video available, so being able to leave my laptop behind and watch my favorite programs on a bigger screen is also something that the Xbox Series S could provide.",
    "With the Xbox Series S essentially being made up of four parts: the console, power lead, HDMI cable and a controller, I found that three of these components could be handily stored in my headphone’s travel case. It meant that I only needed to worry about transporting the console safely, something which a discarded Amazon box did the job of perfectly.",
    "I’ll admit that sticking the Xbox Series S in a cardboard box wasn’t the most glamorous solution, but you can buy some lovely little cases that are specifically designed to transport your Xbox Series S more safely (though nothing is as cool as the Microsoft Flight Simulator Xbox Series S luggage).",
    "Before I knew it, then, I had the Xbox Series S packed up and ready to go in a matter of minutes. Once I reached my destination, it was simply a case of unpacking the console, plugging in the necessary cables and voilà, my evenings were now sorted.",
    "Once I’d connected to the Wi-Fi, the way Xbox handles cloud saves meant that my progress from Xbox Series X was synced to the Xbox Series S in a couple of seconds, and with the Seagate Xbox Storage Expansion Card, I had countless more games available as soon as I plugged in Microsoft’s proprietary SSD into the back of the console. From Gang Beasts and Octopath Traveler to Gears Tactics and FIFA 21, being able to game away from home was a luxury that I’m keen to repeat in the future.",
    "Of course, one factor that could hinder your enjoyment of your Xbox Series S on holiday is the quality of TV that you’ll find at your destination. Thankfully, my staycation had a surprisingly decent 1080p JVC television, which after a bit of calibrating (yeah, I have a bad habit of tweaking other people’s TVs) looked great.",
    "Unfortunately, that won’t always be the case, but soon even this problem could be circumvented. The recently backed xScreen display on Kickstarter might turn the Xbox Series S into the ultimate portable console, as it lets you attach an 11.6-inch 1080p 60Hz display. Created by a company called UPSpec Gaming, it sits flush with the edge of the console, and only adds an extra 1.5 pounds (695g) to the overall weight of the Xbox Series S.",
    "While I’d definitely opt for the Nintendo Switch or Steam Deck when I’m brave enough to fly again, if you’re an Xbox Series S owner, don’t discount Microsoft’s svelte white box as the system to take on your next vacation."
  ],
  "headers": {
    "5": "Movin’ out",
    "9": "Screen time"
  },
  "links": {
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Amazon Video": "https://www.techradar.com/best/best-amazon-prime-movies",
    "HDMI cable": "https://www.techradar.com/best/hdmi-cables-extension-price",
    "buy some lovely little cases": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fs%3Fk%3Dxbox%2Bseries%2Bs%2Bcases%26ref%3Dnb_sb_noss_1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-6035896803978450000-21",
    "Microsoft Flight Simulator": "https://www.techradar.com/reviews/microsoft-flight-simulator",
    "Xbox Series S luggage": "https://twitter.com/XboxANZ/status/1419839990268186624?s=20",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Seagate Xbox Storage Expansion Card": "https://www.techradar.com/reviews/seagate-xbox-storage-expansion-card-review/reviews/seagate-xbox-storage-expansion-card-review",
    "Octopath Traveler": "https://www.techradar.com/news/one-of-the-best-nintendo-switch-games-is-coming-to-xbox-game-pass",
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "xScreen display on Kickstarter": "https://www.kickstarter.com/projects/xscreen/xscreen-for-xbox-series-s",
    "turn the Xbox Series S into the ultimate portable console": "https://www.techradar.com/news/this-device-could-turn-your-xbox-series-s-into-the-ultimate-portable-console"
  }
}