{
  "source": "https://www.techradar.com/news/this-could-be-the-most-powerful-linux-laptop-yet",
  "title": "This could be the most powerful Linux laptop yet",
  "category": "computing",
  "updated": "2021-05-22T05:00:56Z",
  "author": "mayank-sharma",
  "summary": "High quality display paired with some impressive components",
  "article": [
    "German hardware vendor Tuxedo computer has launched a new line of Linux laptops with some eye-popping features.",
    "One of the standout features of the sixth generation of the InfinityBook Pro 14 laptop series is its 3K resolution 14-inch display in a 16:10 aspect ratio.",
    "The laptop is available in two processors from Intel’s 11th Gen Tiger Lake series, the i5-1135G7 and the Core i7-1165G7. The base model ships with 8GB of 3200Mhz RAM, but can take upgrades of upto 64GB.",
    "Similarly, the storage starts with a single Samsung 970 EVO Plus 250 GB NVMe PCIe SSD, but can be upgraded all the way to a 2TB Samsung 980 PRO. Or, perhaps add another of these in the second PCIe slot.",
    "Rounding up the premier features are the full-featured USB-C 4.0 port that offers Thunderbolt 4 with DisplayPort 1.4. Together with the HDMI 2.0 port the laptop can drive up to four displays at the same time.",
    "By default, the laptop ships with Tuxedo’s Ubuntu-based OS with the Budgie desktop environment, though a vanilla Ubuntu 20.04 LTS option is available too.",
    "Advanced users can also use Tuxedo’s WebFAI utility to install openSUSE in an automated fashion. Outside of the utility you can of course install any Linux distro of your choice.",
    "For connectivity, there’s Intel Wi-Fi 6 AX200, which also integrates a dual-mode Bluetooth 5.1. Besides this you get the standard complement of ports including a USB-C 3.2 port, two USB-A ports, a 2-in-1 audio jack, and an SD card reader.",
    "The premier laptop series is housed in a deep grey magnesium chassis and weighs about 2.2 lbs (1kg).",
    "Tuxedo offers fairly comprehensive customizable options for the laptop including the option to have your own logo lasered on to the display lid.",
    "The base model, equipped with a 2K display, 8GB RAM, 250GB SSD, and an Intel i5 processor costs €1,249. A 3K model with Intel i7 processor, 32GB RAM, and a 1TB SSD comes to about €1,669.",
    "You can configure and pre-order the laptop, which will start to ship out at the end of May 2021.",
    "Via OMGUbuntu"
  ],
  "headers": {
    "5": "Linux-powered",
    "8": "Premier pricing"
  },
  "links": {
    "Linux laptops": "https://www.techradar.com/best/linux-laptops",
    "Intel’s": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Samsung 970 EVO Plus": "https://www.techradar.com/reviews/samsung-970-evo-plus",
    "Samsung 980 PRO": "https://www.techradar.com/reviews/samsung-980-pro",
    "Ubuntu": "https://www.techradar.com/reviews/ubuntu",
    "desktop environment": "https://www.techradar.com/best/best-linux-desktop",
    "Ubuntu 20.04 LTS": "https://www.techradar.com/reviews/ubuntu-2004-lts-focal-fossa",
    "Linux distro": "https://www.techradar.com/best/best-linux-distros",
    "OMGUbuntu": "https://www.omgubuntu.co.uk/2021/05/tuxedo-infinitybook-pro-3k-screen"
  }
}