{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s7-fe-accidentally-listed-on-samsungs-own-website",
  "title": "Samsung Galaxy Tab S7 FE accidentally listed on Samsung's own website",
  "category": "tablets",
  "updated": "2021-05-25T08:07:21Z",
  "author": "tom-bedford",
  "summary": "Guess it's coming, then",
  "article": [
    "Nearly every single source is taking turns leaking the Samsung Galaxy Tab S7 FE - previously thought to be called the Galaxy Tab S7 Lite - and now Samsung itself has stepped up to the plate.",
    "As spotted by GSMArena, the German-region version of Samsung's online store currently lists the Galaxy Tab S7 FE, with specs and a price - you can see the listing here. After a few seconds on that link, you'll be taken to a different page on the Samsung store, so it seems like the company has tried (and failed) to remove it.",
    "Because of this, we'd guess the listing wasn't intentional, or an official release - it's likely a page that accidentally went live early.",
    "If there was any doubt remaining that the Galaxy Tab S7 FE was on its way, Samsung has successfully removed it; now we just need to know when the thing will actually go on sale, and how much it'll cost everywhere else.",
    "The tablet listed has 5G support, and costs €649 - that converts to about $800, £560, AU$1,020. This probably won't be the only variant available, and we'd expect versions with more storage or 4G connectivity, but they weren't listed.",
    "Other than the price, the listing tells us what numerous leaks already did; the slate will have a 12.4-inch screen, a 10,090mAh battery, 45W charging, a mid-range Snapdragon 750G chipset, a 5MP front-facing and 8MP rear camera and an S Pen stylus included.",
    "Overall the tablet sounds... okay, though those specs seem a little low-end for the cost. Perhaps this listing had a placeholder price that doesn't reflect the actual one, or perhaps this is for a top-spec version of the tablet, with more affordable ones not listed.",
    "We don't know when the Samsung Galaxy Tab S7 FE is due to be announced - well, announced intentionally - but we'll keep you updated when it does, as a release date will probably get mentioned too."
  ],
  "headers": {
    "4": "Samsung Galaxy Tab S7 FE listing"
  },
  "links": {
    "Galaxy Tab S7 Lite": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-fe",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_tab_s7_fe_gets_official_in_germany_starts_at__euro649-news-49279.php",
    "listing here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1340450518385217000&xs=1&url=https%3A%2F%2Fwww.samsung.com%2Fde%2Ftablets%2Fgalaxy-tab-s%2Fgalaxy-tab-s7-fe-5g-silver-64gb-5g-sm-t736bzsaeub%2Fbuy%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-tab-s7-fe-accidentally-listed-on-samsungs-own-website"
  }
}