{
  "source": "https://www.techradar.com/news/one-of-the-most-underutilized-microsoft-edge-features-is-getting-an-upgrade",
  "title": "One of the most underutilized Microsoft Edge features is getting an upgrade",
  "category": "computing",
  "updated": "2021-01-29T18:39:28Z",
  "author": "anthony-spadafora",
  "summary": "Inking in Edge has never been smoother",
  "article": [
    "Microsoft is making a number of improvements to inking in Edge to give those using a stylus or Surface Pen a better writing experience in its browser.",
    "The software giant decided to make the changes to its browser after receiving feedback from users regarding how writing on PDFs in Edge felt a bit jittery. At the same time, there were also complaints about Edge not being able to distinguish between pen and finger input to allow for scrolling with touch while inking with a pen.",
    "In order to fix the jittery strokes when drawing on PDFs in Edge, the company has adopted the latest Microsoft inking library on web as it offers smoother strokes. Users running Canary or Dev builds of Edge can test out this improved writing experience now and these changes will roll out to all users in an upcoming release of the browser.",
    "Microsoft also said that it plans to continue working on refining the quality of inking experience in its browser by improving latency even further.",
    "In order to allow users to scroll or pan pages with their finger while inking with pen, Microsoft recently added the ability to switch off inking with touch automatically if a digital pen is detected.",
    "The company is also adding a new button in Edge's user interface called “Draw with touch” which can manually enable or disable inking with touch. If this option is disabled though, you won't be able to ink using your finger. The ability to have inking switched off with touch will be available on both PDFs and web captures.",
    "Microsoft's continued commitment to improving the inking experience in Edge will likely lead to even more upgrades in the future. To help make the browser's inking experience even better, the company is asking users that have tried out the feature to leave feedback using its feedback tool which can be accessed from menu > Help and feedback > Send feedback or by using the keyboard shortcut Shift+Alt+l."
  ],
  "headers": {
    "4": "Switching off inking with touch"
  },
  "links": {
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Surface Pen": "https://www.techradar.com/news/microsoft-could-be-making-a-new-surface-pen-to-change-the-way-we-interact-with-our-devices",
    "PDFs": "https://www.techradar.com/best/free-pdf-editor",
    "web captures": "https://www.techradar.com/news/this-divisive-browser-just-got-a-nifty-new-feature-that-might-help-settle-the-debate",
    "feedback tool": "https://www.techradar.com/best/best-customer-feedback-tools"
  }
}