{
  "source": "https://www.techradar.com/news/wandavision-will-have-a-two-episode-premiere-disney-confirms",
  "title": "WandaVision will have a two-episode premiere, Disney confirms",
  "category": "entertainment",
  "updated": "2021-01-08T19:07:36Z",
  "author": "emma-boyle",
  "summary": "Double Vision",
  "article": [
    "Disney has confirmed that when WandaVision premieres on Disney Plus later this month it will be with two episodes.",
    "The first two episodes will make their debut on the streaming service on January 15, after which the release pattern will return to Disney’s standard structure of one episode per week. So that means episode three will be available from January 22.",
    "It’s not entirely clear why Disney has decided to show the first two episodes of WandaVision at once. It’s possible, depending on the length of the episodes, that Disney is hoping for a longer, more impactful premiere day. The desire to make an event of the premiere does feel kind of justified given the dearth of new Marvel content in 2020.",
    "There’s also a chance that Disney wants to give the show a chance to hook viewers; with its sit-com-inspired style and quirky tone, WandaVision definitely looks like a different kind of outing for Marvel and it might be that it’ll take a couple of episodes to really settle into its story and put across what it's trying to do.",
    "Starring Elizabeth Olsen as Wanda Maximoff/ Scarlet Witch and Paul Bettany as Vision, WandaVision will be the first of several MCU TV shows on Disney Plus this year, as well as the first Marvel Phase 4 outing full stop.",
    "It’ll run over nine episodes, so with its weekly release pattern it should finish in March giving just enough breathing space before The Falcon and the Winter Soldier series begins on March 19.",
    "More Marvel TV projects will come to Disney Plus later in the year, with Loki following on from The Falcon and the Winter Solder in May. It seems like the Disney Plus Marvel shows are going to play an important role in the overarching story of Phase 4 of the MCU and will tie into the slate of films that are on the horizon through this year and into 2022 as well. It's going to be a busy couple of years for Marvel fans.",
    "Via IGN"
  ],
  "headers": {
    "4": "More to come"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "dearth of new Marvel content in 2020": "https://www.techradar.com/news/wandavision-release-date-finally-revealed-by-marvel-and-disney-plus",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki": "https://www.techradar.com/news/new-loki-disney-plus-trailer-shows-the-god-of-mischief-stirring-up-trouble-again",
    "IGN": "https://www.ign.com/articles/marvels-wandavision-to-get-2-episodes-on-launch-day"
  }
}