{
  "source": "https://www.techradar.com/news/hunters-season-2-is-already-filming-and-may-arrive-next-year",
  "title": "Hunters season 2 is already filming – and may arrive next year",
  "category": "entertainment",
  "updated": "2021-10-20T13:42:35Z",
  "author": "tom-power",
  "summary": "'We're very much in production'",
  "article": [
    "Hunters season 2 is already in production – and it might be released as early as next year, according to showrunner David Weil.",
    "Speaking during the press tour for Invasion, the Apple TV Plus sci-fi show he co-created with Simon Kinberg, Weil revealed that work on Hunters' next chapter was well underway.",
    "Asked by Entertainment Weekly if he could provide an update on season 2's development, Weil unexpectedly confirmed that work had been completed on its US-based portion. With filming set to commence in Europe very soon, the Solos creator also teased when Hunters season 2 may arrive on Amazon Prime Video.",
    "\"I'm gonna get in trouble for saying this,\" Weil said. \"But we've completed our US leg of filming and we will be shooting in Europe in the coming days. We're very much in production and I hope that we'll be speaking at some point next year about the release of Hunters season 2.\"",
    "The drama series, which follows a band of Nazi hunters as they look to prevent the rise of another Reich in 1970s America, was Weil's first-ever credit as a TV show writer-producer.",
    "Starring the likes of legendary actor Al Pacino and Logan Lerman, Hunters polarized viewers but its season 1 finale set up the possibility of a thrilling second instalment – a follow-up season that may end up launching in 2022.",
    "Major spoilers follow for Hunters season 1.",
    "On the surface, you may think that Pacino's Meyer Offerman won't be back for Hunters' second outing. During the season 1 finale, it was revealed that Offerman was the Nazi commander known as Wilhelm \"The Wolf\" Zuchs, the individual that the hunters had been searching for throughout the show.",
    "Lerman's Jonah Heidelbaum winds up killing Offerman over the revelation, which would prevent his return in Hunters season 2. However, Weil replied \"No comment\" when Entertainment Weekly quizzed him over Pacino reprising the role, indicating that the movie star could be back in some form.",
    "So how could Pacino appear in season 2 if his character died in the season 1 finale? The likelihood is that he'll turn up as a figment of Jonah's imagination, serving as the angel or devil on his shoulders as the Hunters seek out other surviving Nazis.",
    "Viewers will remember that Jonah was suffering from PTSD and stress following his grandmother's death in the pilot episode and the Nazis he killed in season 1.",
    "We suspect that he'll still be suffering from that trauma in season 2, with Offerman's death compounding matters further. As a result, Pacino may return as an apparition of Offerman who might help or hinder Jonah as he travels across Europe in search of other Nazis.",
    "The prospect of Pacino returning, then, is plausible. Sure, Weil could just be teasing us over the possibility so we tune into season 2 when it arrives. Our guess, though, is that Pacino's Offerman will return in some capacity. If he wasn't, a simple \"no\" from Weil would have ended such speculation. The fact that Weil has left the door open on that possibility, however, makes us believe that we haven't seen the last of Offerman."
  ],
  "headers": {
    "6": "Analysis: Will Al Pacino return for Hunters season 2?"
  },
  "links": {
    "Entertainment Weekly": "https://ew.com/tv/hunters-season-2-david-weil-hitler/"
  }
}