{
  "source": "https://www.techradar.com/news/iphone-users-will-soon-be-able-to-use-googles-fi-vpn",
  "title": "iPhone users will soon be able to use Google's Fi VPN",
  "category": "computing",
  "updated": "2021-02-10T19:50:34Z",
  "author": "anthony-spadafora",
  "summary": "Fi VPN is coming to iOS this spring",
  "article": [
    "To commemorate Safer Internet Day, Google has announced that iPhone users that have signed up for its mobile phone service Fi will soon be able to use its VPN to secure data sent to and from their smartphones.",
    "Google Fi offers an Unlimited for 1 plan for $70 per month as well as a Flexible for 1 plan for $20 per month. However, both plans come with a built-in VPN to protect users when connected to unsecure networks such as public Wi-Fi or apps and sites that don't encrypt user data.",
    "In addition to coming to iOS later this spring, Fi VPN is also exiting beta on Android after Google made a number of performance improvements based on user feedback.",
    "According to a new blog post from Google, Fi VPN already secures over 226TB of data every day and this will likely increase once the service arrives for iPhone.",
    "In an effort to make Fi more secure, Google is also rolling out a new privacy and security hub in the Fi app for Android.",
    "This new hub makes it easy for Fi users to learn more about the privacy and security features available with the service and manage them with just one tap. These features include the Fi VPN as well as other tools designed to protect user's personal information online.",
    "Fi also protects users from spam calls by providing free warnings and blocking to stop robocalls and scams that have been identified by Google's security team. Users also have the ability to block specific numbers from calling or texting them.",
    "Finally, as your Fi number is tied to your Google Account, it comes with security features that protect your phone number from threats such as SIM swapping. Users can also enable 2-step verification for additional protection.",
    "If you're considering switching mobile providers, the inclusion of a free VPN service and extra security features just might be enough to entice you to sign up for Google Fi."
  ],
  "headers": {
    "4": "Privacy and security hub"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Google Fi": "https://www.techradar.com/news/google-fi-is-adding-rcs-chat-the-successor-to-sms",
    "public Wi-Fi": "https://www.techradar.com/news/public-wi-fi-and-why-you-need-a-vpn",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "blog post": "https://blog.google/products/google-fi/google-fi-vpn-updates-help-you-connect-safely/",
    "spam calls": "https://www.techradar.com/news/spam-calls-and-emails-saw-a-huge-rise-this-year",
    "Google's security team": "https://www.techradar.com/news/a-look-inside-googles-security-team",
    "SIM swapping": "https://www.techradar.com/news/sim-swap-fraud-leaves-two-factor-authentication-users-at-risk"
  }
}