{
  "source": "https://www.techradar.com/news/outriders-pc-system-requirements-demand-an-nvidia-rtx-3080-for-ultra-details-at-4k",
  "title": "Outriders PC system requirements demand an Nvidia RTX 3080 for ‘ultra’ details at 4K",
  "category": "computing",
  "updated": "2021-03-31T09:54:29Z",
  "author": "darren-allan",
  "summary": "While recommended spec (1080p) calls for a GTX 1070",
  "article": [
    "Outriders arrives tomorrow (April 1) and the PC system requirements have been made available just ahead of the launch, with the shooter demanding a chunky GPU to be run at max settings in 4K resolution.",
    "The spec was published via the game’s official Twitter account, and it details the requirements for three different levels – the minimum needed to run the game at 720p, the recommended requirements (high details, 1080p), and what you’ll need to enjoy Outriders at ‘ultra’ details in 4K resolution.",
    "Minimum requirements (720p, low details, 60 fps)",
    "Recommended requirements (1080p, high details, 60 fps)",
    "Ultra requirements (4K, ultra details, 60 fps)",
    "As you can see, for max details at 4K, you’ll need a seriously beefy RTX 3080 graphics card on the Nvidia side, or an AMD 6800 XT – hardware not a lot of folks have access to (of course, these days it’s not just a money issue to buy expensive top-end GPUs like these, but finding stock is near impossible, even if you have the cash ready to splash).",
    "In fairness, though, that requirement is targeting a smooth 60 frames per second (as are all the specs listed), which is certainly the way a shooter should be played ideally. So it’s not too surprising that it’s a reasonably big ask to keep at that frame rate at 4K with ‘ultra’ details, although some folks aren’t too happy at seeing this requirement going by the feedback we’ve seen online.",
    "Other notable points include the stipulation for 16GB of RAM with the recommended spec, although that’s almost becoming commonplace now. There’s also the need for a GTX 1070 with that recommended spec – earlier requirements we saw a couple of months back indicated a GTX 1060 would be okay, but that card doesn’t quite make the cut for release.",
    "Still, with some tuning of graphics settings away from high, owners of those GPUs will still likely be able to manage just fine at 1080p."
  ],
  "headers": {
    "5": "Outlandish ask?"
  },
  "links": {
    "Outriders": "https://www.techradar.com/how-to/how-to-play-the-free-outriders-demo",
    "Twitter account": "https://twitter.com/Outriders/status/1376927338257076232",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt"
  }
}