{
  "source": "https://www.techradar.com/news/apple-has-been-scanning-icloud-mail-for-csam-since-2019",
  "title": "Apple has been scanning iCloud Mail for CSAM since 2019",
  "category": "computing",
  "updated": "2021-08-23T22:13:29Z",
  "author": "anthony-spadafora",
  "summary": "Incoming and outgoing attachments sent using iCloud Mail are scanned for CSAM",
  "article": [
    "As Apple prepares to begin scanning iPhones and iPads for child sexual assault material (CSAM) with the release of iOS 15, new details have emerged revealing that the company already scans iCloud Mail for CSAM.",
    "According to a new report from 9to5Mac, the iPhone maker has been scanning iCloud Mail for CSAM since 2019 though it has not yet begun scanning iCloud Photos or iCloud backups for such material.",
    "The news outlet decided to investigate the matter further after The Verge spotted an iMessage thread related to Epic's lawsuit against Apple in which the company's anti-fraud chief Eric Friedman said that it is “the greatest platform for distributing child porn”.",
    "While Friedman's statement certainly wasn't meant to be seen publicly, it does raise the question as to how Apple could know this without scanning iCloud Photos.",
    "9to5Mac's Ben Lovejoy reached out to Apple to find out more regarding the matter and the company did confirm that it has been scanning both outgoing and incoming iCloud Mail attachments for CSAM since 2019. As emails sent using iCloud Mail aren't encrypted, scanning attachments as mail passes through Apple's servers is not a difficult thing to do.",
    "In addition to scanning attachments, Apple also told 9to5Mac that it does some limited scanning of other data though the company did not specify what this data is. It did however say that this “other data” does not include iCloud backups.",
    "Back in January of last year, chief privacy officer at Apple, Jane Horvath said at a tech conference that the company uses screening technology to look for illegal images and that it disables accounts if evidence of CSAM is found.",
    "While Friedman's statement initially sounded as if it was based on hard data, it likely wasn't. Instead he made the inference that since the company previously did not scan iCloud Photos or iCloud backups, more CSAM would likely exist on Apple's platform compared to other cloud computing services that actively scan photos for CSAM.",
    "We'll likely find out more on how Apple plans to combat CSAM on its platform once the company rolls out Apple Child Safety photo scanning with the release of iOS 15 this fall.",
    "Via 9to5Mac"
  ],
  "headers": {
    "4": "Scanning iCloud Mail"
  },
  "links": {
    "CSAM": "https://www.techradar.com/news/apple-devices-to-detect-and-report-child-sexual-abuse-images-heres-how-it-works",
    "iOS 15,": "https://www.techradar.com/news/ios-15-update",
    "new report": "https://9to5mac.com/2021/08/23/apple-scans-icloud-mail-for-csam/",
    "iCloud Mail": "https://www.techradar.com/news/icloud-mail-on-web-finally-gets-modern-ios-15-makeover-heres-how-to-get-it",
    "iMessage thread": "https://www.theverge.com/22611236/epic-v-apple-emails-project-liberty-app-store-schiller-sweeney-cook-jobs",
    "Epic's lawsuit against Apple": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "emails": "https://www.techradar.com/news/best-email-provider",
    "iCloud backups": "https://www.techradar.com/how-to/icloud-storage-how-much-do-you-really-need",
    "tech conference": "https://www.techradar.com/news/top-tech-conferences-the-ultimate-tech-events-and-show-guide",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Apple Child Safety photo scanning": "https://www.techradar.com/news/apple-child-safety-photo-scanning-what-you-need-to-know",
    "9to5Mac": "https://9to5mac.com/2021/08/23/apple-scans-icloud-mail-for-csam/"
  }
}