{
  "source": "https://www.techradar.com/news/capcom-warns-against-resident-evil-village-early-access-scam",
  "title": "Capcom warns against Resident Evil Village early access scam",
  "category": "gaming",
  "updated": "2021-03-11T11:48:43Z",
  "author": "vic-hood",
  "summary": "Watch out for this",
  "article": [
    "Capcom has warned that there's a Resident Evil Village phishing scam doing the rounds which claims to offer fans early access to the upcoming Resi game.",
    "In an email to press (via Kotaku), Capcom warned that there are emails circulating that falsely claim to contain Early Access invitations for Resident Evil Village. However, these emails are instead \"phishing attempts by an unauthorized third party\", who uses the email address \"no-reply(at)capcom(dot)com\".",
    "The developer warns that, if you do receive one of these emails, you don't reply or download any files attached – instead \"delete the message immediately\".",
    "While early access to Resident Evil Village is tempting, Capcom unfortunately won't be offering it. However, if you do want a taste of the next Resi before it released on May 7, you can try out the free demo.",
    "The Resident Evil Maiden demo is currently only available on PS5, however, Capcom has previously said that it will release another multi-platform free demo this \"Spring\", so we're expecting it sometime in the coming weeks.",
    "It remains unclear if the multi-platform demo will also be Maiden or a new one altogether. But it's likely this demo will land on Resident Evil Village's other confirmed platforms: PS4, Xbox One, Xbox Series X, Xbox Series S and PC.",
    "If you've already flown through the demo then don't worry, there's not too much longer left to wait for Resident Evil Village – and its Big lady."
  ],
  "headers": {
    "3": "Scary prospect"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Kotaku": "https://kotaku.com/dont-click-on-those-resident-evil-village-early-access-1846451540",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}