{
  "source": "https://www.techradar.com/news/new-sony-wireless-speaker-boasts-unusual-design-with-an-important-audio-purpose",
  "title": "New Sony wireless speaker boasts unusual design with an important audio purpose",
  "category": "audio-visual",
  "updated": "2021-01-08T16:33:27Z",
  "author": "olivia-tambini",
  "summary": "Style and substance",
  "article": [
    "Sony has unveiled two new wireless speakers, including one that comes with an unusual design that should help it provide super immersive audio.",
    "The Sony SRS-RA5000 features a trio of up-firing speakers that spread audio vertically, giving your music a sense of height – and the company hasn't shied away from making them the star of the show, furnishing them in contrasting copper or silver depending on your choice of color.",
    "These upfiring tweeters work together with three middle-sited speakers that spread sound horizontally.",
    "The speaker unit features neodymium magnets and a reinforced cellular diaphragm, which Sony says has allowed it to give the speaker strength while maintaining a compact size.",
    "Bringing the bass is a built-in subwoofer, while support for Sony 360 Reality Audio tracks means you can hear your music as if each instrument was placed in a sphere around you. As well as that, Sony's Immersive Audio Enhancement means two-channel stereo tracks can be upscaled to sound more immersive.",
    "To appeal to audiophiles, there's support for Hi-Res Audio, so your Tidal and Qobuz tracks should sound crisp and detailed.",
    "The SRS-RA5000 should sound good no matter where you put it in your home, thanks to a Sound Calibration feature that allows the speaker to analyze the shape of the room its in and adjust the audio accordingly.",
    "Unusually, there's also an Auto Volume feature, which Sony says will \"take the stress out of finding the perfect volume for each track\". Although we're not sure how stressful this really is, it's cool that the speaker can adjust the volume output track-by-track, and it could be a useful feature for parties or anytime you can't be tethered to your speaker.",
    "Other quality of life features include Chromecast built-in, support for Spotify Connect, Wi-Fi and Bluetooth connectivity, multiroom capabilities, and voice control via compatible Alexa or Google Assistant devices.",
    "Combine all that with a luxurious, if not slightly unusual design, and Sony could be onto a winner – although when the SRS-RA5000 launches in February, it'll set you back £500. Global pricing is still to be confirmed, but that works out at around $680 / AU$870, much more expensive than the best wireless speaker we think you can buy right now, the Sonos One.",
    "If you're looking for something a little less wince-inducing when it comes to price, Sony has also announced the SRS-RA3000, which comes in at £280 (about $380 / AU$500).",
    "While this more compact speaker doesn't come with the RA5000's upfiring tweeters or Hi-Res Audio support, you're still getting 360 Reality Audio, Immersive Audio Enhancement, automatic Sound Calibration, and Auto Volume, as well as all the connectivity features that come with its larger sibling.",
    "According to Sony, the RA3000 is also humidity resistant – though not fully waterproof – so you should be able to use it comfortably in the bathroom or your kitchen while cooking. Just don't let it go anywhere near your sink or bathtub."
  ],
  "headers": {
    "6": "All the connectivity",
    "10": "A cheaper alternative"
  },
  "links": {
    "wireless speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079/news/best-speaker",
    "Sony 360 Reality Audio": "https://www.techradar.com/news/first-look-sony-360-reality-audio",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "best wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review"
  }
}