{
  "source": "https://www.techradar.com/news/many-remote-employees-end-up-paying-for-their-own-cybersecurity",
  "title": "Many remote employees end up paying for their own cybersecurity",
  "category": "computing",
  "updated": "2021-06-18T11:13:22Z",
  "author": "mayank-sharma",
  "summary": "A high number of remote employees have faced multiple cyberattacks",
  "article": [
    "While a majority of employees who work from home take their work cybersecurity seriously, quite a few end up paying for it out of their own pockets.",
    "VPNOverview surveyed over a thousand full-time remote employees to assess their attitude towards cybersecurity along with the evolving cybersecurity landscape during the pandemic.",
    "Although data breaches and congressional hearings had become almost commplace, the report found that nearly two thirds of workers had gone remote and so essentially had taken cybersecurity (for themselves and their company) into their own hands. \"As such, the cybersecurity of these employees has become a big concern for many companies,” said VPNOverview.",
    "However, the survey revealed that while an overwhelming majority (89.4%) have taken cognizance of the increased threats, many reveal that their employees don’t cover costs for appropriate protective measures . In fact, on average many end up paying over $100/month for work-related security themselves.",
    "The survey discovers that although there were exceptions, on the whole, remote employees claim to take their workplace security more seriously than their employers.",
    "Surprisingly nearly half of the respondents admitted to experiencing a phishing or cybersecurity threat, with almost a third having experienced it more than once.",
    "Not surprisingly, those who had experienced an attack were more likely to have implemented precautions such as two-factor authentication (2FA) and VPNs.",
    "Breaking down the respondents, it emerged that the size of the company and the sensitivity of information had a direct bearing on the availability and implementation of cybersecurity measures.",
    "\"As the evidence clearly reveals, cybersecurity is a major consideration for remote employees,\" the report concluded. \"Things like two-factor authentication and secure Wi-Fi are common practices among remote employees in 2021, while the vast majority agree they take it seriously and would know what to do in a cybersecurity threat scenario.\"",
    "\"No matter how large the company or sensitive the information, however, we can see that cybersecurity threats can and do still happen.\""
  ],
  "headers": {
    "4": "Cybersecurity trends"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software",
    "said VPNOverview": "https://vpnoverview.com/news/how-companies-value-cybersecurity-for-remote-employees/",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}