{
  "source": "https://www.techradar.com/news/maintaining-security-with-vdi-in-the-hybrid-working-era",
  "title": "Maintaining security with VDI in the hybrid working era",
  "category": "computing",
  "updated": "2021-05-03T11:04:08Z",
  "author": "roger-waterhouse",
  "summary": "Managing dispersed IT with VDI",
  "article": [
    "Remote working, at least in part, is here to stay. Businesses across numerous sectors are opting to incorporate remote working into their long-term plans, leading to many workers following a balanced model between home and the office in the coming years. With reports of organizations showing productivity increases of 47% during the first lockdown in 2020, it’s no surprise to find that remote working won’t be a measure that’s left behind as the roadmap to post-pandemic normality kicks in.",
    "While businesses will no doubt be excited by the prospect of being able to attract and retain the best talent outside of their traditional catchment area, plus benefitting from lower overheads by refactoring or reducing office space, supporting the remote workforce with the right solutions to complete tasks effectively from remote locations will provide a unique set of challenges to IT management teams.",
    "With issues around data regulations, managing the growing range of users’ devices across varying locations has increasingly impacted on organizations’ ability to remain compliant and secure, not to mention successfully balancing this with ensuring remote staff continue to be productive and effective. It is therefore not hugely surprising that some firms are hesitant to adopt remote working policies permanently.",
    "March 2021 marked a major announcement from BP, with the oil giant introducing a new hybrid working policy that allows staff and partners to work remotely for 40% of the time, something that simply wouldn’t have even been on the table 12 months ago. Permanent hybrid working policies such as these have become expected by workers so quickly that without them, many businesses would struggle to recruit or even keep the talent they currently have. We are undoubtedly witnessing the birth of the hybrid working era?",
    "In any company adopting a hybrid working model, where the workforce divides its time between the office and home or other location dictated by the business, staff need fast, reliable and hassle-free access to business-critical apps from any device, wherever they choose to work, with different users requiring varying levels of compute power and access rights to applications depending on their job role. In addition, with new a generation of workers entering the global workforce with expectations of instant access to technology and a need to work flexibly, the pressure is on organizations to meet this demand. A recent survey found 62% of remote workers also want employers to provide better technology that helps them stay connected with their colleagues, so supporting collaboration is crucial.",
    "It goes without saying that security is paramount. If not governed effectively, remote work can increase the threat landscape for organizations due to the difficulty in implementing and controlling policies in the same manner as in the office. Highly sensitive data could be stored on a staff member’s laptop or personal device if they don’t have access to a corporate device in their home, and laws around GDPR and Brexit mean that the potential compromising of this data could be catastrophic in terms of potential fines from regulatory bodies. In addition, the home networks that these devices are usually connected to often comprise of an unsecured ADSL line and router.",
    "With these challenges at the forefront of IT teams’ concerns, managing a firm’s IT across a hybrid working model is far from simple and with business reputation on the line, there’s very little room for error. Organizations need to understand how to simplify, standardize and secure IT for the remote workforce and take the risk and complexity out of dispersed IT management. The firms that are already beginning to reap the rewards of hybrid working are doing so by implementing a cloud-based virtual desktop infrastructure (VDI).",
    "A modern VDI solution provides numerous benefits to organizations, not least the ability to consistently deliver the same desktop experience that the dispersed workforce would experience in the office. Employees can access their applications, systems, documents and databases from any location, whether they’re using their corporate or personal devices to complete tasks, which can include laptops, PCs, and smartphones.",
    "It’s important to emphasize the benefits that a modern VDI can provide over traditional, often called a ‘shared session’, based desktop. The cumbersome and slow nature of traditional VDIs have led to negative perceptions of the technology, with performance and access varying for users across devices. Traditional platforms rely on shared resources which can lead to the “noisy neighbor” effect, impacting on the performance for others using the infrastructure, causing issues with productivity. Modern VDI solutions can be designed to avoid these drawbacks.",
    "Professionals can ensure peace-of-mind in a hybrid working strategy from centralized management of every user’s desktop and application portfolio used across the business. Upgrades, new applications and software patches can all be rolled out to a centralized infrastructure in the cloud, rather than to all the desktops individual, thereby ensuring a consistent and secure user experience across the workforce.",
    "A virtual desktop infrastructure removes the possibility of sensitive data being stored on the user’s device, enhancing both security and control for the organization and its customers. This provides the assurance that its reputation will be protected, no matter where their people are working or which devices they’re working on.",
    "Centralized control of user’s desktops also means that user access can be restricted to certain features and functions, helping to mitigate the chance of data leaks or other security risks. These rules can be built around types of devices being used, locations or methods of authentication and these can trigger specific actions such as preventing data from being printed, shutting down USB ports, and blocking access to non-corporate email accounts.",
    "While not all organizations will look to adopt a hybrid working approach in future, there is certainly a case for allowing staff and partners to work remotely. The benefits may be clear, but so are the risks, and organizations can best tackle these by employing a modern VDI solution that optimizes the user experience, delivering a genuine Windows desktop that is highly available and supports a plethora of devices. A cloud-based infrastructure can mitigate the risks and enable organizations and their people to reap the benefits of the hybrid working model safely, securely and consistently."
  ],
  "headers": {
    "4": "The challenges facing hybrid working",
    "7": "The case for VDI",
    "12": "The role of VDI in a hybrid future"
  },
  "links": {
    "Remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "office": "https://www.techradar.com/best/best-office-desks",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "virtual desktop": "https://www.techradar.com/best/virtual-desktop-services"
  }
}