{
  "source": "https://www.techradar.com/news/netflix-renews-one-of-its-biggest-tv-shows-for-a-third-season",
  "title": "Netflix renews one of its biggest TV shows for another season",
  "category": "entertainment",
  "updated": "2021-05-12T11:33:20Z",
  "author": "axel-metz",
  "summary": "What’s not to Louvre?",
  "article": [
    "One of Netflix’s most popular original series, Lupin, has been renewed for a third season.",
    "The announcement came on Twitter alongside a trailer, with Netflix confirming “Part Deux” of the French crime drama will arrive on June 11, before returning again for “Part Trois” at a later date. Our guess is this will likely follow in 2022.",
    "Lupin's first season followed Omar Sy as Assane Diop, a man whose life is turned upside down after his father is accused of a crime he didn’t commit by a wealthy family. In true revenge-thriller fashion, Assane – under the alias 'Arsène Lupin, Gentleman Burglar' – stages a heist to avenge his family.",
    "The series – whose titular character is inspired by Maurice Leblanc’s early 1900s novels – drew huge audience figures for its debut, five-episode season, which premiered on the streamer back in January of this year. Lupin was watched by 70 million households in the first month of its release, becoming the most-viewed non-English series on Netflix.",
    "The upcoming episodes don’t strictly represent a second season, in the traditional sense, but rather a direct continuation of the events of the first five episodes – hence Netflix marketing them as “Part Deux”.",
    "As with shows like The Walking Dead, then, Lupin’s final episode (five) – which ended the “Dans L'Ombre D'Arsène” (“In the Shadow of Arsène”) story arc – acts as more of a mid-season finale than proper narrative conclusion.",
    "It’s not hard to understand Lupin’s evidently global appeal.",
    "The show, which was written by British showrunner George Kay, bears all the hallmarks of a Sherlock Holmes thriller while also sporting the slick Hollywood trappings of a heist movie – think Ocean’s Eleven meets The Da Vinci Code.",
    "Given its initial release in January, too, Lupin coincided with national lockdowns across the world and capitalized on the viewing opportunity presented by couch-bound audiences in search of some good, old-fashioned escapism.",
    "Will Lupin’s second (and third) parts maintain the same level of interest? There’s certainly enough here to keep audiences engaged for a while longer, but with Netflix shows continuing to increase in numbers and quality, Lupin will have to stage a pretty daring heist to steal that same level of attention."
  ],
  "headers": {
    "6": "Analysis: The French Connection"
  },
  "links": {
    "Twitter": "https://twitter.com/NetflixUK/status/1392406499880747009",
    "trailer": "https://www.youtube.com/watch?v=kJ6x279y8GI",
    "Netflix shows": "https://www.techradar.com/best/best-netflix-shows"
  }
}