{
  "source": "https://www.techradar.com/news/iphone-13-release-date-might-have-been-revealed-by-a-retailer",
  "title": "iPhone 13 release date might have been revealed by a retailer",
  "category": "phones",
  "updated": "2021-08-25T10:59:09.863Z",
  "author": "james-rogerson",
  "summary": "September 17 could be the date",
  "article": [
    "The wait for the iPhone 13 is almost over, that much we know for sure. Exactly when the wait will be over is slightly less clear, but one retailer has listed the iPhone 13 range with a September 17 date.",
    "This comes from a screenshot of an unnamed \"e-commerce platform” posted on Weibo and spotted by IT Home, which shows the iPhone 13 and its siblings alongside that date, and the AirPods 3 with a date of September 30.",
    "We would take this leak with a huge helping of salt, since it’s not clear what the retailer is, and they could just be using a placeholder date. That said, this is a match for other leaks, with multiple sources suggesting the iPhone 13 would be announced in the third week of September.",
    "Based on past form, Apple would almost certainly put the phone up for pre-order on the Friday of the announcement week, which would in that case be September 17.",
    "However, it’s not totally clear from this latest leak whether September 17 would be the pre-order date or the shipping date. We’d assume the former, especially as that lines up with other leaks, but we can’t be certain.",
    "Not only has September 17 essentially been leaked before, but we’ve long predicted based on Apple’s patterns that the iPhone 13 would be announced in either the second or third week of September. If it’s unveiled in the second week, then September 17 is still notable as that would then likely be the shipping date of the phones.",
    "So whether for pre-orders or actually getting the iPhone 13 in your hands, September 17 is likely to be a key date in the iPhone 13 launch, and this leak just makes that seem even more likely.",
    "That date is fast approaching, so we hope you’ve been saving if you are interested in an iPhone 13, iPhone 13 mini, iPhone 13 Pro or iPhone 13 Pro Max, as they’re all sure to be very expensive handsets. That said, rumors suggest they won’t cost any more than the iPhone 12 range, so that’s something at least.",
    "Via iMore"
  ],
  "headers": {
    "5": "Analysis: September 17 is very likely"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "IT Home": "https://www.ithome.com/0/571/411.htm",
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "sources suggesting": "https://www.techradar.com/news/iphone-13-release-date-may-be-sooner-than-expected-but-could-an-event-be-canceled",
    "iMore": "https://www.imore.com/iphone-13-release-date-might-have-just-been-revealed-along-airpods-3"
  }
}