{
  "source": "https://www.techradar.com/news/five-things-to-look-for-in-a-resume",
  "title": "How to hire employees: 5 things to zoom on in a resume when looking to hire someone",
  "category": "computing",
  "updated": "2021-12-01T15:33:39Z",
  "author": "mike-jennings",
  "summary": "Here are the key things to watch for if you’re on the lookout for new staff",
  "article": [
    "If you’re a recruiter or if you work in an HR department, then you’ll be familiar with just how busy the job can get – and just how many resumes you’ll receive for open positions.",
    "While it’s undoubtedly great to have a big pool of talent to choose from, sifting through all of those resumes and applications can be daunting, especially if you’re busy or you have to tackle the task on your own.",
    "Happily, there are plenty of areas where you can quickly examine a resume and see if the person should be on your shortlist or if you should discard the document. And, if you’re happy to spend a little more time with each resume, you can spot loads more information that will show whether a candidate will be a good fit for your company.",
    "It’s a lot to take in, especially if you’ve got to deal with loads of resumes or if you don’t have loads of recruitment experience. That’s why we’ve rounded up the five key areas where you need to pay particular attention.",
    "We’ve got plenty of other articles that are worth your attention if you need new staff, too: here are 2021’s best recruitment platforms, and head here to discover our top 10 tips for finding the best employees. And, finally, there’s our verdict on 2021’s best US job sites.",
    "Understandably, this is the big one – you’ve got to pay plenty of attention to the employment experience of anyone who applies for your open positions. And with long careers and loads of information to digest, this is one area where you’ve got to really concentrate.",
    "Take a close look at a candidate’s career, and you can learn plenty about their prospects. A person’s previous work experience can indicate if they’re going to have the skills and abilities to tackle your position or if there are areas where they won’t be able to match up.",
    "You can gain insights by looking beyond their earlier duties and responsibilities, too. If you can see obvious signs of increasing responsibility and career progression then that’s a good sign that someone is hard-working and effective, but if you see diminishing responsibility or an obvious career plateau then that’s a potential red flag.",
    "You can find out loads if you read between the lines. Depending on the industry, if a person frequently changes jobs, then that could be an indicator of personality issues – or it might just mean that they’ve taken on contract work. It could be more pertinent to see if there are suspiciously large gaps between people’s jobs.",
    "If someone stays at their previous jobs for a long period then it’s an indicator that they were happy and progressed at their previous job, which bodes well for your business. Also, be on the look out for concrete data about someone’s earlier employment – measurable successes are more indicative than buzzwords.",
    "There are some final things to bear in mind when you examine someone’s experience. Remember that people working in a different industry is not necessarily a problem – they can still have loads of transferrable skills. Similarly, it’s worth considering people who have only held junior roles in the past, because the right person can always grow and develop in your business.",
    "Education is vital in all occupations, and it’s one of the most important aspects of a resume. If someone has the right education for your role, then you can be confident that they’ll have the abilities required for your vacancy. It’s even more important if someone has just left education and doesn’t have any work experience.",
    "The education section on a resume can show off an applicant’s skills, interests, and abilities, and it can also show if they’ve got an education at the level you need for your role. Bear in mind that their education doesn’t necessarily need to match the industry you’re hiring in, either – a good education can supply the skills and knowledge needed even if it’s in a different subject.",
    "If you’re open to hiring people who have just left university, it can be useful to see if they’ve included any relevant coursework on their resume – this can function like work experience if that’s absent.",
    "Also bear in mind that loads of candidates will have professional certifications that they have obtained over their working life. These will be crucial for many jobs, so pay attention if you require these for your vacancy.",
    "Any new hire must have at least some of the skills and abilities needed to perform the job, so you’ve got to examine an entire resume to find out if an applicant has what it takes.",
    "Many candidates will include a dedicated section on their resume that outlines their professional, relevant skills, so you’ll be able to see straight away how many boxes that each applicant ticks. That’s incredibly helpful if you need to quickly decide who should progress to the next stage of your recruitment process – you can see what each candidate has and what they’re missing.",
    "It’s not just about those measurable skills, though. If you read through a person’s previous work experience, then you’ll often easily see what knowledge and abilities they’ve developed and demonstrated in previous roles. Casting your eye over a person’s hobbies and interests can illustrate more skills – especially interpersonal ones that could help someone integrate into your business.",
    "This is one area that can be hard to read from a resume, but any good recruiter can still draw some conclusions here. And it’s important, because any candidate who can fit into your business and get on well with your staff is going to do a better job – and that’s a victory for everyone involved.",
    "There are some areas where you can make determinations about someone’s personality and values. Many candidates will include a short personal statement on their resume, and plenty more will have lists of people’s hobbies and interests.",
    "Ultimately, you won’t be able to tell everything about a candidate’s personality from their resume, but you can usually get enough information to help you decide if they’re worth an interview.",
    "If you find a resume that’s riddled with spelling errors, grammatical inconsistencies, and an ugly layout then you can dismiss it straight away – you want someone with good attention to detail, and candidates with error-strewn resumes clearly don’t fit that brief.",
    "Beyond spelling and grammar, there are plenty of aspects where a resume’s design and layout can reveal plenty about the candidate.",
    "If they’ve used concise, organized, and straightforward language on their resume then that’s a good sign – it shows better communication skills than a resume that’s filled with jargon and empty buzzwords. Also look out for good contextual information and relevant words and phrases for your industry, because it shows that the candidate has paid attention to the job description you’ve advertised. If they’ve tailored their resume to the job, it means they’re serious and have good attention to detail.",
    "The resume’s layout should be clear and consistent, it should ideally use a modern font, and it should be easy to read. It shouldn’t be too long, either, and they should have followed the directions you provided when you listed the job.",
    "Elsewhere, be aware if people have not listed who you should contact for a reference: it’s a potential red flag if they don’t want you to speak to some of their previous employers.",
    "A good resume should have clear contact details and, if it’s electronic, it’s handy if they’ve included links to their relevant professional and social profiles. This doesn’t just show good attention to detail – it means you can make sure that their resume matches up with that’s listed online.",
    "Looking to improve your own resume? Check out our roundup of the best resume builders"
  ],
  "headers": {
    "5": "Work experience",
    "11": "Education",
    "15": "Skills and knowledge",
    "18": "Personality and attitudes",
    "21": "Accuracy, spelling and grammar"
  },
  "links": {
    "resumes": "https://www.techradar.com/best/best-resume-builder",
    "best recruitment platforms": "https://www.techradar.com/best/recruitment-platforms",
    "top 10 tips for finding the best employees": "https://www.techradar.com/news/ten-ways-to-find-employees-for-your-business",
    "best US job sites": "https://www.techradar.com/best/us-job-sites",
    "job description": "https://www.techradar.com/features/30-resources-to-find-job-description-examples",
    "best resume builders": "https://www.techradar.com/best/best-resume-builder"
  }
}