{
  "source": "https://www.techradar.com/news/huawei-p50s-likely-design-shown-off-in-photos",
  "title": "Huawei P50 likely design shown off in leaked photos",
  "category": "phones",
  "updated": "2021-04-30T14:38:58Z",
  "author": "james-rogerson",
  "summary": "One step closer to the real thing",
  "article": [
    "Until now our closest look at the Huawei P50 had come from renders, but now we’ve seen something that might be close to the real thing, as photos that appear to show a dummy unit of the phone have leaked.",
    "Shared by leakers Digital Chat Station and Technology Yu on Weibo (a Chinese social media site), the images look like they could be showing the real phone, but an accompanying description describes it (via machine translation) as a “third-party model.”",
    "That presumably means a dummy unit used by a company such as a case maker that would want to know what the phone looks like ahead of launch.",
    "Often dummy units are supplied by the phone manufacturer – or at least based on specs provided by them, so there’s a good chance the phone shown in these images is an accurate representation of the Huawei P50, but there’s no guarantee.",
    "In any case, the photos show a design that’s much like we’ve seen before in renders. There’s a large camera block housing two massive circles on the rear, though it’s expected that at least one of these circles will house multiple lenses, and indeed one of the images above shows two lenses in each.",
    "The front meanwhile includes a flat screen, a punch-hole camera, and the Huawei P50 is shown in both white and black shades.",
    "As ever with leaks we’d take this with a pinch of salt, but with these matching what we’ve seen before we’d think they’re likely to be accurate. We should find out soon, as the Huawei P50 is expected to land in May or June – probably alongside the Huawei P50 Pro and Huawei P50 Pro Plus.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "Digital Chat Station": "https://weibo.com/6048569942/KdhjDEtRY?from=page_1005056048569942_profile&wvr=6&mod=weibotime&type=comment#_rnd1619792496060",
    "Technology Yu": "https://weibo.com/1840918185/Kdhpzjuoi?from=page_1005051840918185_profile&wvr=6&mod=weibotime&type=comment#_rnd1619792332361",
    "matching what we’ve seen before": "https://www.techradar.com/news/huawei-p50-images-include-the-pros-massive-camera",
    "GSMArena": "https://www.gsmarena.com/huawei_p50_leaks_in_handson_images-news-48914.php"
  }
}