{
  "source": "https://www.techradar.com/news/could-the-apple-watch-7-really-measure-blood-glucose-and-why-is-it-important",
  "title": "Could the Apple Watch 7 really measure blood glucose – and why is it important?",
  "category": "fitness",
  "updated": "2021-05-11T15:42:19Z",
  "author": "cat-ellis",
  "summary": "Probably not a quick solution for people with diabetes",
  "article": [
    "Apple has begun asking users about the apps they use to monitor diet and blood glucose levels, leading to speculation that the next Apple Watch may be able to track users' blood glucose levels non-invasively – but is that really likely, and why is it so important?",
    "The main reason for measuring blood glucose is to help mange diabetes – a very serious condition that can lead to heart attacks and heart failure, strokes, sight loss, amputations, and kidney failure if not properly treated and monitored.",
    "As Diabetes UK explains, diabetes is a condition caused when your body produces no insulin, or not enough, causing blood glucose to rise too high.",
    "People with type one diabetes can't make any insulin at all. The condition isn't related to the person's lifestyle, and must be controlled using insulin injections or an insulin pump.",
    "People with type two diabetes can still make some insulin, but it's either not enough or doesn't work properly. Being overweight is the biggest risk factor for developing type two diabetes, and some people are able to control it by making lifestyle changes, but the longer they have it, the more likely they are to need medication. Eventually they may need insulin injections too.",
    "Many smartwatches already claim to help monitor blood glucose levels, but it's not quite as straightforward as it might sound.",
    "For example, the Fitbit app can keep records of your glucose levels and give you reminders when it's time to take a measurement. However, the Fitbit watch itself doesn't take the readings.",
    "Instead, the app imports data from OneTouch Reveal, which connects to the Verio Reflect smart blood sugar meter. Like most blood glucose monitors, this works using a drop of blood from a finger-prick test.",
    "\"The Blood Glucose feature is not a replacement for medical advice and is not intended to diagnose or treat any medical condition,\" Fitbit says.",
    "\"It is intended to simply help you monitor and keep track of your information. You should talk to your healthcare provider for more guidance on blood glucose management. If you believe you are experiencing a medical emergency, call 911.\"",
    "It's possible to check blood glucose levels on your Garmin watch too, but again this uses data from a separate monitor rather than the watch itself, and is only intended to help athletes plan their nutrition strategy, not for medical purposes.",
    "The Supersapiens app for Garmin watches connects to the Abbott Libre Sense Glucose Sport Biosensor. This is a continuous glucose monitor – an adhesive patch that uses a small sensor just under your skin to measure glucose in the fluid around your body's cells (interstitial fluid).",
    "Continuous glucose monitors for medical use are available too, but glucose levels in interstitial fluid aren't exactly the same as blood glucose, so they're not a direct replacement for a finger-prick test. They're not suitable for all people with diabetes, either.",
    "So is it likely that the forthcoming Apple Watch 7 will be able to measure blood glucose itself? It's very unlikely, though there is some promising research on non-invasive blood glucose monitoring that might be built into smartwatches eventually.",
    "For example, researchers are investigating ways to monitor glucose levels non-invasively using spectroscopy, which uses lasers to identify different chemicals, and the SugarBEAT monitor from UK company Nemuara Medical measures interstitial blood glucose by drawing molecules through the skin using a mild electrical current, but has yet to receive FDA approval.",
    "The most likely scenario, if there's enough demand, is that the next Apple Watch will come with an app pre-installed that collates data from third-party sensors. It might not be the solution some users were hoping for, but would be a welcome next step."
  ],
  "headers": {
    "5": "Blood glucose and smartwatches",
    "13": "The next Apple Watch"
  },
  "links": {
    "asking users about the apps they use": "https://www.techradar.com/news/apple-watch-7-glucose-monitoring-gets-hinted-at-by-apple-itself",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Diabetes UK": "https://www.diabetes.org.uk/",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "OneTouch Reveal": "https://www.myonetouch.co.uk/OneTouchReveal",
    "Verio Reflect": "https://www.myonetouch.co.uk/products/glucose-meters/onetouch-verio-reflect",
    "Fitbit says": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1186378785693779700/https://blog.fitbit.com/fitbit-blood-glucose-tracking-feature/",
    "check blood glucose levels on your Garmin watch": "https://road.cc/content/tech-news/supersapien-now-integrates-garmin-283225",
    "Supersapiens": "https://www.supersapiens.com/en-GB/",
    "Abbott Libre Sense Glucose Sport Biosensor": "https://www.libresense.abbott/en/home.html",
    "continuous glucose monitor": "https://www.diabetes.org.uk/guide-to-diabetes/managing-your-diabetes/testing/continuous-glucose-monitoring-cgm",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "monitor glucose levels non-invasively using spectroscopy": "https://www.healthline.com/diabetesmine/non-invasive-diabetes-technology#how-does-it-work",
    "the SugarBEAT monitor": "https://www.healthline.com/diabetesmine/non-invasive-sugarbeat-cgm-diabetes",
    "Nemuara Medical": "https://nemauramedical.com/"
  }
}