{
  "source": "https://www.techradar.com/news/obi-wan-kenobi-series",
  "title": "Obi-Wan Kenobi series: new concept art, release date and everything we know about the Star Wars prequel show",
  "category": "entertainment",
  "updated": "2021-11-15T10:35:02Z",
  "author": "samuel-roberts",
  "summary": "Is the Force strong with the Disney Plus Star Wars series?",
  "article": [
    "Rumors of Obi-Wan Kenobi’s demise have been greatly exaggerated. While he was – famously – struck down by his former pupil, Darth Vader, in the original Star Wars back in 1977, the Jedi Master has remained a powerful presence in that galaxy far, far away.",
    "Now Old Ben’s getting his own TV show, which will debut on Disney Plus some time in 2022. Obi-Wan Kenobi is set ten years after the Jedi left the infant Luke Skywalker with his uncle and aunt on Tatooine – and begun his lonely exile as the boy's protector.",
    "Ewan McGregor is back to wield a lightsaber in the title role for the first time since 2005's Revenge of the Sith – a part he inherited from the late Alec Guinness. He'll be joined in the Obi-Wan Kenobi TV show by his prequels co-star Hayden Christensen, who's back as Anakin Skywalker – now (in)famously better known as Darth Vader. Deborah Chow, who directed two episodes of The Mandalorian, calls the shots, with Army of the Dead writer Joby Harold providing the scripts for the six-part series.",
    "Lucasfilm has revealed little about the plot, of course – aside from the fact it'll feature “the rematch of the century” – but the Disney Plus Day virtual event in November 2021 did give us a little more intel about the hotly anticipated show.H",
    "Here's everything we know about the Obi-Wan Kenobi TV series so far.",
    "Release date: Disney Plus Day, which took place on November 12, 2021, confirmed that the Obi-Wan Kenobi TV show will land on the streaming platform some time in 2022.",
    "Story: Specifics haven't been revealed yet, but we know it's set 10 years after Revenge of the Sith – that's 9 years before A New Hope. We also know it will feature Obi-Wan's mission to keep Luke Skywalker safe on Tatooine, and one hell of a duel between Kenobi and Vader, his former Padawan.",
    "Cast: Aside from Ewan McGregor and Hayden Christensen, returning actors to the Star Wars universe include Joel Edgerton and Bonnie Piesse (Owen and Beru Lars). There are also a whole host of newcomers to Star Wars – including Kumail Nanjiani, Indira Varma and Rupert Friend.",
    "The sneak peek released on Disney Plus as part of Disney Plus Day confirmed that the Obi-Wan Kenobi release date will be some time in 2022.",
    "The Obi-Wan Kenobi series began production in April 2021, and finished filming by September 2021 – that's according to Ewan McGregor, who talked a little bit about the show during the Emmys. According to the Hollywood Reporter (and other sources), the show will run for six episodes.",
    "According to StarWars.com and the Disney Plus Day teaser, Obi-Wan Kenobi is set 10 years after Revenge of the Sith, and therefore nine years before A New Hope – around the same time as the events of Solo: A Star Wars Story play out. At the end of Episode III, Obi-Wan defeated Anakin Skywalker in battle and left him to burn on the planet of Mustafar. Anakin's body was retrieved by Emperor Palpatine, and he was transformed into Darth Vader, beginning his reign of terror over the galaxy.",
    "Obi-Wan, meanwhile, worked with with Yoda and Senator Bail Organa, to hide Anakin and Padmé's children, Luke and Leia Skywalker. He took Luke to his Uncle Owen and Aunt Beru on Tatooine, and began his new life on the desert planet as a Jedi in exile.",
    "As far as we know, before this series starts, Obi-Wan has been hiding out on Tatooine for the last decade.",
    "There's no official trailer for the Obi-Wan Kenobi series yet. The closest thing is the behind-the-scenes sneak peek (only available to Disney Plus subscribers) released on Disney Plus Day in November 2021. This featured a mix of concept art, and talking head footage with Ewan McGregor and director Deborah Chow.",
    "“This is quite a dark time that we're coming into with [Obi-Wan],” explains Chow. “Just being a Jedi, it’s not safe. There’s Jedi hunters out there.”",
    "“At least he has this one task left which is to keep Luke safe,” continues McGregor, before Chow adds: “That's definitely a starting place for our story. The interesting thing is going to be where it goes from there.”",
    "They also tease the much vaunted return of McGregor's prequels Star Wars co-star Hayden Christensen as Darth Vader, his former apprentice.",
    "“We couldn't tell the story of Obi-Wan Kenobi without addressing Anakin or Vader,” says Chow. “...have another swing at each other,” adds McGregor. “It might be quite satisfying for everybody.”",
    "The concept art from the Disney Plus tease isn't available for non-subscribers yet, but some of the images can be viewed in this tweet:",
    "The images provide plenty of talking points. The first shows Obi-Wan Kenobi facing off against Darth Vader in some fiery location – could they be having a rematch at Mustafar, site of their fateful battle in Revenge of the Sith?",
    "The next shows Obi-Wan on the back of an eopie somewhere on Tatooine. He was riding one of these desert-based beasts of burden when he left the infant Luke Skywalker with his aunt and uncle at the end of Episode III.",
    "The third shows Stormtroopers at some vast (presumably Imperial) base. And the fourth is the most intriguing of all. Not because of the Stormtroopers, but because of the person with them. Could this be one of the Inquisitors? These Dark Side Force-wielders (one of whom was voiced by Buffy's Sarah Michelle Gellar in Star Wars Rebels) helped Vader hunt down the remaining Jedi after the Order 66 purge.",
    "The Inquisitors have already featured in Rebels (which takes place around five years after Obi-Wan Kenobi) and other canonical stories, so it would be logical if they crop up in the new TV show – presumably Obi-Wan is the Inquisitors’ most wanted target.",
    "Other images feature Vader in his shrine on Mustafar, some craft that look rather like the Snowspeeders from The Empire Strikes Back, and some new planet-scapes – one of which looks rather like something out of Blade Runner. Could this urban setting mean a return to Coruscant for Obi-Wan? Seeing as it's the seat of Imperial government, it would be a risky move for Kenobi, but if needs must...",
    "Deborah Chow confirmed in the Disney Plus Day video that the starting point for the series will be Obi-Wan carrying out his lonely assignment to protect Luke Skywalker on Tatooine. It sems that from there, he’ll soon be pulled into an adventure that takes him to other places throughout the Star Wars galaxy. While the specifics of the Obi-Wan Kenobi story remain as cloudy as a rookie Padawan’s visions of the future, canonical Star Wars stories do reveal some of the veteran Jedi’s activities during his post-Revenge of the Sith decade of exile on Tatooine.",
    "In the From the Journals of Obi-Wan Kenobi comics, Luke Skywalker discovers his old master’s diaries, which detail what Old Ben got up to. We know he was frustrated at having to keep his Jedi status secret (using a lightsaber would instantly give away his identity) and his inability to train the young Luke in the ways of the Force. Indeed, the boy’s Uncle Owen demanded that Kenobi keep his distance from the family and their moisture farm. Nonetheless, Obi-Wan does his best to protect the family – including saving Owen from a run-in with Wookiee bounty hunter Black Krrsantan.",
    "The big news about the Obi-Wan Kenobi story, however, is that the Jedi will once again meet his fallen apprentice Anakin Skywalker, who’s now terrorizing the galaxy as Darth Vader. Lucasfilm president Kathleen Kennedy has described the encounter as “the rematch of the century”, which goes without saying – but there are plenty of questions about how it comes to pass. When Obi-Wan left Anakin mutilated and burning on the volcanic surface of Mustafar, he must have assumed his former BFF was dead. So we’re guessing the fact that Skywalker Sr is alive and (almost) well as Darth Vader is going to become as a big shock – and could well be the revelation that pulls Kenobi out of his exile, especially if an Inquisitor comes knocking on the door of his hut. Remember, there’s no way Kenobi would risk the Empire or the Sith coming anywhere near Luke, the potential savior of the galaxy.",
    "Then there’s the flipside of the coin: if Vader realizes that Kenobi is alive, tracking him down and eliminating the man who left him for dead is bound to become an obsession – revenge is part of the Sith playbook, after all.",
    "Living on Tatooine will offer Kenobi a degree of protection – while it’s his home planet, we know Vader will be reluctant to return to the place his mother died – but never underestimate the power of the Dark Side. We already know that – after the destruction of the first Death Star, some nine years after the events of the Obi-Wan Kenobi TV show in canon – the Sith Lord traveled to Jabba’s palace to recruit a bounty hunter to track down a certain Force-sensitive pilot. In other words, Vader avoiding Tatooine isn’t a hard and fast rule…",
    "Vader and Kenobi’s eagerly anticipated rematch doesn’t have to violate canon, either. While we’d assumed their previous meeting had been that fateful encounter on Mustafar, the timeline is ambiguous. In A New Hope, Vader describes Kenobi as “a presence I’ve not felt since…” That “since” could mean any time in the previous two decades.",
    "Ewan McGregor will reprise his role as Obi-Wan Kenobi on-screen for the first time since 2005's Revenge of the Sith (though he had brief voice cameos in The Force Awakens and The Rise of Skywalker). As confirmed at Disney's Investor Day in December 2020, Anakin Skywalker actor Hayden Christensen will be joining him as Darth Vader.",
    "In April 2021, the full cast for the show was revealed. Joel Edgerton and Bonnie Piesse are confirmed for this series, so we expect them to reprise their Attack of the Clones and Revenge of the Sith roles as (Uncle) Owen and (Aunt) Beru Lars – the couple who raised Luke Skywalker after Obi-Wan left the infant on Tatooine. (Owen is the son of Cliegg Lars, the Tatooine moisture farmer who marries Anakin's mom, Shmi, in Attack of the Clones.)",
    "Other confirmed Obi-Wan Kenobi cast members include Kumail Nanjiani (The Big Sick, Eternals), Indira Varma (Game of Thrones), Rupert Friend (Homeland), O’Shea Jackson Jr (Straight Outta Compton), Sung Kang (who plays the the aptly named Han Seoul-Oh in the Fast and Furious series), Simone Kessell (The Crossing), and Benny Safdie (Good Time). In the Lucasfilm tradition, who they're all playing is a mystery.",
    "Another as-yet-unknown character will be played by PEN15 and Scoob! actor Maya Erskine. Deadline say Erskine will have a supporting role for at least three episodes – half of the TV show's rumored six-episode story arc – so Erskine's character may have a prominent role in proceedings.",
    "Venturing into the realms of speculation, there's a good chance some familiar Star Wars characters might enter Obi-Wan Kenobi's orbit in the new Disney Plus series.",
    "The biggest name who may be in line for a return is Luke Skywalker. Luke would be around 10 years old at the time the Obi-Wan Kenobi TV show is set, and it would be weird if he wasn't part of the mix. After all, Luke already knows \"Old Ben” at the start of A New Hope, and the whole reason for Kenobi's extended stay in Tatooine's Jundland Wastes was keeping an eye on the son of Skywalker. Also, if Uncle Owen and Aunt Beru cross paths with Kenobi, chances are Skywalker Jr isn't far away.",
    "When asked if he was doing screen tests with young actors vying to play Luke, McGregor said \"that's very possible\", before following up with a non-committal, \"I don't know\".",
    "At this point in the timeline, Yoda is alive on Dagobah. As far as they know, Yoda and Obi-Wan are the only two Jedi who survived the Emperor's Order 66 purge, so they may use the Force to make contact with each other. That could mean Frank Oz returning to a voice role he first played in The Empire Strikes Back in 1980 – and most recently reprised in The Rise of Skywalker.",
    "Wherever Darth Vader goes, Emperor Palpatine is usually pulling the strings, so we may see (or hear) more from the wonderful Ian McDiarmid.",
    "And (former Darth) Maul (Ray Park) is still at large in the era the Obi-Wan Kenobi TV show takes place – Solo: A Star Wars Story, set around the same time, revealed that Palpatine's former apprentice had taken control of the Crimson Dawn crime syndicate – so don't be surprised if he comes looking for the man who sliced him in two in The Phantom Menace. (Throughout Star Wars: The Clone Wars, Maul was obsessed with having his revenge on Kenobi, and they ended up facing each other for a final time in Star Wars Rebels, set around five years after the Obi-Wan show.)",
    "An Instagram post from Park in February 2021 may also hint at his return.",
    "There could also be a way back for Obi-Wan's old Master, Qui-Gon Jinn, even though he was killed by Maul in The Phantom Menace.",
    "At the end of Revenge of the Sith, Yoda told Obi-Wan that he'd been communing with Qui-Gon, who'd discovered a way to retain his consciousness after death. “In your solitude on Tatooine, training I have for you,” said Yoda. “An old friend has learned the path to immortality. One who has returned from the netherworld of the Force. Your old Master. How to commune with him I will teach you.”",
    "It seems unlikely that a franchise as fond of callbacks as Star Wars would miss the opportunity to pick up this particular plot thread. The question is, will Liam Neeson reprise the role? It wouldn't be the first time – he voiced Qui-Gon in episodes of Star Wars: The Clone Wars and Star Wars Rebels – but the actor denied he was going to appear in an interview with Jimmy Kimmel in June 2021 (via Entertainment Weekly).",
    "\"I heard Ewan McGregor was gonna do a series,\" said Neeson when Kimmel asked about his involvement. \"No, I don't think so. No, I haven't been approached. [Disney] don't have enough money!\"",
    "Of course, Neeson wouldn't be the first star of a major franchise to be economical with the truth regarding their involvement in an upcoming project – and besides, Disney are hardly short of cash.",
    "In other words, don't be surprised if Neeson dons the Jedi robes once again when the Obi-Wan Kenobi TV show lands on Disney Plus in 2022.",
    "The Obi-Wan Kenobi series reportedly began life as a movie back in 2017, with Billy Elliot director Stephen Daldry in early talks to make it. The project was subsequently abandoned, presumably in the wake of the disappointing box office performance of Solo: A Star Wars Story.",
    "In 2019, it was confirmed that an Obi-Wan Kenobi series was in the works, and was expected to start shooting in 2020. Writer Hossein Amini (Drive) was attached to write the show – by January 2020, it was reported he'd departed the project. In April 2020, Variety reported that Army of the Dead writer Joby Harold became the series' new writer.",
    "Finally, after a long wait, the series made it in front of the cameras in April 2021 in the capable hands of The Mandalorian director Deborah Chow, who directed season one episodes 'The Sin' and 'The Reckoning’.",
    "The Star Wars prequels remain contentious more than 15 years after George Lucas wrapped the movies up. Some of the commentary on the films from younger viewers suggests there's a generational divide on opinion around the prequels, probably helped by the well-received animated series The Clone Wars.",
    "For us, though, they never truly lived up to the promise of telling Darth Vader's true origin story, or making the Clone Wars seem all that interesting.",
    "Still, this series is an opportunity to build on the latent potential of the prequel setting – and to add extra dimensions to the relationship between Anakin and Obi-Wan. Salvaging the reputation of the films is probably too big an ask from this show, but continuing the story and finding something new to say about the characters is appealing. And whatever you think of the end result, McGregor was a consistent highlight of the three movies.",
    "If nothing else, the lightsaber battle on Mustafar was the most visually spectacular part of Episode III – if this truly is the rematch of the century, as Lucasfilm has been teasing, will we see the Obi-Wan Kenobi series try and top that? Let's hope so."
  ],
  "headers": {
    "8": "Obi-Wan Kenobi release date",
    "10": "When is the Obi-Wan Kenobi TV show set?",
    "13": "Is there an Obi-Wan Kenobi trailer?",
    "24": "What do we know about the Obi-Wan Kenobi story?",
    "30": "Obi-Wan Kenobi cast",
    "47": "The Obi-Wan Kenobi series has a weirdly long history",
    "50": "What we want from the Obi-Wan series on Disney Plus"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Disney Plus Day": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
    "who talked a little bit about the show during the Emmys": "https://www.techradar.com/news/obi-wan-tv-show-on-disney-plus-has-finished-filming-so-what-can-we-expect",
    "Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/ewan-mcgregor-obi-wan-star-wars-halston-4174111/",
    "StarWars.com": "https://www.starwars.com/news/future-lucasfilm-projects-revealed",
    "behind-the-scenes sneak peek": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1292136985658082000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fvideo%2Fbdb127ae-08b5-4b5a-8dd6-f2fede81006b",
    "As confirmed at Disney's Investor Day in December 2020": "https://www.techradar.com/news/disney-plus-confirms-its-making-10-marvel-and-10-star-wars-tv-shows",
    "the full cast for the show was revealed": "https://www.starwars.com/news/obi-wan-kenobi-series-cast",
    "Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "Fast and Furious series": "https://www.techradar.com/how-to/how-to-watch-the-fast-and-furious-movies-in-order",
    "Deadline": "https://deadline.com/2021/04/obi-wan-kenobi-disney-star-wars-series-adds-pen-15-star-maya-erskine-1234741064/",
    "that's very possible": "https://www.techradar.com/news/its-very-possible-obi-wan-kenobi-on-disney-plus-could-feature-luke-skywalker",
    "Instagram": "https://www.instagram.com/p/CLKedmLsssU/",
    "Entertainment Weekly": "https://ew.com/tv/liam-neeson-obi-wan-kenobi-series-qui-gon-jinn/",
    "Variety": "https://variety.com/2020/tv/news/obi-wan-kenobi-disney-plus-series-joby-harold-1234569286/",
    "commentary": "https://www.independent.co.uk/arts-entertainment/films/features/star-wars-revenge-sith-anniversary-prequels-defence-anakin-padme-a9519701.html"
  }
}