{
  "source": "https://www.techradar.com/news/slack-adds-record-number-of-paying-customers-last-year",
  "title": "Slack added record number of paying customers last year",
  "category": "computing",
  "updated": "2021-02-26T13:57:19Z",
  "author": "sead-fadilpasic",
  "summary": "Number of high-paying customers also grew significantly.",
  "article": [
    "Top online collaboration platform Slack has revealed it ended 2020 with a bang, recording strong growth and bringing in thousands of new paying customers.",
    "Parent company Salesforce said in its recently released financial results for the fourth quarter, that Slack brought in $250.6 million in total revenue in the three months leading up to January 2021.",
    "The platform also added 14,000 net new paid customers during the quarter, the report further added, saying the company grew its paying user base by 180% year-on-year.",
    "In total, Slack now counts 156,000 total paying customers, up 42% compared to the same period last year. Of that number, 0.7%, or 1,180 customers, are shelling out more than $100,000 a year for the service. The number of these high-paying clients also rose by almost a third (32%) year-on-year.",
    "The number of customers paying at least $1 million a year has also grown by more than half (51%), and now stands at 106. Looking at the year as a whole, Slack has had $902.6 million in revenue, up 43%.",
    "Salesforce acquired Slack in early December 2020 for the eye-watering sum of $27.7 billion. Overall, the CRM and software giant beat market expectations with its results for the quarter, reporting non-GAAP diluted earnings per share of $1.04, and revenue of $5.82 billion. That puts its revenue up by a fifth (20%) year-on-year. Analysts were looking for earnings of 75 cents, and revenue of $5.68 billion.",
    "\"We never could have predicted a year ago what was in store, which makes me incredibly proud of how well we pivoted our company to adapt to this pandemic world,\" Salesforce CEO Marc Benioff said. \"We had a record quarter and year by innovating more and faster than ever, enabling our customers to be successful from anywhere, and becoming more relevant and strategic than ever.\"",
    "Ever since the lockdown forced workers into a remote working setup, communications and collaboration tools have been recording stellar results.",
    "A recent report from digital experience management company Aternity found that usage of such tools has risen across the world – with Slack, Zoom, as well as Microsoft Teams all reporting three, and sometimes even four-figure percent growth.",
    "Via ZDNet"
  ],
  "headers": {
    "5": "A great year for Salesforce"
  },
  "links": {
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "financial results": "https://investor.salesforce.com/press-releases/press-release-details/2021/Salesforce-Announces-Strong-Fourth-Quarter-and-Full-Year-Fiscal-2021-Results--Raises-FY22-Revenue-Guidance-to-25.65-Billion-to-25.75-Billion/default.aspx",
    "Salesforce acquired Slack": "https://www.techradar.com/news/salesforce-confirms-multi-billion-dollar-slack-takeover",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "ZDNet": "https://www.zdnet.com/article/salesforce-beats-q4-estimates-slack-adds-record-number-of-paid-customers/"
  }
}