{
  "source": "https://www.techradar.com/news/what-is-google-pixel-pass",
  "title": "What is Google Pixel Pass? The Pixel 6 subscription system explained",
  "category": "phones",
  "updated": "2021-10-20T00:03:50Z",
  "author": "james-rogerson",
  "summary": "Pixel Pass is an Apple One rival",
  "article": [
    "The Google Pixel 6 and Pixel 6 Pro are finally here, but alongside those Google also launched a new service known as Pixel Pass.",
    "This is essentially Google’s take on Apple One, bundling several services together under one monthly subscription. But the exact selection of services differs quite a bit from Apple's offering - and you even get a Pixel phone as part of it.",
    "Below then we’ll run you through exactly what Pixel Pass gets you, and how you can go about signing up for it.",
    "Google Pixel Pass has both a hardware and software component. On the hardware front, you get either a Pixel 6 or a Pixel 6 Pro.",
    "In terms of software, you get a subscription to Google Play Pass (Google’s service that gives you access to various premium apps and games), YouTube Premium, YouTube Music Premium, and Google One (which gives you 200GB of cloud storage).",
    "Additionally, you also get Preferred Care coverage for your Google Pixel phone. This offers cover against accidental damage and mechanical breakdowns.",
    "Pixel Pass is $45 (around £30 / AU$60) per month with the Pixel 6 and $55 (roughly £40 / AU$75) per month with the Pixel 6 Pro, with availability only currently confirmed for the US.",
    "It will take 24 months to pay off the phone as part of Pixel Pass, but if you decide it's not for you then you can cancel at any time and just pay off the remaining balance of your handset.",
    "However, if you stick with Pixel Pass then you'll save up to $294 over two years versus buying all of these services and a Pixel separately.",
    "Presumably you would then also be able to upgrade to a new Pixel through Pixel Pass after the two years, but that hasn't been confirmed.",
    "Pixel Pass is only currently available in the US, and to get it you can sign up either through the online Google Store, or with a phone plan on Google Fi.",
    "If you purchase through Google Fi then you'll also save $5 off your monthly Fi plan, bringing the total savings up to $414 over two years.",
    "Pixel Pass is available to pre-order now along with your Pixel 6. The phone ships on October 25, and if you buy it with Pixel Pass then it will be unlocked, so you can use it with any carrier.",
    "Apple One has three tiers, with the basic tier giving you access to Apple Music, Apple TV Plus, Apple Arcade, and giving you 50GB of iCloud storage. The next tier up is designed to be shared with up to five family members, and gives you the same but with 200GB of iCloud storage.",
    "Then there’s a ‘Premier’ option which you can also share and gives you all that but with 2TB of cloud storage, along with Apple News Plus and Apple Fitness Plus.",
    "Pixel Pass doesn't have multiple tiers like this, so it’s an all or nothing situation - though you do get to choose which Pixel 6 model to get it with.",
    "Overall though, Pixel Pass has a similar selection of services to Apple One, outside of the Premier tier, as there’s no fitness or news aspect listed for Pixel Pass.",
    "However, Apple One doesn’t include an actual phone, or the damage and breakdown cover that you get here, and the basic tier of Apple One has less cloud storage - though given the lack of hardware it also comes in at a much lower price than Pixel Pass.",
    "So while Pixel Pass has more to it, arguably Apple’s subscriptions give you more ability to tailor them to your needs, by choosing the features that you want."
  ],
  "headers": {
    "3": "What do you get with Pixel Pass?",
    "6": "How much does Pixel Pass cost?",
    "10": "How do you get Pixel Pass?",
    "12": "When will Pixel Pass launch?",
    "13": "How does Pixel Pass compare to Apple One?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "Apple One": "https://www.techradar.com/news/apple-one-subscription-service-release-date-price-and-news",
    "Google Play Pass": "https://www.techradar.com/news/google-play-pass",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus"
  }
}