{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-could-be-pushed-to-the-end-of-october-actually",
  "title": "Samsung Galaxy S21 FE release date could be pushed to the end of October, actually",
  "category": "phones",
  "updated": "2021-09-09T10:22:27Z",
  "author": "david-lumb",
  "summary": "The Galaxy S21 FE coming September 8? Make that Halloween",
  "article": [
    "The Samsung Galaxy S21 FE has seen tons of rumors around its launch, including one claiming it’ll come out September 8 , so what’s one more? The latest claim: the phone’s release date will be October 29.",
    "That’s what leaker Jon Prosser is claiming in a tweet and on Front Page Tech, noting his sources told him the phone will be open for pre-orders on October 20 and go on sale October 29. Prosser was careful to note that he didn’t have an announcement date yet, and while the pre-order date is a good guess, Samsung could choose to unveil the phone earlier.",
    "Whether that’s at an event or just a simple online announcement, we haven’t a clue. The rumor says the phone will come in 128GB or 256GB storage options, and consumers can pick between Graphite, White, Olive Green, and Lavender hues.",
    "Yes, we did just see Prosser predict nearly the exact same date of October 28 as the Google Pixel 6 release date. And while there’s always a chance (however small) that his inside sources and info are conflating both phones, there’s more going on in the phones world that could cause these release dates to align.",
    "First is the rumored delays surrounding the S21 FE, which may have been slated for reveal at the August 11 Samsung Unpacked event. While it was packed with other reveals, like the Samsung Galaxy Z Fold 3, Samsung Galaxy Z Flip 3, and Samsung Galaxy Watch 4, it was also likely the last opportunity for the phonemaker to reveal its affordable flagship S21 Fan Edition (FE).",
    "The S21 FE didn’t launch then, and rumors have suggested the Covid-related global chip shortage had even led Samsung to cancel the phone only to recommence production – so a late October release date, as Prosser suggests, could make sense.",
    "That leaves the Google Pixel 6, but even late October isn’t out of line considering every previous Pixel phones (and even some of the later Nexus handsets) launched in mid-October. Given the Google Pixel 5a was released in August, it isn’t too late to see a flagship Google Pixel 6 only a couple months later, mimicking last year’s release schedule.",
    "And we can only imagine Samsung and Google are fine to avoid launching in September, when we expect Apple to unveil its iPhone 13 range.",
    "Via Android Central"
  ],
  "headers": {
    "3": "Analysis: Wait, didn’t I just read a Prosser release date leak for late October?"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "claiming": "https://www.techradar.com/news/samsung-galaxy-s21-fe-might-finally-make-an-appearance-on-september-8",
    "tweet": "https://twitter.com/jon_prosser/status/1433124101187678209",
    "Front Page Tech": "https://www.frontpagetech.com/2021/09/01/exclusive-samsung-galaxy-s21-fe-launching-october-29th/",
    "predict": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "slated": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-launch-in-august-per-leaked-roadmap",
    "global chip shortage": "https://www.techradar.com/news/intel-ceo-says-chip-shortage-could-stretch-into-2023",
    "cancel": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-be-canceled-according-to-mysterious-report",
    "recommence": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Android Central": "https://www.androidcentral.com/samsung-galaxy-s21-fe-october-launch?utm_source=ac_tw&utm_medium=tw_card&utm_content=103731&utm_campaign=social"
  }
}