{
  "source": "https://www.techradar.com/news/dji-mavic-3-vs-mavic-2-pro-is-djis-new-drone-worth-the-premium",
  "title": "DJI Mavic 3 vs Mavic 2 Pro: is DJI's new drone worth the premium?",
  "category": "cameras",
  "updated": "2021-11-13T09:00:08Z",
  "author": "andrew-williams",
  "summary": "The DJI Mavic 3 is here, but how big an upgrade is it?",
  "article": [
    "The DJI Mavic 3 is the successor to 2018’s DJI Mavic Pro 2, which is still one of the most powerful folding drones money can buy.",
    "Despite the Mavic 2 Pro's aerial prowess, the Mavic 3 does significantly improve on the three-year-old drone in most areas. DJI's new flying machine is more nimble, has better slo-mo capabilities, brings a dedicated 'zoom' camera, offers higher-resolution capture from a much larger sensor, and boasts a longer flying time.",
    "There’s now no reason to buy the old Mavic 2 Pro unless you find it going for cheap in the Black Friday drone deals, as many of its talents are now offered by the smaller DJI Air 2S.",
    "In this comparison, we’ll look much deeper into the Mavic 3's changes to see if it's worth the big price jump over its predecessor. But let’s start with the damage the high-end DJI Mavic 3 will do to your finances.",
    "You can get three versions of the DJI Mavic 3. The standard version just includes the bits you need to get flying. One battery, a charger, the drone and some propellors. It costs $2,199 / £1,879 / AU$3,099.",
    "At this level, DJI’s Fly More combo may be a better bet. It includes three batteries instead of one, a battery charging hub, a carrying bag, spare propellors and a set of four neutral density filters. It costs $2,999 / £2,549 / AU$4,199.",
    "The Cine Premium Mavic 3 is the pro’s choice. It has a 1TB SSD built-in and supports Apple ProRes 422 HQ. You get all the extras from the Fly More bundle, plus a 10Gbps data cable and DJI’s new RC Pro controller with a searing 1000-nit display.",
    "This lot costs $4,999 / £4,279 / AU$7,199. Ouch.",
    "Even at its original pricing the DJI Mavic 2 Pro was a notably more affordable drone – it started at $1,599 / £1,349 / $2,499.",
    "However, that was before the pandemic and global chip shortage started. The Mavic 3 also has a lot more tech inside — it’s not just a drone that keeps pace with three years’ worth of tech advancements.",
    "DJI has refined the design of the Mavic series. The Mavic 3 is slightly smaller than the Mavic Pro when folded up, but significantly larger when unfolded – in both cases without the propellors attached.",
    "Want the stats? The DJI Mavic 3 measures 212×96.3x90.3mm folded up, compared to the Mavic 2 Pro’s 212.86×99.83x93.04 mm.",
    "When unfolded the Mavic 3 spreads out to 347.5×283x107.7mm, compared to the Mavic 2 Pro’s 319.55 × 256.46 x 90.5mm.",
    "Despite this change, the new drone is slightly lighter than its predecessor, at 895g. That is 12g less than the 907g Mavic 2 Pro.",
    "These improvements to weight and portability aren’t huge wins on their own. However, DJI says the new design results in 35% less drag, allowing for higher speeds and more efficient use of the battery.",
    "Here’s the big one. DJI makes major changes to the camera hardware in the Mavic 3.",
    "The Mavic 2 Pro has a 20MP 1-inch sensor, which we were hugely impressed by in 2018. It still holds up beautifully today. However, DJI has upgraded the sensor size to Four Thirds on the Mavic 3, which was one of the most popular sensor types for standalone mirrorless cameras until we all became obsessed with full-frame models.",
    "This upgrade means better low-light performance and higher dynamic range – in fact, DJI claims the sensor has native dynamic range of 12.8 stops. No such stats were released for the last model, but this sensor is a major improvement.",
    "The lens has changed, too. We get a wider field of view this time, 84 degrees instead of 77. This is the equivalent of switching from a 28mm lens to a 24mm one.",
    "Just as important, the Mavic 3 has a second camera. This is a 1/2-inch 12MP sensor whose lens has an equivalent focal length of 162mm lens. It this context that's the same as having 6.75x zoom.",
    "It doesn't offer true optical zoom, though – this is another 'prime' lens, so is intended to focus on a completely different sort of subject than you might use the 24mm for. And you can zoom in further with digital zoom – the 4x magnification provides a total zoom range of 28x.",
    "As with the Mavic 2 Pro, results are going to be compromised the more you use the digital zoom. But adding that second full optical field of view is a huge boost to the drone’s versatility. It also shows DJI’s confidence in its gimbal system. Asking a camera stuck in mid-air, battling with the wind, to shoot at up to 28x zoom is no small request.",
    "Alongside a better sensor and a second zoom camera, the Mavic 3 gets upgraded capture and slo-mo modes.",
    "The highest resolution you can shoot at with the Mavic 2 Pro is 4K, at 30 frames per second. True slo-mo of 120fps is only available at Full HD resolution.",
    "A lot has changed since 2018. The Mavic 3 can shoot 120fps video in 4K or DCI 4K resolutions. It can reach further in both resolution and frame rate than its predecessor, too.",
    "5.1K shooting is available at frame rates of up to 50fps, while 200fps recording is possible at 1080p. Consistent with these big upgrades, the max bit-rate is now 200Mbps (H.264) and 140Mbps (H.265), instead of 100Mbps.",
    "Much higher bitrate Apple ProRes 422HQ is on offer too, but only if you get the 'Cine' version of the Mavic 2. This bungs in a 1TB SSD, to let it handle the very high bit-rates of ProRes. DJI asks for a heck of a lot of extra money for the Cine edition.",
    "You can pick up a top-spec 1TB SATA SSD (which is what this drive is, judging by its read/write specs) for around $100-$140. DJI charges an extra $1,700 over the Mavic 3 Fly More Combo. While there may be more to it, including ProRes licensing fees and a significantly more advanced controller, this seems to be a case of DJI recognizing this is a real professional tool, and charging accordingly.",
    "The DJI Mavic 3 is not hugely faster than the DJI Mavic 2 Pro in optimal conditions, but it is a lot more nimble. DJI rates their maximum speeds at 21 m/s and 20 m/s, respectively.",
    "However, there’s a much greater difference in their ascent and descent rates. As usual, the Mavic 3 has a normal “P” flight mode and the “S” sporty mode. In the latter it can descend at up to 6 m/s, ascend at up to 8 m/s. That is a lot more than the 3 m/s descent and 5 m/s ascent rates of the Mavic 2 Pro.",
    "Such speeds may not really be necessary if you’re after classic smooth drone pans from up high. But it’s nice to have the option there.",
    "The Mavic 3 uses a heavier, higher capacity battery than the Mavic Pro 2. It’s a 5,000mAh (77Wh) cell, to its predecessor’s 3,850mAh (59Wh) one. The difference in weight here more than wipes out the drop in the weight of the Mavic 3's body. This new battery weighs 335g, to the old one’s 297g.",
    "Flight times increase quite dramatically on the Mavic 3, though. On a still day you can expect the Mavic 3 to fly for up to 46 minutes instead of 31 minutes. DJI says it will hover in place for up to 40 minutes, compared to 29 minutes in the older drone.",
    "Significantly increased range make the Mavic 3’s longer flying time more than just a 'nice to have' extra. It has a maximum communication range of 15km, compared to 10km in the Mavic 2 Pro. This will depend on the country in which the drone is bought and flown in, though. The 15km range is an FCC standard, applicable in the US and Canada.",
    "DJI achieves this by doubling the number of antennas from two to four. The Mavic 3 also supports Wi-Fi 6, which allows for much greater wireless data transfer rates.",
    "The clearest benefit is in the quality of the preview image. While both generations can use a 1080p resolution Live View with DJI’s Remote Controller, the Mavic 3 offers a 60fps preview where the Mavic 2 Pro is stuck with 30fps.",
    "Wi-Fi 6 also enables genuinely snappy wireless transfer of captured video, at up to 80MB/s. The Mavic 2 Pro’s OcySync 2.0 lets you download at 5MB/s (40Mbps).",
    "Thanks to the big gap between these drones’ release, the Mavic 3 has an obstacle avoidance system that's three numbered generations ahead of the Mavic 2 Pro’s. It’s ActiveTrack 5.0 (at least after a firmware update in January 2022), where the old model has ActiveTrack 2.0.",
    "The main differences here are in the lenses used by the detection cameras, which sit at each corner of the drone’s body. This time we get wide-angle fisheye cameras, offering wider coverage.",
    "For example, the Mavic 3’s 'forward vision system' has a vertical field of view of 103 degrees, to just 70 degrees in the Mavic 2 Pro. Horizontal vision is upgraded from 40 degrees to 90 degrees. All of the navigation cameras have been boosted in similar fashion.",
    "The GPS system has changed, too. Where the old Mavic 2 Pro can communicate with the standard GPS and GLONASS arrays, the Mavic 3 can also use the EU’s Galileo and China’s Beidou. With more points of reference on tap, the drone is less likely to get confused or lost.",
    "The DJI Mavic 3 is a major step up from the Mavic 2 Pro. Our DJI Mavic 3 review found the footage to be \"nothing short of excellent overall\", which is to be expected from that jump to a Four Thirds sensor.",
    "The Mavic 3's improvements aren't just down to sensor size, either. The ability to shoot 4K at 120fps is what many have wanted, while the improved flight time over the Mavic 2 Pro is a big bonus – even if in real-world terms, you only get 30 minutes of flight before it starts suggesting you should 'Return to Home'.",
    "But is all of this worth an almost 40% price increase from the Mavic 2 Pro? We think most non-professionals will be better off with the DJI Air 2S, which offers most of the Mavic 2 Pro's features (aside from variable aperture for controlling exposure in mid-air) in a smaller, more affordable bundle.",
    "While we think the DJI Mavic 3 is a fantastic drone today, it needs a promised firmware update in January 2022 – which will bring features like ActiveTrack 5.0 – to realize its full potential. Also, the Mavic 3's more limited second camera, which can only shoot images in JPEG and standard video (not raw), means the DJI Mavic 2 Zoom isn't entirely redundant yet either.",
    "The DJI Mavic 3 is undoubtedly one of the most powerful drones you can buy today, but that power also comes with downsides that make its appeal a bit more limited than its predecessor."
  ],
  "headers": {
    "4": "DJI Mavic 3 vs Pro 2: Price",
    "10": "DJI Mavic 3 vs Pro 2: Design",
    "15": "DJI Mavic 3 vs Pro 2: Cameras",
    "22": "DJI Mavic 3 vs Pro 2: Video modes",
    "28": "DJI Mavic 3 vs Pro 2: Performance",
    "37": "DJI Mavic 3 vs Pro 2: Obstacle avoidance and GPS",
    "41": "First Impressions"
  },
  "links": {
    "Black Friday drone deals": "https://www.techradar.com/black-friday/black-friday-drone-deals",
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "DJI Mavic 3 review": "https://www.techradar.com/reviews/dji-mavic-3"
  }
}