{
  "source": "https://www.techradar.com/news/japans-biggest-dating-app-hit-by-major-cyberattack",
  "title": "Japan's biggest dating app hit by major cyberattack",
  "category": "computing",
  "updated": "2021-05-24T10:35:34Z",
  "author": "sead-fadilpasic",
  "summary": "Personally identifiable data on almost two million Omiai users exposed",
  "article": [
    "Popular Japanese dating app Omiai has reportedly been hacked, with the personally identifiable data of almost two million users most likely exposed.",
    "According to reports the company that runs the app - Net Marketing Co - has notified the public of multiple unauthorized incursions into its servers during April this year.",
    "During those incursions, the (still unknown) attackers made away with user names, photographs, as well as data from ID cards, driver’s licenses and passports, which were mandatory during registration, for KYC (know your customer) purposes.",
    "No payment or credit card data were compromised, the company confirmed.",
    "While the service is free for women, it’s not free for men. In order to register and use the service, men need to pay for one of its subscription plans, which start at roughly $40 a month.",
    "According to multiple media reports, the app has between five and seven million users and has facilitated more than 50 million successful matches so far. It focuses on trying to offer its customers an opportunity of a long-term relationship, rather than a short-term fling or a one-night stand.",
    "Net Marketing Co says it still hasn’t found any proof of the stolen data being used in the wild, or in the black market. However, if Ashley Madison is any indication, the worst is yet to come.",
    "Ashley Madison is a dating app used for extramarital affairs, that was breached in 2015. The data that was leaked online was believed to have been used against multiple individuals as extortion leverage, leading to at least two suicides.",
    "The news of the breach was also felt on the Tokyo Stock Exchange, where the company’s listed. Bloomberg said the value of Net Marketing’s shares fell 19% at market close on Monday - the biggest drop since the company got listed in 2017. Net Marketing Co is valued at approximately $70 million.",
    "Via: Bloomberg"
  ],
  "headers": {
    "5": "Omiai breac"
  },
  "links": {
    "personally identifiable data": "https://www.techradar.com/best/best-identity-management-software",
    "payment": "https://www.techradar.com/best/best-payment-gateways",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-24/millions-of-accounts-exposed-in-hack-of-leading-japan-dating-app"
  }
}