{
  "source": "https://www.techradar.com/news/using-outlook-for-emails-may-finally-get-less-annoying",
  "title": "Using Outlook for emails may finally get less annoying",
  "category": "computing",
  "updated": "2021-06-15T09:50:27Z",
  "author": "mike-moore",
  "summary": "Chrome and Edge set to get an Outlook extension at last",
  "article": [
    "Microsoft is set to make a major upgrade to its Outlook email service that should make it much easier to use on some of the most popular browsers around.",
    "The company has revealed it is at work on a browser extension for Outlook on Microsoft Edge, as well as a version for Google Chrome.",
    "Microsoft says that the new release, which will also cover Exchange for Business, is still in development at the moment, but should roll out before the end of July 2021.",
    "In a posting on the Microsoft 365 roadmap, the company stated that the update would \"brings you the power of mail, calendar, contacts, and tasks using an icon in Microsoft Edge\".",
    "The extension will allow users to quickly access their Outlook work account or Outlook.com or Hotmail account without needing to switch to another tab or app.",
    "Microsoft 365 already has a similar extension within Edge, where users can click on the platform's icon to get a quick-access dropdown menu of all the top tools they need.",
    "Google also has something similar for its Workspace suite of tools, with users able to access the likes of Docs, Sheets, Meet and more by clicking on an icon in any new tab.",
    "The update is the latest release from Microsoft as it looks to ensure Outlook is part of the new hybrid working world of work as employees return to offices around the globe.",
    "To support this change, the company recently revealed that Outlook calendar markers will soon automatically contain links to join meetings via the web. The feature will support Teams and Skype sessions only, although Microsoft has suggested third-party video meetings may become compatible later down the line.",
    "Outlook itself may be getting a whole new look for this new world of work, with a recent post from Microsoft apparently showing a unified email client for Windows 10 that will replace the current Mail and Calendar apps shipping with its operating system.",
    "When released, the new client, dubbed Project Monarch, will reportedly work across Windows 10, macOS and the web, allowing Microsoft to replace the existing Outlook Win32, UWP and Outlook for Mac clients with a single unit offering a unified experience across platforms in a similar way to how Outlook for the web works.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Outlook extension"
  },
  "links": {
    "email": "https://www.techradar.com/best/best-email-clients",
    "browser": "https://www.techradar.com/best/browser",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Microsoft 365 roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1205814604278477800&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D82036",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "automatically contain links to join meetings via the web": "https://www.techradar.com/news/microsoft-outlook-update-lays-foundation-for-hybrid-working-future",
    "getting a whole new look": "https://www.techradar.com/news/outlook-for-windows-10-could-be-getting-a-whole-new-look",
    "MSPowerUser": "https://mspoweruser.com/microsoft-is-working-on-an-office-365-extension-for-edge-and-chrome/"
  }
}