{
  "source": "https://www.techradar.com/news/microsoft-edge-now-lets-you-know-just-how-great-sleeping-tabs-are",
  "title": "Microsoft Edge now lets you know just how great Sleeping Tabs are",
  "category": "computing",
  "updated": "2021-07-23T10:47:19Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Resource-saving features now advertises its brilliance",
  "article": [
    "Microsoft are bringing Sleeping Tabs to Edge, as a way of reducing the load that's been prevalent in previous versions of the web browser.",
    "The advent of tabbed browsing was both a blessing and curse. While making it easier to keep several sites open at once, it also makes it easier to have loads of sites open at once. And with each tab gobbling up memory, tabbed browsing can be a serious drain on system resources.",
    "To help combat this, this is where Sleeping Tabs come in, essentially hibernating inactive tabs to reduce their resource usage, freeing up memory for other purposes.",
    "If you've ever wondered just how effective the feature is, now you can find out.",
    "There is an element of trust at play here. Sure, it's nice to be told that the browser feature is saving you resources, but have you ever taken the time to check how much RAM is free and how much CPU usage there is when a tab is asleep compared to when it's active? Probably not; you just trust that the feature's working.",
    "But now Microsoft is being a little more up front about what's going on. In the latest Canary build of Edge, if you hover your mouse cursor over a sleeping tab, you'll see a pop-up that lets you know estimated savings. The feature was first spotted by the ever-vigilant Leo Varela who shared the news on Reddit.",
    "There is a difference between being told that there is a 43 percent saving, and knowing that there's a 43 percent saving.",
    "Laptop users may be able to back up the information that's provided by the informative popup by simply noticing that their battery life is improved, but unless you're willing to run the numbers and benchmarks, you're just going to trust that Edge is giving you reliable information.",
    "But the provision of this information raises a question. Does having Edge calculate the resource usages savings that are being made actually eat into those very same resource usage savings? To answer is, undeniably, \"yes\", but the impact is so negligible that it is a small price to pay for the extra information you're being provided with.",
    "Putting inactive tabs to sleep is not something that is unique to Edge. As the browser is based on the Chromium engine, it is hardly surprising that Chrome includes very much the same feature. Google has called its implementation Tab Freezing, but the basic idea is identical between the two browsers.",
    "But as Microsoft has shown time and time again, the move to being a Chromium-based browser has been about much more than just copying features from Chrome.",
    "With Sleeping Tabs, the same functionality has been given to Edge users, but Microsoft has also given a little more. The company is clearly taking big steps to convince more and more people to make the jump to Edge, continuing to shake off the shackles of its rocky reputation with browsers that stems from Internet Explorer and the legacy version of Edge.",
    "Via MSPoweruser"
  ],
  "headers": {
    "4": "To sleep, perchance to dream",
    "9": "Analysis: Edge is copying and improving"
  },
  "links": {
    "Leo Varela": "https://www.reddit.com/r/MicrosoftEdge/comments/opkocn/sleeping_tabs_you_can_now_see_the_estimated/?context=3",
    "MSPoweruser": "https://mspoweruser.com/edges-sleeping-tabs-will-now-tell-you-how-much-resources-its-saving/"
  }
}