{
  "source": "https://www.techradar.com/news/spider-man-far-from-home-wont-feature-andrew-garfield-actor-says-is-the-hype-out-of-control",
  "title": "Spider-Man 3 won't feature Andrew Garfield, actor says – is the hype out of control?",
  "category": "entertainment",
  "updated": "2021-05-05T09:07:33Z",
  "author": "samuel-roberts",
  "summary": "Is the third Spidey movie the most overhyped film to hit the MCU?",
  "article": [
    "Andrew Garfield, who played Peter Parker in 2012's The Amazing Spider-Man and its 2014 sequel, has denied that he will reprise the role in the upcoming Spider-Man: No Way Home.",
    "Speaking to Happy Sad Confused's Joshua Horowitz, the actor was pretty clear in his denial of the constant rumors, which have suggested both him and Tobey Maguire will reprise their Spidey roles in the third MCU movie – something current Peter Parker actor Tom Holland has also denied.",
    "\"There isn’t anything to ruin, bro!\" Garfield says, explaining he hasn't had the call from Sony about reprising the part. \"I had to just quickly cut you off – there’s nothing to ruin! It’s so crazy! Dude, it’s fucking hilarious to me, because I do have this Twitter account, and I see how often Spider-Man is trending, and people freaking out about a thing.\"",
    "Asked again to rule out his involvement, Garfield was clear. \"Listen, I would've gotten a call by now, that's all I'm saying.\"",
    "Very little is known about this movie to date – it's scheduled to release in December, but actors Jamie Foxx and Alfred Molina have both said publicly that they're in the film, reprising their past villain roles as Electro and Doc Ock respectively. This has created a lot of speculation that the movie is dealing with parallel universes, or perhaps incorporating the Spider-Verse universe in live-action, somehow.",
    "The rumors, however, have been getting out of control – actor Charlie Cox, who played Matt Murdock in Netflix's Daredevil show, has also been rumored to appear in the movie. This would be a surprise, since the Netflix shows have widely been considered separate to the MCU movies canon. Wild rumors have even suggested Willem Dafoe's Norman Osborn, aka Green Goblin, will also re-emerge in this movie.",
    "You'll find out for yourself when the movie hits theaters on December 17, 2021.",
    "It does feel like particularly engaged Marvel fans are setting themselves up for trouble with the level of hype for this movie. The prospect of a Multiverse-flavored storyline – one we know will feature Benedict Cumberbatch's Doctor Strange – basically means that anything can happen, in theory.",
    "Garfield does seem very firm, here, but in a movie that features a villain from his era of Spider-Man, you can see why onlookers still hope he might pop up in the film. As people have pointed out, even if he was in the film, it's unlikely he'd just spoil the surprise in a middle of a friendly interview.",
    "Really, though, it's best not to dwell on any of the rumors for this movie. Some of them have turned out to be true – like Molina appearing in the movie – but the wilder ones are bound to be false. Going in with expectations in check, or trying not to read too much about the movie's plot, seems like a good move."
  ],
  "headers": {
    "7": "Is this the most overhyped movie ever?"
  },
  "links": {
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Happy Sad Confused": "https://www.patreon.com/happysadconfused"
  }
}