{
  "source": "https://www.techradar.com/news/nikon-z6-ii-and-z7-ii-cameras-are-getting-upgrades-that-filmmakers-will-love",
  "title": "Nikon Z6 II and Z7 II cameras are getting upgrades that filmmakers will love",
  "category": "cameras",
  "updated": "2021-02-19T12:22:53Z",
  "author": "rhys-wood",
  "summary": "Take your trusty full-frame Nikon ally to the next level",
  "article": [
    "Nikon has announced that it will be rolling out big firmware updates for the Nikon Z6 II and Nikon Z7 II cameras as early as next week. And the news came alongside the unveiling of the new Z6 II Essential Movie Kit, which includes accessories like a cage, external recorder and spare batteries to help turn it into a powerful filmmaking rig.",
    "You’ll be able to download the new firmware version 1.10 for both cameras from February 25 at the download centers for the Nikon Z6 II and Z7 II. This will bring improvements to Eye-Detection AF functionality on both cameras, with Nikon stating that it’ll ensure they can detect human eyes from a greater distance, or when the subject’s face is smaller within the frame. You should notice the improvements in both auto-area AF and wide-area AF.",
    "The firmware update also adds 4K/60p support to the Nikon Z6 II’s recording options, but there is an unfortunate catch here – Nikon states that this option will fix the image area at the DX-based movie format, with movie quality fixed to Normal, which means it won’t be available for uncropped full-frame shooting.",
    "Still, rounding out the firmware update is the enabling of raw video output to external recorders like those from Blackmagic, with this option available on both the NIkon Z6 II and Z7 II. This means filmmakers will be able to make use of the Blackmagic raw and ProRes raw formats, allowing for higher frame rates and HDR image quality.",
    "These are great firmware updates to two cameras that are both ranked highly in our guide to the best cameras. But what if you’re a keen filmmaker who fancies using either the Z6 II or Z7 II for your next project, but haven’t yet taken the plunge on buying one?",
    "This is why Nikon has also announced the Essential Movie Kit, which will be available to buy from the end of February. The bundle will cost £2,909 (Nikon hasn’t yet announced pricing for the US or Australia) and will include a Nikon Z6 II full-frame mirrorless camera with raw video output enabled out of the box.",
    "You’ll also get a very handy bundle of accessories, including an Atomos Ninja V external recorder, Nikon FTZ Mount Adapter and a SmallRig quick-release camera cage, alongside two extra batteries and other extras like a coiled HDMI cable.",
    "A similar bundle was available for the original Nikon Z6 and it highlights the video powers of some of the latest hybrid mirrorless models, which are increasingly among the best 4K cameras you can buy."
  ],
  "headers": {
    "4": "Video stars"
  },
  "links": {
    "Nikon Z6 II": "https://downloadcenter.nikonimglib.com/en/products/556/Z_6II.html",
    "Nikon Z7 II": "https://www.techradar.com/reviews/nikon-z7-ii",
    "Z7 II": "https://downloadcenter.nikonimglib.com/en/products/558/Z_7II.html",
    "best cameras": "https://www.techradar.com/news/best-camera",
    "best 4K cameras": "https://www.techradar.com/news/best-4k-camera"
  }
}