{
  "source": "https://www.techradar.com/news/among-us-new-roles-finally-makes-the-game-worth-playing-again",
  "title": "New Among Us roles finally make the game worth playing again",
  "category": "gaming",
  "updated": "2021-11-10T12:44:56Z",
  "author": "adam-vjestica",
  "summary": "Four new roles shake things up",
  "article": [
    "Among Us has received a significant new update that adds new roles to the smash-hit social deduction game, which should reignite jaded fans’ interest.",
    "The update, which is available now on PC, Nintendo Switch, and mobile, adds the Scientist, Engineer, Shapeshifter, and Guardian Angel roles to the game, and each comes with its own unique ability.",
    "The Scientist role lets you check for player deaths without needing to find a body, while the Engineer role lets you use vents to move around the map – an ability that was previously only available to imposters.",
    "Meanwhile, the Guardian Angel role can shield crewmates from dying, and the Shapeshifter role lets imposters disguise themselves as any other crewmate easily.",
    "It’s clear that these new abilities will open up several new gameplay possibilities in Among Us, and should shake up the formula quite considerably. However, purists will be pleased to know that they can be customized or turned off completely if you want to stick to the original game.",
    "The Among Us update also introduces new cosmetics for players to unlock and purchase. Known as Cosmicubes, players can now unlock more cosmetics via a branching system, and there will be both paid and free varieties.",
    "New visor cosmetics, special nameplates, and additional pets, hats, and skins have also been added, so you can make your crewmate look as hip and stylish as you please. It’s worth noting that developer Innersloth stressed that all cosmetics are purely visual and do not have any effect on gameplay or gameplay options, which is a relief.",
    "But that’s not all for Among Us’ latest update. The game now also has achievements, account linking (except on Nintendo Switch) and means there will be a bevy of new content for new players to dive into ahead of the game’s launch on PlayStation and Xbox platforms on December 14.",
    "Among Us rose to prominence in 2020, and enjoyed particular success during the pandemic as people found more ways to socialize and spend time with friends online during lockdown. Unlike some other apps like Houseparty, which quickly tailed off once society got back to normal, Among Us has managed to continue its success.",
    "There’s plenty of new things to discover in Among Us, then, and these new additions will only help entice lapsed players to return to the game and sus out the imposter once again. Innersloth has also promised that more updates are on the way, including a new map, more roles, and other gameplay features, which will be welcomed by the game’s active community.",
    "It’s nice to see that Innersloth stayed true to its word, too, adding roles that we’ve seen in mods like ‘Town of Us’ but giving them a different spin. The Engineer role can vent like other versions we’ve seen before but can’t fix sabotages, while the Guardian Angel can shield players, like Town of Us' Medic role, but a crewmate has to be dead to do so."
  ],
  "headers": {
    "8": "Analysis: not a flash in the pan"
  },
  "links": {
    "Among Us": "https://www.techradar.com/how-to/play-among-us",
    "update": "https://www.innersloth.com/new-roles-cosmicubes-out-now-emergency-meeting-33/#!",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Houseparty": "https://www.techradar.com/how-to/how-to-use-houseparty",
    "Town of Us": "https://among-us.net/en/mod/town-of-us/"
  }
}