{
  "source": "https://www.techradar.com/news/google-is-giving-chrome-on-the-desktop-one-of-the-android-versions-best-features",
  "title": "Google is giving Chrome on the desktop one of the Android version’s best features",
  "category": "computing",
  "updated": "2021-09-30T10:48:05Z",
  "author": "daryl-baxter",
  "summary": "Through the looking lens",
  "article": [
    "Google has announced that it’s bringing its Lens feature to Google Chrome in the coming weeks, which allows you to easily discover more information on the web page you’re browsing.",
    "Web browsers have become more important in the daily lives of their users lately due to the pandemic, so developers are bringing ever more innovative and eye-catching features to them, from RGB lighting in Opera’s GX browser, to a new look for Apple’s Safari browser.",
    "However, Google Lens has been a useful feature to many people who use Chrome on their smartphones, allowing users to discover more information about images and translate text on the fly.",
    "With this now arriving in Google Chrome on the desktop, it’s a feature that could tempt others to move away from their other web browser of choice.",
    "Launched in 2017, Google Lens allows you to point a smartphone camera at certain objects, and Lens would be able to copy text that’s visible in the image, for example, or translate any signs that’re in another language if you were abroad.",
    "Eventually, it was baked into the Camera app on Android, and it’s also available to use on the Google app on iOS.",
    "It’s a feature that’s always been well received, thanks in part to its reliability when scanning images and text, and now the same can be done via Google Chrome.",
    "According to Google’s tweet, you’ll soon be able to activate Lens through one button, which will scan any part of a web page that you select, and then show the results in a sidebar on the right.",
    "This looks to be appearing on all platforms that you can use Chrome on, such as Windows, macOS, and Google Chromebooks running ChromeOS.",
    "With Apple’s latest software updates introducing its own take on Google Lens in the form of LiveText, it made sense for Google to bring Lens to its other apps.",
    "It’s always been a useful feature - when I was last on holiday in Spain, I would use it to decipher a menu in a restaurant, and this was followed by me using the translate feature to make sure the waiter knew what I wanted to order.",
    "Now that it’s in Google Chrome, it could find a new audience of users who may never have been aware of Lens, possibly due to not using an Android device or the Google app on iOS.",
    "Having it on the toolbar beside the address bar will give users the push to try it out, and it could give Google more ideas for new features to Lens in the future."
  ],
  "headers": {
    "4": "What is Google Lens?",
    "9": "Analysis: say what you see"
  },
  "links": {
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "RGB lighting": "https://www.techradar.com/news/corsair-and-opera-team-up-to-bring-rgb-to-web-browsers-finally",
    "new look for Apple’s Safari": "https://www.techradar.com/news/macos-monterey-the-best-new-safari-features",
    "Google Lens": "https://lens.google/",
    "Google app on iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4729707940665768000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Fgoogle%2Fid284815942",
    "Google Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "LiveText": "https://www.techradar.com/news/live-text-is-no-longer-exclusive-to-m1-macs-but-what-is-it"
  }
}