{
  "source": "https://www.techradar.com/news/first-longer-cycle-kubernetes-release-emerges",
  "title": "First longer-cycle Kubernetes release emerges",
  "category": "computing",
  "updated": "2021-08-06T10:31:01Z",
  "author": "mayank-sharma",
  "summary": "Kubernetes 1.22 is the platforms' penultimate release of the year",
  "article": [
    "Kubernetes has put out its first release in accordance with the new slightly longer release cadence.",
    "To give both the contributor community and Release Engineering team a little longer to roll in new features, the Kubernetes developers decided to shift from pushing out four releases every year down to three.",
    "“Changing the release cadence from four to three releases yearly balances many aspects of the project, both in how contributions and releases are managed, and also in the community's ability to plan for upgrades and stay up to date,” reads the release announcement.",
    "Kubernetes 1.22, the second release of 2021, bundles over fifty new enhancements, with over a dozen graduating from beta to stable, even as it adds twice as many beta features, and introduces sixteen as alpha.",
    "One of the major enhancements in the latest release of the popular open source container orchestration platform is the general availability (GA) of the Server-side Apply (SsA) feature.",
    "First introduced in Kubernetes 1.14 back in 2019, SsA was designed to iron out the workflow and is poised to eventually replace the original kubectl apply function.",
    "Another major theme of the release as described by the developers is the improved support for Windows hosts. The Container Storage Interface (CSI) plugins, which debuted in Kubernetes 1.16 in 2019 as a means to facilitate the development of third party storage volume systems, have finally moved to GA.",
    "The announcement also notes that theWindows Special Interest Group (SIG) has released its local development environment for Kubernetes on Windows.",
    "Besides these, the release is peppered with several features designed to improve security, such as the new PodSecurity admission alpha feature as a replacement for PodSecurityPolicy, support for running containers as non-root users, and enabling containers to be executed using a Seccomp profile.",
    "These steps will help improve the security stance of Kubernetes, whose popularity is also attracting the attention of threat actors, and has forced top security agencies to publish a technical report to help administrators harden their Kubernetes instances."
  ],
  "headers": {
    "4": "Here’s what’s new"
  },
  "links": {
    "Kubernetes": "https://www.techradar.com/news/what-is-kubernetes",
    "release announcement": "https://kubernetes.io/blog/2021/08/04/kubernetes-1-22-release-announcement/",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "local development environment": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8150758967218032000&xs=1&url=https%3A%2F%2Fgithub.com%2Fkubernetes-sigs%2Fsig-windows-dev-tools%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ffirst-longer-cycle-kubernetes-release-emerges",
    "PodSecurity admission": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1380209158503314200&xs=1&url=https%3A%2F%2Fgithub.com%2Fkubernetes%2Fenhancements%2Fissues%2F2579&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ffirst-longer-cycle-kubernetes-release-emerges",
    "Seccomp profile": "https://kubernetes.io/docs/tutorials/clusters/seccomp/#enable-the-use-of-runtimedefault-as-the-default-seccomp-profile-for-all-workloads",
    "harden their Kubernetes instances": "https://www.techradar.com/news/nsa-cisa-heres-how-we-can-properly-secure-kubernetes"
  }
}