{
  "source": "https://www.techradar.com/news/whatsapps-latest-beta-hints-at-big-improvements-on-the-horizon-for-2021",
  "title": "WhatsApp's latest beta hints at big improvements on the horizon for 2021",
  "category": "phones",
  "updated": "2021-01-03T12:54:28Z",
  "author": "cat-ellis",
  "summary": "All the new features to expect this year",
  "article": [
    "WhatsApp has released its first Beta update of 2021, and it's packed with hints about new features that could be landing on your phone later this year.",
    "As WABetaInfo reports, there's a huge list of improvements incoming, including improved video and voice calls, better chat history backups, easier contact management, enhanced stickers, and various bug fixes.",
    "There are also several new features on the way, including one that should help make sure you don't miss out on group calls, which are increasingly important for keeping in touch with friends and family as the pandemic continues.",
    "If you miss out on the start of a group call (due to accident or a clash of timings), it's currently impossible to jump in later and make your apologies. When the new feature arrives, it'll be possible to join in whenever you're free, provided the conversation is still ongoing.",
    "Although it's not yet available for testing, and a release date is yet to be confirmed, resources tucked away in the WhatsApp Beta installation files suggest this will be an option for both iOS and Android.",
    "If you want to be first to try new tools and updates like these once they're released, you'll need to join one of WhatsApp's beta programs.",
    "Unfortunately the program for Apple devices is currently full, though it's worth keeping an eye on the Testflight page to see if a space opens up.",
    "To join the beta program for Android, visit the WhatsApp Beta page on Google Play and enter your details. If you already have the public version of WhatsApp installed, it will be updated to the beta version automatically within a few hours."
  ],
  "headers": {
    "5": "Be an early adopter"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-messenger-beta-for-ios-2-21-10-23-whats-new/#more-7879",
    "keeping an eye on the Testflight page": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2183136800913165600&sharedId=trd-us&u=https%3A%2F%2Ftestflight.apple.com%2Fjoin%2Fs4rTJVPb",
    "visit the WhatsApp Beta page": "https://play.google.com/apps/testing/com.whatsapp/join"
  }
}