{
  "source": "https://www.techradar.com/news/skyrim-is-now-a-tabletop-game-just-when-you-thought-it-couldnt-get-ported-to-anything-else",
  "title": "Skyrim is now a tabletop game, just when you thought it couldn't get ported to anything else",
  "category": "gaming",
  "updated": "2021-03-01T12:52:51Z",
  "author": "rhys-wood",
  "summary": "You’re finally awake…",
  "article": [
    "Modiphius Games, creators of licensed tabletop adventures such as Dishonored: The Roleplaying Game and The Elder Scrolls: Call to Arms are once again teaming up with Bethesda to create a cooperative board game based on its landmark hit, Skyrim.",
    "As reported by Polygon, The Elder Scrolls 5: Skyrim The Board Game will be a cooperative adventure game for one to four players. We don’t currently know anything beyond that, however.",
    "Publisher Modiphius Games says Skyrim: The Board Game’s crowdfunding page is set to go live in June, but it’s not being hosted on Kickstarter. Instead, Modiphius is launching its campaign on Gamefound, a Kickstarter alternative primarily used to fund tabletop games, and the draft page for the project is now live.",
    "Gamefound was founded in 2020 and already has one huge crowdfunding success to its name, that being Awaken Realms’ ISS Vanguard, a cooperative sci-fi tabletop game that to date has raised almost $5 million. When you consider its initial goal of $50,000, it’s hard to see that as anything other than hugely successful.",
    "We’re hoping that Skyrim: The Board Game can follow in ISS Vanguard’s footsteps. It definitely has all the makings to do so, as it’s a well-loved game from a pretty important video game series.",
    "While no big details about how Skyrim: The Board Game will play have been revealed yet, we’re happy that just like the game, the tabletop version will support solo play. We do wonder how Skyrim will translate to a cooperative environment, however, but we imagine it won’t be too different from other cooperative games in the space, such as the Doom and Dark Souls board games."
  ],
  "headers": {
    "3": "Can't wait to count out your coin"
  },
  "links": {
    "Skyrim": "https://www.techradar.com/news/the-best-thing-about-skyrim-on-switch-is-that-its-skyrim-on-switch",
    "Polygon": "https://www.polygon.com/2021/2/25/22299066/skyrim-board-game-gamefound-kickstarter-crowdfunding-launch-robinson-crusoe",
    "now live": "https://gamefound.com/projects/draft/zx6js610y7lvnlnav6qbisnxqqy#/"
  }
}