{
  "source": "https://www.techradar.com/news/marvels-shang-chi-movie-finally-has-an-official-trailer-and-it-looks-great",
  "title": "Marvel's Shang-Chi movie finally has an official trailer – and it looks great",
  "category": "entertainment",
  "updated": "2021-04-19T14:02:54Z",
  "author": "tom-power",
  "summary": "Marvel's newest superhero has arrived",
  "article": [
    "There's been very little information about upcoming Marvel movie Shang-Chi and the Legend of the Ten Rings out there in the wild, other than who's in the movie's cast - but that's now changed with the arrival of its first trailer.",
    "To celebrate Chinese-Canadian star Simu Liu's birthday, Marvel Studios has finally revealed a first look at its upcoming MCU Phase 4 superhero flick, and it looks like it'll be another hit for the studio and Disney.",
    "Check out the movie's official trailer below:",
    "The footage provides a bit more context as to what Shang-Chi's MCU debut will be about. The trailer opens with Shang-Chi's father Wenwu (Tony Leung) – aka the Mandarin – telling his son that he had a decade to live his life, and now it's time to join him as part of the clandestine organization known as the Ten Rings.",
    "Not everything is as it seems, though. In an Entertainment Weekly exclusive feature, which dropped alongside the trailer, it's revealed that Shang-Chi was trained as an assassin by his father as a child. Despite walking away from that life, he's drawn back into the Mandarin's world. What plays out amid the backdrop of martial arts action is a story centered on a family drama – and one with the real Mandarin, not the Trevor Slattery knock-off we saw in Iron Man 3.",
    "Ahead of the trailer's drop, Liu also revealed the movie's first poster on his personal social media accounts. Check it out below:",
    "While the official trailer and poster will take up much of fans' interest, it's intriguing to note that Shang-Chi and the Legend of the Ten Rings won't be coming to Disney Plus.",
    "As the caption on the Marvel Studios' tweet says, fans can \"experience it only in theaters\" when it is released on September 3. This is in stark contrast to Black Widow's launch on July 9, with the delayed Scarlett Johansson-fronted flick receiving a simultaneous release in cinemas and on Disney's streaming service. Black Widow will cost an additional fee when it comes to Disney Plus, too, for anyone who wasn't aware.",
    "While it may seem strange that one MCU movie is getting a simultaneous release and the other isn't, it's all down to the Covid-19 pandemic. Marvel and Disney will be hoping that most theater chains and independent cinemas will be open to the public by Shang-Chi's September release, and that fans are confident enough to watch movies on the big screen again. With vaccination programs being rolled out in the US, UK and beyond, there hopefully shouldn't be the need for Shang-Chi to receive a Disney Plus release as well.",
    "Of course, the Covid-19 situation could change and force Disney and Marvel to reconsider their plans for Shang-Chi's launch. As it stands, though, the movie will only be available to see in theaters in Q3 2021.",
    "Shang-Chi and the Legend of the Ten Rings will be released on September 3, 2021."
  ],
  "headers": {
    "6": "Shang-Chi won't be coming to Disney Plus"
  },
  "links": {
    "Entertainment Weekly": "https://ew.com/movies/shang-chi-and-the-legend-of-the-ten-rings-simu-liu-first-look/",
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-8917819021272179000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date"
  }
}