{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-23-october-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-10-22T14:00:18Z",
  "author": "axel-metz",
  "summary": "Here’s what’s new on Netflix and other streamers this weekend",
  "article": [
    "Sci-fi fans, rejoice! Dune, Denis Villeneuve’s star-studded adaptation of Frank Herbert’s celebrated novel, has finally landed in theaters and on HBO Max after several pandemic-induced delays.",
    "Sure, the director never wanted his magnum opus to be made available to watch on streamers, but if it means we get to see Timothée Chalamet sat atop a skyscraper-sized sandworm from the comfort of our own homes, we’re grateful for the executive decision.",
    "Elsewhere, there’s a healthy selection of horror movies, alien flicks and returning comedies making their way onto streaming services over the next few days – below, we’ve rounded up seven of the biggest additions landing in the US and UK this weekend.",
    "One of the biggest movies of 2021 – in terms of scope, budget and surrounding hysteria – Dune lands on HBO Max in the US (only at the $14.99 tier) this weekend to finally provide the answer to the long-touted question: is it really possible to adapt Frank Herbert’s sci-fi epic?",
    "Denis Villeneuve directs this latest effort, which stars Timothée Chalamet as Paul Atreides, a gifted young prince forced to travel to the most dangerous planet in the universe to ensure the survival of his people. The likes of Zendaya, Josh Brolin, Dave Bautista, Oscar Isaac and Jason Momoa also star, so this really is the definition of a blockbuster – it’s even got a thumping Hans Zimmer score to boot.",
    "Critical reception hasn’t been as universally positive as Villeneuve might have hoped, though the only major qualm has been Dune’s obvious place as part one of a larger whole. Otherwise, expect a visually stunning epic in the vein of Star Wars and Game of Thrones.",
    "For our own thoughts on the movie, you can check out our Dune review. UK viewers will have to watch this one on the big screen.",
    "Now available to stream on HBO Max in the US",
    "If not for the arrival of Dune, Apple TV Plus’ latest big-budget series, Invasion, would have proven the most significant sci-fi streaming addition of the week.",
    "Riding on the coattails of the streamer’s ever-improving Foundation, this new series examines humanity’s response when Earth is visited by a mysterious alien species. That might sound formulaic, but the combined talents of X-Men screenwriter Simon Kinberg and Hunters creator David Weil should ensure this globe-trotting adventure breaks new ground.",
    "Shamier Anderson (Extraction) and Sam Neill (you know, the guy from Jurassic Park) lead the cast for this 10-episode series, with the first three episodes available to stream now.",
    "Subsequent episodes will land on Apple TV Plus every Friday.",
    "Now available to stream on Apple TV Plus",
    "Locke and Key season 2 finally lands on Netflix this weekend, ready to continue the supernatural adventures of the titular Locke siblings – Kinsey (Emilia Jones), Tyler (Connor Jessup) and Bode (Jackson Robert Scott).",
    "Season 2 is set to pick up exactly where the first left off, with the family forced to confront the consequences of the latter’s final episode (no spoilers, but s*** hit the fan). Expect even more Lockes, keys and a demon or two this time around.",
    "Considering the success of other Netflix shows right now – not just Squid Game – Locke & Key is still fairly slept on, so it’s worth tuning into if you’re after something different to the streamer’s more mainstream fare.",
    "Now available to stream on Netflix",
    "In this Netflix original movie – the latest of many heading to the streamer in 2021 – a college student moonlighting as a chauffeur picks up two mysterious women for a night of party-hopping across LA.",
    "Unfortunately, said college student discovers that these mysterious women are in fact vampires – which is always a nice surprise, isn’t it? Think of Night Teeth, then, as a (supposedly stylish) cross between Knock Knock and Twilight.",
    "To stay on top of all the latest scarers, we’ve detailed a list of the other new horror movies heading to theaters and streamers in the coming months.",
    "Now available to stream on Netflix",
    "Larry David’s long-running comedy series returns for an eleventh season this weekend, continuing the fictional-but-not-fictional actor’s misadventures throughout Los Angeles.",
    "New episodes will maintain the show’s celebrated ad-lib humour, with guests including – wait for it – Bill Hader, Jon Hamm, Albert Brooks, Patton Oswalt, Jon Hamm, Woody Harrelson, Lucy Liu, Kaley Cuoco and Tracey Ullman set to ensure season 11 keeps its tried-and-tested formula feeling fresh.",
    "This one’s landing on HBO Max in the US, but UK viewers can find the latest episodes of Curb Your Enthusiasm streaming on Sky Comedy from October 25.",
    "Now available to stream on HBO Max in the US",
    "Sex, Love & Goop had to be a Gwyneth Paltrow creation, didn’t it?",
    "Basically, Netflix has commissioned a show that sees real-life couples work with sex experts to find their optimum orgasm. That’s how we understand it, anyway, but here’s the official synopsis for clarity:",
    "“Sex, Love & Goop follows courageous, real couples as they work with sex experts to explore their bodies and learn methods to enhance their relationships. Through deeper intimacy and an open mind, each couple experiences pleasure, sex and intimacy differently.”",
    "We don’t really know what else to add.",
    "Now available to stream on Netflix",
    "You know those movies that adhere so resolutely to cringey genre tropes that they must have been written as parodies of said tropes? Well, After We Fell sticks to the romance formula like a moth to a lamp – but it’s not a parody.",
    "In fact, it’s the third in a series of theatrical adaptations – following After and After We Collided – inspired by Anna Todd’s young adult novel. This time, main character Tessa is forced to confront the reality of her hard-fought commitment to Hardin.",
    "As such, you’re probably only going to be interested in this one if you caught the first two entries in the series – but After We Fell might, at least, make a satisfactory break-up movie for anyone enduring some romantic struggles.",
    "Now available to stream on Amazon Prime Video UK"
  ],
  "headers": {
    "3": "Dune (HBO Max)",
    "8": "Invasion (Apple TV Plus)",
    "13": "Locke & Key season 2 (Netflix)",
    "17": "Night Teeth (Netflix)",
    "21": "Curb Your Enthusiasm season 11 (HBO Max)",
    "25": "Sex, Love & Goop (Netflix)",
    "30": "After We Fell (Amazon Prime Video UK)"
  },
  "links": {
    "Dune": "https://www.techradar.com/news/dune-is-an-absorbing-and-visually-striking-sci-fi-epic-with-one-major-problem",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "director never wanted": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Dune review": "https://www.techradar.com/news/dune-is-an-absorbing-and-visually-striking-sci-fi-epic-with-one-major-problem",
    "Foundation": "https://www.techradar.com/news/how-to-watch-foundation-online-on-apple-tv-plus-where-you-are",
    "Hunters": "https://www.techradar.com/news/hunters-season-2",
    "Locke and Key season 2": "https://www.youtube.com/watch?v=EZKWJ01jNOI",
    "Squid Game": "https://www.techradar.com/news/squid-game-ending-explained-what-happens-next",
    "many heading to the streamer": "https://www.techradar.com/news/new-netflix-movies-2021-every-confirmed-release-date-and-trailer",
    "new horror movies": "https://www.techradar.com/news/new-horror-movies"
  }
}