{
  "source": "https://www.techradar.com/news/world-of-warcraft-burning-crusade-classic-closed-beta-may-kick-off-later-this-month",
  "title": "World of Warcraft: Burning Crusade Classic closed beta may kick off later this month",
  "category": "computing",
  "updated": "2021-03-09T19:40:07Z",
  "author": "john-loeffler",
  "summary": "The Dark Portal is opening...",
  "article": [
    "Now that BlizzCon 2021 has come and gone, World of Warcraft Classic players are eagerly awaiting the release of World of Warcraft: Burning Crusade Classic, the popular MMOs first relaunched expansion. Now, a possibly leaked internal email indicates that the closed beta for Burning Crusade Classic might begin as early as next week (mid-March 2021).",
    "Flagged by Reddit user zon3tknew3, a screenshot of an internal Blizzard email indicates that the company's internal alpha testing stage is already in progress, with the closed beta scheduled to begin \"later this month.\"",
    "How long the beta will run for isn't indicated, but the first time around, the beta test for the original Burning Crusade expansion ran for about three months. That would put the retail release of Burning Crusade Classic sometime in June or July if the beta ran about as long as the first time around.",
    "As Wccftech notes, there's no way to judge the authenticity of the posted email, so some skepticism is warranted, but the timeframe for the beta is more or less what we have been expecting, so it is definitely plausible at this point. We definitely won't know until there is an announcement by Blizzard, in any case.",
    "After the spectacular success of World of Warcraft Classic following its November 2019 release, the question of the Burning Crusade arose almost immediately. Would the hugely popular servers move on to the game's first expansion once it had exhausted its vanilla content?",
    "\"We are listening very carefully to the Classic community,\" John Hight, the executive producer of World of Warcraft, told us in an interview last month. \"They’re very engaged, they’re very loud. We obviously want to keep them entertained.\"",
    "The development team has taken a lot of the community's input to heart, even to the point of creating a third set of game servers specifically for those who want to keep the game exactly as it is now. The question of further expanding the \"progression\" servers to include World of Warcraft's second expansion, Wrath of the Lich King, is still an open question, according to Hight.",
    "\"It’s hard at this stage to make a commitment because we really want to know where the community wants us to take them next.\"",
    "That will largely depend on the success of the Burning Crusade Classic, obviously, but given the excitement around the game, we can't wait to see what's next for World of Warcraft Classic."
  ],
  "headers": {
    "4": "Revisiting World of Warcraft's golden age"
  },
  "links": {
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "World of Warcraft: Burning Crusade Classic": "https://www.techradar.com/news/world-of-warcraft-classic-the-burning-crusade-release-date-beta-and-everything-we-know",
    "zon3tknew3": "https://old.reddit.com/r/classicwow/comments/m0d1or/tbc_invites_for_ff_should_be_done_by_march_15th/",
    "Wccftech": "https://wccftech.com/burning-crusade-classic-closed-beta-march/",
    "interview": "https://www.techradar.com/news/the-future-of-world-of-warcraft-classic-with-john-hight-and-brian-birmingham"
  }
}