{
  "source": "https://www.techradar.com/news/alexa-adds-two-celebrity-voices-to-its-lineup-but-wed-love-to-see-more",
  "title": "Alexa adds two celebrity voices to its lineup, but we'd love to see more",
  "category": "smart-home",
  "updated": "2021-07-19T09:41:51Z",
  "author": "rhys-wood",
  "summary": "Spruce up your Alexa with recognizable voices",
  "article": [
    "Amazon has added two new voice profiles to its Alexa voice assistant, allowing users to spice up their smart home experience with a touch of celebrity. That is, if you want your home to be filled with the voice of either Melissa McCarthy or Shaquille O’ Neal.",
    "As reported by CNN, Amazon made the announcement via its About Amazon news blog. For $4.99 each, users will be able to replace the default voice profile of Alexa to either Shaq or McCarthy.",
    "Currently, the celebrity voice profiles are only available to US customers, with no word if the dulcet tones of the former NBA star or comedian will show up in other territories. This was also the case with the Samuel L. Jackson voice profile for Alexa released in 2019, which is similarly limited to the US.",
    "Enabling one of these celebrity voices on your Alexa device is blissfully straightforward. Once you’ve bought your desired voice profile, simply say to your voice assistant: “Alexa, introduce me to Shaq/Melissa McCarthy,” and the respective voice will be set. You can then designate a wake word to easily access your desired voice profile at any time.",
    "But what if you’re not in the US? Fear not, as other celebrity voice profiles do exist depending on your region. UK Alexa users, for example, can download a Gordon Ramsay voice profile for free – if you want your cooking to be berated with characteristically violent language, that is. Voice profiles seem to be available on a per-region basis, so it’s worth searching “Alexa voice” or a similar keyword to browse what’s available in your country.",
    "We’re actually surprised Amazon hasn’t fully capitalized on this tech just yet. There’s shockingly few voice profiles available, but we feel the tech giant could be onto something by making more voices available worldwide. The voice profiles use impressive “deepfake” tech that emulates the celebrity’s voice, so they don’t have to spend years recording for every possible instance.",
    "Personally, we’d love for Christopher Walken to tell us a joke, or have Captain Jack Sparrow deliver us the morning news. Ultimately, though, we hope it doesn’t take Amazon another couple of years to add more celebrity voice profiles, because we think the novelty factor alone can be seriously fun."
  ],
  "headers": {
    "3": "How do I enable celebrity voices on Alexa?"
  },
  "links": {
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "CNN": "https://edition.cnn.com/2021/07/17/business/amazon-alexa-voice-shaq-melissa-mccarthy-trnd/index.html",
    "About Amazon news blog": "https://www.aboutamazon.com/news/devices/alexa-introduce-me-to-melissa-and-shaq"
  }
}