{
  "source": "https://www.techradar.com/news/five-tips-for-creating-an-effective-digital-workplace",
  "title": "Five tips for creating an effective digital workplace",
  "category": "computing",
  "updated": "2021-04-16T14:55:02Z",
  "author": "david-bowman",
  "summary": "Digital workplaces create less friction for employees, wherever they may be",
  "article": [
    "Businesses are acutely aware of the many ways technology adoption and digital transformation strategies have changed over the last year. A year ago, we saw businesses digitally transforming overnight. They accelerated their uptake of cloud technologies and quickly adapted to new ways of working.",
    "One of the most recognizable changes during this time has been the need to enable communication and collaboration for remote workforces. Where once we might have asked a simple question of a colleague without so much as a glance away from our screens, we now send emails and instant messages. And where once we booked meeting rooms and huddled round tables, we now join them at the push of a button.",
    "Effective communication means sharing the right information with the right people in the right way. Beyond person-to-person communication, this means employees must be able to easily and immediately surface the content that’s most relevant to them. Remote working has made this business-critical. Without the ability to simply ‘ask’, these processes now matter more to a far greater number of people.",
    "The principles of communication and information-sharing remain the same. These are manifested most effectively in digital workspaces.",
    "When implemented and engaged with effectively, digital workplaces create less friction for employees, wherever they may be. Poor implementation leads to the digital workplace becoming just another hurdle in the way of productivity. To enable the former and avoid the latter, here are five tips to help with implementation.",
    "Before embarking on implementing a digital workplace, businesses must have a clear idea of what they hope to achieve. CIOs and IT business decision-makers must consider the core business problems they are trying to solve.",
    "A major mistake businesses make when implementing digital workplace solutions is more rooted in culture than in technology. Historically, when budget is available, firms are wont to adopt new technologies. The thinking behind this approach is not entirely flawed; upgrade systems and IT infrastructure and efficiencies and returns will naturally follow. This may in part be true, but it approaches technology adoption from the wrong angle. The key to successfully implementing any technology is to first identify the business problem it will solve.",
    "The pandemic has led to flash technology adoption out of short-term necessity, with the implementation of platforms like Teams, Zoom, SharePoint, Slack et al, seeing rapid uptake. These are great channels, but each comes with the cost of being yet another platform employees must log into and manage. It’s evident that workforces want better technology to help them communicate with colleagues. But the long-term value of these platforms must also be considered. Particularly now, as the post-pandemic world will undoubtedly see many businesses move to hybrid working models.",
    "This is where the digital workplace can provide real value. Instead of managing multiple tools and platforms, a digital workplace that prioritises interoperability and integration can become the centralised hub of content.",
    "Another mistake businesses make with digital workplace implementation is failing to engage with employees before embarking on the project. In an ideal world, every workforce would be highly tech savvy and adept at using the latest platforms. This is rarely the case, but it doesn’t have to be.",
    "Organizations are comprised of a variety of teams that perform a variety of functions. So, the default approach to implementing a digital workplace should be to assume that employees are not in the same physical location. A digital workplace that only works well when a user is at a PC in an office is unlikely to be effective, nor will it foster engagement.",
    "Businesses must look at the tools and technologies that teams and individuals use and then work out how they can be accessed remotely and safely, without compromising employee experience.",
    "Doing so requires that honest feedback is gained from teams regarding their technology pain points and requirements. Find out what they need from their digital workplace and what they are willing to accept from one.",
    "The failure of many digital workplace implementations reflects another cultural problem for businesses. This is an over-focus on the implementation project itself, i.e., getting buy-in, reaching out to employees and an initial drive of uptake and enthusiasm.",
    "To maintain engagement, any implementation must evolve with the business. If people, teams and processes change, the digital workplace must reflect this. Re-evaluating every few months ensures the digital workplace looks like the business, which means continually updating the platform to address business problems.",
    "Once rolled out, CIOs should ensure that engagement with the platform is still strong and desirable. Where are people dropping off and where are the new pain points? Use surveys, listen to employee feedback and monitor usage of new technology and the platform itself, iterating accordingly.",
    "Choosing technologies that are interoperable is the key to a seamless employee experience. Focusing on Microsoft’s suite of technologies will of course enable this, but the move towards open standards and APIs means business applications can integrate more easily with one another.",
    "Conversely, it is sometimes more prudent to allow a team or department to continue with a familiar platform or tool if the adoption of a new one is likely to cause significant upheaval. While this means accepting that integration will be a challenge, it is important to understand the cost-benefit of each adoption and plan accordingly.",
    "Advanced digital workplace solutions provide highly bespoke experiences for employees. It’s a great target to aim for, but the level of customization possible is naturally determined by the amount of content available. If personalisation is not prioritised when dealing with rich ecosystems of content, users will be overwhelmed by the information presented. Much of it will be irrelevant to them, leading to poor employee experience and a drop-off in engagement.",
    "Firms just starting out with a digital workplace should first focus on building out their content ecosystem, with the above points in mind. Attempting to personalise and customise early on will expose that there isn’t much content available.",
    "A good rule of thumb for businesses is to think about the top content that employees need to access through their digital workplace. If that’s an easy task and a rich ecosystem of content already exists, then personalisation can be built in from the beginning as the content is there to enable it.",
    "Whether solving problems for the C-suite at head office, or teams already operating under a hybrid working model, a digital workplace must have buy-in from the entire workforce. This is critical to it becoming a positive force for any organisation. Pain points will change over time, as the digital workspace evolves with the business and matures with each strategically beneficial technology adoption. But they will be easier to overcome once the above points are implemented."
  ],
  "headers": {
    "5": "Prioritize business problems",
    "9": "Gain honest feedback",
    "13": "Take an agile approach",
    "16": "Ensure interoperability",
    "18": "Customize and personalize"
  },
  "links": {
    "Remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "Slack": "https://www.techradar.com/reviews/slack"
  }
}