{
  "source": "https://www.techradar.com/news/canon-eos-r3-expected-to-reveal-all-in-imminent-full-launch",
  "title": "Canon EOS R3 expected to reveal all in imminent full launch",
  "category": "cameras",
  "updated": "2021-06-28T10:36:58Z",
  "author": "mark-wilson",
  "summary": "There are strong rumors about its megapixel count, too",
  "article": [
    "The Canon EOS R3 has been edging closer to full launch over the past month – and according to rumors, the pro sports mirrorless camera will get a full launch on June 29.",
    "The full-frame sports camera was given a 'development announcement' in April and Canon has been slowly teasing more specs, including some new AF-tracking powers for racing cars and motorbikes.",
    "But now Canon Rumors has tipped the EOS R3 for a full announcement on June 29 (for those in the western hemisphere), although that may mean June 30 for some regions.",
    "Along with a rumored launch date for the Canon EOS R3, Canon Rumors has posted the camera's expected specs – including what it claims will be a 30.1MP backside-illuminated sensor.",
    "The EOS R3's resolution is one of the key details that Canon so far hasn't revealed, but 30.1MP certainly makes sense for this kind of camera. That resolution rules out 8K video shooting, but will allow the camera – as Canon has already to announced – to shoot raw photos at 30fps will full AF/AE tracking, along with oversampled 4K video.",
    "One other key detail in the Canon Rumors specs list, which hasn't yet been announced, is the EOS R3 is likely to have a vari-angle touchscreen. This is significant because the R3 is effectively a mirrorless equivalent of the Canon EOS 1D X Mark III DSLR, which has a fixed screen, so this would be a new move for a pro Canon sports camera.",
    "The Canon EOS R3 is still listed as \"coming soon\" and a \"development announcement\" on Canon's homepage, but it certainly seems likely that we'll see a full announcement in the next day or so.",
    "There are still a couple of details that haven't appeared in the rumors and leaks –including details about the electronic viewfinder (a crucial factor for sports photography) and its price tag.",
    "The Canon EOS R3 is a significant camera for a couple of reasons. Firstly, it appears to the camera that Canon is hoping will tempt pro sports photographers to the mirrorless side, with its DSLRs increasingly becoming a legacy technology.",
    "In this sense, its electronic viewfinder is crucial, because Canon has maintained that pro sports photographers has continued to prefer DSLRs because their optical viewfinders have zero lag.",
    "Secondly, the EOS R3 will feature a new sensor that, contrary to recent rumors, is \"Canon designed and manufactured\", according to a quote given to Fstoppers. This is a big deal in Canon's fight with Sony, whose Sony A1 will likely be one of the EOS R3's main rivals.",
    "Like the Sony A1, the Canon EOS R3 is expected to be a showcase for Canon's latest sports photography tech, like the motor car AF tracking – so while it might not be a camera that most of non-professionals would buy, it could offer a glimpse of the kind of tech that might filter down to more affordable cameras like the Canon EOS R5 and Canon EOS R6."
  ],
  "headers": {
    "6": "The big R3-veal"
  },
  "links": {
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Canon Rumors": "https://www.canonrumors.com/the-canon-eos-r3-will-be-officially-announced-on-june-29th/",
    "Canon EOS 1D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "Fstoppers": "https://fstoppers.com/gear/no-sony-not-making-sensor-canon-eos-r3-567980",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Canon EOS R6": "https://www.techradar.com/reviews/canon-eos-r6-review"
  }
}