{
  "source": "https://www.techradar.com/news/piracy-sites-saw-huge-drop-in-traffic-last-year",
  "title": "Piracy sites saw huge drop in traffic last year",
  "category": "computing",
  "updated": "2021-01-04T13:29:31Z",
  "author": "barclay-ballard",
  "summary": "Even with most people trapped inside, piracy was down last year",
  "article": [
    "Websites used to download and stream pirated material saw a marked decline in traffic in 2020, even accounting for a brief spike brought about by COVID-19, according to new data from TorrentFreak.",
    "The site's findings suggest that VPN solutions, which have also experienced a boost from the pandemic, are likely to have been largely used to enable remote working, not downloading illegal material.",
    "Between December 2019 and November 2020, visits to public torrent, streaming, linking, and download sites, excluding traffic from search engines, declined by around 10%. Across the same period, search traffic to piracy-related websites fell by a third, with notable downward trends visible in January and May of last year.",
    "It’s likely that the downturns were brought about by changes to Google’s search algorithm, which has a huge influence on the ability of individuals to find websites offering pirated material. Google announced algorithm updates on January 13 and May 4, which aligns perfectly with the piracy drop-offs shown by the data.",
    "Although Google has not disclosed the exact nature of its algorithm changes, it would hardly be surprising if they targeted online pirateers. Copyright holders often request that search engines do more to protect their intellectual property; requests that do not always receive the desired response.",
    "While ISPs do carry out site takedowns where copyright infringements have been identified, this is often little more than a temporary measure. It is relatively straightforward for the owners of blocked sites to simply create new online portals with vaguely similar web addresses and continue offering pirated content.",
    "Search engines offer a more unstainable way of tackling online piracy, not by blocking sites per se but by making them difficult to discover in the first place. If Google’s algorithm update is at least partly responsible for the decline in piracy seen in 2020, then copyright holders will certainly have cause to thank the search engine giant.",
    "Via TorrentFreak"
  ],
  "headers": {
    "3": "Piracy protection"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "experienced a boost": "https://www.techradar.com/news/surge-in-traffic-to-piracy-websites-could-turn-into-flood-of-malware-ridden-pcs",
    "TorrentFreak": "https://torrentfreak.com/pirate-site-search-traffic-tanked-following-google-updates-210101/"
  }
}