{
  "source": "https://www.techradar.com/news/amazon-made-black-friday-2021-the-perfect-time-to-upgrade-your-old-roku-device",
  "title": "Amazon made Black Friday 2021 the perfect time to upgrade your old Roku device",
  "category": "televisions",
  "updated": "2021-10-13T09:35:09Z",
  "author": "hamish-hector",
  "summary": "Upgrade soon or lose Prime Video support",
  "article": [
    "Amazon has just sent out another warning to Roku users that its Prime Video app will soon no longer be supported on some older devices, just in time for the Black Friday 2021 season.",
    "On November 1, you’ll no longer be able to rely on Amazon’s video streaming platform for entertainment if you’re still using some of Roku’s oldest legacy streaming boxes. Thankfully, newer devices will still be supported by Amazon, with access to Prime Video only being taken away from the following:",
    "In fairness, these are all included in Roku’s list of legacy devices and some haven’t been supported by their own manufacturer for a couple of years at this point. Amazon pulling the plug on its support is just another nail in their coffin, and a reminder that you need to upgrade to something more up to date as soon as you can.",
    "November 1 will mark the start of the Black Friday 2021 build-up, so if you can hold on a little longer, you might be able to snag a great deal on the newer Roku devices just as your old one becomes defunct.",
    "If you want to see a major leap forward in performance, you’ll want to be on the lookout for Roku Express 4K Plus (2021) deals. While it was only released in April this year the device has already been discounted slightly and could be set to drop more substantially below its $39.99 / £39.99 asking price come November.",
    "With 4K and HDR10+ support, this stick supports a brilliant image quality and the Roku OS is still a breeze to use - we like this stick so much we gave it four out of five stars.",
    "Alternatively, you could check out slightly older devices like the Roku Streaming Stick Plus or the Roku Express which are sure to be discounted further during the Black Friday season."
  ],
  "headers": {
    "3": "Black Friday 2021: Roku deals to look out for"
  },
  "links": {
    "Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Roku Express 4K Plus (2021)": "https://www.techradar.com/reviews/roku-express-4k-2021",
    "Roku Streaming Stick Plus": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Roku Express": "https://www.techradar.com/reviews/roku-express"
  }
}