{
  "source": "https://www.techradar.com/news/best-xbox-wireless-headset-eq-settings-dial-in-the-perfect-sound",
  "title": "Best Xbox Wireless Headset EQ settings: dial in the perfect sound",
  "category": "gaming",
  "updated": "2021-05-03T12:00:00Z",
  "author": "adam-vjestica",
  "summary": "Get the most out of your Xbox Wireless Headset",
  "article": [
    "What’s the best Xbox Wireless Headset EQ setting? Truth be told, what sounds good to you is totally subjective and will differ from person to person. However, it never hurts to sample the equalizer settings of another user to see if it works for you.",
    "While we were truly impressed by how great the Xbox Wireless Headset sounds, and the incredible value on offer, the stock ‘Game’ profile is overwhelmingly bass-heavy, and has a tendency to muddy the highs and mids that are crucial in so many competitive multiplayer games.",
    "That doesn’t mean we want to strip out the bass entirely, though. The Xbox Wireless Headset does a remarkable job at reproducing those eardrum wobbling explosions that make gaming audio so fun to experience when wearing the right pair of cans.",
    "We also want to pick an Xbox Wireless Headset EQ that gets the most out of spatial audio on Xbox Series X and Xbox Series S, which helps add verticality to games that support it, and generally make sound feel like it's coming all around you.",
    "While we personally opt for DTS Headphone:X on the ‘balanced’ setting – we feel like DTS Headphone:X provides a clearer, more tangible surround sound effect – the EQ setting below will work equally well for Dolby Atmos and Windows Sonic. It’s important to note that DTS Headphone:X does require a one off payment for a license, but you get six months of Dolby Atmos free with the Xbox Wireless Headset and Windows Sonic is also free as standard to Xbox and PC users.",
    "Again, we have to stress that this EQ setting might not be the perfect match for your ears, but it should be a great starting point nonetheless to help you dial in a sound that suits you. We’ll also explain how the EQ works so you can adjust it appropriately.",
    "To adjust the Xbox Wireless Headset EQ, you’ll need to open up the Xbox Accessories app, highlight the picture of the Xbox Wireless Headset (which will appear when it’s turned on and connected) and select ‘Configure’. There are a selection of stock EQ settings to choose from including Game, Heavy Bass, Movie, Music and Speech, but we’ll want to customize our own.",
    "Be careful when moving back and forth between presets once you’ve customized your EQ, as the Xbox Accessories app doesn’t save your custom profile if you change it back to one of the presets.",
    "Starting from the Music EQ as a base, which is the best sounding to our ears, we’ll want to reduce the lower end frequencies significantly and balance the mids and highs. Check out the picture below to see our dialed in settings.",
    "If you’re wondering what the various sliders mean, here’s a quick breakdown in the simplest terms possible.",
    "The 125Hz slider can be best described as your bass setting. Adjusting this up and down will deliver a sizable difference into just how impactful the bass will be from the Xbox Wireless Headset, which can literally make your eardrums shake if you crank it all the way up. Even though it’s super satisfying to have seriously punchy bass, it can overpower the rest of the other important sounds, so we opted for four clicks up from the bottom.",
    "The 250Hz slider brings muddiness to the sound, but can stop it feeling empty or shallow. This is an area where the Xbox Wireless Headset struggles a bit, as if the 250Hz is too high it really impacts the audio quality in a negative way. We found that dropping to three clicks from the bottom to be the ideal fit.",
    "The 1kHz slider manages the midrange sounds. We opted to lower this two clicks from the default of 0 as again, the Xbox Wireless Headset is tuned for the low-end frequencies primarily, so it’s best to tail this off slightly.",
    "For the higher frequencies, 4kHz and 8kHz, these handle the higher pitched harmonics and add a brightness to the audio. We spent a lot of time adjusting these two sliders in particular to try and help the highs cut through more, but found it often ended up sounding too sharp for our ears. We ended up leaving the 4kHZ setting on the default of 0 and pushed the 8kHZ setting up two clicks.",
    "The Xbox Accessories app also features a Bass boost option, which can seem superfluous considering how much low-end these cans can muster. However, we found a Bass boost of 2+ helped give a bit more warmth to the sound without drowning everything else out as a result.",
    "We think this is the best Xbox Wireless Headset EQ setting for all genres of game. If you play competitive titles like Call of Duty: Warzone where hearing every footstep matters, we’d recommend pushing the higher frequencies sliders up a bit higher and removing Bass boost entirely. But with this equalizer, we felt that our favorite Xbox Series X games sounded rich, lively and detailed.",
    "It’s worth noting that if you opt for Dolby Atmos, it will stack the EQ you choose over the custom one in the Xbox Accessories app, so make sure you choose a flat EQ in the Dolby Atmos app, or make further adjustments to suit you as it will change the sound.",
    "A great way of fine-tuning your EQ settings, and more importantly, hearing how the sliders shape the sound, is to open Spotify (if you have a subscription) and the Xbox Accessories app at the same time. You can then make changes on the fly as you skip through songs in the Xbox Guide and tweak the various sliders.",
    "We hope that this Xbox Wireless Headset EQ works for you, and remember that if it doesn’t sound quite right, that’s to be expected. Everyone hears sound differently, but hopefully this will help you find the best Xbox Wireless Headset EQ that works for you."
  ],
  "headers": {
    "6": "Head to the Xbox Accessories app",
    "8": "The best Xbox Wireless Headset EQ",
    "15": "Perfect for any genre"
  },
  "links": {
    "Xbox Wireless Headset": "https://www.techradar.com/reviews/xbox-wireless-headset-review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Windows Sonic": "https://www.techradar.com/news/10-xbox-series-x-features-you-might-not-know-about",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Xbox Series X games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Spotify": "https://www.techradar.com/reviews/spotify"
  }
}