{
  "source": "https://www.techradar.com/news/dji-action-2-vs-gopro-hero-10-black-which-is-the-best-action-camera-for-you",
  "title": "DJI Action 2 vs GoPro Hero 10 Black: which is the best action camera for you?",
  "category": "cameras",
  "updated": "2021-10-29T19:16:03Z",
  "author": "andrew-williams",
  "summary": "How do DJI and GoPro's latest action cameras compare?",
  "article": [
    "The GoPro Hero 10 Black is the best action camera you can currently buy, but could that be about to change with the all-new DJI Action 2?",
    "DJI's follow-up to the original DJI Osmo Action – which was itself a top GoPro rival – hasn't just taken the easy route and simply made a slightly improved version. Instead, DJI has gone leftfield, taking more cues from fellow GoPro rival Insta360 than its own cameras or even GoPro’s.",
    "But are these new changes positives or negatives? We're here to break down how the new DJI Action 2 compares to the GoPro Hero 10 Black, so you know which action camera to take on your adventures.",
    "If you simply head to a store and buy the GoPro Hero 10 Black it will set you back $499/£479/AU$749 – that's more than if you bought the new DJI Action 2 instead, which costs $399/£349/AU$609.",
    "That DJI Action 2 package gets you the main camera as well as the power brick add-on. Even if you choose the front screen module instead, you’ll pay less unless you live in Australia. It costs $519/£455/AU$799.",
    "That isn't the end of the story though, as GoPro offers you an alternative way to purchase its top-of-the-range action camera. With a GoPro Subscription, the GoPro Hero 10 Black costs $399/£379/AU$599. GoPro’s subscription gets you cloud storage, discounts, and replacements of up to two damaged cameras a year (with a $99 charge for each Hero 10 Black replaced).",
    "The initial purchase includes a year’s subscription and you can cancel after, so it’s a bit of a no-brainer. That all means that the two cameras are roughly the same in terms of price, giving no clear winner for the budget-conscious buyer.",
    "You can’t miss the primary difference between the DJI Action 2 and GoPro Hero 10: their designs.",
    "The GoPro is a fairly traditional action camera shape, the kind the company has sold for years, with the more recent addition of a secondary front display. It’s a comfortable kind of camera for those of us who have used the things for years.",
    "The DJI Action 2 is a modular camera. You have the main unit, and can attach a battery back or front display module should you need one. These connect using magnets and a clip, rather than just physical sockets.",
    "However, DJI hasn’t gone quite as far down the modular route as Insta360 has with its One R series cameras. You can use the Action 2's main unit on its own, because it has a battery.",
    "Some of you might consider the GoPro Hero 10 Black to be modular camera, too. This is because for recent models you can get the Display Mod with an extra screen, the Media Mod with a microphone, and a Light Mod with an LED array. However, these are accessories for optional features, whereas the DJI system relies on mods for fairly core elements.",
    "The DJI Action 2’s modular approach means the main camera body is much smaller than the GoPro Hero 10 Black. It measures just 39×39×22.3 mm and weighs 56g.",
    "The GoPro, on the other hand, is 71.8 x 50.8 x 33.6 mm and weighs 158g. It is almost three times as heavy, is 50% thicker and is about 85% longer.",
    "This seems to be intended to give the DJI Action 2 a new appeal for the content creator crowd. It can be magnetically mounted to a pendant you wear around your neck so you can wear this under a shirt, and the camera appears to stick to its surface.",
    "The Action 2 is no spy camera – and you shouldn’t be filming people without them realizing anyway – but gives you a fancy way to store the camera when it's not in use.",
    "Add the battery or power modules to the Action 2, though, and we get closer to the weight of the GoPro Hero 10 Black, even if the DJI is still lighter. The kit weighs 112g with the power module, 120g with the front screen one. That is up to 38g less than the GoPro.",
    "Aside from making the controls more fiddly, there is a price to pay for this flexibility. The camera alone offers 10m water resistance, which is great, but you lose that if you plug in a module. You’ll need to get hold of the waterproof case for proper waterproofing in that case, as it provides 60M resistance for an Action 2 with one of its extra modules.",
    "There’s also a predictable hit to battery life for DJI's action cam. DJI says the Action 2 will last up to 70 minutes when shooting at Full HD resolution (30fps) with the camera brick alone.",
    "The GoPro Hero 10 Black lasts up to 112 minutes in the same scenario. This drops to 76 minutes when shooting at 4K resolution (60fps). And if the DJI experiences a similar drop, it’s likely to last for 45-47 minutes when using the 4K mode.",
    "Is 45 minutes enough for casual shoots? A lot of the time it will be, sure. However, you also need to factor in the Action 2's tendency to overheat, which means it can only record short clips. For example, without any modules attached, our Action 2 stopped recording at 4K 60fps after 5m 45s (with the battery at 79%).",
    "You also lose the easy-swap battery system that GoPro uses. It’s the cost of shrinking everything down to the level DJI has achieved.",
    "Battery life is much better with the Action 2’s Power Mod attached, though. Stamina increases to 180 minutes at 1080p – around 60% longer than the GoPro Hero 10 Black. You can treat these just like a GoPro Battery too, although at $75 a pop they are much more expensive than the $20 GoPro alternative.",
    "You also get only slightly worse figures if you use the Action 2’s front screen module instead of the Power Mod, at 160 minutes (1080p) instead of 180. That module has its own battery as well.",
    "Buy a DJI Action 2 and you have to deal with the same issue we discovered using the Insta360 One R. The screen is pretty small, and not the ideal aspect ratio if you publish 16:9 video.",
    "This is a 1.76in screen with 446 x 424 pixels. It’s going to look very sharp, but the shape is almost square. The Front Touchscreen Module has an identical screen, too. Both look to be of great quality, aside from the size and shape issues.",
    "They are OLED screens with Gorilla Glass protection, and are rated at 500-nit brightness. That is similar to the level of a lower-mid-range phone, and will appear at least reasonably clear outdoors.",
    "Composing a scene on the 2.27-inch widescreen display of the GoPro Hero 10 Black is going to feel more comfortable. You’re trading one form of convenience for another here.",
    "DJI made an interesting choice in the Action 2’s sensor. It’s a 1/1.7-inch sensor, which is around 35% larger than the GoPro’s 1/2.3-inch sensor, used to shoot stills and video at up to 12MP resolution.",
    "However, the GoPro has a much higher-resolution 23.6MP chip, which is what allows it to shoot at 5K resolution. The DJI Action 2 doesn’t have enough pixels to shoot at 5K.",
    "Of course, larger sensor pixels gives the DJI more of a chance at producing usable night-time footage. No GoPro to date has managed to shine in low light.",
    "You could argue 12MP is the optimal sensor resolution for 4K video capture. Sony seems to agree, having used this resolution in the Sony A7S III.",
    "However, we have to consider the realities of shooting with an action camera. A lot of the time you actually use a significantly cropped view. When you use digital zoom in the Action 2, you end up upsampling sensor information to reach 4K resolution.",
    "Still, despite having a lower resolution sensor, the DJI Action 2 actually has a slightly higher maximum bit-rate than the GoPro. It offers up to 130Mbps, where 100Mbps is the GoPro Hero 10 Black’s max setting.",
    "As already mentioned, the GoPro Hero 10 Black’s maximum capture resolution is better than the DJI Action 2’s. It can shoot at up to 5.3k resolution.",
    "The DJI Action 2 can use 4K resolution, at either a 16:9 or 4:3 aspect ratio. The latter is 4096×3072. This might be the native resolution of the sensor, but let’s hope it’s not or you won’t be able to use electronic stabilization in this mode.",
    "GoPro also has the edge for slow-mo capture. It can shoot 4K resolution at 120fps or 2.7K at 240fps. While the DJI Action 2 can handle 4K at 120fps too, if you want to shoot at 240fps you have to use a lower resolution of 1080p.",
    "This is likely the effect of GoPro's more powerful, or more optimized, GP2 processor. Last year’s GoPro Hero 9 Black could only handle 240fps at 1080p, just like the Action 2, because it has the older GP1 processor.",
    "We don’t think you are going to be disappointed by either of these cameras’ stabilization, particularly if you are new to higher-end action cameras. The GoPro Hero 10 Black uses a system called Hypersmooth 4.0. DJI’s Action 2 has Rocksteady 2.0.",
    "And, impressively, both offer horizon leveling. This keeps your footage looking 'upright' even if the camera tilts significantly, at up to 45 degrees in the case of the GoPro Hero 10 Black.",
    "Naturally, this only works with digitally cropped modes, as it uses the same techniques as normal electronic stabilization. Image data that’s out of the initial preview frame but is 'seen' by the sensor is used to smooth out the final footage.",
    "However, DJI’s HorizonSteady taps out far earlier than GoPro’s Horizon Levelling. You can only use Horizon Steady at resolutions below 4K. If you shoot at 100fps or above you don’t get stabilization at all. You do, though, get 180-degrees of tilt correction on the Action 2, compared to the GoPro's more limited 45-degrees.",
    "GoPro’s version works in the Hero 10 Black’s top modes including 5K and 2.7K at 240fps. Once again, this is the power of the GoPro GP2 showing what it can do. It’s pretty impressive.",
    "The DJI Action 2 is a more niche camera than the GoPro Hero 10 Black. Whereas the original Osmo Action had a good stab at using the GoPro formula and upgrading it, the Action 2 goes in a different direction.",
    "Its modular approach is great if you want an ultra-small camera you can attach to clothing, or mount to things with even less bulk involved than with a GoPro. But you sacrifice low-cost, easy-swap batteries and a screen of a shape similar to the actual footage you’re looking to capture. The GoPro Hero 10 Black’s GP2 processor also gives it the edge for stabilization and high-frame-rate video.",
    "Still, if you’d like to capture a lot of vlogs where the camera is strapped to your head, or your shirt, the DJI Action 2 seems like a great solution. If you like to see yourself while filming, though, then the GoPro Hero 10 Black is the more convenient (and fully waterproof) option."
  ],
  "headers": {
    "3": "Price: the DJI Action 2 seems cheaper, but is it?",
    "7": "Design: modular versus traditional",
    "12": "Size and weight: tale of two halves",
    "18": "Battery life: GoPro goes for longer",
    "24": "Usability: GoPro has more screen estate",
    "28": "Sensor: Larger sensor, lower resolution",
    "34": "Shooting modes: GoPro offers better maxed-out modes",
    "38": "Image stabilization: GoPro leads the way",
    "43": "First impressions"
  },
  "links": {
    "best action camera": "https://www.techradar.com/news/best-action-camera",
    "DJI Action 2": "https://www.techradar.com/reviews/dji-action-2",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "Insta360": "https://www.techradar.com/reviews/insta360-one-r-1-inch-edition",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii"
  }
}