{
  "source": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-could-turn-up-earlier-than-expected-in-2022",
  "title": "Nvidia RTX 4000 ‘Lovelace’ GPUs could turn up earlier than expected in 2022",
  "category": "computing",
  "updated": "2021-08-29T11:05:20Z",
  "author": "darren-allan",
  "summary": "Maybe we’ll see them before the end of 2022, after all",
  "article": [
    "Nvidia’s next-gen graphics cards, purportedly codenamed Lovelace, might be here earlier than expected in 2022, and could be built by TSMC on a 5nm process, or so the latest rumor reckons.",
    "This comes from well-known hardware leaker Kopite7kimi on Twitter, who replied to a comment about the incoming GPUs arriving late in 2022 if they are actually on TSMC 5nm (and being expensive, too).",
    "As Wccftech, which spotted this tweet, points out, the leaker had previously said that what will presumably be RTX 4000 graphics cards would be built on a 5nm process, but the assumption was that Nvidia could stick with Samsung for making Lovelace chips. Now Kopite7kimi has clarified that it’ll purportedly be TSMC, and this backs up what we’ve heard in recent times from another leaker – namely Greymon.",
    "Greymon has theorized that Lovelace GPUs could be made on TSMC 5nm or maybe even an enhanced 5nm process (‘N5P’) which would offer an even better performance leap from Ampere.",
    "Remember, these are pretty airy rumors at this stage, but the fact that more than one source is now saying TSMC 5nm does suggest that maybe this is the route Nvidia will indeed take. It’s also possible that only certain models of RTX 4000 cards will be made at TSMC, and other chips could be manufactured at Samsung.",
    "Whatever the case, it’s good to hear that Kopite7kimi believes that we won’t be waiting until late 2022, and that the next-gen graphics cards could arrive a bit earlier in the year. Particularly as previously, Greymon seemed to quite firmly assert that these cards wouldn’t pitch up until the close of 2022 at best.",
    "Fingers crossed that we could see RTX 4000 cards sooner than expected, perhaps, although it wouldn’t be a surprise if these new models were seriously pricey, as the original tweet Kopite7kimi replied to suggested.",
    "That’s very much the direction that the GPU industry has been headed, of course, but hopefully the extra pressure that stock shortages have been putting on pushing prices upwards will ease as we get to a better place in terms of component supply throughout 2022.",
    "That said, another recent rumor indicated that graphics cards could get more expensive at the beginning of next year, interestingly with this theoretically being driven by TSMC upping its prices (responding to the huge demand for its chips). Which, if it pans out, would be an argument for Nvidia not switching to TSMC you would think – or perhaps only using it for certain models like maybe the cutting-edge flagship."
  ],
  "headers": {
    "4": "Analysis: Fingers crossed for an earlier release – but what about those prices?"
  },
  "links": {
    "Nvidia’s next-gen graphics cards": "https://www.techradar.com/news/nvidia-geforce",
    "Lovelace": "https://www.techradar.com/news/nvidias-next-gen-gpus-may-honor-british-mathematician-ada-lovelace",
    "Wccftech": "https://wccftech.com/nvidia-next-generation-ada-lovelace-gpus-will-use-tsmcs-5nm-process-instead-of-samsungs/",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Greymon has theorized": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-finalized-could-arrive-end-2022",
    "Greymon seemed to quite firmly assert": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-finalized-could-arrive-end-2022",
    "graphics cards could get more expensive": "https://www.techradar.com/news/graphics-cards-could-get-even-more-expensive-next-year-heres-why"
  }
}