{
  "source": "https://www.techradar.com/news/this-could-be-the-worlds-first-ddr5-laptop-but-you-will-never-guess-who-built-it",
  "title": "This could be the world’s first DDR5 laptop, but you'd never guess who built it",
  "category": "pro",
  "updated": "2021-12-06T16:15:04Z",
  "author": "desire-athow",
  "summary": "Huawei reportedly readying a business laptop based on ARM and LPDDR5",
  "article": [
    "Embattled Chinese manufacturer Huawei is not giving up on laptops - at least not yet.",
    "Although the company's MateBook X Pro, MateBook 14 and MateBook D15 were amongst the more popular laptops in the UK during Black Friday and Cyber Monday, US restrictions imposed in 2018 by the Trump administration have now forced Huawei to think outside the box when it comes to its long-term strategy.",
    "Chinese website Mydrivers has published what looks like marketing documentation pertaining to a new business laptop from Huawei to target enterprises in mainland China.",
    "The laptop, reportedly called the Dyna Cloud L420, will feature a new system-on-chip called the Kirin 9006C; supporting eight ARM-based cores clocked at up to 3.13GHz will be a Kirin 9000C GPU. However the big surprise is that the device will support LPDDR5, with the base configuration supplying 8GB of it.",
    "If this information is indeed correct, the L420 would be the world’s first laptop to feature DDR5 memory, meaning Huawei has beaten both Intel and AMD to this particular prize.",
    "The rest of the device's purported specifications includes up to 512GB UFS 3.1, Wi-Fi 6, a Gigabit Ethernet LAN port, Bluetooth 4.2, six ports, a 56WHr battery and a 14-inch 2160 x 1440 pixel display, which means that this laptop is likely to reutilize the same base shell as the MateBook 14. That’s almost a certainty as the two share the same dimensions.",
    "The Chinese government has been keen on reducing the technological dependence of its owned-and-operated businesses on foreign hardware and software - meaning there won't be any Windows 11 on this new Huawei device for the time being.",
    "The report mentions Huawei’s Unity OS (UOS) as well as a Kirin K OS, which could mean a dual-booting laptop. A marketing leaflet published by the Chinese news outlet claims that the former is now compatible with more than 32,000 peripherals, applications and services.",
    "The L420, which will supersede the L410, is likely to be a niche product with limited global appeal other than for the curious few looking to try an ARM-based laptop that could give Chromebooks a run for their money. So, could Huawei launch it outside of China as a premium Chromebook? We don’t see why not."
  ],
  "headers": {
    "3": "No Windows, no wonder"
  },
  "links": {
    "MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2021",
    "MateBook 14": "https://www.techradar.com/reviews/huawei-matebook-14-review",
    "MateBook D15": "https://www.techradar.com/reviews/huawei-matebook-d-15-2020",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Mydrivers": "https://news.mydrivers.com/1/800/800201.htm",
    "business laptop": "https://www.techradar.com/news/best-business-laptops",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook"
  }
}