{
  "source": "https://www.techradar.com/news/oculus-quest-2-sales-figures-prove-vr-has-finally-gone-mainstream",
  "title": "Oculus Quest 2 sales figures prove VR has finally gone mainstream",
  "category": "gaming",
  "updated": "2021-04-01T09:16:40Z",
  "author": "hamish-hector",
  "summary": "Better than all the rest",
  "article": [
    "The Oculus Quest 2 has sold more total units than all other Oculus headsets combined. The milestone was recently announced by the VP of Facebook Reality Labs, Andrew Bosworth, and shows that VR is finally starting to hit the mainstream.",
    "Speaking to Bloomberg, Bosworth explained that the Oculus Quest 2’s sales are “a tremendous indicator that we are now at that point where we have broken through from the early adopter crowd to an increasingly mainstream crowd.”",
    "While we don’t have any exact figures for how many Oculus Quest 2s have been sold, we now know that in just over five months it managed to outsell headsets like the Oculus Rift that have been available for five years. Other VR device manufacturers are likely taking note of this success - the rumored wireless Valve Index 2 and wireless Apple headset could soon become reality, and will likely be keeping a close eye on what’s made the wireless Oculus headsets so successful.",
    "In our review of the Oculus Quest 2, we absolutely adored what Facebook had to offer us. The VR experiences were fantastic, the device was easy to use and importantly it was still comfortable to wear.",
    "All of that was packaged in a product that costs less than almost every other VR headset on the market. That’s before you even consider the additional savings you’ll make for not requiring a powerful PC to operate it, like you would with the Quest Rift S – despite the fact you can optionally hook it up to a PC to take advantage of high-end PC VR experiences.",
    "With all of that in mind it seems obvious that the Quest 2 would succeed - especially in a year where many of us have been confined to our houses and virtual escapes might have been our only options to explore somewhere different.",
    "Hopefully Facebook continues to develop even more great VR headsets and we can’t wait to see what an Oculus Quest 3 could offer us."
  ],
  "headers": {
    "3": "Why has the Oculus Quest 2 sold so well?"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Facebook Reality Labs": "https://www.techradar.com/news/mind-monitoring-wristwear-and-hands-free-input-are-the-future-of-ar-and-vr-control-says-facebook",
    "Bloomberg": "https://www.bloomberg.com/news/videos/2021-03-29/facebook-reality-labs-vp-vr-will-transform-global-work-video",
    "Apple headset": "https://www.techradar.com/news/apple-vr-headset",
    "Quest Rift S": "https://www.techradar.com/reviews/oculus-rift-s-review",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs"
  }
}