{
  "source": "https://www.techradar.com/news/ps5-is-it-in-stock",
  "title": "The PS5 will be even harder to buy soon – here's why and how to find it in stock",
  "category": "gaming",
  "updated": "2021-05-28T02:31:58.564Z",
  "author": "matt-swider",
  "summary": "Analysis: Finding PS5 in stock has gone from bad to worse. Here's one solution to finding a restock right away.",
  "article": [
    "News about PS5 is about to get even grimmer if you intend to find a PS5 restock in the latter half of 2021, according to tech-industry analysts and our PS5 restock Twitter tracker Matt Swider. Matt sends instant alerts every time retailers in the US restock the next-gen Sony console – if you follow his Twitter account and turn on notifications. However, go into almost any Walmart and you'll see a sign that says \"Attention Customers: These indemand items are not told in stores,\" listing out the PS5 Disc, PS5 Digital, Xbox Series X and Xbox Series X.",
    "Other American retailers like Target, Best Buy and GameStop have all given us similar statements and have had fewer PS5 consoles online in recent weeks. Our exclusive reporting has included top retailers telling us 'April and May look grim'. They were right – and it's about to get even worse as PS5 demand increases, not wanes like some consumers are expecting.",
    "Click this example of a PS5 restock alert from Twitter tracker Matt Swider. Follow his Twitter account and turn on notifications to receive restock alerts on your phone.",
    "PS5 launch games weren't exactly system sellers. For example, Spider-Man: Miles Morales for PS5, a spirited free-roam sequel, is also available on PS4 and you aren't out of luck if you buy the game for the older console; Sony's free upgrade to PS5 graphics means the PS4 version is versatile for eventual console upgraders. Demon's Souls, exclusive to PS5 and even more graphically stunning, is a remake of a game that's now ten-plus years old. Sony was off to good, but not great start at launch.",
    "Six months later, we're now seeing true PS5-exclusive games and heavy-hitters. The latter half of April gave us Resident Evil Village and Returnal. Looking to next month, the Ratchet & Clank: Rift Apart release date is June 11 and seems like a can't-miss. Deathloop, Ghostwire: Tokyo and God of War 2: Ragnarok, all due to be released this year, are going to make the PS5 even more in demand in the latter half of 2021.",
    "As soon as we get our first glimpse of Uncharted 5 from Naughty Dog – hopefully during the PlayStation-involved Summer Game Fest that's timed during E3 2021 – expect even more people to suddenly want a PS5 console.",
    "The past four Christmas seasons, especially during Black Friday and Cyber Monday, we've seen the Nintendo Switch sell out instantly every time there's a restock... a console that's now more than four years old and you'd think everyone has by now. But demand for new consoles increases around this time of year without fail.",
    "Come October 2021, we'll be surprised if you're able to find a PS5 in stock. According to the replies to Matt Swider on Twitter, some people have given up for now with the expectation that they'll be able to buy the PlayStation 5 later this year. What these people don't know is that a whole set of new consumers are going to want to the console right before Christmas. In other words, good luck trying to compete with that surge in demand.",
    "Sony admits it can't ramp up production of the PlayStation 5 quickly enough and the analysts we've talked to agree that the shortage won't let up until 2022.",
    "\"I honestly don't see this shortage getting better until next year,\" Anshel Sag, Senior Analyst at Moor Insights & Strategy told TechRadar. \"A big component of these console shortages is the fact that these consoles' CPU and GPU are manufactured on the same process node as AMD's rapidly growing CPU and GPU businesses for PCs.\"",
    "It's not just Sony vying for these precious components either, according to Sag. \"With Qualcomm and Apple taking up vast swaths of 5nm, there isn't very much capacity left for vast jumps in demand even with process node optimizations.\"",
    "\"Capacity isn't easy to grow and the best thing that can happen to the industry is that PC demand cools off a bit now that everyone who needed a PC to work remotely has one. However, there still appears to be a lot of pent-up demand in the PC gaming segment which is still red hot and suffering from the worst GPU shortage I think I've ever seen in my 15-plus-year career.\"",
    "In other words, if you see the PS5 console in stock through PS5 restock Twitter tracker Matt Swider, get it while you can."
  ],
  "headers": {
    "3": "Must-have PS5 games are starting to come out",
    "6": "PS5 is going to see Nintendo Switch-like demand",
    "8": "PS5 supply won't recover until 2022"
  },
  "links": {
    "PS5 restock Twitter tracker Matt Swider": "http://www.twitter.com/mattswider",
    "Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Demon's Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Ratchet & Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "God of War 2: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Uncharted 5": "https://www.techradar.com/news/gaming/consoles/uncharted-5-may-well-happen-but-nathan-drake-won-t-be-involved-1312984",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-to-replace-e3-as-2020s-marquee-gaming-event",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}