{
  "source": "https://www.techradar.com/news/technology-personalization-and-the-future-of-fan-engagement",
  "title": "Technology, personalization and the future of fan engagement",
  "category": "computing",
  "updated": "2021-09-14T10:25:32Z",
  "author": "laurence-norman",
  "summary": "How technology impacts sport and the fan experience",
  "article": [
    "The marriage between data and sport is growing stronger each year. Football is littered with statistics on distance travelled, expected goals and tackle success, while technology such as DRS has become an ingrained part of the cricket experience and data analysis has become crucial for golfers in search of the perfect swing. Like so many other industries, sport is embracing digital transformation and it is becoming increasingly reliant on data to achieve this.",
    "We see explicit evidence of the impact of data on player performance in particular. With success in sport at the highest level so often reliant upon the smallest of improvements, it’s no surprise to see athletes turn to data to gain a competitive edge. Whilst we are seeing this across a myriad of sports, the data-rich nature of golf makes it stand out from the crowd. AI technology is used to help players make the incremental improvements that allow them to reach the top of their game, from the smallest of changes in swing motion, to weight distribution during shots. More than perhaps any other sport, success in golf is reliant on the finest of margins, so it’s little surprise to see players embrace the possibilities of data analytics.",
    "Data does not just help athletes improve their performance; it brings fans closer to the sports they love. By mastering the increasing amount of data available to us, we’re able to provide unprecedented insight into the mechanics of the sport and find new narratives that engage viewers. The second screen experience embellishes our enjoyment of our favorite sports, whether watching in person, at home or on the go.",
    "Parallel to this is the growing demand from consumers for personalization. Fans want to be able to follow the action in their own way, and technological innovation allows us to cater for this demand.",
    "However, engaging fans isn’t just about the technology or even the data: it’s about how data is understood and translated into exciting stories which capture the excitement and drama of our favorite sports.",
    "Sport is built on emotion. By leveraging the latest technological innovations in data analytics, we enhance the emotional experience and take fan engagement to exciting new levels.",
    "There is a race across the sporting world as to who can lead the pack in terms of technological advancement, and this competition inevitably leads to increased expectations from fans. To meet this growing demand, venues and sporting events are embracing new digital experiences that can embellish how fans engage with the action when watching live sport.",
    "This is particularly apparent with golf. The geographical nature of the sport makes it very tricky to stay on top of all the latest developments as they happen. Fans tend to either settle in the grandstand at a particular hole or opt to follow a particular group of players as they make their way around the course. This raises a challenge for broadcasters too, who must have their finger on the pulse to catch the most exciting moments of the day as they happen.",
    "This is where technological innovation comes to the fore. By combining AI analytics with data feeds, visual coverage and game analysis can be automated in an unprecedented manner. Video AI technology can also be used to create highlights and updates based on the emotional reactions of fans as key moments unfold, something that NTT DATA introduced at The Open in 2018. For a sport with as many twists and turns occurring simultaneously as golf, such innovation takes fan engagement to the next level by creating content that fans want to interact with.",
    "It is important to remember that innovation in fan engagement is not just reserved for those lucky enough to attend an event in person. The vast majority of us have had to adjust to following our favorite sports from the comfort of our own homes over the past year, so finding new and innovative ways to enhance the experience for remote fans has taken on increased significance.",
    "When we’re on the go and cannot tune into a live broadcast of an event, fans often turn to live feeds and text commentary to keep abreast of the latest developments. In place of access to a live broadcast, an engaging and detailed statistical breakdown of the action as it happens is the next best thing.",
    "However, the two experiences need not be mutually exclusive. Fans are increasingly embracing statistical commentary and analysis as a supplement to their viewing experience. In the aftermath of a memorable moment during an event, it’s common for viewers to turn to a live data feed to get contextual information relating to the moment in question, or to social media to see how fans from all over the world are responding in real-time.",
    "This presents an opportunity for sporting institutions to embellish the fan experience. At The Open this summer, NTT DATA provided a live personalized data feed for fans, giving them all the data they wanted as it happened, through The Open’s official website. Providing this second screen experience as an official element of the event augmented the engagement with fans, meaning they could see all the data without ever having to leave the broadcast.",
    "Personalization is the key to bringing this experience to life, so how can it be achieved? Put simply, to deliver a personalized experience, we need to master our data. This is the case for businesses across all industries, and sport is no exception. Enhancing fan engagement is reliant upon developing a deep understanding of each individual. Advancements in data analytics mean we are well past the point where we have to rely on assumptions to communicate effectively with fans.",
    "With the wealth of choice available, sports fans want to be able to access the data that is most important to them, and personalization allows sporting institutions to provide this. By mastering our data, we are able to provide fans with the content they want, when they want it, and create a second screen experience that takes fan engagement to exciting new places."
  ],
  "headers": {
    "2": "Data for the fans",
    "6": "Enhancing the live experience",
    "9": "Engaging every fan",
    "13": "The personalized experience"
  },
  "links": {
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting?tag=alharo_com-20",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools?source=in"
  }
}