{
  "source": "https://www.techradar.com/news/astronomers-finally-solve-the-mystery-of-a-famous-900-year-old-chinese-supernova",
  "title": "Astronomers finally solve the mystery of a famous 900-year-old Chinese supernova",
  "category": "appliances",
  "updated": "2021-09-20T21:55:12Z",
  "author": "john-loeffler",
  "summary": "The Chinese 'Guest Star' has finally been identified",
  "article": [
    "A 900-year-old mystery has finally been solved as an international team of astronomers say they have identified the source of a famous supernova recorded by astronomers in 1181 CE.",
    "The supernova, which is known as the \"Chinese Guest Star\", was observed by Chinese and Japanese astronomers and was described as being as bright as Saturn and remaining visible in the night sky for as long as six months.",
    "While these astronomers also recorded the approximate location of the supernova in the sky, no one has been able to identify any remnant of it to date, even as astronomers have been able to track down the sources of the other four bright supernova in the Milky Way that have been observed and documented by astronomers in the past millennium.",
    "Now, a team of astronomers from Hong Kong, Spain, Hungary, France, and the UK say in a new paper in The Astrophysical Journal Letters that a nebula known as Pa 30 is the remnant of the star that violently erupted in a supernova in 1181.",
    "According to the team's observations, the nebula is expanding at an \"extreme velocity\" exceeding 1,100 km a second, or nearly 2,500,000 mph. At this speed, it would only take you five minutes to get from the Earth to the Moon.",
    "Using this velocity, the astronomers were able to trace it back to its origin to a star known as Parker's Star, and determine it was created by a supernova around 1,000 years ago, which puts it in the right place in the sky and the right time to have been the Chinese Guest Star observed here on Earth.",
    "\"The historical reports place the guest star between two Chinese constellations, Chuanshe and Huagai,\" said University of Manchester Professor Albert Zijlstra, one of the paper's co-authors, in a statement. \"Parker’s Star fits the position well. That means both the age and location fit with the events of 1181.\"",
    "Parker's Star and Pa30 are believed to have been the result of a merger of two white dwarf stars, which in turn produces a relatively faint and rare form of supernova known as a Type Iax supernova.",
    "\"Only around 10% of supernovae are of this type and they are not well understood,\" Zijlstra said. \"The fact that SN1181 was faint but faded very slowly fits this type. It is the only such event where we can study both the remnant nebula and the merged star, and also have a description of the explosion itself.\"",
    "For Zijlstra and team, being able to stich up this cosmic cold case has been a satisfying effort for all involved.",
    "\"Combining all this information such as the age, location, event brightness and historically recorded 185-day duration, indicates that Parker’s star and Pa30 are the counterparts of SN 1181. This is the only Type Iax supernova where detailed studies of the remnant star and nebula are possible. It is nice to be able to solve both a historical and an astronomical mystery,\" he said.",
    "The great thing about something like the Chinese Guest Star is that it's a good reminder that science is a process more than it is anything else.",
    "Astronomers nearly a millennium ago recorded their observations of a phenomenon that they could not explain and left that record for scientists 1,000 years later to pick up and study.",
    "Today, scientists are making all kinds of observations and deductions that they can't explain yet, especially in more cutting edge fields like quantum mechanics and theoretical physics, that scientists decades or even centuries from now will be able to finally explain.",
    "Recording that data, then, is an important part of the scientific process and is worth supporting, even if we can't explain it or do anything with it in our lifetimes."
  ],
  "headers": {
    "11": "Analysis: science never truly stops, even when the scientist is long dead"
  },
  "links": {
    "The Astrophysical Journal Letters": "https://doi.org/10.3847/2041-8213/ac2253",
    "in a statement": "https://www.manchester.ac.uk/discover/news/astronomers-solve-900-year-old-cosmic-mystery-surrounding-chinese-supernova-of-1181ad/"
  }
}