{
  "source": "https://www.techradar.com/news/why-live-video-will-be-a-critical-tool-for-ceos-post-pandemic",
  "title": "Why live video will be a critical tool for CEOs post-pandemic",
  "category": "computing",
  "updated": "2021-03-16T12:02:44Z",
  "author": "nazir-ul-ghani",
  "summary": "Leaders must find new ways to connect with employees and navigate them through difficult times",
  "article": [
    "2020 was a year that brought significant change. The pandemic shifted the way we work, separating colleagues that normally gathered together in offices and putting unprecedented pressure on frontline workers. Things that were once taken for granted – handshakes with colleagues and meeting with friends – became a thing of the past.",
    "Meanwhile, social movements gained momentum like never before, Black Lives Matter challenged people and businesses to reassess their behaviors and take decisive action. And at the same time, workers were contending with furlough, redundancies and job insecurity.",
    "As a result, the spotlight is on leaders, and many are questioning how their role must evolve in the face of these momentous challenges. The greatest asset of any business is its people, and with economic recovery a priority, leaders must find new ways to connect with employees and navigate them through difficult times if they want to drive business performance, ensure talent retention and create a more inclusive culture at work.",
    "In this context, leaders are compelled to go beyond day-to-day management and leave behind traditions that no longer serve the evolution of business. One skill that has emerged as valuable for leaders is empathy. In fact, many workplace analysts, like Josh Bersin, corroborate that empathy underpins the best workplace cultures and drives productivity. And, he argues, it’s on CEOs to drive empathy within the organization right from the top.",
    "Indeed with work from home measures still widely in place, many people are feeling increasingly isolated. And it’s hard to show real empathy via traditional communication methods. Emails and newsletters can land flat, without the nuance of image and voice. As a result, more executives are turning to live video updates, to show transparency, accountability and authenticity in real time.",
    "Never before have conversations around employee wellbeing and D&I initiatives been as important as they are today. Gone are the days where leaders can avoid taking a stance on issues - and rightly so. Today, people want to know the company they work for is principled and that they share common aims and beliefs. A key part of this is creating opportunities for employees to share what’s important to them, as well as their thoughts and concerns. And these aren’t the type of conversations that can be facilitated through email chains.",
    "The companies getting it right today are those that are willing to open these conversations up to everybody in the company. For example, one Workplace customer decided to start a new series of company town halls following the George Floyd protests - giving their global employee base the chance to hear from the company and be part of the dialogue.",
    "Employees look to their CEOs to lead in uncertain times, so it’s important that they are proactive, open and create spaces for two-way communication. Using live video, CEOs can connect with people in a way that is human and sincere. This communication builds a level of trust that engenders community and pins the moving parts of organizations together under the flag of culture.",
    "In real life, communication is a two-way street. In a remote office landscape, constant communication up and down an organization is essential to build and maintain that inclusive workplace culture. To demonstrate their renewed people-first commitments, leaders must build deeper connections across the business, and, as mentioned above, provide forums for people to voice ideas or concerns.",
    "A great example of this is hotel group Ennismore. Over the pandemic, the company’s CEO went live regularly, creating a virtual ‘open door policy’ where employees can feel safe and supported to pose any question.",
    "Understanding the sentiment of staff questions and feedback in these settings is vitally important. Based on responses, CEOs are able to address issues and concerns before they arise or escalate, and help employees feel heard. These are the actions that help organizations stay strong as a unit and move forwards with everyone on the same page.",
    "On a practical level, the pandemic has necessitated the fast spread of information and required fundamental shifts in the ways we do business. With constantly changing policies out in the news before businesses have time to get up to speed, it’s imperative that changes to furlough, office openings and other company decisions are communicated swiftly and with clarity, to avoid anxiety or confusion amongst staff.",
    "As companies become increasingly global, technology can help leaders connect with all employees. For lastminute.com, staff are spread across multiple countries and continents, so using live video brings updates directly to all employees.",
    "Not only is this technology more efficient at landing messages in real-time, it also carries more accessibility benefits too. Companies have the option to translate captions where needed so the message is clear for every employee. In addition, when employees can’t watch in real time, content is available on demand, so people can go back and find critical information.",
    "In these cases, important information can be brought to employees - rather than the other way round. Keeping employees updated at scale is tricky, but failing here can mean the difference between an empowered work community and one where stress and confusion breeds.",
    "Gone are the days of employee surveys once a year – the best collaboration technology supports interactivity, so that leaders can understand their teams in real time. When CEOs use tools like live video, they can connect with team members across all levels, get critical information out quickly and understand the reactions of people on the ground.",
    "Above all, successful leaders are prioritizing access - to information, to people, to themselves. Operating with vulnerability and integrity will be the new language of CEOs as we learn better ways of working following a year of momentous change. This will be the difference between businesses that thrive in the new world, and those that don’t."
  ],
  "headers": {
    "3": "Enter the CEO (Chief Empathy Officer)",
    "5": "Real conversations connect employees",
    "8": "The virtual 'open door' policy",
    "11": "Rapid information sharing",
    "15": "Looking ahead"
  },
  "links": {
    "best collaboration technology": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}