{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-may-have-one-less-competitor-as-lg-reportedly-delays-its-next-phone",
  "title": "Samsung Galaxy S21 may have one less competitor as LG reportedly delays its next phone",
  "category": "phones",
  "updated": "2021-03-03T01:35:14.188Z",
  "author": "david-lumb",
  "summary": "The LG Rainbow’s pre-release field tests have reportedly been cancelled",
  "article": [
    "LG’s next flagship, the supposedly-called LG Rainbow, might have been delayed indefinitely after reports emerged that the phone’s pre-release field testing has been put on hold. While the phone was expected to come out in March, it’s unclear if it will come out at all.",
    "LG and mobile network operators chose not to proceed with field testing that was scheduled for the end of February, which would precede a March release window, a source told Korean outlet Chosun.",
    "The Rainbow, which followed last year’s LG Velvet, had gotten far enough in development to have produced a prototype that packed a Snapdragon 888 and used a stylus, the report continued.",
    "It’s unclear whether the testing will be temporary or result in permanent cancellation of the Rainbow, especially given the contradictory rumors on LG’s phone business. Shortly after CES 2021, the company’s CEO strongly denied that LG’s smartphone department was shuttering, though he reportedly told employees the company was considering withdrawing from phones (among other potential actions) in an internal memo later in the month.",
    "Naturally, that led to doubt that the company’s LG Rollable, which it had publicly revealed during a CES 2021 presentation and confirmed to CNET would be coming later in 2021, may not reach the market at all. The brand denied it has delayed or cancelled the rollable, but time will tell if LG’s great leap in phone tech gets released."
  ],
  "headers": {
    "3": "LG Rainbow: cancelled with the rest of LG’s phone business?"
  },
  "links": {
    "Chosun": "http://it.chosun.com/site/data/html_dir/2021/02/26/2021022602300.html",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "denied": "https://www.techradar.com/news/lg-rollable-may-be-delayed-or-even-cancelled-suggests-supply-chain-intel",
    "considering": "https://www.techradar.com/news/lg-has-revealed-that-it-might-stop-making-smartphones",
    "CNET": "https://www.cnet.com/news/the-lg-rollable-phone-unveiled-at-ces-is-actually-real-coming-out-in-2021/",
    "reach": "https://www.techradar.com/news/we-might-not-see-the-lg-rollable-go-on-sale-after-all"
  }
}