{
  "source": "https://www.techradar.com/news/netflix-announces-comic-con-style-event-featuring-stranger-things-and-more",
  "title": "Netflix announces Comic Con-style event featuring Stranger Things and more",
  "category": "entertainment",
  "updated": "2021-08-25T15:42:15Z",
  "author": "axel-metz",
  "summary": "The livestream-only event sounds like a big deal",
  "article": [
    "Netflix has announced its first-ever global fan event, Tudum, set to take place on Saturday, September 25.",
    "So-called for the sound that greets you when booting up the streamer, the virtual showcase will bring together the stars and creators of Netflix’s biggest properties, including Stranger Things, The Witcher and Sex Education.",
    "These actors and showrunners will introduce first looks, trailers and exclusive info around more than 70 films and TV shows heading to the streamer in the coming months, from returning series like Cobra Kai to brand new Netflix movies like Don’t Look Up.",
    "You can watch the announcement trailer for the event, which features the likes of Henry Cavill, Chris Hemsworth and Millie Bobby Brown, below.",
    "Netflix says the three-hour virtual livestream event will begin at 9am PT / 12pm ET / 4pm GMT, and be broadcast across its YouTube channels, in addition to Twitter and Twitch.",
    "There’ll be special pre-shows spotlighting Korean, Indian and new anime properties, too, which are set to kick-off at 5am PT / 8am ET / 12pm GMT on specific Netflix channels.",
    "It’s worth noting that Netflix has already run a similar showcase event via its Geeked episodes, though Tudum looks set to provide a more comprehensive look at its latest movies and TV shows, while also including a lot more A-list talent.",
    "Geeked episodes typically only include new looks at Netflix’s TV properties, too, while Tudum will cover the streamer’s feature-length projects as well as its upcoming series. It’s likely, then, that we may get our first proper look at movies including Red Notice and The Power of the Dog on September 25.",
    "There’s also no word yet on whether Tudum will become a regular occurrence, but amid the ongoing global pandemic, a big livestream reveal of this nature is most welcome.",
    "Let’s see how the first one goes, shall we?"
  ],
  "headers": {},
  "links": {
    "Stranger Things": "https://www.techradar.com/news/stranger-things-season-4",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Sex Education": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "Cobra Kai": "https://www.techradar.com/news/cobra-kai-season-4",
    "new Netflix movies": "https://www.techradar.com/news/new-netflix-movies-2021-every-confirmed-release-date-and-trailer",
    "Geeked": "https://twitter.com/NetflixGeeked?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor"
  }
}