{
  "source": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-and-rx-6700-graphics-cards-may-launch-in-march",
  "title": "AMD Radeon RX 6700 XT and RX 6700 graphics cards may launch in March",
  "category": "computing",
  "updated": "2021-01-05T20:41:49Z",
  "author": "john-loeffler",
  "summary": "AMD Navi 22 appears to be en route",
  "article": [
    "AMD is poised to drop their new midrange graphics cards, the Radeon RX 6700 XT and Radeon RX 6700, near the end of March and feature AMD's Navi 22 GPUs.",
    "The new AMD cards, which we were hoping to see this month, will reportedly sell for less than $500, bringing the next-gen Radeon cards more in line with the RTX 3060 Ti. But it remains to be seen how much of price difference there will be between the two rivals midrange offerings.",
    "These two new cards are also expected to use AMD's Navi 22 GPUs, with the Navi 22 XT powering the RX 6700 XT, and the Navi 22 XL powering the less-powerful RX 6700.",
    "We don't know a lot about these GPUs, but according to Wccftech the Navi 22 XT may have around 40 compute units, 2560 stream processors, anywhere from 12GB to 16GB VRAM, and 16Gbps dies, providing up to 384GB/s of bandwidth.",
    "The Navi 22 XL configuration will be somewhat less powerful, but we don't know how different it will ultimately end up being.",
    "With the all-virtual CES 2021 right around the corner and AMD CEO Lisa Su due to present the company's keynote address on January 12, we may hear more about the new midrange Radeon cards that the company has planned. If the rumored March release date is correct, however, me might not hear anything definitive next week.",
    "When Su announced the new AMD Big Navi graphics cards back in November, the cards went on sale within a month. If Su were to announce the RX 6700 cards next week, a late March release would be nearly three months after that, which would be highly unusual.",
    "Still, given how 2020 went and the ongoing shortages of graphics cards, processors, and next-gen video game consoles, who even knows anymore. We'll hopefully find out more next week during CES 2021."
  ],
  "headers": {
    "5": "Will AMD announce new RX 6700 XT and RX 6700 cards at CES 2021?"
  },
  "links": {
    "we were hoping": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-and-rx-6700-may-be-coming-in-january-2021",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Wccftech": "https://wccftech.com/amd-radeon-rx-6700-xt-radeon-rx-6700-navi-22-graphics-cards-march-launch-rumor/",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "AMD Big Navi": "https://www.techradar.com/news/amd-big-navi"
  }
}