{
  "source": "https://www.techradar.com/news/nvidia-rtx-3080-ti-and-rtx-3070-ti-may-be-up-for-preorder-ahead-of-an-actual-announcement",
  "title": "Nvidia RTX 3080 Ti and RTX 3070 Ti may be up for preorder ahead of an actual announcement",
  "category": "computing",
  "updated": "2021-05-21T15:51:33Z",
  "author": "carly-page",
  "summary": "One retailer may be taking advantage of the GPU shortage",
  "article": [
    "Nvidia isn’t expected to unveil the RTX 3080 Ti and RTX 3070 Ti until 31 May, but that hasn’t stopped one retailer from allegedly kicking off pre-orders for the two GPUs.",
    "As reported by Wccftech, a retailer based in Pakistan has posted about taking orders for the RTX 3080 Ti and RTX 3070 Ti weeks before they’re due to go on sale. Rumors suggest the Nvidia RTX 3080 Ti will hit retail shelves on June 3, with the RTX 3070 Ti to follow a week later on June 10.",
    "In a since-deleted post on its Facebook page, Thrift.PK has stated that it’s already taking pre-orders for Palit's GameRock & Gaming Pro cards based on Nvidia's incoming RTX 3080 Ti and RTX 3070 Ti GPUs – even though there's no actual store listing for the graphics cards.",
    "While the cards aren’t yet being listed on the Thrift.PK’s website, Wccftech notes that the retailer will apparently offer the RTX 3080 Ti for 420,000 PKR (about $2,700) and the RTX 3070 Ti for 310,000 PKR (about $2,000).",
    "These prices are more than twice the rumored MSRPs, which is likely a sign that the retailer is looking to take advantage of the ongoing graphics card shortage. As noted by the report, this pricing puts the GeForce RTX 3080 Ti at almost twice the MSRP of the RTX 3090, while for the price of the RTX 3070 Ti, you can get almost four RTX 3070 (non-Ti) GPUs.",
    "The retailer’s delivery dates appear to match up with previous rumors, as it’s promising to start shipping the RTX 3080 Ti in the first week of June, and the RTX 3070 Ti the following week.",
    "With an official announcement rumored for May 31, it’s likely we’ll be hearing more about Nvidia’s latest Ampere GPUs at Computex 2021.",
    "We've reached out to Nvidia for comment on this leak, and we'll update this story if and when we hear anything back."
  ],
  "headers": {},
  "links": {
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "until 31 May,": "https://www.techradar.com/news/nvidia-will-be-at-computex-but-dont-expect-an-rtx-3080-ti",
    "Wccftech": "https://wccftech.com/retailer-taking-pre-orders-geforce-rtx-3080-ti-at-over-2700-us-rtx-3070-ti-for-over-2000-us/",
    "Nvidia RTX 3080 Ti will hit retail shelves on June 3": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-again-rumored-for-early-june-launch-with-rtx-3070-ti-to-follow",
    "Thrift.PK": "https://www.facebook.com/thriftpk/",
    "ongoing graphics card shortage.": "https://www.techradar.com/news/it-might-soon-be-easier-to-buy-a-gpu-thanks-to-ethereum",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}