{
  "source": "https://www.techradar.com/news/vodafone-and-orange-discussed-possible-merger",
  "title": "Vodafone and Orange 'discussed' possible merger",
  "category": "phones",
  "updated": "2021-12-07T12:24:22Z",
  "author": "steve-mccaskill",
  "summary": "Merger would have created Europe's largest telco",
  "article": [
    "Vodafone and Orange reportedly discussed a possible merger that would have created Europe’s largest mobile operator before shelving plans due to opposition from French authorities.",
    "French news channel BFM TV said talks between the companies took place towards the end of last year and at the start of 2021. However, the French government has a 23% stake in Orange, which was previously a state monopoly when it was known as France Telecom.",
    "Paris feared losing control over the company in the event of a merger and also found the idea of a joint headquarters in London to unpalatable.",
    "The reports come at a time of renewed talk of consolidation in the European telecoms sector, with many of the major players frustrated at the high degree of competition and fragmentation which they believe is making it difficult to invest in next generation networks.",
    "Meanwhile, Orange has its own issues given the recent resignation of chief executive Stephane Richard following a fraud conviction.",
    "A tie-up between Vodafone would have many benefits for both given that their respective European and African operations are largely complementary. Spain is the only major European market in which the two companies compete.",
    "The suggestion is that the two firms might still be open to a smaller scale partnership. In 2016, Vodafone combines its mobile network in the Netherlands with Ziggo’s fixed line service to create a joint-venture capable of serving up converged services to consumers.",
    "Both Vodafone and Orange declined to comment on the reports to TechRadarPro.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Vodafone Orange"
  },
  "links": {
    "Reuters": "https://www.reuters.com/markets/deals/orange-vodafone-discussed-abandoned-merger-idea-last-year-bfm-tv-says-2021-12-06/"
  }
}