{
  "source": "https://www.techradar.com/news/steam-deck-leak-is-a-glimpse-of-whats-replacing-big-picture-mode",
  "title": "Steam Deck leak is a glimpse of what’s replacing Big Picture mode",
  "category": "gaming",
  "updated": "2021-09-17T13:34:59Z",
  "author": "darren-allan",
  "summary": "Steam Deck UI spotted on the desktop",
  "article": [
    "We already know that Steam’s Big Picture mode, the UI that gives you a console-like (and controller-friendly) experience on the big screen, is due to be replaced by Steam Deck’s interface, and we’ve just caught sight of how that revamped UI will look on the desktop (following the release of Steam Deck dev kits as revealed earlier this week).",
    "Some grabs were shared by Pavel Djundik, the founder of SteamDB (who was involved in the early leaks around the Steam Deck), showing the interface running on a Windows PC, and looking pretty much like you might expect – in other words, much the same as the UI on the handheld itself.",
    "On Twitter, Djundik further notes that an image of SteamOS 3 has leaked, with some folks already installing it on other portables aside from the Steam Deck (although no hardware is actually named), and that we should bear in mind that what we see here isn’t the finished interface, as work is still ongoing – but at this point, it’s likely to be pretty close to what we can expect at the launch of the Steam Deck.",
    "Of course, we’ve already seen the SteamOS 3 interface in Valve’s previously released press shots anyway, so there are no big revelations here – though it’s obviously interesting to see how the Big Picture replacement is shaping up. With Big Picture mode now being seriously out of date – in fact it hasn’t been updated since 2015, so it’s beyond old at this point – a refresh is obviously most welcome, even if it has been a very long time coming.",
    "Regrading the leak of SteamOS 3 which is apparently floating around online somewhere, likely in dubious corners of the net, those who have come across it would do well to exercise a great deal of caution. Obviously it’s not something that you should be contemplating downloading anyway, not just from a legal standpoint, but also when you consider that it could be loaded with malware or other nastiness (there may well be fake copies of it out there before long, too).",
    "Via PC Gamer"
  ],
  "headers": {
    "3": "Analysis: Big Picture overhaul has been a long time coming"
  },
  "links": {
    "due to be replaced by Steam Deck’s interface": "https://www.techradar.com/news/steam-big-picture-mode-is-getting-an-overhaul-thanks-to-steam-deck",
    "release of Steam Deck dev kits as revealed earlier this week": "https://www.techradar.com/news/steam-deck-is-now-being-shipped-out-to-game-developers-anyway",
    "involved in the early leaks around the Steam Deck": "https://www.techradar.com/news/could-valve-be-making-a-nintendo-switch-killing-steam-handheld",
    "further notes": "https://twitter.com/thexpaw/status/1438253223412916230",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "PC Gamer": "https://www.pcgamer.com/heres-what-the-steam-deck-ui-will-look-like-on-your-desktop/"
  }
}