{
  "source": "https://www.techradar.com/news/what-time-is-godzilla-vs-kong-released-on-hbo-max",
  "title": "What time is Godzilla vs Kong released on HBO Max, Amazon Prime Video and more?",
  "category": "entertainment",
  "updated": "2021-04-01T08:52:25Z",
  "author": "tom-power",
  "summary": "Two titans go to war",
  "article": [
    "Godzilla vs Kong has arrived on HBO Max in the US and Premium Video on Demand (PVOD) in the UK. Adam Wingard's MonsterVerse bout between the two titans landed on March 31 in America and April 1 in the UK and, as its unsurprising name suggests, Godzilla vs Kong pits Earth's two biggest monsters against one another in a supposed battle to the death.",
    "Wingard, the film's director has already gone on record to say that there will be an outright winner from this monumental tussle (IGN) but there may be more to this fight than meets the eye. There are big leaks for the movie doing the rounds online, so be aware of major spoilers if you're looking to read up on Godzilla vs Kong before you watch it.",
    "For now, though, it's the movie's release time that you're here for, isn't it? Let's waste no more time and dive into the exact launch time for Godzilla vs Kong on HBO Max in the US, as well as where you can watch it in the UK.",
    "Godzilla vs Kong is available to watch on HBO Max now. Ahead of its release, HBO Max's official Twitter account revealed that US audiences could view it from March 31 at 12:01am PT/3:01am ET.",
    "Anyone who had checked in to watch it from the moment it dropped will have had a late night. The rest of you, however, will likely be viewing it later today. If that is you, Godzilla vs Kong is available now, so don't delay.",
    "Right now, HBO Max isn't available in the UK. Some UK-based fans may be disappointed to hear that they can't join in on the HBO Max fun, but that doesn't mean that Godzilla vs Kong won't be available to you. Quite the opposite, in fact.",
    "Godzilla vs Kong is now available to rent online, via Premium Video on Demand (PVOD) services, after it landed on April 1 at 12:01am BST in the UK. And no, that's not an April Fools joke.",
    "For UK audiences, the movie is available to rent for £15.99 on Amazon Prime Video and the Sky Store. We had expected Godzilla vs Kong to be available on the Google Play Store and iTunes store, too. However, the former only has a wish list page right now, while it isn't available on the latter."
  ],
  "headers": {
    "3": "What time is Godzilla vs Kong released in the US?",
    "5": "When will Godzilla vs Kong be available in the UK?"
  },
  "links": {
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-2730735243574099500&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhat-time-is-godzilla-vs-kong-released-on-hbo-max",
    "IGN": "https://www.ign.com/articles/godzilla-vs-kong-definitely-wont-end-in-a-draw-says-director",
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FGodzilla-vs-Kong-Alexander-Skarsg%25C3%25A5rd%2Fdp%2FB091CPPPGQ%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-4428976854380237300-21",
    "Sky Store": "https://www.skystore.com/product/godzilla-vs-kong/d2c01333-77e0-4a74-b727-e1cd6ef77f51",
    "Google Play Store": "https://www.prf.hn/click/camref:1100l8Vk3/pubref:trd-us-1344545960836958200/destination:https%3A%2F%2Fplay.google.com%2Fstore%2Fmovies%2Fdetails%2FGodzilla_vs_Kong%3Fid%3DDDFF30EFC1968DF4MV%26hl%3Den%26gl%3DUS"
  }
}