{
  "source": "https://www.techradar.com/news/playstation-wants-the-best-and-nothing-less",
  "title": "PlayStation wants the best and nothing less",
  "category": "gaming",
  "updated": "2021-07-16T15:15:00Z",
  "author": "jamel-smith",
  "summary": "Playstation is focused on quality.",
  "article": [
    "PlayStation CEO Jim Ryan has emphasized PlayStation’s willingness to delay games to ensure the best possible quality, saying “Players only remember best games rather than OK games.”",
    "In an interview with TMTPost, Ryan revealed that PlayStation has delayed the upcoming blockbuster God of War Ragnarok to 2022 for quality assurance, along with Gran Turismo 7 and third-party exclusive Ghostwire: Tokyo. “It is better to wait and have a great game than to rush and have a game that is okay or quite good,” he said.",
    "Recent PlayStation exclusives certainly seem to be going down well with players, becoming industry-leading games. Both Returnal and Ratchet and Clank Rift Apart have received rave reviews, with the latter title widely hailed as the current best-looking game on next-gen consoles.",
    "Ryan did go on to say that PlayStation “gives pressure” to studios to deliver games by an expected time. Hopefully, crunch is not a part of the pressure given to their studios. Though devs at Insomniac Games did publicly highlight that crunch wasn’t a part of the making of Ratchet and Clank Rift Apart.",
    "Concerning updates on highly anticipated PlayStation exclusives Horizon Forbidden West and God of War Ragnarok, Ryan said these games will arrive within “the next year or so”.",
    "Ryan also said PlayStation was “lucky” to have had so many successful new game IPs, highlighting Ghost of Tsushima, Horizon Zero Dawn, and Days Gone among others."
  ],
  "headers": {
    "3": "Delay tactics"
  },
  "links": {
    "TMTPost": "https://en.tmtpost.com/post/5479679",
    "God of War Ragnarok": "https://www.techradar.com/news/god-of-war-ragnarok-delayed-to-2022-and-it-could-be-coming-to-ps4",
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-hits-the-pits-as-release-date-gets-pushed-back",
    "Ghostwire: Tokyo": "https://www.techradar.com/news/ghostwire-tokyo-ps5-exclusive-delayed",
    "": "https://twitter.com/GrantPDesign/status/1402325020890652672?s=20",
    "wasn’t a part of the making of Ratchet and Clank Rift Apart": "https://twitter.com/GrantPDesign/status/1402325020890652672?s=20"
  }
}