{
  "source": "https://www.techradar.com/news/new-xbox-series-x-pulse-red-controller-is-too-hot-to-handle",
  "title": "New Xbox Series X Pulse Red controller is too hot to handle",
  "category": "gaming",
  "updated": "2021-01-12T11:41:53Z",
  "author": "vic-hood",
  "summary": "The Xbox controller gets a striking red makeover",
  "article": [
    "Tired of the Xbox Series X/S controller designs on offer? Then you'll be happy to know that Microsoft is heating things up with its new Pulse Red Xbox Wireless Controller.",
    "Microsoft announced the new design via a blog post on Xbox Wire. The Pulse Red Xbox controller sees the front of the gamepad colored a striking red, while the underneath is white. The bumpers and D-Pad, however, are black. It's pretty much the same design as the Shock Blue design - only red instead.",
    "The new Pulse Red Xbox Wireless controller will release on February 9 and will cost the same as the other designs on offer: $59.99 / £54.99 / AU$74.99.",
    "Currently, the Xbox Wireless Controller is only available in three designs: Robot White, Carbon Black and Shock Blue, so it's nice to see Microsoft offering more design options for players.",
    "The Xbox Wireless Controller underwent a more intensive redesign before the release of the Xbox Series X and Xbox Series S, adding a new Share button, improved textures and geometry, and an overall more premium feel than its predecessors.",
    "The Pulse Red sees no functionality or performance changes - it simply has had a new lick of paint.",
    "It's likely that we'll see Microsoft rolling out further designs in the future, especially given the plethora of Xbox One controller designs available."
  ],
  "headers": {
    "3": "More choices"
  },
  "links": {
    "Xbox Wireless Controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Xbox Wire": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5611950253717989000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F01%2F11%2Fintroducing-new-xbox-wireless-controller-pulse-red%2F"
  }
}