{
  "source": "https://www.techradar.com/news/prime-gaming-february-2021-free-loot-for-roblox-fifa-21-and-fall-guys",
  "title": "Prime Gaming February 2021: free loot for Roblox, FIFA 21 and Fall Guys",
  "category": "gaming",
  "updated": "2021-01-29T14:00:03Z",
  "author": "vic-hood",
  "summary": "Plus four new free games",
  "article": [
    "Prime Gaming has announced its February offering and there's some great content to be had for Prime members, who can get their hands on free loot in FIFA 21 and Madden NFL 21, plus free exclusive content for Roblox, UFC 4 and Fall Guys - while four new PC games are set to join the Prime Gaming library.",
    "So what's up for grabs this month? Well, as we've previously reported, FIFA 21 players can get their hands on in-game rewards for Ultimate Team, which includes one 81+ OVR Player Pick Item and four Rare Gold Player Items - while Team of the Year player items are available in FIFA 21 Ultimate Team for a limited time. This offer is available now and ends March 3 (find out more and claim the offer here).",
    "If FIFA isn't your sport of choice, you'll be happy to know that Prime Gaming is also offering free loot for both Madden 21 and UFC 4. From February 5, Madden 21 players can claim a free Prime Gaming Superbowl pack stuffed with in-game rewards, while UFC players can claim an exclusive purple crown, along with a new player card and background, right now.",
    "But that's not all, Fall Guys players can also grab the new exclusive Slushie Bear bundle, which includes an adorable Slushie Bear costume and 6500 Kudos. This offer is available now, but you only have until February 15 to grab it.",
    "In addition, from February 12, Roblox players can get their hands on an exclusive PB&J hat for their avatar.",
    "But there are plenty more free rewards to be had from Prime Gaming this month. For those who play GTA Online, Prime Gaming is offering access to the Kosatka submarine’s Sonar Station and the ability to earn up to GTA $1 million each month. It's worth noting that to access these freebies, you need to connect your Amazon and Rockstar Games Social Club account (claim this offer and learn more here).",
    "Meanwhile, this month Red Dead Online players can benefit from a RDO $1,000 one-time sign-up bonus, and free loot that includes a Bounty Hunter License, Purple Bounty Wago Tilt (requires three Role tokens and Rank 25+ Bounty Hunter), 50% off a Poncho of your choice, an Off-Hand Holster, 100 High Velocity Revolver Cartridges and 100 Explosive Revolver Cartridges.",
    "There are also rewards to be claimed for Star Wars: Squadrons, League of Legends, Valorant, Smite and more.",
    "But it's not just free loot on offer, four new PC games have also been added to the Prime Gaming library: Swimsanity!, Spinch, Table Manners and Monster Prom: Hotseat Edition.",
    "You can claim all these offers here. But be aware that, unlike the likes of PS Plus, Prime Gaming staggers some of its content releases throughout the month – and often content is available for a limited time only. It's also worth noting that some of this drop is part of a series of drops, or will run throughout the year, so keep an eye out for even more free loot in the future.",
    "Prime Gaming (formerly known as Twitch Prime) offers Amazon Prime members access to a free Twitch channel subscription, exclusive in-game content, and free PC games every month.",
    "And you don't even have to be a PC player to take advantage of these offers, as many extend to console too (like the Fall Guys, FIFA 21 and UFC 4 offers).",
    "Prime Gaming's January offer included exclusive content for games including GTA Online, Fall Guys and Apex Legends – and the addition of five new PC games to the Prime Gaming library.",
    "If you're a Prime member already then it's definitely worth making use of the benefits that come with Prime Gaming. If you're not a member yet then, in order to access everything that Prime Gaming has to offer, simply click on the sign-up link below to start your 30-day free trial."
  ],
  "headers": {
    "5": "And there's even more on offer",
    "10": "One to watch"
  },
  "links": {
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "Roblox": "https://www.techradar.com/news/best-roblox-games",
    "previously reported": "https://www.techradar.com/news/prime-gaming-is-giving-away-free-fifa-21-ultimate-team-rewards",
    "Ultimate Team": "https://www.techradar.com/how-to/fifa-21-ultimate-team-guide-5-things-you-need-to-know",
    "here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1279324634856662800&xs=1&url=https%3A%2F%2Fgaming.amazon.com%2Fhome&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fprime-gaming-february-2021-free-loot-for-roblox-fifa-21-and-fall-guys",
    "Madden 21": "https://www.techradar.com/reviews/madden-21",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "formerly known as Twitch Prime": "https://www.techradar.com/news/twitch-prime-is-now-prime-gaming-will-keep-serving-up-free-gaming-goodies",
    "Prime Gaming's January offer": "https://www.techradar.com/news/prime-gaming-january-2021-free-loot-for-gta-online-fall-guys-and-apex-legends"
  }
}