{
  "source": "https://www.techradar.com/news/valve-console-steampal-probably-wont-be-at-e3-though-it-was-never-likely",
  "title": "Valve console 'SteamPal' probably won’t be at E3 – though it was never likely",
  "category": "computing",
  "updated": "2021-06-08T15:48:17Z",
  "author": "hamish-hector",
  "summary": "Valve's Switch-like handheld isn't coming to E3",
  "article": [
    "Reports about a Nintendo Switch-like console from Steam owner Valve began swirling a couple of weeks ago, and an E3 2021 presence had fans believing the SteamPal handheld might be revealed there. However, new details about Valve’s appearance on the PC Gaming Show suggest that won’t be the case.",
    "Valve is set to make some kind of appearance during the showcase that’s taking place on June 13 at 5:30 PM EST (10:30 PM BST / 2:30 AM PST) ,and the company had originally said it would “deliver a message regarding Steam at E3 2021.” Now the wording of that announcement has changed to say it will instead “deliver a message regarding Steam Next Fest.”",
    "Steam Next Fest will be Valve’s own mini-event with a focus on games and demos and kicks off on June 16th. Given the clarification of its plans, it seems that any hopes of seeing the SteamPal at the PC Gaming Show have unfortunately been dashed.",
    "SteamPal is a codename for a handheld console that is supposedly being developed at Valve. We don’t know too much about the device right now, but a report from ArsTechnica has given a few leaked details about what we could expect.",
    "For one, the handheld could run Valve’s open-source Linux distro, SteamOS, and it looks like the case for the handheld will incorporate more traditional controller inputs, rather than the keyboard and mouse that PC players are used to.",
    "Beyond that, specifics on the SteamPal’s battery size, CPU, GPU, and pretty much everything else that would be important to know, are still a mystery. However, we expect this console to look more like a Switch Pro-like handheld, rather than mimicking the current Switch’s specs.",
    "To play many PC games we’d need to see Valve come out with something that has serious power under the hood. Given that a Switch Pro is also rumored to be coming soon too, a less powerful console might not be able to compete.",
    "We’ll never know for sure if Valve ever planned to reveal the SteamPal at E3 2021, but we’d be confident saying that it isn’t currently on the cards. We’d be surprised if it showed up at the Steam Next Fest, too.",
    "Sure, some evidence suggests that it might. Leaks can indicate that an announcement is coming soon (as more people learn about the project there are more ways for information to seep out) and the name change from Steam Game Fest to Steam Next fest might mean that hardware could be shown off. But, if that is the case, we imagine Valve would be building up a lot more hype for the event.",
    "If Valve really wants to make a console announcement they’d likely already be teasing it officially, making sure that everyone’s eyes are on Steam Next Fest rather than the plethora of gaming events also happening over the coming month.",
    "Add in that very little has been leaked about the SteamPal (an indication that it isn’t super far into development) and we imagine that an announcement is far more likely to appear later into 2021 (or beyond) if it’s coming at all. Not only could the rumored handheld be finalized by then, but there’ll be less gaming noise for Valve to shout through.",
    "Over the next few weeks, we may end up eating our hat if Valve defies the odds and makes an announcement anyway. If they do, we’ll be sure to give you all the latest details about the SteamPal, so be sure to keep checking back to keep in the know."
  ],
  "headers": {
    "3": "What is Valve's SteamPal?",
    "7": "Analysis: Was SteamPal ever coming to E3?"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch/news/nintendo-switch-vs-nintendo-switch-lite-is-bigger-really-better/news/nintendo-switch-deals",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "SteamPal": "https://www.techradar.com/news/steam-deck",
    "PC Gaming Show": "https://www.techradar.com/news/the-pc-gaming-show-will-feature-over-50-games-tune-in-on-june-13",
    "Steam Next Fest": "https://www.techradar.com/news/steam-next-fest-is-coming-in-june-with-hundreds-of-game-demos",
    "ArsTechnica": "https://arstechnica.com/gaming/2021/05/exclusive-valve-is-making-a-switch-like-portable-gaming-pc/",
    "SteamOS": "https://www.techradar.com/news/gaming/steamos-what-you-need-to-know-1183824",
    "Switch Pro": "https://www.techradar.com/news/where-is-the-nintendo-switch-pro",
    "Switch Pro is also rumored": "https://www.techradar.com/news/nintendo-switch-2"
  }
}