{
  "source": "https://www.techradar.com/news/htc-vive-air-vr-headset-will-be-a-sports-shoe-for-the-face",
  "title": "HTC Vive Air VR headset is a sports shoe for the face",
  "category": "fitness",
  "updated": "2021-04-20T13:34:09Z",
  "author": "axel-metz",
  "summary": "A fitness-focused VR headset",
  "article": [
    "With the launch of the HTC Vive back in 2016, HTC proved it could lead the competition when it came to VR headsets. Now, it looks like the company is preparing to shake up the market once more with the release of a new, fitness-focused headset, the Vive Air.",
    "According to a presumably-premature listing on the World Design Guide awards website (spotted by Engadget), the Vive Air VR headset is “specially designed for virtual fitness” and “optimized for high intensity with long use.”",
    "It also looks to be utilizing sports-shoe inspired knitted materials – of the kind used in Nike and Adidas trainers – to provide new levels of comfort and fit from a VR product.",
    "The World Design Guide website suggests these breathable and quick-drying fabrics will allow the device to remain lightweight, improve ventilation and – crucially – be machine washable, with a “quick-release design” to remove soft components.",
    "As for its specs, we spotted four tracking cameras – similar in position to, but slightly larger than, those found on the Oculus Quest 2 – but that’s about it for detail. It’s clear, though, that this is a device with comfort and practicality at the forefront of its fitness-based design, rather than a headset dedicated to gaming.",
    "The Vive Air seems like a logical step for HTC given the boom in home fitness-related product sales brought about by the global pandemic.",
    "With the Oculus Quest 2 proving the most successful of the mainstream VR headsets so far, this potentially-upcoming HTC device could re-establish the brand's foothold in the virtual wearable industry.",
    "More than just a shrewd business move, though, the Vive Air taps into perhaps the most apt use of VR to date – virtual workouts. Dance, yoga and boxing programs seem primed to occupy virtual spaces in the near future, and this could prove a major step in the direction for a technology that has struggled to establish a real sense of purpose.",
    "Given that there hasn’t yet been an official word from HTC on the existence of the Vive Air, we don’t have any details as to when the device might arrive. As per the website listing, though, a launch date of 2021 seems likely. It's also worth noting that the Vive Air might only be a concept design, after all, laying the groundwork for a fully-fledged headset product further down the line.",
    "In any case, the company’s ViveCon 2021 event is scheduled to take place in May – so we expect to hear more regarding the device around then.",
    "Via Engadget"
  ],
  "headers": {
    "5": "This could work out for HTC"
  },
  "links": {
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "listing": "https://ifworlddesignguide.com/entry/309526-vive-air-vr-headset",
    "Engadget": "https://www.engadget.com/htc-vive-air-wireless-headset-leaks-on-design-award-site-114042580.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuaW5vcmVhZGVyLmNvbS8&guce_referrer_sig=AQAAAII8OZyaT5DKD7wAZfs0E9wRn0tcuJd_vajC9RrXhy6aChODH-XWuzwfMuAqPRfiZ94crpuv7vXXLbwJtOLd5ji_HTBgdY75MoDNASmx0SRXq2SnQQqW929tJ2CqvnmGpWmDQ2w7ccnw7kBul5Yr9hiGYR0sbSf4oGCnUgnq6QSM",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}