{
  "source": "https://www.techradar.com/news/microsoft-releases-new-android-web-browser-to-rival-chrome",
  "title": "Microsoft releases new Android web browser to rival Chrome",
  "category": "computing",
  "updated": "2021-04-16T10:35:51Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Preview version of Microsoft Edge lands in Google Play",
  "article": [
    "For anyone looking for a different web browser for Android, Microsoft has a surprise new offering. While to many people it is a little surprising that it has taken so long for the company to produce an Android version of Edge, the sudden release of this version of the browser, with no build up, is arguably more astonishing.",
    "But this is precisely what has happened. Out of the blue, a preview version of Microsoft Edge has appeared in Google Play, giving Android users a new option for browsing the web. Based on the Chromium engine, Edge Canary is available for testing right now.",
    "For anyone who has invested time and effort switching from Internet Explorer or legacy Edge to the Chromium-based version of Edge in Windows 10, the arrival of the Android version is great news for remaining in the ecosystem when switching to mobile.",
    "The browser functions largely as you would expect, and it is possible to synchronize browsing data between devices. This means that you can start browsing the web on your PC, and easily pick up where you left off on your phone thanks to open tab syncing.",
    "Other features found in this first version of Edge for Android include Bing-powered translation, tracking prevention, Microsoft Defender Smartscreen filtering and a choice between light and dark themes. There is not – at least currently – support for browser extensions, and it's not clear whether this will change or not.",
    "As this is a preview build, there is a chance that this early version of Edge for Android is not entirely stable. Microsoft is looking for feedback from anyone who does install it – positive and negative – and the company says:",
    "\"Want to be one of the first to preview what’s new? The Microsoft Edge preview channels are now available for mobile! This is the Microsoft Edge Canary channel for Android. Canary will be released daily to keep you up to date on our progress. Your feedback is what helps us improve, so download now and let us know what you think.\"",
    "If you're interested in trying out Edge for Android, it is available to download free of charge from Google Play, and is compatible with Android 5 and above.",
    "Via Ghacks"
  ],
  "headers": {
    "5": "Take it to the edge"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Google Play": "https://play.google.com/store/apps/details?id=com.microsoft.emmx.canary",
    "Ghacks": "https://www.ghacks.net/2021/04/16/microsoft-edge-for-android-released-as-a-preview/"
  }
}