{
  "source": "https://www.techradar.com/news/most-employees-believe-hybrid-working-is-helping-productivity",
  "title": "Most employees believe hybrid working is helping productivity",
  "category": "computing",
  "updated": "2021-06-15T09:57:55Z",
  "author": "sead-fadilpasic",
  "summary": "Many want hybrid working for the long run",
  "article": [
    "Many employees believe hybrid working is good for productivity and overall mental state, and would love to see the practice kept on after the pandemic, according to a new report from Slack, which found that the majority (57%) of adults think employers should continue to offer hybrid working.",
    "Some workers are quite passionate about hybrid working, with almost a quarter (22%) saying they would think about changing jobs if it was no longer an option.",
    "Those aged 25-34 were the most passionate, with more than a third (35%) saying they would consider leaving their current role if there was a change.",
    "Consequently, hybrid would affect the job search for a significant portion of the workforce (39%), while a fifth wouldn’t even apply for a fixed-location position.",
    "According to the report, much of this positivity is down to the effect on productivity and mental health. More than a third (35%) believe hybrid working makes them more productive, as it eliminates distractions. Another fifth (19%) are simply happier working from home every once in a while.",
    "While hybrid working promises more productivity and a better work/life balance, there are still a few kinks to work out. A fifth (19%) struggle with some colleagues being in the office and others not, while most people (56%) said they’d only stay in their current position if the communication with the team improves.",
    "Hybrid working was born out of remote working, which came about after the lockdown forced everyone to stay at home and away from other people. While remote working means people would work outside the office full-time, hybrid working is more of a middle ground in which employees get to choose how much time they spend in the office, when they’ll come and when they’ll go.",
    "With less time spent commuting, less money being spent on eating out, and more time spent with family members and/or sleeping, employees everywhere are rooting for remote and hybrid working practices to stick around for the long run."
  ],
  "headers": {
    "4": "Hybrid working advantages"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Slack": "https://www.techradar.com/reviews/slack",
    "job search": "https://www.techradar.com/best/us-job-sites",
    "communication": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}