{
  "source": "https://www.techradar.com/news/disney-plus-app",
  "title": "Disney Plus app: how to download Disney Plus for Android and iPhone",
  "category": "entertainment",
  "updated": "2021-07-07T10:43:48.610Z",
  "author": "daniel-pateman",
  "summary": "Bring the Disney Plus magic to your iOS and Android devices",
  "article": [
    "Disney Plus launched in November 2019 to become the new must-have streaming service, and very quickly raced ahead of many of its rivals. It gained 100 million subscribers, making it the third-most popular VOD platform worldwide after Amazon Prime and Netflix.",
    "Unsurprisingly, the Disney Plus app was the most-downloaded app during 2019 in America, enticing viewers with binge-worthy new content like Star Wars spin-off The Mandalorian.",
    "Our guide below will explain how to download Disney Plus to compatible Android and iOS devices, and install the Disney Plus app on tech including - but not limited to - tablets, smartphones, and the iPod Touch. It’s easy to install, and means you could watch Pixar’s acclaimed animation Soul on your crowded commute, or stream any MCU movie directly to your mobile.",
    "Indeed it does! And with the number of downloads exceeding tens of millions, the Disney Plus app is proving essential not just for fans of animated movies, but for anyone interested in addictive, original TV series like WandaVision and cinematic blockbusters, for example, the upcoming Black Widow.",
    "You can download Disney Plus to your Apple iPhone, iPod Touch, or iPad, but you’ll need to have iOS 11 or higher installed (for the latter, iPadOS 11.0).",
    "Most Android smartphones and tablets are also compatible with the Disney Plus app, but require at least the Android 5.0 (lollipop) operating system for it to work, or Fire OS 5.0 if you’re using an Android Fire or Fire Kids tablet.",
    "The app is downloaded in a matter of minutes, and has an interface that’s both intuitive to use and sleekly designed.",
    "As well as giving you the flexibility to stream on the go in HD quality (or Ultra 4K HD with select titles), you can download an unlimited amount of TV shows and films on up to 10 devices and watch them offline. That means enjoying your favorites from anywhere, without demolishing your mobile data.",
    "If you’ve got an iOS device, follow the below instructions to download Disney Plus:",
    "- Open the App Store",
    "- Type “Disney+” into the search tool",
    "- Scroll to the correct entry (it should be near the top)",
    "- Click ‘Get’ (it’s free) to start downloading the app.",
    "- Select the ‘Open’ option once it’s finished downloading.",
    "If you’ve already got an active Disney Plus account, just login using your existing details to begin streaming. If not, you need to complete the additional steps below. But you might want to check our Disney Plus price guide first before subscribing to ensure you’re getting the best deal first. Then:",
    "- Click ‘Sign Up Now’.",
    "- Pick either a monthly or annual membership plan.",
    "- Your App Store payment details will be used to process your sub.",
    "- Login and enjoy!",
    "Alternatively, if you want to download Disney Plus to an Android device, the process is slightly different:",
    "- Enter the Google Play store",
    "- Search for “Disney+”",
    "- Select the Disney Plus icon and click ‘Install’",
    "- Wait for the Disney Plus app to download",
    "- Run it and login with your existing credentials.",
    "As outlined above, if you don’t yet have membership plan you’ll be prompted to pick either the monthly or the annual option (you’ll save roughly 15% with the yearly plan). Payment will be taken using your Play Store payment details and your account will be ready to use immediately.",
    "The VOD platform has nearly 1000 films and almost 300 shows, and this treasure trove of content keeps expanding with the regular addition of exclusive new content, like the Tom Hiddleston starring Loki and The Book of Boba Fett.",
    "The platform packs a lot of prime content, with individual hubs for Walt Disney subsidiaries Marvel, Pixar, Lucasfilm, and National Geographic, some of the most lucrative media brands of the 21st century.",
    "Almost everything from the Walt Disney vaults is included, of course: older animated movies like Bambi and The Jungle Book, to recent fan-favorites Moana and Frozen 1 and 2. Then you get the record-breaking films of the Marvel Cinematic Universe – Captain America, Thor, and Avengers: Endgame among them – with a packed roster of new shows like Hawkeye coming soon.",
    "Pixar brings us the beloved Toy Story franchise, in addition to a plethora of the company’s acclaimed animated movies, such as Inside Out, Up, and the incredible Soul, which was recently awarded the Oscar for Best Animated Film. And if find the thwap, thwap, sizzle of lightsabers electrifying, then you’ve got the entire Star Wars saga to enjoy, from A New Hope to The Last Jedi.",
    "Yet that’s not all! The National Geographic hub delivers awesome spectacle from documentaries charting the natural world, while every season of iconic comedy The Simpsons is available to stream. On top of that, you can purchase the very latest theatrical releases to watch with Disney Plus Premier Access, at the additional cost of around $30 per film.",
    "There’s plenty to keep you entertained, and many highly anticipated upcoming TV shows and movies to get excited about too.",
    "If you don’t have an Android or iOS device, or would rather download the Disney Plus app to another piece of hardware, then the following are also compatible with the VOD streamer:",
    "- Amazon Fire TVs",
    "- PS4 and PS5",
    "- Xbox One and Xbox Series X|S",
    "- Chromecast",
    "- Roku",
    "- Apple TV",
    "- Samsung and LG Smart TVs",
    "- Windows PCs/Laptops/Tablets (running Chrome or Safari)",
    "- iMacs and MacBooks (running macOS10 [Sierra] or later)",
    "You can also find more detailed information here on how to download Disney Plus on Roku and Disney Plus on Apple TV."
  ],
  "headers": {
    "3": "Does Disney Plus have an app?",
    "8": "How do I download the Disney Plus app?",
    "26": "What can I watch on the Disney Plus app?",
    "32": "What other devices can I watch Disney Plus on?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "The Mandalorian": "https://www.techradar.com/how-to/how-to-watch-the-mandalorian-online",
    "Soul": "https://www.techradar.com/news/how-to-watch-soul-online-stream-the-new-pixar-movie-on-disney-plus-today",
    "WandaVision": "https://www.techradar.com/news/how-to-watch-wandavision-online-stream-all-new-marvel-series-on-disney-plus-today",
    "Black Widow": "https://www.techradar.com/news/black-widow-is-officially-coming-to-disney-plus-but-itll-cost-extra",
    "Disney Plus price guide": "https://www.techradar.com/deals/disney-plus-price",
    "‘Sign Up Now’": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-4876005592138554000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome",
    "you’ll save roughly 15% with the yearly plan": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-4427123412037274600&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "upcoming TV shows and movies": "https://www.techradar.com/news/disney-plus-best-upcoming-tv-shows-and-movies",
    "Disney Plus on Roku": "https://www.techradar.com/news/disney-plus-roku",
    "Disney Plus on Apple TV": "https://www.techradar.com/news/disney-plus-apple-tv"
  }
}