{
  "source": "https://www.techradar.com/news/breath-of-the-wild-2-release-date-is-in-2022-watch-the-zelda-teaser-trailer-now",
  "title": "Breath of the Wild 2 release date is in 2022 – watch the Zelda teaser trailer now",
  "category": "gaming",
  "updated": "2021-06-15T16:53:59Z",
  "author": "vic-hood",
  "summary": "Nintendo has given us a release window for Breath of the Wild 2",
  "article": [
    "Nintendo has announced that we’ll get our hands on the highly-anticipated Breath of the Wild 2 in 2022.",
    "Nintendo revealed the release window during its Nintendo Direct showcase at E3 2021, closing the show with a new teaser trailer and the announcement of a 2022 release date - though we don’t know exactly when next year we’ll get our hands on Breath of the Wild 2.",
    "We already knew Breath of the Wild 2 was in the works, following Nintendo’s announcement of the sequel at E3 2019. Since then, Nintendo had been pretty tight-lipped about BOTW 2 but, with Zelda’s 35th anniversary this year, we were hoping we would find out more about the long-awaited sequel. Fortunately, Nintendo has delivered.",
    "From the teaser trailer, we saw that the game’s setting has been expanded to include the skies above Hyrule, as Link free-falls through the clouds to the ground below, which is reminiscent of Skyward Sword. The world itself seems to be packed with more detail this time around, too, with mist enveloping the wide-open fields, along with various enemy forts dotted around the environment.",
    "We also got a glimpse of some of the new equipment Link will be able to harness, such as the ability to move through the environment using water and a fire-breathing dragon head that attaches to his arm.",
    "While Breath of the Wild 2’s story remains a mystery, we did get a glimpse of what looked like The Calamity causing havoc across the world once again. Specifically, Hyrule Castle is ripped up from the ground and suspended in the air.",
    "The Legend of Zelda: Breath of the Wild launched alongside the Nintendo Switch in 2016, and received almost universal acclaim. The game was a notable departure from previous entries in the series, and let players explore a vast open world, without any restrictions on where to go.",
    "It’s a shame that Breath of the Wild 2 won’t release until 2022, but with the pandemic and Nintendo not sharing any details for quite some time, it almost felt inevitable. Nevertheless, there’s no doubt that Link’s next adventure will be one of the most anticipated Switch games for next year."
  ],
  "headers": {
    "3": "What did we learn?"
  },
  "links": {
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Skyward Sword": "https://www.techradar.com/news/the-legend-of-zelda-skyward-sword-hd-for-nintendo-switch-everything-you-need-to-know",
    "The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}