{
  "source": "https://www.techradar.com/news/ps5-restock-sony-direct-has-the-console-right-now-heres-how-to-get-it",
  "title": "Sony Direct has the PS5 restock you've been waiting for – here's how to get it",
  "category": "gaming",
  "updated": "2021-08-30T09:15:54Z",
  "author": "matt-swider",
  "summary": "Both the PS5 Disc and Digital Edition are back in stock at Sony's official store for the PlayStation brand.",
  "article": [
    "Update: The Sont Direct PS5 restock is now over, but you can be alerted about the next next-gen console drop by following our PS5 restock Twitter tracker:",
    "It'll look like:",
    "Prior story There's another PS5 restock at Sony Direct today, and the countdown is going to give way to a virtual queue where some lucky people will be able to buy the console. Both the PS5 Disc and PS5 Digital Edition are back, according to Sony's official website.",
    "Sony Direct did a PS5 restock yesterday, and according to our PS5 Twitter tracker, we saw several replies from people verifying their orders, having just purchased the console. If you don't get it, we know the Amazon PS5 restock time is tomorrow morning, Thursday, March 8.",
    "Both the PS5 Disc and PS5 Digital are in stock right now, at the $399 and $499 price point. The Sony Direct PS5 restock works by putting you into an online lottery, so you can sit back and wait in a virtual queue and anxiously watch a yellow status bar progress.",
    "Initially, you'll see it says it requires more than an hour wait. That'll change more quickly for some lucky few rather than others.",
    "Our PS5 restock Twitter tracker and investigative reporting shows that the next wave of Sony consoles will drop at any time. We've helped thousands of people buy the PS5 in the US store, and we know stores are amassing inventory for this week at Target and Best Buy in particular.",
    "There's an Amazon PS5 restock scheduled to happen tomorrow, Thursday, March 18, according to our sources and based on internal communications at Amazon.",
    "We've had success: about 25% of our PS5 Twitter tracker replies show they got the new console from our alerts. It's gotten easier over time as more people get the Sony system – there's slightly less pressure today than there was two weeks ago.",
    "Best Buy, Walmart and GameStop would have an PS5 and Xbox restock, and our DMs are open to see if more retailers are going to have new console stock this week. So far, people in the know are saying it's coming soon. We'll update this story as soon as we nail down a time.",
    "It's important to point out that you won't be able to order from retail stores. We don't want to be responsible for sending people to physical stores looking for a PS5 restock that doesn't exist. Some stores allow for in-store pickup (Target and certain Best Buy stores), however, none of the actual ordering takes place in stores.",
    "We saw about every other major retailer release PS5 stock this week: Best Buy, Walmart, Amazon, ANTonline, GameStop and Sam's Club.",
    "Sony PlayStation Direct has been more silent in March. We were told that Sony Direct's on Wednesday, February 24, saw delays beyond the promised two-day shipping for PlayStation Plus members. That's likely why Sony hasn't released more stock of the console – it's backed up.",
    "Through Twitter, we're tracking the next PS5 and Xbox stock from more than 13 sources, and we've seen a few PS5 consoles pop up over the last week and, even better news, high success rates for people who have been looking for restock for months.",
    "Even if you don't get to buy the console today, there may be a PS5 and Xbox drop any one of the days in the upcoming week."
  ],
  "headers": {
    "8": "Check these stores for PS5 restock",
    "11": "The PS5 restock pattern",
    "13": "Console restock success stories"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Amazon PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart"
  }
}