{
  "source": "https://www.techradar.com/news/apples-all-new-airpods-pro-are-in-stock-and-on-sale-for-dollar18999-at-amazon",
  "title": "Apple's all-new AirPods Pro are in stock and on sale for $189.99 at Amazon",
  "category": "audio-visual",
  "updated": "2021-12-07T17:30:26Z",
  "author": "mackenzie-frazier",
  "summary": "Order and save on Apple's best-selling AirPods Pro today",
  "article": [
    "AirPods deals are always a hit during the holidays, and we've spotted Apple's all-new AirPods Pro in stock and on sale for $189.99 (was $249) at Amazon. That's a $59 discount and the best deal you can find right now for the wireless earbuds. While we saw the AirPods drop to $159 during Black Friday, this discount was short-lived, and the earbuds flashed in and out of stock over the holiday weekend. As of right now, the AirPods Pro are in stock and ready to ship, and today's deal is actually $10 cheaper than last week's price.",
    "Apple's all-new AirPods Pro now come with a Magsafe Charging Case which provides more than 24-hours of total listening time and can be charged using a Qi-compatible charging mat or using a Lightning connector. The wireless earbuds feature Apple's powerful H1 Chip and include Active Noise Cancellation to block out unwanted noise. The sweat-resistant AirPods also come with new silicon tips in three different sizes to provide a more comfortable and secure fit.",
    "You can shop for more offers with the best AirPod deals and sales and see the best AirPods Pro deals and sales that are happening now."
  ],
  "headers": {
    "1": "AirPods Pro deal",
    "2": "More AirPods deals"
  },
  "links": {
    "in stock and on sale for $189.99 (was $249) at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MLWK3AM-A-New-AirPods%2Fdp%2FB09JQMJHXY%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2751142967316608500-20",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "best AirPod deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "best AirPods Pro deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals"
  }
}