{
  "source": "https://www.techradar.com/news/amazon-halo-2",
  "title": "Amazon Halo 2: what we want to see",
  "category": "wearables",
  "updated": "2021-09-26T08:00:00Z",
  "author": "david-lumb",
  "summary": "What’s coming in Amazon’s next fitness wearable?",
  "article": [
    "The Amazon Halo launched in late 2020 with a surprising pitch: it's a fitness wearable without a screen, haptic vibration, or any feedback whatsoever. Instead, the band passively tracks data and routes it through a paired phone app, an approach we found effective enough, but not without obvious drawbacks we’d like to see fixed in an Amazon Halo 2.",
    "To be clear, Amazon hasn’t confirmed whether it will release a Halo 2 device, nor have we heard rumors that the company is developing a follow-up device. When we do, we’ll post that info here - along with details about possibly similar devices the company might be developing instead, which we expect to hear about during the upcoming Amazon Fall Showcase at the end of September.",
    "In the meantime, we’ve thought about the original Amazon Halo’s strengths and weaknesses to come up with a list of what we want to see in an Amazon Halo 2. Read on for our thoughts on what the shipping titan’s next device could look like.",
    "The original Amazon Halo launched in December 2020, so it hasn’t even been on the shelves for a full year, and we wouldn’t expect a sequel device to land before the end of 2021. We haven’t heard any rumors about a possible Amazon Halo 2 release date, either, though we could get more information during the Amazon Fall Showcase happening at the end of September.",
    "Likewise, we haven’t heard any rumors surrounding the Amazon Halo 2 price, let alone any hints at potential new features that could lead to a higher price than its predecessor. The original Amazon Halo is priced at $99 (around £75 / AU$130), which seems rather high for a wearable without a screen.",
    "The Halo is properly titled the Amazon Halo Band to set it apart from the Amazon Halo service, a subscription-based offering that enabled the Band’s full suite of features, tracking, and workouts on the paired app. The Band includes six months of membership to the Amazon Halo service, which is a bummer for those looking to buy a used model, and costs $4 (around £3 / AU$5.50). Given the Band is only sold in the US, it’s unclear if the service is available in other countries as well.",
    "Until we hear more substantiated rumors that the Amazon Halo 2 is in development and may be coming to the market, we’ll stick with what we want to see in Amazon’s next fitness wearable.",
    "The health data collected by the Halo Band is stored locally on the phone with the paired app, and users can choose whether to upload it to Amazon servers to save if, for instance, they switch Bands. Some features, like Body Scan, work on Amazon servers and require users to upload their data first.",
    "Amazon's team repeatedly assured TechRadar that any data uploaded is stored on servers only linked to the Amazon Halo team, and would not be shared with other Amazon teams.",
    "Given how much of the company’s overall business relies on extensive data collection of user behavior, this assurance felt and still feels flimsy - essentially a promise that’s not legally binding.",
    "While we’d like the Amazon Halo Band 2 to have more intelligent data analysis, we want more than assurances that our health data is being protected - we’d want the data to be encrypted and stored in a way we’d trust wouldn’t be accessible to Amazon, similar to the way Apple has set up its server-side user data storage.",
    "We enjoyed having the Halo Band as a passive tracker that we didn’t have to actively monitor, but the device only tracks steps, heart rate, body temperature, and sleep time. We’d like the Amazon Halo 2 to pack more sensors for additional health tracking, like blood oxygen via SpO2 sensor, heart arrhythmia via ECG, and other points.",
    "We’d also like more precise location tracking via GPS, which has become a standard feature on even lower-end fitness trackers. It would especially be nice for users who want to leave their phone at home during a run, for example.",
    "In some ways, the Amazon Halo Band feels like a delivery vehicle to get folks hooked on yet another subscription: after six months of free membership, users must pay a monthly fee to access even basic features like sleep analysis. That makes other wearables - even cheaper ones - more attractive.",
    "We’d like the Amazon Halo Band 2 to have more features available to users after they’d stopped subscribing, or for those who pick up a Band 2 on the used device market. To be clear, this is a software decision, and something Amazon could easily do right now by flipping a back-end switch on the original Band, but if we’re looking for improvements on a sequel device, this is high on our list.",
    "The Halo Band is envisioned to be a passive tracker, so adding a screen or vibration haptics is against the device’s mission, so to speak.",
    "But for the same price, we could get a fitness wearable with a decent display showing progress on health metrics and other alerts - it would be nice for the Halo Band 2 to give us any indication of where we are on our fitness goals, which is something that the original’s ‘Movement Score’ already summarizes pretty succinctly.",
    "Alternatively, the Halo Band 2 could add vibration to either send simple coded updates - one pulse to get moving, two pulses to acknowledge hitting a movement goal, and so on. The band could even do this in concert with the app, sending a vibration to check a phone notification for quick updates."
  ],
  "headers": {
    "3": "Amazon Halo 2 price and release date",
    "6": "Amazon Halo 2: what we want to see",
    "7": "1. Greater data security assurance",
    "11": "2. GPS and more sensors",
    "13": "3. More non-subscription health tracking",
    "15": "4. Display and vibration"
  },
  "links": {
    "Amazon Halo": "https://www.techradar.com/reviews/amazon-halo-review"
  }
}