{
  "source": "https://www.techradar.com/news/final-fantasy-creators-fantasian-is-made-with-real-models-and-its-gorgeous",
  "title": "Final Fantasy creator's mobile game Fantasian looks gorgeous",
  "category": "phones",
  "updated": "2021-11-11T17:00:52Z",
  "author": "rhys-wood",
  "summary": "The latest Mistwalker project looks stunning",
  "article": [
    "Fans of Japanese role-playing games may want to look towards Mistwalker for their next fix. The studio teased its next game on Twitter, and it's generated positive buzz from JRPG players. Named Fantasian, the game drew eyes thanks to its use of 3D dioramas as its in-game environments.",
    "It looks absolutely stunning, but Fantasian may not end up being all style over substance. After all, veteran studio Mistwalker is developing the game. Made up of classic Final Fantasy alumni, including that series’ creator Hironobu Sakaguchi, the studio has previously developed games like The Last Story and the critically acclaimed Lost Odyssey.",
    "Twitter users have been drawing attention to the game's fascinating environment design with eye-catching tweets.",
    "Sakaguchi himself shared an update on Twitter, showing off a model of one in-game environment, giving fans an insight into how these locales were produced.",
    "This approach to world design is undeniably unique, and brings to mind a few JRPGs of recent times that have used experimental yet gorgeous art styles. From the pixelated goodness of Octopath Traveler to Bravely Default 2’s hand-drawn backdrops, Fantasian looks like it will easily appeal to fans of those games.",
    "Fantasian was originally announced in 2019, exclusively for Apple Arcade. Fans have been eager for more updates ever since. Thankfully, we may not have to wait long to explore the dioramic wonders Fantasian has to offer. Mistwalker again teased via Twitter that they plan to release the game “soon.\"",
    "One gripe fans hoping to try out Fantasian might have is the Apple Arcade exclusivity. While it's a great service for iOS users looking for their next gaming fix, we hope that Fantasian is eventually considered for a wider release on multiple platforms."
  ],
  "headers": {
    "5": "A feast for the eyes"
  },
  "links": {
    "Bravely Default 2": "https://www.techradar.com/reviews/bravely-default-2",
    "originally announced in 2019": "https://twitter.com/mistwalker/status/1110423384356057088",
    "Apple Arcade": "https://www.techradar.com/best/best-apple-arcade-games"
  }
}