{
  "source": "https://www.techradar.com/news/titanfall-removed-from-sale-following-years-of-attacks-from-hackers",
  "title": "Titanfall removed from sale following years of attacks from hackers",
  "category": "gaming",
  "updated": "2021-12-02T16:04:44Z",
  "author": "jamel-smith",
  "summary": "It has come to an end",
  "article": [
    "Respawn Entertainment has announced the original Titanfall game will no longer be sold, and it’ll remove the game from subscription services on March 1, 2022. However, it’ll still keep Titanfall servers live for its dedicated fanbase who are still playing.",
    "This decision comes after a series of DDoS attacks over the past few years. Denial-of-service attacks aim to disrupt the normal traffic of a server by sending a huge amounts of requests which causes the servers to stop working.",
    "Titanfall has been bombarded with DDoS attacks, which has led to players being kicked off servers or not being able to join a match - rendering their purchased game unplayable. Players begged Respawn to address the issue, but it appears the company never did anything about it. Despite saying it’ll keep servers alive, the game is virtually unplayable - so how does that help?",
    "The hacking and DDoS attacks caused Titanfall to be abandoned on PC. According to Steam Charts, there are no current players on Titanfall, and on average six people play the game monthly.",
    "For the past three years, hackers have used exploits in Titanfall’s servers to disrupt the game and render it unplayable. Hackers used bot requests, which would constantly connect to Titanfall’s servers and fill the needed player threshold in the lobby before a match started, so players were unable to join matches.",
    "And despite the game being unplayable for the past few years, Respawn was still selling the game on PC. You had purchased the game during that time you would be met with a ‘dead’ game.",
    "This prompted players to voice their concerns to Respawn and EA, and Titanfall on Steam received overwhelmingly negative reviews, while players bombarded EA forums with their pleas, and some disgruntled gamers even started a website www.savetitanfall.com (it’s no longer active) to spread awareness of the game’s issues. Some went to the extent to hack Apex Legends servers and display the hashtag ‘#SAVETITANFALL’ on in-game pop-ups.",
    "Even Titanfall 2 started to be hacked. Titanfall 2 streamers’ were being ‘blacklisted,’ as hackers tracked their various accounts and IP addresses to ensure they could never join a match.",
    "Respawn did apologize and aimed to fix the issues plaguing both Titanfall games saying, “help is coming”, and that it was investigating the continued DDoS attacks in May. But again, that help never came. A previous employee at Respawn even said that the company “WILL solve this,” back in July.",
    "Instead, Respawn has waved the white flag and left Titanfall as a no man's land - and there isn’t much hope left out for Titanfall 2 as well. But Titanfall 2 does have an enjoyable single-player campaign that still should be played by everyone.",
    "In all, this decision has only caused a negative backlash amongst fans- who may never forgive Respawn."
  ],
  "headers": {
    "3": "Analysis: #SAVETITANFALL"
  },
  "links": {
    "Steam Charts": "https://steamcharts.com/search/?q=Titanfall",
    "used exploits": "https://answers.ea.com/t5/Titanfall/Dear-Respawn-This-is-the-state-of-your-legacy-the-treatment-of/td-p/10169692",
    "www.savetitanfall.com": "http://www.savetitanfall.com/",
    "WILL solve this,": "https://twitter.com/RKRigney/status/1412444476828749836?s=20"
  }
}