{
  "source": "https://www.techradar.com/news/apple-fitness-plus-will-soon-let-you-stream-workouts-to-a-smart-tv-via-airplay",
  "title": "Apple Fitness Plus will soon let you stream workouts to a smart TV via AirPlay",
  "category": "fitness",
  "updated": "2021-02-02T09:59:38Z",
  "author": "cat-ellis",
  "summary": "But there's a catch...",
  "article": [
    "Apple is planning to upgrade Apple Fitness Plus with a new feature that will let you beam workouts straight to any AirPlay 2-compatible smart TV.",
    "This is a real boon for anyone who doesn't own an Apple TV, and has so far been limited to watching Apple's instructors on the much smaller screen of their iPad or iPhone.",
    "The new option is expected to appear with the launch of iOS 7.4 and Watch OS 14.5, and was spotted by TechCrunch in the latest beta.",
    "There are a few drawbacks though, and those without an Apple TV will miss out on a few key features. Something that sets Fitness Plus apart from other services like Peloton is the ability to see data gathered by your Apple Watch directly on screen. This means you can check your vital stats, including heart rate and calories burned, without looking down at your wrist.",
    "Anyone using AirPlay to stream their workouts to a TV will miss out on this feature, which takes away some of the appeal of Fitness Plus compared to its rivals.",
    "Ultimately, this could work in Apple's favor; if you're already invested in the company's hardware ecosystem through your iPhone and Apple Watch, it might be enough of a push for you to make your next TV an Apple one as well to get the best possible experience from your workout subscription.",
    "Fitness Plus opens up other hardware avenues, too. It's already possible to connect your watch to many pieces of exercise equipment using Apple Gymkit, but it will be interesting to see whether the company also chooses to release its own treadmills and exercise bikes as well."
  ],
  "headers": {
    "5": "Lean, mean streaming machine"
  },
  "links": {
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "AirPlay 2": "https://www.techradar.com/news/audio/hi-fi-radio/best-airplay-speakers-5-budget-options-to-choose-from-1205484/how-to/phone-and-communications/mobile-phones/how-to-use-airplay-1318300/news/samsungs-2019-smart-tvs-are-getting-apples-itunes-and-airplay-2-support",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "TechCrunch": "https://techcrunch.com/2021/02/01/apple-fitness-is-adding-airplay-casting/",
    "Apple Gymkit": "https://www.techradar.com/how-to/how-to-connect-your-apple-watch-to-gym-equipment-with-apple-gymkit"
  }
}