{
  "source": "https://www.techradar.com/news/this-sandisk-nvme-ssd-deal-is-too-good-to-pass-up-even-if-you-dont-need-a-new-ssd",
  "title": "This SanDisk NVMe SSD deal is too good to pass up – even if you don't need a new SSD",
  "category": "computing",
  "updated": "2021-11-26T22:51:29Z",
  "author": "john-loeffler",
  "summary": "An extra 1TB of NVMe M.2 storage for just $79? Why the heck not!",
  "article": [
    "If you're looking to upgrade to a NVMe M.2 SSD this Black Friday, you can't go wrong with this SanDisk PCIe Gen3 NVMe internal SSD for just $79.99 at Best Buy, a $150 savings.",
    "This is definitely one of the better Black Friday deals we've seen for computer builders out there, and while it's not the fastest NVMe M.2 SSD around, for this price this makes a perfect secondary drive (if you have an additional M.2 slot on your motherboard) or a great option for a budget PC build.",
    "(Not in the US? Scroll down for deals in your region).",
    "This SanDisk PCIe Gen3 NVMe M.2 SSD might not be the fastest M.2 SSD out there, but at this price it really doesn't need to be. For just $79, we're sure you can find a use for it in a new build or your current system as either an upgrade from a SATA SSD or a backup for a faster PCIe Gen4 NVMe M.2 SSD.",
    "This SanDisk SSD offers read speeds up to 2,400MB/s and write speeds of up to 1,950MB/s, which is still three times faster than the fastest SATA SSDs, which max out at about 600MB/s.",
    "So if you really need to step up from your much slower HDD or SATA SSDs, or if you just need a speedy secondary storage to free up some room on a beefier Gen4 M.2 SSD, you really can't beat this SanDisk SSD for this price.",
    "No matter where you live, you'll find all the lowest prices for NVMe SSDs from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best SanDisk NVMe SSD Black Friday deal",
    "6": "More NVMe SSD deals",
    "7": "More Black Friday deals"
  },
  "links": {
    "SanDisk PCIe Gen3 NVMe internal SSD for just $79.99 at Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-9379399835057970000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fsandisk-ultra-1tb-pcie-gen-3-x4-nvme-internal-solid-state-drive%2F6402020.p%3FacampID%3D0%26cmp%3DRMX%26intl%3Dnosplash%26irclickid%3D3YpRt%253Aw42xyITPtUqswjdSANUkG2FuXG5ywExs0%26irgwc%3D1%26loc%3DNarrativ%26mpid%3D376373%26ref%3D198%26skuId%3D6402020&article_name=This%20SanDisk%20NVMe%20SSD%20deal%20is%20too%20good%20to%20pass%20up%20%E2%80%93%20even%20if%20you%20don't%20need%20a%20new%20SSD&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-sandisk-nvme-ssd-deal-is-too-good-to-pass-up-even-if-you-dont-need-a-new-ssd",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}