{
  "source": "https://www.techradar.com/news/5-ps5-restock-mistakes",
  "title": "5 PS5 restock mistakes I see people make every day – and how to actually buy it",
  "category": "gaming",
  "updated": "2021-08-30T09:14:49.877Z",
  "author": "matt-swider",
  "summary": "It's critical to avoid these mistakes if you're looking to buy the PS5. Here's how to increase your restock chances today.",
  "article": [
    "Update: As we head into Monday, May 10, our PS5 restock advice, outlined below, is more relevant than ever. Here's how to get the console – and not get scammed.",
    "I've become something of a PS5 restock expert in 2021, helping nearly 20,000 people find the Sony console in stock by tweeting out when and where to buy it. Sometimes I'm able to tell everyone in advance, too, giving my Twitter followers a serious edge.",
    "But every day I see the same mistakes being made that prevent people from actually purchasing the PlayStation console of their choice, whether that's the $499 PS5 Disc or $399 PS5 Digital Edition. You don't have to follow my PS5 restock advice, however, you should know how to increase your chances as PS5 stock continues to be low in the US.",
    "Here are the biggest mistakes I see every day and how to actually buy the console by avoiding the very same pitfalls everyone else is making.",
    "This has become an obvious one – at least for my 500,000 new followers in the last 80 days: follow @mattswider on Twitter and turn on notifications. Why? Because each PS5 restock lasts only three minutes when the add-to-cart button is left unabated (some retailers like Walmart, Best Buy, Target and GameStop force you to attempt that add-to-cart button again and again for 30 minutes, but Antonline opens the floodgates and lasts under three minutes so that's where we get that number).",
    "That means you'll have very little time to act, with millions of people still wanting the PS5 console and hundreds of thousands trying during every restock. Many will enter, few will walk away with a 'W'. Turning on notifications will send a push notification to your phone as soon as I send out a tweet about a PS5 restock.",
    "Every day – and this not an exaggeration, sadly – someone finds out about my PS5 restock Twitter account minutes too late. They message me that they might have just been scammed by a Twitter account posing as a reseller 'verified' by PlayStation. The account often has thousands of followers (those followers are fake) and in a few rare cases, the scam account is even been verified by Twitter (either they bought or hacked a verified Twitter account). Never once have I been able to tell the unsure victim that it isn't a scam. It's a PS5 restock scam each and every time.",
    "No one is eager to sell you the world's hottest piece of tech for just $550 – a mere $50 markup. First of all, state sales tax usually makes the final PS5 price close to and in some cases slightly higher than that $550 asking price (depending on where you live in the US), and shipping costs aren't accounted for – so this scammer would actually be losing money in the end... if they had the console.",
    "In addition to having thousands of fake followers, scam accounts have a network of people 'vouching' for them by thanking them for sending the console at such a low price (these are all fake accounts, too, and so are the images of receiving the console – they're probably ripped from Twitter or Google Images). Scammers have gone as far as writing the victim's name on a piece of paper and recording a video 'proving' the console is intended for them (but that console is never going to be sent).",
    "If I had $3 for every time someone replied to my PS5 Twitter tracker account with the words 'Out of stock' or 'already gone' when the console wasn't in fact completely out of stock, I'd be a millionaire right now. I've done the math.",
    "What so many people don't realize is that most retailers release the PS5 in waves. This requires spamming the add-to-cart button over and over again and, in the case of every retailer except Best Buy, refreshing the page and trying again and again until you actually get the PlayStation 5 in your cart and check out.",
    "The funny thing is, after this flood of 'out of stock' replies come, other people will reply to me alerts with 'just got it' 15 minutes later. Stick with it and you're bound to walk away with a PS5 when everyone else gives up. If you're replying 'out of stock' and giving up, you're not going to get it.",
    "My PS5 restock tracking takes into account more than a dozen stores throughout the US, including top retailers like Amazon, Walmart, Target and Best Buy. Small retailers consist of Newegg, Antonline, Costco (limited to members only), and Sony Direct (the official store for the PlayStation brand). We've even seen a rare restock at B&H Photo and Kohl's when they have an odd bundle, but only once in the last three months.",
    "Each retailer is different, and the best advice I have is to try them all and watch video tutorials from Jake Randall on how to buy the PS5 from stores like Target when we know it'll be in stock. For example, it's much easier to checkout with PayPal instead of going through the usual credit card pages on the Target website. Why? Because all of Target servers are being hammered during the restock process, whereas Paypal whisks you away to its own servers to process the payment.",
    "I don't get to every message – especially if the questions have been addressed in my FAQs (below). I usually don't bother if people refuse to read what's in front of them, yet still require individual attention. I get too many messages.",
    "But I still prioritize anyone who is in need of help and I can tell have read through all of my material on Twitter already. I try to get to one thousand messages a day., so please read through everything and ask me. I'm here to help.",
    "Once a week, I host a PS5 / Xbox restock Q&A on Instagram. By using Instagram Stories, I'm able to publicly answer questions, cutting down on a lot of the repeat questions people have about how to secure a console in 2021."
  ],
  "headers": {
    "4": "1. Follow a Twitter tracker – and turn on notifications",
    "6": "2. Avoid PS5 'restock' scams",
    "9": "3. People give up too quickly",
    "12": "4. Not knowing each PS5 restock is different",
    "14": "5. Ask me before making a purchase"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "follow @mattswider on Twitter and turn on notifications": "https://twitter.com/mattswider",
    "PS5 / Xbox restock Q&A on Instagram": "https://www.instagram.com/mattswider/"
  }
}