{
  "source": "https://www.techradar.com/news/dont-want-a-charge-5-your-older-fitbit-is-getting-a-bundle-of-new-tools-too",
  "title": "Don’t want a Charge 5? Your older Fitbit is getting a bundle of new tools too",
  "category": "fitness",
  "updated": "2021-08-25T14:16:53Z",
  "author": "cat-ellis",
  "summary": "But most of them are coming at a price",
  "article": [
    "Fitbit has just announced a new fitness tracker, the Fitbit Charge 5, but owners of its current watches and activity bands are also getting a package of new features – provided you're a Fitbit Premium subscriber.",
    "All of Fitbit’s current device lineup, including the Charge 5, Sense, Versa 3, Versa 2, Luxe and Inspire 2, will soon be able to calculate a daily Readiness Score, which will help you see how much energy you have for the day ahead.",
    "Unlike some devices, which calculate a similar score using heart rate variability, your Fitbit’s Readiness Score will also factor in your sleep quality and activity level. It will then suggest some workouts if you’ve got plenty of get-up-and-go, or some active recovery such as gentle yoga or breathing exercises if you’re tired.",
    "If you own a Fitbit Sense, you may be surprised to learn that the cheaper Fitbit Charge 5 will have one of your watch’s key features: an EDA (electrodermal activity) sensor for tracking changes in stress levels. In fact, you may have bought the Sense on the strength of that alone.",
    "There's good news, though: your Sense will soon be able to start a guided breathing exercise on your phone automatically when you begin taking an EDA reading, or start your watch’s EDA scanner when you begin a breathing exercise. Either way, it will allow you to see the impact of your relaxation session.",
    "Perhaps the most interesting new feature is snore detection, which is coming soon to the Sense and Versa 3. Fitbit’s other devices, including the Charge 5, don’t have microphones to pick up sound.",
    "We're not sure exactly what this will look like yet, but details spotted in the FItbit Android app back in May suggest that users will be categorized as different animals according to their sleep and snoring patterns. For example, if you sleep soundly all night, you might be classified as a 'tortoise', while those whose rest is more disturbed might be labelled 'bears'.",
    "Fitbit explains that this will not only identify snoring, but also pick up other ambient noise during the night that could affect your quality of sleep. That's all we know so far, but the company says it'll be sharing more information soon.",
    "While smartwatches often receive software and firmware updates to add new features, fitness trackers rarely receive new tools after launch. It's good to see Fitbit continuing to support its older devices, and hopefully it will continue to do so over the coming years.",
    "Although it's good to see Fitbit supporting older devices with new features, there is a catch: all of these new tools are likely to be exclusive to Fitbit Premium subscribers.",
    "Much like the personalized Health Metrics Dashboard, which shows variation in heart rate, SpO2 and skin temperature over time, and the custom Wellness Report that you can share with your doctor, Fitbit's new Readiness score will only be visible to those who pay for it.",
    "That's not the main attraction of Premium, though, and it seems as though these tools are more of a way to tempt you to give the service a try. The bulk of Premium's appeal is its wide array of guided video and audio workouts, meditation routines, mindfulness sessions, and nutrition plans.",
    "In fact, there's so much available, it seems as though Fitbit is taking aim at the likes of Peloton, Apple Fitness Plus. and FIIT. The company has even enlisted the services of meditation guru Deepak Chopra, plus Les Mills fitness and Mind meditation to give subscribers more options.",
    "All new Fitbit devices, including the Charge 5, come with a free trial of Premium thrown in, but if things continue at their current pace, we may soon see a cheaper version of Fitbit Premium that doesn't involve fitness trackers or smartwatches at all, and instead provides access to all the workout and mindfulness programs by themselves. Only time will tell, but it's a real possibility."
  ],
  "headers": {
    "3": "Stress measurement",
    "5": "Snore detection",
    "9": "Analysis: Fitbit Premium is the future"
  },
  "links": {
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Charge 5": "https://www.techradar.com/reviews/fitbit-charge-5",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "Luxe": "https://www.techradar.com/reviews/fitbit-luxe",
    "Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "details spotted in the FItbit Android app back in May": "https://www.techradar.com/news/fitbit-devices-are-getting-a-big-sleep-tracking-update-but-not-for-everyone",
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Deepak Chopra": "https://www.techradar.com/news/fitbit-launches-new-stress-busting-meditation-tools"
  }
}