{
  "source": "https://www.techradar.com/news/star-wars-knights-of-the-old-republic-3-is-already-here-you-just-werent-paying-attention",
  "title": "Star Wars: Knights of the Old Republic 3 is already here – you just weren’t paying attention",
  "category": "gaming",
  "updated": "2021-06-28T14:53:41Z",
  "author": "gerald-lynch",
  "summary": "Strip The Old Republic of its MMO leanings, and there are dozens of amazing Star Wars stories to be experienced",
  "article": [
    "There has been a disturbance in the Force. Have you felt it? For years, gamers have been crying out for a sequel to the much-loved Star Wars: Knights of the Old Republic series, and for the first time in an age, there’s a new hope that it might actually be on the way.",
    "The thing is, there’s been an amazing Knights of the Old Republic (KOTOR) game sat under your noses for years now – and you just missed it.",
    "This is no Jedi mind trick – it may not be officially called ‘Knights of the Old Republic 3’, but Star Wars: The Old Republic, despite being a massively multiplayer online RPG, is so close to being that, it’s hard to think of it as anything else.",
    "Approaching its tenth anniversary this year, The Old Republic launched at the height of MMO fever. World of Warcraft was riding high on a year that saw its highest-ever subscriber numbers, and the discourse around the genre was the hunt for a so-called “WoW Killer”.",
    "As history has shown, no such killer revealed itself, but The Old Republic made a heroic effort. Set many generations before the Skywalker Saga, it was a galaxy-spanning adventure that had dozens upon dozens of hours of content – more than what the two single-player KOTOR games combined offered.",
    "Players could take the role of many familiar races and roles from across the Star Wars pantheon. You could lead a Bounty Hunter character from their first job through to big-time gangster payout; take a Sith warrior from their in-training trials on Korriban to the full might of the dark side or play as Republic soldiers battling through intergalactic wars. Being an MMO, social play was carefully encouraged (players in a group could each interact with and question quest givers, and be rewarded for doing so), but the game was very friendly to players that just wanted to experience some fine Star Wars story telling, too.",
    "Each quest and each character were fully-voice acted and even had carefully directed set pieces. Players could make light-and-dark side decisions that would affect how AI companion characters would react to you – and those same AI companion characters would help you take on challenging content without the need to hunt down a full group of players.",
    "But it was the storylines themselves that were most reminiscent of the earlier KOTOR games. Each class had a full, weaving campaign to take part in, with its own goals, bosses and cutscenes, letting you truly feel as if you were living a life out in the harsh expanse of the Star Wars universe. The production values were superb – from the top-notch voice acting to the perfectly-pitched, John Williams-aping score, it all felt like Star Wars. It features some of BioWare’s best writing from the past ten years, while its exaggerated, caricature-like visuals have aged fantastically well.",
    "The problem was, for all its great efforts, it just wasn’t marketed as the solo Star Wars experience that some fans had wanted. It was all there, from the galaxy sweeping stories to the familiar sights and sounds of George Lucas’s universe. But the fear of the MMO grind and a monthly subscription fee (two issues long ironed out since KOTOR is now generously free-to-play aside from a few affordably-gated, one-off-payment-necessary expansions), were too great for the masses of Star Wars fans to initially invest in.",
    "But the intervening years have been quietly kind to The Old Republic, in which it has been continuing many of the themes, story beats and gameplay ideas established in the ‘Knights of…’ series.",
    "It was never developed as a direct sequel to the first two core games, of course . However, over the years it has become closer to those original games than some fans, who may have been put off by the initial MMO trappings of The Old Republic, may have realized: it is easy to solo through the story thanks to companion characters, there are single-player focused expansion packs (one even focusing on the legacy of KOTOR character Revan), exciting starfighter missions and much more.",
    "With relatively few caveats, all this can be experienced for free too – simply download the game (available now from Steam, as well as a separate installer), sign up and away you go. You can go through the entirety of the initial campaign storylines without paying a dime (potentially hundreds of hours of gameplay), while a single monthly-payment, even if never invested in again, will lift restrictions on expansion access and currency limits.",
    "But for purists looking for a true, ground-up KOTOR 3 experience, there’s been some promising developments in that galaxy far, far away too.",
    "For starters, EA’s exclusivity to the Star Wars gaming franchise has begun to be dismantled, with the formation of Lucasfilm Games. This will see Ubisoft making an open-world, story driven game and, on a related note, Bethesda studio MachineGames working on an Indiana Jones game. If Knights of the Old Republic is an EA / BioWare franchise, why is this good news then? Well, increased competition for the Star Wars fans’ dollar means that the company will need to pursue fan-favorite projects, and there’s no Star Wars game more wanted than a return to the RPG design of the Knights of the Old Republic franchise.",
    "Secondly, the current push among Disney’s Star Wars creative teams is to establish a new High Republic timeline, set 200 years before the Skywalker saga. As a result, there’s a whole new untapped area of Star Wars lore to not only tap into, but establish – fertile ground perhaps for a Knights of the High Republic game, no?",
    "But you need not wait to see where these developments go. There are hours upon hours of great Star Wars storytelling to be seen in The Old Republic, the vast majority of it totally free, and some solid RPG gameplay too. With the game heading towards its 10th anniversary, it’s set to be a big year for the title – we’re anticipating seeing a visual upgrade that could include ray-traced visuals, and some brand new content as the team gets over a COVID-19-induced hump. Whether flying (Han) solo, or grouping up with a bunch of rebel pals, Star Wars fans shouldn’t miss out on what The Old Republic still has to offer."
  ],
  "headers": {
    "2": "The Phantom MMO",
    "9": "Rise of The High Republic"
  },
  "links": {
    "Knights of the Old Republic 3": "https://www.techradar.com/news/a-new-star-wars-knights-of-the-old-republic-is-reportedly-in-development",
    "Knights of the High Republic game, no": "https://www.techradar.com/news/the-new-star-wars-knights-of-the-old-republic-is-reportedly-in-the-works-outside-of-ea"
  }
}