{
  "source": "https://www.techradar.com/news/lg-b1-oled-price-release-date-specs",
  "title": "LG B1 OLED price, release date and specs",
  "category": "televisions",
  "updated": "2021-12-03T09:55:05Z",
  "author": "henry-st-leger",
  "summary": "The LG BX's successor has arrived. Here's what we know",
  "article": [
    "The LG B1 OLED is out now, but has its thunder already been stolen? That's the question on our lips right now, with a BX OLED successor confirmed by LG even as an even cheaper A Series model is set to undercut it on price.",
    "The B Series has, for the past few years, been the cheapest OLED TV in LG's television range. Making do with a lower-spec a7 processor, rather than the a9 models used in higher-up models (C Series, G Series, E Series, and W Series), it's been the closest the TV market has got to an affordable OLED that's actually worth buying.",
    "Change is afoot, though. A new A1 OLED was launched this year, with a few more compromises to specification to drop that starting price even further.",
    "It means the B1 isn't the go-to value buy that the B9 or BX was, possibly seeing the model discontinued in the long run if shoppers largely opt for A1 instead – something we saw in 2020, when the gorgeous E9 OLED wasn't renewed with a new iteration.",
    "Initially, we thought the B1 would only be hitting UK and European markets after it was suggested the whole B series was already being discontinued in the US. However, it's now available on the LG website in 55-inch, 65-inch and 75-inch sizes – just like it is in the UK. It's worth bearing in mind this is billed as an 'online exclusive' in the US, so might not be widely available.",
    "So, what can you expect from the LG B1 OLED? Here's everything we know about the TV.",
    "After having a confused status for a while, the LG B1 is now available in both the UK and the US – the LG website calls the US available an 'online exclusive', which is worth bearing in mind before you hit an offline store.",
    "At one point, we weren't sure the B1 was going to arrive at all. The B series usually launches later in the year after the C Series and G Series, and early reports in 2021 suggested LG wasn't sure the B1 would be on its way.",
    "Then reports suggested that the LG B1 would launch, but only in the UK and European markets with an April 24 UK release date.",
    "In the US, as the B Series was due to be discontinued to make way for the entry-level A1 OLED series. However, fast-forward to later in the year and it's now available in US markets, too.",
    "In the UK, you're paying a bit more than the launch price of last year's BX, with a 55-inch model setting you back £1,499, while the 65-inch and 77-inch models cost £2,299 and £3,799 respectively.",
    "The BX, on the other hand, launched at $1,399 / £1,299 / AU$2,995 at 55 inches, and $1,999 / £1,799 at 65 inches, meaning there's been a small uptick – possibly to stress the value of the new entry-level A1 OLED.",
    "In Europe, the B1 is retailing for 1,800 euros for a 55-inch size, which is the same as last year's BX, meaning there's been no price increase.",
    "Now it's launched in the US, we know the LG B1 is $1,399 at a 55-inch size, $1,999 at a 65-inch size, and $3,099 at a 77-inch size.",
    "This is the first time the B Series will get a 77-inch size, though it won't get the compact 48-inch size found on the C Series or A Series. However, there is still more flexibility in sizing than before, and we could always see additional models announced down the line (a new 42-inch OLED panel size is on its way, after all).",
    "The LG B1 OLED isn't the cheapest OLED TV put out by LG this year, but not much has changed over last year's BX.",
    "You're getting a step-down a7 Gen 4 AI processor rather than the a9 Gen 4 AI chip used in the C1 and G1 OLEDs. The a7 isn't quite as advanced (hence the price drop), and tends to lead to more banding and video noise in dark scenes, but it still makes for a generally favorable picture.",
    "It still benefits from some of the AI advances of LG's chipsets this year too, using deep learning to better analyze discrete objects onscreen, meaning people, backgrounds, and sections of text are all properly distinguished from each other. \"Every adjustment to picture and sound is automatic, so everything you watch is spectacular,\" says LG's website.",
    "It's a 4K OLED, so you get a crisp 3840 x 2160 resolution, along with a 120Hz panel and LG's webOS smart platform – which has been overhauled with a sixth iteration for this year, ditching the half-screen overlay for a full-screen home page, and somewhat tidier tile icons.",
    "HDR is supported, along with the Dolby Vision dynamic HDR standard, and Dolby Atmos audio.",
    "In terms of sound, the B1 OLED does get 40W of audio output with its downward-firing drivers, rather than the meagre 20W found on the A1 OLED. The B1 will also include two HDMI 2.1 ports, unlike the A1, which won't have any.",
    "HDMI 2.1 is needed for a host of gamer-centric features like 4K/120Hz gameplay, as well as VRR (variable refresh rate). The B Series and above will also get G-SYNC and AMD FreeSync support to reduce screen tearing on PC-linked gaming TVs.",
    "For those not au fait with LG lingo, the 'B1' is the specific product number applied to this year's B Series OLED.",
    "The letter 'B' denotes the television series (alongside 'A', 'C', 'G', and the now-discontinued 'E' Series), while the number corresponds to the year of release. In 2019, these numbers were all '9', as in 'C9' or 'B9'; in 2020, the number became 'X' ('ten'), while 2021 is resetting to '1'."
  ],
  "headers": {
    "6": "LG B1 OLED release date",
    "10": "LG B1 OLED pricing and sizes",
    "15": "LG B1 OLED specs and features",
    "22": "What does 'B1' really mean?"
  },
  "links": {
    "BX OLED": "https://www.techradar.com/reviews/lg-bx-oled-tv",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "A1 OLED": "https://www.techradar.com/news/lg-a1-oled-price-release-date-specs-sizes",
    "B9 or BX": "https://www.techradar.com/news/lg-bx-vs-lg-b9-oled",
    "E9 OLED": "https://www.techradar.com/news/the-e9-oled-was-one-of-lgs-best-tvs-so-where-did-it-go",
    "LG website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1328750805191004400&xs=1&url=https%3A%2F%2Fwww.lg.com%2Fus%2Ftvs%2Flg-oled77b1pua-oled-4k-tv%23&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Flg-b1-oled-price-release-date-specs",
    "new 42-inch OLED panel size is on its way": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
    "webOS": "https://www.techradar.com/news/television/6-best-smart-tv-platforms-in-the-world-today-1120795/uk/best/webos-vs-tizen-vs-roku-vs-android-tv",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "gaming TVs": "https://www.techradar.com/news/best-gaming-tv"
  }
}