{
  "source": "https://www.techradar.com/news/intel-arc-alchemist-desktop-gpu-could-arrive-disappointingly-late-in-2022",
  "title": "Intel Arc Alchemist desktop GPU could arrive disappointingly late in 2022",
  "category": "computing",
  "updated": "2021-10-03T15:48:24Z",
  "author": "darren-allan",
  "summary": "Renders of what the graphics card might look like have also been shared",
  "article": [
    "Intel’s Arc Alchemist desktop GPU may not emerge until the second quarter of 2022, going by the latest from the rumor mill, which has also shared some renders of what the graphics card could theoretically look like when it does debut.",
    "This comes from YouTube-based hardware leaker Moore’s Law is Dead, who in a new video (spotted by VideoCardz) claims that when Intel talks about a Q1 2022 launch for its Xe-HPG (high-performance gaming) products, the chip giant is referring to laptop GPUs, and the actual Alchemist desktop graphics cards might not arrive until Q2.",
    "The theory is that Alchemist laptop GPUs will launch alongside Alder Lake mobile chips, to make for some seriously pepped-up gaming laptops, and that desktop Alchemist products could then follow the quarter after. The delay may be tied in with supply chain and production worries, rather than any concerns about things like drivers, but as ever, take anything heard on the GPU grapevine with a good deal of skepticism.",
    "As mentioned at the outset, Moore’s Law is Dead also shared some interesting images in this latest video, representing a purportedly fairly accurate mock-up of what these next-gen GPUs will look like.",
    "We have to note carefully here that these images of Intel’s desktop Alchemist graphics card are simply renders (there’s a nifty animation shown in the video, in fact) created for Moore’s Law is Dead, which is illustrative of what the GPU should look like. These are in no way actual pics of Intel’s card, in other words (which obviously isn’t finished yet anyway).",
    "The renders are based on fresh info that several sources have given to Moore’s Law is Dead, with early engineering sample shots that the leaker already had from some time back being used as a reference point to put together the renders.",
    "Moore’s Law is Dead further explains that this is pretty much what ‘most’ current reference test boards look like – there are other designs out there, he clarifies, but in all likelihood, this is what the finished design will be. That’s not certain, naturally, and there’s obviously a good chance that even if this is what the Alchemist flagship turns out to be, there will be various changes between now and the launch of the card.",
    "In short, apply very liberal scatterings of your preferred condiments, and bear firmly in mind that this is just an idea of what the finished desktop graphics card might look like, with various elements potentially changing (he mentions the color, vent placement, and other finer details that’ll almost certainly be fine-tuned – and who knows, bigger changes could come, even if these renders are on the money for the test boards now).",
    "If this is what Intel’s new desktop GPUs will turn out like, or something along these lines, then we’re giving it a tentative thumbs-up: the rendered card looks quite nifty in our opinion – not fancy, but kind of slick in its simplicity. Which isn’t a bad line to take, really.",
    "What’s a bit disappointing here is the possibility that we might have to wait for the second quarter of 2022 before we see the desktop versions of the Alchemist graphics card (remember, though, that this potential delay is merely whispers on the grapevine).",
    "Gamers are hungry to see what Intel has to offer, but with that Q1 2022 release date already floated, if the desktop GPUs don’t actually pitch up until Q2 – which could mean June, or the middle of the year, even if that is seemingly an unlikely scenario – folks could lose patience and buy an AMD or Nvidia card instead. Or alternatively, at that point the next-gen products from Teams Red and Green may be just around the corner – with the rumor mill spinning away furiously by then – and in that case, the danger is that gamers may wait a bit longer to see what those RTX 4000 (presumably) or RDNA 3 products bring.",
    "That said, if Intel goes for the throat on the price front – as we expect might be the case, as an obvious line of attack – that could still tempt buyers later down the line next year (indeed, overall availability of GPUs could well still be shaky at the point, anyway).",
    "However, when it comes down to it, we’ve been waiting quite some time for Intel to debut these desktop Xe-HPG cards, and pushing things out further to possibly the middle of next year feels dangerous to us. Still, Alchemist won’t be ready until it’s ready, and if supply chain pressures get in the way, there won’t be much Intel can do about it."
  ],
  "headers": {
    "8": "Analysis: Potential perils of the waiting game"
  },
  "links": {
    "Intel’s Arc Alchemist": "https://www.techradar.com/news/intel-arc-gpus-kick-off-with-the-alchemist-which-weve-just-caught-a-glimpse-of",
    "video": "https://www.youtube.com/watch?v=Cr1tBFUjPBQ",
    "VideoCardz": "https://videocardz.com/newz/intel-arc-alchemist-reference-desktop-card-shown-in-new-renders-rumored-to-launch-in-q2-2022",
    "Q1 2022 launch": "https://www.techradar.com/news/intel-arc-unveiled-but-how-will-it-stack-up-against-nvidia-and-amd",
    "Xe-HPG (high-performance gaming) products": "https://www.techradar.com/news/intel-xe-hpg-gaming-graphics-card-could-beat-nvidia-and-amds-best-in-one-key-area",
    "Intel’s new desktop GPUs": "https://www.techradar.com/news/intel-ceo-suggests-its-gaming-gpus-will-be-a-serious-threat-to-nvidia",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Xe": "https://www.techradar.com/news/intel-xe-graphics-cards"
  }
}