{
  "source": "https://www.techradar.com/news/sony-launches-widest-ever-prime-lens-for-its-full-frame-cameras",
  "title": "Sony launches widest ever prime lens for its full-frame cameras",
  "category": "cameras",
  "updated": "2021-04-20T23:42:19Z",
  "author": "mark-wilson",
  "summary": "Sony lenses continue hot streak with new 14mm f/1.8 GM",
  "article": [
    "Sony has continued its hot streak of releasing fast, prime lenses for its full-frame cameras with the impressively compact new FE 14mm f/1.8 GM.",
    "The ultra-wide-angle lens, which Sony says is designed for everything from astrophotography to landscapes and architectural shots, carries the GM (or 'G Master') badge, which means it's pretty uncompromising in both design and price.",
    "From a design perspective, the most intriguing thing about the FE 14mm f/1.8 GM is its relatively compact size – it weighs only 460g and measures just under 100mm in length, at 99.8mm.",
    "That means it's considerably lighter than rivals like the Sigma 14mm f/1.8 DG HSM Art Lens, which weighs in at 1,170g, and is about a third shorter, too.",
    "For stills photographers, it's certainly stacking up to be another very tempting addition to the camera bag, with Sony suggesting its edge-to-edge sharpness will be a big improvement on its Sigma rival.",
    "The lens will apparently be particularly good for astrophotographers, thanks to the inclusion of two XA (extreme aspherical) elements, which should help keep stars looking crisp and nicely rounded.",
    "But it should also be a relatively versatile lens, as you'd hope for the price, thanks to a 25cm minimum focusing distance and dual XD Linear Motors, which promise to deliver speedy, quiet autofocus.",
    "Movie shooters are also nicely catered for with the 14mm f/1.8 GM, which has a de-clickable aperture ring and a comparatively front-light design. This should make it particularly suitable for use in gimbals, which are used by movie shooters to keep their footage ultra-smooth.",
    "The lens is also sealed against dust and moisture, and includes Sony's usual fluorine coating to help keep oil and moisture at bay. Along with a focus hold button on the side, it also has an external aperture ring and a built-in lens hood.",
    "So how much will the 14mm f/1.8 GM cost? Surprisingly, considering its size and 'G Master' badge, the price tag isn't too hefty – it'll be available for $1,600 / £1,400 / AU$2,299 when it goes on sale in May.",
    "While that's still a hefty chunk of change for most photographers, it's not much more than its larger and heavier Sigma rival. We're in the process of testing the 14mm f/1.8 GM and will give you our final verdict very soon."
  ],
  "headers": {
    "7": "The wide of your life"
  },
  "links": {
    "full-frame cameras": "https://www.techradar.com/news/best-full-frame-camera"
  }
}