{
  "source": "https://www.techradar.com/news/microsoft-teams-is-finally-fixing-one-of-its-most-annoying-features",
  "title": "Microsoft Teams is finally fixing one of its most annoying features",
  "category": "computing",
  "updated": "2021-05-17T08:49:32Z",
  "author": "mike-moore",
  "summary": "Block all attendee video on Microsoft Teams at last",
  "article": [
    "Hosting a Microsoft Teams call may finally get a bit less irritating thanks to a new update rolled out by the company.",
    "The video conferencing service has revealed that meeting organizers will soon be able to disable and enable video feeds from specific attendees - as well as turning off the video feeds of all participants in a call.",
    "Spotted by WindowsLatest in a Microsoft forum post, the update means that hosts and attendees alike should be less distracted by the vast collection of video feeds that normally comes with joining a group call.",
    "\"We are excited to announce we will soon be releasing the ability to disable all attendee videos, and the ability to disable a single attendee video,\" the forum post noted.",
    "The new feature, which Microsoft said is coming to Windows and macOS users alike, along with mobile users on iOS and Android, should begin rolling out at the end of May 2021.",
    "It's the latest in a number of new features introduced to Microsoft Teams as the company looks to strike ahead in the video call market, especially with many employees embracing a hybrid working approach to office life.",
    "The service also recently rolled out PowerPoint Live, which looks to allow starting presentations directly in a Microsoft Teams meeting without needing to share your screen with the audience.",
    "Microsoft also revealed that Teams will soon automatically record all meetings, with a warning displayed at the start of a call to alert users that the meeting is being recorded, with the recording set to be available to download and listen back to after the call has ended.",
    "And for those looking for something a little bigger, Microsoft Teams users will soon be able to host “interactive webinars” for up to 1,000 participants, or view-only broadcasts for up to 20,000 people.",
    "Via WindowsLatest"
  ],
  "headers": {
    "3": "Turn it off"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "forum post": "https://microsoftteams.uservoice.com/forums/555103-public/suggestions/40255927-participant-controls-in-meetings-block-attendee",
    "record all meetings": "https://www.techradar.com/news/microsoft-teams-will-soon-automatically-record-all-your-meetings",
    "webinars": "https://www.techradar.com/best/best-webinar-software",
    "WindowsLatest": "https://www.windowslatest.com/2021/05/13/microsoft-teams-will-finally-allow-you-to-block-all-attendees-video/"
  }
}