{
  "source": "https://www.techradar.com/news/sony-wf-1000xm4-vs-apple-airpods-pro-how-the-best-wireless-earbuds-compare-to-the-best-airpods",
  "title": "Sony WF-1000XM4 vs Apple AirPods Pro: how the best wireless earbuds compare to the best AirPods",
  "category": "audio-visual",
  "updated": "2021-07-03T15:00:07Z",
  "author": "olivia-tambini",
  "summary": "Should you buy wireless earbuds from Sony or Apple?",
  "article": [
    "We’ve crowned the Sony WF-1000XM4 the best true wireless earbuds you can buy today – but how do they stack up against the best AirPods on the market, the Apple AirPods Pro?",
    "In some respects, these models are evenly matched, with both offering active noise cancellation, similar battery lives, wireless charging, and comfortable designs.",
    "However, there are some significant differences between the two, in terms of audio performance and connectivity. So, which wireless earbuds are best for you? So, before you take the plunge, here’s everything you need to know about Sony and Apple’s top noise-cancelling earbuds.",
    "The Sony WF-1000XM4 were released in June 2021 and cost $279.99 / £250 / AU$449.95. That makes them a little pricier than their predecessors, the Sony WF-1000XM3, which cost $230 / £220 / AU$399 at launch, but are now usually available with a discount. Since the WF-1000XM4 are so new, you’re unlikely to find them for less right now.",
    "The Apple AirPods Pro are the older of the two pairs of wireless earbuds, having launched in 2019 for $249 / £249 / AU$399. While it is possible to find deals that cut the AirPods Pro price a little, it’s rare to find significant discounts.",
    "If you’re in the US or Australia, the AirPods Pro are the cheaper option here. In the UK, however, there’s no price difference between the Apple earbuds and the newer Sony WF-1000XM4, unless you can find a great AirPods Pro deal.",
    "The Sony WF-1000XM4 and the AirPods Pro represent the two main styles of true wireless earbuds: units that come with protruding ear stems such as the AirPods Pro, and those that don’t such as the WF-1000XM4.",
    "Which type you prefer will generally come down to personal preference; some people love the design-led look of the AirPods Pro, while others will prefer the more subtle look of Sony’s wireless earbuds.",
    "Let’s start with the Sony WF-1000XM4. These buds are smaller than their predecessors, with rounded housings and a choice of polyurethane eartips. The charging case is sufficiently compact to slip into a pocket, and is charged via the USB-C port around the back – or using a wireless charging mat.",
    "The surface of each earbud is touch-sensitive, allowing you to control music playback, and you can assign different controls via the Sony Headphones app. Possible controls include ‘volume up/down’, ‘play/pause/skip forwards/skip backwards/summon voice assistant’, and ‘active noise-cancelling on/off/adaptive’.",
    "The AirPods Pro look very different from the WF-1000XM4, with protruding stems that feature capacitive force sensors – squeezing these areas will activate noise-cancelling / Transparency mode, or skip and pause tracks.",
    "Unlike the original AirPods, the AirPods Pro are offered with a selection of silicone tips, making it easier to find a comfortable fit. Like the Sony earbuds, the slim charging case can be topped up via the USB-C port or a wireless charging mat.",
    "Both models come with an IPX4 water-resistance rating, which means they’ll happily survive a sweaty workout – but not a dip in the pool.",
    "In terms of audio performance, the Sony WF-1000XM4s are the winner, hands-down. They feature a balanced, driving sound that displays excellent detail and rhythmic agility.",
    "They also incorporate the DSEE Extreme audio upscaling first seen in the over-ear Sony WH-1000XM4 (AKA the best headphones you can buy in 2021), which have been designed to extract high-resolution sound from standard-definition digital audio files.",
    "On that note, the Sony earbuds support hi-res audio playback, thanks to the company’s bespoke LDAC codec – although aptX support is missing here.",
    "That’s not to say that the Apple AirPods Pro’s sound is terrible by comparison. In fact, they offer a much-improved audio performance compared to their predecessors, with a lively sound and rich mid-low frequencies.",
    "However, they just can’t compete with the Sony earbuds for detail or control. In addition, with no support for hi-res audio, you won’t be able to take advantage of high-quality music streams – which is a puzzling omission given that Apple Music has just added hi-res audio to its platform at no extra cost to subscribers.",
    "Saying that, as of a recent firmware update the AirPods Pro do now feature Spatial Audio, which brings Dolby Atmos immersive audio to the true wireless earbuds.",
    "You’ll need an Apple device with iOS 14 or iPadOS 14 to take advantage, as well a streaming service that supports 5.1, 7.1, or Atmos. Stereo content can also be converted to Spatial Audio as long as the streaming service has enabled a special plugin for stereo spatialization.",
    "While the Sony WF-1000XM4 do support Dolby Atmos and Sony’s 360 Reality Audio, they lack the built-in accelerometers that allow the AirPods Pro to track your head movements, which is one of the reasons Spatial Audio is so successful at replicating 3D sound.",
    "The Sony WF-1000XM4 and the AirPods Pro are fairly evenly matched when it comes to noise cancellation. Both sets are capable of blocking out a fair amount of environmental sound, but neither can beat the Bose QuietComfort Earbuds in this area.",
    "One trick that the Sony earbuds have up their sleeves is adaptive noise cancellation. With your permission, the WF-1000XM4 can learn where you’re using geo-location access, and apply your preferred level of noise cancellation or ambient sound passthrough depending on where you are. So, for example, at home you may prefer a fully cancelled noise mode, while in the office you may still want to be able to hear voices.",
    "The AirPods Pro, on the other hand, use two microphones for internal and external sound analysis. The former monitors the audio quality in the ear to see if the music you’re playing sounds as it should, altering it accordingly using an algorithm. The latter cancels out background sound, and creates a far more serene listening environment.",
    "We can’t evaluate how well the algorithm that monitors sound inside your ear actually works, since there’s no way to turn it on and off – but the active noise cancellation has a strong and noticeable effect.",
    "Both Sony and Apple’s earbuds come with a transparency mode – Sony calls this Ambient Sound Control – that allows you to tap into your surroundings by blending outside noise into whatever you’re listening to.",
    "Battery life is another area where the Sony WF-1000XM4 and AirPods Pro are pretty much on an equal footing. Both models offer a 24-hour battery life, but how that’s split between the earbuds themselves and their charging cases differs slightly.",
    "The Sony earbuds offer between 8 and 12 hours of playback from the earbuds, (depending on whether active noise cancellation is on or off), plus another couple of charges in the case.",
    "Meanwhile, the AirPods Pro offer five hours of listening (that’s with noise cancelling or Transparency mode off; you’ll get four and a half hours with it on), or three and a half hours if you’re using the AirPods Pro as a hands-free mic for making/taking calls.",
    "Neither model offers class-leading battery life, then. The Cambridge Audio Melomania Plus, for example, deliver up to 45 hours of playback – although these buds lack ANC, which can be a real drain on battery life.",
    "The Sony WF-1000XM4 come with Bluetooth 5.2 connectivity, and support for LDAC, SBC, and AAC codecs. The AirPods Pro use the slightly older Bluetooth 5 transmission standard.",
    "As a result, the Sony earbuds are the earbuds to choose if you want the latest in connectivity technology – but it’s the AirPods Pro that are the victor in terms of what they can actually do with that technology.",
    "The AirPods Pro are perfectly optimized for use with other Apple products, with features such as auto-switching allowing the buds to detect the device you’re using and connect automatically. They’ll also soon offer the ability to announce notifications via Siri, which is coming with iOS 15.",
    "Conversation Boost – another feature that will be introduced with the latest iPhone operating system – amplifies the sound of the person you’re speaking to in a face-to-face conversation. It’s potentially a very useful feature for those with hearing impairments, or for anyone trying to hear a friend in a noisy environment.",
    "Since we’ve crowned the Sony WF-1000XM4 the best true wireless earbuds you can buy today, you might have thought that deciding between them and the AirPods Pro is a no-brainer.",
    "However, this isn’t the case. While we believe the Sony WF-1000XM4 are the best all-rounders, there are some instances where the Apple earbuds may be the better choice.",
    "For example, if you use a lot of Apple products, you’ll benefit from the easy pairing afforded by the AirPods Pro, as well as their ability to integrate into your wider Apple ecosystem and offer support for Spatial Audio.",
    "They’re slightly cheaper than the Sony WF-1000XM4 (in the US and Australia, at least), too, with occasional discounts making the AirPods Pro far more affordable than they’d be otherwise.",
    "If pure audio quality is the priority, we’d recommend the Sony WF-1000XM4. However, since they’re evenly matched with the AirPods Pro in terms of ANC and battery life, you’re left with a toss up between sound performance and comprehensive connectivity."
  ],
  "headers": {
    "3": "Sony WF-1000XM4 vs Apple AirPods Pro: price and availability",
    "6": "Sony WF-1000XM4 vs Apple AirPods Pro: design",
    "13": "Sony WF-1000XM4 vs Apple AirPods Pro: audio performance",
    "21": "Sony WF-1000XM4 vs Apple AirPods Pro: noise cancellation",
    "26": "Sony WF-1000XM4 vs Apple AirPods Pro: battery life",
    "30": "Sony WF-1000XM4 vs Apple AirPods Pro: connectivity",
    "34": "Takeaway"
  },
  "links": {
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "noise-cancelling earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple earbuds": "https://www.techradar.com/news/airpods-beats-and-the-best-apple-headphones-you-can-buy-in-2020",
    "AirPods Pro deal": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "Sony’s 360 Reality Audio": "https://www.techradar.com/news/first-look-sony-360-reality-audio",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Cambridge Audio Melomania Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "iOS 15": "https://www.techradar.com/news/ios-15-update"
  }
}