{
  "source": "https://www.techradar.com/news/windows-10-21h2-update",
  "title": "Windows 10 21H2 Update 'Sun Valley' release date, news, and features",
  "category": "computing",
  "updated": "2021-07-06T10:24:38Z",
  "author": "daryl-baxter",
  "summary": "The next Windows 10 update scheduled for late 2021",
  "article": [
    "Microsoft’s regular schedule of releases for Windows 10 is expected to drop another update in the latter stages of 2021. Despite being some way off, the Windows 10 21H2 Update, currently being referred to as ‘Sun Valley’, is shaping up to now be a much smaller update for the operating system than what was previously expected.",
    "Microsoft is yet to officially reveal the 21H2 update to Windows 10, but through leaks, rumors, and the Windows Insider Program, we’ll begin to piece together a good picture throughout the months leading up to its release.",
    "With Windows 11 now official, users are curious as to what the 21H2 update will now bring. With updates and support from Microsoft scheduled to run to 2025, we expect to see Sun Valley as a much smaller update now.",
    "As we begin to build a picture of what to expect, here is everything we know so far about 2021’s second update for Windows 10.",
    "Right now there is no confirmed release date for the Windows 10 21H2 ‘Sun Valley’ update. Microsoft’s release schedule for Windows 10 updates in recent times has been to push out a major update in each half of the year.",
    "The first update for 2021, Windows 10 21H1 is already out, but we can safely expect is that the second update will be released between September and December.",
    "Windows Central reports that the internal timeline for the Windows 10 21H2 release points to October, with testing through the Windows Insider channels before then.",
    "It looks as though Microsoft are focusing more on having Windows 11 in a stable form, with speculation pointing towards an October release as well. So we may see two significant updates here for two operating systems from Microsoft, not really seen since the days of Windows Phone and Windows 8.",
    "At this time there is no confirmed name from Microsoft. Based on the naming convention for Windows 10 updates, however, it’s safe to assume that its official designation will be Windows 10 21H2. The ‘21’ refers to the year and ‘H2’ refers to the second half of the year. With Windows 10 21H1 confirmed for the first half of 2021, there’s no reason not to assume Microsoft is continuing this trend.",
    "The name being tossed around at the moment is ‘Sun Valley’ which is unlikely to be its release name. This is an internal codename for parts of the next version of Windows 10 which is being worked on and has been outed to the public by way of leaks from those with insider knowledge of Microsoft’s workings.",
    "‘Sun Valley’ was first reported as a codename for the UI enhancements Microsoft is working on for the 21H2 release. The other name being touted for the Windows 10 21H2 project is ‘Cobalt,’ encapsulating everything in the release including the UI improvements and the under-the-hood enhancements.",
    "During the opening keynote to Build 2021, Microsoft CEO Satya Nadella spoke about using a new version of Windows. \"I’ve been self hosting it over the past several months, and I’m incredibly excited about the next generation of Windows,\" Nadella told attendees.",
    "We now know that this was hinting towards Windows 11, bringing a new look, a focus on gaming, and a completely redesigned Microsoft Store.",
    "When it comes to a release name, Microsoft tends to apply either a month or a season to the updates for Windows 10. If indeed Windows 10 21H2 does arrive in October, for example, Microsoft could well name it the Windows 10 October 2021 Update.",
    "In the latest Insider dev channels, there are already countless icons that have seen a redesign, giving most of these the most dramatic changes in looks since Windows 7.",
    "However, Microsoft's design team are also looking for a new font, asking users to pick from five fonts to replace Calibri.",
    "It was speculated that 'Sun Valley' was going to bring forth a whole new look for Windows 10, to completely refresh the user interface as we closed out 2021.",
    "However, it looks as though this new look is only being applied to the icons, with the rest of the new look being reserved for Windows 11.",
    "Windows 10 updates are about much more than just visual flair and 21H2 is set to be no exception. There will be several changes underneath that aren’t user-facing, as always, and a number that will be.",
    "Microsoft is reported to be focusing a large effort on the user experience in Windows 10 21H2, and one of the earliest examples is the News & Interests widget on the Taskbar. It’s expected that other lifestyle features like this may appear in 21H2.",
    "It has also been reported that Microsoft will be including battery usage statistics in 21H2 in the Settings app. Smartphones have had this sort of feature for many years but it has, for some reason, eluded Windows. Laptop users should be able to track their battery usage in detail from Windows 10 21H2.",
    "Other rumored features include the ability to uninstall most of the pre-installed Microsoft apps, improvements to snap assist for external displays, and a dashboard for your Microsoft Account that lives in the taskbar. Additionally, recent test builds have suggested that the taskbar and the File Explorer process may, finally, be getting separated.",
    "Before Microsoft pushes out any big update to Windows 10 it passes through the various channels in the Windows Insider Program. There are various channels in the Insider Program which relate to how far ahead of time you’ll be able to test new features, with the most cutting edge being the ‘Dev Channel’, targeted at the most technical users.",
    "The ‘Beta Channel’ is likely to be the first place a full Windows 10 21H2 build will start life and for many is the best one to follow. These will be reliable builds tied to a future release with updates validated by Microsoft. Closer to launch, Windows 10 21H2 will hit the ‘Release Preview Channel’ which is the most stable of all in the Insider Program. Builds released to this channel are supported by Microsoft.",
    "If you’re not yet in the Windows Insider Program and you’d like to start testing future updates early you can enrol right from the Settings app on your PC. Head to the ‘Update & Security section, then select ‘Windows Insider Program’ and choose the channel you want to join. You will then begin receiving updates through ‘Windows Update’ on your PC corresponding to the channel you joined.",
    "With Build 2021 having showcased new features for Visual Studio and Teams, it looks as though there'll be solid support for Windows 10 in the years to come."
  ],
  "headers": {
    "4": "Windows 10 21H2 ‘Sun Valley’ release date",
    "8": "Windows 10 21H2 ‘Sun Valley’ speculation",
    "14": "New icons for Windows 10 21H2 ‘Sun Valley’",
    "18": "New OS features for Windows 10 21H2 ‘Sun Valley’",
    "22": "How to test the Windows 10 21H2 Update before launch"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "much smaller update": "https://www.techradar.com/news/hold-on-there-windows-10-is-still-on-schedule-for-an-update-soon",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows 10 21H1": "https://www.techradar.com/news/the-next-important-windows-10-update-is-one-step-closer-to-release",
    "Windows Central reports": "https://www.windowscentral.com/windows-10-sun-valley-features-everything-we-know",
    "UI enhancements": "https://www.techradar.com/news/windows-10s-new-look-hinted-at-in-fresh-screenshots",
    "Cobalt": "https://www.windowscentral.com/windows-10-sun-valley-ui-october-2021-update",
    "spoke about": "https://www.techradar.com/news/build-2021-windows-10-now-on-more-than-one-billion-devices",
    "asking users": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-3694708559030236700&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Fblog%2F2021%2F04%2F28%2Fbeyond-calibri-finding-microsofts-next-default-font%2F",
    "only being applied to the icons": "https://www.techradar.com/news/hold-on-there-windows-10-is-still-on-schedule-for-an-update-soon",
    "News & Interests widget": "https://www.techradar.com/news/windows-10s-new-taskbar-could-be-bad-news",
    "including battery usage statistics": "https://twitter.com/thebookisclosed/status/1338529689246310402?s=20",
    "taskbar and the File Explorer process": "https://www.techradar.com/news/future-windows-10-update-could-fix-one-of-its-most-annoying-problems",
    "Build 2021": "https://www.techradar.com/news/microsoft-build-2021"
  }
}