{
  "source": "https://www.techradar.com/news/intel-ceo-believes-the-cpu-and-gpu-shortage-crisis-will-last-into-2023",
  "title": "Intel CEO believes the CPU and GPU shortage crisis will last into 2023",
  "category": "computing",
  "updated": "2021-10-23T01:31:50Z",
  "author": "allisa-james",
  "summary": "No end in sight for the immediate future",
  "article": [
    "Intel CEO Pat Gelsinger made quite the bold claim, stating in a recent interview with CNBC that both the gaming CPU and graphics card shortages could last as far as 2023. While he’s weighed in on the issue before, this is the first time he’s named a specific year.",
    "Gelsinger believes that while the semiconductor shortages that have plagued the tech industry will marginally improve over time, he doesn’t think there will be a “supply-demand balance until 2023.” He still remains optimistic about the increase in PC sales, however, believing that the trend will continue in the future.",
    "AMD president and CEO Lisa Su also agrees that the shortage won’t be resolved this year but suggests it will “get better in 2022.” Though she also cautions that while the situation will slowly improve, we shouldn’t hope for an immediate fix.",
    "Regardless, none of these predictions are concrete as they’re based on industry speculation. So we’ll have to wait and see how long this semiconductor shortage actually lasts.",
    "The general consensus is the ongoing chip shortages started with the pandemic. Major factors stemmed from that, such as the closing of production sites due to health mandates, coupled with the massive increase in demand for tech products due to many workers being forced to work from home thanks to global lockdowns.",
    "The all-around reduction in the workforce is especially devastating as it affects manufacturers such as TSMC, the world's largest semiconductor foundry that supplies global tech giants like AMD, Apple, Nvidia, and more.",
    "China recently cracked down on cryptocurrency mining as well, which could possibly improve GPU availability but could overall worsen the semiconductor shortages. The mandated shutdown is meant to choke out energy emissions and curb energy carrier prices, but directly suspending energy suppliers to manufacturing plants will absolutely hurt CPU and GPU production in the long run.",
    "Via PCGamesN"
  ],
  "headers": {
    "4": "Analysis: What’s causing the shortages?"
  },
  "links": {
    "Intel": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "CNBC": "https://www.cnbc.com/2021/10/21/intel-intc-earnings-q3-2021.html",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "While he’s weighed in": "https://www.techradar.com/news/even-intel-thinks-the-global-chip-shortage-could-last-years",
    "the semiconductor shortages": "https://www.techradar.com/news/intel-is-investing-billions-in-eu-semiconductor-foundries",
    "also agrees": "https://www.techradar.com/news/amd-ceo-lisa-su-warns-the-chip-shortage-wont-end-any-time-soon",
    "The general consensus": "https://www.techradar.com/news/even-intel-thinks-the-global-chip-shortage-could-last-years",
    "recently cracked down": "https://www.techradar.com/news/apple-intel-and-nvidia-suppliers-in-china-stop-production-over-power-shutdown-order",
    "PCGamesN": "https://www.pcgamesn.com/amd/chip-shortage-lisa-su-code-conference-2021"
  }
}