{
  "source": "https://www.techradar.com/news/overwatch-2-gameplay-livestream-coming-on-may-20",
  "title": "Overwatch 2 gameplay livestream coming on May 20",
  "category": "gaming",
  "updated": "2021-05-11T20:24:47Z",
  "author": "samuel-tolbert",
  "summary": "Tune in for revamped heroics",
  "article": [
    "Overwatch fans won't be waiting much longer to get a look at Overwatch 2 gameplay. Blizzard Entertainment announced today that on May 20, gameplay will be revealed with a two-hour livestream.",
    "This livestream will be focused on the changes coming to the PvP (player-versus-player) multiplayer experience in Overwatch 2. The press release notes that \"From new maps to major gameplay updates, we’re reinvigorating the core Overwatch experience.\"",
    "Blizzard Entertainment vice president and Overwatch game director Jeff Kaplan recently departed the company after several years. Stepping in as Overwatch game director is Aaron Keller. You can check out the first developer update from Keller in the video below, which also reiterates the details for the upcoming gameplay livestream.",
    "In addition to this upcoming livestream, Blizzard Entertainment will be holding an Reddit AMA (Ask Me Anything) on May 24, so if you have any burning questions for the developers, that'll be the place to submit them.",
    "Blizzard Entertainment's two big games, Overwatch 2 and Diablo 4, won't be launching in 2021, so the earliest we can expect to see either title release is in 2022. The developers at Blizzard Entertainment spoke earlier this year at BlizzConline 2021 about the design process for Overwatch 2 and making sure that the game lives up to fan expectations.",
    "More immediately, Blizzard Entertainment and Vicarious Visions are working on Diablo 2: Resurrected, which is slated to arrive at some point later in 2021. This remaster features cross-progression, new graphics, audio and maybe skateboards.",
    "Whenever Overwatch 2 arrives, it'll be available on PC, Xbox Series X, Xbox Series S, Xbox One, PS5 and PS4."
  ],
  "headers": {
    "4": "When will it arrive?"
  },
  "links": {
    "Overwatch 2": "https://www.techradar.com/news/overwatch-2-release-date-features-and-rumors",
    "recently departed": "https://www.techradar.com/news/jeff-kaplan-leaves-blizzard-entertainment-ahead-of-overwatch-2",
    "Reddit AMA": "https://www.reddit.com/r/Overwatch/",
    "won't be launching in 2021": "https://www.techradar.com/news/overwatch-2-and-diablo-4-release-dates-slip-beyond-2021",
    "spoke earlier this year": "https://www.techradar.com/news/overwatch-2-team-wants-the-game-to-be-a-worthy-successor-and-a-true-sequel",
    "maybe skateboards": "https://www.windowscentral.com/diablo-2-resurrected-remaster-cross-progression-maybe-skateboards",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}