{
  "source": "https://www.techradar.com/news/google-sites-now-lets-you-restore-specific-web-pages-from-version-history",
  "title": "Google Sites now lets you restore specific web pages from version history",
  "category": "computing",
  "updated": "2021-09-09T16:30:54Z",
  "author": "abigail-opiah",
  "summary": "Users no longer need to restore entire sites",
  "article": [
    "Following a new update to Google Sites, website owners can now restore a specific page from version history, rather than having to restore an entire site.",
    "This functionality comes as Google Sites embarks on a journey to try and make restoring, editing and republishing specific pages that may have changed by mistake or been deleted, easier for users.",
    "Part of the rollout has already commenced, with the full release scheduled to begin by September 21 2021.",
    "Google has made using its service easier in several departments, and there is no admin control for the new Google Sites feature.",
    "To browse a site's version history, Google Sites users will need permission to edit the site, and version history might only be available for some sites on the new Google Sites.",
    "In five steps, users can restore a specific page that might have changed or been deleted from a revision without needing to restore the whole site to that revision.",
    "The function is set to be available to all Google Workspace customers, as well as G Suite Basic and Business customers and users with personal Google accounts.",
    "It has been a busy year for Google Sites as its classic Sites website builder was made made defunct on September 1, 2021.",
    "Google also added in the function that allows users to restore a site that had been deleted within 30 days, by using the ‘restore site’ button. There is the option to delete any Google Site owned by the user too.",
    "In addition, Google also added a function that allows users to review the changes that have been made to a drafted website, since the last time it was published. This feature is offered to users in a side-by-side comparison format."
  ],
  "headers": {
    "3": "Google Sites restored"
  },
  "links": {
    "Google Sites": "https://www.techradar.com/reviews/new-google-sites",
    "made defunct": "https://www.techradar.com/news/google-sets-hard-deadline-for-classic-sites-migration"
  }
}