{
  "source": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
  "title": "Starfield: release date, trailers, exclusivity and everything you need to know",
  "category": "gaming",
  "updated": "2021-12-06T17:45:55Z",
  "author": "vic-hood",
  "summary": "Starfield sees Bethesda head to the final frontier",
  "article": [
    "Starfield, the long-awaited new IP from Bethesda Game Studios, is coming to Xbox PC in 2022 and it looks set to take us on an epic sci-fi adventure.",
    "Starfield details remain pretty thin on the ground at the moment but thanks to a few brief teaser trailers we do at least finally have some feel for what the game is going to be like. Bethesda's first new IP in 25 years, the single-player RPG will take players into the future and outer space allowing them, according to studio boss Todd Howard, to take part in an epic about “hope and humanity\" that he's described as being \"like Skyrim in space\".",
    "With its November 2022 release date, it's still a while before we'll get our hands on Starfield. Regardless of the wait, that hasn't stopped us from boarding the Starfield hype train with a first-class ticket. There's nothing more exciting than whetting your appetite for a new game by future-gazing (or star gazing in this case). So, in that spirit, we've searched the galaxy to bring you the latest news and rumors on Starfield. Here's everything you need to know.",
    "At E3 2021, Bethesda confirmed Starfield will release on November 11, 2022 – so quite a while to wait still. In an interview with the Washington Post, Todd Howard said the studio is \"confident in the date\".",
    "What's perhaps even more interesting is that it's now looking to be an Xbox / PC exclusive, with the trailer and Xbox spokespeople making no mention of a PS5 release. With Microsoft now owners of developer Bethesda, this could be indicative of the future of titles like The Elder Scrolls 6 and Fallout 5 going forward.",
    "The Endless Pursuit",
    "In this behind the scenes video Game Director Todd Howard, Studio Director Angela Browder and Art Director Matt Carofano discuss Bethesda's vision of the future with Starfield.",
    "Howard discusses \"step-out moments\" in the Fallout games, where a character emerges into a world that's been irrevocably changed by nuclear war, and cryptically says that Starfield will have “two step-out moments”. Carofano, meanwhile, reveals that Starfield will have a \"realistic science-based backing\" and calls it a \"more grounded game and grounded setting\" than the likes of Skyrim.",
    "The backstory",
    "In October 2021, Bethesda released a video giving an overview of Starfield's overall setting, known as 'The Settled Systems'.",
    "Narrated by Bethesda Game Studios Design Director Emil Pagliarulo, the video explains that Starfield will transport players to the Settled Systems in the year 2330. The Settled Systems are located in “a relatively small pocket of the Milky Way, in an area that extends outward from our Solar System for approximately 50 light-years.” It also gives some details on the game's two largest factions, the United Colonies and the Freestar Collective, who were engaged in a “bloody colony war” before the game begins but have developed an unsteady peace.",
    "Location teasers",
    "In August 2021, Bethesda revealed three brief videos which give an overview of cities that will feature in Starfield. The three locations are pretty distinct, comprising the metropolitan capital of the United Colonies, New Atlantis; the freedom-driven capital of the Freestar Collective, Akila; and the vice-drenched pleasure city, Neon.",
    "Each video (all below) gives a description of the locations and a look at some of the concept art, offering a good sense of the overall atmosphere you can expect.",
    "Teaser trailer",
    "The first proper Starfield trailer was revealed at E3 2021, showing off Bethesda's more realistic approach to sci-fi than the likes of Outer Worlds or No Man's Sky:",
    "We're shown a very NASA-like astronaut exploring the rocky surface of a Moon-like location, complete with a blue-sky atmosphere, preparing for take-off. We're shown drones, a cool mech-like buddy robot, and the promise of uncovering the \"key to unlocking everything.\"",
    "Into the Starfield",
    "E3 2021 also brought a more behind-the-scenes style video for Starfield called Into the Starfield. In this clip that's just under 2 minutes, Bethesda gives an overview of Starfield and what it's aiming to achieve with the game.",
    "Announcement teaser",
    "Other than that, we previously saw our first glimpse of the game during E3 2018 where we got little more than a title, a setting and a glimpse of an unnamed planet, a floating satellite or space station, and some sort of... glowing wormhole?",
    "Check out the teaser trailer below:",
    "Full mod support",
    "Bethesda Game Studios boss Todd Howard confirmed in a recent Reddit AMA that despite Starfield moving to an all new engine from the studio’s previous titles, it will offer the same deep mod support as previous titles from the developer.",
    "“Our plan is to have full mod support like our previous games. Our modding community has been with us for 20 years. We love what they do and hope to see more make a career out of it,” said Howard.",
    "Full character customization",
    "Starfield players will be able to customize their characters to an in-depth degree in Starfield. In a Reddit AMA, Todd Howard said he was “Really excited about what the team has done with character creation”, explaining that it includes “choosing background, skills, etc. You also can pick your pronoun (he, she, they) and we've recorded all the relevant dialogue to support that choice.”",
    "More in summer 2022",
    "We’re getting interesting Starfield tidbits at the moment but according to Todd Howard in a recent Reddit AMA, we can expect another proper Starfield update in summer 2022. “We prefer to just show it,” Howard said, “which should be next summer. We’re happy with the advancements we’ve been able to make, some of which you can see in the trailer shot in-game.”",
    "Composer confirmed",
    "Starfield’s composer has been confirmed as Inon Zur, the composer behind multiple games in the Fallout series, including 3, 4, 76 and New Vegas, as well as Dragon Age and Prince of Persia.",
    "On his website, Zur explains that he’s been on the “epic new musical journey” of creating music for Starfield “for the past several years”. Zur also expresses his “admiration and appreciation to the incomparable creative visionary Todd Howard, audio director extraordinaire Mark Lampert, and the entire BGS family”, not only for their “daring artistic ambition” but for “the honor of entrusting me with scoring their next groundbreaking RPG experience.”",
    "\"Skyrim in space\" and \"Han Solo simulator\"",
    "In an interview with the Washington Post, Todd Howard has described Starfield as being \"like Skyrim in space\", with the caveat that technological advancements since Skyrim's release will allow Starfield to be a much more robust experience.",
    "Bethesda Managing Director, Ashley Cheng, on the other hand, described the game as “the Han Solo simulator. Get in a ship, explore the galaxy, do fun stuff.\"",
    "“We struggled at first at finding ‘Starfield’s’ identity,“ Howard told the Washington Post. ”We knew the style of game we wanted. But there’s so much science fiction, we didn’t have this existing franchise feel. We had to create that from scratch. What do the spaceships look like? What’s the tech level? What do people believe? What year is it really set in?”",
    "The game, Howard revealed, is set 300 years in the future when \"man is living amongst the stars\".",
    "Coming to Xbox One in an unexpected way",
    "Starfield is set to be a big hit for Xbox Series X/S but Xbox One players won’t be totally left behind. In a post to the Xbox Wire blog, Microsoft says that it will be using its cloud streaming technology to serve up games that require the Xbox Series X/S’s power in order to deliver them to the ageing last-gen Xbox One.",
    "“You'll see many games this holiday, including Forza Horizon 5, which will boast DirectX ray-tracing on both Xbox Series X and S, and Battlefield 2042, which will run at 60fps while supporting 128 players on Xbox Series X/S.",
    "“Some games launching next year from our first party studios and partners, such as Starfield, Redfall, and Stalker 2 require the speed, performance, and technology of Xbox Series X/S.",
    "“We're excited to see developers realise their visions in ways that only next-gen hardware will allow them to do. For the millions of people who play on Xbox One consoles today, we are looking forward to sharing more about how we will bring many of these next-gen games, such as Microsoft Flight Simulator, to your console through Xbox Cloud Gaming, just like we do with mobile devices, tablets, and browsers.”",
    "‘Better’ without PS5?",
    "Bethesda’s executive producer Todd Howard has said that the company can create better games now that it’s developing exclusively for Xbox and PC.",
    "Speaking to The Telegraph, Howard said: “You don’t ever want to leave people out, right? But at the end of the day, your ability to focus and say, this is the game I want to make, these are the platforms I want to make it on, and being able to really lean in on those is going to make for a better product. By focusing on those platforms, you really get to lean in a lot on making it the best it can be for those systems“.",
    "Though PS5 players won’t have access to Starfield, Howard says Microsoft is working to get its games to more people than ever before.",
    "“...we’re big believers in all of the avenues that Xbox and Microsoft are doing to get games to more people,“ Howard explained. ”Whether that’s the integration with the PC, which is huge for us, the cloud streaming and all those things. So I think it’s about taking a long-term view. And our belief that those things are really fundamentally good. So we see it actually opening up more and more and more so that people’s ability to play our games - via GamePass and other things - their ability to play our games doesn’t go down. It goes up dramatically.",
    "“And I can say I’m proud to be part of Xbox. I think it’s great for the community of gamers.”",
    "Both third person and first person viewpoints are in Starfield Whether you like staring down the barrel of a gun, or at your player character's cool new space threads, Starfield will offer up both first and third person points of view for players to enjoy. \"First person for us is still our prime way of playing. So you can see the world and touch all those things,\" Todd Howard revealed in an interview with the Telegraph.",
    "There will be \"hardcore\" role playing elements If you've felt that previous Bethesda role playing games have dumbed down the RPG parts of the game in favor of action elements, rest assured that Starfield will not be scrimping on the stats and rolls. The game will have \"great character systems\" and the ability to choose your background, \"things that we used to do in games long ago,\" says director Todd Howard.",
    "NASA and Elon Musk's Space X offered inspiration Rather than the space opera histrionics of the likes of Star Wars or Star Trek, Bethesda is aiming for a more realistic approach with Starfield. While there will still be lasers and robots and cool things like that, the aesthetic of the game is based on imagining where the space program of today will be in 300 years time. In fact, the team at Bethesda had discussions with Elon Musk's Space X team to make sure it was getting the details right.",
    "Starfield will have alien races and multiple planets to explore It may be a more serious approach to space exploration than the likes of No Man's Sky or Mass Effect, but rest assured – there will be aliens to interact with. In quite what capacity, Bethesda isn't yet revealing. But with the news that the game will also feature Skyrim style cities and settlements across multiple planets, we're hoping that we'll run into a fair few alien habitats, too.",
    "Skipping PS5 Rumors that Starfield could skip the PS5 entirely, sourced by the Xbox Two Podcast, now are seemingly confirmed.",
    "Reported by KitGuru, Xbox Two Podcast host Rand Al Thor 19 stated: “I’ve been told, by very reliable people, that Starfield was 100% an Xbox exclusive. I’ve even made bets about it, and I don’t bet unless I know I’m willing to bet. So I’m really, really confident that Starfield is only releasing on Xbox when it does.”",
    "These rumors turned out to be correct, as Starfield was confirmed to be an Xbox console exclusive during the Xbox & Bethesda E3 2021 presentation. PC players shouldn't worry, though, as Starfield is landing on their platform, too.",
    "Starfield companion game \"unlikely\" While the wait for Starfield is undoubtedly a long one, it looks like we won't be getting any ancillary material for the game before its big release late next year.",
    "Talking to the Washington Post, Todd Howard stated that a companion game to Starfield (similar to the Fallout Shelter mobile game) is \"unlikely.\" However, Howard didn't rule out the possibility of a movie or TV show in future.",
    "Starfield’s map is going to be big thanks to procedural generation Bethesda’s Todd Howard has said that the map in Starfield will be “much larger” than anything seen in previous Bethesda games—yes, even Fallout 76.",
    "Speaking at the Develop: Brighton conference, Howard said that the game will use procedural generation, which is also used in No Man’s Sky, meaning that the game’s world will be built by a randomised algorithm as opposed to devs having to manually curate every area. According to Howard, procedural generation will allow the developers to increase the scale of the map overall.",
    "As exciting as all of this sounds, Howard also reiterated during the conference that “It’s going to be a while until people hear about it,” and that Bethesda won'r show previews until it’s a lot closer to launch and they can show off something substantial.",
    "A game engine overhaul Bethesda's Todd Howard has revealed that partnering with Microsoft has \"led to our largest engine overhaul since Oblivion, with all new technologies powering our first new IP in 25 years, Starfield, as well as The Elder Scrolls 6.“",
    "Speaking at the Develop: Brighton conference, Howard gave more information on the overhauled Creation Engine, saying it’s been “a significant overhaul,” adding that “It’s taken us longer than we would have liked, but it’s going to power everything we’re doing with Starfield and Elder Scrolls 6. When people see the results, they’ll hopefully be as happy as we are with what’s on the screen and also how we can go about making our games.”",
    "A Starfield 'leak'? There's a chance some 'leaked' images have given us a new look at Starfield. Four images have surfaced on Imgur (via GamesRadar) which are allegedly from the upcoming game.",
    "The images show a space ship, two instances of a third-person perspective of a character standing beside the ship in astronaut attire (with a stealth and stamina bar in the corner), and a sort of oxygen and carbon dioxide gauge which also appears in the corner of the third-person perspective images.",
    "Of course, there's been no confirmation that these images are actually from Starfield so we can't be sure what we're seeing is from the in-progress game. If they are real, though, which they certainly appear to be given the trailers we've now seen, it looks like Bethesda could be going a little more hard on the sci-fi than in previous space games like Mass Effect.",
    "Starfield is Bethesda's focus In an interview with IGN, Todd Howard revealed that fans will be waiting some time for The Elder Scrolls 6 as Bethesda is focusing on Starfield.",
    "\"We're creatives, and it's like, we have to make this game, and this is the time, and so Elder Scrolls 6 is going to have to wait a little bit,\" Howard said. \"And again, Elder Scrolls Online is doing so well, it's so vibrant, that this is the time [for Starfield], both for us creatively, and our audience.\"",
    "A whole new world Bethesda has reportedly been talking about making Starfield for years now.",
    "There have been rumors flying around about the game since Bethesda publisher Zenimax filed a trademark for the name as far back as 2013.",
    "Given how much mileage Bethesda has achieved out of its other tentpole IPs – Fallout and The Elder Scrolls, which have both seen various spin-off entries and MMO variants – it is presumably hoping to make Starfield a far-reaching franchise in the same vein.",
    "...and whole new systems The idea behind Starfield has been floating around as far back as 2004, and Howard has said it has the recognisable Bethesda DNA to it – so expect deep character customisation and open exploration. But also expect all new ideas entering into the mix – this won't just be Fallout or Skyrim in space. Speaking to Eurogamer, Howard stated \"[...] it has a lot of new systems we've been thinking about for a while that fit that kind of game really well.\" So don't be surprised if there's some sort of on-theme space flight element involved too.",
    "Bigger than ever before Both the Elder Scrolls and Fallout series have shared a similar character progression system and open-world backdrop, partially rooted in their sharing of the same gaming engine.",
    "While we haven't heard specifics on gameplay, Starfield looks set to follow in the same vein, albeit in a more galactic setting. But the final frontier could hold much larger potential for exploration, allowing players to travel across various planets and encounter unknown civilizations.",
    "There's a big gap in the market for sci-fi RPGs With the future of the space-opera RPG series Mass Effect looking uncertain, and the unfulfilled promise of the planet-hopping exploration game No Man's Sky, Starfield will be entering a gaming market hungry for a sci-fi RPG done right. With the proven success of Bethesda's other franchises, could the developer have the next Mass Effect up its sleeves?",
    "(Image credits: Bethesda)",
    "Keep checking back here for all the latest Starfield news"
  ],
  "headers": {},
  "links": {
    "Washington Post": "https://www.washingtonpost.com/video-games/2021/06/13/starfield-bethesda/",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Fallout 5": "https://www.techradar.com/news/fallout-5-release-date-trailer-news-gameplay",
    "confirmed": "https://www.techradar.com/news/modders-rejoice-starfield-will-be-just-as-moddable-as-skyrim",
    "Reddit AMA": "https://www.reddit.com/r/IAmA/comments/qr1f5c/hi_im_todd_howard_game_director_and_executive/",
    "website": "http://www.inonzur.com/news/starfield/",
    "says": "https://www.techradar.com/news/starfield-will-come-to-xbox-one-but-not-how-you-might-think",
    "said": "https://www.techradar.com/news/starfield-on-xbox-will-be-better-without-ps5-to-worry-about-says-bethesda",
    "Telegraph": "https://www.telegraph.co.uk/gaming/features/starfield-e3-2021-reveal-exclusive-todd-howard-spent-25-years/",
    "Xbox Two Podcast": "https://www.youtube.com/watch?v=X8qY8vpACyM&t=5650s",
    "KitGuru": "https://www.kitguru.net/gaming/mustafa-mahmoud/starfield-reportedly-targeting-2021-release-will-be-xbox-exclusive/",
    "confirmed to be an Xbox console exclusive": "https://www.techradar.com/news/starfield-gets-a-november-2022-release-date-and-isnt-coming-to-ps5",
    "Washington Post,": "https://www.washingtonpost.com/video-games/2021/06/13/starfield-bethesda/",
    "has said": "https://www.techradar.com/news/starfield-takes-a-lesson-from-no-mans-sky-as-bethesda-talks-procedural-generation",
    "Develop: Brighton conference": "https://www.youtube.com/watch?v=I9GA8lsH8ls&feature=emb_title",
    "revealed": "https://bethesda.net/en/article/4IwKWIj174Cb2QNTTtBAEb/todd-howard-on-joining-xbox",
    "Imgur": "https://imgur.com/a/GSWTkHn",
    "GamesRadar": "https://www.gamesradar.com/uk/starfield-leaked-images-may-give-us-our-first-look-at-bethesdas-space-rpg/?utm_content=buffera6625&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer_grtw",
    "IGN": "https://www.ign.com/articles/2019/06/04/todd-howard-talks-starfield-elder-scrolls-6-fallout-76-terminator-and-more-a-ign-unfiltered-43",
    "Mass Effect": "https://www.techradar.com/news/mass-effect-andromeda-review",
    "No Man's Sky": "https://www.techradar.com/news/no-mans-sky-hits-xbox-one-on-july-24-along-with-true-multiplayer"
  }
}