{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-04-09T14:36:15Z",
  "author": "axel-metz",
  "summary": "What's worth streaming this weekend",
  "article": [
    "Things are calming down a bit on the streaming front, aren’t they? We’ve had the four hour-long superhero reboot, the giant monster boxing match and most of this year’s Oscar contenders – so what’s left to keep us entertained this weekend, until Mortal Kombat lands in a couple of weeks?",
    "Quite a lot, as it turns out. The trusty trio of Netflix, Amazon Prime and HBO Max will see a slew of new movies and TV shows arrive in their respective libraries over the next few days, while the likes of Hulu and Shudder will also benefit from some fresh additions.",
    "Below, we round up seven of the biggest highlights coming to streaming services this weekend – from gripping true crime docs to sci-fi period dramas (yes, you read that right).",
    "The latest in a barrage of successful true crime documentaries to arrive on the streamer, This Is a Robbery: The World's Biggest Art Heist examines, well, the world’s biggest art heist – when $500m of art was stolen from a Boston museum in 1990.",
    "The four-part docu-series charts the plight of investigators attempting to recover the missing works, unmask the perpetrators and solve the as-yet-unsolved mystery. It’s also produced by the team behind The Irishman, which hopefully means we're in for plenty of real-life wisecracking.",
    "Now available to stream on Netflix",
    "This new Amazon anthology series centers around a Black family who move to an all-white Los Angeles neighborhood in the 1950s – where things, of course, are not what they seem.",
    "Alison Pill and Shahadi Wright Joseph (of Us fame) star in what's attempting to be a super creepy, super relevant examination of race in America. A second season is already planned for the show.",
    "Now available to stream on Amazon Prime Video",
    "In a world where supervillains are commonplace, two estranged childhood best friends reunite after one devises a treatment that gives them powers to protect their city.",
    "Thunder Force stars Melissa McCarthy, Octavia Spencer and, of course, Jason Bateman – because no Hollywood comedy movie would be complete without him. It looks as silly as you’d expect, but a clever blending of genres might make for some refreshingly light entertainment.",
    "Now available to stream on Netflix",
    "In this new HBO original series, Victorian England meets the MCU as a supernatural event grants certain people abnormal abilities – from the wondrous to the disturbing.",
    "The Nevers stars Eleanor Tomlinson, James Norton and Laura Donnelly, and looks primed to alleviate those post-Bridgerton withdrawal symptoms by pitting British high society against fire-wielding orphans. UK viewers can watch it on Sky and Now TV starting on May 17.",
    "Available to stream on HBO Max from Sunday",
    "AMC’s Fear the Walking Dead returns to conclude its sixth season this weekend. After being torn apart by Virginia and her Pioneers, the group is now dispersed across her far-reaching settlements.",
    "If you’ve never seen Fear the Walking Dead, it’s much like The Walking Dead – except with what looks like a lower budget. And if you have seen it, well, you know exactly what to expect.",
    "Available to stream on AMC+ in the US now, and available on AMC in the UK from Monday",
    "The Power arrives on Shudder to add to an already-stacked list of exclusives for the horror streamer. In 1970s London, trainee nurse Val (Rose Williams) is forced to work the night shift in a dark, near-empty hospital during a spate of electrical blackouts in the area.",
    "Naturally, a host of evil forces lurk within the walls of the infirmary, and Val spends 90 minutes sneaking, screaming and dreaming she’d chosen another profession.",
    "Now available to stream on Shudder",
    "Carefree Nyles (Andy Samberg) and reluctant maid of honor Sarah (Cristin Milioti) have a chance encounter at a Palm Springs wedding, but things get complicated when they find themselves unable to escape a cycle of re-living the day over and over again.",
    "Palm Springs was a big hit when it launched on Hulu last year, and after a criminally long and pointless wait, Amazon Prime Video UK subscribers can finally check it out this weekend. Expect heaps of Samberg-esque humor (à la Brooklyn Nine-Nine) and endless references to Groundhog Day.",
    "Now available to stream on Hulu and Amazon Prime Video UK."
  ],
  "headers": {
    "3": "This Is a Robbery: The World's Biggest Art Heist (Netflix)",
    "6": "Them (Amazon Prime Video)",
    "9": "Thunder Force (Netflix)",
    "12": "The Nevers (HBO Max)",
    "15": "Fear the Walking Dead Season 6B (AMC+)",
    "18": "The Power (Shudder)",
    "21": "Palm Springs (Amazon Prime Video UK)"
  },
  "links": {
    "superhero reboot": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "giant monster boxing match": "https://www.techradar.com/news/godzilla-vs-kong-ending-explained-who-won-the-monsterverse-fight",
    "Shudder": "https://www.techradar.com/best/best-shudder-movies",
    "Brooklyn Nine-Nine": "https://www.techradar.com/news/how-to-watch-brooklyn-nine-nine-stream-every-season-online-anywhere"
  }
}