{
  "source": "https://www.techradar.com/news/surface-go-3-leaked-spec-suggests-a-big-improvement-in-battery-life",
  "title": "Surface Go 3 leaked spec suggests a big improvement in battery life",
  "category": "computing",
  "updated": "2021-09-18T10:45:11Z",
  "author": "darren-allan",
  "summary": "Retailer spills the spec, and also pricing (but plenty of salt is required there)",
  "article": [
    "The Surface Go 3, the next-gen tablet which is purportedly set to be revealed early next week at Microsoft’s Surface press event – potentially among many other goodies – has had its spec leaked by a retailer from Thailand.",
    "Of course, we still need to be very skeptical about the details provided, but if this retailer has things right, then this is what we can expect the Surface Go 3 to be packing (as flagged up by German tech site WinFuture). Namely a choice of Intel Pentium Gold 6500Y or Intel Core i3-10100Y processors, with the pepping up of the CPU being one of the only major changes here.",
    "Otherwise, the display remains a 10.5-inch touchscreen with a 1920 x 1280 resolution, and the design of the Windows tablet remains identical to the existing Go 2 (with the same dimensions). There’ll supposedly be options of 4GB or 8GB for system RAM, and storage can be a tight 64GB eMMC drive, or a 128GB SSD, which again keeps things the same as with its predecessor.",
    "Similarly, the front and back cameras will carry over from last year’s Surface Go 2 (with 5-megapixel and 8-megapixel cameras respectively), but another area of improvement – at least if this leak is correct – will be the battery life, which will run to a (claimed) up to 13 hours.",
    "The device will come with Windows 11 Home installed in S mode. Pricing is mentioned here, too, but take massive heaps of salt with that. Apparently it’ll start at about 380 Euros (around $445, £325, AU$610), running up to 575 Euros (around $675, £490, AU$930) for the top-end model of the Go 3, but those conversions from Thai currency are of limited value and aren’t going to reflect what Microsoft will charge in other markets like the US (and they may well be placeholders, anyway).",
    "This isn’t a surprising leak in that it backs up what we’ve previously heard about the spec of the Surface Go 3 from the rumor mill. The main changes, then – if all this proves to be correct – include ramping up the CPUs in the tablet, with a Core i3 10th-gen chip being a solid step up from the Core m3-8100Y in the Surface Go 2. That said, WinFuture observes that we shouldn’t get too excited about the potential performance leap of the Go 3 going by previous Geekbench leaks.",
    "Otherwise, it’s more of the same for the Go 3 compared to its predecessor, although there’s one other element here to get excited about – the rumored 13-hour battery life for the new model.",
    "Again, if we compare that to the Surface Go 2, that offers up to 10 hours, so this would be a pretty impressive bump in longevity away from a power socket (presumably a bigger battery is being included with this next-gen tablet). Fingers crossed that comes to fruition, and that the claimed life translates well to real-life usage (which in fairness, it certainly did in our review of the Surface Go 2).",
    "Via MS Power User"
  ],
  "headers": {
    "5": "Analysis: Here’s hoping for that beefed-up battery"
  },
  "links": {
    "Surface Go 3": "https://www.techradar.com/reviews/microsoft-surface-go-3",
    "WinFuture": "https://winfuture.de/news,125261.html",
    "Windows tablet": "https://www.techradar.com/news/mobile-computing/tablets/windows-8-tablets-release-date-specs-and-prices-916134",
    "last year’s Surface Go 2": "https://www.techradar.com/news/microsoft-aims-to-take-on-apple-with-most-powerful-ever-surface-book-3-and-improved-surface-go-2",
    "spec of the Surface Go 3 from the rumor mill": "https://www.techradar.com/news/surface-go-3-leak-reveals-possible-specs-for-the-2-in-1-tablet-device",
    "review of the Surface Go 2": "https://www.techradar.com/reviews/microsoft-surface-go-2",
    "MS Power User": "https://mspoweruser.com/full-spec-of-surface-go-3-leaked-by-retailer/"
  }
}