{
  "source": "https://www.techradar.com/news/microsoft-plays-down-linkedin-china-closure",
  "title": "Microsoft plays down LinkedIn China closure",
  "category": "computing",
  "updated": "2021-10-18T10:18:26Z",
  "author": "sead-fadilpasic",
  "summary": "LinkedIn replaced with a purely jobs-focused offering",
  "article": [
    "LinkedIn has declared plans to keep operating in China, despite a planned shutdown of its main web offering.",
    "In an official statement, the Microsoft-owned site said that due to a “significantly more challenging operating environment” and “greater compliance requirements in China”, it is forced to turn off its global site in the country.",
    "In its place, it will instead run a site simply hosting job listing boards, and nothing else.",
    "However, more details have now come to light following after the company’s president for China, Lu Jian, took to social media to play down the importance of the change.",
    "“The reports of my death are greatly exaggerated,” The Financial Times cited Jian as saying. LinkedIn has made “strategic adjustments”, he said, which were needed to create new products. It would “fully use its international platform” to help business owners and workers find each other, and will continue helping Chinese firms “connect with global business opportunities”.",
    "“LinkedIn won’t cut its investment in China, it will increase it. We won’t cut employees and we definitely won’t leave the country,” he added.",
    "Following drop-outs by other rivals, LinkedIn had been one of the last Western social media networks left standing on the Chinese market.",
    "Analysts have said that Microsoft was forced to weigh between remaining operational in China, and adhering to its core values, and, in order to keep its brand image intact, tilted towards the latter.",
    "The US government has also commented on the move, the FT reported, saying Microsoft did well to scale back, adding that China forces companies to be “complicit in its repression and authoritarian practices”.",
    "At the moment, LinkedIn claims to have 54 million Chinese users, up from 51 million a year ago. It employs a total of 260 people, 40 of which joined the Beijing and Shanghai offices in the past four years.",
    "Via: The Financial Times"
  ],
  "headers": {
    "6": "China controversy"
  },
  "links": {
    "planned shutdown": "https://www.techradar.com/news/microsoft-shuts-down-linkedin-in-china",
    "The Financial Times": "https://www.ft.com/content/d5cc7987-9d41-44c3-a6bf-7947c03b9cf9"
  }
}