{
  "source": "https://www.techradar.com/news/dodge-joy-con-drift-with-these-black-friday-powera-switch-controller-deals",
  "title": "Dodge Joy-Con drift with these Black Friday PowerA Switch controller deals",
  "category": "gaming",
  "updated": "2021-11-26T18:43:15Z",
  "author": "josephine-watson",
  "summary": "No rumble, no cry",
  "article": [
    "Look away, Nintendo puritans, or risk being converted to the third-party agenda with some of Amazon's Black Friday Nintendo Switch deals on PowerA controllers.",
    "Whether it's the simple black wired controller for just $15.99, or something a little louder like this PowerA Enhanced wireless Waluigi controller for $36.99, PowerA has a huge selection currently on sale for Black Friday, with up to 36% off some models. (Not in the US? Scroll down for deals in your region).",
    "While there are a handful of Nintendo Switch Pro Controller Black Friday deals dotted around, even the lowest prices are still pretty eye-watering. Plus, all you really stand to lose versus first-party controllers are the rumble and NFC functionality for amiibo scanning.",
    "With Nintendo once more not budging far from its listing prices on its Joy-Con and Pro controllers, we'd recommend snapping up these deals before Cyber Monday.",
    "The Nintendo Switch is a fantastic console, but it's undeniable that it - and its accessories and games - aren't the most budget-friendly at times, so it's not the worst idea to cut corners where you can. If you can survive without some of the value-adding features on the Joy-Con and Pro controllers, PowerA controllers are the next best bet. Plus, they come in way more fun designs, in our opinion.",
    "No matter where you live, you'll find all the lowest prices for the best Nintendo Switch controllers from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Nintendo Switch Controller Black Friday deals",
    "5": "More Nintendo Switch game deals",
    "6": "More Black Friday deals"
  },
  "links": {
    "Black Friday Nintendo Switch deals": "https://www.techradar.com/black-friday/nintendo-switch-black-friday-deals",
    "for just $15.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07PDJ45BT%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4311905067286238000-20",
    "for $36.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08DRSNXFM%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6717504855014236000-20",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Nintendo Switch Pro Controller Black Friday deals": "https://www.techradar.com/deals/nintendo-switch-pro-controller-price-sales-cheap",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}