{
  "source": "https://www.techradar.com/news/splitgate-one-of-the-most-popular-games-on-steam-is-only-25-finished",
  "title": "Splitgate, one of the most popular games on Steam, is only 25% finished",
  "category": "gaming",
  "updated": "2021-09-18T18:00:37Z",
  "author": "nick-pino",
  "summary": "ANALYSIS: The game’s developers are just getting started – but how will it stack up against Halo Infinite?",
  "article": [
    "The story of Splitgate – an arena shooter that blends the best parts of Halo and Portal – has been an interesting one. After spending two years in Early Access with sometimes fewer than 1,000 concurrent players, the game has exploded onto Steam’s Top Free To Play games list in the last few weeks and now averages in the tens of thousands of players with some 10 million downloads in July alone.",
    "These numbers are a massive accomplishment for developer 1047 Games' team of 10 people – but, according to the team’s Co-founder and CEO Ian Proulx, it’s just getting started.",
    "Earlier this week in a series of interviews with TechCrunch and GamesBeat, Proulx talked about where the game’s heading, how far it’s already along and what the company is going to do with the $100 million it just got from investors.",
    "Here's what you can look forward to.",
    "While Splitgate borrows the seasonality of games like Apex Legends and Fortnite, it plays like a combination of Portal and Halo. You’ll find near-exact replicas of the weapons from Bungie’s famous first-person shooter scattered on the map (yes, there’s both a battle rifle and an extremely high-powered pistol) but to traverse the map you’ll use portals and a rocket pack-powered double jump.",
    "On its surface and in practice, the results are pretty spectacular.",
    "According to Proulx, though, those games weren’t the only inspirations for Splitgate. In the interview, Proulx describes taking the free-to-play model of games like Rocket League and wrapping it around Splitgate. Instead of offering better weapons and equipment overtime like Call of Duty, the only extras are cosmetic skins that don’t impact gameplay. It’s fair from day one – and it stays that way for the lifetime of the game.",
    "Free-to-play players can still earn the cosmetic gear by completing daily missions and ranking up in casual matches. You might not get that golden armor on day one, but the fact that it can be earned with enough matches is enticing enough to keep players coming back.",
    "Currently, the game is in its Season Zero. Some gamers have been playing since Early Access and have a bit of an advantage, but largely the droves of people coming in now are all starting around the same time with the same amount of experience.",
    "The game has more than a dozen maps counting its sterilized arena spaces that are just used for competitive matches, though you’ll probably play the same five or six of the most popular maps in casual play where everyone gets to vote on which map gets picked.",
    "All of that is pretty impressive considering that Splitgate only has about 10 full-time developers working on it. That’s all going to change when that $100 million gets invested.",
    "“The scope of what we can do is now through the roof,” said Proulx in the interview. “There’s so much we couldn’t think about because we were a tiny team with a tiny budget, but now everything is on the table. We’re focusing on the long term — I look at the game as being 25% done. We don’t need to be Fortnite tomorrow, but now it really is about building the next Riot Games, the next big games business.”",
    "According to Proulx's interview with GamesBeat's Dean Takahashi, some of that funding will be used to hire artists to produce skins, characters, and maps, as well as more game designers to create new modes for play.",
    "One of the most telling points of Proulx’s interview was when he narrowed in on why Splitgate is succeeding in a crowded market: “No one has moved the needle because there hasn’t been a lot of innovation, and there hasn’t been something that’s accessible to the masses. Quake Arena is great, but it’s extremely difficult. No 12-year-old Fortnite kid is gonna play it. We really do fill this void.”",
    "That's interesting insight – and explains how Proulx sees Splitgate fitting in with the current crop of first-person shooters – however this holiday season alone we’re going to see a ton of games that either sit in or adjacent to the arena shooter space that Splitgate occupies.",
    "One of the biggest of those games, Call of Duty: Vanguard, a WWII shooter, drops in early November and will come with updates for its free-to-play counterpart Warzone, which will be shortly followed by Halo Infinite that drops in early December. Both games offer a similar frenetic pace and high skill ceiling that fans largely love about Splitgate, but in a more familiar package.",
    "Further on the horizon, there’s Overwatch 2 – a hero shooter that has an incredible amount of hype behind it – Rainbow Six Extraction and Destiny 2’s next expansion, all of which only add to the deep pool of shooters available to play.",
    "How Splitgate grows and evolves to counter these games and make a name for itself will be interesting to watch – but with its newly earned financial backing, we’re hoping it will find a way to thrive amongst the genre’s battle-hardened staples."
  ],
  "headers": {
    "4": "Splitgate is basically Halo and Portal… and Rocket League",
    "8": "Season Zero is just the beginning (obviously)",
    "13": "But can it go toe-to-toe with Halo Infinite and Call of Duty Vanguard?"
  },
  "links": {
    "TechCrunch": "https://techcrunch.com/2021/09/14/1047-games-raises-100m-on-the-runaway-success-of-its-debut-title-splitgate/",
    "GamesBeat": "https://venturebeat.com/2021/09/14/1047-games-raises-100m-at-1-5b-valuation-after-13m-splitgate-downloads/",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Overwatch 2": "https://www.techradar.com/news/overwatch-2-release-date-features-and-rumors",
    "Rainbow Six Extraction": "https://www.techradar.com/news/rainbow-six-extraction"
  }
}