{
  "source": "https://www.techradar.com/news/what-is-amazon-kids-on-alexa-and-how-do-i-turn-it-on",
  "title": "What is Amazon Kids on Alexa, and how do I turn it on?",
  "category": "smart-home",
  "updated": "2021-07-31T08:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Switch on parental controls so your little ones can use an Amazon Echo unsupervised.",
  "article": [
    "The best smart speakers can be a handy tool for children - from helping them with their homework to letting them chat to family and friends and even listen to their favorite music and audiobooks.",
    "The inbuilt voice assistants are great for education and keeping the kids amused, but there’s a worry that kids could stumble on something inappropriate if left to their own devices with Amazon’s voice assistant.",
    "You can’t supervise them 24-7 so how can you strike the right balance between keeping them safe and letting them benefit from Alexa’s expertise?",
    "This is where Amazon Kids on Alexa comes in. The free-to-use service lets you restrict when Alexa can be accessed, the Alexa skills that can be used and even blocks explicit lyrics when listening to Amazon Music, Apple Music or Spotify.",
    "Initially launched in the US in September 2020, Amazon Kids on Alexa has now been made available in the UK as well.",
    "As we’ve already mentioned, Amazon Kids on Alexa is a free-to-use parental controls service that when switched on, lets you set time limits on when, and for how long the smart speaker can be used.",
    "It also allows pausing access to the device at any point - ideal if you want the kids to concentrate on eating dinner rather than interacting with a voice assistant.",
    "It comes built-in to the new Echo Dot Kids smart speaker, which is priced at $59.99 / £59.99 (around AU$80), and is available with either a tiger or panda theme. However if you have an existing Echo smart speaker in your home, including an Amazon Echo (2020), Amazon Echo Dot (2020) and even the Amazon Echo 1st generation, you can enable Amazon Kids on Alexa through the Alexa app.",
    "If your child has a subscription to Amazon Kids+, which offers unlimited access to child-friendly audiobooks, apps, games and tv shows, this can also now be used on any Amazon Echo smart speaker - although only content that’s audible rather than visual will be available.",
    "We spoke to Amazon and a representative confirmed that Amazon Kids on Alexa and Amazon Kids+ doesn’t work on Amazon’s line of smart displays, such as the Echo Show 5 (2nd generation) and the Echo Show 10. Amazon told TechRadar it wasn’t able to reveal if this will change in the future.",
    "Amazon Kids on Alexa offers more than just the ability to set use limits. When we activated Amazon Kids, we noticed Alexa’s tone softened and the language it used was more child-friendly.",
    "For example, when we asked Alexa to tell a joke when Amazon Kids was enabled, it responded with a joke that would “tickle your funny bone”.",
    "There were plenty of age-appropriate stories and jokes on offer, and Alexa was also able to provide spelling, definitions and even answer some mathematics questions for us when Amazon Kids on Alexa was switched on, although it can also do this in normal mode.",
    "Crucially however, voice purchasing was disabled by default - so no more remembering to toggle this option in the Alexa app when the kids are around.",
    "Amazon Kids on Alexa also does an effective job at preventing tracks with explicit lyrics being played. We requested a track loaded with swearing from Fatboy Slim album ‘We’ve Come A Long Way Baby’ and were impressed to find it wasn't possible.",
    "However, we were able to play plenty of explicit-language free friendly tracks from Kylie Minogue, Justin Timberlake and even some Disney records.",
    "Voice calling is enabled so children can use an Echo smart speaker to communicate with other Amazon smart speakers in the home or call their friend’s that have an Echo speaker (as long as their friend is assigned as an approved contact by you through the Alexa app)",
    "Finally using the Parent Dashboard, which can be accessed through the Alexa app or on Amazon’s website, we were able to restrict the apps and Alexa skills that could be used when Amazon Kids was enabled, so ensuring kids can’t mess with smart home gadgets or , as well as review the skills that had been used while Amazon Kids on Alexa was enabled.",
    "To switch on Amazon Kids on Alexa, open the Alexa app on your phone or table and select the 'Devices’ tab. Tap Echo & Alexa then select the devices you want to install the parental controls on.",
    "Choose the settings icon from the top right-hand corner and then select ‘Amazon Kids’ from the options displayed. Move the slider to the on position.",
    "From here you can add a profile for each child to your household, if they don’t already have any Amazon devices. As well as adding the name, and selecting an icon, you’ll also need to add their date of birth, so age-appropriate content and responses are given.",
    "If they ‘own’ (well, have control of) Amazon devices, the profile will show up automatically, so you just need to select it from the list given.",
    "Only one child can use an Echo with Amazon Kids enabled at a time, however you can easily switch the profiles in the Parent Dashboard.",
    "Once Amazon Kids is enabled in the Alexa app, you’ll still need to ask Alexa on the device itself to open Amazon Kids, otherwise it’ll behave as though there are no parental controls",
    "We also tried asking Alexa on the device to turn off Amazon Kids and revert back to normal mode, just in case any cheeky children thought they couldn’t circumnavigate the parental controls, but handily Alexa just says it can’t help and to ask a grown-up",
    "If you’re a grown-up and you want to revert your Amazon Echo smart speaker into its full, non-child friendly state, you’ll have to disable it in the app"
  ],
  "headers": {
    "5": "What is Amazon Kids on Alexa?",
    "18": "How do I turn on Amazon Kids on Alexa?"
  },
  "links": {
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Amazon Music": "https://www.techradar.com/reviews/amazon-music-hd",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Amazon Echo (2020)": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Amazon Echo Dot (2020)": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "smart displays": "https://www.techradar.com/best/best-smart-displays",
    "Echo Show 5 (2nd generation)": "https://www.techradar.com/reviews/amazon-echo-show-5-2nd-generation",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review"
  }
}