{
  "source": "https://www.techradar.com/news/how-technology-is-weaning-the-world-from-plastics",
  "title": "How technology is weaning the world from plastics",
  "category": "computing",
  "updated": "2021-05-04T11:06:33Z",
  "author": "gert-jan-gruter",
  "summary": "Sustainable solutions of the future",
  "article": [
    "Plastic is everywhere. It is convenient, versatile, and long-lasting. However, it also causes significant waste and pollution problems. In addition to waste building up in the environment, plastic also contributes to climate change, due to heavy dependence on fossil fuels and fossil-based feedstock.",
    "Every year, more than 400 million tons of plastic are produced worldwide, and packaging constitutes a third of this. COVID-19 has added to the problem, as disposable masks, personal protective equipment (PPE), and single-use products have been necessary to protect key workers and maintain hygiene. At the current rate we’re going, there will be more plastics in the sea than fish by 2050.",
    "Yet, the appetite for change is growing. Consumers, policymakers, and campaign groups are putting increasing pressure on the plastics industry and major brands to create and use sustainable alternatives. To enable a circular, environmentally friendly future, the chemicals industry needs to kick its oil habit for good and embrace new technologies to develop sustainable solutions.",
    "Many of the plastics we use today cause harm to the environment in a number of ways. Not only does it take a long time to degrade - and in many cases, it doesn’t at all - but also be unintentionally or not, trillions of pieces of plastic do inevitably end up in nature every year. This unfortunately leads to more and more harmful micro- and nanoplastic into our ecosystem.",
    "As more and more plastic waste is incinerated with energy recovery in the best cases (instead of landfilling), and as every kg of plastic incinerated gives on average 2.5 kg CO2, the total plastic CO2 footprint is close to 1 billion tons. This includes the emissions from the chemical processes to produce plastics, which are energy intensive. Petroleum, an active contributor to climate change, is the main feedstock for the production of plastics, constituting more than 99% of the 400 million annual tons produced.",
    "Technology is playing a key role in developing sustainable alternatives to fossil plastics. A lot of research and development has been conducted around using plant material as feedstock by using plant-based sugars (glucose), replacing the need to use fossil fuels. An example of this is polyethylene furanoate (PEF), a 100% plant-based, closed-loop recyclable and slow degradable plastic alternative. Aside from the environmental benefits, PEF has a range of performance properties that makes it a better component than PET for bottles, packaging, and textiles.",
    "With lower gas permeability towards carbon dioxide (CO2), oxygen (O2), and humidity, PEF can preserve the integrity and quality of the product within the packaging for longer periods of time, reducing food waste and extending functional shelf life. PEF is also stronger and has a better heat resistance and barrier properties, which enables thinner or light-weighted packaging solutions.",
    "Additionally, PEF’s designed end-of-life options do not include biodegradation, but the fact that PEF degrades within years in the environment is a feature we call fate-in-nature. An accelerated study on industrial compostability by OWS in Gent, Belgium has shown that PEF degrades to CO2, water, and biomass in 250-400 days at 58 degrees centigrade in soil. By comparison, PET is estimated to take between 300 to 500 years to break down.",
    "A multi-year field trial with the University of Amsterdam is also being conducted to explore how fast PEF biodegrades in natural conditions (the Netherlands). Initial observations show that degradation starts to occur within the first year when subject to weather and other environmental conditions. This does not occur during normal use of PEF and will only start to happen when PEF comes into contact with soil and the fungi and bacteria therein. his is important for materials that (unintendedly) end up in nature and avoids the endless accumulation over many decades and even centuries in the environment as is the case for PET.",
    "Performance properties are one of many key elements to creating a fully sustainable material. Alongside increasing regulation to ban single-use non-recyclable plastics, new innovations are emerging to ensure that plastics can be reused again and again until the end of its lifecycle. It is estimated by the Ellen MacArthur Foundation that at least 20% of plastic packaging can be replaced by reusable systems. Therefore, reusing plastic is closely linked to an overall reduction in plastic consumption. Simply said, reusing a plastic bottle 10 times reduces plastic consumption (and waste) by 90%.",
    "It is also crucial that technologies can create materials that can fit into existing recycling streams. One of the key challenges that recyclers face is contamination arising from poorly recyclable items that enter their facilities. This can make it difficult for products to be recycled. Polyethylene terephthalate (PET) is a common plastic component. It is widely used across bottles and packaging, among other applications, and is considered a champion by many when it comes to recyclability.",
    "However, despite this, PET applications often need other materials with better barrier to protect products that are particularly sensitive or need a longer shelf life – something which PET packaging cannot achieve on its own. The commonly used materials for this function, such as polyamides, which are mainly used for colored bottles, have poor recyclability.",
    "A great deal of work has been done to ensure PEF can be processed in existing recycling streams. With similar chemical properties to PET, both can even be recycled together. PEF is compatible with PET mechanical recycling assets, and when processed as part of the PET recycling stream, it has been proven that PEF has a much lower environmental impact than other barrier materials on haze and other properties of the resulting rPET material. More importantly, PEF products can also be recycled entirely by themselves in a closed-loop system, very similar to PET.",
    "It is important to remember that PEF is not always competing directly with PET. Applications for PEF will be ones that can benefit from the unique superior properties of PEF, such as high barrier films and specialty bottles. These applications are likely to be ones where PET or other polymers do not have the correct properties to be the material of choice, and where the use of PEF can offer simpler solutions made from a single material in competition with more expensive solutions such as multilayer bottles (non-recyclable) and aluminum or glass).",
    "However, once PEF production is at a larger scale, the cost of the material will reduce, so more applications will be able to make the most of PEF’s renewable and circularity-enabling characteristics.",
    "The problem isn’t plastic itself, but how it is made, used, and discarded. Plastics are unlikely to cease to exist, in fact during this time of the pandemic single-use plastics have been deemed wholly necessary due to hygiene reasons. However, through technological developments, and the desire for a greener world, we can pave the way for sustainable, circular solutions."
  ],
  "headers": {
    "3": "How technology fits into the plastics puzzle",
    "10": "Making new innovations work for existing processes",
    "13": "Not always in competition"
  },
  "links": {}
}