{
  "source": "https://www.techradar.com/news/samsung-galaxy-a32-5g-release-date-price-specs-and-5g-vs-4g-lte",
  "title": "Samsung Galaxy A32 5G release date, price, specs and 5G vs 4G LTE",
  "category": "phones",
  "updated": "2021-04-16T23:39:12Z",
  "author": "michael-hicks",
  "summary": "Is 5G worth a specs downgrade? We'll help you decide",
  "article": [
    "The Samsung Galaxy A32 5G is tailor-made for buyers looking for a cheap phone with decent specs. But Samsung also released several other budget AX2s in early April like the A02, A12, A32 4G and A42 5G.",
    "With so many incremental upgrades to choose from, the A32 5G or 4G will hit that sweet spot with surprisingly decent specs for a price most consumers can afford.",
    "For bargain-hunting Samsung fans who don't want to consider a mid-range option like the Galaxy A72 or a discounted Galaxy S21, the Galaxy A32 5G may be the next best thing. Here's everything you need to know about this handset, including performance, cameras, and whether or not you should get the 5G version.",
    "The Samsung Galaxy A32 5G went on sale April 9, 2021 for $279 (around £200 / AU$365). You can also buy a non-5G version of the A32 for $269 (around £195 / AU$347).",
    "You can't buy an unlocked version; at present, the A32 5G is only available for T-Mobile, Sprint, or Cricket. T-Mobile currently has an offer where you can trade in your current mobile phone to receive a free Galaxy A32 5G, plus a free upgrade to 5G service.",
    "The Samsung Galaxy A32 design is about what you'd expect for a budget phone. It's sized at 6.5 x 3 x 0.36 in (164.2 x 76.1 x 9.1 mm) and weighs 7.2oz/ 205 g, with fairly thick bezels and a plastic back with Gorilla Glass protection. It may feel a bit wide and clunky in your hand compared to a curved phone.",
    "The designers also included a side-mounted fingerprint sensor, a microSD card slot, and a 3.5mm headphone jack.",
    "As for the display, you won't see the OLED panel you're probably used to with most modern phones. The Galaxy A32 has a 6.5-inch LCD panel with a 60Hz refresh rate and HD (720 x 1600) pixel resolution. Expect a display that's more functional than beautiful.",
    "Galaxy A32 5G photographers will have access to a 48MP main shooter, with 8MP ultra-wide, 5MP macro, 2MP depth, and 13MP selfie cameras. For comparison, the A12 only has a 16MP main camera, while you need to upgrade to the A52 to get a 64MP main shooter.",
    "The cameras themselves stick out slightly from the phone, with no camera bump to protect them from damage. It's certainly a phone that could use a protective case.",
    "For your all-day photography sessions, you'll need long-lasting battery life. Thankfully, the Galaxy A32 5G battery has a 5,000mAh capacity, giving you plenty of energy for a full day of work or play.",
    "Don't expect a Snapdragon in this price range. The Galaxy A32 5G sports a MediaTek Dimensity 720 5G chipset, one of the more lightweight processors to support 5G connectivity.",
    "The A32 5G will come with Android 11 preinstalled, specifically Samsung's Android skin One UI 3.0. It won't run as fast as the S21 series, but it should get consistent security updates for the next few years.",
    "Do you really want a cheap 5G phone, or do you just want the best bang for your buck? For the best value, the Galaxy A32 4G offers a significant upgrade at a similar price. In fact, it's fair to guess that Samsung downgraded the Galaxy A32 5G in most areas just to add 5G support.",
    "The 6.45-inch display ups the refresh rate from 60Hz to 90Hz, the resolution from 720p to 1080p, and the pixels per inch from about 270 to over 400. Perhaps most importantly, it used an OLED screen instead of an LCD screen.",
    "It comes with double the default storage capacity (128GB vs. 64GB) and ships with One UI 3.1 installed instead of 3.0. Also, the 4G model has two key camera upgrades: its main camera has 64MP vs. 48MP, while its selfie camera has 20MP vs. 13MP.",
    "The main perk for the 5G model is the MediaTek 720 5G chip, which generally performs better in benchmark tests than the 4G model's MediaTek Helio G80."
  ],
  "headers": {
    "3": "Samsung Galaxy A32 5G release date, price and carriers",
    "5": "Design and display",
    "8": "Cameras and battery life",
    "11": "Performance and software",
    "13": "Samsung Galaxy A32 5G vs 4G LTE"
  },
  "links": {
    "cheap phone": "https://www.techradar.com/best/best-cheap-phones",
    "released": "https://www.techradar.com/news/samsung-a52-5g-headlines-lineup-of-galaxy-phones-released-in-us",
    "Galaxy A72": "https://www.techradar.com/news/samsung-galaxy-a72",
    "discounted Galaxy S21": "https://www.techradar.com/deals/best-samsung-galaxy-s21-deals",
    "free Galaxy A32 5G": "https://www.t-mobile.com/news/un-carrier/t-mobiles-next-un-carrier-move-5gforall",
    "Android 11": "https://www.techradar.com/news/android-11",
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "upgrade": "https://www.techradar.com/news/samsung-galaxy-a32-4g-announced-and-it-might-be-better-than-the-5g-version"
  }
}