{
  "source": "https://www.techradar.com/news/computex-goes-online-only-for-the-second-year-running-here-are-the-dates",
  "title": "Computex goes online-only for the second year running – here are the dates",
  "category": "computing",
  "updated": "2021-03-31T17:51:27Z",
  "author": "carly-page",
  "summary": "TAITRA has cancelled the show's onsite exhibition",
  "article": [
    "The Taiwan External Trade Development Council (TAITRA) has confirmed that Computex 2021 will be fully-virtual, with the show’s onsite exhibition cancelled.",
    "This is the second time Computex’s in-person trade show has fallen victim to the Covid-19 pandemic. TAITRA said in its statement announcing the cancellation that “with another wave of coronavirus pandemic across the world, it doesn't look like we are close to the end.",
    "“The majority of the show's stakeholders, including international exhibitors, visitors, and media, cannot join the show due to border control,” the statement continued. “Therefore, the organizers of Computex have decided to cancel the onsite exhibition this year.”",
    "The decision comes much earlier than TAITRA’s response to the pandemic last year. It originally said it would push Computex 2020 from June to September, and didn’t officially cancel the event until mid-June.",
    "Computex 2021 was also set to be one of the first in-person tech events to be held in 2021. Back in December, TAITRA announced that the show would return in December 2020, suggesting that for those not able attend in person, it would take the form of an online-merge-offline exhibition model",
    "While the physical show has been called off, TAITRA said that its virtual showcase - Computex Virtual - will go ahead as planned. This will run from May 31 until June 30, and will enable “tech and startup communities [to] explore digital business opportunities”.",
    "What’s more, the physical show’s cancellation unlikely means we’ll be missing out on any announcements. Major hardware vendors such as Asus and MSI typically hold their own launch events before Computex kicks off, so these will likely go ahead as planned, albeit virtually.",
    "Computex 2021’s cancellation is another reminder that things haven’t quite returned to normal. However, the organisers of Mobile World Congress (MWC) seems to think events will be back up and running later this year, having announced that MWC 2021 will take place in Barcelona in June.",
    "However, a number of big name firms have been quick to pull out of the conference, including Nokia, Facebook, Ericsson and Sony."
  ],
  "headers": {},
  "links": {
    "statement": "https://www.computextaipei.com.tw/en/news/A191849245001468/info.html",
    "didn’t officially cancel the event until mid-June": "https://www.techradar.com/news/computex-2020-is-officially-canceled-due-to-covid-19",
    "having announced that MWC 2021 will take place in Barcelona in June": "https://www.techradar.com/news/mwc-2021-the-worlds-biggest-phone-show-will-go-ahead-in-june-heres-how"
  }
}