{
  "source": "https://www.techradar.com/news/oneplus-nord-2-renders-show-an-all-screen-design-with-tiny-bezels",
  "title": "OnePlus Nord 2 renders show an all-screen design with tiny bezels",
  "category": "phones",
  "updated": "2021-07-14T10:47:03Z",
  "author": "james-rogerson",
  "summary": "No more surprises",
  "article": [
    "The OnePlus Nord 2 is being officially unveiled on July 22, but given how close that is, there have been surprisingly few leaked images of the phone. Now, though, we’ve at least had another look at the likely design of the handset, thanks to some renders.",
    "Shared by 91Mobiles and coming from leaker Ishan Agarwal, we assume these are unofficial, rather than being leaked marketing material, but the source hasn’t specified. In any case, they show off the apparent front of the OnePlus Nord 2, complete with absolutely tiny bezels at the top and sides of the screen.",
    "The bezel at the bottom is a little bigger, but still fairly slim, and you can also see that there’s a single-lens punch-hole camera in the top left corner of the display, a volume rocker on the left edge, and a power button along with what’s likely an alert slider on the right edge.",
    "Sadly, we don’t see the back of the OnePlus Nord 2, but renders showing both the front and back have previously leaked, and they match up with the front design shown here.",
    "As for the specs, there’s nothing new here, but OnePlus itself has already confirmed that the Nord 2 has a 6.43-inch AMOLED display with a 90Hz refresh rate, and is powered by a MediaTek Dimensity 1200-AI chipset.",
    "Leaks meanwhile have filled in most of the gaps, suggesting that the OnePlus Nord 2 has a triple-lens camera, with a 50MP main, 8MP or 16MP ultra-wide, and 2MP black and white camera. We’ve also heard that the OnePlus Nord 2 might have a 4,500mAh battery, a choice of 8GB or 12GB of RAM, and 128GB or 256GB of storage.",
    "So if all of this pans out then there might not be much left to reveal on July 22, but one thing we’re still not at all sure of is the price, so that will be interesting to learn if nothing else."
  ],
  "headers": {},
  "links": {
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "91Mobiles": "https://www.91mobiles.com/hub/oneplus-nord-2-5g-front-render-exclusive/",
    "have previously leaked": "https://www.techradar.com/news/oneplus-nord-2-leaked-renders-look-a-lot-like-the-oneplus-9-pro",
    "already confirmed": "https://www.techradar.com/news/oneplus-nord-2-screen-specs-confirmed-but-dont-expect-huge-changes",
    "powered by a MediaTek Dimensity 1200-AI chipset": "https://www.techradar.com/news/oneplus-nord-2-is-real-company-confirms-in-a-surprise-announcement",
    "a triple-lens camera": "https://www.techradar.com/news/oneplus-nord-2-might-be-a-realme-phone-in-all-but-name",
    "also heard": "https://www.techradar.com/news/oneplus-nord-2-could-fix-its-predecessors-biggest-weaknesses"
  }
}