{
  "source": "https://www.techradar.com/news/your-withings-smart-scale-can-now-tell-you-the-age-of-your-heart",
  "title": "Your Withings smart scale can now tell you the 'age' of your heart",
  "category": "fitness",
  "updated": "2021-05-05T09:42:43Z",
  "author": "cat-ellis",
  "summary": "Withings Body Cardio gives you more insight into your health",
  "article": [
    "The Withings Body Cardio smart scale can now measure your 'vascular age', giving you an insight into the health of your arteries and heart. The firmware update is rolling out now, making it easier to monitor your cardiovascular wellbeing.",
    "Most smart scales measure your weight and body composition using bioelectrical impedance, and send this data to a mobile app on your phone via either Wi-Fi or Bluetooth. The scale sends a very small current through your body and measures the resistance as it passes through different tissue types. They then use algorithms to estimate the mass of bone, fat, muscle and water in your body.",
    "The Withings Body Cardio scale goes a step further, also measuring heart rate and pulse wave velocity when you step onto the platform. Pulse wave velocity is an indication of how flexible your arteries are. Stiffer arteries suggest higher blood pressure, and poorer cardiac health.",
    "The new vascular age metric is based on pulse wave velocity, but puts this data into a more accessible format, using it to estimate the 'age' of your heart. Step onto the scale and you'll see a simple 'optimum', 'normal' or 'not normal' rating on its display, and within the app.",
    "The Withings Body Cardio is one of the most expensive smart scales on the market, with a retail price of $149.95 / £108.29 / AU$249, but when we tested it we were impressed by the depth of data available in its companion app, which also provides tips you can use to help improve your health.",
    "This firmware update makes this data even more accessible, putting the cardiovascular health measurement into simple terms that are easier to understand rather than giving raw numbers.",
    "It won't be for everyone (if you need a budget smart scale then the simpler Eufy Smart Scale C1 or FitTrack Dara will fit the bill better), but if you're interested in more than just weight loss this new feature makes the Withings Body Cardio easy to recommend."
  ],
  "headers": {
    "4": "Finger (or toe) on the pulse"
  },
  "links": {
    "Withings Body Cardio": "https://www.techradar.com/reviews/withings-body-cardio",
    "smart scale": "https://www.techradar.com/best/best-smart-scales",
    "Eufy Smart Scale C1": "https://www.techradar.com/reviews/eufy-smart-scale-c1",
    "FitTrack Dara": "https://www.techradar.com/reviews/fittrack-dara"
  }
}