{
  "source": "https://www.techradar.com/news/the-future-games-show-returns-for-e3-2021-heres-how-to-watch",
  "title": "The Future Games Show returns for E3 2021 - here's how to watch",
  "category": "gaming",
  "updated": "2021-06-03T13:00:02Z",
  "author": "vic-hood",
  "summary": "The Future Games Show Summer Showcase airs on June 13",
  "article": [
    "GamesRadar+'s Future Games Show is back! This time with a special E3 2021 Summer Showcase, promising new trailers, announcements and unseen games.",
    "Hosted by The Last of Us 2's Troy Baker and Laura Bailey, The Future Games Show Powered by WD_BLACK, is set to reach its widest audience yet as an official partner of E3 2021 and The /twitchgaming gathering. The show will be packed with over 40 games across all major console and PC platforms, from publishers including SEGA, Private Division, Team17, XSEED Games and more. You don't want to miss it.",
    "The Future Games Show will take place straight after the PC Gamer Presents PC Gaming Show Powered by Intel with MechWarrior 5: Mercenaries. The PC Gaming Show will see Sean “Day9\" Plott, Frankie Ward and Mica Burton hosting E3's biggest celebration of PC games to date, with 39 new trailers, game announcements, and interviews beamed to audiences around the world.",
    "The Future Games Show Summer Showcase is the second Future Games Show event of 2021, with future events scheduled for August and November. The Future Games Shows have so far enjoyed over 45 million views.",
    "“GamesRadar is thrilled to bring the Future Games Show to its widest audience yet as an official partner of E3 2021 and the /twitchgaming gathering,\" Daniel Dawkins, content director of games and film at GamesRadar said. \"Our event will complete a packed day of gaming reveals on June 13, including the Xbox E3 2021 showcase and our sister broadcast PC Gamer’s The PC Gaming Show. Our amazing hosts Troy Baker and Laura Bailey look forward to sharing some of the most exciting, quirky and anticipated games of 2021 and beyond; followed by unrivalled post-show coverage and deep-dives on gamesradar.com.\"",
    "The Future Games Show takes place on June 13 at 4pm PDT / 7pm EDT /12am* Midnight BST (or June 14 at 9am AEST). You can catch all the action live on Twitch, Facebook, YouTube, Twitter and GamesRadar.",
    "To stay up to date with news from our friends at GamesRadar+ follow them on Twitter or Facebook or visit the website."
  ],
  "headers": {
    "5": "How to watch the Future Games Show"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "The /twitchgaming gathering": "https://blog.twitch.tv/en/2021/05/26/introducing-the-twitchgaming-gathering/",
    "gamesradar.com": "https://www.gamesradar.com/",
    "Twitch": "https://www.twitch.tv/gamesradar",
    "Facebook": "https://www.facebook.com/gamesradarplus/",
    "YouTube": "https://www.youtube.com/user/GamesRadar",
    "Twitter": "https://twitter.com/GamesRadar",
    "GamesRadar": "https://www.gamesradar.com/uk/",
    "website": "https://www.gamesradar.com/uk/"
  }
}