{
  "source": "https://www.techradar.com/news/bowers-and-wilkins-launches-its-first-wireless-earbuds-to-rival-the-sony-wf-1000xm3",
  "title": "Bowers & Wilkins launches its first wireless earbuds to rival the Sony WF-1000XM3",
  "category": "audio-visual",
  "updated": "2021-04-21T08:01:27Z",
  "author": "olivia-tambini",
  "summary": "Are they worth the wait?",
  "article": [
    "Heritage audio brand Bowers & Wilkins has finally launched its first pairs of true wireless earbuds, having previously avoided the form factor due to concerns that it trades sound quality for wireless convenience.",
    "After an “extensive period of development”, the company has unleashed the PI7 and PI5 true wireless earbuds, which it says will offer “all the sound quality that music lovers have come to expect from a Bowers & Wilkins product”.",
    "The flagship earbuds are the PI7, which come with Qualcomm aptX Adaptive support, allowing for hi-res audio playback from streaming services like Tidal and Qobuz. That’s backed up by 24-bit/48kHz wireless transmission between each earbud, which should pave the way for stable, high fidelity sound from your phone right to your ears.",
    "According to Bowers & Wilkins, the PI7 boast audio specs that are similar to an “advanced” convention loudspeaker. Each bud comes with a 9.2mm drive unit, which are combined with a high-frequency balanced armature driver – and each of these are actively driven by their own amplifiers. The company says that this ensures “exception control, superlative dynamics, and deep, accurate bass”.",
    "To compete with the likes of the Sony WF-1000XM3 and the Apple AirPods Pro, the PI7 come with adaptive noise cancellation, allowing the buds to monitor your surroundings and block out environmental noise accordingly. It works using three microphones in each earbuds, which Bowers & Wilkins says also allow for “crystal clear” sound quality during phone calls.",
    "The PI7 also come with a rather unique feature that should make long haul traveling a little easier to deal with. Its accompanying charging case can be connected to an external audio source, like an inflight entertainment system, by 3.5mm or USB cable, and then wireless transmit that audio to the earbuds. Pretty cool, if you ask us.",
    "Joining the PI7 are the PI5, which come with a single 9.2mm driver unit in each earbud. Support for aptX means you’ll get \"CD-quality\" playback from these buds, while the ability to adjust the noise cancellation manually means you have control over how much environmental sound passes through to your ears – that includes an ambient passthrough mode for when you need to be aware of your surroundings. Instead of three microphones like the PI7, you’ll find two in each bud, which Bowers & Wilkins says will still deliver “high quality” phone calls.",
    "Both the PI7 and PI5 earbuds can be configured with the Bowers & Wilkins app, and come with a single captive button on their outer housings, which allows you to adjust your music playback and summon your device’s voice assistant.",
    "Multipoint pairing should make it easy to switch between devices, so you can quickly swap between listening to music on your laptop and your phone. Both models support wireless charging, but the onboard battery life leaves a little to be desired.",
    "The PI7 will last for four hours before needing to be recharged, while the PI5 can go for slightly longer at four-and-a-half hours – much less than many wireless earbuds on the market today. Saying that, both models’ charging cases provide an additional four full recharges, so you should get nearly a full day’s worth of playback from either of the two true wireless earbud models.",
    "Available from April 21, the PI7 will cost $399 / £349 / AU$599.95, while the PI5 will set you back $249 / £199 / AU$399.95, with both available in white or charcoal colors. The PI7 in particular are pretty expensive – after all, the best true wireless earbuds of 2021, the Sony WF-1000XM3, cost $230 / £220 / AU$399.",
    "While the specs certainly sound impressive (particularly that inflight audio transmission feature), that low battery life is a bit concerning. In any case, we can’t wait to test the first Bowers & Wilkins true wireless earbuds to see if they were truly worth the wait."
  ],
  "headers": {
    "6": "Worth the wait?"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}