{
  "source": "https://www.techradar.com/news/kia-ev6-first-drive",
  "title": "We drive the Kia EV6, 'one of the most important cars' in Kia's history",
  "category": "car-tech",
  "updated": "2021-10-14T09:56:35Z",
  "author": "john-mccann",
  "summary": "A positive first impression",
  "article": [
    "The Kia EV6 is \"one of the most important cars\" in the South Korean firm's history. No pressure then, EV6.",
    "Luckily for Kia, the early signs are positive as the fully-electric EV6 has a striking design, a host of features, and suitable range to be a contender in the crossover SUV market.",
    "Prices start at £40,945 (around $55,000 / AU$75,000), which pitches it against EVs such as the Mercedes EQA and Hyundai Ioniq 5, the latter of which has a lot in common with the EV6.",
    "The Ioniq 5 and EV6 are based on the same platform, with Hyundai the parent company of Kia, but there are enough distinctions between the two that allow them to stand apart on their own.",
    "While the Ioniq 5 aims for all round practicality, Kia has focused the EV6 more on dynamic driving - it wants the car to be a bit more fun and engaging.",
    "That's why there's the EV6 GT, with a 0-62mph time of 3.5 seconds, although it's not available until 2022.",
    "I instead managed to get behind the wheel of both the entry-level Kia EV6 Air and the Kia EV6 GT-Line for a couple of days in Spain to find out if Kia gets this extremely important car right.",
    "The EV6 has a striking, sporty aesthetic with a sweeping roofline, the firm's 'tiger nose grille' design, and ducktail rear giving it a unique look.",
    "I certainly like the look of it, although I'm not completely sold on the rear styling - I am a fan of how the charging port is encompassed by the rear lights, keeping the sides sleek and fuss-free.",
    "Inside, the sporty aesthetic continues with dark tones and an attractive textured dash which is available in a few different patterns.",
    "The main attraction however, is a pair of 12.3-inch displays, housed behind a singular piece of curved glass. They're bright, clear and easy to read.",
    "Kia's infotainment interface is functional, but it's not the slickest or quickest I've used. The built-in sat nav also doesn't shine, with some directions - especially around junctions - not particularly clear, which resulted in some last minute maneuvers and lane changes.",
    "There is support for Android Auto and Apple CarPlay though, which means you can use apps such as Google Maps and Apple Maps for navigation instead.",
    "Sadly, the support is for a wired connection, rather than wireless, so you’ll need to plug your handset into the EV6 via the USB-A port at the base of the dashboard for this to work.",
    "There are a further two USB-C ports available to front seat passengers, plus a wireless charging pad and a 12v socket, providing lots of charging options.",
    "Like the Hyundai Ioniq 5, the EV6 also features a transitional power outlet below the rear seats, allowing you to charge laptops and similar devices.",
    "Passengers in the back also get access to USB-C ports, with one mounted on the side of each of the front seats. It's an usual placement, but one that works nicely as you're not having to scrabble around in the footwell to find the ports.",
    "Something I do like is the dynamic menu bar which sits below the main display. It's actually a slender, horizontal touch display which can adapt the options it shows depending on the situation.",
    "It has two core settings - climate controls and infotainment shortcuts - which you can switch between via a touch sensitive button towards one end of the bar. Although these controls are digital rather than physical buttons, they are responsive and easy to use.",
    "However, one small annoyance is the placement of controls for the heated and cooled seats and heated steering wheel. They lie on the top edge of the central console, which doesn’t sit all that far from the dash.",
    "I found myself resting my hand on the center console while adjusting the climate or selecting an infotainment shortcut, and accidentally triggering one of seat or wheel options with the side of my hand.",
    "It happened more than once, and my co-driver also experienced the same, so Kia may want to rethink the sensitivity or location of these controls.",
    "Another nice inclusion in the sizable HUD (heads-up display), which beams important information onto the windshield and into your eye line, allowing you to check things such as the current speed limit, your speed or the next navigation direction without taking eyes off the road.",
    "It also alerts you if there’s a car in your blind spot, and applies augmented reality (AR) with arrows appearing on the road telling you to change lane or keep in your current lane depending on the navigation.",
    "I spent time driving the entry-level, rear-wheel drive (RWD) EV6 Air with a range of up to 528km (328 miles) WLTP and the middle of the range, all-wheel drive (AWD) EV6 GT Line with a 506km (314 miles) WLTP range.",
    "There wasn’t a huge difference between the two, but you do notice the improved performance from the GT Line, with quicker acceleration and slightly nimbler handling, although the entry-level model still handles well.",
    "You get enough power underfoot to easily get away from junctions and overtake on highways, but the EV6 doesn’t go as far as to give you sports car experience - remember this is still a crossover SUV at the end of the day.",
    "The seats are comfortable and the ride is smooth and quiet enough. Electric cars are being given their own sounds in the absence of the roar of an internal combustion engine, and the hum from the EV6 is pleasing to the ear.",
    "It’s not too loud, not too aggressive and it’s not trying to mimic the sound of a V8, it’s just a smooth tone that gives you audible feedback when you put your foot down.",
    "Range appears to be strong too, with over 250 miles comfortably achievable with a range of driving scenarios using Eco, Normal and Sport modes.",
    "On one trip I traveled 110km on a mix of high speed and city roads in the RWD EV6 Air, and the battery dropped from 98% to 72% which equates to roughly 440km (270 miles) of total range.",
    "While that's a little way off the quoted 528km, it did involve a decent amount of high speed running in Sport mode, which will always drain the battery quicker.",
    "With more conservative driving, you should be able to get closer to the quoted range.",
    "The Kia EV6 is a great looking electric car inside and out, its range is what you'd expect for a crossover SUV and it’s enough to avoid anxiety in most circumstances, and there's a wide range of technology to keep you safe, make driving easier and ensure your devices are fully charged.",
    "I need more time with the EV6 to see what the infotainment and various controls are like after extended usage, if the 10%-80% charge in 18 minutes is possible, and to discover just how close you can get to the quoted range figures. Look out for our full Kia EV6 review in the coming months."
  ],
  "headers": {
    "7": "Striking and sporty",
    "17": "Being dynamic",
    "24": "Ride and drive",
    "33": "Early impressions"
  },
  "links": {
    "Mercedes EQA": "https://www.techradar.com/news/mercedes-benz-eqa-review-mercs-affordable-ev-gets-almost-everything-right",
    "Hyundai Ioniq 5": "https://www.techradar.com/news/hyundai-ioniq-5-review"
  }
}