{
  "source": "https://www.techradar.com/news/whatsapp-is-making-it-easier-to-move-from-ios-to-android",
  "title": "WhatsApp is making it easier to move from iOS to Android",
  "category": "computing",
  "updated": "2021-07-29T11:04:40Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Taking your group chats with you",
  "article": [
    "WhatsApp is looking to simplify the process of moving from an iPhone to an Android phone. A feature that's in the works will make it possible to backup chats on one platform and then restore them on another.",
    "Taking the decision to switch allegiances can be a tough one, particularly when it comes to mobile platforms. You may have committed to taking the plunge, switching from iOS to Android, but there are major considerations - not least of which is making sure that you have all of the apps and data you need.",
    "A future migration feature addresses one of the biggest shortcomings of WhatsApp's backup capabilities. We already knew that it is going to be possible to migrate from Android to iOS in taking all of your WhatsApp chats with you, and while it would have been extremely surprising for the reverse to not also have been implemented, now we have confirmation that this option is on the way.",
    "The ever-reliable WABetaInfo has shared screenshots of a feature discovered by XDA Developers:",
    "Rather than being an option that's built into the WhatsApp app directly, the cross-platform migration tool looks to be part of a separate Switch to Android app which will be available from the App Store soon. This is very similar to the Move to iOS app that can be found in the Play Store.",
    "Judging from the screenshots and video of the feature in action, it would appear that the migration process will require the use of a cable. Just how this will work in practice remains to be seen, and it is entirely possible that the process will change before it goes public – perhaps to utilitize Bluetooth.",
    "As ever, the best way to get your hands on the latest features as soon as possible is to take advantage of the WhatsApp beta program, although this does mean you end up using a slightly less stable version of the app, so do proceed with caution if you decide to go down this rabbit hole.",
    "The decision to make it easier to move between platforms makes a great deal of sense. While both iOS and Android enjoy great brand loyalty from users, there are still plenty of people who decide to switch sides. It is beneficial for everyone involved if the process of swapping platforms is made as painless as possible, and this new data migration option eliminates some of the friction involved.",
    "Of course, it would have been great if the same functionality could have been built directly into the WhatsApp app, but as this would probably have involved storing data in the cloud, there would have been privacy and security concerns.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Make the switch",
    "7": "Analysis: Embracing change"
  },
  "links": {
    "Play Store": "https://play.google.com/store/apps/details?id=com.apple.movetoios&hl=en_US&gl=US",
    "The Verge": "https://www.theverge.com/2021/7/28/22597661/whatsapp-ios-to-android-chat-history-backup-transfer"
  }
}