{
  "source": "https://www.techradar.com/news/sony-is-finally-giving-ps5-indies-the-platform-they-deserve-but-is-it-too-late",
  "title": "Sony is finally giving PS5 indies the platform they deserve - but is it too late?",
  "category": "gaming",
  "updated": "2021-08-30T01:57:22Z",
  "author": "vic-hood",
  "summary": "Opinion: It's about time",
  "article": [
    "Sony has published a spotlight blog post, highlighting new PlayStation indie reveals and updates.",
    "The post focused on seven upcoming indie titles which are coming to PS4 or PS5 (or, in some cases both), including roguelike Hades, charming adventure A Short Hike, reverse-horror experience Carrion and Oxenfree 2: Lost Signals.",
    "But while it's good to see Sony shining the light on these upcoming indie gems, it also feels like it's a little too late.",
    "Sony came under fire earlier this year from indie developers who claimed that the company was failing to support smaller game developers.",
    "Back in June, Ian Garner, a co-founder of indie studio Neon Doctrine, posted a Twitter thread claiming that \"Platform X\" (which Garner later confirmed to Bloomberg to be PlayStation) gives indie developers \"no ability to manage their games\" and forces them to \"jump through hoops\" for promotions. \"If Platform X doesn't like your game, no fanfare, no feature, no love,\" Garner claimed. In an interview with Bloomberg, Garner also claimed that Sony ran a video seminar encouraging developers to pay $25,000 to be featured on the front page of the PlayStation Store - a large amount for smaller developers.",
    "Further indie developers shared their experiences of working with Sony on Twitter and in interviews with publications, claiming that other platforms, such as Xbox and Nintendo, were easier to work with and that Sony's focus primarily lies with AAA titles - leaving indie developers out in the cold.",
    "Sony's focus is reportedly often on its own first-party blockbuster AAA titles. Bloomberg reported back in April that Sony's Visual Arts studio was initially working on a The Last of Us remake for PS5, before Naughty Dog took over the project instead.",
    "Bloomberg's report stated that Visual Arts planned to make The Last of Us remake have a \"similar look and feel\" to The Last of Us 2, which was in development at the time, so the games could be packaged together upon release.",
    "According to the report, Visual Arts also pitched a remake of the first Uncharted game for PS5 to Sony. \"That idea quickly fizzled because it would be expensive and require too much added design work,\" the report reads. \"Instead, the team settled on a remake of Naughty Dog’s 2013 melancholic zombie hit, The Last of Us.\"",
    "Bloomberg's report, claims that this \"obsession\" with blockbusters is causing unrest within the PlayStation empire.",
    "Sony has been posting blog posts semi-regularly highlighting upcoming indie games. However, this shifting focus towards indie games feels a little too late and it's a shame. Indie games often provide some of the most unique gaming experiences out there and, typically, are considerably more affordable.",
    "Both Nintendo and Microsoft provide platforms that laud indies. Microsoft has a specific ID@Xbox program that regularly showcases a range of intriguing indie games coming to Xbox and Xbox Game Pass is packed with indie titles. Similarly, Nintendo often puts a large focus on indie titles in its Nintendo Direct showcases.",
    "However, it feels like Sony often puts its blockbusters center stage. This spotlight by Sony is welcome but I would like to see more indie games getting their deserved share of the spotlight with the PS5 generation. I want to see them featured heavily during the next Sony State of Play or being featured on the PlayStation Storefront. After all, with PS5 exclusives averaging around £70/$70, players need to know there are more affordable, unique experiences out there."
  ],
  "headers": {
    "3": "Growing unrest",
    "6": "A focus on blockbusters",
    "10": "Too little too late?"
  },
  "links": {
    "spotlight blog post": "https://blog.playstation.com/2021/08/05/new-indie-reveals-and-updates-take-the-spotlight/",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Hades": "https://www.techradar.com/news/hades-on-nintendo-switch-is-the-most-addicted-ive-ever-been-to-a-video-game",
    "Twitter thread": "https://twitter.com/NeonIain/status/1410184912745885702?s=20",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-09/sony-s-obsession-with-blockbusters-is-stirring-unrest-within-playstation-empire?sref=HrWXCALa",
    "experiences": "https://twitter.com/jaytholen/status/1410299892631810055",
    "Twitter": "https://twitter.com/summoningpixels/status/1410268893386584073",
    "publications": "https://kotaku.com/playstation-is-hard-to-work-with-devs-say-1847210060",
    "The Last of Us remake": "https://www.techradar.com/news/the-last-of-us-remake-is-coming-to-ps5-according-to-report",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "ID@Xbox": "https://www.techradar.com/news/why-xbox-game-pass-is-a-discovery-engine-for-gamers",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}