{
  "source": "https://www.techradar.com/news/company-of-heroes-2-plus-ardennes-assault-dlc-are-now-free-on-steam",
  "title": "Company of Heroes 2 plus Ardennes Assault DLC are now free on Steam",
  "category": "computing",
  "updated": "2021-05-28T13:40:25Z",
  "author": "darren-allan",
  "summary": "Base game plus Ardennes Assault",
  "article": [
    "Company of Heroes 2 normally runs to $17.49 (or £12.49) on Steam, but right now, you can grab the World War 2 RTS for free.",
    "What you’re actually getting for nothing is the base game plus the Ardennes Assault expansion, so that’s a pretty sweet deal and it’ll last over the weekend and through until May 31 at 1pm ET (6pm BST).",
    "That said, note that you might want to go for this offer sooner rather than later, because it’s marked as “while supplies last” on the Steam product page, so there’s a danger the allocation of freebie copies will run dry.",
    "According to the developer, some folks are encountering trouble while bagging the free game: “Note – some people are experiencing a subscription error with this offer. We are working to resolve this, please check back shortly.”",
    "Company of Heroes 2 is a real-time strategy affair from Relic released eight years back, and casts the player in the role of the Russians in WW2. The game was generally well-received – as was the Ardennes expansion – even if some criticism was directed at it for being a little rough around the edges.",
    "Finally, it’s worth noting that a bunch of DLC for Company of Heroes 2 – and the Franchise Edition which is stuffed with DLC – have a 75% discount applied right now. So if you find that the free game is up your street at the weekend, you could always nab some of the DLC on sale, which is obviously the hope of the devs.",
    "Those hunting for freebies on PC right now should also be aware that the Epic Games Store’s new free game is Among Us, which is a fun shout."
  ],
  "headers": {
    "4": "Eastern front"
  },
  "links": {
    "Steam": "https://www.techradar.com/news/the-best-steam-games",
    "base game plus the Ardennes Assault expansion": "https://store.steampowered.com/app/231430/Company_of_Heroes_2/",
    "devs": "https://twitter.com/CompanyOfHeroes/status/1397965800720330759",
    "Epic Games Store’s new free game is Among Us": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed"
  }
}