{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-specs-leak-is-bad-for-samsung-but-good-for-buyers",
  "title": "Samsung Galaxy S22 specs leak is bad for Samsung but good for buyers",
  "category": "phones",
  "updated": "2021-08-16T10:28:11.004Z",
  "author": "james-rogerson",
  "summary": "Snapdragon almost everywhere",
  "article": [
    "The Samsung Galaxy S21 range and other recent Galaxy S flagships have used different chipsets in different regions, with the US often getting a Snapdragon one, and much of the rest of the world typically getting a Samsung-made Exynos one, but for the Samsung Galaxy S22, almost everywhere might get the same chipset.",
    "That’s according to leaker lanzuk, posting on Naver (a South Korean social media site). Apparently, Samsung has run into production problems, meaning that it won’t be able to build as many Exynos 2200 chipsets (which is the expected next generation Exynos model) as it usually manages, meaning that most of the world will get a Snapdragon chipset instead, rumored to be called the Snapdragon 898.",
    "They haven’t said which countries will still get an Exynos model, just that apparently South Korea is unlikely to.",
    "Additionally, the RAM, storage capacities and design of the Galaxy S22 range will apparently be much the same as the Samsung Galaxy S21 range. That would mean 8GB of RAM and up to 256GB of storage in the Samsung Galaxy S22 and Galaxy S22 Plus, while the Samsung Galaxy S22 Ultra would get up to 16GB of RAM and up to 512GB of storage.",
    "So what will differ other than the chipset? According to @FrontTron (another leaker) there are some battery changes planned, with the Samsung Galaxy S22 apparently getting a 3,800mAh one (down from 4,000mAh in the Galaxy S21), the S22 Plus said to be getting a 4,600mAh one (down from 4,800mAh), and the Galaxy S22 Ultra sticking at 5,000mAh.",
    "As for the camera, this source claims that the standard Galaxy S22 and the Samsung Galaxy S22 Plus will have a 50MP main, 12MP telephoto and 12MP ultra-wide camera, while the Samsung Galaxy S22 Ultra will have a 108MP main and a 12MP ultra-wide, along with a pair of 12MP telephoto ones. Those specs are slightly different from the current models, but mostly in the same ballpark.",
    "Finally, there apparently won’t be an under-display camera in any Samsung Galaxy S22 model.",
    "While Samsung probably isn’t happy about the low yield of its Exynos 2200 chipset (assuming this leak is right), it could end up being good news for buyers.",
    "Currently, Samsung’s flagships are in the odd position of offering different performance depending on which region you buy them from. We’re not just talking differences in raw power either – the chipset choice can also affect camera performance and battery life.",
    "Generally the Snapdragon options seem to come out on top – so more Snapdragon could be good news. That might not be the case in 2022, with reports suggesting the upcoming Exynos chipset could be highly capable. But whichever one is better, having what’s supposed to be the same phone performing differently in different regions isn’t ideal.",
    "Some buyers could feel short changed, and some reviews may not be representative of the experiences you’d have. So it would probably be better for buyers if the same chipset was used in all regions, but this sounds like a step in the right direction at least – even if it’s not what Samsung ideally wants to do.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "The same storage and similar snappers",
    "7": "Analysis: Samsung’s chipset issues could be good for buyers"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Naver": "https://blog.naver.com/yeux1122/222459098136",
    "@FrontTron": "https://twitter.com/FrontTron/status/1426717666920697857",
    "reports suggesting": "https://www.techradar.com/news/samsung-galaxy-s22-will-have-ray-tracing-graphics-at-least-in-one-version",
    "Phone Arena": "https://www.phonearena.com/news/most-samsung-galaxy-s22-models-to-use-snapdragon-898-not-amd-exynos-2200_id134347"
  }
}