{
  "source": "https://www.techradar.com/news/lg-reveals-the-best-oled-tv-size-and-its-huge",
  "title": "LG's Display business reveals the best OLED TV size – and it's huge",
  "category": "televisions",
  "updated": "2021-05-21T17:05:28Z",
  "author": "henry-st-leger",
  "summary": "We all have room for an 83-inch OLED TV, right?",
  "article": [
    "LG Display, a subsidiary of LG, has gone on record to say that its new 83-inch OLED panel size is the best way to experience its most advanced OLED TVs – putting a dampener on the hopes of 55-inch TV or 65-inch TV owners hoping for the best visual experience out there.",
    "The confirmation came in a YouTube video from LG Display Global's official channel, in which an LG representative praised the enhancements in this year's LG OLED flagship, the LG G1 Gallery Series.",
    "Although currently limited to a 77-inch screen size, the G1 uses a new OLED evo panel technology that reportedly ekes out 20% more brightness than traditional OLED screens, upping HDR performance without increasing the risk of burn-in.",
    "\"By improving luminance in OLED, images are more vivid and crisp than ever, which helps to strengthen HDR with OLED,\" LG's spokesperson says, adding that, \"OLED with enhanced luminance allows for more detailed contrast and color expressions.\"",
    "They go on to say that, \"To maximize self emission, LG Display applied high-efficient light emitting material to better emit light and up the display's brightness.\"",
    "So far, so good. But the kicker comes at the end of the video, when we're told that \"the 83-inch OLED display, newly developed in 2021, is the most representative product with improved luminance improvement technology.\"",
    "Unfortunately, because there's no publicly available OLED evo TV in that size, we're kind of out of luck, but it could also be interpreted as a sign that LG Display is thinking about even larger screen sizes for next year.",
    "83-inch OLED TVs are new for 2021, and only confirmed for the LG C1 OLED and Sony A90J OLED so far. The video above does suggest that the LG G1 – the only screen with an OLED evo confirmed for release – could get the size at some point though.",
    "It's a similar strategy as what we saw last year with the rollout of 48-inch OLED TVs, coming to a small number of flagship sets before becoming more commonplace in successive years.",
    "That said, those buying an OLED TV at a smaller size should still be getting a capable television – just not with the hyper-optimized experience of light emission that the 83-inch LG G1 is technically capable of.",
    "Market analysts at Omdia (via Business Korea) report that shoppers seem to be moving to even bigger sizes, with sales of OLED TVs in 2020 seeing the traditional flagship size of 55 inches left behind in favor of step-up 65-inch models – the first year on record where that’s happening.",
    "So it's clear that appetites for bigger screens are increasing, but an 83-inch size will still be out of reach of many, whether that's because of the inflated price tags of larger screens or the physical limitations of the average home.",
    "OLED TVs are often criticized for their dim output compared to the thousands of nits luminance found on high-end LCD TVs (notably new Samsung TVs with QLED displays). HDR content, specifically, is mastered at 1,000 nits, meaning that OLED screens can struggle to hit the color highs that 'high dynamic range' demands.",
    "The incredible black levels of OLED screens helps matters, though, ensuring that even semi-bright highlights can look fantastic in comparison to dark or 'off' pixels. Some TVs might have higher brightness, but unless they can output dark scenes and objects successively, the contrast between the two won't be overly impressive.",
    "A 20% increase in brightness is very notable for an OLED screen, though, and our reviewer could absolutely tell the difference. OLED evo could put a band aid on one of the most common OLED criticisms, then, especially if that percentage increase goes up further in the coming years."
  ],
  "headers": {
    "7": "Big screens: the new normal",
    "12": "Turn up the lights"
  },
  "links": {
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "55-inch TV": "https://www.techradar.com/best/55-inch-4k-tv",
    "65-inch TV": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "YouTube video": "https://www.youtube.com/watch?v=JrwAIzyOOjQ",
    "LG G1 Gallery Series": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Sony A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "48-inch OLED TVs": "https://www.techradar.com/best/48-inch-oled-tv",
    "Business Korea": "http://www.businesskorea.co.kr/news/articleView.html?idxno=66893",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained"
  }
}