{
  "source": "https://www.techradar.com/news/us-and-israel-team-up-in-major-cybersecurity-partnership",
  "title": "US and Israel team up in major cybersecurity partnership",
  "category": "computing",
  "updated": "2021-11-15T20:00:57Z",
  "author": "anthony-spadafora",
  "summary": "Both countries will work together to counter ransomware and other cyber threats",
  "article": [
    "The US and Israel have established a new bilateral partnership that will see both countries work together to combat ransomware and other pressing cyber threats.",
    "This new partnership builds on the longstanding relationship between the US Treasury Department and the Israeli Ministry of Finance. In addition to working together to disrupt ransomware operations, the two countries will create a joint task force to address cybersecurity.",
    "In a press release announcing the new partnership, Deputy Secretary of the Treasury, Wally Adeyemo explained how the US and Israel will work together to safeguard the global economy from ransomware and cyberattacks, saying:",
    "“Harnessing both the power of international cooperation and of technology innovation will position us to support economic competitiveness, prosperity, and to combat global threats including ransomware. As the global economy recovers and ransomware and other illicit finance threats present a grave challenge to Israel and the United States, increased information exchanges, joint work, and collaboration on policy, regulation, and enforcement are critical to our economic and national security objectives.”",
    "As its first order of business, the new task force will begin working to develop a Memorandum of Understanding which will cover sharing information related to the financial sector, staff training and study visits to promote cooperation and competency-building activities such as cross-border cybersecurity exercises.",
    "However, the task force will also launch a series of expert technical exchanges on policy, regulation and outreach to support innovation in the fintech sector which both the US and Israel have agreed to encourage. The two countries want to help the fintech sector develop robust cybersecurity protections that can advance compliance on anti-money laundering, counter-terrorist financing and countering the financing of proliferation.",
    "As part of the new partnership, the US Treasury also plans to participate in the CyberTech Global Tel Aviv conference which will be held in Israel in January of next year.",
    "Countering ransomware and other cyber threats has been a top priority for the Biden administration and this new partnership with Israel will help advance this goal further.",
    "Looking to further protect yourself online? Check out our roundups of the best endpoint protection software, best identity theft protection and best malware removal software",
    "Via Reuters"
  ],
  "headers": {
    "4": "Joint task force"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "cybersecurity": "https://www.techradar.com/news/cybersecurity-what-is-it",
    "press release": "https://home.treasury.gov/news/press-releases/jy0479",
    "cybersecurity exercises": "https://www.techradar.com/news/making-cybersecurity-training-a-global-event",
    "fintech": "https://www.techradar.com/news/uk-hatches-plan-to-retain-fintech-crown-following-brexit",
    "Biden administration": "https://www.techradar.com/news/biden-administration-wants-to-massively-boost-cybersecurity-spending-following-attacks",
    "best endpoint protection software": "https://www.techradar.com/news/best-endpoint-security-software",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "best malware removal software": "https://www.techradar.com/best/best-malware-removal",
    "Reuters": "https://www.reuters.com/world/middle-east/us-treasury-department-partner-with-israel-combat-ransomware-2021-11-14/"
  }
}