{
  "source": "https://www.techradar.com/news/what-time-is-cruella-released-on-disney-plus",
  "title": "What time is Cruella released on Disney Plus?",
  "category": "entertainment",
  "updated": "2021-05-28T13:35:46Z",
  "author": "samuel-roberts",
  "summary": "You can stream Cruella now – for an extra fee",
  "article": [
    "Update: Cruella is available now on Disney Plus via Premier Access. Here's how to watch Cruella online.",
    "Original story: Wondering what time Cruella hits Disney Plus via Premier Access on May 28? In this article, we'll explain when you can watch the new movie in your timezone. As with previous releases Mulan (2020) and Raya and the Last Dragon, you'll have to pay extra for the pleasure of watching it – $29.99 / £19.99 / AU$34.99, to be exact – though you'll be able to watch the movie as many times you like after purchase while you're still subscribed to Disney Plus.",
    "Disney Plus always releases new content at the same time, which means you'll be able to stream Cruella starting at one minute past midnight PT on Friday, May 28. To find out how that translates to your local timezone, just scroll down a little bit and we'll break it down.",
    "Cruella is the latest live-action adaptation of a classic animated Disney movie, but with a bit of a twist. This is an origin story about future puppy-skinning enthusiast Cruella de Vil, exploring her life in 1970s London as a young woman called Estella (played by Emma Stone). Teaming up with a pair of crooks, she pulls herself up from little and finds her fashion sense makes an impact – her work captures the attention of fashion extraordinaire Baroness von Hellman.",
    "Basically, we're going to find out how this sequence of events leads to her becoming Cruella de Vil – and embracing a life of aspirational puppy skinning, as previously mentioned. Craig Gillespie, who directed I, Tonya with Margot Robbie, is behind the camera on this one.",
    "So, what time can you watch Cruella on Disney Plus, via Premier Access? We'll explain when you can watch it in your timezone below.",
    "Like all Disney Plus originals, Cruella will land on Disney Plus at 12.01AM PDT/3.01AM EDT/8.01AM BST/5.01PM AEST on Friday, May 28. A spokesperson for Disney Plus confirmed this time for us, so this is when you can grab the film and start streaming where you are. This timing has been standard practice for all Disney Plus shows like The Mandalorian and The Falcon and the Winter Soldier since the service landed in November 2019.",
    "Disney Plus has confirmed that Cruella will be widely available for anyone who pays for the service from August 27, 2021. So, if you don't want to spend extra to watch it, you've only got three months to wait.",
    "This follows the pattern set by the live-action version of Mulan from last year. That released on September 4, 2020, via Premier Access, then launched for everyone on December 4, 2020."
  ],
  "headers": {
    "6": "What time is Cruella released on Disney Plus?",
    "7": "When will Cruella be released for all Disney Plus subscribers?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "how to watch Cruella online": "https://www.techradar.com/news/how-to-watch-cruella-online-and-stream-the-full-movie-on-disney-plus-anywhere",
    "$29.99": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-7747381841458428000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fmovies%2Fcruella%2F2GJTZuO8I01c",
    "£19.99": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-6470346736746471000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fmovies%2Fcruella%2F2GJTZuO8I01c",
    "AU$34.99": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-8505473425758801000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fmovies%2Fcruella%2F2GJTZuO8I01c",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}