{
  "source": "https://www.techradar.com/news/call-of-duty-warzone-is-getting-an-extremely-cool-vanguard-inspired-new-map",
  "title": "Call of Duty: Warzone is getting an 'extremely cool' Vanguard-inspired new map",
  "category": "gaming",
  "updated": "2021-09-08T10:01:47Z",
  "author": "adam-vjestica",
  "summary": "‘A fresh new experience for Call of Duty players’",
  "article": [
    "Call of Duty: Warzone is set to receive a new map, developer Raven Software has revealed.",
    "The map was teased during Call of Duty: Vanguard’s multiplayer reveal stream and will take players to the Pacific. Like the upcoming Call of Duty: Vanguard, it’ll be inspired by World War II.",
    "The official Call of Duty Twitter account shared a brief glimpse of the new Pacific Warzone map, and it certainly looks like a drastic departure from Verdansk, the game’s current map.",
    "Creative director Amos Hedge said: “We are going to the Pacific, featuring an entirely new play space, complete with all-new points of interest. Players will get to traverse the lush landscapes of the island and make their way through a variety of extremely cool locations while battling it out alongside friends and foes.",
    "“Our goal was to create a fresh, new experience for Call of Duty players by breaking out of the war-torn world of Verdansk to create an atmosphere that is vibrant, alive, and really opens the doors to how we can craft the narratives and events.”",
    "The new Warzone map will use the same tech and engine as Call of Duty: Vanguard (thanks, VGC), which means the massively popular free-to-play multiplayer mode will look and feel a bit different from what players are used to.",
    "“Our teams have worked hard on this, and much more, will continue to do so,” Hodge said. “We know how much it means to everyone. We will be continuing to offer a massive calendar of free post-launch content featuring new modes, playlists, limited-time events and seasonal events, as well as community celebrations and much more.”",
    "Publisher Activision has also confirmed that the new Warzone map won’t affect any player progression or loadouts.",
    "“Warzone will continue to support weapons and content earned with a Battle Pass or purchased via Store Bundle from Call of Duty: Modern Warfare and Call of Duty: Black Ops Cold War,\" Activision said. \"This is all built on the same tech and engine as Call of Duty: Vanguard for seamless weapon integration and play balance, and it all arrives with fully optimized crossplay, cross-progression, and cross-gen support.\"",
    "The Pacific map is set to be slightly larger than Verdansk, Warzone’s current map, and will include new vehicles to help players traverse the landscape more efficiently. The Warzone Pacific map is set to launch shortly after Call of Duty: Vanguard’s release, which is scheduled to be on November 5.",
    "The release of the Pacific Warzone map will also coincide with a new anti-cheat system, something which will be welcomed by most players. The new system is currently being tested, and will hopefully help protect legitimate players from those who rely on hacks, cheats and glitches to win."
  ],
  "headers": {
    "7": "Get in the zone"
  },
  "links": {
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Call of Duty: Vanguard’s multiplayer reveal stream": "https://www.youtube.com/watch?v=lyd44qL8QVQ",
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "VGC": "https://www.videogameschronicle.com/news/first-look-call-of-duty-warzones-new-pacific-map-revealed/",
    "Call of Duty: Modern Warfare": "https://www.techradar.com/reviews/call-of-duty-modern-warfare-2019-review",
    "Call of Duty: Black Ops Cold War": "https://www.techradar.com/reviews/call-of-duty-black-ops-cold-war"
  }
}