{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-land-on-october-20-one-day-after-the-pixel-6",
  "title": "Samsung Galaxy S21 FE could land on October 20, one day after the Pixel 6",
  "category": "phones",
  "updated": "2021-10-13T09:03:25Z",
  "author": "james-rogerson",
  "summary": "Three phones in one week",
  "article": [
    "Hot on the heels of the Samsung Galaxy Z Fold 3 and Samsung Galaxy Z Flip 3, it looks like the Samsung Galaxy S21 FE could be about to launch, as Samsung is holding an event on October 20.",
    "The smartphone maker posted a video on Twitter teasing ‘Unpacked Part 2’, and while the Samsung Galaxy S21 FE isn’t mentioned by name, it’s our best guess for what we might see there.",
    "This phone has been rumored for ages and the name has even been spotted on Samsung websites, so we know it’s something the company is or was working on. It’s also been rumored that the phone would land in October, so this all lines up.",
    "Then again, we can’t be certain, as a Samsung official reportedly said that the phone’s planned launch had been canceled, while mentions of it on official support pages have been removed, all suggesting that the phone itself might have been canceled or at least delayed, with another recent leak pointing to a January launch.",
    "So what else could we see if not the Samsung Galaxy S21 FE? Well, the teaser video itself shows various Samsung app icons, such as Samsung Health, Samsung SmartThings, and music, video, and camera apps.",
    "So it’s possible that this announcement is software rather than hardware focused. We’re not sure what that could involve though. Perhaps Samsung is cooking up a new version of the One UI interface that it sticks on top of Android, but we wouldn’t think it would hold a whole event just for that.",
    "So we’d think hardware of some kind is likely to be present, and the obvious option in that case is the Samsung Galaxy S21 FE.",
    "It’s a busy time in phone world, as not only is Samsung likely unveiling a new handset, but the Google Pixel 6 range is also being fully unveiled on October 19, so just one day before. That includes both the Pixel 6 and the Pixel 6 Pro.",
    "And the day before that Apple is holding an event. This will likely be for MacBooks and AirPods rather than anything smartphone related, but it still makes for a surprisingly busy week in the tech calendar, especially this late in the year.",
    "TechRadar will be sure to cover these events and announcements in full, so make sure to check back here on Monday, Tuesday, and Wednesday for all the details."
  ],
  "headers": {
    "7": "Analysis: it’s going to be a busy week"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "posted a video on Twitter": "https://twitter.com/SamsungMobile/status/1448083619063517185",
    "the phone would land in October": "https://www.techradar.com/news/black-friday-could-spell-disaster-for-the-samsung-galaxy-s21-fe-launch",
    "have been removed": "https://www.techradar.com/news/samsung-galaxy-s21-fe-is-almost-certainly-canceled-as-samsung-removes-support-page",
    "pointing to a January launch": "https://www.techradar.com/news/samsung-galaxy-s22-may-be-delayed-with-galaxy-s21-fe-taking-its-place-in-january",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Apple is holding an event": "https://www.techradar.com/news/when-is-the-next-apple-event"
  }
}