{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
  "title": "Samsung Galaxy Tab S8 release date rumors, price, news and leaks",
  "category": "tablets",
  "updated": "2021-12-07T17:12:08Z",
  "author": "james-rogerson",
  "summary": "Four new Samsung Galaxy Tab S8 models?",
  "article": [
    "We're hearing a slow and steady drip of Samsung Galaxy Tab S8 leaks, and it's starting to sound like one of the best Android tablets we've seen - or we could say 'they' are, as it sounds like there will be a Plus, Lite and Ultra version of the slate too.",
    "Initially, we thought the new family of slates would launch in August - that would be a year after the Samsung Galaxy Tab S7 and Galaxy Tab S7 Plus dropped - but with that month in the rear-view mirror, our sights are set on January and beyond.",
    "These tablets could be rivals to Apple's top iPad Pro slates, especially the Plus and Ultra versions with their giant screens and top processors - that is, if the rumors are correct about all the specs.",
    "Below then you’ll find a list of the main things we want from Samsung’s next top tablets, but before that we’ve included details on the likely release date and price, along with the leaks and rumors that are starting to build up – and we'll be updating this article whenever we hear anything new, so check back regularly.",
    "One release date rumor points to early 2022 for the launch of the Samsung Galaxy Tab S8. That's in line with another more recent rumor, which suggested the range would land alongside the Samsung Galaxy S22, which we're expecting in or around January. Another source has also now said the same.",
    "Some rumors suggested the tablets would come in August 2021, a year after their predecessors, but time disproved those notions.",
    "As for the price, there’s no news there, but the Samsung Galaxy Tab S7 started at $649.99 / £619 / AU$1,149, while the pricier Galaxy Tab S7 Plus started at $849.99 / £799 / AU$1,549, so prices may be similar for the next model. If anything though the Samsung Galaxy Tab S8 range might cost more, since the trend is for prices to rise.",
    "The first major Samsung Galaxy Tab S8 leak to get our attention reveals plenty about the upcoming slate, which will apparently be available in 11-inch, 12.4-inch and 14.6-inch variations – with that last one a huge addition to the line.",
    "According to one leak, the Ultra's 14.6-inch screen will have a 2960 x 1848 resolution.",
    "We've now seen a few unofficial renders leak, to give us an idea of what the Tab S8 series will actually look like: you can check out renders of the Galaxy Tab S8 and Tab S8 Plus, and the new Galaxy Tab S8 Ultra (which may come with a display notch).",
    "That notch rumor has been further evidenced in a leak from Evleaks that includes more imagery of the upcoming tablets. You can see each of these below:",
    "There's also expected to be a Samsung Galaxy Tab S8 Lite, but we've yet to hear anything about the design of this tablet. We'd expect it to have a similar size screen to the Galaxy Tab S8, or perhaps a touch smaller.",
    "Specs-wise, the tablets are said to top out at 12GB of RAM and 512GB of storage for the largest model, while 5G variants will be available. All three models are being tipped to have dual-lens 13MP+5MP cameras on the back, along with an 8MP camera on the front (though the Tab S8 Ultra apparently also has a 5MP ultra-wide lens on the front).",
    "This leak also points to an 8,000mAh battery in the standard Galaxy Tab S8, a 10,090mAh one in the Tab S8 Plus, and a 12,000mAh one in the Galaxy Tab S8 Ultra.",
    "That's slightly at odds with another leak though, which agrees on the size of the battery in the Galaxy Tab S8 Plus, but suggests the Ultra model has an 11,500mAh one, and subsequent leaks have backed this up.",
    "As for the chipset, one leak points to the Exynos 2200 being used in the Samsung Galaxy Tab S8 Ultra, and the Snapdragon 898 being used in the Galaxy Tab S8 Plus. These are expected to be the two speediest Android chipsets of early 2022.",
    "That said, we've elsewhere heard that all three models might use the Snapdragon 898 chipset. Additionally, the three slates might support 45W charging, which is reasonably speedy.",
    "We can predict a few things about the upcoming tablets too. Based on past form, two of these three models will likely be called the Galaxy Tab S8 and Galaxy Tab S8 Plus. The top model meanwhile is rumored to be called the Samsung Galaxy Tab S8 Ultra.",
    "The Plus and Ultra models will probably also have an AMOLED screen, and they will likely also both have a 120Hz refresh rate and a top-end chipset (we're expecting this to be the Snapdragon 888 or Snapdragon 888 Plus from Qualcomm).",
    "The Samsung Galaxy Tab S7 and particularly the Galaxy Tab S7 Plus are excellent slates, with the latter topping our best Android tablets list, but they’re not perfect. Here’s what Samsung can do to make the Tab S8 even better.",
    "The Samsung Galaxy Tab S7 is almost a laptop, especially once you add the optional keyboard accessory, but it has just one USB-C port, which limits its versatility a bit.",
    "So for the Samsung Galaxy Tab S8 we’d like to see a second port added, and ideally also a 3.5mm headphone port. Tablets don’t need to be as slim and compact as phones, so we reckon the usefulness of having such a port is greater than the space saved by removing it.",
    "The Galaxy Tab S range is positioned at the high end of the market, so these slates are always going to be expensive, but we noted in our Tab S7 review that the price is a bit too high really, so we’d like to see that addressed for the Samsung Galaxy Tab S8 range.",
    "We’re not convinced the price will go down, but stranger things have happened, so we’ve got our fingers crossed.",
    "The Samsung Galaxy Tab S7 supports an optional keyboard cover, one which is generally pretty good, but the fact that the keys aren’t backlit means it’s hard to use in the dark.",
    "It’s a small thing but one that could make a big difference to some people, so we’d like the keyboard cover for the Galaxy Tab S8 to have backlit keys.",
    "The Samsung Galaxy Tab S7 Plus has an OLED screen, but the basic Tab S7 is lumbered with an inferior LCD one, so for the Samsung Galaxy Tab S8 we want to see OLED on both models.",
    "With more and more companies offering OLED screens on their devices and Apple now offering them on almost every iPhone, we think it’s reasonable for even the most basic slates in Samsung’s flagship tablet range to use OLED too.",
    "Plus, while Apple has embraced OLED on its phones, the iPad range actually still uses LCD, so this is one way in which the Samsung Galaxy Tab S8 could stand out.",
    "The Samsung Galaxy Tab S7 and Tab S7 Plus have an aluminum back and a premium look and feel, but one thing that spoils the look somewhat is how prone to picking up fingerprints they are, as we noted in our review.",
    "This is a problem faced by many phones and tablets, but it’s one that we’d like Samsung to try and solve for the Galaxy Tab S8, especially as tablets don’t get covered up by cases as frequently as phones, so we want a back that stays pristine."
  ],
  "headers": {
    "4": "Samsung Galaxy Tab S8 release date and price",
    "7": "Design and display",
    "12": "Specs and features",
    "19": "What we want to see",
    "20": "1. More ports",
    "22": "2. A competitive price",
    "24": "3. A backlit keyboard cover",
    "26": "4. An OLED screen on all models",
    "29": "5. A fingerprint-resistant back"
  },
  "links": {
    "Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "Samsung Galaxy Tab S7 and Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "release date rumor": "https://www.techradar.com/news/samsung-galaxy-tab-s8-might-not-land-until-next-year",
    "another more recent rumor": "https://www.techradar.com/news/samsung-galaxy-tab-s8-could-land-alongside-the-galaxy-s22-as-an-ipad-pro-rival",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "now said the same": "https://www.techradar.com/news/samsung-galaxy-tab-s8-release-date-and-chipsets-leaked",
    "reveals plenty": "https://www.techradar.com/news/the-samsung-tab-s8-could-come-with-a-huge-screen-and-a-giant-battery",
    "one leak": "https://www.techradar.com/news/samsung-galaxy-tab-s8-leaks-are-focusing-on-what-but-not-why",
    "Galaxy Tab S8 and Tab S8 Plus": "https://www.techradar.com/news/samsung-galaxy-tab-s8-renders-give-us-first-look-along-with-another-specs-leak",
    "Galaxy Tab S8 Ultra": "https://www.techradar.com/news/samsung-galaxy-tab-s8-ultra-shows-off-a-display-notch-in-new-unofficial-renders",
    "notch rumor has": "https://www.techradar.com/news/samsung-galaxy-tab-s8-leaked-renders-suggest-the-tablet-will-get-a-notch",
    "being tipped": "https://www.techradar.com/news/the-samsung-tab-s8-could-come-with-a-huge-screen-and-a-giant-battery",
    "another leak": "https://www.techradar.com/news/samsung-galaxy-tab-s8-could-land-alongside-the-galaxy-s22-as-an-ipad-pro-rival",
    "subsequent leaks": "https://www.techradar.com/news/samsung-galaxy-tab-s8-leaks-are-focusing-on-what-but-not-why",
    "one leak points": "https://www.techradar.com/news/samsung-galaxy-tab-s8-release-date-and-chipsets-leaked",
    "might use the Snapdragon 898 chipset": "https://www.techradar.com/news/samsung-galaxy-tab-s8-trio-could-launch-with-cutting-edge-power",
    "rumored to be called the Samsung Galaxy Tab S8 Ultra": "https://www.techradar.com/news/samsung-galaxy-tab-s8-might-not-land-until-next-year",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Snapdragon 888 Plus": "https://www.techradar.com/news/snapdragon-888-plus-5g-processor",
    "best Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504"
  }
}