{
  "source": "https://www.techradar.com/news/this-super-fast-e-bike-can-hit-up-to-31mph-but-theres-a-caveat",
  "title": "This super-fast e-bike can hit up to 31mph – at least in theory",
  "category": "fitness",
  "updated": "2021-10-18T11:52:36Z",
  "author": "jamel-smith",
  "summary": "Pre-order with caution",
  "article": [
    "Dutch e-bike company VanMoof has announced an e-bike that can hit a top speed of up to 31mph – in theory, at last. The VanMoof V is intended to replace cars for long commutes in cities, and is scheduled for release late next year.",
    "The company has only released artists’ impressions so far, but the VanMoof V will feature front and rear suspension, thick tires and a new futuristic design. VanMoof has said that the new dual motors will provide powerful acceleration, with adaptive motor control that responds to riding conditions for enhanced traction for safety and performance.",
    "The new e-bike will feature VanMoof’s latest tech including Turbo Boost (providing extra acceleration), Kick Lock for keyless locking, and automatic gear shifting.",
    "The VanMoof V is only available to pre-order by invite-only reservations. Reserving the VanMoof V costs $20 / £20 (about AU$27) and the bike is priced at a premium $3,498 / £3,498 (about AU$4,731).",
    "It’s interesting that VanMoof is putting so much emphasis on the Vanmoof V’s ability to hit 31mph, considering the top speed for an e-bike is 12.5mph in the UK and EU, and 20mph in the US.",
    "VanMoof has said that the new bike will reach “up to 31mph depending on local regulations and how the bike is registered,” which would mean the company will be limiting the speed of its e-bike according to the laws of the countries where it’s sold – and will therefore never hit its maximum possible speed. The e-bike will have a system in place that cuts out the motor when traveling faster, which will make it much the same as any other e-bike.",
    "VanMoof is calling out different countries to change their laws on e-bikes – a step in reversing the car-first mentality of modern-day cities. But for now, no change is happening, so whoever pre-orders the hyperbike will be paying a premium price for speed they can’t use.",
    "Its hard to say whether the other features of the VanMoof V like automatic gear shifting justify its premium price point. It may be better to look around first for other e-bikes before pre-ordering the VanMoof V."
  ],
  "headers": {
    "4": "Analysis: the VanMoof V will probably be limited"
  },
  "links": {
    "VanMoof V": "https://www.vanmoof.com/news/en-GB/203095-vanmoof-reveals-its-very-first-hyperbike",
    "pre-order by invite-only reservations": "https://www.vanmoof.com/en-GB/vanmoof-v"
  }
}