{
  "source": "https://www.techradar.com/news/bmw-has-designed-a-futuristic-new-e-bike-to-replace-your-car-but-you-cant-buy-it",
  "title": "BMW has designed a futuristic new e-bike to replace your car – but you can't buy it",
  "category": "fitness",
  "updated": "2021-07-29T10:23:19Z",
  "author": "cat-ellis",
  "summary": "Plus a new commuter-friendly electric scooter",
  "article": [
    "Cargo e-bikes aren't just for delivery companies any more – they're going mainstream, and BMW has just unveiled a new model for transporting groceries, kids, and other important loads. There's just one catch: as Electrek notes, you can't actually buy it.",
    "The Dynamic Cargo is a three-wheeler, which according to BMW has a 'variably useable loading platform'. In other words, it can be used to carry luggage, shopping, or even your children to replace your car for the school run.",
    "The Dynamic Cargo has a pivoting frame for riding in traffic, which allows the front section to tilt when turning corners while the back portion remains level. The rear wheels are powered by an electric powertrain (BMW hasn't given full specs yet), which will kick in as soon as you start to turn the pedals – much like our current top-rated e-bike, the Cowboy 4.",
    "Unfortunately for would-be riders, the company itself has no plans to start producing and selling the Dynamic Cargo itself, and instead hopes to license out the design to another manufacturer.",
    "We'll keep you updated as and when that happens, but if you're looking for an e-bike to replace your second car, there's no need to wait. Just a few days ago, British bike-maker Raleigh unveiled its own pair of cargo-carrying e-bikes, including one with three wheels for extra stability.",
    "The Stride 2 (a bicycle) and Stride 3 (a trike) can carry loads of 80kg and 100kg respectively, and like the Dynamic Cargo, can be fitted out with boxes, racks, child seats, and even a baby carrier. They have a rather more industrial design than BMW's sleek concept, with rugged steel frames, durable plastic cargo containers, and a black paint job with a \"dash of playful mustard yellow\".",
    "BMW is aware of the competition, and says that when it starts rolling off the production line, the Dynamic Cargo will have an advantage in size and manoeuvrability. It'll have a narrower frame than a typical cargo e-bike, and that pivoting axel will make it easier to take tight corners.",
    "BMW has also revealed a new electric scooter with a dedicated 'commuter mode' to make it easier to carry on buses and trains. The Clever Commute is intended to fill a niche between cheap e-scooters like the Xiaomi Mi Electric Scooter, which are easily portable but not the most stable, and more robust models like the Pure Air Pro that are a pleasure to ride but a pain to carry.",
    "Most e-scooters are foldable, with a hinge at the bottom of the stem that allows you to pack them down flat, but the Clever Commute will have a footboard that folds up from the sides, creating a channel that the rear wheel can fold into from below. This will effectively shorten the scooter's wheelbase so you can more easily take it on escalators at bus and train stations. It can also be wheeled around in this mode, taking up less room on the sidewalk than a conventional e-scooter.",
    "You'll be able to call on a little assistance from the scooter's motor to help push it up ramps (a feature borrowed from e-bikes like the Volt Infinity).",
    "Again, BMW doesn't plan to start producing the Clever Commute itself, but it says it's in discussion with companies that might be up to the challenge, so you may be wheeling your own along the train platform within the next few years.",
    "Even without the Clever Commute's special folding deck, e-scooters solve so many of the small but irritating problems with your daily commute. If you're hesitant about heading back to the office post-pandemic, it's well worth giving one a try.",
    "For example, there's no need to worry about parking, or finding somewhere to lock it up; provided you have a little space by your desk, you can easily fold down your scooter and slot it underneath.",
    "When we tried riding an e-scooter to work for a week, we were also pleased to note how much cheaper it was than driving, or using public transport. The scooter took a while to charge, but we were able to juice it up overnight at home, or during the work day, so it was always ready for our commute.",
    "You might feel a little vulnerable on the road when you first start out, but motorists are becoming increasingly used to sharing the streets with scooters, and provided you stick to the rules and don't do anything unpredictable, you should be pretty safe. We also chose to wear a helmet while riding in case we took a tumble, but that's always going to be an individual decision.",
    "Feelings around electric scooters are mixed, and different countries and cities have varying rules around their use. In the UK, for example, it's only legal to ride a scooter that's part of an authorized hire scheme, but most US cities have no trouble at all with you buying your own and heading out.",
    "Either way, if you have the opportunity, it's well worth at least trying one out. It might make your day go a lot more smoothly – and it's fun, too."
  ],
  "headers": {
    "7": "Scoot to commute",
    "11": "Analysis: why e-scooters are a commuter's dream"
  },
  "links": {
    "e-bikes": "https://www.techradar.com/best/electric-bike",
    "Electrek": "https://electrek.co/2021/07/26/bmw-unveils-innovative-tilting-electric-cargo-trike-then-immediately-says-it-wont-produce-it/",
    "Dynamic Cargo": "https://www.press.bmwgroup.com/global/article/detail/T0338383EN/stimulating-ideas-for-urban-mobility-bmw-group-research-unveils-innovative-concepts-for-cargo-bike",
    "Cowboy 4": "https://www.techradar.com/reviews/cowboy-4",
    "unveiled its own pair of cargo-carrying e-bikes": "https://www.techradar.com/news/groceries-babies-picnics-raleighs-new-cargo-e-bikes-can-carry-them-all",
    "electric scooter": "https://www.techradar.com/best/best-electric-scooters",
    "cheap e-scooters": "https://www.techradar.com/best/cheap-electric-scooters",
    "Pure Air Pro": "https://www.techradar.com/reviews/pure-air-pro-2021-electric-scooter",
    "Volt Infinity": "https://www.techradar.com/news/shimanos-smart-tech-gives-volts-infinity-e-bike-the-edge",
    "riding an e-scooter to work for a week": "https://www.techradar.com/news/i-took-an-electric-scooter-to-work-for-a-week-and-now-im-done-with-walking"
  }
}