{
  "source": "https://www.techradar.com/news/lenovo-says-its-struggling-to-keep-up-with-massive-pc-demand",
  "title": "Lenovo says it's struggling to keep up with massive PC demand",
  "category": "computing",
  "updated": "2021-02-04T13:49:50Z",
  "author": "joel-khalili",
  "summary": "No end to the global PC shortage in sight, according to Lenovo",
  "article": [
    "The world’s largest PC manufacturer, Lenovo, has confirmed it is struggling to keep up with massive demand for new devices.",
    "On an earnings call with investors, COO Gianfranco Lanci revealed Lenovo is operating at less than half of regular stock levels, and potentially as little as a third, as a result of demand driven by the pandemic and stay at home orders.",
    "Despite vaccines providing a light at the end of the tunnel, demand has also remained high in early 2021. “I would say we have not seen any declining demand,” said Lanci. “When I look around the world, from the US to Europe, China and APAC, I think our channel inventory has never been so low.”",
    "Traditionally, Lenovo would be expected to have roughly six weeks’ worth of stock to hand but, according to Lanci, “in some cases during last quarter we were down to two or three weeks, so we were down to very, very low levels.”",
    "As per data from analyst house Canalys, PC shipments rose to 143.7 million units in Q4 2020 (including tablets), marking a third consecutive quarter of growth. Across the year as a whole, meanwhile, 458.2 million units were shipped - the highest volume since 2015.",
    "Lenovo itself holds the greatest market share (20%) and was responsible for 87 million units sold in 2020, marking an annual growth of 19%. Apple (18%), HP (13%), Dell (11%) and Samsung (8%) round out the top five.",
    "According to Lanci, without limitations to supply, Lenovo could have shipped an even greater number of devices in 2020.",
    "The company also expects shipments to rise by a further five to ten percent this year (provided supply can match demand), driven by increased device wear brought about by intensive usage.",
    "“[Users are spending] more time on their PC and tablet, so probably that will drive faster replacement cycles in the future,” explained Yang Yuanqing, Lenovo CEO.",
    "Via The Register"
  ],
  "headers": {
    "4": "Global PC demand"
  },
  "links": {
    "PC": "https://www.techradar.com/news/best-business-desktop-pcs",
    "data": "https://www.techradar.com/news/pc-sales-grow-again-with-tablets-and-chromebooks-leading-the-way",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "The Register": "https://www.theregister.com/2021/02/03/lenovo_on_pcs/"
  }
}