{
  "source": "https://www.techradar.com/news/upgrading-far-cry-6-on-ps5-shouldnt-be-nearly-this-difficult",
  "title": "Upgrading PS4 games to PS5 shouldn't be nearly this difficult",
  "category": "gaming",
  "updated": "2021-10-12T15:49:15Z",
  "author": "hamish-hector",
  "summary": "Opinion: C'mon Sony",
  "article": [
    "Yet another game is having issues upgrading players from the PS4 version to the PS5. This time around it’s Far Cry 6, and while its issues are more unique than what we’ve previously seen, they come as yet another blow for those wanting a simple way to upgrade games to the next-gen console.",
    "In this case, players in the UK and Europe have reportedly been sent Russian versions of the game and so are prevented from upgrading, thanks to compatibility issues. The same also happened back near the PS5’s launch with copies of Assassin’s Creed Valhalla, and the issue took weeks to fix.",
    "Meanwhile Xbox players wanting to upgrade to the Series X version of the game need only boot up their copy of Far Cry 6 and download a digital patch.",
    "Far Cry 6 is far from the only game to cause headaches for PS5 players looking to enhance their PS4 library of games. All the way back at launch, players were left scratching their heads when Sony announced that Marvel’s Spider-Man owners would have to buy a brand new version of the game to enjoy remastered versions of its graphics.",
    "More recently Sony announced plans to offer players a free PS5 upgrade for Horizon Forbidden West when it launches later this year – but only if they purchased the most expensive editions of the PS4 game. Sony did backtrack on its plans here – now offering everyone a free upgrade from PS4 to PS5 – but announced future first-party games won’t be getting free upgrades.",
    "All Xbox first-party games get free, automatic enhancements thanks to Smart delivery.",
    "Even when the upgrades are free it hasn’t been plain sailing. Back in July, A Plague Tale: Innocence fans had to follow a confusing list of steps to get their free PS5 upgrade. If you didn’t want to start your game over from scratch you’d need to download the latest PS4 patch on your old console, turn on cloud saves to upload your data then download your save file on PS5 all, before booting up the game once on the new hardware.",
    "On Twitter, the A Plague Tale Twitter account (perhaps unintentionally) highlighted the ridiculousness of these hoops players had to jump through on PS5 by noting that the Xbox One to Series X cross-progression was “automatic”.",
    "At this point we’re honestly surprised with the level of civility Xbox has shown by not firing back. Sony wouldn’t be playing so nice, evidenced by its tongue-in-cheek Official PlayStation Used Game Instructional Video from 2013.",
    "In the clip, Sony highlighted the ease with which friends could share used games – simply handing the disc over – in response to Microsoft’s strange always-online Xbox One plans that would lock games to one account.",
    "The relatively low production budget behind the video gives just one clue to how desperate Sony wanted to capitalize on its rival's slipup, and it has ridden that wave since; Sony dominated the PS4 vs Xbox One battle and its hardware is taking early leads against the Xbos Series X",
    "If the green machine wants to get its own back, it need only point out the difficulty players have upgrading their PS4 library. With not many next-gen games having released this year either a lack of library upgrades severely limits the usefulness of these brand new consoles – you might as well have saved your money and stuck with the outdated hardware.",
    "We’ll have to see if Sony finds a way to make the PS4 to PS5 upgrade process simpler, as even gaming powerhouses like Ubisoft have yet to grasp its intricacies.",
    "However, after waiting nearly a year for changes to be made, we’d be surprised if Sony fixed the problem now. Most likely it’s just waiting for PS5 stock issues to end so it can sunset the PS4 as soon as possible and be done with the need for next-gen upgrades altogether.",
    "Hopefully it’ll have its act together when the PS6 comes out."
  ],
  "headers": {
    "8": "Xbox has enough ammo to fire back"
  },
  "links": {
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "reportedly": "https://www.videogameschronicle.com/news/ubisoft-says-its-investigating-wrong-ps4-far-cry-6-versions-in-europe/",
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Marvel’s Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "buy a brand new version of the game": "https://www.techradar.com/news/no-you-cant-upgrade-spider-man-ps4-to-the-ps5-remastered-version",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "offering everyone a free upgrade from PS4 to PS5": "https://www.techradar.com/news/horizon-forbidden-west-lack-of-free-ps5-upgrade-isnt-a-surprise-but-its-still-sad-to-see",
    "Smart delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "A Plague Tale: Innocence": "https://www.techradar.com/news/yet-another-ps4-to-ps5-upgrade-is-needlessly-confusing-on-sonys-console",
    "always-online Xbox One plans": "https://www.techradar.com/news/gaming/consoles/from-reveal-to-retail-how-we-arrived-at-the-xbox-one-day-one-edition-1201497",
    "PS6": "https://www.techradar.com/news/ps6"
  }
}