{
  "source": "https://www.techradar.com/news/doom-on-twitter-is-possibly-the-worst-way-to-play-so-far",
  "title": "Doom on Twitter is possibly the worst way to play so far",
  "category": "gaming",
  "updated": "2021-10-18T10:00:25Z",
  "author": "hamish-hector",
  "summary": "Doomscrolling gets a new meaning",
  "article": [
    "Browsing Twitter might leave you feeling like you’ve wandered through the depths of hell, but now you can actually do that on the platform by playing Doom. Yep, that's right, the classic FPS game is now playable on Twitter (provided you’re good at coding and love trial and error).",
    "This isn’t the first weird place we’ve seen the game series crop up. Users have managed to play Doom games on a wide range of console alternatives from pregnancy tests to smart fridges proving that you don't need a PS5 after all. Doomguy is even making an appearance in the family-friendly Super Smash Bros. Ultimate via a Mii costume.",
    "But can this unstoppable force keep charging ahead? Can we actually play Doom on anything?",
    "If you want to play Doom on Twitter for yourself you need to head over to Tweet2Doom and reply to its pinned tweet. By following the input instructions in the images you’ll be able to issue commands to a bot which will then play them out in Doom and provide you with the rendered video of the results.",
    "Here’s what the recommended starting commands look like:",
    "Through trial and error and across multiple replies players have been tasked with completing an entire run of the game. The first chain to traverse through a level, as well as those who can beat the level fastest, will be shared on the Tweet2Doom page as a reward.",
    "The creators are also asking for fan-submitted achievements so that players can race to complete specific goals that aren’t just ‘finish the level’.",
    "Doom has two advantages going for it that allow the series to be playable across so many different consoles. The biggest is the simplicity of the original title that came out in 1993.",
    "While at the time it was truly ground-breaking, Doom's once mind-blowing graphics and controls don't compete with the kinds of games we have today. However, that makes it incredibly simple to run – so as long as you have even the most bare-bones computing components you can cobble together a version of the game that will work.",
    "Its second advantage is Xbox Cloud Gaming. This tool allows you to play certain games – including the Doom series – on devices that can connect to the internet. It's intended for smartphones, consoles, and computers, but as we saw with the Samsung smart fridge you can find a way to make a cloud game playable on just about any modern display.",
    "As our devices incorporate more and more smart features, and computing components crop up in progressively stranger places we'll undoubtedly see Doom follow just behind – why not Doom on a smart blender, or an electric toothbrush?",
    "For as long as Doomguy continues his fight against the forces of hell, so too will he serve as a reminder of just how prevalent technology is in our lives today."
  ],
  "headers": {
    "3": "How to play Doom on Twitter",
    "7": "Why is Doom so easy to play on anything?"
  },
  "links": {
    "pregnancy tests": "https://twitter.com/Foone/status/1302820468819288066?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1302820468819288066%7Ctwgr%5E%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Fuk.pcmag.com%2Fgames%2F128528%2Fyes-doom-is-playable-on-a-pregnancy-test",
    "smart fridges": "https://youtu.be/7R0Rtua7y5w",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "Tweet2Doom": "https://twitter.com/tweet2doom",
    "Xbox Cloud Gaming": "https://www.techradar.com/news/xbox-cloud-gaming-is-now-available-for-xbox-insiders-to-test",
    "Samsung smart fridge": "https://www.polygon.com/2020/10/13/21514933/doom-eternal-refrigerator-door-samsung-smart-refrigerator-xbox-game-pass-richard-mallard"
  }
}