{
  "source": "https://www.techradar.com/news/the-6-biggest-new-camera-features-on-the-iphone-13-and-iphone-13-pro",
  "title": "iPhone 13 and iPhone 13 Pro: The 7 biggest new camera features",
  "category": "cameras",
  "updated": "2021-09-16T17:47:50Z",
  "author": "mark-wilson",
  "summary": "Our pick of the iPhone 13's new snapping talents",
  "article": [
    "The iPhone 13 and iPhone 13 Pro have landed – and as we've come to expect from new iPhones, some of their most intriguing features are built into those camera modules on the back.",
    "Whether you prefer to shoot stills, video or a mixed diet of both, there are some fascinating new photographic features on this year's iPhones, and we've rounded up the best ones in this helpful guide of their fresh snapping skills.",
    "Naturally, both the iPhone 13 and iPhone 13 Pro series have been equipped with new camera hardware, with the latter receiving the largest sensors seen on any Apple smartphone to date. But these days, it's the computational software features that are driving the big changes in our pocket cameras, and Apple has again rustled up some new ones for us to take for a spin.",
    "We've listed the most intriguing camera features below in rough order of our excitement about them, and given our thoughts on whether they're as interesting as Apple claims they are – or if it's again spinning its famed reality-distortion field.",
    "Before we get cracking, just a note that our references to the 'iPhone 13' below encompass both the iPhone 13 and iPhone 13 mini, while mentions of the 'iPhone 13 Pro' cover both the iPhone 13 Pro and iPhone 13 Pro Max. With that housekeeping out the way, here are all the photographic and video skills we're looking forward to testing out on Apple's new iPhones – starting with the promising Cinematic mode...",
    "The biggest new camera upgrade for video shooters on the iPhone 13 and iPhone 13 Pro is the new 'Cinematic mode'. We've seen the ability to automate a 'focus rack' (the technique of changing focus from one object to another mid-shot) on other phones like the Sony Xperia 1 II, but this is the first time we've seen it on iPhones – and Apple's new mode does appear to go much further than its rivals.",
    "There are two main computational tricks in 'Cinematic mode'. The first is that algorithms, which Apple says are trained based on classic cinematography, will automatically figure out a typical 'focus rack' for your scene.",
    "In Apple's example of a Knives Out-style short film, this mostly involved people walking into the frame and gazing away at another person – in both cases, the iPhone 13 series will apparently recognize what's happening and automatically pull focus for you. You'll also be able to override this with the usual tap-to-lock focus.",
    "This didn't look absolutely foolproof in Apple's demo, with a little bit of AF wobble, so we'll be interested to see how well this works in practice. But the much more interesting feature of 'Cinematic mode', which we haven't seen elsewhere, is that it uses a combination of machine learning and disparity (or the different perspectives of its cameras) to create a depth map that's built into the video.",
    "This is a big deal, as it moves toward a video 'Portrait mode' that allows you to adjust your focus after capture. Apple says you'll be able to change the level of bokeh in the Photos app and iMovie for iOS, and this ability will also be coming soon to iMovie for macOS and Final Cut Pro in future updates that will require macOS Monterey. It might be early days for the tech, but it's definitely one to watch.",
    "We've seen some good smartphone macro modes on phones before, from the Huawei P30 Pro to the more recent Xiaomi Mi 11's telemacro lens, but this is something that's been sorely lacking on iPhones. Luckily, the iPhone 13 Pro and iPhone 13 Pro Max have finally fixed that some with new macro powers on their ultra-wide camera.",
    "Apple says the new ultra-wide camera, which has a bright f/1.8 aperture and 120-degree field of view, has a new lens design and autofocus system that will allow it to focus on (and magnify) subjects from as little as 2cm away.",
    "Interestingly, Apple also says that these new macro powers extend to video, including the Slo-mo and Time-lapse modes. The early samples snapped by its pro photographers naturally look impressive, but we're looking forward to seeing how it fares with simple point-and-shoot snapping in natural light.",
    "Another potentially handy, if slightly basic, tool that'll be available on the whole iPhone 13 series is 'Photographic Styles'. These work a bit like Adobe Lightroom presets that allow you to define a particular look for your photos, only they're applied at the point of capture rather than in post-production.",
    "This means the iPhone's computational algorithms can decide which local parts of an image should be tweaked, while leaving things like skin tones alone. Disappointingly, there'll only be four 'Photographic Styles' to choose from initially, including 'rich contrast' and 'vibrant'.",
    "While they certainly sound more nuanced than slapping a simple filter on your snaps, which would make global adjustments to the whole photo, the 'Photographic Styles' themselves do seem a little simplistic and lacking in variety. It'll be interesting to see if Apple ultimately lets you create and save your own styles, beyond just tweaking the 'tone' and 'warmth', or whether it'll leave that kind of tinkering to third-party apps.",
    "As the rumors predicted, Apple will be introducing its ProRes video format to the iPhone 13 Pro series \"later this year\".",
    "If you want to dive deep into what that means, head to our Apple ProRes explainer. But in short, it's a compressed video format that brings the benefit of being relatively easy to edit in programs like Apple Final Cut Pro and Adobe Premiere Pro, without losing any noticeable detail or dynamic range.",
    "Apple hasn't yet revealed which one of the six existing ProRes formats will be supported on its iPhone 13 Pro models, but it did say you'll able to record 4K/30p ProRes files. Unless you choose the lower-capacity 128GB model, in which case you'll annoyingly be downgraded to 1080p/30p video.",
    "It's not yet clear why that's the case, but it's an odd footnote in what is otherwise another pretty big upgrade for more advanced video shooters who are looking to use their iPhone as a handy B-cam.",
    "Apple says the iPhone 13 and iPhone 13 Mini will get an \"improved Night mode\", but it's the 'Pro' models that are again getting an additional treat in the form of Night mode across all three of their cameras.",
    "For many people, this might actually be the biggest camera upgrade on the new iPhone Pros, given how versatile Night mode is. In our guide to taking professional portrait photos with your phone, pro photographer Damien Demolder said that \"sometimes a night mode can be useful in normal conditions to reduce contrast with accentuated dynamic range\".",
    "We've previously seen the Samsung Galaxy series offer night mode on their telephoto and selfie cameras, so it's not a new concept. But the option of using Apple's Night mode on the iPhone 13 Pro's new 77mm equivalent telephoto camera is one we're looking forward to trying out, particularly for low-light portraits.",
    "Both the iPhone 13 and iPhone 13 Pro have seen their main 'wide' cameras get larger sensors. Impressively, the iPhone 13 and iPhone 13 mini inherit the same main camera as last year's iPhone 12 Pro Max, with its 1.7-micron pixels, Sensor-shift optical stabilization and f/1.6 aperture. Considering the iPhone 12 Pro Max currently sits third in our guide to the best camera phones, that bodes well for their camera performance.",
    "Not to be outdone, the main 'Wide' cameras of the iPhone 13 Pro series feature the largest-ever sensors seen on any iPhone, with 1.9-micron pixels backed up by the same Sensor-shift stabilization and a bright f/1.5 lens. According to Apple, this brings a 2.2x improvement in low-light shooting compared to the iPhone 12 Pro Max, although it's not exactly clear what that's referring to. Noise? Dynamic range? We'll soon find out when we take them out for a test run.",
    "We've now reached the point where the effect of traditional hardware improvements like sensor size is being eclipsed by computational boosts like Smart HDR 4 and Night mode, which is why this is last on this list.",
    "But bright lenses and beefy sensors are certainly a good foundation for any smartphone camera, and we're looking forward to seeing how both the iPhone 13 and iPhone 13 Pro models perform in the real world very soon.",
    "Apple still hasn't embraced the folded optics seen on other phones like the Samsung Galaxy S21 Ultra, which allow them to hit 10x optical zoom. But the telephoto cameras on the iPhone 13 Pro and Pro Max have at least been given some extra reach with a 3x zoom.",
    "This pushes its equivalent focal length to 77mm, which is a handy one for portraits as well as travel snapping. But there's a slight catch – in order to get that reach, the maximum aperture has gone down from f/2.2 to f/2.8. This means the sensor will be getting less light, so will that mean lower image quality?",
    "Not necessarily, as computational processing (and the availability of Night mode on all lenses) could potentially even out the difference from last year's telephoto lens. But it's something we'll be keen to test and it's a detail Apple understandably wasn't keen to highlight."
  ],
  "headers": {
    "5": "1. Cinematic mode (iPhone 13 and iPhone 13 Pro)",
    "10": "2. Macro mode (iPhone 13 Pro)",
    "13": "3. Photographic Styles (iPhone 13 and iPhone 13 Pro)",
    "16": "4. Apple ProRes support (iPhone 13 Pro)",
    "20": "5. Night mode on all cameras (iPhone 13 Pro)",
    "23": "6. Larger camera sensors (iPhone 13 and iPhone 13 Pro)",
    "27": "7. Longer telephoto lens (iPhone 13 Pro)"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Apple ProRes explainer": "https://www.techradar.com/news/what-is-apple-prores",
    "taking professional portrait photos with your phone": "https://www.techradar.com/news/how-to-take-professional-portrait-photos-with-your-iphone-or-android-phone",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone"
  }
}