{
  "source": "https://www.techradar.com/news/huawei-cfo-meng-wanzhou-returns-home-after-us-drops-fraud-charges",
  "title": "Huawei CFO Meng Wanzhou returns home after US drops fraud charges",
  "category": "computing",
  "updated": "2021-09-27T08:53:37Z",
  "author": "steve-mccaskill",
  "summary": "Meng Wanzhou has left Canada after three years under house arrest",
  "article": [
    "Huawei CFO Meng Wanzhou has returned to China after US prosecutors dropped charges of fraud that led to her arrest in Canada three years ago.",
    "The US alleges Meng aided Huawei to avoid sanctions on doing business in Iran, which if proven, could have put multinational banking organizations at risk of breaking those sanctions too.",
    "She was arrested in Canada in December 2018, while transferring through the country, and has remained in Vancouver on bail ever since, fighting the extradition.",
    "Meng’s legal team had argued that her extradition should be blocked because the US misled Canada with its evidence and because comments made by former President Donald Trump would influence the outcome of any trial. In any case, they say, no fraud took place.",
    "The suggestion was that the charges were politically motivated. Meng is the daughter of Huawei founder Ren Zhengfei, and the company has long been excluded from the US market on national security grounds. Meanwhile, American companies are banned from doing business with the firm.",
    "Accordingly, the incident had strained relations between China and both the US and Canada, the latter of which had said it previously had no intention of suspending the extradition.",
    "A judge in British Columbia was due to set a date for the extradition ruling next month but a deal has now been struck to end the investigation.",
    "“I'm very pleased that Sabrina Meng and the US Department of Justice have reached a deferred prosecution agreement (DPA) and it has been approved by Judge Donnelly,” said Meng’s legal team.",
    "“Under the terms of this agreement, she will not be prosecuted further in the United States and the extradition proceedings in Canada will be terminated. She has not pleaded guilty and we fully expect the indictment will be dismissed with prejudice after fourteen months. Now, she will be free to return home to be with her family.”",
    "Huawei has welcomed the news: “We look forward to seeing Ms. Meng returning home safely to be reunited with her family. Huawei will continue to defend itself against the allegations in the US District Court for the Eastern District of New York.",
    "Meng has now left Canada has arrived in Shenzhen, the Chinese city where Huawei is headquartered. Meanwhile, two Canadian citizens who were arrested in China shortly after Meng’s own detainment, have been allowed to return home.",
    "China has denied that the arrests of Michael Spavor and Michael Kovrig were related to Meng’s troubles."
  ],
  "headers": {
    "3": "Huawei Meng Wanzhou"
  },
  "links": {
    "Meng Wanzhou": "https://www.techradar.com/news/canadian-judge-to-rule-on-huawei-cfo-extradition-in-october",
    "Huawei": "https://www.techradar.com/news/huawei-ban"
  }
}