{
  "source": "https://www.techradar.com/news/ereader-screens-are-about-to-get-a-big-upgrade",
  "title": "Ereader screens are about to get a big upgrade",
  "category": "tablets",
  "updated": "2021-05-26T03:04:49Z",
  "author": "sharmishta-sarkar",
  "summary": "E Ink's new On-Cell Touch technology could make ereaders better and cheaper",
  "article": [
    "The company that makes the screens for the most popular ereaders has just announced a new technology that will make reading on electronic paper displays a better visual experience, while also possibly bringing down the cost of the devices.",
    "E Ink's new On-Cell Touch ePaper is a module that comes with the touch sensor built into the screen itself. Before this, the touchscreens we're so familiar with on ereaders had the touch sensor laminated above the E Ink displays – working as a separate component of the device.",
    "This small change, according to E Ink, will make ereader screens a much better visual experience, with text becoming sharper, clearer and with better contrast.",
    "The new screen technology will work on both black-and-white as well as color displays.",
    "E Ink's Carta grayscale displays – the black-and-white screens on popular ereaders from Amazon and Kobo – will see a 30% increase in contrast ratio, the company claims, while E Ink Kaleido color screens (like the one used in the PocketBook InkPad Color) will get a better 40% bump in contrast ratio and 15% increase in color saturation with the use of the new On-Cell Touch module.",
    "The integration of the touch sensor within the display itself also means the new technology can be used on flexible e-paper screens, like the E Ink Mobius, as well as in TFT (thin-film transistor) displays that have a glass backplane. In theory, that means this tech can be used in TFT LCD displays like the ones on our computer monitors and TVs, potentially making interactive panels more mainstream.",
    "The new On-Cell Touch module uses a stacked design that, according to E Ink, will drop the production cost of making ereaders as it eliminates the step where the touch sensor needs to be added on top of the electronic paper display.",
    "If this saving is passed on to the end user, next-gen premium ereaders that could potentially replace the likes of the Kobo Forma and Amazon Kindle Oasis might be a bit more affordable. And if this tech somehow filters down to displays generally, it could reduce the price of touchscreen monitors.",
    "An integrated touch sensor could, theoretically, make the screens more responsive, too. E Ink hasn't released any information in terms of performance, but an \"easy on the eyes\" experience will be a welcome improvement for avid readers."
  ],
  "headers": {
    "3": "Better and cheaper displays"
  },
  "links": {
    "On-Cell Touch ePaper": "https://www.eink.com/news.html?type=releasedetail&id=2303&year=2021&page=1",
    "PocketBook InkPad Color": "https://www.techradar.com/news/pocketbooks-new-78-inch-inkpad-color-is-the-color-ereader-youve-been-waiting-for",
    "E Ink Mobius": "https://www.techradar.com/news/portable-devices/other-devices/flexible-screens-won-t-guarantee-flexible-devices-says-e-ink-1182273",
    "Kobo Forma": "https://www.techradar.com/reviews/kobo-forma-review",
    "Amazon Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review"
  }
}