{
  "source": "https://www.techradar.com/news/toyota-mirai-2021-review",
  "title": "Toyota Mirai (2021) review: comfortable and competent, but a hydrogen headache",
  "category": "car-tech",
  "updated": "2021-10-11T06:02:41Z",
  "author": "myriam-joire",
  "summary": "Not the EV you're looking for",
  "article": [
    "Back in 2018, we drove Toyota's first generation Mirai hydrogen fuel-cell electric vehicle (FCEV) alongside MrMobile, and while the technology was interesting, the car was uninspiring to drive, and refueling was a major challenge - even in hydrogen friendly California.",
    "Basically, while the original Mirai got the job done, it was nothing more than an overpriced and compromised hydrogen-powered Toyota Corolla.",
    "Fast forward to 2021, and Toyota's second generation Mirai hydrogen FCEV is upon us, with sharp new looks, a lower price, a better platform, more range, and updated technology.",
    "So, does this new Mirai fix the old car's driving and packaging compromises, and - more importantly - has the dismal hydrogen refueling infrastructure improved over the past 3 years? We drove a 2021 Toyota Mirai for a week to find out.",
    "The 2021 Mirai starts at $49,500 before incentives - that's $9,050 less than the previous generation - and it still comes with six years (or $15,000) of complementary hydrogen.",
    "It's now bigger, built on the same RWD platform as the Lexus LS sedan, with seating for five. Range is has increased 30% over its predecessor, while power is up slightly, with 182hp and 300ft-lb of torque.",
    "The exterior is modern and sophisticated, and the RWD proportions are outstanding. It’s a gorgeous car from every angle. You're basically getting a Lexus-like exterior without the ugly spindle grille.",
    "Inside, it's a different story. There's nothing wrong with materials and build quality, but the interior's Camry-like appearance is busy and uninspired. Despite being whisper quiet, the cabin lacks the luxury of a modern Lexus.",
    "The 2021 Mirai is reasonably spacious inside, but this sense of space is hampered by a high cowl, and by one of the hydrogen tanks, which takes up valuable real-estate, and makes the rear middle seat pretty cramped.",
    "The infotainment system consists of a 13.2-inch touchscreen with navigation and a 14-speaker JBL-branded audio system. Unfortunately, the user interface feels quite sluggish, and looks like it’s from a decade ago.",
    "Thankfully, the 2021 Mirai features Apple CarPlay and Android Auto (both wired), which are the perfect antidote to the built-in infotainment’s clunky user experience. Amazon Alexa integration is also available, along with a Qi-compatible wireless charging pad, and four USB Type-A ports.",
    "The Mirai is definitely tuned for comfort. If that's what you're after, this Toyota delivers. Just don't expect much performance - 0 to 60mph happens in a leisurely 9.2 seconds.",
    "But let's talk about the elephant in the room, and that's the hydrogen refueling infrastructure - or the lack thereof. Despite the San Francisco bay area having over a dozen hydrogen stations, most of them were out of fuel during the week we spent reviewing the Mirai. Hydrogen is also expensive: it costs about $100 to fully refuel.",
    "Overall, the Toyota Mirai is an extremely comfortable and competent vehicle that looks fantastic, but is let down by an abysmal hydrogen refueling infrastructure.",
    "While it's definitely interesting, it's simply not exciting. This is a car from an alternate reality where Tesla doesn't exist (or failed), battery EVs never took off, and hydrogen FCEVs are \"the next big thing\". Problem is, nobody - except Toyota it seems - lives in that reality.",
    "The 2021 Toyota Mirai prices start at $49,500 / £54,920 before incentives. It's only available as a three-year business lease in Australia, and costs AU$63,000.",
    "In the US, it comes in two trims: XLE ($49,500) and Limited ($66,000). Options include an advanced technology package ($1,410) on the XLE trim and 20-inch wheels ($1,120) on the Limited trim. Toyota also includes six years (or $15,000) of complementary hydrogen.",
    "While the XLE trim is already well equipped, the Limited trim boasts several additional features.",
    "It adds a color HUD (heads-up display), multiple cameras for a 360-degree view, front and rear parking sensors, self-parking, a switchable digital rearview mirror with Homelink, rear climate, heated and ventilated seats all around, a fixed panoramic glass roof with a power sunshade, a rear window power sunshade, and rear side window sunshades.",
    "In addition, the Limited trim includes a control panel (with a display and capacitive buttons) in the folding rear armrest that lets rear passengers adjust the volume, rear climate, rear heated and ventilated seats, and rear window power sunshade.",
    "The 2021 Toyota Mirai we tested cost $67,545 and came with the Limited trim ($66,000), SuperSonic Red paint ($425), and the optional 20-inch alloy wheels ($1,120).",
    "As we mentioned, the 2021 Mirai is now built on the same TNGA-L (GA-L) large RWD platform as the Lexus LS sedan, which is a massive upgrade over the original Mirai, which was built on Toyota's older MC compact FWD platform, shared with the Prius, RAV4, and Corolla.",
    "This means the 2021 Mirai is a bigger, more premium, and better looking vehicle. We're big fans of this new design - it's refined and striking, with beautiful RWD proportions.",
    "While the optional 20-inch wheels on the Limited trim we drove really bring the Lexus-like exterior together, the interior is a bit of a letdown.",
    "Basically, it's standard issue Toyota inside - it's perfectly fine, but it doesn't elicit much joy or excitement. Obviously, materials and build quality are top notch, but you'd be forgiven to think you're sitting in a Camry or an Avalon.",
    "It's a busy cabin, with a lot of controls and piano black surfaces that attract fingerprints.",
    "Once you get past its slightly bland and generic design, you'll find this interior to be comfortable, spacious, and quiet.",
    "The dashboard features an 8-inch multi-information instrument display in front of the driver, plus a 13.2-inch center-mounted touchscreen, but the high cowl restricts forward visibility.",
    "And while it's easy to adjust the power memory seats and steering wheel to compensate for this, it reduces the sense of space.",
    "Since the 2021 Mirai is larger, it now seats five (vs four previously). Unfortunately, one of the hydrogen tanks resides where the transmission, diveshaft, and exhaust would be located in a RWD ICE (internal combustion engine) vehicle, splitting the floor longitudinally in half.",
    "The resulting 'hydrogen tank tunnel' limits center console storage, and severely compromises leg space for the rear middle seat passenger.",
    "With the hydrogen fuel cell located under the hood, there's no room for a frunk. And with the battery pack positioned between the rear seats and the trunk, the rear seats don't fold.",
    "This also means trunk space is limited to just 9.6 cubic feet (321 liters). Speaking of the trunk, it features a soft close mechanism, but lacks power struts to fully open or close the lid. Also strangely missing here is a heated steering wheel.",
    "Somehow, we expected both these features to carry over from the Lexus LS sedan the 2021 Mirai is based on.",
    "After all, the Limited trim inherits the fixed panoramic glass roof from its luxury cousin. It keeps the cabin feeling airy, and even includes a power sunshade.",
    "Finally, while the heated faux-leather seats (also ventilated on the Limited trim) match this vehicle's comfortable character, we'd have liked a little more support on longer drives.",
    "Like other hydrogen FCEVs, the Mirai combines hydrogen stored in high-pressure tanks on board the car with the oxygen present in the air to generate electricity on demand inside a fuel cell.",
    "This electricity is then stored in a small battery (about the same size as a hybrid vehicle battery), and used to power an electric motor. Water is the only byproduct (or 'waste') from this process, so hydrogen FCEVs have zero emissions.",
    "The 2021 Mirai stores hydrogen in three tanks (vs two previously) for an increased range of 357-402 miles (vs 312mi previously) - depending on trim.",
    "In addition, it features a 1.24KWh Li-ion battery pack (vs 1.6KWh nickel-metal hydride previously) and a more powerful 182hp / 300ft-lb motor (vs 152hp / 247ft-lb previously), enabling the 0-60mph sprint in 9.2s. While that's not spectacular, there's plenty of torque, so it doesn't feel slow.",
    "Behind the wheel, it's all about comfort over performance, and if that's your jam, Toyota's got you covered.",
    "While the suspension is tuned for comfort - with a compliant and soft ride - handling is pretty decent. Toss the 2021 Mirai into a corner and that RWD platform actually delivers a rewarding experience.",
    "It's the same with the steering, which is quite light - making this car easy to drive - but provides more feedback than expected.",
    "The 2021 Mirai's brakes are disappointing. Like with its hybrid cars, Toyota blends regen and hydraulic braking here, and while it works fine, it feels disconcerting.",
    "Basically, the brakes are hard to modulate because there's a slight delay between when you press the pedal and when the brakes activate. Also, while there's an auto hold feature, it turns off every time you restart the car, which is both annoying and unwarranted.",
    "Speaking of which, you can boost the amount of regen braking by selecting the brake gear (B). But unlike other cars with this option, the 2021 Mirai always wants to return to the standard drive gear (D) after some time.",
    "We think this might have something to do with the state of charge of the battery pack or with hill detection. It's unfortunate since one pedal driving is one feature that really differentiates EVs from the ICE cars.",
    "Refueling the Mirai is a significant challenge. In the US, there are only 45 hydrogen refueling stations, 43 of which are located in California alone, with an even split between the greater San Francisco / Sacramento and Los Angeles / San Diego areas.",
    "During the week we spent testing the 2021 Mirai most of the dozen or so hydrogen refueling stations within a one hour drive from San Francisco were out of fuel.",
    "Making things worse, the 2021 Mirai's navigation system kept suggesting hydrogen refueling stations that were closed because it wasn't receiving timely and accurate status data.",
    "The California Fuel Cell Partnership map was the only resource we found with timely and accurate status data on local hydrogen refueling stations. It directed us to the only working hydrogen refueling station close to us, 10 miles (16km) away.",
    "We refueled twice, spending about $50 each time, and netting about half a tank each time. That's expensive, but it was definitely as quick and easy as refueling with gas or diesel.",
    "On our first refueling stop, we talked with an original Mirai owner and asked if these hydrogen refueling stations were often out of fuel. They said it's a common occurrence, and that they refuel as soon as their car's hydrogen level dips below half, \"just in case\".",
    "When it comes to infotainment, the 2021 Mirai packs a 13.2-inch touchscreen with navigation and a JBL-branded audio system with 14-speaker. Sadly, it sounds middling at best.",
    "While the display is large and reasonably high resolution, the user interface isn't very responsive. The entire system feels sluggish, and the UI design looks dated.",
    "Spec-wise, there's Bluetooth and USB audio support, along with FM / AM / Sirius-XM (satellite) radio functionality.",
    "On the plus side, the 2021 Mirai offers (wired) Android Auto and Apple CarPlay. That's a huge relief considering the infotainment system's lackluster user experience.",
    "You'll also find Amazon Alexa integration, four USB Type-A ports (two in front, two in back), and a Qi-compatible wireless charging pad.",
    "Vehicle remote control - via Toyota's Remote Connect app - and WiFi hotspot functionality are also enabled thanks to built-in LTE connectivity.",
    "Additional features are available depending on trim and options. The advanced technology package adds a 360-degree view plus front and rear parking sensors to the XLE trim.",
    "But the Limited trim comes with a 360-degree view, a color HUD (heads-up display), a switchable digital rearview mirror with Homelink, front and rear parking sensors, and self-parking. A backup camera is standard since it's mandatory in the US.",
    "The 2021 Mirai features Toyota Safety Sense 2.5+. This driver assistance and safety package includes pedestrian warning, forward collision warning, automatic emergency braking, adaptive cruise control with automatic steering, traffic sign recognition, lane keeping assist, and lane departure warning.",
    "In addition, this vehicle comes with automatic wipers, headlights, and high-beams, plus blind spot warning and rear traffic alert.",
    "On paper, these features give the 2021 Mirai level 2 ADAS capability. But in practice, the automatic steering feature didn't inspire much confidence.",
    "We found the implementation very basic, with the car often bouncing between lane markings. It's a far cry from Tesla's Autopilot, which glides down lanes with aplomb.",
    "Toyota's automatic steering also requires the driver to keep both hands on the wheel, instead of monitoring driver attention.",
    "First reviewed: September 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "15": "Toyota Mirai price and availability",
    "21": "Toyota Mirai design",
    "36": "Toyota Mirai drive, range and fueling",
    "53": "Toyota Mirai specs and tech",
    "66": "Don't buy it if"
  },
  "links": {
    "alongside MrMobile": "https://www.youtube.com/watch?v=Em1rtbZbJ3U",
    "California Fuel Cell Partnership map": "https://cafcp.org/stationmap"
  }
}