{
  "source": "https://www.techradar.com/news/googles-airtable-rival-is-now-officially-a-google-cloud-product",
  "title": "Google's AirTable rival is now officially a Google Cloud product",
  "category": "computing",
  "updated": "2021-06-15T16:00:06Z",
  "author": "anthony-spadafora",
  "summary": "Tables has graduated from Google's Area 120 incubator",
  "article": [
    "After launching a new work tracking tool from its Area 120 incubator last year, Google has announced that its AirTable rival Tables will soon become a “fully-supported Google Cloud product”.",
    "In an email sent out to existing Tables users, the search giant explained that the tool's beta launch last year was a success which is why Google Cloud plans to fully invest in the product going forward, saying:",
    "“Last September, we beta launched Tables in Area 120 with the goal of proving market demand for a solution that helps teams organize and track work, and it was a success! Google Cloud has committed to investing in this product area long-term. Moving forward, the beta version of Tables will still be available until we release a fully-supported Google Cloud product – which we expect to complete in the next year.”",
    "Tables is the brainchild of staff software engineer and now Tables general manager Tim Gleason who came up with the tool after having his own difficulties keeping track of projects.",
    "While Tables can be used for project management, the tool's developers believe it can also be used for a variety of different cases including IT operations, customer service tracking, CRM, recruiting, product development and more.",
    "However, what sets Tables apart from Asana, Trello and other project management software is the fact that it uses bots to handle a number of administrative duties such as scheduling email reminders for overdue tasks, messaging a group chat when new forms have been submitted, moving tasks to other workers' queues or updating tasks when schedules have changed.",
    "Head of Platform and VP/GM at Google Cloud Amit Zavery believes that the pandemic and the transition to working from home played a big role in the early success of Tables. This is because managers needed additional help tracking the progress of their remote workers. At the same time though, integrations with Office 365, Microsoft Access, Google Sheets, Slack, Salesforce, Box and Dropbox allow employees to use Tables with their existing tools.",
    "Although Tables offers both a free plan as well as a paid one, which costs $10 per user per month and ads support for up to 1,000 tables and 10,000 rows, pricing options for the tool could change once it is released as a fully-supported Google Cloud product in the next year.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "More than just project management"
  },
  "links": {
    "Area 120": "https://www.techradar.com/news/google-threadit-wants-to-try-and-kill-off-long-video-conferencing-calls",
    "AirTable rival": "https://www.techradar.com/news/rival-to-airtable-google-table-emerges-as-no-code-spreadsheet",
    "Google Cloud": "https://www.techradar.com/news/google-cloud-wants-to-help-secure-your-whole-enterprise-network",
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "Asana": "https://www.techradar.com/reviews/asana",
    "Trello": "https://www.techradar.com/reviews/trello",
    "project management software": "https://www.techradar.com/best/best-project-management-software",
    "Amit Zavery": "https://www.techradar.com/news/google-clouds-new-business-app-platform-requires-no-coding-at-all",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "free plan": "https://tables.area120.google.com/about#/",
    "TechCrunch": "https://techcrunch.com/2021/06/14/googles-airtable-rival-tables-graduates-from-beta-test-to-become-a-google-cloud-product/"
  }
}