{
  "source": "https://www.techradar.com/news/hbo-maxs-next-big-sci-fi-movie-from-the-westworld-creators-looks-pretty-cool",
  "title": "HBO Max's next big sci-fi movie from the Westworld creators looks pretty cool",
  "category": "entertainment",
  "updated": "2021-06-03T15:02:48Z",
  "author": "samuel-roberts",
  "summary": "Take a first look at Reminiscence, which has a boring title",
  "article": [
    "Warner Bros has released the first trailer for original sci-fi movie Reminiscence, starring Hugh Jackman. In North America, the movie will release on HBO Max at the same time it hits theaters, while countries like the UK will have to settle for exclusively seeing it on the big screen when it launches in August.",
    "While the title isn't particularly inspiring, the people behind this movie make us reasonably optimistic – this is the first movie from director Lisa Joy, one of the co-creators of HBO's consistently great Westworld. Writer Jonathan Nolan, the show's other co-creator and Joy's husband, is also one of the producers of Reminiscence. The cast includes Thandiwe Newton from that show, along with Rebecca Ferguson from the Mission: Impossible movies.",
    "Try and take the events of the trailer in, then we'll dissect what the movie is about below:",
    "Jackman plays the unfortunately named Nick Bannister, a PI who specializes in the mind, who resides along a mostly submerged Miami coastline. In a world obsessed with reliving memories, Bannister helps his clients recover moments they thought they'd lost. Everything suddenly goes pear-shaped when Bannister takes on a new gig from Mae (Ferguson) – when she goes missing, he's drawn into a web of conspiracies and other dangers.",
    "It looks like a sci-fi movie about romantic obsession, and it's hard not to be reminded of Inception, which superficially seems thematically similar. Reminiscence will hit US theaters and HBO Max (only for users on the $14.99 tier) on August 20, 2021, while UK viewers can see it in cinemas starting on August 18.",
    "It's really nice to see a big Hollywood studio spend some serious money on an idea that's not based on a comic book or a popular old movie – great, big-budget original sci-fi is evidently hard to get made these days if you're not Christopher Nolan or Denis Villeneuve.",
    "After three great, wildly different seasons of Westworld, it's cool to see Lisa Joy get the opportunity to make a film like this with a big star. While the concept certainly sounds like the familiar stuff of battered sci-fi anthology paperbacks, the level of the cast and visual splendor of the trailer make us optimistic about checking this out.",
    "These types of films come along so infrequently that we can only hope that it's a success, so other rising TV and movie talent get to have their swing at a sci-fi movie on this scale."
  ],
  "headers": {
    "5": "Analysis: a big bet on original sci-fi"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Westworld": "https://www.techradar.com/news/westworld-season-4"
  }
}