{
  "source": "https://www.techradar.com/news/why-vdi-is-even-more-important-for-hybrid-working",
  "title": "Why VDI is even more important for hybrid working",
  "category": "computing",
  "updated": "2021-04-27T10:51:37Z",
  "author": "paul-fisher",
  "summary": "A discussion on how VDI can support hybrid working",
  "article": [
    "As vaccine rollouts begin to gather pace, a return to the office looks more likely in 2021. However, many employees have got used to working from home and are unwilling to commit to a complete return to the office. Meanwhile, employers have realized the cost benefits of remote working and are rolling out flexible working policies for staff on a permanent basis.",
    "Nearly one year on from the start of the pandemic, many organizations still haven’t perfected the work from anywhere model. According to a recent report of UK employees, 62% of remote workers want their companies to provide better technology. That’s where a Virtual Desktop Infrastructure (VDI) solution can help.",
    "A VDI solution enables organizations to run fully functional virtual desktops enabling end users to access their desktops and applications from any device or location. It goes beyond the simple VPN systems that organizations may have implemented thus far. Its major selling point is the reduction of total cost of ownership, business mobility, remote access, IT agility and data security.",
    "Below are some of the benefits of using a VDI to facilitate permanent flexible working.",
    "One of the strengths of VDI is its easy integration with BYOD systems. At the start of the pandemic many companies who had legacy office set-ups issued employees with devices to enable them to work from home. However, as a phased return to the office begins many may judge it makes sense to continue with a permanent BYOD strategy. Aside from a reduced cost, with users accessing their desktops from laptops, smartphones, on the road, and at workstations, VDI provides simpler management from an IT perspective. It allows employees to use any personally owned device without set-up and continue to work uninterrupted.",
    "A VDI helps to avoid minimal interruptions during migrations or upgrades. Traditionally, migrations can be disruptive, putting certain functions out of action and reducing efficiency until complete. A VDI can make it much easier to migrate to new platforms by enabling testing remotely and easily switching between devices and platforms. It’s possible to run different operating systems, allowing users to switch simply by logging out and back in or by selecting the platform or application they wish to run on. For example, after a template is created, the IT team can instantly deploy several virtual machines by selecting the template and utilizing linked clones. This allows multiple virtual machines to share the same software installation, saving disk space and deployment time.",
    "VDI solutions are well placed to support hybrid cloud solutions which have a number of benefits for hybrid working. Although public cloud and on prem solutions have their advantages and disadvantages, organizations committing to a flexible and hybrid way of working may opt for a mix of both. Hybrid cloud offers the benefit of business continuity, providing resilience, recovery and contingency whilst reaping the benefits of secure on-premises solutions and the quick uptime and backups of cloud servers. A hybrid cloud can scale IT infrastructures up or down, as business needs change, while keeping sensitive workloads on-prem. For a hybrid work scenario, this is ideal because it gives IT administrators the flexibility to adjust the environment for back to the office whilst still ensuring data can be accessed from anywhere. The best VDI solutions will allow you to choose from on-premises, public cloud solutions such as Microsoft Azure, Amazon Web Services (AWS) and Google Cloud, or a hybrid of both.",
    "Any device can become prone to vulnerabilities when used over time, and cyber-attacks have risen as more employees have started worked from home. With a VDI solution data is stored on a centralized server instead of being spread around individual endpoints, improving security, whether this be via on-premises , hybrid or public cloud. A VDI solution may be easier to manage from an IT perspective, as a remote publishing solution helps to reduce costs by centralizing application management. A virtual application delivery puts IT in control, enabling admins to protect company data with encryption protocols and advanced filtering. Access policies can also be enforced depending on the specific user or device; the best VDI solutions allow the use of multi-factor authentication and should be able to integrate with third-party security solutions such as Google Authenticator, DualShield and Gemalto (formerly SafeNet).",
    "Perhaps the number one most important factor to any business when considering their IT solutions is cost. As organizations scale back offices, desk space and physical provisions for staff it makes sense to assume the same attitude will be applied to IT.",
    "The impact of the pandemic has hit many business profits and organizations may be seeking a more efficient way of operating. VDI can often be dismissed due to its complexity and implementation cost, however, the short-term upfront costs can be returned in improved efficiency. One of the strengths of a VDI solution is it reduces overheads and removes the need for office space, equipment and daily commodities in the long-term. It also requires fewer IT staff for maintenance, freeing up more time to be spent on other business-critical projects.",
    "However, VDI solutions do have their drawbacks. When deciding to implement any new piece of technology, organizations must weigh up their individual needs and current capabilities.",
    "Since VDI essentially means your users are working off the server, if the server and network go down, everyone gets impacted, which can adversely affect operations and result in lower productivity. Traditional VDI solutions can be expensive, requiring investment in a hefty amount of storage and compute, which can stop your software running smoothly if not accounted for. Be sure to choose a VDI solution that allows you to deploy the right technology, such as remote applications or desktops for you and your users and check it can integrate with your existing technology, on prem or in the cloud. The optimum solution will be cost effective, whilst also satisfying business needs.",
    "From a cost perspective it is important to choose a VDI solution without any hidden charges and complications. A common complaint is that VDI solutions can be complex and expensive, requiring a high spend on expensive hardware, licenses and software add-ons.",
    "An alternative, therefore, is a remote application delivery solution that makes VDI more intuitive and affordable. The best solutions also work with RDS and Remote PC and ensure that users can access all the apps they need to remain productive within today’s digital workspaces. Look for a solution that uses multi-device, multi-app workflows and supports multi-cloud deployments, including Microsoft Azure (Azure IaaS) and Amazon Web Services™ (AWS). You are aiming for a workspace that gives employees secure and comprehensive access to everything they need to be productive from any location they desire.",
    "The challenges of installation are closely tied to the concerns around upfront costs, therefore, to save a headache in the future, look for solutions with straightforward installation, simple all-inclusive licensing and easy options for scalability.",
    "Choosing a system that combines VDI and RDS is even more adaptable, and will allow you to mix and match different operating systems. For example, applications can be deployed on-premises but then scaled out to hybrid or public cloud, with auto-provisioning and auto-scaling to ensure that as demand fluctuates, businesses are best placed to respond.",
    "In the future, even as the necessity for remote working fades, organizations may be expected to facilitate a hybrid office environment and initiatives such as permanently scaling down office space and implementing a hot desk policy may become the norm. The key to ensuring an efficient system that maximizes productivity from anywhere, will be how well your IT system can support the needs of each individual employee. A remote application delivery solution can help with this."
  ],
  "headers": {
    "4": "Bring-your-own-device policies:",
    "5": "Flexibility:",
    "6": "Hybrid Cloud:",
    "7": "Data security:",
    "8": "Cost benefits:",
    "10": "Challenges of VDI",
    "11": "Higher impact of server and network downtime",
    "12": "Upfront cost",
    "14": "Installation",
    "16": "Is it right for you?"
  },
  "links": {
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "virtual desktops": "https://www.techradar.com/best/virtual-desktop-services",
    "desktops": "https://www.techradar.com/news/best-business-desktop-pcs",
    "applications": "https://www.techradar.com/best/best-android-apps-2021",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "IT infrastructures": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}