{
  "source": "https://www.techradar.com/news/ces-2022-will-return-to-las-vegas-but-with-a-twist-heres-what-to-expect",
  "title": "CES 2022 will return to Las Vegas, but with a twist - here’s what to expect",
  "category": "computing",
  "updated": "2021-11-13T20:25:04Z",
  "author": "joel-khalili",
  "summary": "The best of both worlds?",
  "article": [
    "There was no question in the organizers’ minds that CES, one of the world’s most famous technology events, would return to an in-person format as soon as the pandemic would allow.",
    "This year’s virtual event was considered a success, attracting more than 100,000 attendees across live and on-demand broadcasts. However, according to Karen Chupka, who heads up CES at the Consumer Technology Association (CTA), the transition to a digital-only format robbed the show of some of its heart and soul.",
    "“There are plenty of reasons exhibitors and attendees come to CES in-person, but serendipity plays a major role,” she told TechRadar Pro. “People come to the show with one purpose in mind, bump into somebody, and leave with a new idea, customer or business partner.”",
    "“That was the main feedback we received after virtual CES earlier this year. People missed out on the serendipitous interactions that just cannot be replicated online.”",
    "Happily, then, CES 2022 is set to make a triumphant return to Las Vegas in January, with a larger physical presence than ever before.",
    "Although Chupka and the rest of the CTA were eager to return to Vegas for CES 2022, the event will feel a little different than its most recent pre-pandemic edition, taking on a new hybrid form that draws on the best aspects of in-person and virtual events.",
    "Under this arrangement, some of the sessions and major product announcements will be livestreamed online and there will also be a level of interaction with the virtual audience.",
    "Like this year, sessions will also be uploaded to an on-demand streaming service and remain available for a month after the event finishes. This was one of the main takeaways from CES 2021, says Chupka: attendees who would usually be forced to pick and choose which sessions to attend could consume as much of the show as they pleased.",
    "“The digital event did allow us to achieve some goals we had been thinking about for a little while, like connecting people from all over the world to what’s happening at CES,” said Chupka.",
    "“For the 2022 event, we’re excited about taking a digital audience and bringing them into sessions at the physical show. We want to use the hybrid format as a tool to help connect more people and bring new audiences into the fold.”",
    "The digital platform will also allow attendees and exhibitors to set up virtual appointments with one another, in the same way they might at the physical show. And similarly, companies will be able to specify time slots to video conference with online attendees, simulating booth-side interactions.",
    "As for the in-person event, CES 2022 will be the largest ever in terms of physical footprint, spilling for the first time into the Las Vegas Convention Center’s west hall, which covers a whopping 1.4 million square feet.",
    "Chupka says this area will be used to showcase the latest developments in the automotive sector, focusing on electric and autonomous vehicles in particular, with roughly 180 exhibitors currently signed up to utilize the additional floorspace.",
    "In all, with the recent lifting of US travel restrictions, the CTA is expecting more than 1,500 companies from across the globe to have a physical presence at the show.",
    "As always, CES 2022 will act as a platform for showcasing the newest (and strangest) technologies across a wide range of categories, which should mean the show has a distinct flavor for attendees both physical and virtual.",
    "The main new categories will include non-fungible tokens (NFTs), space technology and food technology, Chupka told us. And sustainability-related products will also have a large presence.",
    "The thread connecting these new focus areas is a sharp rise in profile during the pandemic. NFTs, a type of blockchain-based digital collectible, have exploded since the turn of the year and continue to cause a stir, while the exploits of Blue Origin, Virgin Galactic and SpaceX have spurred debate around the viability and ethics of space tourism.",
    "The importance of food delivery and ordering systems during pandemic lockdowns also threw food technology into the limelight, Chupka noted. And sustainability continues to sit at the top of the agenda, as businesses seek out creative new ways to deliver on climate commitments.",
    "“With technology changing our lives in so many different ways, there’s more content for us to cover than ever,” said Chupka. “And we’re excited to be back.”"
  ],
  "headers": {
    "5": "A new hybrid format",
    "14": "What new tech can we expect?"
  },
  "links": {
    "virtual event": "https://www.techradar.com/best/best-virtual-event-platforms",
    "CES 2022": "https://www.techradar.com/news/ces-2022",
    "video conference": "https://www.techradar.com/best/best-video-conferencing-software",
    "non-fungible tokens": "https://www.techradar.com/news/nfts-are-seriously-hot-right-now-but-were-falling-into-a-familiar-trap",
    "space technology": "https://www.techradar.com/news/kamikaze-satellites-and-shuttles-adrift-why-cyberattacks-are-a-major-threat-to-our-ambitions-in-space"
  }
}