{
  "source": "https://www.techradar.com/news/fitbit-versa-2-vs-fitbit-versa-3",
  "title": "Fitbit Versa 2 vs Fitbit Versa 3",
  "category": "fitness",
  "updated": "2021-05-15T11:00:12Z",
  "author": "cat-ellis",
  "summary": "How to choose the right Fitbit for you",
  "article": [
    "If you're thinking about buying a fitness tracker, both the Fitbit Versa 2 and Fitbit Versa 3 are likely to be high on your list of potential candidates, so we're here to help you pick the best one for you.",
    "It's not simply a matter of the newer model being the best Fitbit. The Versa 2 is a couple of years older, but has stood the test of time well, and includes many of the features you'd expect to find on a modern smartwatch, including blood oxygen saturation (SpO2) tracking, music streaming, Amazon Alexa support, and the ability to make contactless payments via NFC.",
    "It's a good-looking watch too, with a smart stainless steel bezel, a choice of three colors, and a special edition version with a woven jacquard band in addition to the standard silicone one.",
    "It also offers on-board music storage, which is something the newer Versa 3 lacks, and it's cheaper, which may be a deciding factor if you're on a limited budget.",
    "However, it does lack some of the Versa 3's more advanced tools – particularly when it comes to fitness tracking. Most importantly, the Versa 3 has its own on-board GPS, which gives more accurate results than the Versa 2, which has to piggyback on your phone for location tracking. If you're training for your first running event, that may be what tips the scales in the Versa 3's favor.",
    "Read on for all the most important differences between the two devices, so you can make the right choice.",
    "The Fitbit Versa 2 was released in September 2019, and is currently available direct from Fitbit for $179.95 / £169.99 / AU$299.95. You can often find it cheaper at third-party retailers, but Fitbit also hosts its own sales, when you may be able to pick it up for even less.",
    "The Versa 3 was available to pre-order in August 2020, and began shipping in September of the same year. It costs a little more than the older model in the US and UK, and is substantially more expensive in Australia.",
    "At the time of writing, the Versa 3 is available from Fitbit for $229.95 / £199.99 / AU$399.99, but you may be able to find a better price at a third-party store. We've rounded up the best deals below.",
    "When you buy either watch, you can also sign up for a free three-month trial of Fitbit Premium, which will give you additional features in the smartphone app, including access to more historical data, plus meditation sessions led by Deepak Chopra and additional workouts.",
    "The Fitbit Versa 2 and Versa 3 look quite similar at first glance, but there have been several upgrades.",
    "For the Versa 3, the company introduced some new design principles, which use curved shapes that it says are inspired by the human body. It's a more modern look overall, which may help tip the balance in its favor if design is one of your priorities.",
    "In fact, the Versa 3 looks nearly identical to the Fitbit Sense, which launched at the same time, but has a substantially different set of features – most notably a sensor that detects changes in your skin's conductivity, which it uses to estimate your stress level.",
    "Both Versa watches have a polymer case, with a smart aluminum bezel and soft silicone band as standard, though the Versa 2 also comes in a special edition version with an extra woven jacquard band included.",
    "Whichever watch you buy, you’ll get both small and large bands in the box, and you can buy alternative designs if you feel like a change.",
    "The Versa 2 comes in three colorways:",
    "The Versa 3 has five color options:",
    "Both watches share the same square-shaped AMOLED display with rounded corners.",
    "The Versa 2 has a resolution of 300 x 300 pixels, while the Versa 3 has a resolution of 336 x 336 pixels, meaning it's able to show more detailed graphs, sharper graphics, and more text at once (particularly useful when receiving smartphone notifications).",
    "The biggest difference between the two watches is that the Versa 3 has its own on-board GPS, while the Versa 2 has to use your phone's GPS receiver.",
    "This means that Versa 3 owners can go for a run, bike ride or walk without their phone, and still have their route, distance and speed tracked during their workout.",
    "Watches with on-board GPS also tend to give more accurate results than those that rely on a smartphone connection, making the Versa 3 a better choice if you're training for an event like a 5k or 10k, where every meter matters. For more casual exercise, the Versa 2 will be fine.",
    "Both the Versa 2 and Versa 3 have 24/7 heart rate tracking, plus all-day step tracking. They also have over 20 dedicated workout modes, plus auto-track if they detect that you’ve started working out without beginning tracking manually.",
    "They also monitor your sleep, giving you a report on your sleep patterns and quality in the Fitbit smartphone app each morning.",
    "Both watches can track your breathing rate too, but only the Versa 3 also includes a pre-installed app that offers guided breathing sessions.",
    "Both the Versa 2 and Versa 3 offer blood oxygen saturation (SpO2) monitoring, though it's worth noting that they only do this while you're asleep, unlike some more advanced sports watches, which let you perform a spot-check any time.",
    "This isn't a medical tool, but it can be useful for picking up signs of conditions like sleep apnea (which causes you to briefly stop breathing overnight), which is worth a conversation with your doctor. The Fitbit app can produce reports that you can share with your GP.",
    "There are some big differences between the Fitbit Versa 2 and Versa 3 when it comes to general smartwatch features, which may make the newer watch a more appealing prospect.",
    "Both the Versa 2 and Versa 3 support Amazon Alexa, but the Versa 2 is also compatible with Google Assistant, making it the best choice if you’ve equipped your house with Google Home smart devices.",
    "There are also differences when it comes to music. Both watches allow you to control your Spotify playlist from your wrist (provided you have a Spotify Premium subscription), and the Versa 3 also supports streaming from Deezer.",
    "However, while the Fitbit Versa 2 has storage for up to 300 songs, the Fitbit Versa does not. If you don't use a music streaming service, you may decide to opt for the Versa 2 instead.",
    "Unlike the Versa 2, the Versa 3 allows you to receive calls on your wrist, and send callers to voicemail if you’re in the middle of a workout, provided your phone is within Bluetooth range.",
    "Both devices can receive app notifications and support contactless payments through Fitbit Pay, though it's worth checking that your bank is one of those supported. Apple Pay and Google Pay are much more widely supported.",
    "You can download additional apps for either watch through the Fitbit app store, which is accessible through the smartphone app."
  ],
  "headers": {
    "6": "Fitbit Versa 2 vs Fitbit Versa 3L: price and availability",
    "10": "Fitbit Versa 2 vs Fitbit Versa 3: design",
    "17": "Fitbit Versa 2 vs Fitbit Versa 3: display",
    "19": "Fitbit Versa 2 vs Fitbit Versa 3: heath and fitness features",
    "27": "Fitbit Versa 2 vs Fitbit Versa 3: smartwatch features"
  },
  "links": {
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "best Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Fitbit Pay": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4534446407989937000/https://www.fitbit.com/global/us/technology/fitbit-pay"
  }
}