{
  "source": "https://www.techradar.com/news/global-smartphone-sales-continue-to-rise",
  "title": "Global smartphone sales continue to rise",
  "category": "phones",
  "updated": "2021-08-31T11:56:21Z",
  "author": "sead-fadilpasic",
  "summary": "Covid-19 was but a scratch on the global smartphone industry",
  "article": [
    "Despite Covid-19 wreaking havoc across the supply chain, the global smartphone market still managed to record growth, market analysts IDC are saying. The growth, even though minimal, is still commendable, the company said, added that it was fueled by 5G and emerging markets such as Japan, the Middle East, and Africa.",
    "IDC’s Worldwide Quarterly Mobile Phone Tracker report estimates shipments of smartphones will grow 7.4% this year to reach 1.37 billion units. The increase is attributed to a “healthy” 13.8% growth from iOS devices, paired with a 6.2% rise from Android-powered devices.",
    "Next year, IDC says, the global smartphone market is expected to grow another 3.4%.",
    "And while the Middle East and Africa continue to spearhead the recovery, mature markets (the Americas, Europe, China) will still be down from 2019.",
    "\"The smartphone market was better prepared from a supply chain perspective heading into 2020 given almost all regions were expecting to grow and vendors were preparing accordingly,\" said Ryan Reith, group vice president with IDC's Mobility and Consumer Device Trackers.",
    "\"2020 was a bust due to the pandemic but all of the top brands continued forward with their production plans with the main difference that the timeline was pushed out. Therefore, we are at a point where inventory levels are much healthier than PCs and some other adjacent markets and we are seeing the resilience of consumer demand in recent quarterly results.\"",
    "Emerging markets aside, the proliferation of 5G technology also fueled the growth, IDC stated. Consumers are interested in upgrading their devices and making use of new the new technology, but that also meant buying somewhat more expensive devices.",
    "The ASP of a 5G smartphone will reach $634 in 2021, IDC says, which is flat from $632 in 2020.",
    "At the same time, the price of 4G devices continues to drop, with the ASP falling to $206, almost 30% down from last year’s $277.",
    "As a result, total 5G shipments will grow 123.4% year-on-year, hitting 570 million units. China will make up most of the market (47.1% share), followed by the States (16%), India (6.1%) and Japan (4.1%). By the end of next year, IDC expects 5G devices to make up more than half of all smartphones shipped (54.1%)."
  ],
  "headers": {
    "6": "Everyone wants 5G"
  },
  "links": {
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "5G smartphone": "https://www.techradar.com/best/best-5g-phones"
  }
}