{
  "source": "https://www.techradar.com/news/e3-games-show-likely-returning-as-an-all-digital-event-in-2021",
  "title": "E3 games show likely returning as an all-digital event in 2021",
  "category": "gaming",
  "updated": "2021-02-10T01:29:23Z",
  "author": "stephen-lambrechts",
  "summary": "Expect a 'transformed' E3 experience",
  "article": [
    "Following its unfortunate cancellation last year due to coronavirus concerns, the Electronic Entertainment Expo (better known as E3) will reportedly return in 2021 as an all-digital event, according to pitch documents obtained by Video Games Chronicle.",
    "The site alleges that the show's organizer, the Entertainment Software Association (ESA), has proposed \"three days of live-streamed coverage held during the previously announced dates of June 15-17.\"",
    "The ESA will purportedly break the show up into several two-hour keynote sessions from major games partners, which will be complemented by shorter streams from \"games publishers, influencers and media partners.\"",
    "It's believed that games media will get a chance to check out the show's video game offerings on the week prior to the event, with some games demos for the general public released during the show.",
    "While the ESA has yet to explicitly reveal its plans for the event, an official statement has confirmed that it is \"transforming the E3 experience for 2021 and will soon share exact details on how we’re bringing the global video game community together.”",
    "It's worth noting that the proposed show sounds remarkably similar to last year's Summer Game Fest, which was launched by former E3 Coliseum host Geoff Keighley following his departure from the event in 2020.",
    "Summer Game Fest also boasted online events, news, trailers and demos from some of the game industry's biggest publishers. It will be interesting to see how E3 2021 differs in that regard."
  ],
  "headers": {
    "5": "Sounds familiar..."
  },
  "links": {
    "cancellation last year": "https://www.techradar.com/news/e3-2020-has-been-cancelled",
    "Video Games Chronicle": "https://www.videogameschronicle.com/news/e3-pushes-forward-with-plans-for-a-digital-2021-event/",
    "previously announced": "https://www.techradar.com/news/dates-have-been-set-for-e3-2021",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-to-replace-e3-as-2020s-marquee-gaming-event"
  }
}