{
  "source": "https://www.techradar.com/news/new-netflix-movies-2021-every-confirmed-release-date-and-trailer",
  "title": "New Netflix movies 2021: every confirmed release date and trailer",
  "category": "entertainment",
  "updated": "2021-12-06T11:34:53Z",
  "author": "axel-metz",
  "summary": "Get ready for more Netflix Originals",
  "article": [
    "It's not often that a major streamer reveals the release dates for its entire movie roster ahead of time, but that's exactly what Netflix has done with its impressive selection of original features heading to the service at the end of 2021.",
    "It's some list, too. Whether you're excited to see the star-studded Don't Look Up, led by Leonardo DiCaprio and Jennifer Lawrence, or Maggie Gyllenhaal's hotly-anticipated directorial debut, The Lost Daughter, Netflix has commissioned a grand variety of big-budget original movies for your viewing pleasure.",
    "Below, we’ve rounded up a selection of the biggest impending arrivals. For each entry, we’ve listed the title, release date and brief synopsis as given by Netflix, as well as any trailers or set images released thus far.",
    "A warning, though: since we're in December now, this list might look a little thin on the ground (we've been refreshing it regularly as titles are released). For the complete list of original films released earlier in the year – which included a few new horror movies, too – check out the tweet posted to Netflix's official film account below.",
    "Released from prison after serving a sentence for a violent crime, Ruth (Sandra Bullock) re-enters a society that refuses to forgive her past, and her only hope for redemption is finding the estranged younger sister she was forced to leave behind.",
    "We haven't seen the acclaimed lead actress on screen for a while, so we're intrigued by this one, to say the least.",
    "A young teenager's eccentric family and vibrant life in 1980s Naples is suddenly upended by the electrifying arrival of a soccer legend – and a shocking accident – in Paolo Sorrentino's personal story of fate, family, sports and cinema.",
    "We're getting shades of Cinema Paradiso from this one, which can only be a good thing.",
    "Written and directed by Adam McKay, two low-level astronomers (Leonardo DiCaprio and Jennifer Lawrence) must go on a giant global media tour to warn mankind of an approaching comet that will destroy planet Earth.",
    "Beyond DiCaprio and Lawrence, though, the cast on this one also includes the likes of Timothée Chalamet, Meryl Streep, Ariana Grande and Chris Evans.",
    "Yeah, we're excited.",
    "In Maggie Gyllenhaal's feature directorial debut, a woman’s beach vacation takes a dark turn when her obsession with a young mother at her seaside resort forces her to confront the secrets of her past.",
    "Olivia Colman, Dakota Johnson, Peter Sarsgaard and Jessie Buckley all star in this one, with the former the subject of early Oscar buzz yet again."
  ],
  "headers": {
    "4": "The Unforgivable (December 10)",
    "6": "The Hand of God (December 15)",
    "8": "Don’t Look Up (December 24)",
    "11": "The Lost Daughter (December 31)"
  },
  "links": {
    "new horror movies": "https://www.techradar.com/news/new-horror-movies"
  }
}