{
  "source": "https://www.techradar.com/news/this-weekends-best-laptop-deals-arent-at-amazon-theyre-at-walmart",
  "title": "This weekend's best laptop deals aren't at Amazon - they're at Walmart",
  "category": "computing",
  "updated": "2021-06-18T21:12:33Z",
  "author": "alex-whitelock",
  "summary": "Here are some great value recommendations",
  "article": [
    "If your shopping list contains cheap tech then you'll probably already know that this month's Prime Day deals are literally just around the corner. What you probably didn't know, however, is that some of the strongest options for Prime Day laptop deals will be offered outside of Amazon itself - case in point, these three Gateway machines we've found at Walmart.",
    "Starting at $419 for this full-size 15.6-inch laptop, we think these machines offer specs that are absolutely fantastic for the cash - and at prices we expect will stick around for Prime Day too. We've particularly got our eyes on this 14-inch Gateway for $499, which is an amazing price for the 11th gen Intel Core i5 processor, 16GB of RAM, and 512GB SSD this machine manages to pack in.",
    "Just below you can see a full roundup of these pre-Prime Day laptop deals at Walmart as well as some more information on what to expect on the big day itself.",
    "Good question. We're definitely expecting Amazon to come out strong with its line-up of sales next Monday (and Tuesday), so it could definitely be a wise policy to wait and see if anything catches your interest. Laptops are normally a fairly small part of the larger Prime Day event (the best sales are normally on Amazon devices), but they'll definitely be featured.",
    "We expect these Walmart Prime Day laptop deals to stick around at this price for next Monday, although definitely not a given, and they could also sell out.",
    "If you'd like to see what Amazon and other leading laptop deals retailers like Dell, HP, and Best Buy are offering, head on over to our main Prime Day laptop deals page. We're tracking the sales on a daily basis there, so you'll find plenty to check out."
  ],
  "headers": {
    "3": "Should I wait until Amazon Prime Day?"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Starting at $419": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-7134179828145082000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FGateway-15-6-1080p-PC-Laptop-Intel-Core-i5-16GB-RAM-256GB-SSD-Windows-10-Black-GWTN156-1BK%2F309509930",
    "for $499": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-9389024092104829000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FGateway-14-1-Ultra-Slim-Notebook-FHD-Intel-Core-i5-1135G7-Quad-Core-Iris-Xe-Graphics-512GB-SSD-16GB-RAM-Tuned-THX-Fingerprint-Scanner-1MP-Webcam-HDMI%2F654399212",
    "Prime Day laptop deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-laptop-deals"
  }
}