{
  "source": "https://www.techradar.com/news/this-upcoming-motorola-phone-will-have-the-highest-resolution-selfie-camera-ever",
  "title": "This upcoming Motorola phone will have the highest-resolution selfie camera ever",
  "category": "phones",
  "updated": "2021-12-07T09:50:56Z",
  "author": "tom-bedford",
  "summary": "Is 60MP too much?",
  "article": [
    "According to some teases, an upcoming Motorola phone could be one of the best smartphones for selfie-taking we've ever seen - or one of the worst, depending on how you look at it.",
    "The Moto Edge X30 launches at a Chinese event on December 9, and the company has been teasing information about it - case in point, company general manager Chen Jin has posted on social media platform Weibo about the phone's selfie camera.",
    "There's also a picture attached - you can see it in the header image of this article above.",
    "The phone is set to have a 60MP front-facing snapper - that's the highest-res camera we've seen allocated to selfie-taking, and it'll let you take ridiculously high-resolution pictures of your face.",
    "It could be paired with an ultra-wide lens for group selfie shots, and we've seen Motorola do this before, but that's not mentioned in the post.",
    "That could lead to great selfies, but apparently, the phone will also have an under-display camera - that means the front-facing snapper is embedded under the display, so you won't be able to see it.",
    "Such a selfie-camera placement sounds fantastic as a way to ensure the maximum screen-to-body ratio on the phone, and avoid an annoying spot where a camera cut-out would be. However, on phones like the Samsung Galaxy Z Fold 3 and Axon 20 that have used the tech, we've found that under-display camera tech doesn't result in great photos.",
    "It's worth pointing out that Jin says a \"special version of the Moto Edge X30\" will be the ones with the 60MP under-display camera, so it's possible not all versions of the mobile will. Since this message was posted in China, and it has been machine-translated, we can't say for certain.",
    "This selfie-camera information makes the Moto Edge X30 sound special - it's a rare Motorola phone in that it's pushing the boat out with intriguing new specs and features.",
    "The company tends to put out solid budget phones - that's perfectly okay as a business model, but it means we're not used it trying to innovate at all.",
    "It's a shame, then, that you might not be able to buy the Moto Edge X30.",
    "The December 9 launch event is China-only, meaning we won't get price or release information. We could see an eventual global launch - the Moto G100 was actually a globalized version of the Edge S which launched in China months prior, for example - but it's far from guaranteed.",
    "That's especially the case because Motorola is enjoying a big push in China at the moment, and it wouldn't be surprising for the brand to release a mobile that's exclusive to the country, especially because many other companies do just that.",
    "So we'll have to wait, with fingers tightly crossed, to see if the Moto Edge X30 comes out worldwide."
  ],
  "headers": {
    "8": "Analysis: it's a shame you might not be able to buy it"
  },
  "links": {
    "Motorola phone": "https://www.techradar.com/news/best-moto-phones",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "Weibo": "https://m.weibo.cn/detail/4711705466113078",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Axon 20": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review"
  }
}