{
  "source": "https://www.techradar.com/news/godaddy-now-owns-the-company-that-invented-managed-wordpress",
  "title": "GoDaddy now owns the company that invented Managed WordPress",
  "category": "computing",
  "updated": "2021-11-12T15:55:06Z",
  "author": "abigail-opiah",
  "summary": "GoDaddy adds another big firm to its portfolio",
  "article": [
    "In a bid to help build out the WooCommerce SaaS platform, GoDaddy has acquired Pagely, the company that pioneered Managed WordPress.",
    "Although the terms of the deal were not disclosed, GoDaddy did reveal it will continue to invest and advance its current GoDaddy WordPress and WooCommerce offerings to support small businesses and website designers and developers.",
    "Pagely said it will continue to provide the scalable Managed WordPress services to its enterprise, public sector, and media customers.",
    "President of GoDaddy Commerce, Osama Bedier said that GoDaddy is committed to helping small businesses grow through seamlessly intuitive “omnicommerce” solutions that empower them to sell anything, anywhere.",
    "\"Pagely possesses the platform, expertise and reputation to help us extend that mission to the WooCommerce ecosystem, creating the next generation of managed commerce,\"he added.",
    "GoDaddy has its own omnicommerce solution for its Websites + Marketing builder for point-of-sale devices, integrated payments and other solutions that power online and offline commerce.",
    "Pagely’s managed hosting service features multi-region redundancy, an enhanced SLA, and personalized technical account management – all powered by AWS cloud.",
    "\"We proved our way worked as a revenue funded, successfully founder-led company sticking to our core values - that employees and customers are the most important stakeholders. GoDaddy is investing in that ethos today,\" said Sally Boldt-Strebel, co-founder and COO, Pagely.",
    "“Pagely gets to do more of what we're good at. More of the things our customers love, with the greater operational scale and vast product catalogue provided by GoDaddy,” added fellow Pagely co-founder and CEO Joshua Strebel.",
    "“We look forward to helping bring this new WooCommerce specific platform to market and continuing to be a leader in the vibrant WordPress ecosystem.”",
    "Including the Pagely acquisition, GoDaddy has now bought 27 companies in total since its inception.",
    "Build your very own online store using the best ecommerce website builders"
  ],
  "headers": {
    "3": "Managed WordPress on GoDaddy"
  },
  "links": {
    "WooCommerce": "https://www.techradar.com/best/woocommerce-hosting",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "Managed WordPress": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "WooCommerce offerings": "https://www.techradar.com/news/godaddy-launches-new-woocommerce-extensions",
    "best ecommerce website builders": "https://www.techradar.com/news/best-ecommerce-website-builder-of-2021-build-the-best-online-store-for-your-business"
  }
}