{
  "source": "https://www.techradar.com/news/xbox-series-x-controllers-wont-ditch-aa-batteries-for-a-while-yet-heres-why",
  "title": "Xbox Series X controllers won't ditch AA batteries for a while yet – here's why",
  "category": "gaming",
  "updated": "2021-01-07T16:01:15Z",
  "author": "axel-metz",
  "summary": "Money from the Duracell bunny",
  "article": [
    "Xbox has always been known for sticking to its guns when it comes to traditional battery packs. As far back as the Xbox 360, players have been given the option of powering their gamepads using AA batteries, and it’s an outdated feature that has also found its way into the next generation of consoles. Yes, Xbox Series X controllers still take AA batteries – but there’s a reason, we guess.",
    "Unlike PlayStation’s DualShock (and now DualSense) series of controllers, which have always used an inbuilt rechargeable battery, the Xbox controller range has, at least, given players options when it comes to how to power their controllers. But the real reason for Microsoft dragging its feet on batteries lies in a long-lasting deal struck with Duracell.",
    "In an interview with Stealth Optional, Duracell UK’s marketing director, Luke Anderson, suggested “there’s always been” a partnership with Duracell and Xbox. He said: “It’s a constant agreement that Duracell and Microsoft have in place [...] for [Duracell] to supply the battery product for the Xbox consoles and also the controllers’ battery.”",
    "So, perhaps giving the player options wasn’t always at the forefront of Microsoft’s reluctance to ditch traditional batteries. On whether it’s a partnership that will continue into the future, Anderson clarified the deal is “going to go on for a while… it’s been going on for a while and I think it needs to go for a while [more].”",
    "If we’re honest, the signs of a deal between the two companies have been hiding in plain sight for several years. The Xbox Series S and S both come with two Duracell-branded AA batteries, rather than Microsoft’s Xbox-branded battery packs, and Duracell’s online marketing campaigns also frequently feature Xbox controllers.",
    "But Microsoft could be willing to concede defeat on other aspects of its controllers, after an Xbox console experience survey went out to customers asking for suggestions on how it can improve the overall user experience – including, tellingly, a question on whether users are “aware of features on PlayStation controllers” that they wish were on Xbox controllers.",
    "It’s a question that makes reference to the PS5 Dualsense controller’s adaptive triggers and haptic feedback, features that aren’t included in the new Xbox Series X controller.",
    "Could Microsoft be regretting its reluctance to update its line of gamepads? Only future updates will reveal the answer – just don’t expect the company to ditch Duracell batteries any time soon."
  ],
  "headers": {
    "5": "Is there change ahead?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Xbox controller": "https://www.techradar.com/news/xbox-one-controller-deals-cheap-xbox-wireless-gamepad-prices",
    "Stealth Optional": "https://stealthoptional.com/feature/why-does-xbox-series-x-s-console-still-use-aa-batteries-duracell/",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox console experience survey": "https://www.techradar.com/news/xbox-series-x-survey-asks-if-you-want-ps5-dualsense-features-on-its-controller",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}