{
  "source": "https://www.techradar.com/news/new-paypal-super-app-includes-messaging-at-last",
  "title": "New PayPal 'super app' includes messaging at last",
  "category": "computing",
  "updated": "2021-07-29T18:30:58Z",
  "author": "anthony-spadafora",
  "summary": "New digital wallet app will offer functionality beyond mobile payments",
  "article": [
    "PayPal will be moving forward with its plans to transform its mobile payment app into a “super app” according to the company's CEO.",
    "As reported by TechCrunch, during a recent Q2 earnings call PayPal CEO Dan Schulman told investors that the initial version of its new consumer digital wallet app is now “code complete” and this means it is almost ready to be rolled out.",
    "By transforming its money transfer app into a super app, PayPal could eventually resemble China's WeChat or Alipay or India's Paytm which provide a number of services in addition to supporting mobile payments. The company has previously said that its super app will include a number of new features such as enhanced direct deposit, check cashing, budgeting tools, bill pay, cryptocurrency support, subscription management and buy now, pay later functionality.",
    "PayPal also plans to add ecommerce features using the mobile shopping tools it obtained after acquiring the popular online shopping extension Honey for $4bn back in 2019. While the company has ran Honey as a standalone app, website and browser extension since its acquisition, its super app could include the service's deal-finding and price-tracking features.",
    "During the company's recent earnings call with investors, Schulman also revealed that messaging will be another feature available in PayPal's super app.",
    "With the addition of messaging functionality, PayPal users will be able message back and forth with friends, family and sellers without having to leave its app. They'll also be able to send thank yous directly from the app after receiving funds without having to use a different messaging service.",
    "Schulman provided further details on all of the new capabilities that will be available in PayPal's super app in the company's earnings call, saying:",
    "“Obviously, the [user experience] is being redesigned. We’ve got rewards and shopping. We’ve got a whole giving hub around crowdsourcing, giving to charities. And then, obviously, buy now, pay later will be fully integrated into it. … The last time I counted, it was like 25 new capabilities that we’re going to put into the superapp.”",
    "While PayPal's super app is now code complete, the company did not provide any details as to when it will begin rolling out to consumers though it did say that the app will be constantly updated with new features even after its release.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Messaging functionality"
  },
  "links": {
    "PayPal": "https://www.techradar.com/news/paypal-zettle-launch-in-the-us-offers-an-affordable-boost-for-small-businesses",
    "mobile payment app": "https://www.techradar.com/news/best-mobile-payment-app",
    "reported": "https://techcrunch.com/2021/07/29/paypals-new-super-app-is-ready-to-launch-will-also-include-messaging/",
    "money transfer app": "https://www.techradar.com/best/best-money-transfer-apps",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "buy now, pay later": "https://www.techradar.com/news/paypal-launches-installment-payment-plans",
    "Honey": "https://www.techradar.com/news/amazon-says-this-browser-extension-is-a-major-security-risk",
    "messaging service": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "TechCrunch": "https://techcrunch.com/2021/07/29/paypals-new-super-app-is-ready-to-launch-will-also-include-messaging/"
  }
}