{
  "source": "https://www.techradar.com/news/e-bikes-have-a-weight-problem-but-the-9kg-ares-super-leggera-hps-could-change-that",
  "title": "E-bikes have a weight problem, but the 9kg Ares Super Leggera HPS could change that",
  "category": "fitness",
  "updated": "2021-10-01T09:48:05Z",
  "author": "cat-ellis",
  "summary": "Carbon fiber and F1-inspired tech is lightening the load",
  "article": [
    "Electric bikes can take the sweat out of daily commuting, smoothing out hills so you arrive at work clean and fresh – but only if your journey doesn't involve a stage of public transport as well.",
    "A typical e-bike weighs around 15kg, with the weight often unevenly distributed on the frame due to the positioning of the battery, making it a challenge to haul up steps or onto storage racks (particularly if they take the form of hooks mounted six feet up a wall). If you don't have sufficient strength or mobility (which may be your reason for choosing an e-bike in the first place), you might as well forget it.",
    "Thankfully, that seems to be gradually changing thanks to careful use of carbon fiber and build techniques more commonly reserved for conventional road bikes.",
    "The Ares Super Leggera HPS is the latest example, tipping the scales at a mere 9kg including the battery. To put that into context, the lightest model in our current roundup of the best electric bikes, the Ribble Hybrid Al e, comes in at 13.1kg.",
    "Ares Systems claims the Super Leggara HPS weighs as little as a top-end conventional bike, though as ebiketips.co.uk observes, that isn't strictly true. A category-leading road-bike typically hovers around the 7kg mark, but the difference is understandable, due to the need for the drive system and battery in an electric model.",
    "The Super Leggara HPS uses a remarkably light Watt Assist drive system, which has been developed by High Performance Systems and which employs tech derived from Formula One, and when you detach the bottle-shaped power pack, the weights align much more closely.",
    "There is, however, a rather significant catch: Ares is a luxury brand, and the Super Leggara HPS will be a limited run of just 24 bikes. They'll be presented and sold at the company's showrooms in the US, UAE and around Europe.",
    "No price is listed so far, but it seems fair to say that every gram shaved off the bike's weight will add substantially to its cost - this is certainly no commuter workhorse.",
    "We remain optimistic though, and hopefully the technological advances made in developing this 9kg e-bike will eventually trickle down to much more accessible models, and make straining to heave an e-bike upstairs a thing of the past."
  ],
  "headers": {
    "4": "The lighter side of e-bikes"
  },
  "links": {
    "Electric bikes": "https://www.techradar.com/best/electric-bike",
    "hooks mounted six feet up a wall": "https://www.theguardian.com/lifeandstyle/bike-blog/2019/nov/04/rail-companies-bike-policy-bicycle-storage-trains",
    "Ares Super Leggera HPS": "https://www.aresdesign.com/en-us/news-press/ares_super_leggera_by_hps_/",
    "the best electric bikes": "https://www.techradar.com/best/electric-bike",
    "Ribble Hybrid Al e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "ebiketips.co.uk": "https://ebiketips.road.cc/content/news/ares-says-its-9kg-super-leggera-e-bike-is-a-world-first-but-that-s-open-to",
    "category-leading road-bike": "https://www.cyclingnews.com/features/best-road-bikes/"
  }
}