{
  "source": "https://www.techradar.com/news/mandalorian-star-rosario-dawson-joins-cast-of-dying-light-2",
  "title": "Mandalorian star Rosario Dawson joins cast of Dying Light 2",
  "category": "gaming",
  "updated": "2021-10-01T09:36:45Z",
  "author": "vic-hood",
  "summary": "Dawson will play major character Lawan",
  "article": [
    "Developer Techland has revealed that Mandalorian and Sin City actor Rosario Dawson will play a major character in Dying Light 2.",
    "The casting was revealed during the most recent episode of Dying 2 Know, the Dying Light 2 video series. The episode revealed that Dawson will play a major in-game character called Lawan, a woman who is \"fighting her past\" and is \"looking to seek revenge on the people who wronged her\".",
    "Lawan is set to be an important character with \"a lot of impact on the plot\", according to Dying Light 2's Senior Writer, Piotr Mostowski. According to Mostowski, Lawan will react either positively or negatively to players' actions, and that the consequence of those actions will be felt – so it sounds like you may want to keep her on your good side or you could end up on her kill list.",
    "In the episode, Dawson explains that Lawan's path will be largely dictated by the player's actions, allowing her to either be a \"rage-filled killer\" or a Nightrunner who \"risks her life to save others\". Check out the reveal below.",
    "In addition to the unveiling of Dawson's character, the episode gave fans a closer look at The City and its citizens (apparently one citizen made something similar to a dating app?), as well as a behind-the-scenes look of Dying Light 2's music recording process in London's iconic Abbey Road Studios.",
    "We still have a while to wait until we can explore the world of Dying Light 2 and see Lawan in action, with the survival horror due for release on February 4, 2022 following a delay from its initial December release date."
  ],
  "headers": {
    "4": "A closer look at Dying Light 2's world"
  },
  "links": {
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "most recent episode": "https://www.youtube.com/watch?v=EsT_pAF_lQY"
  }
}