{
  "source": "https://www.techradar.com/news/sounds-like-the-xiaomi-mi-11t-could-get-the-mi-11s-best-camera-feature",
  "title": "Sounds like the Xiaomi Mi 11T could get the Mi 11's best camera feature",
  "category": "phones",
  "updated": "2021-08-16T12:31:13Z",
  "author": "tom-bedford",
  "summary": "Telemacro is back, baby",
  "article": [
    "When we tested the Xiaomi Mi 11, we fell in love with telemacro camera which took better close-up pictures than almost every other smartphone snapper out there. It sounds like that lens could ride again on the upcoming Xiaomi Mi 11T.",
    "This comes from Xiaomi news outlet Xiaomiui, which shared an infographic showing leaked specs it'd found on the Mi 11T or Redmi K40 series (the latter name will likely be used in China, while the same handsets will likely come under the former name elsewhere). It's not clear where this information initially came from, so take it with a pinch of salt.",
    "Apparently, the phone will come with a chipset made by MediaTek, not Qualcomm which typically provides Xiaomi phone processors - the exact chipset hasn't been specified though.",
    "The leak also says the handset will have a 120Hz display, a 64MP main camera, an ultra-wide camera with a Sony IMX355 sensor (a sensor which hasn't been officially announced yet, we should add) and a 3x telemacro camera.",
    "Quite a few specs are missing right now, but we haven't heard too much about the Xiaomi Mi 11T even though we're expecting it fairly soon, so this is better than nothing.",
    "If the Xiaomi Mi 11T uses a similar, or even better, telemacro camera than the Mi 11, then it'll almost definitely be the late-2021 smartphone to beat when it comes to close-up shots.",
    "Most smartphones that have macro cameras use iffy lenses and low-resolution sensors, and the Mi 11 was one of the few phones that actually showed care and attention for this popular form of photography. Macro cameras are meant to be great for focusing on close-up or small objects like flowers, insects, small foods or textures.",
    "It's unlikely Apple or Google will opt to use macro camera on the iPhone 13 or Google Pixel 6, at least judging by current leaks, and while both will likely employ some sort of software system for optimizing close-up snaps, software doesn't compare with good hardware.",
    "So macro picture fans: if you're looking for a new smartphone towards the end of the year, the Mi 11T might be the only new phone that suits your needs. Well, unless you're happy to buy the slightly-older Mi 11 or Mi 11 Lite."
  ],
  "headers": {
    "5": "Analysis: bad news for every other phone"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "Xiaomiui": "https://twitter.com/xiaomiui/status/1427032539265474565",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Mi 11 Lite": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review"
  }
}