{
  "source": "https://www.techradar.com/news/new-fitbit-charge-5-leak-reveals-a-tiny-workout-tracking-powerhouse",
  "title": "New Fitbit Charge 5 leak reveals a tiny workout-tracking powerhouse",
  "category": "fitness",
  "updated": "2021-08-23T11:57:21Z",
  "author": "cat-ellis",
  "summary": "GPS, workout suggestions, stress monitoring and more",
  "article": [
    "Yet more details of the forthcoming Fitbit Charge 5 fitness tracker appear to have leaked, including more specifications and its launch price. The new info comes from known leaker Snoopy, who shared what appears to be an official promotional video on Twitter",
    "The clip features a watch that looks identical to the images that appeared online last week, with a stainless steel case that sits flush with a soft silicone band. It's a design that brings the Charge in line with Fitbit's newer devices, including the Sense, Versa 3, and Inspire 2, which traded sharp corners and bright colors for more subtle lines and shades. The video also shows extra band options, including a sporty perforated design.",
    "There will also be a color AMOLED display instead of the low-res monochome screen that was one of our main complaints about the Fitbit Charge 4.",
    "Fitbit seems to be more clearly defining each of its devices. The Versa 3 is a smartwatch, the Sense is for wellbeing, the Inspire 2 is for everyday activity tracking, the Luxe is for style – and the new Charge 5 will be for working out.",
    "Like its predecessor, the Charge 5 will be one of the few Fitbit to offer on-board GPS, meaning it can track your location and pace on runs, walks and bike rides without a connection to your phone. Not only is this more convenient, it's also typically more accurate than connected GPS.",
    "Like all Fitbits, the Charge 5 will be able to track workouts, but that's not all. Much like the recently released Garmin Forerunner 55 – an entry-level GPS running watch – the Charge 5 will be able to give you custom workout suggestions based on your activity, sleep, and heart rate.",
    "It looks like these suggestions will be quite general; whereas the Forerunner 55 offers ideas for specific running sessions, such as intervals or tempo runs, the Charge 5 will suggest you try gentle yoga or breathing exercises if you're tired, or a more intense workout when you're well rested and energized.",
    "If implemented well, it could be a very useful feature that helps people new to working out ease themselves into a manageable routine that helps them avoid getting stuck in a rut, over-training, or not challenging themselves enough.",
    "Users will also receive a 'daily readiness' score, which seems to be similar to Garmin's 'body battery' function, and estimates how much energy you're likely to have for the day ahead. This seems to be the metric represented by a meter on the watch's homescreen, as shown in the leaked images above.",
    "Both the Fitbit Charge 3 and Charge 4 cost $149.95 / £129.99 / AU$229.95 at launch, but it looks like the Charge 5's extra features will make it slightly more expensive.",
    "According to the leaked info, the Charge 5 will cost $179 (about £130 / AU$250), which places it in between the Fitbit Luxe (which usually sells for $149.95 / £129.99 / AU$199.95) and the Fitbit Versa 3 (which goes for $229.95 / £199.99 / AU$399.95).",
    "While the Charge 5 will work perfectly well by itself, to get the most out of it (including access to the full catalogue of guided workouts), you'll also need a Fitbit Premium subscription. This costs $9.99 / £7.99 / AU$14.99 per month, or $79.99 / £79.99 / AU$129.99 per year (though the Charge 5 will come with a free six-month trial to whet your appetite).",
    "Perhaps most interestingly, the leaked video reveals that the Fitbit Charge 5 will feature EDA (electrodermal activity) sensors to detect changes in stress. It works by passing a very mild electrical current through your skin, and uses its conductivity as a way to estimate adrenal activity (which changes in response to physical and emotional stress).",
    "It's a tool that's only available in one other Fitbit – the Fitbit Sense, which launched last year and sells for $299.95 / £279.99 / AU$449.95. It has always been advertised as the Sense's key selling point, so we're very surprised to see it appear in the much cheaper Charge 5.",
    "We don't have the Charge 5's full specs yet, so it's possible that the Sense may still have a few extras to offer on the health front, including skin temperature and SpO2 (blood oxygen saturation) monitoring. The new watch may also lack music streaming, and Google Assistant/Alexa voice controls.",
    "However, with so many of its key features available for a lower price in the Charge 5, it's about to become much harder to justify the Sense's larger price tag."
  ],
  "headers": {
    "9": "How much will it cost?",
    "12": "Analysis: is it game over for the Fitbit Sense?"
  },
  "links": {
    "Fitbit Charge 5": "https://www.techradar.com/reviews/fitbit-charge-5",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Snoopy": "https://twitter.com/_snoopytech_/status/1429512996510912516",
    "images that appeared online last week": "https://www.techradar.com/news/fitbit-charge-5-screen-and-colors-shown-off-in-new-image-leaks",
    "Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "Fitbit Charge 4": "https://www.techradar.com/reviews/fitbit-charge-4",
    "Garmin Forerunner 55": "https://www.techradar.com/reviews/garmin-forerunner-55",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for"
  }
}