{
  "source": "https://www.techradar.com/news/how-to-watch-unforgotten-online-stream-season-4-of-the-itv-drama-from-anywhere",
  "title": "How to watch Unforgotten online: stream series 4 of ITV drama from anywhere",
  "category": "computing",
  "updated": "2021-03-29T13:10:36Z",
  "author": "aatif-sulleyman",
  "summary": "Is this one cold case too far for DCI Cassie Stuart?",
  "article": [
    "The Unforgotten has stood out as one of the best TV murder mystery series that UK television has produced over the last few years. Into its fourth run, DCI Cassie Stuart (Nicola Walker) and DI Sunny Khan (Sanjeev Bhaskar) are investigating the gruesome discovery of a dismembered body that has been undiscovered for some thirty years. Here's how to watch Unforgotten season 4 online from anywhere – including for free for anyone in the UK with ITV.",
    "The corpse has been stripped of both its head and its hands, but is otherwise extremely well preserved, with a postmortem establishing that it has been frozen since 1990. However, without the rest of the victim’s body a cause of death cannot be determined.",
    "A tattoo gives the team a much-needed lead, and they also discover that the freezer that the body was trapped inside belonged to a recently deceased man, Robert Fogerty, who was cautioned for a traffic offence on the same night that the victim disappeared. But Fogerty wasn’t driving alone.",
    "Four passengers rode with him that night, and each one must immediately be regarded as a suspect for murder. In the Peak District, therapist Fiona Grayson (Liz White); in Cambridge, high-flying police officer Liz Baildon (Susan Lynch); in Rochester, businessman Dean Barton (Andy Nyman); and in Southall, expectant father Ram Sidhu (Phaldut Sharma).",
    "Were they simply in the wrong place at the wrong time, or is something else going on? Get ready to be gripped all over again, as we explain how to watch Unforgotten season 4 online from anywhere - including 100% free for anyone in the UK with ITV.",
    "While fans of crime dramas in the UK can enjoy Unforgotten season 4 online with ease, regional restrictions mean that tuning in from anywhere else in the world will be near impossible. That means that anyone from the UK who's currently abroad – and having paid for an annual TV license – won’t be able to connect to ITV Hub either.",
    "Luckily, downloading a VPN provides a simple solution. This nifty bit of kit changes your IP address, allowing you to connect to your favourite on-demand services and watch all its premium content regardless of where you’re streaming from."
  ],
  "headers": {
    "5": "How to watch Unforgotten season 4 from outside your country"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}