{
  "source": "https://www.techradar.com/news/looking-for-a-ring-doorbell-on-black-friday-this-bundle-deal-is-too-good-to-miss",
  "title": "Looking for a Ring doorbell on Black Friday? This bundle deal is too good to miss",
  "category": "smart-home",
  "updated": "2021-11-26T11:17:45Z",
  "author": "cat-ellis",
  "summary": "Save over 50% off a Ring doorbell and Amazon Echo Show 5",
  "article": [
    "Black Friday is finally here, and right now you can grab the latest Ring video doorbell in stylish Venetian Bronze or Satin Nickel together with an Amazon Echo Show 5 smart speaker for just $89.99 at Amazon. That's a huge saving of $94.99 off the regular price, and the cheapest we've ever seen it by far.",
    "Amazon owns Ring, so it's no surprise that it's offering some of the best Black Friday deals on video doorbells and security cameras this year. This particular bundle is something really special though, and one of the best Black Friday Ring video doorbell deals we've seen this year.",
    "(Not in the US? Scroll down for deals in your region.)",
    "Ring doorbells and security cameras are all compatible with Amazon Alexa, so they're ideal when partnered with an Echo smart speaker. With an Echo Show 5, you can see high-resolution footage from the doorbell anywhere in your home, and speak to visitors via two-way audio.",
    "This isn't your only option, though; there are lots of other bundle deals that combine a smart speaker with a Ring video doorbell or camera (or even a whole set). We've hunted down the best offers for you right here.",
    "No matter where you live, you'll find all the lowest prices for Ring video doorbells from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Ring doorbell Black Friday deal",
    "5": "More Ring Black Friday deals",
    "6": "More Black Friday deals"
  },
  "links": {
    "for just $89.99 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08YSZQD2C%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8525642397536374000-20",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday Ring video doorbell deals": "https://www.techradar.com/black-friday/the-best-black-friday-deals-on-amazons-ring-doorbell"
  }
}