{
  "source": "https://www.techradar.com/news/apple-mac-mini-m1-deals-reach-lowest-prices-ever-in-the-us-and-uk",
  "title": "Apple Mac Mini M1 deals reach lowest prices ever in the US and UK",
  "category": "computing",
  "updated": "2021-05-08T15:26:05Z",
  "author": "alex-whitelock",
  "summary": "Get a bargain on the 512GB model this weekend",
  "article": [
    "Apple deals hunters on both sides of the pond will be pleased to see the latest range of excellent price cuts on the new Apple Mac Mini M1 at Amazon this weekend.",
    "Right now you can pick up this awesome little machine in its 512GB capacity variant for just $799.99 (was $899.99) or £827.99 (was £899) in each territory respectively. While we do often see the odd MacBook M1 deal grace the store pages of Amazon every so often, this is the cheapest price yet in both territories and a great option if you want one of these machines with a larger capacity drive, which we'd probably recommend.",
    "Note - If you're visiting from the US you'll notice that the landing page only says $829 as the price initially. This is because Amazon is offering the last $30 saving at checkout, so you won't receive the full discount until then.",
    "While diminutive, the new Apple MacBook Mini M1 isn't to be underestimated. The brand new M1 chip under the hood gives these small machines a huge amount of power - even when compared to the most expensive of Intel-based machines. For design work or production tasks especially they're absolutely fantastic, and their small size allows them to fit snugly even in the tightest of places. Subsequently, they're actually great value (despite being an Apple device!) and an easy recommendation - especially when there's Mac Mini M1 deals like these.",
    "Outside the US and UK? See the best Apple deals in your region just below.",
    "See what other excellent Apple products are on sale this weekend with our best Apple MacBook deals and Apple iPad deals pages."
  ],
  "headers": {
    "5": "Apple Mac Mini M1 deals at Amazon"
  },
  "links": {
    "for just $799.99 (was $899.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB08N5P7TLW%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9685642889121501000-20",
    "£827.99 (was £899)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FApple-mini-Chip-256GB-November%2Fdp%2FB08N5Q8XPF%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8017478202153319000-21",
    "best Apple MacBook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699",
    "Apple iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices"
  }
}