{
  "source": "https://www.techradar.com/news/how-healthy-are-air-fryers",
  "title": "How healthy are air fryers?",
  "category": "appliances",
  "updated": "2021-04-15T13:46:56Z",
  "author": "sophie-bird",
  "summary": "Are air fryers really any healthier to cook with?",
  "article": [
    "Many people buy one of the best air fryers because brands offer up these appliances as a healthier way to cook your food. But is that true, and how healthy are air fryers really?",
    "Well, air fryers cook food differently when you compare them to traditional gas ranges, or even using a deep fat fryer. Air fryers heat your food by convection - using a heating element and fans to circulate really hot air around your food until it’s cooked evenly on all surfaces.",
    "Some foods are suitable for air frying without any oil at all, and many will be ready much quicker than when you use a traditional cooker. That’s because of two reasons. The first is that with an oven, you have to allow time for it to heat up before you can put your food inside. On some models, this can take as long as 30 minutes, whereas an air fryer heats up in seconds. The second reason is that air fryers use intense, high heat that results in shorter cooking times.",
    "Whether you opt for a model such as the Tefal ActiFry Genius XL, the Instant Vortex Air Fryer, or the Ninja Foodi Dual Zone Air Fryer, often one of the biggest selling points is that you won’t need to use as much oil but does this necessarily make these appliances automatically healthier?",
    "Now we know this might seem like a simple answer, but the healthiness of what you make in your air fryer, all depends on what you actually put in it. It’s no secret that dishes such as frozen fries, onion rings, chicken wings, and other fried goods are not the healthiest choices on the planet but by air frying these, you also won’t be instantly making them healthier, of course.",
    "The difference here, though, is that unlike using deep fryers, you won’t need to submerge your food in a vat of hot oil or fat. This will make your food slightly lighter and also means it won’t have a greasy finish either. On a more practical note, you also won’t need to worry about using kitchen paper to blot excess oil out of your food, nor will you have to worry as much about splatters of oil that could burn you.",
    "As we mentioned earlier, some air fryers do need a little oil to add flavor to your food, but it’s the air circulating and the high heat that cooks your food and adds a crisp finish, rather than the oil itself.",
    "When it comes to preparing homemade fries in an air fryer, these can be healthier than preparing them in the oven if you would normally use plenty of oil to coat the potatoes. You might be surprised to find out that even things like mini pizzas can be cooked in an air fryer, but you won’t see a huge nutritional difference with these as typically, they’re not cooked in masses of oil either.",
    "You can use an air fryer to make a whole range of dishes but there’s an awful lot of choice when it comes to lighter or healthy recipes too. You can prepare root vegetables, healthier fries, homemade vegetable chips, and crispy roast potatoes with ease.",
    "When it comes to sweet dishes, you can also use an air fryer to cook slices of apple or peaches for warm desserts or tasty snacks. These won’t require much oil but many recipes will advise sprinkling sugar on the top, so this is something worth factoring in.",
    "We’ve already established that air frying is healthier than using a deep fryer but when it comes to ovens, it’s not quite as clear cut. Depending on the cookware you use in your oven, and the food you’re cooking will depend on the amount of extra fat or oil you use. However, due to air fryer designs and the non-stick coated baskets, it’s likely that you won’t need as much oil as you would for an oven."
  ],
  "headers": {
    "4": "Do air fryers make healthy food?",
    "10": "Is air frying healthier than using an oven?"
  },
  "links": {
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "Tefal ActiFry Genius XL": "https://www.techradar.com/reviews/tefal-actifry-genius-xl-review",
    "Instant Vortex Air Fryer": "https://www.techradar.com/reviews/instant-vortex-air-fryer",
    "Ninja Foodi Dual Zone Air Fryer": "https://www.techradar.com/reviews/ninja-foodi-dual-zone-air-fryer-af300uk-review"
  }
}