{
  "source": "https://www.techradar.com/news/intel-arc",
  "title": "Intel Arc: everything we know about the new GPUs",
  "category": "components",
  "updated": "2021-09-07T16:05:41Z",
  "author": "jackie-thomas",
  "summary": "Team Blue is coming to challenge Teams Red and Green",
  "article": [
    "Intel Arc is official, and with it the graphics card world will soon be a mighty scrum between Teams Blue, Red, and Green. But how much do AMD and Nvidia have to fear from this latest player in on the GPU scene, and how confident are we that Intel Alchemist, the first Arc card we're expecting to see, will earn a spot on our best graphics cards list when it drops?",
    "While this might be Intel's first go at making a line of discrete gaming graphics cards, Intel has been making GPUs for a while now in the form of Intel Iris integrated graphics, and it's Iris Xe graphics have been pretty impressive, given the constraints of its platform integrated with Intel Tiger Lake CPUs.",
    "We did get our first look at a discrete Intel Iris Xe graphics card at CES 2020, and we even got to play around with them a little bit. But even though those early efforts looked good, it remained to be seen how well the final product would turn out.",
    "That is, of course, still the case since we haven't gotten our hands on the Intel Arc graphics card yet, but we won't have to wait too much longer with a release date expected less than a year away. So what else do we know so far about the Intel Arc? Let's take a look.",
    "Unlike just about everything else about Intel Arc, there are some things we do know about Intel Arc's specs, courtesy of Intel itself.",
    "During Intel's recent Architecture Day event, where Intel Arc was given some considerable attention, we learned that Intel Arc will be seriously competitive when it comes to real-time ray tracing, AI super sampling technology – directly competing with Nvidia DLSS and AMD FidelityFX Super Resolution – to upscale graphics, and mesh shading.",
    "Intel released a video demonstrating its latest tech during its Intel Arc announcement and it definitely looks impressive.",
    "We do know that the Intel Xe-HPG architecture that Intel Arc will be based on features a core count of 4096, which is higher than both the AMD RX 6700 and RX 6800, though this falls short of that of the Nvidia RTX 3070.",
    "If Team Blue can get the pricing right on Intel Arc, it could easily pose the greatest challenge to AMD, and even supplant it for second place in the graphics card market as the graphics card to get if you are in any way budget-conscious."
  ],
  "headers": {
    "4": "Intel Arc specs"
  },
  "links": {
    "AMD and Nvidia": "https://www.techradar.com/news/computing-components/graphics-cards/amd-vs-nvidia-who-makes-the-best-graphics-cards-699480",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Intel Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake",
    "Intel Iris Xe graphics card": "https://www.techradar.com/news/intel-xe-graphics-cards",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "got to play around with them a little bit": "https://www.techradar.com/news/we-played-destiny-2-on-the-intel-xe-dg1-at-ces-2020",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Nvidia DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "AMD FidelityFX Super Resolution": "https://www.techradar.com/news/amd-finally-takes-on-dlss-with-fidelityfx-super-resolution"
  }
}