{
  "source": "https://www.techradar.com/news/cisco-is-now-offering-your-business-everything-as-a-service",
  "title": "Cisco is now offering your business everything as a service",
  "category": "computing",
  "updated": "2021-03-31T15:31:39Z",
  "author": "mike-moore",
  "summary": "New Cisco Plus brings together the company's products into one offering",
  "article": [
    "Cisco is looking to help businesses simplify their tech purchases with the launch of a new single-service proposition.",
    "The new Cisco Plus proposition bundles together the company's software, hardware and services into a single offering that it says gives customers much more flexibility in how they buy and build their technology stack.",
    "All of these offerings, and possibly more, will now be available under a single subscription licence, potentially saving money and helping many businesses get back up to speed quickly in the post-pandemic world.",
    "Revealed at the company's Cisco Live event, the new Plus offering looks to unify the company's various services, in the hope that customers will be tempted to go all-in on its products.",
    "Initially, the platform will offer Cisco Plus Hybrid Cloud, which will includes Cisco’s entire data center compute, networking and storage portfolio in addition to third-party storage and software, bridging on-premise, edge and public cloud.",
    "Customers can choose the exact level of services they need desire for planning, design and install, with 0% - 100% usage commitment up front. The company even says Cisco Plus will be deliverd within 14 days, and will intially be available as a limited release in the Australia, Canada, Germany, the Netherlands, UK and the US.",
    "Alongside Cisco Plus, the company has also announced a new Network-as-a-Service (NaaS) offering that looks to help customers get the most out of their network without the need to own, build and maintain their own infrastructure.",
    "The NaaS rollout will first focus on a cloud-based solution as-a-service for secure access service edge (SASE), with Cisco saying this will be especially useful for companies pivoting to an increasingly remote working model, and offers a secure, seamless and visible way to get set up and online.",
    "“Every business is unique with its own challenges today, but what we have in common is the need to simplify everything,” said Todd Nightingale, Senior Vice President and General Manager, Enterprise Networking and Cloud, Cisco.",
    "“Network-as-a-service is a great option for businesses wanting to shift to a cloud operating model without the heavy lift. Cisco is leading the industry in its approach with Cisco Plus. Together with our partners, we intend to offer the majority of our technology portfolio to be clouddelivered, cloud-managed and offered as-a-service.”"
  ],
  "headers": {
    "3": "Cisco Plus"
  },
  "links": {}
}