{
  "source": "https://www.techradar.com/news/amazon-sale-slashes-the-kindle-paperwhite-to-just-dollar85-lowest-price-ever",
  "title": "Amazon sale slashes the Kindle Paperwhite to just $84.99 – the lowest price ever",
  "category": "tablets",
  "updated": "2021-07-20T16:08:04Z",
  "author": "mackenzie-frazier",
  "summary": "Score a $45 discount on Amazon's Kindle Paperwhite",
  "article": [
    "Kick-off the new school year with a new e-reader thanks to this fantastic deal that we've spotted at Amazon. For a limited time, you can get the best-selling Kindle Paperwhite on sale for just $84.99 (was $129.99). That's a massive $45 discount and the lowest price we've seen for the waterproof e-reader.",
    "The Kindle Paperwhite features a glare-free 6-inch display and twice the storage of the previous generation. The handheld e-reader is also thinner and lighter than previous models and has a battery that will last for weeks on a single charge. Perhaps the coolest feature of the all-new Paperwhite, though, is its IPX8 water resistance protection, so you can enjoy reading your Kindle at the beach, pool, or in the bath and not worry about it getting wet. As we've mentioned above, this is the best deal we've found for the Kindle Paperwhite, and the only other time we've seen this record-low price was during last year's Black Friday sale. We don't know how long Amazon will have the e-reader at this price, so we'd recommend taking advantage now before it's too late.",
    "See more of the best cheap Amazon Kindle sales that are happening now and shop more offers with our roundup of the back to school sales that are happening right now. You can also learn more about the upcoming Labor Day sales event."
  ],
  "headers": {
    "1": "Amazon Kindle Paperwhite deal",
    "2": "More Amazon Kindle deals"
  },
  "links": {
    "on sale for just $84.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAll-new-Kindle-Paperwhite-Waterproof-Storage%2Fdp%2FB07CXG6C9W%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7846742238841083000-20",
    "Kindle Paperwhite": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-2018-review",
    "Black Friday sale": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "best cheap Amazon Kindle sales": "https://www.techradar.com/news/portable-devices/portable-media/kindle-deals-1296345",
    "back to school sales": "https://www.techradar.com/news/best-back-to-school-sales-2020",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}