{
  "source": "https://www.techradar.com/news/sonys-giving-you-the-chance-to-buy-a-ps5-ahead-of-black-friday-2021",
  "title": "Sony's giving you the chance to buy a PS5 ahead of Black Friday 2021",
  "category": "gaming",
  "updated": "2021-10-14T14:09:16Z",
  "author": "rhys-wood",
  "summary": "But only if you're in the US",
  "article": [
    "If you still haven't managed to buy an elusive PS5 for yourself or a relative, then you might finally be in with a shot. Sony has launched a website that allows users to register their interest in purchasing a PlayStation 5 console this Holiday season.",
    "Spotted by Twitter user Nibellion, the website reads: \"This coming holiday season, we will have a limited amount of PS5 Consoles available for customers in the US to purchase direct from PlayStation.\"",
    "The promotion seems to be open to US buyers only, who must have an existing PlayStation Network ID in order to sign in to the website to register their interest. The FAQ section of the page reads that \"selection is based on previous interests and PlayStation activities,\" implying that people who have purchased PlayStation products in the past are more likely to be picked.",
    "The website notes that if you've been selected, invitations will start rolling out in November 2021, likely just ahead of Black Friday 2021 which takes place from November 26.",
    "Invitations will be sent via email, containing instructions for how to redeem your invitation to buy a PS5 console (or the PS5 Digital Edition) as well as attachments like DualSense controllers and the Pulse 3D wireless headset.",
    "Even if you are selected, Sony stresses that it's still possible for its pool of PS5s to sell out before all invitations have been redeemed, so we'd recommend keeping a hawkish eye on your inbox in November if you've registered interest.",
    "As Black Friday looms, PS5 consoles are no doubt on the minds of thousands of consumers. PS5 deals are likely to be very thin on the ground this Black Friday outside of the odd bundle – thanks to the ongoing rarity of Sony's current-gen system – so we'd say you've got nothing to lose by registering your interest above, as long as you meet the entry requirements and can, of course, afford to buy a PS5.",
    "It's hardly the first time Sony has run a promotion akin to this one, with similar invitation-based sessions sprinkled throughout the year since the PS5's release, including this one where only existing PS5 owners were eligible to buy another PS5.",
    "We're glad to see that Sony is extending something of an olive branch ahead of Black Friday 2021, at least for US buyers. We'd of course love to see similar promotions hit regions across the globe, but at least some players in the US will be able to hopefully beat the Black Friday rush to score a PS5 in time for the holidays."
  ],
  "headers": {
    "6": "Analysis: Is this PS5 promotion worth jumping on?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "the website": "https://www.playstation.com/en-us/ps5/register-to-buy/",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "PS5 Digital Edition": "https://www.techradar.com/news/ps5-vs-ps5-digital-edition-which-next-gen-sony-console-is-for-you",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Pulse 3D wireless headset": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset?region-switch=SG",
    "this one": "https://www.techradar.com/news/ps5-owners-can-now-buy-another-ps5-thanks-to-sony"
  }
}