{
  "source": "https://www.techradar.com/news/older-macbooks-with-charging-issue-get-an-official-fix-from-apple",
  "title": "Older MacBooks with charging issue get an official fix from Apple",
  "category": "computing",
  "updated": "2021-02-18T11:49:35Z",
  "author": "harry-domanski",
  "summary": "macOS 11.2.1 is here to solve your charging woes",
  "article": [
    "If you have a 2016 or 2017 model Apple MacBook, there's a chance that you've encountered a bug that stopped your device from charging properly – thankfully, there's an official fix for that.",
    "As spotted by AppleInsider, Apple has today released macOS 11.2.1 with an incremental patch to the larger operating system update it rolled out last week. It only features two changes, but one of them fixes the aforementioned charging bug.",
    "Affected devices would still function with power plugged into them, but in a number of cases, the MacBook's battery wouldn't charge. Apple promises that macOS 11.2.1 remedies this issue.",
    "The other change patches a flaw that potentially allowed hackers access to a user's MacBook via a Sudo vulnerability. Similar incremental updates that patch this flaw have also been released for macOS Catalina and Mojave.",
    "As always, you can manually download the update by navigating to System Preferences > Software Update, or you'll find it installed automatically if you have automatic updates enabled.",
    "In addition to the software patch, Apple is saying that some MacBook Pro models are eligible for a complete battery replacement. The eligible models include:",
    "To find out which model you have, navigate in the Apple menu down to \"About This Mac.\" There, you should be able to identify if your MacBook Pro model qualifies for a battery swap.",
    "If you are having issues with your 2016 or 2017 MacBook Pro battery, you can contact Apple Support and arrange to have it replaced. The servicing is free if your model is eligible, though an Apple technician will have to verify eligibility before giving you a new battery."
  ],
  "headers": {
    "5": "Some Apple MacBook Pro models eligible for battery replacements"
  },
  "links": {
    "Apple MacBook": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "AppleInsider": "https://appleinsider.com/articles/21/02/09/apple-issues-macos-big-sur-1121-with-fix-for-macbook-pro-charging-issue",
    "access to a user's MacBook via a Sudo vulnerability": "https://www.techradar.com/news/sudo-bug-also-found-to-affect-macos",
    "Apple is saying": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3783934135821918700&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT212163",
    "Apple Support": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1181505082954707000&sharedId=trd-us&u=https%3A%2F%2Fgetsupport.apple.com%2F%3Fcaller%3Dkbase%26PFC%3DPFC1002%26category_id%3DSC0999%26symptom_id%3D21085"
  }
}