{
  "source": "https://www.techradar.com/news/amd-promises-amazing-cpu-advances-over-next-few-years",
  "title": "AMD promises amazing CPU advances over next few years",
  "category": "computing",
  "updated": "2021-09-30T14:02:48Z",
  "author": "darren-allan",
  "summary": "Big steps forward with better power-efficiency for Epyc and other heavyweight chips",
  "article": [
    "AMD has announced that it is aiming for a 30x increase in the energy efficiency of its server chips by the time we reach 2025.",
    "In just a four-year span, a thirtyfold efficiency improvement is a seriously ambitious plan for its Epyc processors – the CPUs which go in servers – and AMD GPU accelerators which are used in AI applications and high-performance computing.",
    "If you’re doubtful of AMD’s ability to achieve this, bear in mind that the company’s previous plan to hit 25x energy efficiency, kicked off in 2014, was realized in 2020. In fact, efficiency gains to the tune of over 31x were managed by AMD according to an independent assessment, but this time around, the aim is to score another similar energy efficiency victory in four years rather than six.",
    "AMD admits that it’s not an easy goal to meet by 2025, and that “success is certainly not a forgone conclusion” by any means.",
    "Just to underline what this would mean, a 30x increase with efficiency would be outpacing industry energy efficiency performance by some 150% if you compare to the previous five-year period, AMD believes. Take a little salt here, given that this is Team Red’s own workings and stat crunching – as ever with these kind of PR announcements – but it’s clear enough that the potential energy savings and positive environmental impact could be very substantial.",
    "AMD observes that the possible savings could represent “billions of kilowatt hours of electricity” while “potentially reducing energy use per computation by 97% over the next five years”, no less.",
    "This new goal for Epyc and AMD Instinct accelerators is clearly important for sustainability and data centers being more green-friendly in general at a point where climate change targets are becoming an increasing concern.",
    "While this is heavyweight silicon AMD is talking about here, driving improvements in that sphere, and research and development therein, will doubtless have a trickle-down effect to other areas of Team Red’s CPU portfolio like consumer chips.",
    "Indeed, in recent times we’ve already seen AMD take great strides in not just concentrating on upping the performance of its Ryzen CPUs, but also pushing forward with much better energy efficiency with impressive results. So there’s no reason to doubt that this should continue, too, as we plough on through to the midpoint of this decade."
  ],
  "headers": {
    "6": "Analysis: Epyc progress is vital for many reasons"
  },
  "links": {
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "Epyc processors": "https://www.techradar.com/news/amd-ryzen-threadripper-vs-epyc-what-should-professionals-use",
    "tune of over 31x": "https://www.amd.com/en/technologies/25x20",
    "Team Red’s CPU portfolio": "https://www.techradar.com/news/best-small-business-servers",
    "Ryzen CPUs": "https://www.techradar.com/news/amd-ryzen-5000"
  }
}