{
  "source": "https://www.techradar.com/news/gigabyte-rtx-3060-ti-elite-graphics-card-is-an-ultra-cool-beast",
  "title": "Gigabyte RTX 3060 Ti Elite graphics card is an ultra cool beast",
  "category": "computing",
  "updated": "2021-05-07T17:29:16Z",
  "author": "darren-allan",
  "summary": "Elite model offers boost speeds of up to 1,785MHz",
  "article": [
    "Gigabyte has released a fresh spin on its GeForce RTX 3060 Ti range which offers an overclocked spec and a fancy cooling system to keep the GPU tamed when it’s running full pelt.",
    "The Gigabyte Aorus RTX 3060 Ti Elite 8G is capable of boosting up to 1,785MHz (120MHz faster than reference), and comes with 8GB of GDDR6 video RAM (which is what the ‘8G’ refers to). It slots just beneath the RTX 3060 Ti Master version, and above the Gaming PC Pro (the latter of which offers up to 1770MHz in terms of clocks).",
    "As mentioned, one of the main attractions is the cooler design to keep the temperatures down here, which is Gigabyte’s by now familiar WindForce 3X system. This consists of three 80mm fans with specially shaped blades to help with optimal airflow. The latter is also facilitated thanks to the middle fan spinning in the opposite direction to the outer fans.",
    "The heatsink is an extended design, and the RTX 3060 Ti Elite also benefits from five copper heat pipes (which are routed to ensure the largest direct contact area possible with the actual GPU is achieved) in its configuration of cooling components. 3D active fan tech means that the fans stay off if not needed (when the GPU isn’t doing much) to keep your PC quieter, and there is also a silent running mode that can be switched on (although the default setting for the graphics card is the overclocked mode).",
    "The RTX 3060 Ti Elite has a metal backplate, too, and sports a ‘neopunk’ design (meaning futuristic styling with sparkly lights – RGB with 16.7 million possible customizable color options, plus fancy effects).",
    "You also get a four-year warranty with the RTX 3060 Ti Elite. Gigabyte notes: “Excellent circuit design with the top-grade materials, not only maximizes the excellence of the GPU, but also maintains stable and long-life operation.”",
    "Don’t forget to register your purchase online, though, to benefit from the warranty. Speaking of purchasing, we don’t know how much the Gigabyte Aorus RTX 3060 Ti Elite 8G might retail for yet, but the recommended price, and actual asking prices you’ll find online – if you can grab a GPU at all – will likely be quite different, shall we say. Sadly, stock problems in the GPU arena look set to continue for both Nvidia and AMD in the near future.",
    "Incidentally, if you are struggling to find available models of Nvidia’s mid-range Ampere GPU, we’ve got an article on where to buy the RTX 3060 Ti which is worth checking out.",
    "Via Guru 3D"
  ],
  "headers": {
    "4": "Neopunk styling"
  },
  "links": {
    "GeForce RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "GPU": "https://www.techradar.com/news/nvidia-geforce",
    "3060 Ti": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-ti-find-stock-here",
    "stock problems in the GPU arena": "https://www.techradar.com/news/nvidia-rtx-3080-shortage-could-continue-until-q3",
    "where to buy the RTX 3060 Ti": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-ti-find-stock-here",
    "Guru 3D": "https://www.guru3d.com/news-story/gigabyte-releases-oc-version-of-geforce-rtx-3060-ti.html"
  }
}