{
  "source": "https://www.techradar.com/news/how-to-avoid-buying-a-fake-fitbit-on-amazon-prime-day",
  "title": "How to avoid buying a \"fake\" Fitbit on Amazon Prime Day",
  "category": "fitness",
  "updated": "2021-12-04T15:01:05Z",
  "author": "cat-ellis",
  "summary": "Make sure you're getting the genuine article",
  "article": [
    "We're expecting to see some great deals on running watches and fitness trackers for Amazon Prime Day 2021, and in previous years we've seen some impressive discounts on Fitbits, with big savings across the whole line. If you've been looking for a cheap fitness tracker to nudge you towards healthier habits, this is a great time to find a bargain.",
    "However, there are also a lot of devices on Amazon that look uncannily like Fitbits, but aren't. It's not necessarily an attempt to trick you – there are only so many ways to design a fitness watch – but the similarities can trip you up. These devices are often steeply discounted, particularly in short-lived Lightning Deals, and it can be easy to mistake them for the real deal if you think you're in danger of missing out.",
    "Lookalike watches will also appear if you simply search for 'Fitbit' – often under subheadings like 'Recommended article' or 'Amazon's choice'. It's cheeky, and might catch you out.",
    "To avoid disappointment, we've put together this guide to help you (or someone you know) be sure you're buying the right watch on Prime Day.",
    "There's a possibility that a Fitbit lookalike will serve your purposes perfectly well, but there are lots of reasons not to risk it.",
    "Firstly, you won't get the same customer protection. When you buy a Fitbit, you'll be protected by a one-year warranty (two years if you live in the European Economic Area) that covers defects in materials and workmanship.",
    "If a specific problem is identified in a batch of devices, Fitbit has also been known to offer a free replacement to anyone affected. We saw this in December 2020, when the company replaced a small batch of Fitbit Sense watches with faulty sensors.",
    "Another reason to avoid lookalike fitness trackers is the Fitbit app, which is one of the main reasons for choosing the brand. Pseudo-Fitbits will doubtless have their own smartphone apps, but the genuine one is particularly well designed and easy to use.",
    "All your stats are clearly presented, you can connect with other Fitbit users to chat and take part in challenges, and you can sync your data with other services, including MyFitnessPal, Strava, Runkeeper and Peloton to name just a few. The app imports data from other Fitbit branded devices as well, including smart scales like the Fitbit Aria Air.",
    "The app will also provide important firmware updates to your watch, which can add new features like snore tracking, as well as any necessary security patches.",
    "When you buy a Fitbit device, you'll get a free trial of Fitbit Premium too, which unlocks extra features like guided meditation sessions from Deepak Chopra, bonus workout classes, and advanced health insights.",
    "One of the best ways to avoid picking up a Fitbit lookalike is to search for a specific device. The most recently released Fitbits are the Fitbit Ace 3, Fitbit Sense, Fitbit Versa 3, Fitbit Inspire 2, and Fitbit Charge 4 (with the Fitbit Luxe available to pre-order).",
    "Rather than searching for something more general, like 'sports watch' or 'fitness tracker', it's best to check out some reviews first and decide which one will suit you best, then look for that particular device.",
    "As mentioned above, search results often include fitness trackers that are similar to the one you've looked for, but not identical. The first result is usually the correct one, but take a moment to read it carefully before adding it to your cart.",
    "Amazon's Lightning Deals are designed to be tempting, with countdown clocks and progress bars showing how many items have already been bought. It's easy to feel the fear of missing out, but acting too quickly can mean you end up with a device that isn't what you expected.",
    "Screen protectors, straps and charging cables can all be extremely useful, but when they're accompanied by photos of a complete watch, it can be easy to mistake their listings for something they're not.",
    "This is almost certainly not malicious (it's helpful to see how a strap will look on your watch), but if you're in a hurry to avoid missing out, it could be easy to click 'Buy it now' before realising. The words 'compatible' and 'replacement' are ones to look out for to avoid falling foul.",
    "Then it probably is. Our roundup of the best Fitbits will gives you a good idea of the usual price for each watch, which will help you identify whether a deal is genuine. If you're looking at a fitness tracker whose starting price was only a fraction of what you'd usually pay, it's probably not an actual Fitbit.",
    "We'll be hand-picking the best Prime Day deals throughout June 21 and 22, including any Fitbit offers that are worthy of mention. We'll never recommend a lookalike device, no matter how good a deal it may look, so you can be confident that you're getting the real thing.",
    "If you can't wait until then, take a look at our current guide to the best Fitbit deals for some big savings at Amazon and other retailers."
  ],
  "headers": {
    "4": "Why fake Fitbits matter",
    "11": "Be specific in your searches",
    "14": "Take care with Lightning Deals",
    "15": "Watch out for accessories",
    "17": "If it sounds too good to be true...",
    "18": "Stick with TechRadar"
  },
  "links": {
    "running watches": "https://www.techradar.com/best/running-watches",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "cheap fitness tracker": "https://www.techradar.com/best/best-cheap-fitness-trackers",
    "a one-year warranty": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1336966135257867300/https://www.fitbit.com/global/us/legal/returns-and-warranty",
    "Fitbit": "https://www.techradar.com/news/fitbit-versa-2-vs-fitbit-versa-3",
    "replaced a small batch of Fitbit Sense watches": "https://www.techradar.com/news/fitbit-is-recalling-a-batch-of-watches-but-its-emails-have-alarmed-some-users",
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "smart scales": "https://www.techradar.com/best/best-smart-scales",
    "Fitbit Aria Air": "https://www.techradar.com/reviews/fitbit-aria-air",
    "snore tracking": "https://www.techradar.com/news/fitbit-devices-are-getting-a-big-sleep-tracking-update-but-not-for-everyone",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "guided meditation sessions": "https://www.techradar.com/news/fitbit-launches-new-stress-busting-meditation-tools",
    "Fitbit Ace 3": "https://www.techradar.com/reviews/fitbit-ace-3",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Fitbit Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "Fitbit Charge 4": "https://www.techradar.com/reviews/fitbit-charge-4",
    "Fitbit Luxe": "https://www.techradar.com/reviews/fitbit-luxe",
    "the best Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "hand-picking the best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best Fitbit deals": "https://www.techradar.com/news/cheap-fitbit"
  }
}