{
  "source": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
  "title": "Hybrid Log Gamma: everything you need to know about HLG HDR",
  "category": "televisions",
  "updated": "2021-03-30T12:38:24Z",
  "author": "henry-st-leger",
  "summary": "Does HLG broadcasting bring something new to the table?",
  "article": [
    "New TV tech arrives all the time. That’s why it can be hard to keep up with many of the new content formats you’ll find in modern-day TVs. Especially because more of the new features and formats have confusing initialisms, like HDR and HLG.",
    "Anyone buying a new TV, or generally interested in TV tech, will have already got their heads around new HDR formats, including Dolby Vision and HDR10+. But what about Hybrid Log Gamma (often shortened to HLG)? What is HLG? Does your TV have it? And why should you care if it does?",
    "The best place to begin to truly understand HLG is with HDR (High Dynamic Range). This is a video format that enhances the brightness, sharpness, and color gamut of an image beyond SDR (Standard Dynamic Range).",
    "There are already several different types of HDR. There's the original HDR10 standard through to the more exclusive Dolby Vision. This is the still-nascent Advanced HDR by Technicolor and, for broadcasters, that's where Hybrid Log Gamma comes in.",
    "To help you make sense of this brave new world of color and clarity, we’ve put together a general overview of Hybrid Log Gamma’s new HDR format, as well as everything that makes it stand out from competing standards.",
    "Hybrid Log Gamma is an HDR format developed by the UK's own BBC (British Broadcasting Corporation), in conjunction with NHK, Japan's national broadcaster.",
    "The issue traditional broadcasters have is that many of their viewers still hold on to old SDR television sets, which can't display the increasingly prevalent HDR standard.",
    "SDR is also much cheaper to film in, and the likes of the BBC are naturally reluctant to ditch a cost-effective format that tens of thousands of viewers still rely on.",
    "The HLG format works around this obstacle by coding HDR and SDR information into a single signal, enabling HDR-compatible TVs to display an enhanced image. It's a far more efficient process for broadcasters, who then don't have to provide twice the amount of bandwidth to transmit their programming across the country in both SDR and HDR.",
    "When reaching your home television, the HLG signal will display in HDR if your television is compatible with the HLG HDR format. Otherwise, it displays in regular ol’ SDR – with some neat upscaling to bring it closer to its HDR counterpart.",
    "The HLG broadcast format is slightly different to HLG Photo Mode, which displays still HDR images from Panasonic Lumix cameras, and is exclusively available on OLED TVs in the Panasonic TV range.",
    "Hybrid Log Gamma uses what’s called an ‘opto-optical transfer function’ (sorry), which is the process used to convert a broadcast signal into the light that shows on your television screen. SDR and HDR information are both converted into two types of light coding, which can then be unpacked separately depending on the compatibility of the television.",
    "The ‘hybrid’ in Hybrid Log Gamma refers to this dual-coding of SDR and HDR. ‘Gamma’ refers to the low-light image data encoded in the signal, while ‘log’ is short for the ‘logarithmic curve’ that transmits in HDR’s wider brightness range.",
    "While having a single dominant format would no doubt be simpler – for users who just want to get on with, you know, watching the telly – the competition is no doubt driving up the standard picture quality we expect from our television screens.",
    "HLG is only one of numerous HDR formats out there, which are all doing different things and are suited to different purposes.",
    "HDR10 is the most common out of these, and is usually what people refer to when they say 'HDR' (any HDR TV will come with it built in). Like HLG, it's an open-source format, meaning that anyone can use it, and it delivers on a wider color palette than SDR, with 10-bit color depth and a peak brightness of 4,000 nits .",
    "Dolby Vision is a well-regarded alternative, that can reach up to 10,000 nits brightness and a 12-bit color depth, and generally offers a better picture. It does, however, require royalties from content providers to use, and is therefore much less ubiquitous – and is already facing off competition from an upgraded HDR10+ standard with equivalent bells and whistles.",
    "Both Dolby Vision and HDR10+ use a type of ‘dynamic metadata’ in real-time, optimizing brightness and contrast to suit the images being shown onscreen in each shot. HLG is specifically made for the ease of broadcasters, meaning it forgoes metadata that could get lost or out of sync during a live broadcast.",
    "As with any new format, HLG will only be as strong as the players who support it. It’s very much its own HDR format, and therefore an HDR TV will need to have the ability to recognise and play the format.",
    "Any recent HDR television from LG, Sony or Samsung – made in 2016 or after – have included HLG compatibility in firmware updates. Panasonic has also supported the format in a number of its premium HDR sets.",
    "There’s scattered support elsewhere, including in the odd projector from Sony and JVC, but it’s not as prevalent as HDR10 and you’ll need to make sure it’s supported in your specific make of television or otherwise.",
    "The BBC started trialing the technology in 2017 and – after some strong audience responses – has been rolling it out to flagship programmes like Blue Planet II, as well as major sporting events like this year’s FIFA World Cup.",
    "One of the BBC’s blog post on HLG reads: “The audience feedback from last year’s trial was fantastic, and exceeded our expectations. Even with only those four minutes of content, we were delighted to learn that there is a real audience appetite for better quality pictures, and more of them.”",
    "HLG is supported on BBC iPlayer – obviously – as well as YouTube, Freeview Play, and DirecTV. Hybrid Log Gamma will no doubt start appearing on more televisions, content platforms and the like, though in a heavily competitive market you never know what's going to last, and what will fall by the wayside.",
    "According to the BBC, it's still working to develop \"a complete HDR ecosystem\", which involves a lot of research and development. But it seems that the innovation of HLG generally has been a bit quiet in recent years."
  ],
  "headers": {
    "5": "So what is Hybrid Log Gamma?",
    "11": "How does Hybrid Log Gamma work?",
    "13": "And why does anyone need Hybrid Log Gamma?",
    "18": "So what can I watch HLG content on?",
    "21": "What's next for Hybrid Log Gamma?"
  },
  "links": {
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "BBC": "https://www.bbc.co.uk/rd/projects/high-dynamic-range",
    "HLG Photo Mode": "https://www.techradar.com/best/best-lg-tv",
    "OLED TV": "https://www.techradar.com/news/what-is-oled",
    "Panasonic TV": "https://www.techradar.com/news/panasonic-tv-2021",
    "LG": "https://www.techradar.com/news/lg-tv-2021",
    "Sony": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Samsung": "https://www.techradar.com/news/best-samsung-tv",
    "Panasonic": "https://www.techradar.com/news/panasonic-tv-2021",
    "projector": "https://www.techradar.com/best/4k-projector",
    "JVC": "https://www.techradar.com/news/want-8k-in-your-home-theater-jvcs-new-dla-nx9-projector-has-you-covered",
    "BBC’s blog post on HLG": "https://www.bbc.co.uk/rd/blog/2017-12-uhd-hdr-trial-blue-planet-bbc-iplayer"
  }
}