{
  "source": "https://www.techradar.com/news/iphone-12-helps-make-apple-the-worlds-biggest-smartphone-manufacturer-again",
  "title": "iPhone 12 helps make Apple the world's biggest smartphone manufacturer again",
  "category": "phones",
  "updated": "2021-01-28T15:02:09Z",
  "author": "steve-mccaskill",
  "summary": "Smartphone market returns to growth in last quarter of 2020",
  "article": [
    "The worldwide smartphone market returned to growth at the end of a difficult 2020, with incredible demand for the iPhone 12 driving shipments and returning Apple to the position of the world’s largest manufacturer.",
    "The economic impact of the coronavirus pandemic, coupled with lockdowns and social distancing measures across the globe, has had an inevitable impact on demand, physical retail, and manufacturer supply chains.",
    "As a result, shipments have fallen by 5.9% across the entire year, but a dramatic recovery has helped minimise the contraction. During Q4, sales increased by 4.3% to 385.9 million devices, driven by Apple’s record performance.",
    "\"There are a lot of elements at play that are fuelling the smartphone market recovery – pent-up demand, continued supply push on 5G, aggressive promotions, and the popularity of low to mid-priced phones,” said Nabila Popal, research director with IDC's Worldwide Mobile Device Trackers.",
    "\"Vendors also seem to be better prepared for the second lockdown, ensuring they have the right channel set up ready to fulfil orders and reach the end consumer. Lockdowns also have people spending less on areas like leisure, travel, and dining out – and smartphones are benefitting from this. In addition to all these factors, the fast recovery and resilience of the smartphone supply chain also has to be given some credit.\"",
    "Apple shipped 90.1 million devices over the three-month period, an increase of 22.2%, and now commands 23.4% market share. This is the highest shipment volume by a vendor in a single quarter.",
    "Samsung enjoyed more modest growth of 6.2%, shipping 73.9 million units to secure 19.1% share but the other major trend is the decline of Huawei. The Chinese giant broke Samsung’s stranglehold on the top spot last year but US sanctions that limit its access to technology have ended any ambition of a repeat – especially now it has sold its Honor subsidiary.",
    "Shipments fell by a huge 42.% to 32.3 million, giving the firm a share of 8.4% - the fifth largest of any manufacturer . Oppo and Vivo capitalised on these problems to secure 3rd and 4th spot with shares of 11.2% and 8.8% respectively.",
    "Analysts are encouraged by the markets strong recovery and expect momentum to continue into Q1 of 2021.",
    "\"The recovery of both the smartphone market and its supply chain has been truly impressive and the year-end growth is testament to how far we've come,\" added Ryan Reith, program vice president with IDC's Worldwide Mobile Device Trackers.",
    "\"The majority of the world is either in some form of lockdown or still waiting to return to normal day-to-day life, yet smartphone sales are rebounding as though nothing ever happened. This illustrates the importance of smartphones in everyone's life and provides a strong foundation for market demand. As the world progresses towards a post-pandemic environment, IDC believes demand will grow and the market recovery will accelerate.\""
  ],
  "headers": {
    "3": "Worldwide smartphone sales"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12"
  }
}