{
  "source": "https://www.techradar.com/news/asus-confirms-the-zenfone-8-is-launching-on-may-12-with-a-compact-version-rumored",
  "title": "Asus confirms the Zenfone 8 is launching on May 12, with a compact version rumored",
  "category": "phones",
  "updated": "2021-04-25T09:30:21Z",
  "author": "david-nield",
  "summary": "New flagships incoming",
  "article": [
    "Attention fans of smaller phones: Asus has announced a product launch for May 12, during which the Zenfone 8 is going to get its official unveiling. As per recent rumors and the event invite, a more compact version of the handset could also be in the offing.",
    "The tagline on the new splash page on the Asus website – \"Big on Performance. Compact in Size.\" – certainly suggests that a smaller model is going to be introduced, perhaps called the Zenfone 8 Mini.",
    "An event invite sent to outlets including PhoneArena includes a screen protector with the dimensions 148 mm x 69 mm (5.83 inches x 2.72 inches), so that might be a clue as to the size of the smaller model. The iPhone 12 mini has dimensions of 131.5 mm x 64.2 mm (that's 5.18 inches x 2.53 inches).",
    "Based on benchmarks supposedly from the Asus Zenfone 8 Mini, the phone is going to come carrying the Qualcomm Snapdragon 888 processor – and we would assume that the other Zenfone 8 models would have the same chipset in too.",
    "We haven't heard too many rumors about the Zenfone 8 up until now, but we were very impressed with what the Zenfone 7 and the Zenfone 7 Pro had to offer last year. It would seem that Asus has now decided that a mini model is required as well.",
    "Given the Zenfone 7 handsets were unveiled in August 2020, having their successors arrive in May 2021 is a bit of a surprise – though it's certainly plausible that last year's models were delayed due to the effects of the global coronavirus pandemic.",
    "It's going to be interesting to see if the Zenfone 8 phones keep the rotating flip camera on the top of the device, which serves as both a selfie and rear camera. It certainly helps the Zenfone series stand out from the rest of the market, though it's perhaps not as convenient as having regular rear and selfie cameras installed.",
    "We'll find out for sure on May 12 – and we will of course bring you all the announcements as they're made. The event is scheduled to get underway at 10am PT / 1pm ET / 6pm BST (that's 3am AEST on May 13 in Australia)."
  ],
  "headers": {
    "4": "A state of Zenfone"
  },
  "links": {
    "recent rumors": "https://www.techradar.com/news/upcoming-asus-phone-could-fill-the-sony-xperia-compact-shaped-hole-in-your-heart",
    "new splash page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7147333459313913000&xs=1&url=https%3A%2F%2Fwww.asus.com%2Fevent%2FZenFone8%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fasus-confirms-the-zenfone-8-is-launching-on-may-12-with-a-compact-version-rumored",
    "PhoneArena": "https://www.phonearena.com/news/Asus-teases-compact-yet-powerful-Zenfone-8-with-a-cute-invite_id131690",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "supposedly from": "https://www.techradar.com/news/asus-zenfone-8-minis-specifications-revealed-in-a-benchmark-listing",
    "Zenfone 7 Pro": "https://www.techradar.com/reviews/asus-zenfone-7-pro"
  }
}