{
  "source": "https://www.techradar.com/news/amd-and-nvidia-next-gen-flagship-gpus-could-force-you-into-a-psu-upgrade",
  "title": "AMD and Nvidia next-gen flagship GPUs could force you into a PSU upgrade",
  "category": "computing",
  "updated": "2021-07-30T13:42:23Z",
  "author": "darren-allan",
  "summary": "If rumors are right about seriously huge power draw from these cards",
  "article": [
    "Both AMD and Nvidia’s next-gen flagship graphics cards could be seriously power-hungry, at least if the latest gossip from the grapevine proves to be true.",
    "3DCenter has been on another rumor-collecting trawl, as picked up by VideoCardz, and the tapped info from multiple hardware leakers (on Twitter and elsewhere) suggests that the top dog cards from what could turn out to be the RTX 4000 and RX 7000 ranges will pull in over 400W in terms of power demands – possibly well over.",
    "In a discussion on Twitter, both kopite7kimi and Greymon55 agree that 400W will likely be exceeded by Nvidia’s next flagship GPU, and we could even be looking at possibly reaching a power consumption of 450W or even up towards 500W according to the latter leaker.",
    "This is just speculation, of course, so give all this a healthy coating of skepticism with the rumor brush, but it certainly points the way to some serious wattage demands from Team Green – and the same is purportedly true for rival Team Red.",
    "AMD’s RDNA 3 flagship is supposedly shaping up to be quite the beast, but it may have a serious appetite for Watts, too. As 3DCenter points out, Bondrewd reckons that AMD’s next-gen card won’t hit 500W, but with clues that leaker left as to the size of the chiplets (remember, the flagship RDNA 3 product is rumored to use a pair of GPUs), 3DCenter has guessed that the card could pull around 450W. Elsewhere, though, there are whispers that AMD’s card could hit more like 350W (but that’s still a good chunk more than the RX 6900 XT’s 300W TDP).",
    "Bondrewd also indicated that the Nvidia flagship will have a greater power consumption than 450W. Whichever way you dice it, if any of this theorizing and rumor peddling is near the mark, both next-gen flagships are going to be seriously demanding power-wise.",
    "Watts really could be problematic if we’re looking at 400W to 450W of power draw for the top-tier next-gen graphics cards. The current Ampere beast of a flagship, Nvidia’s RTX 3090, pulls 350W, and as we already mentioned, the RX 6900 XT chugs down 300W.",
    "And here’s the thing – at those levels, the 6900 XT comes with a minimum recommended power supply of 850W. The RTX 3090 has a recommendation from Nvidia of a minimum of a 750W PSU, and remember that really, with such beefy GPUs, ideally you want to be running a considerably higher wattage than that in your power supply just to be safe and leave a good amount of headroom.",
    "As we observed in our GeForce RTX 3090 review, the card actually consumed a maximum of 357W, and we recommended a full-on 1,000W PSU just to be really safe in any situation. Now, think of what kind of PSU requirements we’re going to be looking at in the future if these next-gen rumors are right.",
    "GPUs with this kind of massive power draw make it not just a simple matter of upgrading your graphics card when you want a new one, but also probably upgrading your power supply, at extra cost and inconvenience. A PSU upgrade is more complex than switching out a card or memory stick, and a bit of a faff involving more than a few cables – not something the less tech-confident gamers out there will particularly enjoy.",
    "Of course, we’ll have to see how the power requirements actually pan out, but this sounds rather ominous (for your electricity bill, too)."
  ],
  "headers": {
    "6": "Analysis: will you need a new PSU?"
  },
  "links": {
    "Nvidia’s": "https://www.techradar.com/news/nvidia-geforce",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "3DCenter": "https://www.3dcenter.org/news/hardware-und-nachrichten-links-des-29-juli-2021",
    "VideoCardz": "https://videocardz.com/newz/next-gen-flagship-gpus-nvidia-ad102-and-amd-navi31-might-both-draw-more-than-400w-of-power",
    "supposedly shaping up to be quite the beast": "https://www.techradar.com/news/amds-rdna-3-flagship-gpu-could-be-ridiculously-powerful-but-at-what-cost",
    "Bondrewd": "https://forum.beyond3d.com/threads/amd-rdna-3-speculation-rumours-and-discussion.62092/page-29#post-2217149",
    "whispers": "https://twitter.com/MelodicWarrior1/status/1420835506108211200",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "power supply": "https://www.techradar.com/news/best-pc-power-supply",
    "GeForce RTX 3090 review": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}