{
  "source": "https://www.techradar.com/news/bang-and-olufsen-launches-a-headset-for-work-that-you-might-actually-want-to-wear",
  "title": "Bang & Olufsen launches a headset for work that you might actually want to wear",
  "category": "computing",
  "updated": "2021-10-28T08:06:55Z",
  "author": "mike-moore",
  "summary": "Bang & Olufsen launch the most premium headset for work yet",
  "article": [
    "One of the world's most famous audio brands is looking to add a bit of glamour to your video conferencing calls with a super-smart new release.",
    "Bang & Olufsen has teamed up with Cisco to release the (somewhat originally-titled) Bang & Olufsen Cisco 980 headphones. The partners say that the new headset targets hybrid workers looking to split their time between home and the office, but also looking for a premium audio experience.",
    "To that end, the new headset features some handy workplace features, including built-in integration with Cisco's Webex online collaboration platform, as well as adaptive active noise cancellation to really let you focus when on a call.",
    "Available from the start of 2022 for around $549, the Bang & Olufsen Cisco 980 headphones are a lightweight alternative to traditional audio headsets, with the manufacturer saying they offer a \"stable, enduring fit\" for all-day use that is still comfortable.",
    "When it comes to connectivity, the headset features Bluetooth 5.1, Webex integrations, voice prompts and convenient on-ear call controls that allow users to easily mute, answer or end calls.",
    "The headset uses beamforming microphone arrays to create a virtul boom arm, meaning there's no need to fiddle with a manual microphone. This also helps with the noise cancellation tools, meaning you can keep your focus and feel like you are part of the meeting.",
    "IT departments and admins can also easily deploy, manage, and view real-time analytics of the Bang & Olufsen Cisco 980 all from a single platform, and calls will remain secure thanks to a combination of hardware and software-based protections.",
    "\"Today, customers want a product they can use at home, at work or in transition - and look and feel good when using it,\" said Kristian Teär, CEO Bang & Olufsen.",
    "\"We’re integrating Cisco’s industry leading technologies with our renowned capabilities within sound, design, and craftsmanship to create the ultimate audio product for the hybrid world.”",
    "These are the best wireless headphones around today"
  ],
  "headers": {
    "3": "Premium quality"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "hybrid workers": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "headset": "https://www.techradar.com/news/best-business-headphones-and-earphones",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Webex": "https://www.techradar.com/reviews/cisco-webex-meetings",
    "best wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344"
  }
}