{
  "source": "https://www.techradar.com/news/ev-charging-connector-types-what-they-are-and-how-they-compare",
  "title": "EV charging connector types: what they are and how they compare",
  "category": "car-tech",
  "updated": "2021-07-17T15:00:56Z",
  "author": "ian-evenden",
  "summary": "We explore the various types of EV charging connectors",
  "article": [
    "Moving to an EV from a petrol car is fairly straightforward. All the controls are in the same place, and the steering wheel hasn't changed into a large carrot or anything like that.",
    "The thing that is different, however, is the fuel - and that means a new type of fueling connector. EV charging connectors are broadly similar to a petrol hose - they're a pipe the electricity comes down - but there are three distinct types of charger, and they might need an adapter depending on what's fitted on your new electric car.",
    "Those types are Rapid, which is the fastest. Fast, which is not the fastest. And Slow, which you probably get the idea about.",
    "Charging comes in either AC (for home chargers) or DC, and the amount of energy is measured in kilowatts.",
    "Rapid chargers always have captive cables, so no need to bring your own, but the other kinds may require you to bridge the gap between charger and car yourself - your EV will come with a set of cables and adapters to do just this.",
    "The market has yet to coalesce around one type of plug, and it can be quite complicated working out what goes where. We're here to help, and these are the most common connectors used on electric cars.",
    "With its three large pins and two smaller ones, this is the charging connector seen most commonly in Asia, and not seen much in the rest of the world apart from low-voltage charging in North America.",
    "Commonly seen as part of home charging solutions in Europe, and as part of some Tesla Superchargers, the Type 2 actually comes in two types.",
    "There's the AC version that's installed on the front of people's houses, which is made up of seven pins, two small and five large, with a flattened edge for orientation.",
    "Then there's a DC version, known as a Combo 2, which does away with all but three of those but adds two more even larger pins in a separate lozenge below them.",
    "A CCS (Combined Charging System) connector keeps all the pins from both Type 2 versions, so a Type 2 plug can be used in a CSS socket, but a Combo 2 won't fit in a Type 2 socket, as it lacks space for the additional pins.",
    "The least common type of electric car charger connector, this features an oval housing and up to seven pins. It's well protected against the elements by safety shutters, but hasn't seen much take-up among charging point manufacturers.",
    "Often found on rapid chargers, and backed by Nissan, Toyota, Honda and Mitsubishi, the CHAdeMO 2.0 spec can deliver up to 400kW of DC to your vehicle.",
    "The name comes from a contraction of a Japanese phrase that translates into English as 'How about a cup of tea?' referring to the speed of the charging. The connector looks like four circles, with the top and bottom ones containing another four pins each, and it's also known as a Type 4.",
    "Tesla has its own two-pin charging plug, but does not supply it to Europe. In North America, this is what's installed on Tesla Superchargers, but the company seems to be changing over to the CCS standard.",
    "China, which has the world's largest electric car fleet, has its own charging connection. This again comes in AC and DC variants, the former with seven pins, and the latter with nine. Its plugs are circular, with a flattened edge, and larger than other types.",
    "If you're in the US, and don't drive a Tesla, then you're most likely to come across the CCS version of the Type 2 connector.",
    "It's becoming standardized across the country for fast charging at the expense of CHAdeMO/Type 4, which is found on the Nissan Leaf and the Mitsubishi Outlander PHEV.",
    "If you're in Europe, you'll come across Type 2 variants most commonly - even Tesla uses it. Some cars, such as the Leaf, will have two sockets built into them, while others come with a bootful of adapter cables.",
    "It doesn't matter what connector your EV uses, as long as you can safely attach it to a charger using some combination of cable and adapter.",
    "They're all different enough to ensure you can never plug the wrong plug into the wrong socket, so there's no need to worry. You'll be able to charge your car almost everywhere you go no matter what model you buy."
  ],
  "headers": {
    "6": "Type 1",
    "7": "Type 2",
    "11": "Type 3",
    "12": "CHAdeMO/Type 4",
    "14": "Tesla",
    "15": "GB/T 20234.2-2015",
    "16": "You'll most likely come across..."
  },
  "links": {}
}