{
  "source": "https://www.techradar.com/news/another-crypto-marketplace-has-been-hit-by-a-major-cyberattack",
  "title": "Another crypto marketplace has been hit by a major cyberattack",
  "category": "computing",
  "updated": "2021-10-28T12:27:14Z",
  "author": "mayank-sharma",
  "summary": "Cream Finance suffers third million-dollar robbery this year",
  "article": [
    "Hackers have stolen about $130 million worth of cryptocurrency assets from Cream Finance, by exploiting a bug in their flash loaning system to siphon away all Ethereum-based tokens on the platform.",
    "This is Cream Finance’s third hack this year alone. The decentralized finance (DeFi) platform allows users to loan and speculate on cryptocurrency price variations.",
    "The latest incident was first detected by blockchain security firms PeckShield and SlowMist, before it was confirmed by the Cream Finance team.",
    "“Our Ethereum C.R.E.A.M. v1 lending markets were exploited and liquidity was removed on October 27, 1354 UTC….No other markets were impacted,” shared Cream Finance on Twitter.",
    "Before today’s incident, Cream Finance had suffered million dollar heists earlier in the year, losing $37 million in February, and another $29 million in August.",
    "Interestingly, all attacks were flash loan exploits, which reportedly has emerged as one of the most common ways hackers use to break into DeFi platforms over the past two years.",
    "According to a report by CipherTrace, DeFi related hacks have accounted for 76% of all major hacks in 2021, resulting in users losing cryptos worth more than $474 million.",
    "Cream Finance patched the bux within hours of the theft. However, The Record believes that even though the attacker’s initial wallet has been identified, the funds have already been moved to new accounts, and there’s little chance of the stolen crypto being traced and returned to the wallets of the victims."
  ],
  "headers": {
    "4": "Repeat victims"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "Ethereum": "https://www.techradar.com/news/ethereum-a-victim-of-its-own-success",
    "DeFi": "https://www.techradar.com/news/what-is-defi-everything-you-need-to-know",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "PeckShield": "https://twitter.com/peckshield/status/1453364046904786950",
    "SlowMist": "https://twitter.com/SlowMist_Team/status/1453398034151194627",
    "confirmed": "https://twitter.com/CreamdotFinance/status/1453455806075006976",
    "shared": "https://twitter.com/CreamdotFinance/status/1453455806075006976",
    "report by CipherTrace": "https://ciphertrace.com/cryptocurrency-crime-and-anti-money-laundering-report-august-2021/",
    "The Record believes": "https://therecord.media/hackers-steal-130-million-from-cream-finance-the-companys-3rd-hack-this-year/",
    "wallets": "https://www.techradar.com/news/best-bitcoin-wallets"
  }
}