{
  "source": "https://www.techradar.com/news/battlefield-2042s-mystery-mode-could-let-you-play-remastered-classic-maps",
  "title": "Battlefield 2042's mystery mode could let you play remastered classic maps",
  "category": "gaming",
  "updated": "2021-06-23T12:26:35Z",
  "author": "vic-hood",
  "summary": "It's rumored to be called the 'Battlefield Hub'",
  "article": [
    "EA Dice is set to reveal Battlefield 2042's third multiplayer experience during its EA Play event on July 22 but, thanks to a notable leaker, we may already know what this unrevealed mode entails.",
    "According to Tom Henderson (via VGC), who correctly leaked numerous details about the new Battlefield before its reveal, this third multiplayer experience is called the 'Battlefield Hub' and will allow players to play remastered versions of classic Battlefield maps.",
    "\"Battlefield Hub is going to contain remasters of old maps from old Battlefield titles,” Henderson says in a video. \"It’s going to be a map on the Battlefield 2042 engine and it's going to run on that engine, so the movement and stuff like that is going to be exactly the same. However, you’re essentially playing on a remastered map with different weapons and vehicles from past Battlefield titles.\"",
    "According to Henderson, the main map will be 64-player only, though the Battlefield Hub will support 128-player maps on next-gen consoles and PC. \"It just depends on the map,\" Henderson says. This suggests we could see some of the bigger classic Battlefield maps supporting 128 players.",
    "Henderson also claimed that the Battlefield Hub is going to be \"the ultimate sandbox experience\" and is touted to be the \"fun\" game mode when it comes to Battlefield 2042. According to Henderson's sources, the Battlefield hub isn't necessarily going to be a competitive or balanced experience, with the focus being on fun instead. Henderson also claims that this mode won't feature classes, but instead will feature Battlefield 2042's Specialists instead.",
    "EA Dice has already revealed two of Battlefield 2042's three multiplayer experiences: All Out Warfare and Hazard Zone, but it hasn't shared any details on the third multiplayer mode, which is set to be unveiled during the EA Play event. However, we do know that this third experience has been \"designed as a love letter\" to Battlefield fans.",
    "Henderson's claim would make sense then, and given that the leaker already accurately leaked Battlefield 2042's extreme weather conditions, robot dogs and parts of the narrative, we're inclined to believe his claims about this third mode – although he does caution fans to take this information \"with a big pile of salt\".",
    "It's not long until we find out if this rumor is true, as we'll officially get confirmation of what this third multiplayer mode is on July 22."
  ],
  "headers": {
    "5": "Not long to wait"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Tom Henderson": "https://www.youtube.com/watch?v=fyiEucNCrEw",
    "VGC": "https://www.vg247.com/2021/06/23/battlefield-2042-battlefield-hub-report/",
    "extreme weather conditions": "https://www.techradar.com/news/battlefield-6-could-feature-extreme-weather-conditions-and-even-more-vehicles",
    "robot dogs": "https://www.techradar.com/news/battlefield-6-could-add-robot-dogs-to-your-arsenal",
    "narrative": "https://www.techradar.com/news/battlefield-6-could-let-you-have-control-over-which-superpower-you-fight-for"
  }
}