{
  "source": "https://www.techradar.com/news/webex-reveals-major-cloud-calling-expansion",
  "title": "Webex reveals major cloud calling expansion",
  "category": "computing",
  "updated": "2021-09-07T19:00:31Z",
  "author": "anthony-spadafora",
  "summary": "Cisco has added the UK to its Webex Calling plans",
  "article": [
    "Cisco has revealed that its video conferencing software and cloud calling solution Webex now hosts a record 8bn calls each month.",
    "Furthermore, to help meet the growing global needs of enterprise businesses, Cisco has also extended its domestic calling coverage to include the UK.",
    "Now businesses can reach customers in more than 65 countries with the company's Cisco Calling Plans and Cloud Connected PSTN services. T-Mobile, Office Depot, Cigna Health and CDK Global are just a few of the large brands that rely on Webex Calling to power their businesses.",
    "EVP and GM of Cisco Security and Collaboration, Jeetu Patel explained in a press release how the company's Webex Suite is an ideal solution for hybrid work, saying:",
    "\"With the move to hybrid work and increasing pressure to delight customers, there's never been a greater need to unify communications across the entire workforce. As enterprises look to migrate calling solutions to the cloud, Webex Calling offers the leading end-to-end, secure calling experience that makes unified communications a reality.\"",
    "Webex Calling is part of Cisco's Webex Suite which provides a number of services including cloud calling, messaging, meetings, polling, events and socio in a unified, secure offering.",
    "Calling systems need to be reliable especially when they are embedded into a businesses' everyday workfows. For instance, in a hospital if a call is delayed by even a minute, it can be the difference between life and death when a patient arrives in critical condition.",
    "In addition to adding support for calls to the UK, Cisco now allows customers to customize their PSTN solutions by mixing and matching options to meet their location and operational requirements. The company has also integrated its cloud connected PSTN in Control Hub to enable customers to automate the ordering and provision of new numbers quickly and easily.",
    "Webex Calling customers are supported by Cisco's extensive partner ecosystem for cloud calling with over 1,000 partners worldwide that offer local delivery, integration and calling plans and support to meet specific customer needs."
  ],
  "headers": {
    "5": "Webex Calling"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "cloud calling": "https://www.techradar.com/best/best-cloud-phone-systems",
    "Webex": "https://www.techradar.com/reviews/cisco-webex-meetings",
    "press release": "https://www.prnewswire.com/news-releases/webex-by-cisco-hits-record-8-billion-monthly-calls-milestone-301369555.html",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "polling": "https://www.techradar.com/best/best-qanda-and-polling-platforms",
    "events": "https://www.techradar.com/best/best-virtual-event-platforms"
  }
}