{
  "source": "https://www.techradar.com/news/spotify-hifi-is-apparently-available-for-some-users-but-only-for-a-few-seconds-at-a-time",
  "title": "Spotify HiFi is apparently available for some users – but only for a few seconds at a time",
  "category": "audio-visual",
  "updated": "2021-05-18T19:09:10.983Z",
  "author": "nick-pino",
  "summary": "The time for HiFi draws nigh",
  "article": [
    "Apple and Amazon made their cases to audiophiles earlier this week when they announced that the high resolution of Apple Music (called Apple Music Lossless) and Amazon Music Unlimited (called Amazon Music HD) would be made available to subscribers at no extra cost.",
    "Now we have a strong theory as to why: it looks strongly like Spotify HiFi has begun to pop up on some users' devices, meaning the launch is likely happening soon.",
    "Following up on a thread they spotted on Reddit by user themonarc, a reader claims they have successfully captured images of Spotify HiFi in action and shared their findings with us via Imgur. While we've not been able to validate the images ourselves, the quality, font, variety and content suggests strongly that these are genuine.",
    "The shared images show the HiFi icon in the lower right corner of the app and includes text about music playing at 16-bit/44.1kHz quality.",
    "The app says that if bandwidth suddenly drops, it will degrade the quality of the stream so that listening isn’t interrupted and the images confirm that HiFi music can be downloaded locally for later playback.",
    "Here’s our gallery of the images provided to us by a reader:",
    "Because users are seeing the icon in the app – albeit very briefly at startup – it looks like launch could happen any day now.",
    "Spotify HiFi’s imminent launch might also explain why Apple and Amazon unceremoniously announced their support for high-resolution audio streaming on a random Monday rather than during some larger press event.",
    "Our working theory is that Apple and Amazon knew this could happen and wanted to get out ahead of launch.",
    "Of course, we’re working to verify the images with Spotify as we speak – and will certainly ask about the launch plans for Spotify HiFi – and will share what we can soon."
  ],
  "headers": {
    "6": "How soon will HiFi service start?"
  },
  "links": {
    "made available to subscribers at no extra cost": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "themonarc": "https://www.reddit.com/r/truespotify/comments/netuuw/i_successfully_opened_the_hifi_menu_by_quickly/",
    "Imgur": "https://imgur.com/a/hEmiKHj/"
  }
}