{
  "source": "https://www.techradar.com/news/covid-19-a-defining-moment-for-businesses-data-usage",
  "title": "COVID-19: a defining moment for businesses’ data usage",
  "category": "computing",
  "updated": "2021-04-13T10:33:01Z",
  "author": "andrew-abraham",
  "summary": "How the pandemic has changed perceptions of data",
  "article": [
    "The COVID-19 pandemic has undoubtedly expanded our understanding of how we can use data. It’s demonstrated how it can be applied for societal good by guiding the provision of resources, helping us to track the virus’ progress, and determining the effectiveness of countermeasures.",
    "It has also opened organizations’ eyes to the important role of data in digital transformation. This is a key finding of Experian’s latest Global Data Management report, which surveys 700 data practitioners and data-driven business leaders globally to establish how the pandemic has affected attitudes towards data within their organizations.",
    "However, the pandemic has also exposed weaknesses in businesses’ data management practices. Many leaders describe low data quality, a shortage of data skills, and a lack of agility in data processes. COVID-19 is evolving the picture; acting as a catalyst for digital transformation, shifting attitudes towards data and forcing leaders to consider how they can use their data more effectively.",
    "The pandemic has rapidly digitalized the way we live and work, so that three quarters of survey respondents saw a dramatic change in their customers’ behavior.",
    "Within this new context, business leaders are struggling to understand evolving customer requirements and how best to serve them. They know that digital transformation is key – but deciding the best approach to this can be a challenge. To overcome this, businesses are turning to data. Almost three quarters (72%) of business leaders say that the rapid push to digital transformation is making their businesses more reliant on data.",
    "Beyond underscoring its business value, the pandemic has also exposed data's potential to be used for societal good – and business leaders are keen to explore this further. 78% see COVID-19 as a defining moment for organizations to set-up and use data for societal good, while 86% would like to use their data to this end.",
    "While this is easy to say, our research also indicates that leaders are thinking about practical steps to achieve this. Some are looking to increase collaboration with other organizations or share talent and resources to develop and deliver products. Others may allow data practitioners to spend time on voluntary projects. Whatever route they choose, these all present hugely positive steps.",
    "While we’re seeing fierce ambition from businesses to implement data initiatives, the reality is that some will struggle to use data unless they can overcome weaknesses in legacy data management practices.",
    "Our research indicates that the most significant barrier to organizations using data for business and social good is poor data management. Currently, organizations believe a third (32%) of their data is inaccurate in some way and 55% lack trust in data assets. This is hugely concerning, as businesses will struggle to unlock the potential of data-based decision making if they do not trust the information available to them.",
    "What’s more, embracing the power of data is being stunted by a skills gap; 62% say a lack of basic data literacy skills impacts the value they get from their investment in data and technology, while 55% believe they lack the skills or resources to leverage data assets fully.",
    "These entrenched issues are hampering businesses’ ability to be agile – something that has been crucial during the pandemic. Those businesses able to instantly respond to market shifts by pivoting digital strategy and operational tactics have won out. However, 62% admit a lack of agility in data processes has hurt their response to changing business needs in the wake of COVID-19.",
    "It’s clear there is still a way to go in overcoming these barriers, but business leaders are eager to make headway. Eighty-five percent plan to hire data roles in the next six months, with the same proportion looking to invest in the technology and processes to equip and empower these people.",
    "Many are also looking at DataOps over the coming year. This emerging practice aims to shorten development cycles, increase deployment frequency, and create more dependable releases of data pipelines, in close alignment with business objectives. Having these practices in place will help organizations adapt more quickly to changing conditions.",
    "Fundamentally, leaders know that getting the basics right; prioritizing data quality, technology and skills, will be key to organizational success moving forward.",
    "For businesses, the pandemic has highlighted the urgent need for digital transformation – and the importance of high-quality data to guide this. While poor data management will have hampered many organizations’ response to the pandemic, leaders are now more aware of endemic weaknesses and committed to addressing these. As a result, the future looks bright for data usage, both for business and societal good."
  ],
  "headers": {
    "3": "Shifting demands for data",
    "7": "Hampered by data mismanagement",
    "11": "Overcoming barriers",
    "14": "Light on the horizon"
  },
  "links": {
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "surveys": "https://www.techradar.com/best/best-survey-tools",
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation"
  }
}