{
  "source": "https://www.techradar.com/news/the-tesla-model-3-and-model-y-just-got-more-expensive-overnight-thanks-to-price-hike",
  "title": "The Tesla Model 3 and Model Y just got more expensive overnight thanks to price hike",
  "category": "car-tech",
  "updated": "2021-10-13T13:31:15Z",
  "author": "chris-teague",
  "summary": "The Model Y and Model 3 prices have risen",
  "article": [
    "Earlier this year, Tesla seemed to raise the prices on its vehicles almost daily, responding to what CEO Elon Musk said were supply chain issues.",
    "Price hikes stopped over the summer, but now it appears that Tesla has fallen back off the wagon, because overnight between October 5 and October 6, the automaker increased pricing on its most popular models.",
    "Tesla's pricing updates pushed the cost of a Model 3 Standard Range Plus to $41,990 and the price of the Model 3 Performance to $57,990.",
    "Pricing for the Model 3 Long Range AWD stayed flat at $49,990. Similarly, the cheapest Model Y is now $2,000 more expensive and the performance model got a $1,000 bump.",
    "While Tesla cars purchased after December 31, 2019, are no longer eligible for government tax credits, a new federal EV incentive is expected by year's end.",
    "If that happens, buyers would be able to take advantage of up to $8,000 in credits or discounts, greatly softening the price of a new Tesla.",
    "Price increases aside, Tesla delivered more cars than expected in the third quarter of 2021, putting it on pace to crush expectations for the year.",
    "That growth is driven by sales of the Model 3 and Model Y, so it's possible that the company recognizes popular models and wants to capitalize on the interest.",
    "Demand hasn't been Tesla's problem, so it's in the automaker's court to meet demand and continue to deliver vehicles.",
    "For Tesla hopefuls, price increases can be discouraging, but it's important to look at the industry as a whole. Prices are climbing, and that's assuming you don't have to wait a year to get your new car.",
    "The Model Y is still cheaper than a comparable Ford Mustang Mach-E at this point, and while some versions of the car won't deliver until April 2022, some can be scheduled for as soon as next month."
  ],
  "headers": {
    "4": "New grant could help soften price hike"
  },
  "links": {
    "Model 3 Long Range": "https://www.techradar.com/news/tesla-model-3-long-range-2021-review",
    "Ford Mustang Mach-E": "https://www.techradar.com/news/ford-mustang-mach-e"
  }
}