{
  "source": "https://www.techradar.com/news/how-do-you-bring-castlevania-to-your-iphone-a-developer-qanda",
  "title": "How do you bring Castlevania to iPhone? We spoke to the developers to find out",
  "category": "phones",
  "updated": "2021-09-17T15:00:45Z",
  "author": "david-lumb",
  "summary": "Castlevania: Grimoire of Souls is live on Apple Arcade",
  "article": [
    "Today, Apple Arcade added a game from one of the most storied franchises in the video game industry. Castlevania: Grimoire of Souls from Konami is rolling out now to subscribers of Apple’s game service, and TechRadar got to chat with the game’s developers to see what it took to adapt the storied franchise to smartphones.",
    "The most beloved Castlevania games, like the PS1 classic Castlevania: Symphony of the Night, feature players exploring gothic castles in side-scrolling gameplay and fighting monsters with an armory of mighty weapons before taking on a master villain – which is usually Dracula, the famous vampire.",
    "The Castlevania series was so influential that it spawned (with the Metroid games) its own genre, the ‘Metroidvania,’ spawning imitators and inspiring plenty of indie games to this day with varied takes on the classic formula. But Castlevania: Grimoire of Souls looks to be a return to the grim, supernatural action that made the series famous – and thanks to the successful Netflix animated Castlevania show, ready for fans new and old to explore the game’s gothic world.",
    "And series fans will see from Castlevania: Grimoire of Souls screenshots that the game will have several playable characters, including what looks like series favorites Simon Belmont (of the Dracula-hunting Belmont clan), Alucard (Dracula’s half-vampire son), a magic user (perhaps Sypha Beinades, from the show), and at least one other.",
    "But launching Grimoire of Souls on Apple Arcade meant more than shrinking the action down to tablet and smartphone size – the developers had to adapt the series’ fast side-scrolling action to touchscreens. Yota Tsutsumizaki, lead planner and level designer of Metal Gear Solid V: The Phantom Pain and director of Metal Gear Survive, directed Grimoire of Souls – and he graciously answered our questions about what it took to bring Castlevania to your iPhone and iPad.",
    "Apple and Konami connected TechRadar to Tsutsumizaki-san via email, and his responses have been translated from Japanese.",
    "TechRadar: First off, what was it like to make Castlevania playable on smartphones and tablets? What did you have to adjust, and what about Castlevania couldn't be adapted for touchscreens?",
    "Tsutsumizaki-san: When designing an action game, it's common to consider the action from in the point of the input device of the platform. This game was also designed with touch screen input, so there were some actions that we had to adjust and some that we didn't adopt for designing reasons.",
    "Such as quick continuous input (like double-clicking) or command input using the directional keys. We decided not to use these because they would have caused frustration for users on the touch screen. In terms of the movement, we adopted a method in which the center point of the input moves, as well as a virtual stick, which is common on touchscreens. I think it reduces the misalignment inherent in touch screens.",
    "TechRadar: What should players expect from Grimoire of Souls? What can it offer veteran fans as well as newcomers to the franchise?",
    "Tsutsumizaki-san: As this title has been running for 35 years, there are many attractive characters. I hope that this game, with its chance encounters with these characters, will be a nostalgic experience for fans of the past, and a chance for newcomers to learn about the wonderful works of the past.",
    "TechRadar: How do you keep the Castlevania franchise feeling new, while sticking to what is a relatively-rigid formula (e.g the Metroidvania exploration format)?",
    "Tsutsumizaki-san: We did not adopt an exploratory platform for this game, as we emphasized the fact that many users would play it on mobile devices. This is because exploratory games tend to have a relatively long play time per play session.",
    "Rather than designing a game which can be played for a long time at a time, we focused on having players play something action-packed over and over again whenever they have time.",
    "TechRadar: Is there pressure when working on a franchise that includes Symphony of the Night, a game regularly cited as one of the all time greats? And what inspiration can that 25-year-old game offer today?",
    "Tsutsumizaki-san: In many of the development sites I have experienced, there was always a sense of pressure and tension. This is also the case in this game. However, this is not a bad thing, and I think it is a good trend because it is born from the desire to entertain the users.",
    "This title is a long series that marks its 35th anniversary and has been built up by many predecessors. I hope you will be able to feel a part of the many characters and their history in this work."
  ],
  "headers": {
    "5": "Q&A with game director, Yota Tsutsumizaki"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it"
  }
}