{
  "source": "https://www.techradar.com/news/inmarsat-combines-satellite-and-5g-into-a-single-global-network",
  "title": "Inmarsat combines satellite and 5G into a single global network",
  "category": "computing",
  "updated": "2021-07-30T10:44:19Z",
  "author": "steve-mccaskill",
  "summary": "Inmarsat touts 'world first' Orchestra network",
  "article": [
    "UK firm Inmarsat is creating what it claims to be a “world first” network that combines satellite and 5G technology, ensuring customers can receive a reliable connection wherever they may be in the world.",
    "‘Orchestra’ fuses geosynchronous (GEO) and low earth orbit (LEO) satellites with terrestrial 5G infrastructure into a single network, blending coverage and capacity.",
    "Satellite has long been prized for its wide coverage, especially in remote parts of the world such as oceans, and advances in technology have boosted speeds and lowered latency. This is especially important across busy oceanic flight paths where multiple aircraft might be competing for signal.",
    "The addition of 5G into the mix means customers can still get a signal in a crowded port, while it also opens up potential new use cases like autonomous vessels that operate close to shore.",
    "Orchestra is also a dynamic mesh network that allows traffic to be routed between customer terminals. This means that if a vessel is connected to a 5G network, it can provide support for other ships – extending the reach of the network and boosting resilience.",
    "Inmarsat says the benefits are not just limited to the maritime industry. It says aviation, government and enterprises can all take advantage. Potential use cases include emergency services, oil and gas, and defence.",
    "“An orchestra brings different instruments together, each supporting the other and playing its role in the masterpiece. We’re building [Inmarsat] Orchestra on the same concept,” said Rajeev Suri, CEO of Inmarsat.",
    "“By combining the distinct qualities of GEO, LEO and 5G into a single network, we will deliver a service that is far greater than the sum of its parts. Our customers will benefit from dramatically expanded high throughput services around the world. This is the future of connectivity and Inmarsat is perfectly positioned to bring it to the world with its proven technology expertise, right base of customers and partners, and financial strength.”",
    "“Orchestra ensures Inmarsat is well positioned to deliver long-term, profitable growth by delivering new services to existing customers, targeting near-adjacent market segments, and maintaining a strong competitive position.",
    "“We have a record of adopting the right technology at the right time. We plan to focus initially on delivering the Orchestra terrestrial network, while preparing for a future LEO constellation in the range of 150-175 satellites. This is a highly cost-effective approach that leverages Inmarsat’s leading GEO satellite networks as part of Orchestra unique multi-layer architecture.”"
  ],
  "headers": {
    "3": "Inmarsat 5G"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}