{
  "source": "https://www.techradar.com/news/oppos-foldable-phone-sounds-way-more-interesting-than-the-galaxy-z-fold-3",
  "title": "Oppo's foldable phone sounds way more interesting than the Galaxy Z Fold 3",
  "category": "phones",
  "updated": "2021-10-13T10:04:15Z",
  "author": "tom-bedford",
  "summary": "A top-spec foldable phone",
  "article": [
    "While Samsung's Galaxy Z Fold 3 is currently the best foldable phone according to our ranking, an upcoming rival from Oppo could steal that crown, going by a leaked specs list.",
    "This information comes from prolific leaker Digital Chat Station, posting on Chinese social media platform Weibo. It's not exactly clear where they got the information from, but since they're leaking details on upcoming phones all the time, we can only presume they have sources.",
    "According to Digital Chat Station, the Oppo foldable phone will have a screen that's somewhere between 7.8 and 8 inches - the leak doesn't specify the 'outer' screen size, or even the form factor, but the leaked size all but confirms it's a 'book-style' foldable like Samsung's Galaxy Folds.",
    "The leak continues that the screen will have a 2K resolution, which would be about 1200 x 2000 pixels depending on the screen aspect ratio. This will apparently have a 120Hz refresh rate and will use OLED tech.",
    "DCS says the phone will have the Snapdragon 888 chipset - this is currently one of the top processors available to Android phones, but a new version is expected in December 2021, which implies the foldable could come before then.",
    "With regards to the cameras, DCS suggests the phone will have a 32MP front-facing snapper, and on the rear will tout the Sony IMX766 50MP sensor. Both those cameras make the foldable sound like the Oppo Find X3 Pro, which had them both, and was a fantastic camera phone as a result.",
    "Finally, DCS states the phone will run Android 11 with Oppo's ColorOS 12 laid over the top - again things that point to an imminent release, with Android 12 rolling out soon - and that it will have a side-mounted fingerprint scanner.",
    "Some of the leaked Oppo foldable phone specs make it sound like a Samsung Galaxy Z Fold 3 rival, especially since lots of it sounds the same, but there are some areas in which it has a clear edge.",
    "For example, that 50MP Sony sensor would give the phone a clear photography advantage over the Z Fold 3 with its 12MP snappers, as the IMX766 is fantastic for capturing colors and light.",
    "The 32MP selfie camera would also be much more high-res than Samsung's 4MP front-facer, and presumably it won't use an under-display camera either, the use of which on the Fold resulted in some very iffy selfies.",
    "At 7.6 inches across, the Z Fold 3's screen is a little smaller than the Oppo is expected to be, though many people might not notice that 0.2-inch difference.",
    "It's really the camera department that makes the Oppo foldable sound more exciting than the Z Fold 3 - for a phone as expensive as the Samsung, you'd expect top photography, but it doesn't quite deliver. We still need to hear more about Oppo's option before we call it the best outright, but it sounds promising.",
    "Via MyFixGuide"
  ],
  "headers": {
    "7": "Analysis: Samsung? More like Sam-done"
  },
  "links": {
    "Samsung's Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "best foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "Weibo": "https://m.weibo.cn/detail/4691803179844623",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "camera phone": "https://www.techradar.com/news/best-cameraphone",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "MyFixGuide": "https://www.myfixguide.com/oppo-foldable-phone-specs-revealed/"
  }
}