{
  "source": "https://www.techradar.com/news/want-the-best-sounding-headphones-this-portable-dac-could-be-your-secret-weapon",
  "title": "Want the best-sounding headphones? This portable DAC could be your secret weapon",
  "category": "audio-visual",
  "updated": "2021-03-19T12:18:48Z",
  "author": "olivia-tambini",
  "summary": "A portable DAC can transform your headphones",
  "article": [
    "If you want to get the most out of your headphones, a portable DAC is an excellent investment, making your cans sound crisper and clearer – and the latest mini DAC (Digital-to-Analogue Converter) from Astell & Kern could be a convenient way to achieve better sound on the move or at home.",
    "The Astell & Kern AK USB-C DUAL DAC Cable allows you to connect your wired headphones to phones or devices without a 3.5mm audio port (like most modern smartphones, for example), as well as hopefully improving the sound of your music.",
    "Like previous Astell & Kern devices, the new portable DAC cable has an angled design, sleek lines, and should be light and small enough to use comfortably on the move.",
    "The small size of the AK USB-C DUAL DAC Cable is particularly impressive. An innovative circuit has been designed to fit into a chassis the size of a pack of gum (17mm x 50mm x 10.3mm).",
    "Inside the device are two DACs thats support Hi-Res Audio playback up to 32bit/384kHz – so if you use a music streaming service like Tidal or Amazon Music HD, your high quality tracks should sound pristine.",
    "Bespoke capacitors are designed to optimize the audio circuit, suppressing power fluctuations, so you should get a stable audio performance at all times.",
    "The dual DACs are paired with an analog amplifier, which Astell & Kern says is designed to deliver \"a distortion-free, live, warm and clear sound as the artist intending, while harboring power to sufficiently drive a variety of high impedance headphones\".",
    "The cable itself is designed to be durable and reduce signal interference for a clean sound, with thick-plated copper that should help to offer \"a clear and rich spatial sound\". It's also been given a shielding treatment to prevent digital and analogue signal noise from your playback device.",
    "All that in a package the size of a pack of gum sounds very impressive – and at $149 / £109 (about AU$190), it's not too expensive either.",
    "There's a catch though; while the portable DAC works with Android smartphones, Windows 10 PCs, tablets, and MacOS computers, it won't work with your iPhone or iPad. According to the company, this is because a dual DAC cable requires more current to run than iOS devices export.",
    "If you're looking for a DAC that will work with your iPhone, check out models like the Chord Mojo or the Audiolab M-DAC Nano, with the latter offering wireless connectivity as well as a compact design that'll slip right into your pocket."
  ],
  "headers": {
    "4": "All that in a pack of gum"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "portable DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "Windows 10 PCs": "https://www.techradar.com/news/best-windows-laptop",
    "Chord Mojo": "https://chordelectronics.co.uk/product/mojo/",
    "Audiolab M-DAC Nano": "https://www.audiolab.co.uk/nano/"
  }
}