{
  "source": "https://www.techradar.com/news/ps5-dualsense-charging-station-price-april",
  "title": "PS5 DualSense charging station: it's out of stock – but you can win it today",
  "category": "gaming",
  "updated": "2021-04-18T19:36:11Z",
  "author": "matt-swider",
  "summary": "The PS5 DualSense charger accessory is a rare find, but we've tracked down three to give away. Here's how to claim one.",
  "article": [
    "The Sony PS5 DualSense charging station is in stock for only a few minutes of a time whenever we see it for sale at Walmart, Target and Amazon. It doesn't last long, but there's good news for at least three people.",
    "The TechRadar PS5 restock tracker efforts have yielded three (3) DualSense charging stations (pictured) that we bought ourselves from GameStop and Amazon.",
    "Multiple entries can be had by US residents – by following TechRadar, following our PS5 restock tracker Matt Swider on Twitter and Instagram, and subscribing to the newsletter. We'll also be having an Xbox-related giveaway in the following week to keep things fair.",
    "There's still a chance to buy the PS5 DualSense charger for its normal price from a few retail stores a few times a week, but it stays in stock for minutes if not seconds.",
    "The official price is $29.99 MSRP, and you can pay that at Walmart, Amazon, Target, Best Buy and GameStop if you know when to look. But you have to be quick – this critical PS5 accessory is harder to buy than the PS5 console. That's saying something.",
    "Our DualSense charging station restock tracker will look like:",
    "We've tweeted it out a few times in the month of April – and our followers have scooped it up in 3 minutes or less. You'll have to be fast to get it, or buy an alternative version of the DualSense charging station.",
    "We've seen the PS5 DualSense charging station restock at Walmart, Best Buy, Target and Amazon, and recently bought the controller accessory at Amazon. It doesn't ship until May or June 2021 in some cases, but at least we didn't overpay for this PlayStation 5 accessory.",
    "We've got some good news and bad news for you. The PS5 DualSense charging station is probably not in stock right now, but it does randomly come back in stock a few times a week, but usually not when our PS5 restock tracker says the console is back in stock – except Sony Direct appears to couple the two together. That's why we're providing links to retailers where we've found it before.",
    "Don't be fooled by resellers who are profiting by selling the PS5 DualSense charging station at a much higher price. You shouldn't pay more than $29.99 for it. We're constantly seeing it at $129.99, and that's highway robbery for a simple PS5 accessory.",
    "In fact, you don't need DualSense charging station. Your console comes with a USB-C cable that can charge the new controller just fine. It's just that we've found battery life of the DualSense wanting, and it's easier to pop the gamepad onto the charging dock without fishing for the USB-C cable. And you can charge two controllers at once, in case you got roped into a PS5 bundle that has an extra DualSense.",
    "The Sony-made DualSense charging station isn't the only accessory out there of its kind. If you don't mind a third-party accessory without the PlayStation brand name to it, you can get a similar easy-to-use charger – and sometimes the price is cheaper than Sony's $29.99 kit.",
    "In addition to offering PS5 restock help and advice, we're branching out to find you the best PS5 accessories. You'll notice that not all retailers in the US carry third-party DualSense chargers. GameStop and Best Buy are only going with the official Sony DualSense charging Station. However, you should get the same benefits from these cheaper models."
  ],
  "headers": {
    "3": "DualSense charging station price and how to get it normally",
    "8": "Where is DualSense charging station in stock sometimes?",
    "9": "PS5 DualSense charging station price",
    "11": "Where to buy a DualSense charging alternative"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock help and advice": "https://www.techradar.com/news/ps5-restock-help",
    "PS5 accessories": "https://www.techradar.com/best/ps5-accessories"
  }
}