{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-disney-plus-apple-tv-plus-and-more-this-weekend",
  "title": "7 new movies and TV shows on Netflix, Disney Plus, Apple TV Plus and more this weekend",
  "category": "entertainment",
  "updated": "2021-06-18T14:00:20Z",
  "author": "axel-metz",
  "summary": "What's worth watching this weekend on Netflix and other streamers?",
  "article": [
    "After what seems like an eternity, the sun has finally returned (for everyone except our Australian readers, that is). And along with some much-needed solar rays comes an equally-warm Pixar adventure to enjoy on Disney Plus this weekend.",
    "Luca, the story of two teenagers-cum-sea-monsters on the Italian Riviera, arrives as a welcome antidote to the superheroes, giant apes and raging murderers filling our screens of late. It also begs the question of whether Disney is going to continue the trend of four-letter titles beginning with L (yes, that is a Loki joke).",
    "Elsewhere, though, the next few days will see a refreshing variety of content dropping on the likes of Netflix, Apple TV Plus and Hulu. Below, we’ll walk you through seven of the biggest highlights – from all-new dramedies to returning foreign thrillers.",
    "After last year’s Soul took Pixar to new existential heights, Luca arrives to remind us that the studio can still tell charming, engaging stories without relying on adult themes to create emotional impact.",
    "The movie tells the tale of Luca Paguro (Jacob Tremblay), a lonely teenager who isn’t really a teenager at all, but a sea monster hunted by the human residents of Portorosso. Luca meets Alberto, another amphibian youngster, and the pair embark on an above-ground adventure after finding themselves enamored with a bright red Vespa.",
    "Expect gelato, pasta and scooter rides through Italian hills.",
    "Now available to stream on Disney Plus",
    "Rose Byrne stars as a frustrated San Diego housewife on a quest to launch a successful VHS aerobics-instruction business in Apple's latest original series, Physical. Billed as a dark satire, the 10-episode show follows Sheila Rubin as she navigates the home fitness craze of the ‘80s.",
    "Critics have been largely kind to the show so far, praising Byrne’s performance as Rubin, in particular. Don’t expect light-hearted nostalgia, though – Physical is a gritty and unflinching character study.",
    "The first three episodes are available to stream now, with the remaining seven arriving in weekly instalments.",
    "Now available to stream on Apple TV Plus",
    "Perhaps out-muscling even Luca for dopamine-inducing warmth, Penguin Town follows a colony of endangered African penguins as they wander the beaches and city streets of Cape Town, South Africa.",
    "Patton Oswalt narrates the eight-episode series, which has been praised for its use of humor to tell the stories of its black and white subjects. Like David Attenborough’s best nature docs before it, expect beach bust-ups, flamboyant displays of courtship and a lesson or two in Penguin behavior.",
    "It’s free of gore, easy on the mind and a hefty helping of virtual comfort food.",
    "Now available to stream on Netflix",
    "A little different to an endearing documentary about Penguins, Elite returns to Netflix for its fourth season this weekend, ready to re-ignite the romantic entanglements, intense rumors and murder mysteries of Spanish private school Las Encinas.",
    "The show is known for its twists and turns – as well as its inordinate number of sexual encounters – and don’t expect that to change in season 4. It’s a European mix of Riverdale and Gossip Girl, basically.",
    "Incidentally, season 5 is already in production – so this crop of episodes must be worth a try, at least.",
    "Now available to stream on Netflix",
    "About a Boy director Paul Weitz helms this Netflix adaptation of Matthew Logelin's memoir, which follows one father’s experience of raising his daughter after the death of his wife.",
    "Kevin Hart stars as Matthew, in a role that’s decidedly different to the wise-cracking characters the comedian is known for, and Fatherhood gives him a platform to flex his acting muscles as a devoted but desperate single dad.",
    "So far, critical reception has been pretty mixed. One outlet has called it “manipulative reputation rehab,” while another described the movie as “a touching portrait.” Our advice is to watch it and decide for yourself.",
    "Now available to stream on Netflix",
    "Unfortunately, Kevin Can F**k Himself isn’t about Kevin Hart. Instead, this new sitcom from AMC tells the story of an infuriated housewife (Schitt’s Creek’s Annie Murphy) who wants to kill her husband.",
    "Interestingly, the show blends single and multi-camera formats to highlight the difference between domestic life and the isolated experience of its protagonist, Allison, which keeps Kevin Can F**k Himself from being standard sitcom fare. Critics like this one, and it could be worth the watch for its unique camerawork alone.",
    "Now available to stream on AMC Plus in the US",
    "Dave, the show about a neurotic twenty-something convinced he's destined to be one of the best rappers of all time, is back for a second season. David Burd (aka Lil Dicky) reprises his titular role, with Dave now setting his sights on musical domination in Korea.",
    "Season 1 featured cameos from the likes of Justin Bieber, Benny Blanco, Macklemore and Trippie Redd, so expect plenty more appearances from internet culture’s biggest musical names – we’ve already spotted Kendall Jenner in the trailer.",
    "Episode 1 is now available to stream on Hulu"
  ],
  "headers": {
    "3": "Luca (Disney Plus)",
    "7": "Physical (Apple TV Plus)",
    "11": "Penguin Town (Netflix)",
    "15": "Elite season 4 (Netflix)",
    "19": "Fatherhood (Netflix)",
    "23": "Kevin Can F**k Himself (AMC Plus)",
    "26": "Dave season 2 (Hulu)"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Luca": "https://www.techradar.com/news/luca-on-disney-plus-is-the-nostalgic-pixar-fantasy-movie-to-get-you-ready-for-summer",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Soul": "https://www.techradar.com/news/how-to-watch-soul-online-stream-the-new-pixar-movie-on-disney-plus-today"
  }
}