{
  "source": "https://www.techradar.com/news/amd-denies-loving-crypto-miners-more-than-gamers",
  "title": "AMD denies loving crypto miners more than gamers",
  "category": "computing",
  "updated": "2021-09-13T11:29:29Z",
  "author": "matt-hanson",
  "summary": "AMD denies it, but gamers are feeling left out",
  "article": [
    "Some gamers are unhappy with AMD, feeling that they are being overlooked in favor of cryptocurrency miners - and while the company denies this, it’s clear that AMD’s struggles to meet demand has caused some ill feeling.",
    "First, let’s take a look at the background. For over a year now, GPU stock from both AMD and its rival Nvidia has been extremely limited, and it's lead to some gamers having to either pay considerably more than the recommended retail price for GPUs they actually find in stock, or put off their upgrade plans altogether.",
    "The difficulty in getting new graphics cards is due a number of reasons that have unfortunately combined to create a perfect storm. There’s the ongoing global pandemic which seriously affected production and distribution, as well as a chip shortage which saw some chip makers struggle to meet the demands of their customers.",
    "On top of that, there’s been a cryptocurrency boom, which has meant that miners have been snapping up any available stock. This has meant for many gamers, getting hold of a new GPU has been incredibly difficult – if not downright impossible.",
    "As Hot Hardware reports, at a recent Deutsche Bank of 2021 Technology Conference, AMD CFO Devinder Kumar, promised that supply of GPUs will be getting better, saying that “from a supply standpoint, it's become more fortified right now,\" and that “from our standpoint, as we get to 2022 and look at all partners across the board, the supply situation continues to get better.\"",
    "So, AMD appears to be hopeful that stock issues will sort themselves out, and as with other manufacturers, it seems AMD is betting on things returning to normal in 2022. Let’s hope they are correct.",
    "Kumar also addresses accusations that AMD is favoring cryptocurrency miners above PC gamers, saying that sales to those miners have been “negligible,” and that cryptocurrency is “not a priority for us. We do not prioritize our product or make them for the crypto folks, it is more for the gamers and that's a high priority from that standpoint.”",
    "That’s a pretty emphatic denial, then, but will it be enough to convince people who feel they are being overlooked by AMD?",
    "So, what has led to gamers feeling neglected by AMD in favor of cryptocurrency miners? As Hot Hardware explains, there’s a few things that people have felt are evidence of this.",
    "For a start, AMD’s biggest competitor, Nvidia, has also been struggling to meet demands. However, the company has been quite vocal about implementing artificial hash rate limiters in its recent GPUs. The aim of this is to cut the performance of the graphics cards when it comes to cryptocurrency mining, without impacting gaming performance. This, in theory, would make those GPUs less appealing to miners, and should make them more easily available to gamers.",
    "While it’s not quite clear how successful this move has been for Nvidia just yet, what is noticeable is that AMD has not tried anything similar. While it may not be fair, if your main rival is making a big deal of addressing an issue, while you are not, then some people are going to take that lack of action as implicit support.",
    "Why would AMD care? Well, that’s kind of the point, in a way. It doesn’t really matter who buys its products, as long as people are buying them, and as AMD’s recent financial results show, the company is doing very well. Some people may argue that AMD doesn’t want to rock the boat and do anything – such as limit the desirability of its products for a certain market – to risk its financial success.",
    "But who is buying AMD’s GPUs? This is another element that some people think shows that AMD is at the very least more popular with miners than gamers. A recent Steam Hardware survey, which asks people using Valve’s Steam store and game launcher, what hardware they are running, showed a rather astounding trend: Nvidia’s high-end and ultra-expensive RTX 3090 outsold all of AMD’s RX 6000 GPUs combined.",
    "This was remarkable because the RTX 3090 is a rather niche product due to its performance and price – not to mention the fact it’s hardly ever in stock. The fact more people in the Steam Hardware Survey were using this GPU compared to all of AMD’s new GPUs is quite shocking.",
    "But, this led people to wondering if AMD’s sales are doing so well, but it seems gamers aren’t buying the GPUs, then who is? For some people, that meant cryptocurrency miners.",
    "Finally, there have been leaks about an apparent RDNA 2-based graphics card in the works from AMD that is geared specifically for mining, with 10GB of GDDR6 memory and a 39MH/s hash rate. For people wanting to get hold of a GPU to game on, seeing AMD apparently working on a mining GPU probably would not go down well.",
    "So, what’s going on? While there’s some compelling reasons for believing that AMD may be favoring cryptcurrency miners over gamers, we’re not convinced that’s the case at all.",
    "Take the Steam Hardware Survey results, for instance. While those results won’t have been comfortable reading for AMD, suggesting that it means cryptocurrency miners are buying up all of AMD’s GPUs rather than gamers is still quite a stretch.",
    "It’s important to note that the Steam Hardware Survey only collects information from PC gamers with Steam installed, and only from people who have agreed to take part in the survey. This means that while Steam is incredibly popular, this isn’t a terribly accurate glimpse of the hardware market.",
    "Then there’s the rumored existence of a GPU aimed at crypto miners. Regardless of whether or not it exists, the fact is that both AMD and Nvidia have made GPUs dedicated to cryptocurrency mining in the past, and that doesn’t mean they're neglecting gamers – in fact, it’s the opposite.",
    "By creating a crypto currency GPU, the idea is that miners will buy that instead, leaving regular GPUs to gamers, which should make it easier for them to buy, as they are not competing with miners when stock does appear.",
    "Of all the accusations, it’s probably the fact that AMD hasn’t been seen to be doing as much as Nvidia to curtail crypto miners buying up its GPUs that has the most weight, and it’s something we’d like to see the company do more of.",
    "In the end, though, Kumar’s explanation of AMD’s position on crypto mining (that it’s not its priority) is pretty compelling. AMD is a huge company, and it’s been seeing success not just with PC gamers, but on the server and professional side of things as well. The amount of money it makes there would dwarf any revenue it makes from crypto currency sales which, after all, is still a relatively niche endeavour, so it wouldn’t make sense for AMD to prioritise it over customers that make it a lot more money – and which have been so instrumental in its success in the past.",
    "We contacted AMD for comment and were told that it had nothing more to add to Kumar’s statements, and that’s absolutely fair enough. It can sometimes be tempting to look for conspiracy theories, especially if you’re frustrated with a company, but more often than not, the most simple (or obvious) explanation is the right one."
  ],
  "headers": {
    "4": "AMD’s promises",
    "8": "The case against AMD",
    "16": "Does AMD love crypto miners more than gamers?"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "Hot Hardware reports": "https://hothardware.com/news/amd-denies-favoring-miners-gamers-supply-improve-soon",
    "artificial hash rate limiters in its recent GPUs": "https://www.techradar.com/news/the-light-hash-rate-nvidia-rtx-3080-is-real-heres-what-you-need-to-know",
    "RTX 3090 outsold all of AMD’s RX 6000 GPUs combined": "https://www.techradar.com/news/nvidia-geforce-rtx-3090-outsells-all-amd-rx-6000-gpus-is-amd-in-trouble",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}