{
  "source": "https://www.techradar.com/news/iphone-12-vs-samsung-galaxy-s20",
  "title": "iPhone 12 vs Samsung Galaxy S20: Apple's latest, or 2020's best phone?",
  "category": "phones",
  "updated": "2021-12-05T14:07:43Z",
  "author": "jon-mundy",
  "summary": "The latest iPhone versus Samsung's 2020 highlight",
  "article": [
    "Apple vs Samsung has been the biggest, longest-running rivalry in the smartphone industry. Ever since the launch of the first Samsung Galaxy S in March 2010, there’s been a constant back and forth between these massive manufacturers.",
    "That rivalry is perhaps best represented today by the iPhone 12 and the Samsung Galaxy S21, but here we're going to compare Apple's latest to the company's older S20 model.",
    "These two mainstream phones are packed full of high end components, svelte design flourishes, and advanced software without topping out in the price department. But they take very different routes to smartphone mastery.",
    "So which is the best phone for you - the iPhone 12 or the Samsung Galaxy S20? We’ve been using both for a number of months now, so an in depth breakdown is in order.",
    "These two phones landed at opposite ends of 2020, the Samsung Galaxy S20 in March and the iPhone 12 in October. That’s a gap of more than half a year, which is an age in smartphone terms.",
    "This makes the consideration of relative pricing rather complicated. The Galaxy S20 is frequently discounted this deep into its life, while the iPhone 12 is still going for the full RRP.",
    "The iPhone 12 starts from $799 / £799 / AU$1,349 for the 64GB model, moving up to $849 / £849 / AU$1,429 for 128GB and $949 / £949 / AU$1,599 for 256GB.",
    "If we’re comparing launch prices, the 5G-ready Galaxy S20 arrived with a tag for $999 / £899 / AU$1,499. Some territories, like the UK and Australia, also got a 4G-only version for £799/AU$1,349.",
    "At the time of writing, however, Amazon is selling the S20 5G for $800, which is a saving of $200. And in the UK, we've found the Galaxy S20 5G for £764, which represents a meaty £135 price cut.",
    "These chunky price cuts have been initiated for a clear reason, of course - there’s the new Galaxy S21 range, which includes the Galaxy S21 Ultra and Galaxy S21 Plus. You might want to factor that in to your purchase decision.",
    "Though they may be longstanding rivals, the pleasing thing about both the iPhone and Galaxy S ranges is that they’ve developed to look remarkably different over the years.",
    "The Samsung Galaxy S20 is the archetypal modern Android flagship - an all-screen device with glass to the front and back, a cool metal chassis, and curved edges to the front and back. It’s pleasing to see that the display plunges away far less dramatically than before, making the S20 much more practical to use than previous phones, though the display is still hardly flat.",
    "Conversely, the iPhone 12 marks a return to the sharp industrial design language of the iPhone 4 and iPhone 5. Its edges are dead flat and sit at a strict 90 degree angle to the equally flat front and rear surfaces.",
    "There’s a similar choice of glass and aluminum materials here, though the iPhone 12 has a much more muted range of finishes. Its simple shades of Black, White, Red, Green, and Blue all come with with corresponding matte rims.",
    "The Galaxy S20 measures 151.7 x 69.1 x 7.9mm versus the iPhone 12’s 146.7mm x 71.5mm x 7.4mm. Despite being taller and fatter than the iPhone 12, the Galaxy S20 actually feels a little thinner in the hand, thanks no doubt to those tapered edges.",
    "Despite their different approaches to design, there’s just a single gram in between these two phones - 163g for the Galaxy S20, 164g for the iPhone 12. In broader market terms, these are two fairly small phones that won’t fill or weigh down your pockets.",
    "If we’re talking toughness toughness, both phones are water resistant to the IP68 standard. The iPhone 12, however, gains a custom nano-crystalline Ceramic Shield screen, which apparently makes it four times stronger than usual.",
    "There are a couple of other design differences to note. Apple goes with its signature wide notch, which digs into the top of the screen and grants facial recognition for access and payment authentication.",
    "The Galaxy S20 goes with a much less intrusive central hole punch notch, which is less obstructive of video content. But it can’t scan your face, and it relies on a somewhat erratic in-display fingerprint sensor for its authentication.",
    "Considering the relative merits of these two displays is an interesting exercise, because Samsung supplies many of Apple’s iPhone 12 screens alongside those of its own handset.",
    "The fundamentals are quite similar. With the iPhone 12 you’re getting a 6.1-inch Super Retina XDR OLED screen. The Samsung Galaxy S20 gives you a 6.2-inch Dynamic AMOLED.",
    "They’re of comparable size, and both kick out bold and beautifully balanced colors thanks to top notch OLED panel technology. Both can hit the same theoretical peak brightness of up to 1200 nits, too, though in general conditions you’ll find the Galaxy S20 will get quite a bit brighter.",
    "The closer you look, the better the Galaxy S20 display seems. Samsung’s phone can get much sharper, with a peak 1440 x 3200 (QHD) resolution for 563 ppi. The iPhone 12’s screen only goes to 1170 x 2532 and 460 ppi.",
    "But arguably the biggest strength of the Samsung Galaxy S20 screen is the presence of a 120Hz refresh rate. The iPhone 12 can only hit half that at 60Hz. This is arguably the biggest omission from the entire iPhone 12 range, and a big win for Samsung. We should note that activating 120Hz lowers the resolution to 1080p on the Galaxy S20.",
    "Another point against the iPhone 12 is that huge notch, which interferes with video content more than the Galaxy S20’s hole punch equivalent.",
    "So does the iPhone 12 display do anything flat out better than the Samsung Galaxy S20 display? As noted, we prefer the dead-flat approach of Apple’s phone, as you don’t get any distracting reflections like you do with the Galaxy S20. The iPhone 12 also seems to render colors a little more naturally.",
    "All in all, we have to give the win to Samsung’s altogether more impressive OLED display, though the difference isn’t night and day in the hands. These are two excellent screens.",
    "The Samsung Galaxy S20 has three cameras next to the iPhone 12’s dual-camera setup, but there are some similarities here.",
    "Both phones are led by 12-megapixel wide sensors. The iPhone 12 allies this with an f/1.6 aperture, which is wider than the Galaxy S20’s f/1.8. However, the Galaxy S20 sensor captures 1.8 micron pixels, which are much larger than the 1.4 micron pixels of the iPhone 12. Larger pixels mean more light captured.",
    "The similarities continue with a pair of 12-megapixel ultrawides, which in both cases capture fine 120 degree landscape shots. Samsung goes one step further, however, with the addition of a 64-megapixel telephoto camera. Using a combination of optical and digital techniques, it’s able to capture up to 30x zoomed shots - although you’ll clearly get much better quality at lower zoom levels.",
    "Both phones feature advanced Night modes for low light photography, but the iPhone 12 can use its Night Mode across all of its cameras, including the 12MP selfie camera. It’s a fine low light shooter.",
    "Regardless of the hardware differences, the key separating factor to the average users is between Apple’s and Samsung’s color science. Samsung typically goes with a more exaggerated, punchy tone, while Apple’s shots tend to look a little more natural and pull out more nuance from a scene.",
    "The iPhone 12 takes excellent 4K video, as has become customary with Apple’s phones. Samsung also has something to boast about on this front with the ability to capture 8K footage. However, you don’t get Samsung’s advanced stabilization tech beyond 1080p, and who even has an 8K display to show such footage off on?",
    "When it comes down to it, the Galaxy S20 pack the more flexible and feature-packed camera setup of the two, but the iPhone 12 takes the more pleasing and accurate shots in most conditions.",
    "So far you could argue that it’s been nip and tuck when comparing these two brilliant phones. But there’s really no comparison when it comes to raw performance.",
    "The iPhone 12’s A14 Bionic processor handily thrashes its Samsung Galaxy S20 counterpart. And that’s true regardless of the model you’re talking about. You may want to opt for the Galaxy S21 series if you want more power in your Samsung handset.",
    "Samsung has a habit of packing its flagship phones with completely different processors depending on the region. In the US, that means the same Snapdragon 865 that powered much of its Android rivals throughout 2020. In the global model that means Samsung’s own Exynos 990 equivalent, which is significantly less capable. We were getting around a 15% difference in Geekbench 5 multicore benchmark scores.",
    "That in itself is a bit of a weakness compared to the iPhone 12’s consistent one-chip approach. And like we said, the A14 Bionic trounces both chips anyway, with a Geekbench multicore score that’s around 25% higher than the global Galaxy S20 model.",
    "Not that this has a material impact on day to day usage. In our review of the global Galaxy S20 we noted that “it’s powerful enough to do everything we need it to, whether that’s playing games or loading apps quickly”. Together with Apple’s unparalleled legacy software support, however, we pretty much guarantee that the iPhone 12 will feel faster for much longer.",
    "One thing you get a lot more of in the Galaxy S20 is RAM. There’s 12GB in the 5G model, which is three times the amount found in the iPhone 12. The differences between the way iOS and Android operate make this point a bit of a non-issue, however. All that matters is that both phones have sufficient memory to run everything at full pelt.",
    "Storage capacity most certainly does matter, however, and on that front there are mixed results. The Galaxy S20 gets kudos for defaulting to 128GB, which is double that of the iPhone 12. But the iPhone also comes in 128GB and 256GB guises, whereas the Galaxy S20 doesn’t give you any additional options.",
    "Swinging back in the Galaxy S20’s favor is the potential for up to 1TB of microSDXC expansion.",
    "Both phones feature 5G support out of the box, but we’ll reiterate that some markets offer a 4G option of the Galaxy S20. Whether that’s a strength or a weakness rather depends on your view of 5G’s relevance. Our view is that right now 5G isn’t a particularly worthwhile feature, but that in a year or two that will almost certainly change.",
    "The Samsung Galaxy S20 has a much larger battery than the iPhone 12. We’re talking 4000 mAh as opposed to 2815 mAh.",
    "Again, this is a figure that loses a little meaning when you factor in the markedly different ways that iOS and Android handle their hardware resources. There are also a lot of variables that will affect how both phones perform under load.",
    "With the Galaxy S20, much depends on how you have the display set up. Set to 120Hz or 4K resolution, the battery will drain much quicker than at 60Hz and 1080p. We should also note that in our experience, the Exynos 990 is rather more power hungry than the Snapdragon 865, so those unwelcome regional variances come into play again.",
    "On the other hand, the iPhone 12’s smaller battery will arguably take a bigger hit from extended 5G connectivity. Indeed, we found that wandering around using the phone exclusively on mobile networks drained around 10–15% of the iPhone’s battery per hour.",
    "In terms of recharging, both phones support 15W wireless Qi charging, though only the Galaxy S20 officially supports reversible charging. One standard the iPhone 12 does support that the Galaxy S20 doesn’t is Apple’s MagSafe, which provides a more secure magnetised spin on wireless charging.",
    "When it comes to good old fashioned wired charging, the Galaxy S20 supports fast 25W out of the box. You’ll need to buy such a rapid charger (or any charger for that matter) for your iPhone 12 separately, and even then it only goes as far as 20W.",
    "Comparing the iPhone 12 with the Samsung Galaxy S20 is a tricky task. It’s not quite Apples and oranges, but there’s certainly a touch of that.",
    "Despite both phones being released in the same calendar year, they effectively sit a generation apart. This is most apparent when it comes to performance, where the iPhone 12 hands out an absolute pasting. Uniform 5G support across the range is another sign that Apple’s phone is the newer and more up to date of the two.",
    "This is perhaps a slightly unfair comparison as the Samsung Galaxy S21 series is now an option, but the Galaxy S20 is still a readily available smartphone in 2021.",
    "You might also consider Apple’s break from the curvy design norm to be fresher. The Galaxy S20 looks and feels great, but it’s a largely iterative update next to the bold angles of the iPhone 12.",
    "In other ways, however, the Galaxy S20 feels like the more forward-thinking phone of the two. Its 120Hz display feels like table stakes for a 2020 flagship, or it did right up until Apple omitted the spec from its iPhone 12 family.",
    "You’ll also miss out on proper zoomed in photos by going with the iPhone 12. The Galaxy S20’s triple camera system is the more flexible of the two, though we’d argue that the iPhone 12 takes better shots in most non-zoomed conditions.",
    "Going back to that age difference, you’ll be able to pick the Galaxy S20 up much cheaper than the iPhone 12 right now. Conversely, Samsung’s flagship is soon to be replaced by a new model, so it won’t be top of the manufacturer’s list of update priorities for much longer.",
    "Differences aside, we can apply the same general summary to both. These are brilliant all-rounders that look and feel great, take great pictures, and sport vibrant OLED displays whilst still sitting lightly in your pocket. They’re also significantly cheaper than their respective range-toppers, making both seem like great value picks."
  ],
  "headers": {
    "4": "iPhone 12 vs Samsung Galaxy S20 price and availability",
    "10": "Design",
    "19": "Display",
    "27": "Camera",
    "34": "Specs and performance",
    "43": "Battery life",
    "49": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s-689293/review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Apple’s MagSafe": "https://www.techradar.com/best/best-magsafe-accessories"
  }
}