{
  "source": "https://www.techradar.com/news/these-are-the-features-microsoft-just-killed-off-with-windows-10-may-2021-update",
  "title": "These are the features Microsoft just killed off with Windows 10 May 2021 Update",
  "category": "computing",
  "updated": "2021-05-20T09:25:34Z",
  "author": "darren-allan",
  "summary": "Several Windows 10 features have been ditched or shelved from development",
  "article": [
    "Windows 10 May 2021 Update has just been unleashed, and as ever when a new upgrade emerges, adding features – although not many in this case – Microsoft also takes with the other hand and removes some functionality from the OS.",
    "To be specific, Microsoft actually lists the features which are being deprecated – in other words, those being shelved and no longer actively developed – and also those which are being completely ditched from Windows 10.",
    "In the latter category, one of the features getting the boot is the legacy version of Microsoft Edge, which has of course been replaced by Chromium-powered Edge (although as you may recall, support for legacy Edge was actually withdrawn a couple of months ago in March).",
    "The only other thing canned is support for Windows 2000 XDDM-based remote display drivers, but that won’t affect many folks.",
    "On the deprecation front, Microsoft has halted development on roaming Personalization settings, which allows your lock screen images, wallpaper and other customization elements to be synced across devices. So this feature will remain in stasis going forward, and Microsoft further observes that it “might be removed in a future release”.",
    "In this case, that’s something some folks might miss (although again, presumably not that many, as we can guess it wasn’t hugely popular – unless there’s another reason for abandoning development, like maybe shifting the functionality elsewhere).",
    "The Windows Management Instrumentation Command line (WMIC) tool is also now shelved, with Microsoft noting: “This tool is superseded by Windows PowerShell for WMI. Note: This deprecation only applies to the command-line management tool. WMI itself is not affected.”",
    "The software giant also reminds us that as we reported earlier, Internet Explorer 11 is being retired and support will cease on June 15, 2022, at least for versions of Windows 10 without any long-term servicing contract (in other words, for all but enterprise users).",
    "Via Thurrott.com"
  ],
  "headers": {
    "4": "Syncing sunk"
  },
  "links": {
    "Windows 10 May 2021 Update has just been unleashed": "https://www.techradar.com/news/windows-10-may-2021-update-is-finally-done-and-should-be-rolling-out-soon",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "category": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-7927185765792508000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fwindows%2Fdeployment%2Fplanning%2Fwindows-10-removed-features",
    "actually withdrawn a couple of months ago in March": "https://www.techradar.com/news/microsoft-edge-legacy-is-dead-but-the-chromium-version-is-fast-gaining-traction",
    "deprecation front": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4212972900245985300&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fwindows%2Fdeployment%2Fplanning%2Fwindows-10-deprecated-features",
    "as we reported earlier": "https://www.techradar.com/news/microsoft-officially-retiring-internet-explorer-next-year-moving-on-to-edge",
    "Thurrott.com": "https://www.thurrott.com/windows/windows-10/250262/microsoft-details-deprecated-and-removed-features-in-windows-10-version-21h1"
  }
}