{
  "source": "https://www.techradar.com/news/why-you-may-not-be-able-to-buy-dying-light-on-switch-digitally",
  "title": "Why you may not be able to buy Dying Light on Switch digitally",
  "category": "gaming",
  "updated": "2021-10-19T15:22:02Z",
  "author": "vic-hood",
  "summary": "Thanks to a German ban",
  "article": [
    "Dying Light Platinum Edition was officially released for Nintendo Switch on October 19 but, thanks to the knock-on-effect of a German ban, you'll only be able to buy a digital version of the survival horror game if you're in the US or Australia.",
    "Dying Light on Switch is unavailable to buy digitally in Europe, Australia and New Zealand, meaning players in these regions can only purchase the game physically if they want to play. That's because Dying Light is banned in Germany, where the Nintendo eShop for Europe, Australia and New Zealand is registered, meaning that the eShop can't sell the digital version.",
    "Techland addressed the issue in response to a Redditor who asked why they couldn't access the game in their region, saying:",
    "\"If you're talking about the digital version, then due to nature of content the digital version of the game is currently banned in Germany where European e-Shop is officially registered. This is making it impossible to officially distribute the game in European countries and also in Australia and New Zealand. We are currently working with our partner and local authorities to remove the ban as soon as we can.",
    "\"The game is available digitally in the US and Asia, and the retail version is available worldwide (except Germany)\", they added.",
    "Dying Light was banned in Germany when it was first released in 2015. Due to the game's high-impact gory violence, the USK (responsible for video game ratings in Germany) didn't approve the game. Following an examination by the BPjM, the Federal Review Board for Media Harmful to Minors in Germany, the game was found to be harmful to young people and was later banned from circulation in the country.",
    "Germany is known for its strict censorship rules around video games, often banning games that include gory or realistic violence and Nazi symbolism. The list of banned games in Germany is a lengthy one, including offenders such as Wolfenstein, Call of Duty, Sleeping Dogs and Left 4 Dead.",
    "Many of these games have had censored versions released in Germany, so it's possible that we could see Dying Light censored in some way to meet German rating standards – perhaps removing the blood or cutscenes of extreme violence. Bethesda notoriously removed all of Wolfenstein's Nazi symbolism for release in the country, but we imagine that might be slightly easier than removing violence from a game like Dying Light, which sees you slashing up zombies with machetes.",
    "But the main issue here isn't that the game is banned in Germany, it's that the ban affects the digital sale of Dying Light on Switch in many other key regions that didn't ban the game. And, unfortunately, the German regulators have the final say.",
    "It seems Techland is trying to find some sort of workaround. But it's unclear if this means the developer censoring the game for release in Europe, New Zealand and Australia, or whether it will come to an agreement with the German regulatory board to allow it to sell the game to others countries in Europe (not Germany), despite the Nintendo eShop being registered in Germany.",
    "It's an issue Techland will need to iron out before the release of Dying Light 2 in February 2022. After all, the sequel is set to release on Switch too and – from what we've seen so far – looks to be even more violent than its predecessor. It's almost a certainty that the German regulators will ban Dying Light 2, so Techland will need to come to some sort of arrangement that will cover both its games without impacting digital sales in key regions.",
    "However, there's a possibility that a workaround can't be found and those who want to buy Dying Light 2 on Switch in Australia, Europe and New Zealand will only be able to purchase a physical edition.",
    "TechRadar has contacted both Techland and Nintendo and will update this story when we know more."
  ],
  "headers": {
    "5": "Analysis: But will Dying Light 2 suffer the same issue?"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "response": "https://www.reddit.com/r/dyinglight/comments/qaldxb/the_switch_port_doesnt_seem_to_be_out_yet_in_alot/hh3myjj/",
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors"
  }
}