{
  "source": "https://www.techradar.com/news/this-new-teenage-mutant-ninja-turtles-game-looks-totally-radical-dude",
  "title": "This new Teenage Mutant Ninja Turtles game looks totally radical, dude",
  "category": "gaming",
  "updated": "2021-03-10T15:03:16Z",
  "author": "adam-vjestica",
  "summary": "Heroes in a half shell",
  "article": [
    "A new Teenage Mutant Ninja Turtles game is on the way – and by the looks of it, it’s bound to please fans of 1991’s classic side-scrolling beat ‘em up, Turtles in Time.",
    "Teenage Mutant Ninja Turtles: Shredder’s Revenge will be published by Dotemu, the team behind the excellent recent release of Streets of Rage 4, and is being developed by Tribute Games, who house key talent that worked on the acclaimed Scott Pilgrim vs The World: The Game.",
    "You can check out the trailer below, which is sure to tug on the heart strings of older games and those who grew up watching the animated series. The signature Turtle's anthem is also sung by Faith No More's Mike Patton, which again, probably won't mean much to anyone under the age of thirty.",
    "Teenage Mutant Ninja Turtles: Shredder’s Revenge reunites Leonardo, Raphael, Michelangelo and Donatello as they tour iconic TMNT locations, thumping the Foot-Clan along the way. You’ll need to use the pizza-loving turtles shell-shocking abilities and brawling prowess to thwart familiar nemeses like Bebop and Rocksteady from executing their dastardly plans.",
    "The game features a pixel art world and is directly inspired by Teenage Mutant Ninja Turtles: Turtles In Time. That means you can expect plenty of satisfying side-scrolling action, some couch co-op and a cowabunga or two from the turtles themselves.",
    "Teenage Mutant Ninja Turtles: Shredder’s Revenge is coming to consoles and PC, so we’d expect it to see it arrive on PS5, Xbox Series X, Xbox Series S and Nintendo Switch, as well as last-gen systems.",
    "It's comforting to know that such a classic franchise is in good hands, with Dotemu known for their excellent handling of beloved retro games like Wonder Boy: The Dragon's Trap and Streets of Rage 4. It's unlikely this new TMNT game will Splinter the series' loyal audience, then. (Sorry.)"
  ],
  "headers": {
    "4": "Cowabunga, dudes!"
  },
  "links": {
    "Streets of Rage 4": "https://www.techradar.com/news/streets-of-rage-4-gets-a-release-date-and-theres-a-retro-surprise-for-older-fans",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}