{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-may-finally-reach-120hz-at-its-highest-wqhd-resolution",
  "title": "Samsung Galaxy S21 Ultra may finally reach 120Hz at its highest resolution",
  "category": "phones",
  "updated": "2021-01-08T10:30:13Z",
  "author": "david-lumb",
  "summary": "120Hz refresh rate at max resolution? The Samsung S21 Ultra could achieve it",
  "article": [
    "A new leak suggests the Samsung Galaxy S21 Ultra could achieve what its predecessors could not: reach 120Hz refresh rate at the phone’s maximum WQHD+ resolution.",
    "The proof is in the screenshot: noted leaker @UniverseIce tweeted a capture of the settings page, allegedly taken on a Samsung S21 Ultra, which shows display options looking a lot like those on the Samsung S20 series of phones – except the ‘Screen resolution’ option is set to the phone’s maximum (WQHD+, 3200 x 1440) while the ‘Motion smoothness’ is set to ‘Adaptive.’",
    "Last year’s S20 phones only allowed the former if the latter was explicitly set to 60Hz; conversely, the screen refresh rate could be set to 120Hz if the resolution was dialed down to Full HD (2400 x 1080).",
    "Admittedly, that’s not the most persuasive of screenshots – it would be nice to see whether the ‘Adaptive’ mode is the only option for maximum refresh rate – so we’re relying on @UniverseIce’s tweeted comments that the phone is capable of both 120Hz and WQHD+ at the same time. Given they had previously leaked in mid-2020 that the Note 20 Ultra would not be able to do both, it's possible @UniverseIce has more info than just the screenshot.",
    "What does that mean? S21 Ultra users will be able to have the sharpest screen resolution available in today’s smartphones, and it’ll have nearly the fastest refresh rate (the Asus ROG Phone 3 caps out at 144Hz) for silky-smooth browsing and gaming. It’s unclear why last year’s S20 line couldn’t do both at once, but we expect that maxing out both features may drain the battery at a faster pace than if either was dialed back.",
    "And of course, the big question: will the Samsung Galaxy S21 and S21 Plus have this capability, too?",
    "Thus far, we can only speculate as to what exclusive features the S21 Ultra will sport to justify its expected premium pricetag.",
    "If it follows the Samsung S20 Ultra and Note 20 Ultra, the S21 Ultra will have slightly better specs and a bigger display. Rumors point to a 6.8-inch WQHD+ OLED display, a 5,000mAh battery, and if renders are to be believed, five rear cameras, including a 108MP main shooter and two telephoto cameras: one 3x optical and one 10x optical.",
    "Several rumors have suggested it will support an S Pen stylus, but a recent leak showed how: by clipping it into a folio case. In other words, the premium phone is nabbing the best feature of the Note 20 Ultra, meaning the S21 Ultra could truly be the most advanced traditional smartphone yet – though we’ll know the truth when the phone launched on January 14.",
    "Via XDA Developers"
  ],
  "headers": {
    "6": "What the S21 Ultra will have over its less premium siblings"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1346342403792273413",
    "Samsung S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "leaked": "https://www.techradar.com/news/samsung-galaxy-note-20-probably-wont-solve-one-of-the-galaxy-s20s-biggest-issues",
    "Asus ROG Phone 3": "https://www.techradar.com/reviews/asus-rog-3",
    "Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "renders": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-image-leak-shows-a-monstrous-camera",
    "leak": "https://www.techradar.com/news/new-leak-hints-s21-ultra-could-pack-an-s-pen-in-an-unusual-spot",
    "XDA Developers": "https://www.xda-developers.com/samsung-galaxy-s21-ultra-120hz-qhd-resolution/"
  }
}