{
  "source": "https://www.techradar.com/news/psa-amazons-amazing-black-friday-deals-on-the-galaxy-z-fold-3-and-flip-are-still-here",
  "title": "PSA: Amazon's amazing Black Friday deals on the Galaxy Z Fold 3 and Flip are still here",
  "category": "phones",
  "updated": "2021-12-09T14:49:51Z",
  "author": "alex-whitelock",
  "summary": "But not for long, we think",
  "article": [
    "Amazon's Black Friday deals on the Samsung Galaxy Z Fold 3 and Flip 3 are still available this week - a nice little surprise if you didn't catch yourself a cheap foldable in November's big sales event.",
    "The Galaxy Z Fold 3 in particular is just $1,499 (was $1,799) right now, its cheapest price ever, and also comes with a free pair of Galaxy Buds 2. These wireless earbuds aren't super high-end, but they're worth anywhere between $80 to $100 by themselves so it's not a small freebie by any stretch of the imagination. A $300 price cut, of course, doesn't exactly make this premium device cheap, but it really helps soften the normally prohibitive blow to your wallet.",
    "And, for those looking to jump on the foldable bandwagon, it'll be worth every penny. The Samsung Galaxy Z Fold 3 is the company's most refined, well thought out, and powerful foldable yet. A few UI bugs aside, it's definitely the best foldable device on the market right now and a great buy if you're going to make the most of that extra screen real estate.",
    "For something cheaper, you'll also find the Galaxy Z Flip 3 on sale for $924.99 at Amazon today with the same free Buds 2 promotion. Today's price is actually $75 more expensive than the cheapest ever (over Black Friday), but we don't believe we've seen these free buds offered at this retailer before. It's not quite as good of a deal as that on the Fold 3, but it's still a fine option if you're looking for a cheaper (and smaller foldable).",
    "Outside the US? See today's best Samsung Galaxy Z Fold 3 and Flip 3 deals in your region just below.",
    "Looking for carrier options? We've got the latest from Verizon, AT&T, and others over on our main Galaxy Z Fold 3 deals and Galaxy Z Flip 3 deals pages. Also recommended is our cell phone deals page - where you'll find this week's best options on other devices."
  ],
  "headers": {
    "5": "Samsung Galaxy Z Fold 3 and Flip 3 deals at Amazon"
  },
  "links": {
    "is just $1,499 (was $1,799)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSamsung-Electronics-Unlocked-Smartphone-Foldable%2Fdp%2FB097CNBDX2%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1324041514016468200-20",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "best foldable device": "https://www.techradar.com/best/best-foldable-phones",
    "for $924.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FUnlocked-Smartphone-Intuitive-Warranty-Lavender%2Fdp%2FB097CMXJ4F%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7542440985928232000-20",
    "Galaxy Z Fold 3 deals": "https://www.techradar.com/deals/samsung-galaxy-z-fold-3-deals",
    "Galaxy Z Flip 3 deals": "https://www.techradar.com/deals/samsung-galaxy-z-flip-3-deals",
    "cell phone deals": "https://www.techradar.com/deals/mobile-phone-deals"
  }
}