{
  "source": "https://www.techradar.com/news/amazfit-challenges-apple-with-potentially-life-saving-smartwatch-tech",
  "title": "Amazfit challenges Apple with potentially life-saving smartwatch tech",
  "category": "fitness",
  "updated": "2021-03-19T17:23:52Z",
  "author": "cat-ellis",
  "summary": "Affordable blood pressure monitoring could arrive soon",
  "article": [
    "Amazfit is working on a new generation of smartwatches with more advanced health tracking sensors, according to a new interview with Wareable, and might even steal a lead on Apple when it comes to blood pressure monitoring.",
    "Amazfit (owned by Zepp Health) has made its name with cheap fitness trackers that deliver impressive features for relatively little cash. These include the GTS and GTR series, plus the tough T-Rex line, which is soon to be expanded with the new T-Rex Pro.",
    "Now, however, it looks like the company has higher-end rivals in its sights, and may be developing a premium watch that can track much more than steps, sleep, heart rate and workouts.",
    "“We are currently engaging with the US FDA and on areas such as ECG and blood pressure monitoring. Those things are ongoing right now,” Mike Yeung, COO of Zepp Health, told Wareable.",
    "“While we are getting our own algorithm to be FDA certified, we are already in partnership with AliveCor here in the States.”",
    "The fact that Amazfit is working with companies like AliveCor (which specializes in mobile ECG technology) is a positive sign, and suggests that we might see a smarter Amazfit watch sooner rather than later.",
    "Companies often release devices with some sensors deactivated while they seek approval from health administrations in various countries. For example, the Samsung Galaxy Watch 3 and Galaxy Watch Active 2 both launched with blood pressure and ECG sensors, but these were only unlocked in countries outside South Korea and the US in January this year.",
    "By contrast, Amazfit is working to get its tech approved ahead of any product releases, which should mean they're available to users worldwide straight away.",
    "It may beat Apple to the punch as well, introducing blood pressure monitoring first, and at a much lower price.",
    "Apple appears to be developing its own blood pressure sensor, but it's been a work in progress for several years now and there's so far been no sign of it being implemented. The tech might feature in the Apple Watch 7, which we're expecting to debut in September, but Amazfit keeps a much more rapid release schedule, so we may well see a super affordable blood pressure monitoring Amazfit watch first. We'll keep you updated as soon as we know more."
  ],
  "headers": {
    "5": "Time pressure"
  },
  "links": {
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Wareable": "https://www.wareable.com/smartwatches/amazfit-to-launch-ecg-and-blood-pressure-as-zepp-health-gets-serious-8345",
    "cheap fitness trackers": "https://www.techradar.com/best/best-cheap-fitness-trackers",
    "GTS": "https://www.techradar.com/reviews/amazfit-gts-2",
    "GTR": "https://www.techradar.com/reviews/amazfit-gtr-2",
    "T-Rex": "https://www.techradar.com/reviews/amazfit-t-rex-review",
    "T-Rex Pro": "https://www.techradar.com/news/amazfit-t-rex-pro-leaks-show-a-tough-powerful-smartwatch-coming-soon",
    "AliveCor": "https://www.alivecor.co.uk/",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "these were only unlocked": "https://www.techradar.com/news/samsung-brings-ecg-and-blood-pressure-checks-to-thousands-of-galaxy-watch-users",
    "its own blood pressure sensor": "https://www.techradar.com/news/apple-watch-6-may-track-blood-pressure-without-a-clumsy-cuff"
  }
}