{
  "source": "https://www.techradar.com/news/the-best-techradar-reads-you-may-have-missed-apr-12-2021",
  "title": "The best TechRadar reads you may have missed",
  "category": "appliances",
  "updated": "2021-04-12T10:04:50Z",
  "author": "axel-metz",
  "summary": "The very best of TechRadar from the week that was",
  "article": [
    "As weeks go in the tech world, the last one was decidedly rumor-packed. We saw major leaks surrounding iOS 15, the iPhone 13 and some potentially game-changing VR mechanics – not to mention the new Google earbuds which were accidentally revealed by… Google.",
    "It’s no surprise, then, that the TechRadar site has been a lively place. Below, you’ll find the best of our content from the past week, from a detailed rundown of your Fitbit’s potentially life-saving update to our look inside Amazon Prime’s newest TV show, Them. We’ve even gone ahead and published a guide to the best film cameras – because who doesn’t want to rediscover the joys of analogue photography?",
    "There’s also a host of review and opinion content for you to sink your teeth into, but if you’re after something a little easier on the eyes (but maybe not the ears), we’ve parked the latest episode of the TechRadar Noise Cancelling Podcast at the end of this article for your listening pleasure.",
    "Now there’s a question. Granted, it’s probably not one that keeps you up at night, but the perfect TV viewing distance does exist – it just depends on the size of your screen.",
    "Luckily for you, we’ve put together a handy guide to just how far away from your TV you should sit, for every possible size. So, sit back (a little further?) and enjoy the read.",
    "Read more…",
    "At times, Amazon Prime Video’s latest big drama series, Them, is unwatchable. That’s not because it’s poorly acted or badly written, but because of its distressing content, inspired by the injustice and terror that Black Americans have historically faced, and which many still encounter today.",
    "TechRadar spoke to creator Little Marvin and three of the series’ lead actors to learn more.",
    "Read more…",
    "TechRadar writers are known for their frequently-excellent ideas – and none were better than our Computing Editor’s decision to leave the PS5 queue behind and build his own console.",
    "So, how did it go? “Along the way I had a lot of fun [...] I also almost lost my mind several times,” seems to be the general gist.",
    "Read more…",
    "Fitbit is investigating whether some of its existing fitness trackers can be used to measure blood pressure, and is asking its users to help out.",
    "The feature could be implemented in both current and future models, and so the company is looking for US residents aged 20 or above to take part in its potentially life-saving research.",
    "Read more…",
    "Looking for the best film camera to help you rediscover the joys of analogue photography?",
    "Whether you're searching for a vintage SLR, a classic instant camera or a new, affordable film-hungry sidekick, we've drawn on our decades of experience with film cameras to bring you this round-up of the best choices around – whether you're buying second-hand or new.",
    "Read more…",
    "LG has been a major player in the mobile game for a long old while, but the company has finally decided to hang up its smartphone-shaped boots.",
    "So, what better way to reminisce about LG's mobile legacy than to, well, reminisce about LG's mobile legacy? We pick out the best of the company’s flagship phones in years gone by.",
    "Read more…",
    "In the relatively niche world of video doorbells, Ring is the go-to name. So how does the company’s latest offering, the Ring Video Doorbell 4, improve on the current Ring Video Doorbell 3?",
    "We’ve put together a helpful guide to find out, covering its price, release date and everything else you should know.",
    "Read more…",
    "CD Projekt Red finally released the gargantuan 1.2 patch for Cyberpunk 2077, and while it probably has things like \"bug fixes\" and \"content,\" it also enables ray tracing on supported AMD graphics cards.",
    "We weren't exactly expecting AMD to come out of nowhere and topple Nvidia's lead in the realm of graphics cards – we also weren't prepared, however, for just how far it has to catch up.",
    "Read more…",
    "The week's biggest tech news, in podcast form! We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's show is presented by Gareth Beavis, Global Editor-in-Chief of TechRadar, and Sherri L. Smith, Editor-in-Chief of Laptop Mag, with guests Gerald Lynch, Executive Editor at TechRadar, and James Peckham, Phones Editor at TechRadar, who join in (remotely, of course) to talk about the last seven days in tech.",
    "Catch up on all the latest tech gossip, from our thoughts on the latest movie delays, LG no longer making smartphones, and how we miss Casio Watch calculators.",
    "Read more…",
    "You can find every episode of Noise Cancelling here too"
  ],
  "headers": {
    "3": "How far away should you sit from your TV?",
    "6": "Inside Them, Amazon’s new horror series",
    "9": "I couldn’t buy a PS5, so I built my own console",
    "12": "Fitbit needs your help",
    "15": "The best film cameras of 2021",
    "18": "A complete history of LG phones",
    "21": "Everything we know about the Ring Video Doorbell 4",
    "24": "Cyberpunk 2077 ray tracing is pretty...rough",
    "27": "Movie delays and AI-generated chat up lines: Noise Cancelling podcast episode 59"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "game-changing VR mechanics": "https://www.techradar.com/news/this-futuristic-vr-tech-could-be-a-game-changer-for-virtual-reality-headsets",
    "accidentally revealed": "https://www.techradar.com/news/new-google-pixel-buds-leaked-by-google",
    "Noise Cancelling Podcast": "https://www.techradar.com/news/movie-delays-and-ai-generated-chat-up-lines-noise-cancelling-podcast-episode-59",
    "Read more…": "https://www.techradar.com/news/movie-delays-and-ai-generated-chat-up-lines-noise-cancelling-podcast-episode-59",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "AMD graphics cards": "https://www.techradar.com/news/amd-graphics-cards",
    "movie delays": "https://www.techradar.com/news/new-james-bond-movie-no-time-to-die-has-been-delayed-yet-again",
    "LG no longer making smartphones": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next",
    "You can find every episode of Noise Cancelling here too": "https://audioboom.com/channels/5019679"
  }
}