{
  "source": "https://www.techradar.com/news/the-weirdest-headphones-weve-ever-tested-have-a-huge-black-friday-discount",
  "title": "Black Friday headphones deal: huge savings on the weirdest cans we've ever tested",
  "category": "audio-visual",
  "updated": "2021-11-26T23:06:26Z",
  "author": "olivia-tambini",
  "summary": "A Black Friday headphones deal for adventurous audiophiles",
  "article": [
    "The strangest headphones we've ever tested here at TechRadar have been given a brilliant Black Friday discount, with Amazon slashing the price of the Nuraphone headphones from $399 to $279.",
    "That's a saving of $120, and close to the lowest price we've seen for these odd headphones.",
    "You can also save on the Nuraphone headphones if you're in the UK, as they've been reduced from £349 to £244 - a saving of £105. (Not in the US or UK? Scroll down for the best deals in your region.)",
    "So, why are the Nuraphone so unusual? Well, they have a unique in-ear/over-ear hybrid design, and the accompanying app lets you measure the sensitivity of your ears and adjust the sound of the headphones so that you hear the maximum amount of detail in your music.",
    "The risks taken by Nura, the brand behind these headphones, ultimately paid off. The form-factor works much better than you might expect, the sound personalization adds an interesting element to the listening experience, and overall the headphones offer a great level of sound quality.",
    "If you want to try something a little different, the Nuraphone wireless headphones are worth considering.",
    "The unusual form factor means you don't have to choose between in-ear and over-ear headphones, while conveniences like active noise cancellation and wireless connectivity mean you aren't sacrificing desirable specs for the strange design.",
    "The audio quality is very good, and the ability to personalize the sound based on your ears means you're getting a listening experience unique to your tastes. A 20-hour battery life, while not class-leading, should also be more than enough to get you through a week's worth of commuting.",
    "No matter where you live, you'll find all the lowest prices for the Nuraphone wireless headphones from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best Black Friday headphones deal",
    "8": "More Nuraphone deals",
    "9": "More Black Friday deals in the UK"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Nuraphone headphones from $399 to $279": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNuraphone-Wireless-Bluetooth-Headphones-Earbuds%2Fdp%2FB0833GMD7K%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1258318590859726000-20",
    "reduced from £349 to £244": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB0833GMD7K%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2140669720733107000-21",
    "Nuraphone wireless headphones": "https://www.techradar.com/reviews/nuraphone-headphones"
  }
}