{
  "source": "https://www.techradar.com/news/huawei-phones-could-be-making-a-surprise-return-soon",
  "title": "Huawei phones could be making a surprise return soon",
  "category": "pro",
  "updated": "2021-11-15T16:20:51Z",
  "author": "sead-fadilpasic",
  "summary": "Chinese giant may license out phone design to third parties in order to get component access",
  "article": [
    "Huawei is reportedly considering outsourcing smartphone design to a third party in order to circumvent US sanctions and keep its consumer business afloat,.",
    "According to Bloomberg, the company is currently negotiating the deal with Xnova, a China Postal and Telecommunications Appliances (PTAC) unit. If the deal goes through, Xnova will then be able to purchase smartphone parts, such as chips, which have been out of Huawei’s reach since the ban imposed by former US President Donald Trump.",
    "Bloomberg claims Xnova is already selling some Huawei-branded Nova phones on its e-commerce site. Citing people familiar with the matter, who decided to stay anonymous because the negotiations are still ongoing, the publication further claims Xnova will also offer self-branded devices, based on the larger company’s designs, as well as some devices featuring Huawei’s design, under its own brand.",
    "However, some Huawei engineers have already started redesigning the circuits of some of their key smartphones, to fit either Qualcomm or MediaTek processors, it was said. Huawei is expecting at least 30 million devices sold next year.",
    "So far, all companies allegedly involved in these negotiations are staying silent on the matter, but the Trump administration hurt Huawei badly, with the sanctions meaning business sales have fallen for the past four quarters.",
    "The company was forced to offset the Honor sub-brand to a consortium of companies last year, but given its recent strong performance, Huawei could have been motivated by Honor’s good performance for its new move."
  ],
  "headers": {
    "3": "Motivated by Honor?"
  },
  "links": {
    "Huawei": "https://www.techradar.com/news/best-huawei-phones",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-11-15/huawei-recruits-smartphone-partners-to-sidestep-u-s-sanctions",
    "ban imposed by former US President Donald Trump": "https://www.techradar.com/news/us-firms-see-huawei-licences-revoked",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "Honor": "https://www.techradar.com/news/honor-phones"
  }
}