{
  "source": "https://www.techradar.com/news/netflixs-army-of-the-dead-prequel-gets-a-teaser-but-dont-expect-zombie-action",
  "title": "Netflix's Army of the Dead prequel gets a teaser – but don't expect zombie action",
  "category": "entertainment",
  "updated": "2021-07-26T05:22:28Z",
  "author": "stephen-lambrechts",
  "summary": "Netflix's Zombie Universe expands with Army of Thieves",
  "article": [
    "Even before Zack Snyder's Army of the Dead was released, plans were already set in motion for the zombie action film to spawn its own cinematic universe at Netflix, starting with a prequel film (Army of Thieves) and spin-off anime series (Army of the Dead: Lost Vegas).",
    "Now, a teaser trailer has arrived for the former, which sees the return of Matthias Schweighöfer, who played the eccentric safe-cracker Ludwig Dieter in the first film.",
    "Along with starring in Army of Thieves, Schweighöfer also takes on directing duties, with Zack Snyder acting as producer on the film. You can check out Army of Thieves' first teaser below.",
    "Although Army of Thieves takes place in the same cinematic universe as Army of the Dead, there won't be much of a zombie presence in the prequel, and there's a very plausible reason for that.",
    "As we can see from the trailer above, Army of Thieves takes place in Europe right before the events of Army of the Dead, and at this point in the story's chronology, the zombie outbreak has only just kicked off and is still contained to the American city of Las Vegas.",
    "Of course, Army of Thieves won't be entirely different to Zack Snyder's film, in that it will still follow the construct of a team-based heist film, with Dieter brought in to crack yet another impenetrable safe.",
    "Despite the lack of zombie-related action, Army of Thieves looks like a great deal of fun. Unfortunately, we don't know when exactly the film will arrive on Netflix, as the teaser trailer only states that it's \"coming soon\". That said, we fully expect Army of Thieves to arrive on the service within the next few months."
  ],
  "headers": {
    "3": "Army of Thieves isn't a zombie film – here's why"
  },
  "links": {
    "Army of the Dead": "https://www.techradar.com/news/army-of-the-dead-on-netflix-is-zack-snyders-best-movie-yet"
  }
}