{
  "source": "https://www.techradar.com/news/galaxy-buds-2-leaks-suggest-a-familiar-design-and-audio-quality-upgrades",
  "title": "Galaxy Buds 2 leaks suggest a familiar design and audio quality upgrades",
  "category": "audio-visual",
  "updated": "2021-05-29T10:00:55Z",
  "author": "david-nield",
  "summary": "Launching soon, probably",
  "article": [
    "The Samsung Galaxy Buds 2 will be the next wireless earbuds we get from Samsung, and a couple of new leaks give us some more clues about what's coming: apparently the earbuds will produce audio that sounds better than ever, though in terms of design not much is changing from the Galaxy Buds Pro.",
    "First up, the dinky listening devices have made an appearance at the Federal Communications Commission (FCC) regulatory body in the US, as spotted by AllAboutSamsung – that's a sure sign that they're going to go on sale very soon.",
    "We have been expecting the Samsung Galaxy Buds 2 for months at this point, but if they're being assessed by regulators then it would seem that the wait is finally over – previous rumors have pointed to August as the month when the earbuds might launch.",
    "The FCC filing comes with some photos attached, and the design of the Galaxy Buds 2 looks very similar to the earbuds that came directly before them. That's not necessarily a disappointment though, because we were impressed with the fit and finish of the Galaxy Buds Pro launched last year.",
    "Meanwhile seasoned tipster @UniverseIce has revealed that the Galaxy Buds 2 will be keeping the active noise reduction of their predecessors, and come with \"better sound quality\" – an upgrade we would usually expect from a new pair of earbuds.",
    "There's an image attached to this leak as well, though it doesn't really tell us much more about what's on the way. It looks as though the infrared sensors for automatic in-ear wear detection will be kept from the Galaxy Buds Pro, and we won't be seeing a return to the bean-shaped design of the Galaxy Buds Live.",
    "It's only been a couple of years since the first Samsung Galaxy Buds appeared, but Samsung has launched several iterations of its wireless earbuds since then. The new pair are likely to be more affordable than the Pro models, and may lose some features or audio fidelity as a result.",
    "We're expecting the Galaxy Z Fold 3, the Galaxy Z Flip 3 and the Galaxy S21 FE to make an appearance in August, so it's possible that Samsung will push out the Galaxy Buds 2 at the same time. We will, of course, keep you posted."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "AllAboutSamsung": "https://allaboutsamsung.de/2021/05/galaxy-buds-2-zulassungsbehoerde-enthuellt-design/",
    "for months": "https://www.techradar.com/news/samsung-galaxy-buds-2-might-soon-be-a-reality",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1398193086564503553",
    "Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition"
  }
}