{
  "source": "https://www.techradar.com/news/investment-in-digital-and-diversity-is-key-to-a-resilient-future",
  "title": "Investment in digital and diversity is key to a resilient future",
  "category": "computing",
  "updated": "2021-07-16T14:05:11Z",
  "author": "stephen-corfield",
  "summary": "How to build business resilience",
  "article": [
    "If the pandemic has taught us anything it’s what it means to be resilient in a crisis: to mitigate impacts or shocks, and to respond and recover quickly. As we become more hyperconnected, we know this won’t be the last pandemic we will face. In business as with public health, there is no room for complacency. Together, we must learn lessons from today’s crisis to prepare for whatever challenges the future may hold.",
    "Key to building resilience, firstly, is realism: to recognize you have a problem and solve it. Secondly is optimism, to innovate and deliver success from anywhere. As we emerge from the pandemic, we know we’re not going back to the way things were. We are moving to an all-digital, work-from-anywhere world. It’s time for investment - in technology, people, and for future generations. To this end, there are three principles that organizations and businesses of all sizes should follow to become and remain agile in a changing world.",
    "The difference between this pandemic and previous pandemics has been the ability of businesses to continue operating and serving customers, largely because of technology. Companies around the world have had to fundamentally rethink their operating models in response to COVID-19.",
    "COVID-19 has accelerated the digital transformation of all aspects of our society. Where CEOs previously delegated their digital strategy, today more and more want to take direct leadership. They realize it’s imperative to the very survival of their business and building better resilience.",
    "From now on remote work will just be work. E-commerce will just be commerce. Video meetings will just be meetings. As the pandemic persists, and in preparation for the next crisis, whether global or local, from retail to education and healthcare, all industries must adapt to a world that is partly virtual and partly physical. Every company has to be able to work, sell, service, market, collaborate, and analyze data from anywhere.",
    "It’s no secret that workplaces with greater diversity tend to be more innovative and successful. For instance, Mckinsey’s 2019 Diversity analysis found that companies with the best gender diversity on executive teams were 25 percent more likely to have above-average profitability than companies with the least diversity. In the case of ethnic and cultural diversity, they also found that in 2019, the most diverse companies outperformed the others by 36 percent in profitability, highlighting how the likelihood of out performance continues to be higher for diversity in ethnicity than for gender.",
    "By maximizing the diversity of teams, in terms of gender, age, race, skills and knowledge, organizations will be more likely to consider surprises and anomalies. Together teams can cultivate a company culture of thinking outside of the box, leveraging different perspectives to consider where risks may come from and how they can respond when they occur. Businesses, by diversifying their products and assets, can also better position themselves to avail of economic opportunities.",
    "Organizations should also look to deconcentrate decision-making. Many organizations, to their detriment, have tended to concentrate information and power in a single individual or place. Should something happen to that person or place, absence of planning can have ramifications for the entire system. By empowering people with more data and analytics and decision-making capacity, providing a greater sense of purpose, skills, and meaning, at every level organizations will become more resilient to disruption.",
    "We can’t be resilient against everything, but we can be strategic; allowing time to respond and minimize the worst possible impacts of a crisis. Whether it’s building things like vaccine manufacturing capacity or technologies to help us stay connected, it’s imperative that we develop sustainable solutions that will help businesses and society to flourish in unfamiliar situations. Take collaboration technology for instance. Although these tools existed before the pandemic, we’re going to continue to see a huge wave of innovation which will make workplace collaboration and socialization easier and simpler.",
    "As we emerge from the pandemic, parallels with the climate emergency are striking. Both require a collective response which is responsible and sustainable, now and for future generations. Just as the pandemic has taught us to understand what we truly value, to address climate change and overcome other challenges we must cooperate, together prepare for the challenges ahead and continue to build better businesses and society than we had before."
  ],
  "headers": {
    "2": "Learn to pivot between virtual and physical worlds",
    "5": "Maximize diversity and empower teams to make decisions",
    "8": "For everyone to flourish, we need to collaborate"
  },
  "links": {
    "remote work": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "E-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "data": "https://www.techradar.com/best/best-data-recovery-software",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}