{
  "source": "https://www.techradar.com/news/lgs-ludicrously-named-new-vacuum-cleaner-automatically-empties-its-bin",
  "title": "LG's ludicrously-named new vacuum cleaner automatically empties its bin",
  "category": "smart-home",
  "updated": "2021-01-06T11:04:59Z",
  "author": "gerald-lynch",
  "summary": "LG CordZeroThinQ A9 Kompressor Plus just rolls off the tongue",
  "article": [
    "It may not be in Las Vegas, but CES 2021 wouldn't be CES if it didn't have some ridiculously-named products on show – and first up vying for the crown of this year's worst-named product is LG's CordZeroThinQ A9 Kompressor Plus cordless vacuum cleaner. Just... why LG, why?",
    "Thankfully, it's at least got a few interesting features to help us forget that travesty of a label. First up, the Kompressor Plus (as we're electing to call it from here on) comes with a charging station that not only powers the sucker, but also automatically empties its dust bin when docked.",
    "The \"fully-automated dust removal system\" extracts dirt into a larger dust bag in the stand, meaning you won't have to dig around in its waste chamber to get all the gross stuff out. Of course, you're eventually going to have to empty or replace that external bag too – how often, and how much replacements cost if you need them, is yet to be clarified by LG.",
    "The stand has a few other tricks up its sleeve, with space to hold the cleaner's six accessories (including a 2-in-1 combination tool, a crevice tool, a pet hair nozzle, a power carpet nozzle, and a power mop), and a touchscreen that allows you to adjust settings. Though it's hard to judge from the press images (which to our eyes look unlikely to have been captured in situ) that charging station looks pretty big.",
    "A pair of quick-change battery packs and washable filters round out the package.",
    "Name aside, it looks like a smart cleaner, keeping your exposure to dust to a minimum. The inclusion of a power mop head for hard floors is also a nice touch.",
    "There's no word on pricing or availability yet, but the Kompressor Plus will be on show at LG's virtual CES booth from January 11."
  ],
  "headers": {
    "3": "Tidy tech"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights"
  }
}