{
  "source": "https://www.techradar.com/news/fujifilm-may-not-launch-another-x-series-camera-in-2021-and-thats-no-bad-thing",
  "title": "Fujifilm may not launch another X-series camera in 2021 – and that's no bad thing",
  "category": "cameras",
  "updated": "2021-05-15T08:00:00Z",
  "author": "mark-wilson",
  "summary": "Rumors suggest a quiet year for X-series bodies, at least",
  "article": [
    "Fujifilm has steadily created a collection of some of the best mirrorless cameras around for hobbyists shooters. But anyone hoping for more new X-series treats this year could be disappointed, according to the latest rumors.",
    "Fuji Rumors, which has a reliable track record for X-series speculation, claimed pretty emphatically this week that there will be \"no more Fujifilm X Series cameras coming in 2021\". And it's pretty sure about that, saying it's \"100% accurate\".",
    "Considering we're only in May, that would be something of a surprise based on Fujifilm's recent history. As Fuji Rumors notes, this would be the first year since the X-series launched in 2013 that the company would only have launched a single APS-C camera (the Fujifilm X-E4, which landed in January).",
    "So why might this be the case? After all, Fujifilm has traditionally launched a new X-series model in September or October of each year, with the Fujifilm X-S10, Fujifilm X-Pro 3 and Fujifilm X-T3 all arriving in that window over the past few years.",
    "There are a few possible reasons. Most obviously, the pandemic has had a big impact on the supply chains, launch cycles and bottom lines of all camera manufacturers. Nikon recently denied that its Z-mount lens launches have been delayed, despite its only announcement this year being the development of the Nikon Z9.",
    "But the lack of any new X-series cameras this year, if that does turn out to be the case, isn't necessarily a black mark on Fujifilm or the health of its mirrorless APS-C system. The company had a bumper year of new launches in 2020, with the Fujifilm X-S10, Fujifilm X-T4 (which currently tops our best cameras list), Fujifilm X100V and Fujifilm X-T200 all arriving last year.",
    "The company also restructured in some regions like the UK, which has seen it combine sub-brands like Instax with the X-series under one umbrella, making it more likely that 2021 will be a year of consolidation. And while some Fuji fans will no doubt be pining for cameras like the long-rumored Fujifilm X-H2, a lack of new X-series bodies might not necessarily be a bad thing...",
    "A lack of new X-series cameras doesn't necessarily mean it'll be a quiet year for Fujifilm in general. We saw the arrival of the Fujifilm GFX100S, its latest medium format camera, in March, and there are already rumors that it could get a more affordable sibling soon.",
    "But perhaps even more important for existing Fujifilm X-series owners is the possibility of seeing the company focus on refreshing its lens lineup.",
    "The XF33mm f/1.4 R WR, the spiritual successor to the classic XF35mm f/1.4 R, is expected to launch this year, and could potentially be a great street photography companion for cameras like the Fujifilm X-T4 and Fujifilm X-Pro 3.",
    "According to Fuji Rumors, the XF23mm f/1.4 Mk II and XF56mm f/1.2 Mk II are also in the works, with the latter expected to be a refresh of the popular current version, only with speedier focusing and a form factor that's a little less weighty than Fujifilm's recent XF50mm f/1.0.",
    "While those two lenses might not arrive until 2022, there are also strong rumors that Sigma is preparing to launch its first lenses for the X-mount in 2021, too.",
    "Back in December, a Fuji Rumors source said that \"there will be Sigma lenses for Fujifilm coming in 2021\". This followed a social media post from Sigma where it answered a question about the possibility of X-mount Sigma lenses with \"hopefully we’ll see such in 2021\".",
    "So far, there's been no sign of that Sigma announcement, but if that news did arrive in the second half of the year, alongside a couple of new Fujifilm prime lenses plus generous firmware updates for its existing cameras, that would ensure the X-series continues to be a highly desirable place for hobbyist shooters.",
    "For pro photographers, well, it sounds like 2022 is going to be the bigger year, thanks to the arrival of the Fujifilm X-H2. According to rumors, a new stacked sensor and processor combo, which could again explain the rumors of a quiet year for new Fujifilm camera bodies, will debut on that camera. Until then, the X-series lineup is looking strong and will hopefully, if those rumors are correct, be reinforced with some tasty new glass over the next six months."
  ],
  "headers": {
    "7": "Focus and recompose"
  },
  "links": {
    "best mirrorless cameras": "https://www.techradar.com/news/best-mirrorless-camera",
    "Fuji Rumors": "https://www.fujirumors.com/rumor-sigma-lenses-for-fujifilm-coming-in-2021-trusted-source/",
    "Fujifilm X-E4": "https://www.techradar.com/news/the-fujifilm-x-e4-is-a-retro-travel-camera-with-an-attractive-price-tag",
    "Fujifilm X-S10": "https://www.techradar.com/reviews/fujifilm-x-s10",
    "Fujifilm X-Pro 3": "https://www.techradar.com/reviews/fujifilm-x-pro3",
    "Fujifilm X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3",
    "Nikon recently denied that its Z-mount lens launches": "https://www.techradar.com/news/nikon-denies-its-z-mount-lenses-have-been-hit-by-major-delays",
    "Nikon Z9": "https://www.techradar.com/reviews/nikon-z9",
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4",
    "best cameras": "https://www.techradar.com/news/best-camera",
    "Fujifilm X100V": "https://www.techradar.com/reviews/fujifilm-x100v",
    "Fujifilm X-T200": "https://www.techradar.com/reviews/fujifilm-x-t200",
    "Instax": "https://www.techradar.com/news/polaroid-vs-instax",
    "Fujifilm X-H2": "https://www.techradar.com/news/fujifilm-x-h2-release-date-news-rumors-and-what-we-want-to-see",
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "more affordable sibling": "https://www.techradar.com/news/fujifilm-gfx100s-could-be-getting-an-even-more-affordable-sibling"
  }
}