{
  "source": "https://www.techradar.com/news/zoom-may-have-just-killed-off-in-person-conferences-for-good",
  "title": "Zoom may have just killed off in-person conferences for good",
  "category": "computing",
  "updated": "2021-10-27T12:08:06Z",
  "author": "mike-moore",
  "summary": "Host your whole conferences online with Zoom Events",
  "article": [
    "The age of in-person events and company conferences could soon be at an end, if Zoom has anything to do with it.",
    "The video conferencing firm has revealed that customers can now host fully-fledged conferences online using its Zoom Events platform.",
    "Promising everything needed to run conference-scale virtual events, Zoom says that the new upgrade will help lessen the stress of hosting such online collaboration events, whilst also allowing users to configure and build their event just how they want.",
    "The company had tested its new release for its own Zoomtopia 2021 conference, where it says it was able to successfully host more than 33,000 global attendees.",
    "\"Juggling multiple platforms for event hosting and management can be a challenge. That’s why we’re constantly innovating to improve how you host, manage, and report on your virtual experiences with Zoom Events, the only solution you’ll need to host virtual events,\" Zoom Product Marketing Specialist David Ball wrote in a blog post outlining the new features.",
    "Users will now be able to host events lasting up to five days, and support up to 13 concurrent sessions. When logging in, attendees will be able to converge in a conference lobby, where they can network and view sessions before and during an event.",
    "Attendees can also view or search for specific sessions in the lobby or via a new directory, filtering via tracks, and can also monitor their itinerary or build their own schedules by adding sessions.",
    "For organisers, the new update means that session and speaker information can be uploaded in bulk, and session videos such as a sizzle reel or preview clip can be included to introduce speakers or prepare attendees for the start of the event.",
    "Speakers will also be able to edit their session and bios, although organisers will still have the final sign-off, along with full chat moderation throughout. and the hosting of the entire event can be split by assigning up to 20 event coordinators.",
    "After the event, surveys can be sent out to gauge attendee opinion, hopefully helping to make events more interesting and engaging going forward. Recordings of all sessions will also be made and distributed, and organisers can also see in and post-event analytics reports across a number of metrics.",
    "Out now, Zoom says that hosting free and paid events is available to users in United States, United Kingdom, Ireland, Germany, Australia, New Zealand, Canada, and France. However there are some limits to other countries hosting purely paid or free events for the time being.",
    "Need to boost your WFH set-up? Here's the best hybrid working tech - everything you need for the return to the office"
  ],
  "headers": {
    "3": "Zoom events"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "virtual events": "https://www.techradar.com/best/best-virtual-event-platforms",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "blog post": "https://blog.zoom.us/zoom-events-conference-features/",
    "best hybrid working tech": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}