{
  "source": "https://www.techradar.com/news/next-wear-os-version-will-only-work-on-smartwatches-with-these-chipsets",
  "title": "Next Wear OS version will only work on smartwatches with these chipsets",
  "category": "wearables",
  "updated": "2021-06-17T09:02:31Z",
  "author": "james-rogerson",
  "summary": "Wear 3100, 4100 and 4100 Plus",
  "article": [
    "We’ve known for a while that the major Wear OS overhaul landing later this year probably wouldn’t be compatible with all current Wear OS smartwatches, but we now have a clearer idea of which ones it might work with, as Qualcomm has revealed which of its chipsets are compatible.",
    "In a statement to XDA Developers, a Qualcomm spokesperson said “We are working with Google on bringing Wear OS 3.0 to Snapdragon Wear 4100 Plus and 4100 platforms. Snapdragon Wear 3100, 4100 Plus and 4100 platforms are capable of supporting Wear OS 3.0, but we are not discussing any specifics at this time.”",
    "So, in theory any wearable using those chipsets should be able to get Wear OS 3.0, though it’s odd that the statement mentions the Snapdragon Wear 3100 as being capable, but that the company is only currently working on the 4100 and 4100 Plus. That might mean that there’s a longer wait for Wear 3100 devices to get the update, if they do at all.",
    "That’s just speculation though, and just because a chipset is capable of running Wear OS 3.0, it doesn’t mean that all devices using that chipset will get the update, since that will still be down to the smartwatch maker.",
    "It’s also worth noting that only the TicWatch Pro 3 (and the Pro 3 LTE) actually use the Snapdragon Wear 4100 chipset, and at the time of writing precisely zero wearables use the 4100 Plus.",
    "So it’s likely (though not confirmed) that the TicWatch Pro 3 will get the new version of Wear OS, but for the most part this work on 4100/4100 Plus compatibility from Qualcomm is probably more about future devices that will launch with Wear OS 3.0 out of the box.",
    "Still, this gives us slightly more clarity than before. And loads more devices use the Snapdragon Wear 3100. These include the Fossil Sport, Moto 360, Oppo Watch and Skagen Falster 3, among many others.",
    "Fossil (which also makes watches by Skagen, Michael Kors, Misfit and more) has been a bit unclear on whether any of its current devices will support Wear OS 3.0. The brand suggested initially that they wouldn’t, but more recently claimed that it will bring the 'maximum amount of innovation that Google will enable' to current models – suggesting that the Wear 3100 ones could get the new Wear OS.",
    "For now, we’re still not really certain of anything, but hopefully smartwatch makers will start making some concrete announcements before long.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "Still uncertain"
  },
  "links": {
    "probably wouldn’t be compatible": "https://www.techradar.com/news/wear-os-update-may-not-be-available-to-all-current-watches",
    "Wear OS smartwatches": "https://www.techradar.com/news/best-wear-os-watch",
    "XDA Developers": "https://www.xda-developers.com/wear-os-3-0-compatible-platforms",
    "TicWatch Pro 3": "https://www.techradar.com/reviews/ticwatch-pro-3",
    "Fossil Sport": "https://www.techradar.com/reviews/fossil-sport-review",
    "Moto 360": "https://www.techradar.com/reviews/moto-360-2019",
    "Oppo Watch": "https://www.techradar.com/reviews/oppo-watch-review",
    "Skagen Falster 3": "https://www.techradar.com/reviews/skagen-falster-3",
    "more recently claimed": "https://www.techradar.com/news/fossil-is-making-a-new-premium-smartwatch-for-the-new-wear-os",
    "Phone Arena": "https://www.phonearena.com/news/qualcomm-chipsets-google-wear-os-upgrade_id132908"
  }
}