{
  "source": "https://www.techradar.com/news/ssds-are-failing-just-as-often-as-hard-drives",
  "title": "SSDs are failing just as often as hard drives",
  "category": "computing",
  "updated": "2021-10-04T13:28:19Z",
  "author": "sead-fadilpasic",
  "summary": "Mainly when they're new(ish), though",
  "article": [
    "Solid-state drives (SSD) are often touted as more reliable than hard-disk drives (HDD), but new research from cloud backup and storage services provider Backblaze suggests that may not always be the case.",
    "The company recently put both variants to the test, analyzing the performance of both SSDs and HDDs in the same environment, performing the same functions, and with the same workload - with the devices also the the same age and have had to operate in a relatively same timeframe.",
    "The results found that the Annual Failure Rate (AFR) of HDD drives was 1.38%, while the AFR for SSD drives was 1.05%.",
    "“We have some evidence that when both types of drives are young (14 months on average in this case), the SSDs fail less often, but not by much,” the company said in a blog post detailing its research.",
    "But storage units, both SSDs and HDDs, are not built to last 14 months, but rather for years and years, and in order to assess even more precisely who the winner of this contest is, Backblaze said it would require data on a longer timeframe.",
    "“At this point, you are better off deciding based on other factors: cost, speed required, electricity, form factor requirements, and so on,” the blog said.",
    "“Over the next couple of years, as we get a better idea of SSD failure rates, we will be able to decide whether or not to add the AFR to the SSD versus HDD buying guide checklist. Until then, we look forward to continued debate.”",
    "Solid-state drives are usually considered a more reliable alternative to HDD drives considering the fact that they don’t have any moving parts that could break down after extended use."
  ],
  "headers": {
    "4": "Building for years"
  },
  "links": {
    "blog post": "www.backblaze.com/blog/are-ssds-really-more-reliable-than-hard-drives/"
  }
}