{
  "source": "https://www.techradar.com/news/ps5-could-be-getting-a-genuinely-exciting-online-multiplayer-upgrade",
  "title": "PS5 could be getting a genuinely exciting online multiplayer upgrade",
  "category": "gaming",
  "updated": "2021-08-30T02:04:42Z",
  "author": "rhys-wood",
  "summary": "Official PS5 online tournament system could come soon",
  "article": [
    "A Sony patent has revealed the company could be working on an official online tournament system for the PS5. The system would allow players and developers alike to host gaming tournaments on PlayStation 5, using a built-in feature that creates tournament brackets without the need of a dedicated mode in each game.",
    "As reported by Gaming Intel, this online tournament system will make use of the PlayStation Network to generate tournament brackets outside of the game you’re playing. This means that multiplayer games won’t need to have a dedicated tournament mode, instead relying on the built-in PlayStation Network system to create one for the game.",
    "The really clever part is how this PS5 online tournament system plans to work. After the brackets have been generated and the players are present and accounted for, the system will update the bracket by tracking in-game wins and losses. It will then schedule the next matches in the tournament accordingly. For example, once a quarter-final match has wrapped up, the system will then update one of the semi-final brackets.",
    "The usefulness of a dedicated tournament mode on PS5 can’t be understated, and it’s something we hope Sony goes ahead and implements. There aren’t a ton of games that feature dedicated tournament modes, and while the PS5’s library is still relatively short on multiplayer games, getting the feature in while the console’s still young will definitely benefit multiplayer gamers in the long run.",
    "A dedicated on-console tournament feature would be a huge boon for fighting games like the recent Guilty Gear Strive, which has a PS5 version and is enjoying a period of immense popularity. But looking at the bigger picture, we can see a PlayStation Network-centric tournament system benefiting team-based games like the upcoming Battlefield 2042, Call of Duty 2021 and smaller, existing titles like Knockout City and Destruction AllStars.",
    "We also hope this online tournament system on PS5 would be quite robust. Not only should there be support for basic tournaments, but also larger, professional ones with entry criteria as well as tournaments with losers’ brackets which allow players a second chance should they be knocked out early.",
    "It could also make for a fantastic way for developers to foster their active communities by hosting regular tournaments. In which case, it would be great to see Sony’s PS5 tournament system support prize pools or even contests with stricter rulesets, like only being able to select certain characters or playing on predetermined maps.",
    "Of course, as Sony has only filed a patent for now, there’s currently no telling if the company genuinely plans to implement the system on the PS5 or not. But we seriously hope it chooses to do so, because it would present a reason for serious multiplayer gamers to purchase a PS5 if tournament play is fully catered for out of the box."
  ],
  "headers": {
    "3": "Go for broke"
  },
  "links": {
    "patent": "https://pdfaiw.uspto.gov/.aiw?PageNum=0&docid=20210205711&IDKey=4F9D26B9D91F&HomeUrl=http%3A%2F%2Fappft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO1%2526Sect2%3DHITOFF%2526d%3DPG01%2526p%3D1%2526u%3D%2Fnetahtml%2FPTO%2Fsrchnum.html%2526r%3D1%2526f%3DG%2526l%3D50%2526s1%3D20210205711.PGNR.%2526OS%3D%2526RS%3D",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Gaming Intel": "https://gamingintel.com/sony-patents-psn-online-tournament-ps5/",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Call of Duty 2021": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "Knockout City": "https://www.techradar.com/news/knockout-city-is-the-competitive-dodgeball-game-you-never-knew-you-wanted",
    "Destruction AllStars": "https://www.techradar.com/news/destruction-allstars-is-worth-a-spin-but-lacks-longevity"
  }
}