{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s8-ultra-shows-off-a-display-notch-in-new-unofficial-renders",
  "title": "Samsung Galaxy Tab S8 Ultra shows off a display notch in new unofficial renders",
  "category": "tablets",
  "updated": "2021-10-24T10:30:53Z",
  "author": "david-nield",
  "summary": "We're going to need a bigger tablet case",
  "article": [
    "We're expecting the Samsung Galaxy Tab S8 series to break cover sometime early in 2022, and over the last few days we've got a much better idea of what the tablets are going to look like – including, in the latest unofficial renders, the Tab S8 Ultra edition.",
    "Courtesy of 91mobiles and @OnLeaks (by no means newcomers to renders like this), we've got a detailed, high-resolution look at the biggest and most expensive Tab S8 tablet. Notably, it appears that Samsung has decided to put a display notch up at the top of the screen (when it's held in landscape mode).",
    "That notch houses the selfie camera and means the bezels around the rest of the screen can be thinner, apparently – and the word is that the screen will be a huge 14.6 inches in size (compared to 11 inches for the Tab S8 and 12.4 inches for the Tab S8 Plus).",
    "There are dual rear cameras here, four speakers and a USB-C port, though Samsung hasn't found room for a headphone jack. We can also see a magnetic strip to hold the S Pen. The overall dimensions of the Galaxy Tab S8 Ultra are reported to be 325.8 mm x 207.9 mm x 5.4 mm (12.8 inches x 8.2 inches x 0.2 inches).",
    "Only a couple of days ago we saw unofficial renders for the Galaxy Tab S8 and the Galaxy Tab S8 Plus, together with plenty of leaks around the specs of these upcoming tablets – but there's no notch on those other two models.",
    "It's worth mentioning that Samsung hasn't offered an Ultra model of its flagship Android tablet before: last year we just got the Galaxy Tab S7 and the Galaxy Tab S7 Plus (and the Galaxy Tab S7 FE, a bit later on). Those tablets launched in August 2020, so their successors could appear any time between now and early 2022.",
    "Rumors that Samsung would add a super-sized Ultra model to the Galaxy Tab S8 line-up have been swirling for months now, and it seems clear that the aim is to challenge Apple's iPad Pro slates – with the biggest of those tablets measuring 12.9 inches.",
    "Samsung has never been shy of going bigger and better than anyone else, and with a 14.6-inch tablet we would be well into laptop monitor size territory. As with the other models in the Galaxy Tab S8 range, there will no doubt be keyboard cover accessories so you can use these devices as makeshift tablets too.",
    "It won't just be the screen size that makes the Galaxy S8 Ultra a premium tablet though: expect top-tier specs on the inside, excellent build quality, and of course support for the S Pen stylus. This might be the tablet that lifts the bar when it comes to the best that Android tablets can be.",
    "If there is a notch on the display as well, then it adds something else to distinguish it from the other S8 tablets in the series – though we'll have to wait and see how apps and the on-board software handle the cut out on screen."
  ],
  "headers": {
    "3": "Samsung goes Ultra",
    "6": "Analysis: Samsung aims for the iPad Pro"
  },
  "links": {
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "91mobiles": "https://www.91mobiles.com/hub/samsung-galaxy-tab-s8-ultra-renders-design-exclusive/",
    "@OnLeaks": "https://twitter.com/OnLeaks/status/1451803371371999237",
    "unofficial renders": "https://www.techradar.com/news/samsung-galaxy-tab-s8-renders-give-us-first-look-along-with-another-specs-leak",
    "Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Galaxy Tab S7 FE": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-fe",
    "swirling for months": "https://www.techradar.com/news/the-samsung-tab-s8-could-come-with-a-huge-screen-and-a-giant-battery",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review"
  }
}