{
  "source": "https://www.techradar.com/news/squarespace-is-now-worth-dollar10bn",
  "title": "Squarespace is now worth $10bn",
  "category": "computing",
  "updated": "2021-03-17T22:16:26Z",
  "author": "anthony-spadafora",
  "summary": "Latest funding round brings in $300m at a $10bn valuation",
  "article": [
    "The website builder and web hosting company Squarespace has managed to raise an additional $300m in its latest round of funding and the firm is now valued at $10bn.",
    "While the company's existing backers Accel and General Atlantic participated in this new funding round, a number of new backers including Dragoneer, Tiger Global, D1 Capital Partners, Fidelity Management & Research Company, funds and accounts advised by T. Rowe Price Associates, Inc. and Spruce House also contributed.",
    "In a post on its site, founder and CEO of Squarespace Anthony Casalena welcomed the new investors that will allow the company to further scale its suite of products, saying:",
    "“We’re thrilled to welcome our new investors as we continue scaling our product suite in service of our customers around the world.”",
    "Squarespace's latest funding round comes less than two months after the company confidentially filed to go public through either a direct listing or initial public offering.",
    "The company was first founded in 2003 and was bootstrapped up until 2010 when it raised $38.5 million in a Series A funding round co-led by Accel and Index Ventures. Then in 2014, Squarespace was able to raise an additional $40 million but three years later, it brought in $200 million from General Atlantic to further fund its expansion.",
    "During its 18 year history, Squarespace has helped millions of users around the world create an online presence thanks in part to its drag-and-drop website builder. In recent years though, the company has expanded into the ecommerce market by allowing users to host online stores on its site.",
    "Website creation reached an all-time high during the pandemic and in our increasingly digital world, demand for website builders and web hosting services is only likely to increase going forward.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Funding round"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "post": "https://Squarespace.syuh.net/c/221109/533949/9084?subId1=trd-us-8205256915662669000&sharedId=trd-us&u=https%3A%2F%2Fnewsroom.squarespace.com%2Fblog%2Fsquarespace-raises-300-million-investment-round-at-10-billion-valuation",
    "ecommerce": "https://www.techradar.com/news/best-ecommerce-hosting",
    "reached an all-time high": "https://www.techradar.com/news/global-appetite-for-website-building-reaches-new-highs-during-pandemic",
    "TechCrunch": "https://techcrunch.com/2021/03/16/squarespace-raises-300m-at-staggering-10b-valuation/"
  }
}