{
  "source": "https://www.techradar.com/news/nvidia-could-make-mining-gpus-again-and-thats-good-news-for-gamers",
  "title": "Nvidia could make mining GPUs again, and that’s good news for gamers",
  "category": "computing",
  "updated": "2021-01-15T13:08:44Z",
  "author": "darren-allan",
  "summary": "Could potentially help to ease RTX 3000 graphics card stock woes",
  "article": [
    "Nvidia is keeping a close watch on developments with crypto-mining regarding its graphics cards, and is potentially ready to again start making new dedicated GPUs for that purpose – a move that could potentially help ease the stock pressures on RTX 3000 products.",
    "This news comes from a conference call with Nvidia’s CFO Colette Kress as reported by Seeking Alpha, in which the subject of whether cryptocurrency mining has contributed ‘meaningfully’ to RTX 3000 sales – and the huge demand for Ampere GPUs – was raised.",
    "Kress noted that: “We don’t have visibility on how much of the RTX 30 Series end demand comes from mining. So, we don’t believe it’s a big part of our business today. Gaming demand is very strong, and we think that’s larger than our current supply. This time feels different than what we had seen several years ago for a couple of reasons.”",
    "Kress is referring here to the big spike of crypto-mining demand in 2018, and this time around with Ampere, she observes that “inventory levels are now very lean, and we have better visibility into that channel inventory”.",
    "She concludes: “So, in summary, if crypto demand begins or if we see a meaningful amount, we can also use that opportunity to restart the CMP product line to address ongoing mining demand.”",
    "In short, what Nvidia is saying here is that it can’t be sure exactly how much RTX 3000 demand is driven by crypto-miners, but if the cryptocurrency market continues to look a strong proposition, then CMP model production could be cranked up.",
    "CMP refers to dedicated crypto-mining cards, which remove the video outputs (miners don’t need them) and can be made (and therefore sold) more cheaply – or indeed in the current climate, any availability at all would likely be a selling point.",
    "While Bitcoin mining may be the province of ASICs, other coins are still ripe targets for utilizing GPUs for mining operations, notably Ethereum which has been on a major upward trajectory (not quite to the same extent as Bitcoin, but it’s still ramped up a lot in the latest crypto explosion).",
    "Theoretically, if Nvidia does make dedicated mining cards again, that could ease the amount of RTX 3000 GPUs which are potentially being bought for this purpose rather than gaming.",
    "So that would certainly be a good thing – although there is also the argument that miners would likely prefer to buy a fully-fledged GPU rather than a CMP model anyway, for resale value down the line (for example if – or arguably when – the crypto bubble bursts with a vengeance).",
    "At any rate, gamers struggling to buy an RTX 3000 graphics card to enjoy playing the latest big releases, and who believe crypto demand isn’t helping Nvidia’s well-documented stock shortages – we’ve certainly seen some evidence that suggests this is the case – can be hopeful that perhaps Nvidia will take the course of pushing out CMP products for miners.",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "8": "Stock solution?"
  },
  "links": {
    "stock pressures on RTX 3000 products": "https://www.techradar.com/news/nvidia-rtx-3000-stock-may-not-improve-until-may-and-amds-gpu-outlook-isnt-great-either",
    "Seeking Alpha": "https://seekingalpha.com/article/4398578-nvidia-corporation-nvda-presents-19th-annual-j-p-morgan-tech-auto-forum-conference-transcript",
    "Ampere GPUs": "https://www.techradar.com/news/nvidia-ampere",
    "ASICs": "https://www.techradar.com/best/asic-devices",
    "mining operations": "https://www.techradar.com/best/mining-gpu",
    "Bitcoin": "https://www.techradar.com/news/bitcoin-price-is-making-a-mockery-of-previous-records",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/nvidia-mulls-restarting-production-of-cryptomining-product-line"
  }
}