{
  "source": "https://www.techradar.com/news/ps5-could-finally-be-getting-an-all-black-makeover-but-it-wont-be-cheap",
  "title": "PS5 could finally be getting an all-black makeover - but it won't be cheap",
  "category": "gaming",
  "updated": "2021-02-10T13:53:30Z",
  "author": "adam-vjestica",
  "summary": "The wait for a black PS5 might soon be over",
  "article": [
    "A company called dbrand has sent out a survey about the black PS5 faceplates it’s been working on – and it pulls no punches when it comes to describing Sony’s console.",
    "The custom hardware skin maker, dbrand, is producing PS5 faceplates that are fittingly called Darkplates, and they'll let you transform the white PS5 into a sleek, matte black machine.",
    "Sony's two-tone design for its next-gen console has been divisive ever since its reveal, and because the faceplates are removable, consumers have been crying out for a solution to make the PS5 black. Sony, however, has yet to reveal anything official and it seems like dbrand are now leading the charge.",
    "A survey has gone out to users who signed up for notifications regarding the matte black faceplates, and it appears that dbrand’s Darkplates won’t come cheap. The PS5 survey asks users to “help us price the Darkplates”, with the lowest figure we saw being $69 (around £50, AU$90).",
    "The Darkplates will also feature a micro-texture inside the panels, just like on the PS5. However, as dbrand notes: \"If you look closely, you'll see that we replaced the stock geometric shapes with more apocalyptic dbrand versions. As an added bonus, Sony can't sue us for including them. Checkmate, lawyers.\"",
    "The survey also reveals that dbrand is making a custom skin for the center spine of the PS5, and one of the designs includes a collaboration with popular tech YouTuber, MKBHD. Again, users are asked to pick from a variety of price points that they’d be willing to pay.",
    "\"In addition to Darkplates, we'll also be selling skins to cover up the glossy, scratch-prone plastic center on your PS5. These skins would most likely be sold in a bundle, alongside the Darkplates,\" the survey says.",
    "Finally, dbrand also asks how much users would be willing to pay for shipping, while making fun of the size of Sony’s console. “As you are likely aware, the PS5 is f**king enormous. As a result, the Darkplates are also f**king enormous. This means they cost a lot to ship,” the survey says.",
    "Previously, dbrand challenged Sony to “sue them” after it stopped another company from producing a similar product last year, and it looks like Sony will have to call its bluff at this rate.",
    "A custom modding team previously promised to sell a PS2-themed black PS5, but the project was shutdown after the team claimed it received \"threats to their safety\".",
    "If you're still searching for the regular old PS5 (and many people are), we're helping you find where to buy PS5 by checking all the online retailers for updates."
  ],
  "headers": {
    "7": "Big box energy",
    "8": "Design wars"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Darkplates": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2934136220365881000/https://dbrand.com/shop/special-edition/ps5",
    "sue them": "https://www.reddit.com/r/dbrand/comments/kk0aav/introducing_playstation_5_faceplates/",
    "PS2-themed black PS5": "https://www.techradar.com/news/the-ps2-themed-black-ps5-has-now-officially-sold-out-but-more-could-be-on-the-way",
    "where to buy PS5": "https://www.techradar.com/news/where-to-buy-ps5"
  }
}