{
  "source": "https://www.techradar.com/news/aws-will-now-let-you-run-macos-big-sur-in-a-cloud-instance",
  "title": "AWS will now let you run macOS Big Sur in a cloud instance",
  "category": "computing",
  "updated": "2021-02-24T18:10:44Z",
  "author": "mirza-bahic",
  "summary": "AWS has introduced more options for macOS developers",
  "article": [
    "Amazon Web Services (AWS) has delivered an update that greatly improves its macOS offering, introducing the ability to run the latest version, Big Sur, in a cloud instance.",
    "Previously, Amazon’s EC2 Mac instances supported only macOS Mojave and Catalina, but the firm has now added the recently released macOS Big Sur (version 11.2.1) to the line-up.",
    "Big Sur arrived just 18 days before AWS unveiled its macOS instances in November last year, explaining its omission at launch, but it’s unclear why it has taken so long to be introduced.",
    "One of the newest enhancements is the option to mount Amazon’s Elastic File System (EFS) on macOS cloud instances, which will be particularly welcome if speed is your concern.",
    "Currently, Amazon recommends users of macOS instances avoid using the native file system and switch to using Amazon’s Elastic Block Storage.",
    "Big Sur is the latest version of the macOS operating system and delivered the biggest redesign of the operating system since the introduction of macOS X. Aside from interface changes, a lot of attention was placed on updating the Safari browser, which among other features, received a built-in translator.",
    "The EC2 Mac instances are running on physical Mac Minis. At the moment, availability limited to the following regions: US East (North Virginia), US East (Ohio), US West (Oregon), EU, and Asia-Pacific.",
    "Via The Register"
  ],
  "headers": {
    "3": "AWS macOS instances"
  },
  "links": {
    "AWS)": "https://www.techradar.com/news/aws",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "macOS Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "browser": "https://www.techradar.com/best/browser",
    "The Register": "https://www.theregister.com/2021/02/24/aws_cloud_macs_big_sur/"
  }
}