{
  "source": "https://www.techradar.com/news/biden-nominee-suggests-no-change-in-us-huawei-stance",
  "title": "Biden nominee suggests no change in US Huawei stance",
  "category": "phones",
  "updated": "2021-02-05T13:55:49Z",
  "author": "steve-mccaskill",
  "summary": "Gina Raimondo says she sees no reason to lift sanctions",
  "article": [
    "Hopes that Joe Biden’s tenure as US president would lead to a reprieve for Huawei appear to be unfounded following comments from his nominee for commerce secretary.",
    "Huawei, along with several other Chinese companies, has been on the US ‘non-entity’ list since 2019, a status that prevents US companies from doing business with it without a licence. This has limited its access to key technologies such as Google applications and US-manufactured components.",
    "Gina Raimondo had initially not committed to keeping Huawei on the list, prompting senate republicans to seek a delay to her confirmation until the matter was clarified.",
    "In response to a written question, Raimondo said: “I understand that parties are placed on the Entity List and the Military End User List generally because they pose a risk to U.S. national security or foreign policy interests. I currently have no reason to believe that entities on those lists should not be there. If confirmed, I look forward to a briefing on these entities and others of concern.”",
    "According to Bloomberg, this was a satisfactory response to any concerns and her nomination has advanced.",
    "The company denies any allegations that it is a national security risk and has said the sanctions threaten the future of its smartphone business. The measures have certainly ended any ambitions of becoming the world leading smartphone manufacturer. It is refocusing on the high-end segment of the market and has sold its Honor subsidiary – in part so it can escape the impact of US sanctions.",
    "Meanwhile, China has suggested the US stance on Huawei and other affected companies is political.",
    "Via Bloomberg"
  ],
  "headers": {
    "3": "Huawei Biden"
  },
  "links": {
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-04/biden-commerce-pick-sees-no-reason-to-pull-huawei-from-blacklist"
  }
}