{
  "source": "https://www.techradar.com/news/amazon-kindle-paperwhite-2021-vs-kindle-paperwhite-2018",
  "title": "Amazon Kindle Paperwhite 2021 vs Kindle Paperwhite 2018",
  "category": "tablets",
  "updated": "2021-10-26T17:00:33Z",
  "author": "james-rogerson",
  "summary": "Old vs new",
  "article": [
    "It’s been three years since the Amazon Kindle Paperwhite (2018) landed, but now finally we have a new model, in the Amazon Kindle Paperwhite (2021).",
    "Three years is a long time in the wider tech world, so you might expect a lot to have changed here, but on the other hand progress is often slow when it comes to ereaders. In the case of the Kindle Paperwhite 2021 the reality is somewhere in the middle. It’s not an enormous upgrade over the 2018 model, but there are still some substantial changes here.",
    "Below we’ve detailed exactly what those changes are, so you can see whether this new model is worth upgrading to if you have the old model, and worth choosing over the old one if you don’t.",
    "The Amazon Kindle Paperwhite 2021's sale date is October 27, 2021, and it costs $139.99 / £129.99 for a version with adverts on the lock screen, or $159.99 / £139.99 / AU$239 without adverts.",
    "That’s for the standard 8GB model, but there’s also a Kindle Paperwhite Signature Edition, which comes with 32GB of storage and wireless charging, and costs $189 / £179 / AU$289.",
    "The older Amazon Kindle 2018 meanwhile has obviously been out for years, and this started at $129.99 / £119.99 / AU$199 for an 8GB model when it launched. That’s for a version with ads in the regions that offer them, so the price goes up slightly if you remove ads. For a 32GB model you’d pay $159.99 / £149.99 / AU$249.",
    "So the new version is a bit more expensive than the old one was at launch, and the 2018 model has since dropped in price too. At the time of writing we can see it from $110 / £99 / AU$189.",
    "Usually in these articles we’d talk about the design before the display, but the screen is a big change here, and it’s a fundamental part of the design.",
    "The Amazon Kindle Paperwhite 2021 has a 6.8-inch screen, up from 6.0 inches on the previous Paperwhite, so it’s significantly bigger here, and closer in size to the 7-inch Amazon Kindle Oasis.",
    "It also has 17 LEDs in its front light, compared to five in the old model, allowing for a 10% higher maximum brightness. You can also adjust the warmth of the light from the display, which you can’t on the old model.",
    "Shell out for the Kindle Paperwhite Signature Edition and the front light can additionally automatically adjust the brightness based on the environment.",
    "Not everything about the screen has changed though, with the old and new Paperwhites both having 300 pixels per inch, so the new one isn’t any crisper, not that the old one was lacking on that front.",
    "While the Amazon Kindle Paperwhite 2018 is available in black, plum, sage and twilight blue shades, the Kindle Paperwhite 2021 is only available in black, which is a bit of a shame.",
    "The new model is also slightly bigger, as you’d expect given the larger screen, but the difference isn’t substantial. The Amazon Kindle Paperwhite 2021 is 174 x 125 x 8.1mm, while the Kindle Paperwhite 2018 is 167 x 116 x 8.2mm. The difference in weight is minor too, with the old model being 182g (or 191g if you get a version with cellular connectivity), while the new model is 207g.",
    "Otherwise the design is similar, with both ereaders having a plastic shell on the rear and large black bezels on the front. That said, the Paperwhite 2021 has smaller bezels than the old model, and it just has the Amazon smile logo on the back, while the 2018 ereader also says Amazon in large writing.",
    "Both ereaders have the same level of waterproofing as each other (an IPX8 rating allowing them to withstand submersion up to 2 meters deep in fresh water for up to 60 minutes), but there is one other notable difference between them, albeit not one that’s visible.",
    "The Kindle Paperwhite 2021 is a Climate Pledge Friendly product, which means that it’s made with 60% post-consumer recycled plastics, and that 95% of the packaging is made from wood-fiber-based materials from responsibly managed forests or recycled sources. There’s no such pledge on the Kindle Paperwhite 2018.",
    "The Amazon Kindle Paperwhite 2021 comes with 8GB of storage, or if you choose the Signature Edition then you get 32GB of storage. For the Kindle Paperwhite 2018 you can also choose between 8GB or 32GB of storage, but in both cases that’s for a standard Paperwhite – there’s no Signature Edition of the old model.",
    "That Signature Edition additionally gets you wireless charging, which is a new feature for Amazon’s ereader range, as even the Kindle Oasis doesn’t have this.",
    "And speaking of charging, if you do use a wire, you can connect it to a USB-C port on the Kindle Paperwhite 2021, whereas the Kindle Paperwhite 2018 is stuck with a dated micro USB port.",
    "The battery life should also be better on the new model, with Amazon claiming that the Paperwhite 2021 will last for up to 10 weeks between charges, whereas the Paperwhite 2018 only goes up to six weeks (based on half an hour of reading per day in both cases).",
    "The Amazon Kindle Paperwhite 2021 also benefits from page turns that are 20% faster than on the previous generation.",
    "But not everything works out in the new model’s favor, as the Amazon Kindle Paperwhite 2018 is optionally available with cellular connectivity, whereas the Kindle Paperwhite 2021 is Wi-Fi-only.",
    "The new Amazon Kindle Paperwhite 2021 comes with a wealth of upgrades, including a larger, brighter screen with an adjustable warm light, longer battery life, smaller bezels, a USB-C port, faster page turns, and a more sustainable, environmentally friendly build. Go for the Kindle Paperwhite Signature Edition and you also get wireless charging and an automatically adjusting front light.",
    "But the new model is also more expensive, bigger, heavier, only comes in one color, lacks cellular connectivity, and is in most other ways very similar to the old one, including having the same pixel density and storage amounts.",
    "So in some ways the Amazon Kindle 2018 is actually the better device, though the only significant advantages it has are cellular connectivity and a lower price. Overall the Kindle Paperwhite 2021 is the clear winner on paper – but we wouldn’t expect anything less with three whole years between the products."
  ],
  "headers": {
    "3": "Amazon Kindle Paperwhite 2021 vs Kindle Paperwhite 2018 price and availability",
    "7": "Display",
    "12": "Design",
    "17": "Specs, features and battery life",
    "23": "Takeaway"
  },
  "links": {
    "Amazon Kindle Paperwhite (2018)": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-2018-review",
    "Amazon Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review"
  }
}