{
  "source": "https://www.techradar.com/news/3-things-weve-learned-about-facebooks-ar-glasses",
  "title": "3 things we’ve learned about Facebook’s AR glasses",
  "category": "wearables",
  "updated": "2021-03-15T17:30:24Z",
  "author": "axel-metz",
  "summary": "Including wearables to wear with the wearables",
  "article": [
    "AR wearables have long been thought of as the next great innovation in the world of mainstream consumer tech – but after all these years, no one has yet managed to come up with a commercially-viable proposition.",
    "Now, after the trials and tribulations of Apple, Google and Samsung before it, Facebook is throwing its hat in the ring to try and develop the glasses of the future.",
    "A recent post from Facebook Reality Labs – the brains behind the Oculus Quest headsets – suggests the company is intent on bringing about a world “where a lightweight, stylish pair of glasses could replace your need for a computer or smartphone.” But how realistic is this vision? What makes Facebook so confident it can succeed where so many others have failed?",
    "Here, we’ll break down three things we’ve learned about Facebook’s AR glasses, and leave you to decide what is fact and what is fantasy.",
    "During a recent company-wide meeting, the Vice President of augmented and virtual reality at Facebook, Andrew ‘Boz’ Bosworth, suggested the developer is considering incorporating plans for facial recognition technology in its AR wearables project.",
    "Naturally, details were scarce as to how this technology might be implemented – it was more of a throwaway comment from Bosworth than a statement of intent – but we’ll speculate that the glasses would be capable of detecting the user’s face to determine whether or not they function (in the same way facial recognition software works as a mode of security for phones).",
    "Of course, this could also mean the wearables might be able to detect other faces, too, though why this would benefit their functionality is anyone’s guess at this stage.",
    "It’s worth noting that Bosworth made sure, during a later Instagram Q&A, to caveat that Facebook would only roll out facial recognition if people wanted it. The company has been the subject of a major privacy lawsuit in recent years – having recently agreed to pay damages to users who alleged Facebook created and stored scans of their faces through its photo-tagging feature without their consent in 2015 – so it follows that the company are exercising caution in this regard.",
    "Bosworth also tweeted that AR glasses “would be fine without” the feature, but that Facebook is investigating the potential legal and privacy issues around using the technology. That’s a fairly so-so verdict on whether or not we’ll see facial recognition functionality on Facebook’s upcoming AR wearables, but it’s clear the company is at least entertaining the idea.",
    "The latest Facebook Reality Labs blog post suggests the upcoming AR glasses might also come with what the company describes as a “soft wristband”.",
    "Whatever this might mean, Facebook is clearly working on an alternative to more traditional interface methods found on existing smart glasses. The Google Glass Enterprise Edition 2, for example, had discreet finger loops that let you navigate menus, while Epson’s Moverio glasses had you rely on your smartphone to engage with the wearables. Naturally, smart glasses require a method of interacting with what the user sees in front of their eyes, but neither solutions from Google nor Epson were particularly intuitive.",
    "Facebook, then, might be taking a different approach by having the user wear a separate wristband alongside the glasses. The blog describes the following scenario, which sheds some light on how this might work: “Say you decide to walk to your local café to get some work done. You’re wearing a pair of AR glasses and a soft wristband. As you head out the door, your Assistant asks if you’d like to listen to the latest episode of your favorite podcast. A small movement of your finger lets you click ‘play’.” It doesn’t seem too far-fetched.",
    "A wristband like this would presumably harness electromyography (EMG) – technology which monitors the electrical signals traveling from your spine to your hand – to determine user decisions. It’s not an entirely new technology, since we’ve seen similar band prototypes for the Apple Watch which let you control functions with the tiniest of finger movements, but it certainly marks uncharted territory for the mainstream tech market.",
    "Following the hypothetical scenario in which you choose your playlist using this electromyography-enabled wristband, the blog post goes on to mention a pair of “soft, lightweight haptic gloves” that tell the glasses to project a virtual screen and keyboard in front of the user.",
    "Haptic feedback – which refers to any technology that can create an experience of touch by applying forces, vibrations or motions – offers an easy way of detecting and transmitting data between the user and device, so it makes sense that a pair of AR glasses could employ this technology effectively.",
    "These “soft gloves” (there’s a “soft” theme here) would liaise with what Facebook describes as the Assistant, a Siri-like virtual voice which uses special in-ear monitors (IEMs) and active noise cancellation to soften the background noise and allow you to focus on the task at hand.",
    "Essentially, Facebook seems intent on introducing a range of “soft, all-day wearable systems” to address the interface challenges posed by AR glasses technology. As we’ve mentioned, the blog post simply provides a hypothetical glimpse at what Facebook’s wearables might be capable of when they’re finally released to the mass market. When that time will come – and indeed which of these features will end up in the final offering – remains a mystery at this early stage in development.",
    "In any case, the glasses are “coming along nicely,” according to Andrew Bosworth. Maybe Facebook’s plans to crack this notoriously problematic technology are more fact than fantasy, after all."
  ],
  "headers": {
    "4": "They might incorporate facial recognition technology",
    "9": "They could come with a wristband",
    "13": "… and haptic gloves"
  },
  "links": {
    "recent post": "https://tech.fb.com/inside-facebook-reality-labs-the-next-era-of-human-computer-interaction/",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "blog post": "https://tech.fb.com/inside-facebook-reality-labs-the-next-era-of-human-computer-interaction/"
  }
}