{
  "source": "https://www.techradar.com/news/disney-plus-next-big-movie-is-indiana-jones-meets-pirates-of-the-caribbean",
  "title": "Disney Plus' next big movie is Indiana Jones meets Pirates of the Caribbean",
  "category": "entertainment",
  "updated": "2021-05-28T13:34:55Z",
  "author": "tom-power",
  "summary": "Jungle Cruise sails onto Disney Plus this summer",
  "article": [
    "This year's summer movie release window is set to be a busy one for Disney. The legendary studio has a number of big hitters arriving in the next few months, including the delayed Black Widow movie and new Pixar film Luca.",
    "One flick that Disney hopes won't fall under the radar, though, is Jungle Cruise. The action-adventure movie, which stars Emily Blunt and Dwayne Johnson, simultaneously arrives in theaters and on Disney Plus (via Premier Access, for an extra fee) in late July - and a new trailer has been released ahead of its official launch.",
    "Based on the river boat ride at four Disney theme parks (yes, you read that right), Jungle Cruise stars Blunt as Doctor Lily Houghton, a scientist searching for the legendary Tree of Life in the early 20th century.",
    "Charting course for its location alongside riverboat man Frank (Johnson) and her younger brother McGregor (Jack Whitehall), Lily must stay one step ahead of a competing German expedition led by Prince Joachim (Breaking Bad's Jesse Plemons) to find the tree and unlock its supposed healing powers.",
    "Check out the film's new trailer below:",
    "Probably not. Based on the footage so far, Jungle Cruise looks like standard fare for Disney, and it'll likely be more appealing to parents who want to entertain the kids for a couple of hours during the summer holidays.",
    "You may be wondering why, then it isn't a Disney Plus exclusive. Luca, Pixar's next original movie, is only launching on the studio's streaming platform. If Disney doesn't expect Luca to pull in the required figures at the box office, why is Jungle Cruise viewed differently?",
    "For one, Jungle Cruise's cast is full of big names. The star power of Johnson and Blunt, in particular, should draw in audiences at theaters across the globe. With the likes of Whitehall, Plemons and Paul Giamatti backing up the movie's leads, Disney would expect it to do well at the global box office based on who is in it.",
    "Jungle Cruise's aesthetic might entice nostalgic movie fans to view it, too. It has the look and feel of an Indiana Jones or Pirates of the Caribbean film, and those series are still wildly popular among many people to this day. Tapping into that nostalgia seems like the perfect way for Disney to lure punters to watch Jungle Cruise, even though it won't get near to the box office hauls of each property, which stands at $1.98 billion and $4.54 billion respectively.",
    "It seems, then, that Jungle Cruise's all-star cast and nostalgic slant are the reasons behind its dual theatrical-Disney Plus release. It remains to be seen how well it'll do on Disney's streaming platform (it's a Premier Access title, after all) but Disney must have high hopes that it'll perform when it lands later this year.",
    "Jungle Cruise is due to be released worldwide on July 30."
  ],
  "headers": {
    "5": "Analysis: does Jungle Cruise need a simultaneous theatrical and Disney Plus release?"
  },
  "links": {
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Luca": "https://www.techradar.com/news/pixars-next-movie-is-taking-a-summer-vacation-to-the-charming-italian-coast"
  }
}