{
  "source": "https://www.techradar.com/news/pokemon-diamond-and-pearl-remakes",
  "title": "Pokémon Diamond and Pearl remakes release date, trailer, news and more",
  "category": "gaming",
  "updated": "2021-10-27T18:24:52Z",
  "author": "rhys-wood",
  "summary": "Will these Pokémon Diamond and Pearl remakes shine?",
  "article": [
    "The Pokémon Diamond and Pearl remakes are due to release in November 2021 under the new titles of Pokémon Brilliant Diamond and Pokémon Shining Pearl. The upcoming games are the fourth set in Pokémon’s long-running remake line, following Pokémon FireRed and LeafGreen (2004), Pokémon HeartGold and SoulSilver (2010) and, most recently, Pokémon Omega Ruby and Alpha Sapphire (2014).",
    "Pokémon Brilliant Diamond and Shining Pearl will be recreations of the original fourth generation releases, Diamond and Pearl, taking players back to a revamped Sinnoh region. The usual format of catching and training Pokémon to work your way through the region’s gyms applies as it always has up to that point and beyond.",
    "Pokémon Brilliant Diamond and Shining Pearl were first announced during the February 2021 Pokémon Presents showcase video, part of the wider Pokémon 25th anniversary celebrations, alongside Pokémon Legends Arceus, a prequel set in the Hisui (which will eventually become Sinnoh) region that will release worldwide on January 28, 2022.",
    "Excited about Pokémon Brilliant Diamond and Shining Pearl and want to know more? Read on to find out everything we know about the upcoming Pokémon remakes.",
    "Pokémon Brilliant Diamond and Shining Pearl will release on November 19, 2021 for Nintendo Switch.",
    "Before that, on November 5, 2021, Pokémon fans will be able to purchase a special edition Nintendo Switch Lite that bears the designs of Dialga and Palkia, which are Diamond and Pearl's flagship legendary Pokémon.",
    "Pre-orders for the console are currently available in the UK where it’s priced at £199.99 for the console on its own while a package that includes either Brilliant Diamond or Shining Pearl is priced at £249.99.",
    "Team Galactic October trailer",
    "In a trailer released in October 2021, we get a better look at the villains of Brilliant Diamond and Shining Pearl, Team Galactic, as well as the Gym Leaders Candice and Volkner. The trailer also confirms bonuses for players who pick up the game early: a “Platinum Style Outfit” and an egg for the Pokémon Manaphy. These have to be redeemed by February 21. Take a look for yourself below:",
    "September 28, 2021 trailer This trailer showcases some new features for Pokémon Brilliant Diamond and Shining Pearl, including the brand new Pokétch, an in-game digital watch that looks to be a one-stop access point for all the most useful shortcuts, including using HM moves and checking on your party. It's even got a step counter like Pokémon Heart Gold / Soul Silver's physical Pokéwalker.",
    "Poffins are also returning. These cute snacks could be made and used to enhance your Pokémon's stats. Here, it looks a lot like the curry cooking minigame from Pokémon Sword and Shield, and cooking with your Pokémon can apparently result in the creation of high-level Poffins.",
    "Official trailer Pokémon Brilliant Diamond and Shining Pearl were first shown off during the February 2021 Pokémon Presents showcase, announced alongside a trailer demonstrating the game’s art style and gameplay primarily.",
    "The game’s aesthetic in the overworld very much mimics that of the original Nintendo DS release, with deformed “chibi” style characters navigating basic 3D environments. Things change in battle, though, as characters take on more realistic proportions alongside the full-sized Pokémon models.",
    "As such, the Pokémon Diamond and Pearl remakes look to be quite faithful to the originals, albeit with a high-definition 3D overhaul to the graphics while throwing in some fairly impressive lighting effects. Some cinematic battle animations were also shown off in the trailer, and look to be at least somewhat of an improvement over Pokémon Sword and Shield’s efforts, where the animations were criticized for being reused and underwhelming for the first HD mainline Pokémon title.",
    "If you played the original Pokémon Diamond and Pearl games on Nintendo DS, then you should know what to expect in terms of gameplay. The core Pokémon series gameplay appears to be largely unchanged, maintaining exploration of the overworld, turn-based combat and a focus on catching as many Pokémon as you can to fill out your Pokédex as an extra completionist objective.",
    "Based on recent previews of the game, Brilliant Diamond and Shining Pearl look like they're going to be fairly faithful, if slightly safe, remakes that bring forth a lot of nostalgia. The updated art style makes for a cuter, more cosy game but it seems like the core experience will be familiar for those that loved the originals.",
    "It seems the aim of the Pokémon Diamond and Pearl remakes is a fairly faithful recreation but with some much-needed quality of life improvements. Indeed, improvements from newer releases like auto-save, character customization, improvements to HMs and being able to access your Pokémon Box from anywhere have all been noted. More contentiously, EXP Share will also be present in the remakes but it appears players won't be able to turn it off (as in Sword and Shield) which isn't likely to please everyone.",
    "Of course, not everything is identical. There have been some changes to the Underground tunnels, which proved popular in the original releases for eschewing Pokémon battling and catching entirely for a more casual resource gathering affair. It also let players create Secret Bases, a customizable home away from home, of sorts. Known as the Grand Underground, this area has been updated with a new addition called \"Hideaways\" which add a whole new dimension with support for online play and new opportunities to catch Pokémon in different biomes.",
    "Contests have also been slightly revamped to make them more interesting, with more cutomization and a new rhythm game element.",
    "Grand Underground, Secret Bases confirmed The Grand Underground and Secret Base features are returning in the Pokémon Brilliant Diamond and Shining Pearl remakes. The former is a sprawling underground dungeon, featuring rooms filled with Pokémon to catch.",
    "The latter acts as your home away from home, and can be customized with furniture, statues and more.",
    "Tying into this is a brand new feature to the remakes known as Pokémon Hideaways. These special rooms contain Pokémon based on the statues you've placed in your Secret Base. In addition, unique Pokémon may spawn here that you won't be able to catch anywhere else.",
    "Character customization Something missing from the previous remakes, Pokémon Omega Ruby and Alpha Sapphire, was the ability to alter your trainer's appearance that debuted to a warm reception in Pokémon X and Y.",
    "Thankfully, the feature is returning in Pokémon Brilliant Diamond and Shining Pearl, where players will be able to dress up their trainers to their liking.",
    "Pokéball customization Another feature that's being expanded upon is the ability to customize your Pokéballs with stickers, emblems and more. This time, your unique Pokéballs will also be able to make an entrance with various flashy effects based on the designs you affix to them.",
    "Mega Evolutions could return The biggest rumor doing the rounds currently for Pokémon Brilliant Diamond and Shining Pearl is the potential inclusion of Mega Evolutions. These were first introduced in Pokémon X and Y on the Nintendo 3DS, and allows certain Pokémon to temporarily transform into super-powered versions of themselves.",
    "Mega Evolutions have often been criticized for trivializing the already low difficulty of recent Pokémon games, as the stats of Mega-evolved forms can typically weather the toughest of attacks, even when the move used against them is super effective. If Pokémon Brilliant Diamond and Shining Pearl do feature Mega Evolutions, we hope the feature is handled with care and a greater focus on balancing them properly.",
    "Pokémon Platinum content included? Speculation from fans also seems to indicate that content from Pokémon Platinum - the more feature-complete follow-up to Diamond and Pearl - will be present in the remakes. This is largely evidenced by a character that appears in the Pokémon Brilliant Diamond and Shining Pearl trailer that was added in the Platinum follow-up, as pointed out on Twitter.",
    "If Pokémon Platinum content is indeed present, then, that would mean a number of extra features will make it into Pokémon Brilliant Diamond and Shining Pearl, including the minigame-centric Wi-Fi Plaza (which we imagine will be renamed in the remake) and the aforementioned Battle Frontier."
  ],
  "headers": {
    "4": "Pokémon Diamond and Pearl remakes: cut to the chase"
  },
  "links": {
    "Pokémon Legends Arceus": "https://www.techradar.com/news/pokemon-legends-arceus-trailer-release-date-news",
    "special edition Nintendo Switch Lite": "https://www.techradar.com/news/pokemon-legends-arceus-release-date-confirmed-alongside-special-edition-switch-lite",
    "console on its own": "https://www.awin1.com/awclick.php?awinmid=12777&awinaffid=103504&clickref=trd-us-6806068209724976000&p=https%3A%2F%2Fstore.nintendo.co.uk%2Fen_gb%2Fnintendo-switch-lite-pokemon-dialga-and-palkia-edition-000000000010007815.html",
    "package that includes either Brilliant Diamond or Shining Pearl": "https://www.awin1.com/awclick.php?awinmid=12777&awinaffid=103504&clickref=trd-us-9644169678405755000&p=https%3A%2F%2Fstore.nintendo.co.uk%2Fen_gb%2Fnintendo-switch-lite-pokemon-dialga-and-palkia-edition-pokemon-shining-pearl-pack-B00126.html",
    "inclusion of Mega Evolutions": "https://gamerant.com/rumor-pokemon-brilliant-diamond-shining-pearl-might-mega-evolutions/"
  }
}