{
  "source": "https://www.techradar.com/news/parler-hosting-companys-code-offered-up-for-sale-online",
  "title": "Parler hosting company's code offered up for sale online",
  "category": "computing",
  "updated": "2021-06-03T10:24:28.017Z",
  "author": "mayank-sharma",
  "summary": "However experts doubt legitimacy of the information",
  "article": [
    "The source code and database of DDoS-Guard, the web hosting platform of the controversial social media company Parler has apparently been posted for sale online.",
    "Amazon Web Services (AWS), the original hosting provider for the beleaguered social network, pulled the plug earlier this year over apparent insufficiencies in Parler's content moderation policy.",
    "Parler then found refuge with the Russia-based hosting provider DDoS-Guard, but researchers from cyber-intelligence company Group-B have uncovered a cybercrime forum listing offering DDoS-Guard’s database and the entire source code for its infrastructure for $350,000.",
    "According to the post, the database supposedly contains information about DDoS-Guard’s customers, including their names, IP-addresses, and payment information. However, Group-IB has said that it can’t verify the authenticity of the data, since the poster hasn’t provided a sample.",
    "“If the data is legitimate, the threat actors can potentially use it in a number of ways: from mass spamming and follow up targeted phishing attacks,” said Group-IB’s threat intelligence analyst, Oleg Dyorov, speaking to CyberScoop, adding that the data could perhaps even be used to conduct ransomware attacks.",
    "If the data is indeed authenticated, it’d be ironic given DDoS-Guard’s flirtations with the law.",
    "Adrianus Warmenhoven, chief information security officer at Dutch cybersecurity firm Tesorion, told CyberScoop that DDoS-Guard is one of those hosting companies that are adept at staying “just at the edges of the law.”",
    "In its earlier report on online piracy, Group-IB too had observed that DDoS-Guard not just hosts but also obstructs the identification of website owners of hundreds of shady resources that are engaged in illicit goods sale, gambling, and copyright infringements.",
    "Via CyberScoop"
  ],
  "headers": {
    "3": "Poetic justice"
  },
  "links": {
    "database": "https://www.techradar.com/best/best-database-software",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Parler": "https://www.techradar.com/news/parler-returns-to-the-app-store",
    "AWS": "https://www.techradar.com/news/aws",
    "pulled the plug": "https://www.techradar.com/news/aws-suspends-web-hosting-for-controversial-parler-app",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "": "https://www.group-ib.com/resources/threat-research/black-jack.html",
    "CyberScoop": "https://www.cyberscoop.com/ddos-guard-parler-exploit-in-bulletproof-hosting/"
  }
}