{
  "source": "https://www.techradar.com/news/aquaman-2-release-date-cast-and-what-else-we-know-about-dcs-return-to-atlantis",
  "title": "Aquaman 2: release date, cast and what else we know about DC's return to Atlantis",
  "category": "entertainment",
  "updated": "2021-05-02T12:00:51.847Z",
  "author": "richard-edwards",
  "summary": "Arthur Curry is back to rule the deep blue sea in December 2022",
  "article": [
    "The first film made such a splash that Aquaman 2 soon became inevitable.",
    "That’s because the highest-grossing movie ever based on a DC Comics character doesn’t belong to any of the famous trinity of Batman, Superman or Wonder Woman. Instead, the Jason Momoa-starring, James Wan-directed Aquaman beat them all – the new king of Atlantis was also crowned DC’s king of the box office.",
    "It’s something of a sea-change for a character who’d traditionally been the butt of the joke in comic-book circles – in everything from Family Guy to the fake James Cameron movie in Entourage. But thanks to Momoa’s wise-cracking performance, a makeover inspired by DC’s New 52 reboot, and The Conjuring/Fast & Furious 7 director James Wan’s instinct for underwater spectacle, he’s now one of the DC Extended Universe’s MVPs – this is one franchise that isn’t going to be sleeping with the fishes any time soon.",
    "So as the hotly anticipated sequel gears up for production in summer 2021, we dive into the intel that’s already washed ashore – everything from the Aquaman 2's release date and cast, to what it all means for the story. However it all turns out, Aquaman 2 is sure to make waves…",
    "The first Aquaman hit cinemas in December 2018, and came out on top in a month that also included the releases of Mary Poppins Returns, Spider-Man: Into the Spider-Verse and Bumblebee. It’s not much of a surprise, then, that Warner Bros has targeted another December debut for its sequel, with the Aquaman 2 release date currently set for December 16, 2022 – almost exactly four years after the first movie’s release.",
    "It looks like production on Aquaman 2 will get underway in the UK later this year – that’s what Dolph Lundgren (who plays King Nereus) told the Wizard World Virtual Experience (via ScreenRant), anyway. “I may be doing Aquaman 2 this summer, shooting in London,” the Rocky IV, He-Man and Punisher star told his assembled fans.",
    "The first movie shot on Australia’s Gold Coast, so the UK will be a major relocation – though seeing as all the underwater scenes were filmed ‘dry-for-wet‘ in a studio, with actors supported by sophisticated harnesses, it shouldn’t make much difference to the look of the film.",
    "Unlike Warner Bros’ 2021 releases, it looks like Aquaman 2 won’t be released on streaming service HBO Max at the same time it hits theaters. According to Deadline, Warner has struck a deal with cinema distributors to launch its 2022 release slate exclusively on the big screen – though the window of theatrical exclusivity will be cut back to a mere 45 days, so you won’t have to wait that much longer to watch the movie at home on your TV.",
    "With production yet to get under way, it’s a little early for DC and Warner to be unveiling any footage from the movie. The first Aquaman teaser debuted at San Diego Comic-Con 2018, and – assuming the smaller Comic-Con Special Edition goes ahead as planned over Thanksgiving weekend – it’s possible that we’ll see some kind of Aquaman 2 trailer there, especially as Warner/DC have a history of big Hall H reveals.",
    "That said, DC has just announced that its digital FanDome event will return in 2021 on October 16. Last year, that's where The Batman's trailer was first revealed – so it's more likely we'll see Aquaman there this year, since the event is specifically geared for a global audience.",
    "Here are the confirmed cast members for Aquaman 2 based on what we know so far, though you can expect this list to grow as we learn more about the movie:",
    "It’s no surprise that Jason Momoa is returning to play Arthur Curry/Aquaman for the fourth time (after Aquaman, Justice League and a very brief cameo in Batman v Superman: Dawn of Justice). And despite (seemingly unfounded) rumors that Amber Heard wasn’t going to be back as Xebelian princess (and daughter of Nereus) Mera, the actor posted an image of herself reading a book on her Instagram feed – along with a #gettingakindleforaquaman2 hashtag.",
    "With Arthur Curry having shown mercy to his scheming half-brother Orm (aka the self-styled Ocean Master) at the end of the first movie, James Wan regular Patrick Wilson has seemingly confirmed he’s part of the Aquaman 2 cast in an Instagram post about his training routine.",
    "And it looks like there’ll be someone on hand to keep the squabbling siblings in check, with Nicole Kidman rumored (via We Got This Covered) to be back as their mother, Atlantis’s Queen Atlanna. While it’s yet to be confirmed officially, we suspect this also means a return for Temuera Morrison (soon to be seen as the title character in The Book of Boba Fett) as Arthur’s dad, Thomas Curry – after all, with Atlanna and Thomas reunited after decades apart, it would be cruel not to let them rekindle a romance that brought two worlds together.",
    "There’s no word yet on whether Willem Dafoe will return as Arthur’s Atlantean mentor, Vulko, but it seems a safe bet, if only to help keep the new king of Atlantis on the straight and narrow.",
    "Meanwhile, Watchmen star Yahya Abdul-Mateen II confirmed to Uproxx that he’ll be back to represent the surface dwellers as the owner of one of the most iconic helmets in comic books, the revenge-obsessed Black Manta. Chances are we’ll also be seeing more from Randall Park (recently seen starring as Jimmy Woo in Marvel’s WandaVision) as marine biologist-turned-Atlantis expert Dr Stephen Shin, seeing as the two joined forces during Aquaman’s end credits sting.",
    "And given Pilou Asbæk’s history as a bad guy in Game of Thrones, we think it’s likely his role in the Aquaman 2 cast (reported by Deadline) will skew more to the dark side than the light.",
    "Now that DC is less hung up than it used to be about creating an interweaving, MCU-style shared universe for its superheroes, the most we know for certain about the Aquaman 2 plot is that the movie’s being scripted by David Leslie Johnson-McGoldrick. The writer previously worked with director James Wan on two The Conjuring movies and the first Aquaman.",
    "“I think the second one is a little bit more serious, a little bit more relevant in the world we are living in today,” Wan teased at DC’s virtual FanDome event in August 2020 (via Deadline). “I think that’s where it wants to go.”",
    "He expanded slightly when Patrick Wilson suggested he’d prefer to see Aquaman 2 exploring uncharted waters. “I can definitely guarantee you new worlds in this next one,” replied Wan, “and I think you’re going to be very excited as an actor.”",
    "What does all this mean for Arthur Curry now that he’s donned Aquaman’s classic gold and green armor, got his hands on the Trident of Atlan, and taken his place on the throne of Atlantis? While he and the water-manipulating Mera were seemingly an item by the end of the first movie, Hollywood convention and the needs of storytelling dictate it probably won’t be plain sailing this time out.",
    "Indeed, past form suggests Orm won’t make life easy for his half-brother – though Wilson’s aforementioned Instagram post may have muddied the waters slightly with a cryptic #brothersdontshakehandsbrothersgottahug. Could a familial reconciliation be on the cards?",
    "David Hyde, aka Black Manta, seems primed for a promotion to lead villain in Aquaman 2. Blaming Arthur Curry for the death of his father during a skirmish on a submarine in the first movie, Black Manta has become obsessed with having his revenge on the Aquaman. And having survived their previous encounter by the skin of his teeth – even when armed with superpowered Atlantean weapons – he’s unlikely to give up until Arthur Curry is dead.",
    "Chances are that Black Manta will be assisted in his mission by Dr Shin, a character who’s made the journey to the screen from DC Comics’ New 52 Aquaman reboot. The Aquaman end credits sequence showed the duo making a deal – if Shin helps Black Manta find Aquaman, Black Manta will give him concrete evidence on the existence of Atlantis.",
    "Unfortunately, Black Manta’s mission to dish out revenge may be bad news for Thomas Curry – if he decides that justices is best served by murdering the father of the man he believes killed his own dad.",
    "And don’t be surprised if Aquaman 2 also makes a return trip to the Trench, the dark, scary region of the ocean whose monstrous inhabitants kept Atlanna prisoner in Aquaman – especially now that the proposed The Trench movie spin-off has been dropped by Warner Bros (as reported by Variety)."
  ],
  "headers": {
    "4": "Aquaman 2 release date: December 2022",
    "8": "Aquaman 2 trailer: when will we see it?",
    "10": "Aquaman 2 cast: who’s in the movie",
    "17": "Aquaman 2 plot: what’s in store for Atlantis?"
  },
  "links": {
    "ScreenRant": "https://screenrant.com/aquaman-2-movie-filming-schedule-updates-dolph-lundgren/",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Deadline": "https://deadline.com/2020/08/aquaman-2-is-more-serious-and-relevant-dc-fandome-1203020862/",
    "Comic-Con Special Edition": "https://www.comic-con.org/cci",
    "Instagram": "https://www.instagram.com/p/CN2kfFEFPv_/",
    "We Got This Covered": "https://wegotthiscovered.com/movies/patrick-wilson-nicole-kidman-return-aquaman-2/",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "Uproxx": "https://uproxx.com/tv/yahya-abdul-mateen-interview-watchmen-hbo-aquaman-2-candyman/",
    "WandaVision": "https://www.techradar.com/news/wandavision-season-2-what-we-know-after-the-finale",
    "Variety": "https://variety.com/2021/film/news/dc-film-new-gods-the-trench-ava-duvernay-james-wan-1234942862/"
  }
}