{
  "source": "https://www.techradar.com/news/microsoft-could-copy-apple-with-bespoke-surface-laptop-processor",
  "title": "Microsoft could copy Apple with bespoke Surface laptop processor",
  "category": "computing",
  "updated": "2021-10-18T11:29:09Z",
  "author": "rhys-wood",
  "summary": "Could Microsoft give Apple something to think about?",
  "article": [
    "Recent rumors have suggested that Microsoft could be working on its own bespoke silicon for its portable Surface devices. If true, the tech giant could be following in the footsteps of Apple in creating a processor tailor-made for its own hardware.",
    "As reported by HotHardware, a Microsoft job listing shows that the company is looking to hire a Director of SoC (system on a chip) Architecture for its Surface division. And while this on its own isn't concrete proof that we'll see Microsoft-made silicon come to future Surface hardware, another piece of evidence suggests it may well be the case.",
    "Twitter user Tron points to Clien, a Korean website that suggests AMD is working with Microsoft to produce bespoke silicon for its Surface devices. While it's not quite the leap taken by Apple – who will now use its own silicon across all devices, parting ways with Intel in the process – it would be a shakeup for Microsoft especially as a new generations of Surface devices roll out.",
    "A move to bespoke silicon would be a substantial move on Microsoft's part. It would mean that, like Apple, the tech giant is able to produce its own processors specifically tailored to its Surface products.",
    "It also wouldn't be the first time the Microsoft has partnered with AMD on its hardware. The tech specialist previously worked with Microsoft to bring custom AMD Zen 2 CPU and RDNA 2 GPU to the Xbox Series X and Xbox Series S consoles. Suffice to say, Microsoft and AMD likely have a strong working relationship, and we wouldn't at all be surprised if the pair chose to work together again.",
    "The move could also represent something of a fresh start for Microsoft when it comes to specs. The company recently launched Windows 11, and it would make sense to produce its own silicon tailor-made to take full advantage of the new operating system."
  ],
  "headers": {
    "3": "Analysis: What does a bespoke processor mean for Surface?"
  },
  "links": {
    "Surface": "https://www.techradar.com/news/mobile-computing/tablets/windows-8-tablets-release-date-specs-and-prices-916134",
    "Apple": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "HotHardware": "https://hothardware.com/news/microsoft-exploring-in-house-silicon-design",
    "Clien": "https://www.clien.net/service/board/park/16536544",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Windows 11": "https://www.techradar.com/reviews/windows-11"
  }
}