{
  "source": "https://www.techradar.com/news/nintendo-switch-2",
  "title": "Nintendo Switch Pro: everything we know about the long-rumored 4K Switch",
  "category": "gaming",
  "updated": "2021-10-12T14:57:23Z",
  "author": "vic-hood",
  "summary": "Will we ever get a Nintendo Switch Pro?",
  "article": [
    "Even though a Nintendo Switch Pro never came to be, rumors of a 4K Switch refuse to go away. The Japanese company recently announced the Nintendo Switch OLED, a pleasing upgrade over the original console that comes with a bigger screen, a redesigned kickstand, more internal storage, better speakers, and a striking OLED display.",
    "But when it comes to power, the Nintendo Switch OLED is exactly the same as the original Nintendo Switch released in March 2017. The console displays at 1080p when docked, and 720p in handheld mode.",
    "That news came as a disappointment to many, as the release of the PS5 and Xbox Series X has only served to highlight the performance gap between Nintendo's console which is approaching its fifth anniversary.",
    "4K TVs are now the standard in many homes, too, which makes the Switch's 1080p output look noticeable soft on most 4K displays.",
    "Demand for a Nintendo Switch Pro is certainly there, then, but will we ever see a 4K Switch? And could existing hardware hold hints of what's to come? Here's everything you need to know about Nintendo's elusive 4K console.",
    "The Nintendo Switch Pro was rumored to launch instead of the Nintendo Switch OLED, which landed on October 8, 2021. Now, though, the existence of a Pro console has come into question, as the Nintendo Switch OLED includes many of the leaked specs that were supposed to be included in the Switch Pro.",
    "Bloomberg predicted a Nintendo Switch Pro console would have a release date around September or October this year, which surprised many at the time. Instead, that release date belongs to the OLED model; however, a release date of March 2022 was hinted at, which could still come to be if Nintendo did announce a Nintendo Switch Pro shortly after.",
    "Obviously redesigns cost money, and redesigns with improved hardware doubly so. The Nintendo Switch Pro, with its updated and more powerful hardware, will almost definitely cost more than the current Switch's £279 / $299 / AU$449 pricing.",
    "The Nintendo Switch OLED is already a more premium model and launched at $349.99 / £309 / AU$539. Thankfully this isn't a huge step up from the original Switch's asking price and is less than the $399 price tag that was predicted by some. For comparison, the PS4 Pro was $100 more than the PS4.",
    "As a family-focused company, we'd be surprised if the Nintendo Switch Pro came in at the same price as PS5 and Xbox Series X, $499 / £449 / $AU749, but it will be more expensive than the Nintendo Switch OLED nonetheless.",
    "Nintendo Switch OLED holds 4K secrets",
    "As the Switch OLED has launched, some of the changes from previous consoles have started up speculation that 4K capability could be hidden right under our noses. For one, the console ships with an HDMI 2.0 cable – instead of the 1.4 standard used by the regular Switch – which should enable 4K passthrough from the dock, or even HDR.",
    "The Switch OLED dock, contains a Realtek chip that could be 4K capable, and which is new to this console – though it could be tied to other features like improved audio or Ethernet capability instead. While this isn't a 4K console just yet, it's possible that the dock could be used in some minimal upscaling capacity down the line, or for a 4K Switch Pro when it eventually launches.",
    "Nintendo denies the existence of Nintendo Switch Pro after new reports Bloomberg has once again reported that a Nintendo Switch Pro is indeed real, and has claimed that 11 different game studios had access to an official development kit that featured 4K support.",
    "The console was apparently shelved due to supply issues caused by the ongoing global semiconductor shortage, though it could still be released.",
    "Nintendo, however, has moved swiftly to deny these claims. In a post on Twitter, Nintendo said that Bloomberg's report \"falsely claims that Nintendo is supply tools to drive game developers for a Nintendo Switch with 4K support\", the company went on to say \"we have no plans for any new model other than Nintendo Switch OLED Model\".",
    "A Nintendo Switch Pro could still be in the works According to Tokyo-based analyst Serkan Toto, a Nintendo Switch Pro could still happen. Toto has suggested that the Switch OLED might be a \"dummy upgrade\" before a real upgrade arrives next year.",
    "Speaking to Bloomberg, Toto said: \"This new Switch looks more like an interim model than a real upgrade to me,\" Toto told Bloomberg. \"This might just be a dummy upgrade until Breath Of The Wild 2 is ready and the component shortage is over next year.\"",
    "The Nintendo Switch OLED has been announced The Nintendo Switch OLED (which was supposed to be the Nintendo Switch Pro) has been announced by Nintendo. In an announcement trailer posted to the official Nintendo YouTube channel, we got our first glimpse of the hardware improvements that are coming.",
    "Obviously, the display will be enhanced and take advantage of OLED technology to deliver an amazing picture with vivid colors and impressive contrast. The Switch OLED's screen will also be slightly bigger (7-inches as opposed to 6.2-inches) and the internal sound system is getting a boost. If you like downloading games you'll be able to take advantage of 64GB of internal storage, and those who like gaming online can use the new Nintendo Switch dock's Ethernet port which is built in.",
    "The Nintendo Switch OLED does not support 4K gaming while docked as was expected of the rumored Nintendo Switch Pro, and outputs at 720p in handheld mode.",
    "Dataminer strikes gold? A data miner known as SciresM has claimed (via Wccftech) that they have found reference to a new Nintendo Switch model within the Switch’s latest firmware update, codenamed 'Aula'.",
    "Reportedly, this hardware uses the same chip as the Nintendo Switch Lite and 2019 Switch model, the Mariko (Tegra X1+) SoC. However, SciresM also claims that there are references to support for a Realtek chip which is a “4K UHD multimedia SoC”.",
    "Rather than being within the Switch tablet, they think that it “might be inside a new dock and not inside the tablet, though, there’s no way to tell from the firmware code yet.” They also say that the tablet itself will have an improved OLED screen, though what resolution it’ll offer is still unclear. The claims of some kind of 4K support do line up with the many other reports from the past year which claim that an upgraded Switch capable of 4K is on the horizon.",
    "Of course, there’s been no confirmation from Nintendo itself that a new Switch is on the cards and, in fact, Doug Bowser has made comments very recently that suggest there might not be for some time. With that in mind, we're still taking this with a pinch of salt.",
    "Nintendo Switch outsells PS5 and Xbox Series X Perhaps Nintendo was right not to worry about the launch of the next-generation consoles from Sony and Microsoft. It has been revealed that in the launch month of the PS5 and Xbox Series X, Nintendo’s Switch family of consoles has stayed on top in the US in terms of console sales.",
    "According to analytics film NPD Group the Switch and Switch Lite garnered a total 1.35 million sales in the US alone throughout November. In fact, the report also says that Nintendo’s hardware is selling even more in 2020 than the previous year – around half a million units more, to a total of 6.92 million – despite now being three years into its lifecycle. We don’t actually have firm numbers for sales of the PS5 and Xbox Series X yet, but the former console is estimated to have sold around 2 million units worldwide across its two November launch dates, with stock drying up soon after.",
    "The story isn’t the same across the world – it’s worth noting that the PS5 did outsell the Switch in the UK. Regardless, it shows that the Switch’s momentum does not seem to be slowing even in the face of new and more powerful 4K consoles. What this means for a prospective more powerful Nintendo Switch Pro remains to be seen. Nintendo clearly doesn't really need a new console right now with those sales but launched at the right time it could propel the Switch to even greater heights.",
    "Standalone Joy-Con patent A newly discovered patent (via VGC) suggests that some standalone Joy-Con controllers have been considered by Nintendo.",
    "A newly-discovered Nintendo patent suggests that the company may be planning to release a new form of Joy-Con style controller.",
    "Originally filed in May 2018 and registered in April 2020, the patent shows a controller that’s highly similar in shape and layout to the existing Joy-Con found on the original Switch. However, it is slightly updated and rather than being designed to slide onto a screen like the current Joy-Con, this controller appears to be a standalone device, with no rails for sliding in sight.",
    "While there isn’t much need for standalone Joy-Con on the original Switch, they could be useful with the more recent Nintendo Switch Lite, which has its controls permanently attached, as it would allow for easier multiplayer gaming. Given the recent rumors around the Nintendo Switch Pro, though, it’s also worth considering that the standalone Joy-Con has been designed with this new console in mind.",
    "Rumors of a mini-LED display Something slightly different from the 4K rumors we've been used to when it comes to the Nintendo Switch Pro; we may see a mini-LED display replace the current LCD screen. According to a report from Taiwan’s Economic Daily News, the still-rumored Switch Pro model could sport mini-LED screens supplied by Innolux, a well-known manufacturer in the field.",
    "The current Switch and Switch Lite consoles use an HD (720p) LCD screen. If a new Switch console did have 4K capability, we imagine it'd be in docked mode, with handheld mode offering a slightly-boosted Full HD (1080p) display. Upgrading to a mini-LED display would make all of those pixels look better than before as mini-LED displays use thousands of tiny individually-controlled backlights in the glass substrate of the panel to offer a wider contrast ratio, better brightness control, deeper blacks and richer colors. It could even mean thinner and lighter product designs. There are rumors that 2021 will bring an iPad Pro 12.9 which utilizes mini-LED technology, too, so it could be a technology that's on the rise.",
    "Devs are reportedly being told to get 4K-ready A recent report by Bloomberg has alleged that Nintendo is asking developers to make their Nintendo Switch games 4K-ready, adding weight to previous rumors that Nintendo has a resolution upgrade up its sleeve with a 4K-ready upgraded Switch console.",
    "Bloomberg's report most notably corresponds with a recent reports from the Economic Daily News, which cited various hardware manufacturers responsible for the Switch’s flash storage and Joy-Con controllers, and claimed that a more powerful Nintendo Switch console with upgraded interactivity and improved display quality could go into production in 2021.",
    "Utilizing Nintendo Switch features In the 80th Annual General Meeting of Shareholders (via VideoGamer), Nintendo stated that future consoles will harness the the Switch's unique elements and experience.",
    "\"Our current generation game system, Nintendo Switch, has entered its fourth year since launch, but its momentum is increasing,\" Nintendo president Shuntaro Furukawa said. \"We believe there are two factors behind this. First is the existence of two hardware configurations with different characteristics, in Nintendo Switch and Nintendo Switch Lite. The second factor is that Nintendo’s development resources are concentrated on developing content for a single platform, Nintendo Switch. We want to extend the life cycle of Nintendo Switch while maximising such advantages.",
    "\"From the perspective of playing with the image displayed on a TV, we believe that because consumers can play Nintendo Switch on a TV or the game console screen itself, it has greatly increased the opportunities for gameplay in various scenes in their lives, compared to previous consoles,\" Furukawa continued. \"Through Nintendo Switch, we’ve made many discoveries about where a dedicated video game platform can fit into a consumer’s daily life. We see scenes on social media of children and their families sitting around a game console to play, which gives us a renewed sense of the value of our dedicated video game platform. We will utilise these experiences in carefully considering the form our future game consoles will take.\"",
    "Codenames Dataminers have been coursing through Nintendo's firmware version 10.0.0 for information on new Switch consoles and have apparently identified codenames for the upcoming devices.",
    "According to JershJopstin on Resetera, there are five identified codenames for Nintendo Switch models: Icosa, Copper, Hoag, Iowa, and Calcio. Here's a breakdown of what we know about their codenames so far (thanks TweakTown):",
    "While Iow, Hoag and Icosa have already released, Copper and Calcio have not been confirmed to be in development.",
    "According to JershJopstin, Copper appears to be a non-mobile device due to its lack of battery and charging services, and the HDMI services it appears to have which would typically be handled by a Switch docking station.",
    "Meanwhile, according to another rumor, Calcio will apparently be a docked-only, more traditional console.",
    "In addition, JershJopstin has suggested that this Calcio console could be digital-only due to its apparent lack of support for game cards and new naming form factor.",
    "However these rumors should be treated with a healthy dose of skepticism until we get confirmation from Nintendo.",
    "Possible dual-screen A dataminer has dug into the new Nintendo Switch version 10.00 firmware and found hints that it adds preliminary support for a new Switch model, - nx-abcd -, one with a secondary display, possibly a dual-screen like the Nintendo DS. This is the same dataminer who previously uncovered that Nintendo was working on a revised model – which turned out to be longer battery-life Switch – from firmware version 9.0.0. However, this should still be treated with skepticism.",
    "This is a different form factor from the Switch codenames we've seen before, with Resetera user suggesting we may see a different type of Switch device altogether – not handheld or docked.",
    "Nintendo isn't worried about the next console generation 2020 wasn't the year of a new Nintendo Switch console, but it was the year that Sony and Microsoft launch the next generation of consoles: the PS5 and Xbox Series X. Nintendo, however, isn't worried about catching up.",
    "Talking to investors during a Japanese Q&A (via VGC), Nintendo's president Shuntaro Furukawa said that while the gaming landscape will change, the company doesn't think the release of these next-gen consoles will have a big impact on its own fortunes.",
    "“We do not believe that the business trends of other companies will have a significant impact on our business,” Furukawa told investors, explaining that the reason Nintendo is so confident that the PS5 and Xbox Series X won't pose huge competition is because the Nintendo Switch targets a different audience.",
    "While this doesn't tell us a whole lot about any specific new console plans Nintendo has, it does suggest that the company isn't feeling any great hurry or pressure from its supposed competitors to release, or even announce, a Nintendo Switch Pro in the immediate future.",
    "AR and VR support VR and AR support for the Switch never looked likely, with the MD of Nintendo France citing a lack of mainstream appeal for the technology back in 2018, but the Labo VR Kit shows Nintendo has changed its mind about the viability of VR.",
    "The Switch doesn't have the high resolution of most VR gaming rigs, so we could see an advanced model with 2K or 4K resolution to improve those close-up VR experiences. However, given the VR Kit is still focused mainly on children, we'd be surprised to see a visual overhaul simply for this one peripheral.",
    "What about 3D? Another Nintendo patent came to light in early 2019: this time for a 3D sensor array that sits above your television, and creates a stereoscopic image in a similar way to the 3DS, meaning you wouldn't even need glasses.",
    "3D visuals felt like a passing gimmick even with Nintendo's handheld consoles – and the defunct Microsoft Kinect camera will no doubt keep it wary of unnecessary TV peripherals. But getting convincing 3D imaging on standard 2D TVs may the step needed to bring 3D gaming mainstream.",
    "Could it support 4K? While Sony and Microsoft push at the 4K market, there isn’t really any big reason for Nintendo, the company that staunchly sets itself apart from other hardware producers, to follow suit.",
    "In the same interview where he dismissed VR, Nintendo France General Manager Philippe Lavoué also brushed off 4K saying that the technology has “not been adopted by the majority” and it would, therefore, be too early for Nintendo to jump in.",
    "Nintendo didn’t enter the HD console market until 2012 when it released the Wii U. This was around four years after Sony and Microsoft and at the point when more than 75% of US households actually had HD displays in their home.",
    "Miyamoto however has said he wished Nintendo had done the jump to HD sooner than this, saying that the display technology became popular around three years before Nintendo expected it to. It's expected that by 2020, 50% of US households will have adopted 4K technology and it might be at this point that Nintendo decides to join the 4K fray, rather than waiting until the 75% market saturation of before."
  ],
  "headers": {
    "5": "Nintendo Switch Pro: cut to the chase"
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "could existing hardware hold hints of what's to come": "https://www.techradar.com/news/the-nintendo-switch-oled-is-harbouring-a-4k-secret-and-we-want-answers",
    "PS4 Pro": "https://www.techradar.com/news/gaming/consoles/ps4-pro-deals-1328247",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "could be hidden right under our noses": "https://www.techradar.com/news/the-nintendo-switch-oled-is-harbouring-a-4k-secret-and-we-want-answers",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2020-09-09/nintendo-said-to-boost-switch-production-by-another-20",
    "post on Twitter": "https://twitter.com/NintendoCoLtd/status/1443366443374899205",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Wccftech": "https://wccftech.com/nintendo-switch-new-revision-aula-4k/",
    "revealed": "https://www.techradar.com/news/somehow-nintendo-switch-outsold-the-ps5-and-xbox-series-x-in-their-launch-month",
    "VGC": "https://www.videogameschronicle.com/news/nintendo-says-it-isnt-concerned-about-ps5-and-xbox-series-x-launches/",
    "mini-LED display": "https://www.techradar.com/news/nintendo-switch-pro-could-sport-a-mini-led-display-heres-why-that-matters",
    "Economic Daily News": "https://udn.com/news/story/7253/4804253",
    "rumors": "https://www.techradar.com/news/next-gen-ipad-pro-129-with-mini-led-screen-might-be-delayed-and-thats-a-good-thing",
    "VideoGamer": "https://www.videogamer.com/news/nintendos-next-console-will-utilise-the-unique-elements-of-the-switch",
    "JershJopstin": "https://www.resetera.com/members/jershjopstin.4549/",
    "Resetera": "https://www.resetera.com/threads/rumor-nintendo-switch-firmware-10-0-0-adds-preliminary-support-for-a-new-hardware-model-nx-abcd.184806/",
    "TweakTown": "https://www.tweaktown.com/news/71818/nintendo-switch-may-get-dedicated-vr-ar-mixed-reality-headset/index.html",
    "isn't worried": "https://www.techradar.com/news/nintendo-isnt-worried-about-ps5-and-xbox-series-x-and-it-doesnt-need-to-be",
    "Japanese Q&A": "https://www.nintendo.co.jp/ir/pdf/2020/200202.pdf",
    "MD of Nintendo France": "http://www.nintendolife.com/news/2018/01/nintendo_reiterates_that_its_not_interested_in_virtual_reality_or_4k_support",
    "Labo VR Kit": "https://www.techradar.com/news/nintendo-wants-you-to-dive-face-first-into-its-labo-with-new-vr-kit",
    "3D sensor array": "https://www.techradar.com/news/nintendo-switch-3d-feature-a-possibility-with-new-patent-filing",
    "interview": "https://www.lesnumeriques.com/loisirs/switch-retrogaming-super-mario-zelda-l-incroyable-come-back-nintendo-a3491.html",
    "Miyamoto": "http://nintendotoday.com/miyamoto-on-hd-wii/",
    "expected that by 2020": "http://4k.com/news/4k-tv-sales-to-surpass-100-million-units-by-2018-5948/"
  }
}