{
  "source": "https://www.techradar.com/news/the-new-technics-turntable-looks-gorgeous-but-there-are-better-options-for-beginners",
  "title": "The new Technics turntable looks gorgeous, but there are better options for beginners",
  "category": "audio-visual",
  "updated": "2021-09-07T14:11:33Z",
  "author": "olivia-tambini",
  "summary": "The Technics SL-1210g comes with a slick black finish",
  "article": [
    "Technics has lifted the lid on its latest record player – and it looks very nice indeed. The Technics SL-1210G continues the iconic SL-1200 range of turntables that started in the seventies, and comes with a slick, black finish that will appeal to minimalists.",
    "Under the hood, the new turntable is actually exactly the same as its predecessor, the SL-1200G, which we saw at CES way back in 2016.",
    "The SL-1200G was an intoxicating mix of the old and the new, which honored the original design of the brand's well-known turntables while replacing the direct-drive system with a new coreless direct-drive motor that's powered by a twin rotor.",
    "That motor is designed to create a stable rotation, free from cogging – or in layman's terms, it should prevent the stuttering effect of a slowly rotating turntable, which could degrade the quality of the sound.",
    "Alongside that, you've got a highly sensitive tonearm, a three-layer platter for high levels of dampening, and silicone-rubber insulators to prevent unwanted vibrations from ruining your music.",
    "For all that, you're looking at a £3,499 (about $4,800 / AU$6,500) price tag. But should you ever spend that much on a turntable?",
    "Turntables can cost anything from $50 / £50 to well over $2,000 / £2,000, and we're not to see a record player with a price tag at the high end of that scale from a respected brand like Technics.",
    "If you want the best audio performance possible, and you have some money to spare, there's nothing wrong with splashing your cash on a high-end turntable like the Technics SL-1210G or our current favorite, the Pro-Ject Debut Carbon Evo (which is admittedly, far cheaper).",
    "However, it's important to know that you absolutely don't have to if you're on a stricter budget.",
    "If you're a turntable novice, you're better off looking at the specs of different record players rather than blindly buying the most premium model – after all, investing in vinyl is a bit of a commitment, and you don't want to spend all your money on a hobby that might not last.",
    "One essential spec to look out for it how well-damped a record player is. Different manufacturers will use different motor configurations and materials to stop vibrations from degrading the audio quality of your vinyl – look for turntables that sit on rubber feet, plinths made from strong materials, and third-party platforms that give your device a really even surface to sit on.",
    "Belt-driven turntables are usually far quieter and offer higher fidelity than direct drive models, as direct drive turntables have a motor that is directly connected to the platter.",
    "You'll also need to know whether your new turntable comes with a phono stage built-in – otherwise, you'll need to buy an external amplifier, which could become pricey.",
    "If you’re just starting out, you probably don’t need to be fooling around with a complex turntable with an adjustable vertical tracking angle, anti-skate and azimuth (though if you do like that kind of thing, check out our guide on how to set up a record player for all the info you need).",
    "You may even want a turntable that connects to your speaker wirelessly over Bluetooth – these models are super convenient and mean that you don't need loads of cables snaking around your home.",
    "One of our favorite record players for beginners is the Audio-Technica AT-LP120XBT-USB – and funnily enough, it owes more than a little to the Technics SL1200/SL1210 where aesthetics are concerned.",
    "But as well as all the DJ-friendly features (like pitch control and super-responsive direct drive motor), this Audio-Technica turntable has an integrated, switchable phono stage, a USB output and wireless aptX Bluetooth connectivity. All of which makes it a fair bit more adaptable than your average record player.",
    "It’s very nearly a plug’n’play arrangement, making it perfect for beginners. All you need to do when it first comes out of the box is put the aluminum platter on, fix the cartridge to the tonearm and the hinges to the dust-cover, and you’re good to go.",
    "Another good model for newbies is the Fluance RT81, which has a built-in phono premap, a simple setup, and a great audio performance. Both of these models lack the kind of detail that higher-end turntables can eke out of your vinyl, but their simplicity makes them super convenient to use.",
    "Another good model for newbies is the Fluance RT81, which has a built-in phono preamp, a simple setup, and a great audio performance. Both of these models lack the kind of detail that higher-end turntables can eke out of your vinyl, but their simplicity makes them super convenient to use.",
    "There are also budget models from brands like Victrola that are worth considering. These popular retro turntables are widely available on Amazon, and come in a range of styles, prices, and configurations to suit any vinyl enthusiast – and some are even portable, bringing some much needed convenience to the timeless form factor.",
    "We haven't tried them for ourselves, but the specs and customer reviews suggests that they could be good options for vinyl beginners.",
    "As they come with built-in speakers and wireless connectivity, they’ll be easy to set up, and you won’t need to mess around balancing the tonearm or tracking down an external preamp.",
    "Of course, you could always just blow your bank balance on a Technics classic. We won't judge you."
  ],
  "headers": {
    "6": "Save your money if you're a vinyl novice",
    "15": "What's the best record player for beginners?"
  },
  "links": {
    "record player": "https://www.techradar.com/news/best-turntables",
    "turntables": "https://www.techradar.com/news/best-turntables",
    "way back in 2016": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/turntables/technics-sl-1200g-1312363/review",
    "Pro-Ject Debut Carbon Evo": "https://www.techradar.com/reviews/pro-ject-carbon-debut-evo",
    "how to set up a record player": "https://www.techradar.com/how-to/how-to-set-up-a-turntable",
    "Audio-Technica AT-LP120XBT-USB": "https://www.techradar.com/reviews/audio-technica-at-lp120xbt-usb",
    "Fluance RT81": "https://www.techradar.com/reviews/fluance-rt81-turntable",
    "brands like Victrola": "https://www.techradar.com/news/should-i-buy-a-victrola-record-player-this-prime-day"
  }
}