{
  "source": "https://www.techradar.com/news/remembering-expansion-packs",
  "title": "Remembering our favorite expansion packs",
  "category": "computing",
  "updated": "2021-08-30T18:00:56Z",
  "author": "daryl-baxter",
  "summary": "Expanding horizons",
  "article": [
    "Back in the 90s, the internet was mainly used to communicate with groups through forums and IRC, with the rare multiplayer match on certain FPS games thanks to dial-up connections for the internet.",
    "The idea of using the internet to download extra content for a PC game or even movie was thought to be something that was only possible in Star Trek. But nowadays we can buy and download extra content as we please through different outlets, whether that's new characters in a fighting game, new cars in a racing game, or just new dances for Fortnite.",
    "But there was once a time where you would have to buy an additional disk in order to play extra levels for a game, or even a standalone game that would add onto the original story. These were once called expansion packs, and in today’s age these would simply be DLC, or part of a Season Pass.",
    "For PC Gaming Week, we wanted to highlight five of the best expansion packs from the mid to late 90s of what you could buy for your PC.",
    "In November 1999, one year after the release of the original Half Life was its first expansion pack, set at the same time as the original, but told from the perspective of US Marine Adrian Shepard. It made the distinction in playing as one of the bad guys here, but your main objective was to run through Black Mesa and defeat the hordes of Xen aliens across twelve levels, before meeting the infamous G-Man.",
    "There’s plenty of new weapons for you to try out, from the Sniper Rifle to a Combat Knife, all ready to be used against the enemies you’ll face. Having been developed by Gearbox instead of Valve this time, it gave the player a different aspect into how the story was told from a perspective other than Gordan Freeman, the series’ main protagonist.",
    "Opposing Force was able to give depth to the story of Half Life and the Black Mesa facility without feeling as though it intruded on the original story. You can still buy the expansion pack from Steam right now, and it’s still a fun ride even in 4K resolution, but it would be great to see an unofficial remake to it, similar to Black Mesa.",
    "Each of the first four Tomb Raider games had the fortune of having an expansion pack roughly a year after a main entry would be released. However, while TR: Unfinished Business and TR2: Golden Mask were fun tropes and needed the original game to be played, Lost Artifact was able to be played on its own, without requiring the base game.",
    "The expansion was released in March 2000 and extends the story of the third Tomb Raider game, released in November 1998, where there’s a fifth Infada artifact, the collection of McGuffins that Lara had to collect across the globe.",
    "Instead of Egypt and Pyramids, you were presented with Scotland and a Castle, taking you to the home of the antagonist, Willard and seeing where the fifth artifact was located. Across six levels you’re brought to a rematch with a previous boss, Sophia Leigh, and you collect the Hand of Rathmore, wrapping up Croft’s third adventure nicely.",
    "It was a fun expansion pack that further extended the story of Tomb Raider III. While the original game was known to be very difficult in places, here it was far more refined, with locations not seen in a Tomb Raider game before, making this new and fresh.",
    "There was no additional music by the original composer, Nathan McCree, who left the franchise in 1998 – though he told us that if given the chance, he would have gladly composed more music for the expansion’s four settings across the United Kingdom if circumstances had worked out.",
    "But there’s also the fact that none of these expansions can currently be bought on the storefronts of today. Steam, GOG, Epic Games and more don’t have these for sale, and with it being the 25th anniversary of Tomb Raider this year, to be able to play expansions that were only available on disk would be a great way to celebrate the original trilogy.",
    "One of two expansion packs to come out for the highly praised Quake II, this was released in May 1998, just five months after the release of Quake II, but developed by Xatrix Entertainment Inc instead of iD Software.",
    "Featuring eighteen new single-player levels and six new multiplayer levels for deathmatch, this was a substantial expansion, and that’s even before we talk about the new weapons, music, and enemies.",
    "This was an expansion focused on what made Quake II work so well - its level design, the enemies, and the different weapons you would discover across the areas. There’s even one level that features low gravity, not seen since a bonus level in the original Quake game, where it's up to your wits to keep up with a multitude of enemies while you’re flying around in an area.",
    "While subsequent expansions were released, The Reckoning was more positively received thanks to its wide-ranging level design, new weapons and the six new music tracks.",
    "It’s available on Steam but does require the full game of Quake II in order to play.",
    "LucasArts were on a roll back in the 90s, with many Star Wars games that are still fondly remembered. However, it was the Dark Forces series that really defined how a third-person game in the Star Wars world could be played, and when it came to the sequel, Dark Forces II: Jedi Knight, you could finally play as a Jedi in a 3D environment.",
    "This sequel was a roaring success, and an expansion pack soon followed, but instead of playing as Kyle Katarn, you were instead playing as a character from the novels, called Mara Jade, Luke Skywalker’s wife.",
    "Set five years after the events of Dark Forces II, you take control of Mara Jade as Katarn goes missing, leading you on a quest across fourteen levels.",
    "But what made this expansion unique was how there were also improvements to the game’s engine. More detailed lighting across the levels was implemented here, while in-game cutscenes replaced the cinematics of Dark Forces II.",
    "It’s only in recent years that a hidden level was discovered in this expansion, where you would control Luke Skywalker in Bespin, taking you into the climatic third act of Empire Strikes Back.",
    "While Mysteries of the Sith is available on Steam and GOG, the expansion pack still holds up today, which makes us wonder if a remake or a sequel to Dark Forces could be something that Disney and LucasFilm Games are currently looking at.",
    "The original game surprised many when it was released back in September 2000, with a first person shooter focus on Star Trek Voyager, a series that aired between 1995 and 2001. You would take on enemies of Starfleet like the Borg and the Klingons, and it was generally well received.",
    "But the expansion pack, released in February 2001 did something different to what other expansion packs did at the time. Instead of a new campaign, or new weapons, it added a Tour mode which allowed you to browse the full ship of Voyager, and even take part in some hologram missions.",
    "Coupled with five new multiplayer modes ready to play alongside Jeri Ryan’s voice for Seven of Nine being featured, it was a different expansion pack. But it offered Trekkies something that hadn’t been done before in a Star Trek game - a fully interactive, first-person experience of exploring one of the ships which you could fully interact with.",
    "While the full game and the expansion pack is currently unavailable on modern storefronts and platforms, you can play the original on PlayStation 2 thanks to a port made by Pipe Dream Interactive, released in August 2002."
  ],
  "headers": {
    "4": "Half Life: Opposing Force",
    "7": "Tomb Raider 3: Lost Artifact",
    "13": "Quake II Mission Pack: The Reckoning",
    "18": "Jedi Knight: Mysteries of the Sith",
    "24": "Star Trek Elite Force: Expansion Pack"
  },
  "links": {
    "PC game": "https://www.techradar.com/news/best-pc-games",
    "PC Gaming Week": "https://www.techradar.com/news/welcome-to-techradars-pc-gaming-week-2021",
    "from Steam": "https://store.steampowered.com/app/50/HalfLife_Opposing_Force/",
    "Black Mesa": "https://store.steampowered.com/app/362890/Black_Mesa/",
    "Steam": "https://store.steampowered.com/app/32390/STAR_WARS_Jedi_Knight__Mysteries_of_the_Sith/",
    "GOG": "https://www.gog.com/game/star_wars_jedi_knight_dark_forces_ii?pp=d965a463ac183af4828302b14522bb3371cec49f"
  }
}