{
  "source": "https://www.techradar.com/news/mcu-merchandise-may-contain-spoilers-but-why-look-for-them",
  "title": "MCU toys may contain movie spoilers – but let's stop looking for them",
  "category": "entertainment",
  "updated": "2021-07-03T15:00:00Z",
  "author": "tom-power",
  "summary": "Alright, Marvel, keep your secrets",
  "article": [
    "Another week of Marvel speculation has come and gone – and, as always, there have been lots of rumors for the MCU’s ravenous fanbase to pour over.",
    "While fans (us included) spent the early part of the week theorizing where Loki’s Disney Plus TV series will go in its final episodes, more recent speculation has focused on two specific upcoming Marvel productions.",
    "Spider-Man: No Way Home and Marvel’s What If…? TV show are the latest subjects of official Marvel merchandise reveals and leaks. It’ll come as no surprise to learn, then, that MCU fans have run the rule over each property’s tie-in products to glean any clues about plot points and other secrets.",
    "It’s about time, though, that we stopped spoiling upcoming Marvel movies and TV shows for ourselves.",
    "Fans are bound to speculate about a movie universe that’s as popular as the MCU is. It’s fun to theorize about what characters may be introduced, based on Easter eggs within its movies and TV shows, or using the comics to hypothesize where the MCU could go next.",
    "It becomes a problem, though, when we start reading way too much into every minute detail in official merchandise, whether it’s a full reveal from Marvel or through leaked images.",
    "Take the Spider-Man: No Way Home Lego sets that were posted on the Danish toy company’s website on Thursday, July 1, for instance.",
    "We already know that Doctor Strange will have a supporting role in No Way Home – it’s been reported as much by outlets including The Hollywood Reporter – so his presence in one Lego set won't come as a shock.",
    "The major issue, however, lies in fans combing the film's Lego sets for any crumb of evidence that may point towards plot specifics for Spider-Man’s third MCU outing.",
    "At the time of writing, one Reddit thread has over 600 comments about what the Sanctum Workshop Lego set could tease about the upcoming movie.",
    "The webslinger’s new suit, why Doctor Strange is wearing the Eye of Agamotto despite the Time Stone being destroyed in Avengers: Endgame, and what Peter Parker and MJ are doing in the Sanctum Santorum have all been discussed at length, and speculation seems set to continue well into the weekend.",
    "Fans have been pouring over other No Way Home toys recently, too. Marvel revealed more No Way Home tie-in merchandise on its official website on Friday, July 2, and fans jumped on what these might tell us about the film as well.",
    "Again, at the time of writing, another Reddit thread has over 500 comments that theorize what a Funko Pop figure of Spider-Man’s new costume – the Integrated Suit, which you can see in the bottom left of the image below – means for the character’s next outing and potential new superpowers he may acquire.",
    "No Way Home isn’t the only Marvel production that’s been heavily speculated about. The studio’s animated series What If…? has been spoiled by various toy leaks ahead of its potential August release on Disney Plus.",
    "From Funko Pop figures that reveal alternate versions of Doctor Strange and Gamora, to Lego set leaks that show off an updated version of Steve Rogers’ Hydra Stomper mech and Robert Downey Jr’s supposed return as Iron Man, What If…? hasn’t been immune from fans wanting to learn more about the TV show before it officially airs.",
    "Marvel leaks are, and will continue to be, a common occurrence, especially where merchandise is concerned. Toys and other tie-in products have to be manufactured months in advance so that they’re available to buy online or in-store when a new MCU movie or TV show arrives.",
    "Why, though, do we feel the need to ruin a film or TV series’ plot, character reveals or other spoilers by obsessively looking over every piece of merchandise?",
    "It takes the enjoyment, or element of surprise, away from watching an MCU’s movie plot or character reveals happening on the screen in real time. It seems that we’ve forgotten about that aspect of going to theaters and taking in movies with no prior knowledge of them.",
    "It’s not as if some products will give much (if anything) away, too. Spider-Man: No Way Home’s Sanctum Workshop Lego set may be a movie tie-in toy, but it doesn’t appear to be an explicit scene from the film.",
    "You only have to take one look at the arachnid-like monster that comes as part of the set and realize that No Way Home shouldn’t have such a creature (although, given its Multiverse vibes, who knows?). In my view, it’s highly unlikely that this Lego set offers up anything in the way of No Way Home spoilers, save for Spidey’s updated suit.",
    "A quick look at the 51 available (or coming soon) Lego sets on the company’s official website proves that the Danish toymaker doesn’t just make products that directly tie into specific movie scenes either, so there’s no major correlation between Lego sets and Marvel movie spoilers that we can glean from these collaborations.",
    "It’s unsurprising, really, why Marvel movie and TV show trailers are so vague with their plots, or the amount of footage revealed, when leaks and speculation are so rife.",
    "Some fans were left underwhelmed by the first Marvel’s Eternals trailer that dropped in May. Others, too, are growing increasingly agitated that we haven’t received a No Way Home teaser yet, despite this movie’s release date drawing ever closer.",
    "Why, then, should we be shocked or even confused by the vagueness of Marvel trailer footage, or their release dates, when we’re collectively losing our minds over fan theories, rampant speculation and wild rumors? Can we not just look at a No Way Home Lego set or Funko Pop, think “that’s very cool” and wait to be surprised by the movie’s big reveals in theaters instead?",
    "I get it, it’s difficult – nay, sometimes impossible – to avoid the conjecture around Marvel movies and TV shows. As someone who covers them extensively, I know it’s very easy to fall down the rabbit hole and find yourself caught in a web of endless speculation and rumors.",
    "Honestly, though, I long for the days when MCU productions weren’t spoiled before they’re released.",
    "I remember watching a Marvel Studios panel, from 2010’s San Diego Comic Con, on YouTube and beaming from ear to ear as Samuel L. Jackson revealed the official line-up for 2012’s Avengers Assemble. It felt like a watershed moment for the MCU; not only because it was the first time that these Marvel superheroes had teamed up on screen before, but because of the unparalleled success that’s followed for the MCU since.",
    "Those tentpole moments, though, don’t feel as special these days. Sure, Marvel may surprise us with unexpected news – Blade and the Fantastic Four in the MCU, anyone? – but, by and large, elements of Marvel movie and TV show reveals are worked out by fans long before they come to the big and small screens, and it takes the enjoyment away from these big announcements.",
    "We can’t prevent the leaks from happening, particularly those that are captured on set. What we can do, though, is stop ourselves from ruining Marvel productions, by searching for tenuous clues in their merchandise lines, before we watch them – and now is as good a time as any to do so."
  ],
  "headers": {
    "4": "No way back from MCU spoilers",
    "15": "What if… we stopped reading into every Marvel merchandise leak or reveal?"
  },
  "links": {
    "theorizing": "https://www.techradar.com/news/loki-episode-4-post-credits-scene-explained",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/benedict-cumberbatch-joins-spider-man-3-as-doctor-strange-exclusive-4069491/",
    "Reddit thread": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/oc7gns/spiderman_no_way_home_first_look_at_brandnew/",
    "official website": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-6393670928312241000&murl=https%3A%2F%2Fwww.lego.com%2Fen-gb%2Fthemes%2Fmarvel",
    "alternate versions": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/obrvku/new_what_if_funko_pop_common_set_leaked/",
    "Steve Rogers’ Hydra Stomper mech": "https://www.instagram.com/p/CQyYjKNpMUy/?utm_source=ig_web_copy_link",
    "supposed return as Iron Man": "https://www.instagram.com/p/CPo727Zpda6/?utm_source=ig_embed",
    "underwhelmed": "https://www.reddit.com/r/marvelstudios/comments/nkr8ga/eternals_trailer_looks_garbage/",
    "increasingly agitated": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/np6w3j/spiderman_no_way_home_trailer_date_speculation/"
  }
}