{
  "source": "https://www.techradar.com/news/wraith-the-oblivion-afterlife-puts-you-into-a-horror-movie-and-is-the-best-vr-scare-yet",
  "title": "Wraith: The Oblivion - Afterlife puts you into a horror movie – and is the best VR scare yet",
  "category": "gaming",
  "updated": "2021-04-24T12:00:00Z",
  "author": "hamish-hector",
  "summary": "Great story-driven horror in VR",
  "article": [
    "Virtual reality adds a heightened level of fear to horror experiences that other media just can’t match. You’re no longer watching the action play out on a screen from the safety of your living room instead, you’re caught up in the nightmare yourself. Wraith: The Oblivion - Afterlife takes everything VR has to offer and delivers a fantastically creepy survival horror adventure.",
    "Wraith: The Oblivion - Afterlife has you play as Ed Miller, a deceased photographer who has returned to discover the truth behind his death at Barclay Mansion. Using your new powers as a Wraith, a creature caught between life and death, you’re forced to explore the manor all while steering clear of the monsters that also roam the halls.",
    "This latest entry in the World of Darkness franchise lives up to what’s expected from the series but is still accessible to anyone who’s new to what it has to offer. If you like getting spooked, and own an Oculus headset, Wraith: The Oblivion - Afterlife is absolutely a game you’ll want to download this weekend.",
    "Barclay Mansion is the ultimate haunted house. Wraith: The Oblivion - Afterlife establishes the building’s grand scale from the main menu (by having you stand outside the imposing exterior as you start up the game) but still manages to create these moments of claustrophobia as you work through the manor’s labyrinth of halls and corridors.",
    "This combination gives you the feeling of being trapped, despite escape being as easy as just slipping off the headset. This constant sense of dread is heightened further by the general atmosphere Wraith: The Oblivion - Afterlife creates with its audio and visual effects. It’s a game that doesn't need to rely on jump scares to make you fear turning around every corner (though there are still a few to ratchet up your heart rate).",
    "The ambience of Barclay Mansion isn’t all that you have to fear in Wraith: The Oblivion - Afterlife. Monsters known as Spectres wander the house like you, but they aren’t very friendly. You’ll want to keep out of sight by hiding behind furniture, in closets or by creating noise distractions using thrown objects.",
    "The Spectres create a true horror-film like experience, causing tense moments where you’ll instinctively hold your breath to stop them finding you. Throughout my time with Wraith: The Oblivion - Afterlife, the spectres were never not frightening.",
    "If none of that has managed to scare you away, then you’ll be ready for what Wraith: the Oblivion - Afterlife has in store for you. You can play it now on Oculus Quest and Rift headsets, and it will be available on Steam and PSVR later in 2021."
  ],
  "headers": {
    "3": "Spooks-galore"
  },
  "links": {
    "Oculus headset": "https://www.techradar.com/news/the-best-vr-headset"
  }
}