{
  "source": "https://www.techradar.com/news/leaked-pics-of-nvidias-own-rtx-3080-ti-could-disappoint-some",
  "title": "Leaked pics of Nvidia’s own RTX 3080 Ti could disappoint some",
  "category": "computing",
  "updated": "2021-05-29T14:00:16Z",
  "author": "darren-allan",
  "summary": "Design purportedly to stay the same as RTX 3080, prompting some cooling concerns",
  "article": [
    "Nvidia’s RTX 3080 Ti is hotly tipped to be unleashed imminently, and here we have (yet another) leak about the GPU, this time showing pics of what are claimed to be final images of the card.",
    "The images of the purported RTX 3080 Ti Founders Edition come courtesy of VideoCardz and they show a graphics card which is, well, identical to Nvidia’s vanilla RTX 3080 Founders Edition. In other words, it offers the same overall two-slot design, and two fans for cooling (one front, one rear), plus the 12-pin power connector (so you may need to use an adaptor, just as before).",
    "That’s kind of expected – as indeed the leaks of third-party RTX 3080 Ti graphics cards we’ve seen have shown mainly unchanged designs compared to the base RTX 3080 spins – but still, some folks might be disappointed at the seeming lack of any movement at all on the design front. And as VideoCardz points out, there may be a few concerns around cooling here.",
    "That’s because the RTX 3080 has a rated power consumption of 320W, yet the RTX 3080 Ti is believed to up this to 350W – the same level as the RTX 3090 – so the potential worry for gamers is how the new Founders Edition will cope with the additional power and heat, given that same card and cooler design.",
    "However, to be fair to Nvidia, its cooling solution worked very nicely with the RTX 3080, as we observed in our review. Still, with the performance of the RTX 3080 Ti rumored to be jacked up to very close to RTX 3090 levels, some concerns may still remain in this area…",
    "Nvidia’s RTX 3080 Ti is expected to be revealed alongside the 3070 Ti at Computex on May 31, with the graphics cards going on sale come June 3 and June 10 respectively, if the grapevine is correct with its predictions."
  ],
  "headers": {
    "4": "Cool runnings?"
  },
  "links": {
    "Nvidia’s RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "VideoCardz": "https://videocardz.com/newz/nvidia-geforce-rtx-3080-ti-founders-edition-pictured",
    "unchanged designs": "https://www.techradar.com/news/nvidia-rtx-3080-ti-spotted-as-rumors-about-imminent-gpu-pile-up",
    "RTX 3090": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3090-find-stock-here",
    "as we observed in our review": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "rumored to be jacked up": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-specs-have-leaked-and-you-wont-be-disappointed",
    "close to RTX 3090 levels": "https://www.techradar.com/news/nvidia-rtx-3080-ti-leak-suggests-gpu-could-be-as-fast-as-rtx-3090",
    "Nvidia’s RTX 3080 Ti is expected to be revealed": "https://www.techradar.com/news/maybe-nvidia-is-launching-the-rtx-3080-ti-at-computex-after-all",
    "3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "graphics cards going on sale come June 3 and June 10": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-again-rumored-for-early-june-launch-with-rtx-3070-ti-to-follow"
  }
}