{
  "source": "https://www.techradar.com/news/army-of-the-dead-on-netflix-is-zack-snyders-best-movie-yet",
  "title": "Army of the Dead on Netflix is Zack Snyder's best movie yet",
  "category": "entertainment",
  "updated": "2021-05-18T15:55:37Z",
  "author": "tom-power",
  "summary": "Zack Snyder's Army of the Dead is a joy from beginning to end",
  "article": [
    "Army of the Dead feels like a rebirth for Zack Snyder. With his DC superhero commitments firmly in the rear view mirror, the director’s first non-Warner Bros. movie in seven years is a significant moment for Snyder and his fanbase.",
    "There’s plenty riding on this week's Netflix zombie-themed heist movie, however. Snyder's passionate fans are eager to see what he’s conjured up in his post-DCEU world, while critical reception to some of his previous films has been hard to predict.",
    "How, then, does Army of the Dead stack up to the likes of Batman v Superman? Through its amusing and heartfelt character dynamics, topical subject matter, and reinvention of zombie movie tropes, Snyder’s latest movie is arguably his finest work yet. And yes, that’s including his cut of Justice League and the 2004 remake of George Romero’s Dawn of the Dead that originally made his name.",
    "Army of the Dead stars Dave Bautista as Scott Ward, a former zombie-stomping war hero who’s approached by casino owner Bly Tanaka (Hiroyuki Sanada) with a tantalizing offer.",
    "The proposal? Enter Las Vegas, retrieve $200 million from Tanaka’s casino vault and Ward will earn an eye popping $50 million cut. Las Vegas, though, is overrun with zombies following a mass outbreak, and the US government plans to level the city with a nuclear bomb in less than 32 hours. No pressure then.",
    "Believing this payday will help to repair his fractious relationship with daughter Kate (Ella Purnell), Ward agrees to help and assembles a crack team of experts including fellow ex-soldiers Vanderohe (Omari Hardwick) and Maria Cruz (Ana de la Reguera), safecracker Ludwig Dieter (Matthias Schweighöfer), helicopter pilot Marianna Peters (Tig Notaro) and a zombie expert known as The Coyote (Nora Arnezeder).",
    "However, when Kate and Tanaka’s head of security Martin (Garret Dillahunt) become last-minute additions with their own secret assignments, the plan goes awry. With Las Vegas’ undead hordes - led by an Alpha Zombie called Zeus (Richard Cetrone) - in hot pursuit and the government’s nuclear strike suddenly brought forward by 24 hours, survival, not money, becomes the group’s priority.",
    "Army of the Dead is instantly recognizable as a Snyder movie. Its opening credits montage, for one, is stylistically reminiscent of how his live-action take on Watchmen begins. It looks, feels and sounds like a Snyder production, with slow-motion shots and violent imagery accompanied by a humorously appropriate cover of Elvis Presley’s ‘Viva Las Vegas’. The movie’s opening salvo is a convenient and crowd-pleasing way of introducing the zombie outbreak, too.",
    "One of the main criticisms of Zack Snyder’s Justice League was the laborious two-hour set-up before the ‘real’ movie began. Army of the Dead foregoes this by efficiently introducing its characters through a recruitment montage overseen by Ward, which significantly reduces its runtime while showcasing their individual theft-based talents. It really is like Snyder's version of Suicide Squad.",
    "Army of the Dead does take 45 minutes to get to the actual heist, mind you, so some viewers may find these preceding scenes a little self-indulgent. Still, it beats the alternative of watching extensive character introductions that explain their backstories, which is what we got in Justice League.",
    "With the crew in place, Army of the Dead proceeds with the heist itself - and it’s here where the film really starts to shine.",
    "Thrown together by circumstance, Ward’s group is full of eclectic personalities, but it isn’t long before some unlikely friendships are forged. Ward and Kate’s dysfunctional relationship may be the driving force behind many of the movie’s emotional beats, but it’s the bond between Hardwick’s Vanderohe and Schweighöfer’s Dieter that ultimately steals the show. Their initially awkward rapport grows into a Lethal Weapon-esque bromance as the plot progresses, providing the film’s funniest moments in the process.",
    "Not everyone is a team player, though, and it’s when characters act alone that Zeus’ undead hordes have the upper hand.",
    "Army of the Dead retains the iconic fundamentals of the zombie genre (only headshots will kill them, for example), while taking inspiration from iconic zombie flicks, including Land of the Dead and Snyder’s Dawn of the Dead remake, to give its undead hordes an athleticism and intelligence to rival their human foes.",
    "Where Snyder’s breed of zombie differs from some of its predecessors, though, is that Zeus and his cohorts are emotionally engaging. Army of the Dead does a stellar job of ensuring viewers sympathize with the undead in certain instances and, ironically, makes them seem more human than Ward’s group of mercenaries.",
    "That said, Zeus’ forces are deadly when the action commences. Without spoiling anything major, and given the size of the film’s human cast, it isn’t a surprise that some characters don’t make it out alive.",
    "What is slightly disappointing, though, is that there’s no scope for Ward and company to mourn who they lose along the way. The frenetic pace of the movie’s action, particularly in the show-stopping sequence that goes down in the final 40 minutes, means that grieving those who perished is simply not possible for Ward’s crew.",
    "Sure, Army of the Dead’s finale wouldn’t flow, or be as thrilling, with multiple breaks in the action to mourn deceased characters. Glossing over them to quickly move onto the next set-piece, though, detracts from the dramatic weight of each one, and makes Ward’s gang feel like nothing more than cannon fodder.",
    "Overall, too, the action sequences feel like familiar fare for a zombie movie – save for its rip-roaring finale. Nonetheless, it still makes for entertaining and at-times suspenseful viewing.",
    "Action aside, Army of the Dead is also a thematically dense movie. Its presentation of timely topics, including misogyny and immigration camps, reflect current world events, while the film’s diverse cast is a great choice on Snyder’s part. Representation on these fronts is becoming a prerequisite within the movie industry, and one I’d like to see future Snyder productions explore, from a social commentary perspective or otherwise, in more detail.",
    "Army of the Dead is the shot in the arm that Zack Snyder’s career needs. It has the feel of a movie where the director has been given free rein to be as artistically creative as he likes, and Army of the Dead benefits from letting him play to his strengths.",
    "It isn’t perfect, granted. Some of the dialogue is a bit clunky, a bit more action wouldn’t have gone amiss for the run time and the first act is a bit too long for my liking.",
    "Army of the Dead, though, is a big improvement on Snyder’s recent grim superhero works and, once it gets going, its runtime flies by. That’s a testament to the tight, well-paced tale that Snyder has told. If this is the first bold step in a new chapter in his career, Army of the Dead could be Snyder’s most important movie yet.",
    "Army of the Dead launches exclusively on Netflix on Friday, May 21."
  ],
  "headers": {
    "3": "Day of the Dead",
    "10": "Deadly dynamics",
    "20": "What we think"
  },
  "links": {
    "Army of the Dead": "https://www.techradar.com/news/how-netflixs-army-of-the-dead-mirrors-george-romeros-zombie-movie-reinvention"
  }
}