{
  "source": "https://www.techradar.com/news/the-billie-eilish-echo-studio-is-cool-but-its-time-for-customizable-smart-speakers",
  "title": "The Billie Eilish Echo Studio is cool, but it's time for customizable smart speakers",
  "category": "audio-visual",
  "updated": "2021-09-23T10:01:56Z",
  "author": "olivia-tambini",
  "summary": "When Alexa falls asleep where does she go?",
  "article": [
    "Pop superstar Billie Eilish has been spotted in the Studio... no, not that Studio, we're talking about Amazon's biggest and best-sounding smart speaker.",
    "Ahead of its annual hardware event on September 28, the company has released a limited edition version of the Amazon Echo Studio with Billie Eilish's face plastered on the speaker's grille.",
    "Available to preorder now for $230 (about £170 / AU$315), the Happier Than Ever album-themed speaker will ship in October. That's a little pricier than the Echo Studio's original price, but we're sure die-hard Billie fans won't mind.",
    "If you're a little confused as to why Amazon would release the Billie-branded Echo Studio (and we don't blame you), it seems to be part of a marketing ploy to extol the benefits of the wireless speaker's spatial audio technology.",
    "In an Amazon statement, Eilish said: \"I can't wait for my cutie fans to be able to listen to my new album Happier Than Ever in spatial audio, available on Amazon Music Unlimited.\"",
    "If you're a Billie Eilish fan, we're sure the idea of an Echo Studio with her face plastered all over it is truly exciting - but it does leave everyone else out in the cold.",
    "Amazon is clearly capable of printing images onto its smart speakers, so why not take it one step further and allow customers to upload their own images and buy fully personalized Echo speakers? It would certainly set its Echo range apart from rivals like the Apple HomePod mini and the Google Nest lineup.",
    "You could even use a selfie, as if you'd taken the very essence of Alexa and put it into the empty shell of your own face - as demonstrated beautifully by TechRadar staff writer, Tom Bedford:",
    "We can see why the company would be hesitant, though. Unless it could monitor the kind of images people were uploading, there could be an influx of rude (and potentially very offensive) Echo speakers finding their way onto the internet. And that wouldn't be very good for the company's image at all.",
    "Still, there's no reason why Amazon couldn't take a small step towards customizable smart speakers. The current Echo range is only available in two colors: Glacier White, and Twilight Blue. We get that consistent branding has worked so far in helping Amazon to dominate the smart home market, but surely Alexa speakers are ubiquitous enough now for the company to have a little fun?",
    "After all, we know that Amazon isn't shy about playing with wacky designs; the Amazon Echo Dot Kids, suitable for children of three and upwards, is available in either a Panda or Tiger design that brings a cute look to the Echo Dot’s space-age spherical aesthetic.",
    "In fact, the company recently crowdfunded a limited edition Echo Dot, made in collaboration with fashion designer Diane Von Furstenburg, resulting in a smart speaker that might actually appeal to those who dare to splash a little color around their homes.",
    "There was an element of choice in this collaboration, too; customers were given a choice of three designs to preorder, with only the winning design (Midnight Kiss) being made.",
    "We'd love to see more designer-led collaborations like this in the future - as well as making more color and pattern options available for the regular Echo Dot, without the drawn out process of having to vote for different designs.",
    "Perhaps better customization for Echo speakers is something we'll see at the upcoming Amazon event. The company could even make its next Echos modular, with the ability to swap out the grille depending on your mood, the season, or simply to match your new cushions. For now though, it's Billie or bust."
  ],
  "headers": {
    "5": "More choice, please"
  },
  "links": {
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "annual hardware event on September 28": "https://www.techradar.com/news/the-next-batch-of-amazon-echo-devices-will-be-unveiled-on-september-28",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-show-10-review/reviews/amazon-echo-studio-review",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Echo speakers": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Apple HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Amazon Echo Dot Kids": "https://www.techradar.com/reviews/amazon-echo-dot-kids-review",
    "with fashion designer Diane Von Furstenburg": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0956GYV8K%3Fref%3Dods_aucc_lp_pr_pe%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1669581009232175400-20"
  }
}