{
  "source": "https://www.techradar.com/news/macos-monterey-support-is-bad-news-for-older-macbook-pro-and-air-models",
  "title": "macOS Monterey support is bad news for older MacBook Pro and Air models",
  "category": "computing",
  "updated": "2021-06-22T15:06:02Z",
  "author": "darren-allan",
  "summary": "Incoming macOS 12 will drop support for two years’ worth of Apple laptops",
  "article": [
    "Apple just revealed the latest version of macOS at WWDC, and also listed the Macs which will support Monterey – so for those wondering if they might be left out in the cold with macOS 12, here’s the full lowdown on whether or not you can grab it.",
    "The list of compatible Macs as detailed by Apple is as follows:",
    "If we compare that to the compatible machines for the current macOS 11 Big Sur, the most notable difference is in Apple’s mainstay laptops, the MacBook Air and MacBook Pro.",
    "Previously, MacBook Air models going back to 2013 were good with Big Sur, but now you need an Air from early 2015 – and the support goalposts have shifted in a similar way with the MacBook Pro, from late 2013 to early 2015.",
    "In other words, that represents a two-year leap when putting machines out in the cold, whereas Apple has only shifted forward a year with the 12-inch MacBook and iMac. Support remains unchanged with the Mac mini and Mac Pro with Monterey compared to Big Sur.",
    "At any rate, while owners of MacBook Pro and Air models from 2013 and 2014 might be out of luck when it comes to upgrading to macOS 12 Monterey, they can still continue with Big Sur for the time being with the OS receiving updates from Apple.",
    "Eventually, that update support road will run out – Apple usually supports a macOS release for three years, so probably in 2023 – and at that point, not being able to upgrade to a newer version of macOS obviously becomes more of a problem. In short, you’ve got a couple of years left where all you’ll be missing out on is the new features of Monterey (plus successors), and after that it’s definitely time to be eyeing up a hardware upgrade (if you weren’t already).",
    "Speaking of those new features, macOS 12, which will be out later this year (in the fall), introduces a raft of useful tricks for those who own multiple bits of Apple hardware. Such as, for example, Universal Control: the ability to have your MacBook and iPad next to each other and use the latter seamlessly with the laptop’s trackpad (being able to drag and drop files straight from the MacBook desktop to the tablet). As ever, Monterey is a free upgrade.",
    "Via Wccftech"
  ],
  "headers": {
    "5": "Big Sur updates"
  },
  "links": {
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "Monterey": "https://www.techradar.com/how-to/how-to-download-and-install-macos-12-monterey",
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "MacBook Air": "https://www.techradar.com/news/macbook-air-2021-release-date-news-and-rumors",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "raft of useful tricks": "https://www.techradar.com/news/macos-12",
    "Wccftech": "https://wccftech.com/these-are-the-macs-compatible-with-macos-monterey-list/"
  }
}