{
  "source": "https://www.techradar.com/news/google-pixel-buds-a-series-accidentally-revealed-in-official-tweet",
  "title": "Google Pixel Buds A-Series accidentally revealed in official tweet",
  "category": "audio-visual",
  "updated": "2021-05-04T23:08:37Z",
  "author": "david-lumb",
  "summary": "Google Pixel Buds A likely confirmed by Google itself",
  "article": [
    "The Google Pixel Buds A (or ‘A-Series’ as they’re named) may have been confirmed twice over by Google itself – first in a supposed tweet (already deleted) from an official account, as well as on its German site, adding more support to the possibility that a new, more affordable version of the true wireless earbuds are coming.",
    "The tweet came from the official @Android account, and was supposedly live for all of 10 minutes before it was summarily taken down. It refers to ‘The new Pixel Buds A-Series’ and mentions ‘one-tap Bluetooth pairing with the updated Fast Pair experience.’",
    "The tweet also shows an image of the Buds A-Series (as in the attached image above), which reveals true wireless earbuds and a recharging case that looks identical to the previous Google Pixel Buds (though in an all-white design with white trim). But aside from the look and the ‘Fast Pair’ feature, the tweet doesn’t show anything else about the new earbuds.",
    "This in itself is remarkable, but the Pixel Buds A-Series was also supposedly seen in a Google search – specifically, the name itself was mentioned in suggested results below the German Google store, according to German tech site Cashys Blog. While we couldn’t find the same, suggesting it could have been taken offline, it’s still a bit more official support for the Google earbuds.",
    "What little we’ve heard about the Google Pixel Buds A suggests they’ll look much like the Google Pixel Buds that launched last year, though they may have a lower price tag while retaining features like touch controls for adjusting music playback and accessing Google Assistant.",
    "We’d originally heard a rumor that the Buds A would launch in April, but as that date has come and gone, we’d expect them to be announced alongside the Google Pixel 5a during Google IO 2021, which runs from May 18-20, with a mid-2021 release date.",
    "Via Droid-Life"
  ],
  "headers": {
    "4": "Google Pixel Buds A: affordable true wireless earbuds?"
  },
  "links": {
    "Google Pixel Buds A": "https://www.techradar.com/news/google-pixel-buds-a",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "Droid-Life": "https://www.droid-life.com/2021/05/04/google-appears-to-have-confirmed-pixel-buds-a-series/"
  }
}