{
  "source": "https://www.techradar.com/news/bafta-2021-nominations-list-reveals-a-diverse-selection-of-film-nominees",
  "title": "BAFTA 2021 nominations list reveals a diverse selection of actors and movies",
  "category": "entertainment",
  "updated": "2021-03-09T16:17:39Z",
  "author": "tom-power",
  "summary": "Nomadland and Rocks lead the way",
  "article": [
    "The BAFTA 2021 nominations have been announced, and this year's list is possibly the most diverse in the award show's history.",
    "Nomadland and Rocks lead the way with seven nominations each, while other critically-acclaimed films including Minari, The Father, and Promising Young Woman find themselves up for six gongs.",
    "Rocks is perhaps the biggest surprise in terms of number of nominations as, outside of film festival ceremonies and the British Independent Film Awards, it hadn't received major award recognition. Sarah Garvon's British coming-of-age drama, though, will be looking to cause a few upsets on the night in categories including Best Director and Leading Actress.",
    "In a greater push for inclusion and diversity, this year's BAFTAs also sees 16 of the 24 nominated actors and actresses coming from ethnic minority groups. Bukky Bakray (Rocks) and Wunmi Mosaku (His House) are unexpected inclusions in the Leading Actress category, while Adarsh Gourav (The White Tiger) finds himself among celebrated actors including Sir Anthony Hopkins and the late Chadwick Boseman.",
    "Surprisingly, there are no places for actors such as Gary Oldman (Mank), Sacha Baron Cohen (The Trial of the Chicago 7), Carey Mulligan (Promising Young Woman), or Olivia Colman (The Father) on those lists. Their omissions, though, show the strength of nominee for this year's awards.",
    "The 2021 BAFTAs will take place virtually on Sunday, April 11 at the Royal Albert Hall in London. In the meantime, read on for a full list of the nominated films and those involved:"
  ],
  "headers": {
    "6": "Outstanding Contribution"
  },
  "links": {}
}