{
  "source": "https://www.techradar.com/news/resident-evil-village-rumored-to-be-middle-entry-in-a-resident-evil-trilogy",
  "title": "Resident Evil Village rumored to be middle entry in a Resident Evil trilogy",
  "category": "gaming",
  "updated": "2021-04-13T16:49:04Z",
  "author": "samuel-tolbert",
  "summary": "Two-thirds through the latest story arc?",
  "article": [
    "Resident Evil Village is nearly here, but ahead of its release we've heard how it might fit in the greater Resident Evil franchise as a whole. While Resident Evil Village is the eighth mainline game in the series (with VIII in the title highlighted, clearly referring to \"8\"), it's also rumored to be the second game in a trilogy.",
    "This rumor comes via Aesthetic Gamer aka Dusk Golem on Twitter, someone with access to information at Capcom and who has reliably shared info on Resident Evil Village in the past, since even before the game was announced.",
    "According to Dusk Golem, Resident Evil Village is meant to be the second game in a trilogy, as there are some things in Resident Evil 7: Biohazard that will make more sense after going through Resident Evil Village, as well as saying that this being a direct sequel was decided early in development.",
    "Much like Resident Evil 7: Biohazard, Resident Evil Village is a first-person horror game. It trades in the murky bayou for a mysterious village and castle, with the latter serving as the home of the explosively-popular Lady Dimitrescu and her daughters.",
    "Fans won't be waiting too much longer to see another look at Resident Evil Village, as Capcom is holding another Resident Evil showcase on April 15 with a brand-new trailer and other tidbits.",
    "Resident Evil Village is currently set to be available on May 7 for PS5, PS4, PC, Xbox Series X, Xbox Series S and Xbox One."
  ],
  "headers": {
    "3": "What lurks in the castle?"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Aesthetic Gamer aka Dusk Golem": "https://twitter.com/AestheticGamer1/status/1381077743853400064",
    "Resident Evil showcase": "https://www.techradar.com/news/new-resident-evil-village-gameplay-to-be-shown-at-showcase-next-week",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}