{
  "source": "https://www.techradar.com/news/heres-how-the-samsung-galaxy-z-fold-3s-new-display-cuts-battery-usage-by-25",
  "title": "Here's how the Samsung Galaxy Z Fold 3's new display cuts battery usage by 25%",
  "category": "phones",
  "updated": "2021-08-17T06:26:45Z",
  "author": "stephen-lambrechts",
  "summary": "Introducing Samsung's Eco 2 OLED technology",
  "article": [
    "During its announcement last week, keen-eyed observers will have noticed that the new Samsung Galaxy Z Fold 3 has a slightly smaller battery (4,400mAh) than its predecessor, the Galaxy Z Fold 2 (4,500mAh).",
    "This, along with the inclusion of a more powerful Snapdragon 888 chipset and an upgraded 120Hz display on the outside of the device, would lead most reasonable people to assume that the Z Fold 3 would suffer somewhat when it comes to battery life.",
    "Not so, according to Samsung, which has revealed via Samsung Display Newsroom how its new Eco 2 OLED display technology is able to reduce battery consumption by 25% while also offering a 33% increase in screen brightness.",
    "As revealed by Samsung Display, the Galaxy Z Fold 3's new Eco 2 OLED display uses an integrated polarizer, an opaque plastic sheet which was previously included as an additional layer between the device's OLED display and Samsung's ultra-thin glass (UTG) top layer as a means to reflect external light and improve visibility in bright settings.",
    "So why would an additional plastic sheet affect a device's battery life? According to Samsung, \"a traditional polarizer adds a dark layer of film on top of the panel\", which means \"your device requires more light\", forcing the handset to pump up the brightness and go through more power in order to compensate.",
    "Instead, Samsung says its Eco 2 OLED display is able to achieve the same effect without the additional layer by \"leveraging its innovative pixel structure,\" which is said to have delivered a 33% improvement in transmittance rate and a 25% decrease in power consumption in its internal tests.",
    "If that wasn't exciting enough, Samsung also revealed that the new display tech has allowed the company to cut down on its plastic usage now that the additional polarizer layer is no longer needed, making the Eco 2 OLED display even more eco-friendly than we initially thought."
  ],
  "headers": {
    "3": "How Samsung's Eco 2 OLED technology works"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Display Newsroom": "http://global.samsungdisplay.com/28402/"
  }
}