{
  "source": "https://www.techradar.com/news/come-on-microsoft-its-time-to-update-this-age-old-problem-for-xbox-series-x",
  "title": "Come on, Microsoft – it’s time to update this age old problem for Xbox Series X",
  "category": "gaming",
  "updated": "2021-04-27T10:53:48Z",
  "author": "adam-vjestica",
  "summary": "Opinion: I’m crying out for more colors on Xbox",
  "article": [
    "It's been over eight years since the Xbox One launched, and even though the console’s UI is practically unrecognizable from the first iteration that greeted players in 2013, one element has stubbornly stood the test of time: the restrictive amount of profile colors available.",
    "In a world where every mouse and keyboard is capable of putting on a self-contained RGB light show – and more consumers than ever are illuminating their home entertainment centers with glowing LEDs (which can help elevate even the most humble of setups into something eye-catching) – the lack of color options on Xbox Series X and Xbox Series S really stands out. It’s at odds with the sheer amount of customization options the rest of the console offers as well, but unfortunately, it continues to be overlooked with every major update.",
    "The Xbox Series X and entire family of Xbox consoles really do let you tinker to a satisfying degree. You can change your profile picture, use achievement art as your background, organize your favorite games into specific groups and rearrange the home screen to suit your preference.",
    "You can also pick between light and dark themes, change the transparency of the tiles, and even organize your games in a number of pleasing ways, like seeing which titles are enhanced for Xbox One X.",
    "And even though the Xbox isn’t the most intuitive user experience you'll find, especially for newcomers, there is an appealing amount of granularity on offer to those who like to explore every possible setting. (It took me years to discover this Xbox feature as a result.)",
    "But when it comes to profile colours, which are neatly integrated throughout the Xbox user interface, it feels annoyingly restrictive. There are 21 colors to choose from, which admittedly sounds like a lot. But the problem is half of them are basically identical. You have light green, a darker green, a teal, a lighter teal, a purple, a lighter purple and so on and so forth. There are some key colors missing, too, like black, white and yellow, which really limits your ability to express yourself or match your current setup.",
    "What makes the matter more frustrating is that on Windows 10, there are 48 standard color types to choose from. You can even create a custom accent color using a color picker and brightness slider. Not every color is supported, as you might expect, but there’s a far greater chance you’ll be able to create a look that’s far more personal to you.",
    "Even the new Xbox Avatars, with their bizarre misshapen thighs (what’s with that, by the way?) provide a wealth of color customization options when it comes to choosing your hair and eye color, for example, so why can’t we get some new profile colors that work system-wide? My new Philips Hue Light Strip can set the scene and match my mood in a plethora of ways, and after using a light blue accent on Xbox for close to a decade, it would be nice if I could mix things up there too.",
    "Microsoft's new Xbox Wireless Controller designs also ignite my desire for more color options further. I want to inject that striking neon yellow color of the new Volt Xbox Wireless Controller into the Xbox dashboard, but the closest option available I can pick is a mild orange...",
    "Demanding that Microsoft add more profile colors may seem like a trivial request, and in many ways that’s exactly why it’s so irritating that we still only have the stock 21 colors from 2013 at our disposal. If Microsoft could at least match the color options available on Windows 10, that would be a start, and it would greatly benefit Microsoft’s goal of making PC and Xbox ecosystems feel more aligned.",
    "Consider this a colorful cry for help, Microsoft."
  ],
  "headers": {
    "5": "True colors",
    "7": "Technicolor dream box"
  },
  "links": {
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "It took me years to discover this Xbox feature as a result": "https://www.techradar.com/news/i-never-knew-about-this-xbox-series-x-feature-after-all-these-years",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Philips Hue Light Strip": "https://www.techradar.com/reviews/philips-hue-lightstrip-plus",
    "Xbox Wireless Controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Volt Xbox Wireless Controller": "https://www.techradar.com/news/new-xbox-wireless-controller-designs-will-liven-up-your-lounge"
  }
}