{
  "source": "https://www.techradar.com/news/stripe-pulls-ecommerce-support-for-trump-website",
  "title": "Stripe pulls ecommerce support for Trump website",
  "category": "computing",
  "updated": "2021-01-11T12:01:53Z",
  "author": "barclay-ballard",
  "summary": "Stripe joins Twitter and Facebook in going against the President",
  "article": [
    "Payment processing company Stripe has become the latest tech firm to go against Donald Trump after it announced it would no longer manage payments for the out-going president’s campaign website.",
    "Stripe reportedly made its decision after adjudging that the Trump campaign had encouraged acts of violence in the wake of the riots that struck the Capitol last week.",
    "In addition to Stripe, both PayPal and Shopify have been moderating their platforms for several years. In 2017 following the Charlottesville riots, PayPal began banning far-right organizations, while Shopify has removed a number of controversial online stores in recent years.",
    "The action taken by Stripe follows similar decisions made by Twitter, Facebook, and Pinterest, with the President rapidly running out of technology platforms that he is able to use. Looking specifically at tech firms that process payments, many have acted quickly to remove accounts connected to extremist groups that support Trump.",
    "Stripe will no doubt face accusations that its decision to stop processing payments for the Trump campaign is politically motivated.",
    "Technology firms have long been accused of attempting to shut down conservative voices and recent events have seen these claims voiced even more loudly.",
    "Last week, both Google and Apple removed the free speech social network Parler from their app stores – a decision that AWS followed up by revoking its web hosting services. These combined actions have effectively shut the platform down completely.",
    "However, the Silicon Valley giants have hit back at suggestions that they censor right-wing voices by stating that they only de-platform individuals and organizations where they incite violence.",
    "After the events in the Capitol last week, in which five people were killed, these firms believe that it is their legal duty to crack down on extremist views. Stripe may be the latest tech firm to distance itself from the Trump campaign but it might not be the last.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "De-platformed"
  },
  "links": {
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "AWS": "https://www.techradar.com/news/aws-suspends-web-hosting-for-controversial-parler-app",
    "TechCrunch": "https://techcrunch.com/2021/01/10/stripe-reportedly-joins-the-tech-platforms-booting-president-trump-from-their-services/"
  }
}