{
  "source": "https://www.techradar.com/news/xbox-game-pass-could-soon-be-built-into-your-smart-tv",
  "title": "Xbox is getting a smart TV app and streaming stick for cloud gaming",
  "category": "televisions",
  "updated": "2021-06-11T10:38:14Z",
  "author": "henry-st-leger",
  "summary": "But what does this mean for consoles?",
  "article": [
    "Your smart TV may be about to get Xbox Game Pass, it seems. Ahead of the E3 2021 expo, Microsoft and Xbox have hinted at the future of the Game Pass platform, confirming that it could soon arrive on living room TVs without a need for an Xbox Series X or Xbox Series S console.",
    "A press release for the announcement states that “Xbox is working with global TV manufacturers to embed the Xbox experience directly into internet-connected televisions with no extra hardware required except a controller.”",
    "That means smart TVs from the likes of Samsung, LG, Sony, Hisense and TCL could all get a native Xbox Game Pass app that sits alongside YouTube, Netflix, and Disney Plus, allowing you to try out any of the 300+ games in the growing Game Pass library within the same smart TV platform – without a console. You will need an Xbox controller or Xbox-compatible gamepad, of course, but the potential disruption here to living room gaming is huge.",
    "Game Pass is the jewel in Xbox’s crown right now. With hundreds of games to try out, day-one launches for first-party games, and cloud gaming starting to be integrated into the Game Pass Ultimate tier, this monthly-fee subscription service is at the heart of the Xbox platform today, and is the major threat to PlayStation’s market-leading position.",
    "That’s not all, though. Liz Hamren, CVP of Gaming Experiences & Platforms, tells us that Xbox is “also developing standalone streaming devices that you can plug into a TV or monitor, so if you have a strong internet connection, you can stream your Xbox experience.”",
    "If you don’t have a smart TV that supports Xbox Game Pass, then, or don’t want to upgrade your home television just yet, then you should be able to buy a streaming stick accessory that plugs into your TV’s HDMI port and loads up the Game Pass app that way.",
    "“We're doing all this because Game Pass works,” says Hamren. “It works for consumers, and it works for publishers. With Game Pass, players spend 20% more time playing games. They play 30% more genres, and play 40% more games overall, including games outside their Game Pass subscription. In a recent survey, we found that more than 90% of members said they played a game they would not have otherwise played without Game Pass.”",
    "Phil Spencer, Head of Xbox, is bullish about the future of Xbox console hardware looking bright, even while he proselytizes the potential of cloud gaming to disrupt the gaming landscape and make the Xbox platform even more accessible.",
    "“There’s still a place for consoles and PCs and frankly, there always will be,” Spencer says. “But through the cloud, we will be able to deliver a robust gaming experience to anyone connected to the Internet, even on the least powerful, least expensive devices, devices people already own. And with the cloud, gaming players can participate fully in the same Xbox experience as people on local hardware.”",
    "Liz Hamren, too, hints that Xbox is “already hard at work on new hardware and platforms, some of which won’t come to light for years.”",
    "It seems we’re only seeing a small part of the picture so far, then, but the arrival of Xbox games Pass on smart TVs and streaming sticks – especially with the integration of cloud gaming that doesn’t require advanced gaming hardware – is surely an exciting thing for gamers the world over, and will certainly become a key issue for TV makers in the years to come.",
    "Just as some TV brands were slow to start introducing HDMI 2.1 for next-gen console connections, so too could manufacturers who get behind Game Pass early see the benefit."
  ],
  "headers": {
    "7": "Can consoles and streaming coexist?"
  },
  "links": {
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Xbox Game Pass": "https://www.techradar.com/news/xbox-game-pass-for-pc-is-a-frustrating-mess-heres-why/reviews/xbox-games-pass",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "streaming devices": "https://www.techradar.com/best/streaming-device",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know"
  }
}