{
  "source": "https://www.techradar.com/news/exclusive-gamestop-xbox-series-x-restock-in-store-no-ps5",
  "title": "Exclusive: GameStop Xbox Series X restock – when to buy it in stores today",
  "category": "gaming",
  "updated": "2021-08-30T10:45:57Z",
  "author": "matt-swider",
  "summary": "We did actual reporting on the in-store GameStop Xbox Series X restock. Here's what to expect today, June 16.",
  "article": [
    "We're on location reporting on today's GameStop Xbox Series X restock news, and if you're not in line yet and miss it, follow our Xbox and PS5 restock Twitter tracker Matt Swider who will send you an alert when it's back in stock – if you follow his account and turn on notifications.",
    "The GameStop lines haven't been that very long on the East Coast of the US, where most of the stores open at 11am EDT. That's good news if you want to buy the Xbox Series X in another time zone. There's still time. Most stores have an inventory count of 13 for the Series X – a few have just three while others have up to 20 on hand.",
    "Here's what you need to know based on our exclusive reporting.",
    "In case you miss it: Matt Swider is tracking Xbox Series X restock opportunities from more than 12 different stores in the US. Here's an example of the alert you'll get if you follow his Twitter account.",
    "The GameStop restock today is very different. This is the first time in 2021 that a restock will happen inside GameStop stores, and Matt Swider will be reporting for TechRadar live outside of the GameStop in Manhattan to see how the event unfolds.",
    "We did report on an in-store Best Buy restock for the Nvidia 3080 Ti GPU on June 3, so while physical store restocks aren't commonplace, two in one month makes a trend. We've seen the occasional Walmart in Texas carry the PS5 and Xbox Series S consoles, according to our loyal followers who reply to our Twitter restock tracker account, but it's not something Walmart officials announce – or seem to know about.",
    "There's no telling if the in-store GameStop Xbox restock will make buying next-gen consoles easier. While bots are not going to be a problem in real life (let's hope not), resellers can still camp out for the console to turn a profit. As we mentioned, it's one console per person, so that's a rule that's easier to enforce in person.",
    "But, on the flip side, we did see Target temporarily suspend in-store sales of sought-after Pokemon trading cards and also sports cards after a physical altercation at one of its stores. The line for the aforementioned Best Buy GPU restock drew 200 people in Manhattan and a fight almost broke out, according to our on-the-ground reporting, so there's certainly room for chaos for in-demand tech.",
    "We'll continue to follow the GameStop Xbox Series X restock news, try to see when there will be a PS5 restock in stores (don't hold your breath), and update you on how the line is progressing around the US."
  ],
  "headers": {
    "3": "Exclusive GameStop Xbox Series X details"
  },
  "links": {
    "Xbox Series X restock news": "https://www.techradar.com/news/xbox-series-x-restock-at-gamestop-date-and-time-confirmed-heres-when",
    "Xbox and PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "report on an in-store Best Buy restock": "https://www.techradar.com/news/life-in-the-queue-meet-the-gamers-camping-out-for-an-rtx-3080-ti-across-the-us",
    "Nvidia 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "GPU restock": "https://www.techradar.com/news/rtx-3080-in-stock-today-newegg-shuffle"
  }
}