{
  "source": "https://www.techradar.com/news/macos-monterey-the-best-new-safari-features",
  "title": "The best new Safari features in macOS 12 Monterey",
  "category": "computing",
  "updated": "2021-06-22T15:01:36Z",
  "author": "bryan-m-wolfe",
  "summary": "It's all about the tabs",
  "article": [
    "Apple's native Safari app for Mac received a significant update in macOS 12 Monterey. The software refresh, which will arrive this fall, offers new ways to organize your favorite websites while at the same time injecting some much-needed style changes into the sometimes stuffy web browser.",
    "With macOS Monterey only starting to go through the beta testing process, some key features in the new Safari could change between now and the public release. Still, it's already possible to give you an overall feel on what to expect.",
    "Tabs have always played an important role on most web browsers because they make it easier for users to go back and forth between websites. Apple's pushing the tabs concept into new territory, not just in macOS Monterey but also on iOS 15 and iPadOS 15. Together, the changes should make it easier to find your favorite websites and arrange them in fun new ways.",
    "The Safari tab changes come in two varieties: a tab bar and tab groups.",
    "Elsewhere in Safari, Apple has introduced a 'More' menu, making it quicker to find features like sharing and the Safari Privacy Report. There's also an update to the Safari sidebar.",
    "Separately, none of these changes sound that extraordinary. And yet, together, knowing many of the same changes are coming to mobile makes Safari a new experience.",
    "You'll have to decide whether this is a better experience, of course.",
    "The tab bar in Safari has been tweaked in macOS 12 Monterey to take up much less space while also extending the web page to the edge of the window. The tab bar also changes colors to match that of the web page you're browsing.",
    "Additionally, the tabs have a rounder appearance and take on a more button-like appearance. They also change in size as you open more tabs or adjust the size of the Safari window.",
    "These are subtle changes, but they do tend to work, and the tabs feel much more siloed as a result. For the lack of a better word, they feel more \"sturdy\" during use.",
    "Because you can never have too much organization, Apple has also added tab groups. These let you organize tabs based on what you're currently doing. For example, you may want easy access to certain websites during working hours and others when you're simply surfing the web looking for sports news.",
    "Are you planning a trip? With tab groups, you can group web links for the hotel, travel service, and location with ease.",
    "You can switch between tab groups using the sidebar or drop-down menu in Safari. Tab groups are synced to other Apple devices, including iPhone and iPad.",
    "Tab groups are much more exciting and useful than you might expect, although they force you to rethink how to access websites. Plus, it's still an open question whether having multiple tab groups would suddenly slow down Safari on your Mac. Assuming this isn't the case, and it probably isn't, tab groups could be the most interesting new feature on Safari.",
    "Still, others may wonder what all the fuss is about since bookmarks serve a similar purpose. According to Apple, it views tabs as more dynamic than bookmarks, meaning tabs follow you. A bookmark, by contrast, is more hard-coded to a specific page. It sees users picking tab groups or bookmarks depending on the sort of tasks they are doing.",
    "Within the active tab on the address bar, you'll now find the new 'More' menu. When clicked, you can access features like the Safari 'Privacy Report', 'Translate', and 'Reader'. Safari's sharing features are also located here.",
    "The change makes the top of Safari much less cluttered, although not everyone will like it. Some might view it as unnecessarily hiding key features.",
    "It's going to take a lot more digging to fully grasp the changes Apple's bringing to Safari this fall. On mobile and Mac, the changes are much more significant than many might have realized when watching the Worldwide Developers Conference (WWDC) keynote. Stay tuned for updates."
  ],
  "headers": {
    "2": "What has changed?",
    "7": "Tab bar",
    "10": "Tab groups",
    "15": "More menu",
    "17": "Promising new look"
  },
  "links": {
    "macOS 12 Monterey": "https://www.techradar.com/news/macos-12",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15"
  }
}