{
  "source": "https://www.techradar.com/news/amazon-kindle-paperwhite-2021-is-out-now-with-a-big-display-and-thinner-bezels",
  "title": "Amazon Kindle Paperwhite 2021 is out now with a big display and thinner bezels",
  "category": "tablets",
  "updated": "2021-10-26T13:00:35Z",
  "author": "david-lumb",
  "summary": "The Kindle Paperwhite gets a facelift in 2021",
  "article": [
    "The Amazon Kindle Paperwhite 2021 is finally out, with a handful of aesthetic upgrades and a few long-awaited improvements to one of the best ereaders on the market, which hasn’t been updated since the Amazon Kindle Paperwhite 2018.",
    "The big upgrades to the Kindle Paperwhite 2021 are a much larger 6.8-inch e-ink screen than the 6-inch display on its predecessor. The ereader also has a USB-C port, finally moving on from the micro USB port of older Kindle Paperwhites.",
    "The new ereader (6.9 x 4.9 x 0.32 inches) is a bit bigger than the 2018 model (6.6 x 4.6 x 0.3 inches), with thinner bezels to accommodate the bigger display. The standard Kindle Paperwhite 2021 has 8GB of storage like its predecessor – but if you want to upgrade to 32GB, you’ll need to pay for the significantly pricier Kindle Paperwhite 2021 Signature Edition.",
    "While the Kindle Paperwhite 2021 is priced at $139.99 / £129.99 / AU$239, the Kindle Paperwhite 201 Signature Edition has a price tag of $189 / £179 / AU$289. The design is identical, but the latter has the aforementioned higher storage, wireless charging, and the capability to auto-set brightness based on environmental light level.",
    "The Kindle Paperwhite 2021 remains the mid-tier option among Amazon’s ereaders, and the updates make it an even more viable option, though buyers can save money by picking up the older Kindle Paperwhite 2018 at a discount by now.",
    "Consumers looking for cheaper options can pick up the basic Amazon Kindle, which has a chunkier-bezel design but starts for much cheaper – $89.99 / £69.99 / AU$139 – if they’re willing to put up with ads, or go ad-free for $109.99 / £79.99 / (about AU$150).",
    "The luxury option, the Amazon Kindle Oasis (which hasn’t been updated since 2019), starts at $249.99 / £229.99 / AU$399 for the 8GB model, which has a larger 7-inch e-ink display backlit by 25 LEDs. Some of its features, like the warmness light setting, have trickled down to the Paperwhite series, though its physical buttons might be exactly what some consumers want."
  ],
  "headers": {
    "4": "Kindle Paperwhite 2021 vs Kindle vs Kindle Oasis"
  },
  "links": {
    "best ereaders": "https://www.techradar.com/best/best-ereader",
    "Amazon Kindle Paperwhite 2018": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-2018-review",
    "Amazon Kindle": "https://www.techradar.com/reviews/amazon-kindle-review",
    "Amazon Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review"
  }
}