{
  "source": "https://www.techradar.com/news/a-new-avengers-movie-is-coming-but-youll-be-waiting-a-while",
  "title": "A new Avengers movie is coming – but you'll be waiting a while",
  "category": "entertainment",
  "updated": "2021-01-12T10:07:24Z",
  "author": "samuel-roberts",
  "summary": "Marvel's Kevin Feige drops a small hint on the MCU's future",
  "article": [
    "Another Avengers movie is coming at some point, Marvel CCO Kevin Feige has confirmed in a new interview.",
    "While a new Avengers movie isn't part of the plan for Marvel's Phase 4 – due to kick off this Friday with the release of WandaVision on Disney Plus – at some point you'll see the superhero group reassemble on the big screen.",
    "\"I would have to think so. I would have to say yes, at some point,\" Feige said when asked directly about the prospect of a new Avengers movie by IGN. \"It's a good title. Could use that,\" he added jokingly.",
    "Feige had previously told the outlet that Phase 4 is about \"beginnings\", and \"learning new things about characters you already think you know\". The former is summed up well by incoming Disney Plus TV shows like Moon Knight, Ms Marvel, She-Hulk, Ironheart and Hawkeye, all of which either feature brand new superheroes, or new iterations of ones we already know (Hawkeye features Jeremy Renner's Clint Barton training a new vigilante archer called Kate Bishop, played by Hailee Steinfeld). New movies like Shang-Chi and Marvel's Eternals also continue that theme.",
    "Meanwhile, the \"learning new things\" about familiar heroes can be applied to the delayed Black Widow movie – currently scheduled for release on May 7, 2021. The WandaVision, The Falcon and the Winter Soldier and Loki TV shows on Disney Plus all fit that bill, too.",
    "No Avengers movie is currently on the release schedule, and Marvel currently has movies scheduled through to the end of 2022. Several, like Jon Watts' Fantastic Four, Guardians of the Galaxy Vol. 3 and Ant-Man and the Wasp: Quantumania, don't have official release dates yet.",
    "It's unclear when Phase 4 ends and Phase 5 begins, then, but you've likely got a few years to wait until the Avengers reassemble.",
    "The 'Multiverse' is widely expected to be the new overarching threat or subject of some upcoming Marvel movies – our best guess is that this will factor in to a future Avengers movie, too. In comic book terms, this means the potential for characters to visit alternate realities or be visited by residents of other realities.",
    "The non-MCU animated movie Spider-Man: Into the Spider-Verse offers the easiest explanation of how this works.",
    "Feige has previously said that \"the Multiverse is the next step in the evolution of the MCU.\" That's most obvious in 2022's Doctor Strange in the Multiverse of Madness, which mentions the idea in the title.",
    "But recent reports also shed light on what Marvel might be planning for the future. The next Spider-Man movie starring Tom Holland – due to release this December – is expected to feature Alfred Molina and Jamie Foxx reprising their past Spider-Man roles of Doc Ock and Electro respectively. That's despite neither starting out as MCU characters, suggesting that characters from other realities will tie into the action somehow. (Perhaps that'll explain how Deadpool 3 will be part of the MCU, too.)"
  ],
  "headers": {
    "7": "What could happen in a new Avengers movie?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "IGN": "https://www.ign.com/articles/marvel-avengers-phase-4-kevin-feige",
    "Disney Plus TV shows": "https://www.techradar.com/best/best-disney-plus-shows",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Alfred Molina and Jamie Foxx reprising their past Spider-Man roles of Doc Ock and Electro respectively": "https://www.techradar.com/news/marvels-spider-man-3-movie-brings-back-the-best-villain-from-the-original-trilogy",
    "Deadpool 3 will be part of the MCU": "https://www.techradar.com/news/deadpool-3-will-be-part-of-the-marvel-cinematic-universe-and-r-rated"
  }
}