{
  "source": "https://www.techradar.com/news/explore-madripoor-website-has-had-its-x-men-mcu-easter-eggs-deleted",
  "title": "Explore Madripoor website has had its MCU X-Men Easter eggs deleted",
  "category": "entertainment",
  "updated": "2021-04-09T15:00:45Z",
  "author": "tom-power",
  "summary": "Where have they gone?",
  "article": [
    "MCU fans were given the biggest hint yet over the X-Men's arrival in Falcon and the Winter Soldier episode 3.",
    "Last week's entry in the Disney Plus TV series saw Sam, Bucky, and Helmut Zemo travel to Madripoor. To commemorate the occasion, Marvel Studios recently released a tourism website for the fictional criminal city, which was first picked up by ComicBook.com.",
    "Madripoor has ties to X-Men members including Wolverine, so it'll come as no surprise for people to learn that X-Men MCU rumors began to gather momentum mere hours after the Explore Madripoor website went live.",
    "Why? Well, fans began unearthing X-Men Easter eggs on the Explore Madripoor website - secrets that led some to assume that it wouldn't be long before the likes of Professor X start appearing in the MCU.",
    "According to those who visited Explore Madripoor, the use of specific passwords allowed fans to find ships with very familiar names in Madripoor's Buccaneer Bay docks. Those listings included Mystique, who Marvel fans will know well, as well as Daken, the son of Wolverine in Marvel comics. Shang-Chi and the sentient island called Krakoa were also discovered, but it's Mystique and Daken that drew the most attention for their X-Men references.",
    "What was Marvel's response to fans uncovering these Easter eggs? Removing them, of course. As IGN reports, fans who visit the Explore Madripoor website now will find no trace of these X-Men references.",
    "These were almost certainly nods to Wolverine's presence on Madripoor from the comics, but Marvel seems to have removed any Easter eggs in an effort to dampen fan expectations of the X-Men's MCU arrival.",
    "Yes. Marvel may have removed its X-Men references, but there are plenty of cool little nods to the events of Falcon and the Winter Soldier. Fans can unearth 'wanted' posters for Sam, Bucky and Zemo, as well as find desktop and mobile phone wallpapers to download. There are also CCTV clips of the trio escaping Madripoor's criminals, too, from a variety of angles that episode 3 didn't showcase.",
    "In order to access the website's hidden sections, you'll need two particular passwords. Per IGN, users can use the password 'powerbroker' in Buccaneer Bay and 'sharoncarter' in the Hightown Nightclub areas.",
    "Falcon and the Winter Soldier's fourth episode was released today, and there was one big moment in its final scene that has left some viewers shocked. We have thoughts on what this means for the series moving forward, so check out our ending explainer for more."
  ],
  "headers": {
    "7": "Are there any Easter eggs left on the Explore Madripoor website?"
  },
  "links": {
    "Falcon and the Winter Soldier": "https://www.techradar.com/news/how-to-watch-the-falcon-and-the-winter-solider-finale-stream-episode-6-online-now",
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1131769221023988600&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "tourism website": "https://www.exploremadripoor.com/",
    "ComicBook.com": "https://comicbook.com/marvel/news/falcon-and-winter-soldier-madripoor-marvel-website/",
    "IGN": "https://www.ign.com/articles/marvel-opens-mcu-madripoor-website-quickly-scrubs-x-men-references",
    "ending explainer": "https://www.techradar.com/news/falcon-and-the-winter-soldier-episode-4-ending-explained"
  }
}