{
  "source": "https://www.techradar.com/news/google-meet-update-allows-for-meetings-with-up-to-500-participants",
  "title": "Google Meet update allows for meetings with up to 500 participants",
  "category": "computing",
  "updated": "2021-11-18T00:30:29Z",
  "author": "anthony-spadafora",
  "summary": "You'll need to be a premium Workspace subscriber to host large-scale meetings though",
  "article": [
    "Google will allow even more participants to join meetings when using its video conferencing software as part of a new update now rolling out to Google Meet.",
    "In a new blog post, the search giant revealed that up to 500 participants will be able to be on a video call at the same time to make it easier to connect and collaborate with colleagues, clients and customers.",
    "However, there is a catch. In order to host meetings with up to 500 participants, you'll need to be a Google Workspace Business Plus, Enterprise Standard, Enterprise Plus or Education Plus customer as this feature isn't available for users of the company's Essentials, Starter or Standard Workspace plans.",
    "If 500 participants isn't enough for your organization, you can enable live streaming in Google Meet instead which will allow up to 100,000 viewers to watch at once.",
    "With more people working from home than ever before, Google, Microsoft, Zoom and other makers of video conferencing software have been steadily increasing the maximum number of participants allowed in a video call.",
    "For instance, back in August, Microsoft announced that it would increase the number of participants in Microsoft Teams meetings for US government organizations to 25,000 people on desktop while a total of 1,000 people can be in a normal meeting using the service.",
    "Zoom meanwhile allows for up to 500 or 1,000 participants to participate in a meeting on its platform. However, users need to have either a Pro or Business subscription and purchase the Large Meetings add-on which starts at $50 per month to have 1,000 participants. Users on the Enterprise plan though can host up to 500 participants without purchasing the add-on while those on the Business plan can have up to 300 participants.",
    "Now that video conferencing is here to stay, we'll likely see all three companies increase the number of participants in their meetings especially as organizations have begun implementing hybrid work policies with some employees working remotely while others are back at the office.",
    "Looking to improve your video call experience? Check out our roundups of the best video conferencing software, best business webcams and best headsets for conference calls"
  ],
  "headers": {
    "4": "Large-scale video meetings"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "blog post": "https://workspaceupdates.googleblog.com/2021/11/host-meetings-with-500-participants.html",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "live streaming": "https://support.google.com/meet/answer/9308630",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "25,000 people on desktop": "https://www.techradar.com/news/you-can-now-have-thousands-more-people-in-your-microsoft-teams-call",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "best video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "best business webcams": "https://www.techradar.com/best/best-business-webcams",
    "best headsets for conference calls": "https://www.techradar.com/news/best-business-headphones-and-earphones"
  }
}