{
  "source": "https://www.techradar.com/news/hbo-maxs-day-and-date-release-model-isnt-working-and-warner-bros-knows-it",
  "title": "HBO Max's day-and-date release model isn't working and Warner Bros. knows it",
  "category": "entertainment",
  "updated": "2021-08-10T12:16:58.883Z",
  "author": "stephen-lambrechts",
  "summary": "Warner Bros. and AMC Theatres strike a deal",
  "article": [
    "WarnerMedia shook the entire film industry last year when it announced that all of the films on its 2021 release schedule would debut simultaneously in theaters and on its then-new streaming service, HBO Max.",
    "It was a bold move, in that it allowed the conglomerate to offset Covid-related losses with a huge boost to HBO Max's stock price.",
    "However, following yet another underwhelming box office debut from one of its tentpole releases, it appears Warner Bros. now knows the day-and-date model won't be enough to sustain the blockbuster film industry in the long run.",
    "Warner Bros. has now officially committed to a deal with the US cinema chain AMC Theatres that will see all of the studio's film releases in 2022 receive an exclusive 45-day theatrical release window, as reported by The Hollywood Reporter.",
    "AMC CEO Adam Aron revealed the news in its latest earning call, stating that \"We’re especially pleased Warner Bros. has decided to move away from day-and-date,\" further noting that \"An exclusive window is an important way to build big and successful franchises.\"",
    "While James Gunn's The Suicide Squad was undoubtedly one of Warner Bros.' most anticipated releases of 2021, the $185 million superhero film opened to a very soft box office debut of just $26.5 million in the US and $72.2 million worldwide.",
    "And, while the film has proven very popular on HBO Max, it's quickly becoming clear that streaming popularity isn't enough to justify the budget and marketing costs attributed to blockbuster releases – an issue which Dune director Denis Villeneuve warned about when Warner's strategy was first put in place.",
    "\"I want the audience to understand that streaming alone can’t sustain the film industry as we knew it before Covid,\" said Villeneuve, further stating that \"Warner Bros.’ decision means Dune won’t have the chance to perform financially in order to be viable and piracy will ultimately triumph.\"",
    "It's worth noting that Villeneuve also stated that \"Streaming can produce great content, but not movies of Dune’s scope and scale,\" and that has indeed proven to be the case with Mortal Kombat, which is still the most popular movie to land day-and-date on HBO Max. The video game adaptation has pulled in more viewers than not only The Suicide Squad, but also Godzilla vs Kong, Wonder Woman 1984 and Space Jam: A New Legacy.",
    "So what makes Mortal Kombat special? Well, for starters, it isn't a tentpole film – the gory fight flick had a far more modest budget of $55 million, making it far less of a financial gamble for the studio. It's priced at around the right level for a film that would need to be sustained solely with a streaming release – that it made $83 million at the worldwide box office is just a bonus.",
    "Maybe this release strategy would have worked flawlessly if applied only to mid-budget films, however, we're glad to see WarnerMedia take steps to keep epic filmmaking alive."
  ],
  "headers": {
    "5": "Analysis: why theatrical is absolutely necessary"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "underwhelming box office debut": "https://www.techradar.com/news/the-suicide-squads-poor-debut-dampens-hopes-of-an-imminent-box-office-recovery",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/warner-bros-commits-to-exclusive-theatrical-release-in-2022-in-new-amc-theatre-deal-1234995035/",
    "Dune director Denis Villeneuve warned about": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "still the most popular movie to land day-and-date on HBO Max": "https://www.techradar.com/news/the-suicide-squads-poor-debut-dampens-hopes-of-an-imminent-box-office-recovery",
    "Godzilla vs Kong": "https://www.techradar.com/news/how-to-watch-godzilla-vs-kong-stream-online",
    "Wonder Woman 1984": "https://www.techradar.com/news/how-to-watch-wonder-woman-1984-online-stream-ww84-from-anywhere-today",
    "Space Jam: A New Legacy": "https://www.techradar.com/news/how-to-watch-space-jam-a-new-legacy-online-stream-the-new-hbo-max-movie-today"
  }
}