{
  "source": "https://www.techradar.com/news/solar-panels-hydrogen-and-wireless-charging-kia-has-big-plans-for-its-ev-future",
  "title": "Solar panels, hydrogen and wireless charging – Kia has big plans for its EV future",
  "category": "car-tech",
  "updated": "2021-10-18T14:44:53Z",
  "author": "john-mccann",
  "summary": "Kia plans to launch 11 new electric cars by 2026",
  "article": [
    "Kia's electric car portfolio is already pretty strong, with the Soul EV, the eNiro and the new EV6 now available, but the South Korean firm isn’t resting on its laurels.",
    "It’s planning to launch 11 new EVs (the EV6 being the first) by 2026 and is also planning to extend the naming convention across the range – so expect to see EV1, EV2, EV3, and so on in the coming years.",
    "We sat down with Kia UK President and CEO Paul Philpott to discuss the company’s electric vehicle strategy, and get a better idea of what we may be able to expect over the next five years – and we've also got our crystal ball out to help us form a picture of what Kia’s upcoming EVs could look like.",
    "For now, Kia's plans are purely in battery electric vehicles, but another major renewable energy source is hydrogen – and the advantage for Kia here is that it's more familiar with the fuel cell technology than most manufacturers.",
    "\"We're part of the Hyundai Motor Group, based in South Korea. South Korea is a big producer of hydrogen, and whilst Kia has been pushing ahead with EV, Hyundai has also been experimenting with hydrogen,\" Philpott told us.",
    "So there's a fair bit of hydrogen expertise it can draw on, which puts Kia in a strong position if the technology really takes off – although that may be still quite a while off.",
    "\"At the moment it's a Hyundai-led experiment into hydrogen. It raises all kinds of infrastructure issues, but I do think in the long term hydrogen will be a viable alternative to electric,\" Philpott explained.",
    "Hydrogen-powered cars are already available, albeit in limited quantities and select markets. We drove a hydrogen fuel cell-toting Hyundai ix35 five years ago, and just this year we put the new Toyota Mirai through its paces in Southern California.",
    "The issues are still the same as it was five years ago though – the infrastructure to support these vehicles is sorely lacking, with fuel stations few and far between and supplies of hydrogen currently low, and the cost of a top-up is greater than for petrol cars.",
    "\"Electric is great, providing the electricity producers are sustainable,\" says Philpott. \"Hydrogen has other challenges, but I think it is a viable alternative for the future, and that has to be good.\"",
    "Something we may see sooner in Kia's electric cars are solar panels. They're already available in the roof of the Hyundai Ioniq 5 (in some markets at least) – and it's no secret that the two firms share resources.",
    "While Philpott wouldn't be drawn on whether we'd definitely see a solar panel option feature in any of the remaining planned 10 EV launches up to 2026, Philpott did hint that it's at least feasible.",
    "\"As part of the bigger group, that is shared research and development, that technology is within our group, it's a question of when we make it commercially available on one of our new products, but I can't confirm a planned introduction right now,\" he said.",
    "This is certainly one to keep a close eye on then. While solar panels are unlikely to produce enough power to fully recharge an electric car's battery, the panels on the Ioniq 5 can offer drivers up to 2,000km / 1,243 miles per year (around 5-6km / 3-4 miles per day) of additional range in sunny environments.",
    "That's not enough to cover most daily trips, but it's free range generated from a source with no by-products beyond the construction of the panels themselves, and over the next few years we could see solar panels become more efficient, and able to generate even more range for electric cars.",
    "Another EV technology that has garnered attention this year is wireless car charging, with a trial currently running in the UK and the US state of Michigan committing to build a one-mile stretch of wirelessly charging road.",
    "Currently there aren't any mainstream EVs which offer wireless charging as standard, but the upcoming Genesis GV60 will offer it as an option – and Genesis is also part of the Hyundai Motor Group, which means Kia will have access to the technology, and the research behind it.",
    "But don't get too excited just yet, as widely available wireless charging pads and a large pool of EVs that support them are still a way off.",
    "\"Wireless charging will come over time, but it raises different infrastructure questions about how you monitor it, where does it go,\" Philpott explained. \"Under-road charging would be fantastic, because then you've not got to plug [EVs] in, you can charge while you’re driving, but I think it’s still some way off.\"",
    "So while we're wirelessly charging our phones inside many EVs today, wirelessly charging the cars themselves won’t be arriving en masse in the short term.",
    "Something you can expect from at least some of the yet-to-be-launched Kia electric vehicles is a continued improvement in the range they offer.",
    "As Philpott points out, Kia has already made strides here. He says that the \"[battery] technology is developing fast, and from eNiro to EV6 is a move from 282 miles to 328 miles [of range] – that's a pretty significant increase.\"",
    "And Kia isn't done there, as Philpott predicts even greater EV range in the coming years. \"That rate of progress, iterations of new products, will see range continue to increase,\" he says.",
    "However, electric car range is only half the battle. EVs will still need to be recharged, and currently that takes far longer than filling up a tank of fuel.",
    "The Kia EV6 offers a 10%-80% charge in as little as 18 minutes when connected to a super-fast charger, which is a positive step forward, but it's still around eight times longer than an equivalent fuel stop.",
    "\"Speed of charging is equally as important as range, and range will have an upper limit at some stage,\" says Philpott, \"but speed of charging, and having access to chargers that can charge quickly is [a] simple [solution].\"",
    "It's a simple solution in theory, but one that’s trickier to bring to fruition, especially in busy city centers with high-rise apartments, and a severe lack of parking spots and locations in which to install chargers.",
    "What is clear however, is that the EV market is going to continue growing at pace, bringing with it more innovation and exciting technologies, new ways to power and recharge, and a vast array of new vehicles for consumers to choose from."
  ],
  "headers": {
    "3": "Hydrogen hype",
    "10": "Harnessing the power of the sun",
    "15": "Look ma, no cable!",
    "20": "Range, range and more range"
  },
  "links": {
    "eNiro": "https://www.techradar.com/news/kia-e-niro-the-ev-for-the-people",
    "EV6": "https://www.techradar.com/news/kia-ev6-first-drive",
    "Hyundai ix35": "https://www.techradar.com/news/car-tech/hyundai-ix35-fuel-cell-is-a-solid-ride-but-hydrogen-is-still-a-work-in-progress-1321551",
    "Toyota Mirai": "https://www.techradar.com/news/toyota-mirai-2021-review",
    "Hyundai Ioniq 5": "https://www.techradar.com/news/hyundai-ioniq-5-review",
    "wireless car charging": "https://www.techradar.com/news/wireless-electric-vehicle-charging",
    "a trial currently running in the UK": "https://www.techradar.com/news/wireless-electric-car-charging-pads-now-available-for-drivers-of-special-renault-evs",
    "a one-mile stretch of wirelessly charging road": "https://www.techradar.com/news/charging-your-electric-car-wirelessly-while-you-drive-has-taken-a-major-step-forward",
    "Genesis GV60 will offer it as an option": "https://www.techradar.com/news/finally-wireless-car-charging-is-coming-to-an-electric-car-youll-be-able-to-buy"
  }
}