{
  "source": "https://www.techradar.com/news/hp-has-launched-a-microsoft-365-and-more-subscription-management-service-for-smbs",
  "title": "HP has launched a Microsoft 365 and more subscription management service for SMBs",
  "category": "computing",
  "updated": "2021-11-16T20:00:27Z",
  "author": "anthony-spadafora",
  "summary": "Keep track of SaaS subscriptions and costs with HP's new service",
  "article": [
    "Managing all of the subscriptions for the various SaaS applications used by SMBs can be a time consuming and tedious process.",
    "To make matters worse, more than half of IT leaders still rely on dated internal tools and manual spreadsheets to track and monitor their subscriptions and renewals according to a survey from Productiv. Due to this, it can be challenging for IT departments to know when renewals will take place as well as how much is actually being spent on software licenses.",
    "For this reason, HP has announced a subscription management service designed for small and medium-sized companies to enable them to make software investment decisions based on reliable workforce intelligence.",
    "The new HP Subscription Management Service provides easy-to-use license management for Microsoft 365 as well as for the full list of Microsoft cloud subscription services.",
    "By using the new HP Subscription Management Service, IT teams gain online visibility of software analytics and usage trending by user, department or geography so they can easily shift and scale their subscriptions as needed.",
    "Meanwhile for channel partners, the service offers a one-stop cloud-based solution that enables them to sell Microsoft 365 and the full Microsoft cloud subscription library to their customers along with licensing analytics and premiere partner support from HP.",
    "HP Subscription Management Service also includes other features that help companies reduce cost and administration overhead while increasing security and compliance. For instance, HP customers can easily flex licenses up or down with simple pay-as-you-go subscription options to ensure that their software spend is the right size for their IT budget.",
    "The new service can also be used by organizations to security their workforce whether employees are working from home or at the office with essential cloud security health checks optimized for hybrid working.",
    "HP Subscription Management Service is expected to be available in France, the UK, Germany and Chile by the end of this year and it will launch in additional countries, including the US, in the first quarter of next year.",
    "We've also featured the best free office software and best online collaboration tools"
  ],
  "headers": {
    "4": "HP Subscription Management Service"
  },
  "links": {
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "spreadsheets": "https://www.techradar.com/best/spreadsheet-software",
    "survey": "https://productiv.com/wp-content/uploads/2019/03/Pulse-SaaS-Mar-2019.pdf",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "HP Subscription Management Service": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-8044506127676761000&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fservices%2Fsubscription-management-service.html",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "best free office software": "https://www.techradar.com/best/free-office-software",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}