{
  "source": "https://www.techradar.com/news/revil-ransomware-gang-is-scamming-its-own-customers",
  "title": "REvil ransomware gang is scamming its own customers",
  "category": "computing",
  "updated": "2021-09-29T10:37:10Z",
  "author": "mayank-sharma",
  "summary": "Opportunity makes a thief",
  "article": [
    "A threat actor claims to have discovered a secret backdoor in REvil’s ransomware code, which allegedly helps the ransomware group steal ransom proceeds from its affiliates.",
    "Cybersecurity researchers at Flashpoint have shared an interesting example of the tumultuous relationships in the cyber underground.",
    "Earlier last week, an unidentified threat actor shared evidence of the backdoor on the Russian-language underground forum board Exploit, alleging that REvil was using it as a means of robbing its affiliates after making them do the heavy lifting of compromising and infecting a victim.",
    "“The subsequent fallout within the threat actor community offers the very organizations and individuals they target a window into the types of important chatter that can arise in the cybercriminal underground,” observes Flashpoint while sharing the details of the exchange.",
    "The revelation led another threat actor known as Signature to re-hash their $7 million arbitration claim that had been initiated after REvil re-emerged from a self-imposed hibernation.",
    "Signature wasn’t alone in voicing concern against REvil following the revelation about the backdoor. Other threat actors chimed in to share their displeasure at REvil’s scamming-the-scammers tactics.",
    "According to Flashpoint’s reporting of the conversations, LockBitSupp, the representative of the LockBit ransomware gang, went as far as to claim that many REvil affiliates share suspicion towards REvil.",
    "Flashpoint reasons that animosity between the threat actors in the ransomware ecosystem have been on the rise ever since high-profile malicious campaigns have led to increased law enforcement scrutiny."
  ],
  "headers": {
    "4": "Den of thieves"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "observes": "https://www.flashpoint-intel.com/blog/revils-cryptobackdoor-con-ransomware-groups-tactics-roil-affiliates-sparking-a-fallout/",
    "REvil re-emerged": "https://www.techradar.com/news/revil-is-back-and-wants-to-rebuild-its-reputation",
    "self-imposed hibernation": "https://www.techradar.com/news/revil-websites-disappear-from-the-web",
    "": "https://www.flashpoint-intel.com/blog/where-do-cybercriminals-stand-on-ransomware/"
  }
}