{
  "source": "https://www.techradar.com/news/tide-and-sage-join-forces-to-offer-accounting-help-for-small-businesses",
  "title": "Tide and Sage join forces to offer accounting help for small businesses",
  "category": "computing",
  "updated": "2021-05-12T13:48:29Z",
  "author": "rob-clymo",
  "summary": "Combined software tools are designed to help firms stay on top of accounting",
  "article": [
    "Business finance platform Tide has joined forces with Sage to offer a new banking and accounting product.",
    "The partnership has developed the as-yet-unnamed solution so that it’s aimed squarely at the UK’s self-employed and small businesses owners. The core benefit is that it will work in a single environment by connecting banking data and Tide’s existing finance and admin tools to Sage’s latest accounting and compliance as a service platform, or ACaaS.",
    "Tide members will subsequently be able to streamline their workflow by combining their financial and tax compliance processes into one system. The collaboration is aimed at smoothing out annual procedures including the likes of self-assessment returns and year-end accounts.",
    "Research from the two companies indicates that financial constraints and general worries about succeeding are seen as main barriers to starting a new businesses. With many start-ups and small businesses owners concerned about getting their tax and accounting figures wrong the move seems timely. This is especially so given the expanding Taking Tax Digital legislation, which could potentially impact up to 4 million businesses in the UK.",
    "Tide plans to trial the accounting and compliance solution via its 340,000 members later this year.",
    "If trials are successful, the new partnership between Tide and Sage should help business owners cut down on time and admin work thanks to the interconnected applications. Central to the appeal is likely to be the way that the simple accounting and taxation tools will be built-in to both Tide’s mobile and web platforms. It should also assist smaller concerns in ensuring that they’re remaining compliant while avoiding any potential penalties. Neal Watkins, EVP of Small Business Segment at Sage said, “By partnering with Tide, we hope to encourage more people, who have so far only dreamt about being their own boss, to start a new business.",
    "Many entrepreneurs are held back from starting a new business by fears around getting their tax right, but with this new offering, accountancy and compliance will become a simple and seamless service, meaning that the business owner can sleep easy knowing that they’re getting their tax right and making well-informed decisions.”",
    "“Adding an accountancy offering to the Tide platform is a huge step towards our mission to make life easier for people who work for themselves, saving them time (and money) on their financial admin,\" said Oliver Prill, Tide CEO.",
    "\"Tide has chosen to work with Sage to deliver this product due to Sage's long and impressive record in accounting and compliance and their strategic alignment with Tide. We share a similar customer base, and combining our expertise will bring the right technology solutions to small business owners at the right time.”"
  ],
  "headers": {
    "5": "Interconnected applications"
  },
  "links": {
    "accounting product": "https://www.techradar.com/best/accounting-software-small-business",
    "small businesses owners": "https://www.techradar.com/best/small-business-tax-software",
    "year-end accounts": "https://www.techradar.com/best/best-tax-software",
    "accounting": "https://www.techradar.com/best/accounting-software-small-business",
    "Taking Tax Digital": "https://www.techradar.com/news/make-time-for-making-tax-digital",
    "simple accounting": "https://www.techradar.com/best/best-personal-finance-software",
    "taxation tools": "https://www.techradar.com/best/best-expense-trackers"
  }
}