{
  "source": "https://www.techradar.com/news/nintendo-switch-oled-spotted-in-the-wild-just-weeks-before-launch",
  "title": "Nintendo Switch OLED spotted in the wild just weeks before launch",
  "category": "gaming",
  "updated": "2021-09-20T09:08:44Z",
  "author": "rhys-wood",
  "summary": "The OLED of your eye?",
  "article": [
    "The upcoming Nintendo Switch OLED model has been spotted in the wild just a few weeks ahead of launch. The handheld hybrid console is now on display at Nintendo's official Tokyo-based store, showcasing the console, dock, Joy-Con controllers and some games, too.",
    "Formerly rumored to be the Nintendo Switch Pro, the $349 / £309 Switch OLED has been officially confirmed for a good few months now, but this is the first time we're seeing the console in a public space.",
    "Limited Run Games' Alex Aniel tweeted out some screenshots of the Nintendo Switch OLED, noting the vibrancy of the handheld's screen while it played Mario Kart 8 Deluxe, adding that the smaller bezel is a nice touch.",
    "Aniel wasn't the only person to bring Twitter's attention to the displayed Switch OLED. User Bunnagashi was able to snap images of the console running the delightfully colorful Splatoon 2 and the upcoming Metroid Dread, so it seems like the unit on display is programmed to play demos from a wide variety of games.",
    "The public display of the Switch OLED in Japan shortly follows a price drop for the original 2017 model in the UK and Europe, falling to £259 / €269 (even if there aren't any plans for a price cut in the US just yet). As such, we might see OLED units pop up at select locations across the continent.",
    "There's nothing quite like a retail display of an upcoming console to hammer home that the device is on the horizon, and the Nintendo Switch OLED is doing nothing new in this regard.",
    "That said, given the Switch OLED's lukewarm reception when it was announced, getting a unit out there for the public to witness could win over consumers who were on the fence about purchasing the upgraded console.",
    "The term \"upgrade\" is sadly something of a misnomer in the eyes of many fans when it comes to the Nintendo Switch OLED, however. Besides the slightly larger 7-inch OLED screen on the handheld, smaller bezel and other quality-of-life features like a wider kickstand, there's little here to get many Switch fans excited – especially those who primarily play on the TV in docked mode.",
    "That's not to say the Nintendo Switch OLED is a pointless endeavour for Nintendo, though. While it's clearly aimed at enthusiasts, there are upcoming titles well-suited to the sharper 720p OLED screen, such as the aforementioned side-scroller Metroid Dread and Splatoon 3, releasing in 2022.",
    "While we certainly don't expect the Nintendo Switch OLED to sell quite as well as the original model, it could still be a fine choice for both enthusiasts as well as first-time Switch buyers looking to get the best portable experience possible."
  ],
  "headers": {
    "5": "Analysis: Nintendo Switch OLED is almost here"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Mario Kart 8 Deluxe": "https://www.techradar.com/how-to/mario-kart-8-deluxe-tips-and-tricks/news/new-mario-kart-8-deluxe-dlc-is-a-golden-opportunity-for-nintendo-so-where-is-it",
    "Bunnagashi": "https://twitter.com/bunnagashi/status/1439116658329542656?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1439116658329542656%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.nintendolife.com%2Fnews%2F2021%2F09%2Fnintendos_switch_oled_model_makes_its_first_public_appearance_in_japan",
    "Metroid Dread": "https://www.techradar.com/news/its-not-metroid-prime-4-but-metroid-dread-is-the-first-new-2d-entry-in-20-years",
    "original 2017 model": "https://www.techradar.com/reviews/nintendo-switch",
    "aren't any plans for a price cut in the US just yet": "https://www.techradar.com/news/switch-wont-get-a-price-cut-in-the-united-states-nintendo-confirms",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news"
  }
}