{
  "source": "https://www.techradar.com/news/jeff-bezos-lawsuit-delays-nasa-artemis-moon-lander-contract-with-spacex",
  "title": "Jeff Bezos' lawsuit delays NASA Artemis Moon lander contract with SpaceX",
  "category": "appliances",
  "updated": "2021-08-20T19:56:26Z",
  "author": "john-loeffler",
  "summary": "The delay is now official",
  "article": [
    "NASA has agreed to a ten-week hold on its SpaceX lunar lander contract in order to address the recent lawsuit brought by losing bidder Blue Origin, all but ensuring that NASA will miss its 2024 target for returning humanity to the Moon.",
    "\"NASA has voluntarily paused work with SpaceX for the human landing system (HLS) Option A contract effective August 19 through November 1,\" according to a NASA statement emailed to Gizmodo.",
    "Blue Origin, headed by Amazon founder Jeff Bezos, filed a lawsuit last week in federal court demanding that NASA's contract award to SpaceX be voided and that a new bidding process take place.",
    "Blue Origin's suit is under a protective order, so the details of the suit aren't specifically known, but Blue Origin, and Bezos in particular, haven't been quiet about their objections.",
    "In a protest presented to the Government Accountability Office earlier this year, Blue Origin argued that the original NASA contract bid indicated that multiple landers would be built, but in the end only one was selected, SpaceX's Starship.",
    "Bezos even offered to pay for $2 billion of its original $5.9 billion bid in an effort to win over NASA, but NASA said that due to budget constraints imposed by Congress, they only had the funding for one lander proposal.",
    "The GAO rejected Blue Origin's argument on July 30, giving NASA the go-ahead to begin working with SpaceX on the Human Launch System (HLS) that would land astronauts on the Moon for the first time since 1972.",
    "Now, that work has been put on hold while NASA sorts out this latest lawsuit from Blue Origin. \"In exchange for this temporary stay of work, all parties agreed to an expedited litigation schedule that concludes on Nov. 1,\" NASA said. \"NASA officials are continuing to work with the Department of Justice to review the details of the case and look forward to a timely resolution of this matter.\"",
    "As tempting as it might be for some to write off Blue Origin's protest as the whining of one particularly bitter billionaire, Blue Origin's proposal wasn't made by Blue Origin alone.",
    "Due to Blue Origin's admittedly limited experience in actual space flight – Jeff Bezos' jaunt past the Kármán line notwithstanding – the company has partnered with some heavy hitters in the aerospace industry: Northrop Grumman and Lockheed Martin.",
    "As founding members of the military-industrial complex, Northrop Grumman and Lockheed Martin have long benefitted from a steady stream of government contracts with little to no real competition.",
    "With little incentive to offer the lowest bid possible to secure a contract, many of these companies have gotten very used to the government simply having no choice but to accept the only qualified bids on the table – which just happen to be large.",
    "SpaceX has disrupted this by offering incredibly competitive bids and consistently delivering results. It's notable that even with Bezos' offer to cover $2 billion of his own company's bid, Blue Origin's bid was still $1 billion higher than SpaceX's $2.9 billion.",
    "While there's no question Jeff Bezos would love to see his company's crewed lunar lander be the first to touch down on the moon in over 50 years, the real drivers of this lawsuit are more likely Northrup Grumman and Lockheed Martin, who have seen their revenue from NASA contracts starting to slip.",
    "While the military contractors aren't likely to go under any time soon because of SpaceX, they may find themselves increasingly locked out of space flight contracts, which carry a certain prestige than bombs and fighter jets simply can't match."
  ],
  "headers": {
    "8": "Analysis: more than just a billionaire's wounded ego"
  },
  "links": {
    "SpaceX": "https://www.techradar.com/news/spacex-everything-you-need-to-know",
    "Blue Origin": "https://www.techradar.com/news/blue-origin",
    "Gizmodo": "https://gizmodo.com/jeff-bezos-instigates-potentially-crushing-delay-of-nas-1847524983",
    "filed a lawsuit": "https://www.techradar.com/news/space-suit-this-is-how-badly-jeff-bezos-blue-origin-wants-nasas-moon-mission",
    "rejected Blue Origin's argument": "https://www.gao.gov/press-release/statement-blue-origin-dynetics-decision",
    "NASA said": "https://www.reuters.com/legal/government/nasa-temporarily-halts-work-lunar-lander-contract-pending-court-case-2021-08-19/",
    "Jeff Bezos' jaunt past the Kármán line": "https://www.techradar.com/how-to/watch-jeff-bezos-blue-origin-rocket-launch"
  }
}