{
  "source": "https://www.techradar.com/news/every-dandd-book-for-5e-from-players-handbook-to-candlekeep-mysteries",
  "title": "Every D&D book for 5E, from Player's Handbook to Candlekeep Mysteries",
  "category": "gaming",
  "updated": "2021-03-27T16:00:15Z",
  "author": "aimee-hart",
  "summary": "All the D&D books you need",
  "article": [
    "Getting into Dungeons & Dragons 5E (5th Edition) but not sure where to start? Well, we understand that. There’s over 30 books for the tabletop roleplaying game out there – if you count both campaign adventures and sourcebooks – meaning there’s a lot to choose from. And if you’re not sure of the difference between all the different 5E books, we can explain everything you need to know.",
    "A sourcebook is a book that’s made solely to provide players and Dungeon Masters with information that’ll help enrich their gameplay. It can offer a lot of things: new rules, races, subclasses, and even campaign settings such as the Sword Coast and Eberron, being different settings with two different tones, but both adopting the same rules.",
    "An adventure, on the other hand, is a pre-made campaign that is used by Dungeon Masters; it gives them instructions on how to run a narrative, and, speaking from personal experience, is a lot less of a hassle than home-brewing an adventure by yourself.",
    "With these two definitions in mind, we’re here to let you know just which D&D 5E books rank up to our best expectations and which are probably worth giving a miss.",
    "It’s worth keeping in mind that these books are widely available in PDF form too, or on the official D&D Beyond website, but for those after the satisfaction of a fully-stocked D&D bookshelf, read on below.",
    "Much like the Dungeon Master’s Guide, this book is essential for anyone looking to get into 5th edition. It not only gives you essential rules, tools and tips, but it explains how to create a character in the first place. It also goes into the nitty gritty details of explaining abilities, classes, subclasses, spells and backgrounds. Even Dungeon Masters need the Player’s Handbook in their life.",
    "This is key for any player, regardless if you’re going to be a Dungeon Master or not. It explains the basic, key rules of 5th edition Dungeons & Dragons, and is mandatory for anyone looking to get started in Wizard of the Coast’s popular role-playing game.",
    "So you’ve got your A-Z to help you get where you want to go, but how about your A-Z of monsters to include in your campaign? With the Monster Manual, you’ve got 150 deadly monsters to mess with, each with a detailed stat block so that planning combat encounters is as easy as pie.",
    "We know you’ve already had some monsters, but why not add 139 more to your adventures, to scare your players further? If that isn’t enough to convince you, Volo’s Guide to Monsters actually adds new playable races that aren’t included in the Player Handbook, such as the celestial Aasimar and the unique Firbolg races.",
    "Tasha’s Cauldron of Everything was a huge milestone for players of Dungeons & Dragons, adding 22 new subclasses for all core classes as well as a rework of character’s racial traits to help customize their origin story. There are also new spells, items and magical artefacts, as well as 92 different rule options for Dungeon Masters to get stuck into! Talk about lush!",
    "Much like Tasha’s guide above, Xanthar’s Guide to Everything introduces new tools and systems to spice up a character’s creation, as well as including 31 different subclasses like the Swashbuckler and Hexblade Warlock. It even gives Dungeon Master’s new tools to work with to make their campaign the best it can be!",
    "We’ll be honest, from here on out the rest of the ranking is largely subjective. But Mordenkainen’s Tome of Foes is an exciting sourcebook, as it not only adds a new playable race called the Gith, but it gives you another 120 monsters (at a slightly higher level than the ones in Volo’s Guide to Monsters) and gives you more lore about the multiverse of 5th edition D&D that can be used in your campaign.",
    "If you’re a fan of the Critical Role D&D podcast and web series, then Wildemount will be the book you’re looking for, taking place on the same continent and featuring many of the same locations, characters, items, and lore as the hit show. You get new subraces, classes, items and 40 new monster encounters, too.",
    "Yet another campaign setting sourcebook! The Sword Coast is a very popular setting for more than a few adventures, so if you’re going to be running a campaign around the area, we would recommend adding this sourcebook to your collection. It even goes into more detail about factions, and adds one new race, a Feral Tiefling.",
    "A campaign setting sourcebook that combines the world of Magic The Gathering with Dungeons & Dragons. Even if you’re not interested in the Magic The Gathering lore it adds, you’ll still be given five unique races, two new subclasses, 45 unique enemies and a variety of magical items and weapons.",
    "If exploring Ravnica wasn’t enough for you, this campaign setting adds the plane of Theros from Magic The Gathering. If you’re looking for a more hellenic adventure and love Greek settings, this will definitely be the sourcebook for you. It includes two new playable races, the lion-like Leonin and the swift-footed Satyr, as well as magical items and enemies.",
    "Not to be confused with The Wayfarer’s Guide, this campaign setting puts players in the gritty world of Eberron, a more pulpy and technologically-advanced setting for those with a penchant for steampunk stories. It includes a new race, the Warforged, 13 new subraces, as well as a variety of magical items and monsters.",
    "Created in partnership with Penny Arcade, this book adds a new race called the Verdan, and introduces heists, five new player backgrounds, and a touch of hilarity that is sorely missing in the rest of the sourcebooks. There are mechanics for helping your adventurers run their own business, too.",
    "With two new subclasses, 30 new domains of Dread and new, horrific monsters for you to explore, Van Richten’s Guide to Ravenloft is the perfect sourcebook for those wanting a touch of gothic horror, being packed with witches, zombies, vampires and the like. As a new sourcebook, we haven’t had the chance to test out just yet, but it builds on the famous Curse of Strahd adventure listed below and is well worth a look for that reason.",
    "Baldur’s Gate: Descent into Avernus is one of the more recent adventures and is especially important if you’re a fan of Larian Studio’s Baldur’s Gate 3, as it’s a direct prequel to the game. It’s a wild experience into the depths of Hell, and will have the party fighting demons, devils and archangels – all while trying to survive.",
    "Is there anything better than adding spookiness to a water-based campaign adventure? If the answer to that is no, then you’ll love Ghosts of Saltmarsh. It adds a dark, mysterious tone and has a number of different backgrounds and quests to add, alongside a full-blown adventure that’ll keep you guessing at every turn.",
    "Heists are our guilty pleasure, and in Waterdeep: Dragon Heist well… Come on, read the title. In this adventure, you’ll have to figure out who is friend or foe, but do so quick! One wrong move and the treasure trove that awaits you may become lost forever.",
    "A draconic adventure for levels 1-8, the Hoard of the Dragon Queen has players fighting against the Cult of the Dragon, a group that wishes to release the Dragon Queen Tiamat from her prison in the Nine Hells to unleash on the Forgotten Realms.",
    "An adventure that takes place after Dragon Heist, players (level 5-20) are thrown into a vast dungeon called The Undermountain in order to find and combat the mad wizard Halaster Blackcloak. With 23 levels to explore, alongside 75 mad monsters, players will have more than enough to handle in this combat-orientated adventure.",
    "Once you’re finished with the Hoard of the Dragon Queen, you can continue your adventure by moving across the world of Faerun to combat Tiamat and send her packing. But be warned, you must succeed or the world will certainly be doomed.",
    "The Curse of Strahd is a fan-favorite among players of D&D 5e thanks to the campaign introducing a new campaign setting called Ravenloft, as well as the suave nature of the main villain, the vampire himself, Strahd. It’s a gothic adventure, and one that’s perfect to play during the darker months.",
    "Don’t expect sunny weather in Icewind Dale: Rime of the Frostmaiden. In this level 1-12 adventure, players will embark on a chilling, horror campaign that offers 26 unique locations and 79 new, scary monsters.",
    "We all love a little bit of mystery in our lives, and Candlekeep Mysteries has that in spades thanks to a collection of 17 intrigue-heavy adventures for players from level 1 to 16. All adventures can be run as one-shots, or slotted into another campaign to keep things interesting.",
    "A level 1-11 campaign that takes players on a death-defying adventure, Tomb of Annihilation has players figuring out things with their fists and their heads as a disease sweeps through streets and taverns. The party has no choice but to find answers about this curse in the Jungles of Chult.",
    "Ever wanted to fight among or against giants? In this level 1-10 adventure, you’ll be able to do just that. Puny you may be in comparison, you and your party must gather your strength and take the giants head-on with the help of powerful, magic runes.",
    "So, we heard you like dungeons, and if that’s the case then Tales from the Yawning Portal is the adventure book for you. With several unique dungeons – which all include unique maps, rollable tables, and useful stats for DMs – you’ll either be thankful you played or thankful to get out alive.",
    "The Underdark is a mysterious place that’s full of creatures and inhabitants that you’ve never seen before… And it’s dangerous. In this level 1-15 adventure, players must try their hardest to seal a rift to the demonic Abyss that causes creatures of malicious intent to step into the Underdark and thus, into the Forgotten Realms. It’s up to you to stop this madness!",
    "In this level 1-15 adventure, patrons of the Elder Elemental Eye have emerged to spread chaos across the Forgotten Realms, be it through petty banditry or overthrowing cities. What will the adventuring party do to stop them?",
    "As you can probably already tell, the Lost Mine of the Phandelver is a perfect starting adventure for new players. Unlike the other sourcebooks, the Lost Mine of the Phandelver can only be accessed online, or through the D&D 5e Starter Set. But trust us when we say it’s worth it, as the adventure eases a lot of new players into role-playing.",
    "Now for something entirely different. For fans of the Rick and Morty show, this adventure will take you from level 1 to 3, but in a campaign that has the same tone as your favorite sci-fi satire. It may not be enticing for general D&D fans, but if you’re a fan of both then why not give it a go all the same?",
    "Stranger Things’ Will really did want to play D&D a lot, and now you can make his desires a reality by picking up the Stranger Things starter set. It comes with a Stranger Things themed adventure, as well as two exclusive Demogorgon figurines. Nice!"
  ],
  "headers": {
    "5": "1. Player's Handbook",
    "6": "2. Dungeon Master's Guide",
    "7": "3. Monster Manual",
    "8": "4. Volo’s Guide to Monsters",
    "9": "5. Tasha’s Cauldron of Everything",
    "10": "6. Xanathar’s Guide to Everything",
    "11": "7. Mordenkainen’s Tome of Foes",
    "12": "8. Explorer's Guide to Wildemount",
    "13": "9. Sword Coast Adventurer's Guide",
    "14": "10. Guildmasters' Guide to Ravnica",
    "15": "11. Mythic Odysseys of Theros",
    "16": "12. Eberron: Rising from the Last War",
    "17": "13. Acquisitions Incorporated",
    "18": "14. Van Richten’s Guide to Ravenloft",
    "19": "1. Baldur's Gate: Descent into Avernus",
    "20": "2. Ghosts of Saltmarsh",
    "21": "3. Waterdeep: Dragon Heist",
    "22": "4. Hoard of the Dragon Queen",
    "23": "5. Waterdeep: Dungeon of the Mad Mage",
    "24": "6. Rise of Tiamat",
    "25": "7. Curse of Strahd",
    "26": "8. Icewind Dale: Rime of the Frostmaiden",
    "27": "9. Candlekeep Mysteries",
    "28": "10. Tomb of Annihilation",
    "29": "11. Storm King’s Thunder",
    "30": "12. Tales from the Yawning Portal",
    "31": "13. Out of the Abyss",
    "32": "14. Princes of the Apocalypse",
    "33": "15. Lost Mine of the Phandelver (Starter Set)",
    "34": "16. Dungeons & Dragons vs. Rick and Morty",
    "35": "17. Stranger Things Starter Set: The Hunt for the Thessalhydra"
  },
  "links": {
    "Dungeons & Dragons": "https://www.techradar.com/news/dnd-5e-races-classes-dice"
  }
}