{
  "source": "https://www.techradar.com/news/rainbow-six-extraction",
  "title": "Rainbow Six Extraction release date, trailers, Operators and news",
  "category": "gaming",
  "updated": "2021-09-09T22:41:21Z",
  "author": "samuel-tolbert",
  "summary": "Rainbow Six Extraction pits you against an alien threat",
  "article": [
    "First revealed back in 2019, Tom Clancy's Rainbow Six Extraction (originally known as Rainbow Six Quarantine, then as Rainbow Six Parasite) was finally revealed at the Ubisoft Forward event, which took place on June 13 as part of E3 2021.",
    "While Rainbow Six Extraction's release date was initially slated for this year, it's been pushed back to January 2022, per an official tweet. Rainbow Six Extraction is a 1-3 player co-op experience which pits you and your team of Operators against an ever-evolving alien threat. You'll need to successfully complete dangerous excursions into hostile territory but will face numerous threats that will stand in your way.",
    "The game has a couple of interesting twists that should keep players on their toes – any fallen Operators will be MIA until they're rescued, and there's also the looming threat that you could lose all your hard-earned abilities you unlock during a run.",
    "Think you're up for the challenge of overcoming the growing alien spread of the Archæans? Here's everything we know about Tom Clancy's Rainbow Six Extraction.",
    "Rainbow Six Extraction's release date would have been September 16, 2021, but an official tweet in July announced the launch was pushed back until January 2022.",
    "The game will support cross-play and cross-save across all platforms, and will be available on the Ubisoft Plus subscription service.",
    "The game will be available on Xbox Series X, Xbox Series S, Xbox One, PC, PS5 and PS4 and Stadia.",
    "Tom Clancy's Rainbow Six Extraction is a PvE spin-off of the incredibly popular Rainbow Six Siege. Developed and published by Ubisoft, the game was first announced at Ubisoft's E3 2019 showcase under a different name: Rainbow Six Quarantine.",
    "The name was later changed due to Parasite, as the developer wanted to distance itself from the global pandemic, but we now know exactly what players can expect when Rainbow Six Extraction launches on September 16.",
    "You can choose from a roster of 18 Operators, each of whom have their own unique gadgets, weapons and abilities. You'll need to harness and combine the powers of the Operators effectively if you want to overcome the alien threat which is spreading across America known as the Archæans. With 12 maps to tackle set across four regions of the United States, you'll go up against procedurally generated challenges and various enemy types that will each pose a distinct challenge.",
    "As you move through each map, which are split into three subzones, the difficulty will increase. You'll unlock new React gear, though, which will let you take out the aliens more effectively.",
    "You'll need to weigh up the risk and reward when moving to new subzones, however, as if you fail, your Operator will be unavailable until they're rescued, and you'll lose the abilities you've unlocked.",
    "We also got a look at some of the game's enemies, known as Archæans. There are 10 parasitic archetypes in total, including the Spiker, Breacher, Tormentor and Apex. Each offers a distinct challenge for players to overcome, and you'll need to use a combination of stealth, abilities and teamwork to survive.",
    "We've gathered all the Rainbow Six Extraction trailers for you to watch in one place, so check them out below.",
    "Rainbow Six Extraction: PlayStation Showcase 2021 | World Trailer A new trailer for Rainbow Six Extraction was shown during Sony's PlayStation Showcase 2021 event. Here it is below in case you missed it:",
    "Rainbow Six Extraction: Gameplay Deep Dive Ubisoft showed off a deep dive into Rainbow Six Extraction's tactical-based gameplay. You can watch it below and learn about some of the threats you'll face.",
    "Rainbow Six Extraction: Cinematic Reveal Trailer There's nothing better than a fancy CGI trailer, and Rainbow Six Extraction's has its very own. Check it out below.",
    "Rainbow Six Extraction: Sprawl Teaser Get a glimpse of the unknown, sentient and consuming lifeform that's causing havoc in Rainbow Six Extraction.",
    "Rainbow Six Extraction Dev Team Title Reveal Find out more about Rainbow Six Extraction in this dev team title reveal trailer, which explains the premise of the game.",
    "E3 2019 Teaser Trailer Ubisoft first showed off Rainbow Six Extraction, previously known as Quarantine, at E3 2019. You can watch the teaser trailer for the game below.",
    "Much like Rainbow Six Siege, Rainbow Six: Extraction is a first-person shooter starring different Operators. It's a standalone game, too, and not just DLC for Rainbow Six Siege.",
    "Unlike Siege, however, which is a 5v5 multiplayer game, Rainbow Six: Extraction is 1-3 player PvE (player vs environment) game where Operators face off against alien parasite creatures. This concept was first established with the limited-time Outbreak event in Rainbow Six Siege, so you can consider this game a continuation – or evolution – of that event.",
    "Rainbow Six Extraction has at least 18 confirmed Operators in the game, though it's currently unclear if all of these Operators will be included at launch or if more will be added when the game releases. Here are the Operators that have been confirmed and the abilities they offer:",
    "Albi Albi can deploy a decoy to lure and distract enemies. She's armed with an Mx4 Storm SMG which is a pistol-caliber semi-automatic carbine.",
    "Doc Doc can fire a health pistol to heal or revive himself or teammates when downed. He's armed with an SG-CQB shotgun.",
    "Ela Ela can throw sticky proximity mines, which can stun enemies. Ela's weapon is the Scorpion EVO 3 machine gun. Finka Finka can temporarily boost the team's reactivity and survival. She can revive any downed teammates and is armed with the SPEAR .308 assault rifle.",
    "Hibana Hibana can shoot remote explosives that can stick to any surface. She's armed with a TYPE-89 assault rifle.",
    "Lion Lion can detect all moving enemies in an area for a medium duration. He wields a V3208 assault rifle.",
    "Pulse Pulse can detect VIPs, MIAs, and enemy nests through obstacles. He carries an M1014 shotgun.",
    "Sledge Sledge can equip a tactical hammer that can stun parasites and destroy walls to create new paths. He's armed with an M590A1 shotgun.",
    "Vigil Vigil's ability lets him disrupt enemies so he becomes undetectable for a medium duration. He uses a K1A1 machine gun in combat."
  ],
  "headers": {
    "4": "Rainbow Six Extraction: cut to the chase"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "tweet": "https://twitter.com/R6Extraction_UK/status/1416082687157325824",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}