{
  "source": "https://www.techradar.com/news/apple-watch-stopped-charging-you-could-get-a-free-repair-directly-from-apple",
  "title": "Apple Watch stopped charging? You could get a free repair directly from Apple",
  "category": "wearables",
  "updated": "2021-02-16T09:58:14Z",
  "author": "sofia-wycislik-wilson",
  "summary": "If watchOS 7.3.1 doesn't solve your problems, Apple will",
  "article": [
    "If you've invested in an Apple Watch, it has almost certainly become an integral part of your life. For anyone tracking runs and workouts using the wearable, problems with charging can have a serious impact.",
    "Apple has now acknowledged a problem with some devices that fail to charge after entering Power Reserve mode, and the company is offering free repairs to some owners.",
    "In some cases, simply updating watchOS to the latest version is enough to fix the issue, but in a \"small number\" of cases, Apple will need to intervene. But before you start to package up your Apple Watch and stick in the mail, you need to check whether you are eligible for the free repair.",
    "In a support document about the newly announced repair program, Apple says that \"a very small number of customers with Apple Watch Series 5 or Apple Watch SE models running watchOS 7.2 or 7.3 have experienced an issue with their watch not charging after it enters Power Reserve\".",
    "The first thing you need to do to see if you qualify for a free repair is to update your device to watchOS 7.3.1 (just head to General > Software Update to check for updates). This particular release is specific to the Apple Watch Series 5 or Apple Watch SE, and is designed solely to fix the charging issue – but it's not guaranteed to work for everyone.",
    "Apple says that once you have installed the watchOS update, you should leave your device on charge for at least 30 minutes. If you find that you're still experiencing problems with charging, you should qualify for the free repair.",
    "You'll need to get in touch with Apple and arrange to send your Apple Watch in to be fixed.",
    "The company does warn that \"your watch will be examined before service to verify that it's eligible for free repair\", indicating that this is not a repair program that can be used just to get a new battery for free!",
    "Via Engadget"
  ],
  "headers": {
    "5": "Charge check"
  },
  "links": {
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "support document": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1061313689273133700&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT212180",
    "Apple Watch Series 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "watchOS 7.2": "https://www.techradar.com/news/watchos-74-news",
    "get in touch with Apple": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9535545363700680000&sharedId=trd-us&u=https%3A%2F%2Fgetsupport.apple.com%2F%3Fcaller%3Dkbase%26SG%3DSG008%26category_id%3DSC0215%26symptom_id%3D20369",
    "Engadget": "https://www.engadget.com/apple-watchos-power-reserve-free-repair-204558746.html"
  }
}