{
  "source": "https://www.techradar.com/news/ipad-in-trouble-xiaomis-new-android-tablet-is-likely-getting-a-global-launch-soon",
  "title": "iPad in trouble? Xiaomi's new Android tablet is likely getting a global launch soon",
  "category": "tablets",
  "updated": "2021-08-16T10:27:22Z",
  "author": "tom-bedford",
  "summary": "The new iPad will have a contemporary rival",
  "article": [
    "When the Xiaomi Mi Pad 5 and 5 Pro launched, they seemed to be well-specced and affordable iPad Pro rivals (Xiaomi's words, not ours, as the Chinese company kept comparing its new slates to members of Apple's stable). The catch? It seemed the slates would only go on sale in China.",
    "That may not be the case though, as a supply chain source speaking to GizmoChina suggested Xiaomi was gearing up to launch its Mi Pad 5 in Europe in September. As with all rumors of its kind, take this with a pinch of salt, but GizmoChina can be fairly reliable for supply chain information.",
    "There's no release date set just yet, apparently, and we don't even know if both tablets will land or just the standard Mi Pad 5. But still, the launch of any new Android tablet is exciting.",
    "Pricing for the Xiaomi Mi Pad 5 isn't known outside China, but judging by the costs there, this could be a surprisingly low-cost slate.",
    "As pointed out in recent news we ran on the iPad mini, fate has conspired to give Apple a free pass with its late-2021 products. Smartphone competition like the Samsung Galaxy Note 21, OnePlus 9T and Huawei Mate 50 are either confirmed, or rumored, to be canceled, meaning the iPhone 13 series won't have many rivals.",
    "That carries over to the tablet space too, with the Samsung Galaxy Tab S8 rumored to be launching in January or February, not August or September as we expected. This would mean the iPad mini 6 and the new entry-level iPad 10.2, if either or both launch, would have no new rivals - well, unless Xiaomi steps up.",
    "If the Xiaomi Mi Pad 5 does launch in Europe in September, it would very literally rival the new iPads by giving customers a lower-cost, higher-spec tablet to consider - and it might be the only tablet doing so. The Realme Pad has been teased too, but its availability or launch window is unknown.",
    "The Android tablet sphere has been on shaky ground for a while now, but the pandemic, and subsequent rise in home working and home learning, brought it back from the brink of death. That's why we're seeing lots of brands start putting out tablets, either for the first time (like Realme) or after many years (like Xiaomi).",
    "Now we're at the tail-end of the pandemic, and the world is re-opening, it's up to these brands to see if they can keep interest going, and follow Apple's example in making their tablets anticipated yearly stables - or if these slates are just one-offs."
  ],
  "headers": {
    "4": "Analysis: giving Apple a run for its money"
  },
  "links": {
    "Xiaomi Mi Pad 5 and 5 Pro": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "GizmoChina": "https://www.gizmochina.com/2021/08/14/exclusive-xiaomi-to-launch-the-mi-pad-5-in-europe-next-month/",
    "Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "pointed out in recent news we ran on the iPad mini": "https://www.techradar.com/news/iphone-13-apple-watch-7-and-new-ipads-all-detailed-in-a-big-leak",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "Huawei Mate 50": "https://www.techradar.com/news/huawei-mate-50",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "iPad mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "iPad 10.2": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Realme Pad": "https://www.techradar.com/news/realmes-first-cheap-android-tablet-could-be-here-very-soon"
  }
}