{
  "source": "https://www.techradar.com/news/new-nintendo-switch-update-still-doesnt-add-features-that-gamers-actually-want",
  "title": "Nintendo Switch update still doesn’t add features that gamers actually want",
  "category": "gaming",
  "updated": "2021-07-06T14:42:15Z",
  "author": "adam-vjestica",
  "summary": "Opinion: The wait continues for fan-requested Switch features",
  "article": [
    "Nintendo has released a new firmware update for Nintendo Switch which brings the console to version 12.1.0.",
    "However, if you were hoping that Nintendo may have finally added some new features that gamers actually want, well, you can think again.",
    "Version 12.1.0 brings with it the usual “general system stability improvements” that seem to accompany every firmware update, but it also lets you delete old data for software if there isn’t enough space remaining on the internal storage, or microSD card, when downloading game software update data.",
    "That’s a welcome change for those who may have encountered this issue, but let’s be real: there’s so much more that Nintendo could and should have done with its system updates since the console launched. Here are a few things we’d love to see Nintendo implement sooner rather than later.",
    "After almost five years on sale, we still can’t organize Switch games into folders or pin our favorite titles to the home screen. This means that if you’re someone who likes to play through more than a few games at a time, titles will disappear off the main home screen and will be hidden away under the ‘more games’ icon. Folders would immediately fix this annoying problem, and would allow users to group their favorite titles or genres together easily, something which has been an option on Nintendo 3DS since April 2012.",
    "The Nintendo 3DS also shames the Nintendo Switch when it comes to themes and custom wallpapers. In what seemed like almost a certainty at launch, the Nintendo Switch still only has two themes to choose from: basic black and basic white. Compared to the Nintendo 3DS, which has received hundreds of custom wallpapers and themes, the lack of new Switch backgrounds seems like a huge missed opportunity for Nintendo. I’m sure I’m not the only one who would buy a Kirby theme tomorrow if Nintendo added custom themes to the Nintendo Switch.",
    "The fact that the Nintendo Switch themes are called \"basic\" black and white strongly implies that Nintendo were planning to add more themes after launch, but as of yet, nothing has materialized.",
    "We know that the Nintendo Switch supports Bluetooth, so wouldn’t it be great if Nintendo let us connect our wireless headphones to the Switch? For a portable device which is all about playing anywhere, anytime, having to use a wired pair of headphones seems rather archaic in 2021, especially as so many people are picking up the best wireless earbuds to listen to music while on the move. An update that added Bluetooth headphone support to Switch would be extremely well-received, then.",
    "Ok, this one would probably take a significant amount of work to implement, but I’d love to see achievements come to the Nintendo Switch. With both PS5, Xbox Series X, Steam and Epic Games all offering the ability to unlock achievements in games, playing games on Nintendo’s console without any sort of achievements or milestones to collect and work towards feels plain wrong. It’s even more baffling when games like New Pokémon Snap contain in-game milestones to work towards, so it’s high time Nintendo implemented achievements at a system-wide level.",
    "Nintendo has also updated the Nintendo Switch Joy-Con to version 12.1.0 according to its support website, but it won’t fix Joy-Con drift if you’ve encountered this annoying problem. Joy-Con drift is a hardware-level problem, which Nintendo has previously apologized for.",
    "It would be nice to see Nintendo eradicate this problem entirely by fixing the inherent design flaw that seems to exist with the Joy-Con controller’s analog sticks, especially as Nintendo managed to significantly improve the Nintendo Switch’s battery life with a newer model. Fixing the Joy-Con, then, should be a priority, especially as they can't be removed on the Nintendo Switch Lite, which means users need to send their whole console off for repair should the problem occur.",
    "Sadly, we’re not hopeful that Nintendo will implement any of these highly-requested features during the Switch’s lifespan, which means we might be waiting for the Nintendo Switch Pro or Nintendo Switch 2 until these fairly simple dreams are realized. For now, we can at least enjoy some more “general system stability improvements,\" for what they're worth. Update: Nintendo just announced a Nintendo Switch OLED, which upgrades the original model's 6.2-inch screen with a 7-inch OLED display. It's out October 8, 2021, but it remains to be seen whether the features we requested above will eventually come in the future via a firmware update. Fingers crossed."
  ],
  "headers": {
    "4": "Folders",
    "5": "Custom themes and backgrounds",
    "7": "Bluetooth headphone support",
    "8": "Achievements",
    "9": "More reliable Joy-Con controllers"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "version 12.1.0": "https://en-americas-support.nintendo.com/app/answers/detail/a_id/22525/~/nintendo-switch-system-updates-and-change-history",
    "microSD card": "https://www.techradar.com/best/nintendo-switch-micro-sd-cards-the-best-memory-cards-for-storing-your-games",
    "Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Nintendo 3DS": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-3ds-931771/review",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Epic Games": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed",
    "New Pokémon Snap": "https://www.techradar.com/reviews/new-pokemon-snap-review",
    "Joy-Con": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "fix Joy-Con drift": "https://www.techradar.com/how-to/how-to-fix-joy-con-drift-on-nintendo-switch",
    "Nintendo has previously apologized for": "https://www.techradar.com/news/nintendo-finally-apologizes-for-joy-con-drift-amid-lawsuit",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Nintendo Switch 2": "https://www.techradar.com/news/nintendo-switch-2-news",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review"
  }
}