{
  "source": "https://www.techradar.com/news/samsung-cloud-is-closing-down-so-migrate-your-photos-and-files-now",
  "title": "Samsung Cloud is closing down - so migrate your photos and files now",
  "category": "computing",
  "updated": "2021-03-30T09:27:45Z",
  "author": "joel-khalili",
  "summary": "Samsung Cloud will no longer support Gallery Sync, Samsung Cloud Drive or Premium Storage",
  "article": [
    "Samsung Cloud is a cloud storage service that allows owners of Samsung devices to create copies of their data or free up local storage space for apps, music and other files.",
    "However, Samsung is about to begin the process of cutting back this service, withdrawing the ability to store photos and files off-device. Soon, Samsung Cloud will only allow users to store lightweight items, such as contacts, calendars and notes.",
    "According to a notice on the website, the automatic photo and file sync features will be supported by Microsoft OneDrive instead, but only if users take the necessary action before the deadline.",
    "The pace of the Samsung Cloud shutdown will depend on the region in which you are located. The deadlines for Group 1, which consists of the UK, US, Australia and many European countries, differ from the deadlines for Group 2, which covers much of Asia, Africa and the Middle East.",
    "Members of Group 1 will need to migrate their Samsung Cloud data to OneDrive by the end of tomorrow, March 31. Affected smartphone owners should receive a notification that prompts them to activate the migration process, which is made easy thanks to a OneDrive integration.",
    "If this deadline is missed, Group 1 users will have until June 30 to download their Samsung Cloud data to their device or a computer. On July 1, all photos and files held in Samsung Cloud will be deleted outright and will no longer be recoverable.",
    "Group 2 has been given a little more time to make the necessary arrangements. These users have until May 31 to migrate their data to OneDrive and until August 31 to perform a manual download. On September 1, Samsung Cloud will no longer store the photos or files of any user, in any territory.",
    "Anyone that holds a Premium Storage subscription can expect their plan to be cancelled on either April 1 (Group 1) or June 1 (Group 2) and may receive a refund.",
    "Although free Microsoft OneDrive accounts are usually allocated only 5GB of storage, anyone migrating from Samsung Cloud will be given 15GB of storage free of charge, the same capacity as the free Samsung account.",
    "However, the expanded OneDrive storage offer will expire after one year. After that, users will either have to pay to increase their OneDrive storage capacity or transfer their data to an external hard drive, portable SSD or another cloud backup service."
  ],
  "headers": {
    "3": "Samsung Cloud deadlines",
    "8": "OneDrive storage capacity"
  },
  "links": {
    "Samsung Cloud": "https://www.techradar.com/news/samsung-cloud-storage-everything-you-need-to-know-about-it",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "a notice": "https://www.awin1.com/awclick.php?awinmid=17946&awinaffid=103504&clickref=trd-us-2670138467579223000&p=https%3A%2F%2Fwww.samsung.com%2Fuk%2Fsupport%2Fmobile-devices%2Fchanges-to-gallery-sync-samsung-cloud-drive-and-premium-storage%2F",
    "Microsoft OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "depend on the region": "https://support.samsungcloud.com/#/eof_notice/group",
    "external hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "portable SSD": "https://www.techradar.com/news/best-portable-ssd",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup"
  }
}