{
  "source": "https://www.techradar.com/news/twitter-is-the-latest-social-network-to-ban-donald-trump",
  "title": "Twitter is the latest social network to ban Donald Trump",
  "category": "computing",
  "updated": "2021-01-09T09:00:33Z",
  "author": "david-nield",
  "summary": "Reddit cracks down too",
  "article": [
    "After an initial 12-hour block issued in the wake of Wednesday's storming of the US Capitol building, Twitter has now suspended Donald Trump's personal @realDonaldTrump account permanently, \"due to the risk of further incitement of violence\".",
    "The outgoing US President had already been kicked off Facebook and Instagram for an indefinite period, with Facebook boss Mark Zuckerberg saying that Trump was using the platforms \"to incite violent insurrection against a democratically elected government\".",
    "\"After close review of recent Tweets from the @realDonaldTrump account and the context around them – specifically how they are being received and interpreted on and off Twitter – we have permanently suspended the account due to the risk of further incitement of violence,\" explained Twitter in a blog post.",
    "\"In the context of horrific events this week, we made it clear on Wednesday that additional violations of the Twitter Rules would potentially result in this very course of action,\" continues the post, which goes into details of one specific tweet that broke these rules.",
    "\"Our public interest framework exists to enable the public to hear from elected officials and world leaders directly,\" explains Twitter. \"It is built on a principle that the people have a right to hold power to account in the open.\"",
    "\"However, we made it clear going back years that these accounts are not above our rules entirely and cannot use Twitter to incite violence, among other things. We will continue to be transparent around our policies and their enforcement.\"",
    "Twitter has taken steps to prevent Trump tweeting from other accounts too, such as the official @POTUS Twitter handle, which will be passed on to incoming President Joe Biden on January 20. Meanwhile, Reddit is also taking action, with the r/Donaldtrump subreddit also banned for inciting violence.",
    "Hundreds of protestors occupied and damaged the US Capitol building on Wednesday, in a riot that left five people dead and others seriously injured. Donald Trump had earlier encouraged his supporters to march on the building amid his continued and baseless claims of fraud in the 2020 US Presidential election."
  ],
  "headers": {
    "4": "\"These accounts are not above our rules\""
  },
  "links": {
    "@realDonaldTrump": "https://twitter.com/realdonaldtrump",
    "already been kicked off": "https://www.techradar.com/news/donald-trump-banned-indefinitely-from-facebook-as-mark-zuckerberg-issues-statement",
    "blog post": "https://blog.twitter.com/en_us/topics/company/2020/suspension.html",
    "@POTUS": "https://twitter.com/potus",
    "r/Donaldtrump": "https://www.reddit.com/r/Donaldtrump/"
  }
}