{
  "source": "https://www.techradar.com/news/imac-27-inch-set-to-arrive-in-2022-with-mini-led-display-and-promotion-support",
  "title": "iMac 27-inch set to arrive in 2022 with mini-LED display and ProMotion support",
  "category": "computing",
  "updated": "2021-10-20T10:10:40Z",
  "author": "jess-weatherbed",
  "summary": "Lets keep this ball rolling",
  "article": [
    "If you were hoping for a new iMac or iMac Pro reveal at the Apple Unleased event on October 18, then you may have come away slightly disappointed. Word on the street is that 2022 will bring a larger 27-inch model of the Apple all-in-one, equipped with the same mini-LED display that's currently featured on the freshly released MacBook Pro 14-inch and MacBook Pro 16-inch.",
    "This speculation comes from display analyst Ross Young, who correctly predicted that the latest generation of MacBook Pro devices would be equipped with a mini-LED display.",
    "His track record certainly adds weight to his prediction, but as with all unverified leaks and rumors, don't take anything as gospel until we hear it from Apple directly.",
    "There was some initial confusion that resulted in claims that a new external monitor under the XDR branding was being developed, as reported (and since corrected) by MacRumors. Young has since clarified on Twitter that his leaks are regarding a new iMac desktop computer rather than a monitor, though he has not counted it out entirely for future development.",
    "Young also claims that the refresh rate of the 2022 iMac will switch between a range of 24Hz and 120Hz for efficiency and that this will be an early 2022 launch, likely announced in the first quarter. With any luck, this will also come with a redesign to meet the current look of the 24-inch iMac, complete with a new 1080p webcam and flashy colored chassis.",
    "We previously reported that an M1 Pro or M1 Max-powered iMac or iMac Pro 27 may have been on track for this year but has since been delayed until 2022 as Apple doesn't want its launches to compete with each other too much.",
    "This is another leak from @dylandkt rather than an official press release of course, so even if it does tie into the current predictions, take it with a healthy pinch of salt.",
    "The iMac 24-inch that launched earlier in 2021 is equipped with an M1 processor, which places it in line with the MacBook Air (M1, 2020) for performance. This is fine for people who don't use demanding applications, but one of the benefits of a desktop over portables is typically a boost in power. As things stand right now, Apple is walking on two opposing ends of the desktop market with no satisfying middle ground.",
    "The iMac serves well as a cute, colorful family PC that can be used for homework and home office working, providing you don't have any heavy-duty applications that need running. On the other hand, the current iMac 27 is still rocking an Intel 10th-generation Comet Lake processor.",
    "This is far from outdated right now, but a larger, slightly more powerful AIO running Apple silicon would help fill the huge jump between the current iMac range and the Mac Pro, Apple's extremely pricey and insanely powerful desktop computer.",
    "There's plenty of appeal in a larger, more capable iMac without jumping directly into the Pro range of devices that are often out of people's affordability. A mini-LED display could certainly sweeten the deal, so we hope the predictions regarding an iMac 27 update are accurate. Our home offices demand it."
  ],
  "headers": {
    "3": "Bigger, better, brighter",
    "7": "Analysis: Apple needs more silicon desktop solutions"
  },
  "links": {
    "Apple Unleased event on October 18": "https://www.techradar.com/news/live/apple-event-october-2021-live-blog",
    "MacBook Pro 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "MacBook Pro 16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "Ross Young": "https://twitter.com/DSCCRoss/status/1447967377426165765",
    "correctly predicted": "https://www.techradar.com/news/new-macbook-pros-could-get-120hz-mini-led-screens-but-at-what-cost",
    "MacRumors": "https://www.macrumors.com/2021/10/19/apple-27-inch-xdr-display-early-2022-rumor/",
    "24-inch iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "M1 Pro or M1 Max-powered iMac or iMac Pro 27": "https://www.techradar.com/news/want-a-new-imac-27-you-might-have-to-wait-until-2022",
    "@dylandkt": "https://twitter.com/dylandkt",
    "iMac 24-inch": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}