{
  "source": "https://www.techradar.com/news/amd-is-looking-to-hire-more-linux-engineers",
  "title": "AMD is looking to hire more Linux engineers",
  "category": "computing",
  "updated": "2021-02-12T13:30:48Z",
  "author": "mayank-sharma",
  "summary": "Job postings include several internships, suggesting Linux is part of AMD's long-term outlook",
  "article": [
    "Chip giant AMD has issued a number of Linux-related job postings in an apparent bid to improve the support for open source software on its hardware.",
    "The semiconductor company’s increasing footprint in the enterprise space with its recent high-performance computing (HPC) wins, could perhaps be the reason behind the headhunting. Even on the desktop front, AMD is garnering a lot of support from Linux gamers, in terms of adoption of its processors and graphics cards with desktop PCs.",
    "In light of these developments, it now appears that the hardware vendor is trying to make it easier for Linux users to get the most out of AMD hardware, by hiring engineers to work closely with the upstream kernel as well as the various popular distros.",
    "The listings cover a range of roles and experience levels, further suggesting that AMD could be set for a major push to boost its Linux capabilities going forward.",
    "Besides hiring Linux engineers and system architects among the traditional engineering roles, AMD is also looking for a manager to oversee their kernel and virtualization development efforts.",
    "The Santa Clara-based company is also looking for a client engineering Linux lead who will coordinate with OEM partners as well as with Linux distros to ensure better support for AMD hardware.",
    "Many of the new job postings begin with a call to \"step up into a new organization built to engage more strategically and deeply with the technical teams of our commercial customers.\"",
    "Phoronix reports that when asked if there is a “new Linux organization” at AMD as mentioned in the postings, the company replied in the negative, but did say that the move is “part of the overall expansion at AMD.”",
    "Most of the jobs are based out of Austin, Texas and in addition to the full time roles also include several internship opportunities as well.",
    "Via: Phoronix"
  ],
  "headers": {
    "3": "Better support for AMD on Linux"
  },
  "links": {
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "increasing footprint in the enterprise space": "https://www.techradar.com/news/year-in-review-how-amd-did-in-2020",
    "high-performance computing (HPC) wins": "https://www.techradar.com/news/amd-claims-title-of-worlds-fastest-gpu-at-least-when-it-comes-to-hpc",
    "support from Linux gamers": "https://www.techradar.com/news/amds-gpus-and-cpus-are-becoming-seriously-popular-with-linux-gamers",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "Phoronix": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Hiring-More-Linux-2021"
  }
}