{
  "source": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
  "title": "Thor: Love and Thunder: cast, release date, plot and what we know so far",
  "category": "entertainment",
  "updated": "2021-11-29T15:40:42Z",
  "author": "samuel-roberts",
  "summary": "Love is in the air for the god of thunder in Thor 4",
  "article": [
    "Thor: Love and Thunder will feature a very different god of thunder to the one we first in Kenneth Branagh's original movie, more than a decade ago.",
    "Since he became one of the founder members of the Avengers and fought the Dark Elves in disappointing sequel The Dark World, Thor's been through something of a reinvention. Director Taika Waititi used the brilliant sci-fi action-adventure of Thor: Ragnarok to give Chris Hemsworth's Asgardian a comedic makeover. And, while Avengers: Infinity and Endgame put him through the wringer, it looks like we'll be getting more of the same in the eagerly anticipated Thor: Love and Thunder.",
    "The most exciting news about this fourth movie in the series is that Natalie Portman is returning to the franchise as Dr Jane Foster, the astrophysicist who joined forces with Thor in the first two films. There's a twist, however – this time Foster will get to wield Mjolnir for herself, and gain god-like powers of her own...",
    "So, with its release less than eight months away, here's everything you need to know about Thor: Love and Thunder...",
    "Release date: The movie is scheduled to land in theaters on July 8, 2022. Expect it to appear on Disney Plus a few months later.",
    "Story: The Thor: Love and Thunder story is heavily inspired by Jason Aaron’s acclaimed run on The Mighty Thor, in which Jane Foster becomes the new incarnation of the god of thunder.",
    "Cast: The returning Hemsworth and Portman are joined by Ragnarok returnees Tessa Thompson and Waititi himself. The movie's all-star cast will also feature the Guardians of the Galaxy, and former Batman Christian Bale as villain Gorr the God Butcher.",
    "The Thor: Love and Thunder release date is currently July 8, 2022. The movie will debut in theaters before coming to Disney Plus at least 45 days later.",
    "It was originally set for November 5, 2021, but like so many theatrical releases, it was pushed back by the coronavirus pandemic. Thor 4 was briefly set for a May 2022 launch, until a Marvel announcement in October 2021 confirmed it was delaying all of its 2022/2023 launches. Love and Thunder subsequently took the date previously occupied by Black Panther 2: Wakanda Forever.",
    "The movie’s shoot wrapped in Australia in June 2021 (as revealed in the tweet below), with Waititi now heading into the traditionally lengthy post-production process.",
    "You'll be pleasantly unsurprised to find out that we're going to see the return of Chris Hemsworth as the god of thunder – and some of his New Asgardian friends will be joining Odinson in the Thor: Love and Thunder cast. Tessa Thompson reprises her role as Valkyrie, while Waititi himself climbs back into his performance capture suit to play wannabe revolutionary Korg – a contender for the title of funniest character in the whole of the MCU.",
    "One Thor regular who (apparently) won’t be back to cause mischief, however, is the thunder god’s adoptive brother Loki, who's now otherwise engaged on his own Disney Plus show. \"We have explored about as much as we can about these two brothers,\" star Tom Hiddleston explained. \"We talked about the Thor movies as a family saga, and the diametric opposition between Thor and Loki, and duality and antagonism, being a book that perhaps should remain closed for the moment.\"",
    "But the biggest news about the Thor: Love and Thunder cast is the return of Natalie Portman as Dr Jane Foster. Having appeared in the original Thor and disappointing 2013 sequel Thor: The Dark World, Portman was nowhere to be seen in Thor: Ragnarok, as Thor spent most of the movie on the alien world of Sakaar. But she’ll be back with a thoroughly beefed up role in Thor: Love and Thunder, as Foster wields Thor’s magical hammer, Mjolnir, and takes on the mantle of the goddess of thunder.",
    "Another Ragnarok absentee making a comeback is Jaimie Alexander, who's reportedly returning as Asgardian warrior Sif – she was absent when her usual sidekicks, the Warriors Three, were bumped off in Thor: Ragnarok, though she did have a cameo in Loki episode 4.",
    "From elsewhere in the MCU, the Guardians of the Galaxy will show up in Thor: Love and Thunder, ahead of the release of their own third movie in 2023 – hardly surprising, seeing as Thor ended Avengers: Endgame in the company of Marvel’s most beloved bunch of a-holes.",
    "Chris Pratt (Star-Lord), Dave Bautista (Drax the Destroyer), Karen Gillan (Nebula), Pom Klementieff (Mantis) and Sean Gunn (Kraglin) are reportedly all back in action in the fourth Thor movie – and don’t be surprised if digital characters Rocket and Groot join them too.",
    "Crossing over from another superhero universe, former Batman Christian Bale becomes the latest actor to score roles as both DC and Marvel characters, as he takes on Thor: Love and Thunder villain duties as Gorr the God Butcher. In the comics, Gorr ends up gaining some divine powers thanks to a series of unfortunate events, and then takes it upon himself to rid the universe of gods wherever he finds them. It'll be intriguing to see how this character looks on the big screen, especially given Bale's love of transforming himself for his roles.",
    "Russell Crowe (who played Superman’s father, Jor-El, in Man of Steel) also joins the exclusive DC-plus-Marvel club. According to a report in Entertainment Weekly), the star has revealed he’s playing Zeus in the new movie. Expect to see Greek and Norse mythology existing side-by-side in the MCU for the first time.",
    "There’ll also be cameos for Luke Hemsworth, Matt Damon and Sam Neill, returning as the actors playing Thor, Loki and Odin, respectively, in an in-movie play retelling the story of Asgard. Leaked set photos also suggest a major Hollywood star is playing Thor and Loki’s sister, Hela – but we won’t say her name here in case we ruin the surprise.",
    "There’s no Thor: Love and Thunder trailer yet, but surely a teaser can't be far away. Recent MCU releases have debuted their first trailers 4-6 months ahead of release, so we'd expect to get our first look early in 2022.",
    "We expect Thor: Love and Thunder to address the way we left the god of thunder at the end of Avengers: Endgame – that is, overweight, and teaming up with the Guardians of the Galaxy. This movie will be released before Guardians of the Galaxy Vol. 3 (due in 2023), so we expect that plot point to be touched upon here. Valkyrie was left as the ruler of New Asgard, a seaside village on Earth, so it'll be interesting to see how their stories link up again.",
    "Taika Waititi has indicated that the overweight Thor stuff had been done already, which perhaps explains why Hemsworth is in such godly shape in all the photos that have leaked from the set.",
    "Love and Thunder will be inspired by the Mighty Thor comics of star Marvel writer Jason Aaron. In that comic, Odinson loses the ability to lift Mjolnir, and Jane Foster takes on the mantle of Thor, while simultaneously battling cancer in her human hours.",
    "\"When we were shooting Ragnarok I was reading one storyline by Jason Aaron, The Mighty Thor,\" director/co-wroter Taika Waititi said on-stage at San Diego Comic Con 2020. \"And for those of you who know that storyline, it's incredible, it's full of emotion, love and thunder, and it introduces, for the first time, female Thor. So, for us there's only one person who could play that role. Only one.\"",
    "Natalie Portman was introduced on-stage during the event, wielding Mjolnir, confirming she's back to play the character.",
    "Just as Thor: Ragnarok only superficially referenced the Planet Hulk storyline from Marvel's comics, we'd be surprised if Thor: Ragnarok film was a literal adaptation of the Mighty Thor series. That said, Portman did confirm in a 2020 Yahoo interview that \"[Jane]’s going through cancer treatment and is superhero on the side,” hinting that the movie will be taking significant inspiration from the comics.",
    "Waititi has previously described the film as \"so over the top now in the very best way,\" after writing four or five drafts. \"It makes Ragnarok seem like a really run of the mill, very safe film…this new film feels like we asked a bunch of 10-year-olds what should be in a movie and just said yes to everything.\"",
    "The What We Do in the Shadows and Jojo Rabbit director has since emphasized Thor: Love and Thunder's over-the-top nature in an interview with Empire. “I've done some crazy s**t in my life, I've lived, like, ten lifetimes, but it's the craziest thing I've ever done,” he said. “If you wrote down all the elements of this film, it should't make sense. It's almost like it shouldn't be made. If you walked into a room and said, 'I want this and this and this.’ Who's in it? These people. What are you going to call it? Love and Thunder. I mean, you'd never work again. Maybe I won't after this...”",
    "It also looks like he's not holding back on the central love story, which suggests Thor 4 could be the MCU's first bona fide romance movie. “What I wanted to do from the beginning was to ask, ‘What are people expecting the least from this franchise?’” Waititi explained in an interview with Wired. “Oh, I know – full blown love story!” He also told BBC News the script is “very romantic”.",
    "The set photos below, tweeted by Thor: Love and Thunder News, play up the love story angle. It's also widely assumed that the couple's hairstyles suggest these are flashbacks to The Dark World era.",
    "Also worth noting: in Thor: Ragnarok, a fan tells Thor she's “sorry to hear that Jane dumped you.” He counters that, “I dumped her. It was a mutual dumping.” Whatever really happened between the couple, it's clear there's plenty about their relationship in the intervening years we don't yet know – expect these details to form an integral part of the Thor: Love and Thunder story.",
    "It's curious that Thor is the only solo series to get four movies in the MCU so far, but Ragnarok was something of a soft reset for the character. Waititi left behind the bland gods and prophecies and made a weird sci-fi comedy with some of the DNA of his other, earlier movies. And the return of Portman here has so much potential to show us new sides of the MCU.",
    "It's no wonder Waititi's been lined up to direct a Star Wars movie after Thor: Love and Thunder. He just makes great, fun films."
  ],
  "headers": {
    "7": "Thor: Love and Thunder release date: July 2022",
    "10": "Thor: Love and Thunder cast: who's starring alongside the god of thunder?",
    "19": "Thor: Love and Thunder trailer: expect to see something early in 2022",
    "20": "Thor: Love and Thunder story: the script is “very romantic”",
    "31": "More Thor makes a lot of sense"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "delaying all of its 2022/2023 launches": "https://www.techradar.com/news/marvels-phase-4-plans-in-tatters-as-it-delays-thor-4-black-panther-2-and-more",
    "Black Panther 2: Wakanda Forever": "https://www.techradar.com/news/black-panther-2-release-date-cast-plot-and-everything-you-need-to-know-about-wakanda-forever",
    "Tom Hiddleston explained": "https://www.techradar.com/news/loki-wont-appear-in-thor-love-and-thunder-heres-why",
    "Thor: The Dark World": "https://www.techradar.com/news/is-thor-the-dark-world-really-the-worst-mcu-movie",
    "reportedly returning": "https://deadline.com/2020/12/sif-mcu-jaimie-alexander-thor-love-and-thunder-and-loki-1234655160/",
    "Loki episode 4": "https://www.techradar.com/news/loki-episode-4-recap-takes-the-show-in-a-whole-new-direction",
    "Entertainment Weekly": "https://ew.com/movies/russell-crowe-zeus-thor-love-and-thunder/",
    "cameos for Luke Hemsworth, Matt Damon and Sam Neill": "https://www.techradar.com/news/thor-love-and-thunder-set-photos-reveal-loki-features-in-the-movie-sort-of",
    "Yahoo": "https://www.yahoo.com/lifestyle/natalie-portman-forging-fairy-tales-130143489.html",
    "previously": "https://collider.com/thor-4-script-over-the-top-taika-waititi/",
    "Empire": "https://www.empireonline.com/movies/news/thor-love-thunder-shouldnt-make-sense-taika-waititi-exclusive/",
    "Wired": "https://www.wired.co.uk/article/taika-waititi-free-guy",
    "BBC News": "https://www.bbc.co.uk/news/av/entertainment-arts-53491521",
    "Waititi's been lined up to direct a Star Wars movie": "https://www.techradar.com/news/new-star-wars-movies-and-tv-shows"
  }
}