{
  "source": "https://www.techradar.com/news/new-amazon-echo-show-10-release-date-confirmed",
  "title": "New Amazon Echo Show 10 release date confirmed",
  "category": "smart-home",
  "updated": "2021-01-28T09:53:06Z",
  "author": "carrie-ann-skinner",
  "summary": "After a long wait, the new Amazon Echo Show 10 will finally be available in the US and the UK",
  "article": [
    "Amazon's long-awaited new Echo Show 10 has finally been given a release date in the US and the UK. The new-look smart speaker, which features a 10-inch HD display and automatically rotates to ensure it's always facing you when you move around the room, was unveiled in September 2020, along with a number of other new Echo devices.",
    "However, Amazon has now listed the smart speaker as being released on February 25, nearly four months after it was first announced. The new Amazon Echo Show 10 costs $249.99 / £239.99 and is available to pre-order from Amazon now. However, an Australian release date has yet to be confirmed.",
    "Like the other Echo devices unveiled at the same time, the new Echo Show 10 sports a rounder design that's a departure from previous models, and comes in either a charcoal or white fabric finish. Amazon says the brushless motor that enables the device to rotate is \"completely silent\" so it won't make irritating noises in use.",
    "The smart display also features a 13MP wide-angle camera. It can pan and zoom during video calls, so you're always in the centre of the shot, just like the Facebook Portal.",
    "The camera also means the new Echo Show 10 can double as a home security camera if you don't already have one. You can view the live feed from the camera on another Echo Show or via the Alexa app on your phone and ask Alexa to rotate the Echo Show 10 so you can see various angles of the room.",
    "There's a manual cover for the camera, which when activated will also stop the smart display rotating too.",
    "Amazon's voice assistant, Alexa is built-in, and can provide you with updates on your schedule, answer your burning questions, play music and even control your smart home devices.",
    "The new Amazon Echo Show 10 has a cylindrical 2.1 speaker system with a wraparound grille. It also supports Adaptive Sound, which means the soundstage can be automatically customized to suit the room it's in."
  ],
  "headers": {
    "2": "New rounder design"
  },
  "links": {
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Facebook Portal.": "https://www.techradar.com/reviews/facebook-portal-tv"
  }
}