{
  "source": "https://www.techradar.com/news/dont-wait-for-windows-11-grab-my-favorite-chromebook-before-prime-day-ends",
  "title": "Don’t wait for Windows 11, grab my favorite Chromebook before Prime Day ends",
  "category": "computing",
  "updated": "2021-06-22T14:31:47Z",
  "author": "richard-devine",
  "summary": "A Chromebook for everyone",
  "article": [
    "You can always rely on Amazon's Prime Day deals to surface some hot discounts on Chromebooks – after all, they’re some of Amazon’s most popular laptops – but not all Chromebooks are good. It’s easy to get trapped by a low price, but end up with a laptop that isn’t up to much.",
    "Fortunately, there's one Chromebook on Prime Day that has the benefit of being both extremely affordable and high quality: the Lenovo Chromebook Flex 5.",
    "I picked one of these up about six months ago, and since then it’s been my go-to laptop when I’m working, relaxing, and even gaming. Chrome OS has matured to a point that it’s a serious contender in the desktop OS space ,and when you slap it onto a laptop as good as the Lenovo Chromebook Flex 5 you’re onto a winner. Even with Windows 11 on the horizon, here’s why you ought to pick up this outstanding laptop while you still can.",
    "(Not in the US? Scroll down for the best Chromebook deals where you are.)",
    "Whereas many mid-tier Chromebooks go for an Intel Celeron or even ARM processor, the Lenovo Chromebook Flex 5 goes a step above and includes a 10th Gen Intel Core i3. As such you get better overall performance than many similarly priced Chromebooks.",
    "The other standout hardware features are the keyboard and the display. Lenovo makes some of the best laptop keyboards around and that expertise has made its way down to even this affordable Chromebook. It’s incredibly enjoyable to type on for long periods of time.",
    "You also get a 13.3-inch 1080p touch display that looks fantastic. There are much worse displays than this found on laptops costing twice as much. It supports the USI stylus standard, so with a compatible pen, you can scribble away to your heart’s content. And the pièce de résistance is that it’s fully convertible, meaning you can kick back and use it as a tablet or just fold the keyboard out of the way to watch a movie.",
    "The Lenovo Chromebook Flex 5 is also a pretty handy little gaming machine. No, you won’t be loading up your Steam library (though Steam does run on a Chromebook just fine), but you can play the likes of Cyberpunk 2077, Apex Legends, Metro Exodus, and many more of today’s finest games through the cloud using services like Google Stadia and Nvidia GeForce Now.",
    "The speakers are pretty good, and since you can just hook up a gamepad like an Xbox One or Google Stadia controller, you’d be hard pushed to tell you were playing on a Chromebook.",
    "There was a day that getting real work done on a Chromebook was hard. The operating system’s origins as an extension of the Chrome browser presented a number of limitations. It’s still based on the browser (you can’t have Chrome OS without it), but the operating system has matured far beyond those early days.",
    "It also makes a Chromebook a good buy for any type of laptop user. Just want to browse the web and do a little light work? No problem. A heavy media consumer? Absolutely fine. Like gaming? Sure, why not.",
    "Chrome OS is built with a number of goodies that make it extremely flexible. Android is baked in and the Google Play Store is pre-loaded. This makes your favorite smartphone apps available to run on your laptop, in many cases providing an advantage over even Windows 10. But apps like Netflix, Disney+, Prime Video, all work flawlessly on a Chromebook, even with their Android-specific enhancements like downloading to watch offline.",
    "You can also run native Linux apps on a Chromebook, opening it up to a whole other world of productivity. Linux has some outstanding free and open source apps that will enhance your life on a Chromebook. GIMP, for example, is your Photoshop alternative, LibreOffice is a native Microsoft Office-a-like and you can even edit videos or get down to some serious coding with apps like Kdenlive and Microsoft Visual Studio Code.",
    "There are limitations still, and if you are absolutely entrenched in a Windows or Mac-only application, you might find it harder to switch. But honestly, for most people, most of the time, there will be an easy solution to any problem with a Chromebook. I’ve recently started exploring the vast world of web development and get by just as well on my Lenovo Chromebook Flex 5 as on my desktop PC.",
    "Whether it’s for yourself or for the kids to do their schoolwork on, the Lenovo Chromebook Flex 5 is a brilliant laptop, made even more spectacular by its hefty Prime Day discount. It’s close in hardware and design to its Windows counterpart, and a definite standout in the world of the Chromebook.",
    "Its current price is also the lowest we’ve seen it and naturally, when the curtain draws on Prime Day it will be gone. I absolutely love this laptop, it’s been a faithful companion throughout 2021 so far and I’ll be using it for a long while to come. It’s compact and affordable without making unnecessary compromises, and you really don’t want to wake up tomorrow and regret that you didn’t buy one.",
    "This deal is (sadly) specific to the US but if you’re hunting for a new Chromebook, these are the best deals you can find right now where you are."
  ],
  "headers": {
    "4": "One of the best Chromebooks at the best price",
    "9": "Chromebooks are great laptops for every user",
    "14": "This really is a deal not to miss",
    "16": "More Chromebook deals",
    "17": "More Amazon Prime Day deals in the UK"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Lenovo Chromebook Flex 5": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLenovo-Chromebook-i3-10110U-Integrated-82B80006UX%2Fdp%2FB086383HC7%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9968225346661230000-20",
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia"
  }
}