{
  "source": "https://www.techradar.com/news/asus-cmp-40hx-leaks-online-reveals-up-to-43mhs-hash-rate",
  "title": "Asus CMP 40HX leaks online, reveals up to 43MH/s hash rate",
  "category": "computing",
  "updated": "2021-04-26T15:41:31Z",
  "author": "john-loeffler",
  "summary": "The news includes a rumor on CMP prices",
  "article": [
    "A newly leaked benchmark from an Asus CMP 40HX, the latest cryptomining GPU based on Nvidia's Turing TU106-100 GPU, appeared online this week and appears to show an improved hash rate of 43.77MH/s, up from the 36MH/s specified by Nvidia.",
    "The test result shows a CMP cluster of eight Asus CMP 40HX cryptomining processors, running between 43.31MH/s and 43.77MH/s, which is roughly a 21% improvement over the reference specification provided by Nvidia.",
    "The cards were power-optimized, according to VideoCardz, and likely had their memory speeds modified, leading to the improved hash rate. The CMP 40HX, along with the CMP 30HX, were originally planned to launch in Nvidia's first fiscal quarter, which ends on May 2, but we are only just starting to see announcements from Nvidia's board partners like Gigabyte about new CMP offerings and none appear to have officially gone on sale.",
    "This leaked CMP 40HX mining benchmark, if true, would be the first time we've gotten some solid data on the mining efficiency of this new CMP. We won't know about its actual hash rate until these cards actually make their way to customers, and we don't have any firm dates on when that might be.",
    "The news from VideoCardz also revealed some new details about possible pricing for the new CMPs, at least from Asus. Originally, they reported that the Asus CMP 30HX was going to launch in May at $799 (about £575/AU$1,020), but that appears to have changed.",
    "Now, Asus is reportedly going to sell its CMP 40HX for $699 (about £500/AU$895), and its CMP 30HX for $599 (about £430/AU$765). This would make both of these cards much more appealing to cryptominers, especially if Nvidia follows through on its plan to extend its new cryptomining limiter on new Ampere GPUs from the RTX 3060 up through the RTX 3090.",
    "That all remains to be seen, though. Without official word from any of Nvidia's AIB partners about their pricing and release dates, it's impossible to tell what kind of impact their CMPs will have on the broader market for graphics cards, which are still in very short supply."
  ],
  "headers": {
    "4": "New pricing details on CMP 30HX and CMP 40HX"
  },
  "links": {
    "specified by Nvidia": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1214257195195970800&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-us%2Fcmp%2F",
    "VideoCardz": "https://videocardz.com/newz/asus-cmp-40hx-mining-card-tested-allegedy-launches-at-699-usd",
    "Gigabyte": "https://www.techradar.com/news/gigabyte-cmp-30hx-officially-announced-but-price-and-release-date-still-a-mystery",
    "reported": "https://videocardz.com/newz/asus-cmp-30hx-mining-card-features-argb-lighting",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}