{
  "source": "https://www.techradar.com/news/you-can-already-save-dollar10-on-monster-hunter-stories-2",
  "title": "You can already save $10 on Monster Hunter Stories 2",
  "category": "gaming",
  "updated": "2021-07-05T15:52:27Z",
  "author": "tabitha-baker",
  "summary": "Early savings on the latest Monster Hunter spin-off",
  "article": [
    "Monster Hunter Stories 2 is set for release this week, but Amazon's latest Nintendo Switch deals can already save you $10 before it's even hit the shelves. You can pre-order Wings of Ruin for just $49.99 right now and still get speedy day one delivery on the July 7 launch day. That's an excellent deal considering we rarely see such savings on Nintendo Switch titles once they're already out in the wild, let alone still up for pre-order.",
    "We almost never see Nintendo Switch deals on games before they hit the shelves, although Monster Hunter Stories 2's position as a spin-off may be helping it here. Nevertheless, the original was beloved by main franchise fans and newcomers alike, so there's likely plenty to get your teeth into here. However, you'll find plenty more Nintendo Switch game deals further down the page as well.",
    "Monster Hunter Stories 2 is the second spin-off to use the 'Stories' moniker, with the previous instalment dating all the way back to the Nintendo 3DS. Since then we've come a long way and we already know of five post-launch updates heading to the game once it's out in the wild - including the addition of Rise's Palamutes.",
    "We're rounding up all the best Nintendo Switch deals and Nintendo Switch Lite bundles right here on TechRadar, but you'll also find a range Pro Controller price drops taking place right now as well."
  ],
  "headers": {
    "3": "More Nintendo Switch deals"
  },
  "links": {
    "for just $49.99 right now": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FMonster-Hunter-Rise-Nintendo-Switch%2Fdp%2FB08JJ37XVW%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2452086391698384400-20",
    "Nintendo Switch game deals": "https://www.techradar.com/deals/cheap-nintendo-switch-game-deals-sales",
    "Nintendo Switch deals": "https://www.techradar.com/news/nintendo-switch-deals",
    "Nintendo Switch Lite bundles": "https://www.techradar.com/deals/cheap-nintendo-switch-lite-prices-bundle-deals",
    "Pro Controller price": "https://www.techradar.com/deals/nintendo-switch-pro-controller-price-sales-cheap"
  }
}