{
  "source": "https://www.techradar.com/news/george-rr-martins-work-on-elden-ring-wrapped-up-years-ago",
  "title": "George R.R. Martin’s work on Elden Ring wrapped up ‘years ago’",
  "category": "gaming",
  "updated": "2021-06-19T09:34:01Z",
  "author": "emma-boyle",
  "summary": "“These games, they’re like movies, they take a long time to develop\"",
  "article": [
    "George R.R. Martin has recently been discussing his role as a collaborator in the development of FromSoftware’s Elden Ring and it turns out his part in the project was completed \"years ago\".",
    "Speaking to WTTW News Chicago, the Game of Thrones creator said that, from him, FromSoftware “wanted a world created to set the game in.” “World building is a big factor in fantasy and science fiction,\" he explains, \"You’re not only talking characters and the plot, but the setting is almost as important as everything else: Tolkien’s Middle-Earth, Robert E. Howard’s Hyborian Age, the foundation universe of Isaac Asimov.”",
    "Martin says he “worked up a fairly detailed background for them” and that the developer “took it from there.” As a result, his “work on it was actually done years ago. These games, they’re like movies, they take a long time to develop.”",
    "It seems that, once his work was completed, Martin didn’t see too much more of the game as he reveals “it’s been several years since I last seen them” and he is “as excited as anybody else to see it.” That said, he’s not been completely in the dark as he adds, “they would come and periodically show me some monsters they’d designed or the latest special effects, or the cool things.”",
    "This largely lines up with Hidetaka Miyazaki’s description of Martin’s involvement in the project in a recent interview with IGN. According to Miyazaki, Martin “brought things to the table that we couldn't have done by ourselves, in terms of that rich storytelling and that sense of character and drama.”",
    "Miyazaki explains that Martin was the source for the name of the game’s setting, the Lands Between, and that after getting the “initial impetus from George R.R. Martin's mythos”, the team “used that to paint the foundation and the initial layers of the game.”",
    "After a long wait, fans finally got the chance to see a brand new Elden Ring trailer during the recent Summer Game Fest: Kick Off Live. Between this and recent revelations on what the game will involve from Miyazaki, it feels like Elden Ring is finally starting to step out of the shadows. If you missed the trailer, or you just can't resist watching it one more time, you can see it for yourself below:",
    "During the stream, we also learned Elden Ring’s release date: January 21 2022. When the game releases, you’ll be able to play it on PS4, Xbox One, PS5, Xbox Series X, Xbox Series S and PC."
  ],
  "headers": {
    "6": "Trailer revealed"
  },
  "links": {
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "WTTW News Chicago": "https://news.wttw.com/2021/06/16/george-rr-martin-talks-northwestern-writing-and-game-thrones",
    "IGN": "https://www.ign.com/articles/elden-ring-miyazaki-hidetaka-full-interview-summer-of-gaming",
    "recent revelations on what the game will involve from Miyazaki": "https://www.techradar.com/news/elden-ring-dev-fromsoftware-shares-more-info-on-its-open-world-and-whats-in-it",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}