{
  "source": "https://www.techradar.com/news/nintendo-direct-september-2021-all-the-biggest-announcements-you-need-to-know",
  "title": "Nintendo Direct September 2021: all the biggest announcements you need to know",
  "category": "gaming",
  "updated": "2021-09-24T11:08:28Z",
  "author": "rhys-wood",
  "summary": "A whirlwind Nintendo Direct",
  "article": [
    "The September 2021 Nintendo Direct was predictably packed with information on existing and upcoming games, giving Nintendo Switch owners plenty to look forward to in the coming months and into 2022, including those planning on picking up a Nintendo Switch OLED model on October 8.",
    "Nintendo was able to bookend the presentation with two huge announcements, opening with the Monster Hunter Rise: Sunbreak expansion before closing things out with the long-awaited reveal of Bayonetta 3.",
    "Plenty of gaming goodness was sprinkled throughout, too, with updates to existing games like Animal Crossing: New Horizons and Hyrule Warriors: Age of Calamity, to surprise reveals like Chocobo GP and Kirby and the Forgotten Land.",
    "To get you up to speed, here's a breakdown of the biggest announcements from Nintendo's September 2021 Direct showcase.",
    "Originally announced close to four (four!) years ago at the 2017 Game Awards, Bayonetta 3 finally got the big reveal trailer we've all been waiting for. Featuring intense gameplay and a dashing new look for the gun-toting Umbra Witch, we can't wait to finally get our hands on Platinum Games' next big title when it launches in 2022.",
    "Our favorite treat-eating, power-vacuuming, god-destroying pink blob is finally returning on the Nintendo Switch with Kirby and the Forgotten Land. The game looks to be quite the departure from his usual 2D-based shenanigans, expanding to a 3D perspective in a strange, apocalyptic land. We're excited to see how Kirby's copy abilities will come into play in this new setting when the game launches early in 2022.",
    "Originally announced back in February 2021, we've had to wait a little while for new info on Splatoon 3. Thankfully, Nintendo broke the silence in September, showing off new special abilities in Turf War multiplayer and a closer look at the game's single-player campaign, known as Return of the Mammalians. There's still no concrete release date for Splatoon 3, but we'll be playing it non-stop in 2022.",
    "We first learned of Mario Party Superstars during the E3 2021 Nintendo Direct, but it looks like Nintendo is (finally) back on the right track when it comes to Mario's board-based shindigs, reiterating that full online play will be supported. Loaded with boards and minigames from the N64 era, Superstars injects a day and night cycle that can significantly alter the behavior of the board you're playing on.",
    "A common criticism of Animal Crossing: New Horizons is that content in the game is quite scarce compared to its predecessors. Hopefully, that's set to change soon as a dedicated Animal Crossing Direct is taking place sometime in October 2021. The Nintendo Direct trailer teased the return of a fan-favorite locale, Brewster's The Roost coffee shop.",
    "One of Final Fantasy's most overlooked spin-off titles, the original Chocobo Racing on PS1 will soon have a surprise follow-up in the form of Chocobo GP, releasing in 2022. This new game features even more Final Fantasy characters than before, while retaining the innovative power-up system featured in the original.",
    "Monster Hunter Rise fans will finally have something much bigger to sink their oversized great swords into when its expansion, Sunbreak, releases in 2022. The trailer teased a brand new, foreboding locale, and a new flagship monster that seems to have some vampiric traits.",
    "The long-awaited Metroid Fusion sequel is launching in just a few weeks, but Nintendo dropped a flashy new trailer for Metroid Dread during the Direct that gave us an even better look at Samus's new abilities and the threats she'll be facing on Planet ZDR, rumored to have once been the home of the series' iconic Chozo race.",
    "Nintendo announced a release date for Triangle Strategy, Square Enix's upcoming title made in its impressive HD2D engine. The developer has also been hard at work making tweaks to the game based on the results of the demo version's survey. Appearing to take cues from Final Fantasy Tactics, Triangle Strategy certainly looks the part. Let's hope it plays just as well when it launches in March, 2022."
  ],
  "headers": {
    "4": "Bayonetta 3 (2022)",
    "5": "Kirby and the Forgotten Land (Spring 2022)",
    "6": "Splatoon 3 (2022)",
    "7": "Mario Party Superstars (October 29, 2021)",
    "8": "Animal Crossing: New Horizons Direct (October 2021)",
    "9": "Chocobo GP (2022)",
    "10": "Monster Hunter Rise: Sunbreak (Mid 2022)",
    "11": "Metroid Dread (October 8, 2021)",
    "12": "Triangle Strategy (March 4, 2022)"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Bayonetta 3": "https://www.techradar.com/news/bayonetta-3",
    "Animal Crossing: New Horizons": "https://www.techradar.com/reviews/animal-crossing-new-horizons",
    "Kirby and the Forgotten Land": "https://www.techradar.com/news/kirby-and-the-forgotten-land",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "Final Fantasy": "https://www.techradar.com/news/the-best-final-fantasy-games-for-series-beginners-and-rpg-newcomers",
    "Monster Hunter Rise": "https://www.techradar.com/reviews/monster-hunter-rise",
    "Metroid Dread": "https://www.techradar.com/news/its-not-metroid-prime-4-but-metroid-dread-is-the-first-new-2d-entry-in-20-years"
  }
}