{
  "source": "https://www.techradar.com/news/google-pixel-6-pro-leaked-in-first-hands-on-video",
  "title": "Google Pixel 6 Pro leaked in first hands-on video",
  "category": "phones",
  "updated": "2021-09-22T08:50:07Z",
  "author": "james-rogerson",
  "summary": "Looking good in grey",
  "article": [
    "Google itself has revealed a lot about the Pixel 6 and the Pixel 6 Pro, but so far we’ve mostly just seen images and partial specs lists. Now though, someone has seemingly gone hands-on with the Google Pixel 6 Pro.",
    "M. Brandon Lee from This is Tech Today shared a brief eight-second hands-on video on Twitter. It’s not clear where the video originally came from, but you can see the Google Pixel 6 Pro in a grey shade with black accents.",
    "The back is glossier and more reflective than you might have realized from pictures, but the rest of the details are mostly as we’ve seen and heard before, including the large camera block and curved screen.",
    "You’ll note that one thing that does differ is the logo on the back, which isn’t the typical Google one. This as Lee points out suggests that we’re looking at an early production test unit, which means that some things could change between this and the final phone. That said, it looks basically identical to what Google itself has shown, so we wouldn’t expect any major changes.",
    "Shortly after this leak, Lee put out a new This is Tech Today YouTube video covering it, in which he also shared a few photos supposedly showing the Pixel 6 Pro. One of these shows the makeup of the phone’s Tensor chipset, including two high-power cores, four middling ones, and two low-power ones.",
    "Lee also notes in this video that the Google Pixel 6 Pro is almost exactly the same size as the Samsung Galaxy S21 Ultra. Apparently Google’s phone is just slightly shorter.",
    "There’s not really much new here other than the discovery that the Pixel 6 Pro could be quite glossy, but seeing it on video gives a better idea of how the phone actually looks in the flesh and in the hand, and for our money it’s a very good look.",
    "When the Pixel 6 range first leaked, its design – while largely praised – proved a bit divisive, with the large camera block and two-tone color scheme proving off-putting to some. But the model on video here has a classy, premium look, which stands out from the crowd a bit without looking garish.",
    "It remains to be seen how well all the components of the Pixel 6 Pro will come together, but from a design perspective we reckon Google is onto a winner. As for the rest, we should find out soon, with October 19 widely rumored to be the announcement date.",
    "Via SlashGear"
  ],
  "headers": {
    "6": "Opinion: the Pixel 6 Pro continues to impress"
  },
  "links": {
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "on Twitter": "https://twitter.com/thisistechtoday/status/1440385355258028032",
    "This is Tech Today YouTube video": "https://www.youtube.com/watch?v=SktUWuvLEig",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "October 19 widely rumored": "https://www.techradar.com/reviews/google-pixel-6",
    "SlashGear": "https://www.slashgear.com/pixel-6-pro-hands-on-videos-reveal-interesting-details-21692011/"
  }
}