{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-rumored-to-support-both-google-assistant-and-bixby",
  "title": "Samsung Galaxy Watch 4 rumored to support both Google Assistant and Bixby",
  "category": "phones",
  "updated": "2021-08-04T22:27:35Z",
  "author": "david-lumb",
  "summary": "The Samsung Galaxy Watch 4 could get even more Google Wear OS features",
  "article": [
    "The Samsung Galaxy Watch 4 could support both Samsung’s Bixby voice assistant and Google Assistant, according to a new rumor.",
    "While we knew the Samsung Galaxy Watch 4 would probably inherit some fun perks from Google’s Wear OS now that it and Samsung have collaborated on Wear OS 3, the operating system introduced at Google IO 2021. We hadn’t heard many specifics on new features that would be shared, so getting Google Assistant on the watch is an exciting possibility.",
    "In a reply to a 9to5Google tweet about the Galaxy Watch 4, leaker SnoopyTech mentioned that the watch would have Google Assistant and Bixby:",
    "As 9to5Google explained in follow-up coverage, there’s a reference in the Wear OS app’s code to support for an ‘alternate assistant’ – that is, an alternate to Google Assistant. There’s also evidence that the alternate, which could be Bixby or, perhaps, another voice assistant like Amazon’s Alexa, could get its own tile in the Wear OS launcher.",
    "When Google introduced its partnership with Samsung to merge their wearable operating systems, we were left wondering what tangible benefits users would see. When it was introduced during the Google IO 2021 keynote, the collaboration was tied to a series of OS upgrades, including 30% faster app starts, better battery life, and smoother app transitions.",
    "But a post-keynote developer session explained that there would be a bunch of back-end improvements, too. Some of these would ease the user experience, like faster task switching, easier ways for appmakers to build Tiles, expansion of Google Pay for Wear to more countries and metro areas.",
    "Other potential upgrades seemed more tangible, including a function to return to the most-used app by double-tapping a smartwatch's function button, a Google Maps update that allows offline navigation, more robust health information shared across apps through APIs, and color-matching your other Android devices via Android 12’s new cross-platform Material You synchronization.",
    "What else could Samsung bring to Wear OS 3? A stronger idea of ecosystem, for one: Samsung’s smartwatches had been set up to better interface with other products like the Samsung Galaxy Buds. Heck, even Samsung’s smartphone and tablet DeX app is designed to expand the product family’s reach across more devices, with its most recent version allowing the Samsung Galaxy S21 phones to wirelessly connect to external displays.",
    "Whether this interconnectivity can extend to smartwatches is anyone’s guess, but we’re excited to see what else the Samsung Galaxy Watch 4 can gain with Wear OS 3 – and we won’t have to wait long, as we expect the wearable to launch at Samsung Unpacked on August 11."
  ],
  "headers": {
    "4": "Analysis: What else can Wear OS add from Samsung?"
  },
  "links": {
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "mentioned": "https://twitter.com/_snoopytech_/status/1422193527530958850",
    "coverage": "https://9to5google.com/2021/08/03/wear-os-alternate-assistant-bixby/",
    "explained": "https://www.techradar.com/news/5-things-you-probably-missed-from-google-io-2021",
    "wirelessly connect": "https://www.techradar.com/news/samsung-dex-goes-wireless-only-if-you-have-a-galaxy-s21",
    "Samsung Unpacked": "https://www.techradar.com/news/rip-galaxy-note-21-samsung-galaxy-z-fold-3-to-launch-in-august-hints-unpacked-invite"
  }
}