{
  "source": "https://www.techradar.com/news/microsoft-teams-wont-be-so-much-of-a-ram-hog-soon",
  "title": "Microsoft Teams won't be so much of a RAM hog soon",
  "category": "computing",
  "updated": "2021-03-11T11:00:25Z",
  "author": "mike-moore",
  "summary": "New Low Bandwidth Mode should solve Microsoft Teams hardware headaches",
  "article": [
    "Using Microsoft Teams on older or slower devices should be less of a headache soon thanks to an upcoming update to the online collaboration service.",
    "The video conferencing platform is set to release a new Low Bandwidth Mode which should mean that running Teams requires less computing power, and hopefully meaning a smoother user experience for all.",
    "Designed primarily for desktop, Microsoft says that new mode is in development now, and should be rolling out to users within the next few weeks.",
    "\"Whether you want to preserve data or are in a location with a poor or limited network connection, sometimes it’s helpful to limit the amount of data you’re using during a video call,\" the Microsoft 365 roadmap site entry for the new feature said.",
    "\"A new low data mode allows users to cap the amount of data that will be used during Teams video calls as well as establish different settings based on network availability.\"",
    "The new mode should mean an end to users suddenly dropping off calls due to poor bandwidth, as many of us will no doubt have been on calls where half the participants have had to turn their video feeds off due to it affecting the audio quality.",
    "It should also help reduce the strain on company networks which may already be struggling with the continued shift to remote working, especially at larger businesses where workers may be joining a call from anywhere in the world.",
    "The new Low Bandwidth Mode is the latest in a series of recent upgrades for Microsoft Teams as the company looks to ensure the platform remains useful even as workers slowly begin to return to the office.",
    "Other recent updates include a new Progressive Web App (PWA) version of Microsoft Teams which should also help users with lower-end devices to run the platform without suffering major hits to their performance, and a tweak that will push meeting attendees off-screen if they have not activated their webcam.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Are you there?"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "video conferencing": "https://www.techradar.com/news/microsoft-teams-update-could-soon-give-you-a-whole-new-view-on-your-calls",
    "Microsoft 365 roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-2730521075279578000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D70786",
    "Progressive Web App (PWA) version": "https://www.techradar.com/news/microsoft-teams-is-getting-a-new-slimline-makeover",
    "MSPowerUser": "https://mspoweruser.com/low-bandwidth-mode-coming-soon-to-microsoft-teams/"
  }
}