{
  "source": "https://www.techradar.com/news/charging-your-electric-car-wirelessly-while-you-drive-has-taken-a-major-step-forward",
  "title": "Charging your electric car wirelessly while you drive has taken a major step forward",
  "category": "car-tech",
  "updated": "2021-10-18T14:43:53Z",
  "author": "chris-teague",
  "summary": "Michigan set to have first wirelessly charging road in US",
  "article": [
    "Even the most extended range electric cars can be a real pain to charge. The amount of time it takes to replenish battery power is still far greater than the time it takes to refill a fuel tank, though several new EVs are getting closer.",
    "Michigan will become the latest government entity to try and remedy the issue. Governor Gretchen Whitmer opened the Motor Bella auto show in Pontiac, MI, yesterday, announcing that the state would begin testing wireless electric vehicle charging roadways.",
    "The state joins Indiana and several international organizations, including governments, with similar plans.",
    "Whitmer said that a one-mile stretch of road would be chosen for the Inductive Vehicle Charging Pilot, but it's not clear where it will end up.",
    "Earlier this year, the Indiana Department of Transportation announced that it would begin testing wireless charging highway pavement.",
    "Its tests will take place in phases, beginning with testing and validation of different types of pavements.",
    "Phase three is when actual testing starts, though the location and timeframe are not yet defined.",
    "The Michigan plan would move the state ahead of Indiana by going directly to the road test phase. Other tests are underway, or will soon be underway, in Israel and Norway.",
    "One big question is implementation. It's not possible to plug-in a car while driving, so both the car and the road surface have to be capable of wireless charging.",
    "In 2018, Sweden began testing a system that used an electrified rail that could charge vehicles through a retractable arm, kind of like a street trolley in San Francisco, but there aren't any EVs on sale in the US with that kind of hardware today.",
    "There are, however, EVs coming with wireless charging capability, including the upcoming Genesis GV60.",
    "As more vehicles adopt the technology and become more efficient, a charging highway could be a massive step forward for charging times and range anxiety issues."
  ],
  "headers": {
    "8": "Wireless car charging finally on the horizon"
  },
  "links": {
    "wireless electric vehicle charging": "https://www.techradar.com/news/wireless-electric-vehicle-charging"
  }
}