{
  "source": "https://www.techradar.com/news/prime-gaming-january-2021-free-loot-for-gta-online-fall-guys-and-apex-legends",
  "title": "Prime Gaming January 2021: free loot for GTA Online, Fall Guys and Apex Legends",
  "category": "gaming",
  "updated": "2021-01-11T12:22:07Z",
  "author": "vic-hood",
  "summary": "Plus five new free games",
  "article": [
    "Prime Gaming is kicking off the new year with some fantastic content for Prime members, including exclusive content for games such as GTA Online, Fall Guys and Apex Legends – and the addition of five new PC games to the Prime Gaming library.",
    "So what exactly is up for grabs? For those who play GTA Online, Prime Gaming is offering access to the Kosatka submarine’s Sonar Station and the ability to earn up to GTA $1 million each month. It's worth noting that to access these freebies, you need to connect your Amazon and Rockstar Games Social Club account (claim this offer and learn more here).",
    "Those who prefer some jellybean fun will be pleased to know you can claim an exclusive winter-themed bundle for Fall Guys this month, which includes the adorable Winter Warmer costume and three free Crowns.",
    "Apex Legends players can also claim an exclusives Queen of Hearts skin for Wraith in January 2021, while League of Legends players will be treated each month this year to very single skin shards in League of Legends (with 36 available throughout 2021).",
    "For those who want to try out some new games this month, Prime Gaming has also added a further five free PC games to its library: Alt-Frequencies, Void Bastards, Along the Edge and Bridge, and Constructor Playground. That means you can access over 35 free games through the Prime Gaming library at the time of writing – but it's worth noting these are PC only.",
    "You can claim all these offers here. But be aware that, unlike the likes of PS Plus, Prime Gaming staggers some of its content releases throughout the month – and often content is available for a limited time only.",
    "Prime Gaming (formerly known as Twitch Prime) offers Amazon Prime members access to a free Twitch channel subscription, exclusive in-game content, and free PC games every month.",
    "And you don't even have to be a PC player to take advantage of these offers, as many extend to console too (like the GTA Online and Fall Guys offers).",
    "If you're a Prime member already then it's definitely worth making use of the benefits that come with Prime Gaming. If you're not a member yet then, in order to access everything that Prime Gaming has to offer, simply click on the sign-up link below to start your 30-day free trial."
  ],
  "headers": {
    "6": "Some great offers"
  },
  "links": {
    "here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2930496170946486000&xs=1&url=https%3A%2F%2Fgaming.amazon.com%2Fhome&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fprime-gaming-january-2021-free-loot-for-gta-online-fall-guys-and-apex-legends",
    "winter-themed bundle for Fall Guys": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1960809909971988700&xs=1&url=https%3A%2F%2Fgaming.amazon.com%2Floot%2Ffallguys&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fprime-gaming-january-2021-free-loot-for-gta-online-fall-guys-and-apex-legends",
    "Apex Legend": "https://www.techradar.com/reviews/apex-legends-review",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "formerly known as Twitch Prime": "https://www.techradar.com/news/twitch-prime-is-now-prime-gaming-will-keep-serving-up-free-gaming-goodies"
  }
}