{
  "source": "https://www.techradar.com/news/googles-play-store-ratings-will-soon-be-tailored-to-your-device-and-country",
  "title": "Google’s Play Store ratings will soon be tailored to your device and country",
  "category": "phones",
  "updated": "2021-08-24T03:37:51Z",
  "author": "harry-domanski",
  "summary": "More personalized data aims to provide better buying advice",
  "article": [
    "Google has announced plans to change the way its Play Store ratings and reviews appear for users in different countries and on different devices, finally offering a more accurate look at the quality of the app or game for your specific situation.",
    "Since the Play Store first launched, star ratings and written reviews have been the most immediate way to gauge the quality of an app or game when comparing it to the multiple alternatives on offer.",
    "From November 2021, the mobile version of the Play Store will show ratings specific to the user's country, and from early 2022, ratings specific to a user's device (such as tablets, wearables and Chromebooks) will be displayed.",
    "Google cites various reasons for the changes, such as when a bug specific to only one region negatively affects the rating of an app globally, or when an app's tablet experience improves considerably but the rating doesn't reflect this due to the large number of phone users.",
    "The tech giant also mentions that these ratings directly impact the visibility of apps on the Play Store, so certain apps may have an unfairly inflated standing in search results, or be similarly buried based on the experience in other regions or on other devices.",
    "We see these features as a considerable improvement on how apps will be selected and even purchased in the future, with users being given a much more realistic expectation of how it will perform for them specifically.",
    "Particularly when looking at the likes of weather, streaming, and payment-related apps, there's no doubt that the quality of these services will vary wildly depending on the support of a country's payment platforms, weather radars and streaming service compatibility.",
    "We anticipate this will have a flow-on effect where regions with a smaller populace will no longer be seeing results dominated with apps popular in countries with massive populations, and the increased relevance of these apps will continue to gain local approval.",
    "This level of granularity should again help apps narrow their focus on a specific device they're aiming to work with. Apps that require larger screen real estate such as audio, image and video editing suites won't suffer as much from the mobile version of their otherwise tablet-centric design, for instance, and the same goes for wearables."
  ],
  "headers": {
    "5": "Analysis: Tailor-made grade"
  },
  "links": {
    "announced": "https://android-developers.googleblog.com/2021/08/making-ratings-and-reviews-better-for.html",
    "tablets": "https://www.techradar.com/news/best-tablet",
    "wearables": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook"
  }
}