{
  "source": "https://www.techradar.com/news/most-businesses-dont-think-they-could-respond-to-a-cyberattack-today",
  "title": "Most businesses don't think they could respond to a cyberattack today",
  "category": "computing",
  "updated": "2021-10-26T10:13:15Z",
  "author": "sead-fadilpasic",
  "summary": "They don't believe in the people, processes and technologies",
  "article": [
    "With cyber-threats evolving on a daily basis, talented workers being extremely difficult to find, and security tools being subpar compared to the arsenal of malicious actors, many organizations nowadays don’t feel confident in their ability to respond to incidents, or staying compliant with rules and legislation.",
    "These are the conclusions in a new research paper from Rackspace Technology, which after surveying 1,420 IT decision-makers across numerous industries, found that two in five (39%) lack the confidence to tackle these issues. Just a third (36%) feel confident in their ability to stay compliant.",
    "The key problem - constantly evolving security threats, such as malware, and attack methods - was cited by almost two-thirds (60%) of respondents. Further on, more than half (53%) don’t have the necessary tools to properly identify security incidents across multi-cloud environments, something they hope will change, within the next three years.",
    "Then, there is the issue of talent. Almost half (44%) are struggling to find and retain talented cybersecurity workers. Those skilled in cloud security and data privacy are most in demand these days. To try and solve the problem, most UK businesses rely on in-house staff, with some third-party assistance. The majority, however, (56%) use up to five external cybersecurity providers, including Security Value Added Resellers, Managed Security Service Providers, and Managed Detection & Response Providers.",
    "Integrated risk, application security, and data security are the top three areas most likely outsourced, the report further found.",
    "For Andy Brierley, UK General Manager at Rackspace Technology, cybersecurity is extremely trick to address, mostly due to the accelerated pace at which digital transformation is happening in all the key sectors.",
    "“Given the current digital skills gap and ongoing recruitment challenges, it is important that businesses seek further support from third-party partners to help identify and address their weaknesses,” he said.",
    "“Few businesses have all bases covered – people, processes, and technology in place – when it comes to a mature cybersecurity model. Working with a partner that can bring these specialist skills and tailor them to specific requirements is an increasingly popular and effective way to ensure and increase overall confidence in addressing cybersecurity needs.”",
    "Make sure to also check out our list of the best firewall providers today"
  ],
  "headers": {
    "3": "Third parties to the rescue"
  },
  "links": {
    "security tools": "https://www.techradar.com/news/best-endpoint-security-software",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "best firewall": "https://www.techradar.com/best/firewall"
  }
}