{
  "source": "https://www.techradar.com/news/keep-your-wfh-safe-with-these-top-tips",
  "title": "Keep your WFH safe with these top tips",
  "category": "computing",
  "updated": "2021-01-25T10:40:58Z",
  "author": "techradar-pro",
  "summary": "Kick off 2021 with these security resolutions",
  "article": [
    "With 2020 finally behind us, the new year offers a chance of a fresh start and optimism for the 12 months ahead.",
    "However it's unlikely that 2021 will be a year without any security issues, and as many of us are now firmly entrenched in working from home, now is a good time to make sure your protection levels are as good as they can be.",
    "If you're not sure where to start - don't fear, we've got some top security tips to keep you safe in 2021.",
    "Although many people are hopefully now aware that all smart devices need some form of protection, it's always remembering that every connected product you use online needs safeguarding against threats. Whether laptop, desktop, tablet or smartphone, the need to ensure all devices are safe can be a huge step forward for keeping your WFH set-up protected.",
    "Fortunately, Bitdefender Total Security 2021 is able to cover all your smart devices. It works across multiple platforms and software versions, including Windows, macOS, Android and iOS, and can be used across up to 15 devices per household, making sure your whole family stays protected online this year.",
    "Over the last few years, using a Virtual Private Network, or VPN, has become an essential tool for many users. A VPN allows you to disguise your internet connection to make it appear to originate from a different country or region entirely, meaning your online activity and location should be safe from any snooping.",
    "Although many of us may already be working with a VPN service through our work or business devices to access a workplace network or intranet, there are also consumer-facing offerings that can allow you to watch and enjoy entertainment streaming services from anywhere in the world. Bitdefender Total Security 2021 comes packaged with its own Secure VPN service that offers complete online privacy - and with a 200MB/day allowance, you can ensure your internet enjoyment isn't compromised.",
    "Although the days and weeks may be blurring in to one another at the moment, that's no reason to take your eyes off the ball when it comes to email security. To make sure you stay protected from the latest threats, you need to make sure no phishing emails slip through the gaps whilst your mind is preoccupied with other tasks whilst working from home.",
    "Phishing emails, where hackers spoof communications from legitimate companies or brands (or even your workplace) in an attempt to steal login details or personal information, remain a potent threat, especially with many of us now blurring the remote working boundaries.",
    "Most of the time, however, if you receive an email that looks or seems suspicious, it may be just that. Taking a few moments to examine a suspect message can be vital, as phishing emails often contain mistakes in the links inside, or imaging and formatting errors.",
    "Fortunately, Bitdefender Total Security 2021 offers comprehensive anti-phishing protection as standard, keeping all your devices safe from the latest threats - and if you are concerned, don't open any attachments in suspicious emails.",
    "January is typically a time for new year's resolutions, deciding to make a change in old habits or adding new ones. That can also apply to your passwords, which often need a spruce up to ensure they stay fresh and, more importantly, secure. As you've no doubt heard, using a different password for each account is highly recommended, with a strong mix of letters, numbers and special characters more likely to help keep your accounts safe.",
    "But if you do re-use passwords across multiple accounts, it's worth remembering that all it takes is for one to be compromised for hackers to gain knowledge of your logins to everything else. To help with this, Bitdefender Total Security 2021 comes with an in-built Password Manager service, allowing you to let you keep track of all your login details, meaning one less thing to worry about."
  ],
  "headers": {
    "3": "Get everything updated",
    "5": "If you don't have one, invest in a VPN",
    "7": "Keep an eye out for phishing threats",
    "11": "Take a weight off with a password manager"
  },
  "links": {
    "Bitdefender Total Security 2021": "https://www.bitdefender.co.uk/solutions/total-security.html"
  }
}