{
  "source": "https://www.techradar.com/news/battlefield-2042-is-reminiscent-of-hardline-and-thats-a-good-thing",
  "title": "Battlefield 2042 is reminiscent of Hardline – and that’s a good thing",
  "category": "gaming",
  "updated": "2021-09-19T15:00:18Z",
  "author": "francisco-jose-ruiz-perez",
  "summary": "Opinion: Visceral’s spinoff is still relevant",
  "article": [
    "Visceral Games’ Hardline was originally envisioned as a bridge between Battlefield 4 and the new era of Battlefield kickstarted by Battlefield 1, which sent the franchise in a more grounded direction. The departure from the saga’s tradition of military settings instantly pushed the bigger purists away, and despite EA and Visceral’s best efforts, the game opened semi-dead-on-arrival.",
    "Much was written about a single-player campaign that didn’t quite click together or a multiplayer component that tried to do too many things at once, yet a vocal minority of players stuck around and grew to love this “war on crime” take on the Battlefield property.",
    "In many ways, we believe some of that game’s DNA has survived for more than half a decade and made its way into Battlefield 2042.",
    "Gamers automatically connect the Battlefield franchise to the word “sandbox,” sometimes even jokingly calling the classic installments “Funfield (x)”. If Call of Duty excels at competitive, tighter FPS action, Battlefield is always there for us when we’re looking for big, dumb and epic shootouts topped with explosive vehicular warfare. These tenets never went away, but most veterans will agree that Battlefield 1 and Battlefield 5 maybe became – within the franchise’s spirit – a bit too serious.",
    "Of course, with Battlefield 2042, EA and DICE are (rightly) pushing the narrative of a return to the more open-ended and flexible spirit of Battlefield 3 and Battlefield 4’s maps and overall gameplay flow. In fact, Battlefield 2042 is a canonical sequel to the events narrated in the fourth game of the mainline series, so naturally, it needs to play similarly despite all the additions and upgrades.",
    "But why is everyone ignoring Hardline, a game as packed with new ideas and silly fun as its two predecessors? As we mentioned before, people quickly swept it under the carpet because it wasn’t about soldiers and tanks, or jets crashing against each other. But it wasn’t a simple cops vs. robbers FPS title either, nor the Battlefield 4 reskin it’s been unfairly described for years. Let us break that down.",
    "While Hardline game modes such as Heist or Blood Money toyed with the game’s strengths and unique systems, the classic Conquest mode and Hotwire, one of the franchise’s highest points even among the non-believers, kept the traditional Battlefield spirit alive under a new guise – one that isn’t any weirder than the upcoming jump to the high-tech future of 2042. Okay, maybe that setting doesn’t have drivable magic sofas.",
    "Inevitably, many of Hardline’s maps were also set in urban environments, at times borrowing whole ideas from Battlefield 4’s most famous levels. For example, Battlefield 4’s Siege of Shanghai and Hardline’s Downtown are very close relatives up to the “big Levolution event in the big building” part. Also: in Hardline you can literally ride the elevator with a motorbike and jump off the tallest building without blowing up. It doesn’t get more Battlefield-y than that.",
    "We know for a fact the environments in 2042 represent a world consumed by the relentless expansion of the human race… and its consequences. Giant skylines are back, and so are big weather events. And DICE is tying all that to the “Battlefield moments” slogan. The game’s first trailer was basically a (cinematic) compilation of “only in Battlefield” situations, referencing many fan-favorite hijinks and gameplay tricks. We couldn’t help but think of Hardline when some of those scenes came up.",
    "Okay, maybe Visceral didn’t land all of its shots – after all, Hardline was its first and only step into the FPS world. But the developer sure tried to go somewhere different with the Battlefield formula. Maybe fans were scared of the main saga becoming something else, but that never was a possibility. EA and DICE have demonstrated time and again that Battlefield is all about big and accessible battles. 2042 might be the biggest entry yet, but its futuristic setting (still not as futuristic as 2142’s) doesn’t mean the franchise is never returning to “more realistic” scenarios. They simply have to expand their canvas because variety is good and can put them ahead of the competition.",
    "In order to make up for the lack of heavy military-grade vehicles, Hardline offered a wide array of civilian rides too. As we can see in that first 2042 preview, fragile cars and bikes are making a comeback. What are they going to do against futuristic tanks and global warming-generated giant tornadoes? Not a lot, but they sure are going to be good silly fun or perfect unsuspecting vehicles for C4-powered surprises.",
    "And what about the gadgets? Well, they seem to be the bread and butter of this new Battlefield installment – archetypical classes are being dumped in favor of Specialists who are unique in-universe characters with complete backgrounds and, more importantly, distinctive abilities and gadgets that help take down enemies and reshape the players’ approach to navigating the maps or relating to their surroundings. The classic Battlefield entries never went too far with these ideas, yet Visceral added quite a bit of flexibility and choices with a fair amount of tools all the way back in 2015.",
    "The lack of massive firepower in a cops vs. robbers conflict supported the idea of “alternative” approaches in Hardline, such as ballistic shields, jammers or grappling hooks. Messing with the opposing team’s logistics was almost as important as putting them to the ground. It now seems like DICE took some notes and wants players to interact with the battlefield in more ways than ever before. Moreover, specialists are kind of designed to complement each other and make up cohesive squads that are part of a larger coordinated effort. Charging into battle without a plan doesn’t equal victory anymore.",
    "2042 wants to be the “most Battlefield-ish Battlefield ever\", but it’s also allowing itself to be methodical and weird. And that’s good. Maybe Hardline didn’t resonate with fans only because of its setting, but we’re happy to see some of its DNA and more interesting elements live on in a new setting. And that brings us to a final question (or maybe a request of sorts): could some bits of Hardline be part of Battlefield Portal’s plan of post-launch content? It may not have been gifted via Prime Gaming, unlike every other modern Battlefield, but we’re not losing hope."
  ],
  "headers": {
    "3": "Silly fun is back",
    "10": "Old and new gadgets for a new conflict"
  },
  "links": {
    "Battlefield 1": "https://www.techradar.com/news/battlefield-1-review",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "drivable magic sofas": "https://www.youtube.com/watch?v=yKEZn9hLMiI",
    "first trailer": "https://www.techradar.com/reviews/battlefield-2042",
    "giant tornadoes": "https://www.techradar.com/news/battlefield-2042-tornadoes-ruin-the-experience-according-to-leaker",
    "via Prime Gaming": "https://www.techradar.com/news/ahead-of-battlefield-6-prime-gaming-is-offering-battlefield-4-for-free"
  }
}