{
  "source": "https://www.techradar.com/news/the-7-functions-of-marketing",
  "title": "The 7 functions of marketing",
  "category": "computing",
  "updated": "2021-12-09T15:53:35Z",
  "author": "erin-gregory",
  "summary": "The seven functions of marketing, designed to bring growth and success to businesses of all sizes.",
  "article": [
    "Marketing is a culmination of effective messaging, well-planned financing and budgeting, targeted selling, and strategic distribution. A marketing team is often made up of a variety of professionals who, together, can effectively carry out a well thought out marketing strategy.",
    "Even the best of marketers struggle to manage all of these tasks for an organization, which is why it is important to have an effective tool to assist in the planning and management of the various tasks. From PR and information management, to financing and distribution – these seven functions of marketing are essential in today’s business world.",
    "PR, which stands for public relations, is the ability to communicate with the public through the use of media in a controlled, flattering manner to your organization, allowing you to build rapport with your consumer-base and the community. Public relations can help you form concepts and ideas around your organization. This field has adapted with social media heavily, utilizing the platforms to disseminate information, communicate directly with an organization’s audience, and control the conversation.",
    "There are several layers of public relations and information management including:",
    "⩥ Crisis management – an established strategy for communication policies and procedures put into place for if an emergency should take place",
    "⩥ Relationship management – procedures put into place to manage key relationships, and maintaining those relationships",
    "⩥ Reputation management – a standard put in place to ensure the organization maintains its ethical behavior and social responsibility to its audience.",
    "Without marketing and competitor research, it might seem like your marketing department is just guessing at what your audience wants and who your audience is. Marketing research can help you identify where you need to be putting your messages, what those messages need to be focused around, and how to best address the direction your competitors are going.",
    "There are several different types of market research to consider when planning how to best use your resources. Primary research involves communicating directly with your target audience to gauge how your organization is doing from their perspective, and analyzing that data internally.",
    "Secondary research involves following the data from a second party – a competitor or otherwise, and analyzing their data. This form of research is valuable to organizations that cannot afford to conduct their own primary research.",
    "There is also quantitative research, which focuses on the numbers produced by a campaign or promotion, and qualitative research, which focuses on the overall quality of the responses provided to a select group.",
    "When you think of marketing, chances are your mind will go to promotions first. As consumers this is what we most associate with marketing. Promotions can come in a variety of forms – advertisements, public relations, email marketing, mailers… etc. Most promotions are a culmination of all of these forms put together to create a marketing campaign. For a list of different platforms that help to manage these different activities, check out this article by TechRadar.",
    "Marketers use promotions in one of two ways: above the line or below the line. In an article by avada.io, they break it down as:",
    "Above the line: activities aimed at promoting and building a brand image with a sustainable and long-term purpose through mass media such as TV, Radio, Print & Outdoor Ads. These activities are usually undertaken by the Brand team.",
    "Below the line: activities aimed at developing the distribution market, promoting retail, consumption for short-term purposes, and creating direct effects, such as sample delivery, direct marketing, organization events, promotions for consumers, promotions for agents and retailers.",
    "Selling can take place in a variety of different ways depending on the target market. Once you’ve done your research to establish your target market, created your promotions to support your selling process, you can then plan your approach. Most marketers will present the prospect with a promotional gift, free trial, or other enticement to engage them.",
    "Now that the prospect is in a place to learn more, the salesperson will have the opportunity to present their solution. Through our research process, a well-established salesperson will have determined the client’s need for their product or service. During the presentation stage is when that need is addressed, allowing for the product or service to act as the solution to the problem.",
    "Lastly, the salesperson will have to address any questions, conflicts or objections that follow the presentation in order to close the deal. Having established a well-founded knowledgebase through research will best prepare you for this stage of selling.",
    "Your distribution channel is the series of businesses your product or service needs to go through to reach your consumer. Distribution is dependent upon the budget of your organization and the method you aim to use. Some items to consider before landing on your distribution method include:",
    "1. The product or service you are selling and what its demands are. What does the market say? This is where your research will come in handy to tell you whether or not social media is the right place for your service, or a boutique retailer, or other outlet.",
    "2. The cost of and benefits of each method.",
    "3. Whether or not the option you’re choosing leaves room for growth.",
    "Whichever route you decide to take with distribution, do your research. Compare prices and offering, and make sure it is the right choice for your business. There are pros and cons to most options, and you don’t want to get stuck in a contract that isn’t mutually beneficial.",
    "The project manager or ‘PM’ is the individual responsible for the overall success of a scope of work. She makes sure the project is on target with the customer’s and company’s overall goals. The amount of drive and ambition relayed by the project manager feeds into the success of the project.",
    "As the economy becomes more project-focused, the need for highly functional project managers becomes more imperative. In an article by PMI it's stated that \"Demand over the next 10 years for project managers is growing faster than demand for workers in other occupations. ... Through 2027, the project management-oriented labor force in seven project-oriented sectors is expected to grow by 33 percent, or nearly 22 million new jobs.\"",
    "Many new businesses need some source of secure financing to build a sustainable workflow. Marketing is the support system that keeps businesses moving forward. In an article by avada.io it states ‘finance and marketing have a very close relationship with each other.",
    "If one of the two fails to stand up, the other will also collapse. Without marketing, it would be difficult for a company to sell products and bring value to customers, and not have a stable and growing finance.’",
    "Whether it is a customer rewards program, an appealing email campaign that drives sales, or effective customer relations, marketing is the bridge between the financial growth of the business and its customers. The marketer also helps establish how the market is responding to the cost of service by the business and can help to determine whether or not their financial model is sustainable.",
    "Marketing has expanded rapidly over the years to include a multitude of facets including public relations, social media, market research and even advertising. The truly effective marketer can’t do it alone.",
    "She needs a strong team of support and an effective tool to assist in the planning and management of the various tasks. As marketers continue to evolve towards the project manager mentality, being able to successfully plan and oversee the extent of assignments that comes with the job is imperative to the success of the organization."
  ],
  "headers": {
    "2": "PR & Information Management",
    "7": "Marketing and Competitor research",
    "11": "Promotion",
    "15": "Selling",
    "18": "Distribution",
    "23": "Product and Customer Service Management",
    "25": "Financing",
    "28": "Conclusion"
  },
  "links": {}
}