{
  "source": "https://www.techradar.com/news/rpa-why-you-need-to-care-about-this-totally-unsexy-technology",
  "title": "RPA: Why you need to care about this totally unsexy technology",
  "category": "computing",
  "updated": "2021-10-27T15:51:08Z",
  "author": "joel-khalili",
  "summary": "RPA is unlikely to eliminate your job, but it will almost certainly change it",
  "article": [
    "Robotic process automation, or RPA, is a technology with an identity problem. The name is both dry enough to make the eyes glaze over and confusing enough to obscure precisely what it is or might do.",
    "As a result, very few people outside of the IT industry are familiar with the concept. Yet this is a technology expected to have a colossal impact on the working lives of pretty much all office-based employees, and at least an indirect impact on everyone else.",
    "According to the latest projections from analyst house Gartner, the RPA market is set to be worth almost $2 billion this year - and many times more than that by the middle of the decade. And by the end of 2022, 90% of large companies will have deployed the technology in some way or form.",
    "The sell is very simple: RPA is supposed to help businesses reduce the amount of time and money spent on repetitive manual tasks and, in turn, liberate employees from tedious administration. So, what’s the catch?",
    "Although RPA has been around for two decades now, the industry has experienced a major surge over the last few years, catalyzed by the need to drive efficiencies during the pandemic. The largest pure-play vendor right now is UiPath, with a revenue of $607 million in fiscal 2021, followed by Automation Anywhere and Blue Prism, but other IT firms are building RPA functionality into their products too.",
    "In the simplest terms, RPA is about programming software to complete tasks by following a set of instructions. These units of software are referred to variously as digital workers, software robots and automation assistants.",
    "“A software bot is a configurable software designed to perform a task by learning, mimicking, and then executing rules-based business processes. It interacts with other applications and software systems to complete these business processes, just like a human would,” explained Prince Kohli, CTO at Automation Anywhere.",
    "In theory, RPA allows employees to spend less time punching data into Excel spreadsheets, processing documents and pulling information from CRM systems, and more time fulfilling the aspects of their roles that computers are (currently) unequipped to handle. “These bots enable employees to take the robotic out of their work,” Kohli added.",
    "Although it’s easy to imagine how all businesses could benefit from the ability to automate tasks in this way, the earliest adopters have typically been large enterprises hailing from sectors required to perform the most repetitive administration, such as insurance, utilities, financial services and healthcare.",
    "More recently, however, with the addition of artificial intelligence (AI) and low-code solutions to the mix, RPA deployments have become easier to configure and smart enough to handle more difficult assignments. Paul Maguire, Senior VP EMEA & APAC at software firm Appian, says these kinds of supporting technologies will create new use cases and bring RPA to a wider audience.",
    "“While RPA is great for task automation, it’s not appropriate for everything,” he told us. “This is where hyperautomation has a role to play, by combining technologies with people in a single workflow.”",
    "“Implemented alone, RPA bots can be fast and relatively inexpensive, but they cannot handle exceptions or change. AI is a powerful tool to help collect and analyse information. It can also turn unstructured content into structured data to sort, prioritize, and make suggestions on best next-step actions for better decisions.”",
    "Nonetheless, however, RPA companies are to some extent struggling to communicate the benefits of their services to workers and businesses, who have learned to be suitably suspicious of grandiose promises.",
    "The most common fear is that RPA will make a proportion of the workforce redundant, by automating functions currently fulfilled by human workers. Unsurprisingly, RPA vendors say this is a misconception, a product of pop culture representations of robots and AI, but it could be argued that the vendors themselves are equally to blame. Automation is almost always pitched as a way to free up staff to deliver value in new and creative ways, but the message is rarely more specific than that.",
    "It is widely accepted that the rise of automation will change the configuration of the workforce and the day-to-day activities of employees, but there is some debate as to the extent of this change.",
    "The picture painted by the vendors is that RPA will play a supporting role. Instead of eliminating jobs, RPA will shoulder all the loathsome manual tasks and reduce error rates by removing human fallibility from the equation, they say.",
    "“When we hear talk of employees being replaced by robots, it is often about unattended robots. The purpose of an unattended robot is to take a process and execute it by themselves, and no human is needed,” explained Oded Karev of NICE, which deploys RPA in a call center context.",
    "“Attended robots, however, rely on man working with machine. The robot is installed on the employee desktop and becomes something akin to a virtual assistant to help boost performance.”",
    "Asked for specific examples that illustrate how RPA will change the lives of employees, the companies we spoke to explained the technology can be applied in any situation in which information is siloed or employees are burdened with data-handling tasks.",
    "For example, Gavin Mee, MD Northern Europe at UiPath, says RPA allows accounting professionals to spend less time on bookkeeping and data gathering, and more time on “deep analytics and advisory activities”. And in a human resources context, software bots can handle tasks such as approving annual leave and logging sick days, while staff focus on “relationship building and critical problem solving”.",
    "The customer services sector is also considered well-primed to benefit from RPA. The main role of agents is to engage with customers, but too much time is currently wasted seeking out and inputting information across multiple disparate systems, something a software bot can handle with relative ease.",
    "While it’s plausible that increased efficiency will allow businesses to operate with leaner teams, leading to job cuts, all of these types of roles will still be held by human workers. The most significant change will be that their range of responsibilities will be quite drastically different.",
    "It’s also true that RPA will create a need for a number of brand new jobs. Namely, more IT staff will be needed to handle the configuration and maintenance of RPA systems, because it’s not quite as simple as setting up a software robot and letting it run free.",
    "Although low-code solutions are making it easier for non-technical employees to deploy software robots, additional programming expertise will be required to configure bots for more complex workloads, monitor the performance of deployments and manage any errors and anomalies.",
    "A recent survey conducted by UiPath suggests the majority (77%) of RPA professionals expect their organizations to hire more developers within the next year. A research report from the World Economic Forum (WEF) came to a similar conclusion, that automation will result in a net increase in 58 million jobs, albeit jobs with a higher average skill requirement.",
    "In spite of their vested interests, the vendors we consulted all concede that businesses will encounter friction on multiple levels when it comes time to deploy RPA at scale. And the problem is as much cultural as technological.",
    "“One of the greatest barriers to widespread RPA adoption is the misunderstanding or even fear of the technology,” explained Mee. “Thanks to Hollywood blockbusters, the word ‘robot’ often conjures up negative imagery, and when this is compounded with fears of redundancy, businesses can face resistance when embarking on an RPA journey.”",
    "“It’s a natural response; we tend to fear what we don’t know, and a technology that promises to revolutionise the way we work forever is almost inevitably going to cause confusion and apprehension at first.”",
    "Mee and others say solving this problem is about approaching deployment in as transparent a way as possible; clearly communicating the intentions and ambitions behind the introduction of RPA, as well as the business benefits.",
    "The angle from which organizations approach RPA is also important. Many large firms find it difficult to know where to begin, while others come looking for quick wins to help meet short-term productivity objectives, which can become a problem when scaling up deployments later on. The intermingling of RPA with other automation technologies, like AI and business process management (BPM), only adds further complexity.",
    "As pointed out by Optiv Security, there are also cybersecurity risks associated with rushed or superficial RPA rollouts. Ultimately, RPA expands the attack surface, introducing “many ways in and many ways out”, says Optiv VP John Ayers, which means implementation needs to be careful and considered.",
    "In the end, however, the decision to lean into RPA or not may be taken out of the hands of business leaders, made practically compulsory by market conditions and the changing expectations of employees.",
    "“If there is a leader that is hesitant, I would ask them to consider what their knowledge workers would invent or improve if they had more time, and the business value that would immediately provide. And whether they face an existential risk if they do not provide that kind of support and experience to their customers and employees,” said Kohli of Automation Anywhere.",
    "In this scenario, the question is no longer whether it is right to forgo RPA in order to preserve jobs that can feasibly be automated, but whether businesses can afford to."
  ],
  "headers": {
    "4": "What is RPA?",
    "14": "Future of work",
    "25": "Inevitable friction"
  },
  "links": {
    "latest projections": "https://www.gartner.com/en/newsroom/press-releases/2020-09-21-gartner-says-worldwide-robotic-process-automation-software-revenue-to-reach-nearly-2-billion-in-2021",
    "Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "call center": "https://www.techradar.com/best/best-call-center-software",
    "accounting": "https://www.techradar.com/best/accounting-software-small-business",
    "bookkeeping": "https://www.techradar.com/best/accounting-software-small-business",
    "human resources": "https://www.techradar.com/best/best-hr-software",
    "survey": "https://www.uipath.com/g/thank-you-developer-survey",
    "research report": "https://www.weforum.org/agenda/2021/02/world-economic-forum-automation-create-jobs-employment-robots"
  }
}