{
  "source": "https://www.techradar.com/news/disney-plus-original-shows-to-premiere-on-wednesdays-with-one-exception",
  "title": "Disney Plus' Star Wars and Marvel shows will now release on Wednesdays",
  "category": "entertainment",
  "updated": "2021-07-06T15:24:29Z",
  "author": "tom-power",
  "summary": "Midweek launches are coming to Disney Plus",
  "article": [
    "Disney Plus original shows will begin premiering on Wednesdays instead of Fridays from now on, according to reports.",
    "Per news outlets including The Hollywood Reporter (THR), Disney has altered its release date schedule for its in-house TV series, with new productions now set for permanent midweek launches.",
    "The change in approach will take affect in July, with the first of Disney Plus' new original shows – Monsters at Work – seeing its launch date moved from Friday, July 2 to Wednesday, July 7.",
    "According to THR's sources, Disney's decision to alter the release schedule of its original TV series has been taken to accommodate the streaming platform's increasing content output – but it's likely that there are other factors involved, too.",
    "While Disney Plus original shows will premiere on Wednesdays, there's no alteration to the streamer's original movies release date schedule.",
    "That means that Marvel's Black Widow (which launces simultaneously in theaters and on Disney Plus via Premier Access) will arrive on Friday, July 9. Future Disney Plus original movie releases will also launch on Fridays and not Wednesdays.",
    "Disney's decision to alters its Disney Plus original series launch schedule appears to be two-fold.",
    "First, there's the success of Loki. Marvel's latest TV show was the first-ever original series to premiere midweek on Disney Plus and, on the surface, it appears that audiences responded extremely well to this altered approach.",
    "Disney CEO Bob Chapek recently revealed that Loki was the most-watched TV show premiere in Disney Plus' history (per DiscussingFilm), and this appears to have had a big impact on Disney's decision to switch up its release date formula.",
    "What's unclear, though, is whether Disney Plus' subscriber base prefers Wednesday launches over Friday releases.",
    "Yes, Loki's premiere seems to suggest that this is the case. However, there's also the fact that this is a Marvel TV series fronted by the charismatic Tom Hiddleston, who reprises his role as the beloved villain/anti-hero in the show. It's unclear at this stage, then, if audiences prefer Wednesday releases or if Loki was the right show, at the right time, to take advantage of such a launch schedule change.",
    "The other main reason behind Disney's decision appears to be the increasingly congested streaming service market.",
    "Netflix, arguably Disney Plus' biggest competitor, releases new content (movies and TV shows) every Friday. Amazon Prime, too, launches its original productions ahead of the weekend, while HBO Max and Peacock's new arrivals typically get released on Thursdays.",
    "Disney, then, seems to be distancing itself from the competition by switching up its release date formula. Changing the launch day of its original series to Wednesdays signifies Disney's desire to avoid competing with Netflix and Amazon Prime for viewers' attention.",
    "We're sure to find out if it's a worthwhile strategy in the coming months, providing Disney reveals if its other original series are performing well or not."
  ],
  "headers": {
    "6": "Analysis: Disney's decision seems to be based on two major factors"
  },
  "links": {
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-news/disney-plus-shifts-original-series-to-wednesday-release-date-schedule-1234968809/",
    "Marvel's Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Loki": "https://www.techradar.com/news/what-time-is-loki-episode-6-released-on-disney-plus",
    "DiscussingFilm": "https://twitter.com/DiscussingFilm/status/1404527643400224774"
  }
}