{
  "source": "https://www.techradar.com/news/these-super-cheap-e-scooter-prime-day-deals-are-the-most-fun-you-can-have-on-two-wheels",
  "title": "These super cheap e-scooter Prime Day deals are the most fun you can have on two wheels",
  "category": "fitness",
  "updated": "2021-06-22T13:51:14Z",
  "author": "cat-ellis",
  "summary": "Plus hoverboards and helmets",
  "article": [
    "This year's Prime Day Deals are rolling in thick and fast, including the lowest prices we've ever seen for some of the world's best electric scooters. These includes the excellent Segway Ninebot E45, which is now a hair under $600 for the first time ever, and the long-range Hover-1 Blackhawk for under $430.",
    "Yes, you can find cheaper scooters than these on Amazon, but these are all from reputable brands that you can trust, with solid build quality and dependable after-sales service. Safety is paramount, and you want to be sure that a machine with a top speed of 18mph will be tough enough.",
    "All the e-scooters above are built for adult riders, but to make sure the kids don't miss out, Amazon has also knocked one of Segway's best kid-sized models down to just $150. The ZING E10 has never been this cheap before, even on Black Friday, and with a top speed of 10mph and a 6.5-mile range, it's a big step up from other scooters in the same price bracket.",
    "E-scooters are great for short trips, but for something even more fun, Amazon has also knocked some serious cash off a selection of hoverboards.",
    "These models are made by US company Hover-1, which is one of the biggest names in electric skateboards, scooters and hoverboards, so again, you can be safe in the knowledge that they're well built and reliable. Hover-1 also supplies a wide range of replacement parts on its website, so you can make repairs yourself.",
    "If you're not in the US, or the scooters and hoverboards above don't catch your eye, we've rounded up a collection of other top-rated scooters right here."
  ],
  "headers": {
    "3": "Hoverboard deals",
    "5": "More e-scooter deals",
    "6": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day Deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best electric scooters": "https://www.techradar.com/best/best-electric-scooters",
    "Segway Ninebot E45": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdeal%2F62ca1238%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1057671674696142300-20",
    "Hover-1 Blackhawk": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdeal%2F62ca1238%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6917744978520541000-20"
  }
}