{
  "source": "https://www.techradar.com/news/amazon-releases-amazon-prime-video-app-for-mac-at-long-last",
  "title": "Amazon Prime Video app finally comes to Macbooks, as Netflix lags behind",
  "category": "entertainment",
  "updated": "2021-11-16T12:35:30Z",
  "author": "balakumar-k",
  "summary": "Will Amazon's rival follow suit?",
  "article": [
    "Finally, the Amazon Prime Video app is available in the Mac App Store as a native macOS app. Prime Video subscribers previously using the TV streaming service on their Macbook browsers can now use a dedicated desktop app instead, either for streaming content or downloading for offline use.",
    "The Amazon Prime Video app for macOS has all its standard features including native Picture-in-Picture support as well as AirPlay support. It allows for in-app payments for rentals as well as on-demand content. This means users need not switch to the browser to complete payments.",
    "Other features in the app include keeping track of what users are watching and where they are in a TV series or movie so that it can be watched on one device and then continued seamlessly on another – meaning your Amazon Prime Video app will remain up to speed with your viewing habits elsewhere (say, on a Fire TV Stick or smart TV) and vice versa. It also supports Spatial Audio for AirPods Pro and Airpods Max.",
    "Going through the responses to the new app, one can see that a majority of people who have used the app feel the options for download and the streaming quality is a welcome one. But there have been complaints about the user interface, which is not exactly surprising – or limited to the desktop app of the service.",
    "However, the arrival of a macOS desktop app for Amazon Prime Video does mark a distinct difference from Netflix, which has yet to offer a desktop app on Macbook in the same vein as its mobile/tablet apps for iPhone and iPad.",
    "Watching in-app is a great option for those wanting a standalone application for their streaming needs – meaning you won't get lost amid tabs or distracted by a browser notification. Desktop apps tend to offer higher resolution streaming, too, than is offered in streaming service browsers; Netflix's Windows 10 app can stream in 4K resolution, if your PC monitor supports it.",
    "So it is a shame not to see Netflix (or Disney Plus, for that matter) offer the same on Macbooks just yet.",
    "It's the same thing in the world of smart displays. Netflix is quite rare in that area, with its arrival on Google Nest Hub Max last year making headlines. Amazon, with its various lines of Echo Show smart displays, has ensured that its own streaming service is more widespread there.",
    "Amazon Prime Video for macOS is available on the Mac App Store as a free download. It is compatible with macOS Big Sur 11.4 and later. Naturally, an Amazon Prime subscription is needed to view the streaming content."
  ],
  "headers": {
    "5": "Analysis: Is Netflix falling behind?"
  },
  "links": {
    "Amazon Prime Video": "https://www.techradar.com/news/amazon-prime-new-feature-lets-you-share-30-second-clips",
    "TV streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Airpods Max": "https://www.techradar.com/reviews/airpods-max",
    "or limited to the desktop app of the service": "https://www.techradar.com/news/everything-wrong-with-amazon-prime-video",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "PC monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Google Nest Hub Max": "https://www.techradar.com/reviews/google-nest-hub-max"
  }
}