{
  "source": "https://www.techradar.com/news/iphone-13-prices-could-get-pushed-up-by-increased-chip-production-demand",
  "title": "iPhone 13 prices could get pushed up by increased chip production demand",
  "category": "phones",
  "updated": "2021-08-26T11:10:27Z",
  "author": "david-nield",
  "summary": "Passing the costs on",
  "article": [
    "One of the biggest questions around the iPhone 13 is how much it will cost: previous rumors have suggested price points in line with the iPhone 12, but a new leak hints that there might be quite a jump in how much you'll have to pay compared with the 2020 range of iPhones.",
    "That's as per a report from DigiTimes (via MacRumors), an outlet that has recorded some hits and some misses in terms of getting accurate Apple information in advance. If it's right this time, you might need to save a bit more for your next iPhone upgrade.",
    "The price hike is apparently to cover for the increased cost of components: Apple supplier TSMC is said to be charging its customers up to 20% more for components from January, so Apple has some profit margins to protect.",
    "DigiTimes doesn't go into the reasons why TSMC is putting up its prices, but the increased demand for electronic components is likely to be one of the main reasons, coupled with constrained supplies due to the ongoing pandemic.",
    "As manufacturers have tried to deal with coronavirus restrictions, it's been causing staffing shortages up and down the supply chain – just about every aspect of the production process has been affected, which is why it's so difficult to get hold of anything from a games console to a graphics card at the moment.",
    "iPhone 12 pricing currently starts at $699 / £699 / AU$1,199 for the lowest spec'd iPhone 12 mini, and goes all the way up to $1,399 / £1,399 / AU$2,369 for the highest spec'd iPhone 12 Pro Max. Get ready to pay something above that for the iPhone 13 equivalents.",
    "Apple must have thought the worst was over when it finally pushed the iPhone 12 out in October 2020, a month after it usually unveils its new iPhones every year – all kinds of coronavirus complications meant it couldn't be unveiled in September as normal.",
    "The price hikes being put in place by TSMC haven't been specifically linked to the pandemic, but it's hard to imagine that the state of the world at the moment hasn't played some part: all across the globe, people are off sick and being asked to stay at home.",
    "Electronic chips for computers, tablets, phones, cars and everything else are in short supply as a result, and the impact is going to continue for a long time to come. It's the reason that Google has only been able to make the Pixel 5a available in the US and Japan.",
    "It looks as though the iPhone 13 will be announced on schedule – September 14 is the likely date, with pre-orders on September 17 – but this time around it might be prices rather than timing that the pandemic impacts. Apple will be hoping for a clearer run in 2022 when the iPhone 14 appears."
  ],
  "headers": {
    "3": "Supplier and demand",
    "6": "Analysis: the pandemic continues to cause problems"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "previous rumors": "https://www.techradar.com/news/iphone-13-price-might-not-be-any-higher-than-the-iphone-12s",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "DigiTimes": "https://www.digitimes.com/news/a20210826PD207.html",
    "MacRumors": "https://www.macrumors.com/2021/08/26/iphone-13-price-increase-chip-production/",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "pre-orders on September 17": "https://www.techradar.com/news/iphone-13-release-date-might-have-been-revealed-by-a-retailer",
    "iPhone 14": "https://www.techradar.com/news/four-iphone-14-leaks-you-need-to-know-even-though-it-isnt-coming-until-2022"
  }
}