{
  "source": "https://www.techradar.com/news/google-cloud-and-saps-partnership-is-an-important-one-for-the-cloud-sector-heres-why",
  "title": "Google Cloud and SAP's partnership is an important one for the cloud sector - here's why",
  "category": "computing",
  "updated": "2021-08-09T17:22:10Z",
  "author": "abigail-opiah",
  "summary": "A collaboration that hopes to take cloud to the next level",
  "article": [
    "The recent news that Google Cloud and SAP have extended their partnership was music to the ears of customers everywhere.",
    "The closer working between the two tech giants on security, scalability, cost and integration - areas that are important to critical business systems - means that the RISE with SAP offering should help support businesses transitioning to the cloud everywhere.",
    "That's along with the fact that having two of the biggest names in the cloud sector join forces further validates the belief that working to push businesses along their digital transformation journey isn't simple.",
    "Cloud, which was once flung around the sector as a buzzword, has now firmly settled as a key element of running and maintaining businesses worldwide.",
    "According to a recent whitepaper by Arcserve, there will be over 100 zettabytes of data stored in the cloud by 2025 - the equivalent of around 50% of the world’s data by that time, and a significant increase from the 25% stored in the cloud back in 2015.",
    "Google Cloud says the new partnership will offer its customers the chance to utilize the planned global availability of multiple SAP services and products on its cloud infrastructure, including the SAP Analytics Cloud and SAP Data Warehouse Cloud solutions within SAP Business Technology Platform (SAP BTP).",
    "“Offering integration between SAP solutions, SAP BTP, and Google Cloud infrastructure and capabilities in artificial intelligence, machine learning, and analytics gives customers both the choice they desire as well as the innovative portfolio they seek to transform their businesses in the cloud,\" noted Thomas Saueressig, member of the Executive Board of SAP responsible for SAP Product Engineering.",
    "And not only is this partnership a win for the cloud sector in terms of general growth, but it's also a win for organizations looking to make the leap to the cloud entirely.",
    "Google Cloud and SAP say they will also be working towards helping customers augment existing business systems with the former's capabilities in artificial intelligence (AI) and machine learning (ML).",
    "\"Through support for RISE with SAP and in-depth integrations between SAP and Google Cloud, this new partnership will enable customers to seamlessly bring their most critical business systems and applications to a future-proof, secure, and low-latency environment and to run them sustainably, on the industry’s cleanest cloud,\" Rob Enslin, President at Google Cloud."
  ],
  "headers": {
    "3": "A win for cloud"
  },
  "links": {
    "Google Cloud": "https://www.techradar.com/reviews/google-cloud-cdn",
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "digital transformation": "https://www.techradar.com/news/google-cloud-wants-to-help-speed-up-your-digital-transformation",
    "Arcserve": "https://1c7fab3im83f5gqiow2qqs2k-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/ArcserveDataReport2020.pdf"
  }
}