{
  "source": "https://www.techradar.com/news/motorola-razr-2021-might-be-canceled-but-xiaomi-and-honor-could-fill-the-void",
  "title": "Motorola Razr 2021 might be canceled, but Xiaomi and Honor could fill the void",
  "category": "phones",
  "updated": "2021-06-15T08:42:36Z",
  "author": "tom-bedford",
  "summary": "Magic and Mi",
  "article": [
    "The Motorola Razr (2019) was one of the first-ever foldable phones, and it was followed up with the Razr (2020) which fixed some of the original's issues. A new report says there won't be a Razr (2021) to carry on the tradition.",
    "This comes from a report by DSCC, a display expert, looking at the future of folding devices and the brands working on them. According to the report, \"One company not introducing a new foldable this year is Motorola.",
    "\"The next Razr now isn’t expected until the second half of 2022 as they look to re-invent their foldable design.\"",
    "That might not sound like good news for people hoping for Motorola's third-gen foldable, but it could be. By the sounds of it, Moto will skip its 2021 version of the phone so it can make big improvements for the 2022 version.",
    "Previously, we've given the Razr range lower review scores than Samsung's Galaxy Z line of foldables, so this could be Motorola's way of closing the gap on its core competition.",
    "Of course take this with a pinch of salt. There's no official comment either way, but if you're a big foldable phones fan it sounds like there will be lots of interesting new devices coming soon to take your mind off the Razr.",
    "The DSCC report also gives us our first hint at Honor's first foldable phone. It lists some of the upcoming foldables we'd previously heard of, like the Google Pixel Fold and Oppo's foldable - and the Honor Magic Fold is also mentioned by name.",
    "Apparently, this phone will have the same in-folding design that the Huawei Mate X2 and Samsung Galaxy Z Fold 2 use, so it might not be a total revolution for bending smartphones, but Honor is known for its affordable tech so perhaps this could be one of the first budget foldable phones.",
    "While those other foldables are expected in late 2021, apparently the Honor Magic Fold will 'closely follow' them, so it could also come then or in early 2022.",
    "There's also the successor to Xiaomi's Mi Mix Fold, which is apparently set to come before the end of the year, according to popular leaker Digital Chat Station posting on Weibo.",
    "According to the leaker the new phone, which we'll tentatively label the Mi Mix Fold 2 despite DCS not calling it that, will have the same form factor as its predecessor. However, it's said to have a 5,000mAh battery, 108MP main camera, and top-end Qualcomm Snapdragon 888 chipset.",
    "So the new foldable sounds like an increase in specs, but not a big overhaul of the original device. That first-gen foldable only launched in China, though, so hopefully we'll see the Fold 2 released in more regions."
  ],
  "headers": {
    "6": "You've got the Magic in Mi"
  },
  "links": {
    "Motorola Razr (2019)": "https://www.techradar.com/reviews/motorola-razr",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Razr (2020)": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "Razr (2021)": "https://www.techradar.com/news/motorola-razr-2021",
    "report by DSCC": "https://www.displaysupplychain.com/blog/dsccs-latest-quarterly-foldable-rollable-report-reveals-new-insights-including-cornings-first-foldable-utg-design-win",
    "Google Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "Oppo's foldable": "https://www.techradar.com/news/oppo-foldable-phone-could-launch-very-soon",
    "Huawei Mate X2": "https://www.techradar.com/news/huawei-mate-x2",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Mi Mix Fold": "https://www.techradar.com/news/xiaomi-mi-mix-fold-release-date-price-features-and-everything-you-need-to-know",
    "Weibo": "https://weibo.com/6048569942/KkfN7BB7W?from=page_1005056048569942_profile&wvr=6&mod=weibotime&type=comment"
  }
}