{
  "source": "https://www.techradar.com/news/poirier-vs-mcgregor-3-ufc-246-order",
  "title": "Can't wait to watch Poirier vs McGregor 3 at UFC 264? Here's how to order it now",
  "category": "entertainment",
  "updated": "2021-07-02T22:25:58Z",
  "author": "kevin-lynch",
  "summary": "One of the biggest rivalries in UFC resumes in Las Vegas",
  "article": [
    "Are you ready for war one more time? Conor McGregor is set to stand off against rival lightweight Dustin Poirier for the third time at UFC 264. Set to take place on Saturday, July 10, it's a card no MMA fan will want to miss.",
    "The massive trilogy fight follows the pair's last meeting at UFC 257 in January, which saw the the Notorious beaten in two rounds by the Diamond, leaving the pair tied at one win each going into this much-anticipated decider.",
    "The pair first met at UFC 178 all the way back in 2014, in a fight that saw Irish star McGregor walk away with a TKO in under two minutes. A win here looks likely to set the victor up with a much coveted title shot at current UFC Lightweight title holder Charles Oliveira.",
    "The UFC 264 bill also includes Gilbert Burns' attempt to bounce back from his unsuccessful try at Kamaru Usman’s welterweight title with a tasty looking fight against expert striker Stephen ‘Wonderboy’ Thompson",
    "Read on to discover how to order ESPN Plus's UFC PPV now and get prepared to watch Poirier vs McGregor 3 at UFC 264.",
    "As well as all the drama from Conor McGregor's latest appearance in the Octagon, a subscription to ESPN+ opens up access to exclusive live UFC Fight Nights, alongside original content including Dana White’s Contender Series, UFC Destined, and Ariel & The Bad Guy, plus classic fights, replays, and there’s also the perk of fewer adverts.",
    "Outside of UFC live streams and coverage, ESPN Plus continues to pick up loads of other great live sport action. Alongside top rank boxing, it also shows loads of European soccer, and even gets the odd NHL and NFL game. Considering you get the whole year for less than an effective $30 with the above bundle, it's hard to ignore the value."
  ],
  "headers": {
    "5": "What does a UFC fan receive with their ESPN+ subscription?"
  },
  "links": {
    "ESPN Plus's UFC PPV": "https://go.web.plus.espn.com/c/221109/718846/9070?subId1=trd-us-5862399930671806000&sharedId=trd-us&u=https%3A%2F%2Fplus.espn.com%2Fufc%2Fppv",
    "subscription to ESPN+": "https://go.web.plus.espn.com/c/221109/718846/9070?subId1=trd-us-1347026437158388200&sharedId=trd-us&u=https%3A%2F%2Fplus.espn.com%2Fufc%2Fppv",
    "UFC live streams": "https://www.techradar.com/news/ufc-live-stream-watch-fight-night-events-ppv-online-anywhere"
  }
}