{
  "source": "https://www.techradar.com/news/iphone-13-pro-leak-says-itll-have-this-android-phone-feature",
  "title": "iPhone 13 Pro leak says it'll have this Android phone feature",
  "category": "phones",
  "updated": "2021-04-09T08:45:12Z",
  "author": "james-peckham",
  "summary": "120Hz screen may be landing this year",
  "article": [
    "The iPhone 13 series may be the first time we see Apple debut a 120Hz refresh rate display on its flagship phones, and the latest leak suggests it will be coming to both the iPhone 13 Pro and iPhone 13 Pro Max.",
    "The new information comes from trusted source DigiTimes, which says that Apple's suppliers are switching to different screen technologies for certain models of the upcoming iPhone.",
    "What is a 120Hz refresh rate? That essentially means your phone's screen refreshes 120 times per second, which gives you a smoother image when playing games or scrolling through social media feeds. All current iPhone models have 60Hz screens.",
    "This new report says Apple's screen suppliers are switching to a new low-power LTPO OLED technology, which would be the right technology to allow for Apple to offer a 120Hz screen refresh rate.",
    "Before launch, Apple's iPhone 12 series was rumored to feature this technology but it didn't materialize. It's believed that's because the company believed it couldn't make the tech work without seriously impacting battery life.",
    "Apple is rumored to have made 15-20% improvements in power efficiency on the iPhone 13 Pro series - which is likely down to the upcoming A15 chipset - and that may be why the company thinks the time is right.",
    "A 120Hz refresh rate will use more battery than a 60Hz one, so it may be that Apple is using these new efficiencies to justify switching to the higher spec on its screen.",
    "Lots of flagship Android phones now feature a higher refresh rate than 60Hz, and some particularly high-end models even stretch to 165Hz in an attempt to make gaming better.",
    "This isn't the first time we've seen Apple introduce a higher refresh rate either as we've seen it on iPad Pro and Apple Watch models for the last few years. The 2018 iPad Pro was the first model to feature a 120Hz refresh rate.",
    "What does this mean for an iPhone 13 and iPhone 13 mini? This may remain an exclusive feature for the Pro models, so it may be that Apple decides to offer a 60Hz refresh rate screen display on these cheaper variants.",
    "This doesn't mean the iPhone 13 Pro and iPhone 13 Pro Max are definitely set to get the technology later this year, but it's the biggest sign yet that the company will be offering a higher refresh rate on its 2021 models.",
    "Via MacRumors"
  ],
  "headers": {
    "7": "Common on Android phones"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "DigiTimes": "https://www.digitimes.com/news/a20210408PD204.html",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "MacRumors": "https://www.macrumors.com/2021/04/09/iphone-13-pro-120hz-refresh-rate/"
  }
}