{
  "source": "https://www.techradar.com/news/amd-ryzen-6000-cpus-not-coming-in-2021-more-rumors-claim-we-could-see-5000-xt-chips-instead",
  "title": "AMD Ryzen 6000 CPUs not coming in 2021, more rumors claim – we could see 5000 XT chips instead",
  "category": "computing",
  "updated": "2021-05-02T08:57:06Z",
  "author": "darren-allan",
  "summary": "‘Warhol’ may turn up as APUs still, but latest rumor peddling doubts even that",
  "article": [
    "Earlier this week, we heard a rumor that Ryzen 6000 processors based on Zen 3+ won’t be coming in 2021, and there’s now been a further flurry of speculation that AMD will instead be relying on Ryzen 5000 XT CPUs to provide buyers with new options later this year.",
    "The original source for this that we reported on was YouTube leaker RedGamingTech, but now a whole bunch of folks seem to be on board the rumor bandwagon in this case, including fellow YouTuber Moore’s Law is Dead, who highlighted some other rumors on Twitter, as did Wccftech which spotted all this, including the following tweet from ExecutableFix.",
    "The gist of all this recent spinning from the rumor mill is that Ryzen 6000 CPUs codenamed ‘Warhol’, based on Zen 3+ (a refinement of the current Zen 3 architecture for Ryzen 5000 processors), have disappeared off AMD’s recent roadmap for 2021, and no one is hearing about them anymore – so the theory is they’ve been canceled. Instead, Ryzen 6000 is supposedly now arriving in 2022 as Zen 4 chips.",
    "Remember that it is just a theory, and even the rumor mill underlines this, but what the fresh speculation does is point to an alternative, in that rather than leaving a big hole in Team Red’s line-up for 2021, AMD is planning on releasing 5000 XT versions of current processors (which as you’ll no doubt recall, has been done before with XT chips for the Ryzen 3000 range).",
    "Moore’s Law is Dead further points out the possibility that in fact, ‘Warhol’ may refer solely to next-gen APUs built on an enhanced version of Zen 3 (not Zen 3+), stating that several of his sources at AMD have said that they haven’t heard a Zen 3+ refresh for Ryzen desktop CPUs is in the cards at all (and indeed running with Zen 3+ was never actually AMD’s plan, anyway).",
    "There are somewhat mixed messages around the rumors about Zen 3+, then, but the overall gist is that it doesn’t seem likely there will be a Zen 3+ refresh in the form of Ryzen 6000 this year, and instead we’ll get Ryzen 5000 XT models – still a refresh, but a more minor one.",
    "That said, the previous rumor indicated that the gains from Zen 3+ weren’t huge anyway (but still obviously more than an XT refresh would be).",
    "According to Moore’s Law is Dead, we may also still see ‘Warhol’ emerge in the form of a new APU, but he sounds pretty doubtful about that, even, and as ExectuableFix points out in the above tweet, AMD ‘Phoenix’ – Ryzen 7000 APUs (Zen 4) – have already been spotted in other rumors, with no sign of ‘Warhol’ now."
  ],
  "headers": {
    "4": "APU only?"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-processors",
    "YouTube leaker RedGamingTech": "https://www.techradar.com/news/amd-wont-have-new-ryzen-cpus-for-2021-rumor-claims-this-could-be-intels-big-break",
    "Moore’s Law is Dead": "https://www.youtube.com/watch?v=bqkGNtsZejc&t=968s",
    "Wccftech": "https://wccftech.com/amd-ryzen-6000-warhol-zen-3-desktop-cpus-reportedly-cancelled/",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "Zen 4 chips": "https://www.techradar.com/news/amd-zen-4-rumor-could-be-bad-news-for-intel",
    "Ryzen 3000": "https://www.techradar.com/news/amd-ryzen-3000-processors-should-run-faster-and-cooler-with-this-free-app",
    "gains from Zen 3+ weren’t huge anyway": "https://www.techradar.com/news/amd-wont-have-new-ryzen-cpus-for-2021-rumor-claims-this-could-be-intels-big-break"
  }
}