{
  "source": "https://www.techradar.com/news/cant-be-bothered-installing-windows-11-just-try-it-in-your-browser-instead",
  "title": "Can’t be bothered installing Windows 11? Just try it in your browser instead",
  "category": "computing",
  "updated": "2021-08-26T11:24:13Z",
  "author": "darren-allan",
  "summary": "Interactive Windows 11 experience gives you a flavor of the OS",
  "article": [
    "Windows 11 is, of course, still in preview at the moment, and installing an operating system in testing is a task that most folks won’t want to be bothered with – but there’s now another much easier option: simply give the OS a quick whirl in your browser.",
    "Okay, so upfront we should say that in case you’re imagining that this is some virtual desktop trickery to allow Windows 11 to run in a browser window, well, it isn’t anything of the sort. You’re not going to be ‘running’ Windows 11 in any way, virtually or otherwise, but what you can experience is a website – produced by software developer BlueEdge (as highlighted by Tom’s Hardware) – that offers an interactive demo of how Microsoft’s incoming operating system works.",
    "Check out the site here and have a play around to your heart’s content, but there are unsurprisingly strict limitations on what you can do. Only a small handful of functions and apps are active, but you get a good flavor of what’s on offer, and you can, for example, dip into the new Microsoft Store and explore the main panels of the UI (but nothing is active in terms of the actual content).",
    "BlueEdge provides a good overview of what the desktop and some major apps look like, and how everything is organized – but note that some parts of the interactive experience still aren’t finished. For example, click on File Explorer and you get a blank screen informing you that this part of the interface will be ‘coming soon’.",
    "As Tom’s observes, one interesting point here is that Microsoft obviously holds the copyright on the Windows 11 graphics and assets employed here, so whether BlueEdge’s site might be targeted for takedown on those grounds – well, we’ll have to see.",
    "Obviously, though, Microsoft might feel that it doesn’t hurt to help build up a bit of hype for the desktop OS, though the company would probably have preferred it if the available on-screen functions were all finished before the site went live.",
    "Assuming Microsoft is happy enough to let this website continue to exist, which as mentioned, only time will tell, it’s a pretty handy little way of getting a basic idea of what Windows 11 will deliver without having to do anything except click a link.",
    "Yes, you could watch YouTube videos of folks using the preview version of Windows 11, for example, to get a better and fuller flavor of the OS and all its intricacies, but there’s something satisfying about actually being able to see it full-screen on your own monitor and click things interactively.",
    "It’s a neat little shortcut for the many folks who doubtless can’t be bothered to go through the process of installing the preview version of Windows 11, which is a considerable hassle of course – and involves finding a spare machine for starters. (You don’t want to be running a beta OS on a PC that you actually use for important tasks or daily work, naturally, as things can most certainly get broken with preview software)."
  ],
  "headers": {
    "6": "Analysis: A hassle-free Windows 11 desktop taster can’t be a bad thing"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/try-windows-11-from-browser",
    "Check out the site here": "https://win11.blueedge.me/",
    "flavor of what’s on offer": "https://www.techradar.com/news/microsoft-windows-11-design-will-not-hamper-performance",
    "what Windows 11 will deliver": "https://www.techradar.com/news/over-half-of-current-windows-users-want-to-upgrade-to-windows-11",
    "things can most certainly get broken": "https://www.techradar.com/news/the-latest-windows-11-preview-mangles-windows-security-apps"
  }
}