{
  "source": "https://www.techradar.com/news/amazon-is-launching-an-apple-fitness-plus-rival-but-is-it-too-late-to-the-game",
  "title": "Amazon is launching an Apple Fitness Plus rival – but is it too late to the game?",
  "category": "fitness",
  "updated": "2021-09-29T10:48:29Z",
  "author": "cat-ellis",
  "summary": "Cheap prices may not be enough for Halo Fitness to succeed",
  "article": [
    "Amazon is launching its own home workout service to rival the likes of Peloton, Fitbit Premium, and Apple Fitness Plus – but with gyms reopening and people desperate for an opportunity to get outdoors, is it too late?",
    "Amazon Halo Fitness was revealed alongside the Halo View fitness tracker. Unlike last year's Halo Band, which was an entirely passive device that gathered biometric data to be processed in the Halo smartphone app, the Halo View shows your stats right on your wrist, much like an entry-level Fitbit.",
    "There's no on-board GPS for tracking your route on runs and bike rides, but it has an optical heart rate monitor, blood oxygen sensor, an accelerometer for counting steps, and a skin temperature sensor. Although useful, it's a pretty unremarkable set of features.",
    "What makes the Halo View special is its price: just $79 (about £60 / AU$110). For comparison, the Fitbit Inspire 2 has very similar specs, but will set you back $99.95 / £89.99 / AU$149.95.",
    "Amazon Halo Fitness takes a similar approach, not offering anything new and groundbreaking, but seriously undercutting its rivals on price. Halo Fitness will provide subscribers with instructor-led workouts that they can follow at home, with heart rate data streamed to their TV from their Halo device in exactly the same way Apple Fitness Plus displays data from an Apple Watch.",
    "Halo Fitness will include cardio, strength, yoga and mobility classes, which are all par for the course. What differentiates it is the price. An Amazon Halo subscription costs $3.99 (about £3 / AU$5) per month, compared to $12.99 / £12.99 (about AU$18) for Peloton Digital, or $9.99 / £9.99 / AU$14.99 for Apple Fitness Plus – and your first year is free when you buy an Amazon Halo View.",
    "That still might not be enough, though. Although low, that monthly subscription fee will add up, and you may find it hard to justify after your free trial expires if there's nothing unique on offer.",
    "Even without a subscription, Halo View owners will still get access to data including their heart rate, step count, simple sleep stats, and calories burned. Extra tools (such as health insights, activity intensity, and sleep score) are nice to have, but not essential, and although the Halo Fitness workouts will doubtless be well designed and led with enthusiasm, so far they just don't sound different enough.",
    "There's also the matter of timing. Apple launched Fitness Plus a little over a year ago, when many of its customers were in lockdown and had nowhere to exercise but their living rooms. It was a golden opportunity, and the company seized it.",
    "Now, yet another workout service is much less of a novelty, and with people starting to renew their gym memberships, Amazon may have missed the boat. Unless it offers something truly unique (like leveraging its power to introduce celebrity instructors), it may struggle to get off the starting blocks."
  ],
  "headers": {
    "6": "A false start?"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Halo View": "https://www.techradar.com/news/amazon-halo-view",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Fitbit Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "Amazon Halo subscription": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fhelp%2Fcustomer%2Fdisplay.html%3FnodeId%3DGQAJNVT7S4XCHMT2%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2673939548651366400-20"
  }
}