{
  "source": "https://www.techradar.com/news/xiaomi-phones-might-finally-get-good-software-or-less-bad-at-least",
  "title": "Xiaomi phones might finally get good software - or less bad, at least",
  "category": "phones",
  "updated": "2021-06-03T14:48:33Z",
  "author": "tom-bedford",
  "summary": "MIUI is finally getting fixed",
  "article": [
    "Ask ten Xiaomi phone owners their top problems with the phone, and nine of them will probably tell you 'the software' (we imagine - we couldn't find ten users to check). MIUI is known for being a very buggy fork of Android used in Xiaomi's Mi, Redmi and Poco smartphones, though it does have some neat customization options.",
    "Well all that could change, because on Xiaomi's official forums, the company officially confirmed 'we are designing the brand new MIUI system'. This was posted alongside a questionnaire, where people could list their problems with the user interface, though it closed quite quickly after launch.",
    "According to the post, the survey was for 'Issues/Bugs which you are facing most & want to get fixed and more!' - the wording seems to imply Xiaomi can't fix all the MIUI problems, but will try to get to some.",
    "This seems to suggest Xiaomi is crowdsourcing a hit-list of the most egregious bugs people want fixing, a list we hope will include the app scanner for newly-installed apps which appears over everything else you're doing, the tendency for notifications to get sent multiple times (or for a notification alert to appear when nothing has been received), and the fact your wallpaper will sometimes revert back to the default one for no obvious reason.",
    "There's no indication of when this revamped version of MIUI will launch. It probably won't be in time for MIUI 13, which we're expecting to see any day now, but perhaps version 13.5 or 14 will bring lots of fixes.",
    "Frequently the phrase 'MIUI is really buggy' (in some kind of wording) will appear in the 'cons' list of Xiaomi phone reviews, and we're getting quite tired of writing it. Hopefully an MIUI fix will come along soon and improve the user experiences of these otherwise fantastic phones.",
    "Via Notebookcheck"
  ],
  "headers": {},
  "links": {
    "Xiaomi phone": "https://www.techradar.com/news/best-xiaomi-phones",
    "Xiaomi's official forums": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1262885330030496000&xs=1&url=https%3A%2F%2Fc.mi.com%2Fthread-3726707-1-1.html&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fxiaomi-phones-might-finally-get-good-software-or-less-bad-at-least",
    "MIUI 13": "https://www.techradar.com/news/miui-13",
    "Notebookcheck": "https://www.notebookcheck.net/Buggy-MIUI-12-forces-Xiaomi-to-open-survey-for-Global-ROM-smartphone-users.543019.0.html"
  }
}