{
  "source": "https://www.techradar.com/news/your-apple-watch-lets-you-stroll-with-dolly-parton-who-else-would-you-walk-with",
  "title": "Apple Time to Walk lets you stroll along with celebrities – who would you like to join?",
  "category": "fitness",
  "updated": "2021-01-30T17:00:05Z",
  "author": "cat-ellis",
  "summary": "Opinion: let me take you on a journey...",
  "article": [
    "Earlier this week, Apple launched Time to Walk - a series of podcast-like interviews with well-known guests that are intended to help you get out of the house, take a stroll, and complete your exercise rings. Each episode (there are four at launch, and Apple plans to add a new one each week) is around 25 to 40 minutes long, and involves the guest telling three stories about their lives and interests, followed by three of their favorite songs.",
    "The episodes play directly through your Apple Watch, and are available to Apple Fitness Plus subscribers.",
    "The first four guests are musicians Shawn Mendes and Dolly Parton, actor Uzo Aduba, and basketball player Draymond Green. It’s a lovely idea – even if you’re alone, you can take a walk ‘with’ someone else. I spent a pleasant half hour wandering around my cold, rainy hometown listening to Dolly Parton’s tales from her childhood in Tennessee, and it made me start thinking about who else would be able to spin a good yarn for Apple users to walk to. Who would you pick as your storyteller?",
    "Actor Daniel Kaluuya is probably now best known for his role in Get Out, which earned him an Oscar nomination, but I first saw him in the Black Mirror episode Fifteen Million Merits. If you’ve not seen it (and you don’t mind something a little dark), it’s set in a society where ordinary people cycle for hours on stationary exercise bikes to earn Merits, which act as currency for daily life. Collect enough Merits, and you’ll have the chance to take part in a reality TV style talent show, and possibly win a chance at a better life.",
    "Maybe not the best story to think about while filling up your activity rings, but you’ve got to admit it’s apt, and the story is really brought to life by Kaluuya’s gut-wrenching performance as desperate protagonist Bing.",
    "Kaluuya wrote his first play when he was just nine years old, and worked his way up from his local theater school to Hollywood, switching back and forth between the stage and the writers’ room. He’s just 31, but he’s a fantastic storyteller and must have amassed a huge collection of anecdotes throughout his career so far.",
    "Gillian Burke is a naturalist and TV presenter, and at the time of writing is co-presenting Winterwatch on BBC 2. She first developed an interest in wildlife through photography, observing the natural world with her father in Kenyan game parks, and following her mother’s conversation work for the UN.",
    "I’d love to hear a Time to Walk episode from Burke for two reasons. Firstly, she’s so passionate, and I can easily imagine her sharing stories about the wildlife in three of her favourite places, or three of the species of plants or animals she finds most interesting - sharing her knowledge and enthusiasm. Secondly, she has a very relaxing voice - very different to Dolly Parton, but just as distinctive.",
    "If you grew up in the UK, you’re almost guaranteed to have one of Mary Berry’s many, many recipe books to hand in the kitchen - probably well-used, and with specks of cake batter on the most-used pages. She’s one of the country’s best known and best loved food writers and presenters, and saw a surge in popularity more recently for her role as a judge on The Great British Bake Off (or as it’s known in the US, The Great British Baking Show) during its run on the BBC.",
    "Berry (now 85) first developed an interest in cooking in high school, and has since written over 70 books and appeared on innumerable TV shows. I imagine her Time to Walk episode focusing on the stories behind some of her favorite recipes - how they came about, and what they mean to her. And what radio station does she keep on in her own kitchen?"
  ],
  "headers": {
    "3": "Daniel Kaluuya",
    "6": "Gillian Burke",
    "8": "Mary Berry"
  },
  "links": {
    "Time to Walk": "https://www.techradar.com/news/apple-time-to-walk-lets-you-take-a-stroll-with-a-new-celebrity-guest-every-week",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Daniel Kaluuya": "https://www.imdb.com/name/nm2257207/",
    "Black Mirror": "https://www.techradar.com/best/best-black-mirror-episodes-the-top-10-episodes-ranked",
    "Gillian Burke": "https://twitter.com/gillians_voice",
    "Winterwatch": "https://www.bbc.co.uk/programmes/p012msk2",
    "Mary Berry": "https://www.imdb.com/name/nm2915364/",
    "The Great British Bake Off": "https://thegreatbritishbakeoff.co.uk/"
  }
}