{
  "source": "https://www.techradar.com/news/move-over-zoom-whatsapp-can-now-make-voice-and-video-calls-from-the-desktop",
  "title": "Move over, Zoom – WhatsApp can now make voice and video calls from the desktop",
  "category": "computing",
  "updated": "2021-03-04T10:58:43Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Voice and video calls land for desktop users",
  "article": [
    "It has been a very long time coming, but the desktop version of WhatsApp is finally getting one of the most useful features of the mobile app. After a lengthy period of beta testing, the desktop app is getting voice and video calls.",
    "But while this is great news for WhatsApp users, the arrival of voice and video calls on the desktop is not a direct port of those same options found in the mobile app. For now, there are a few limitations, but this will change further down the line.",
    "Until now, anyone using the WhatsApp desktop app on Windows or macOS has been limited to communicating using text-based messages – although it is possible to send images and other attachments. But the latest update means that voice calls can be placed using a microphone, while supported systems with webcams can be used to make video calls.",
    "The limitation that will disappoint many people is that group calling is not currently supported. Regardless of whether you are indulging in a voice or video call one the desktop, you are limited to chatting with one other person for now. This is something that will change in the future, but at the moment it is not quite clear how far off this might be. While this limitation is present, WhatsApp’s desktop call options will not pose a threat to the likes of Zoom, Skype or Microsoft Teams.",
    "Just as with calls placed between mobile devices, and standard text-based messaging in WhatsApp, voice and video communication in the desktop app is protected with end-to-end encryption. Calls can be placed across platforms and device, but the desktop app remains reliant on your phone for now.",
    "If you’re chatting with someone using their mobile, there’s support for portrait and landscape video. Chat windows will remain on top of other windows so you can continue to use your computer for other things without losing sight of a video call.",
    "The prerequisites for making and receiving voice and video call in WhatsApp Desktop are not particularly great. Mac users need to be running at least macOS 10.13, while PC users must have the 64-bit edition of Windows 10 version 1903 or newer installed.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Good to talk"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/best/whatsapp-alternatives",
    "video calls": "https://www.techradar.com/best/best-video-conferencing-software",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "TechCrunch": "https://techcrunch.com/2021/03/04/whatsapp-rolls-out-voice-and-video-call-support-to-desktop-app/"
  }
}