{
  "source": "https://www.techradar.com/news/zero-trust-could-be-the-key-to-defending-against-barrage-of-ransomware-attacks",
  "title": "Zero trust could be the key to defending against ransomware attacks",
  "category": "computing",
  "updated": "2021-11-29T14:40:59Z",
  "author": "sead-fadilpasic",
  "summary": "Most organizations are already deploying zero-trust",
  "article": [
    "Zero-trust architecture is set to increase the efficiency of cybersecurity solutions to stop data breaches by 144%, a new report has claimed.",
    "Surveying 125 IT and security decision-makers from both midsize and large organizations, on their plans surrounding zero-trust architecture, Symmetry Systems found the majority of organizations are well acquainted with the advantages of zero-trust and are rushing to deploy.",
    "For the majority (53%), the main motivator for the deployment of zero-trust architecture is ransomware attacks. However, they are also keen on securing customer data, as well as protecting themselves, and their employees, in these new remote-first and hybrid working-first environments.",
    "How many will be left behind? Not too many, but still a significant portion, the report suggests. Allegedly, more than 90% of respondents confirmed their organization was planning an enterprise-wide deployment of zero-trust architecture.",
    "Zero-trust allows for the elimination of one point of failure, during a data breach. Even if malicious actors get their hands on login credentials, database locations or IPs, with zero-trust integration that information is useless, as they’re barred from accessing information given to application roles, cloud-network perimeters, or Identity and Access Management (IAM). Speaking of IAM, almost three-quarters (73%) of respondents are focused on IAM for employees, as the key design modification for zero trust.",
    "Elsewhere in the report, the two companies listed different challenges businesses are facing when deploying zero-trust architecture, with the majority (55%) saying legacy system limitations were their number one barrier.",
    "\"Today's threat environment is drastically different from what we have experienced even in recent years – with relentless cyberattacks, the adoption of cloud services and mass remote or hybrid work,\" said Michael Sampson, Senior Analyst at Osterman Research, which helped with the report. \"Many organizations have begun the transition to a zero-trust architecture and those who have not are behind the curve.\""
  ],
  "headers": {
    "3": "Legacy system limitations"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "login credentials": "https://www.techradar.com/best/best-identity-management-software",
    "IPs": "https://www.techradar.com/vpn/best-vpn-for-business"
  }
}