{
  "source": "https://www.techradar.com/news/indiana-jones-5-is-about-to-begin-filming-heres-what-we-know",
  "title": "Indiana Jones 5 is about to begin filming – here’s what we know",
  "category": "entertainment",
  "updated": "2021-06-03T09:48:15Z",
  "author": "axel-metz",
  "summary": "Indy is back for one more adventure",
  "article": [
    "After years of rumors and delays, Indiana Jones 5 is confirmed to begin filming next week in the UK.",
    "As per a recent Deadline report, the fifth and final instalment of George Lucas' iconic adventure franchise will begin shooting at the UK’s Pinewood Studios in June.",
    "Indiana Jones 5 had been in various stages of stagnant development for almost 13 years following the release of The Kingdom of the Crystal Skull in 2008, before Logan and Ford Vs Ferrari director James Mangold signed on to steer the project in 2020.",
    "Disney hasn’t yet officially confirmed that filming is about to begin, though Harrison Ford has already been spotted near the studios. He is expected to be joined by co-stars Mads Mikkelsen, Thomas Kretschmann, Phoebe Waller-Bridge and Shaunette Renée Wilson in the coming weeks.",
    "Steven Spielberg, who helmed all four of the series’ previous entries, stepped away from directing duties on the upcoming project last year, though he will remain involved as a producer, alongside Kathleen Kennedy, Frank Marshall and Simon Emanuel. John Williams will also be returning as the movie’s composer, so don’t expect any major variations on that iconic theme.",
    "Beyond that, though, there hasn’t been a whole lot of concrete information surrounding the anticipated project. Ford himself had previously suggested he wouldn’t make another Indiana Jones “unless [he was] in a position to kill it,” which at least bodes well for the quality of the fifth movie’s story.",
    "We’ve also been given an official release date: July 29, 2022.",
    "Naturally, we don’t yet have any confirmed details about the movie’s plot.",
    "Previous rumors had suggested a 1960s space race theme, though more recent reports had hinted at shoot set-ups near Bamburgh castle in the UK – a world away from the launch control centers of Houston.",
    "There has, however, been plenty of enthusiasm bestowed upon the movie’s script. Mads Mikkelsen, speaking to Collider in May, described it as “everything [he] wished it to be.”",
    "The Danish actor also teased the collaborative nature of his role: \"I do think I'm invited in to create a character – I think that everybody wants that. That's why they pick certain actors that they think can come up with certain things, and it will be a collaboration as it always is.”",
    "Does that mean Mikkelsen will be playing the movie’s villain? Given his CV – which counts Hannibal Lector and Le Chiffre among his most celebrated roles – it wouldn’t be a surprise.",
    "As for where the franchise will go next, Lucasfilm president Kathleen Kennedy has frequently denied that another actor will eventually replace Ford in the title role, and since we know Indiana Jones 5 to be the \"fifth and final\" movie in the franchise, there’s every chance this really could be the last time we see the iconic adventurer in action.",
    "Until the inevitable reboot, that is. Or Bethesda's upcoming Indiana Jones video game."
  ],
  "headers": {
    "7": "The plot thickens"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/06/indiana-jones-5-begin-filming-uk-next-week-harrison-ford-phoebe-waller-bridge-mads-mikkelsen-1234767764/",
    "Phoebe Waller-Bridge": "https://www.techradar.com/news/indiana-jones-5-gets-phoebe-waller-bridge-and-john-williams",
    "previously suggested": "https://www.heyuguys.com/harrison-ford-updates-indiana-jones-5/",
    "Collider": "https://collider.com/indiana-jones-5-script-mads-mikkelsen-comments/",
    "Indiana Jones video game": "https://www.techradar.com/news/new-indiana-jones-game"
  }
}