{
  "source": "https://www.techradar.com/news/alan-wake-2-sounds-like-its-coming-back-to-save-the-day-through-the-power-of-rock",
  "title": "At last, Alan Wake 2 might finally be happening – and it's going to sound amazing",
  "category": "gaming",
  "updated": "2021-08-16T10:44:39Z",
  "author": "cat-ellis",
  "summary": "The Old Gods of Asgard are back on tour",
  "article": [
    "The long-rumored Alan Wake 2 may now be in full development, according to an investment report from developer Remedy Entertainment (via Eurogamer). Back in May, VentureBeat's Jeff Grubb said that Alan Wake 2 was one of the two projects the studio was making with Epic Games.",
    "That should mean more Twin Peaks-inspired horror, more gathering batteries – and more otherworldly horrors defeated through the power of rock.",
    "Music was a real highlight of Alan Wake, with fictional band Old Gods of Asgard playing a key role in both the plot and soundtrack. Ageing rockers Tor and Odin Anderson provide Alan with advice about defeating the game’s antagonist, and their music (performed by Finnish band Poets of the Fall) provides the backdrop for one the game’s most epic battles.",
    "The first game ended with the Old Gods going back on tour – and it looks like they’re still on the road for the sequel.",
    "Poets of the Fall have worked with Remedy Entertainment since 2003, when The band’s frontman Marko Saaresto (a friend of Remedy’s creative director Sam Lake) composed the song Late Goodbye as the closing theme for Max Payne 2: The Fall of Max Payne in 2003.",
    "With their real-world tours suspended, the band had some serious time on their hands during the pandemic. In 2020 they recorded a set of videos in the Alexander Theater in Helsinki (later released as an album), but were otherwise uncharacteristically quiet. In January 2021, they dropped a rather large hint at their next project by sharing links to new Twitter and Instagram accounts for Old Gods of Asgard.",
    "Not long after, a line of official Old Gods merchandise also appeared on Backstage Rock Shop. The Old Gods are back – and this time, they’ve got hoodies.",
    "All this marketing for the Old Gods suggests that Alan Wake 2 might feature even more original songs than the first game, which was almost taken off sale permanently due to a music licensing problem.",
    "Alan Wake is split into TV-style episodes (six for the main game, and two for the DLC package The Signal), each of which has its own closing song. One of these is credited to Old Gods of Asgard and another to Poets of the Fall, but the remaining six were licensed works from other artists including Roy Orbison and David Bowie.",
    "Unfortunately the original licenses didn’t allow the music to be used indefinitely, leaving Remedy with a choice of either modifying the game with different tracks, or pulling it from sale entirely. Believing that changing the soundtrack would damage the game, Remedy opted for the latter, and the game was removed from Steam in May 2017.",
    "Thankfully for fans, Microsoft stepped in and used its clout to renegotiate the contracts, allowing the game to go back on sale unaltered. It was a close call though, and it’s possible that Remedy may opt for a fully original soundtrack, as it did for 2019's Control, to avoid having its fingers burned again.",
    "In an interesting crossover, Control also featured a track from Old Gods of Asgard, so Tor and Odin clearly haven't been sitting on their hands. We're looking forward to seeing – and hearing – more very soon."
  ],
  "headers": {
    "4": "Old Gods, new songs"
  },
  "links": {
    "according to an investment report": "https://investors.remedygames.com/announcements/remedy-drives-growth-with-moves-towards-publishing-and-new-games/",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-08-15-it-looks-like-that-rumoured-alan-wake-sequel-has-gone-into-full-production",
    "VentureBeat's Jeff Grubb": "https://twitter.com/nibellion/status/1377312988990955524?lang=en",
    "Poets of the Fall": "https://twitter.com/PoetsOfTheFall",
    "Twitter": "https://twitter.com/oldgodsofasgard/",
    "Instagram": "https://www.instagram.com/oldgodsofasgardband/",
    "Backstage Rock Shop": "https://www.backstagerockshop.com/collections/old-gods-of-asgard",
    "the game was removed from Steam": "https://www.techradar.com/news/get-an-amazing-deal-on-alan-wake-before-it-disappears-from-stores",
    "Control": "https://www.techradar.com/reviews/control-review"
  }
}