{
  "source": "https://www.techradar.com/news/gpu-makers-saw-profits-rise-370-due-to-inflated-prices",
  "title": "GPU makers see profits rise 370% due to inflated prices",
  "category": "computing",
  "updated": "2021-06-11T09:57:42Z",
  "author": "jess-weatherbed",
  "summary": "Please, we just want affordable graphics cards",
  "article": [
    "If you've been trying to get your hands on a new graphics card in recent months, chances are you've found yourself staring in disbelief at the price tag on some of the latest offerings from Nvidia and AMD. While it isn't exactly surprising, it turns out people who are lucky enough to find GPUs actually available for purchase are desperate enough to pay those eyewatering markups to upgrade their rig (or build their first gaming PC). A study conducted by Jon Peddie Research reports that Add-In Board (AIB) graphics card shipments increased by 24.4% year-on-year, which is a staggering figure in itself, until you also see that GPU makers earned around $12.5 billion in Q1, an insane increase 370% from the previous year.",
    "Inflated prices for graphics cards have been an issue for several months, with the likes of 3DCenter previously reporting that coveted products such as the Nvidia’s RTX 3000 (Ampere) series are selling for almost three times their recommended retail price, making GPUs like the 'entry-level- GeForce RTX 3060 unaffordable for its target market.",
    "Analysts from Jon Peddie state that \"We believe the stay-at-home orders created demand in 2020 and in the first quarter of 2021. Home PCs and workstations became the center of professional life and often the main source of entertainment during the lockdowns. Gaming added to the pressure on the supply chain as it continued to grow in popularity.\" In short, this situation has occurred because of a 'perfect storm', with an ongoing shortage of silicon and components needed to manufacture graphics cards, a boom in cryptomining causing people to buy up the available stock in bulk for mining builds and of course, scalpers taking advantage of the high demand and using bots to bypass website restrictions to buy what limited inventory is available.",
    "With this existing demand, we're seeing GPU suppliers inflating the shelf price of popular models like the GeForce RTX 3080 and the Radeon 6800 XT significantly higher than the base price of the original reference cards from Nvidia and AMD.",
    "Sadly there really isn't much we can do in this situation. It's infuriating for gamers and PC building hobbyists, but until something finally gives in either the Crypto market or supply chain then your best chance of getting a shiny new graphics card to play the latest AAA titles is to buy a gaming laptop or a prebuilt system. Not only are these a more affordable option than trying to go the DIY PC route right now, but availability isn't suffering as much as the bigger GPU market. Another alternative is to use a streaming service like GeForce Now until the market calms down, though this is only suitable for gaming and won't help anyone in a creative field trying to upgrade their hardware to keep up with design software demands.",
    "If you're set on trying to secure a new GPU regardless of the depressing prices then we've created pages dedicated to where to buy the RTX 3080, where to buy the RTX 3070 and where to buy the RTX 3060, among others, which will keep you updated when stock comes in.",
    "Via Tom's Hardware"
  ],
  "headers": {
    "2": "Why are GPUs so expensive?"
  },
  "links": {
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "build their first gaming PC": "https://www.techradar.com/how-to/how-to-build-your-first-gaming-pc",
    "A study conducted by Jon Peddie Research": "https://www.jonpeddie.com/press-releases/graphic-add-in-board-shipments-lift-off-in-q12021",
    "Nvidia’s RTX 3000 (Ampere)": "https://www.techradar.com/news/nvidia-ampere",
    "almost three times": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-gpu-stock-nightmare-continues-as-prices-skyrocket",
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "ongoing shortage of silicon": "https://www.techradar.com/news/chip-shortage-nightmare-could-last-for-years-says-ibm",
    "cryptomining": "https://www.techradar.com/news/how-cryptomining-is-making-it-harder-to-find-the-graphics-cards-you-want",
    "mining builds": "https://www.techradar.com/best/mining-rigs",
    "scalpers taking advantage of the high demand": "https://www.techradar.com/news/profiteers-resold-nearly-50000-nvidia-rtx-30-series-gpus-on-ebay-and-stockx",
    "GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Radeon 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "buy a gaming laptop": "https://www.techradar.com/news/thinking-about-building-your-first-pc-dont-buy-a-gaming-laptop-instead",
    "prebuilt system": "https://www.techradar.com/news/the-nvidia-rtx-3080-is-still-hard-to-find-so-maybe-its-time-to-just-get-a-prebuilt-gaming-pc",
    "GeForce Now": "https://www.techradar.com/news/i-tried-nvidia-geforce-now-on-everything-i-own-could-it-replace-my-gaming-pc",
    "where to buy the RTX 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "where to buy the RTX 3070": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3070-find-stock-here",
    "where to buy the RTX 3060": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-find-stock-here",
    "Tom's Hardware": "https://www.tomshardware.com/uk/news/sales-of-graphics-cards-hit-12-1-billion-in-q1-2021"
  }
}