{
  "source": "https://www.techradar.com/news/this-has-been-the-worst-amazon-prime-day-for-pc-gaming-in-years",
  "title": "This has been the worst Amazon Prime Day for PC gaming in years",
  "category": "computing",
  "updated": "2021-06-23T02:13:29Z",
  "author": "bill-thomas",
  "summary": "Opinion: it's not really even Amazon's fault",
  "article": [
    "One of the best things about Amazon Prime Day in the past has been the ability to build a cheap gaming rig. Sure, you were never going to see the top-end flagship graphics card on a deep discount, but you could save on RAM and SSDs and other such components to kind of subsidize the cost of the GPU of your dreams.",
    "That wasn't exactly possible this year.",
    "Not that I was surprised. It doesn't exactly require a constant vigil over the graphics card market to see that prices are still incredibly inflated and availability isn't going to be fixed any time soon – even if we've heard some rumors that suggest some relief may be coming. I'll believe it when I see it at this point.",
    "But while I wasn't expecting gamers to be able to buy an RTX 3080, it seemed like an easy choice to me for PC manufacturers to throw some of their best gaming PCs on sale. And, we did see some of that – the Alienware Aurora R12, strapped with an RTX 3080, saw a pretty deep discount, but that wasn't even on Amazon.",
    "See what I mean?",
    "On the first day of Amazon Prime Day, my first goal was to find gaming PCs on sale. Mostly because that's, like, my job, but also because I have friends who have been on the market for a new gaming rig for months, and they need something. And, wow was Prime Day a disappointment for that.",
    "In the US at least, there weren't any gaming PCs on sale at Amazon, and the only ones I could find at a major retailer were at Best Buy, and those were so bad. One of the top deals at Best Buy was this iBuyPower Arc gaming PC (it's not on sale any more). Best Buy cut the price down to about $500, but it's equipped with an Nvidia GeForce GT 710.",
    "That graphics card was trash when it came out in 2014, and by today's standards, the integrated graphics in most processors are actually better. But, because it's paired with the Intel Core i3-10105F, you can't just pull that graphics card out and throw it in the dumpster where it belongs.",
    "It wasn't really until I looked at Dell's website and saw the excellent Aurora R12 with a $290 discount that I found something I could easily recommend to friends on the market for a new gaming PC. And even then, that's not a PC I would recommend to an enthusiast, as it's not the easiest to tear down and scavenge for parts if you want to build something on your own.",
    "However, while you were probably left disappointed if you were on the market for a gaming PC, there were actually a pretty good amount of gaming laptop Prime Day deals out there. A lot of these seemed to be the gaming laptops equipped with last-generation Nvidia Turing graphics like the RTX 2070 and RTX 2080, but those GPUs are still more than good enough to power through most modern games.",
    "There were even a pretty good amount of gaming laptops out there with current-generation RTX 3000 series GPUs, which is what I would go with if I had to settle for a gaming laptop right now.",
    "And hey, maybe a gaming laptop is your preferred way to do some PC gaming, in which case this Prime Day offered, and is still offering a pretty good choice of gaming laptops on sale. Though, it seems like the best ones, like the Razer Blade 15 and the Alienware m15 are starting to sell out, and that really just makes sense.",
    "If you're one of the lucky few that's just totally happy with their existing gaming PC itself, then there are still quite a few peripheral deals out there that are pretty great. Corsair, Razer and other manufacturers put a ton of gaming mice, headsets and keyboards on sale, so if your setup is getting a little stale, or if you want to graduate to a mechanical keyboard – and you totally should – you can still do that.",
    "Even if you were just looking for a cheap mouse and keyboard that'll just let you play games, there were a lot of savings to be had. The Razer Deathadder Essential, for instance, got its price cut all the way down to $19 at Amazon, and that's an excellent little mouse.",
    "So, if you just needed to upgrade your peripheral game, there were some pretty good deals out there.",
    "Until the global silicon shortage ends, it's unlikely that big sales like Amazon Prime Day are going to be fruitful for PC gamers looking to build their next best gaming PC. And with the way Prime Day went this year, I'm not really expecting Black Friday to be much different.",
    "Things could change, of course. Prices for the best graphics cards have started to come down, but they're still nowhere near their actual launch prices. It's still an awful time to build a new gaming PC, and it doesn't look like it's going to change any time soon. Sorry, gamers."
  ],
  "headers": {
    "5": "Shoveling out the worst gaming PCs on the market",
    "9": "Time to get a gaming laptop, I guess",
    "12": "Finishing up your gaming setup",
    "15": "The new normal?",
    "17": "More Amazon Prime Day deals in the US"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "cheap gaming rig": "https://www.techradar.com/news/best-budget-gaming-pc-2018-top-gaming-desktops-for-less",
    "RAM": "https://www.techradar.com/news/best-ram",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "the Alienware Aurora R12, strapped with an RTX 3080,": "https://www.techradar.com/news/this-rtx-3080-gaming-pc-deal-is-probably-the-best-youre-going-to-get-on-prime-day",
    "gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "iBuyPower Arc gaming PC (it's not on sale any more)": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1392437499839954400&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fibuypower-arc-gaming-desktop-intel-i3-10105f-8gb-memory-nvidia-geforce-gt-710-1gb-480gb-ssd%2F6459368.p%3FskuId%3D6459368&article_name=This%20has%20been%20the%20worst%20Amazon%20Prime%20Day%20for%20PC%20gaming%20in%20years&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-has-been-the-worst-amazon-prime-day-for-pc-gaming-in-years",
    "gaming laptop Prime Day": "https://www.techradar.com/news/screw-the-gpu-shortage-these-are-the-best-gaming-laptop-prime-day-deals"
  }
}