{
  "source": "https://www.techradar.com/news/this-web-hosting-company-is-entering-the-tape-storage-business",
  "title": "This web hosting company is entering the tape storage business",
  "category": "computing",
  "updated": "2021-01-21T14:33:37Z",
  "author": "barclay-ballard",
  "summary": "OVHcloud is working with IBM and Atempo",
  "article": [
    "OVHcloud, perhaps best known for its web hosting services, has launched a new tape-storage-as-a-service offering, working alongside IBM and data management firm Atempo. The new service will be managed from four data centers within France, which should help businesses meet data sovereignty regulations.",
    "While compliance costs have risen steadily in the cloud market, so too has the price of the storage itself. OVH has chosen to use tape storage as this offers the lowest cost per terabyte or all the storage options available today. Longevity is another strength, with data stored on tape legible for at least 30 years.",
    "In addition to using IBM Enterprise 3592 Tape technology, OVH's new cloud storage service will leverage Atempo’s Miria platform to migrate, manage and synchronize the data being stored. OVHcloud will host the data in its new dedicated facilities, prioritizing the security of its customers’ data.",
    "“We are very pleased that the convergence of IBM, Atempo and OVHcloud expertise results in a reliable and sovereign data preservation solution” Sylvain Rouri, Chief Sales Officer at OVHcloud, said. “Public and private organizations will benefit from a unified and highly secure storage experience with our high-performance solutions built in a trusted cloud.”",
    "In addition to cost benefits, using tape will allow businesses to organize their data more efficiently, switching some of their archive data to OVHcloud, without having to delete information that may be needed again in the future. With the new offering, businesses will be able to restore the data stored on tape in a timeframe ranging from 10 minutes to 12 hours.",
    "So far, OVH has not released pricing details regarding its new storage solution but with AWS Glacier, which offers a similar service, prices vary widely based on retrieval time and geography.",
    "Via The Register"
  ],
  "headers": {
    "3": "Commit to tape"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "said": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5247942084297540000&xs=1&url=https%3A%2F%2Fwww.ovh.co.uk%2Fnews%2Fpress%2Fcpl1727.ovhcloud-teams-ibm-and-atempo-trusted-secure-cloud-storage-solution&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-web-hosting-company-is-entering-the-tape-storage-business",
    "The Register": "https://www.theregister.com/2021/01/20/ovhcloud-tape-storage-as-a-service/"
  }
}