{
  "source": "https://www.techradar.com/news/huaweis-next-foldable-phones-may-be-the-first-you-can-afford",
  "title": "Huawei’s next foldable phones may be the first you can afford",
  "category": "phones",
  "updated": "2021-04-20T13:47:03Z",
  "author": "hamish-hector",
  "summary": "Cheap and (we’re) cheerful",
  "article": [
    "Foldable smartphones have yet to take the world by storm and we’re not surprised - they’re very expensive. Huawei could be set to change that this year though, thanks to rumored plans for three cheaper foldable handsets.",
    "A report from DigiTimes claims that industry insiders believe Huawei is releasing three foldable smartphones in 2021, with “more friendly pricing, targeting the entry-level segment to spur demand.”",
    "This move would certainly make sense, the best foldable phones on the market right now will set you back in the region of $1,000 (£800 / AU$1,300), and you can definitely find better smartphone options for the price.",
    "If Huawei can undercut the competition they could gain a substantial lead over competitors like Samsung, who’s yet to see widespread success with its Galaxy Z Fold and Galaxy Z Flip line of phones. This report doesn’t share any specific pricing for Huawei’s upcoming phones.",
    "If the reports are true, and Huawei is trying to produce foldable phones at a more affordable price point, then it might not be long before more people have one in their pockets. High prices are always the main gatekeeping factor with new tech, but sales can skyrocket when the cost drops; just look at virtual reality.",
    "VR is only slightly older than folding phones and has already seen an affordable headset take the world by storm: the Oculus Quest 2. The Quest 2 has sold better than all other Oculus headsets combined, and other data suggests it could be the most popular VR device from any brand. This is likely thanks, at least in part, to the headset’s much lower price compared to other options.",
    "Similarly, if Huawei can make foldable phones cheaper it could soon see the same levels of success - provided these less expensive handsets are still worth the cost of entry. We’ll have to wait and see what comes of these rumors, but we’re excited to see what the future holds if they’re true."
  ],
  "headers": {
    "4": "Could Huawei make folding phones mainstream?"
  },
  "links": {
    "DigiTimes": "https://www.digitimes.com/news/a20210419PD208.html",
    "best foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "better smartphone options": "https://www.techradar.com/news/best-phone",
    "Galaxy Z Fold": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review"
  }
}