{
  "source": "https://www.techradar.com/news/disney-confirms-when-eternals-will-land-on-disney-plus",
  "title": "When is Eternals coming to Disney Plus?",
  "category": "entertainment",
  "updated": "2021-12-10T16:33:08Z",
  "author": "tom-power",
  "summary": "Eternals' Disney Plus release date has been revealed",
  "article": [
    "When will Eternals come to on Disney Plus? If you're one of the many Marvel fans wondering when the MCU movie will arrive on Disney's streaming platform, you may want to pull up a seat.",
    "Why? Because we've finally received word of when Eternals is coming to the streamer. In an official press release from the Walt Disney Company, as well as on Marvel Studios' official Twitter account, it was revealed that Eternals will arrive on Disney Plus on January 12, 2022.",
    "Due to the ongoing pandemic, some MCU fanatics weren't comfortable with going to watch Eternals in a theater. The movie's poor critical reception, too, may have put some off from seeing it in November 2021, so some will have held out to see the Marvel Phase 4 movie in the comfort of your own home.",
    "Now that its Disney Plus launch date has been confirmed, make sure you free up some time on that day (it's a Wednesday) to finally watch it. Oh, and Eternals will be available to stream in IMAX Enhanced mode, too, which means you can see more of the movie, thanks to the mode's greater aspect ratio support.",
    "Below, we'll explain (in more detail) why Eternals' Disney Plus release is still a way off, as well as whether it'll be a Premier Access title like Black Widow was. Strap in and let's begin.",
    "Yes. As we mentioned in our introduction, Eternals will launch on Disney Plus on January 12, 2022. Funnily enough, there were reports about when it might come to Disney Plus via Dutch website Streamwijzer.nl (per Streaming Guider), which claimed Eternals would land on that date. So it turns out that they were right.",
    "Like Shang-Chi and the Legend of the Ten Rings before it, Eternals was given a 45-day exclusive theatrical run, as revealed on The Walt Disney Company's website earlier in 2021. Given that the MCU flick was released on November 5, that meant that it wouldn't arrive on Disney Plus until December 20, 2021 at the very earliest.",
    "However, Shang-Chi didn't come to Disney Plus exactly 45 days after its theatrical release. It didn't launch on the streamer until 70 days after its initial release, with Shang-Chi debuting in cinemas on September 3 and on Disney Plus on November 12.",
    "With Eternals landing on Disney Plus on January 12, it'll be 68 days since its original release.",
    "Some fans had speculated that Eternals would launch on Disney Plus after Hawkeye's series finale. Given that the show's final episode will arrive on December 22, and that Eternals' exclusive theatrical period ends on December 20, some people think we could see Eternals get released in time for Christmas. That's proven to be incorrect, and we'll have to wait until January 12 for its arrival.",
    "No, Eternals won't be a Disney Plus Premier Access title. Shang-Chi wasn't when it landed on Disney Plus on November 12, and Eternals isn't, either. We reached out to Disney for confirmation on this, and they've confirmed that it'll be free to all Disney Plus subscribers.",
    "As long as you're a current Disney Plus subscriber, then, Eternals will be free to watch when it launches early in 2022.",
    "Eternals clocks in at two and a half hours long. That's including its mid-credits and post-credits scenes, as well as its end credits.",
    "Thankfully, when it does land on Disney Plus, you'll be able to pause Eternals if you need to take a bathroom break. Or to get up and find those all-important snacks as nobody likes to go hungry while watching an enthralling Marvel movie."
  ],
  "headers": {
    "5": "Does Eternals have a Disney Plus release date?",
    "10": "Will Eternals be a Disney Plus Premier Access title?",
    "12": "How long is Eternals' runtime?"
  },
  "links": {
    "Eternals": "https://www.techradar.com/news/eternals-is-unlike-any-other-mcu-movie-so-far-and-thats-a-good-thing",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "MCU movie": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Marvel Phase 4": "https://www.techradar.com/news/marvel-phase-4",
    "Black Widow": "https://www.techradar.com/news/black-widow-is-a-bona-fide-spy-thriller-and-the-mcu-is-all-the-better-for-it",
    "Streaming Guider": "https://streamingguider.com/eternals-disney-plus-movie-2021/",
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
    "The Walt Disney Company's website": "https://thewaltdisneycompany.com/disney-announces-exclusive-theatrical-windows-for-remaining-2021-slate-of-films/",
    "Hawkeye": "https://www.techradar.com/news/inside-hawkeye-marvels-holiday-themed-and-most-subversive-show-yet",
    "Premier Access title": "https://www.techradar.com/news/disney-plus-premier-access",
    "Disney Plus subscriber": "https://www.techradar.com/deals/disney-plus-price"
  }
}