{
  "source": "https://www.techradar.com/news/royole-flexpai-2-is-the-sequel-to-the-first-foldable-phone-heres-what-its-like-to-use",
  "title": "Royole FlexPai 2 is the sequel to the first foldable phone – here's what it's like to use",
  "category": "phones",
  "updated": "2021-11-11T17:03:00Z",
  "author": "david-lumb",
  "summary": "The FlexPai 2 is a wallet-sized foldable you can't use outside China",
  "article": [
    "The Royole FlexPai 2 is the follow-up to the first foldable phone to be publicly revealed as a functional version of the concept. It fixes most of the flaws of the original, which felt more like a show floor concept device than the market-ready foldables that followed. And while the FlexPai 2 is far more of a polished device consumers would want to buy, it’s been surpassed by several other foldables which went on sale in more regions first.",
    "The original FlexPai beat the Samsung Galaxy Fold to the finish line when it was revealed at CES 2019, but two rounds of Samsung and Huawei foldables each have launched before we got Royole’s follow-up. And we won’t get it – consumers in the US, UK, Australia, India, and elsewhere anyway – as Royole does not have plans to sell the FlexPai 2 outside China (much like the original FlexPai).",
    "Thus, it’s not quite fair to stack the FlexPai 2 against foldable phones that can be bought globally. We’ve used the phone for a few days now, and we’ll walk you through what it’s like to use and carry around.",
    "What does the FlexPai 2 feel like? Wide, dense, and comfortable in hand – which is not what I expected now that Samsung and Huawei have saturated the market with tall and narrow phones that unfold into tablet-sized screens. Royole’s foldable feels more wallet-sized and fits nicely in pockets. As a result, its shape and weight – noticeably wider than any standard phone, and twice as heavy – feels far less ungainly than ‘tall’ foldables like the Galaxy Fold that aren’t easy to use one-handed.",
    "Not that the FlexPai 2 is as feasible to use one-handed – your thumb won’t reach across the display nearly as easily as on thinner small-format phones like the iPhone 12 mini – but it’s a lot less unwieldy with its squat form factor. The ‘main’ (right side) of the wraparound display is 5.5 inches, while the left side is 5.4 inches considering the vertical camera strip and the ‘Smart Touch Control area,’ a capacitive button that has few but crucial uses (more on that later).",
    "The FlexPai 2 unfolds lengthwise into a 7.8-inch Full HD Plus resolution screen, which is just a bit bigger than the 7.6-inch interior display of the unfolded Galaxy Fold 2. Like other foldable phones, the FlexPai 2 can rotate its display to view wide (for media) or long (for documents). And, as all these photos of the device show...its display is not bright enough to use in direct sunlight, even at maximum brightness.",
    "This is an ‘outie’ foldable with its display on the outside, like the Huawei Mate X series, meaning it’s more exposed to external damage from, say, whatever’s in your pocket if you don’t secure it in a case; but it also doesn’t have a noticeable crease found to some degree in the ‘innie’ foldables like the Samsung Galaxy Fold series.",
    "The FlexPai 2 folds closed flush, as opposed to its predecessor, which had such a gap when folded shut you could stick a pen through it. The new foldable snaps closed with a secure ‘click’ and stays shut with magnets.",
    "The device feels more robust, thanks to a glossy-finished metal frame lining the outer edge, which also contains a wide lock button-plus-fingerprint sensor and volume button rocker on one side and SIM card slot on the other side. The ‘Cicada Wing’ hinge has been assured for 1.8 million folds, a claim we could not possibly test, but it’s solid enough to suffer our repeated folding and unfolding as if it were a flying book. The interior back cover is a burnished metal, dark gray in color, that transitions to a lighter gray in strips around, and over, the hinge.",
    "The FlexPai 2 has a respectable camera suite: a 64MP f/1.9 main shooter, a 16MP ultra-wide camera with a 116-degree field of view, an 8MP telephoto lens with 3x optical zoom, and a 32MP lens dedicated to portrait photos. It’s a standard array, and comparable to other foldable phones – though a bit less capable in zoom photography compared to, say, the Samsung Galaxy S21 phones (especially the S21 Ultra).",
    "That doesn’t matter as much with this design...because, when it’s folded closed, you can take photos with both screens turned on, with the front acting as a traditional viewfinder while the rear gives photo subjects a preview of the photo being taken. It’s a neat and official version of ad-hoc ways folks were using foldables’ exterior screens to let folks see the photo being taken of them.",
    "Every part of this experiential tell-all has been pretty universal; you don’t need localized access to enjoy the FlexPai 2’s design and cameras. There’s an elegance to this squat, lovely little wallet-phone. But that doesn’t make ensure it’s usable to everyone: software and apps do that.",
    "The Android-based WaterOS 2.0 is smooth and navigating around it is easy, made better with its specs, a Snapdragon 865 chipset and either 8GB or 12GB of RAM (plus 256GB or 512GB of storage and 4,000mAh of battery). Given the FlexPai 2 isn’t sold outside China at the moment, all the apps included are popular Chinese apps like Weibo, WeChat, Alipay, BaiduMap, Tencent Video, and more.",
    "What’s not there, of course, are functional Google Apps – you can download them, but given the phone doesn’t support Google Play services (we tried to login, and failed), it’s simply not useful for the modern Android user. Without all your Google account and app functionality, it’s simply a neat phone with a novel way to get more screen real estate that can make calls but, unless you have plenty of accounts with Chinese apps and services, is barely useful to anyone reliant on other app ecosystems.",
    "That’s not to say it’s useless – you can fumble your way through the available services and some apps, like Royolle’s own RoWrite for taking notes, is easy to use. Sadly, it’s not terribly usable for Android users who are used to easily porting their lives over to a new device by signing in to their Google accounts. Further, while there’s plenty of English directions, some operating system language and most apps default to Mandarin Chinese, so you’ll only get so much use without fluency.",
    "That can all change, of course, if Royole decides it’s worth localizing the FlexPai 2 to be sold in other regions, but given their high prices, foldables aren’t exactly flying off the shelves. Which is a pity, since the Royole FlexPai 2 retails for 9,988 RMB (around $1,544 / £1,125 / AU$1,999), it’s the most affordable full foldable yet, and competitive with the smaller-screen clamshell foldables like the Motorola Razr 2020. Time will tell whether we see the device make the jump to other markets."
  ],
  "headers": {
    "3": "What does a wallet-sized foldable feel like?",
    "9": "Cameras: fine, but the novelty is in the display",
    "11": "Software: great, if you don’t need Google"
  },
  "links": {}
}