{
  "source": "https://www.techradar.com/news/where-is-the-samsung-galaxy-s21-fe",
  "title": "Where is the Samsung Galaxy S21 FE?",
  "category": "phones",
  "updated": "2021-10-24T09:25:21Z",
  "author": "david-lumb",
  "summary": "Supply shortages and Samsung: a story of a missing phone",
  "article": [
    "In mid-October, Samsung held another Unpacked event that revealed new colors and special editions for previously-announced products…and no new devices. It seemed like something should have debuted at an event pitched to be ‘for the fans,’ and the best contender is probably the more affordable flagship ‘Fan Edition’ of the Galaxy S21. So where is the Samsung Galaxy S21 FE?",
    "We’d been expecting the S21 FE to launch back in September, a year after its popular predecessor, the Samsung Galaxy S20 FE, was revealed at an August 2020 Unpacked event. But the month came and went. Now, in late October, rumors suggest the cheaper version of the Samsung S21 may launch in January – alongside or even stealing the launch slot for the Samsung Galaxy S22.",
    "TechRadar reached out to Samsung to ask if the S21 FE was intended to launch at the October Unpacked event, and they declined to acknowledge that the phone was coming, or even admit its existence.",
    "“We can’t comment on our product roadmap, but we’re focused on listening to consumer needs and providing options across our mobile portfolio for every price point,” a Samsung spokesperson told TechRadar over email. “We’re seeing a lot of demand and interest in both our current S series lineup and our latest foldable devices. To meet our customers’ needs, we’re prioritizing those devices right now.”",
    "We’ve heard enough rumors and leaks to feel confident that the S21 FE exists – so what’s keeping the phone from being ready for release?",
    "As you might have suspected, it’s probably due to the supply chain issues that have kept everything from GPUs and PS5s to automobiles to dress shirts from reaching consumers – a continued effect of Covid’s impact on interrupting resource supply, production, shipping, local transport, and retail. Reports indicate the shortage could last into 2022, and will certainly impact stock for Black Friday and Cyber Monday.",
    "Given the 10 million unit iPhone 13 production shortfall, it’s believable that shortages would apply to other phones, too. Here’s what analysts say about how phones like the S21 FE continue to be impacted – and why that phone seems to be delayed more than devices from other brands.",
    "By April 2020, reports started coming out that Covid outbreaks in production facilities in China and elsewhere resulted in shutdowns and interruptions. This resulted in the global chip shortage that has affected so many industries, as Avi Greengart, founder of tech research and analysis firm Techsponential, told TechRadar over email.",
    "“The initial shutdowns in China stopped smartphone production for a few weeks, but that wasn’t too problematic because there was also an initial drop in smartphone sales during the first round of lockdowns in the US and Europe,” Greengart said. “After that, though, there was a massive surge in demand for electronics of all kinds, making it hard to source components for smartphones, GPUs, game consoles, PCs, home appliances, and cars.”",
    "The impact of those shortages has been compounded by more Covid shutdowns, shipping and port jams, and natural disasters, Greengart added. “In my conversations with manufacturers, one constant is that there are breakdowns everywhere throughout the supply chain. Even if you switch to air freight for finished goods to get around the seaport jams, the raw materials and components coming into factories are stuck in the ports or in factories without enough truck drivers to move them to the next stop.”",
    "But the smartphone industry has seen far less impact than others. Some phones have been in reduced supply, like the Samsung S21 line, but they aren’t nearly as scarce as PS5s and GPUs.",
    "That’s largely because the phones industry has been growing as a whole for years in contrast to a PC and notebook industry that has plateaued or declined, according to Nabila Popal, mobile industry analyst at IDC. The firm expected the smartphone industry to grow in 2020, and thus it was better able to absorb Covid’s shock to its system.",
    "“As far as the smartphone industry in 2020, the manufacturers and vendors were already expecting kind of a growth year, so the momentum and preparations had already been made,” Popal told TechRadar over the phone. “Of course [Covid] hit and then we had a six percent decline, but because of that anticipation, we were basically better prepared from all sides, be it accruement of materials needed, logistics, factory and capacity, or differences in value chain.”",
    "“We shouldn’t look at the positive growth to say that there aren’t any issues there, because there are, but they’re not as compounded as they are in automotive and PC and notebooks,” Popal said.",
    "There’s another reason the smartphone industry absorbed the interruption in the supply chain, Popal noted: the industry was in the process of switching from 4G to 5G, which requires entirely new chipsets and modems. This means smartphone manufacturers needed to set up their own new supply and production chains to make new silicon, which weren’t as affected by the global chip shortage. Instead, the smartphone industry was hit hard by components shortages, which ended up affecting 4G phones more than 5G devices – which constitute mainly flagship but more and more mid-range and budget phones in 2021.",
    "Popal couldn’t confirm or deny anything specifically on the potential delay of the S21 FE, but she did point to a particular strain on Samsung’s production in Q2 2021: Covid outbreaks in Vietnam that impacted the company’s production facilities. Despite previous containment, an outbreak in May threatened tech production, per Reuters, which led to Samsung shutting down factories in July to contain the virus, according to Nikkei Asia.",
    "The Korean phonemaker wasn’t the only one hit – Apple supplier Foxconn was ordered to temporarily shut its factories in August, per Bloomberg – but because half of Samsung’s smartphone production is in Vietnam, the shortages may have impacted Samsung’s current and upcoming lineup more than other companies’ releases.",
    "“For the S21, in Q2 [2021], the major issues that Samsung faced was their supply was constrained for many of the leading models because of the shutdowns in Vietnam, because of Covid,” Popal said, also affirming that supply issues ultimately led to the cancellation of the Samsung Galaxy Note 21.",
    "Even if we can’t get a straight answer from Samsung itself or analysts that supply shortages led to the delay of the S21 FE, given their impact on the availability of current phones and outright cancellation of another highly-anticipated Samsung device, it’s still the most likely reason we didn’t see the S21 FE launch at the October Samsung Unpacked, let alone in September when we expected it to be unveiled.",
    "But the big phone companies are doing what they can to mitigate the effects, and they may not be felt by everyone. Despite a previous report that Apple might ship 10 million fewer iPhone 13 units, Popal told TechRadar that the company’s high-volume orders and dominance means it can remain at the top of the priority list in supply chains and expect component suppliers to make up shortfalls. Apple will in turn prioritize shipments to its biggest markets, like the US, Europe, and likely China, and have lower supply in the Middle East and Eastern Europe.",
    "It probably won’t be the last phone shortage we see, given how Covid’s initial impacts continue to domino into new crises. The latest are a series of regional planned blackouts in Chinese factories that are affecting phone production, and we can’t guess what the next might be."
  ],
  "headers": {
    "7": "Smartphones, supply fiascos, and more",
    "15": "So...what about the Samsung Galaxy S21 FE?"
  },
  "links": {
    "Unpacked": "https://www.techradar.com/news/live/samsung-galaxy-unpacked-live-blog-todays-colorful-launch-as-it-happens",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "launch": "https://www.techradar.com/news/samsung-galaxy-s22-may-be-delayed-with-galaxy-s21-fe-taking-its-place-in-january",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "PS5s": "https://www.techradar.com/news/why-ps5-shortage",
    "last": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "shortfall": "https://www.techradar.com/news/major-iphone-13-chip-shortage-reportedly-forcing-apple-to-slash-10-million-iphones",
    "Reuters": "https://www.reuters.com/technology/vietnam-coronavirus-outbreak-threatens-disrupt-tech-supply-chain-2021-05-28/",
    "Nikkei Asia": "https://asia.nikkei.com/Spotlight/Coronavirus/Samsung-suspends-Vietnam-factories-hit-by-COVID-health-ministry",
    "Bloomberg": "https://www.bnnbloomberg.ca/vietnam-orders-foxconn-plant-to-shut-as-virus-surges-1.1605092",
    "cancellation": "https://www.techradar.com/news/samsung-confirms-skipping-galaxy-note-21-but-teases-galaxy-z-fold-3-and-flip-3",
    "told": "https://www.techradar.com/features/what-do-10-million-fewer-iphone-13-shipments-mean"
  }
}