{
  "source": "https://www.techradar.com/news/new-ipad-pro-is-apparently-coming-in-2022-as-well-as-three-apple-watch-models",
  "title": "New iPad Pro is apparently coming in 2022, as well as three Apple Watch models",
  "category": "tablets",
  "updated": "2021-09-21T09:41:09Z",
  "author": "tom-bedford",
  "summary": "2022 sounds like an exciting year for Apple",
  "article": [
    "If you watched the iPhone 13 launch and were a bit disappointed with the lack of real upgrades for either Apple's smartphones or the new iPad (2021), don't fret – as it sounds like 2022 could be a real gangbuster year for the company.",
    "This comes from Bloomberg's Mark Gurman, writing in their weekly Power On newsletter, who writes \"2022 is certain to be a stronger showing\".",
    "According to Gurman, next year we'll see a new iPad Pro model and three new Apple Watches, as well as upgrades to the AirPods Pro, improved computers and an iPhone that actually feels like an upgrade.",
    "That suggests 2021 was just a filler year for Apple, something the products themselves illustrate, so if you were on the fence about buying a new Apple device, it could well be worth waiting a little bit.",
    "It's worth pointing out that Gurman's list of 2022 Apple products aren't tied to any particular event, and it's likely they'll get unveiled slowly as the year goes on. We'll likely see the iPad Pro near the beginning of the year, but with the Apple Watches later on.",
    "The new iPad Pro (2022) is something Apple fans have been excited about for a while now, even before the launch of the iPad Pro (2021) or iPad Pro (2020). That's because analysts predict it's going to be a big spec jump over predecessors.",
    "The top-end tablet will apparently have an OLED screen, bigger screen sizes that its predecessors, MagSafe compatibility and wireless charging, if various leaks are to be believed. These are all early-days rumors, so take them with a pinch of salt, but it's enough to get the Apple community excited.",
    "Then the three Apple Watches – what could they be? Well the Apple Watch 8 will almost definitely be one, and it's very possible the Apple Watch SE 2 will be another, as a mid-range alternative to the Series 8.",
    "So what about the last one? A true budget smartwatch? A Fitbit-rivalling fitness tracker? A Pro or Pro Max version of the Series 8? We can only guess at this point.",
    "While we're still in the dark as to Apple's plans for 2022, the fact that Gurman suggests it's a bumper year is reason enough for fans of the tech giant to get excited."
  ],
  "headers": {
    "4": "Analysis: what are these new Apple products?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "new iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "iPad Pro (2022)": "https://www.techradar.com/news/new-ipad-pro-2022",
    "iPad Pro (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPad Pro (2020)": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "Apple Watch SE 2": "https://www.techradar.com/news/apple-watch-se-2"
  }
}