{
  "source": "https://www.techradar.com/news/potential-amd-radeon-pro-gpu-featuring-navi-21-spotted",
  "title": "Potential AMD Radeon Pro GPU featuring Navi 21 spotted",
  "category": "components",
  "updated": "2021-04-08T11:32:11Z",
  "author": "jess-weatherbed",
  "summary": "Big Navi has had a professional glow up",
  "article": [
    "The ongoing shortage of chip components hasn't stopped new graphics cards from being released every few months, and this looks to continue with a currently unreleased AMD Radeon Pro making an appearance online. The GPU images were initially published on the ChipHell forums, but have since been removed, and there isn't much information regarding the full specifications of the card as the original leaker wasn't confident on the exact model details. It does however appear to feature RDNA2 architecture and 16GB of Samsung memory, which seemingly shows this new productivity graphics card is based on the Navi 21 configuration.",
    "The Radeon Pro range caters to productivity users such as CAD designers and CGI artists rather than a gaming-orientated audience, so you'll likely want to pick this over an AMD Radeon RX 6800 XT or RX 6700 XT if you work in a demanding creative field. This is also Team Red's answer to the Nvidia Quadro line that is similarly optimized for workstations. Several new Nvidia Quadro RTX cards were also leaked last month which indicated that this latest generation of GPUs may be ready to ship. If AMD can follow suit (and with plentiful stock), it may be in for a chance of gaining ground against Team Green in the productivity hardware market.",
    "The blue and silver shroud is recognizable for anyone familiar with previous Radeon Pro GPU designs, though certain details make this identifiable as a potential new product rather than a re-casing. Given the probable Navi 21 architecture it'll be using, it's likely this new Radeon Pro GPU will still have a 256-bit bus interface and carry 128 MB of Infinity Cache. We don't get a good look at any display outputs or power connectors, though the stickers displayed on the GPU indicate this is an early engineering sample which means any of the current information we have is subject to change. Speaking of which, as with all unofficial information or leaks, don't take any of this as fact until an announcement is made through proper channels. The current speculation has a lot of weight, but easier to take it with a pinch of salt to be on the safe side. The very existence of an engineering sample does suggest that we could expect an official announcement soon though, so with any luck we'll soon know more regarding the full specs, pricing and availability.",
    "Via WCCFTech"
  ],
  "headers": {
    "2": "AMD looks good in blue"
  },
  "links": {
    "shortage of chip components": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "AMD Radeon Pro": "https://www.techradar.com/news/gaming/amd-s-virtual-reality-labs-aim-to-light-vr-content-creation-spark-1316865",
    "ChipHell forums": "https://www.chiphell.com/thread-2315876-1-1.html",
    "RDNA2 architecture": "https://www.techradar.com/news/amd-big-navi",
    "Navi 21": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "AMD Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "Nvidia Quadro RTX cards": "https://www.techradar.com/news/new-nvidia-quadro-rtx-cards-found-online",
    "WCCFTech": "https://wccftech.com/amd-radeon-pro-graphics-card-big-navi-21-gpu-16-gb-gddr6-memory-pictured/"
  }
}