{
  "source": "https://www.techradar.com/news/the-most-underrated-borderlands-game-is-making-a-comeback-next-week",
  "title": "The most underrated Borderlands game is making a comeback next week",
  "category": "gaming",
  "updated": "2021-02-11T13:10:35Z",
  "author": "rhys-wood",
  "summary": "Tell me the tale again",
  "article": [
    "Tales from the Borderlands, arguably one of Telltale Games’ finest projects, is getting a complete re-release next week.",
    "The episodic game was delisted in 2019 as a result of Telltale Games’ closure back in 2018, which saw a number of the company’s other games being removed from digital store fronts.",
    "Fortunately, Borderlands fans can now look forward to Tales from the Borderlands being re-released by Gearbox Software on February 17, as the full five episode package hits Xbox Live, PlayStation Store and on PC via Steam and the Epic Games Store.",
    "Borderlands is best known as a series of first-person shooter games with an emphasis on loot, class abilities and co-operative play. A narrative experience may seem like a weird fit for a fast-paced shooter, but it ended up working tremendously well, helping to flesh out Borderlands’ quirky world and characters in interesting ways.",
    "Originally released in 2014, Tales from the Borderlands introduced two original main characters to the series. Rhys, a Hyperion employee struggling to work his way up the corporate ladder, and Fiona, a Pandora-born con artist. The pair are forced to become dysfunctional allies.",
    "Crammed with new and established characters from across the Borderlands franchise, the game’s extravagant set pieces and remarkably funny dialog are the stars of the show in Tales from the Borderlands. Each episode is front loaded with an incredible musical intro, and are laced throughout with gut-busting laughs, great plot twists and genuinely touching character moments.",
    "Tales from the Borderlands, despite its high quality, was not the commercial success Telltale or Gearbox were hoping for at the time of release. Hopefully, this re-release can breathe new life into the game. Plenty of players jumped into the franchise for the first time with Borderlands 3, so potentially there’ll be a whole host of new fans checking out Tales from the Borderlands for the first time."
  ],
  "headers": {
    "3": "Pandora's Box"
  },
  "links": {
    "Telltale Games’ closure": "https://www.techradar.com/news/telltale-games-is-laying-off-most-of-its-staff-canceling-upcoming-games",
    "Xbox Live": "https://www.techradar.com/news/xbox-live-gold-deals",
    "Epic Games Store": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed",
    "Borderlands 3": "https://www.techradar.com/reviews/borderlands-3-review"
  }
}