{
  "source": "https://www.techradar.com/news/is-the-revil-ransomware-set-for-a-return",
  "title": "Is the REvil ransomware set for a return?",
  "category": "computing",
  "updated": "2021-09-08T13:11:44Z",
  "author": "mayank-sharma",
  "summary": "There’s been no official word from REvil yet",
  "article": [
    "After being offline for about two months, several of the dark-web servers belonging to notorious ransomware operator REvil have come back online.",
    "The usually vocal group became uncharacteristically silent after orchestrating the Kaseya attacks back in July, following which its properties on both the dark-web and normal web, including its ransom negotiating portal, the website where it shares exfiltrated data, and a blog it used to boast about its latest exploits, went offline.",
    "The disappearance led to speculation that the group could have been hit by law enforcement agencies, following its extravagant, but bungled Kaseya campaign.",
    "However, BleepingComputer now reports that a couple of REvil’s properties have come back online again.",
    "Reportedly, REvil’s payment/negotiation site and its data leak site on the dark web are both online.",
    "The security community however is divided in its interpretation of the move.",
    "While BleepingComputer thinks it could just be the law enforcement agents tinkering with the supposedly seized servers, others believe that REvil’s about to get back to business.",
    "“Revil took time to refit, retool, and take a bit of a holiday over the summer. The fact their sites are back online means they are, again, ready for business and have targets in mind,” security vendor Exabeam’s chief security strategist, Steve Moore tells TechRadar Pro.",
    "In fact, Moore goes as far as to suggest that the ransomware operator has “undoubtedly” already laid their hands on a compromised software supply chain.",
    "“The technique began in espionage and has now been borrowed for criminal activity; this campaign hasn't started yet – but will very soon,” warns Moore.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Back for real?"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "became uncharacteristically silent": "https://www.techradar.com/news/revil-websites-disappear-from-the-web",
    "Kaseya attacks": "https://www.techradar.com/news/kaseya-ceo-says-thousands-of-firms-may-be-affected-by-ransomware-attack",
    "bungled Kaseya campaign": "https://www.techradar.com/news/revil-bungled-its-massive-ransomware-attack-giving-businesses-an-easy-out",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/revil-ransomwares-servers-mysteriously-come-back-online/"
  }
}