{
  "source": "https://www.techradar.com/news/make-your-e-bike-last-much-much-longer",
  "title": "How to make your electric bike last (much, much) longer",
  "category": "fitness",
  "updated": "2021-03-28T11:00:33Z",
  "author": "cat-ellis",
  "summary": "The pros at Shimano give their top tips for years of happy riding",
  "article": [
    "An electric bike is a big investment, but a little care and maintenance will ensure it gives you years of happy riding. Any bike requires regular TLC to keep it running smoothly, but an e-bike needs a little extra attention. It’s not complicated though, provided you know the basics.",
    "TechRadar spoke to Gavin Brough, manager of Gamma Transfer Division Shimano Service Center in Edinburgh, for advice on how to keep your e-bike rolling for years to come.",
    "“Regular maintenance is crucial for your safety and enjoyment of cycling,” Brough says. “A bike that runs smoothly and sweetly is a lot more fun to ride! How frequently your bike requires servicing depends on how often you ride, the conditions you ride in, and even your riding style.\"",
    "\"As a minimum we suggest a yearly visit to a service center, but performing regular at-home mechanical checks, cleaning and lubricating will help you keep on top of your bike’s condition and alert you to any problems.”",
    "Brough advises checking your bike systematically from front to back to make sure nothing is loose, the wheels are properly secured, and the gears are shifting smoothly. If your bike uses the Shimano Steps e-bike system (which is used by brands including Ridgeback, Raleigh and Saracen, among others), you can also wirelessly update and customize its software with the E-Tube Project app.",
    "Over time, some parts of your e-bike will become worn and eventually need replacing. “If you are used to a conventional bike you may notice your e-bike parts wear out faster,” says Brough.",
    "“This is due to the extra force the drive unit puts on the chain and cassette. Being a slightly heavier and potentially faster bike, you may also need to change your brake pads more often.”",
    "E-bike batteries are expensive to replace, so it's good practice to take care of yours and extend its life as long as possible. Making sure it's kept clean and dry is essential to avoid damage, but what about charging?",
    "\"You can top up your battery any time you feel you need it,\" says Brough. \"There is no need to run a battery flat before recharging. Running a battery until flat during a ride won’t damage it, but it's best to avoid it as you will lose the pedal assist which , although you will still be able to ride, will make the rest of your journey much harder work!\"",
    "He advises that a 504Wh battery, using a 4A charger, will take two and a half hours to charge up to 80%. A complete charge will take take five hours.",
    "\"If you aren’t planning to ride your bike for a while it is important to store your battery safely. You should first charge it to around 70% full and having done this turn the power off and remove the battery from your bike.",
    "\"To keep your battery in the best condition, re-charge it to around 70% full every six months and charge it fully before your first ride if it has been in storage for some time.\"",
    "Some e-bikes use a carbon belt rather than a conventional chain. This cuts down on maintenance, as there’s no re-tensioning or lubrication needed, and you can clean it with just water and a soft brush. However, Brough explains, carbon drive systems are delicate, and you should take great care not to damage the carbon fiber cords in the belt.",
    "“Carbon fiber cords are able to absorb high levels of tensile force, but at the same time they are sensitive to bending loads, shearing forces, indentations and impacts,” he says. “For instance, if you are loading your bike into your car, be careful not to twist the belt or rest anything on it.",
    "“A carbon belt doesn’t respond well to being ridden in snow, ice or mud as the teeth of the pulleys can become clogged and lead to the belt being pushed off of the pulley. It’s best to keep your belt drive bike for fair-weather cycling. If you have a crash it is really important to get the condition of the carbon belt checked over, along with the rest of your bike, as damage can lead to component failure.”",
    "With an e-bike, you also need to be aware of software issues that can arise. As with any computer-controlled device, keeping its firmware up to date is essential.",
    "“For your e-bike system, the simplest way to check for potential problems and to keep your bike riding perfectly is to use the E-Tube Project app,” Brough says. “This will allow you to customize your settings, update firmware and connect directly with your bike.",
    "\"If you see an error message on your bike computer you can find the error codes and trouble-shooting solutions on the Shimano Steps website, or you can contact your dealer center.”",
    "It’s always best to nip potential problems in the bud, so you don’t run into trouble when you’re out riding, and your e-bike doesn’t suffer damage that accumulates over time. Brough recommends always giving your bike a check over before pedalling to make sure your ride is safe. Anything that squeaks, rubs or rattles is a sign that further investigation is needed.",
    "“Alongside regular checks, some simple home maintenance can help you enjoy your e-bike longer. Before every ride check that your tyres are inflated to the correct pressure and in good condition,” Brough says. “Riding with flat tires will drain your battery because of increased rolling resistance and may cause damage to the tires.",
    "“If your bike has suspension make sure it is set up correctly for you and frequently check the pressure in your shocks, this helps protect your bike and will make your ride more enjoyable. For more longevity from your chain clean and lube it frequently to keep it running smoothly and prevent it getting worn by grit and dirt.”",
    "Riding an e-bike is great fun, and by following this advice, you should be able to keep enjoying yours for years to come."
  ],
  "headers": {
    "4": "Everyday checks",
    "7": "Power management",
    "12": "Caring for carbon",
    "15": "E-bike firmware",
    "18": "Tackle issues early"
  },
  "links": {
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "Gamma Transfer Division": "https://www.gammatd.com/",
    "Shimano Steps": "https://www.shimano-steps.com/"
  }
}