{
  "source": "https://www.techradar.com/news/it-doesnt-actually-matter-if-ubisoft-supports-the-steam-deck-or-not",
  "title": "Steam Deck doesn’t have Ubisoft’s support yet – and it doesn’t matter",
  "category": "computing",
  "updated": "2021-07-20T20:07:37Z",
  "author": "bill-thomas",
  "summary": "Opinion: the beauty of the Steam Deck is that you can do whatever",
  "article": [
    "Now that the Steam Deck has been talked about for a while and we're all familiar with what it's going to be doing, we're starting to see game developers come out and give comment on it. And, Ubisoft CEO Yves Guillemot shared his thoughts about the forthcoming portable gaming device.",
    "As reported by IGN, an investor asked the CEO his thoughts on the Steam Deck, and Guillemot said Ubisoft would put its games on the platform if it's successful, and even also said \"we're happy to see Steam Deck coming to the industry\". But regardless of whether or not Ubisoft officially releases its games \"for the Steam Deck\" - whatever that means - the games are going to be playable either way.",
    "Ubisoft basically stopped putting its games on Steam starting with The Division 2, putting them exclusively on its own storefront and the Epic Games Store, which gives the company a much bigger share of the sales. It's possible that Yves Guillemot meant that if the Steam Deck takes off in a big way, Ubisoft would consider putting its games back on Steam - much like EA has recently done.",
    "But it's not like Ubisoft fans that want to play these games are going to be left in the cold either way. Valve has been very clear that it will let users install any software they want on the Steam Deck, including third-party stores like the Ubisoft Connect launcher or the Epic Games Store, which means every Ubisoft game will be supported in one way or another.",
    "Though, to be fair, it would be ideal if this meant that Ubisoft was going to port its games over to Vulkan, allowing them to be run natively on SteamOS, rather than relying on the Proton translation layer. But even then, looking at ProtonDB, where users report on compatibility, Assassins Creed Odyssey is rated as Gold, which means Assassins Creed Valhalla would likely be the same - as it runs on the same engine.",
    "This far ahead of the Steam Deck's launch, I don't actually know how Proton will work with games that aren't purchased through Steam, but according to this Reddit thread, it is possible.",
    "But what's awesome about the Steam Deck is that we don't have to rely on what big video game executives decide is worth doing with the platform. It's running on an x86 platform, and it's also completely open, which means the users ultimately will make the rules.",
    "While I love that SteamOS is probably going to be miles better when the Steam Deck comes out than the last time I used it back in like 2018, I fully plan on wiping the handheld when I get mine in the mail and installing Windows 10. Then, I'm going to install something like Playnite to easily launch games from multiple stores without having to mess around too much on that tiny 7-inch display.",
    "And I think more than anything, that's where the Steam Deck is going to shine. Lifelong PC gamers like me that live to tinker with stuff (and potentially break things), are going to have a blast with the new handheld, precisely because there aren't going to be any rules.",
    "Regardless of what Ubisoft says about its games \"coming to Steam Deck\" I'm going to be playing Assassins Creed Valhalla on Steam Deck within a day of the handheld showing up on my stoop - and I imagine I'm not the only one."
  ],
  "headers": {
    "2": "An open approach",
    "6": "A paradise for nerds"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "IGN": "https://www.ign.com/articles/steam-deck-might-bring-ubisoft-back-steam",
    "Assassins Creed Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review",
    "rated as Gold": "https://www.protondb.com/app/812140",
    "Assassins Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Reddit thread": "https://www.reddit.com/r/linux_gaming/comments/be4e46/how_to_play_nonsteam_games_through_proton_this/",
    "Playnite": "https://playnite.link/"
  }
}