{
  "source": "https://www.techradar.com/news/instagram-will-tell-teens-to-take-a-break-after-second-facebook-outage-forces-them-to",
  "title": "'Taking a break' from Instagram isn't as easy as Facebook says",
  "category": "computing",
  "updated": "2021-10-11T14:11:41Z",
  "author": "henry-st-leger",
  "summary": "Minimal features don't tackle the root problem",
  "article": [
    "Instagram is set to start nudging teenagers to \"take a break\" from the social media platform, in a small acknowledgement of the psychological impact the Facebook-owned app can have on young people.",
    "The app is set to add a number of new features designed to assist negatively-affected users, which Facebook's VP of Global Affairs Nick Clegg said should make \"a considerable difference\" in an interview on CNN.",
    "Clegg clarified that Instagram would \"nudge\" users to look at different content if they were \"looking at the same content over and over again, and it's content which may not be conducive to their well being\" – as well as even asking younger users to step away from the platform temporarily where needed.",
    "It's something of a turnaround for Facebook, which has now paused its plans for a child-focused version of Instagram, in the wake of whistleblower Frances Haugen – who blew the lid off internal Facebook research around Instagram's impact on teens' mental health, and which wasn't acted on until now.",
    "Leaked documents given to The Wall Street Journal cited presentation slides claiming that “Thirty-two percent of teen girls said that when they felt bad about their bodies, Instagram made them feel worse,\" and that \"Teens blame Instagram for increases in the rate of anxiety and depression. This reaction was unprompted and consistent across all groups.\"",
    "That's a sizeable number, and it being Facebook's own research makes it even more damning.",
    "While Facebook's prospective nudges could have an impact, they also pale in comparison to the scale of the problem, or the built-in incentives towards 'doomscrolling' endlessly through news feeds – which were designed to use the same 'pull down' mechanic as Las Vegas slot machines.",
    "Even asking teens to take a break is limited in its usefulness. The problem is that social media apps are often construed as how we take a break – from our work monitors, our chatting peers, our arguing relatives, the boredom of waiting for a bus. It's a permanently-available distraction, and pushing for teens to 'take a break' now and again, while a necessary step, can't fully counteract this problem by itself.",
    "It's similar to advertisements to tell people to stop gambling 'when the fun stops': the addictive nature of something makes even leaving at the point of distress very difficult.",
    "Back in May 2021, Instagram introduced a way to hide like counts entirely – and we're going to need more instances like these of the service critically assessing its own mechanisms, and truly reckoning with its impact on the mental health of teens, rather than simply suggesting users close the app every once in a while.",
    "Via The Verge"
  ],
  "headers": {
    "6": "Facebook's reckoning"
  },
  "links": {
    "paused its plans": "https://www.techradar.com/news/facebook-pauses-instagram-for-kids-plan-but-it-may-be-gone-forever",
    "The Wall Street Journal": "https://www.wsj.com/articles/facebook-knows-instagram-is-toxic-for-teen-girls-company-documents-show-11631620739?mod=hp_lead_pos7",
    "Las Vegas slot machines": "https://www.theguardian.com/technology/2018/may/08/social-media-copies-gambling-methods-to-create-psychological-cravings",
    "introduced": "https://about.instagram.com/blog/announcements/giving-people-more-control",
    "The Verge": "https://www.theverge.com/2021/10/10/22719545/instagram-introduce-take-a-break-nudge-teens-harmful-content-facebook"
  }
}