{
  "source": "https://www.techradar.com/news/macos-catalina-is-here-everything-you-need-to-know-about-macos-1015",
  "title": "macOS Catalina is here: everything you need to know about macOS 10.15",
  "category": "computing",
  "updated": "2021-04-19T17:33:34.474Z",
  "author": "jackie-thomas",
  "summary": "We have all the details on macOS Catalina",
  "article": [
    "Anyone using MacBooks and Macs has been able to download macOS Catalina since its WWDC 2019 release. And, with its release comes a lot of fantastic features that weren’t present in prior versions of the operating system.",
    "It’s true that some well-loved features, such as iTunes, bit the dust with the introduction of macOS Catalina. However, Apple has replaced those features with great apps such as Apple Books, Apple TV, Apple Podcasts, and, of course, Apple Music. It’s not just new apps that come with the new OS. Other new updates and features include “Project Catalyst,” which allows iOS 13 and iPadOS developers to port their work easily to macOS 10.15, as well as Sidecar, which lets you use newer iPad models as a second screen.",
    "We’ve dug deep into all the significant features that make macOS Catalina one of the biggest updates that macOS has seen in some time.",
    "If you’re not sure about using macOS Catalina after reading about it, possibly because it still has some issues, consider instead updating to the newer macOS 11 Big Sur. It’s surprisingly even bigger of an update compared to Catalina, with its own list of incredible features to make using an Apple that much better.",
    "Apple held its iPhone 11 event on September 10, but the show came and went without so much of a mention of macOS 10.15. Still, Apple's macOS 10.15 Catalina page was updated with an \"October 2019\" release window. Apple didn't share any more specifics about the release, so when it launched it caught us all by surprise.",
    "Fortunately, this does mean you can now download macOS Catalina, so long as you have a compatible Mac. You might want to wait until the next update comes out, just to ensure that any serious bugs are squashed. You see, updating your operating system is definitely a large undertaking, and you could possibly break something, losing a lot of valuable data. So, if you don't absolutely need the new software, waiting may be your best bet.",
    "We'll update this hub as soon as we know a new update is on its way, but if you want to live on the edge, go ahead and hit that download button. We'll show you how.",
    "If you want to get your paws on the latest macOS update, you'll have to make sure your Mac can really support it. Fortunately, if you already have macOS Mojave installed, you're probably in the clear. Unless, of course, you circumnavigated Apple's restrictions.",
    "It's official, iTunes is no more. From its ashes, however, rises a unique collection of magnificent apps for macOS: Apple Music, Apple TV, Apple Podcasts and Apple Books – and they will be polished versions of those already found on iOS.",
    "Apple Music gives macOS Catalina users access to their entire music libraries regardless of whether the tracks have been downloaded or are being streamed. This also holds music that's been ripped from CDs, incorporated into the same libraries.",
    "Apple TV, on the other hand, is home for the app's channels and offers more than 100,000 iTunes movies and TV shows that you can browse to buy or rent. And, content will be available in 4K HDR video and Dolby Atmos audio wherever it’s offered. Apple TV+ can also be accessed courtesy of this app now that the service has rolled out.",
    "At the same time, Apple Podcasts brings the service's more than 700,000 podcasts, as well as new episode updates, to the Mac in a totally fresh interface. This rendition of the app also offers better search functions that can pull up episodes by hosts, guests or even discussion topics.",
    "Finally, Apple Books is the portal to all the audiobooks you would want to purchase, download and listen to. Similar to the other new apps, it also features a familiar interface for anyone who is used to iTunes.",
    "Concerned about all your existing music and playlists, as well as iTunes gift cards and credit? Don’t worry. All your music and playlists will be transferred over to the Apple Music app in macOS Catalina. Plus, any iTunes gift cards or unspent iTunes credits are still valid to be used in these new apps.",
    "In macOS 10.15 Catalina, the iTunes Store, which is accessible through the Sidebar in the Apple Music app, is still available to buy new music. And of course, you can also subscribe to the Apple Music streaming service using the app – if you do, you can hide the iTunes Store for a cleaner, more minimalist interface.",
    "With iTunes making its exit, syncing devices in macOS Catalina is now taken care of courtesy the Finder app. It can back up and sync those devices. According to Apple, it will be easier to drag and drop files for quick transfers as well.",
    "This is perhaps the most thrilling update that macOS 10.15 Catalina offers: the ability to extend your Mac's display to a nearby iPad, whether wired or wirelessly. A good amount of MacBook users are already own an iPad, so this essentially means that a significant number of mobile workers just received a secondary display for free.",
    "Possibly even more notable for designers is that this connected iPad can also be used as a drawing tablet with specific supported apps. Final Cut Pro X, Adobe Illustrator and iWork are the first apps listed that support this capability.",
    "The Sidecar feature is supported by those models that can also run the new iPadOS, specifically the iPad Pro (all models), iPad (6th generation or later), iPad Mini (3rd generation or later), and the iPad Air (3rd generation).",
    "Apple says that the following Mac apps will support Sidecar's Apple Pencil input and other enhanced features:",
    "One of Apple's most meaningful changes to iOS 12 was Screen Time, an app that tracks your iPhone or iPad usage time and offers insights into the trends. This time around, this feature will not only come to macOS with Catalina, but also offer a new “One more minute” feature, giving you more time to save your work or finish up a game.",
    "This information will also be synced across your other Apple devices, so that you have a complete profile of how often you look at your collective screens, as well as get tips on what to do with that information. Additionally, it will also include parental controls on time spent using a Mac, as well as with whom kids are able to interact with on those devices.",
    "Thanks to Apple's new Project Catalyst initiative, macOS 10.15 Catalina will soon be populated with a slew of iOS and iPadOS apps. There are a number of them available at launch, but the real potential of this initiative is that it opens up the floodgates for all kinds of apps to come over to the Mac.",
    "For developers, it all seems to start with simply checking off a box within the Xcode app in macOS 10.15 Catalina. A series of new features and protocols then become available to the app in the development phase, from which the developer can choose to add to their apps – presumably with additional yet lighter coding.",
    "It looks to make the process smoother and even quicker, with even the likes of Twitter using the tool to more effortlessly bring its native app back to macOS from iOS.",
    "Safari browser now has a new startup page that uses Siri Suggestions to surface commonly visited websites, bookmarks, iCloud tabs and more.",
    "Mail now lets users block messages from senders, mute message threads from issuing push notifications and send unsubscribe requests from within the app to mailing list providers.",
    "Lastly, Reminders gets an overhaul in the visual interface so that it will allow users to more easily create, keep track and organize their reminders."
  ],
  "headers": {
    "4": "macOS Catalina release date",
    "7": "macOS Catalina compatibility",
    "8": "Goodbye, iTunes – hello, Apple Music, Podcasts Books and TV",
    "16": "Sidecar turns your iPad into another display",
    "20": "Screen Time comes to macOS",
    "22": "Project Catalyst",
    "25": "Other fun improvements"
  },
  "links": {
    "MacBooks and Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "WWDC 2019": "https://www.techradar.com/news/wwdc-2019-liveblog",
    "iOS 13": "https://www.techradar.com/news/ios-13-release-date-features-and-everything-you-need-to-know",
    "iPadOS": "https://www.techradar.com/news/ipados-release-date-and-news",
    "some issues": "https://www.techradar.com/how-to/macos-catalina-problems-how-to-fix-the-most-common-issues",
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "We'll show you how": "https://www.techradar.com/how-to/how-to-download-and-install-macos-12-monterey",
    "macOS Mojave": "https://www.techradar.com/news/macos-1014",
    "Apple Music": "https://www.techradar.com/reviews/apple-music"
  }
}