{
  "source": "https://www.techradar.com/news/hps-giant-new-pos-wants-to-reimagine-the-post-pandemic-retail-world",
  "title": "HP's giant new POS wants to reimagine the post-pandemic retail world",
  "category": "computing",
  "updated": "2021-06-22T08:23:50Z",
  "author": "rob-clymo",
  "summary": "HP POS hardware and software range gets a full update",
  "article": [
    "HP is boosting its point of sale product portfolio by launching the new HP Engage Go 10.",
    "Aimed primarily at retail and hospitality businesses, the system is said to be fully convertible, meaning that it can be used from pretty much any location and in a wide variety of sales scenarios.",
    "The Engage Go 10 is also being complemented by another new product, the HP Engage Flex Mini, which is a compact device that can provide a point of sale solution for non bricks and mortar outlets or where space is limited.",
    "The technology giant is also making its HP Engage One Pro point of sale system available with Android or Windows options, offering everyone from small business owners through to larger corporates increased flexibility.",
    "According to HP, a recent study has underlined that 76% of US apparel executives said they want to develop and improve omnichannel integration in stores due to the evolving sales landscape.",
    "Business owners have had to react to changing consumer habits, especially since the arrival of the global coronavirus pandemic. Customers are increasingly looking for a wider range of purchasing options, including curbside pick-up and ship from store. HP is also collaborating with payment specialist Igenico in order to integrate improved payment capabilities into the new range of HP Engage products. As a result, the Engage Go 10 allows businesses to accept most major payment card methods in the US. It also offers the convenience of being able to process transactions on-the-go when necessary.",
    "“As consumer behaviors and shopping habits continue to evolve, businesses need to remain laser-focused on connecting with consumers in new and exciting ways,” said Cory McElroy, vice president and general manager, Retail Solutions, HP.",
    "“The new HP Engage Go 10 and HP Engage Flex Mini reflects HP’s commitment to delivering technology solutions to retailers and hospitality operators that combine sleek designs, expanded capabilities, and the reliability and security needed to run a wide range of operations throughout their business - whether fixed in store or mobile for curbside pickups.”",
    "HP Engage Go is a 10-inch tablet-based solution that can be used in both fixed and mobile sales situations and features up to 11th generation Intel Core i5 processor power and up to 9 hours of battery life along with HP Fast Charge Technology. Whilst it's mobile and lightweight, starting at 1.6 pounds, the device has been designed to work with key sales accessories, such as a barcode scanner and a fingerprint reader.",
    "It also comes with the option of integrating the Igenico Moby 5500M payment device, which offers business owners the ability to process a wide variety of electronic payment methods. The unit features HP Engage Link software, designed to boost the speed and efficiency of sales transactions, plus HP Wolf Security for Business.",
    "And, because it’s designed to work in all sorts of situations the unit has been designed to be robust, with the ability to fend of dust, liquids and the frequent disinfection that current hardware is being subjected to. The display also features a sturdy Gorilla Glass touchscreen.",
    "Meanwhile, the HP Engage Flex Mini is the next generation of the HP MP9, which features a compact design that targets the retail and hospitality sectors as well as healthcare, manufacturing and transportation industries. HP claims that the new design will let business take on their front-of-store and back-of-house operations, including point of sale, digital signage and surveillance systems, as well as edge computing workflows.",
    "In terms of performance, business owners can expect to benefit from up to 10th generation Intel Core i9 processors, 64GB memory and 2 flex port options, including a second NIC flex port. The small-but-potent package is set to feature HP Engage Edge too, which HP says is the first product in retail to be powered by the EdgeX Foundry open-source platform."
  ],
  "headers": {
    "5": "HP Engage products"
  },
  "links": {
    "point of sale": "https://www.techradar.com/news/the-best-pos-system",
    "point of sale solution": "https://www.techradar.com/news/how-to-choose-the-right-pos-system-for-your-business",
    "point of sale system": "https://www.techradar.com/news/how-does-a-pos-system-work",
    "small business": "https://www.techradar.com/best/small-business-tax-software",
    "payment card": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "process transactions": "https://www.techradar.com/best/best-mobile-card-payment-reader/how-to/how-to-take-card-payments-contactless-or-pin-based",
    "Intel Core i5 processor": "https://www.techradar.com/news/computing-components/processors/core-i5-processor-what-you-need-to-know-633121",
    "electronic payment": "https://www.techradar.com/best/best-payment-gateways",
    "Gorilla Glass": "https://www.techradar.com/news/phone-and-communications/mobile-phones/how-gorilla-glass-protects-your-phone-1167640",
    "Intel Core i9 processors": "https://www.techradar.com/news/intel-core-i9-rumored-to-join-mainstream-processor-lineup-with-octa-core-chip"
  }
}