{
  "source": "https://www.techradar.com/news/why-the-eufy-smart-scale-c1-is-our-number-one-smart-scale-of-2021",
  "title": "Why the Eufy Smart Scale C1 is our number one smart scale of 2021",
  "category": "fitness",
  "updated": "2021-07-16T13:23:33Z",
  "author": "cat-ellis",
  "summary": "A smart scale that's heavy on features, but light on price",
  "article": [
    "The Eufy Smart Scale C1 is one of the most affordable smart scales you can buy right now – and in our tests, we found it was also the best. This stylish little scale delivers truly impressive specs for the price, which gave it the edge over bigger names like Garmin and Fitbit, earning its place as the best smart scale of 2021.",
    "Eufy is well known for its smart home devices, including robot vacuums and video doorbells – but even if you don't recognize the name, you probably know its parent company Anker, which makes some of our top-ranking wireless headphones and speakers. You'd expect its smart scales to be among the best too – and you'd be right.",
    "Some smart scales are a hassle to set up, requiring a complex registration process and multiple passwords – but not this one. In fact, we were amazed how quickly it was ready for us to step on and start measuring our weight. You'll need to download the appropriate smartphone app and make a user account, but this takes just a few moments, and once it's done the scale will be detected and connect to your phone via Bluetooth almost instantly.",
    "The scale will recognize you automatically as soon as you step aboard, and your name will be displayed on the bright LED display, which is easy to read while you're standing. There's no Wi-Fi connectivity, but don't worry; the scale can store up to 100 weight readings, and will sync them for you when your phone is within Bluetooth range.",
    "The Eufy Smart Scale C1 supports up to 16 users, which is unusual (most smart scales max out at eight), and means it's suitable for a big household, or even a sports team.",
    "Eufy's app is thoughtfully designed too. The scale uses the EufyLife app rather than EufyHome, which is for smart home devices like robot vacuums, but you can use the same account login details for both. All your data is clearly presented, with your current weight on the home screen and more detailed body composition stats in a series of tiles.",
    "Each tile is color-coded to show whether your stats are high, normal. or low, and tapping them reveals extra information about what the data actually means – something not all smart scale apps provide.",
    "We found that the measurements from the Eufy scale almost exactly matched those from the body composition scale in our gym. Both these scales use bioelectric impedance to estimate the mass of lean tissue and fat in your body. This isn't as accurate as a DEXA scan, for example, but can be useful for tracking changes over time.",
    "Despite all this, the Eufy Smart Scale C1 is one of the most affordable smart scales around, costing just $35.99 / £35.99 (about AU$50) – and can often be found for even less at retailers like Amazon.",
    "If you own a Garmin or Fitbit device, you might prefer to stick with a scale like the Garmin Index S2 or Fitbit Aria Air, which will import your weight and body composition into the appropriate mobile app automatically. However, typing in the figures yourself doesn't take long, and for such a big saving, you might decide it's worth the extra effort."
  ],
  "headers": {
    "2": "Smart and simple",
    "8": "Weighing up the competition"
  },
  "links": {
    "Eufy Smart Scale C1": "https://www.techradar.com/reviews/eufy-smart-scale-c1",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "best smart scale": "https://www.techradar.com/best/best-smart-scales",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "speakers": "https://www.techradar.com/news/best-speaker",
    "DEXA scan": "https://www.bodyscanuk.com/dexa-body-scans.html",
    "Garmin Index S2": "https://www.techradar.com/reviews/garmin-index-s2",
    "Fitbit Aria Air": "https://www.techradar.com/reviews/fitbit-aria-air"
  }
}