{
  "source": "https://www.techradar.com/news/the-rumored-facebook-smartwatch-looks-set-to-take-on-gopro",
  "title": "The rumored Facebook smartwatch looks set to take on... GoPro?",
  "category": "wearables",
  "updated": "2021-06-10T08:20:31Z",
  "author": "tom-bedford",
  "summary": "An action cam in a smartwatch",
  "article": [
    "Back in February 2021 rumors surfaced that Facebook was working on its own health-tracking smartwatch. More rumors have surfaced about this Zuckerberg watch, but far from a fitness tracker, they suggest it'll function more like an action cam.",
    "According to The Verge, which apparently spoke to people involved in the Facebook smartwatch project, the wearable will have a screen that can be removed from the strap. This display will have a front-facing camera so you can take selfies whenever you want, as well as a rear, higher-resolution one, that's housed on the back of the display and can record video when removed from the strap.",
    "That's not to say there are no health features on the Facebook watch, as the report suggests it will have a heart rate tracker and will be marketed as a fitness device.",
    "The watch will have LTE connectivity apparently, come in white, black and gold, and launch in 2022 for about $400 (roughly £280, AU$520). That's all subject to change, though, as the project sounds far from completion.",
    "This removable display that houses a rear camera makes the Facebook smartwatch sound like it doubles as an action cam, like a GoPro camera. You'd be able to remove the watch when you're doing something cool, like an extreme sport, and save the video for Instagram. Perhaps you could prop the camera up somewhere too, and its unique selling point is its small size.",
    "That's a fair enough use case for a smartwatch, though a bit curious given most wearables are designed for fitness tracking, not video recording.",
    "The front-facing camera sounds dubious, though, because if the Nubia Alpha taught us anything, it's that it's basically impossible to take a good selfie from a wrist-mounted device. The angle's just not right.",
    "Still, the last rumor we heard about the Facebook watch painted it as a fitness device, so this is a big change. We should wait for more official news before we take anything for granted."
  ],
  "headers": {
    "4": "Instagramification"
  },
  "links": {
    "Facebook was working on its own health-tracking smartwatch": "https://www.techradar.com/news/facebook-rumored-to-be-working-on-its-own-health-tracking-smartwatch",
    "The Verge": "https://www.theverge.com/2021/6/9/22526266/facebook-smartwatch-two-cameras-heart-rate-monitor",
    "action cam": "https://www.techradar.com/news/best-action-camera",
    "GoPro camera": "https://www.techradar.com/news/best-gopro",
    "Nubia Alpha": "https://www.techradar.com/reviews/nubia-alpha-review"
  }
}