{
  "source": "https://www.techradar.com/news/cisco-wants-to-get-rid-of-complicated-work-passwords-for-good",
  "title": "Cisco wants to get rid of complicated work passwords for good",
  "category": "computing",
  "updated": "2021-03-31T13:30:24Z",
  "author": "mike-moore",
  "summary": "Wants to bring in a \"passwordless future\" for all",
  "article": [
    "Cisco has laid out its plan to put an end to remembering and typing in complicated passwords on your work devices.",
    "At its Cisco Live 2021 event, the company revealed a plan to introduce \"passwordless\" authentication for enterprise users across the world, allowing them to access to workplace devices using security keys or biometric logins.",
    "These systems will be built directly in to new laptops and smartphones as Cisco and its Duo security division look to offer companies of all sizes an easy way to bid farewell to passwords for good.",
    "Cisco says that the effects of remembering and typing in passwords cost millions of hours in lost productivity each year - equating to billions of dollars around the world.",
    "It is now hoping that Duo's passwordless authentication offering can help businesses get back to speed in the post-pandemic world, giving employees and IT admins alike less to worry about when it comes to security.",
    "The new platform will be built in to Duo's existing security offering, which is already used by around 25,000 organizations acrosds the globe, giving them quicker access to cloud or infrastructure applications. The offering is designed to be infrastructure-agnostic, meaning set up should be quick and painless, and allowing a greater degree of protection for organisations that work across a range of platforms without the need for multiple security products.",
    "When it comes to biometric sign-in, this means that systems such as Apple FaceID and TouchID as well as Windows Hello will all be included - and Duo will also provide device health and behavior monitoring controls through its excisting product offerings.",
    "“Cisco has strived to develop passwordless authentication that meets the needs of a diverse and evolving workforce and allows the broadest set of enterprises to securely progress towards a passwordless future, regardless of their IT stack,” said Gee Rittenhouse, SVP and GM of Cisco’s Security Business Group. “It’s not an overstatement to say that passwordless authentication will have the most meaningful global impact on how users access data by making the easiest path the most secure.”",
    "Cisco says the Duo passwordless authentication will be available for public preview beginning summer 2021."
  ],
  "headers": {
    "3": "Passwordless"
  },
  "links": {
    "passwords": "https://www.techradar.com/best/password-manager",
    "security keys": "https://www.techradar.com/best/best-security-key",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone"
  }
}