{
  "source": "https://www.techradar.com/news/alan-wake-remastered-wont-include-its-weirdly-iconic-product-placement",
  "title": "Alan Wake Remastered won’t include its weirdly iconic product placement",
  "category": "gaming",
  "updated": "2021-09-13T11:40:42Z",
  "author": "adam-vjestica",
  "summary": "De-Energize",
  "article": [
    "Alan Wake Remastered will be missing its prominent product placement, according to a PR representative for the game.",
    "Alan Wake included billboards for the US mobile carrier Verizon, Lincoln cars, and Energizer batteries, which players had to pick up to keep Alan’s flashlight from running out of juice. However, as discovered by Screen Rant, the product placements have been axed for the remaster.",
    "The reason behind this decision is actually really quite simple: the deals with these brands have now expired. It means that the game’s Energizer batteries will now be replaced with “generic in-universe branding”, which some might prefer.",
    "The inclusion of product placement in Alan Wake didn’t sit right with everyone; however, some felt it helped ground the world in everyday reality. Thankfully, though, the songs and TV shows that were in Alan Wake will return.",
    "Alan Wake isn’t the only game that's dabbled with product placement, of course. Crazy Taxi on Sega Dreamcast featured KFC, Tower Records, and Pizza Hut as in-game locations, and Death Stranding sees the game’s protagonist Sam Bridges chug Monster Energy drinks to build up stamina.",
    "It isn’t a surprise that Alan Wake won’t include any product placement, particularly as the game was released back in 2010. And unlike Crazy Taxi, which also lost the rights to its iconic soundtrack, players probably won’t miss the fact that Alan will be using generic batteries over branded ones, as it isn’t as integral to the game’s identity as Crazy Taxi’s soundtrack and real-life locations were.",
    "Of course, it does mean that PlayStation owners won't be getting the true Alan Wake experience, technically speaking. The game is available on PlayStation platforms for the very first time after previously being an Xbox 360 exclusive, but of course that version still includes product placement.",
    "Alan Wake Remastered is set to release on October 5, 2021, for PS4, PS5, Xbox One, Xbox Series X/S, and PC. The game will feature all new rendered 4K visuals, including new cinematics and a new character model of Alan Wake."
  ],
  "headers": {
    "4": "Analysis: marketing doesn’t make the game"
  },
  "links": {
    "Alan Wake Remastered": "https://www.techradar.com/reviews/alan-wake-remastered",
    "Screen Rant": "https://screenrant.com/alan-wake-remastered-no-verizon-energizer-product-placement/",
    "Death Stranding": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}