{
  "source": "https://www.techradar.com/news/oneplus-9-pro-leak-shows-exciting-camera-upgrades-including-hasselblad-partnership",
  "title": "OnePlus 9 Pro leak shows exciting camera upgrades, including Hasselblad partnership",
  "category": "phones",
  "updated": "2021-02-08T11:52:07Z",
  "author": "aakash-jhaveri",
  "summary": "A partnership with Hasselblad could mean a lot of things",
  "article": [
    "The OnePlus 9 series is expected to be unveiled in the next few months, and the latest leak gives us a glimpse of what we should expect from the device including a partnership with the legendary camera manufacturer Hasselblad.",
    "In his latest video, YouTuber Dave2D shared images of a supposed OnePlus 9 Pro that were supplied by a fan. Take the images with a pinch of salt, but it seems so far that this is a prototype device from OnePlus.",
    "It seems to have a different camera layout but the overall design language is similar to the previous leaks, and that has lead him to believe that this might be our first look at the OnePlus 9 Pro.",
    "The live images reveal a quad-camera setup with two larger sensors – likely to be the primary and ultra-wide lenses – followed by two smaller ones whose function is currently known, along with a laser module for autofocus.",
    "What’s particularly interesting is Hasselblad branding on the module, suggesting a partnership of some capacity. It's previously been rumored that OnePlus was looking to partner with Leica, another iconic camera brand, but if this new leak is on the money then it appears that Hasselblad is in the frame, so to speak.",
    "For the uninitiated, Hasselblad is a camera company from Sweden which make premium medium format shooters. One of its cheapest offerings is the X1D II, which started at a whopping $5,750 / £5,200 (about AU$7,500, Rs 4.2 lacs). The only time it partnered with a smartphone maker was for the True Zoom Moto Mod in 2017. Chinese drone giant DJI now owns a majority stake in Hasselblad.",
    "Historically, OnePlus flagships have been great overall smartphones but couldn’t keep up with the cameras of the competition. In a recent Weibo post (via Android Authority), CEO Pete Lau said that the company will invest heavily in cameras.",
    "A partnership with a camera company could help OnePlus close the gap, but without any specifics, we wouldn’t get too excited. These can range from something as minor as offering a new shooting mode to something substantial like co-developing the hardware and software for better results.",
    "Other images of the camera app show a new 3.3x optical zoom option, up from the 3x on the OnePlus 8 Pro, and a new tilt-shift photography mode — a shooting technique which uses special lenses to create an unusually shallow depth-of-field. Its utility on a phone is questionable, but OnePlus is no stranger to camera gimmicks.",
    "Max Jambor, a leakster with a great track record for OnePlus information, also said he has heard the partnership is official.",
    "Another leak has also suggested OnePlus may be experimenting with a new voice assistant to include on its smartphones. A trademark for a software called Speak Now from the company may offer a glimpse of a future Bixby or Google Assistant competitor.",
    "Dave2D's video shows a physical overview of the OnePlus 9 Pro including a curved display and a sleeker frame that houses the buttons and the alert slider.",
    "The phone seemingly has a glossy silver finish, but the final units could opt for a classier finish. Other listed specifications included 11GB of RAM - that's probably 12GB when rounded up - and 256GB of storage, but the display size and processor could not be confirmed.",
    "It remains to be seen how the association pans out, and if it will prove to be the solution that OnePlus had been waiting for. The OnePlus 9 Series is currently rumored to be coming in mid-March, alongside its first smartwatch and a new mid-range smartphone."
  ],
  "headers": {
    "11": "What to expect"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "YouTuber Dave2D": "https://www.youtube.com/watch?v=3iLT6iDu8Ds&feature=youtu.be",
    "OnePlus was looking to partner with Leica": "https://www.techradar.com/news/oneplus-dials-leica-to-help-improve-camera-performance-for-its-next-flagship",
    "X1D II": "https://www.techradar.com/news/hasselblad-x1d-ii-50c-confirmed",
    "True Zoom Moto Mod": "https://www.techradar.com/news/photography-video-capture/cameras/the-hasselblad-true-zoom-makes-the-moto-z-look-and-feel-like-a-real-camera-1327598",
    "Weibo": "https://weibo.com/1110411735/JBM4Fl2Uk?from=page_1005051110411735_profile&wvr=6&mod=weibotime&type=comment",
    "Android Authority": "https://www.androidauthority.com/pete-lau-oneplus-camera-quality-1190376/",
    "camera gimmicks": "https://www.techradar.com/news/oneplus-8-pro-colour-filter-camera-to-be-disabled-a-matter-of-privacy",
    "has also suggested OnePlus": "https://twitter.com/stufflistings/status/1358625251106508802",
    "smartwatch": "https://www.techradar.com/reviews/oneplus-watch-review"
  }
}