{
  "source": "https://www.techradar.com/news/massive-facebook-data-breach-leaks-info-on-millions-of-users",
  "title": "Massive Facebook data breach leaks info on millions of users",
  "category": "computing",
  "updated": "2021-04-05T09:46:43Z",
  "author": "mike-moore",
  "summary": "Data of over 533 million Facebook users leaked online",
  "article": [
    "The personal information of hundreds of millions of Facebook users across the globe has been leaked online.",
    "Around 533 million Facebook users are thought to have been affected by the data breach, with phone numbers, Facebook ID, full name, location, past location, birthdate, email address, account creation date, relationship status, and personal bios all available.",
    "The data is thought to be the same set that was leaked in January 2021 and was available to purchase online, meaning Facebook has failed to secure its users once again.",
    "The leak was first discovered by security researcher Alon Gal, co-founder of security research company Hudson Rock. Gal says he has verified the details of some users involved in the leak, with the information seemingly valid.",
    "“If you have a Facebook account, the phone number used for the account was likely leaked,” Gal stated.",
    "He believed the data could be a couple of years old and could have been extracted using the bug that Facebook said it fixed back in 2019 - before being first made available online back in January.",
    "Facebook corroborated this, telling Business Insider that the data had been scraped due to the vulnerabilitiy that it patched back in 2019.",
    "That being the case, hackers or imposters could still misuse the information for SMS phishing scams, impersonate users or lure them to share the credentials.",
    "“Individuals signing up to a reputable company like Facebook are trusting them with their data and Facebook [is] supposed to treat the data with utmost respect. Users having their personal information leaked is a huge breach of trust and should be handled accordingly,” Gal added.",
    "He has warned users to remain careful of \"social engineering attacks\" as hackers may try to access Facebook accounts using the information obtained through this fresh dump of data.",
    "Via Business Insider"
  ],
  "headers": {
    "3": "Facebook breach"
  },
  "links": {
    "Alon Gal": "https://twitter.com/UnderTheBreach/status/1378314424239460352",
    "Facebook said it fixed": "https://www.techradar.com/news/millions-of-facebook-user-phone-numbers-leaked-online",
    "Business Insider": "https://www.businessinsider.com/stolen-data-of-533-million-facebook-users-leaked-online-2021-4?r=DE&IR=T"
  }
}