{
  "source": "https://www.techradar.com/news/doctor-who-season-13",
  "title": "Doctor Who season 13: release date and everything we know",
  "category": "entertainment",
  "updated": "2021-10-11T15:38:08Z",
  "author": "matthew-forde",
  "summary": "What we know about the Doctor's return.",
  "article": [
    "Doctor Who series 13 finally releases on October 31, after a long wait for the BBC sci-fi show's return – now given the subtitle of 'Flux'. This will be the third and final season to star Jodie Whittaker in the lead role, with showrunner Chris Chibnall set to depart also following a trilogy of specials.",
    "Doctor Who series 13 is set to pick up after the departures of Graham (Bradley Walsh) and Ryan (Tosin Cole) in the 2021 New Year's special, Revolution of the Daleks. Yaz (Mandip Gill) will return alongside a new companion, Dan (John Bishop), setting up what is described as the Doctor's \"biggest adventure yet.\"",
    "With that in mind, here's everything we know about season 13 of Doctor Who and how Jodie Whittaker is set to bow out as the first woman to portray the Time Lord.",
    "Release date: Doctor Who returns to screens on October 31, 2021.",
    "Cast: Jodie Whittaker, Mandip Gill and John Bishop make up the show's main cast for this coming season.",
    "Who'll play the next Doctor? That's unknown right now, but we've got some suggestions on that front...",
    "Doctor Who series 13 begins on October 31, as confirmed by the BBC in a tweet above. The show has been given the subtitle 'Flux' for this run of episodes.",
    "Filming on series 13 commenced in November 2020 before being completed by August 2021. Due to Covid-19, there will be six episodes instead of the expected 11, with two specials already shot for 2022. A third special is then scheduled to air to coincide with the BBC's centenary celebrations in autumn 2022, which will also act as Jodie Whittaker and Chris Chibnall's swansong.",
    "\"Jodie and I made a 'three series and out' pact with each other at the start of this once-in-a-lifetime blast. So now our shift is done, and we’re handing back the TARDIS keys,\" wrote Chibnall in a blog confirming the pair's exits from the show (via the BBC).",
    "The first trailer of season 13 debuted at the BBC's Doctor Who panel during the virtual San Diego Comic-Con 2021. The 42-second preview shows off very little, but gives us brief glimpses of a number of new planets, as well as newcomers Dan and Vinder. The Doctor and returning companion Yaz both feature heavily, too.",
    "A few moments to highlight (in chronological order) include: killer robots, the TARDIS rocketing through the time vortex, Dan falling on his face in an environment that seems Egyptian, the Doctor and Yaz flying across a planet while holding onto a glider, and Yaz telling a guilty-looking Doctor that she is \"hiding something.\"",
    "The full confirmed cast list so far for Doctor Who season 13 can be seen below:",
    "Jodie Whittaker and Mandip Gill will return to their respective roles, while Chris Chibnall will once again act as showrunner. Ed Hime and Maxine Alderton both return as writers, with Segun Akinola likewise composing the thirteenth series after joining in season 11. Jamie Magnus Stone and Azhur Saleem were both confirmed as directors for the six-episode run.",
    "The newest face to the TARDIS team will be the introduction of Dan Lewis, played by comedian John Bishop. The Liverpool-born and bred comic previously held roles in seasons 3 and 4 of Skins, as well as the ITV crime thriller drama Fearless. This is inarguably Bishop's biggest role in acting to date. On top of this, Jacob Anderson (best known as Grey Worm in Game of Thrones) will join as a recurring cast member.",
    "While few details are out there about the plot of season 13 right now, we do know that the six episodes will tell an overarching story – the first time this has happened since 1986's The Trial of a Timelord serial with Colin Baker. The weekly cliffhangers are also very reminiscent of classic Who with stories commonly being between four to six episodes.",
    "New companion Dan will be from Liverpool (like Bishop), and looks to be a handyman from the teaser shown after Revolution of the Daleks. Vinder, meanwhile, was described by the Game of Thrones actor himself as \"fun, adventurous, and dynamic.\" He was also confirmed to possess his own spaceship.",
    "After season 12's controversial Timeless Child arc came to a climax, many fans were left with more questions than answers. That's why we reckon the narrative surrounding who the Doctor actually is and how she became the Timeless Child will be fleshed out further – potentially something that leads to this incarnation's demise.",
    "Chibnall spoke a little on the story as part of the Doctor Who Comic-Con@Home 2021 panel: \"I can tell you that we pick up with the Doctor and Yaz, who have been travelling together for some time, and we come and meet them mid-adventure,\" he said. \"Then they stumble across a man called Dan Lewis.\"",
    "Most recently, during the Edinburgh TV Festival, BBC director of drama Piers Wenger commented on the direction of the show (via Elliot Gonzalez).",
    "\"As with any change of Doctor and showrunner, we'll be radical [...] Change is ahead,\" he told attendees.",
    "Following the three specials due to take place in 2022, the 13th Doctor will regenerate into a currently unknown actor. Speculation is already rife with who will take over the TARDIS, yet no official name is likely to be announced until sometime next year."
  ],
  "headers": {},
  "links": {
    "Who'll play the next Doctor?": "https://www.techradar.com/news/who-should-play-the-next-doctor-who-10-candidates-to-replace-jodie-whittaker",
    "BBC": "https://www.doctorwho.tv/news/?article=jodie-whittaker-chris-chibnall-leave-doctor-who",
    "Comic-Con@Home 2021": "https://www.youtube.com/watch?v=QzDthngLyDU&ab_channel=Comic-ConInternational",
    "Elliot Gonzalez": "https://twitter.com/elliot_gonzalez/status/1430524695661760516",
    "who will take over the TARDIS": "https://www.techradar.com/news/who-should-play-the-next-doctor-who-10-candidates-to-replace-jodie-whittaker"
  }
}