{
  "source": "https://www.techradar.com/news/chrome-is-getting-an-amazing-new-article-management-feature",
  "title": "Chrome is getting an amazing new article management feature",
  "category": "computing",
  "updated": "2021-01-27T11:12:50Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Grab Chrome Canary to try out this handy tool right now",
  "article": [
    "When browsing the web you will stumble across endless articles that pique your interest. Few people have time to sit and read every article of interest as and when they find it, hence the popularity of 'read it later' services and browser plugins. To save you from having to turn to third-party tools to maintain a reading list, Google is bringing such a feature to Chrome on Android.",
    "Known as Read Later, the tool will function as a more useable alternative to simply using Chrome's normal bookmarking feature. The feature has been available to people using Chrome for iOS for a little while, but now Google is finally bringing it to Android.",
    "For anyone who has ever used another 'read it later' tool, Read Later will be entirely familiar – and integration into the browser is something that will be widely welcomed. It is a much more user-friendly option than using traditional bookmarks as it keeps the articles you still need to read separate from other links, and it is easier to mark items as read once you're done with them.",
    "To use the feature, you can tap and hold on a link and then select the Read later option in the menu that appears. When the time comes to read the articles you have saved in this way, you need simply head to your bookmarks and you will find a link to a growing Reading List.",
    "The great news is that to try out Read Later, all you need to do is install the latest build of Chrome Canary. This is version 90 of the browser and – slightly unusually – the is feature enabled by default, and there are no secret settings that you need to enable. This indicates that the feature will be gradually making its way to the beta and stable release channels, so it won't be long before it is available to all Chrome users as standard.",
    "If you are already a Canary build user, you just need to update to the latest release, but if not you will need to download the most recent build from Google Play. Note that – as Google points out – while Chrome Canary will give you access to features that are yet to receive a wider release, this version of the browser may be unstable, so you might want to install it alongside the regular build rather than replacing it.",
    "For anyone who is not keen on running Chrome Canary, it is also possible to enable the feature in the stable versions of Chrome for Android and desktop platforms. Just pay a visit to chrome://flags/#read-later, enable the setting and restart Chrome. In Android you will then be able to access Read Later as described above, while on the desktop you will need to click the star icon in the omnibar and chose whether a page should be added to bookmarks or the Read Later list. The links you save can be accessed by clicking the Reading list button in the bookmarks bar.",
    "Via XDA Developers"
  ],
  "headers": {
    "5": "Save for later"
  },
  "links": {
    "Google Play": "https://play.google.com/store/apps/details?id=com.chrome.canary&hl=en&gl=US",
    "XDA Developers": "https://www.xda-developers.com/google-chrome-read-later-android/"
  }
}