{
  "source": "https://www.techradar.com/news/samsung-phones-will-be-worlds-first-to-get-new-gorilla-glass-for-cameras",
  "title": "Samsung phones will be world's first to get new Gorilla Glass for cameras",
  "category": "phones",
  "updated": "2021-07-23T02:39:39Z",
  "author": "harry-domanski",
  "summary": "Corning's latest tech improves optical performance of phone cameras",
  "article": [
    "While there are some competitors, Corning and its Gorilla Glass technology has all but dominated the smartphone market when it comes to the use of durable, scratch-resistant glass.",
    "Today, the company has announced two new types of Gorilla Glass with DX and DX+ technology, introducing a new product class focusing on the glass covering a smartphone camera's lens. This new tech promises \"98% light capture\", according to Corning, although it wasn't revealed how this compares to preceding technologies.",
    "Strictly speaking, Gorilla Glass with DX is not just glass and it's not new – Gorilla Glass with DX is a composite material and it was first used in 2018 on the Samsung Galaxy Watch but, at the time, the technology hadn't been refined specifically for camera applications.",
    "To do this, Corning had to overcome the married problems of increasing the scratch resistance and durability of its glass composite, while not negatively impacting its optical performance (a notable side effect of lending a transparent material extra endurance).",
    "While increasing scratch resistance typically leads to less clear optics, so do the scratches themselves, so this new tech is a two-pronged solution to ensuring higher image quality for smartphone photographers.",
    "Within Corning's announcement, the company states that \"Samsung will be the first customer to adopt the Gorilla Glass DX products for camera lens covers\".",
    "There's no elaboration in the post on the specific device, nor mention of when the first DX products will be available on the market, so we'll just have to wait and see which Samsung product they're referring to – perhaps the premium and imminent Galaxy Z Fold 3 and Galaxy Z Flip 3?",
    "Even budget and mid-range smartphones on today's market possess photographic capabilities that couldn't have been fathomed a decade or two ago, a trend that simultaneously enables and responds to the need for a camera that's 'always there'.",
    "While the sheer amount of everyday photographers is at least partially due to the increasing prowess of camera phones, this would mean nothing without a degree of reliability – the best camera is the one that still works.",
    "Around the same time that smartphones began moving towards all-glass designs, the essence of the device shifted into something that prioritised premium features and style over everyday ruggedness, with devices sporting increasingly large camera arrays becoming the norm.",
    "Some handsets like the Google Pixel 5 shifted their attention back to everyday usability, and returned to a smaller, aluminum body while retaining its focus on camera capabilities.",
    "We appreciate seeing design improvements that ultimately aim to extend the life and viability of the product, rather than introducing a powerful yet fragile feature that will ensure a short lifespan for the device that bears it, so we hope Corning can continue its mission of durability."
  ],
  "headers": {
    "7": "Analysis: photography for all"
  },
  "links": {
    "announced": "https://www.corning.com/worldwide/en/about-us/news-events/news-releases/2021/07/corning-expands-corning-gorilla-glass-composite-products-to-optimize-performance-of-mobile-device-cameras.html",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5"
  }
}