{
  "source": "https://www.techradar.com/news/microsoft-edge-gets-a-silly-update-that-procrastinators-and-time-wasters-will-love",
  "title": "Microsoft Edge gets a silly update that procrastinators and time-wasters will love",
  "category": "computing",
  "updated": "2021-06-12T05:00:04Z",
  "author": "joel-khalili",
  "summary": "Microsoft Edge browser game receives host of upgrades",
  "article": [
    "It’s a little-known fact that Microsoft Edge has an in-built tool designed specifically for the hardcore procrastinators and time-wasters among us, called Surf.",
    "The browser game, which challenges players to surf as great a distance as possible without colliding with obstacles or falling prey to a sea monster, has received a host of upgrades with the latest early-access Edge build.",
    "According to William Devereux, Senior Program Manager for Edge, Surf now boasts a new set of obstacles, a streamlined character selection menu, a way to share scores with friends, as well as a number of bug fixes that improve performance.",
    "Although the latest iteration is currently available to members of the early-access program only, via the Canary channel, Surf can be played by all Edge users simply by typing “edge://surf” into the URL bar.",
    "Inspired by the 1991 classic SkiFree, the Edge surfing game continues an honorable tradition started by Google with Dino Run, an on-the-rails side-scrolling platformer playable whenever Chrome loses connection to the internet.",
    "In a blatant act of one-upmanship, Microsoft has taken the concept of a hidden browser game to a whole new level with Surf, which features multiple playable characters, charming pixel art visuals and a power-up system.",
    "The game also has three distinct game modes - Endless, Time Trial and Zig Zag - and can be controlled via keyboard, mouse, touch and, incredibly, Xbox or PlayStation controller.",
    "“Surf as far as possible in an endless ocean, compete for the shortest time, or zig zag through as many gates as you can in a row,” reads the official blurb. “Who knows? There might even be a few secrets just waiting to be found.”",
    "The latest Surf update will no doubt leave users asking one question: is this the arena in which the browser wars will finally be decided?"
  ],
  "headers": {
    "3": "Microsoft Edge game"
  },
  "links": {
    "Surf": "https://blogs.windows.com/msedgedev/2020/05/26/surf-game-edge-stable/",
    "browser": "https://www.techradar.com/best/browser"
  }
}