{
  "source": "https://www.techradar.com/news/the-audi-e-tron-gt-is-the-most-powerful-audi-ev-to-date-and-its-a-beauty",
  "title": "The Audi e-tron GT is the most powerful Audi EV to date – and it's a beauty",
  "category": "car-tech",
  "updated": "2021-02-10T13:59:07Z",
  "author": "axel-metz",
  "summary": "With great power comes great responsibility",
  "article": [
    "It's easy to think of electric vehicles (EVs) as quiet, sensible alternatives to power-hungry supercars, but Audi's new e-Tron GT aims to buck the trend by delivering genuine sustainability alongside raw, unmitigated performance.",
    "The Audi e-tron GT and RS e-tron GT arrive as fully electric cars continue to gain a foothold in the automotive mainstream, with the German manufacturer looking to capitalize on the popularity of Porsche's first EV, the Taycan, by using similar technology in its latest high performance offerings.",
    "Both e-tron GT models are four-door coupes powered by two electric motors (one on each axle) fed by an 800V, 93kWh battery. The two-speed transmission that boosts acceleration in the Porsche Taycan features here, too, meaning Audi's latest grand tourers are very, very fast.",
    "The e-tron GT quattro comes with a horsepower of 476 (or 350kW), giving it a 0-62mph (0-100kph) acceleration of 4.1 seconds. The sportier RS e-tron GT can peak at 646 horsepower (or 440kW), clocking an even faster sprint time of 0-62mph in just 3.3 seconds – which, for reference, is about the same speed as a Ferrari 458. Not bad for a couple of sustainable EVs.",
    "Despite being powered by batteries rather than petrol engines, Audi says drivers can still expect an immersive audible driving experience in its new vehicles thanks to virtual sound systems – of the type we've come to expect in sportier EVs – which simulate authentic engine roars.",
    "These synthesized sounds will be informed by data about the rotational speed of the electric motors, the load, the vehicle speed, and other parameters.",
    "Both models will also feature adaptive air suspension, all-wheel-steering and locking rear differential to offer improved traction, as well as a driving range in excess of 295 miles (e-tron GT quattro) and 280 miles (RS e-tron GT), according to the company.",
    "In addition to an efficient powertrain, a leather free interior option is available using recycled materials, plus production is completely carbon neutral, says the company.",
    "And boy, are they pretty to look at. The e-tron GT models share the assembly line with the Audi R8, and the muscular design of the manufacturer's flagship sports car seems to have rubbed off on the new EVs. Hell, Tom Hardy was at the Audi launch event, so they must look cool.",
    "As you'd expect from Audi, the interior console is equally futuristic-looking. On the inside, the dash features a crisper interpretation of current Audi interiors with the central touchscreen placed higher than in previous models.",
    "The virtual cockpit remains, tilted slightly towards the driver in what looks like a move to better show off the technological bells and whistles that seem customary of the manufacturer. Physical buttons for climate control have also returned.",
    "The e-tron GT quattro and RS e-tron GT are set for simultaneous introduction sometime between March and May 2021, initially in Germany and then likely the rest of the world.",
    "The e-tron GT quattro will be available from £79,900 (around $110,000 / AU$140,000), and the RS e-tron GT from £110,950 (around $150,000 / AU$200,000), but prices will vary depending on specification.",
    "With the Tesla Model S – perhaps the e-tron GTs' most comparable competitor – starting at £73,990, Elon and co. could finally have a worthy EV opponent to contend with."
  ],
  "headers": {
    "7": "With great power..."
  },
  "links": {
    "Audi R8": "https://www.techradar.com/news/audi-r8-v10-plus-an-addictive-mix-of-excellence-and-excess"
  }
}