{
  "source": "https://www.techradar.com/news/is-daredevil-in-spider-man-no-way-home-charlie-cox-wont-deny-it",
  "title": "Is Daredevil in Spider-Man: No Way Home? Charlie Cox won't deny it",
  "category": "entertainment",
  "updated": "2021-09-02T09:15:56Z",
  "author": "tom-power",
  "summary": "Will The Man Without Fear appear?",
  "article": [
    "Daredevil star Charlie Cox has refused to downplay rumors that he'll appear in Spider-Man: No Way Home.",
    "Speaking on the Steve Varley show for his new TV series Kin, Cox was asked if he was aware of the speculation surrounding a Daredevil/Matt Murdock cameo in No Way Home.",
    "Cox, who admitted that his mom and wife had kept him in the loop on the rumors, appeared to become flustered as he tried to discredit the conjecture. Check out the clip in question from the 9:00 minute mark below:",
    "On the rumors about Daredevil's appearance in No Way Home, Cox said: \"I see it as a massive, massive... it makes me feel very grateful that people care that much. Y'know, it makes me... I feel like... I wouldn't want to ruin something either way. Do you know what I mean?",
    "\"So, so... it makes me a little anxious in that regard so it's... it's a difficult thing to talk about. I guess what I can say is that everyone, myself included, is going to have to wait and see what happens.\"",
    "In a separate interview with ComicBook.com, Cox was more sure regarding one particular aspect of No Way Home's first trailer. Asked if the individual with rolled up sleeves, at the 0:31 mark in the teaser, was Matt Murdock, Cox simply said: “I can promise you those are not my forearms.\"",
    "Despite Cox's best efforts, his quotes have only helped to convince fans that Daredevil (or Matt Murdock, at least) will cameo in Spider-Man: No Way Home.",
    "After his comments emerged online, replies from Marvel fans in various Reddit threads show that plenty believe that Murdock will appear – even if it's just a five to 10 minute cameo.",
    "Even before No Way Home's first trailer arrived in late August, there had been plenty of speculation that Cox would reprise his role as Murdock in the Spider-Man sequel.",
    "Numerous journalists and leakers, including Brandon Davis and Charles Murphy, had suggested that Cox was seen on the No Way Home set in December 2020 and January 2021. Since then, rumors have persisted about Cox's role in the movie, with even Marvel Studios President Kevin Feige appearing to be extremely coy on such speculation at the beginning of the year.",
    "The arrival of the multiverse, too, provides Marvel and Sony with unlimited possibilities for Marvel to lean more heavily into fan service.",
    "Both studios have the potential to bring iterations of fan favorite characters, such as Cox's Murdock, into the MCU. Marvel and Sony could simply state that their inclusion is a by-product of the breakdown in barriers between universes, which allows characters to bleed over into other realities and dimensions.",
    "We've already seen this play out in Loki's Disney Plus show. Crossovers are set to continue in No Way Home and Doctor Strange 2, and they could form part of other upcoming MCU productions including Secret Invasion and Ant-Man and the Wasp: Quantumania.",
    "Our opinion? Cox will appear in No Way Home in some capacity. He may have said those aren't his forearms in the first trailer, but that doesn't mean he won't appear at all.",
    "There are too many believable rumors that suggest otherwise and Cox, with the perfect opportunity to deny he'd show up, failed to pour cold water on that growing speculation. Given all of the evidence, we're confident he'll make a cameo appearance.",
    "Either way, we won't have long to find out for sure. Spider-Man: No Way Home arrives in theaters on December 17."
  ],
  "headers": {
    "6": "Analysis: Will Daredevil feature in Spider-Man: No Way Home? All signs point to yes"
  },
  "links": {
    "ComicBook.com": "https://comicbook.com/marvel/news/spider-man-no-way-home-spoilers-charlie-cox-not-in-trailer-confirmed/",
    "various": "https://www.reddit.com/r/marvelstudios/comments/pfxtam/charlie_cox_denies_appearing_in_the_spiderman_no/",
    "Reddit": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/pg41s5/charlie_cox_gets_a_bit_flustered_on_whether_hes/",
    "threads": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/pfwxqp/charlie_cox_on_nwh_rumors/",
    "Brandon Davis": "https://twitter.com/spideysnews/status/1350134555500535808",
    "Charles Murphy": "https://www.murphysmultiverse.com/charlie-cox-daredevil-spiderman-3-marvel-studios/",
    "extremely coy": "https://www.youtube.com/watch?v=MV4ZQF9w4TM&t=239s"
  }
}