{
  "source": "https://www.techradar.com/news/roku-streaming-sticks-could-ditch-batteries-as-rechargeable-remote-goes-on-sale",
  "title": "Roku streaming sticks could ditch batteries as rechargeable remote goes on sale",
  "category": "audio-visual",
  "updated": "2021-02-16T11:33:50Z",
  "author": "rhys-wood",
  "summary": "Roku goes green",
  "article": [
    "Roku’s new rechargeable remote, the Roku Voice Remote Pro, boasts a lot of convenient features and upgrades from its predecessors, including getting rid of the need for disposable batteries.",
    "Available as part of Roku’s Early Access Program, the Voice Remote Pro looks to be a minimal device with handy features like a voiced lost remote finder and a rechargeable battery.",
    "The device currently has a limited run of just 2000 units priced at $29.99, with shipping scheduled for 19 February – but it’s yet unclear if the company will move the device into mass production.",
    "It’s likely that the Voice Remote Pro is a work in progress, with Roku stating on the device’s store page that customers will be helping them “perfect our newest remote.”",
    "According to a beta tester on the Roku subreddit, the remote can now handily be recharged via micro-USB, but whether or not that’s the current USB-C standard remains to be announced. Regardless, this is a welcome change, especially considering other companies such as Microsoft are reluctant to make the move away from traditional batteries.",
    "Other features listed on the graphic include hands-free voice recognition, personal device shortcuts and private listening which may allow users to plug headphones into the device.",
    "Some more examples of voice recognition are also included, showing that the Voice Remote Pro retains the Lost Remote Finder function. This makes the remote emit a beep when the relevant button is pressed on your Roku device. The screenshot also offers an example showing that the remote can be told to play music via the user’s voice.",
    "A more robust launch for the Roku Voice Remote Pro is unconfirmed, and there are things we still don’t know about the device, such as battery life and its operational range. Still, this could signal another home brand moving away from traditional batteries, which can only be good for buyer convenience and the environment at large."
  ],
  "headers": {
    "3": "Bye bye batteries"
  },
  "links": {
    "Early Access Program": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1303260476055358000/https://www.roku.com/betatesting",
    "Roku subreddit": "https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/",
    "Microsoft": "https://www.techradar.com/news/xbox-series-x-controllers-wont-ditch-aa-batteries-for-a-while-yet-heres-why"
  }
}