{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4s-major-wear-os-makeover-has-been-detailed-in-a-leak",
  "title": "Samsung Galaxy Watch 4’s major Wear OS makeover has been detailed in a leak",
  "category": "wearables",
  "updated": "2021-05-18T09:21:18Z",
  "author": "james-rogerson",
  "summary": "Wear OS plus One UI and new features rumored",
  "article": [
    "We’ve been hearing for a while that the Samsung Galaxy Watch 4 and Samsung Galaxy Watch Active 4 will likely run Wear OS, and the latest leak on the subject backs this up, while also providing a lot more details about the watches.",
    "According to SamMobile, Samsung is planning to launch three new smartwatch models codenamed Wise, Fresh and Lucky. The first of those will apparently have classic watch design elements and a rotating bezel, so it will presumably launch as the Samsung Galaxy Watch 4.",
    "The other two are said to be sportier, so one of them will presumably be the Samsung Galaxy Watch Active 4. The other one might also be an Active model, or it could be something new.",
    "On the subject of the software, while all three upcoming wearables will apparently run Wear OS (instead of Tizen, which Samsung’s current smartwatches use), it will supposedly be overlaid with Samsung’s One UI 3.x.",
    "This is said to be an entirely new version of Samsung’s One UI (an interface which can be found on Samsung's smartphones and some of its wearables), and it should allow for a similar look and feel to the software on current Galaxy Watch models, such as the Samsung Galaxy Watch 3, even though the operating system will apparently be different.",
    "This could allow Samsung to deliver the best of both worlds, with the slick smartwatch interfaces it’s known for paired with the wider range of third-party apps that are available for Wear OS.",
    "The Samsung Galaxy Watch 4 will apparently also have a new feature that lets you use it like a walkie-talkie to send voice messages to friends, which is a feature already found on the Apple Watch.",
    "Additionally, according to SamMobile there will apparently be new SmartThings features available on the watch. The site doesn’t say what these features will be, but supposedly the interface is being revamped for ease of use. SmartThings allows you to control your home’s smart devices all in one place, so perhaps these changes will give you more control from your watch.",
    "It remains unclear exactly when the Samsung Galaxy Watch 4 and Galaxy Watch Active 4 will actually launch, but some reports suggest they’ll be here by the end of June.",
    "In the meantime, there could be other exciting Wear OS news, as Google is expected to make some announcements about it at Google IO 2021, which kicks off later today (May 18)."
  ],
  "headers": {
    "3": "Wear OS, but not as you know it"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "SamMobile": "https://www.sammobile.com/news/exclusive-galaxy-watch-4-feature-wear-os-confirmed/",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "by the end of June": "https://www.techradar.com/news/expect-the-galaxy-watch-4-and-the-galaxy-watch-active-4-in-the-next-few-months",
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog"
  }
}