{
  "source": "https://www.techradar.com/news/amds-more-affordable-rx-6600-gpu-could-turn-up-much-later-than-expected",
  "title": "AMD’s more affordable RX 6600 GPU could turn up much later than expected",
  "category": "components",
  "updated": "2021-07-21T11:43:25Z",
  "author": "darren-allan",
  "summary": "Vanilla RX 6600 may not be here until October",
  "article": [
    "AMD’s supposedly imminent RX 6600 graphics card – the vanilla non-XT version – won’t be arriving as soon as expected, at least not going by fresh info plucked from the GPU grapevine.",
    "Previous spinning from the rumor mill has indicated that both the RX 6600 and 6600 XT GPUs could be out next month, but now leaker Coreteks reckons that the base RX 6600 won’t be here until at least September, or it might not even pitch up until October.",
    "Coreteks has previously said that the RX 6600 XT will come out in August, and with no mention of the XT card here, presumably that piece of speculation still holds, and it’s just the RX 6600 that we might be waiting another few months for. We don’t know that for sure, though – and indeed remember we can’t be certain about any of this, as ultimately it’s all rumors and educated guesswork.",
    "The vanilla RX 6600 will purportedly feature 1,792 stream processors, compared to the 6600 XT which is rumored to run with 2,048 stream processors – and potentially could outdo Nvidia’s RTX 3060 Ti according to the latest benchmark leak we’ve seen. That fresh leak is certainly a surprise given that we were thinking AMD was targeting the RTX 3060, but it could help to explain some of the chatter about heftier price tags for the 6600 XT. Time will tell, but the RX 6600 will offer a more affordable option, of course.",
    "Beyond that, Coreteks also mentions that Navi 24 will arrive before the end of 2021, the GPU to power the budget cards which will sit below the 6600 series. So by the close of this year, there should be a lot more options on the table in terms of graphics cards which are more wallet-friendly from AMD.",
    "Hopefully we’ll see some decent stock levels of these GPUs, too, which will obviously be a crucial part of the puzzle.",
    "Via VideoCardz"
  ],
  "headers": {
    "3": "Spec talk"
  },
  "links": {
    "AMD’s supposedly imminent": "https://www.techradar.com/news/is-this-the-rumored-amd-radeon-rx-6600-xt",
    "Coreteks has previously said": "https://www.techradar.com/news/amd-rx-6600-xt-price-rumors-could-disappoint-gamers-hunting-for-a-budget-gpu",
    "rumored to run with 2,048 stream processors": "https://www.techradar.com/news/amd-rx-6600-xt-price-rumors-could-disappoint-gamers-hunting-for-a-budget-gpu",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "latest benchmark leak we’ve seen": "https://www.techradar.com/news/amd-radeon-rx-6600xt-leak-shows-a-true-rival-to-the-nvidia-rtx-3060-ti",
    "chatter about heftier price tags for the 6600 XT": "https://www.techradar.com/news/amd-rx-6600-xt-price-rumors-could-disappoint-gamers-hunting-for-a-budget-gpu",
    "VideoCardz": "https://videocardz.com/newz/amd-radeon-rx-6600-non-xt-not-to-launch-sooner-than-september"
  }
}