{
  "source": "https://www.techradar.com/news/whatsapp-wants-to-make-business-messaging-faster-and-easier",
  "title": "WhatsApp wants to make business messaging faster and easier",
  "category": "computing",
  "updated": "2021-06-02T16:01:10Z",
  "author": "rob-clymo",
  "summary": "Overhaul of WhatsApp Business API",
  "article": [
    "WhatsApp has revealed a number of improvements to its suite of chat tools for business users at the F8 Refresh developer event.",
    "With the pandemic meaning that more people want to chat with companies using apps such as WhatsApp, the company has outlined the improvements it plans to make to address this.",
    "A series of updates to the WhatsApp Business API will make it quicker for businesses to exploit growing demand for chat options from customers. In fact, e-commerce businesses will soon be able to get up and running using the WhatsApp Business API in just five minutes, compared to the process taking weeks to implement previously.",
    "The updates are aimed primarily at medium and larger businesses with a desire to carry out more customer conversations using WhatsApp. One of the key improvements will focus on offering more flexibility for businesses when it comes to communicating with customers. Previously, companies were faced with a limited time slot for sending customers notifications, making it difficult to follow up with them outside of a standard 24-hour window.",
    "From now on though businesses will get support for a wider range of messages, which will let companies offer a more comprehensive range of customer updates, such as notifying them when stock levels change.",
    "In a WhatsApp blog post, the company points out how periodic updates from health authorities in response to evolving situations caused by the pandemic have proved invaluable. WhatsApp thinks that offering the same options to the wider business community could prove invaluable following the update.",
    "Boosting speed and efficiency are also at the forefront of the WhatsApp updates. For example, new list messages that feature a menu of up to 10 different options will enable people to reply instantly and without needing to type anything.",
    "Similarly, reply buttons will be condensed and feature quick one-tap response options that can be tailored to suit the needs of different businesses. Fine-tuning can be carried out via their WhatsApp Business API account.",
    "The company adds that by noting that the new tools and services will enable e-commerce businesses and customers to have more control. Added to that, the improvements should also allow consumers to give greater feedback to businesses about their experiences, including if they feel the need to block a company for a specific reason, such as receiving unwanted notifications."
  ],
  "headers": {
    "5": "WhatsApp Business API"
  },
  "links": {
    "chat tools": "https://www.techradar.com/best/best-live-chat-software",
    "e-commerce businesses": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "WhatsApp": "https://www.techradar.com/how-to/use-whatsapp"
  }
}