{
  "source": "https://www.techradar.com/news/early-black-friday-deal-excellent-sony-wireless-earbuds-hit-their-lowest-price",
  "title": "Early Black Friday deal: excellent Sony wireless earbuds hit their lowest price",
  "category": "audio-visual",
  "updated": "2021-11-11T10:36:07Z",
  "author": "olivia-tambini",
  "summary": "Get the brand-new Sony WF-C500 with an incredible discount",
  "article": [
    "If you're looking for a reliable pair of true wireless earbuds, these early Black Friday deals on the excellent Sony WF-C500 could be just the ticket.",
    "The wireless earbuds may have only been released in September, but they've already hit their lowest price in the US and the UK - and as the WF-C500 were already fairly budget-friendly, these Black Friday wireless earbuds deals are well worth snapping up.",
    "In the US, the Sony WF-C500 have been slashed from $99 to $78, saving you $21.99.",
    "Meanwhile, UK buyers can get the Sony earbuds for just $59, which is a saving of $31 compared to their £90 RRP.",
    "(Not in the US or UK? Scroll down for deals in your region.)",
    "The Sony WF-C500 are very light and comfortable earbuds, and they make a good cheap alternative to the Sony WF-1000XM4 - though they don't come with active noise cancellation.",
    "Controlling the earbuds is super easy - if you want a pair of budget-friendly wireless earbuds that 'just work', the WF-C500 are the ones to buy.",
    "The sound is good too, in spite of their low price. You can expect a rapid, detailed, and thoroughly engaging audio performance, with some real areas of expertise, especially where vocals are concerned.",
    "Saying that, the 20-hour battery life isn't great (though we'll concede that a 10-hour playback from the earbuds alone is quite impressive), so if you constantly forget to charge your buds, you might want to look elsewhere.",
    "As the Sony WF-C500 were only released in September, we don't expect these prices to drop significantly over Black Friday and Cyber Monday. So, if you're keen on these excellent Black Friday headphones deals, we'd recommend snapping them up today.",
    "No matter where you live, you'll find all the lowest prices for the Sony WF-C500 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best early Black Friday wireless earbuds deals",
    "10": "More Sony WF-C500 deals",
    "11": "More Black Friday deals in the UK"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Sony WF-C500": "https://www.techradar.com/reviews/sony-wf-c500",
    "Black Friday wireless earbuds deals": "https://www.techradar.com/black-friday/best-wireless-earbuds-deals",
    "slashed from $99 to $78": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSony-Bluetooth-Headphones-Resistance-Exclusive%2Fdp%2FB09CFP6J6D%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1376743617289337600-20",
    "for just $59": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FSony-WF-C500-Wireless-Headphones-Built-Green%2Fdp%2FB09FKFMLQR%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1113756103365259600-21",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Black Friday headphones deals": "https://www.techradar.com/black-friday/best-headphones-deals"
  }
}