{
  "source": "https://www.techradar.com/news/why-should-you-care-about-nfts-you-can-watch-episode-7-of-seriously-right-now",
  "title": "Why should you care about NFTs? You can watch episode 7 of Seriously? right now",
  "category": "computing",
  "updated": "2021-06-16T10:38:52Z",
  "author": "hamish-hector",
  "summary": "Explaining why NFTs might not just be hype",
  "article": [
    "Seriously? What do you think? We gather some of the best tech journalists from all over the internet to argue about the biggest tech topics for your enjoyment.",
    "This week TechRadar Staff Writer Hamish Hector, Laptop Mag Senior Writer Sean Riley, and Tom's Guide Senior Editor Henry T. Casey all try to convince Matt that the future of NFTs could be an exciting one.",
    "Matt and his guests dive into the controversial world of NFTs to find out what they are, how you make one, how you buy one, and ultimately, should you care about them?",
    "Along the way, the discussion turns to art, the environment, group-think, basketball, and the power of Elon Musk’s tweets.",
    "Henry T. Casey explains that understanding NFTs should help you not get ripped off, and is convinced that NFTs might be being fuelled by hype, but Sean Riley believes there could be value in supporting your favorite creators.",
    "Meanwhile, Hamish Hector compares NFTs to the Mona Lisa.",
    "You can watch Seriously? episode 7 above and find our what our experts think. New episodes of Seriously? roll out every two weeks on a Wednesday, and you can catch-up on the entire series via the links below",
    "Why should I care about 5G? | Should AAA games cost $70? | How scared should we be of smart tech? | Is Apple Truly Innovative?"
  ],
  "headers": {
    "2": "Confused and skeptical"
  },
  "links": {
    "Hamish Hector": "https://www.techradar.com/author/hamish-hector",
    "Laptop Mag": "https://www.laptopmag.com/uk",
    "Sean Riley": "https://www.laptopmag.com/author/sean-riley",
    "Tom's Guide": "https://www.tomsguide.com/",
    "Henry T. Casey": "https://www.tomsguide.com/author/henry-t-casey",
    "Why should I care about 5G?": "https://www.youtube.com/watch?v=cwtu_ggxS6w",
    "Should AAA games cost $70?": "https://www.youtube.com/watch?v=g0J4Z1yOc-4",
    "How scared should we be of smart tech?": "https://www.youtube.com/watch?v=0PGmc4eoh-Y",
    "Is Apple Truly Innovative?": "https://www.youtube.com/watch?v=RH1Roqctank"
  }
}