{
  "source": "https://www.techradar.com/news/dolby-vision-gaming-on-xbox-series-xs-has-arrived-heres-everything-you-need-to-know",
  "title": "Dolby Vision gaming on Xbox Series X/S has arrived – here’s everything you need to know",
  "category": "gaming",
  "updated": "2021-09-29T09:00:13Z",
  "author": "adam-vjestica",
  "summary": "Enjoy improved picture quality thanks to Dolby Vision",
  "article": [
    "Dolby Vision gaming, a new HDR format promising more color, contrast, and highlights for video games, is now available for Xbox Series X and Xbox Series S, Microsoft announced today.",
    "More than 100 next-gen HDR-capable titles will support Dolby Vision soon, including games available today and in the future such as Halo Infinite, which was tipped to include Dolby Vision support a few months ago.",
    "Dolby Vision will also improve thousands of classic HDR10 and Auto HDR games, as Microsoft has ensured that the Xbox Series X and Xbox Series S will automatically enhance your existing games to deliver a richer HDR experience. Auto HDR is Microsoft’s clever tech that injects HDR into titles that previously never supported high dynamic range.",
    "Developers can opt to add Dolby Vision for gaming support via the tools provided by Microsoft or by implementing the technology directly into a game’s engine.",
    "But how does Dolby Vision for gaming compare to something like HDR10? Well, Microsoft and Dolby say that games will automatically map to any display that supports Dolby Vision, which will deliver the best possible picture available to players. It means that your games should benefit from better brightness, color, contrast, and detail, and Dolby Vision’s automatic tone mapping means players won’t have to manually calibrate every game to get the best possible HDR experience.",
    "Dolby Vision is also compatible with 120Hz displays, allowing games to be played at 120fps. However, not every TV supports this feature yet, but Microsoft and Dolby have stated that it is working closely with TV manufacturers to update firmware support for Dolby Vision capabilities.",
    "If you’d like to experience Dolby Vision gaming for yourself, you’ll need to have Dolby Vision-capable TV. You can check to see if your display supports Dolby Vision by pressing the Xbox button to open the guide, clicking on Settings > General > TV & display options > 4K TV details.",
    "To enable Dolby Vision on Xbox Series X and Xbox Series S, head to Settings > General’ > TV & display options > Video Modes > Dolby Vision for Gaming. Microsoft also recommends turning on automatic low-latency mode (ALLM), if your TV supports it, as you may experience latency issues during gameplay without it. You can check Dolby’s website to see a list of compatible TVs.",
    "It’s worth noting that Dolby Vision for gaming takes advantage of all the next-gen gaming settings you’re probably used to on Xbox Series X/S, such as ALLM as mentioned above – as well as variable refresh rate (VRR), which eliminates screen tearing and smooths out minor framerate dips.",
    "Microsoft has a long-standing relationship with Dolby, which began during the days of Xbox One. Dolby released its spatial audio tech, Dolby Atmos, on Xbox consoles in 2017, and Dolby Vision support for streaming services such as Netflix arrived in 2018. Dolby Vision for gaming is the latest addition and will be welcome by anyone who has a capable display.",
    "The partnership means that Xbox Series X/S is the only console where you can experience Dolby’s suite of audio and visual tech, as the PS5 doesn’t include Dolby Atmos, Dolby Vision, or Dolby Vision for gaming support. Sony has opted for its own proprietary audio technology in the form of 3D audio and only supports HDR10.",
    "Dolby Atmos for headphones does require the user to pay a license fee, though, while Sony’s 3D audio is free as standard on PS5. However, your license also carries over to PC and other devices, and you don't need a license to use Dolby Atmos on a soundbar or home theater system. Dolby also lets users create their own EQ settings as well as pick between a wide selection of presets. Dolby Vision, meanwhile, won’t require a fee to use – just a compatible display."
  ],
  "headers": {
    "6": "How to optimize Dolby Vision gaming for your TV",
    "9": "Analysis: Microsoft and Dolby’s partnership continues"
  },
  "links": {
    "Dolby Vision gaming": "https://www.techradar.com/news/these-120hz-oled-gaming-tvs-just-got-a-serious-upgrade-but-only-for-xbox-series-x",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Dolby Vision support": "https://www.techradar.com/news/halo-infinite-looks-like-it-will-support-dolby-vision-and-dolby-atmos",
    "Auto HDR": "https://www.techradar.com/news/what-is-xbox-series-x-auto-hdr-microsofts-game-changing-feature-explained",
    "120fps": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support",
    "Dolby’s website": "https://www.dolby.com/experience/xbox",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Dolby Atmos": "https://www.techradar.com/news/hear-the-difference-the-best-dolby-atmos-xbox-series-x-games",
    "3D audio": "https://www.techradar.com/news/best-ps5-headsets-for-3d-audio-experience-more-immersive-sound"
  }
}