{
  "source": "https://www.techradar.com/news/high-demand-for-rtx-gpus-has-resulted-in-an-abundance-of-cheap-motherboards",
  "title": "High demand for RTX GPUs has resulted in an abundance of cheap motherboards",
  "category": "computing",
  "updated": "2021-05-17T11:08:03Z",
  "author": "jess-weatherbed",
  "summary": "At least one component won't cost a small fortune",
  "article": [
    "Retailers like Newegg have been pairing motherboards with highly desirable graphics cards such as the GeForce RTX 3080 and Radeon 6800 XT to such an extent that DigiTimes is reporting a 10-15% fall in global mobo sales. For some, buying these bundles is the only way to purchase a new GPU outside of third-party auction sites (at the risk of buying a scalped product at an insanely inflated price), resulting in unwanted motherboards being cheaply sold on. It's also likely that everyday gamers and DIY PC builders are not mostly responsible for the oversaturation of discounted motherboards available online. Cryptominers have been widely criticized for buying up GPUs en masse to mine for Bitcoin and Ethereum, and scalpers are known to use bots to buy huge quantities of stock at RRP to later resell for a profit on sites like eBay and Facebook Marketplace. Both cryptominers and scalpers have no use for the other hardware being paired with elusive GPUs, so it's likely that these 'bulk' purchases have contributed to the vast quantities of discounted motherboards.",
    "In-demand graphics cards have been sold in combination with other components for some time, as seen in the above tweet from @RyuGTX that dates back to January 2021. These bundle deals could be an advantage for anyone looking to start their first DIY build, but for anyone simply looking to update an existing rig, it's adding unnecessary costs to an already expensive purchase. Even for folk new to the world of PC gaming, it may be a better financial choice to purchase a gaming laptop or pre-built gaming PC right now. That said, while the ongoing GPU shortage isn't easy on our wallets, we could also see other components being flogged at a discount due to these bundle sales. NotebookCheck predicts that SSDs and CPUs could also find their way onto sites like eBay given that Cryptominers have no use for them after buying bundle deals. The current prediction is we will see sales declining on motherboards well into late 2021, and with other essential components expected to be cheaply offloaded into online marketplaces, it might be worth hunting around for some good deals to upgrade your current build. With any luck, GPU stock availability may eventually increase to meet demand before your freshly upgraded system needs another rebuild.",
    "Via TomsHardware"
  ],
  "headers": {
    "1": "A silver lining?"
  },
  "links": {
    "GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Radeon 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "DigiTimes": "https://www.digitimes.com/news/a20210514PD200.html",
    "insanely inflated price": "https://www.techradar.com/news/current-nvidia-rtx-3000-gpu-prices-are-so-much-worse-than-we-thought",
    "@RyuGTX": "https://twitter.com/RyuGTX/status/1351997139791052801",
    "gaming laptop": "https://www.techradar.com/news/thinking-about-building-your-first-pc-dont-buy-a-gaming-laptop-instead",
    "pre-built gaming PC": "https://www.techradar.com/news/the-nvidia-rtx-3080-is-still-hard-to-find-so-maybe-its-time-to-just-get-a-prebuilt-gaming-pc",
    "ongoing GPU shortage": "https://www.techradar.com/news/whats-the-point-of-releasing-new-gpus-if-nobody-can-actually-buy-them",
    "NotebookCheck": "https://www.notebookcheck.net/Crypto-miners-could-soon-flood-Ebay-with-cheap-CPUs-motherboards-and-SSDs-acquired-via-GPU-bundle-purchases.539289.0.html",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "CPUs": "https://www.techradar.com/news/best-processors",
    "TomsHardware": "https://www.tomshardware.com/uk/news/motherboard-sales-decline-from-bundles"
  }
}