{
  "source": "https://www.techradar.com/news/baptism-of-fire-how-to-survive-the-first-six-months-as-a-new-tech-ceo",
  "title": "Baptism of fire: How to survive the first six months as a new tech CEO",
  "category": "computing",
  "updated": "2021-08-09T09:57:43Z",
  "author": "joel-khalili",
  "summary": "New BlackLine CEO Marc Huffman took charge in a period of crisis",
  "article": [
    "By a quirk of chance, Marc Huffman took on his first CEO role in the middle of a pandemic. Although his career to date had taught him the importance of preparing for every eventuality, this particular scenario was “unimaginable”.",
    "Six months into his new role at accounting software firm BlackLine, Huffman told us he is pleased with how the business has weathered the crisis so far, but he is now eager to move past the pandemic and help return the business to growth.",
    "In some respects, the crisis has given Huffman a clean slate to work from; the period of turbulence, as destructive as it has been for many businesses, has acted as an economy-wide reset and created a platform to build upon.",
    "His primary concern in the months to come will be positioning BlackLine to ride the swell in momentum as businesses begin to refire their engines.",
    "“With the roll out of vaccines, the confidence level within the organization and among customers is on the upswing,” Huffman told TechRadar Pro.",
    "“Having been involved in putting the pandemic strategy in place and communicating the plan to employees [before becoming CEO], I’m now fortunate to be able to help us emerge into a new era.”",
    "In the technology industry, it is common for people to shine brightly but briefly before moving on to pastures new, but Huffman’s career paints a different picture.",
    "He first entered the space in 1996, taking a sales position at software giant Oracle, where he spent the next seven years. After that, he plied his trade for a decade and a half at Netsuite, another enterprise IT titan, eventually working his way up to the position of President of Sales. The only other company to feature in Huffman’s résumé is BlackLine.",
    "The long duration of his tenures at Oracle and Netsuite, he says, is partly down to his personality, which requires him to focus on just a few items at a time in order to resist the temptation of the “next crazy idea that might lead me astray”.",
    "Separately, however, Huffman has also tried to make a point of sticking around at a business when the honeymoon period has ended - and especially when disaster strikes.",
    "“Running off when a job becomes difficult seems counterintuitive to me,” he told us. “So much of what I’ve learned and so many of the opportunities that have come my way have arrived on the other side of difficult times.”",
    "In one such instance, Huffman found himself leading a team of two hundred at Oracle, on an assignment that saw him relocate temporarily to Ontario, Canada. Already he was faced with an unusual amount of responsibility at a young age, but then 9/11 happened.",
    "Leading people through the societal and economic turmoil that followed, he says, was a “unique experience”, especially because he found himself outside of his home country at a time in which it was under attack.",
    "Later, in 2007, Huffman was at Netsuite when the company went public just before the global financial crash. As Head of Sales for North America, Huffman had to balance the (now urgent) need to drive results with the need to manage people through a desperate and deeply dispiriting time.",
    "“It was really difficult, attempting to grow a company and get people to focus on the work at hand: selling ERP software to midsize companies,” he said. “That was a big challenge when people were concerned about the very existence of the business.”",
    "Behind the scenes, the conversation among executives was about the company’s prospects of surviving the fallout, but in front of employees a brave face was required.",
    "In the context of these landmark events, both of which had far-reaching consequences for society as well as business, it seems fitting that Huffman took on the role of BlackLine CEO in the middle of a pandemic.",
    "Huffman resists the idea that all CEOs are cut from the same cloth, sharing a common personality type and set of attributes; there are many different approaches to the job, he says. But he does concede that all CEOs need one quality in particular: thick skin.",
    "Although BlackLine celebrated its 20th anniversary earlier this year, Huffman is only the company’s second ever CEO. The first was its founder, Therese Tucker.",
    "Inevitably, taking over as CEO from someone who has held the post for decades was going to throw up challenges, not least because Tucker still holds an active position on the board.",
    "However, Huffman insists he has been given sufficient room to pursue his own objectives and strategies; Tucker doesn’t peer over his shoulder, breath down his neck or perform any other metaphorical act that might be attributed to a micromanager.",
    "There remains a need to stamp his own mark on the position, but equally, Huffman suggests there is no major rush.",
    "“The biggest dynamic I pay attention to when driving change is time,” he said. “It’s sort of like a ship that’s turning; you can try to turn very aggressively or you can make a long arcing turn. The difference is how long it’s going to take to turn, but also how much spills over the sides.”",
    "“In our case, we’ve got a rich heritage inherited from people who have been at the company for a long period of time. I didn’t want to make aggressive change, such that those people didn’t feel like they were part of the same organization.”",
    "Although Huffman didn’t say so specifically, his relationship with Tucker appears to have a mentor-mentee flavor. The pair still meet on a biweekly basis to discuss ongoing issues, strategy and the division of labor, and Therese, though now focused largely on product, acts as a trusted advisor.",
    "Asked about the preparations he made before taking on the role of CEO, Huffman described the process as one of osmosis, rather than crash course. He learned by watching on from the side-lines over a number of years; after all, “there is no school for CEOs,” he reminded us.",
    "Like many successful companies, BlackLine is founded on a problem that was once impossible to solve: the substantiation (or reconciliation) of a balance sheet account.",
    "In short, a customer of Tucker’s then startup (which at the time had an entirely different focus) was complaining of their inability to verify the figures on their balance sheet by cross-checking with the various records of incomings and outgoings.",
    "With an objective hat on, even Huffman might agree there are companies founded on sexier problems than this, but the scale of opportunity for a business that could find a workable solution was massive.",
    "“There’s a tremendous amount of manual work that goes on in accounting, specifically the processes involved in closing the books for an institution that provides audited financials,” Huffman explained.",
    "“We view ourselves as a business that is modernizing the manual accounting processes that are no longer sustainable.”",
    "In its modern form, BlackLine operates in three areas - financial close automation, accounts receivable automation and inter-company governance - and services some of the world’s largest multinationals. Indeed, the larger the company, the greater the accounting complexity and more pressing the need for a platform to make sense of it.",
    "The common line among companies in the automation space is that reducing the quantity of manual labor will free up employees to deliver value in different ways, although the messaging is rarely more specific than this.",
    "Pressed on what this concept looks like specifically in an accounting context, Huffman suggested there is greater scope for creativity in accounting than most people realize.",
    "“By automating a task, what you’re essentially doing is freeing up time and capacity,” he explained. “CFOs and financial controllers are always trying to drive towards strategic initiatives, but are always shy of the necessary resources.”",
    "“We help people take all the manual work that’s done over and over again, automate it through rules, and turn those people loose as excess capacity so they can do the valuable work controllers really want done.”",
    "The specifics of this “valuable work” vary on a case-by-case basis, says Huffman; sometimes it’s about improving operational efficiency, sometimes about minimizing the risk of severe accounting deficiencies or fines relating to failures of compliance.",
    "With more and more businesses now coming around to the merits of automation, it is Huffman’s job to make sure BlackLine is ready to capitalize.",
    "So far, Huffman has acted exclusively as a pandemic CEO. While the effects of the crisis will reverberate for some time yet, soon enough he will have to reckon with a different set of expectations from the board and the company’s shareholders.",
    "Asked how he deals with these pressures, Huffman laughed and spun his webcam to face a well-stocked bar in the corner of the room. A brisk drink or two aside, he says it’s really about having a tight focus on the immediate next steps for the company.",
    "In the coming months, Huffman says his main objective is to continue to augment the company’s technology platform and identify areas of the business that might benefit from an injection of cash. Luckily for him, BlackLine recently raised an additional $1 billion, so he has plenty to play with.",
    "“As I look forward, I’m looking at our operations today and asking where they need to be in the next 24 months,” he said. “And also asking what we might use our balance sheet to acquire, to make sure our team is able to successfully solve the challenges of our customers: financial controllers.”",
    "According to Huffman, although the pandemic was “a frightening period” for business owners and executives, it was also “an opportunity to grow stronger”. Riding the post-pandemic surge and new enthusiasm for automation technologies, Huffman hopes to turn BlackLine into a billion-dollar turnover business, almost triple its current size."
  ],
  "headers": {
    "6": "Necessity, the mother of invention",
    "18": "Big shoes to fill",
    "26": "Making accounting sexy",
    "38": "An eye to the future"
  },
  "links": {
    "accounting software": "https://www.techradar.com/best/accounting-software-small-business",
    "ERP": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "raised an additional $1 billion": "https://www.globenewswire.com/en/news-release/2021/03/09/2189935/0/en/BlackLine-Inc-Announces-Proposed-Private-Offering-of-1-Billion-of-Convertible-Senior-Notes.html"
  }
}