{
  "source": "https://www.techradar.com/news/this-new-alexa-feature-instils-some-patience-in-your-smart-home-device",
  "title": "This new Alexa feature instills some patience in your smart home device",
  "category": "smart-home",
  "updated": "2021-10-06T11:43:47Z",
  "author": "rhys-wood",
  "summary": "Alexa takes its foot off the gas",
  "article": [
    "Love asking Alexa questions, but frustrated by the precious little time you have to ask them before your voice assistant cuts you off? This latest Alexa feature could be one of the most important if you regularly make use of devices like the Amazon Echo or Echo Studio.",
    "The new feature grants you more time to present questions or statements to Alexa, The Verge reported, letting you take your time articulating what you want to say, or perhaps even ask long-form, complex questions to your smart home device.",
    "Another positive feature being added to the Android version of the Alexa app is the ability to type requests to your voice assistant, great for users who may not want (or are unable) to use their voice in the moment. It's a feature that's been usable on the iOS version of the Alexa app since late 2020, and it's finally rolling out to Android users in the US first. Hopefully a global rollout will follow shortly.",
    "The ability to enable longer statement times seems to be off by default in the Alexa app, so users will need to switch it on if they want to make use of this handy setting. To do so, simply head into 'Device Settings' in your Alexa smartphone app and select your desired Alexa-compatible device.",
    "As for the ability to type statements and questions in the Alexa app, both Siri and Google Assistant, as well as Microsoft's Cortana, have all had this feature for a while, so it's nice to see Alexa finally catching up to the competition in this regard.",
    "The new features are especially refreshing to see from Alexa, where some recent updates have come across as fairly superfluous, such as adding celebrity voices – a novel feature that ultimately does little to heighten the smart home device's accessibility.",
    "More accessibility options with smart home devices is always a good thing, and granting users more time to posit questions and statements to Alexa achieves a whole lot more than you might think.",
    "This could be an invaluable feature for users with speech impediments who might need the extra time to articulate. Plus, it grants more time in general to more naturally talk to Alexa, without feeling forced to present statements in a more rushed, truncated format.",
    "It's curious as to why Amazon has waited until now to add a typing feature to the Android version of the Alexa app, though it's fair to assume that because Alexa is generally tailored for home usage, the option to type requests to Alexa probably wasn't priority one for the development team at Amazon."
  ],
  "headers": {
    "6": "Analysis: accessibility and Alexa"
  },
  "links": {
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "The Verge": "https://www.theverge.com/2021/10/5/22711570/amazon-alexa-more-time-to-speak-type-question-android",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "Siri": "https://www.techradar.com/how-to/how-to-use-siri",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Cortana": "https://www.techradar.com/news/phone-and-communications/mobile-phones/cortana-everything-you-need-to-know-about-microsoft-s-siri-rival-1183607",
    "adding celebrity voices": "https://www.techradar.com/news/alexa-adds-two-celebrity-voices-to-its-lineup-but-wed-love-to-see-more"
  }
}