{
  "source": "https://www.techradar.com/news/5g-coverage-requires-focusing-on-tangible-benefits",
  "title": "5G coverage requires focusing on tangible benefits",
  "category": "computing",
  "updated": "2021-08-05T14:06:33Z",
  "author": "paul-carter",
  "summary": "5G and possible challenges that remain",
  "article": [
    "The UK’s deployment of 5G continues to gather pace, with mobile providers offering the enhanced service to devices across a growing number of locations. Yet, despite increasingly frequent announcements from operators of new locations being served with 5G, the deployment process is still very much a misunderstood entity – by consumers, businesses, and media alike. The benefits of 5G are often presented in an unhelpfully narrow manner leading to, at best, an underestimation of what 5G technology could enable or, at worst, public resentment of the vital infrastructure required to make these benefits a reality.",
    "The priority for operators, the government and thought leaders should be as much a focus on educating and preparing the public on what is required to make 5G and its advanced features commonplace, as it is on the technological steps required to bring about coverage across the UK.",
    "Though the rollout is far from complete, 5G in the UK is already delivering a marked improvement for consumers, which could be used to justify policies and regulatory changes that will speed up the deployment process. The most recent testing conducted by GWS found that each of the UK’s major mobile network providers, EE, O2, Three and Vodaphone, are all making substantial progress in rolling out 5G. 5G at the time of testing was available across nearly 40% of the markets driven; in addition, throughput testing shows average speeds boosted nearly five times in areas where 5G is available.",
    "To put the above into perspective, the data demonstrated how once a market reaches a certain level of 5G coverage, average network speeds are significantly boosted. Average speeds during network capacity stress tests where 5G is delivered are 150 Mbps across all operators, compared with 33 Mbps in areas where there is no 5G present.",
    "So whilst 5G may not yet be available in various cities and towns, in all the areas where it has been deployed there are tangible, positive benefits for the consumer in terms of performance. Despite this, resistance to more imposing electronic communications infrastructure can be found at the local level up and down the UK; stories of 5G related infrastructure being blocked in local authorities are becoming ever more common. This resistance should be taken seriously, and a concerted effort is needed to convince a wary public that 5G will be hugely beneficial to UK consumers and businesses.",
    "As a starting point, operators and key stakeholders should take the lead in outlining the procedure of deployment to improve understanding of 5G and quell misinformation. Given the level of anticipation and expectation around 5G, coupled with a certain degree of hype, the feeling for many consumers will perhaps be that 5G is not being rolled out quickly enough. There has also been a lack of clarity for consumers as to what exactly 5G is, what the key benefits are and how it could actually transform people’s lives, which has led to further confusion and complications at the important initial phase of rollout.",
    "Realistically, it’s unlikely that 5G networks could have been deployed much faster than the current pace across the UK. Rolling out a new transitional technology of this scale and integrating it with existing national network infrastructure requires significant capital investment and resources from operators, not to mention the involvement of local and national regulators and other government agencies. It’s also as much about 5G devices being made available, and the longer-term goal of new commercial services and innovations being introduced, as it is the network itself. 5G represents a step-change in terms of what’s possible via a wireless network, but the journey towards 5G connectivity isn’t going to happen overnight.",
    "The UK is currently progressing towards a full stand alone 5G network which ultimately will unlock the significant commercial innovations promised by its advocates, but for now 5G has been deployed alongside 4G – integrated with but, for the most part, not yet independent. Whilst operators such as Vodaphone are taking steps to provide a new core for a standalone 5G network, this process is very much in its infancy.",
    "The conversation surrounding 5G deployment requires proactive and positive argument to be made in its favor. Continued misinformation resulting in or combined with local level resistance against electronic communications infrastructure is problematic for operators. Luckily, customer expectations about network reliability and performance remain constant – they want a network that they can rely on that will deliver the services they need. Harnessing this desire for reliable, robust connectivity must be used to justify the infrastructure investment which will bring about these benefits. 5G is already delivering what consumers want: better connectivity. This fact should not be forgotten, even if the road to widespread and stand alone 5G is a long one."
  ],
  "headers": {
    "2": "The tangible benefits of 5G are on the horizon",
    "5": "Consumers and businesses must feel empowered by 5G"
  },
  "links": {
    "5G": "https://www.techradar.com/best/best-5g-phones",
    "mobile": "https://www.techradar.com/deals/mobile-phone-deals",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "network": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools"
  }
}