{
  "source": "https://www.techradar.com/news/disney-plus-boss-weighs-in-on-the-chances-of-a-cheaper-ad-supported-tier",
  "title": "Disney Plus boss weighs in on the chances of a cheaper ad-supported tier",
  "category": "entertainment",
  "updated": "2021-06-15T11:39:37.806Z",
  "author": "axel-metz",
  "summary": "No ads… for now",
  "article": [
    "Disney CEO Bob Chapek has responded to questions surrounding the potential introduction of advertisements on Disney Plus – and things don’t look to be changing any time soon.",
    "Speaking at a Q&A session with Credit Suisse, Chapek spoke of the company’s satisfaction with the streamer’s current subscription model, and dismissed suggestions that a cheaper, ad-supported tier of Disney Plus would arrive in the near future.",
    "Chapek’s comments come as HBO recently released a more affordable subscription package for its HBO Max service, joining the likes of Paramount Plus, Disney's own Hulu and Peacock, which also offer ad-supported tiers.",
    "When asked whether ads might ever find their way onto Disney Plus, Chapek said: “we won’t limit ourselves and say no to anything, but right now we have no such plans for that.”",
    "“We’re always reevaluating how we go-to-market across the world, but [...] we’re happy with the models that we’ve got,” the Disney boss added.",
    "At $11.99 / £7.99 / AU$11.99 per month, the streaming service is already one of the cheaper options on the market right now – for comparison, HBO Max’s standard tier costs $14.99 per month, while its recently-introduced cheaper tier brings that price down to $9.99.",
    "Disney Plus is also providing a sizable chunk of the entertainment giant’s revenue, which doesn’t suggest a need to change a winning formula.",
    "“40% of our sales this year were actually in streaming and digital,” Chapek said, “which I think speaks to the nature of how this business is rapidly changing, and obviously we’re well positioned to do that as the business continues to evolve.”",
    "The streamer hasn’t wanted for quality content of late, either. The arrival of original Marvel shows like Loki and movies with concurrent theatrical releases like Cruella have ensured Disney Plus has maintained its sense of exclusivity two years on from its initial launch in 2019.",
    "The company’s release of the Star catalogue outside the US, too, only adds to the streamer’s future prospects, and suggests Disney Plus could, one day, challenge Netflix for the top spot on the streaming shelf.",
    "With all that being said, then, it’s unlikely that Disney Plus will see a shake-up of its subscription model anytime soon. The quality content is arriving thick and fast, and the company’s balance sheet is looking better and better as the streamer’s library continues to grow.",
    "It’s worth noting that Chapek did reiterate that Disney wouldn’t “say no to anything” – but we’re betting the House of Mouse is pretty happy with how things are going right now."
  ],
  "headers": {
    "6": "If it ain't broke..."
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Q&A session": "https://thewaltdisneycompany.com/the-walt-disney-company-at-the-credit-suisse-23rd-annual-communications-conference/",
    "recently released": "https://www.techradar.com/news/hbo-max-launches-cheaper-ad-supported-subscription-tier",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Hulu": "https://www.techradar.com/deals/hulu-plans-prices-deals-subscription-packages-cost-sign-up",
    "Peacock": "https://www.techradar.com/news/peacock-tv-how-to-watch-for-free-cost-devices-shows-movies-and-more",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Cruella": "https://www.techradar.com/news/cruella-is-the-best-disney-movie-reboot-for-years"
  }
}