{
  "source": "https://www.techradar.com/news/seventy-pounds-for-final-fantasy-vii-on-pc-is-too-high-a-price",
  "title": "The Final Fantasy VII Remake on PC is far too expensive",
  "category": "computing",
  "updated": "2021-12-10T13:48:06Z",
  "author": "daryl-baxter",
  "summary": "Opinion: Living in a materia world",
  "article": [
    "There comes a time where the principal in paying for a game overtakes your hype for the game.",
    "That happened with Final Fantasy VII Remake: Intergrade coming to PC. This is the enhanced port that came out earlier this year, and it was announced during The Game Awards last night. While I woke up with glee that it was finally confirmed, it quickly turned to disbelief once I discovered the price.",
    "While Final Fantasy VIII will always be my favorite entry in the series, I was caught up in the hype of the remake of Final Fantasy VII when it was first announced in 2015.",
    "The cheers at the Sony conference at E3 that year, alongside Shenmue 3 and The Last Guardian being showcased, made me excited for Final Fantasy again. But at a price of $70 / £70 for the PC version that has been leaked by the Epic Games Store, I'm waiting for the sale.",
    "It's been six years between the announcement of the remake at E3 and the PC port finally being made official.",
    "While it was first released on PS4 in 2020 to great reviews, I was still holding out for it to either arrive on Game Pass or another storefront on PC eventually.",
    "It took longer than I expected, but as soon as I saw the news, a wave of disappointment came crashing down around me.",
    "On Amazon, you can buy the PS4 version for $35 / £25 right now, or the PS5 version that includes Intergrade for $58 / £40.",
    "If you own the PS4 version but have a PS5, you can upgrade for free, but the DLC featuring Yuffie costs $19.99 / $14.99.",
    "This still equals to roughly $55 / £40 for the same package as what's being offered for the upcoming PC port.",
    "Final Fantasy VII REMAKE: Intergrade can be wishlisted on the Epic Games Store for now, but the price looks to be $70 / £75 when it releases on December 16.",
    "We've reached out to Square Enix for comment as to why the price is so high, but it feels like a slap in the face for nostalgia and fans of Final Fantasy VII.",
    "This is especially the case when Epic co-founder and CEO Tim Sweeney stated in an interview, that the games offered on the Store would be cheaper than anywhere else.",
    "There are many people out there who hold this particular entry of Final Fantasy close to their hearts. It's helped define careers and friendships since its release in 1997, with the story still talked about today through written media, podcasts, videos and more.",
    "Paying almost double the price for the same game on PS4, on PC, especially when the original game from 24 years ago can be bought on Steam for $9.99 / £9.99, is a real shame.",
    "I don't have a PlayStation so I can't play it anyway. But with this price, and for a game that's essentially part one of three, I'd rather wait for the eventual sale and play the original in the meantime."
  ],
  "headers": {
    "4": "A high price for Cloud gaming",
    "11": "Nostalgia at a high gil"
  },
  "links": {
    "enhanced port": "https://www.techradar.com/news/final-fantasy-7-remake-ps5-upgrade-brings-new-story-content-and-visual-upgrades",
    "Game Awards": "https://www.techradar.com/news/the-game-awards-2021-the-biggest-announcements-and-reveals",
    "great reviews": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "$35": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFINAL-FANTASY-VII-REMAKE-playstation-4%2Fdp%2FB07SV4S75P%2Fref%3Dsr_1_2%3Fkeywords%3Dff7%2Bremake%26qid%3D1639136058%26sr%3D8-2%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1248095316389198000-20",
    "£25": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FFINAL-FANTASY-VII-REMAKE-PS4%2Fdp%2FB07SV4S75P%2Fref%3Dsr_1_3%3Fkeywords%3Dff7%26qid%3D1639136024%26sr%3D8-3%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1159120842456914400-21",
    "$58": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFINAL-FANTASY-REMAKE-INTERGRADE-playstation-5%2Fdp%2FB08XRNCFZX%2Fref%3Dsr_1_4%3Fkeywords%3Dff7%2Bremake%26qid%3D1639136084%26sr%3D8-4%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1293755514815114000-20",
    "£40": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FFINAL-FANTASY-VII-REMAKE-INTERGRADE%2Fdp%2FB08XRNCFZX%2Fref%3Dsr_1_2%3Fkeywords%3Dff7%26qid%3D1639136105%26sr%3D8-2%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-4494418191210950000-21",
    "can be wishlisted on the Epic Games Store": "https://www.epicgames.com/store/en-US/p/final-fantasy-vii-remake-intergrade",
    "stated in an interview,": "https://arstechnica.com/gaming/2019/03/epic-ceo-youre-going-to-see-lower-prices-on-epic-games-store/",
    "Steam": "https://store.steampowered.com/app/39140/FINAL_FANTASY_VII/"
  }
}