{
  "source": "https://www.techradar.com/news/windows-10x-leak-shows-us-microsofts-os-in-all-its-glory-but-with-some-apparent-disappointments",
  "title": "Windows 10X leak shows us Microsoft’s OS in all its glory – but with some apparent disappointments",
  "category": "computing",
  "updated": "2021-01-14T14:26:41Z",
  "author": "darren-allan",
  "summary": "Check out a purportedly near-final build of the lightweight OS in this video clip",
  "article": [
    "What’s apparently a near-final build of Windows 10X for single-screen laptops – the initial incarnation the operating system is arriving in – has been leaked, and it’s looking nicely polished on the whole. Although that said, there are some aspects highlighted here (and rumors seemingly proved right) which will doubtless disappoint some…",
    "Zac Bowden over at Windows Central took the pre-release build of the OS for a spin, presenting the results in an 8-minute video which is well worth a watch.",
    "Windows 10X, for the uninitiated, is a stripped-back and lightweight version of Microsoft’s desktop operating system, so as you might expect, the interface is much more minimalist than the Windows 10 we know.",
    "As you can see in Bowden’s video below, the Start menu is now a centred panel (as opposed to being over on the left) and it’s a simplified list of installed apps (and websites), with recently used files and applications listed below, and a web search box on top. Gone are the live tiles and other complications seen in Windows 10, replaced by something more akin to the streamlined launcher system Chromebooks employ.",
    "Similarly, the taskbar icons (for running or pinned apps) are now centred (instead of left-aligned). The system tray over on the right has been cut back to just the barest of info and clock/date, with other icons shifted to a new Quick Settings panel, which nestles beneath the Notifications panel in what is the new Action Center (which also boasts a handy music playback control panel).",
    "The Quick Settings panel, as the name suggests, allows for quick access to commonly used settings, such as Bluetooth devices for example. It also provides some convenient touches like a volume and display brightness slider.",
    "It’s worth noting that there are some neat touches on the animation front with Windows 10X, such as when you click on an app in the taskbar to open it, the icon presses in slightly to acknowledge the click (while you wait for the program to open). This avoids scenarios where you’re not sure whether your click actually registered or not.",
    "File Explorer has also been simplified, and is very basic indeed now, just offering a straightforward method of accessing files with no trimmings. Note that OneDrive integration is a big thing here: everything is synced to the cloud, with the only exception being the Downloads folder. Also, you must sign into a Microsoft Account – there’s no getting round that with Windows 10X, with local accounts being ditched. All this could be pain points for some folks, that’s for sure…",
    "Another potential one of those is the fact that apps only run full-screen, which is a reflection of the fact that the initial incarnation of Windows 10X is designed to run on low-cost and low-power single-screen laptops – that will likely change down the line, though. You can still snap two apps together in a side-by-side view, though, so there’s a basic level of multitasking here – but the sort of machines that Windows 10X will be shipped on initially won’t be capable of handling major multitasking anyway.",
    "Furthermore, as is made clear in the video clip, Windows 10X doesn’t support traditional Windows apps (Win32 applications), at least not at launch, meaning you’ll be limited to universal (UWP) and web apps. We’ve heard this before, and the hope is that the functionality to run Win32 apps will be introduced before too long – but possibly not until 2022 going by the rumor mill.",
    "The sweetener is that here, it looks like the implementation of web apps is pretty slick, as Bowden illustrates with Spotify."
  ],
  "headers": {
    "7": "Basic Explorer"
  },
  "links": {
    "Windows 10X": "https://www.techradar.com/news/windows-10x",
    "Windows Central": "https://www.windowscentral.com/hands-windows-10x-single-screen-pcs",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "File Explorer has also been simplified": "https://www.techradar.com/news/windows-10x-has-a-new-file-explorer-and-this-is-what-it-looks-like",
    "We’ve heard this before": "https://www.techradar.com/news/windows-10x-could-be-ready-by-december-but-without-an-important-feature",
    "until 2022 going by the rumor mill": "https://www.techradar.com/news/windows-10x-could-launch-early-next-year"
  }
}