{
  "source": "https://www.techradar.com/news/apple-watch-6-is-getting-a-limited-black-unity-edition",
  "title": "Apple Watch 6 is getting a limited Black Unity edition",
  "category": "wearables",
  "updated": "2021-01-26T15:53:09Z",
  "author": "james-rogerson",
  "summary": "Available for Black History Month",
  "article": [
    "If you’re in the market for an Apple Watch 6, you’re about to have an additional strap design option, as from February 1 Apple will be selling the Apple Watch 6 Black Unity, which is a limited-edition model designed to celebrate Black History Month.",
    "It comes with a red, black, and green band that’s reminiscent of the Pan-African flag, and it has a watch face to match – one which Apple says creates an ever-changing pattern that dynamically shifts as the watch moves. The band also has ‘Truth. Power. Solidarity.’ laser-engraved onto the interior of the fastening pin.",
    "The Apple Watch 6 Black Unity will only be available during February, and it’s set to start at $399, or $499 if you want cellular connectivity. Pricing for other regions hasn’t been confirmed at the time of writing, but those are the standard starting prices for the aluminum Apple Watch 6, so presumably it would cost the same as that elsewhere, meaning £379 / AU$599, or £479 / AU$749 for a cellular model.",
    "Indeed, strap and watch face aside, this looks to be a standard Apple Watch 6, and if you already have an Apple Watch 6 or don’t get round to buying one before the end of February, you don’t have to be left out, as the watch face will be available to all Apple Watch users as part of the watchOS 7.3 update landing today (January 26).",
    "The strap meanwhile will also be sold separately for the rest of the year, for $49 (likely £49 / AU$69 based on other Apple Watch strap prices).",
    "With this launch, Apple is supporting Black Lives Matter, the European Network Against Racism, the International Institute on Race, Equality and Human Rights, the Leadership Conference Education Fund, the NAACP Legal Defense and Education Fund, and Souls Grown Deep.",
    "And this is just one of many things Apple is doing to celebrate Black History Month. The company is also highlighting Black artists and movements through Apple Music, Black-owned businesses, developers, and apps through the App Store, and doing similar with Apple Podcasts, Books, News, and TV."
  ],
  "headers": {
    "3": "Available for everyone"
  },
  "links": {
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review"
  }
}