{
  "source": "https://www.techradar.com/news/heres-why-oppos-upcoming-foldable-phone-could-be-a-real-samsung-galaxy-z-fold-rival",
  "title": "Here's why Oppo's upcoming foldable phone could be a real Samsung Galaxy Z Fold rival",
  "category": "phones",
  "updated": "2021-12-05T11:00:40Z",
  "author": "tom-bedford",
  "summary": "It's called the Oppo Find N",
  "article": [
    "Although the biggest name in foldable phones is arguably Samsung, with its top-spec Galaxy Z Fold 3 being its most recent top-end bending handset, a rival device from Oppo might take the top spot soon.",
    "We've heard rumors about the Oppo Find N for a while now, though that name isn't official. Judging by its rumors and specs, it sounds like this could be a contender for the top entry in our list of the best foldable phones – and some rumors claim it could launch very, very soon.",
    "Rumors point to the Oppo Find N having a screen between 7.8 and 8 inches across when it's unfolded. The main display will apparently have a 120Hz refresh rate, though the outer one is said to be stuck at 60Hz.",
    "It's also believed there will be three rear cameras, including a 50MP main one and also a 32MP selfie snapper.",
    "Additionally, the phone is expected to use the Snapdragon 888 chipset, have a 4,500mAh battery, and charge at 65W.",
    "But when could we see the thing? Well, one source thinks it'll get launched by the end of December. Oppo is hosting its annual Inno Day on December 14 and that could be when we see the device.",
    "The specs to the Oppo Find N seem decent but we don't know enough to get too excited just yet – and those specs alone aren't enough to call the phone a decent Galaxy Z Fold rival.",
    "What's more promising is the name behind the foldable: Oppo. The company has a legacy of making phones with great displays and cameras, and it's that advantage that the Find N could have over other foldable rivals.",
    "For example, the Find X3 Pro had a \"Full-Path Color Management System\" which basically avoids compression ruining the look of streaming videos and makes them look better. Features like that could give the Find N an edge for viewing media.",
    "Plus, Oppo often has an edge over its rivals when it comes to its cameras. Oppo worked with Sony to create a bespoke main camera sensor for the Reno 5, which also ended in in the X3 Pro, and took vibrant pictures.",
    "We don't know enough about the phone's display or camera features, but judging by Oppo's reputation and past phones, we're looking forward to the Find N already.",
    "We'll certainly be tuning into the Oppo Find N launch when it happens so we can see if this really is the game-changing foldable phone to rival Samsung's alternatives."
  ],
  "headers": {
    "2": "What we know about the Oppo foldable phone",
    "6": "What we don't know about the Oppo foldable"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "best foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Reno 5": "https://www.techradar.com/news/oppo-reno-5"
  }
}