{
  "source": "https://www.techradar.com/news/gta-trilogy-releases-in-november-will-launch-day-one-on-xbox-game-pass",
  "title": "GTA Trilogy remaster releases in November - and the improvements are huge",
  "category": "gaming",
  "updated": "2021-10-22T13:30:03Z",
  "author": "rhys-wood",
  "summary": "Months of speculation have been put to rest",
  "article": [
    "The GTA Trilogy, better known as Grand Theft Auto: The Trilogy - The Definitive Edition (good lord, that's a mouthful), finally has a release date, putting an end to the months of speculation on whether the remasters even exist, and when we'll get to play them.",
    "Packing in remastered versions of Grand Theft Auto 3, as well as its much-lauded follow-ups Vice City and San Andreas, this definitive re-release will be out digitally, worldwide, on November 11, 2021 for PS4, PS5, Xbox One, Xbox Series X/S, Nintendo Switch and PC, with a physical release scheduled for Xbox Series X/S and Xbox One, Nintendo Switch, and PS4 on December 7",
    "Additionally, arguably the best game of the trilogy, Grand Theft Auto: San Andreas - The Definitive Edition, is coming to Xbox Game Pass on day one. The two prequels, however, don't appear to be sharing this advantage on Microsoft's console. However, Grand Theft Auto 3 - The Definitive Edition is coming to the PlayStation Now subscription service on December 7.",
    "Each game in the trilogy has been remastered in the Unreal Engine, and features all-new lighting and higher resolution textures, increased draw distances, allowing us to see even more of the map at a glance than what was possible on the original PS2 hardware.",
    "Additionally, all three games have revamped controls, bringing them more in line with GTA 5. Specifically, movement, camera and targeting controls have been overhauled, which should make them more playable than ever and more palatable to modern audiences who may not yet have played these groundbreaking first 3D outings.",
    "Radial menus for radio stations and weapon selection are also being added, which is a huge boon to those of us who used to get frustrated cycling through them in a drawn-out fashion. An updated minimap is also featured, allowing players to even set waypoints for easier navigation through each game's vast cities.",
    "We were surprised to learn, originally, that the trilogy was rumored to be coming to Nintendo Switch. That's now been confirmed, too, and this version even features exclusive features like touch screen and gyroscopic controls, likely to help aiming to feel more fluid.",
    "Check out the trailer below:",
    "We're really quite impressed with the seemingly high quality of the GTA Trilogy remaster. While we did expect upscaling and cleaned-up textures, other quality of life additions such as improved controls, draw distance and bespoke motion controls on the Switch version were beyond our predictions, so credit where it's due in that regard.",
    "However, we feel some will turn their nose up at the price of the trilogy. At $59.99 / £54.99, you're essentially paying a full price, modern release's worth for three, decades-old games. And while it's true more effort has gone into the remasters than we initially thought would happen, 60 bucks is a little steep for three games we've played countless times before.",
    "Some of that edge is at least being taken off by the arrivals of San Andreas and GTA 3 to Xbox Game Pass and PS Now respectively. Xbox Game Pass members are getting the better deal here, with San Andreas being the bigger and better game overall, but there's value in both of these inclusions."
  ],
  "headers": {
    "8": "Analysis: A port of surprising quality?"
  },
  "links": {
    "GTA Trilogy": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "Grand Theft Auto 3": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Grand Theft Auto: San Andreas": "https://www.techradar.com/news/gta-san-andreas-remastered-5-things-we-want-to-see",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review"
  }
}