{
  "source": "https://www.techradar.com/news/even-nonprofit-websites-are-riddled-with-user-trackers",
  "title": "Even nonprofit websites are riddled with user trackers",
  "category": "computing",
  "updated": "2021-10-22T19:00:28Z",
  "author": "anthony-spadafora",
  "summary": "Just as businesses do, nonprofits also use third-party cookies and other tools to collect data on their users",
  "article": [
    "Businesses often track users online without their knowledge using third-party cookies but a new report from The Markup has revealed that even nonprofits often do so as well.",
    "By using its Blacklight tool, the news outlet scanned over 23,000 nonprofit websites to discover that around 86 percent of the sites in question use third-party cookies or tracking network requests to collect data on their users. The Markup also surveyed the top 80,000 websites last year to reveal that 87 percent use some type of third-party tracking.",
    "Of the 23,856 nonprofit websites scanned as part of its latest investigation, the news outlet found that about 11 percent contained a Facebook pixel embedded on their sites while 18 percent used the Google Analytics “Remarketing Audiences” feature.",
    "Additionally, The Markup found that 439 of the nonprofit websites it analyzed loaded scripts called session recorders that have the ability to monitor the clicks and keystrokes of site visitors.",
    "Of the nonprofits analyzed, the website of Planned Parenthood, which many in the US rely on for access to contraceptives, abortions, sex education and other personal health issues, was one of the most concerning due to the amount of trackers its site contained.",
    "The Markup found a total of 28 ad trackers and 40 third-party cookies tracking visitors on the nonprofit's site after running it through its Blacklight tool. However, there were also session records as well as trackers from both Facebook and Google.",
    "Further investigation revealed that Planned Parenthood's site communicates with a number of for-profit companies including Oracle, Verizon, LiveRamp, TowerData and Quantcast. While the company's VP for digital products Katie Skibinski told the news outlet that it only collects data for internal purposes and doesn't sell any of the data it collects, the number of trackers is still concerning due to the nature of the information site visitors may share with the organization.",
    "While you can use an anonymous browser to further protect yourself from unwanted tracking online, using a VPN service when navigating to the sites of nonprofits and other businesses will prevent them from knowing your real location which will help preserve your privacy further.",
    "Via The Markup"
  ],
  "headers": {
    "4": "Unwanted tracking online"
  },
  "links": {
    "third-party cookies": "https://www.techradar.com/news/adobe-wants-to-help-businesses-survive-the-death-of-third-party-cookies",
    "new report": "https://themarkup.org/blacklight/2021/10/21/nonprofit-websites-are-riddled-with-ad-trackers",
    "Blacklight tool": "https://themarkup.org/blacklight",
    "top 80,000 websites": "https://themarkup.org/blacklight/2020/09/22/blacklight-tracking-advertisers-digital-privacy-sensitive-websites",
    "Facebook pixel": "https://www.techradar.com/news/you-can-now-stop-facebook-following-you-around-the-web-sort-of",
    "Google Analytics": "https://www.techradar.com/reviews/google-seo-tools",
    "keystrokes": "https://www.techradar.com/news/world-of-tech/the-way-you-type-is-as-unique-as-your-fingerprint-1300758",
    "ad trackers": "https://www.techradar.com/news/ad-trackers-arent-just-a-privacy-threat-they-can-double-page-load-times",
    "anonymous browser": "https://www.techradar.com/best/anonymous-browsing",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "The Markup": "https://themarkup.org/blacklight/2021/10/21/nonprofit-websites-are-riddled-with-ad-trackers"
  }
}