{
  "source": "https://www.techradar.com/news/fresh-canon-eos-r7-rumors-suggest-affordable-rf-cameras-are-en-route",
  "title": "Fresh Canon EOS R7 rumors suggest affordable RF cameras are en route",
  "category": "cameras",
  "updated": "2021-09-30T09:44:53Z",
  "author": "mark-wilson",
  "summary": "Smaller, cheaper Canon RF cameras are likely in the pipeline",
  "article": [
    "Now that Canon has finally launched its Canon EOS R3 powerhouse, it seems the camera giant may now be taking pity on our bank accounts and switching its attention to the more affordable RF cameras – including the long-awaited Canon EOS R7.",
    "The ever-reliable Nokishita has spotted that two new unreleased cameras have been registered with what appear to be Russian certification bodies. This doesn't usually point to an imminent launch, but suggests that the products are in the pipeline for 2022.",
    "The certifications sadly don't contain any specific info like Wi-Fi radios that could hint at what kind of cameras Canon has in store, but separate speculation from Canon Rumors has given more credence to the idea that APS-C RF bodies are en route.",
    "Canon Rumors says that it's \"now been told by a good source that Canon will definitely be bringing an APS-C RF mount camera equipped with a backside-illuminated sensor in the second half of 2022\".",
    "This APS-C sensor, which is expected to have a resolution between 28MP-32MP, will apparently be backside-illuminated and \"appear in more than one camera\". It's not clear whether or not these rumors are linked to the registrations spotted by Nokishita, but given those two leaked models have similar product codes ('DS126841' and 'DS126842') it certainly seems a possibility.",
    "The arrival of a Canon RF camera, like the rumored Canon EOS R7, would be significant for two reasons. Firstly, all current RF bodies have larger full-frame sensors, which means they're aimed at advanced shooters. Cameras with APS-C sensors are generally more affordable and designed for hobbyists. And secondly, it would mean the end of Canon's current EOS-M system, which have an older EF-M mount that was spun off from its DSLRs.",
    "Back in June, we saw rumors that Canon is preparing to launch as many as three RF cameras with APS-C sensors, including the Canon EOS R7, a vlogger-friendly version called the Canon EOS R8, and an entry-level body called the Canon EOS R9. If true, it might be a while until we see all of those arrive, but these latest scraps of evidence do suggest that 2022 could be the year of more affordable Canon RF cameras.",
    "There has been no official confirmation that Canon is working on RF-mount cameras with APS-C sensor, but the evidence is certainly growing that this could be the case.",
    "Firstly, Canon Rumors has a pretty good track record with information that comes from its \"known sources\", and it's been pretty unequivocal that Canon will \"definitely\" be launching an APS-C RF mount camera next year.",
    "But there has also recently been a lot of indirect evidence pointing towards the same conclusion. Canon recently launched two affordable RF-mount lenses and was keen to stress that one of them, the Canon RF 16mm f/2.8 STM ($299 / £319 / AU$549), converts to a very useful 25.6mm focal length when used in APS-C crop mode.",
    "The launch of the disappointing Canon EOS M50 Mark II back in October 2020 also appeared to signal that Canon was shifting its focus away from its EOS M line (which also have APS-C sensors). That camera was a barely reheated version of its predecessor, and felt very much like a placeholder while Canon concentrated on its newer RF mount.",
    "In the past couple of years, Canon has focused on making its RF bodies and lenses a comfortable home for professionals, particularly those looking to switch from older DSLRs. But while the hobbyist camera market has shrunk in recent years, photographers and vloggers would certainly be keen to see more affordable mirrorless options from the camera giant.",
    "The only question is exactly how soon RF-mount cameras with APS-C sensors will arrive. The two registered cameras spotted by Nokishita are prime candidates for the launches that Canon Rumors has predicted for January 2022 and March/April 2022, but the first APS-C RF camera isn't expected until the second half of 2022. Either way, it could be worth the wait for those who've been waiting for sub-$1,000/£1,000 Canon RF cameras."
  ],
  "headers": {
    "7": "Analysis: Evidence grows Canon RF cameras with APS-C sensors"
  },
  "links": {
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Canon EOS R7": "https://www.techradar.com/news/canon-eos-r7",
    "Nokishita": "https://twitter.com/nokishita_c/status/1442610061763747848",
    "Canon Rumors": "https://www.canonrumors.com/a-bsi-aps-c-eos-r-camera-is-coming-in-the-second-half-of-2022-cr2/",
    "three RF cameras with APS-C sensors": "https://www.techradar.com/news/canon-eos-r7-and-eos-r8-rumors-hint-at-the-end-for-eos-m-mirrorless-cameras",
    "two affordable RF-mount lenses": "https://www.techradar.com/news/canons-super-affordable-new-rf-lenses-will-be-popular-for-different-reasons",
    "Canon EOS M50 Mark II": "https://www.techradar.com/reviews/canon-eos-m50-mark-ii"
  }
}