{
  "source": "https://www.techradar.com/news/e-bikes-take-the-sweat-out-of-cycling-but-they-have-a-serious-weight-problem",
  "title": "E-bikes take the sweat out of cycling, but they have a serious weight problem",
  "category": "fitness",
  "updated": "2021-08-06T13:08:17Z",
  "author": "cat-ellis",
  "summary": "E-bikes can be a drag, but it doesn't have to be that way",
  "article": [
    "Pure Electric (best known for its electric scooters, including our current top-rated model, the Pure Air Pro) has launched its first e-bike, the Pure Flux One. It's is one of the lightest and cheapest available today, weighing 17.5kg including its battery, and costing £999 (about $1,400 / AU$1,900).",
    "That's an impressively low price (in our tests, we've rarely been blown away by an electric bike below the £1,000 mark), but it's the weight that makes the Pure Flux particularly appealing.",
    "E-bikes are notoriously heavy – largely due to the weight of their high-capacity batteries – and that's a real problem.",
    "Many cycling facilities are designed with the assumption that you'll be able to lift your bicycle with relative ease. Cycle storage on trains and buses, for example, is intended make the last part of their journey on two wheels, but often takes the form of hooks mounted six feet in the air.",
    "For anyone with limited upper body strength or mobility – exactly the type of people who'll benefit most from a bicycle with power assistance – that's going to be extremely tough with a heavy bike.",
    "Folding e-bikes might seem like a good solution, packing away small and being easy to store, but they're often even weightier than their full-size counterparts due to the need for extra strong construction with tough joints. They're also surprisingly tough to carry, as their geometry means you can't shoulder them like a diamond-frame bicycle when they're unfolded.",
    "Thankfully, things are starting to change, and there's an increasing range of everyday e-bikes that are as easy to carry as they are to ride.",
    "The Ribble Hybrid Al e, for example, is a hybrid bike that weighs just 13.1kg, though it's twice the price of the new Pure model, starting at £1,999 (about $2,500, AU$3,600). The Ampler Curt is also super light at 13.5kg - 14.3kg, and for riders who wants to stray off the beaten track, the Ribble CGR AL e weighs only 13.8kg.",
    "The way that weight is distributed is another important factor. The Cowboy 4, which currently holds the number one spot in our guide to the best e-bikes, is somewhat heavier than the Ampler, Ribble and Pure models at 18.9-19.2kg, but is much tougher to carry due to its battery being built into the seat tube. This makes the rear of the bike far heavier than the front.",
    "Ribble and Pure have both opted for power packs on the downtube (Ribble's is integrated and Pure's is removable) which gives a much better center of gravity, and means the Ribble is far easier to carry on your shoulder.",
    "Hopefully the design and weight of e-bikes will continue to improve over the coming years with improvements in battery technology, opening up the roads and cycle lanes to even more people."
  ],
  "headers": {
    "6": "Lightening the load"
  },
  "links": {
    "electric scooters": "https://www.techradar.com/best/best-electric-scooters",
    "Pure Air Pro": "https://www.techradar.com/reviews/pure-air-pro-2021-electric-scooter",
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Pure Flux One": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-1140359722524648600&p=https%3A%2F%2Fwww.pureelectric.com%2Fproducts%2Fpure-flux-one-electric-hybrid-bike",
    "hooks mounted six feet in the air": "https://www.theguardian.com/lifeandstyle/bike-blog/2019/nov/04/rail-companies-bike-policy-bicycle-storage-trains",
    "Folding e-bikes": "https://www.techradar.com/best/best-folding-e-bikes",
    "Ribble Hybrid Al e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "Ampler Curt": "https://www.techradar.com/reviews/ampler-curt",
    "Ribble CGR AL e": "https://www.techradar.com/reviews/ribble-cgr-al-e",
    "Cowboy 4": "https://www.techradar.com/reviews/cowboy-4"
  }
}