{
  "source": "https://www.techradar.com/news/ps5-controller-adds-weight-and-heft-to-heroes-says-marvels-avengers-devs",
  "title": "PS5 controller adds 'weight and heft' to heroes, says Marvel's Avengers devs",
  "category": "gaming",
  "updated": "2021-03-18T17:23:06Z",
  "author": "vic-hood",
  "summary": "Interview: DualSense is ‘another means to add additional character depth’",
  "article": [
    "Given it's got some superpowers of its own, it makes sense that the DualSense controller is being utilized in the PS5 upgrade for Marvel’s Avengers. After all, with Earth’s Mightiest Heroes already feeling pretty mighty on PS4, why wouldn’t developer Crystal Dynamics want to further enhance that feeling?",
    "Well, that’s exactly what it’s doing with the PS5 upgrade for Marvel’s Avengers, which promises to bring faster loading times, 4K visuals and spatial audio support when it releases on March 18 - alongside the Hawkeye DLC. While these are enhancements we expect from a next-gen upgrade, and - bar spatial audio - are also being rolled out with the Xbox Series X upgrade, Crystal Dynamics has also chosen to go one step further by implementing DualSense controller support, allowing Marvel’s Avengers to make use of the PS5 gamepad’s haptic feedback and adaptive controllers.",
    "We spoke to senior game designer at Crystal Dynamics, Scott Walters, and narrative designer at Nixxes, Keano Raubun, about the upcoming Marvel’s Avengers next-gen upgrade and how the DualSense will improve the experience for PS5 players.",
    "Marvel’s Avengers next-gen upgrades are available for free from March 18 to those who already own the game on PS4 and Xbox One. While Xbox Series X/S players will benefit from enhanced visuals, significantly faster load times and better frame rates, PS5 players will get all this plus DualSense support.",
    "This DualSense support means that Marvel’s Avengers will utilize haptic feedback and adaptive triggers on PS5, making heroes' movements and abilities feel more immersive than ever before.",
    "“We've done a lot of work to try and make sure that each skill and each different ranged attack feels different and unique for each of the heroes and just use that as another means to add additional character depth to each player,” Scott Walters tells us.“I definitely think the adaptive triggers help lend some weight and some heft to some of those actions”.",
    "Walters uses the example of how the DualSense support will affect the feel of using Hawkeye’s bow, the latest hero who is coming to Marvel’s Avengers.",
    "“You can feel the tension on the string as you're holding [the adaptive trigger] down while you're charging up and aiming that upgraded shot,” Walters tells us “And we've obviously tried to make the bows feel different than the pistols, feel different than the repulsors.”",
    "Walters explains that the team wanted to ensure that when players are “hopping between” heroes, that each hero and their subsequent abilities feel different from one another - with the player feeling that difference through the controller’s feedback. That means that when you hold down the trigger for Black Widow’s semi-automatic pistol, which releases in short bursts, it should feel substantially different than when you release single shots, which requires a trigger pull per shot.",
    "While PS5 players will uniquely benefit from DualSense support, Xbox Series X players will benefit from native 4K resolution at 60fps while the PS5’s native 4K resolution is only possible at 30fps, as it is now, players can opt for 60fps using a checkerboard 4K resolution on Sony’s newest console.",
    "Given that we had some issues with frame rate drops in our Marvel’s Avengers review, it’s welcome news that these upgrades should stabilize the game’s performance.",
    "“I definitely think players are going to enjoy the graphics upgrades,” Walters says. “That's a big thing for a lot of people with the new consoles is they want to see the power of those platforms delivered.”",
    "While there are some minor differences in what next-gen upgrades for the two consoles feature, both will be benefiting from significantly faster load times. Square Enix told TechRadar that the load times on Xbox Series X and PS5 are “at least ten times faster” and “as much as 20 times” faster compared to the last-gen consoles, while “loading screens have been removed”.",
    "“I think just for me, one of the favorite things [about the next-gen upgrade] is the load time - it’s just so fast,” Keano Raubun tells us. “Whenever you die, whenever you transition between areas, whenever you enter the Quinjet, it’s really great for people to get into the game and stay engaged for much longer.”",
    "Marvel’s Avengers next-gen upgrades and Operation Hawkeye DLC is available on March 18."
  ],
  "headers": {
    "3": "That heroic feel",
    "9": "Even stevens"
  },
  "links": {
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Marvel’s Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x"
  }
}