{
  "source": "https://www.techradar.com/news/googles-parent-company-has-stuck-it-to-oracle-another-way",
  "title": "Google's parent company has stuck it to Oracle another way",
  "category": "computing",
  "updated": "2021-04-06T13:30:41Z",
  "author": "mayank-sharma",
  "summary": "The move has nothing to do with their courtroom tussles, assures Google",
  "article": [
    "Alphabet, Google’s parent company, has migrated its internal financial operations from Oracle to SAP software, reportedly owing to Oracle’s refusal to certify its database for use in Google’s cloud computing platform..",
    "The timing of the move comes on the same day Oracle lost its landmark Android lawsuit against Google.",
    "An unnamed source told CNBC that the move to SAP stems from Oracle being adamant about not getting its database certified on Google Cloud, which hampered its adoption, particularly among large companies.",
    "Reportedly the lack of certification for Oracle forced Google to focus on deploying SAP’s database software in the cloud.",
    "However, that has nothing to do with the transition to SAP according to Google. In a statement to ZDNet, Google Spokesperson José Castañeda noted that Google Cloud actively enables Oracle's customers to run their Oracle database workloads on Google Cloud through Google’s bare metal solution.",
    "\"But that's entirely separate to our decision as an enterprise customer of financial software to transition our financial systems from Oracle to SAP,\" added Castañeda.",
    "According to reports, Oracle co-founder and CTO, Larry Ellison has proudly pointed to Google as a client in past earning calls. In a recent one he even listed dozens of companies and government agencies that have moved from SAP’s ERP to Oracle’s Fusion ERP.",
    "The process of migrating off of Oracle’s financial software to SAP is said to complete by next month.",
    "Via: ZDNet"
  ],
  "headers": {
    "3": "Round two"
  },
  "links": {
    "financial operations": "https://www.techradar.com/reviews/pc-mac/software/business-and-finance-software",
    "database": "https://www.techradar.com/best/best-database-software",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "landmark Android lawsuit": "https://www.techradar.com/news/us-supreme-court-backs-google-over-oracle-in-billion-dollar-court-case",
    "CNBC": "https://www.cnbc.com/2021/04/05/google-will-stop-using-oracle-finance-software-switch-to-sap.html",
    "Google Cloud": "https://www.techradar.com/reviews/google-cloud-cdn",
    "ZDNet": "https://www.zdnet.com/article/google-migrates-from-oracle-financial-software-to-sap/"
  }
}