{
  "source": "https://www.techradar.com/news/your-oura-ring-just-got-better-at-tracking-daily-naps-on-android",
  "title": "Your Oura Ring just got better at tracking daily naps on Android",
  "category": "wearables",
  "updated": "2021-09-08T15:58:11Z",
  "author": "tom-may",
  "summary": "Next time you nod off in the daytime, your Smart Ring will pay more attention",
  "article": [
    "Desperate to improve the quality of your sleep? We’re not surprised. The importance of good night’s sleep can’t be underestimated, both for mental and physical health. And yet modern living, with its constant light and unending stimulation, makes that very difficult.",
    "That’s where the best sleep trackers come in handy: devices that measure that information using tech such as an accelerometer to detect movement, and an optical heart rate sensor to measure your heart rate.",
    "Sleep tracking features are commonly found in fitness trackers, such as the Fitbit Charge 4 and the Honor Band 5, and smartwatches like the Fitbit Sense and the Polar Vantage V2. But some people find wearing devices like this in bed too clunky and constricting.",
    "Hence the rise of the smart ring, with our favourite being the Oura Ring. As well as being unobtrusive, there's also good evidence that taking the pulse from the finger rather than the wrist is more accurate overall.",
    "Of course, the software which interprets that data is just as important as the hardware itself. So we were delighted today to see an update today on our Oura Ring, showing that it now supports \"nap tracking\" on Android.",
    "This update already arrived on iOS in May, so it’s about time Android users got to benefit from it as well. But what exactly is it, and what does it do?",
    "Nap tracking stems from the idea that it’s not just the sleep you get at night that’s important. You need to take any sleep you get during the day into account too, whether those are regularly planned cat naps, or accidental dozes after a late night or bad night’s sleep.",
    "Previous to the update, the Oura Ring simply measured naps as “Rest Periods.” Now, though, Nap Detection now provides detailed insights about both individual naps and ensures the impact of all of your sleep is reflected in your Sleep and Readiness Scores. Specifically:",
    "Of course, the makers recognise that their tech isn’t perfect: you might not be napping but just sat and lying very still for a while. For this reason, you need to confirm your naps for your Oura Ring to register them as such.",
    "If you don’t confirm them, they’ll only be recorded as Rest Periods, the app won’t provide detailed insights on these period, and they won’t impact your Sleep and Readiness Scores.",
    "If you nap before 6pm, your Sleep/Readiness Score will update right away. If you nap after 6pm, Oura anticipates you will sleep that evening and so holds off on updating your score until the next long sleep period of three hours-plus. Sleeping periods over three hours, though, are automatically confirmed.",
    "Overall, it does seem like this new update has been well thought-through, and it’s great news that Android users can now access it as well as iOS users. Especially for anyone who’s a new parent, shift worker, frequent traveller or just needs to catch up on sleep during the day."
  ],
  "headers": {
    "2": "Rise of the smart ring"
  },
  "links": {
    "best sleep trackers": "https://www.techradar.com/best/best-sleep-tracker",
    "Fitbit Charge 4": "https://www.techradar.com/reviews/fitbit-charge-4",
    "Honor Band 5": "https://www.techradar.com/reviews/honor-band-5-review",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Polar Vantage V2": "https://www.techradar.com/reviews/polar-vantage-v2",
    "Oura Ring": "https://www.techradar.com/news/oura"
  }
}