{
  "source": "https://www.techradar.com/news/banjo-kazooie-is-coming-to-nintendo-switch-online-but-theres-a-better-place-to-play-it",
  "title": "Banjo Kazooie is coming to Nintendo Switch Online, but there’s a better place to play it",
  "category": "gaming",
  "updated": "2021-12-10T13:49:33Z",
  "author": "adam-vjestica",
  "summary": "The bird and the bear are better elsewhere",
  "article": [
    "Nintendo has revealed that Banjo Kazooie – Rare’s classic N64 platformer which debuted in 1998 – is coming to the Nintendo Switch Online Expansion Pack service in January 2022.",
    "It’s the second N64 title to be added to Nintendo’s premium subscription tier since it arrived in October, with Paper Mario due to release on December 10, 2021.",
    "Banjo Kazooie will likely run at the same resolution and frame rate as other N64 titles on the service: 720p at 30fps, and will also support the Switch’s suspend and resume feature, which lets you create multiple save points.",
    "However, even though it’s great to see one of the N64’s best titles come to Nintendo’s new service, there’s a better way to play Banjo Kazooie right now, and for significantly less money.",
    "As a result of Microsoft buying Rare back in September 2002, Banjo Kazooie has been available on Xbox consoles for quite some time. The game runs at a resolution of 4K on Xbox Series X and Xbox One X, 1440p on Xbox Series S, and 1080p on Xbox One and Xbox One S – which is noticeably higher than the 720p output on Switch.",
    "Banjo Kazooie also supports Xbox achievements, and the game can be played via Xbox Cloud Gaming on your mobile device if you have Xbox Game Pass Ultimate. Xbox Series X and Xbox Series S owners will benefit from Auto HDR support, too, if they have a compatible display.",
    "Banjo Kazooie is, like all first-party Microsoft games, available on Xbox Game Pass. Xbox Game Pass is only $9.99 / £7.99 / AU$10.95 a month, which means you can play both Banjo Kazooie and the game’s sequel, Banjo-Tooie, for significantly less than the price of a year’s Nintendo Switch Online Expansion Pack, which costs $49.99 / £34.99 / AU$59.95. No monthly subscription option is available for the Nintendo Switch Online Expansion Pack.",
    "Alternatively, you could pick up a copy of Rare Replay, which includes both Banjo games as well as 28 other Rare classics like Conker’s Bad Fur Day, for less than $20 / £20. Obviously, that’s not an option for Xbox Series S owners, as the console doesn’t have a disk drive.",
    "Once Banjo Kazooie arrives in January 2022, there will be 11 N64 games available for subscribers to play on the Nintendo Switch Online Expansion Pack service. That’s a paltry amount compared to what other subscription-based services offer, like Xbox Game Pass and PlayStation Now, which grant users access to hundreds of titles to download and play from day one.",
    "Games are frequently added to both Microsoft and Sony’s services, too, which often gives subscribers new titles to enjoy every month.",
    "However, Nintendo’s biggest problem with its online services, including its NES and SNES library of games, is the glacial speed that new titles are added over time. It means subscribers can often be left waiting months, if not years for some of their favorite N64 titles to arrive, if at all. For the price Nintendo is charging, it needs to do more."
  ],
  "headers": {
    "8": "Analysis: Nintendo’s N64 library is growing, but far too slowly"
  },
  "links": {
    "Nintendo Switch Online Expansion Pack": "https://www.techradar.com/news/nintendo-switch-online-vs-nintendo-switch-online-expansion-pack-which-is-right-for-you",
    "Paper Mario": "https://www.techradar.com/news/paper-mario-n64-game-release-is-nintendo-switch-online-at-its-best-and-worst",
    "N64’s best titles": "https://www.techradar.com/news/best-n64-games",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x/reviews/original-2013-xbox-one",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Auto HDR": "https://www.techradar.com/news/what-is-xbox-series-x-auto-hdr-microsofts-game-changing-feature-explained",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review"
  }
}