{
  "source": "https://www.techradar.com/news/windows-10x-rumor-says-its-no-longer-being-developed-at-microsoft",
  "title": "Windows 10X rumor says it's no longer being developed at Microsoft",
  "category": "computing",
  "updated": "2021-05-09T13:30:36Z",
  "author": "david-nield",
  "summary": "But nothing is official yet",
  "article": [
    "Windows 10X was originally announced in October 2019 as a new flavor of Microsoft's operating system for the dual-screen Surface Neo. With the future of the Neo uncertain, development on the software then switched to single-screen devices, and now it looks as though Windows 10X could be canceled completely.",
    "Petri reports that \"people familiar with the company's plans\" say that Microsoft won't ship Windows 10X this year, and that the OS \"will likely never arrive\" in its current form. Instead, bits of Windows 10X might make their way into Windows 10 proper.",
    "As development on Windows 10X was separated from development on the Surface Neo, it looked as though 10X would evolve to become a lightweight, simpler version of Windows – not dissimilar to the old Windows RT or the more recent Windows 10 S – that would compete against Chrome OS.",
    "For whatever reason – and no specific reason is given in the Petri report – Microsoft has \"shifted resources\" to Windows 10 and put Windows 10X \"on the back burner\", at least for the foreseeable future. As yet, Microsoft has made no official comment.",
    "We recently heard information from a reliable leaker that Windows 10X devices would start appearing in the second half of 2021, with Microsoft reportedly delaying the arrival of the software to get all of the details right, and to make sure it was as bug-free as possible.",
    "Screenshots and videos showing off Windows 10X have already leaked out, and it's clear that the operating system is already a long way down its development road. If and when Microsoft does make an announcement about Windows 10X no longer being on its roadmap, it's going to be interesting to hear the reasons why.",
    "From what we've seen so far, Windows 10X was intended to be a very stripped-down, basic version of Windows 10, relying on web apps rather than traditional desktop apps (which will sound familiar to anyone who has used a Chromebook.",
    "It's the sort of operating system that would make sense for 2-in-1 devices, and indeed Windows 10X has previously been spotted running on a Surface Pro 7. For now the fate of the software remains in the balance, but as soon as Microsoft confirms or denies the reports we'll let you know."
  ],
  "headers": {
    "4": "Chrome OS rival"
  },
  "links": {
    "Windows 10X": "https://www.techradar.com/news/windows-10x",
    "Surface Neo": "https://www.techradar.com/news/microsoft-surface-neo-release-date-news-and-rumors",
    "switched to single-screen devices": "https://www.techradar.com/news/windows-10x-might-not-be-the-revolutionary-dual-screen-operating-system-we-first-thought",
    "Windows 10 S": "https://www.techradar.com/news/windows-10-cloud-release-date-news-and-rumors",
    "in the second half of 2021": "https://www.techradar.com/news/windows-10x-could-be-delayed-until-later-in-2021-as-microsoft-tries-to-get-it-right",
    "already leaked out": "https://www.techradar.com/news/windows-10x-leak-shows-us-microsofts-os-in-all-its-glory-but-with-some-apparent-disappointments",
    "used a Chromebook": "https://www.techradar.com/news/best-chromebook",
    "running on a Surface Pro 7": "https://www.techradar.com/news/windows-10x-shown-running-on-a-surface-pro-7-and-it-looks-pretty-cool"
  }
}