{
  "source": "https://www.techradar.com/news/cryptominers-are-flogging-masses-of-used-nvidia-geforce-rtx-3060-gpus",
  "title": "Cryptominers are selling off masses of used Nvidia GeForce RTX 3060 GPUs",
  "category": "computing",
  "updated": "2021-07-13T09:28:10Z",
  "author": "jess-weatherbed",
  "summary": "And at a reasonable price no less",
  "article": [
    "If you've been looking at the state of the graphics card market in recent months with despair then we have some good(ish) news for you. China's recent crackdown on cryptomining for Bitcoin has caused miners to sell off their used hardware en mass in order to squeeze some final cash out of their operations, which has resulted in used GPUs flooding the Chinese market at a reasonable price. At least, the price is reasonable if you're happy to take on the risk of buying hardware that's been so heavily used. It's worth noting that these GPUs have been running at full capacity for numerous months, so you can't guarantee what kind of performance or reliability you'll actually be getting from them. The mass sell-off of graphics cards also hasn't hit the western markets yet, but given the scale of China's cryptomining operations, we should at least see a knock-on effect in the coming months that will increase new stock availability for gamers and bring down the inflated prices we're currently seeing.",
    "The best graphics cards currently on the market have been almost impossible to obtain thanks to the 'perfect storm' of component shortages that prevents available stock from meeting high demand, and the recent boom in cryptocurrencies such as Bitcoin and Ethereum. GPUs became highly lucrative as part of mining operations, creating competition between gamers and miners for what little inventory was available. And of course, opportunists will take advantage of situations like this. Scalpers started using bots to clear up the available stock and inflate prices by almost three times their recommended MSRP for some of the more coveted cards, like the GeForce RTX 3080.",
    "Thanks to China putting stricter regulations in place for cryptocurrencies, miners have been flooding the market with second-hand GPUs for weeks, though this is the first instance we're seeing of prices being so close (or even cheaper than) MSRP. GeForce RTX 3060 card listings have appeared, advertising the used GPUs for 2,200 yuan to 2,899 yuan (around $336/£245/AU$450 - $450/£325/AU$600). According to The Block, it would appear that competition is so high that miners are undercutting rival prices, causing a further drop to 1,760 yuan (roughly $270/£195/AU$360).",
    "While those prices sound appealing when compared to the frankly disgusting inflated ones we've seen in recent months, buying one of these GPUs isn't advisable unless you're happy to take a risk. That isn't to say it's guaranteed that an ex-mining card is a bad investment, but we can apply the same mentality to GPUs that we do cars: sure, that Sedan with 200k miles might be cheap, but are you actually getting your money's worth? It's likely that all this will have a knock-on effect for new hardware given miners won't be out hunting for any GeForce RTX 3070 cards to send to the mines, so we recommend that you wait and see how much availability and shelf price improves for brand new stock before diving into any used purchases.",
    "It seems like cryptocurrency prices collapsing was the respite we needed to help ease the difficulties gamers face when trying to get a new graphics card, but if you have a little bit of patience you might not just find you dodge a bullet on a second-hand purchase, but we could be seeing reasonably priced graphics cards in both digital and physical stores again soon."
  ],
  "headers": {
    "1": "The market is healing",
    "3": "The best deal you shouldn't buy"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Ethereum": "https://www.techradar.com/news/ethereum-a-victim-of-its-own-success",
    "almost three times their recommended MSRP": "https://www.techradar.com/news/current-nvidia-rtx-3000-gpu-prices-are-so-much-worse-than-we-thought",
    "GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "flooding the market with second-hand GPUs": "https://www.techradar.com/news/cryptominers-are-selling-off-rtx-cards-in-bulk-after-chinas-crypto-crackdown",
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "The Block": "https://www.theblockcrypto.com/post/110638/chinese-crypto-miners-dump-gpu",
    "GeForce RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "cryptocurrency prices collapsing": "https://www.techradar.com/news/heres-hoping-elon-musk-tanks-crypto-so-miners-will-leave-our-rtx-3080s-alone"
  }
}