{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-note-21-is-canceled-but-the-xiaomi-mi-mix-4-might-fill-that-void",
  "title": "The Samsung Galaxy Note 21 is canceled, but the Xiaomi Mi Mix 4 might fill that void",
  "category": "phones",
  "updated": "2021-07-29T09:09:22Z",
  "author": "tom-bedford",
  "summary": "Similar-sounding specs",
  "article": [
    "While the Samsung Galaxy Note 21 is canceled, something the company has essentially confirmed, another late-2021 flagship might take its space as a top-end phablet - that's the Xiaomi Mi Mix 4.",
    "Popular leaker Digital Chat Station, posting on social media platform Weibo, has shared some specs of the Mi Mix 4 that make it sound a lot like what we expected from the Galaxy Note 21.",
    "Namely, DCS states the phone will have a screen that curves at the edges (as the Note 21 Ultra would likely have) and also an under-display front camera. This is a selfie camera that isn't housed in a cut-out or a notch, but actually sits below the device's display.",
    "Evidence pointed to the Galaxy Note 21 coming with an under-display camera, and it's possible the Galaxy Z Fold 3 will actually debut with the technology, though the first handset with this feature was actually the Axon 20 5G from late 2020.",
    "DCS has a pretty great track record of leaks, especially on phones from Chinese companies, but since the Mi Mix 4 is still a bit of an enigma, take the leak with a pinch of salt for now.",
    "The Xiaomi Mi Mix 3 came out in late 2018, and the line was thought to be cancelled, but rumors suggest the Mi Mix 4 could revive the name and the line. There's been little in the way of official comment on the existence of the device, and we've mainly got leaks to go by.",
    "While Xiaomi couldn't have known the Galaxy Note 21 could get cancelled, it has a track record of competing with Samsung devices - the Mi and Galaxy S flagship lines release around the same time each year, for example. So Xiaomi was likely hoping to rival the Galaxy Note 21 series.",
    "But with a hole in the market for a late-year Android powerhouse - something Huawei won't fill since its devices don't use Android anymore, and the Google Pixel 6 might not fill either if it turns out to be another mid-range handset - the Mi Mix 4 might end up being a pretty important phone.",
    "Sure, it's unlikely to have a stylus - we would have heard that from leaks by now - but with a curved-edge screen and under-display camera, it has lots of the features we thought the Note 21, or Note 21 Ultra, would have.",
    "Furthermore, judging by Xiaomi's habits, we'd predict the phone will have a 6.67-inch screen, Qualcomm Snapdragon 888 chipset and 108MP main camera - all pretty top specs. Those are judging by past performance from the company, but leaks haven't said as much yet.",
    "There are still a lot of question marks over the Xiaomi Mi Mix 4, mainly if it'll launch outside China, as the company releases lots of its device only to its homeland. But if Xiaomi won't fill the Galaxy Note 21 hole in our hearts, it's unlikely any other company will."
  ],
  "headers": {
    "5": "Analysis: A Galaxy Note 21 replacement?"
  },
  "links": {
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Xiaomi Mi Mix 4": "https://www.techradar.com/news/xiaomi-mi-mix-4-news",
    "Weibo": "https://m.weibo.cn/detail/4661735187546602",
    "Galaxy Note 21 coming with an under-display camera": "https://www.techradar.com/news/evidence-mounts-the-samsung-galaxy-note-21-will-have-an-under-screen-front-camera",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "Xiaomi Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6"
  }
}