{
  "source": "https://www.techradar.com/news/nvidia-has-just-released-a-new-gpu-that-you-cant-buy-and-gamers-arent-happy",
  "title": "Nvidia has just released a new GPU that you can’t buy - and gamers aren’t happy",
  "category": "computing",
  "updated": "2021-12-09T11:57:37Z",
  "author": "jamel-smith",
  "summary": "When will it end?",
  "article": [
    "Nvidia just released the RTX 2060 12GB GPU, and it seems to be out of stock already, with new units reported to be arriving in late December 2021.",
    "Our friends over at PC Gamer scoured a bunch of retailers like Best Buy, Newegg, Scan and Box to see if they had the RTX 2060 12GB in stock - and they didn’t find a single listing.",
    "The RTX 2060 originally came out a few years ago, but Nvidia has resurrected this older GPU and upgraded it with 12GB of VRAM in a bid to address stock shortages with its newer RTX 3000 series GPUs, such as the RTX 3060, which replaced the RTX 2060. The new 12GB card is capable of running up to 31.65MH/s compared to the older version which ran at 22.17MH/s, according to tests conducted by pcmarket's review (via momomo_us).",
    "There was some speculation that the actual on-sale date was different from the announcement date, but Nvidia has said that’s not the case. The Nvidia RTX 2060 12GB started to hit shelves on December 7, which means Nvidia’s partners were free to distribute the GPU from that date. It’s stated that Nvidia expects \"partner card availability to ramp starting the end of December through January.\"",
    "So, it looks like the card Nvidia released to combat stock shortages is facing stock shortages of its own. This has understandably left many gamers looking to upgrade their gaming PCs disappointed and angry.",
    "To make matters worse, there isn’t any information on what the price of the card is going to be. Some leaked prices from Videocardz appear to show MSI RTX 2060 12GB cards costing anywhere from €528 (about $600 and £450) to a whooping €645 (about $730 and £550), but these listings could just be placeholders.",
    "So, PC owners and builders shouldn’t expect the RTX 2060 12GB to rectify issues with GPU price and stock shortages. Both issues seem to be continuing into 2022 and probably beyond, and it feels like there’s nothing Nvidia can do about it.",
    "We’ve contacted Nvidia to find out more."
  ],
  "headers": {
    "5": "A big price tag?"
  },
  "links": {
    "PC Gamer": "https://www.pcgamer.com/uk/nvidia-rtx-2060-12gb-stock-availability/",
    "RTX 2060 12GB": "https://www.techradar.com/news/the-nvidia-geforce-rtx-2060-12gb-is-here-but-does-it-matter",
    "RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "stock shortages with its newer RTX 3000 series GPUs": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-gpu-stock-nightmare-continues-as-prices-skyrocket",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "pcmarket's": "https://www.pcmarket.com.hk/rtx-2060-12gb-review/",
    "momomo_us": "https://twitter.com/momomo_us/status/1468224914838667266",
    "gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Videocardz": "https://videocardz.com/newz/msi-geforce-rtx-2060-ventus-graphics-card-with-12gb-memory-goes-on-sale-in-france-for-528-eur"
  }
}