{
  "source": "https://www.techradar.com/news/oppo-reno-6",
  "title": "Oppo Reno 6 release date, price, specs and what you need to know",
  "category": "phones",
  "updated": "2021-05-27T11:54:48Z",
  "author": "tom-bedford",
  "summary": "The sixth-gen Oppo Reno phone",
  "article": [
    "The Oppo Reno 6 series is here - blimey, Reno moves fast, with six generations of mid-range Oppo phones pumped out since 2019.",
    "These phones follow the Oppo Reno 5 series, which you may know better as the Oppo Find X3 Lite and Find X3 Neo (as they got launched in the West as more affordable alternatives to the premium Oppo Find X3 Pro).",
    "At the moment, the Oppo Reno 6 series has only been unveiled for China - the launch event took place in the country - but Oppo has confirmed a Europe launch for the phones is planned too.",
    "Below we've got all the information you need on the Oppo Reno 6, Pro and Pro Plus, and if we hear about global availability or prices we'll update this article.",
    "While the Oppo Reno 6 series has launched in China, Oppo has confirmed to us that the phones will come to Europe at some point in the future.",
    "Above you can see the Chinese prices for the phones, as well as rough conversions for different currencies. If these phones ever do get sold worldwide, the prices could be quite different, so take this under advisement.",
    "The Oppo Reno 6 seems to have taken design inspiration from the iPhone 12, as its edges are totally flat and angular. That's not the case for the Pro or Pro Plus, and they also have curved-edge screens.",
    "Each phone has a 6.55-inch FHD+ display which supports HDR10+, with a 90Hz refresh rate and 180Hz touch input. The screen on each phone is also broken up by a punch-hole cut-out.",
    "The phones are available in some pretty dynamic shades, with pale blues and silvers shown off, but probably more colors available too.",
    "The Oppo Reno 6 and 6 Pro have the same rear and front camera arrays, with one key difference - the latter has a 2MP macro camera that's missing on the 'vanilla' phone.",
    "The Oppo Reno 6 Pro Plus brings the big changes though. It has a 50MP main camera, which is technically lower-res than the 64MP snapper on the other two, but has a bigger sensor size to 'see' more light.",
    "This is the only phone with a telephoto lens, and its ultra-wide camera is paired with a higher-res sensor. It misses out on the macro lens of the Reno 6 Pro, but given that this camera is only 2MP, it's not a big loss.",
    "You can see a complete graph of the cameras below:",
    "In terms of battery life, each phone has a 4,500mAh power pack, save the 'vanilla' device which is just 4,300mAh. They all charge at 65W too, which is pretty snappy for a mid-range phone.",
    "The top-end Oppo Reno 6 Pro Plus uses the Qualcomm Snapdragon 870 chipset, which we've also seen in the Moto G100 and other mid-rangers. It's not quite as powerful as the top-end Snapdragon 888, but it's close.",
    "The two other Reno phones ditch Qualcomm for MediaTek, its rival. The Reno 6 uses the Dimensity 900 and the Pro model uses the Dimensity 1200, which are solid mid-rangers that don't quite compete with the Snapdragon 870.",
    "All three phones are 5G-compatible too.",
    "The handsets all come running Android 11, with Oppo's ColorOS laid over the top. This is mainly a design change but it brings with it lots of customization, like the ability to change the effect that happens when you press the fingerprint scanner."
  ],
  "headers": {
    "4": "Oppo Reno 6 price and availability",
    "6": "Design and display",
    "9": "Cameras and battery life",
    "14": "Performance and software"
  },
  "links": {
    "Oppo phones": "https://www.techradar.com/news/best-oppo-phones",
    "Oppo Find X3 Lite": "https://www.techradar.com/reviews/oppo-find-x3-lite",
    "Find X3 Neo": "https://www.techradar.com/reviews/oppo-find-x3-neo-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}