{
  "source": "https://www.techradar.com/news/google-chrome-update-adds-its-very-own-command-line-feature",
  "title": "Google Chrome update adds its very own command line feature",
  "category": "computing",
  "updated": "2021-05-27T10:12:59Z",
  "author": "joel-khalili",
  "summary": "Google has added three new Chrome Actions to the roster",
  "article": [
    "Google is expanding an experimental Chrome feature that turns the browser’s URL bar into a makeshift command line.",
    "The company began testing so-called Chrome Actions last year with version 87, allowing users to perform certain tasks (clear browsing data, translate page etc.) using a series of text commands entered into the address bar.",
    "Now, Google has added three new commands to the library: Run Chrome safety check, Create doc and Manage Google Account.",
    "The first allows users to check for corrupt extensions and cross-reference saved passwords with a database of credentials known to have been compromised in data breaches. The Manage Google Account command, meanwhile, can be used to amend personal information, payment methods and subscriptions.",
    "The Create doc command is the most self-explanatory of the three, giving users a quick way to launch a fresh Google Docs file.",
    "Google is aiming to roll out Chrome Actions far and wide later this year, but for now the feature remains in beta. To test out URL bar commands ahead of the full release, users will need to enable a pair of Chrome Flags.",
    "To do so, type “chrome://flags” into the address bar and search for “#omnibox-pedals”. From here, enable “Omnibox Pedals Default Icon Colored” and “Omnibox Pedal batch 2” flags and restart the browser.",
    "If successful, typing supported commands into the URL bar will generate actions underneath the query, which the user can then select.",
    "With the rise of web applications and remote working leading to many spending more and more time working in browser sessions, the ability to streamline workflows using quick-fire commands will be a welcome addition.",
    "The arrival of Chrome Actions will also add fuel to the fight between web browsers. Although Chrome remains the dominant force in the market, services such as Microsoft Edge have been on an upward trajectory over the past year, which won’t have gone unnoticed at Google.",
    "Via Bleeping Computer"
  ],
  "headers": {
    "5": "Enable Google Chrome commands"
  },
  "links": {
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "began testing": "https://www.techradar.com/news/chrome-87-has-hidden-actions-that-make-the-address-bar-even-more-useful",
    "passwords": "https://www.techradar.com/best/password-manager",
    "database": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "browser": "https://www.techradar.com/best/browser",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Bleeping Computer": "https://www.techradar.com/news/chrome-87-has-hidden-actions-that-make-the-address-bar-even-more-useful"
  }
}