{
  "source": "https://www.techradar.com/news/microsoft-accidentally-leaks-public-preview-for-visual-studio-code-for-the-web",
  "title": "Microsoft accidentally leaks public preview for Visual Studio Code for the Web",
  "category": "computing",
  "updated": "2021-09-01T15:13:47Z",
  "author": "mayank-sharma",
  "summary": "The announcement is gone, but the release is live",
  "article": [
    "Microsoft appears to have accidentally announced the public preview of Visual Studio Code for the Web, the browser-based version of its free and cross-platform Visual Studio Code (VS Code) integrated development environment (IDE).",
    "Sharing details via the now-deleted blog post, Microsoft announced that the preview-release of the browser-based IDE was available to everyone for free.",
    "\"Announcing the preview of Visual Studio Code for the Web, a new web-based code editor that runs entirely in your browser and without backing compute,\" read the deleted blog post, as captured by BleepingComputer.",
    "Notably, VS Code for the Web comes less than a month after GitHub launched its own browser-based code editor in the form of GitHub Codespaces.",
    "Though the announcement has since been deleted, the public preview of the browser-based IDE is live, and reportedly appears to be working fine according to tech journalist Simon Bisson.",
    "In its current form, the browser-based instance of VS Code lets developers open and browse source code hosted on GitHub as well as on a local machine.",
    "Microsoft also noted that VS Code for the Web extended several of the features of the desktop edition including syntax highlighting, search, multiple file editing, and a source control view, though of course there are differences between the two versions.",
    "\"VS Code for the Web does not have access to compute resources, so you won't be able to build, run, or debug your application, nor you will be able to use the integrated terminal,\" Microsoft reportedly added in the deleted post.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Down, but not out"
  },
  "links": {
    "VS Code": "https://www.techradar.com/reviews/microsoft-vs-code",
    "IDE": "https://www.techradar.com/best/best-ide-for-python",
    "GitHub Codespaces": "https://www.techradar.com/news/github-doubles-down-on-browser-based-coding",
    "browser-based IDE is live": "https://vscode.dev/",
    "Simon Bisson": "https://twitter.com/sbisson/status/1432781091069382662",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/microsoft/microsoft-announces-visual-studio-code-for-the-web-public-preview/"
  }
}