{
  "source": "https://www.techradar.com/news/this-tiny-portable-dac-could-make-your-headphones-sound-incredible",
  "title": "This tiny portable DAC could make your headphones sound incredible",
  "category": "audio-visual",
  "updated": "2021-04-08T13:17:27Z",
  "author": "olivia-tambini",
  "summary": "The THX Onyx works with your phone, PC, or tablet",
  "article": [
    "THX may be a name you associate with cinema, but the company has just released a portable DAC (digital-to-analogue converter) that could make your headphones sound incredible.",
    "With a USB-C dongle on one end, and a 3.5mm audio port on the other, the THX Onyx acts as a middleman between your headphones to your PC, Mac, or Android phone, and hopefully improving the sound of your music, films, and games in the process.",
    "That 3.5mm jack will also work for your desktop speakers, while an included USB-C to USB-A adapter means you can still use the THX Onyx if your laptop doesn't have the former. If you're an iPhone user, you would need to buy the Apple Lightning to USB Camera Adapter to use the mini portable DAC.",
    "THX says that the Onyx is the first portable DAC to feature the company's AAA-78 amplifier technology, which it claims gives the device the same power as a desktop THX AAA amplifier, but in a far smaller package.",
    "According to the company, this \"nulls conventional distortion mechanisms to reduce harmonic, intermodulation, and crossover distortion by up to 40dB, resulting in a realistic and fatigue-free listening experience\", and makes the THX Onyx \"up to five times more powerful than other portable USB DAC/Amps\".",
    "Inside the Onyx is an ESS ES9281PRO DAC chip and a Master Quality Authenticated (MQA) renderer to \"reproduce the sound of master recordings\" and playing MQA-encoded Tidal Masters.",
    "In spite of all that impressive audio tech, the THX Onyx is very small indeed, and its slim build means you should hardly notice it when you're using it on the move. The USB-C dongle is even magnetic, so you can loop it back around and attach it to the main body of the DAC when not in use, and use it to secure your headphones' cable.",
    "Its all-metal body is furnished with LED lights that signify the quality of the music files being played through it, with blue signifying 44.1kHz or 48kHz PCM files, yellow indicating sample rates above that, red for DSD signals, and pink for MQA files.",
    "So, how much will that cost you? The THX Onyx is priced at $200 / £199 / AU$359.95.",
    "That's a fair amount pricier than the recently-announced Astell & Kern AK USB-C DUAL DAC Cable, which offers a similarly slimline design and Hi-Res Audio chops. Costing $149 / £109 (about AU$190), the Astell & Kern DAC allows you to connect your wired headphones to phones or devices without a 3.5mm audio port (like most modern smartphones, for example), as well as hopefully improving the sound of your music.",
    "There's a catch, though: while the portable DAC works with Android smartphones, Windows 10 PCs, tablets, and MacOS computers, it won't work with your iPhone or iPad. According to the company, this is because a dual DAC cable requires more current to run than iOS devices export.",
    "In the case of the THX Onyx, you'll just need an extra adapter for it to work with your iOS devices."
  ],
  "headers": {
    "6": "Small yet mighty"
  },
  "links": {
    "portable DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Astell & Kern AK USB-C DUAL DAC Cable": "https://www.techradar.com/news/want-the-best-sounding-headphones-this-portable-dac-could-be-your-secret-weapon",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "Windows 10 PCs": "https://www.techradar.com/news/best-windows-laptop"
  }
}