{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-hbo-max-disney-plus-amazon-prime-and-more-this-weekend-june-12-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, Disney Plus and more this weekend",
  "category": "entertainment",
  "updated": "2021-06-15T11:40:41Z",
  "author": "axel-metz",
  "summary": "What's worth watching this weekend on Netflix and other streamers?",
  "article": [
    "And just like that, another Marvel Cinematic Universe (MCU) adventure blasts its way onto Disney Plus. This week, though, Kevin Feige and co. have refrained from more of the paint-by-numbers action à la The Falcon and the Winter Soldier and opted for a decidedly unique take on the superhero genre.",
    "Yes, the first episode of Loki has arrived to join a stellar lineup of new content dropping on the likes of Netflix, Amazon Prime Video and HBO Max this weekend. But as well as big-budget comic book shows, there’s big-budget musical movies, medium-budget crime series and even tiny-budget, fly-on-the-wall farming documentaries.",
    "The point being, there’s a lot to sink your teeth into over the next few days. Below, we’ll walk you through seven of the biggest highlights – from mind-bending thrillers to returning heist dramas.",
    "Marvel’s latest original adventure, Loki, follows the exploits of the titular God of Mischief after his Tesseract-assisted escape in Avengers: Endgame. Told in six parts, the show takes proceedings away from Earth and into various new dimensions as Loki encounters the Time Variance Authority, an organization with a mission to keep the MCU’s different timelines in working order.",
    "Episode 1 is out now, and has been near-unanimously praised by fans and critics alike for its shaking up of the well-trodden superhero formula, and taking it into more of a Terry Gilliam's Brazil-infused workplace comedy. As ever, Loki is a charismatic and highly watchable villain, and the series breaks new ground by playing with the time travel mechanics first introduced in the last Avengers movie.",
    "New episodes will arrive every Wednesday until July 14, and stay tuned to TechRadar for all the latest Loki reviews, explainers and theories you could need.",
    "Now available to stream on Disney Plus",
    "A feature-film adaptation of Lin-Manuel Miranda’s Tony Award-winning musical, In the Heights takes audiences to the toe-tapping, break-dancing neighborhood of New York's Washington Heights.",
    "Directed by Crazy Rich Asians’ Jon M. Chu, the movie sets Miranda’s original music and lyrics to vibrant set-pieces in the vein of La La Land and West Side Story, with critics praising its party-like atmosphere and refreshing positivity amid the doom and gloom of recent times.",
    "In the Heights will run on HBO Max for one month, alongside its theatrical release, and you can only get it at the $14.99 tier of the service – not the ad-supported one. In the UK, this one is only available in cinemas.",
    "Now available to stream on HBO Max in the US",
    "It’s been a while since we’ve seen Mark Wahlberg on the big screen, hasn’t it? Infinite, the story of one man’s struggle to understand memories of a life he never had, was originally headed for a theatrical release in September, but now arrives as a Paramount Plus exclusive movie. It's not had stellar reviews, on the whole.",
    "Here, Wahlberg – who replaced Chris Evans in the lead role – stars alongside Chiwetel Ejiofor and Dylan O’Brien in a sci-fi thriller that looks to have more than a few shades of Christopher Nolan to it. It’s also an adaptation of a novel, The Reincarnationist Papers, by D. Eric Maikranz, and is directed by Antoine Fuqua (The Equalizer, Training Day) – so expect bullets and brawn.",
    "Those in the US not yet subscribed to Paramount Plus can enjoy a 7-day free trial.",
    "Now available to stream on Paramount Plus in the US",
    "One of Netflix’s most popular original series, Lupin returns for a second season this weekend. “Part Deux” of the French crime drama once again follows the escapades of Omar Sy’s Assane Diop, picking up where season 1’s cliffhanger ending left off.",
    "With Assane’s son, Raoul, abducted by the dastardly Pellegrini, Lupin sets out for revenge – but he must also now navigate the pressures of being the most wanted man in France.",
    "Season 3 – “Part Trois” – of the popular French-speaking show has also been confirmed, though we don’t expect it to arrive until at least 2022. Just enjoy season 2 first, OK?",
    "Now available to stream on Netflix",
    "The UK’s foremost potty-mouthed motorhead, Jeremy Clarkson, swaps The Grand Tour and Who Wants To Be a Millionaire for life on a provincial farm in Amazon Prime’s aptly-titled Clarkson’s Farm.",
    "In this series, we follow the presenter’s haphazard attempts to run his own 1000-acre farm in Oxfordshire, England, as he encounters the stark – and smelly – realities of seed sowing, sheep shearing and s**t shoveling.",
    "In an interesting twist, the whole endeavor has been praised by almost every major outlet in the UK, with most professing it “surprisingly fun”. Whatever you think of Clarkson, then, this one could be worth a watch for the laughs alone.",
    "Now available to stream on Amazon Prime Video",
    "In Awake, chaos ensues after a global event wipes out all electronics and takes away humankind’s ability to sleep. Gina Rodriguez (Annihilation) stars as Jill, an ex-soldier who may hold the key to a cure.",
    "Granted, that doesn’t sound like the most original premise, but sense-stealing thrillers like Bird Box and A Quiet Place have been roaring successes in recent years. That said, critics haven’t been kind to this one so far – Awake currently scores a measly 33% on Rotten Tomatoes, while one outlet labelled it a “real snooze.”",
    "Maybe just sleep, instead?",
    "Now available to stream on Netflix",
    "Another new HBO Original series, Starstruck follows Jessie (Rose Matafeo), a London-living millennial juggling two dead-end jobs and navigating the pressures of becoming romantically involved with a famous film star (Nikesh Patel).",
    "It’s been described as Notting Hill in reverse, which is an apt summary of not only Starstruck’s plot, but sense of humor. Think of it as Bridget Jones’ Diary, then, with more than a few hints of Fleabag thrown in for good measure. Minnie Driver and Russell Tovey also star.",
    "Given the critical reception so far, this one could be a gem.",
    "Now available to stream on HBO Max"
  ],
  "headers": {
    "3": "Loki (Disney Plus)",
    "7": "In the Heights (HBO Max)",
    "11": "Infinite (Paramount Plus)",
    "15": "Lupin (Netflix)",
    "19": "Clarkson's Farm (Amazon Prime Video)",
    "23": "Awake (Netflix)",
    "27": "Starstruck (HBO Max)"
  },
  "links": {
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Episode 1": "https://www.techradar.com/news/loki-episode-1-recap-under-the-skin-of-a-great-mcu-villain",
    "7-day free trial": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "The Grand Tour": "https://www.techradar.com/news/the-grand-tour-season-4-episode-3-release-date-and-upcoming-episodes-explained"
  }
}