{
  "source": "https://www.techradar.com/news/even-nvidia-doesnt-think-youll-get-an-rtx-3080-this-year",
  "title": "Even Nvidia doesn't think you'll get an RTX 3080 this year",
  "category": "computing",
  "updated": "2021-04-14T10:35:41Z",
  "author": "jess-weatherbed",
  "summary": "And it would know, right?",
  "article": [
    "Graphics cards have been increasingly hard to find recently, with coveted new releases like Nvidia's GeForce RTX 3080 and AMD's Radeon RX 6800 XT vanishing from the shelves as soon as they appeared. This, unfortunately, looks set to continue for some time, much to the dismay of many PC builders or gamers holding out hope that the shortages will ease up. CFO Colette Kress addressed Nvidia's annual investors day on Monday, stating “we expect demand to continue to exceed supply for much of this year\", despite Nvidia previously predicting back in November during the launch of its Ampere range that it may only take a \"few months\" for available stock and manufacturing to catch up to the demand. This means that everything from the entry-level GeForce RTX 3060, to the princely RTX 3090 may not be available for a 'reasonable' price any time soon.",
    "Kress also added “our operations team is agile and executing fantastically. We expect our supplies to increase as the year progresses\", so at least some progress is anticipated throughout the rest of 2021, even if the issue isn't expected to be revolved. A large reason for the high demand is a mix of product scalpers who use bots to scrape sites for available inventory, to then resell on online auction sites like eBay. We've seen GPUs listed (and sadly selling) for more than double the recommended retail price which nulls the appealing 'affordability' of both AMD and Nvidia's latest generation of cards.",
    "Adding to the problem, component parts like RAM and semiconductors are also facing supply issues, and these are needed not just in graphics cards, but other tech such as gaming consoles which has made the PS5 and Xbox Series X just as hard to manufacture and get our hands on.",
    "And then of course, there's the mining situation. Cryptominers have been buying up GPUs in bulk to build rigs for mining cryptocurrencies such as Bitcoin and Etherium due to an ongoing boom. There's been consistent speculation that the rapid inflation will result in the bubble imminently bursting on crypto, but there have been no solid indications that this is around the corner. Nvidia are trying to combat gaming GPUs being purchased for mining by creating dedicated cryptomining processors (CMPs), and even resurrecting older cards such as the GTX 1060 and GTX 1080 Ti to take some pressure off the newer Ampere tech. Despite the dedicated CMPs not being officially released, a bunch of smugglers in Hong Kong got a large cache of 30HX CMPs seized by customs officials, which proves just how in demand crypto hardware is right now. Sadly, some recent reports and leaked specs on one of these new CMPs isn't very promising, so this may not prevent miners from buying up dedicated gaming cards.",
    "Commenting on the concerns for how the production of CMPs will affect the shortage of Ampere, Kress also said “we now expect CMP revenue to be approximately $150 million, higher than the $50 million included in our fiscal Q1 outlook. Up side to CMP is not displacing supply from our other platforms. It is incremental.” In short, it looks like we're in this for the long haul, so until Etherium and Bitcoin lose their value again, or production bottlenecks are removed you may actually be better buying a gaming laptop than trying to build a desktop right now. At least you can find an RTX 30 series GPU in those.",
    "Via PCMag"
  ],
  "headers": {
    "3": "Dig a little deeper"
  },
  "links": {
    "Nvidia's GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD's Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "RAM": "https://www.techradar.com/news/the-amd-and-nvidia-graphics-card-shortage-could-continue-until-february-2021",
    "semiconductors": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "dedicated cryptomining processors (CMPs)": "https://www.techradar.com/news/can-nvidias-cryptomining-cards-help-you-finally-get-an-rtx-3080",
    "GTX 1060": "https://www.techradar.com/news/nvidia-gtx-1060-might-be-brought-out-of-retirement-to-mine-crypto",
    "GTX 1080 Ti": "https://www.techradar.com/news/nvidia-gtx-1080-ti-could-be-the-next-gpu-to-make-an-unexpected-comeback",
    "30HX CMPs seized": "https://www.techradar.com/news/see-the-300-nvidia-cryptomining-gpus-seized-by-hong-kong-customs-officials",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "PCMag": "https://uk.pcmag.com/graphics-cards/132757/nvidia-demand-for-graphics-cards-to-outstrip-supply-for-much-of-2021"
  }
}