{
  "source": "https://www.techradar.com/news/canon-eos-r5-firmware-update-brings-serious-video-upgrades",
  "title": "Canon EOS R5 firmware update brings big video upgrades",
  "category": "cameras",
  "updated": "2021-03-30T01:00:00Z",
  "author": "mark-wilson",
  "summary": "But doesn't quite address all of its flaws",
  "article": [
    "The Canon EOS R5 has today been given a big firmware update that brings some much-requested video features to the full-frame mirrorless camera.",
    "The update, which has been joined by slightly smaller firmware boosts for the Canon EOS R6 and Canon EOS 1D X Mark III, delivers some long-rumored upgrades to the EOS R5. These include a slo-mo 120p option for Full HD recording, a low bit-rate raw recording mode to help reduce file sizes, and the Canon Log 3 format for filmmakers who like to color grade their videos.",
    "All of these additions will be welcomed by Canon EOS R5 owners. The lack of 4x slow motion recording in Full HD was an odd omission from the R5, given it was available on the EOS R6. And the arrival of Canon Log 3 support will please video shooters who want the flexibility of shooting in Log, but need more dynamic range than what's possible with the more limited Canon Log 1 format.",
    "Sadly for Canon EOS R6 and EOS 1DX Mark III owners, Canon has only promised that it'll be bringing Canon Log 3 support to those cameras \"in a future update.\" But there are other more minor updates for those models in today's firmware boosts, as well as a couple of extra stills-focused ones for the EOS R5.",
    "On both the R5 and R6, you now get support for 'full-time manual focus' (FTM) on RF lenses. This means you can override the autofocus of Canon's lenses by turning their focus ring when in 'Servo AF' mode (otherwise known as continuous autofocus). That could be handy for fine-tuning your autofocus, without having to switch between manual focus and autofocus.",
    "For pro photographers, the firmware update also brings an 'FTP transfer status' to the screens of both the EOS R5 and 1D X Mark III, showing how long it'll take to transfer your photos. The R5 is also getting a new Protect Image Transfer function, which lets you protect them from being deleted when transferring them via FTP.",
    "Lastly, and perhaps most usefully for owners of multiple Canon cameras, you can now save your personalized EOS R5 settings to a memory card, which can then be copied across to other cameras. It might not be a scintillating addition, but that one feature alone could well save some Canon fans hours of setting up time.",
    "Overall, then, these firmware upgrades bring a couple of big video upgrades to the Canon EOS R5, along with some smaller ones for the R5, R6 and 1D X Mark III that address long-standing niggles.",
    "In some ways, a slight gap has opened up between the video capabilities of the Canon EOS R5 and R6, with the latter strangely not receiving the Canon Log 3 support given to its pricier sibling.",
    "The updates also don't address all of the requests that have come from Canon fans. For example, the Canon EOS R5 still has a 30-minute recording limit for its video files, which feels slightly restrictive when you consider that rivals like the Sony A7S III have no recording limits.",
    "Some R5 users have also asked for a Pixel Shift feature, like the one introduced on the Sony A7R IV and Sony A1, which use a camera's sensor stabilization system to capture a series of raw images and then combine them into huge files – for example, a 199MP photo on the Sony A1.",
    "Still, these features could theoretically arrive in the future and, for now, today's firmware updates will be welcome news for Canon fans. You can download the updates on the official pages for the Canon EOS R5, Canon EOS R6 and Canon EOS 1D X Mark III."
  ],
  "headers": {
    "7": "Baby steps"
  },
  "links": {
    "Canon EOS R6": "https://www.canon.co.uk/support/consumer_products/products/cameras/digital_slr/eos-r6.html?type=important%20",
    "Canon EOS 1D X Mark III": "https://www.canon.co.uk/support/consumer_products/products/cameras/digital_slr/eos-1d-x-mark-iii.html?type=important",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Canon EOS R5": "https://www.canon.co.uk/support/consumer_products/products/cameras/digital_slr/eos-r5.html?type=important"
  }
}