{
  "source": "https://www.techradar.com/news/insider-data-breaches-are-running-rampant",
  "title": "Insider data breaches are running rampant",
  "category": "computing",
  "updated": "2021-07-14T13:45:36Z",
  "author": "mayank-sharma",
  "summary": "IT leaders fear hybrid working will increase incidents of data breaches, survey finds",
  "article": [
    "Virtually all organizations across various sectors have experienced insider data breaches in the last year, according to a new survey.",
    "The Insider Data Breach Survey 2021 from by security services provider Egress reveals that 94% of all surveyed businesses have suffered a data breach from an insider in the last twelve months.",
    "However, an overwhelming majority (84%) of the respondents blamed human error as the cause for the most serious of breaches.",
    "“Insider risk is every organization’s most complex vulnerability – and it has far-reaching consequences, from ransomware attacks to loss of client trust. Organizations must act now to mitigate the risk posed by their people,” said Egress CEO Tony Pepper.",
    "Even then, 28% IT leaders are more worried about malicious insiders breaching business data, and only about one-fifth (21%) worrying about genuinely erring employees.",
    "The survey surveyed 500 IT leaders and 3000 employees in the US and UK across vertical sectors including financial services, healthcare and legal.",
    "It finds that almost three-quarters (74%) of organizations were breached because employees broke security protocols, even as a similar number (73%) fell victim to phishing attacks.",
    "Worryingly, many feel that the move towards remote working will further compound the problem, with 56% of the opinion that the new hybrid working environment will make it harder to prevent data breaches caused by human error or phishing.",
    "Interestingly, employees are a lot more optimistic with 61% arguing that working from home makes them less, or just as likely, to cause a breach."
  ],
  "headers": {
    "5": "Friendly fire"
  },
  "links": {
    "data breaches": "https://www.techradar.com/news/what-is-a-data-breach",
    "Egress": "https://www.techradar.com/news/email-may-be-the-riskiest-tool-your-workplace-is-using",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "working from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working"
  }
}