{
  "source": "https://www.techradar.com/news/theres-a-powerful-new-linux-gaming-laptop-on-the-scene",
  "title": "There's a powerful new Linux gaming laptop on the scene",
  "category": "computing",
  "updated": "2021-01-15T15:02:00Z",
  "author": "mayank-sharma",
  "summary": "Slimbook Titan is available for pre-order now, with delivery starting in May",
  "article": [
    "Linux-friendly Spanish PC maker Slimbook has revealed a powerful new gaming laptop that features some of the hottest pieces of hardware around today.",
    "Dubbed the Slimbook Titan, the laptop is equipped with the AMD Ryzen 7 5800H processor, and an NVIDIA GeForce RTX 3070, both of which boast impressive performance improvements over their rivals.",
    "Expectedly, the laptop isn’t cheap and is available at a discounted pre-order price of €1599. Best of all, the laptop ships with Ubuntu, though you can have it with Windows 10 for an additional cost.",
    "The octa-core AMD processor that supports boost speeds of up to 4.4 GHz, together with Nvidia’s newest graphics powerhouse with 8GB memory, make the Slimbook Titan one of the fastest gaming laptops in the market.",
    "The laptop has a 15.6 inch 2K IPS display with a 165 Hz refresh rate, and the usual complement of ports including three USB 3.0, one USB Type-C, HDMI, and Ethernet.",
    "The base model is equipped with 16GB of 3200Mhz RAM, which can be upgraded to either 32GB or 64GB. Similarly, the laptop comes with a 500GB NVMe SSD, but offers a multitude of NVMe storage options up to 4TB, as well as an optional RAID array, at an additional cost.",
    "To compliment its impressive specs, the laptop dons a black aluminum body and uses a backlit opto-mechanical keyboard with per-key RGB lighting. It also features an infrared facial recognition camera that works in Linux and weighs 2.2Kg or about 4.8 pounds.",
    "Slimbook is currently accepting pre-orders for the laptop, but will only begin shipping it later this year in May."
  ],
  "headers": {
    "3": "Monster specs"
  },
  "links": {
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Slimbook Titan": "https://slimbook.es/en/store/titan/titan-comprar",
    "AMD Ryzen 7 5800H": "https://www.techradar.com/news/amd-ryzen-7-5800h-cpu-destroys-predecessor-and-could-worry-intel-in-leaked-benchmark",
    "NVIDIA GeForce RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070"
  }
}