{
  "source": "https://www.techradar.com/news/samsung-galaxy-a72",
  "title": "Samsung Galaxy A72 release date, price, news and features",
  "category": "phones",
  "updated": "2021-03-26T16:30:25Z",
  "author": "james-rogerson",
  "summary": "A 90Hz screen, a telephoto camera, water resistance and more",
  "article": [
    "The Samsung Galaxy A72 might not be as high-profile and flashy as the Samsung Galaxy S21 range, but it’s a whole lot cheaper and has a respectable assortment of specs.",
    "These include a 90Hz FHD+ screen, a big battery, and water resistance, among other things – so you’re still getting some quite premium features here, potentially making this a good fit if you want a capable but not quite cutting-edge handset.",
    "Below you’ll find full details of all the Samsung Galaxy A72’s specs and features, along with information on where it’s available and how much it costs.",
    "The Samsung Galaxy A72 was announced on March 17, 2021, and it’s available now in the UK, while Australia will get it from April 9. It costs from £419 / AU$749 (around $580), but there’s no confirmed US availability at the time of writing.",
    "The above prices are for a model with 6GB of RAM and 128GB of storage, but – at least in some regions – there will also be a version with 8GB of RAM and up to 256GB of storage.",
    "The Samsung Galaxy A72 has a plastic back – which is to be expected given that even the much more expensive Samsung Galaxy S21 does.",
    "It’s available in Awesome Black, Awesome White, Awesome Violet or Awesome Blue, and has an IP67 rating, meaning it’s dust and water resistant (the latter to depths of up to 1 meter for up to 30 minutes).",
    "It comes in at 165 x 77.4 x 8.4mm and 203g, and the overall design is fairly conventional, with a large camera block in the top left corner of the rear, and a punch-hole selfie camera in the top center of the screen.",
    "Speaking of the screen, it’s a flat 6.7-inch 1080 x 2400 one, which uses Super AMOLED, has a 90Hz refresh rate, around 394 pixels per inch, a 20:9 aspect ratio, and a maximum brightness of 800 nits.",
    "So on paper it has fairly good specs. For reference, it’s the same resolution as the Galaxy S21, and bigger, but with a lower refresh rate and maximum brightness.",
    "There’s a quad-lens rear camera on the Samsung Galaxy A72, consisting of a 64MP f/1.8 main camera with optical image stabilization (OIS), an 8MP f/2.4 telephoto one (with OIS, 3x optical zoom and 30x digital zoom), a 12MP f/2.2 ultra-wide one (with a 123-degree field of view), and a 5MP f/2.4 macro one.",
    "It can also record 4K video at 30fps (or 1080p video at up to 60fps), and there’s a 32MP f/2.2 selfie camera on the front.",
    "The battery meanwhile is a 5,000mAh one, with 25W charging. That’s a good size, but there’s no wireless charging. There is however a charger included with the phone, which isn’t something you get with the Galaxy S21 range.",
    "The Samsung Galaxy A72 is powered by a Snapdragon 720G chipset. That’s mid-range, but not capable of 5G, so this is just a 4G phone.",
    "That’s then coupled with 6GB or 8GB of RAM and 128GB or 256GB of storage (though at the time of writing only the 6GB / 128GB model is available in the UK).",
    "As for features, there’s an in-screen fingerprint scanner, stereo speakers (with Dolby Atmos), a microSD card slot (supporting up to 1TB), and a Game Booster mode, which optimizes the battery, temperature and memory use while gaming. The Galaxy A72 also runs Android 11, overlaid with Samsung’s One UI 3.1."
  ],
  "headers": {
    "3": "Samsung Galaxy A72 release date and price",
    "5": "Design and display",
    "10": "Camera and battery",
    "13": "Specs and features"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}