{
  "source": "https://www.techradar.com/news/major-windows-10-update-will-come-with-these-cool-hidden-features",
  "title": "Major Windows 10 update will come with these cool hidden features",
  "category": "computing",
  "updated": "2021-04-06T13:24:31Z",
  "author": "matt-hanson",
  "summary": "Leaked Windows 10 21H2 features emerge",
  "article": [
    "Windows 10 is due a major revamp later in 2021 with the Windows 10 21H2 Update, and while we've had a good idea of some of the features coming to the operating system, a few exciting hidden features have just been uncovered in an early test version.",
    "As spotted by Twitter user Albacore, and reported by WinCentral, these new features haven’t been publicly talked about by Microsoft, and some of them have been hidden away in menus.",
    "The fact that Microsoft hasn’t been shouting about these features doesn’t mean they aren’t interesting – in fact, they seem pretty cool. The reason they’ve been overlooked could be because they are still being worked on, and not ready for prime time.",
    "Also, unlike the Windows 10 21H1 update, which is due soon and only comes with minor fixes and changes, the 21H2 update will be a much larger update that brings loads of new tools and features, so Microsoft may just not have a chance to showcase all the changes.",
    "One of the more noticeable changes coming to Windows 10 in the 21H2 update is a new ‘Device usage’ section in the ‘Personalization’ settings page. This new section lets you tell Windows 10 what you use your PC for, be it gaming, schoolwork and more, and Windows 10 will configure itself so that it runs best for your needs.",
    "These options actually appear when you first run Windows 10, but if you skipped setting them when they first appeared, this allows you to set it up later.",
    "You’ll also be able to use Windows Spotlight as a desktop background, which gives you different, and often stunning, photos. There’s also a ‘Learn about this picture’ option, which you can click and it will bring up information about the photograph, including who took it and what the photo is of.",
    "Perhaps most usefully of all, the on-screen touch keyboard is also getting new customization options as well to make it easier to use.",
    "Windows 10 21H2 Update is due in the latter half of 2021, and in the run up we’ll hopefully see even more new features emerge."
  ],
  "headers": {
    "4": "What’s coming?"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 10 21H2 Update": "https://www.techradar.com/news/windows-10-21h2-update",
    "Twitter user Albacore": "https://twitter.com/thebookisclosed",
    "WinCentral": "https://thewincentral.com/windows-10-21h2-hidden-features-leak-device-usage-windows-spotlight-touch-keyboard-customization-10044/"
  }
}