{
  "source": "https://www.techradar.com/best/best-mmo-games",
  "title": "Best MMO games: live a second life on console and PC",
  "category": "gaming",
  "updated": "2021-06-29T08:54:40Z",
  "author": "vic-hood",
  "summary": "An different kind of daily grind",
  "article": [
    "The best MMO games, also known as Massively Multiplayer Online games, set themselves apart from the crowd thanks to their nature. Playing one gives you a unique gameplay experience because not only are you offered an almost completely empty canvas to start with, but you’re also exploring and interacting with thousands of other players from all over the world in vast fictional worlds.",
    "In essence, the best MMO games will let you lead an alternate life in an alternate version of yourself. You can create and customize your own avatar, which you can build through interactions, battling and leveling up. That’s while you’re doing things like meeting new people and going on new adventures, offering a sense of freedom and a taste of things you may never experience in your everyday life.",
    "There’s a reason why the MMO games are well-loved. Even online giant Amazon is coming out with its own entry named New World, which takes place in the 17th century. Regardless of whether you’re looking for your first MMO, a new adventure to dive into, or in its popular variant, the MMORPG (RPG stands for Role Playing Game), we’ve collected the best MMO games for you to dig into.",
    "Let's face it, this was an obvious one. Blizzard's World of Warcraft has been going since around 2004 and it's been the reigning champion of the MMO genre for a long time. But, in that time, it's changed quite a lot.",
    "World of Warcraft is one of the most successful and influential games in the genre, with new content frequently being added for a thriving, dedicated player base. If subscriber numbers look like they're wavering even slightly, you can be sure Blizzard will come out with another great expansion to corral everyone back into the fold and maybe bring some newbies with them.",
    "Its latest expansion, World of Warcraft: Shadowlands, has to be among the best expansions in its history, offering stunning visuals on top of excellent dungeons and a linear questing system as well as a whole slew of exciting new content.",
    "World of Warcraft is kind of essential for anyone interested in the high fantasy MMORPG and we can’t see it being knocked from prominence any time soon.",
    "You can download the game for free on the official website.",
    "What can I play it on? PC",
    "What’s the payment structure? Free trial up to level 20, then a monthly subscription fee",
    "Planetside 2 is a first-person shooter on a massive scale. If you're not interested in the kind of granular play offered by games like Black Desert Online, then this game's focus on all out war against other players might appeal to you.",
    "The game revolves around three factions in a constant state of war. Players choose their faction and then spend their time attacking and defending bases on a huge map to remain ahead of the competition. One day you could be on the attack, the next you could be desperately defending. Either way you're always fighting.",
    "Planetside 2 is now seven years old and, though it doesn't have quite the same popularity or player base as it once did, it offers something a little different to the rest of the MMOs on this list.",
    "You can get going for free on the official site.",
    "What can I play it on? PS4 and PC",
    "What's the payment model? Free-to-play",
    "Rather than a sprawling world with endless choice, Secret World Legends is an MMO which places a lot of focus on storytelling. If you're tired out by the usual high fantasy and space fare, this is a game which is set in a world very close to our own. Well, kind of. It's our world if cults, mythological creatures, crazy conspiracies and supernatural phenomenons were commonplace.",
    "There's more than 100 hours of story to enjoy here and players are able to explore locations all over the world and take part in a range of missions to unlock the mysteries of the world.",
    "While it's possible to play through the story on your own, you can also team up with others and adventure with players from across the world.",
    "You can start your story via the official website or on Steam.",
    "What can I play it on? PC",
    "What's the payment model? Free-to-play",
    "If you're looking for player-versus-player combat then you should definitely give Guild Wars 2 some of your time. Whether you like fighting other players in contained structured modes or you'd be interested in fighting against hundreds across sprawling maps in World-versus-World mode, Guild Wars has you covered.",
    "For those that don't enjoy the grinding that's traditionally involved in MMOs then Guild Wars 2 will also appeal – this is an accessible game and it doesn't try to copy World of Warcraft. The game's world is dynamic and player decisions have real consequences which promises a story that feels individual.",
    "You can download the base game for free on the official site.",
    "What can I play it on? PC",
    "What's the payment structure? You can download the base game for free and then each expansion is buy-to-play",
    "Few fictional worlds are as perfect for the MMO treatment as Tolkein's Middle-earth. Sure, Frodo's adventure was thrilling, but we all know we could have one equally as exciting if we had the chance.",
    "You get to choose between being a Human, Elf, Dwarf or Hobbit before you drop into Middle-earth and explore the locations you know and love with an intimacy that no other Lord of the Rings game has allowed.",
    "You can expect to find the usual World of Warcraft style of questing here, alongside crafting mechanics and the ability to purchase and set up a home. Overall, it's a pretty standard MMORPG in terms of mechanics, but its setting really helps it stand out.",
    "Though the game is free-to-play, there are expansions available for purchase which add to the game's story and introduce new items and mechanics. Even better for Tolkien fans: the storylines follow in line with the books.",
    "You can fine the base game for free on the official site or Steam.",
    "What can I play it on? PC",
    "What's the payment model? Free-to-play, with purchasable DLC and optional subscription",
    "It's been a while since the last mainline Elder Scrolls release, and we're pretty sure it'll be a while until The Elder Scrolls 6 will be here, so if you're a fan looking to breathe fresh life into Tamriel, Elder Scrolls Online is an excellent option.",
    "Like Final Fantasy XIV, this is a game that struggled initially. But since dropping its subscription fees for a buy-to-play model, perception has dramatically improved. Despite being one of the most modern and recent MMOs to hit the market, Elder Scrolls Online has really picked up traction, which is undoubtedly helped by being in a recognizable universe that many wish to return to.",
    "After the success of Morrowind, Elder Scrolls Online has had several DLC updates including Summerset, Wolfhunter and Murkmire.",
    "Here you'll find the traditional Elder Scrolls viewpoint and combat but it’s all neatly tied in with those traditional MMO features like looting, crafting systems and PvP and PvE missions.",
    "What can I play it on? PS4, Xbox One, PC",
    "What's the payment structure? Buy-to-play",
    "Like World of Warcraft, Runescape is one of those names that's renowned in the MMO world, partly because it's one of the oldest games in the genre still going. And yet, with its user base managing to double in 2018, it's still very much alive and kicking.",
    "Originally a browser-only game, over the years Runescape has expanded into its own program with vastly improved visuals and mechanics. At its heart, though, it remains a game that's dedicated to giving players freedom in combat and questing. It's perhaps for this reason that it remains one of the most popular and updated games in the MMO genre.",
    "You can start playing via the official Runescape site.",
    "What can I play it on? PC and Android Early Access with iOS coming in 2020",
    "What's the payment structure? Free-to-play but can pay monthly membership for extra content - membership also includes mobile access",
    "Black Desert Online certainly isn't one of the more accessible games on this list, but it's one that you may find it worth investing some time into. As a Korean MMO, it does place a heavy emphasis on grinding, but for anyone looking for in-depth profession and crafting systems, it's a contender.",
    "More than many other MMOs, this is one that will try to draw you into a second life. It also has one of the most robust character creation systems in the genre. This is a game that has something to engage with on big and small scales. Want to fish and farm? You can do that. But you can also take part in guild wars and sieges past a certain level.",
    "Don't expect a vast story here – this is very much a sandbox game where you craft your own story and adventure.",
    "But there are various systems and mechanics to engage with and connecting them together can be rewarding, even if the process proves time-consuming and complicated.",
    "Black Desert Online is a complex but stunning game. It has its problems, but its move from PC onto Playstation and Xbox One has only made it more relevant for a mainstream audience.",
    "What can I play it on? PC, Xbox One, PS4",
    "What's the payment structure? Buy-to-play with optional in-game purchases",
    "There's been a lot of high fantasy in this list so far – but if you're more of a space age type then you might want to take a look at Eve Online.",
    "A word of warning, though: we said Black Desert Online is complicated but Eve Online edges to beat it. This is a game world that's been going for 17 years and it's become somewhat infamous for being one of uncaring betrayal. While you can do whatever you want in the game, just remember that others can do whatever they want. And sometimes that involves ruining you. Space colonization is a tough game and there's no room for lasting friendships.",
    "Eve Online is kind of the ultimate in sandbox MMO gaming – it's a game world driven by its playerbase; a playerbase capable of dragging out wars and schemes over periods of months with plenty of fighting, smuggling and sabotage in between.",
    "Just because it's not the easiest game to learn doesn't mean you can't do it, though. Unlike the creators of Black Desert Online, over the years developer CCP has attempted to make it slightly more accessible and the developer has put together a thorough and helpful tutorial for beginners.",
    "Besides, sometimes there's no better lesson than getting something horrifically wrong. The introduction of a free-to-play option is also a great chance to dip your toes in and see if you're interested in delving deeper.",
    "You can download Eve Online from its official website.",
    "What can I play it on? PC",
    "What's the payment structure? Free-to-play or subscription",
    "It's not been an easy journey for this Final Fantasy MMO. First launched in 2010 to an overwhelmingly negative response (and for good reason), Square Enix then spent two years reworking and rebuilding it to create something much better.",
    "In its latest and vastly improved form, Final Fantasy XIV is a game that will appeal to franchise fans and newcomers alike.",
    "Boasting an accomplished class system and a story that builds steadily over the game's various expansions, this is an MMO which really captures the essence of the Final Fantasy franchise with plenty of fan service.",
    "What can I play it on? PS4 and PC",
    "What's the payment structure? Buy-to-play"
  ],
  "headers": {
    "3": "World of Warcraft",
    "10": "Planetside 2",
    "16": "Secret World Legends",
    "22": "Guild Wars 2",
    "27": "Lord of the Rings Online",
    "34": "The Elder Scrolls Online",
    "40": "Runescape",
    "45": "Black Desert Online",
    "52": "Eve Online",
    "60": "Final Fantasy XIV"
  },
  "links": {
    "New World": "https://www.techradar.com/news/amazon-at-gdc-2017",
    "World of Warcraft: Shadowlands": "https://www.techradar.com/reviews/world-of-warcraft",
    "official website": "https://www.eveonline.com/",
    "official site": "https://www.lotro.com/en/game",
    "Steam": "http://store.steampowered.com/app/212500/The_Lord_of_the_Rings_Online/",
    "official site.": "https://www.guildwars2.com/en/",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "official Runescape site.": "http://www.runescape.com/community",
    "free-to-play option": "https://www.eveonline.com/"
  }
}