{
  "source": "https://www.techradar.com/news/ddr5-modules-are-scheduled-for-q3-2021-but-should-you-upgrade",
  "title": "DDR5 modules are scheduled for Q3 2021 - but should you upgrade?",
  "category": "computing",
  "updated": "2021-05-07T10:31:43.124Z",
  "author": "rhys-wood",
  "summary": "Will DDR5 be the new RAM standard?",
  "article": [
    "Kingston Technology has announced that its DDR5 modules have been sent to its motherboard partners for qualification purposes. As reported by VideoCardz, The modules have been developed with overclocking support in mind, and are posited for a Q3 2021 release.",
    "Likely, this means that we’ll see the first wave of DDR5 RAM modules released around that time frame, so expect the conversation around DDR5 to grow as we see modules launch between that July to September time period.",
    "DDR5 modules are most likely going to be 16GB as standard, which was earlier confirmed by a TeamGroup spokesperson speaking to TechRadar Pro. Unsurprisingly, the spokesperson also suggested that DDR5 will be more expensive than the current DDR4 standard.",
    "DDR5 does have a number of advantages over DDR4. DDR5 registers higher speeds of up to 6.4Gbps, doubling DDR4’s potential data rate of 3.2Gbps. DDR5 will also use less power than its predecessor, making the modules ever so slightly more energy efficient.",
    "DDR5 also packs more memory per module (as mentioned, 16GB will be the standard) than DDR4, which will prove massively useful for intensive tasks like rendering video and special effects, 4K and above photo editing, and high-quality live streaming.",
    "That being said, there’s a glaring issue with DDR5 in that consumers won’t actually be able to make use of it until CPU manufacturers release supporting hardware. AMD and Intel are expected to launch DDR5 supporting ranges sometime in 2022.",
    "As such, you’ll most likely have to wait for the release of Intel’s 12th generation Alder Lake chips in 2021/22 when we once again move to an entirely new motherboard design. The same goes for the red team, too, as DDR5 support will likely arrive alongside AMD’s Zen 4 processor lineup, which also won’t be released until 2022.",
    "DDR5 is also expected to be very expensive at launch, meaning that the modules might not be the consumer standard for some time. DDR4 modules won’t be rendered obsolete, and will likely still be the affordable option for consumers outside of the hobbyist and enthusiast demographics."
  ],
  "headers": {
    "3": "Should you upgrade to DDR5?"
  },
  "links": {
    "VideoCardz": "https://videocardz.com/press-release/kingston-technology-announces-its-overclockable-ddr5-modules-will-ship-in-q3-2021",
    "TeamGroup spokesperson": "https://www.techradar.com/vpn/pcs-with-16gb-ram-likely-to-be-standard-in-2021-as-ddr5-hits-mainstream",
    "DDR5 supporting ranges": "https://www.techradar.com/news/intels-12th-generation-desktop-processors-could-support-ddr5-ram-before-amd",
    "Intel’s 12th generation Alder Lake chips": "https://www.techradar.com/news/latest-intel-12th-gen-leak-gives-us-a-glimpse-beyond-the-desktop",
    "AMD’s Zen 4": "https://www.techradar.com/news/amd-zen-4-cpus-could-be-40-faster-than-its-current-processors-which-should-concern-intel"
  }
}