{
  "source": "https://www.techradar.com/news/cyberpunk-2077-for-ps5-and-xbox-series-x-what-we-know-so-far",
  "title": "Cyberpunk 2077 for PS5 and Xbox Series X: What we know so far",
  "category": "gaming",
  "updated": "2021-05-24T20:42:23Z",
  "author": "samuel-tolbert",
  "summary": "A second go at Night City",
  "article": [
    "After several years of teases, gameplay reveals and trailers, CD Projekt Red's Cyberpunk 2077 launched on December 10, 2020 to commercial success but mixed critical reception. While an initial mess of hilarious and occasionally game-breaking bugs spoiled the game for some, on high-end PC rigs, the game can run well and look absolutely gorgeous, with neon lights illuminated with ray-tracing.",
    "On consoles, it's something of a different story. In addition to numerous bugs, performance and visuals on the different console platforms ranged from \"alright\" to \"extremely poor.\" Patches have improved the situation since launch but it's still not ideal in many respects.",
    "As such, many players are interested in a promised update for the game that upgrades the experience to one built specifically for the latest consoles. Here's what we know about Cyberpunk 2077 on PS5, Xbox Series X, and Xbox Series S.",
    "Cyberpunk 2077 is an open-world role-playing game set in the year 2077, based on the Cyberpunk 2020 tabletop game built by Mike Pondsmith.",
    "The game takes place in Night City, a place where megacorporations rule the skyline and gangs rule the city's underbelly. Players choose between one of three Lifepaths when setting out: Nomad, Street Kid, or Corpo.",
    "This upgrade will be completely free on all platforms for anyone who currently owns Cyberpunk 2077 on Xbox One or PS4. Players will also be able to transfer their saves without issue. It's an automatic process for Xbox players, while PlayStation users need to use PlayStation Plus Cloud Saves or a USB to import their files.",
    "Right now, while it doesn't fully take advantage of the power in the newest consoles, Cyberpunk 2077 runs at 60 FPS on Xbox Series X and PS5. As such, it's safe to expect that there will be a performance mode targeting 60 FPS included in the current-gen update.",
    "It also seems reasonable that there'll be a visuals-focused mode, possibly locking the framerate to 30 FPS but enabling higher-quality textures, resolution and even ray-traced reflections.",
    "Load times are already heavily reduced on the newer consoles thanks to the ultra-fast SSDs, but by tapping further into the system, these load times should be even further reduced.",
    "There are also console-specific features that could be introduced. For the Xbox Series X|S version, we might see reduced controller latency. The PS5 version of the game could find interesting ways to take advantage of the DualSense haptic feedback and adaptive triggers.",
    "CD Projekt Red has not offered an exact release date yet for the enhanced version of Cyberpunk 2077 outside of saying it'll be available in the second half of 2021. A port of The Witcher 3: Wild Hunt for Xbox Series X|S and PS5 is also being aimed to release in the second half of 2021.",
    "Given the nature of game development as the world continues to deal with the effects of the pandemic, as well as how CD Projekt Red previously delayed Cyberpunk 2077 numerous times, we'd recommend not getting your hopes up until a date has been announced and then arrives."
  ],
  "headers": {},
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "DualSense haptic feedback and adaptive triggers": "https://www.androidcentral.com/list-ps5-games-dualsense-haptic-feedback-adaptive-triggers",
    "aimed to release": "https://www.techradar.com/news/the-witcher-3-on-ps5-and-xbox-series-x-coming-later-this-year"
  }
}