{
  "source": "https://www.techradar.com/news/why-i-just-bought-a-kindle-paperwhite-on-prime-day-even-if-i-still-love-paper-books",
  "title": "Why I just bought a Kindle Paperwhite on Prime Day, even if I still love paper books",
  "category": "tablets",
  "updated": "2021-12-04T02:47:55Z",
  "author": "michael-hicks",
  "summary": "I saved $55 and stopped pretending e-books were shameful",
  "article": [
    "When someone mentions an e-book, I'll inevitably start rambling about how good paper feels to hold, or how reading print books improves retention, or some other grumbling comment about e-books. And as someone who once worked in book publishing, my feelings about Amazon are complicated, to say the least.",
    "Despite all of that, today I gave in to the inevitable and bought a Kindle Paperwhite, which is currently at an all-time low of $55 off for Prime Day. Kindle Prime Day deals offered an opportunity I couldn't refuse; and I'm here to give you (fellow print book nerd) permission to have an open relationship with e-books and print books, so to speak.",
    "I brought hundreds of novels across the country when I moved to California, nearly injuring the poor movers that had to carry bins full of them up three flights of stairs. I'm not giving up on print books.",
    "But somehow, when it comes to picking something new to read, I have to stop myself from buying even more books. I'm like the meme of the sleazy boyfriend, checking out the attractive new books while my TBR pile stares in shock.",
    "So I reluctantly turned to borrowing and buying Kindle e-books, and was immediately annoyed at how convenient they were. I could sneak peeks at new books during lunch breaks, or snag daily deals of great books for a buck or two. I'm more ahead on my Goodreads Challenge than ever before.",
    "I also realized that, even if I end up skimming more while reading e-books than print books, that's fine: I don't have enough time to read all of George RR Martin's descriptions of food or Robert Jordan's five thousand braid-tugging scenes anyway. Better to get the gist than not read at all.",
    "My new e-book binge has slowly started destroying my eyes, though. I already stare at screens 9 hours a day for work – it's what made it hard for my brain to step away from screens and stare at a book without getting distracted and antsy. Reading e-books on my computer or my new Fire HD 10 meant they never got a screen break from morning to night.",
    "That's why I jumped on this Kindle Prime Day deal. The Paperwhite's e-ink and 300ppi, anti-glare screen will give me access to my cheap e-books, borrowed library books, and Audible audiobooks on a device – without giving me stress headaches, tempting me with video streaming apps, or requiring daily recharges.",
    "I considered the Kindle Oasis – currently $65 off – for its adaptive light and better lighting for eye strain. But my colleagues who reviewed both e-readers said the Paperwhite was plenty comfortable on the eyes, and it let me save a ton of money for buying more e-books. No regrets!",
    "I still plan to buy physical books from my favorite authors. I'm even hoping that reading more regularly on my Paperwhite will make my brain more patient with long stretches of print reading again. But I'm done acting as if reading e-books somehow makes me less of a 'real' reader. I'm getting too old for that hipster crap.",
    "No matter where you live, you'll find all the lowest prices for the Amazon Kindle models from around the web right here, with offers available in your region.",
    "You might also want to check out Amazon Prime Day Kindle deals."
  ],
  "headers": {
    "10": "More Amazon Kindle deals",
    "12": "More Amazon Prime Day deals"
  },
  "links": {
    "Kindle Paperwhite": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-2018-review",
    "$55 off": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07PTCW9G7%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1293387234595315200-20",
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Fire HD 10": "https://www.techradar.com/reviews/amazon-fire-hd-10-2021-review",
    "Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review",
    "$65 off": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAll-new-Kindle-Oasis-now-with-adjustable-warm-light%2Fdp%2FB07F7TLZF4%2Fref%3Dsr_1_1%3Fcrid%3D2RH9D4631F1WG%26dchild%3D1%26keywords%3Dkindle%2Boasis%26qid%3D1624319785%26s%3Damazon-devices%26smid%3DATVPDKIKX0DER%26sprefix%3Dkindle%2Boasis%252Camazon-devices%252C255%26sr%3D1-1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1930532510149485000-20",
    "Amazon Prime Day Kindle deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-kindle-deals-2020"
  }
}