{
  "source": "https://www.techradar.com/news/google-photos-price",
  "title": "Google Photos price: what will it charge when free storage ends in June?",
  "category": "cameras",
  "updated": "2021-05-24T21:00:23Z",
  "author": "chris-rowlands",
  "summary": "What will Google charge for Photos subscription plans?",
  "article": [
    "Google Photos’ free unlimited storage for ‘high quality’ images ends on June 1. Wondering what the price of storing all your snaps and videos in Google Photos will be after that date? We’ve gathered all of the important info here so you can get prepared for the Google Photos change.",
    "One thing’s for sure – Google Photos is, and will continue to be, a fantastic option for saving your snaps online. The service offers simple and secure cross-platform access, plus a suite of smart sorting, editing and sharing tools to get the best out of your image library. And it’s not just for Android users: Google Photos plays nice with web browsers, as well as PCs, Macs and iOS devices.",
    "Google Photos has proved popular because of the unlimited free storage capacity it previously offered for compressed photos. But that’s changing from 1 June 2020 – and it could have significant repercussions, depending on how you use the service.",
    "Whether you’re new to Google Photos or a long-established user, it’s worth taking a few minutes to understand what the policy changes mean and how the new storage pricing structure will affect you. Luckily, we’ve explained everything below – as well as your options if you don’t want to shell out for a subscription.",
    "When backing up snaps to Google Photos, you currently have two size options: ‘high’ quality and ‘original’ quality. The latter saves full-fat copies to the cloud, with no compression. It uses more storage space, but means that images retain resolutions big enough for printing – and allows photographers to duplicate their precious raw photo files.",
    "‘High’ quality, on the other hand, means images are sensitively compressed when they are uploaded, to a maximum size of 16MB. The compression is efficient, with no significant reduction in quality noticeable when viewed on a screen. While ‘high’ quality photos won’t be as sharp if printed, they take up a lot less storage capacity in the cloud.",
    "Why is this significant? Google previously offered unlimited free storage space for ‘high’ quality images. Users could upload as many snaps as they liked – including their entire smartphone camera roll – and it wouldn’t count towards the 15GB storage capacity that comes with their Google Account.",
    "From 1 June 2021, that’s no longer the case. Google Accounts will still come with 15GB of complimentary storage space, but any new images uploaded will count towards the total – whether they are ‘high’ or ‘original’ quality. So if you’re a happy snapping smartphone photographer, you could soon find your free allowance maxed out.",
    "There is one exception to this – users of Google Pixel phones (from the Google Pixel 2-5) will continue to receive unlimited free storage for high quality photos. Similarly, owners of the Pixel (2016) will retain their unlimited storage capacity for original quality photos.",
    "Existing ‘high’ quality images will not count towards your free 15GB account allowance. So you don’t need to worry immediately if you’ve got a sizable library of snaps in the cloud: any photos already uploaded in ‘high’ quality before 1 June 2021 will not affect your capacity cap.",
    "However, if you have a large stash of ‘original’ quality images taking up storage space – and you regularly backup ‘high’ quality images on the assumption that it’s free – you may find that Google soon prompts you to pay for additional storage. And if it does, you’ll have several options to select from.",
    "Google does not offer a dedicated plan for Google Photos. Instead, to increase your cloud storage capacity, you’ll need to take out a Google One subscription. There are three paid plans to pick between. Each includes an increased storage allowance, which applies across all Google products – including Google Drive.",
    "The most affordable Google One plan includes 100GB of storage space. It costs US$1.99 / £1.59 / AU$2.49 per month. Alternatively, you can save 16% over 12 months by paying annually. That will set you back US$19.99 / £15.99 / AU$24.99 per year. This will be the best plan for most people, offering a decent storage expansion at an affordable cost. It’s ideal if you’re mainly looking for a place to backup your smartphone image library online.",
    "The next plan nets you a maximum capacity of 200GB. That costs US$2.99 / £2.49 / AU$4.39 per month. Again, you can choose to pay annually and save 16% on the total cost. The yearly fee is US$29.99 / £24.99 / AU$43.99.",
    "The most spacious Google Plan that’s immediately available includes a significantly larger 2TB of storage space. This sets you back US$9.99 / £7.99 / AU$12.49 per month. The annual fee is US$99.99 / £79.99 / AU$124.99. If you’re only uploading images in ‘high’ quality, this might be overkill – but those with a sizable library of ‘original’ quality images to backup will likely find that this is the best value option.",
    "There are in fact further tiers of Google One subscription plans available, but these only appear once you have subscribed to the 2TB plan. These are substantially more spacious but also more expensive – and they’re only really relevant to power users of Google products. Note that there is also no annual option for the highest capacity tiers; you can only pay monthly.",
    "The fees for these are:",
    "• 10TB: US$49.99 / £39.99 per month. • 20TB: US$99 / £79.99 per month. • 30TB: US$149 / £119.99 per month.",
    "Every Google account will still include 15GB of free storage as standard, for use across all Google products. And remember: any ‘high’ quality photos uploaded prior to 1 June 2021 will not count towards that account cap.",
    "If you don’t want to shell out for a Google One subscription, you’ll need to stay within that 15GB limit. Luckily, there are a few options to help you do so. Removing unwanted images and deleting large files from Google Drive will both free up all-important space.",
    "Don’t fancy trawling through your entire library of ‘original’ quality images to find fuzzy and out of focus photos? Google has just launched a new tool that automatically identifies blurry images in your library, to suggest them for space-saving deletion.",
    "If you only want to store your favorite photos in the cloud and keep the rest backed up offline, there are several ways to save your snaps from Google Photos to a hard drive or your smartphone. Check out our Google Photos backup guide to find out how.",
    "If your account usage is likely to take you over the 15GB free limit, it’s worth exploring what other cloud photo backup services are available – such as iCloud – and whether these might represent a better deal for your needs.",
    "Amazon Photos, for example, offers a very similar set of features to Google Photos, including multi-device syncing and integrated editing tools. There are dedicated apps for Android, iOS and Fire devices, too. For a 100GB storage package, pricing is pretty much the same as the equivalent Google One plan.",
    "The real boon comes if you take out an Amazon Prime plan for US$12.99 / £7.99 per month. Prime members get unlimited full-resolution photo storage for free as part of their subscription. That’s alongside the next-day delivery and video streaming perks that also come with the package.",
    "If you’re happy to consider switching and will make use of those features, Amazon Photos is a very viable alternative. Check out our comprehensive Google Photos vs Amazon Photos feature for a more detailed comparison."
  ],
  "headers": {},
  "links": {
    "Google Photos": "https://www.techradar.com/reviews/google-photos",
    "Google One subscription": "https://one.google.com/about?hl=en_GB",
    "launched a new tool": "https://www.techradar.com/news/this-new-google-photos-tool-will-help-you-prep-for-the-end-of-free-storage",
    "Amazon Photos": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fb%3Fie%3DUTF8%26node%3D12153286031%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1456976368972466000-21",
    "Google Photos vs Amazon Photos": "https://www.techradar.com/news/google-photos-vs-amazon-photos-which-cloud-storage-giant-is-the-best"
  }
}