{
  "source": "https://www.techradar.com/news/new-studio-laptops-raise-the-bar-for-entry-level-performance",
  "title": "New Studio laptops raise the bar for entry-level performance",
  "category": "computing",
  "updated": "2021-05-11T14:44:47Z",
  "author": "mayank-sharma",
  "summary": "The new entry level laptops start at $799",
  "article": [
    "Nvidia has announced a new series of GeForce Studio laptops equipped with its latest GeForce RTX 3050 and 3050 Ti laptop GPUs.",
    "The RTX 3050 and 3050 Ti, which are designed to replace the GTX 1650 and 1650 Ti, help Nvidia expand their entry-level graphics processor line.",
    "Besides these, the new Studio laptops also include several with RTX 30 series laptop GPUs, expanding the number of RTX 30 Series laptops to more than 140.",
    "“There are now five times more RTX 30 Series gaming laptops that are thinner than 18mm compared with previous-generation RTX systems, delivering groundbreaking performance with very sleek and portable designs,” said Mark Aevermann, director of product management for laptops at Nvidia.",
    "Nvidia pitches the GeForce RTX 3050 Ti and 3050 Studio laptops to creative professionals such as graphic designers, photographers and video editors, promising to deliver performance without breaking the bank.",
    "The new line of Studio laptops introduces a wider range of options. The GeForce RTX 3050 Ti and 3050 laptops, and RTX A2000 professional laptops are pitched at creators and students.",
    "The mid range includes laptops powered by GeForce RTX 3070 and 3060 laptop GPUs or RTX A4000 and A3000 professional GPUs. The professionals get laptops powered by the GeForce RTX 3080 laptop GPU and RTX A5000 professional GPU.",
    "Most of the new GeForce RTX 30 Series laptops, including RTX 3060, 3070 and 3080, are available starting today from vendors including Acer, Alienware, Asus, Dell, Gigabyte, HP, Lenovo, and others, while the RTX 3050 Ti and 3050-based laptops will be available this summer."
  ],
  "headers": {
    "4": "Entry-level performance"
  },
  "links": {
    "Nvidia": "https://www.techradar.com/news/nvidia-geforce",
    "GeForce RTX 3050": "https://www.techradar.com/news/still-cant-buy-an-rtx-3080-new-gaming-laptops-are-here",
    "3050 Ti": "https://www.techradar.com/news/nvidia-rtx-3050-ti-laptop-gpu-specifications-leak-in-full",
    "GTX 1650 and 1650 Ti": "https://www.techradar.com/news/nvidia-geforce-gtx-1650-rtx-2060-and-rtx-3080-are-dominating-their-respective-gpu-generations",
    "RTX 30 series laptop GPUs": "https://www.techradar.com/news/geforce-rtx-3000-laptop-gpu-benchmarks-have-started-to-appear",
    "available starting today": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1005224135169548300&murl=https%3A%2F%2Fblogs.nvidia.com%2Fblog%2F2021%2F05%2F11%2Fgeforce-rtx-studio-laptops-3050-ti%2F",
    "Acer": "https://www.techradar.com/news/the-best-acer-laptops",
    "Alienware": "https://www.techradar.com/reviews/alienware-m17-r4-2021",
    "Asus": "https://www.techradar.com/news/best-asus-laptops",
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "Gigabyte": "https://www.techradar.com/reviews/gigabyte-aorus-17g-2021",
    "HP": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710",
    "Lenovo": "https://www.techradar.com/news/the-best-lenovo-laptops-2018"
  }
}