{
  "source": "https://www.techradar.com/news/sony-xperia-compact-leak-may-disappoint-if-youre-hoping-for-a-premium-small-phone",
  "title": "Sony Xperia Compact leak may disappoint if you're hoping for a premium small phone",
  "category": "phones",
  "updated": "2021-01-25T09:32:02Z",
  "author": "tom-bedford",
  "summary": "It's looking like a mid-ranger",
  "article": [
    "We've been hearing news of a new compact Sony phone coming for - well, for years now - but the latest rumors point to it being connected somehow to the Sony Xperia 1 III. However, while that was expected to be a premium smartphone, it sounds like the new compact model could feature lower spec than the brand's flagship phones.",
    "Popular leaker @OnLeaks has shared plenty of details on the new Sony Xperia Compact, as they're calling it, including renders and spec details. That name implies it might not be connected to the Xperia 1 III, as some previous rumors called it the Xperia 1 III Compact, but we'll have to wait to see for sure.",
    "If this information is correct, the phone could be more like an Xperia 10 III Compact, as the Xperia 10 line focuses on cheaper phones and these specs certainly point towards that.",
    "According to this leak, the Sony Xperia Compact phone will have a 5.5-inch screen - that's something we've heard before - broken up by a 'tear-drop' notch that houses the front camera.",
    "This front-facing camera is apparently 8MP, while on the back there are two snappers with a 13MP main and unspecified secondary camera. The fact there are only two rear cameras is evidence of the budget or mid-range nature of the phone.",
    "Some Sony staples seem to return here, as the leak suggests the phone will have a fingerprint scanner embedded on the power button as well as a bespoke camera button. Those are two things Sony is prone to use in its smartphones.",
    "Our main evidence of the mid-range nature of this phone comes from the cameras, though separately-leaked chipset information also points in the same direction. It seems as well as being smaller than its flagship cousin, the Sony Xperia Compact could also be weaker.",
    "Sony has previously released Compact variants of its older phones with high-end specs that match its flagship devices but in a smaller body. This no longer seems to be Sony's plan for its next Compact model.",
    "We'll have to wait until the compact phone launches to be sure though. If it's truly coming with the Sony Xperia 1 III it could come in the first few months of 2021, but if not it could still be many months or even years away."
  ],
  "headers": {},
  "links": {
    "Sony phone": "https://www.techradar.com/news/best-sony-phones",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "@OnLeaks": "https://www.voice.com/post/@onleaks/this-is-the-new-xperia-compact-the-iphone-12-mini-rival-android-fans-need-1611507056-509494028",
    "Xperia 10": "https://www.techradar.com/reviews/sony-xperia-10-review",
    "that's something we've heard before": "https://www.techradar.com/news/sony-xperia-1-iii-compact-looks-likely-thanks-to-a-new-55-inch-phone-leak",
    "chipset information": "https://www.techradar.com/news/sony-xperia-1-iii-compact-looks-likely-thanks-to-a-new-55-inch-phone-leak"
  }
}