{
  "source": "https://www.techradar.com/news/the-best-techradar-reads-you-may-have-missed-mar-01-2021",
  "title": "The best TechRadar reads you may have missed",
  "category": "appliances",
  "updated": "2021-03-01T11:25:22Z",
  "author": "axel-metz",
  "summary": "The very best of TechRadar from the week that was",
  "article": [
    "As weeks go in 2021, the last one was refreshingly uneventful. A distinct lack of political scandals, major public holidays and noisy sporting events meant the internet was a relatively quiet place as we bid farewell to February and ushered in March (already?) – but that’s not to say the busy world of tech enjoyed a week off.",
    "In fact, there's been a host of tech-related news and announcements over the last few days, from the exciting (the first-ever 165-inch foldable TV) to the downright confusing (Apple is developing… fabric?).",
    "Here, we’ve picked out the best TechRadar content of the week, from our round-up of the most exciting indie games coming to PC to our assessment of the title announcement for the upcoming Spider-Man movie. We’ve even gone ahead and resurrected an iPhone 6s and pitted it against a shiny new iPhone 12 – you know, just to see if Apple is telling the truth about how far its hardware has come.",
    "There’s also a host of review and opinion content for you to sink your teeth into, but if you’re after something a little easier on the eyes (but maybe not the ears), we’ve parked the latest episode of the TechRadar Noise Cancelling Podcast at the end of this article for your convenient listening pleasure.",
    "Samsung's Galaxy Watch 4 is ditching Tizen and switching to Wear OS – but we can’t work out why.",
    "Samsung’s software is easier to use, well optimized for smartwatches and has already done a much better job of bringing improvements and enhancements to its own platform, so we’ve been left scratching our heads as to why the tech giant is switching to what seems a lesser OS.",
    "Read more…",
    "After some good-natured (albeit infuriating) trolling from its cast, the upcoming Spider-Man movie finally received an official title – but what could No Way Home actually mean?",
    "Here, we break down four likely explanations, from the possible comic book origins of the title to some potential multiverse-related madness.",
    "Read more…",
    "Last week, Austrian tech brand C-Seed announced the world’s first-ever 165-inch foldable MicroLED TV, and it’s not (we repeat: not) cheap.",
    "At almost half a million dollars (or around £300,000 / AU$520,000, if you’re asking), the M1 4K is a beast of epic proportions – and we think it could give Samsung’s equally-massive MicroLED offering, The Wall, a run for its money.",
    "Read more…",
    "When Amazon announced that it’s newest smart display, the Echo Show 10, could follow you around the room using a rotating screen, our Homes Editor was decidedly sceptical.",
    "But after living with the device for just over a week, she may have been too quick to dismiss the value of the new feature...",
    "Read more…",
    "The recent Steam Game Festival gave us an exciting taste of what's to come for indie-playing PC gamers over the next year, showcasing everything from fantasy RPGs to third-person action shooters.",
    "Here, we round up the best of the bunch – including a game called You Suck at Parking. Ouch.",
    "Read more…",
    "iPhones have come a long way since Apple’s first smartphone launched in 2007. When it comes to photography, web browsing and video calling, the company’s older models can’t lay a glove on its shiny new products.",
    "But what about when it comes to gaming? We chatted with a handful of mobile game developers about how their upcoming high-profile titles will play on an iPhone 12 – and what you might miss out on if you don’t upgrade.",
    "Read more…",
    "Sonos is a huge player in the world of home audio, with its range of super-connected wireless speakers and soundbars making it a trusted brand for audiophiles and casual music listeners alike.",
    "Now it looks like the audio company is about to enter a new market, after patents and confirmation of a mystery product launch on March 9 have stoked rumors of the first Sonos headphones. Could this spell competition for the Apple AirPods Max?",
    "Read more…",
    "For a company famed for its output of world-leading smartphones and computing devices, it came as quite the surprise to learn that Apple is turning its attention to fashion.",
    "Alright, it’s not really getting into fashion, per se, but recent patents do suggest it’s developing a form of 'smart fabric' for sportswear. Documents indicate the company is working on tech that could be integrated into hats, belts, wrist bands, headbands, socks, gloves, shirts and pants. Watch out, Nike.",
    "Read more…",
    "The week's biggest tech news, in podcast form! We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's show is presented by Gareth Beavis, TechRadar's Global Editor-in-Chief, and Sherri L. Smith, Editor-in-Chief of Laptop Mag, with guests Jess Weatherbed, Computing Writer at TechRadar, and James Peckham, Phones Editor at TechRadar, who join in (remotely, of course) to talk about the last seven days in tech.",
    "Catch up on all the latest tech gossip, from our thoughts on the PlayStation VR 2, Disney Plus Star and BlizzCon 2021.",
    "Read more…",
    "You can find every episode of Noise Cancelling here too"
  ],
  "headers": {
    "4": "Beware of Wear OS",
    "7": "Spider-Man: No Way Home theories",
    "10": "A giant TV for giant pockets",
    "13": "A rotating smart display is actually… very useful?",
    "16": "Indies to look out for",
    "19": "How far has mobile gaming come?",
    "22": "Watch out, AirPods Max",
    "25": "Apple-wear",
    "28": "PlayStation VR 2 and Disney Plus Star: Noise Cancelling podcast episode 53"
  },
  "links": {
    "TechRadar Noise Cancelling Podcast": "https://www.techradar.com/news/playstation-vr-2-and-disney-plus-star-noise-cancelling-podcast-episode-53",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Read more…": "https://www.techradar.com/news/playstation-vr-2-and-disney-plus-star-noise-cancelling-podcast-episode-53",
    "The Wall": "https://www.techradar.com/news/samsung-the-wall-microled-tv",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "PlayStation VR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "Disney Plus Star": "https://www.techradar.com/news/disney-plus-star-explained",
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "You can find every episode of Noise Cancelling here too": "https://audioboom.com/channels/5019679"
  }
}