{
  "source": "https://www.techradar.com/news/wandavision-episode-7-recap-review",
  "title": "WandaVision episode 7 recap: the biggest reveal of the entire season",
  "category": "entertainment",
  "updated": "2021-02-20T12:03:37Z",
  "author": "richard-edwards",
  "summary": "Huge spoilers ahead",
  "article": [
    "Spoilers for the latest episode of WandaVision follow. Watch it first before reading this.",
    "Outside the Hex field, Monica Rambeau and Agent Jimmy Woo continue driving to meet her contact. Woo tells her that Darcy got past the last bit of the firewall at SWORD HQ, discovering R&D reports on a secret project called Cataract. He says that Hayward wasn’t decommissioning Vision, he was trying to bring him back online – but nothing worked until Wanda stole Vision’s body. Hayward is tracking Vision because he wants his “sentient weapon” back – Woo points out that someone needs to tell Wanda what’s going on.",
    "Wanda wakes up, realizing Vision isn’t next to her. The show cuts to her talking directly to the camera, as if she’s being interviewed. “Look, we’ve all been there, right? Letting our fear and anger get the best of us, intentionally expanding the borders of the false world we created…”",
    "A flashback to SWORD soldiers running away from the expanding Hex field.",
    "Billy and Tommy run into the bedroom, telling Wanda their videogame is freaking out – the controllers keep shifting eras, and even morph into playing cards. Wanda hides under the covers and says she’s resting her eyes. Billy tells her his head feels really noisy – he doesn’t like it. Wanda just wants to stay in bed. She tells the interviewer she’s planning on taking a “quarantine-style staycation” as punishment for her “reckless evening” – a whole day to herself. She pulls down the covers and realizes she’s still wearing her Scarlet Witch outfit from Halloween.",
    "Wanda comes downstairs and grabs some almond milk from the fridge. When she turns back after grabbing some cereal, it’s glitched into a carton of dairy milk – then the carton changes into a bottle. Wanda tells the interviewer she’s not sure what that’s all about – “it’s probably just a case of the Mondays. Am I right?”",
    "The opening credits show Wanda’s name written in a variety of formats, before revealing a ‘WandaVision: created by Wanda Maximoff’ title card.",
    "At the SWORD base outside the Hex, an agent tells Hayward that the WandaVision signal has disappeared – it’s now just dead air. He tells her they launch today – she acknowledges and walks away.",
    "Vision wakes up in the circus. One of the performers confuses him for a clown and tells him he’s late for a rehearsal with the escape artist – who just happens to be Darcy. She tells the unseen interviewer that her new gig “doesn’t really speak to my skill set”.",
    "Vision recognizes Darcy from outside the energy field – he says they locked eyes, that there was an understanding. She doesn’t remember him, though, and walks off.",
    "Wanda asks the kids if they’ve seen Vision. They say they haven’t and offer to go and look for him. “Well, if he doesn’t wanna be here, there’s nothing I can do about it,” she replies. Billy asks her about when Pietro mentioned “re-killing Dad” on Halloween. She tells Billy not to believe anything that man says – “he is not your uncle”. They ask who he is. She admits that she doesn’t have all the answers – in fact, “I have no answers. I’m starting to believe that everything is meaningless. You’re welcome to draw your own conclusions, but that’s just where I’m at.”",
    "Wanda admits to the camera that she might have gone a bit dark, but reasons that the kids must have inherited tough skin from their vibranium dad.",
    "Agnes arrives at the door and offers to take the boys to give Wanda some space.",
    "Wanda settles down to watch TV, but the TV and furniture start glitching and transforming into earlier models from previous episodes. Wanda uses her powers to change everything back.",
    "She assures the interviewer she’s fine.",
    "On the edge of the Hex field, they meet Monica’s contact, Major Goodner. Monica tells her that her mother would have appreciated her loyalty. “She’s not the only one we’re loyal to, Captain.” Goodner shows Rambeau and Woo the incursion vehicle they’ve constructed.",
    "Back at the circus, Vision continues to follow Darcy, trying to persuade her that she was part of a team monitoring a supernatural anomaly. She thinks he’s asking her out on a date, and she reluctantly agrees. After a weak piece of distraction involving a mime artist, Vision touches Darcy’s head to restore her real memories. “Part of me secretly wanted a guest spot on the show but seriously, that sucks.”",
    "She tells Vision she has answers, but first they have to run away from the circus. With Darcy due to go on stage, they steal a van and hit the road. Vision asks if his children are safe, and about the identity of “that imposter, Pietro”. She can’t help him.",
    "In the house, the glitching is increasing – even the stork is back. Wanda admits she doesn’t understand “why it’s all falling apart and why I can’t fix it.”",
    "“Do you think maybe this is what you deserve?” asks the unseen interviewer.",
    "COMMERCIAL BREAK",
    "A woman sits alone on a park bench. “Feeling depressed?” asks the voiceover. “Like the world goes on without you? Do you just want to be left alone? Ask your doctor about Nexus…” Apparently it’s a unique anti-depressant that works to anchor you back to your reality – or the reality of your choice. “You should not take Nexus unless your doctor has cleared you to move on with your life. Nexus: because the world doesn’t revolve around you. Or does it?”",
    "At Agnes’s house, Billy tells her she likes it there. Agnes asks if that’s because her rabbit, Señor Scratchy, is such a good listener, but Billy says it’s actually because it’s quiet. “You’re quiet, Agnes,” he explains. “On the inside.”",
    "Tommy asks Agnes if she thinks their mom is okay. Agnes says they don’t have to worry – Wanda can do anything, she’s supermom. Agnes admits to camera that she has a tendency to sugar-coat things.",
    "Outside the anomaly, Rambeau dresses in a spacesuit, ready to drive the rover into Westview, and vows to save Darcy. Goodner tells Woo that she’s driving SWORD’s most heavily armored space rover – Rambeau will “sail right through, unharmed”.",
    "Monica accelerates towards the energy field, but she doesn’t sail through it – it’s more like smashing into a wall. She tries to push through but the field’s density matches hers, and causes the front wheels to ride upwards. The field starts to absorb the rover – Goodner says the vehicle is disintegrating, but Woo corrects her, telling her it’s being “rewritten”. He gets on the radio to tell Monica to get out of the rover before it absorbs her. The rover is pulled in further before being thrown out. The front half of the vehicle been transformed into a standard 4x4.",
    "Monica looks at the field and looks at Woo – she says she can get through. As Woo urges her not to, she sprints back towards the Hex field and forces herself inside. As she fights her way into Westview, she hears flashbacks of her mother, Carol Danvers, and Nick Fury.",
    "When she emerges, her eyes are glowing blue. Her body has been changed somehow, and she can see the Hex field glowing. She runs towards the town.",
    "Darcy tells Vision the story of his death – how Wanda killed him to save half the universe, before Thanos rewound time, killed him all over again, and undid the universe-saving. They’re stopped by yet another red light. “It’s kind of overkill out here in the sticks, don’t you think?” As the light goes green and they try to pull away, a team arrives to repair the lights, holding them up further.",
    "Vision tells the unseen interviewer that he thinks Wanda is “creating these impediments to stop me returning home. I’m not amused.”",
    "Vision tries to get his head around who he is. He understands his thoughts are based on Tony Stark’s AI, JARVIS, and that his body was created by Ultron – but what does that make him now? Darcy assumed Wanda had just flicked a switch in his head, but that doesn’t explain why he can’t leave the Hex.",
    "“What I do know is I’ve been watching WandaVision for the past week,” she adds, “and the love you two have is real. You belong together.”",
    "Monica arrives at Wanda’s house and bursts in. Wanda asks how she got in here and tells her to get out of the house. Monica tries to warn her about Hayward’s plans for Vision, but Wanda uses her powers to launch the SWORD agent into the air. The neighbors – including Dottie – look on. “The drones, the missiles, Pietro – all you do is lie…” argues Wanda. As Monica tries to explain SWORD had nothing to do with Pietro, Wanda slams her into the sidewalk. Monica’s new powers activate and she’s surrounded by blue energy as she hits the ground. Her eyes glow blue again.",
    "Monica tells Wanda that the only lies she’s told are the ones Wanda put in her mouth, and challenges Wanda to take her out. Wanda pauses. Monica tells her that’s what makes her different to Hayward, that Hayward is prepared to burn Westview to the ground to get what he wants. “Don’t let him make you the villain.”",
    "“Maybe I already am,” answers Wanda.",
    "Agnes notices the disturbance through her front window.",
    "Monica tells Wanda she’s not afraid of her. She says she also lost the person closest to her – “the worst thing I can think of has already happened to me and I can’t change it, I can’t undo it. I can’t control this pain anymore and I don’t think I want to, because it’s my truth.”",
    "Agnes interrupts, telling Rambeau she’s outstayed her welcome, that Wanda’s been through enough. She tells Wanda to run along.",
    "Monica tells her again to take the field down, but Wanda refuses. “Don’t make me hurt you,” Wanda tells Monica.",
    "The traffic light repairs continue in front of Vision and Darcy, but before they can pull away, a class of kids crosses the road.",
    "Vision tells the interviewer he didn’t realize how much Wanda had endured. He suddenly realizes it’s absurd that he’s sitting there talking when he could be with his wife. He phases through the roof of the van and flies away.",
    "In Agnes’s house, Wanda asks where the twins are – Agnes says they’re probably in the basement. She walks down the stairs and the boys are nowhere to be seen. She finds herself in a huge, creepy cellar, full of vines, with magical texts and skulls. Agnes walks into the room, holding her rabbit. “Wanda, Wanda, you didn’t think you were the only magical girl in town, did you? The name’s Agatha Harkness. Lovely to finally meet you, dear.” She uses her magic to put something in Wanda’s brain.",
    "The show cuts to the credits for an all-new TV show called ‘Agatha All Along’. A woman in witchy clothes morphs into 1950s Agnes, as the theme song reveals that she’s been “pulling every evil string” throughout the series. The credits show her using her malevolent influence at Wanda and Vision’s magic show, controlling Herb, watching Pietro arrive on the doorstep, and making Vision believe she was just an ordinary Westview resident under Wanda’s spell. It even turns out she’s the interviewer who’s been grilling Wanda throughout the episode.",
    "“And I killed Sparky, too!” she laughs.",
    "PLEASE STAND BY",
    "MID-CREDITS STING",
    "Monica looks around Agnes’s house, and opens the hatch to the basement. She sees the stairwell glowing with magical energy, and is taken aback when Pietro appears behind her. “Snoopers gonna snoop,” he says.",
    "Verdict:",
    "Talk about hiding in plain sight…",
    "We always suspected that Agnes was much more than your average nosy neighbor, and WandaVision has left some pretty strong hints about her true identity. Even so, the reveal in the aptly titled ‘Breaking the Fourth Wall’ is a big enough deal to rival the surprise of Pietro turning up on Wanda’s doorstep.",
    "It also highlights the writing team’s instinctive understanding of what makes the best episodic TV work. Because as well as being a big-budget slice of MCU action, WandaVision is – at heart – a mystery, that revels in keeping us hanging on for the next piece of the puzzle. There’s no point seeding clues or mysteries if you never provide any answers, but this show knows when to tease and when to deliver a colossal revelation.",
    "Okay, you don’t need a Vision-scale intellect to spot that ‘Agnes’ is just Agatha Harkness shortened, or that Billy’s inability to hear her thoughts means she can’t be an ordinary Westview resident. Even the fact she wore a witch’s outfit on Halloween feels like a blatant clue – in hindsight.",
    "But WandaVision consistently keeps things just ambiguous enough. So when Agatha takes the opportunity to tell Wanda who she is – how much is Kathryn Hahn enjoying herself at this point? – you’re totally on board for the ride. Using the ‘Agatha All Along’ titles to explain Ms Harkness’s evil schemes is possibly the most memorable sequence in a show that’s already had more than its fair share. Is she really the show's Big Bad, or is someone else pulling the strings?",
    "While Agnes/Agatha undoubtedly steals the show, the episode doesn’t just belong to her. The noughties’ fascination with sitcom characters talking directly to the camera couldn’t have come at a better time for WandaVision’s story arc – if ever there was a time to get inside the characters’ thoughts, this is it.",
    "Darcy and Vision also make for a fun double act, but our biggest questions now concern Monica Rambeau’s newly acquired superpowers. They’ve only been hinted at so far, but she could be well on the way to powering up to Avenger-level – as she did in the comics. What exactly do her powers allow her to do? And what will she do with them? It looks like she holds the key to getting the unfortunate residents of Westview out alive.",
    "New episodes of WandaVision are available every Friday on Disney Plus."
  ],
  "headers": {
    "55": "Marvel-ous facts"
  },
  "links": {
    "Monica Rambeau’s": "https://www.techradar.com/news/wandavision-who-is-monica-rambeau"
  }
}