{
  "source": "https://www.techradar.com/news/the-next-macbook-pros-are-rumored-to-be-getting-a-1080p-webcam-upgrade",
  "title": "The next MacBook Pros are rumored to be getting a 1080p webcam upgrade",
  "category": "computing",
  "updated": "2021-07-11T13:30:55Z",
  "author": "david-nield",
  "summary": "For a better FaceTime",
  "article": [
    "As a result of the global pandemic we've all been living through, we're all now far more familiar with our webcams than we used to be – and the latest rumor around the upcoming 14-inch and 16-inch MacBook Pro refresh is that the integrated FaceTime camera will finally get an upgrade to 720p.",
    "That's according to tipster @dylandkt on Twitter, who has a solid record with leaks in the past. After the new and improved camera arrives on the MacBook Pros, it will come to all of the other models in the Mac line-up, the same source says.",
    "While nothing is official yet, the rumor is definitely plausible: MacBooks and iMacs have been stuck with 720p quality webcams for several years at this point, and one of the notable upgrades on the new 24-inch iMac launched by Apple in April.",
    "Apple knows that webcams are more important than ever on a modern-day computer, so it makes a lot of sense that the quality of the FaceTime camera would get a bump. Last year the MacBook Air and 13-inch MacBook Pro were updated with the new M1 chip, but there was no change to the camera.",
    "There has been some debate about when the next MacBook Pro refresh might happen, but only yesterday we heard that these new laptops would indeed make an appearance in 2021 – that's according to one of the most reliable analysts in the business.",
    "When the Apple computers do make an appearance, we're expecting them to come with the new and improved Apple M1X chip inside. That will then be closely followed by the M2 chip, which could well make its debut in the 2022 edition of the MacBook Air.",
    "We aren't expecting many changes to the design of the incoming laptops, although the rumors are that the Touch Bar is going to be quietly ushered out of the door. There has also been speculation that we'll see a few more ports added to the mix, which would add to the appeal of the new laptops if they don't impact the size and weight.",
    "While an upgraded 1080p FaceTime camera might not end up convincing anyone to upgrade to the new MacBook Pros on its own, it would definitely be a welcome improvement in a key area, on a laptop that's already excellent as it is.",
    "Via AppleInsider"
  ],
  "headers": {},
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "@dylandkt": "https://twitter.com/dylandkt/status/1413853957634547714",
    "the new 24-inch iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "we heard that": "https://www.techradar.com/news/new-macbook-pros-still-on-target-for-later-in-2021-rumor-claims",
    "Apple M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "make its debut": "https://www.techradar.com/news/new-macbook-air-could-arrive-early-2022-with-m2-chip-and-imac-colors",
    "the rumors are": "https://www.techradar.com/news/new-macbook-pro-could-kill-off-touch-bar-rumors-suggest",
    "AppleInsider": "https://appleinsider.com/articles/21/07/10/updated-1080p-facetime-camera-rumored-for-14-inch-16-inch-macbook-pro"
  }
}