{
  "source": "https://www.techradar.com/news/samsung-galaxy-buds-2-might-soon-be-a-reality",
  "title": "Samsung Galaxy Buds 2 might soon be a reality",
  "category": "wearables",
  "updated": "2021-03-30T10:03:53Z",
  "author": "rhys-wood",
  "summary": "The second generation is coming",
  "article": [
    "Samsung might finally be gearing up to launch the Galaxy Buds 2, as evidenced by some intriguing lines of code within the Samsung Galaxy Wearable app’s APK file data originally discovered by Android Police. Judging by the name, it looks like Samsung is finally preparing to introduce the second generation of the Galaxy Buds line of products.",
    "Android Police was able to unearth a few interesting details about the Galaxy Buds 2 by delving into the code in the Galaxy Wearable's APK data. The Galaxy Buds 2 are seemingly being developed under the codename ‘berry,’ and will likely be able to connect to multiple devices at the same time. It’s anticipated that the true wireless earbuds could launch alongside the upcoming Galaxy Z Fold 3 in the latter half of the year.",
    "The Galaxy Buds 2 will likely compete with Apple's upcoming third generation of AirPods, which are also projected to debut later this year. As was the case with previous generations, Samsung will likely be looking to undercut Apple’s flagship earbuds when it comes to pricing.",
    "Speaking of price point, while nothing is official as of yet, we expect the Galaxy Buds 2 to be comparable to the Galaxy Buds Pro, which retailed for $199 / £219 / AU$349. The Galaxy Buds Pro were already cheaper than the AirPods Pro ($249 / £249 / AU$399), so it’s possible that Samsung will want to keep a similar price gap when moving to the next generation of earbuds.",
    "It’s possible that we can expect the Galaxy Buds 2 to improve upon the feature set of the Galaxy Buds Pro. For example, we’d love to see improved noise cancellation from the Galaxy Buds 2, as well as a better form factor and overall improved sound quality.",
    "Samsung will have to meet this heightened level of quality as Apple most likely won’t be resting on their laurels. The AirPods Pro already boasts good noise cancellation and a comfy form factor that we can only assume will improve with Apple’s third generation lineup of earbuds."
  ],
  "headers": {
    "3": "Galaxy of sound"
  },
  "links": {
    "Android Police": "https://www.androidpolice.com/2021/03/29/galaxy-wearable-update-reveals-new-galaxy-buds-in-the-works-apk-teardown/",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review"
  }
}