{
  "source": "https://www.techradar.com/news/kia-ev6-electric-car-beats-porsche-ferrari-and-lamborghini-in-drag-race",
  "title": "Kia EV6 electric car beats Porsche, Ferrari and Lamborghini in drag race",
  "category": "car-tech",
  "updated": "2021-10-14T10:07:38Z",
  "author": "john-mccann",
  "summary": "Plus panoramic curved display and long range",
  "article": [
    "The Kia EV6 has been officially unveiled, with the electric car boasting impressive supercar-challenging performance, large panoramic curved display and long range.",
    "Available in three core models - EV6, EV6 GT-Line and EV6 GT - it's the latter which offers Kia's touted supercar performance.",
    "According to Kia, the EV6 GT can shift from 0-100km/h (0-62mph) in 3.5 seconds, and it can reach a top speed of 260 km/h (around 160 mph).",
    "In a 400m drag race, the EV6 GT was shown to beat the Lamborghini Urus, Mercedes-AMG GT, Porsche 911 Targa 4 and Ferrari California T - showing just how quick it is off the line.",
    "You can watch the drag race unfold in the video below (from 12:15)",
    "Kia will offer a 58kWh standard range battery and 77.4kWh extended range (up to 510km / 316 miles) battery option in both two-wheel drive (2WD) and all-wheel drive (AWD) variants for the EV6 and EV6 GT-Line. The top-performance EV6 GT model will only be available with the 77.4kWh battery and AWD.",
    "The 58kWh EV6 model can accelerate from 0-to-100 km/h in 6.2 seconds, while the AWD 77.4kWh EV6 can do it in 5.2 seconds.",
    "There's support for 800V ultrafast charging, and the 2WD, 77.kWh extended range battery can be replenished from 10% to 80% in 18 minutes at supported fast chargers, where it's also possible to gain 100km (62 miles) of range in 4.5 minutes.",
    "Moving into the cabin of this crossover SUV, the Kia EV6 features an integrated panoramic curved display, which houses two, 12-inch screens. One is the digital cluster display which sits behind the steering wheel, while the other sits atop the center console and provides a touch interface for all your infotainment needs.",
    "Kia has reduced the number of physical buttons and switches in the EV6, but it has provided quick access to key settings. This is done via a 'switchable controller' bar which sits below the central screen and features LCD soft keys that allows you to customize the cabin to your needs.",
    "The LCD display on the bar can change the button options shown depending on what you're trying to control, such as climate control or audio playback.",
    "The EV6 also comes with an AR heads-up display, which beams key information including vehicle speed, turn-by-turn navigation instructions and alerts from the driver assistance system into the driver's line of sight.",
    "Kia is also making a 14-speaker Meridian surround audio system available in the EV6, although this is likely going to be an optional extra.",
    "The EV6 also has another little party piece - the ability to act as a power generator for other devices. Like sister firm's Hyundai Ioniq 5, you can plug in and charge a laptop, electric bike or even another electric car from the EV6.",
    "Kia EV6 availability in some markets will start in July 2021, while it's expected to reach UK customers in October 2021 and North America customers in Q1 2022.",
    "The Kia EV6 price for the UK starts at £40,895 for the EV6 model, £43,895 for the GT-Line and £58,295 for the GT - pitting it directly against the Tesla Model 3."
  ],
  "headers": {
    "8": "In-car tech"
  },
  "links": {
    "Kia EV6": "https://www.techradar.com/news/kia-ev6-first-drive",
    "Hyundai Ioniq 5": "https://www.techradar.com/news/hyundai-ioniq-5-review",
    "Tesla Model 3": "https://www.techradar.com/news/tesla-model-3"
  }
}