{
  "source": "https://www.techradar.com/news/nvidia-turing",
  "title": "Nvidia Turing release date, news and features",
  "category": "computing",
  "updated": "2021-02-02T21:58:31Z",
  "author": "kevin-lee",
  "summary": "The architecture behind Nvidia’s first ray tracing GPU",
  "article": [
    "While it seemed to take forever for Nvidia to release its next-generation Turing graphics cards, it was worth the wait once they arrived. This architecture has been satisfying gamer’s graphics needs for some time now and the impressive performance out of these GPUs has been duly noted by the computer world.",
    "The Nvidia Turing lineup is quite striking, from the original Nvidia GeForce RTX 2080 Ti, RTX 2080, RTX 2070 and RTX 2060, to the newer Super RTX cards led by the RTX 2080 Super. They’re still among the best graphics cards available to power the next couple years of gaming (especially considering how hard it is to get one of the newer generation Nvidia Ampere GPUs). And, don’t forget the Titan RTX card for the prosumer crowd.",
    "Real-time ray tracing has come to the masses thanks to Nvidia Turing, revolutionizing how GPUs render the best PC games. And, considering how games like Metro Exodus and Shadow of the Tomb Raider look with ray tracing turned on, there’s no turning back. You can even enable ray tracing on non-RTX cards (though you will suffer a major performance hit).",
    "And, with these graphics cards showcasing their graphics prowess in the desktop arena, it’s no surprise that Nvidia is hitting the mobile sphere as well. Its Turing-based GeForce RTX 2080 Super and RTX 2070 Super graphics cards are now available for gaming laptops. You can now find a ton of laptops equipped with Nvidia Turing’s mobile GPUs.",
    "Of course, there are Nvidia Turing cards out there for people that don’t need as much power: the GeForce GTX 1660 Ti, GeForce GTX 1660 and GeForce GTX 1650. They’re not quite as powerful as the RTX 2000 cards, but they’re significantly more affordable. On the other side of the spectrum, there’s the Nvidia Ampere series, Turing’s successor, which are blowing the competition away.",
    "Still, the Nvidia Turing cards remain among the best on the market today, and the most influential graphics cards to ever hit the shelves.",
    "All of the currently-announced Nvidia Turing GPUs are now out in the wild – from the GTX 1660 and 1660 Ti to the RTX Super cards: RTX 2060 Super, RTX 2070 Super and RTX 2080 Super.",
    "At CES 2019, we didn’t just finally get an RTX 2060 announcement, but also over 40 gaming laptops sporting the mobile version of Nvidia RTX graphics. These days, the best gaming laptops, alongside the ones we saw at CES 2019 like the Alienware Area 51m, are all packing the latest Nvidia Turing graphics.",
    "On the other hand, the GeForce RTX 2060 Super and GeForce RTX 2070 Super hit the streets in July to compete with AMD Navi. If you were looking for a graphics card that you won’t have to take out a personal loan to afford, these are certainly the more affordable options. The pricier GeForce RTX 2080 Super followed, seeing a release date of July 23rd.",
    "Thankfully, the RTX-series cards are readily available now after some initial limited availability. And, thanks to the release of the newer cards, you’ll likely find more than a few older models on sale every day.",
    "What’s more is users will have these RTX Super cards available on-the-go as well. Nvidia just recently announced that the RTX 2080 Super and RTX 2070 Super graphics cards are now going to be available for gaming laptops in April 2020. That’s alongside the GeForce RTX 2060 laptops, which are going to start coming in at $999 (about £800, AU$1,640).",
    "Although the Nvidia Turing series started with the Quadro RTX GPUs, we're far more interested in the graphics cards available for consumers. If you wanted to check out these enterprise-leaning parts, we’ve got you covered here. Otherwise, the prices for Nvidia Turing graphics cards are as follows:",
    "Overall, the prices for Nvidia's newest graphics cards seem to have risen with the Nvidia GeForce RTX 2080 Ti taking the place of Nvidia’s past Titan cards. This shift up was sadly seen across the entire lineup.",
    "That is, until the Super RTX cards rolled out. Perhaps in an effort to keep up with the growing popularity of AMD’s Radeon RX 5700 GPUs, Nvidia released the RTX 2070 Super and RTX 2080 Super, at a lower price – $100 less, to be exact – than their predecessors when they were first released. Essentially, anyone looking to upgrade to one of the RTX Turing cards can now pay less for even better performance.",
    "Then there’s the Turing GTX cards. These are heralded by the $279 (£259, AU$469) GTX 1660 Ti, and provide phenomenal value at the low end. The most recent of these cards, the GTX 1650, is priced at $149 (about £115, AU$210), and is positioned to compete with the AMD Radeon RX 570.",
    "The marquee feature of Nvidia Turing is the inclusion of ray-tracing, which can render more realistic visuals and lighting in real time without having to fall back on programming tricks. Through specialized RT cores, these graphics cards can basically calculate how light and sound travel in a 3D environment at a rate of up to 10 GigaRay/s on the RTX 2080 Ti. These specialized cores also allow Nvidia Turing-based graphics cards to process ray tracing up to 25 times faster than Pascal.",
    "When these RT Cores aren’t in use for ray tracing, they essentially switch off, ceasing to draw any power.",
    "In addition to these RT cores, the Turing Architecture also features Tensor Cores, like the ones found in Volta. These specialized cores enable artificial intelligence and neural networking so that Turing cards get better at rendering over time – something previously exclusive to supercomputers.",
    "With the ability to deliver 500 trillion Tensor operations a second, this technology accelerates deep learning training and inferencing. This allows Nvidia to offer Deep Learning Super Sampling (DLSS), which could be a version of super sampling that won’t bring your computer to its knees.",
    "Even for games that don’t support this new DLSS tech, these AI-fueled cores should deliver traditional anti-aliasing much more efficiently – up to eight times.",
    "As with Volta, Nvidia Turing is adopting GDDR6 memory – up to 11GB in the RTX 2080 Ti, which can clock in at up to 14Gbps, and up to 8GB in the RTX 2080 Super, clocking in at up to 15.5Gbps. That’s quite the leap over the Pascal-powered Nvidia Titan Xp that clocked in at 11.4Gbps.",
    "The Nvidia GeForce RTX 2080 Ti is an absolute behemoth of a GPU. With 4,352 CUDA cores, 11GB of GDDR6 VRAM with a 352-bit memory bus and 18 billion transistors, it’s capable of 4K Ultra gaming at high refresh rates for years to come. It’s no wonder it comes with such a high price tag.",
    "The more mainstream RTX 2080 and RTX 2070, as well as the RTX 2060 Super and RTX 2070 Super, are also quite impressive and absolutely destroy the previous generation of GPUs. The former will feature 2,944 CUDA cores, 8GB of GDDR6 memory and clocks in at a 1.5GHz base frequency. The 2070, though is be a bit weaker, coming with 2,304 CUDA cores 8GB of GDDR6 VRAM and clocked at a 1,410Mhz base frequency.",
    "And, while the RTX 2060 is basically just a cut-down RTX 2070, with the same TU106 GPU, but with 1,920 CUDA cores, 6GB of GDDR6 VRAM and a boost clock of 1,680 MHz, it’s still a formidable graphics card.",
    "Nvidia has also launched some non-RTX cards, starting with the GTX 1660 Ti. This entry-level card features 1,536 CUDA cores, 6GB of GDDR6 VRAM at 12Gbps, and a base clock of 1,500 MHz. It’s slower than the RTX 2060, but it’s a substantial upgrade over the GTX 1060 it replaces.",
    "Team Green’s second non-RTX GPU, the GTX 1660 features 1,480 CUDA cores, 6GB of GDDR5 video memory and a reference boost clock of 1,785MHz. It might not sound mighty on paper, but between its low price and fantastic 1080p gaming performance, it’s currently the absolutely best entry-level graphics card you can buy.",
    "A third non-RTX GPU has been released, the Nvidia GeForce GTX 1650. This low-end GPU features the TU117 GPU, clocked at 1,485GHz with a boost of 1,665GHz. This budget card features 4GB of GDDR5 VRAM with 128GB/s of memory bandwidth on a 128-bit bus.",
    "As long as you have the high-end specs to back them up, the new Turing RTX cards are able to perform much faster than their Pascal equivalents. These cards will be able to push it even further once DLSS or deep learning super sampling is more widespread. Additionally, due to the AA improvements in the Tensor cores, we’re seeing about a 20-40% increase in games that don't support DLSS.",
    "In our benchmarks, the GeForce RTX 2080 outperforms the GeForce GTX 1080 Ti by about 11% and the Nvidia GTX 1080 by a more impressive 32% in Middle Earth: Shadow of War in 4K. This performance difference is even more massive when you look at the Nvidia GeForce RTX 2080 Ti. It’s not only 20% faster than the RTX 2080 in the same title, but beats out the last-generation 1080 Ti by a massive 30%, destroying the GTX 1080 with a 45% performance delta.",
    "Then, there’s the RTX 2080 Super, the high-end offering in the Super RTX series. When pitted against its predecessor, we found the RTX 2080 Super is only about 4-5% faster than the RTX 2080 Founders Edition, which may not be worth the upgrade if you’ve already invested in the RTX series. However, if you’re upgrading from a GTX card, and you don’t have the funds to shell out for a $1,199 RTX 2080 Ti, the RTX 2080 Super is as close as you’re going to get to robust 4K gaming experience.",
    "The Nvidia GeForce RTX 2070 is less impressive, and while it does absolutely wipe the floor with the GTX 1070, it’s essentially neck in neck with the GTX 1080 – barely hitting a 10% performance increase at 4K in Shadow of the Tomb Raider. At this price point, we expected more, especially after seeing the RTX 2080 and RTX 2080 Ti’s impressive performance.",
    "On the other hand, we’re very impressed with the price-to-performance ratio of the RTX 2070 Super and RTX 2060 Super. This is especially true for the former, which offers a much better performance than the vanilla RTX 2070 at $100 cheaper, and can even breach the RTX 2080’s territory. With boosted specs, the RTX 2060 Super will easily handle 1440p gaming with ray tracing enabled, rivaling the RTX 2070’s performance.",
    "The RTX 2060 is obviously the weakest of the bunch, but you shouldn’t dismiss it outright. The mid-range Nvidia Turing card far outclasses the GTX 1060, but what’s more surprising is that it surpasses the GTX 1070 Ti – for a lower asking price. We were able to get 90 fps in Shadow of the Tomb Raider at 1080p, whereas the 1070 Ti lagged behind at 86 fps. That’s not a huge difference, but the 2060 is $100 cheaper at launch.",
    "In traditional games, there’s no question that Nvidia Turing marks a total upgrade from Pascal. And, over time as drivers mature and users get ready to start overclocking their Turing cards, the difference is only going to grow. That’s not to mention the inclusion of incoming DLSS and ray tracing in games, which should only increase the Nvidia Turing performance gap.",
    "When it comes to ray tracing, there was only one title that supported it at the time of writing: Battlefield V. And, in that title, the Nvidia Turing cards use a hybrid rendering technique – combining both traditional rasterization and ray tracing in order to produce playable frame rates.",
    "Nvidia utilizes “Bounding Volume Hierarchy,” or BVH to track large portions of the scene being rendered for whether or not a ray is being bounced. The RTX cores will then dig deeper into these large rendering zones until it finds the polygon that’s getting hit by the light ray.",
    "This method impacts performance far less than tracking each ray live, but it’s still very demanding. In our own testing, you’ll be stuck at 1080p if you’re looking for smooth gameplay with ray tracing turned on. However, with Nvidia’s latest RTX drivers, it’s claiming to increase performance by up to 50% for ray tracing. We’ll be sure to test this and report back, but we have to wait for the new Battlefield V patch to do it.",
    "As for the Nvidia GeForce GTX 1660 Ti, you can expect a much better performance than the GTX 1060 for less money – up to 56% faster in Shadow of the Tomb Raider at 1080p in our testing. That makes the 1660 Ti a beast when it comes to value."
  ],
  "headers": {
    "6": "Nvidia Turing release date",
    "11": "Nvidia Turing price",
    "15": "Nvidia Turing specs",
    "27": "Nvidia Turing Performance"
  },
  "links": {
    "Nvidia GeForce RTX 2080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-ti-review",
    "RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080",
    "RTX 2070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070",
    "RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "Super RTX cards": "https://www.techradar.com/news/nvidia-super-rtx",
    "RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "Titan RTX card": "https://www.techradar.com/news/nvidia-titan-rtx-release-date-news-and-features",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Shadow of the Tomb Raider": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot",
    "enable ray tracing on non-RTX cards": "https://www.techradar.com/news/some-geforce-gtx-graphics-cards-now-support-ray-tracing",
    "Turing-based": "https://www.techradar.com/news/nvidia-turing",
    "GeForce RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super",
    "RTX 2070 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
    "available for gaming laptops": "https://www.techradar.com/news/nvidia-geforce-rtx-super-mobile-gpus-are-here-to-provide-superpowered-gaming-laptops",
    "ton of laptops": "https://www.techradar.com/news/heres-every-nvidia-geforce-gtx-1650-and-1660-ti-laptop-announced-so-far",
    "GeForce GTX 1660 Ti": "https://www.techradar.com/news/best-nvidia-geforce-gtx-1660-ti",
    "GeForce GTX 1660": "https://www.techradar.com/reviews/gigabyte-geforce-gtx-1660-oc-6g",
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "RTX 2060 announcement": "https://www.techradar.com/news/nvidia-finally-announces-the-geforce-rtx-2060-graphics-card",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "saw at CES 2019": "https://www.techradar.com/news/ces-2019-has-made-gaming-laptops-exciting-again",
    "Alienware Area 51m": "https://www.techradar.com/reviews/alienware-area-51m-review",
    "GeForce RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "GeForce RTX 2070 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
    "AMD Navi": "https://www.techradar.com/news/amd-navi",
    "Quadro RTX GPUs": "https://www.techradar.com/news/nvidia-announces-the-turing-architecture-and-its-first-ray-tracing-gpu",
    "here": "https://www.techradar.com/news/nvidia-announces-the-turing-architecture-and-its-first-ray-tracing-gpu",
    "Radeon RX 5700": "https://www.techradar.com/reviews/amd-radeon-rx-5700",
    "Volta": "https://www.techradar.com/news/nvidia-volta",
    "you have the high-end specs": "https://www.techradar.com/news/benchmarks-confirm-nvidia-geforce-rtx-2080-ti-and-rtx-2080-are-for-top-end-gaming-pcs-only",
    "GeForce GTX 1080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1080-ti",
    "Nvidia GTX 1080": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1080-ti",
    "pitted against its predecessor": "https://www.techradar.com/news/nvidia-geforce-rtx-2080-super-vs-rtx-2080-what-has-changed",
    "increase performance by up to 50% for ray tracing.": "https://www.techradar.com/news/nvidia-claims-new-drivers-massively-boost-geforce-rtx-ray-tracing-performance-in-battlefield-v"
  }
}