{
  "source": "https://www.techradar.com/news/data-breaches-are-almost-the-norm-for-many-businesses-these-days",
  "title": "Data breaches are almost the norm for many businesses these days",
  "category": "computing",
  "updated": "2021-11-11T12:54:22Z",
  "author": "mayank-sharma",
  "summary": "Move to the cloud has only exacerbated the issue, reveals report",
  "article": [
    "A global survey of app security managers has revealed that a majority (91%) of the respondents had experienced security breaches in the last year as a direct result of a vulnerable application.",
    "Compiled by cybersecurity specialists Checkmarx, the report shares alarming trends in breaches and supply chain loopholes, based on a survey of over a thousand AppSec managers and developers.",
    "“Security breaches within the enterprise have unfortunately become a societal norm, so identifying those gaps and creating the solutions to eliminate them is integral to the success of businesses today,” said Maty Siman, Checkmarx founder and CTO.",
    "Surprisingly, over half of the respondents (54%) blame the shift to the cloud, saying that the move increased their concerns around secure application development.",
    "Securing the supply chain emerged as one of the challenges of ensuring application security. More than a quarter (26%) of the respondents cited “gaining visibility into open source packages being utilized in custom applications” as the biggest challenge when it comes to visualizing and securing software supply chains.",
    "Still, despite facing multiple breaches in the last year due to vulnerable applications, an overwhelming majority (81%) of developers say they can build a secure product.",
    "Just about half (49%) of all surveyed software developers said they are adopting a DevSecOps model with security as a supply chain focus in order to reduce the risk of a breach, with 42% of AppSec managers saying the same.",
    "The report also revealed that following an AppSec-related incident, 38% of AppSec managers and software developers said their organizations deployed penetration testing exercises to prevent future breaches, while 40% of software developers stated their organizations issued mandatory AppSec training.",
    "Protect your network with the help of these best firewall apps and services, and ensure your computers are running these best endpoint protection tools to shield them from cyber-attacks."
  ],
  "headers": {
    "4": "Identifying loopholes"
  },
  "links": {
    "security breaches": "https://www.techradar.com/news/data-breaches-are-costing-businesses-more-than-ever",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "survey": "https://checkmarx.com/blog/the-current-state-of-appsec-a-notable-survey-to-share/",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Securing the supply chain": "https://www.techradar.com/news/defending-against-the-threat-of-software-supply-chain-attacks",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "software developers": "https://www.techradar.com/news/best-laptop-for-programming",
    "best firewall apps and services": "https://www.techradar.com/best/firewall",
    "best endpoint protection tools": "https://www.techradar.com/news/best-endpoint-security-software"
  }
}