{
  "source": "https://www.techradar.com/news/new-ipad-air-and-ipad-pro-models-could-both-get-oled-screens-next-year",
  "title": "New iPad Air and iPad Pro models could both get OLED screens next year",
  "category": "tablets",
  "updated": "2021-03-05T10:07:12Z",
  "author": "james-rogerson",
  "summary": "The Air gets priority",
  "article": [
    "Apple could be planning significant screen upgrades for its iPad ranges, and oddly it might not even be the premium iPad Pro range that gets those upgrades first, with a move to OLED apparently planned and the iPad Air range possibly being the first to get it.",
    "That’s according to DigiTimes, which claims that an iPad with a 10.9-inch OLED screen could go into production towards the end of 2021, for release in 2022. The site doesn’t name the iPad, but with that screen size it’s likely an iPad Air, given that the iPad Air 4 (2020) has a 10.9-inch display.",
    "Then, following that Apple is apparently also considering moving to OLED for its 12.9-inch iPad Pro models, as well as for 16-17-inch MacBook Pro models. These would also be released in 2022, but Apple apparently hasn’t decided on whether to switch to OLED for them, suggesting they’d probably land later than the OLED iPad Air, if at all.",
    "So why wouldn’t Apple give its premium Pro models an OLED upgrade before its mid-range Air tablets? It could be because the iPad Pro 2021 is already rumored to be getting upgraded to a Mini LED screen.",
    "Indeed, according to DigiTimes, Mini LED and OLED will exist on Apple’s tablet ranges side by side, with each targeting different consumer groups. This is in line with leaks we’ve heard before, with one source previously saying that the iPad Pro range would switch to Mini LED in 2021, then to OLED in 2022.",
    "Both Mini LED and OLED should be worthwhile upgrades. The former means using smaller LED backlights for an LCD display, leading to improved contrast ratio and color reproduction. OLED offers similar improvements, and is currently the display type of choice on high-end phones, including the iPhone 12 range.",
    "It seems then that the days of conventional LCD iPad displays might be numbered if even the iPad Air range is getting an upgrade soon, but of course we’d take all of this with a pinch of salt until it’s official.",
    "Via MacRumors"
  ],
  "headers": {
    "3": "Mini LED then OLED"
  },
  "links": {
    "DigiTimes": "https://www.digitimes.com/news/a20210305PD209.html",
    "iPad Air 4 (2020)": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "one source": "https://www.techradar.com/news/ipad-pro-2021-rumor-points-to-a-mini-led-screen-saving-oled-upgrade-for-2022",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "MacRumors": "https://www.macrumors.com/2021/03/04/10-9-inch-oled-ipad-early-2022/"
  }
}