{
  "source": "https://www.techradar.com/news/ipad-pro-2021-the-worlds-best-tablet-is-now-at-its-lowest-price",
  "title": "iPad Pro 2021, the world's best tablet, is now at its lowest price",
  "category": "tablets",
  "updated": "2021-11-20T14:30:48Z",
  "author": "james-peckham",
  "summary": "Almost every model of the iPad Pro 2021 is now discounted",
  "article": [
    "The iPad Pro 2021 comes in two sizes, two different connectivity models and five storage sizes. Knowing which one to buy is complicated, but luckily almost every model of the new iPad Pro 2021 is discounted right now for Black Friday.",
    "The Black Friday iPad deals are heating up, and we've seen a discount on almost every single version of the latest and greatest tablet from Apple. Below you can find all the best deals we've seen so far.",
    "Not in the US or UK? Scroll down for deals in your region.",
    "The iPad Pro 2021 is the best tablet money can buy right now, but it's a remarkably expensive device and it won't be for everyone.",
    "In our review of the 12.9-inch variant, we noted: \"It isn’t for everyone, on account of its large size and high price tag, and you may be better served by another more portable and affordable tablet.\"",
    "However, if you are looking for the ultimate tablet experience and you're looking for a discount on the iPad Pro 2021 this is the best time of year for you to pick up either this or the iPad Pro 11-inch.",
    "No matter where you live, you'll find all the lowest prices for the iPad Pro 2021 below."
  ],
  "headers": {
    "3": "Today's best iPad Pro 2021 Black Friday deals in the UK",
    "6": "More iPad Pro 2021 deals",
    "7": "More Black Friday deals in the UK"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday iPad deals": "https://www.techradar.com/black-friday/black-friday-ipad-deals",
    "iPad Pro 11-inch": "https://www.techradar.com/reviews/ipad-pro-11-2021-review"
  }
}