{
  "source": "https://www.techradar.com/news/amd-threadripper-5000-cpus-may-not-turn-up-until-november",
  "title": "AMD Threadripper 5000 CPUs may not turn up until November",
  "category": "computing",
  "updated": "2021-07-16T13:30:01Z",
  "author": "darren-allan",
  "summary": "Next-gen Zen 3-based Threadrippers could be disappointingly late",
  "article": [
    "AMD’s Ryzen Threadripper 5000 processors, the heavyweight range of CPUs which have seen a few rumors flying around of late, may not be here as soon as we previously expected.",
    "According to the latest from YouTuber Moore’s Law is Dead, the Threadripper 5000 series (codenamed ‘Chagall’) is expected to launch by November 2021, whereas previous gossip pointed to a launch as early as August or September.",
    "Now, there could be some confusion from the rumor mill regarding whether these estimated timeframes might refer to a paper launch or actual on-shelf availability, and there is still the possibility of an announcement soon, followed by a later on-sale date in November (though that’d be quite a gap from reveal to availability).",
    "At any rate, Moore’s Law certainly seems reasonably confident in his assertion that we could be waiting another four months or so before Threadripper 5000 chips arrive. When they do, the CPUs will be headed up by a 64-core flagship (as previously rumored), and the chips will boast support for (quad-channel) DDR4 RAM and PCIe 4.0 (64 lanes).",
    "So, as another recent rumor suggested, apparently there won’t be any big changes from the current (now nearly two-year-old) Threadripper processors, except for the move to the Zen 3 architecture (as seen in Ryzen 5000 chips) which will obviously offer a sizeable performance uplift (in IPC or Instructions Per Clock). Also, there’s a further positive aspect here in that the upgrade path will be easier in terms of being able to drop a new Threadripper 5000 into an existing TRX40 motherboard.",
    "Moore’s Law also reckons that pricing on these new Threadripper 5000 models could be higher than the existing HEDT products, or at least that the proposed prices are right now – but it wouldn’t be a surprise to see them notched up a bit.",
    "There’s no mention made of the purported 16-core model for the Threadripper 5000 series, interestingly, which has been floating around as a speculated inclusion for the next-gen chips.",
    "Moore’s Law also covered the Threadripper 5000 Pro models (for workstations) which will again supposedly run with a 64-core flagship and eight-channel DDR4 support, with 128 x PCIe 4.0 lanes. Those CPUs won’t come until later, the leaker suggests, with January 2022 being the date to mark in your calendar.",
    "Finally, Moore’s Law flags up ‘Chagall X3D’ references, with AMD possibly having a Threadripper spin with 3D V-Cache (‘vertical L3 cache’), and we could see such chips turn up later in 2022 (possibly as a workstation-only affair). He didn’t offer up any details on core counts for these purported CPUs, as this is still the very early stages of speculation for Chagall X3D.",
    "AMD’s 3D V-Cache tech could also power up Ryzen 5000 XT refreshes in the future, maybe early in 2022 going by the rumor mill.",
    "Via VideoCardz"
  ],
  "headers": {
    "5": "Pricey proposition?"
  },
  "links": {
    "CPUs": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Moore’s Law is Dead": "https://www.youtube.com/watch?v=la-7Q_VsWUM",
    "August": "https://www.techradar.com/news/amd-threadripper-5000-64-core-processor-could-launch-as-soon-as-august",
    "September": "https://www.techradar.com/news/amd-threadripper-5000-chips-could-arrive-in-september-with-a-16-core-cpu",
    "as another recent rumor suggested": "https://www.techradar.com/news/amd-threadripper-5000-64-core-processor-could-launch-as-soon-as-august",
    "Zen 3 architecture": "https://www.techradar.com/news/amd-zen-3",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "3D V-Cache": "https://www.techradar.com/news/amd-3d-chiplet-technology-meet-the-future-of-processors",
    "maybe early in 2022 going by the rumor mill": "https://www.techradar.com/news/intel-alder-lake-cpu-rumored-specs-could-mean-amd-has-a-serious-fight-on-its-hands",
    "VideoCardz": "https://videocardz.com/newz/amd-ryzen-threadripper-5990x-with-64-cores-now-rumored-to-launch-in-november"
  }
}