{
  "source": "https://www.techradar.com/news/apple-watch-7-release-date-is-set-for-october-15",
  "title": "Apple Watch 7 release date is October 15 – here’s when pre-orders start",
  "category": "wearables",
  "updated": "2021-10-06T15:11:45Z",
  "author": "james-peckham",
  "summary": "It'll be ready to order this week",
  "article": [
    "The Apple Watch 7 release date has been set, and you'll be able to buy the new smartwatch on October 15. That's the same date for many countries around the world, including the US, UK and Australia.",
    "Apple Watch 7 pre-orders will open for the upcoming smartwatch on Friday, October 8. That's when you'll be able to ensure your order is made, and it should mean you're able to receive one as quickly as possible.",
    "Apple has confirmed pre-orders start at 5am PT / 8am ET / 1pm BST / 11pm AEDT.",
    "The Apple Watch 7 price starts at $399 / £369 / AU$599, which is for the 41mm GPS-only model. This is the first time we've heard confirmed prices for the UK and Australia, too.",
    "Apple revealed the new smartwatch alongside the iPhone 13 and iPad mini 6 on September 14, but it didn't share a release date at the time of its unveiling.",
    "We don't have an official comment from Apple on why its smartwatch took longer to come out than the other devices revealed on September 14.",
    "It's thought that the change in design for the Apple Watch 7 caused the delay in the manufacturing process, but we don't expect Apple to officially confirm why it didn't arrive in September.",
    "The Apple Watch 7 looks like a modest upgrade with a larger screen than previous smartwatches from the company. The display is said to be 70% brighter than previous Apple Watch products as well.",
    "Fast charging has also been introduced to the Apple Watch 7, and it's said to be 33% faster than the Apple Watch 6."
  ],
  "headers": {},
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Apple Watch 7 pre-orders": "https://www.techradar.com/deals/apple-watch-7-deals-sales",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPad mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review"
  }
}