{
  "source": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
  "title": "Sea of Thieves Season 4, the Sunken Kingdom, cross platform, Twitch drops and updates",
  "category": "gaming",
  "updated": "2021-10-13T18:04:52Z",
  "author": "emma-boyle",
  "summary": "What's on the horizon for Sea of Thieves fans?",
  "article": [
    "Rare's sandbox multiplayer pirate adventure, Sea of Thieves, has come a long way. Since first hitting Xbox One and PC in March 2018, the developer has been working on a host of post-launch patches and free DLC – with more staff working on the title now than in the run-up to its original release.",
    "The seafaring title continues to attract more players by offering continual improvements and additional content to the game's community, such as the game's recent Seasons that include 100 tiers of rewards for players to earn.",
    "According to Rare, within the game's first year, Sea of Thieves players collected and cashed in almost 750 million chests, skulls and items of cargo to amass a collective fortune of 642 billion gold. That number will have increased exponentially since, then, as the game has passed its third anniversary and has now amassed 20 million players since launch.",
    "As of September 2021, we've now reached Sea of Thieves' fourth season but as an open-ended online service game, there's plenty more to come. To help you keep on top of what's new and what's coming up, we've put together this handy page which will be updated with all the latest announcements.",
    "The latest Sea of Thieves update is Season Four. You can see the full trailer below, but this newest upgrade will bring lots of new events, seasonal rewards and an overhaul to the trials and deeds system. It will also fully reveal the Sunken Kingdom, which can now be fully explored and is filled with treasures and secrets.",
    "Season Four has been available since September 23, 2021 and it’s free for all players with Xbox Game Pass and across Xbox Series X, Xbox Series S, Xbox One, Windows 10 and Steam.",
    "Sea of Thieves has received a Pirates of the Caribbean crossover, which became available on June 22 for Xbox Series X, Xbox Series S, Xbox One and PC. The game is available to download for Xbox Game Pass subscribers.",
    "The trailer, which you can watch below, shows that players will encounter new enemies and challenges, such as cursed crews and bloodthirsty mermaids.",
    "You can also learn more about how Sea of Thieves: A Pirate's Life came to be in this deep dive showcase video.",
    "Season 4 is now underway and the latest update to the game, numbered 2.3.0.1., brings in some fixes and improvements based on feedback from the community.",
    "These fixes are detailed in full in the official Sea of Thieves change log, but they primarily revolve around The Sunken Kingdom setting where players were experiencing a few issues with bugs, alongside some performance and stability fixes for the wider game. The download sizes for this latest update are as follows:",
    "Sea of Thieves isn’t just very playable, it’s very watchable and it’s hugely popular on Twitch. It’s not a surprise then, that Rare’s Twitch Drops are returning to the game for Season 4. These allow Sea of Thieves players to claim brand new in-game items simply by tuning in each day to watch the streams of participating Sea of Thieves partner’s for at least 20 minutes. Each item will be available for 24 hours, beginning and ending at 10am BST, after which the daily reward will change.",
    "This month’s Twitch Drops run from October 15 to October 19 and will include items from the Twilight Hunter set. All you have to do is link your Twitch account with your Sea of Thieves account and watch participating streamers within the timeframe. You’ll see a on Twitch when you’ve got your item. After that, you’ll just need to claim the item within 24 hours of unlocking it to ensure you receive it.",
    "Sea of Thieves is now available on Xbox Series X, Xbox Series S, Xbox One and PC. It's possible to purchase the game outright, but you can also pick up an Xbox Game Pass subscription where the entire game is included.",
    "If you're not sure whether Sea of Thieves is for you, picking up a Game Pass trial for free and playing the game for a short time through it is a good way to find out.",
    "The game is not a port for PC or Xbox, it works equally on both and supports cross-play and cross-progression. The game runs at 60fps on Xbox Series X and Xbox Series S, and Xbox Series X owners can also play at 120fps. Xbox One players will have to make do with 30fps, while the PC version's are unlocked. Mouse, keyboard and controllers are all supported across console and PC, and you can cross-play across platforms."
  ],
  "headers": {
    "4": "Sea of Thieves: Season Four",
    "6": "Sea of Thieves: A Pirate's Life",
    "9": "Sea of Thieves update news and patch notes",
    "11": "Sea of Thieves Twitch drops",
    "13": "How to play Sea of Thieves"
  },
  "links": {
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-review/uk/news/sea-of-thieves-release-date-news-and-features",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "According to Rare": "https://www.seaofthieves.com/news/year-one-infographic",
    "Xbox Game Pass": "https://www.techradar.com/news/xbox-all-access-packages-a-console-xbox-live-and-game-pass-for-one-monthly-fee",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "change log": "https://www.seaofthieves.com/release-notes",
    "Twitch Drops": "https://www.seaofthieves.com/twitch-drops"
  }
}