{
  "source": "https://www.techradar.com/news/no-james-bond-isnt-getting-a-tv-show-on-amazon-prime-video",
  "title": "No, James Bond isn’t getting a TV show on Amazon Prime Video",
  "category": "entertainment",
  "updated": "2021-08-19T13:53:18Z",
  "author": "axel-metz",
  "summary": "Bond is sticking to the big screen",
  "article": [
    "The producers behind the James Bond movies have confirmed there won’t be any small-screen adventures for 007 in the near future.",
    "In an interview with Total Film, long-time Bond custodian Barbara Broccoli responded to questions surrounding the iconic character’s future following Amazon’s $8.45 billion acquisition of MGM back in May.",
    "\"We make films,” Broccoli asserted. “We make films for the cinema. That’s what we do,\" adding that MGM has “resisted [calls for a Bond television series] for 60 years.\"",
    "Though no such ambitions were made official by Amazon following the high-profile deal between the two studios, it’s safe to assume that its acquisition of the Bond IP brought with it a wealth of potential spin-off concepts for the streamer.",
    "Hell, following the announcement, even we at TechRadar put together a list of 5 James Bond TV shows we’d like to see on Amazon Prime Video. Awkward.",
    "But Broccoli’s resistance to seeing Bond on the small screen may come as a relief to Bond fans who felt Amazon’s acquisition of MGM threatened the integrity of the franchise.",
    "A similarly-beloved IP like Star Wars, for instance, has seen its characters and lore stretched far and wide following Disney’s purchase of Lucasfilm back in 2012. At present, there are 11 different Star Wars TV shows in the works, and while some of them will inevitably hit the mark – The Mandalorian, for example, has been a roaring success – Disney runs the risk of wearing thin the appeal of a universe that has held strong for decades.",
    "Of course, Broccoli’s comments also don’t represent a legally-binding stance. Depending on the nature of the deal between Amazon and MGM, there may come a time when the wishes of Bond’s creators are cast aside in favor of the franchise’s unquestionable commercial appeal.",
    "Until then, though, the immediate future of Bond lies with the release of No Time to Die, which is currently scheduled for release on September 30 in the UK and October 8 in the US.",
    "\"It’s tough to think about the future until this film has its moment,\" Broccoli told Total Film. \"I think we just really want to celebrate this and celebrate Daniel, and then when the dust settles, then look at the landscape and figure out what the future is.”",
    "That sounds to us like the small screen door is ajar, rather than locked shut..."
  ],
  "headers": {
    "6": "Analysis: Why keeping Bond on the big screen makes sense"
  },
  "links": {
    "Total Film": "https://www.gamesradar.com/james-bond-producers-say-there-will-not-be-an-amazon-tv-series-we-make-films-for-the-cinema/?utm_campaign=socialflow&utm_medium=social&utm_content=total-film&utm_source=twitter.com",
    "Amazon’s $8.45 billion acquisition of MGM": "https://www.techradar.com/news/amazon-is-buying-james-bond-studio-mgm",
    "5 James Bond TV shows we’d like to see on Amazon Prime Video": "https://www.techradar.com/news/5-james-bond-tv-shows-amazon-prime-could-make",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}