{
  "source": "https://www.techradar.com/news/should-you-buy-a-gaming-phone",
  "title": "Should you buy a gaming phone?",
  "category": "phones",
  "updated": "2021-07-10T08:00:45Z",
  "author": "david-lumb",
  "summary": "Do you really need a gaming phone to play mobile games?",
  "article": [
    "It’s 2021, and if you play a lot of games on your smartphone, you might wonder whether a mainstream flagship smartphone will serve just fine – or whether a gaming phone is right for you.",
    "In truth, the best phones you can buy aren’t too different from the top gaming phones. Both will pack top specs, big batteries, and great screens. For everyday use, not to mention playing casual games, you won’t go wrong with either.",
    "But let’s drill down to the real differences between the two categories – how much better it is to play on a proper gaming phone, and what you’ll be giving up by not picking up a more mainstream handset.",
    "Gaming phones aren’t uniform in their features, with unique advantages and perks that differ from model to model. Overall, they do improve the mobile gaming experience – to different degrees, of course.",
    "These advantages include both hardware and software features. There are a few things that are common among most of them, including powerful specs with leading chipsets (right now, the Qualcomm Snapdragon 888 is the best silicon) and expansive RAM (8GB at least, though the Asus ROG 5 Ultimate goes up to 18GB).",
    "Gaming phones also typically have big batteries around, and perhaps beyond, 5,000mAh that allow players to stay in the game for hours and still have enough capacity to last until the end of the day. More often than not, gaming phones also have 3.5mm headphone jacks, a feature that’s rarely seen on mainstream flagship phones.",
    "Gaming phones also typically have software that eases the playing experience. These are often branded as ‘gaming modes’ that have a mix of automatic and manual features. The former include upping the performance or streamlining power consumption so the battery doesn’t overheat, while the latter include toggle settings to block out calls, texts, and other notifications while in a match.",
    "Of course, there are mainstream phones that have their own gaming modes, like the recent OnePlus 9 or Sony Xperia 1 III, but they typically have much more limited options and settings than gaming phones.",
    "Some gaming phones have very elaborate gaming modes – the Asus ROG 5 and its predecessors have the Asus ‘Armoury Crate’ software that collects your games into a library and allows you to tweak your performance settings, as well as the ‘Game Genie’ overlay you can swipe out mid-game to fiddle with settings and change the shoulder AirTrigger mappings (more on that below).",
    "The ROG 5 also has ‘X Mode,’ which prioritizes performance when switched on – by default, this is done by physically pinching the sides of the handset.",
    "One of the biggest advantages of gaming phones is hardware: the Asus ROG 5 has two touch-sensitive buttons on the top and bottom of the right side, such that rotating the phone into landscape mode puts them right under a player’s index fingers.",
    "They operate like ‘shoulder’ buttons on traditional gamepads, which players can map to different functions in games, offering greater control and freeing up screen space that would be covered by thumbs. Extra touch-sensitive buttons are somewhat prevalent in gaming phones, appearing also on the Nubia Red Magic 6 and its predecessors.",
    "The flashiest gaming phone advantages are the peripherals. Many have their own bespoke accessories tailored to the phone – for instance, the ROG 5’s Kunai 3 gamepad fits controller halves on either side, Nintendo Switch-style, that slide into a case that only fits that phone.",
    "The ROG 5 also has a specific charge port midway on the left side of the phone that its attachments can click into, like the AeroActive Cooler 5 fan. (External fans are probably the most common attachment.)",
    "Does having an external fan noticeably cool your phone? We’ve never seen a phone overheat enough from gaming to see slowdown, though that might not be the case in hotter environments. In any case, the fans do make your phone cooler and thus more comfortable to hold – and in the AeroActive Cooler 5’s case, add physical underside buttons.",
    "The external controllers are more obviously advantageous – even if they aren’t as precise as Nintendo’s Joy Cons, they add more precision than touch controls.",
    "Gaming phones also have some surprisingly subtle gaming-enhancing internal design advantages, too. The Asus ROG 5’s battery is split in two for faster charging as well as to keep the actual battery cells cooler and away from where player fingers will likely rest on the back of the phone. The ROG 5 also has multiple cell and 5G antennas spread equidistantly around the phone, so no matter how you’re holding it (including sideways while playing), you should still get signal. Likewise, there are multiple microphones positioned around the phone to hear you speak.",
    "Going for a mainstream phone has several advantages – or, put another way, gaming phones have several disadvantages. They often have poor cameras, both in lens variety and software for image processing and photo modes. They typically have worse availability, and usually aren’t sold by carriers, which makes it harder in markets like the US where consumers buy plans to pay in monthly installments.",
    "Android gaming phones may not get software updates as frequently or for as long as mainstream phones, and there are no specific iOS gaming phones.",
    "Mainstream phones really are pretty good at playing games, and consumers who aren’t planning to play competitively or aspire to mobile gaming esports have little to worry about if they opt for non-gaming phones. Heck, we make this clear on our best gaming phones page, which lists the top mainstream flagship phones you can still get a good gaming experience while using.",
    "There are also accessories that work just fine on non-gaming phones, especially Nintendo Switch-like controllers such as the iOS-only Jawbone. If you really wanted to, there’s probably an external fan or other gaming specific accessory out there to try. The rest of you can link up their Xbox Series X and PS5 (or Xbox One and PS4) controllers to their phones via Bluetooth to play games, and even buy a clip accessory to attach to their gamepad while playing.",
    "There are good reasons to choose gaming phones, and good reasons to stick with normal non-gaming phones, too. Pick the one that’s right for you and fits within your budget – which is a far more important consideration than stressing over which handset has better game-assisting software."
  ],
  "headers": {
    "3": "What’s so great about a gaming phone?",
    "6": "How about gaming phone software?",
    "10": "Gaming phone hardware: in-device and peripheral power",
    "17": "What do you miss out on by choosing a gaming phone?"
  },
  "links": {
    "gaming phone": "https://www.techradar.com/news/best-phone-for-gaming",
    "best phones": "https://www.techradar.com/news/best-phone",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Asus ROG 5 Ultimate": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Nubia Red Magic 6": "https://www.techradar.com/reviews/nubia-red-magic-6",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One": "https://www.techradar.com/reviews/original-2013-xbox-one",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review"
  }
}