{
  "source": "https://www.techradar.com/news/you-can-finally-buy-83-inch-oled-tvs",
  "title": "The LG C1 4K OLED TV now comes in an 83-inch size – but can you afford it?",
  "category": "televisions",
  "updated": "2021-06-23T15:27:19Z",
  "author": "henry-st-leger",
  "summary": "The LG has launched its room-filling C1 OLED TV worldwide",
  "article": [
    "If you've been hankering after a massive OLED TV, then the LG C1 could be the screen of your dreams, having now launched in its largest 83-inch size with a similarly massive $5,999 / £6,999 / AU$12,599 price tag.",
    "That's a big step up from the next size down, which is a still-enormous 77 inches retailing for $3,499 / £3,999 / AU$6,995 – with 65-inch, 55-inch and 48-inch sizes below that at decreasing price points.",
    "The LG C1 OLED is technically the world's first OLED screen to be released at an 83-inch size, although it certainly won't be the last. We know that the Sony A90J OLED, this year's flagship 4K TV from Sony, will be coming in the same panel size – and in both cases the 83-inch model will naturally up the price over smaller screen sizes.",
    "The 83-inch panel used by LG is new for 2021, and continues LG's expansion into new and larger OLED sizes – the company contributed to the flurry of 48-inch OLED TVs we saw last year, and LG Display, which is the sole supplier of OLED panels, is working on 42-inch OLEDs that will feature in TVs from various brands.",
    "If you're after a seriously highly specified OLED TV, you have a good few options these days, each with their own pros and cons.",
    "While you can now get the LG C1 OLED in that huge 83-inch size, you could spend roughly the same amount of money on a smaller LG G1 OLED, a model with enhanced 'OLED evo' panel technology that ups the peak brightness by as much as 20% – given the famously dim output of OLEDs compared to their QLED counterparts, that's quite an improvement.",
    "There's also the LG Z1, an 8K OLED TV for almost three times the price as the C1, at £19,999 (likely $19,999) for its smallest 77-inch size, or £24,999 (likely $29,999) for an 88-inch option.",
    "Both the LG G1 and LG Z1 now come with five-year manufacturer warranties to encourage purchases, too, which is something you won't get with the C1 OLED.",
    "Then there's the rollable OLED TV, known as the LG 65RX, which is retailing for £99,999 in the UK – and likely $99,999 in the US when it launches. So there's clearly a scale of premium that doesn't stop at four-figure sums, and knowing how high it goes might make you view the 83-inch LG C1 OLED in a slightly more favorable light."
  ],
  "headers": {
    "4": "Choosing a premium OLED TV"
  },
  "links": {
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Sony A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "48-inch OLED TVs": "https://www.techradar.com/best/48-inch-oled-tv",
    "42-inch OLEDs": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
    "LG G1 OLED": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "8K OLED TV": "https://www.techradar.com/best/best-8k-tv",
    "five-year manufacturer warranties to encourage purchases": "https://www.techradar.com/news/lg-oled-tvs-now-come-with-a-five-year-warranty-but-not-all-of-them",
    "rollable OLED TV": "https://www.techradar.com/reviews/lg-signature-series-oled-tv-r-65r9"
  }
}