{
  "source": "https://www.techradar.com/news/why-you-should-wait-until-amazon-prime-day-to-buy-a-new-sim-free-phone",
  "title": "Why you should wait until Amazon Prime Day to buy a new SIM free phone",
  "category": "phones",
  "updated": "2021-06-15T10:57:26Z",
  "author": "alex-hughes",
  "summary": "The Amazon event is the perfect time to snag an Android phone",
  "article": [
    "Amazon's Prime Day event is rapidly closing in and if you've been planning on upgrading your handset, Prime Day deals could be the perfect way to do so.",
    "While the retailer giant's event covers everything from speakers through to baby clothes and absolutely everything in between, certain items tend to receive the bigger discounts - smartphones being one of them.",
    "Set for June 21 and 22, the event is going to be here very soon and realistically, it's the second best time to get a new smartphone right behind the massive Black Friday event.",
    "Normally you could end up dropping near to $1000 / £1000 on mobile phone deals, especially for flagship handsets. However, we've seen discounts exceeding $500 / £500 in previous years and a number of budget handsets tend to appear, with prices sinking below $100 / £100 in some cases.",
    "So what can you expect over Amazon Prime Day? Read on to find out what kind of SIM-free phones you can get in this year's sale.",
    "While it's not clear why, Amazon Prime Day is very much an Android heavy event. Whether this is because of the larger quantity of options, Apple's disinterest in discounting its handsets or some other reason entirely, you'll find the focus on the likes of Google, Samsung and other Android brands.",
    "This is obviously great news for Android fans and gives you plenty of choice. In past Amazon Prime Day events, we have seen discounts across both flagship phones and much cheaper budget devices.",
    "So what exactly can you expect? Looking at the highlights of last year's event is the easiest way to get a good idea of the options.",
    "In the UK, the OnePlus 8 Pro fell to its lowest price yet of £749, Samsung knocked 20% off its Galaxy S20, Huawei had slashed £200 off both its flagship handsets and all of the core budget devices from Samsung saw some major discounts.",
    "In the US, the event was dominated by Google and Samsung. The Google Pixel 4 and 4 XL dropped by as much as $309 and a few hundred dollars were knocked off of the Samsung Galaxy S20, S10 and Note 20 series.",
    "So what does that mean for this year? In essence, it means the best prices are going to be across Samsung, Google and OnePlus. We would expect some impressive discounts on the Samsung Galaxy S21 family, the Google Pixel 5 and OnePlus' new 9 and 9 Pro devices and the OnePlus Nord.",
    "As we said, Amazon Prime Day is an event filled with Android handsets, but that doesn't mean Apple is a complete no-show. Every year the brand comes along with a few star deals for Apple fans.",
    "However, unlike some key Android brands, these are very rarely on the latest and greatest devices. Apple tends to push its more budget handsets in Prime Day sales but that isn't necessarily a bad thing.",
    "That would likely mean three devices from Apple could show - the iPhone SE, iPhone 11 and XR. These are Apple's three non-discontinued handsets that aren't in its flagship range.",
    "All three have appeared in Prime Day sales in the past and are highly likely to show again. The other option that is pretty likely for Apple is refurbished iPhones.",
    "Apple frequently flogs major discounts in this sale on refurbished devices, offering older handsets at very low prices.",
    "What this really means for Apple fans is that no, this is not the time to get a flagship from Apple - that will be the job of Black Friday. Instead, this is a chance to score a big saving on Apple's older, more affordable devices.",
    "When it comes to the world of smartphones, Amazon limits itself at the selling of SIM-free phones. That means if you don't have a cell phone plan already set-up for your new device, you'll have to get it separately to go with your new smartphone.",
    "The good news though is that there are plenty of great offers all year round for cell phone plans (or SIM only deals for those in the UK). Whether you're after something cheap and affordable or an all out unlimited data plan, you'll find something that works with your new device.",
    "So if Amazon doesn't sell SIMs, where can you buy them during the event? Our guides to the best SIM only deals and cell phone plans will help you track down the best prices right now."
  ],
  "headers": {
    "5": "Amazon Prime Day is for the Android fans:",
    "11": "And what about Apple?",
    "17": "Can I get cell phone plans on Prime Day:"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "mobile phone deals": "https://www.techradar.com/deals/mobile-phone-deals",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "SIM-free phones": "https://www.techradar.com/deals/unlocked-mobile-phones",
    "SIM only deals": "https://www.techradar.com/sim-only/sim-only-deals",
    "cell phone plans": "https://www.techradar.com/deals/best-cell-phone-plans"
  }
}