{
  "source": "https://www.techradar.com/news/salesforce-and-ring-central-will-now-let-you-make-calls-from-your-browser",
  "title": "Salesforce and Ring Central will now let you make calls from your browser",
  "category": "computing",
  "updated": "2021-02-25T22:07:35Z",
  "author": "anthony-spadafora",
  "summary": "In-app calling powered by RingCentral is now available in Salesforce",
  "article": [
    "Making business calls from your computer is about to get a whole lot easier for Salesforce users as RingCentral has announced that its VoIP service can now be used to make in-app calls directly from the company's CRM software.",
    "This new feature is designed to help boost productivity and efficiency as sales agents will be able to make, transfer and control phone calls directly from Salesforce.",
    "With in-app calling enabled, sales associates can easily control and manage all of their customer calls without ever having to leave their browser. Users can even select their preferred caller ID number, organize multiple calls as separate browser tabs and manage incoming and outgoing calls across devices without the need to download any additional software.",
    "The new in-app calling capabilities in Salesforce are built with WebRTC technology and are the latest advancements in the growing list of features of the RingCentral for Salesforce integration.",
    "In addition to being able to make calls from their browser, Salesforce users can now view a complete dashboard of a team's performance by editing and customizing the RingCentral Analytics data as a native Salesforce report through RingCentral's Cloud Phone Report.",
    "Chief product officer at RingCentral, Will Moxley explained in a press release how its new in-app calling feature in Salesforce helps employees stay focused on the task at hand as they no longer need to switch between apps, saying:",
    "“Today’s modern workforce needs the ability to communicate from anywhere using their preferred channels of choice in order to stay connected and efficient. Our in-app calling for Salesforce brings the capabilities of RingCentral to customer phone conversations directly within a browser, eliminating the need to switch between different apps. Our integration with Salesforce builds on our vision of providing an open platform, where users are empowered to access RingCentral’s cloud-based communications capabilities from within their applications of choice for optimal productivity across their organization.”",
    "RingCentral's in-app calling feature for Salesforce is now available and users can test it out for themselves in either Salesforce Classic or when using Salesforce Lightning UI."
  ],
  "headers": {
    "3": "Salesforce in-app calling"
  },
  "links": {
    "Salesforce": "https://www.techradar.com/news/salesforce-drops-major-cross-suite-update-including-new-industry-specific-products",
    "VoIP": "https://www.techradar.com/news/best-voip-service",
    "CRM software": "https://www.techradar.com/best/the-best-crm-software",
    "browser": "https://www.techradar.com/best/browser",
    "WebRTC": "https://www.techradar.com/news/internet/web/webrtc-uncovered-why-it-s-the-future-of-online-communications-1137222",
    "RingCentral": "https://www.techradar.com/reviews/ringcentral-office",
    "press release": "https://www.prf.hn/click/camref:1011l4qw5/pubref:trd-us-2041598416776131300/destination:https%3A%2F%2Fwww.ringcentral.com%2Fwhyringcentral%2Fcompany%2Fpressreleases%2Fringcentral-introduces-direct-calls-from-salesforce.html",
    "Salesforce Lightning UI": "https://www.techradar.com/news/software/business-software/lightning-strikes-salesforce-s-sales-cloud-1302594"
  }
}