{
  "source": "https://www.techradar.com/news/best-games-consoles-nintendo-gamecube-marios-under-appreciated-home",
  "title": "Is the Nintendo GameCube the best games console of all time, ever?",
  "category": "gaming",
  "updated": "2021-11-11T16:53:01Z",
  "author": "jon-porter",
  "summary": "Mario's under-appreciated home",
  "article": [
    "If ever there was a console that was under-appreciated at the time of its release it was Nintendo’s GameCube.",
    "The console didn’t have the massive library of Sony’s PlayStation 2, and nor did it have the online capabilities of the original Xbox. But the GameCube had a library of releases that have stood the test of time to be some of the greatest ever made.",
    "But why wasn’t this console's strengths more widely apparent when the console was first released? In many ways the console was behind the times compared to what its competitors were attempting.",
    "While Microsoft and to a certain extent Sony forged ahead in defining the new online gaming landscape, the GameCube was a resolutely offline affair. While the Xbox and PS2 got comfortable with dual analogue stick controllers, the GameCube’s felt anachronistic with its one analogue stick and one nodule masquerading as a second.",
    "But with the benefit of hindsight, the console was an absolute treasure trove of classic titles. They didn’t push the envelope as far as games such as GTA III or Halo: Combat Evolved did on rival machines; they were instead fantastic executions of classic games from 2D side-scrollers such as Viewtiful Joe to space shooters like Star Wars Rogue Leader: Rogue Squadron II.",
    "It also helped that the GameCube was the last Nintendo console to see almost equal support from third-parties. Whereas later Nintendo consoles would be almost abandoned by external developers, GameCube owners could still enjoy the latest Prince of Persia, Tony Hawks and Splinter Cell games day-and-date with their PS2 and Xbox releases.",
    "In comparison, at the time first-party GameCube games failed to impress. Though now seen as a classic, Wind Waker was badly received by fans at the time, and Super Mario Sunshine is widely regarded as one of the worst in the series.",
    "It’s hard to narrow the console’s best games down to just three. As soon as you start looking through the GameCube’s library, there are numerous games that jump out as being console greats.",
    "Eternal Darkness: Sanity’s Requiem is one of the best horror games ever made, and Viewtiful Joe brought modern production values to a 2D side-scroller way before the Xbox Live Arcade made it cool. To this day Super Smash Bros. Melee is one of the most played fighting games at tournaments, and F-Zero GX’s speed and intensity are yet to be beaten.",
    "When we’re talking about the best games the GameCube has to offer, you have to start with Resident Evil 4. At a time when the world’s shooters were resolutely first-person, Resident Evil 4 proved that exactly the same intensity could be achieved in third-person, and it brought the franchise back from the grave as part of the bargain.",
    "Less than a decade later, third-person games would become almost as big as their first-person competitors. The likes of Gears of War simply wouldn’t exist without the format created by Resident Evil 4.",
    "Next up is Metroid Prime. Whereas some games have stumbled when making the transition from two to three dimensions (we’re looking at you Sonic...), Metroid Prime made the most of the change without sacrificing anything about what made the 2D classics great.",
    "Levels were vast and cavernous, and the feeling of slowly learning and unlocking the entire map felt like an achievement like no other.",
    "Finally, although at the time fans reacted negatively to its cartoony aesthetic, The Legend of Zelda: Wind Waker has since grown into one of the most respected in the series. Replacing the planes of Hyrule with an enormous expanse of water could have made the world feel empty, but in the end the game’s secrets just ended up feeling that little harder to find, and much more satisfying as a result.",
    "Thankfully, the GameCube’s reputation compared with its relative lack of sales means that these games went on to be re-released to great effect elsewhere. Metroid Prime was re-released on the Wii as part of Metroid Prime Trilogy, Resident Evil 4 has gone on to be released on every console under the sun, and Wind Waker saw an excellent HD remake on the Wii U.",
    "So while the reasons for picking up a GameCube these days may be slim, it was still a console with a library that has cast a long shadow in the modern gaming landscape, and well-deserves its place as the one of the best consoles of all time."
  ],
  "headers": {
    "4": "Third-party love-in",
    "9": "Resident Evil 4",
    "11": "Metroid Prime",
    "13": "The Legend of Zelda: Wind Waker"
  },
  "links": {
    "PlayStation 2": "https://www.techradar.com/news/best-games-consoles-playstation-2-the-console-that-made-nintendo-and-sega-weep",
    "PS2": "https://www.techradar.com/news/best-ps2-games-anniversary"
  }
}