{
  "source": "https://www.techradar.com/news/putting-the-office-at-the-center-of-hybrid-work-will-help-workers-thrive",
  "title": "Putting the office at the center of hybrid work",
  "category": "computing",
  "updated": "2021-06-19T14:16:17Z",
  "author": "simon-o-kane",
  "summary": "The pandemic forced enterprises to rethink the workplace",
  "article": [
    "The pandemic has forced enterprises all over the world to rethink the workplace. The rapid shift to remote work forced companies to focus on their digital transformation efforts and support team collaboration and communication among dispersed teams. The result? The realization that a workspace doesn’t need to be limited to a desk or a 9 to 5 workday.",
    "Ernst & Young and Goldman Sachs have determined that working from home is 'not sustainable' and want to quickly move to a hot-desk or cubicle working environment. While companies such as Twitter and Salesforce, have vowed that employees can work from home “forever.”",
    "As teams reunite in the months ahead, there will be a wider variety of work environments than we’ve seen in the past. Some will be remote-only, some will be office-only, and others will be somewhere in between. No matter the approach, companies wishing to survive and thrive in the next chapter of hybrid work must be flexible and intentional in their approach.",
    "As a global company, we are accustomed to our teams working remotely across the globe and we will naturally facilitate hybrid work moving forward. But we also recognize the benefits of face-to-face communication. ‘Water cooler’ moments and impromptu co-creation simply can’t be replicated remotely, so as soon as it’s safe to do so, we will be prioritizing an office-centric hybrid approach.",
    "The workplace has radically changed from the first emergence of COVID-19. Almost overnight, the world transitioned to remote work, with little warning or preparation. Despite the efforts of many organisations to rapidly roll out the technology to help their teams navigate lockdown, productivity is on the decline.",
    "A key culprit in waning productivity is time-drain. Exacerbated by excessive context switching, from searching for resources, chasing for updates and going from one meeting to the next, knowledge workers are spending the majority of their day doing work about work. With workers using an average of 10 apps and switching between them 25 times a day just to do their job, teams are feeling overwhelmed, misaligned and overrun by a sea of non-stop notifications.",
    "What would be an informal five-minute chat in the office, has been replaced by a 30-minute scheduled video call - with further time wasted in efforts to schedule the virtual meeting in the first place.",
    "Alongside this, workers are suffering from virtual meeting fatigue, and are having to log extra hours to compensate for this increased call time. The result? Rising burnout levels - in 2020 alone, 75% of knowledge workers in the UK experienced burnout.",
    "This trend is reinforced by The Human Experience Report which states that workers say the COVID-19 pandemic has been the most stressful time in their careers.",
    "As lockdown restrictions continue to ease, we have the opportunity to reunite teams in-person. To do this, business leaders must focus on building a workplace environment that will be long-lasting and designed to facilitate collaboration, relationship-building and career development -- three essential parts of work that were challenging to recreate virtually.",
    "Beyond reducing burnout or work about work, returning to the office is about providing the space for greater creativity and innovation. A shared physical space offers the opportunities to collaborate, innovate and iterate in real-time. When teams are in the same room, individuals can easily voice opinions, bounce ideas off of someone and easily raise a concern or opinion.",
    "Beyond creative thinking, the office is a critical component in safeguarding your team’s mental health. It’s much easier to spot if someone is approaching burnout, facing a challenge, or simply having a bad day when you’re face-to-face with them. Working in the same room as your team, you can see if a company process is faltering or is putting undue pressure on anyone - and perhaps more importantly, it’s much easier for individuals to feel safe to admit it. Allowing you to take action before the problem snowballs into a much bigger issue.",
    "That’s not to say we should ignore the lessons of the past year.",
    "From providing flexi-hours for parents and caregivers to making work more accessible to employees with disabilities - the response to COVID-19 has highlighted the benefits of remote and flexible working.",
    "It’s important to encourage flexibility by incorporating hybrid elements to an office-centric culture, providing employees with the ability to choose how they work - whether they want a space to be collaborative, or focus on individual workflow, either at home or in the office.",
    "Just as there wasn’t a blueprint for remote working, and there isn’t one for returning to the office either. We will take the lessons from our time working remotely, and use this to inform how we help teams to acclimatize to a post-pandemic world.",
    "No matter which model you end up choosing, being intentional in your approach and prioritizing the health and well-being of your employees is key. For us at Asana, that means putting the office at the center of our next chapter of hybrid work. With our office-centric hybrid approach, we believe that we’ve found a way to achieve an exceptional in-person culture while adopting the best elements of hybrid models to ensure that every one of our global team members can work together effortlessly."
  ],
  "headers": {
    "2": "So what should the future of work look like - remote, in-office, or hybrid?",
    "4": "Burnout and app-switching is on the rise",
    "10": "Virtual offices lack human connection",
    "12": "Lessons from lockdown, to thriving in a distributed world"
  },
  "links": {
    "remote work": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "working from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "employees": "https://www.techradar.com/best/best-employee-monitoring-software",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "office": "https://www.techradar.com/best/free-office-software"
  }
}