{
  "source": "https://www.techradar.com/news/iphone-13-colorized-renders-show-smaller-notch-and-rearranged-rear-cameras",
  "title": "iPhone 13 colorized renders show smaller notch and rearranged rear cameras",
  "category": "phones",
  "updated": "2021-04-15T22:08:31Z",
  "author": "david-lumb",
  "summary": "Another iPhone 13 leak shows rendered mock-ups in full color",
  "article": [
    "Yesterday’s iPhone 13 leak showed a glimpse of what the smartphone could end up looking like when we expect it to launch later this year, but the colorless CAD models could only show so much. Now, new renders based on those models show what the iPhone 13 could look like in full color, revealing the shorter notch and rearranged rear cameras.",
    "Using the CAD data originally released by @mysmartprice and 91Mobiles, render maker 9TechEleven tweeted models of the iPhone 13 and iPhone 13 Pro that simulate how they’d look similar to – and differently from – their iPhone 12 counterparts. The resulting mock-ups give a much clearer idea of what the 2021 iPhone range could look like:",
    "In color and with all the display and back details filled in, the potential differences between last year’s iPhones and the new iPhone 13 range is even clearer, like the smaller notch we keep hearing rumors about. The base iPhone 13’s two lenses have been rearranged into diagonal corners of the camera block – which could either facilitate a larger camera sensor (rumored to trickle down from the iPhone 12 Pro Max) or simply differentiate the phone even more from its pricier triple-rear-camera siblings, PhoneArena theorized.",
    "Of course, these are based on CAD models built from leaked information, so the iPhone 13 could end up looking very different. If these predictions are accurate, though, the next group of Apple phones could look otherwise similar to their iPhone 12 counterparts (squared-off sides and all).",
    "Otherwise, we’ve heard plenty about the iPhone 13, including a host of leaks suggesting the cameras will get incremental improvements. A recent rumor suggests it’s getting the same-size 5nm chipset, though a more efficient and potentially more powerful 3nm chipset could follow in 2022 for the iPhone 14 range. On the other hand, the iPhone 13 may finally get a 120Hz display, catching up to Android phones which have had that feature for years.",
    "We’ll know for sure when the iPhone 13 launches later in 2021, which rumor suggests will come out on time in September. That’s the usual release window for Apple phones that only half of the iPhone 12 range launched in, with the other half launching in October owing to delays attributed to the COVID outbreak-caused disruptions to production and supply chains."
  ],
  "headers": {
    "4": "So what is coming in the iPhone 13?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "showed": "https://www.techradar.com/news/iphone-13-and-iphone-13-pro-design-could-look-something-like-this",
    "@mysmartprice": "https://www.mysmartprice.com/gear/exclusive-iphone-13-3d-renders-reveal-smaller-notch/",
    "91Mobiles": "https://www.91mobiles.com/hub/apple-iphone-13-pro-render-design-notch-exclusive/",
    "tweeted": "https://twitter.com/9techeleven/status/1382355631542317057",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "hearing": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "rumors": "https://www.techradar.com/news/iphone-13-leaks-point-again-to-smaller-notch-and-120hz-screen",
    "rumored": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "PhoneArena": "https://www.phonearena.com/news/apple-iphone-13-pro-new-design-concept-renders_id131473",
    "leaks": "https://www.techradar.com/news/iphone-13-pro-max-could-be-better-at-portraits-and-night-shots",
    "rumor": "https://www.techradar.com/news/iphone-13-release-date-looks-to-be-on-schedule-for-september",
    "display": "https://www.techradar.com/news/iphone-13-pro-leak-says-itll-have-this-android-phone-feature"
  }
}