{
  "source": "https://www.techradar.com/news/the-suicide-squad-isnt-your-traditional-sequel-heres-why",
  "title": "The Suicide Squad isn't your traditional sequel – here's why",
  "category": "entertainment",
  "updated": "2021-06-28T09:17:10Z",
  "author": "tom-power",
  "summary": "Is The Suicide Squad a sequel, a reboot or neither?",
  "article": [
    "The Suicide Squad is just over a month away from release, but there's one big question that we still don't have a definitive answer to: is it a traditional sequel to David Ayer's Suicide Squad or not?",
    "Previous comments, made by the movie's cast and crew, have left this open to interpretation. Now, though, it seems that we have a better understanding of whether The Suicide Squad is a follow-up to Warner Bros' 2016 flick.",
    "Speaking to the Toronto Sun, producer Peter Safran – who also worked on 2016's Suicide Squad – explained that The Suicide Squad is its own film, despite the fact that its cast contains characters from David Ayer's movie.",
    "“There’s no sense of continuation from the first movie in this movie,” Safran revealed. “The question I’ve been asked a lot is, ‘Is this a reboot or a sequel?’",
    "\"It’s definitely not a sequel, but it’s not a traditional reboot, either, because it has a couple of continuing characters. So the way we describe it is: This is The Suicide Squad from the mind of James Gunn. It’s his vision for the film.”",
    "It's easy to see why there's so much confusion over The Suicide Squad. Over the last decade, audiences have become accustomed to movie universes (largely due to the MCU's major success) and the continuity that exists within these film series.",
    "Initially, Warner Bros' DC Extended Universe (DCEU) was no different. The likes of Man of Steel, Batman vs. Superman and Justice League followed on from one another and, as a result, it was simple to watch these movies in chronological order.",
    "Now, though, Warner Bros. appears to be going in a different direction. Sure, there are (and will continue to be) traditional sequels for characters including Wonder Woman, Shazam and Aquaman, but it seems that Warner Bros. is less worried about making sure that its DCEU movies are intrinsically tied to one another.",
    "The Suicide Squad is a prime example of this. It exists in the DCEU but it isn't linked to any superhero film that has come before. That gives its cast and crew plenty of freedom to explore standalone adventures and not become bogged down by the vision or creative decisions that previous writers, directors and producers made.",
    "In a way, you can liken Warner Bros' approach to that of DC comics themselves. As Margot Robbie (who plays Harley Quinn) explained to the Toronto Sun, DC comics have set a precedent for overlooking continuity in favor of rebooting (or rebranding) multiple series throughout its illustrious history.",
    "“Oftentimes, you’ll be reading a comic and they leave off at one place and you pick up the next (issue),\" Robbie said. \"They pick up with totally different characters and that person who just died is suddenly there and you just go with it.",
    "\"I swapped between The New 52 (a 2011 revamp of DC’s titles) and the old comics, and none of that stops me from enjoying the stories.”",
    "Robbie's analogy, then, gives us a much clearer idea of what The Suicide Squad is, and how it's related to David Ayer's Suicide Squad.",
    "Think of the two films as independent comic series. They share the same name and some of the same characters. However, they're standalone stories (albeit set in the same universe) that aren't bound by plot threads. View The Suicide Squad and 2016's Suicide Squad in this way, and it's far easier to understand the \"it's not a sequel or reboot\" line of thought.",
    "The Suicide Squad arrives in theaters and on HBO Max on August 6 in the US (July 30 in the UK)."
  ],
  "headers": {
    "5": "Analysis: The DCEU is moving away from its MCU-style movie universe continuity"
  },
  "links": {
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-release-date-plot-cast-trailer-and-more",
    "Toronto Sun": "https://torontosun.com/entertainment/movies/margot-robbie-says-james-gunns-the-suicide-squad-explores-a-different-side-of-harley-quinn",
    "Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Aquaman": "https://www.techradar.com/news/aquaman-2-release-date-cast-and-what-else-we-know-about-dcs-return-to-atlantis"
  }
}