{
  "source": "https://www.techradar.com/news/camera-giant-olympus-hit-by-ransomware-attack",
  "title": "Camera giant Olympus hit by ransomware attack",
  "category": "computing",
  "updated": "2021-09-13T12:05:08Z",
  "author": "mayank-sharma",
  "summary": "Olympus has reportedly become the latest victim of ransomware newbie DarkMatter",
  "article": [
    "Famous camera maker Olympus claims it is investigating “a potential cybersecurity incident” that’s affected its computers across the European, Middle East and Africa regions.",
    "However, an anonymous source familiar with the incident told TechCrunch that Olympus is grappling with a ransomware attack that began on September 8, 2021.",
    "Interestingly, the source shared details about the incident with TechCrunch prior to Olympus acknowledging the incident.",
    "“We are currently working to determine the extent of the issue and will continue to provide updates as new information becomes available. We apologize for any inconvenience this has caused,” read Olympus’ official statement.",
    "In its statement put out on Saturday, 11 September, Olympus did acknowledge that it first detected “suspicious activity” on September 8. Once alerted, the company claims its specialized response team was quick to act, and is working with forensics experts to help resolve the issue.",
    "“As part of the investigation, we have suspended data transfers in the affected systems and have informed the relevant external partners,” Olympus informs.",
    "The anonymous source however shared with TechCrunch the ransomware note left behind by the Olympus attackers.",
    "Decrypting the purported note, ransomware expert and threat analyst at Emsisoft, Brett Callow, believes the attack seems to be orchestrated by BlackMatter.",
    "BlackMatter is a new ransomware-as-a-service (RaaS) threat actor, which the cybersecurity community claims to have risen from the ashes of the notorious DarkSide RaaS operator.",
    "Emsisoft has also found technical links between Darkside and BlackMatter, which has apparently chalked up over 40 victims since its appearance earlier this year in June, 2021.",
    "Olympus didn’t immediately respond to our email asking for confirmation whether it has indeed been the target of a BlackMatter campaign.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "A victim of BlackMatter?"
  },
  "links": {
    "Olympus": "https://www.techradar.com/news/new-olympus-camera-is-coming-in-the-next-few-weeks",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "read": "https://www.olympus-europa.com/company/en/news/press-releases/2021-09-11t03-00-00/investigating-potential-cybersecurity-incident-affecting-limited-areas-of-our-emea-it-system.html?2021-09-11t03-00-00.html",
    "Emsisoft": "https://www.techradar.com/reviews/emsisoft-anti-malware",
    "found technical links": "https://mobile.twitter.com/fwosar/status/1421504819890634754",
    "since its appearance": "https://www.techradar.com/news/revil-returns-but-under-another-name",
    "TechCrunch": "https://techcrunch.com/2021/09/12/technology-giant-olympus-hit-by-blackmatter-ransomware/"
  }
}