{
  "source": "https://www.techradar.com/news/samsung-brings-ecg-and-blood-pressure-checks-to-thousands-of-galaxy-watch-users",
  "title": "Samsung brings ECG and blood pressure checks to thousands of Galaxy Watch users",
  "category": "fitness",
  "updated": "2021-01-26T13:03:35Z",
  "author": "axel-metz",
  "summary": "Potentially life-saving features on their way to 31 new countries",
  "article": [
    "Samsung has announced that its Health Monitor app is coming to owners of the latest Samsung Galaxy Watch devices in 31 new countries, including the UK.",
    "Galaxy Watch 3 and Galaxy Watch Active 2 users will be able to access features including ECG (electrocardiogram) and blood pressure tracking, which have previously only been available on models purchased in South Korea and the US.",
    "The Samsung Health Monitor app is intended to help users monitor their health and wellness goals, with new features able to detect irregularities in heart rhythm and sense when body tension is too high.",
    "The Samsung Galaxy Watch 3’s ECG functionality brings the device in line with many high-end fitness watches, including the Apple Watch 6 and Fitbit Sense, but the device’s blood pressure monitoring capabilities means it arguably offers more health functionality than many of its wearable competitors – especially as it's now a feature more widely available across the globe.",
    "To take blood pressure and ECG measurements, you must have the Samsung Health Monitor app installed on both the Galaxy Watch 3 or Galaxy Watch Active 2 and their Galaxy smartphone.",
    "The Samsung Health Monitor app is automatically installed when you update your Galaxy smartwatch to the latest version via the Galaxy Wearable app. The smartwatch app will then open a link, which will direct users to the smartphone app download page in the Galaxy Store app."
  ],
  "headers": {
    "4": "How to get the update"
  },
  "links": {
    "announced": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9338459603578868000&xs=1&url=https%3A%2F%2Fnews.samsung.com%2Fglobal%2Fsamsung-expands-vital-blood-pressure-and-electrocardiogram-tracking-to-galaxy-watch3-and-galaxy-watch-active2-in-31-more-countries%3Futm_source%3Drss%26utm_medium%3Ddirect&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-brings-ecg-and-blood-pressure-checks-to-thousands-of-galaxy-watch-users",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense"
  }
}