{
  "source": "https://www.techradar.com/news/oneplus-9-vs-oneplus-9-pro",
  "title": "OnePlus 9 vs OnePlus 9 Pro: is there value in going Pro?",
  "category": "phones",
  "updated": "2021-03-24T11:23:05Z",
  "author": "jon-mundy",
  "summary": "Do you need to splash the cash on the Pro model?",
  "article": [
    "The OnePlus 9 Pro and the OnePlus 9 have finally been unveiled, marking one of the signature flagship phone announcements of 2021 so far.",
    "As expected, these two phones pack in plenty of improvements over the OnePlus 8 Pro and the OnePlus 8 respectively, especially with the new Hasselblad-tuned cameras that aim to fix earlier OnePlus phones' photographic shortcomings. But the question the question we’re here to answer is: how do they compare to one another?",
    "What does going Pro really get you, and is it worth the premium you’ll have to pay for privilege? Let’s take a closer look at how these two phones stack up.",
    "Both the OnePlus 9 and the OnePlus 9 Pro represent a price bump over their predecessors, the OnePlus 8 and OnePlus 8 Pro respectively.",
    "But we’ll leave discussions about that for another feature. What’s important to us here is how they compare to one another, and on that front there’s also been some movement.",
    "Prices for the OnePlus 9 start from $729 / £629 (about AU$940) for the 8GB of RAM / 128GB model, and move up to $829 / £729 (about AU$1070). for the 12GB of RAM / 256GB model. The OnePlus 9 Pro, on the other hand, starts at $969 / £829 (about AU$1,250) for 8GB / 128GB, and goes up to $1,069 / £929 (about AU$1,400) for 12GB / 256GB.",
    "That’s a considerable $240 difference across the board. This means that the gap between these two phones has increased by $40 over the OnePlus 8 range.",
    "OnePlus hasn’t exactly made any bold design moves with the OnePlus 9 Pro and the OnePlus 9. These are two tidy, well-built phones – or “burdenless” to use the OnePlus vernacular. They undoubtedly lack the visual panache of Samsung’s and Apple’s latest iPhone 12 series, but they aren't unattractive, either.",
    "Of the two, the OnePlus 9 Pro is the better looking and feeling phone. That might sound obvious given its Pro status, but last year’s OnePlus 8 was roughly of a piece with its OnePlus 8 Pro sibling, and the two were tough to differentiate. Not so here.",
    "The reason for this shift lies on the OnePlus 9 side of the equation. While the OnePlus 9 Pro is more or less a continuation of the OnePlus 8 Pro’s design – barring a less prominent camera module – the OnePlus 9 represents a bit of a regression.",
    "No longer is the cheaper phone’s chassis made up of aluminum. Instead, OnePlus has traded in for a “fiberglass-reinforced polymer frame” – that’s fancy plastic to you and I. While it looks fine, and you still get a glass back, it undoubtedly makes the phone feel cheaper and lower grade than the Pro.",
    "The finishes are slightly different too. While the OnePlus 9 Pro offers the glossy silver Morning Mist, matte Forest Green, and glossy Stellar Black, the OnePlus 9 comes in the light purple gradient Winter Mist, light blue Arctic Sky, and glossy Astral Black.",
    "Also, while the OnePlus 9 Pro is 3mm taller than the OnePlus 9 at 163.2mm, it’s also half a millimeter narrower. This is because the OnePlus 9’s smaller display is completely flat, with more of a side bezel. The OnePlus 9 Pro’s is slightly curved, with thinner bezels, giving it a tighter and more premium appearance. (Interestingly, the side of the display has less curve than the OnePlus 8, as users found their fingers slipping off the edge.)",
    "Despite the difference in size and materials, both phones weigh nearly the same. The OnePlus 9 Pro comes in at 197g, while the OnePlus 9 weighs 192g.",
    "Both phones sport the signature OnePlus alert slider on the right hand edge, which lets you set your phone to silent, vibrate, or ring tone with a satisfying click.",
    "The OnePlus 9 Pro’s display is better than the OnePlus 9’s in virtually every way. It’s bigger at 6.7-inches compared to the OnePlus 9’s 6.55-inches.",
    "You also get a sharper screen with the Pro, to the tune of 3216 x 1440 resolution aka QHD. The OnePlus 9’s display is 2400 x 1080 or FHD. This makes for a much more pixel-dense picture for the Pro at 525 ppi when compared to the OnePlus 9’s 402 ppi.",
    "Both are AMOLED displays, and boast similarly punchy colors and deep blacks. But even there the OnePlus 9 Pro scores higher, with a higher peak brightness of 1300 nits (versus 1100 nits) and native 10-bit color depth.",
    "While both displays support a 120Hz refresh rate (an improvement for the OnePlus 9 over the 90Hz OnePlus 8), the OnePlus 9 Pro has more tech features. Thanks to the addition of LTPO technology, it can adjust its frame rate from 1Hz to 120Hz depending on what's being displayed (looking at a saved photo vs. playing an intense online game, respectively), saving power. It also has a faster touch sampling rate with its Hypertouch feature, recognizing finger touches faster than ever for peak game performance.",
    "Both displays are great in their own right, but the OnePlus 9 Pro screen feels like it’s half a generation ahead. Which, given that the OnePlus 9 display is taken directly from the late–2020 OnePlus 8T, doesn’t appear to be far from the truth.",
    "Run side by side, the OnePlus 9 Pro display is clearly the brighter, more vibrant, and more color-accurate of the two. But of course, the vast majority of people won’t be comparing them in this way.",
    "Another shared point to note here is the presence of a speedy in-display fingerprint sensor on both phones, though accuracy may suffer if you don't have your thumb exactly on the reader.",
    "The OnePlus 8 Pro was the first OnePlus phone to feature a genuinely good camera. Both the OnePlus 9 Pro and the OnePlus 9 continue in the same vein.",
    "In the case of the OnePlus 9, the debt to the OnePlus 8 Pro is clear. It packs the same 48-megapixel Sony IMX689 main sensor, albeit without the same OIS assistance. Still, it captures bright, reasonably crisp shots.",
    "The OnePlus 9 Pro takes things to the next level with a new custom 48-megapixel Sony IMX789 sensor. It’s the same size as its predecessor at 1/1.43\", and it produces the same 12-megapixel shots with 2.24 μm pixels using pixel binning techniques.",
    "Both phones benefit from OnePlus’s new partnership with Hasselblad. While the Swedish camera maker hasn’t gotten involved in the camera hardware side of things as yet (stay tuned for that in later OnePlus phones), it has turned its attention to the color science. As a result, both phones are capable of taking shots that pop with color, aided by the ability to shoot photos in 12-bit RAW format.",
    "That said, the OnePlus 9 Pro’s snaps definitely stand out more, with richer colors, greater dynamic range, and more detail when you really zoom in and start pixel-peeping. The dynamic range enhancements come partly from the provision of Digital Overlap High Dynamic Range (DOL-HDR) technology, which makes it so that both bright and dark data can be presented at the same time.",
    "The OnePlus 9 Pro’s Nightscape mode is also capable of taking crisper, clearer, brighter shots than its brother. No doubt that’s aided by the inclusion of OIS.",
    "Going back to the hardware, The OnePlus 9 Pro also benefits from the inclusion of a dedicated 8-megapixel telephoto lens, which can take 3.3x optically zoomed shots. The OnePlus 9, by contrast, gets no such telephoto provision.",
    "The rest of the camera package is the same across the two phones. Both have impressive 50-megapixel Sony ultrawide IMX766 ultrawide sensors, which are 3.2 times larger than the iPhone 12 Pro Max equivalent. They also pack freeform lenses, which means that wide angle shots suffer from far fewer edge distortions than most smartphone ultra-wide lenses. You also get a 2-megapixel monochrome with both phones, which enhances any arty black and white shots you might take.",
    "Both phones also come with a 16-megapixel Sony IMX471 front camera, which is a pretty capable selfie snapper.",
    "While the OnePlus 9 Pro has had the clear upper hand in every category so far, it and the OnePlus 9 are largely even on performance. Both are powered by Qualcomm’s Snapdragon 888 SoC, which is the go-to chip for early–2021 Android flagships.",
    "This is backed by either 8GB or 12GB of LPDDR5 RAM in both cases, depending on the model you choose. Sure enough, performance is similarly snappy across the two phones, although the OnePlus 9 Pro seems to take the slightest edge in benchmarking.",
    "We ran Geekbench 5 simultaneously on both phones, and the OnePlus 9 Pro would consistently finish a fraction quicker and with a slightly higher score. We recorded average multicore scores of 3739 for the OnePlus 9 Pro and 3587 for the OnePlus 9. It’s a slight but unmistakable edge.",
    "Unsurprisingly, given the top tier specifications, it’s possible to play something like PUBG Mobile on maxed out settings on both phones, with remarkably fluid performance. In the case of the OnePlus 9 Pro, that means a UHD resolution and an Ultra frame rate.",
    "That gaming performance is helped by the inclusion of larger vapor chambers for both, providing more effective heat dissipation when under sustained load. Those snappy CPUs and GPUs can run at full whack for longer without needing to be throttled back.",
    "Even the onboard storage provision is the same, with a choice of either 128GB or 256GB – though it can't be expanded as there's no microSD slot.",
    "Both phones benefit from stereo speakers with Dolby Atmos support. OnePlus has also fitted both phones with improved haptic motors, and of course both phones support sub-6 and mid-band 5G, too – though only the OnePlus 9 Pro supports mmWave 5G.",
    "You get dual-cell 4500 mAh batteries with both phones, which probably explains why they have similar weights despite their slightly differing materials.",
    "From a practical perspective, this shared spec might worry prospective OnePlus 9 Pro customers. After all, the more expensive phone has a bigger, brighter, and sharper display to drive.",
    "However, the inclusion of LTPO screen technology helps rein in some of that extra power consumption. Unlike the the OnePlus 9, the Pro’s screen can drop from 120Hz right down to 1Hz when appropriate.",
    "The result of this is general parity when it comes to stamina. You’ll be able to get through a full day of moderate to heavy usage with both phones, though intensive use will definitely drain things faster.",
    "Both phones come with a Warp Charge 65T charger in the box, which is a poke in the eye for Samsung and Apple. And not just because it’s bundled in either – 65W charging is way quicker than either the Samsung Galaxy S21 or the iPhone 12 family supports.",
    "Using this power brick, both phones can recharge from 1 to 100% in just 28 minutes, which is quite frankly ridiculous.",
    "Only the OnePlus 9 Pro supports fast wireless charging, however. You’ll need to buy the bespoke Warp Charge 50 Wireless charger from OnePlus, but if you do you’ll be able to go from 1 to 100% in just 43 minutes. The OnePlus 9 only goes up to 15W wireless charging, but that’s still competitive with those aforementioned premium rivals.",
    "OnePlus has created two more compelling devices in the OnePlus 9 Pro and the OnePlus 9.",
    "In the OnePlus 9 Pro you have a genuine flagship contender, with all of the specifications and refined components that you’d expect for the money. In the OnePlus 9, you have an affordable flagship to rival phones like the Samsung Galaxy S21 and iPhone 12.",
    "The OnePlus 9 Pro is without doubt the better phone of the two. It’s got a superior screen, a stepped up camera, and a more premium design, all in a package that isn’t much bigger or heavier.",
    "However, for those looking to spend less, the OnePlus 9 still gives you top notch performance and a solid camera. Indeed, the differences only become readily apparent when you use these two phones side by side, which most people simply won’t be in a position to do."
  ],
  "headers": {
    "3": "OnePlus 9 vs OnePlus 9 Pro price and availability",
    "7": "Design",
    "15": "Display",
    "22": "Camera",
    "31": "Specs and performance",
    "38": "Battery",
    "45": "Takeaway"
  },
  "links": {
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12"
  }
}