{
  "source": "https://www.techradar.com/news/nvidia-dlss-delivers-huge-frame-rate-boosts-for-baldurs-gate-3-and-back-4-blood",
  "title": "Nvidia DLSS delivers huge frame rate boosts for Baldur’s Gate 3 and Back 4 Blood",
  "category": "gaming",
  "updated": "2021-10-12T16:01:17Z",
  "author": "darren-allan",
  "summary": "DLSS is arriving on 10 more games in October",
  "article": [
    "Nvidia has announced that DLSS is gracing 10 more games with its presence in October, with the frame rate boosting tech coming to Baldur’s Gate 3 (as rumored back in July) and Back 4 Blood.",
    "The biggest boost, according to Nvidia’s own benchmarking – which as with any internal performance testing, should be taken with a dusting of salt – is witnessed by Baldur’s Gate 3.",
    "The RPG, which is still in early access (testing) on Steam, is getting DLSS with its latest update this week, with the promise of up to 88% frame rate boosts. That particular best-case scenario is at 4K resolution with max graphics settings and DLSS in performance mode.",
    "This means that those with an RTX 3060 Ti can enjoy the game at these settings while still exceeding the magic 60 frames per second (fps) threshold, reaching 64 fps in fact, whereas without DLSS, the GPU would only manage 34 fps. Those with an RTX 3080 can hit the 100 fps mark (the card gives 54 fps without DLSS in 4K). These benchmarks were run with an AMD Ryzen 9 5900X as the guest CPU, by the way.",
    "The other big name here is Back 4 Blood which came out today, and Nvidia also benchmarked that in 4K in an identical manner to Baldur’s Gate 3. The results were that at 4K with max settings, even the lowly RTX 2060 hit 60 fps (compared to 41 fps with DLSS off). The RTX 3060 Ti managed 99 fps compared to 53 fps without DLSS.",
    "The other games getting DLSS in October are as follows: Chivalry 2, Crysis Remastered Trilogy, Rise of the Tomb Raider, Shadow of the Tomb Raider, Sword and Fairy 7, Swords of Legends Online, with Alan Wake Remastered and FIST: Forged In Shadow Torch already having the tech. With Baldur’s Gate 3 and Back 4 Blood on top, that makes 10 new additions for this month in total.",
    "In total, with these 10 new offerings this month, Nvidia DLSS is now supported by 120 games and apps.",
    "Of course, there’s an anomaly here in that DLSS is actually already in Shadow of the Tomb Raider, which was one of the very first RTX titles, but only version 1.0 of the tech – which was when DLSS wasn’t nearly as good. Version 2.0 made major leaps in terms of performance, so it’s great to see that Nvidia is bringing the latest DLSS to the game.",
    "In fact, with the new DLSS (in performance mode), Shadow of the Tomb Raider performance more than doubles at 4K with max settings and ray tracing on, again going by Nvidia’s own testing. (The RTX 3060 Ti hits 66 fps with DLSS, rather than the 32 fps which it would normally achieve).",
    "Hopefully that’s a sign that other games still languishing on the first incarnation of DLSS might get the upgrade through, as well.",
    "Via PC Gamer"
  ],
  "headers": {
    "6": "Analysis: Not just new games – but an upgraded DLSS version in the mix"
  },
  "links": {
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-brings-faster-frame-rates-to-more-games-thanks-to-unreal-engine-plug-in",
    "Baldur’s Gate 3": "https://www.techradar.com/news/baldurs-gate-iii-may-just-be-the-future-of-pc-rpgs-and-im-so-here-for-it",
    "rumored back in July": "https://www.techradar.com/news/baldurs-gate-3-could-get-nvidia-dlss-when-it-arrives-in-2022",
    "benchmarking": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-5505596974002633000&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-us%2Fgeforce%2Fnews%2Foctober-2021-rtx-dlss-game-updates%2F",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Back 4 Blood": "https://www.techradar.com/reviews/back-4-blood",
    "DLSS is actually already in Shadow of the Tomb Raider": "https://www.techradar.com/news/dlss-games-top-titles-that-support-nvidias-exciting-tech",
    "PC Gamer": "https://www.pcgamer.com/uk/nvidia-dlss-announcement-back-4-blood-baldurs-gate-tomb-raider/"
  }
}