{
  "source": "https://www.techradar.com/news/yubico-and-microsoft-want-to-finally-kill-off-passwords-for-good",
  "title": "Yubico and Microsoft want to finally kill off passwords for good",
  "category": "computing",
  "updated": "2021-03-02T21:00:00Z",
  "author": "anthony-spadafora",
  "summary": "Passwordless authentication is now available for Azure Active Directory",
  "article": [
    "Microsoft Azure Active Directory (Azure AD) users can now login without having to enter a password as Yubico has announced that YubiKey passwordless authentication is now available on the platform.",
    "Nearly three years ago, Yubico first embarked on this journey with Microsoft when the company brought the first FIDO2-enabled security key to the market and since that time, demand for passwordless authentication has grown significantly.",
    "Now that passwordless login is now generally available for Azure AD, admins can enable users to login using a variety of different authentication options including Windows Hello, the Microsoft Authenticator App, and FIDO2 security keys such as YubiKeys.",
    "End users can now use passwordless authentication and a YubiKey or other security key for that matter to log into Microsoft 365 web apps in Chrome and Edge on desktop, enterprise applications federated with Azure Active Directory, Windows 10 devices (version 1903 and above) joined to Azure Active Directory and Windows 10 devices joined to a hybrid Active Directory.",
    "Corporate VP of program management at Microsoft's Identity Division Alex Simons explained how broad support for FIDO2 standards can help organizations move beyond passwords, saying:",
    "“Now with broad support for FIDO2 standards, our customers can provide an authentication experience for their users that is effortless, cross platform, and highly secure. We are happy to be part of a collaboration with Yubico in our joint effort to move beyond passwords and provide more secure environments for today’s workforce.”",
    "Many of Yubico's YubiKeys support Microsoft's passwordless authentication including the flagship YubiKey 5 Series and the company's Security Key NFC. To get started using passwordless authentication in their Microsoft environment, organizations will need to either purchase a passwordless starter kit or contact the Yubico sales team for a consultation."
  ],
  "headers": {
    "3": "Passwordless authentication"
  },
  "links": {
    "Azure AD": "https://www.techradar.com/news/microsoft-promises-huge-improvements-in-azure-uptime",
    "Yubico": "https://www.techradar.com/news/making-secure-login-accessible-to-all-qanda-with-yubico",
    "FIDO2": "https://www.techradar.com/news/windows-10-is-a-step-closer-to-never-needing-passwords",
    "Windows Hello": "https://www.techradar.com/how-to/software/how-to-use-windows-hello-1301455",
    "Microsoft Authenticator App": "https://www.techradar.com/news/microsoft-authenticator-is-getting-its-own-password-manager",
    "security keys": "https://www.techradar.com/best/best-security-key",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "YubiKey 5 Series": "https://www.techradar.com/news",
    "Security Key NFC": "https://www.techradar.com/news/yubico-launches-security-key-nfc-and-previews-yubikey-for-lightning",
    "passwordless starter kit": "https://www.gopjn.com/t/8-12281-101987-191575?sid=trd-us-1245748705712439000&website=194177&url=https%3A%2F%2Fwww.yubico.com%2Fproduct%2Fpasswordless-starter-kit%2F"
  }
}