{
  "source": "https://www.techradar.com/news/oppo-find-x3-pro-vs-iphone-12-pro-max",
  "title": "Oppo Find X3 Pro vs iPhone 12 Pro Max: super-sized camera phones face off",
  "category": "phones",
  "updated": "2021-05-29T13:00:14Z",
  "author": "jon-mundy",
  "summary": "Two of the very best camera phones",
  "article": [
    "The iPhone 12 Pro Max is the Apex predator of the smartphone world, laying down a formidable roster of premium features for a correspondingly high fee.",
    "But Apple is no longer the only manufacturer making waves in the emerging super-premium category. Oppo has arrived as a major new player, and the Oppo Find X3 Pro is a serious statement of intent.",
    "With both of these phones sporting bold design flourishes, impressive camera specs, and similar price points, this is going to be a close fought – not to mention, aesthetically pleasing – battle.",
    "The Oppo Find X3 Pro landed on March 19, 2021. The sole 256GB model costs a chunky £1,099 / AU$1,699, which roughly converts to around $1,500.",
    "As that approximate dollar pricing suggests, you can’t buy the Oppo Find X3 Pro in the US. Mark that down as an early win for the universally available iPhone.",
    "The iPhone 12 Pro Max hit shops on November 13, 2020, with pricing starting from $1,099 / £1,099 / AU$1,849 for 128GB of storage. That jumps to $1,199 / £1,199 / AU$2,019 for 256GB, and $1,399 / £1,399 / AU$2,369 for 512GB.",
    "Like for like, then, the iPhone 12 Pro Max is £100 / AU$320 more expensive than the Oppo Find X3 Pro. We’re all even going into the Design category.",
    "Smartphone design has become ever so slightly stale in recent times, but these two phones at least attempt something different.",
    "The Oppo Find X3 Pro looks like pretty much every other Android flagship from the front, with a dual-curved Gorilla Glass 5 display, minimal bezels, and a hole punch selfie camera in the top-left corner.",
    "Around the back, however, it looks quite striking. It has a large camera module that appears to organically erupt out of the Gorilla Glass 5 surface, rather than sitting on top of it. We do miss the Oppo Find X2 Pro’s attractive vegan leather and ceramic finish options, but props to Oppo for trying something new here.",
    "Other than that, you get a pretty typical aluminum frame, although Oppo flattens out the top and bottom edges in another bespoke touch.",
    "Camera module aside, the iPhone 12 Pro Max looks way more iconic than its rival. Apple has ditched the curves in favor of an angular, flat-edged design reminiscent of the iPhone 4 and iPhone 5.",
    "It also uses a more premium stainless steel material for its rim, and the flat front of the phone is covered by a tougher Ceramic Shield. Apple claims that this provides four times the drop protection of regular display glass.",
    "Both phones are big, but the Oppo Find X3 Pro is generally more wieldy, and not merely because of those curves. At 163.6 x 74mm, it’s both shorter and narrower than the 160.8 x 78.1mm iPhone.",
    "It’s also significantly lighter than Apple’s phone at 193g. Thanks, no doubt, to its use of stainless steel, the iPhone 12 Pro Max weighs in at a chunky 228g. However, Apple’s flagship is a lot thinner than the Oppo, at 7.4mm versus 8.3mm.",
    "Both phones get an IP68 rating, although the iPhone goes above and beyond in being capable of immersion in six metres of water rather than the stipulated 1.5 metres.",
    "Apple’s distinctive display notch is definitely more intrusive than Oppo’s tiny hole-punch, but it also lays on Face ID.",
    "These are two great 6.7-inch OLED displays, capable of outputting vibrant and accurate colors. But there’s no doubt which is the better of the two.",
    "The Oppo Find X3 Pro screen wins in several key areas. It’s sharper, with a resolution of 3216 x 1440. The iPhone 12 Pro Max display gets plenty sharp enough, but at 2778 x 1284, it falls just a little short of its rival.",
    "The really meaningful win for Oppo here is the refresh rate. While the Find X3 Pro’s LTPO technology ensures it can scale between 5Hz and 120Hz depending on the task, the iPhone 12 Pro Max is stuck at a measly 60Hz. The end result: Apple’s phone is literally half as fluid.",
    "Oppo’s display also gets a tad brighter at 1300 nits compared to the iPhone’s 1200 nits. However, this isn’t something you’ll really notice in use.",
    "The Chinese manufacturer makes a lot of its ability to output an impressive 1 billion colors, and to cover 100% of the DCI-P3 color gamut. We found the phone’s default output to be more exaggerated and less natural than the iPhone’s, but you can tweak this in the Settings menu.",
    "You also get a fast, reliable in-display fingerprint sensor that’s positioned a tad lower than we’d have liked. The iPhone 12 Pro Max, of course, no longer features Touch ID due to its facial recognition system.",
    "We can’t imagine that anyone will be disappointed with either of these displays, as they output all content beautifully. But the Oppo has a definite edge over the iPhone.",
    "Whenever you spend more than £1,000 / $1,000 on a smartphone, it’s typically the camera system that benefits most from the extra investment. That’s certainly the case with both phones here; they’re two of the very best camera phones in the business.",
    "The Oppo Find X3 Pro has a quad-camera system with one stand-out boast: both the main wide camera and the ultra-wide camera are backed by an identical 50-megapixel Sony IMX766 sensor. Typically, a phone’s ultra-wide camera sensor will vary in terms of tone, detail and all-round quality, but this is the most parity we’ve ever seen in a phone.",
    "That ultra-wide is the real star of the show. Not only is the sensor top-drawer, but the use of a freeform lens greatly reduces those weird visual distortions that you typically get from such a wide snapper.",
    "Unfortunately, the 13-megapixel telephoto camera isn’t such a home-run. It has a fairly unremarkable 2x zoom, and with no OIS to steady things out. The iPhone’s is 2.5x and it has OIS. It’s a shame Oppo ditched the 5x periscope lens of the Oppo Find X2 Pro.",
    "There’s also a novel 3-megapixel Microlens camera on the Oppo, which can produce 60x extreme close-ups if you can get the phone close and steady enough, in sufficient light. It’s a cool effect when it works – but, ultimately, it’s a bit of a gimmick.",
    "The iPhone also strives for balance in its own way, with three 12-megapixel cameras for wide, ultra-wide and telephoto shots. The main sensor is the talking point here, since it’s 47% bigger than any of the other iPhone 12 handsets. It’s certainly a match for the Oppo when it comes to sucking in light, particularly allied to a wide f/1.6 aperture (the Oppo’s is f/1.8).",
    "Besides those three cameras, the iPhone also packs a LiDAR sensor that helps improve low-light autofocus, and a sensor-based optical stabilization system to keep those long exposures steady.",
    "Night time is where the iPhone 12 Pro Max really shows its capabilities, although both phones can utilise their Night modes across all of their cameras, including selfies.",
    "For all the fancy hardware, much of the look of these two camera systems comes down to color science and image processing. Oppo claims that its Find X3 Pro is the first phone to be able to capture and display 1 billion colors. Its shots are vibrant, with a notably warmer and more punched-up tone.",
    "Apple, on the other hand, goes with a more naturalistic tone that better reflects the actual scene. Your preference will doubtless vary on this, but we generally prefer Apple’s approach.",
    "Both phones pack in the software features. The Oppo can grab 12-bit RAW shots through its manual mode, while Digital Overlap HDR (DOL-HDR) reduces ghosting in HDR shots by shooting long and short exposures in very quick succession.",
    "The iPhone gets Smart HDR 3 and Deep Fusion to provide smarter shot selection and better contrast. ProRAW, meanwhile, combines the data-packed RAW format with the auto-adjusting computational improvements of JPEG.",
    "Both phones support 4K video at 60fps, but Apple is the established king of steady, sharp footage.",
    "Both of these phones are plenty fast enough to do everything you might ask of them, but the iPhone 12 Pro Max is the more impressive of the two.",
    "The Oppo Find X3 Pro runs on Qualcomm’s Snapdragon 888 processor, which is the go-to chip for Android flagship phones in 2021. This is backed by 12GB of LPDDR5 RAM.",
    "Over in the other corner, the iPhone 12 Pro Max powers along on the back of Apple’s A14 Bionic, which is the fastest chip that Apple has ever made. This is backed by 6GB of RAM, but fundamental differences in the operation of iOS and Android mean it’s impossible to draw a conclusion from that fact alone.",
    "So how do we compare the performance of these two phones? It’s tricky when 3D games run at full whack on both, and when there’s nary a hint of stutter when jumping into the camera or multitasking.",
    "Benchmarks are the most reliable method, and they show the iPhone 12 Pro Max to be the faster phone by some margin. An average Geekbench 5 multi-core score of 4,106 sees the iPhone 12 Pro Max absolutely hammering the Oppo on 3,257, while a single-core score of 1,591 for the iPhone is almost double the Oppo’s 870.",
    "It’s also worth pointing out that these Geekbench results pitch the Oppo behind many of its direct Android rivals running on identical hardware. The iPhone 12 Pro Max, on the other hand, is the fastest phone that Apple makes.",
    "Elsewhere, the Oppo Find X3 Pro offers a generous 256GB of internal storage as standard, but there’s no scope for specifying more or less, and no microSD slot either. The iPhone 12 Pro Max gives you a choice of 128GB, 256GB, or 512GB – although, again, with no potential for expansion.",
    "Another major point of difference has already been referenced – software. The Oppo runs on Android 11 with ColorOS, which is Oppo’s own custom skin, while the iPhone runs on Apple’s very own iOS 14.",
    "ColorOS is much less clean and appealing than iOS, with way more bloatware and less polish. But it’s also far more customizable, with the ability to tweak and theme the appearance of your home screen in a variety of ways.",
    "Both phones also offer 5G connectivity, although that’s hardly a talking point in 2021 – especially with 5G coverage being as spotty as it is.",
    "The Oppo Find X3 Pro runs on a 4,500mAh battery. The fact that it’s much bigger than the iPhone 12 Pro Max’s 3,687mAh cell can be deceiving, however.",
    "As we’ve already mentioned, iOS and Android handle their respective hardware resources very differently, and that includes their batteries. Apple’s OS is famously more buttoned down and frugal than Google’s.",
    "In practice, we found that the Oppo Find X3 Pro lasted a full day of light to medium use without issue. We had to really hit it hard with games and videos to make it fall short of a regular 12-hour shift. It’s a solid one-dayer, and will only red line when you really push it on the media front.",
    "The iPhone 12 Pro Max is the longest-lasting phone in the iPhone 12 family, and the only one that will last through a full day of intensive use on flaky mobile networks. 5G connectivity really hits both phones hard, just as it does with every other flagship device out there.",
    "If stamina is nip and tuck, then the Oppo clearly wins out when it’s time to plug in. It ships with a 65W charger in the box, whereas the iPhone only gives you a measly cable. You’ll have to supply your own power brick, and even then it only supports charging speeds up to 20W.",
    "The Oppo Find X3 Pro also supports up to 30W wireless charging next to the iPhone 12 Pro Max’s 15W – although you can invest in one of Apple’s fancy new magnetized MagSafe chargers, should you wish.",
    "As predicted, this has been a close-fought battle between two premium flagship phones. Both justify the extra expenditure required to obtain them, albeit in different ways.",
    "With the iPhone 12 Pro Max, you’re getting the most powerful phone on the market, with arguably the most premium design and the best all-round software offering. It also comes with the best point-and-shoot camera experience around, bar none.",
    "In the case of the Oppo Find X3 Pro, you have a stylish Android phone with a superior 120Hz display, impeccable ultra-wide snaps, and much faster charging, together with a more customizable (although altogether uglier) OS.",
    "All in all, we prefer the iPhone 12 Pro Max as an all-round package. It just has that extra layer of premium poise, and fewer rough edges. But whichever £1,000-plus smartphone you opt for, you’re in for a winner."
  ],
  "headers": {
    "3": "Oppo Find X3 Pro vs iPhone 12 Pro Max price and availability",
    "7": "Design",
    "17": "Display",
    "24": "Camera",
    "37": "Specs and performance",
    "47": "Battery life",
    "53": "Takeaway"
  },
  "links": {
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro"
  }
}