{
  "source": "https://www.techradar.com/news/pandemic-has-transformed-consumer-payment-habits-for-good",
  "title": "Pandemic has transformed consumer payment habits for good",
  "category": "computing",
  "updated": "2021-05-06T08:00:07Z",
  "author": "rob-clymo",
  "summary": "Shoppers are warming to the benefits of digital wallets",
  "article": [
    "The majority of consumers have changed the way they pay for goods and services since the arrival of Covid-19, new research has found.",
    "According to a report from Paysafe, over eight in ten (86%) of the 8000 people have altered their payment habits compared to pre-pandemic times, with 49% trying out a new payment method for the first time.",
    "Consumers falling into the 18-24 year old age group have been even more willing to explore new ways of paying, with 77% trying out new apps and tapping into the potential of digital wallets.",
    "Minimal ability to pay for goods and services in-person has been the key factor in consumers adopting new routes to the checkout. While 33% cited this as being the main reason they’ve evolved their spending habits, some 26% of those surveyed stated that they were keen to track their spending more closely. The ever-present threat of fraud also ranked as a key concern with 25% admitting they were worried about it.",
    "Coronavirus and the upheaval that has come with it has driven more consumers to look more closely at the different payment options open to them. Indeed, some 38% of those questioned said they were now much better informed about the new tech and payment systems that were available. A third (31%) stated that they were willing to use an alternative payment if they were shopping online, compared to the old days when they’d simply choose a credit or debit card option.",
    "Nevertheless, card payments are still hugely popular. Data from the survey shows that, globally, 54% of consumers have called on a debit card to pay for something in the last month. Similarly, 51% of people surveyed have reached for their credit card over the course of the last four weeks to complete a transaction.",
    "However, digital wallet use is on the up, with 43% now using them globally in the last month. Usage rises looking towards Europe, with 55% of Italians now using a digital wallet compared to 47% in the UK to make payments over the last month. Global use of digital wallets indicates that 32% are now using them more than before the pandemic, while 13% favour prepaid cards. Meanwhile, just 8% plump for online cash or eCash alternatives.",
    "Consumers are also expecting a greater choice of payment options when they get to the checkout too, be it a conventional point of sale terminal in a store or an online variation on the theme. Over half (53%) of those surveyed said they would seek an alternative outlet in future if they didn't get their payment option of choice.",
    "On top of that, shoppers are also expecting better anti-fraud performance, with 63% looking out for tighter payment security measures when buying goods or services. Convenience seems to be the ultimate goal for consumers though, with 110% said to be prioritizing this aspect of their payment journey post Covid-19.",
    "And, while many of those questioned were glad that retailers were making additional efforts to help people shop, 28% still felt that many retailers hadn't moved fast enough to respond to changing needs.",
    "While 48% of consumers reported that they were keen to return to in-store shopping somewhat surprisingly 50% of them also reckoned they were going to make at least 25% of their transactions cash-based.",
    "Philip McHugh, CEO at Paysafe, comments: “Consumers have adapted and gotten to grips with alternative payment methods over the last year, partly because they had to due to the pandemic. Through our ongoing research into payment trends, we continue to witness that COVID-19 has been a real accelerator in the adoption of alternative payment methods and choice is everything.",
    "The good news is, it’s now easier than ever for merchants to integrate into a payments platform and access a huge range of payments methods via one connection.”"
  ],
  "headers": {
    "4": "Payment systems"
  },
  "links": {
    "pay for goods": "https://www.techradar.com/how-to/sas-best-mobile-payment-solutions-and-how-to-install-them",
    "payment method": "https://www.techradar.com/news/best-mobile-payment-app",
    "new apps": "https://www.techradar.com/best/best-iphone-apps-2021",
    "digital wallets": "https://www.techradar.com/news/digital-wallet-spending-to-skyrocket-in-the-next-five-years-study-suggests",
    "checkout": "https://www.techradar.com/news/many-online-shoppers-are-using-guest-checkout-over-data-privacy-fears",
    "track their spending": "https://www.techradar.com/best/best-expense-trackers",
    "threat of fraud": "https://www.techradar.com/news/how-to-detect-and-prevent-identity-fraud",
    "payment systems": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "shopping online": "https://www.techradar.com/best/best-shopping-cart-software",
    "card payments": "https://www.techradar.com/best/best-credit-card-processing-service",
    "point of sale terminal": "https://www.techradar.com/news/the-best-pos-system",
    "anti-fraud performance": "https://www.techradar.com/best/best-antivirus"
  }
}