{
  "source": "https://www.techradar.com/news/intel-cpu-sales-surge-fighting-amd-ryzen-dominance-but-will-it-last",
  "title": "Intel CPU sales surge, fighting AMD Ryzen dominance – but will it last?",
  "category": "computing",
  "updated": "2021-08-04T13:38:20Z",
  "author": "darren-allan",
  "summary": "Figures from German retailer show Intel swiftly clawing back market share",
  "article": [
    "AMD’s Ryzen CPUs may still dominate the overall desktop landscape going by recent sales figures from a big European retailer, but Intel is fighting back hard – although whether that apparent turnaround can last is definitely debatable.",
    "First off, let’s look at the sales breakdown of German retailer Mindfactory for July, as provided by Reddit user Ingebor (who posts these stats on a monthly basis, as you may have seen).",
    "The overall processor market share now stands at 76% for AMD, with Intel snaffling the remaining 24% of sales. What’s most interesting here is that Intel’s share is up strongly compared to June, when Team Blue had 18% of the market – and if we go back a month further, just 15%.",
    "So, this is a sizeable leap here, and putting it in perspective with the whole of the past year, it’s the highest share of CPU sales that Intel has seen (although the chip giant came close in February 2021 with 23%).",
    "Overall unit sales are down quite considerably, with AMD flogging just over 10,000 chips in July, and Intel shifting fewer than 5,000. Compare that to the end of 2020, when in December, AMD alone sold close to 40,000 units at Mindfactory. Things are now a lot quieter, and from what we’ve been hearing about component shortages – we’ll dig into this more in a moment – that’s not exactly a surprise.",
    "It’s worth noting that these figures are just from one single retail source, so we must be careful about reading too much into them in terms of the overall CPU landscape. As Wccftech, which spotted the latest Mindfactory stats, points out, it’s clear enough that AMD still holds court as king of the desktop processors when you look at the top-selling silicon on Amazon, Newegg and the like, which are all Ryzen 5000 or 3000 (current and last-gen) models.",
    "There’s no arguing that AMD remains very dominant in the desktop world, then, but this particular set of sales figures has shown a pronounced monthly increase for Intel in July, and indeed June. Team Blue had been slipping with market share since February 2021, but the last two months have seen that trend reversed – albeit actual unit sales are only a tad more than in May (with AMD’s units shifted having fallen heavily since May).",
    "This can only be a positive development for Intel, of course, but we’ll need to see this strength and an overall upward trend continue going forward into 2021 for it to really get folks to sit up and take notice.",
    "What’s in Intel’s favor is that the firm has Alder Lake processors on the horizon, too, which are seriously promising in terms of the performance they could usher in going by multiple leaks. Moreover, AMD doesn’t appear to have any reply in the near future, either, with next-gen Ryzen CPUs not expected until towards the end of 2022 according to the rumor mill, and no clear signs of when any Ryzen 5000 refresh (presumably XT models) might arrive as a stopgap.",
    "This could look very much like the door is being left clearly open for Intel to step in and drive forward with a serious comeback in desktop CPUs, but there’s just one problem – the company has admitted that it has run into some troublesome supply issues. Indeed, George Davis, Intel’s chief financial officer, has said that we can expect ‘acute’ supply issues through to and including September, and that the firm will be prioritizing premium chips for the likes of data center usage above consumer products (because the former is where the fatter profits lie – and binding contracts for that matter).",
    "The way Intel is describing these supply problems makes them sound pretty serious, and that is potentially the big fat fly in the thermal paste here, possibly hampering the apparent progress made over these last couple of months, at least going by this set of figures. And maybe even making life more difficult in getting those new Alder Lake chips on shelves; but let’s hope that isn’t the case, as we’ll be out of Q3 by then."
  ],
  "headers": {
    "6": "Analysis: Why Intel’s current gains could be short-lived"
  },
  "links": {
    "AMD’s Ryzen CPUs": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Intel": "https://www.techradar.com/news/best-processors",
    "Ingebor": "https://www.reddit.com/r/AMD_Stock/comments/ovp0sq/newest_mindfactory_data/",
    "AMD alone sold close to 40,000 units at Mindfactory": "https://www.techradar.com/news/amd-cpu-sales-get-even-stronger-as-ryzen-5000-stock-issues-ease",
    "Wccftech": "https://wccftech.com/amd-ryzen-desktop-cpus-continue-to-outsell-intel-core-cpus-zen-3-best-seller-at-several-retailers/",
    "Alder Lake processors": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "seriously promising in terms of the performance": "https://www.techradar.com/news/intel-alder-lake-leak-shows-a-flagship-cpu-that-could-be-an-amd-ryzen-5950x-killer",
    "next-gen Ryzen CPUs not expected until towards the end of 2022": "https://www.techradar.com/news/amds-next-gen-ryzen-cpus-and-rdna-3-gpus-could-launch-together-at-end-of-2022",
    "presumably XT models": "https://www.techradar.com/news/amd-ryzen-6000-cpus-not-coming-in-2021-more-rumors-claim-we-could-see-5000-xt-chips-instead",
    "admitted that it has run into some troublesome supply issues": "https://www.techradar.com/news/intel-warns-of-cpu-stock-shortages-in-near-future"
  }
}