{
  "source": "https://www.techradar.com/news/the-batman-is-facing-reshoots-so-is-it-getting-delayed-again",
  "title": "The Batman is facing reshoots – so is it getting delayed again?",
  "category": "entertainment",
  "updated": "2021-06-22T13:33:22Z",
  "author": "tom-power",
  "summary": "The Batman is reportedly undergoing extra filming",
  "article": [
    "The Batman, Warner Bros' latest reboot of the iconic DC superhero, hasn't been immune to the effects of the Covid-19 pandemic.",
    "The movie has already had its release date pushed back twice due to the global climate, as well as seeing production delayed on a couple of occasions due to various cast and crew members testing positive for the virus.",
    "Now, it seems that the upcoming film requires some reshoots to take place before the final cut is edited together ahead of its March 2022 launch.",
    "According to the Daily Record, Robert Pattinson and Colin Farrell – who are playing Bruce Wayne/Batman and Oswald Cobblepot/The Penguin respectively – are heading to Glasgow, Scotland to film some scenes for the movie's final cut.",
    "Glasgow was used as a stand in for Gotham City during filming, which took place in February 2020, before the Covid-19 pandemic impacted production. Pattinson and Farrell, though, weren't part of those initial scenes as they were primarily centered around action sequences.",
    "Per the Daily Record, sources close to the film has stated that Pattinson and Farrell will be present in the city to shoot some extra footage for the movie. Production is expected to last for a week before further filming takes place in York in July.",
    "Fans of the Dark Knight can rest easy about its release date potentially being pushed once more.",
    "Production officially wrapped on the film back in March, but reshoots are part and parcel of any large scale production. Given that The Batman reshoots are taking place from late June to mid July, there shouldn't be any major delays in getting the movie ready for its theatrical release on March 4, 2022.",
    "Once the footage is in the can, The Batman will move into its post-production phase. This is where the movie is edited together, visual effects are added, the score is layered over the film and more.",
    "There will be seven months between these reshoots taking place and The Batman's launch date. Providing there are no major hiccups along the way, the next reincarnation of the Caped Crusader should arrive in cinemas when it's expected to do so.",
    "Set during Batman's second year of fighting crime, the masked vigilante uncovers corruption in Gotham (relating to the Wayne family) amid a high-stakes chase for the serial killer known as The Riddler.",
    "The Batman stars Pattinson alongside Farrell, Zoe Kravitz, Paul Dano, Jeffrey Wright, John Turturro, Barry Keoghan, Peter Sarsgaard and Andy Serkis. It'll arrive in theaters on March 4, 2022."
  ],
  "headers": {
    "6": "Analysis: The Batman's release date won't be pushed again"
  },
  "links": {
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer",
    "Daily Record": "https://www.dailyrecord.co.uk/news/scottish-news/robert-pattinson-colin-farrell-head-24357381"
  }
}