{
  "source": "https://www.techradar.com/news/lokis-big-mystery-has-been-leaked-by-its-official-merchandise",
  "title": "Loki episode 2's big mystery has been leaked – by its official merchandise",
  "category": "entertainment",
  "updated": "2021-06-22T09:07:37Z",
  "author": "tom-power",
  "summary": "Loki on Disney Plus has had one of its secrets revealed again",
  "article": [
    "Spoilers follow for Loki episode 2.",
    "Loki will be halfway through his standalone Disney Plus adventure when the third episode arrives on Wednesday, June 23.",
    "The gap between episodes has given fans plenty of time to debate the identity of last week's big character reveal – something we weighed in on, too – but it seems that this discussion can now be put to bed.",
    "Why? Because the name of this new character has seemingly been confirmed by a new piece of official Loki merchandise.",
    "Ahead of episode 3's release, the official Zavvi online store listed some new official merchandise from jewellery manufacturer SalesOne.",
    "The item in question is a replica set of Loki's horned helmet, which we've seen the God of Mischief wear in past MCU movies. The set also includes the headpiece for Lady Loki, who was apparently the big character reveal in episode 2.",
    "However, this individual isn't called Lady Loki in the Marvel merchandise set – it's Sylvie, who Marvel comic fans will know as Sylvie Lushton or by her supervillain pseudonym Enchantress.",
    "This isn't the first time that Sylvie's real identity has been made public since Loki episode 2 aired on Disney Plus.",
    "In the aftermath of the episode, fans noticed that the so-called Lady Loki character (played by Sophia Di Martino) wasn't a female rogue variant of Tom Hiddleton's Loki after all.",
    "During the Castellana and German language dub sections of the end credits sequence, eagle-eyed viewers noticed that a character called Sylvie, and not Lady Loki, appeared alongside Loki, Agent Mobius and the TV show's other main players.",
    "Hours later, fans noticed that the language dub sections had been altered by Marvel or Disney, presumably in a bid to prevent this character reveal from being seen by any viewers who would be watching episode 2 later in the evening or at the weekend.",
    "The damage, though, had already been done. Multiple online discussions erupted as MCU fans argued the case for (and against) Di Martino's character being Lady Loki and Sylvie.",
    "Now, given this official merchandise revelation, it appears that those in the 'Sylvie' camp are right about the identity of Di Martino's character.",
    "Of course, Marvel will hope that the vast majority of viewers won't have any idea about who Di Martino's character really is. Some audience members will have turned episode 2 off once the credits had rolled, and some won't be scouring the internet to try and find out who Sylvie/Lady Loki actually is.",
    "In that sense, Marvel are safe. However, there are sections of its fanbase who are now aware of the character's real identity, and it does take the fun away in finding out who Di Martino is portraying in the show.",
    "There's also the possibility that Marvel is combining Lady Loki and Enchantress into one character for Loki's TV show. If they did, it would certainly create a debate online as people discussed who this individual really is. Judging by the above threads, that's already happening.",
    "Hopefully, Loki's other big secrets won't be revealed by other unusual sources. There are four more episodes to go, and we expect that there will be plenty of other twists and turns along the way. It would be a shame if any other leaks ruined those surprises, so here's hoping that they don't.",
    "Loki episodes 1 and 2 are available to stream on Disney Plus right now."
  ],
  "headers": {
    "7": "Analysis: Loki's first big reveal has accidentally been released twice now"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/loki-episode-2-recap-compelling-detective-drama-with-a-time-travel-twist",
    "we weighed in on": "https://www.techradar.com/news/lady-loki-explained-who-is-the-character-revealed-in-loki-episode-2",
    "official Zavvi online store": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5288955676199292000&xs=1&url=https%3A%2F%2Fwww.zavvi.es%2Fmerch-memorabilia%2Fmarvel-s-loki-and-sylvie-helmet-replica-set-zavvi-uk-and-eu-exclusive%2F12966406.html&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Flokis-big-mystery-has-been-leaked-by-its-official-merchandise",
    "Multiple": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/o4vss6/new_character_poster_for_the_person_whos_name_no/",
    "online": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/o16v7s/disney_spain_leaks_the_true_identity_of_the_loki/",
    "discussions": "https://www.reddit.com/r/marvelstudios/comments/o4cnil/some_thoughts_about_the_variant_spoiler/"
  }
}