{
  "source": "https://www.techradar.com/news/the-sims-4s-next-expansion-could-feature-a-series-first",
  "title": "The Sims 4's next expansion could feature a series first",
  "category": "gaming",
  "updated": "2021-06-08T11:24:35Z",
  "author": "vic-hood",
  "summary": "The new Sims 4 expansion will be revealed this week",
  "article": [
    "It looks like we could be heading to the English countryside in the next The Sims 4 expansion.",
    "Sims influencers have been receiving a postcard that seemingly teases the setting for the new The Sims 4 expansion (thanks, GamesRadar). The postcard is from a fictitious location called Henford-on-Bagley, showing a bridge over a river.",
    "The postcard, from A&A Crumplebottom, reads: \"We're so pleased you're joining us in Henford-on-Bagley! I'm sure you will enjoy the quaint countryside life. Do come join us at our garden stall when you arrive!\"",
    "The postcard then goes on to say that the mayor has spoken of a worldwide tourism video for Henford-on-Bagley, which will take place on June 10 - which seems to be the new expansion's reveal.",
    "The Henford-on-Bagley name is reminiscent of English villages with similar titles such as Kingston upon Thames and Stoke-on-Trent, suggesting the new expansion may see us visiting the English countryside.",
    "There have been rumors for some time that EA has been working on a countryside/farming expansion for The Sims 4, with fans hoping that the new expansion will have a farming element. While this hasn't been confirmed, we do know that the iconic Crumplebottom family will play a part in this new expansion, given the postcard was from them.",
    "We'll find out more on June 10 at at 8am PT / 11am ET / 4pm BST (or June 11 at 1am AEST), when EA officially reveals the \"tourism video\" for the new expansion."
  ],
  "headers": {
    "4": "Country livin'"
  },
  "links": {
    "GamesRadar": "https://www.gamesradar.com/the-sims-4-teases-an-english-countryside-expansion-pack/"
  }
}