{
  "source": "https://www.techradar.com/news/the-boys-is-getting-a-hunger-games-style-spin-off-show",
  "title": "The Boys is getting a Hunger Games style spin-off show",
  "category": "entertainment",
  "updated": "2021-09-28T12:58:49Z",
  "author": "tom-power",
  "summary": "The Boys are back in town",
  "article": [
    "The Boys, Amazon Prime Video's most popular TV show, is getting a spin-off series.",
    "In a press release, Amazon Studios confirmed that it had given the greenlight for the offshoot series, which currently has no official title or release date.",
    "Billed as a \"part college show, part Hunger Games – with all the heart, satire and raunch of The Boys\", the untitled spin-off will be set in the US's only exclusive college for young-adult superheroes, which is obviously run by Vought International.",
    "Amazon revealed that the TV series will follow \"the lives of hormonal, competitive Supes as they put their physical, sexual and moral boundaries to the test, competing for the best contracts in the best cities\". So it's unsurprising that the spin-off show, much like The Boys itself, will be R-rated.",
    "Michele Fazekas (Emergence, Agent Carter) and (Reaper, Hawaii 5-0) will serve as showrunners and executive producers on the TV show. The Boys showrunner and executive producer Eric Kripke will also produce the series alongside the likes of Seth Rogen and Evan Goldberg. The Boys' creators Garth Ennis and Darick Robertson, too, are involved as executive producers.",
    "In a statement accompanying the announcement, Kripke said: “Much like Mork & Mindy spun-off from Happy Days – which is an insane and true fact – our spinoff will exist in the Vought Cinematic Universe, yet have a tone and style all its own. It’s our take on a college show, with an ensemble of fascinating, complicated, and sometimes deadly Young Supes.",
    "“Michele and Tara are stone-cold geniuses, we’re thrilled to have them steer this ship, and grateful to Sony and Amazon for the opportunity. We love this show and can’t wait for you to see it. Also, Baywatch Nights spun-off from Baywatch, and it had vampires. Vampires!”",
    "It's hard to argue with Amazon's desire to create spin-offs from The Boys. The studio's live-action adaptation of Ennis and Robertson's beloved comic series is arguably its biggest show ever. It's unsurprising, then, that Amazon wants to capitalize on its most popular product.",
    "Not only that, but Amazon will have noticed how other companies and streamers have begun to build live-action cinematic universes from their respective in-house productions.",
    "Netflix has achieved plenty of success with its Witcher adaptation and, based off that acclaim, it's gone on to make multiple spin-offs. The streaming giant has already released an animated prequel movie called Nightmare of the Wolf, while filming is currently ongoing on its Blood Origin spin-off series. Recently, Netflix also confirmed that two more Witcher productions – another animated film, as well as a family friendly show – are in development, while The Witcher has been renewed for a third season.",
    "Meanwhile, Marvel's Disney Plus shows have been received extremely well by the MCU's fanbase. Marvel's What If...? have breathed new life into the franchise, while the likes of WandaVision and Loki have taken the studio's movie formula and altered it for TV purposes to great effect.",
    "In a bid to keep up, then, Amazon Studios needs its own large-scale franchises that it can continue to flesh out and build upon. As its most popular show, The Boys is its best bet, and there's plenty that Amazon can do with the series – even after The Boys' final episode airs.",
    "So it shouldn't be a complete shock that The Boys is getting a spin-off show. And, honestly, we wouldn't be surprised if more offshoots arrive in the future, too. If The Boys' young-adult superhero show is a hit for Amazon Prime Video, similar properties are sure to be on the way."
  ],
  "headers": {
    "7": "Analysis: Amazon is right to build out The Boys' live-action universe"
  },
  "links": {
    "Witcher adaptation": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Blood Origin": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
    "also confirmed": "https://www.techradar.com/news/the-witcher-season-3-confirmed-by-netflix-while-season-2-gets-a-new-trailer",
    "Marvel's What If...?": "https://www.techradar.com/news/marvels-what-if-is-a-surreal-disney-plus-anthology-show-with-limitless-potential",
    "Loki": "https://www.techradar.com/news/loki-season-2"
  }
}