{
  "source": "https://www.techradar.com/news/lg-could-sell-thousands-of-rollable-oled-tvs-despite-high-prices",
  "title": "Rollable OLED TVs are here, but is anyone going to buy them?",
  "category": "televisions",
  "updated": "2021-04-09T15:48:00Z",
  "author": "henry-st-leger",
  "summary": "Market analysts have high sales estimates for the LG rollable OLED TV",
  "article": [
    "LG's rollable OLED TV is slowly rolling out to more regions worldwide, but despite the very high price for this experimental television, market analysts are predicting to see thousands of units sold in a single year – and several magnitudes of that in the years thereafter.",
    "Market analysts at Omdia (via OLED-info) have made their predictions for the rollable OLED TV, expecting that LG will be able to sell around 3,000 units in the course of 2022. That's a notable figure for such an expensive television, with it retailing at £99,999 in the UK and likely to cost an equivalent $99,999 in North America when it launches there in the coming months.",
    "But the figures get truly astronomical a few years down the line. Omdia predicts that sales figures will rise to 74,000 units in 2024, and 672,000 units in 2027.",
    "It's a fraction of the multi-million sales of OLED TVs every year, but notable nonetheless given the rather inaccessible price point.",
    "Some provisional reports out of South Korea – where the television launched first – claimed that only a handful of rollable OLED TV units (around 10) had been sold, so these figures may be somewhat optimistic. However, as the price point drops in the coming years, and potential audiences expand in new territories (the US is expected to get the set in late 2021), it's possible we'll see the rollable OLED TV gain some traction.",
    "Omdia is certainly no stranger to changing up its forecasts on the fly. In late 2019, the company predicted we'd see 5.5 million OLED TV sales in the successive year, but it changed that forecast to 3.5 million shortly into 2020. So it's likely we'll hear from Omdia, as we near those milestones, as to whether the LG rollable OLED TV is staying on track for such big success.",
    "Since LG first showed off the Signature OLED R (65RX), it's inspired awe and fascination, as it utilizes OLED's flexible panel materials to furl and unfurl – much like a carpet – at the touch of a button.",
    "It's an incredible space-saving measure, allowing viewers to hide away the screen entirely or set its height at 'half mast' for some limited smart display functionality. Unfortunately, it isn't a cost-saving measure, and the complex mechanical parts mean production is very pricey.",
    "LG tells us that 'Each rollable TV is produced to order, painstakingly assembled and finished with a craftsman-like attention to detail by the most experienced production professionals at LG’s factory in South Korea.' So at least there aren't piles of these televisions lying around.",
    "Of course, LG had also been experimenting with rollable OLED displays with its LG Rollable Phone. The company's departure from the smartphone business, though, means it's unlikely its roll-up mobile will ever hit shelves – and it speaks volumes that LG is ploughing ahead with its rollable OLED TV amid such a cautious retreat from other parts of the electronics market. Confident much?"
  ],
  "headers": {
    "6": "Rolling with the punches"
  },
  "links": {
    "rollable OLED TV": "https://www.techradar.com/reviews/lg-signature-series-oled-tv-r-65r9",
    "OLED-info": "https://www.oled-info.com/omdia-3000-rollable-tvs-ship-2022-and-672000-2027",
    "retailing at £99,999 in the UK": "https://www.techradar.com/news/you-can-finally-buy-the-lg-rollable-oled-tv-in-the-uk-if-you-can-afford-it",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Some provisional reports out of South Korea": "https://www.techradar.com/news/apparently-only-10-people-have-bought-lgs-rollable-oled-tv-but-why",
    "it changed that forecast to 3.5 million shortly into 2020": "https://www.techradar.com/news/oled-tvs-are-going-to-have-a-rough-year-heres-why",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "The company's departure from the smartphone business": "https://www.techradar.com/news/lg-has-officially-quit-making-phones-heres-whats-next"
  }
}