{
  "source": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-might-be-slower-than-the-nvidia-rtx-3060-ti",
  "title": "AMD Radeon RX 6700 XT might be slower than the Nvidia RTX 3060 Ti",
  "category": "computing",
  "updated": "2021-03-12T15:26:56Z",
  "author": "carly-page",
  "summary": "Benchmarks suggest the GPU will struggle to match the RTX 3070 and 3060 Ti",
  "article": [
    "AMD’s upcoming Radeon RX 6700 XT might not be able to beat Nvidia in the mid-range after all, as leaked benchmarks show the GPU failing to match the RTX 3060 Ti.",
    "Leaker @TUM_APISAK spotted two Geekbench 5 entries for the AMD RX 67000 XT, which was tested on a system equipped with an AMD Ryzen 3700X CPU and 32GB of RAM clocked at 3000MHz.",
    "While AMD is pitching the Navi 22 GPU as a mid-range graphics card that will battle Nvidia in the mid-range, it looks like the Radeon RX 6700 XT might struggle to match Nvidia's RTX 3070 and RTX 3060 Ti when it comes to performance.",
    "In the Vulcan tests, the RX 6700 XT scored just 55,278 points - which is dramatically lower than the score of 95,906 racked up by the Nvidia RTX 3060 Ti. This, while unlikely close to final performance, gives Nvidia’s latest mid-range GPU a 73% performance advantage.",
    "In OpenCL tests, however, the RTX 6700 performs much better, scoring 102,831 points. However, whole this is 6% faster than the Nvidia RTX 3060, it still fails to match the RTX 3060 Ti, which scored 120,619 points in the same test.",
    "These benchmark results should be taken with a pinch of salt for now, as it’s likely the tests were run on pre-release drivers. With that in mind, we can expect the Radeon RX 6700 XT to perform at higher levels when it’s officially released.",
    "The AMD Radeon RX 6700 XT is launching on March 18. However, you might struggle to get your hands on the GPU at launch, as despite AMD’s promises that the RX 6700 XT will have more stock than previous Radeon 6000 series graphics cards, it looks like the graphics card will be in short supply.",
    "According to igor'sLAB, \"If you condense the information of various board partners and distributors to a trend, then there are, depending on the manufacturer and model, only a few pieces (for Germany) to a few thousand for the EU as a whole.\"",
    "Via: Guru3D"
  ],
  "headers": {},
  "links": {
    "Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "@TUM_APISAK": "https://twitter.com/TUM_APISAK/status/1369681019780042752",
    "AMD Ryzen 3700X": "https://www.techradar.com/reviews/amd-ryzen-7-3700x",
    "Nvidia's RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Radeon 6000 series graphics cards": "https://www.techradar.com/news/amd-has-more-stock-of-its-own-rx-6000-graphics-cards-coming-soon",
    "igor'sLAB": "https://www.igorslab.de/en/various-information-about-availability-of-the-radeon-rx-6700xt-at-launch-will-be-scarce-again/",
    "Guru3D": "https://www.guru3d.com/news-story/amd-radeon-rx-6700-xt-could-be-slower-than-geforce-rtx-3060-ti.html"
  }
}