{
  "source": "https://www.techradar.com/news/google-is-being-more-honest-about-what-incognito-mode-does-and-what-it-doesnt",
  "title": "Google is being more honest about what Incognito Mode does and doesn't do",
  "category": "computing",
  "updated": "2021-08-17T09:30:09Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Is Chrome's private browsing mode as private as you thought?",
  "article": [
    "Google is in the process of updating the wording of the introductory text that appears on new Incognito tabs. The change is coming to both the desktop and mobile versions of the company's web browser, and the updated text makes it much clearer that using Incognito Mode does not mean that you are invisible online.",
    "It has always been the case that when opening a new Incognito tab Google has displayed information about what this means. But with a change that is rolling out over the coming weeks, the page has been made not only more informative, but also easier to understand by reducing it to a pair of bulleted lists about what the mode does and doesn't do.",
    "The revamped landing page is far more explicit about the capabilities and limitations of Incognito Mode than previously. Gone is the brief introductory blurb, as Google now cuts right to the chase with the details about the ways in which Incognito mode boosts privacy – such as not saving search history locally – and making it clearer that it does not ensure complete anonymity online.",
    "At the moment the altered text is only visible in the Canary build of Chrome for Android, and even then it is only visible when an optional flag is enabled. Ultimately, the reworded text will make its way to the iOS, macOS, Windows, Chrome OS and Linux versions of Chrome as well, and you can enable the Revamped Incognito New Tab Page flag to force the change in Chrome Canary for Android right now.",
    "With the updated wording activated, new Incognito tabs advise users about what will happen to certain browsing data when the tabs are closed. It says that once all Incognito tabs are closed, Chrome will clear browsing activity, search history and form data from the current device.",
    "It also points out that as Incognito Mode does not make you invisible, any sites you visit using it will know that you have visited. In addition, it points out that schools and employers can still track browsing activity, and also that ISPs may monitor traffic.",
    "While the change undoubtedly provides users with more and clearer information than before, it does not make it obvious that Google itself it still able to collect data about browsing in Incognito Mode.",
    "While it is something of a shame that this important change in the information provided to Chrome users has come after a lawsuit, it is good news, nonetheless. It is an important informational change because there was a great deal of misunderstanding about the privacy-protecting mode, as well as assumptions about just how it worked.",
    "There is greater interest than ever in online privacy, and what this change to Chrome is indicative of is the fact that knowledge is power. An informed userbase is a happy userbase, and it would be nice to think that even with the threat of legal action, Google would have felt compelled to make a tweak like this.",
    "It is not the case that the company was being dishonest in any claims about Incognito Mode in the past, but now it would be difficult for anyone using the browser to be under any illusion about just how much their privacy is being protected. The wording is now much clearer and there is little – if any room – for misinterpreting the purpose and limitations of Incognito Mode.",
    "Via Techdows"
  ],
  "headers": {
    "4": "How private?",
    "7": "Analysis: Honesty is the best policy"
  },
  "links": {
    "Techdows": "https://techdows.com/2021/08/chrome-incognito-page-on-android-revamped.html"
  }
}