{
  "source": "https://www.techradar.com/news/how-to-watch-black-beauty-2020-online-stream-the-new-disney-plus-movie-today",
  "title": "How to watch Black Beauty 2020 online: stream the full movie on Disney Plus now",
  "category": "computing",
  "updated": "2021-02-23T11:33:37Z",
  "author": "james-laird",
  "summary": "Latest adaptation of Anna Sewell's classic released last year",
  "article": [
    "Every generation needs its own version of Black Beauty, and the latest adaptation of Anna Sewell's classic 1877 novel is out now exclusively on Disney Plus. Directed by Ashley Avis, the film stars Mackenzie Foy as Jo Green, Kate Winslet at the voice of Black Beauty, Fern Deacon as Georgina Winthorp and Claire Forlani as Mrs Winthorp. Read on as we explain how to watch Black Beauty 2020 online with Disney Plus today.",
    "Eagle-eyed Game of Thrones fans may also recognize Scottish actor Iain Glen, who plays John Manly, while other members of the Black Beauty 2020 cast include Calam Lynch as George Winthorp, Max Raphael as James, Hakeem Kae-Kazim as Terry, Matt Rippy as Henry Gordon, Avianah Abrahams as Anna, Sascha Nastasi as Jennifer and Alex Jeaven as Jasmine.",
    "The film has, somewhat predictably, received mixed reviews for its version of the classic tale of the bond between a teenage girl and a wild horse. This is so often the case with adaptations of seminal literature, but don't let the naysayers put you off - Black Beauty hasn't been updated since the male-centric 1994 film starring Andrew Knott, Sean Bean and David Thewlis, so this is a much-needed remake.",
    "With a run time of just under two hours (109 minutes), Black Beauty 2020 is unrated but a broadly family friendly flick in the Disney tradition, suitable for ages 10+ according to the non-profit parental advisory group Common Sense Media. Any parents unsure if it's right for their kids can always watch some of it themselves and then make their own mind up.",
    "Follow our guide below as we explain how to watch Black Beauty 2020 online with Disney Plus - and how to get the the best deals on the service today.",
    "Disney Plus is already cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. Obviously you have to splash the cash at the start, but with so much content to get stuck in to we very much doubt you'll run out of things to watch before the 12 months are up. You're looking at $69.99/£79.90/AU$119.99 for the year.",
    "Or if your interests are farther reaching (and you're in the US), then we'd seriously suggest looking at the fantastic value bundle package. It adds Hulu and ESPN+ to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Helstrom and Normal People. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $12.99 a month.",
    "Disney Plus is showing no signs of slowing down since the service first launched last November and in addition to being the exclusive release platform of new Pixar movies like Soul, subscribers can look forward to Star Wars spin-off The Mandalorian, Mulan, Hamilton, WandaVision and much more.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "Now that Disney has set the precedent of releasing its live-action Mulan remake on the service instead of in theaters through its Premier Access program, expect the company to keep bring more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021.",
    "And finally, there's the new Star on Disney payload that most global markets get to enjoy and sees the amount of content available through Disney Plus more than double, with a particular eye to shows grown-ups are going to enjoy. It costs a tiny bit more, but is worth it based on our initial impressions - and you can still save big by going with an annual subscription.",
    "Read more:"
  ],
  "headers": {
    "5": "How to save money on Disney+ right now",
    "7": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "$69.99/£79.90/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1326254161181044000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN+": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $12.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-3210961605618944000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Star on Disney": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}