{
  "source": "https://www.techradar.com/news/fifa-22s-cover-star-has-been-confirmed-ahead-of-the-trailer-reveal",
  "title": "FIFA 22’s cover star has been confirmed ahead of the trailer reveal",
  "category": "gaming",
  "updated": "2021-07-10T08:45:42Z",
  "author": "emma-boyle",
  "summary": "Mbappé returns",
  "article": [
    "EA has confirmed that French football star Kylian Mbappé will return as the cover star of FIFA 22 after appearing on the covers of FIFA 21 last year.",
    "Mbappé was confirmed as FIFA 22’s cover star by the official EA Sports FIFA Twitter account, which posted a picture of the FIFA 22 Ultimate Edition cover. The cover features Mbappé at the centre with his back to the camera, gesturing to his name on the back of his Paris Saint-Germain kit.",
    "That’s not the only FIFA 22 information EA has up its sleeve for this weekend, though. According to the cover reveal tweet, EA is planning to broadcast a “game-changing reveal” trailer on July 11 at 4.30PM BST/ 8.30AM PT/ 11.30AM ET, only a few hours before the final of the 2020 Euros. Clicking the link for the trailer takes you through to a YouTube page with a countdown until the its launch.",
    "It’s worth noting that “Dual Entitlement” is visible on the newly revealed covers, so it appears FIFA 22 will follow FIFA 21 in being a cross-gen release with opportunities to upgrade within the same console family.",
    "There’s also a mention of “Hypermotion Technology” on the new cover, which, unlike Dual Entitlement, is something that EA hasn’t really covered before. Fortunately, it looks like EA is going to expand on this on July 20 as part of its EA Play Live Spotlight Series.",
    "EA was initially coy with regards to what title the July 20 spotlight would involve, only promising it would highlight “an exciting new addition to a popular and long running EA Sports franchise”. However, towards the end of July 8’s “Future of FPS” stream, FIFA 22 was confirmed to be the starring title.",
    "Based on the schedule, which specifies “FIFA Next Gen gameplay powered by Hypermotion Technology”, it looks like Hypermotion Technology is going to be a feature just for Microsoft and Sony’s latest Xbox Series X/S and PS5 consoles.",
    "The name suggests this technology will involve EA harnessing the power of these new consoles to give players even more realistic, smooth animations and movements but we’ll have to wait until July 20 to find out for sure. At the very least, we know that earlier this year EA promised a “massive year of innovation” across its line of sports titles, with the FIFA franchise being a part of that line, which teases the possibility of interesting changes in a series that tends towards evolution rather than revolution.",
    "Suffice it to say that FIFA fans have an exciting couple of weeks ahead of them – with the game’s reveal trailer coming on July 11 and a further focus on next-gen gameplay on July 20, many of our most pressing FIFA 22 questions could soon have answers.",
    "EA will wrap up its spotlight series with its main EA Play Live stream on July 22 at 10am PDT / 1pm EDT / 6pm BST (3am AEST on July 23), in which it promises “to make games the unwavering focus” and highlight “games that are coming out soon rather than in the all-to-distant future” across its 40 minute run-time."
  ],
  "headers": {
    "6": "More to come"
  },
  "links": {
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "final of the 2020 Euros": "https://www.techradar.com/news/england-vs-italy-live-stream-how-to-watch-free-euro-2020-final-online",
    "YouTube page": "https://www.youtube.com/watch?v=o1igaMv46SY",
    "Dual Entitlement": "https://www.techradar.com/news/dual-entitlement",
    "towards the end of July 8’s “Future of FPS” stream": "https://youtu.be/NQVgqQo7pLY?t=2011",
    "earlier this year": "https://www.techradar.com/reviews/fifa-22",
    "promises": "https://www.ea.com/ea-play-live/news/announcing-the-ea-play-live-spotlight-series"
  }
}