{
  "source": "https://www.techradar.com/news/inmarsat-delivers-speed-boost-to-satellite-broadband-to-support-iot",
  "title": "Inmarsat delivers speed boost to satellite broadband to support IoT",
  "category": "computing",
  "updated": "2021-08-13T11:04:01Z",
  "author": "steve-mccaskill",
  "summary": "Inmarsat Elera will deliver speeds of 1.7Mbps",
  "article": [
    "Inmarsat is launching a new narrowband satellite network that promises to deliver a fourfold speed increase for customers compared to standard ‘L-band’ services, opening new use cases including the Internet of Things (IoT).",
    "As connectivity becomes increasingly integral to every single industry, satellite will play a key role in providing coverage in the hardest-to-reach parts of the globe. Satellite connectivity lacks the speed and low-latency of traditional networks but it makes up for this with global coverage.",
    "The ‘Elera’ network will be supported by the launch of two new satellites, each capable of delivering 50% more capacity per beam, and lower cost terminals for organisations that require connectivity in areas beyond the reach of terrestrial networks.",
    "The company says this combination of 1.7Mbps speeds, improved resiliency, and greater availability, will greatly benefit core customers in the maritime, aviation and government sectors as well as open the doors to other industries such as utilities, agriculture, and rail.",
    "Data transmission and voice services are two areas that will be improved, but IoT applications such as autonomous vehicles and agricultural sensors – where battery consumption and coverage are prioritised over bandwidth – become a reality.",
    "“Elera is perfectly suited to the needs of the connected IoT world,” declared Rajeev Suri, Inmarsat CEO. “Global reach, extraordinary resilience, faster speeds, smaller and lower cost terminals are all part of ensuring that we remain ahead of others in meeting the needs of our customers.",
    "“Elera is the exciting vision of how Inmarsat is planning to transform the capabilities offered to IoT and mobility customers for years to come and confirms our long-term commitment to L-band services.”",
    "The news comes just two weeks after Inmarsat detailed what it claimed to be a “world first” network called ‘Orchestra’ that combines geosynchronous (GEO) and low earth orbit (LEO) satellites with terrestrial 5G infrastructure into a single network, blending coverage and capacity.",
    "LEO has significant speed and latency advantages over traditional satellites, making it more suited for rural broadband and in-flight Wi-Fi services."
  ],
  "headers": {
    "3": "Inmarsat 5G"
  },
  "links": {}
}