{
  "source": "https://www.techradar.com/news/intels-laptop-empire-is-under-threat-from-amd-ryzen-cpus-and-apples-next-arm-macbooks",
  "title": "Intel’s laptop empire is under threat from AMD Ryzen CPUs and Apple’s next ARM MacBooks",
  "category": "computing",
  "updated": "2021-01-06T19:26:42Z",
  "author": "darren-allan",
  "summary": "AMD and Apple are both taking big strides forward in the notebook arena",
  "article": [
    "Apple’s incoming MacBook Pro models with ARM chips, which are expected to arrive later in 2021, are forecast to gain some serious sales traction. Along with laptops powered by AMD Ryzen chips, these combined forces look like a real threat to Intel’s dominant presence in the notebook arena.",
    "According to analyst firm TrendForce, Apple’s new 14-inch and 16-inch MacBook Pros – which are expected to debut in Q2 or Q3 of 2021, with some major innovations including a mini-LED screen – will push the firm’s laptop market share to around an estimated 7%.",
    "Meanwhile, TrendForce observes that laptops with AMD processors had an 11.4% market share in 2019, which rose to 20.1% in 2020. The analyst firm notes: “The 7% and 20% market shares from Apple and AMD, respectively, mean that Intel will be faced with increasing competitive pressure in the market and need to deliver an appropriate product strategy in response.”",
    "We have reached out to Intel for comment and will update this article if and when we hear anything.",
    "As MacRumors observes, this isn’t the only voice of concern when it comes to Intel’s future laptop prospects. New York hedge fund Third Point believes that Intel must take immediate action to stem its losses when it comes to chip designers who are leaving, with remaining staff apparently becoming increasingly demoralized, according to an Ars Technica report.",
    "Intel is now behind AMD in the desktop CPU market, as we’ve seen time and time again with big headlines about AMD’s huge sales – and what Intel can’t afford is to now start losing its laptop lead.",
    "The fact that not just AMD, but now Apple – which is transitioning away from Intel processors over a period of two years, to use its own ARM-based chips in Macs (the initial incarnation of which has proved massively successful) – is a threat just underlines the seriousness of the situation."
  ],
  "headers": {
    "4": "Demoralized designers?"
  },
  "links": {
    "ARM chips": "https://www.techradar.com/news/apples-m1-powered-macs-owe-their-storming-success-to-the-iphone",
    "TrendForce": "https://www.trendforce.com/presscenter/news/20210106-10633.html",
    "expected to debut in Q2 or Q3 of 2021": "https://www.techradar.com/news/apple-macbook-pro-13-inch-and-macbook-air-with-arm-cpus-could-be-out-later-in-2020",
    "MacRumors": "https://www.macrumors.com/2021/01/06/14-inch-16-inch-macbook-pro-apple-silicon/",
    "Ars Technica": "https://arstechnica.com/gadgets/2020/12/activist-hedge-fund-advises-intel-to-outsource-cpu-manufacturing/",
    "AMD’s huge sales": "https://www.techradar.com/news/amd-ryzen-5000-smashes-processor-sales-records",
    "has proved massively successful": "https://www.techradar.com/news/apples-m1-chip-embarrasses-microsofts-surface-pro-x-by-running-windows-10-on-arm-much-faster"
  }
}