{
  "source": "https://www.techradar.com/news/peloton-reboots-its-picturesque-scenic-workouts-but-not-for-everyone",
  "title": "Peloton reboots its picturesque scenic workouts – but not for everyone",
  "category": "fitness",
  "updated": "2021-05-05T11:18:37Z",
  "author": "cat-ellis",
  "summary": "A big upgrade for Peloton all-access subscribers",
  "article": [
    "Peloton has launched a raft of new features for members, including refreshed scenic workouts, new training tools, and the ability to pause on-demand classes.",
    "The relaunched scenic workouts let you take a first-person trip through a virtual locale rather than sweating it out in a studio class. They were previously available to all Peloton members, including those with digital-only subscriptions, but are now only open to users with all-access membership.",
    "That change will no doubt come as a disappointment to users who don’t own Peloton hardware, but those who do will get a lot more from their virtual journeys. Whereas scenic rides and runs were originally based on time alone, you can now take your pick from guided classes led by an instructor, as well as options based on time or distance.",
    "The music has been upgraded too, with licensed tunes from Warner Music Group replacing the generic tracks that accompanied older scenic sessions.",
    "The second new feature, Strive Score, is a metric based on your heart rate, measured with a compatible ANT+ heart rate monitor. This can be a chest-strap device like the Garmin HRM-Pro, or a fitness tracker from the likes of Polar, Garmin, Wahoo or Coros (unfortunately Fitbit devices don’t support ANT+ and therefore can’t be used for this).",
    "Unlike Peloton’s leaderboards, which pit you against other runners and riders, Strive Score is non-competitive, and is personal to you. It measures how long you spend working in each heart rate zone during every class. Your heart rate zones are based on percentage of your maximum heart rate, and help you understand the intensity of your workout.",
    "If you own a Peloton Tread or Tread+, you can now follow on-demand classes with target ranges for speed and incline. This feature was previously only available to Peloton Bike users, and helps you ensure you’re sticking to the instructor’s session plan.",
    "Peloton has also relaunched Programs, which are collections of classes from instructors designed to help you achieve a particular goal. You’ll be given a schedule of workouts and classes, with a progress bar so you can measure how close you are to achieving your goal and keep yourself accountable.",
    "Finally, you can now stop an on-demand class and pick it up later using a new feature called ‘Pause’. It’s a handy tool that means you won’t miss a chunk of your workout if you have to attend to something important in the middle of your ride or run.",
    "Peloton is facing increasing competition, so it’ll need updates like these to keep ahead of the curve. Companies like Echelon are aiming to take a bite out of its lunch, and subscription service iFit allows owners of compatible NordicTrack, ProForm and FreeMotion exercise equipment to take part in instructor-led classes and virtual scenic sessions as well."
  ],
  "headers": {
    "6": "Right on target"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Garmin HRM-Pro": "https://www.techradar.com/reviews/garmin-hrm-pro",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit"
  }
}