{
  "source": "https://www.techradar.com/news/your-fitbit-sense-or-versa-3-wont-get-a-music-upgrade-any-time-soon",
  "title": "Sorry, your Fitbit won't get a music upgrade any time soon",
  "category": "fitness",
  "updated": "2021-12-04T14:58:17.895Z",
  "author": "cat-ellis",
  "summary": "No repurposing on-board storage for your tunes",
  "article": [
    "Fitbit isn't planning to bring on-board music storage to its top-end smartwatches any time soon. According to a recent post on the company's official forums, although Fitbit Sense and Fitbit Versa 3 owners can exercise phone-free using their fitness tracker's on-board GPS, if they want to play their own tunes, they can't transfer their own MP3s to either device for offline playback.",
    "In theory, it might be possible to free up some space for music by customizing the amount of storage used for workout and other biometric data.",
    "Both devices have on-board storage for an entire week's worth of minute-by-minute motion data, plus daily totals for 30 days, so you won't lose valuable information if you're unable to sync the watch with your phone.",
    "However, as Gadgets & Wearables reports, the company isn't planning to issue a firmware update that would let you change how this storage is used any time soon.",
    "This has come as a disappointment to some Fitbit fans, who see this move as a downgrade from the original Fitbit Versa, Versa 2 and Ionic – all of which let you store your own music tracks.",
    "If you want to play music through your Fitbit Versa 3 or Sense, there are still a few options. It's possible to play Pandora stations and Deezer playlists through either watch, or you can use them to control the Spotify app on your phone.",
    "Alternatively, you could opt for one of the older watches, or (if you're not wedded to the Fitbit ecosystem) a device like the Garmin Forerunner 245 Music or Amazfit Stratos. These cost around the same as the Sense and Versa, and offer storage for hundreds of tracks, albeit with less impressive health-tracking tools."
  ],
  "headers": {
    "5": "Play on"
  },
  "links": {
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "a recent post": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7420449961555958000/https://community.fitbit.com/t5/Feature-Suggestions/Music-storage-on-Sense-Versa-3/idi-p/4452403",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Fitbit Versa 3": "https://www.techradar.com/news/fitbit-versa-2-vs-fitbit-versa-3",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Gadgets & Wearables": "https://gadgetsandwearables.com/2021/04/24/can-fitbit-sense-store-music/",
    "Fitbit Versa": "https://www.techradar.com/reviews/fitbit-versa-review",
    "Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "Ionic": "https://www.techradar.com/reviews/fitbit-ionic-review",
    "Pandora": "https://www.techradar.com/news/spotify-stations-vs-pandora-radio",
    "Deezer": "https://www.techradar.com/reviews/deezer",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Garmin Forerunner 245 Music": "https://www.techradar.com/reviews/garmin-forerunner-245-review",
    "Amazfit Stratos": "https://www.techradar.com/reviews/amazfit-stratos"
  }
}