{
  "source": "https://www.techradar.com/news/microsoft-edge-update-will-change-the-way-you-think-about-browser-tabs",
  "title": "Microsoft Edge update will change the way you think about browser tabs",
  "category": "computing",
  "updated": "2021-03-03T01:04:01Z",
  "author": "anthony-spadafora",
  "summary": "Are vertical tabs the future of web browsing?",
  "article": [
    "After adding support for vertical tabs last year, Microsoft is now testing a new customization feature in Edge that allows users to resize the vertical tabs panel in its browser.",
    "As reported by Windows Central, Reddit user Leopeva64-2 first spotted the new feature and recently uploaded a GIF of it in action. The option to resize the Vertical Tabs panel is now live for Edge Insiders running Microsoft Edge Canary build 90.0.810.0.",
    "While horizontal tabs have long been the standard way to have multiple websites open in a browser, vertical tabs are quickly becoming a popular alternative due to how they allow users to better utilize screen space and this is especially true on ultrawide monitors.",
    "Regardless of whether you have the vertical tab panel pinned in Microsoft Edge, the company's new experimental feature still works and this makes it quite useful.",
    "When contracted, the vertical tabs panel just shows the icons of the websites you have open but the panel can also be expanded if you want to see the full address of each site you have open in a different tab. Edge users can hover their cursor over the panel to expand it or they can pin it to keep it expanded.",
    "Now that Microsoft has added the option to resize the vertical tabs panel in its browser, users can click and drag the panel to change its size. However, when pinned, the panel stays expanded at all times.",
    "If you're the kind of person that uses your web browser with multiple tabs open, then you may want to give Edge's vertical tabs feature a try as it could help boost your productivity as it will be easier to find a particular tab.",
    "Via Windows Central"
  ],
  "headers": {
    "3": "Resizing the vertical tabs panel"
  },
  "links": {
    "vertical tabs": "https://www.techradar.com/news/you-can-now-access-vertical-tabs-in-microsoft-edge-heres-how",
    "Windows Central": "https://www.windowscentral.com/microsoft-edge-canary-now-lets-you-resize-vertical-tabs",
    "Leopeva64-2": "https://www.reddit.com/r/edge/comments/lt64rr/in_the_latest_edge_canary_build_you_can_now/?context=3",
    "Edge Insiders": "https://www.techradar.com/news/microsoft-edge-is-getting-a-bunch-of-new-features-in-early-access",
    "ultrawide monitors": "https://www.techradar.com/news/ultrawide-monitor",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "web browser": "https://www.techradar.com/best/browser"
  }
}