{
  "source": "https://www.techradar.com/news/loki-episode-5-has-a-chris-hemsworth-cameo-but-who-does-he-play",
  "title": "Loki episode 5 has a Chris Hemsworth cameo – but who does he play?",
  "category": "entertainment",
  "updated": "2021-07-12T13:06:02Z",
  "author": "tom-power",
  "summary": "Spoilers for Loki episode 5 follow",
  "article": [
    "The season finale of Loki is almost here, and fans are excited to find out how the Disney Plus series will end.",
    "While we wait for episode 6 to land on the streamer on July 14, there's still plenty to pour over from last week's show.",
    "Loki episode 5 provided plenty of Easter eggs and cameos for viewers to enjoy – but there's one particular secret that fans may have overlooked.",
    "During the opening minutes of episode 5, certain Marvel fans will have noticed Throg – aka Frog Thor – trapped in a glass jar as Loki (and his variant brethren) descend into their underground home. He's trying to reach a human sized version of Mjolnir (Thor's hammer) but he can't break out of his prison, bless him.",
    "What audiences won't have realized, however, is which actor briefly voices the amphibious version of the God of Thunder: it's none other than Chris Hemsworth.",
    "Some fans will know that Throg was supposed to appear in an earlier episode of Loki – he beat up the god of mischief during one humorous scene – before the scene was cut, but this is the first time we've heard of Hemsworth's involvement.",
    "Speaking to ForAllNerds following episode 5's release, Loki director Kate Herron revealed that Hemsworth had lent his vocal talents to the animated character, even though they only appeared on screen for a matter of seconds. Judging by the presenters' reactions, it's clear that very few people (if any) knew that Hemsworth had voiced Throg.",
    "Check out Herron's confirmation of Hemsworth's role in the tweet below:",
    "Marvel's Loki has thrown up plenty of possibilities for the MCU, including the looming Marvel Cinematic Multiverse (MCM) and the potential for variants of other characters to appear.",
    "We've been treated to various incarnations of Loki throughout the titular character's TV series, but Throg's appearance is the first time we've seen a variant of an MCU character who isn't Loki.",
    "Could we see variants of other characters appear in future Marvel productions? It's possible, although we wouldn't expect it to be a regular occurrence.",
    "Marvel's What If...? series may explore these instances. The upcoming animated Disney Plus show will reveal what could have happened to certain superheroes if events surrounding them had been different. This could be based around character variants, but we'll have to wait for the series to drop to be completely sure.",
    "Spider-Man: No Way Home and Doctor Strange 2 will explore the MCM in more detail, too, judging by their rumored castings and plot synopses. Add in the fact that Marvel's Hawkeye TV series contains two Hawkeyes (could Kate Bishop be introduced as a variant of Clint Barton? It would be a cool twist if that's who she really is), and we may see more character variants crop up in some of Marvel's forthcoming projects."
  ],
  "headers": {
    "8": "Analysis: Hemsworth's Throg cameo is a fun and potentially intriguing appearance"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/what-time-is-loki-episode-6-released-on-disney-plus",
    "supposed to appear": "https://twitter.com/MrEricMartin/status/1412987552324145152",
    "Marvel's What If...?": "https://www.techradar.com/news/marvels-what-if-show-finally-gets-a-release-date-and-a-star-studded-trailer",
    "Disney Plus show": "https://www.techradar.com/best/best-disney-plus-shows",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Hawkeye TV series": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know"
  }
}