{
  "source": "https://www.techradar.com/news/the-7-best-disney-plus-guilty-pleasure-movies",
  "title": "7 of the 'best' Disney Plus guilty pleasure movies",
  "category": "entertainment",
  "updated": "2021-02-27T14:00:31Z",
  "author": "hamish-hector",
  "summary": "So bad they’re good?",
  "article": [
    "Disney is a brand that's synonymous with great films, from its animated classics to Pixar masterpieces and big-budget Marvel movies. However, there are more than a few films in its lineup that some of us might not go out of our way to admitting we enjoy, like bad VHS sequels to classic animated movies or the Beverly Hills Chihuahua trilogy.",
    "The plots of the films on this list might be as paper-thin as their special effects budgets, but if you want to kick back and have as much fun poking fun at a movie as you get from watching it, these guilty pleasures are ones we think you'll enjoy.",
    "With choices from across the past two decades of Disney Channel offerings, many with soundtracks you can’t help but sing along to, here’s selection of so-bad-they're-good treats you can find on Disney Plus right now.",
    "Of all of the iconic series' films, 2007's High School Musical 2 was the clear choice. The songs – with hits like I Don’t Dance and Work This Out – are overall a cut above the numbers in its predecessor, and the story has a bit more weight behind it. Troy’s relationship with Gabriella and his basketball team will be pushed to its limits as he has to choose between his present and his future, all while Sharpay is pulling the strings in the background. It’s so corny, but oddly lovable.",
    "When you’ve relived the originals you should also check out the mockumentary style follow-up High School Musical: The Musical: The Series, a Disney Plus exclusive show.",
    "Before the MCU, back in 2005 Disney treated superhero fans to Sky High, and frankly we’re disappointed Jetstream and the Commander haven’t shown up in an Avengers movie yet. Sky High is a high school exclusively for superpowered teenagers, and Will Stronghold, the son of the world’s most famous crime-fighting duo, is about to start his first day – the only problem is he doesn’t actually have his superpowers yet.",
    "This flick will prove that superpowers don’t make a hero a hero...though they definitely help a lot.",
    "If you watched Frozen and thought it was unfair that Elsa got to be both Queen and have ice powers, this film is for you. In 2020’s Secret Society of Second-Born Royals, the second-born children of monarchs are given superpowers – because apparently wealth and power weren’t enough. From the weird premise to the odd choice of superpowers to the villain actually being in the right (sort of, anyway), this film is a wild ride that’s definitely worth the price of admission.",
    "Have you ever wanted to know what happened after your favorite Disney movies ended, or maybe what would happen to the kids of the heroes and villains? The 2015 movie Descendants follows the children of Cruella De Vil, Jafar, Evil Queen from Snow White and Maleficent as they navigate life at a new school, in a new land. They’ve been invited to the United States of Auradon by the son of Belle and Beast as part of a royal initiative to rehabilitate the children of villains, and give them the chance to become productive citizens.",
    "If you’re a fan of Disney’s animated catalog, there’s a lot of fun to find in this movie, even if the special effects budget clearly has its limits.",
    "If you haven’t got a strong sense of nostalgia when it comes to Disney movies, you might instead try this 2018 film. After an accident at the Seabrook Power Plant turns half of the town into brain-eating zombies, the human residents force the new Zombietown into strict quarantine. Fifty years later, the two societies are finally able to begin reconnecting, thanks to the new Z-Band, that inhibits the undead’s craving for brains.",
    "Most of the film is pretty predictable once you get into it, though that doesn’t stop Z-O-M-B-I-E-S being a surprisingly good flick to kick back to.",
    "This 2012 movie is definitely one of the better entries on this list, with a cracking soundtrack featuring gospel, hip hop, and rap music, which – Hamilton aside – you won’t find much of on Disney Plus.",
    "Cyrus DeBarge is a musician who’s severely lacking in confidence and held back by a fear of performing. However, when his best friend steals the credit for a contest-winning song, Cyrus has to learn to overcome his anxieties and let his talents shine.",
    "While it’s a cracking film in its own right for any fan of the Disney Channel TV series, 2009's Wizards of Waverly Place: The Movie fills this spot on our list on behalf of all films based on Disney Channel shows. Whether it’s The Suite of Zack and Cody or animated hits like Kim Possible, watching the movie spin-off makes for a great way to relive your childhood without rewatching episodes you’ve seen thousands of times."
  ],
  "headers": {
    "3": "High School Musical 2",
    "5": "Sky High",
    "7": "Secret Society of Second-Born Royals",
    "8": "Descendants",
    "10": "Z-O-M-B-I-E-S",
    "12": "Let It Shine",
    "14": "Wizards of Waverly Place: The Movie"
  },
  "links": {
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review"
  }
}