{
  "source": "https://www.techradar.com/news/ps5-restock-today-best-buy-and-sony-direct",
  "title": "PS5 restock update: Sony Direct sold out in 23 minutes – when to buy it next",
  "category": "gaming",
  "updated": "2021-08-30T09:13:03Z",
  "author": "matt-swider",
  "summary": "If you didn't get our alerts for Sony Direct and Walmart, you need to follow PS5 restock Teitter tracker Matt Swider and turn on notifications.",
  "article": [
    "Update: If you missed the Sony Direct PS5 restock today, or Walmart restock before that, then you're probably not following our PS5 restock Twitter tracker Matt Swider, who will send you an alert when the console is in stock – if you follow his account and turn on notifications.",
    "Trust and credibility: Matt Swider has helped 43,000 people (likely a lot more after today's massive PS5 restock in the US) get a next-gen console in recent weeks. How? With his in-stock Twitter alerts, 24/7 tracking and restock news reporting.",
    "Here's how it went down: The massive PS5 restock today we were hoping for seems to be happening, with Walmart PS5 Digital stock going live at 3pm EDT, and Sony Direct offering a virtual queue for both $499 PS5 Disc and $399 PS5 Digital. TechRadar exclusively reported that Best Buy won't have a restock today, according to our souces.",
    "What time is the next PS5 restock?",
    "This is what we know from past virtual queues: Sony Direct sent email invites to PSN users (it's done at random) for a 3pm EDT / 12pm PDT virtual queue, and quite a lot of people got the invite this time around, according to our exclusive reporting and research. Don't despair – the Sony Direct virtual queue has already opened up to the general public with a five-hour queue (to end at 5pm EDT.",
    "The thought of a Best Buy PS5 restock wasn't unfounded. It's been tested the add-to-cart button overnight while you were sleeping, but our sources say that warehouses do not have inventory of the console. Instead, we're tracking Walmart at 3pm EDT.",
    "Why trust our reporting: We helped 43,000 people get a console. Click on this example of a past PS5 restock alert to get notifications (it's the little bell icon).",
    "Today, Thursday, June 17, has the potential to be the first big PS5 restock in three weeks. We have confirmed that Walmart will have a PS5 Digital restock today at 3pm EDT, while Sony Direct email invites went out to select PSN users at random and a virtual queue will happen in the afternoon today. Sony always opens things up after that time, usually at 5pm EDT / 2pm PDT (the waiting room has already started).",
    "Walmart, not Best Buy may have restock the Sony console (though we have our doubts as it may be saved for Walmart's Days of Deals promotion next week. We've seen Best Buy testing out the add-to-cart button overnight, a sign it will restock the PS5 in the coming hours. We will update this page if happens, but the faster way to get alerts is through our Twitter account.",
    "Our 24/7 PS5 restock Twitter did find some consoles in stock this week. There was a minor Target PS5 restock yesterday morning for both the $499 PS5 Disc and $399 PS5 Digital consoles. Newegg had a 'Shuffle' lottery alongside a GPU restock, while Antonline sold a PS5 bundle on Monday to start off the week.",
    "Walmart PS5 restock dates often happen on Thursdays, however, the followers of the Matt Swider PS5 Twitter tracker account have been woken up by 3am restock opportunities the past two cycles. A few were lucky enough to buy the PS5 Digital console. We're still keen on checking out Walmart at 3pm EDT (normal hours) every Thursday (so today) just in case Walmart follows its usual PS5 restock pattern.",
    "We'll send out a news alert today whether or not there will be a PS5 restock at Walmart (we often know the news ahead of time).",
    "Update: Nope, it won't happen today after all.",
    "The Best Buy PS5 restock may actually be first today, and we're confident of that for two reasons. First, overnight the online store flashed the add-to-cart button a bunch of times. You couldn't buy the Sony console, but it's a sign that Best Buy is testing out the product page for both PS5 Digital and PS5 Disc.",
    "There's another reason, which we cited last week: Best Buy added a Ratchet & Clank: A Rift Apart PS5 bundle to its inventory. Best Buy doesn't require you to buy bundles, unlike GameStop and Antonline, but these optional sales pitches are usually a sign that it's preparing to open up PS5 inventory soon.",
    "While the Best Buy restock time has been all over the place in 2021, we know the American electronics retailer often favors Thursday and Friday restocks.",
    "The Sony Direct will restock the PS5 today for those with an email invite (you can't ask for a Sony Direct invite, as it's randomly sent to PSN account holders). That's been confirmed to be happening at 3pm EDT / 12pm PDT, according to the email seen by TechRadar.",
    "Everyone else may see a similar virtual queue that often opens up at 5pm EDT / 2pm PDT. Will it be exactly at this time? That's unconfirmed, but that's become the most popular time that Sony Direct goes live in recent months. Basically, look out for our alert in the late afternoon.",
    "The Target restock date finally happened after three weeks of the console being out of stock, but it went too quickly for a lot of people. It varied due to the fact that this particular store has inventory flowing through its local retail stores. It's an online-only purchase with in-store pickup (and has that way been for all of 2021).",
    "The Target PS5 restock date has been a mystery lately (always a Wednesday or Thursday, though), but the restock time remains firm: 7:40am EDT / 6:40am CDT / 5:40am MDT / 4:40am PDT. That's a brutal time if you're on the West coast of the US, however, since you're shopping online and selecting a local store, it becomes a lot easier to buy a PS5 when everyone else in your town is asleep.",
    "There's no GameStop restock in stores this week – that was for a special Xbox Series X restock in GameStop stores. The Sony PS5 consoles remain harder to get, so while those in-store purchases are going on, we expect GameStop to stick to offering PS5 bundles online, maybe sometime this week or next week.",
    "Despite tweeting that GameStop wouldn't have the PS5 in stores, our PS5 restock Twitter tracker Matt Swider received many replies asking if... it would be in stores.",
    "Newegg occasionally offers PS5 bundles with games and accessories – and recently we've seen a restock from at the online store every other Wednesday. Bad news: it just happened this past Wednesday. It's always a lottery with the Newegg Shuffle, so you're never guaranteed to get it, but you also don't have to constantly try to add it to your cart. Newegg also has RTX GPU stock almost every day.",
    "Antonline finally had a PS5 Disc console in stock on Monday, and it had six games at MSRP. Even at face value, the PS5 bundle price was $809 in the end, and while many people passed on this, it sold out in two minutes.",
    "Antonline is one of the better retailers to buy PS5 from – even if it's not a household name. It ships fast, according to the thousands of Twitter tracker replies we've gotten showing a solid customer service experience. People have gotten the console in as little as two days.",
    "Amazon has had a restock anywhere between 15 and 54 days, according to our PS5 restock tracker timeline. That means it can happen at any point and the date hasn't had a pattern.",
    "However, there is potentially good news as part of our research into the Amazon PS5 restock times. We've noticed that it shifts back and forth between morning and 3am EDT every month. The current restock cycle calls for a 3am EDT Amazon PS5 restock time, though we don't know the date. It could be between now and Amazon Prime Day deals.",
    "Here's an example of the last Twitter alert we sent for the PS5 restock at Amazon:"
  ],
  "headers": {
    "7": "PS5 restock news for June 17: Walmart and Sony Direct",
    "10": "Walmart PS5 restock: PS5 Digital in stock today",
    "12": "Best Buy PS5 restock is just a tease",
    "16": "Sony Direct virtual queue today – here's the time",
    "18": "Target PS5 restock date happened yesterday",
    "20": "GameStop PS5 restock will remain online only",
    "22": "Newegg raffles PS5 bundles every other week",
    "23": "Antonline the PS5 Disc console on Monday",
    "25": "Amazon PS5 restock date is always a myserty"
  },
  "links": {
    "Sony Direct PS5 restock today": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "GPU restock": "https://www.techradar.com/news/rtx-3080-in-stock-today-newegg-shuffle",
    "Ratchet & Clank: A Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Xbox Series X restock in GameStop stores": "https://www.techradar.com/news/exclusive-gamestop-xbox-series-x-restock-in-store-no-ps5",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}