{
  "source": "https://www.techradar.com/news/ransomware-gang-mysteriously-drops-threat-to-leak-apple-macbook-data",
  "title": "Ransomware gang mysteriously drops threat to leak Apple MacBook data",
  "category": "computing",
  "updated": "2021-04-26T15:44:06Z",
  "author": "carly-page",
  "summary": "The data has been removed from REvil's dark web blog",
  "article": [
    "The infamous REvil hacking group has allegedly dropped all references to a ransomware attack against Apple supplier Quanta Computer from its dark web blog.",
    "REvil last week claimed to have accessed obtained images and schematics of unreleased Apple products, including the company’s next-generation MacBooks, after accessing the internal computers of Taiwan-based Quanta.",
    "The group posted 21 screenshots depicting MacBook schematics as proof of the breach and threatened to publish new data every day leading up to May 1 unless a $50 million ransom demand was paid.",
    "Quanta reportedly refused to pay the ransom to reclaim the stolen data and as a result, the hackers decided to extort Apple instead.",
    "However, MacRumours reports that the hacking group has removed all references to the extortion attempt, which was timed to coincide with Apple’s ‘Spring Loaded event’ where the company announced its first M1 iMac.",
    "What’s more, no additional stolen documents have been leaked online since the original demand was made public, according to the MacRumours report.",
    "It’s currently unclear why REvil - which typically follows through with its threats of publishing confidential documents - has seemingly dropped the threat against Apple, and it remains to be seen whether the ransom demand was paid.",
    "Apple has yet to comment publicly on the alleged breach, although Quanta has confirmed that its servers were breached in a statement to Bloomberg.",
    "“Quanta Computer’s information security team has worked with external IT experts in response to cyber attacks on a small number of Quanta servers, a spokesperson said, adding that “there’s no material impact on the company’s business operation” as a result of the hack.",
    "Via: Tom's Hardware"
  ],
  "headers": {},
  "links": {
    "Apple": "https://www.techradar.com/news/computing/apple",
    "claimed to have accessed obtained images and schematics of unreleased Apple products": "https://www.techradar.com/news/ransomware-gang-leaks-stolen-apple-macbook-blueprints",
    "MacBooks": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699",
    "MacRumours": "https://www.macrumors.com/2021/04/26/revil-delists-stolen-apple-schematics-threat/",
    "M1 iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "in a statement to Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-21/apple-targeted-in-50-million-ransomware-hack-of-supplier-quanta",
    "Tom's Hardware": "https://www.tomshardware.com/news/revil-drops-apple-threat"
  }
}