{
  "source": "https://www.techradar.com/news/netflixs-army-of-the-dead-first-reactions-call-it-a-thrilling-violent-zombie-film",
  "title": "Army of the Dead first reactions call Snyder's latest a 'thrilling, violent zombie film'",
  "category": "entertainment",
  "updated": "2021-05-11T11:39:17Z",
  "author": "samuel-roberts",
  "summary": "Zack Snyder's zombie movie sounds like the real deal",
  "article": [
    "Netflix's Army of the Dead is one of its biggest movies to date – and ahead of its release on May 21, social media reactions to Zack Snyder's first Netflix flick have started filtering out. The outlook is cheery for the Vegas-set zombie heist movie, which stars Dave Bautista alongside an ensemble cast.",
    "It's been called everything from \"bold, humorous and heartbreaking\" to \"a downright stunning display of zombie mayhem and carnage\". Below, we've captured a few reactions to the film to give you an idea of what to expect – at least until Netflix releases the review embargo closer to release.",
    "Let's start with TechRadar's own Tom Power, who was very positive on Snyder's first zombie movie since his debut Dawn of the Dead feature back in 2004.",
    "Another critic calls the film a \"blast\" and praises its creativity – it seems like zombies are just a good fit for Snyder's sensibilities as a filmmaker.",
    "Given that the film is about a ragtag squad of specialists trying to pull off the ultimate score, its superficial similarities to Suicide Squad have been noted by critics.",
    "Plenty of praise has been thrown at the movie's ensemble cast, which includes Omari Hardwick, Ella Purnell, Matthias Schweighöfer and Theo Rossi, among others.",
    "Most of the early reactions seem universally positive, but let's balance out all that praise with a little bit of criticism. One critic points out that you'll \"feel the runtime\" of the 2.5 hour film – which seems long for a movie of this ilk. Another reviewer points out that Army of the Dead feels pretty familiar:",
    "Find out for yourself on May 21, 2021.",
    "Dawn of the Dead remains one of Snyder's most enduringly acclaimed movies – while the DC universe of films has taken up the majority of the director's time over the past decade, it's nice to see him return to a genre where he can have more fun.",
    "For Netflix, too, it gets something that looks and feels more like a blockbuster, an area that it's pushing into more and more over the next few years. Acquiring Knives Out 2, for example, or producing spy movie The Gray Man with Chris Evans and Ryan Gosling, shows that it's serious about standing up to its blockbuster-touting competitors.",
    "After all, this year, the biggest movies in streaming have been landing on HBO Max – Godzilla vs Kong, for example, or Zack Snyder's Justice League."
  ],
  "headers": {
    "8": "Snyder takes on zombies again"
  },
  "links": {
    "Army of the Dead": "https://www.techradar.com/news/zack-snyders-army-of-the-dead-netflix-movie-gets-a-release-date",
    "Knives Out 2": "https://www.techradar.com/news/netflix-is-making-two-knives-out-sequels",
    "The Gray Man": "https://www.techradar.com/news/netflixs-massive-spy-movie-stars-chris-evans-as-a-really-interesting-villain"
  }
}