{
  "source": "https://www.techradar.com/news/cadillacs-premium-ev-that-changes-lane-by-itself-sold-out-in-19-minutes",
  "title": "Cadillac's premium EV - that changes lane by itself - sold out in 19 minutes",
  "category": "car-tech",
  "updated": "2021-09-20T16:39:00Z",
  "author": "chris-teague",
  "summary": "The Cadillac Lyriq Debut Edition proved popular",
  "article": [
    "As General Motors' premium brand, Cadillac has a lot of history and strong expectations to live up to. That's why interest in the design and capabilities of the automaker's upcoming EV, called Lyriq, is so strong.",
    "That interest also drove the upcoming electric car's initial allotment of reservations to sell out in just 19 minutes over the weekend.",
    "That's hundreds, if not thousands, of buyers willing to put down $100 for the opportunity to own a vehicle they've never seen in person and will likely not be available for over a year.",
    "Not that this is something new for the industry - Tesla, for example, has employed a similar strategy in the past.",
    "Lyriq reservations opened at 1pm on Saturday 18 September, and by 1:19pm all available Debut Edition models had been reserved.",
    "Cadillac will sell other versions of the vehicle when it hits the market, but the Debut Edition is the only model offered for reservation so far.",
    "The Lyriq hits a sweet spot on price and will offer several enticing technologies, such as unique light signatures and upgraded Super Cruise, another step towards autonomous driving which will see the car able to make lane changes by itself.",
    "With a starting price of around $60,000, the Cadillac will face off against strong competition from a whole slew of soon-to-be-released European EVs.",
    "Fans of American cars haven't had much in the way of premium electric vehicles to choose from, outside of Tesla and mid-range models from Ford and GM, which could be driving demand in part as well.",
    "While it's worth noting that the fee to reserve a Lyriq was just $100, is refundable, and non-binding, there's still a disconnect between supply and demand for new EVs.",
    "The GMC Hummer Edition 1 sold out quickly and Ford seemed to have been caught off guard by demand for its Mustang Mach-E earlier this year.",
    "Whether it's the desire to future-proof or just a curiosity for EVs, buyers are hot for electrification. While the lure of a limited-edition car is likely attractive just because of its exclusivity, it's clear the demand is strong enough for higher production volumes."
  ],
  "headers": {
    "6": "Analysis: hitting the sweet spot"
  },
  "links": {
    "Mustang Mach-E": "https://www.techradar.com/news/ford-mustang-mach-e"
  }
}