{
  "source": "https://www.techradar.com/news/microsoft-teams-is-getting-a-helpful-under-the-hood-upgrade",
  "title": "Microsoft Teams is getting a super helpful under-the-hood upgrade",
  "category": "computing",
  "updated": "2021-04-03T10:16:29Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams will soon allow admins to control how much bandwidth it gobbles up",
  "article": [
    "Microsoft is working on a new feature for its online ollaboration platform Teams that will help ensure the service performs consistently, irrespective of the user’s location.",
    "As per an entry to the product roadmap, a new roaming bandwidth control will allow admins to build bespoke bandwidth policies, based on the geographical location of each Teams user.",
    "“This allows admins to set more limited bandwidth controls for when users travel to remote or bandwidth constrained locations, and then relax limitations when they travel to a location with higher bandwidth capacity,” Microsoft explained.",
    "The new feature is currently still under development, but is set to roll out for all Teams users by the end of May.",
    "With the rise of remote working and exodus from major cities, IT teams have had to figure out how to deliver the same level of service to employees operating out of urban, suburban and rural areas.",
    "The disparity between the internet infrastructure covering these different regions is significant, with some staff having access to high-speed internet with plenty of bandwidth and others suffering all manner of connectivity issues.",
    "With the new Teams feature, however, admins will have a simple method of heading off potential performance issues, by dialling bandwidth limitations up or down depending on need.",
    "IT teams will initially have two settings at their disposal: AllowIPVideo and MediaBitRateKb. The former establishes whether the user’s video is enabled, while the latter determines the media bitrate for audio and video sharing in meetings.",
    "The phrasing of the roadmap entry suggests Microsoft intends to expand this range of options after the initial rollout is complete."
  ],
  "headers": {
    "4": "Microsoft Teams update"
  },
  "links": {
    "online ollaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "an entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1211707978853036300&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D81350",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}