{
  "source": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
  "title": "Shang-Chi release date, trailer, cast and what we know about Marvel's new movie",
  "category": "entertainment",
  "updated": "2021-09-01T15:29:42Z",
  "author": "samuel-roberts",
  "summary": "Shang-Chi and the Legend of the Ten Rings explained",
  "article": [
    "Marvel movies have taken a long time off, but in 2021, they're finally set to roar back onto theater screens – and Shang-Chi and the Legend of the Ten Rings is the second MCU release on the schedule for this year, following the July arrival of Black Widow. It'll also be the first to release exclusively in theaters this year, assuming we don't see the pandemic shake the movie schedule up again.",
    "Starring Simu Liu, best known for Canadian sitcom Kim's Convenience, Shang-Chi is another deep-ish cut from Marvel's roster of superheroes. Like the Guardians of the Galaxy were before that movie became a mega hit, this character isn't as well-known more broadly as the likes of Spider-Man and Iron Man. '70s comics readers, though, are likely to have more of an affinity with the hero.",
    "The story of the movie is a little grislier than other Marvel movie tales. Trained as an assassin from a young age, a now-adult Shang-Chi finds himself being dragged into the web of the mysterious Ten Rings organization after trying to make a fresh break, in what's been described as a 'family drama' by Marvel Studios. It looks like a classic MCU origin film combined with a martial arts picture, something we haven't really seen Marvel Studios do before. Directed by Destin Daniel Cretton, the movie features Asian talent on and off the screen to ensure the movie feels authentic.",
    "Below, we'll dig into what we know about Shang-Chi and the Legend of the Ten Rings so far, including its cast, release date, plot, and trailer.",
    "Shang-Chi debuted in the comic Special Marvel Edition #15 back in 1973, as a creation of artist Jim Starlin (Thanos' creator) and writer Steve Englehart (one of the most influential Batman creators ever). The book's title was quickly changed to The Hands of Shang-Chi: Master of Kung Fu, and it ran into the '80s. Shang-Chi's powers mostly encompass a variety of impressive martial arts skills.",
    "In the comics, Shang-Chi is trained into becoming an assassin by his father, who he later turns on. The character was originally conceived as the son of the licensed villainous character Fu Manchu – but this connection was dropped later on, and retconned entirely in modern appearances. Wenwu, Tony Leung's character in the film and Shang-Chi's father, was created specifically for the movie. That indicates a fresh approach to the hero's origins.",
    "In more modern appearances, Shang-Chi has been a member of the Avengers – specifically the 2012 iteration conceived by writer Jonathan Hickman. The character recently appeared in his own miniseries from writer Gene Luen Yang, which should offer a nice primer on the hero.",
    "Shang-Chi and the Legend of the Ten Rings will release on September 3 2021 exclusively in theaters, as it stands. That's in contrast to Black Widow, which is releasing on Disney Plus and in theaters simultaneously. Production on the film wrapped by the end of last year.",
    "The first Shang-Chi and the Legend of the Ten Rings trailer was released on April 19, 2021. Check it out below – it promises martial arts-infused action and a set piece involving a runaway bus in San Francisco.",
    "If you want to see a little more from the movie, the first images of Shang-Chi have also been revealed by Entertainment Weekly, which you can check out below:",
    "Here's the confirmed cast list for the film from Marvel, which was revealed back at Disney's Investor Day in December 2020.",
    "In what's become a fairly well-known piece of lore surrounding the making of the film, Simu Liu had actually asked Marvel on Twitter about the possibility of an Asian American hero joining the MCU all the way back in 2014, and specifically raised the idea of him playing Shang-Chi in December 2018. By July 2019, he was officially set as the movie's lead. Sometimes, it pays to ask...",
    "An official synopsis for Shang-Chi was released last year. \"Opening Summer 2021, Simu Liu stars as Shang-Chi in Marvel Studios' Shang-Chi and The Legend of The Ten Rings. Shang-Chi must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization.\"",
    "More about the story was revealed through the trailer and an EW piece. After spending much of his young life training to be an assassin at the behest of his father Wenwu, Shang-Chi left his family behind and moved to America to try a more ordinary life. At the start of the movie, Shang-Chi is a twenty-something living in San Francisco and mostly hanging out with his friends, like Katy, played by Awkwafina.",
    "Unfortunately, Wenwu wouldn't let him go so easily – and that's why Shang-Chi is pulled in to the grasp of the Ten Rings, and forced to face down the world he thought he'd previously escaped.",
    "Wenwu has gone by another name: the Mandarin, a name you likely remember as the moniker of Ben Kingsley's fake-out villain in 2013's Iron Man 3. This Mandarin is a much more terrifying figure. \"[People are] hopefully getting a more complex and layered take on the character than that name would lead you to,\" says producer Jonathan Schwartz.",
    "Expect a complicated relationship between Shang-Chi and his father, who apparently has a \"deep ability to love\", according to director Destin Daniel Cretton. As the trailer suggests, the movie will be heavy on martial arts set pieces – it's probably no surprise to learn that Shang-Chi is trained in a whole bunch of fighting styles. According to EW, Cretton drew inspiration from everything from Crouching Tiger, Hidden Dragon to the more comedic movies of Jackie Chan in bringing the movie's set pieces to life.",
    "The movie is taking the opportunity to craft a more contemporary version of an origin story for Shang-Chi – an advantage of the character not being as well-known as some of the others from Marvel's comics, and a chance to retire some of the hero's more dated tropes.",
    "Marvel is a proven hitmaker at this point, and the relative obscurity of the Shang-Chi character probably won't be a barrier to the movie's success. The trailer looks like a lot of fun – and a character who doesn't wear any form of mask, who practices martial arts, is not something we've really seen in the MCU before. Well, not in the movies: Iron Fist on Netflix certainly did it badly for the small screen. There's an opportunity to course-correct that, here.",
    "To keep Marvel feeling fresh on the big screen in Phase 4, it needs new and different types of stories – every time the studio has added a different angle on the MCU so far, from the way Doctor Strange brought magic into the fold, or how Guardians of the Galaxy showed us a cosmic side, it's made the whole enterprise seem more exciting. Hopefully this movie will add a similar storytelling dimension.",
    "Who knows? Maybe we'll see Shang-Chi turn up in a future iteration of the Avengers roster, as his comics counterpart did."
  ],
  "headers": {
    "4": "Who is Shang-Chi in Marvel's comics?",
    "7": "Shang-Chi release date: here's when you can see it",
    "8": "Shang-Chi trailer: first look at the movie",
    "10": "Shang-Chi cast: who's starring in the movie",
    "12": "Shang-Chi and the Ten Rings story: what is the plot of the MCU film?",
    "18": "What we think of Shang-Chi so far"
  },
  "links": {
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "in his own miniseries": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FShang-Chi-Gene-Luen-Yang-Vol%2Fdp%2F1302924850%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2430533108836833000-20",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "December 2018": "https://twitter.com/SimuLiu/status/1069696323056586752",
    "EW piece": "https://ew.com/movies/shang-chi-and-the-legend-of-the-ten-rings-simu-liu-first-look/"
  }
}