{
  "source": "https://www.techradar.com/news/fire-tv-streaming-devices-get-even-better-as-os-update-rolls-out-to-more-models",
  "title": "Fire TV streaming devices get even better as OS update rolls out to more models",
  "category": "televisions",
  "updated": "2021-07-21T11:36:41.120Z",
  "author": "rhys-wood",
  "summary": "A huge Fire TV rollout is happening soon",
  "article": [
    "Amazon is rolling out its latest and much-improved Fire TV platform, the Fire TV Experience, to a number of new devices – including the second-gen Fire TV Stick, as well as many Fire TV smart TVs and Fire TV soundbars. This follows the addition of Fire TV Experience to devices such as the Fire TV Stick 4K and Fire TV Cube earlier in 2021.",
    "In a press release, Amazon stated that the Fire TV Experience update will be rolling out to new devices \"over the coming weeks,\" so if you own any of those devices listed above, keep an eye on your updates throughout the rest of July and August 2021.",
    "The all-new Fire TV experience is, as Amazon claims, its biggest update yet. It features new user profiles, simplified menus and the ability to pin your favorite apps for much quicker access to the movies and shows you visit time and again. Also, the new App Peeks feature lets users preview content within popular apps, without having to access them first.",
    "Alongside the new Fire TV experience comes the addition of Amazon Kids to the second-generation Fire TV Stick, allowing users of the older device to access the app if they haven’t or can’t afford to upgrade to a newer stick.",
    "Any and all updates to the Amazon Fire user interface experience are welcome, as FireOS has never really been able to shake its similarities to that of Android. This is understandable, though, considering FireOS itself is a modified Android operating system. As such, any quality-of-life upgrades or notable differences being added will certainly help Fire TV devices better stand out from the crowd.",
    "We also appreciate the decision to roll out Fire TV updates to even more devices than ever before. This just makes the service far more accessible, no matter which device a user owns. Catering to second-gen Fire TV Stick owners is a huge plus, and we hope Amazon will continue to support the older model for future updates too."
  ],
  "headers": {
    "3": "Fire it up"
  },
  "links": {
    "second-gen Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "smart TVs": "https://www.techradar.com/news/best-tv",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Amazon Kids": "https://www.techradar.com/reviews/amazon-fire-7-kids-edition",
    "FireOS": "https://www.techradar.com/news/fireos-does-amazons-software-compete-with-android",
    "Android": "https://www.techradar.com/best/best-android-phones"
  }
}