{
  "source": "https://www.techradar.com/news/the-latest-intel-11th-gen-tiger-lake-leak-might-disappoint-you",
  "title": "The latest Intel 11th Gen Tiger Lake leak might disappoint you",
  "category": "computing",
  "updated": "2021-03-08T11:03:45Z",
  "author": "jess-weatherbed",
  "summary": "Slower speeds than previously rumored",
  "article": [
    "More information has emerged regarding Intel's upcoming 8-core Tiger Lake mobile chips, with details including the name of the new processor SKUs, as well as clock speeds and configurations.",
    "We initially saw rumors regarding the new CPUs shared on Twitter by prolific hardware leaker @momomo_us indicating the new lineup will have an unlocked Core i9-11980HK, plus a Core i9-11900H and Core i7-11800H. An additional spec sheet from a mobile workstation has now emerged that shows the Core i9-11900H will be 8-core with 16 threads, and the i7-11800H is the 8-core, 16 thread option.",
    "A correction has been made to the information that was initially leaked, with the i9-11900H reportedly having a base clock of 2.1 GHz, down from 2.5 GHz. The i7-11800H has a base clock of 1.9 GHz, down from 2.4 GHz and the i5-11400H has a base clock of 2.2 GHz, down from 2.7 GHz. An additional insight from known leaker @OneRachu also reveals a currently unknown 11260H, and states that the TDP of these CPUs will be 45W, with a 65w mode for the Core i9-11980HK to increase its base clock to 5.0 GHz.",
    "As with all rumors surrounding product leaks, if the information isn't coming directly from the official source then remain skeptical. Intel hasn't provided an expected launch date for these processors, but the current expectation is we may see an announcement in the next few months, possibly in line with Computex. With the unreleased i9-11980HK allowing overclocking – providing the laptop cooling system is up to the task – this could be a game-changer for Intel in the gaming laptop market.",
    "Via VideoCardz"
  ],
  "headers": {
    "3": "Stop the clock"
  },
  "links": {
    "Tiger Lake mobile chips": "https://www.techradar.com/news/intel-tiger-lake-announced-to-power-the-next-generation-of-laptops",
    "rumors regarding the new CPUs": "https://www.techradar.com/news/intel-to-attack-amd-with-a-trio-of-8-core-tiger-lake-laptop-cpus-leak-suggests",
    "@momomo_us": "https://twitter.com/momomo_us/status/1368039748489539584",
    "@OneRachu": "https://twitter.com/OneRaichu/status/1368170083353309187",
    "overclocking": "https://www.techradar.com/how-to/how-to-get-started-with-overclocking",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "VideoCardz": "https://videocardz.com/newz/intels-full-11th-gen-core-tiger-lake-h-lineup-listed-new-6-core-11260h-cpu-appears"
  }
}