{
  "source": "https://www.techradar.com/news/signal-aims-to-tempt-whatsapp-users-by-borrowing-some-of-its-best-features",
  "title": "Signal aims to tempt WhatsApp users by borrowing some of its best features",
  "category": "phones",
  "updated": "2021-01-22T10:08:38Z",
  "author": "cat-ellis",
  "summary": "Making the switch is about to get a lot easier",
  "article": [
    "Following changes to WhatsApp's privacy policies that require users to share extra data with its parent company Facebook, many users have begun looking for alternative messaging apps – and it looks like Signal is hoping to lure them away by borrowing a few of WhatsApp's features.",
    "Signal already offers end-to-end encryption and the ability to send messages that self-destruct after a certain period of time (an option that arrived in WhatsApp late last year), but its latest beta release reveals a raft of other updates that will bring it in line with its rival.",
    "The changes, discovered by WABetaInfo, include some cosmetic options that have appeared in recent WhatsApp updates (animated stickers and custom chat wallpapers, to be specific), but there are also several practical new features on the cards that will make it easier for WhatsApp users to make the switch.",
    "The maximum number of participants for a group call in Signal is increasing from five to eight (WhatsApp made the same change in April 2020), there's a new low data mode to reduce data usage during calls (an option WhatsApp debuted in 2014), and users can now set a custom 'about' status (which appeared on WhatsApp in June 2019).",
    "WhatsApp has (at least temporarily) delayed the switchover to its new terms of service, but that decision appears to have come too late for many users, including world leaders like French president Emmanuel Macron, who have decided to abandon ship rather than share extra information with Facebook.",
    "Telegram's founder Pavel Durov called the number of people leaving WhatsApp \"the largest digital migration in human history,\" so it's understandable that Signal is looking to increase its share of the pie by bringing its own specs in line.",
    "We don't yet know when Signal's update will be rolled out to all users, but if you've been looking for an alternative messaging app that can replace WhatsApp's features like-for-like, it's one to keep an eye on."
  ],
  "headers": {
    "4": "Get the message?"
  },
  "links": {
    "changes to WhatsApp's privacy policies": "https://www.techradar.com/news/whatsapps-new-privacy-policy-requires-you-to-share-data-with-facebook",
    "looking for alternative messaging apps": "https://www.techradar.com/news/heres-why-whatsapp-users-are-fleeing-for-other-platforms",
    "arrived in WhatsApp late last year": "https://www.techradar.com/news/iphone-users-are-getting-a-very-important-whatsapp-update-right-now",
    "WABetaInfo": "https://wabetainfo.com/signal-takes-advantage-of-the-situation-implementing-several-whatsapp-features/",
    "animated stickers": "https://www.techradar.com/news/whatsapp-is-getting-a-big-update-that-should-be-lots-of-fun",
    "custom chat wallpapers": "https://www.techradar.com/news/new-whatsapp-feature-will-stop-you-embarrassing-yourself-in-group-chats",
    "made the same change": "https://www.techradar.com/news/whatsapps-eight-person-video-calls-are-now-available-to-everyone",
    "WhatsApp debuted": "https://www.techradar.com/news/phone-and-communications/mobile-phones/whatsapp-just-made-voice-calls-more-affordable-1299839",
    "appeared on WhatsApp": "https://www.techradar.com/news/a-new-whatsapp-feature-will-let-you-share-your-status-on-facebook-and-instagram",
    "delayed the switchover": "https://www.techradar.com/news/whatsapp-delays-update",
    "the largest digital migration in human history": "https://www.techradar.com/news/whatsapp-exodus-was-largest-digital-migration-in-history-says-telegram-boss"
  }
}