{
  "source": "https://www.techradar.com/news/scotts-patron-eride-will-power-trail-riders-for-up-to-100km",
  "title": "Scott’s Patron eRide will power trail riders for up to 100km",
  "category": "fitness",
  "updated": "2021-09-09T13:16:26Z",
  "author": "tom-may",
  "summary": "Flagship new model features radical design",
  "article": [
    "Looking for an e-bike that's capable of more than just a ride to the shops? Want to get out in the wilds of the countryside? Then this sweet new ride may be just what you're looking for.",
    "Scott’s Patron eRIDE is an e-mountain bike aimed at long-travel trail riders. And its makers are really talking up its radical new design, suggesting it’s the “most incredible e-bike ever”, that it represents a “new integration benchmark”, and calling it the Swiss army knife of e-bikes.",
    "So what’s so unique about it? Well, the main innovation revolves around the fact that Scott has hidden the 160mm shock in the top tube, under a removable plastic cover.",
    "That provides more space for other elements of the bike, allows for the inclusion “excessively large water bottles” and, most significantly, has enabled Scott to position the motor in a different way.",
    "The motor – which comes with 85Nm and up to 340% assistance – is vertically positioned, rotated by 46 degrees, and resting on the frame. Scott says this makes it stiffer, better protects it from impacts, and improves cooling. Ventilation is further assisted by the holes in the cover.",
    "This motor, by the way, is based on Bosch’s recently reworked drive system, which we spoke to its CEO, Claus Fleisher, about in our recent interview. The frame, meanwhile, is fully carbon, and available in four sizes: S, M, L and XL.",
    "The bike also boasts a 750Wh battery, which Scott claims is the biggest on the market. Sliding inside a tube, which is incorporated into the main carbon frame, it’s capable of powering up to 100km (or 2,000m of elevation) on eco mode, or half that on Turbo mode.",
    "The shock comes with Scott’s proprietary TwinLoc technology, enabling riders to lock the suspension directly from the handlebar for optimal pedalling efficiency. Scott is also proud of the way it’s integrated the bike’s cables directly through the handlebars for a clean finish.",
    "Compared with the rest of its range, Scotts say it will give more support in terms of suspension than a Genius eRIDE, but a bit less than a Ransom eRIDE. On the other hand, it's said to be nimbler than a Ransom eRIDE.",
    "Overall, the Patron eRIDE is being clearly positioned as Scott's flagship model. \"This is the model that most of our ambassadors and athletes will use,\" the company proclaims. \"The Patron eRIDE has the biggest battery, the best integration and connectivity.\"",
    "Will it be a success? Many in the mountain bike/trail rider community are still sniffy about the idea of powered riding. But the idea that you can simply ride until you're worn out, and then switch to power, is attracting many. And this sleek, well-powered and cleverly designed new bike may well be the one that lures them in.",
    "The Patron eRIDE should be in shops by November 2021, with further models available in 2022."
  ],
  "headers": {
    "6": "Big on battery"
  },
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Patron eRIDE": "https://www.scott-sports.com/gb/en/patron-eride",
    "our recent interview": "https://www.techradar.com/news/the-next-generation-of-e-bikes-will-be-seriously-smart-but-youll-be-in-control"
  }
}