{
  "source": "https://www.techradar.com/news/cheapest-airpods-prices",
  "title": "The cheapest AirPods sales and deals in December 2021",
  "category": "audio-visual",
  "updated": "2021-12-01T09:59:50Z",
  "author": "mackenzie-frazier",
  "summary": "Your guide to the best AirPods deals that are available today",
  "article": [
    "Our best AirPods deals roundup is here for one thing - to help you get your hands on the very best Apple AirPods sales available online. Whether you're looking for the latest prices on the standard AirPods, the powerful AirPods Pro, or the all-new AirPods Max, we've got you covered in this article.",
    "While it was once rare to find AirPods sales in the US and UK, thanks to the product ranges eternal popularity and seasonal sales, it's now becoming easier and easier to find some discounted prices. However, they do sell out pretty quickly still, so we always recommend jumping on an AirPods deal if you're ready to commit.",
    "Recently we've seen a whole range of discounts - including savings of up to $80 / £80, although these have indeed gone pretty quickly. Considering how premium Apple tech is, these AirPods deals have been pretty damn good in our books, and these once heftily priced earbuds are now much more obtainable.",
    "If you've picked up a modern iPhone that's dumped the traditional headphone jack, the Apple AirPods rank amongst the best earphones to pair with your new phone. Although, as they're Bluetooth, you can pair them with plenty of other mobile phones and even laptops.",
    "So, how much are AirPods, and how can you get the best AirPods deals out there? Our price comparison tool automatically brings you the best savings from all your favorite retailers so you can shop the latest prices as soon as they hit the shelves.",
    "The Apple AirPods Pro were released in October of last year with a starting price of $249 / £249 / AU$399. Thanks to the recent release of the AirPods Max, you'll be able to find plenty of deals for the AirPods pro just below.",
    "That's quite the jump in price compared to the regular AirPods, but the AirPods Pro are the first AirPods to include active noise-canceling technology to keep outside distractions away from your music, which is excellent for those noisy commutes or keeping your concentration going at work. That being said, you can activate a mode that allows some outside noise to filter through, which is useful if you prefer being able to hear things like traffic when running/cycling/walking or someone calling your name in the office.",
    "The AirPods Pro are also water and sweat resistant making them much better suited to the gym than the standard AirPods, and they come with multiple tips so you can adjust to the best fit for you. The water resistance is IPX4 level, so we're talking the odd splash and light rain rather than full-on immersion.",
    "The Apple AirPods Pro ship with a wireless charging case as standard. There is no cheaper version with a standard charging case, unlike the regular AirPods that give buyers the option of both.",
    "There are plenty of AirPods deals to be found for the 2019 version that come with a wireless charging case. The Apple Airpods cost a bit more with prices starting at $199 / £199 / AU$319, but wireless charging is a super convenient feature. The actual AirPods themselves are the same as the ones we mentioned above, so the case is the only difference between the two.",
    "Just pop your AirPods into the snug charging case, close the lid, and put it on a Qi-certified wireless charging pad (sold separately) and that's it. Apple canceled the release of its own bespoke wireless charging pad, the Apple AirPower, which would have allowed for simultaneous charging of your iPhone, Apple Watch, and AirPods. But at least third-party pads are significantly cheaper than that one would have been.",
    "So, how much are the 2019 AirPods, and how can you get the cheapest price possible? Directly below, you'll find the latest AirPods deals for the 2nd generation earbuds, which were first released in March of 2019. The Apple AirPods with Charging Case had a starting price of $159 / £159 / AU$249, but thanks to the release of newer models, we've seen the wireless earbuds drop as low as $99 / £99 / AU$99.",
    "Compared to the older model, the visual design remains the same. But inside, you get a faster H1 processor chip, 50% more talk time, and hands-free Siri interactions. So seeing as the older models never really came down in price, the new 2019 AirPods are the best standard option to buy right now if the Pro's don't appeal. Look out for these features in the description to make sure you're getting the newest versions. This model comes with the standard charging case that provides a further 20 hours of battery life and up to three hours of talk time on a single charge.",
    "Apple quietly released the AirPods Max in December, and they're available to buy right now if you can find them in stock. They don't come cheap though, in fact, the AirPods Max are the most expensive headphones from Apple with a starting price of $549.99 / £549. The AirPods Max not only stand out because of their price, but the Apple headphones also feature an over-ear design, which is a first from the AirPods line. Apple claims the AirPods Max bring the magic of AirPods to an over-the-ear design, which means you're getting Active Noise Cancellation, powerful H1 Chips, and an enhanced audio experience. The AirPods Max also feature a unique design with a breathable knit mesh headband and a stainless steel frame with memory foam earcups for ultimate comfort. The Apple headphones come in several sleek color choices such as space gray, silver, sky blue, green, and pink and provide up to 20 hours of battery life. While we haven't seen any AirPods Max deals yet, we're hoping to see first-time price cuts during the upcoming Amazon Prime Day event.",
    "These models have been discontinued and phased out at most stores now. On the rare occasions that we do spot unused stock units, they're actually the same price as the new and improved 2019 versions.",
    "Short version: get the 2019 models instead via one of the deals in the comparison chart above. To be sure they are the new ones, look out for H1 chip and hands-free Siri functionality in the description if the title doesn't say something along the lines of '2019' or 'latest/newest version'.",
    "The official AirPods' price is $159 in the US and £159 in the UK and $249 in Australia. So you shouldn't pay any more. Although, we have seen some stores cheekily push the price up when stock thins out. If you're looking for the version with the wireless charging case, then prices shoot up to around $199 in the US and £199 in the UK.",
    "Expect the usual outlets to charge closer to the MSRP and, better yet, potentially dip below it around the key shopping seasons. Fingers crossed we don't have to wait long for some proper Apple AirPod sales though!",
    "As an alternative, there are lots of wireless earphone and headphone deals in our Beats headphone deals page and other brands are covered in our wireless headphone deals page.",
    "You might be waiting a while for seriously big discounts. Last year around Black Friday, we were seeing $20 discounts selling out in minutes, and it was one of the most popular deals we highlighted in our extensive roundups of the hottest offers. We saw similar discounts in the UK too - much better than last year's $7 discount but still no flash sales around right now.",
    "Things have actually been better overall this year though with much better deals available in various regions. We're regularly seeing discounts of $15/£20 outside of peak seasonal discounts, so you should be able to beat the recommended asking price to be honest."
  ],
  "headers": {
    "5": "The best AirPods sales and deals",
    "14": "What about the original 2016 Apple AirPods?",
    "16": "How much are AirPods?",
    "19": "Should I wait for a cheaper AirPods deal?"
  },
  "links": {
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Apple Airpods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "2019 AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Beats headphone deals": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "wireless headphone deals": "https://www.techradar.com/deals/the-best-cheap-wireless-headphone-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}