{
  "source": "https://www.techradar.com/news/iphone-se-3-could-be-based-on-a-surprisingly-modern-iphone",
  "title": "iPhone SE 3 could be based on a surprisingly modern iPhone",
  "category": "phones",
  "updated": "2021-10-22T09:27:37Z",
  "author": "tom-bedford",
  "summary": "An iPhone XR remake",
  "article": [
    "All signs were pointing to the iPhone SE 3 being based on an older, 'classic' iPhone like the iPhone SE (2020) was, but a new leak has suggested it could be based on a more recent device.",
    "According to Chinese website MyDrivers, the next 'budget' iPhone will launch in early 2022, will use an LCD display, and will be based on the iPhone XR. The site adds that the mobile will have a side-mounted fingerprint scanner, something Apple hasn't used for its smartphones before, that it will use the Bionic A15 chipset, and that it will be 5G-compatible.",
    "The iPhone XR came out in 2018 alongside the iPhone XS and iPhone XS Max, as the budget version of those other devices, and Apple continued it for quite a few years as a result of its popularity.",
    "Previous iPhone SE models have been based on older iPhones, like the iPhone SE (2020) which was an iPhone 8 but with improved internals. So the iPhone SE 3 being based on an older device isn't a surprise, but previous rumors suggested the next SE would also be based on the iPhone 8, so having a modern device mooted is a surprise.",
    "We say 'modern' because the iPhone XR doesn't have a physical Touch ID button, whereas the 8 does - this would be the first iPhone SE without the front-facing button. The idea that the SE 3 could have a side-mounted fingerprint scanner is intriguing though, as the iPhone XR didn't.",
    "If the iPhone SE 3 has a side-mounted fingerprint button, it would constitute a significant departure from the design of the iPhone XR.",
    "That's noteworthy because the iPhone SE (2020) was almost identical design-wise to the iPhone 8 - if this leak is correct, Apple could be preparing to take some creative liberties with how its new phone looks.",
    "The iPhone XR was a fairly good-looking mobile when it came out, so it'll be interesting to see what more Apple changes - color is another key area, as the XR came in loads of shades that its contemporaries didn't.",
    "If Apple has figuratively gone back to the drawing board for the new mobile, we'd like to see changes to the notch design and improvements to the display quality, as that would fix some of the things we criticized in our review of the XR.",
    "Perhaps adding cameras would also make the iPhone SE 3 more appealing, but then you risk making the device a more premium handset, which would ruin the whole point of a 'budget iPhone'.",
    "This is just one leak for now, and we'll have to see what subsequent rumors hint at."
  ],
  "headers": {
    "5": "Analysis: creative liberties"
  },
  "links": {
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "MyDrivers": "https://news.mydrivers.com/1/790/790144.htm",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review"
  }
}