{
  "source": "https://www.techradar.com/news/new-microsoft-surface-pro-x-documents-suggest-an-imminent-launch",
  "title": "New Microsoft Surface Pro X documents suggest an imminent launch",
  "category": "computing",
  "updated": "2021-09-20T20:21:57Z",
  "author": "john-loeffler",
  "summary": "A new certification listings indicates Windows 11 on ARM is coming",
  "article": [
    "Microsoft may be set to release a new Surface Pro X running Windows 11 on ARM this month at its Surface event on September 22.",
    "The latest news comes from an Energy Star Certification for a new Microsoft Windows Surface Pro X device that says it can run both Windows 10 and Windows 11, running on a Qualcomm Snapdragon SQ2 processor with eight cores and 16 threads.",
    "While most of the information contained on the certification, originally spotted by Windows Latest, relates to the device's power consumption (for obvious reasons) there are a couple of things worth noting beyond the baseline specs for the device.",
    "Toward the bottom of the listing, the certification lists a certification date of August 5, 2021, with a \"Date Available On Market\" of September 7, 2021, which was obviously two weeks ago. This is likely a preliminary date for the earliest the device could have been on the market when the device was submitted for certification.",
    "Microsoft first announced its September 22 event back on September 1, so shortly after getting the Surface Pro X certified by Energy Star, though it's doubtful Microsoft was waiting exclusively for Energy Star to give it the green light to announce its latest device.",
    "There has been a lot of controversy over the system requirements for Windows 11, especially around which processors are capable of running it.",
    "Officially, Microsoft says you'll need an AMD Zen 2 or eighth-generation Intel processor (with some allowances made for Microsoft devices running on seventh-gen Intel chips), though you're free to try running the new operating system on older chip, at your own risk, when the OS launches on October 5.",
    "So it will be interesting to see how well the new OS runs on an ARM-based Qualcomm Snapdragon. Windows on ARM has had a bit of a rocky road these past few years as the predominantly 64-bit Windows 10 operating system attempted to capture some of the energy-efficient goodness offered by ARM processors, which are traditionally used in more lightweight mobile devices like phones and tablets.",
    "ARM processors had major compatibility issues with a lot of popular Windows 10 apps, however, which held Windows 10 on ARM back from really taking off. A lot of those compatibility issues have been resolved now that ARM chips can run 64-bit apps, but it really did take some of the wind out of Windows 10 on ARM's sail in recent years.",
    "A new Surface Pro X running Windows 11 on ARM then just might be the mighty gust of wind Microsoft needs to reset and get its Windows on ARM experiment back on course."
  ],
  "headers": {
    "5": "Analysis: Windows 11 might not run on a Zen 1, but it'll run on ARM"
  },
  "links": {
    "Surface Pro X": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Energy Star Certification": "https://www.energystar.gov/productfinder/product/certified-computers/details/2382916",
    "Windows Latest": "https://www.windowslatest.com/2021/09/20/a-new-microsoft-surface-pro-x-is-coming-with-windows-11/",
    "announced its September 22 event back on September 1": "https://www.techradar.com/news/is-the-microsoft-surface-duo-2-just-a-month-away",
    "you'll need an AMD Zen 2 or eighth-generation Intel processor": "https://www.techradar.com/news/windows-11-shouldnt-run-on-older-pcs-but-microsoft-wont-stop-you-from-trying",
    "Windows on ARM": "https://www.techradar.com/news/windows-on-arm-now-supports-64-bit-apps"
  }
}