{
  "source": "https://www.techradar.com/news/the-surface-laptop-4-might-be-getting-a-swappable-lid",
  "title": "The Surface Laptop 4 might be getting a swappable lid",
  "category": "computing",
  "updated": "2021-02-11T22:17:50Z",
  "author": "john-loeffler",
  "summary": "Are swappable back panels coming to the Surface?",
  "article": [
    "A newly filed patent shows that Microsoft might be bringing swappable lid covers for the next Surface Laptop, making it much easier to customize your Surface device to your liking.",
    "The patent, spotted this week by WindowsUnited, shows an interlocking back panel that can be swapped out to feature new designs, which would supposedly be sold by retailers along with the Surface Laptop itself.",
    "These patents might not ever make it into an actual product, as Windows Central reminds us, but it does show that Microsoft is looking at ways to distinguish its products from the crowded field of similar looking Ultrabooks out there.",
    "The patent doesn't refer to a specific Surface device, but it would make sense for updates on products like the Surface Book and Surface Laptop. The patent notes that there are several customization options for \"computing devices\" like stickers and even snap-on covers, these aren't integral to the design of the device itself, so will always be ad hoc customization solutions.",
    "While the patent doesn't mean that we will definitely see interchangeable lids implemented in a future Surface laptop, it wouldn't be surprising.",
    "Microsoft has been investing pretty heavily in the Surface line of laptops and tablets and a recent Bluetooth certification points to the upcoming release of the Surface Laptop 4. We can't say that this design will be implemented in that laptop, but we'd love to see it.",
    "It's hard to find a truly unique Ultrabook these days, so it would be great to see Microsoft build customization into its Surface devices – and it would also make business sense to help differentiate its products both in-store and out in the world."
  ],
  "headers": {
    "4": "Microsoft continues to invest in their Surface products"
  },
  "links": {
    "patent": "https://pdfpiw.uspto.gov/.piw?PageNum=0&docid=10908649&IDKey=47697A3A123F%0D%0A&HomeUrl=http%3A%2F%2Fpatft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO2%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r%3D3%2526f%3DG%2526l%3D50%2526co1%3DAND%2526d%3DPTXT%2526s1%3Dmicrosoft.ASNM.%2526s2%3Dhinge%2526OS%3DAN%2Fmicrosoft%252BAND%252Bhinge%2526RS%3DAN%2Fmicrosoft%252BAND%252Bhinge",
    "WindowsUnited": "https://windowsunited.de/exklusiv-surface-laptop-bald-mit-wechselbarer-rueckseite/",
    "Windows Central": "https://www.windowscentral.com/microsoft-patents-design-interchangeable-backs-surface-devices",
    "Surface Book": "https://www.techradar.com/reviews/surface-book-3",
    "Surface Laptop": "https://www.techradar.com/reviews/microsoft-surface-laptop-3-15-inch",
    "Bluetooth certification": "https://www.techradar.com/news/microsoft-surface-laptop-4-spotted-in-bluetooth-certification-is-it-coming-soon",
    "Surface Laptop 4": "https://www.techradar.com/reviews/surface-laptop-4"
  }
}