{
  "source": "https://www.techradar.com/news/whatsapp-exodus-was-largest-digital-migration-in-history-says-telegram-boss",
  "title": "WhatsApp exodus was largest digital migration in history says Telegram boss",
  "category": "news",
  "updated": "2021-01-20T14:34:36Z",
  "author": "storm-simpson",
  "summary": "Even world leaders have switched to Telegram",
  "article": [
    "WhatsApp's controversial new privacy policy prompted the exodus of thousands of users amid fears that the instant messaging platform would share even more sensitive user data with its parent company, Facebook.",
    "WhatsApp's loss was every messaging platform's gain it seems. Pavel Durov, the founder of Telegram, described the exodus as \"the largest digital migration in human history.\"",
    "In consecutive blog posts on his Telegram channel, Durov listed how his platform benefitted from WhatsApp's folly.",
    "On January 14 he said: \"We may be witnessing the largest digital migration in human history\" and boasted that two more world leaders – Brazilian and Turkish presidents, Jairo Bolsonaro and Recep Tayyip Erdogan – have migrated to the platform.",
    "They join a long list of heads of state, including French President Emmanuel Macron.",
    "\"We are honoured that political leaders, as well as numerous public organisations, rely on Telegram to combat misinformation and spread awareness about important issues in their society,\" said Durov.",
    "He also took the time to throw at Facebook by saying \"unlike other networks\" his platform does not use nontransparent algorithms to determine whether a user will see the content they subscribed to or not.",
    "In a blog post earlier in the week, Durov stated that Telegram surpassed 500 million active users in the first week of January and that growth continued to accelerate as the platform added 25 million new users in 72 hours (at the time of posting: January 12).",
    "Durov feels that people no longer want to exchange their privacy for free service and \"no longer want to be held hostage by tech monopolies that seem to think they can get away with anything as long as their apps have a critical mass of users.\"",
    "WhatsApp tried to stem the flow of users vacating its platform but it seems the damage has been done, with several tech heavyweights, including Edward Snowden and Elon Musk, encouraging the public to switch to more private messaging apps like Telegram and Signal.",
    "WhatsApp eventually relented and said the controversial privacy update has been pushed back to some time in May."
  ],
  "headers": {},
  "links": {
    "consecutive blog posts": "https://t.me/s/durov",
    "pushed back to some time in May": "https://www.techradar.com/news/whatsapp-delays-update"
  }
}