{
  "source": "https://www.techradar.com/news/the-new-volvo-c40-electric-car-has-a-260-mile-range-that-will-increase-with-updates",
  "title": "The new Volvo C40 electric car has a 260 mile range that will increase with updates",
  "category": "car-tech",
  "updated": "2021-03-02T14:58:50Z",
  "author": "john-mccann",
  "summary": "The range will get better with time",
  "article": [
    "The new Volvo C40 Recharge has been officially announced, and it is Volvo's first model to go solely fully electric. That means the new C40 Recharge won't be available as any form of hybrid, or with a combustion engine.",
    "This isn't a vehicle you'll be able to walk into a showroom and buy either, with the Volvo C40 Recharge only available online (a first for Volvo) and a step towards all cars from the brand being sold exclusively online by 2030.",
    "The infotainment system in the new C40 Recharge is powered by Google's Android operating system, providing a more mobile-like interface and direct access to some of the most familiar apps on today's smartphones, such as Google Maps, Spotify and the Google Assistant.",
    "What's more, Volvo is offering unlimited data with its all-electric C40, which means you can download and use as many apps as you wish without having to worry about data usage or additional costs.",
    "The Volvo C40 comes with a 78kWh battery, which the firm says will get you from 0-100kph (0-62mph) in just 4.9 seconds and can be recharged from 0% to 80% in 40 minutes when connected to a 150kW DC charger.",
    "As for how far you can travel on a single charge, the C40 has a quoted range of 420km / 210 miles - which puts it towards the middle of the electric car field - however, that's just the start.",
    "Volvo says it will improve the range of the new C40 Recharge via future over-the-air updates, allowing you to travel further on a single charge. It hasn't given us any indication of how much additional range could be added, or when the first of these updates will land - but it's certainly something to keep an eye on.",
    "We've already seen Tesla offer similar range-boosting updates, and it could well become common practice for many EVs going forward.",
    "The Volvo C40 Recharge will be available in seven colors and go into production during the Autumn (Sep-Nov) of this year, while the price and release date is yet to be announced."
  ],
  "headers": {
    "4": "The Volvo C40's range will get better with time"
  },
  "links": {}
}