{
  "source": "https://www.techradar.com/news/sonos-speakers-finally-get-hi-res-audio-streaming",
  "title": "Sonos speakers finally get Hi-Res Audio streaming",
  "category": "audio-visual",
  "updated": "2021-03-24T16:43:09Z",
  "author": "olivia-tambini",
  "summary": "It's been a long time coming",
  "article": [
    "Sonos speakers can finally handle wireless Hi-Res Audio streaming, with Qobuz beating competitors like Tidal and Amazon Music HD to become the first Hi-Res streaming service to be supported by the multi-room ecosystem.",
    "Available with the S2 app, Qobuz is bringing 24-bit wireless streaming to Sonos customers, who will be able to listen to \"studio-quality music\", which preserves \"all the details and color of the original recordings,\" according to the French streaming service.",
    "Previously, it was only possible to listen to Hi-Res Audio on Sonos speakers by playing 24-bit FLAC and ALAC files from a local drive – but the new Qobuz integration should make this as easy as pressing a button within the S2 app.",
    "The ability to support 24-bit streaming first came to compatible Sonos products with the introduction of the S2 app; these include the Sonos One, One SL, Five, and Play:5 speakers, Sonos Arc, Beam, Playbar, and Playbase soundbars, and the brand's portable speakers, the Sonos Move and the Sonos Roam.",
    "The discontinued Play:1 and Play:3 speakers don't support 24-bit streaming unfortunately (as well as any Sonos speakers that still use the S1 app), though you'll still be able to stream in 16-bit via Qobuz.",
    "While Sonos does support other streaming services with high-resolution tiers like Tidal and Amazon Music HD, Qobuz is the first to deliver true 24-bit Hi-Res Audio, rather than 'CD-quality' 16-bit audio.",
    "Whether that difference will be discernible to the average ears is debatable, but there are other benefits aside from any perceived improved in the sound of your music.",
    "As CNET points out, this will be beneficial even for owners of smaller speakers like the Sonos One and the new Sonos Roam, where pristine audio quality may not always be possible. In the past, 24-bit files wouldn't be played at all if your Sonos speaker didn't support them, so even if you're not bothered about Hi-Res Audio, you should have more choice when it comes to your music."
  ],
  "headers": {
    "5": "Not just for audiophiles"
  },
  "links": {
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "One SL": "https://www.techradar.com/reviews/sonos-one-sl-review",
    "Play:5": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/sonos-play5-657133/review",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Playbar": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-playbar-1130807/review",
    "Playbase": "https://www.techradar.com/reviews/sonos-playbase",
    "portable speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "Sonos Roam": "https://www.techradar.com/reviews/sonos-roam",
    "CNET": "https://www.cnet.com/news/sonos-users-get-better-compatibility-with-first-24-bit-streaming-music-support/"
  }
}