{
  "source": "https://www.techradar.com/news/microsoft-teams-will-soon-let-you-access-all-your-important-files-offline",
  "title": "Microsoft Teams will soon let you access all your important files offline",
  "category": "computing",
  "updated": "2021-05-28T08:54:17Z",
  "author": "mike-moore",
  "summary": "Never lose track of your files again with Microsft Teams",
  "article": [
    "Finding the right file or presentation whilst using Microsoft Teams is set to get even easier thanks to a new update to the platform.",
    "The video conferencing service has proved incredibly popular over the last 12 months as more and more companies embrace hybrid working due to the pandemic.",
    "Finding a simple and effective way to share files across groups or work teams has become paramount to making sure remote workers are able to collaborate effectivdly, but Microsoft Teams now appears to have found a way to help assist.",
    "The platform will now give users offline access to files opened and shared within Microsoft Teams. According to the Microsoft 365 roadmap entry detailing the update, users \"can now access previously opened files even when there is no internet connectivity\".",
    "The new feature, which could prove incredibly useful for those working from home or in areas of poor connectivity, is set to roll out to Microsoft Teams desktop and Android mobile users in June 2021.",
    "The update comes as Microsoft looks to increasingly position Teams not just as a tool for work, but for personal lives as well.",
    "The company recently announced \"personal features\" in Microsoft Teams as it looks to bring together friends and family from around the world as the pandemic hopefully begins to ease.",
    "Among the new features is Together Mode, which looks to offer a different view from regular video calls, with backgrounds including a family lounge, coffee shop, or a summer resort, which Microsoft says will help reduce video call fatigue.",
    "Another addition is the ability to react with live emojis and GIFs during a call, allowing users to bring more emotions and personality to meetings. If you've missed a vital call, Teams will also let you come back and catch up on the saved chat thread, where you can also react with emojis or GIFs - and also, unlike Zoom, carry on the chat after the call has finished."
  ],
  "headers": {
    "3": "Offline files"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft 365 roadmap entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-4834409150184282000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D81563",
    "\"personal features\" in Microsoft Teams": "https://www.techradar.com/news/microsoft-teams-is-now-invading-your-personal-life"
  }
}