{
  "source": "https://www.techradar.com/news/saucony-updates-its-fastest-ever-carbon-running-shoe-with-a-new-fit",
  "title": "Saucony updates its 'fastest ever' carbon running shoe",
  "category": "fitness",
  "updated": "2021-06-02T11:55:31Z",
  "author": "cat-ellis",
  "summary": "The same carbon plate, but a new lacing system and heel fit",
  "article": [
    "Saucony has released an updated version of its full carbon fiber running shoe, the Saucony Endorphin Pro 2.",
    "The changes are subtle, but should be noticeable. The new model features the same S-shaped carbon plate as its predecessor, which was billed as the company's 'fastest ever' shoe when it launched last year. However, the Endorphin Pro 2 has been tweaked with a new heel support and lacing system for a better fit.",
    "The curve of the carbon plate is designed to encourage forward propulsion, while the stiff midsole helps transfer forces. The shoe also features Saucony's lightweight PWRRUN PB foam, and tips the scales at 213g for the men's model, and 179g for the women's.",
    "The Endorphin Pro 2 will face stiff competition, though. Ever since Nike's first Vaporfly attracted controversy for potentially giving wearers an unfair advantages (a claim that was subsequently quashed by a World Athletics review panel), thick soles and carbon plates have become mainstream in racing shoes.",
    "In addition to the improved fit, one of the factors that might tempt you towards the Endorphin Pro 2 in particular is its price. Although not the cheapest around, is very reasonable for a quality carbon shoe, and considerably less than models like the new Nike ZoomX Vaporfly NEXT% 2.",
    "The Endorphin Pro 2 is available now for for $200 / £190 (about AU$260) directly from Saucony in the US and the UK.",
    "The launch of the Endorphin Pro 2 coincides with Global Running Day (June 2), which has also seen the launch of the new entry-level Garmin Forerunner 55, plus a new worldwide study from Asics that encourages runners and other athletes to scan their faces before and after a workout to analyze the effect of exercise on mental wellbeing.",
    "More fitness and running news is coming soon, so stick with TechRadar to make sure you're up to date."
  ],
  "headers": {
    "6": "Global Running Day"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes",
    "the company's 'fastest ever' shoe": "https://www.techradar.com/news/saucony-launches-its-fastest-ever-running-shoe-to-take-on-nike-vaporfly",
    "Nike ZoomX Vaporfly NEXT% 2": "https://www.techradar.com/reviews/nike-zoomx-vaporfly-next-2",
    "in the US": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8451104456302727000&xs=1&url=https%3A%2F%2Fwww.saucony.com%2Fen%2Fendorphin-pro-2%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsaucony-updates-its-fastest-ever-carbon-running-shoe-with-a-new-fit",
    "the UK": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1254045236995806700&xs=1&url=https%3A%2F%2Fwww.saucony.com%2FUK%2Fen_GB%2Fthe-endorphin-collection%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsaucony-updates-its-fastest-ever-carbon-running-shoe-with-a-new-fit",
    "Garmin Forerunner 55": "https://www.techradar.com/news/garmin-launches-new-entry-level-running-watch-the-garmin-forerunner-55",
    "a new worldwide study from Asics": "https://www.techradar.com/news/scan-your-face-to-see-how-exercise-affects-your-mental-health",
    "stick with TechRadar": "https://www.techradar.com/fitness"
  }
}