{
  "source": "https://www.techradar.com/news/why-infinity-train-on-hbo-max-is-the-best-animated-series-you-havent-seen",
  "title": "Why Infinity Train on HBO Max is the best animated series you haven't seen",
  "category": "entertainment",
  "updated": "2021-06-12T10:00:59Z",
  "author": "chris-aiken",
  "summary": "Celebrating a series that's gone too soon",
  "article": [
    "Last year, when Cartoon Network animation Infinity Train hit HBO Max, it was finally my chance to dive into the series. Little did I know I would actually be watching a dark anthology dealing with trauma and healing, disguised as a children’s show.",
    "The premise of season 1 sets the template – Tulip is a young girl who, following her parents' divorce, finds herself stuck on this mysterious train. Moving through each train car presents a new adventure or challenge, and the train only seems to pick up passengers dealing with personal issues.",
    "It immediately caught my attention, and I binged all three seasons in a single weekend. Like many other fans who were also captured by the stories of the passengers inhabiting this insidious train, I anxiously waited for word on the next season.",
    "We did get that next season. The coveted Book 4. Unfortunately, fans soon found out that it would be the last stop on a train that supposedly never ends. The abrupt cancellation of a beloved cartoon is nothing new, but Infinity Train was a show that clearly had more stories to tell.",
    "Below, I'll discuss what makes Infinity Train such a great show, and why Book 4’s story about the characters Ming-Gi and Ryan represents a bittersweet ending to a show that needed more time to grow.",
    "Infinity Train is best described as an experience. For those not in the know – and HBO Max gives US viewers an easy way to catch up – here’s what the show is about thematically, beyond that basic premise. Infinity Train focuses on characters with psychological and emotional issues, which is a heavy topic for a kids' show, but it carefully mixes cartoonish antics with a thoughtful approach to the subject matter to make it a little easier to swallow.",
    "When they are unable to resolve these issues in the real world, the train appears before the character in question, transporting them a mysterious, otherworldly wasteland with nothing but the train and the tracks. Suddenly finding themselves as unwilling passengers, they discover there's a random number imprinted on their hand, and that every car on the train contains its own world with challenges that need to be solved to move forward.",
    "But, moving through the train doesn’t guarantee getting back home – unless passengers figure out why they are really on the train, they’ll be stuck there forever.",
    "You’d be forgiven for thinking that this sounds more like a horror story than a children’s show. That’s because the cartoon has an edge of darkness to it, along with plenty of unsettling moments and imagery. But trust me, it's all part of the show’s unusual charm. And while the mysteries of the train, its purpose, and it’s denizens give fans plenty of things to discuss and ruminate in places like Reddit, it’s the characters that are the core of the story.",
    "Each season of Infinity Train follows a different set of characters and their journey through the train across 10 episodes. While this technically makes it an anthology show, it all takes place within the same universe, meaning plenty of characters make recurring appearances, or just end up taking the spotlight in the next season.",
    "Infinity Train doesn’t hold back with its approach to trauma. As mentioned, Book 1 deals with Tulip and the effect of her family breaking apart because of her parents’ divorce. Through the characters MT and Jesse, Book 2 tackles self-identity and peer pressure. In Book 3, we see the effect of big expectations, loss, and the impact of failing to deal with trauma.",
    "It’s all incredibly well done, as each season makes our lead characters discover a little more about themselves and puts them on a path towards healing. These complex topics and themes make the show deeply relatable, especially if you're watching as an adult, and it highlights that trauma can be brutal and not easily fixed – it emphasizes that it has to be worked on.",
    "While the show is definitely a rollercoaster of emotions and can even get too dark for its own good, it’s balanced out with great world building, fun characters, and a unique concept that shows it can be fun, silly, and smart.",
    "It really is bittersweet to see Infinity Train end with Book 4. While having more of the show is great, you can clearly tell that Book 4 was never meant to be an ending.",
    "This final season tells the story of two best friends, Ming-Gi and Ryan, whose relationship fell apart. Together, they both end up on the train, where Ming-gi has to learn be more reckless and to take more charge of his future, while Ryan has to learn to learn to rein in his spontaneous nature and consider the feelings of others. It’s a story of two friends reconnecting, in order to have a better future together.",
    "When it comes to last season of Infinity Train, creator Owen Dennis has said he wouldn’t have changed a thing if he knew about the show’s cancellation – and that this was the story the creators felt they needed to make after finishing Book 3 of the show. Each season of the series is intended to be a reaction to the previous one.",
    "This makes sense. Book 3 was the darkest season of Infinity Train yet, leaving most of its characters' stories unresolved. Book 4 has a lighter tone, and positions itself as a prequel, showing the train before it’s thrown into disarray as we saw in Book 1.",
    "Book 4's strength is that it feels like a break from the norm, which works when you consider how the previous season played out. However, it doesn’t function that well as an ending. It’s also one of the shakier seasons overall, where the two lead character don’t feel like they’ve worked out the issues with their relationship before it ends.",
    "It’s more of what loyal viewers of the show love, but stopping here feels empty. Yes, Infinity Train is an anthology were the main characters are the focus and their journey begins and ends with that season. But all the seasons were connected, and there was a story being told in the background that we as fans will never get answers to. More importantly, there were some characters whose stories never had a chance to fully be told.",
    "Clearly there were plans for more seasons – eight seasons were planned in total, according to Owen Dennis, with a fifth season that could've answered some of the lingering questions about the series.",
    "Every time I hear news about what could have been, I like to tell people that we were denied something wonderful – because it’s kind of true. When you love a show, you want to feel like you can walk away from it without feeling like something is missing. With modern TV, though, and the overpopulated world of streaming content, you're never really guaranteed closure on the series you're passionate about.",
    "Still, Infinity Train is clearly beloved. Within the last year and its debut on HBO Max, it has gained a tremendous following. At one point, it was apparently the fourth most popular show on the service, and fans have demonstrated their love for it all over social media.",
    "If you give Infinity Train a try, you’ll see want many fans see. Infinity Train is unique, smartly written, and handles emotional topics in a way that most kids can understand. You’ll want that final season that shows us how we can survive and move past grief and sadness.",
    "You’ll also to want that closure to properly say goodbye, and like the passengers on the train, walk away in a better place than you were before.",
    "Infinity Train seasons 1-4 are now streaming on HBO Max in the US."
  ],
  "headers": {
    "5": "An anthology, but not an anthology",
    "13": "Not the ending we deserved"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained"
  }
}