{
  "source": "https://www.techradar.com/news/the-oneplus-10-could-end-up-looking-a-lot-like-the-oneplus-9",
  "title": "The OnePlus 10 could end up looking a lot like the OnePlus 9",
  "category": "phones",
  "updated": "2021-09-04T09:30:25Z",
  "author": "david-nield",
  "summary": "Not much changing, design-wise",
  "article": [
    "The OnePlus 9 launched in March 2021, and it sounds as though there might not be a OnePlus 9T at all – which leaves the way clear for us to start speculating on what the OnePlus 10 might be bringing with it at some point during 2022.",
    "Well-known tipster Yogesh Brar gets the ball rolling for us with the reveal that the OnePlus 10 phones are \"being pitched as polished series 9 models\", suggesting that not a huge amount is going to change in terms of the aesthetics of these devices.",
    "It's still very early days for OnePlus 10 rumors, and information from this particular source isn't always accurate, so bear that in mind. At this stage it does seem likely that we'll get a standard model and a Pro edition as usual when the time comes.",
    "Brar also reveals that a \"bunch\" of Nord-branded phones are on the way, which is to be expected, and that \"some new accessories\" are in the pipeline too, ready to be unveiled at the next device launch. OnePlus has been diversifying into other products in recent years – with the OnePlus Watch, for example.",
    "This is the very first leak we've heard regarding the OnePlus 10, so we can't tell you much more about the phone at this stage. The performance and camera improvements we typically see year-on-year are to be expected, though it doesn't sound like a major upgrade is in store with the 2022 flagship OnePlus phones.",
    "The rumor is that OnePlus has decided against a mid-cycle OnePlus 9T refresh this year because the OnePlus 9 and the OnePlus 9 Pro are still perfectly fine – though the global chip shortage may have also played a role. The OnePlus 10 should be launched around March 2022.",
    "There's been a lot going on in the world in 2021, and it's been a busy 12 months for OnePlus, as well as everyone else. Besides product launches, original co-founder Carl Pei quit the company to make some wireless earbuds, and OnePlus decided to merge its operations with Oppo.",
    "Some premium OnePlus earbuds and a OnePlus smartwatch have been unveiled in recent months, and there's talk that a OnePlus Pad is in the pipeline as well. The company has now gone way beyond making flagship-level phones at affordable prices.",
    "With all that activity in mind, 2022 is going to be a big year for OnePlus, and the OnePlus 10 and OnePlus 10 Pro are likely to play a defining role in how successful the next year is going to be for the company. The mid-range-to-premium section of the smartphone market is more competitive than its ever been – thanks in part to OnePlus itself.",
    "We really liked the OnePlus 9 phones, so the signs are good for the OnePlus 10, even if there aren't any hugely significant changes to it. As always, the pricing is going to be crucial, and could determine whether the handsets sink or swim.",
    "Via GSMArena"
  ],
  "headers": {
    "3": "Very early days",
    "6": "Opinion: 2022 is a big year for OnePlus"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "Yogesh Brar": "https://twitter.com/heyitsyogesh/status/1433359898683711496",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "The rumor is": "https://www.techradar.com/news/oneplus-9t-canceled",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "quit the company": "https://www.techradar.com/news/carl-pei-quits-oneplus",
    "wireless earbuds": "https://www.techradar.com/reviews/nothing-ear-1",
    "with Oppo": "https://www.techradar.com/news/oneplus-is-merging-with-oppo-heres-what-that-could-mean-for-android-phones",
    "OnePlus earbuds": "https://www.techradar.com/reviews/oneplus-buds-pro",
    "that a OnePlus Pad": "https://www.techradar.com/news/oneplus-pad",
    "GSMArena": "https://www.gsmarena.com/oneplus_10_series_tipped_to_reuse_predecessors_design-news-50803.php"
  }
}