{
  "source": "https://www.techradar.com/news/the-dji-air-2s-is-old-news-dji-is-officially-moving-into-self-driving-cars",
  "title": "It's official: DJI is moving into self-driving cars",
  "category": "cameras",
  "updated": "2021-04-16T11:12:53Z",
  "author": "mark-wilson",
  "summary": "The rumored DJI Automotive sub-brand is real",
  "article": [
    "DJI has just upstaged the launch of its own DJI Air 2S drone by announcing a new sub-brand called DJI Automotive – the new home for its self-driving car tech.",
    "Rumors earlier in the week had suggested the drone maker might be moving into autonomous driving, which is a good fit for DJI considering its drones use cutting-edge obstacle avoidance. But DJI has just made the move official on its new DJI Automotive site.",
    "At this stage, DJI won't be making its own self-driving cars, as there's sadly no sign of a Mavic vehicle on the site. But it does explain the three areas of autonomous driving that DJI is getting into.",
    "These three self-driving solutions are DJI Driving D130 series (for highway and motorway driving of speeds between 0-130kph), the D80 series (suitable for driving at lower speeds of 0-80kph in cities), and the DJI Parking System.",
    "Right now, it looks like DJI Automotive will be partnering with car manufacturers to integrate this tech into future cars, rather than being a consumer-facing brand. But it's certainly a fascinating move that builds on some of the same tech that will be familiar to drone fans.",
    "Those three systems are built on tech like geo-fencing (which DJI uses to prevent its drones from taking off in dangerous areas), ultrasonic sensors (for judging distances using soundwaves), and Lidar scanners (Light Detection and Ranging), which you'll find on industrial drones like the DJI Zenmuse L1 and your iPhone 12 Pro.",
    "Naturally, DJI's experience in building drone software will play a role too, with the company stating that \"based on the algorithm accumulation in the field of UAV (Unmanned Aerial Vehicles) vision sensing\", it's developed some new Stereo Perception Sensors that can \"identify common objects with high precision, locate arbitrary obstacles and estimate the distance\".",
    "Put all of this tech and experience together and you have a promising self-driving cocktail that DJI says will deliver things like hands-free driving, automatic emergency brakes, advanced overtaking assistance and (the one we're most happy about) intelligent collision avoidance.",
    "Somewhat more scary, though, is the DJI Driver Monitoring System, which can apparently detect the driver's condition in four ways (facial Analysis, fatigue detection, distraction detection, and dangerous behavior detection) and \"reduce accidents caused by human error\". Presumably, this means that if DJI Automotive doesn't think you're on the ball today, it could step in to show you how it's done.",
    "Of course, DJI is far from the only company with self-driving car tech, with Huawei recently announcing that it's getting into the growing space, alongside established brands like Google's Waymo.",
    "But with its unrivaled experience in making some of the best drones around, along with its many patents in the field of self-driving tech, DJI certainly stands a good chance of being a big player in the autonomous driving. Expect to hear more about it at the Shanghai Motor Show, which starts on 19 April."
  ],
  "headers": {
    "7": "Driving force"
  },
  "links": {
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "earlier in the week": "https://www.techradar.com/news/dji-could-be-bringing-its-drone-tech-to-self-driving-cars",
    "DJI Automotive site": "https://auto.dji.com/",
    "Lidar scanners": "https://www.techradar.com/news/what-is-a-lidar-scanner-the-iphone-12-pros-rumored-camera-upgrade-anyway",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review"
  }
}