{
  "source": "https://www.techradar.com/news/microsoft-says-its-going-to-get-working-on-an-xbox-series-x-mini-fridge",
  "title": "Microsoft says it's going to get working on an Xbox Series X mini fridge",
  "category": "gaming",
  "updated": "2021-04-05T09:22:30Z",
  "author": "david-nield",
  "summary": "Keep your cool while gaming",
  "article": [
    "You've seen the Xbox Series X, you've seen the fridge inspired by the Xbox Series X, and now it looks as though the Xbox Series X mini fridge is coming too – possible exhausting the number of ways that Microsoft can play off the similarity between its latest console and the kitchen appliance.",
    "At the end of last week, Twitter launched a #BestOfTweets competition, and in the brands category it was Xbox up against Skittles. At this point, Xbox marketing chief Aaron Greenberg promised that Xbox Series X mini fridges would go into production if the Microsoft brand came out on top.",
    "In the end, Xbox edged out Skittles by the narrowest of margins: 50.5% against 49.5%. A total of 341,731 votes were cast in the final, though it's not clear just how many of them were after an Xbox-shaped drinks chiller.",
    "True to his word, Greenberg then followed up to say that the Xbox Series X mini fridge would indeed be going into production – with the first one of the line being delivered to the defeated finalists at Skittles, with some Xbox games packed inside.",
    "As you can see from the tweet above, we don't have much detail here – it's not clear when the Xbox Series X mini fridge is going to be going on sale, how widespread the availability might end up being, or how much one of the mini fridges might set you back.",
    "However, we're talking Greenberg's insistence that this isn't a late April Fools' joke or any kind of clickbait as a guarantee that this is really going to happen in some form or another, and it might end up being a must-have accessory for anyone who's invested in Microsoft's most powerful console to date.",
    "Of course, product tie-ins and spin-offs are common in the gaming industry, and it's easy to see why Microsoft would want to go ahead with this – it's likely to grab a fair bit of attention, as well as put more Xbox-branded hardware out into the world.",
    "No word yet on whether or not the Xbox Series S is going to get a home appliance of its own: it certainly doesn't look as much like a mini fridge as the Series X does, but another Twitter poll might be enough to get something in the pipeline."
  ],
  "headers": {},
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "the fridge inspired": "https://www.techradar.com/news/the-xbox-series-x-is-now-a-real-fridge-and-you-can-own-it",
    "promised that": "https://twitter.com/aarongreenberg/status/1377803738702745602",
    "of margins": "https://twitter.com/TwitterMktg/status/1377985717683560449",
    "followed up": "https://twitter.com/aarongreenberg/status/1377986560679768064",
    "Greenberg's insistence": "https://twitter.com/aarongreenberg/status/1377803738702745602",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}