{
  "source": "https://www.techradar.com/news/the-sonos-roam-could-be-the-best-portable-speaker-ever-heres-why",
  "title": "The Sonos Roam could be the best portable speaker ever – here’s why",
  "category": "audio-visual",
  "updated": "2021-03-11T11:04:37Z",
  "author": "olivia-tambini",
  "summary": "We can’t wait to get our hands on the Sonos Roam",
  "article": [
    "The Sonos Roam is the latest wireless speaker from the multi-room audio giant, and its promising specs suggest it could be the best portable speaker we’ve seen.",
    "It’s not the first portable Sonos speaker – that was the Sonos Move – but a relatively low price, new connectivity features, a rugged and lightweight design, and the potential for excellent audio performance means the Roam could eclipse the Move, and swipe its crown as the best Bluetooth speaker on the market.",
    "Like the Move, the Sonos Roam comes with both Wi-Fi and Bluetooth connectivity, a choice between Google Assistant and Alexa for voice control, and can be integrated into the wider Sonos ecosystem. However, extra features like Automatic Switching and Sound Swap – both of which we’ll look at below – and improved Auto Trueplay mean the Roam isn’t just a smaller, cheaper version of its older sibling.",
    "The Sonos Roam looks like it could be an excellent speaker in its own right, with Sonos employing clever design choices to mitigate the various sonic compromises that often come with more compact builds.",
    "There’s a lot to be excited about, and while we won’t speak to the Sonos Roam’s performance before we’ve tested it ourselves, there are lots of features that we can’t wait to try out – features that could make the Sonos Roam the best portable speaker yet.",
    "The Sonos Roam is the cheapest speaker that the brand has ever released, making it a relatively affordable way to gain access to the Sonos ecosystem.",
    "That’s not to say that it’s cheap; $169 / £159 / AU$279 for a portable speaker definitely puts the Sonos Roam at the higher end of the price scale, although it is significantly cheaper than the brand’s last portable speaker, the Sonos Move.",
    "Sonos devices rarely come cheap, but their high prices are usually justified by excellent audio performance, reliable connectivity and attractive design – and if the Roam can offer all this at a slightly cheaper price, the audio brand could be on to a real winner.",
    "If it lives up to its specs, the Sonos Roam will be able to do things that most portable speakers can’t, thanks to its integration within the company’s wider ecosystem.",
    "As well as using the Sonos Roam as a regular Bluetooth speaker, you can add it into your existing Sonos setup, with the ability to pair to other Sonos devices at the touch of a button.",
    "We saw the same thing with the Sonos Move, but the Roam’s new Sound Swap feature makes this integration even more comprehensive. Sound Swap allows you to ‘throw’ the music from your Sonos Roam to the nearest Sonos speaker available, with the two devices using ultrasonic frequencies to communicate. All you have to do is hold down the play button on the top of the Roam, and your music should magically begin playing on your Sonos Arc, for example.",
    "That’s not something any other Sonos speaker can do, let alone other Bluetooth speakers on the market.",
    "Portable smart speakers are starting to grow in popularity, not least thanks to the success of the Sonos Move and similar products from other brands, such as the Bose Portable Home Speaker, and Sonos’ assistant-agnostic approach to its speakers means the Roam will be an attractive proposition for both Google Assistant and Alexa users.",
    "The ability to ask your speaker questions, check your calendar, and even control your other smart home devices with your voice alone are features rarely seen in Bluetooth speakers, even if they are starting to become more commonplace.",
    "The Sonos Roam works over both Wi-Fi and Bluetooth 5, so you can use it in the home or on the move – and another new feature, Automatic Switching, should ensure that connectivity is seamlessly maintained wherever you go, with the speaker automatically connecting to your Wi-Fi network when in range, and re-pairing with your phone when you’re out and about.",
    "Most portable speakers on the market today only offer Bluetooth connectivity, so the inclusion of Wi-Fi support alone is an excellent feature. Add in Automatic Switching and the latest version of Bluetooth, and the Sonos Roam could be the best-connected speaker we’ve ever seen.",
    "Design is hugely important when it comes to audio devices, but outdoor speakers and home speakers necessarily tend to look rather different. While an outdoor speaker needs to be rugged, waterproof, and resistant to bumps and scrapes, home speakers are generally made of more premium materials, with a focus on aesthetically pleasing lines.",
    "With the Sonos Roam, it looks like the company has found a happy middle ground between these competing design imperatives, combining a rugged build with a minimalist aesthetic.",
    "The speaker comes with an IP67 water-and-dust-resistance rating, and rubberized concave end caps to protect it from the elements. At the same time, its precision-drilled grille and sleek finish mean it should fit into even the chicest of homes.",
    "The Sonos Roam is a far cry from the typically garish-looking waterproof speakers on the market, and it’s a welcome change. It’s also far lighter and smaller than its predecessor, making it much better suited to playing your tunes on the go.",
    "We think there will be lots to love about the Sonos Roam, but there are a few downsides that we’ve noticed.",
    "For starters, you can’t use two Sonos Roam speakers as a pair of rear channels for your home cinema system. We expected this to be the case, as the same is true for the Sonos Move – the company puts this down to sync issues, and the potential for a directional soundtrack to lose its focus if a speaker isn’t optimally positioned in a room.",
    "While we understand the reasoning behind this decision, it’s a shame that Sonos hasn’t pulled out all the stops to make the Sonos Roam a speaker that really can do it all. With Wi-Fi and Bluetooth connectivity, smart home integration, and Sound Swap, it comes very close to being a speaker for pretty much any occasion.",
    "There’s also the fact that the Sonos Roam is unlikely to sound as powerful as the Sonos Move, due to its smaller size, meaning that if you’re looking for the loudest portable speaker of the two you may have to fork out over $200 extra for the Roam’s larger sibling.",
    "That said, we’re hoping that any trade-off in audio quality in favor of a more compact build is negligible – because if Sonos’ claims that the speaker has “enough power to fill a room” are proven to be accurate, the Sonos Roam could easily see off the competition to become the best portable speaker of 2021."
  ],
  "headers": {
    "5": "A (sort of) low price",
    "8": "Sonos smarts",
    "12": "Your choice of voice assistant",
    "14": "Excellent connectivity",
    "16": "Rugged design meets chic lines",
    "20": "Are there any downsides to the Sonos Roam?"
  },
  "links": {
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "best Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "best portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Bose Portable Home Speaker": "https://www.techradar.com/reviews/bose-home-speaker-500",
    "waterproof speakers": "https://www.techradar.com/news/best-waterproof-speaker",
    "home cinema system": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema"
  }
}