{
  "source": "https://www.techradar.com/news/godzilla-vs-kong-ending-explained-who-won-the-monsterverse-fight",
  "title": "Godzilla vs Kong ending explained: who won the MonsterVerse fight?",
  "category": "entertainment",
  "updated": "2021-04-01T08:02:35Z",
  "author": "tom-power",
  "summary": "Clash of the titans",
  "article": [
    "Spoilers for Godzilla vs Kong follow.",
    "Godzilla vs Kong is out now on HBO Max, and the latest MonsterVerse movie was a fun ride, in our opinion. It isn't without its issues but, as far as blockbuster films go, it's one of the more enjoyable ones we've seen in 2021.",
    "As the dust settles on their epic bout, though, there are some lingering questions that remain following the film's final scenes. We imagine that you'll have your own queries about Godzilla vs Kong, including questions about its ending.",
    "That's where we come in. We're here to answer some of those questions, such as who was crowned the winner of the duo's battle, how the movie ends, and whether there will be any more entries in Legendary's MonsterVerse.",
    "Bear in mind that there are major spoilers for the movie after the sub-headline below. If you haven't watched Godzilla vs Kong in its entirety yet, leave this page and come back when you have. Otherwise, you'll have the movie spoiled for you.",
    "This is a big question to kick things off with, but it's better to explain it now in order to provide more context to the section below.",
    "For those unfamiliar, director Adam Wingard told IGN that there would be only one winner from the duo's fight. \"This is the decider,\" he said. \"You don't have to debate it anymore. You watch this film. That's Godzilla, that's King Kong. They're beating... each other, and one wins, and that's it.\"",
    "Godzilla and Kong only lock horns twice in this movie, which is a little disappointing for a movie that billed this as the ultimate showdown. Either way, despite how the final scenes of the film play out - more than this later - there's only one clear winner.",
    "It's Godzilla.",
    "Why? Well, because the prehistoric sea monster wins both fights. In the first, Godzilla almost drowns Kong. But for the US navy's depth charge barrage, it would have succeeded, too. Kong makes his way back onto his ship and is clearly in no condition to carry on fighting. The US navy's entourage even turns off its engines, lights, and weapons to trick Godzilla into thinking it's won, so that it doesn't come back and finish Kong off.",
    "In the second fight, Godzilla beats Kong again. Sure, this bout is more evenly matched thanks to Kong's smarts and his Hollow Earth axe, but he's still outmuscled by Godzilla. It's the latter who tears at Kong with its sharp claws and stomps on his chest to finally end the contest.",
    "Again, if it isn't for humanity's intervention to aid Kong in his hour of need, he wouldn't have survived. It's Dr. Lind who uses one of Apex Cybernetics' H.E.A.V ships to restart Kong's heart and allows him to help Godzilla defeat the film's real antagonist, which we'll get onto below.",
    "By the movie's end, there's a begrudging respect between the pair. In our minds, though, it's evident that Godzilla is the monster supreme in the MonsterVerse, no matter what Kong or his fanbase will say.",
    "Adam Wingard's movie may have been billed as a titantic clash between the titular pair, but they aren't the only monster in the movie. As it turns out, certain sections of humanity haven't learned their lesson from Godzilla, Kong: Skull Island, or Godzilla: King of the Monsters.",
    "What have they done now? Well, they've made a robotic version of Godzilla. You read that right. Through a combination of cybernetics, one of King Ghidorah's skulls, Apex Cybernetics and some Hollow Earth energy, Apex Cybernetics - the film's antagonistic corporation - have made Mechagodzilla.",
    "If you want a primer on who, or what, Mechagodzilla is, you can read more in our Mechagodzilla explainer article. If you just want answers for the film's ending, however, read on.",
    "As it turns out, Apex Cybernetics have created Mechagodzilla so that humanity has a way to combat Godzilla if it ever turned on them. It's a stupid idea on their part, given that Godzilla has left humanity alone since the end of King of the Monsters, but there's always someone looking to take advantage of a situation.",
    "To function properly, Mechagodzilla needs a greater energy source than Apex is able to provide. Long story short, they steal some Hollow Earth energy to power their creation and, true to form, things go terribly wrong. Mechagodzilla becomes sentient - thanks to a combination of the Hollow Earth power source and King Ghidorah's lingering consciousness - and starts leveling Apex Cybernetics' Hong Kong base.",
    "Godzilla, who has just bested Kong, finally meets its match during the ensuing battle. Powered by the Hollow Earth's energy and King Ghidorah's rage, Mechagodzilla immediately gains the upper hand of its namesake. Godzilla doesn't stand a chance against its arsenal of weapons, Hollow Earth energy surges and metallic shell, so it's unsurprising to see Mechagodzilla overpower its counterpart.",
    "Not all hope is lost, though. As we mentioned in the section above, Kong rejoins the fight after Jia, the little girl who Kong has a trusting relationship with, convinces him that Godzilla isn't his enemy. Rescuing Godzilla from certain death, Kong and his former adversary put their differences aside and team up to take Mechagodzilla down.",
    "After a pulsating clash that tos-and-fros, Godzilla supercharges Kong's axe with its nuclear breath and Kong cuts off Mchagodzilla's sting-like tail. Another axe swipe and its right arm falls to the ground; oil loosing from the wound in its shoulder.",
    "With Mechagodzilla on the backfoot, Kong continues his assault. A chest-splitting swing is followed by Mechagodzilla's left arm and right leg being amputated, which results in it falling to the ground. Mechagodzilla prepares to unleash a nuclear breath attack, but another axe smash from Kong stops it in its tracks. Kong jumps onto his foe's fallen body and rips its head and upper spinal column out to finally end Mechagodzilla's reign of terror.",
    "Exhausted, Kong slumps to the floor. As humanity celebrates Kong's victory, however, Godzilla rises and heads towards the giant ape. Kong grabs his axe and readies himself for another fight. To his surprise, Godzilla silently recognizes that Kong saved its life and seems to offer him its respect. In reply, Kong drops his axe to de-escalate the situation.",
    "With the pair knowing where they stand, Godzilla swims off into the Pacific Ocean. Kong, alongside Jia, Dr. Lind and Dr. Andrews, returns to the Hollow Earth, which is now their home.",
    "It's hard to say. Godzilla vs Kong's ending certainly leaves the door open on solo movies for the pair, but Wingard himself says that any sequels will be dictated by audience demand.",
    "Speaking to DreadCentral ahead of the film's release, Wingard said that the MonsterVerse was \"at a crossroads now. It’s really at the point where audiences have to kind of step forward and vote for more of these things. If this movie is a success obviously they [Warner Bros] will continue forward.\"",
    "If there are to be sequels, it's likely that they'll take place in the Hollow Earth. There's still a lot we don't know about this subterranean world where titans are supposedly born. Additionally, exploring this world would ensure that there isn't another repeat of Warner Bros. 'titans fighting on Earth's furace' formula. The Hollow Earth gives them creative license to portray the Hollow Earth however they see fit, and show that there are threats for Kong to deal with in his new kingdom.",
    "For now, Kong and Godzilla have gone their separate ways, and it's unclear if we'll see them or the MonsterVerse again. It's up to global audiences to decide whether there are future instalments.",
    "Godzilla vs Kong is out now on HBO Max and in theaters in the US, as well as cinemas in other world regions."
  ],
  "headers": {
    "5": "Godzilla vs Kong: who won overall?",
    "13": "Godzilla vs Kong: how does the film end?",
    "24": "Godzilla vs Kong: will there be another movie?"
  },
  "links": {
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-3035646003473848300&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fgodzilla-vs-kong-ending-explained-who-won-the-monsterverse-fight",
    "IGN": "https://www.ign.com/articles/godzilla-vs-kong-definitely-wont-end-in-a-draw-says-director",
    "Mechagodzilla explainer article": "https://www.techradar.com/news/godzilla-vs-kong-mechagodzilla-explained",
    "DreadCentral": "https://www.dreadcentral.com/news/383790/exclusive-godzilla-vs-kong-director-adam-wingard-explains-why-no-post-credits-scene/?fbclid=IwAR19i5JyBKeGcQsX4DL-M6iDB1v8d4XuZhgoaSlp48OaC6i4KE1SeOGY2a0"
  }
}