{
  "source": "https://www.techradar.com/news/how-the-cell-phone-changed-lives-by-its-inventor",
  "title": "How the cell phone changed lives... by its inventor",
  "category": "computing",
  "updated": "2021-04-04T00:38:11Z",
  "author": "martin-cooper",
  "summary": "The first mobile call ever was made on April 3, 1973",
  "article": [
    "Martin Cooper is an American Engineer who is credited with inventing the first handheld cellular mobile phone back in 1973 while working at Motorola. In addition to being the “father of the cell phone”, Cooper is also the first person in history to make a call from a mobile phone in public.",
    "What follows is an extract from Chapter 13 of his new book Cutting the Cord titled “How the Cell Phone Changes Lives” which is now available at bookstores as well as online.",
    "In 2001, roughly 45 percent of the US population had a cell phone. Ownership had doubled in the previous four years and quadrupled over the prior six. On September 11 of that year, terrorists hijacked airplanes and launched attacks in New York, Washington, and Pennsylvania. On at least one of the hijacked planes, passengers used cell phones to communicate with family members on the ground. In many locations, however, cell sites had not yet been installed or existing sites didn’t have the capacity to carry the sudden increase in cellular telephone calls. Many first responders and government officials could not be reached, even on the wired network.",
    "On that awful day, radio pagers—what many called beepers—were a principal means of how information about the attacks spread. Even though there were three times as many cell phones as pagers, pagers were still widely used for contacting and alerting people, including at the highest levels of the US government.",
    "Among White House staff traveling with President George W. Bush, “every- one’s pager started going off” as word spread of the attacks. There were no phones on Air Force One, which carried the president around the country as they tried to figure out what action to take. The White House press secretary had a two-way pager, not a cell phone, that could send and receive only a few predetermined responses. The presidential entourage was only able to get updates on the attacks by picking up local television signals as the plane flew around. In the North Tower of the World Trade Center, pagers were the principal source of news for those trying to get out. Long lines formed at pay phones around Manhattan.",
    "These pagers were descendants of the first nationwide devices Motorola introduced thirty years earlier. People want and need to be in touch with each other—conveniently, affordably, often immediately, and, during emergencies, urgently. In the late 1960s, when pagers were teaching us about constant connectivity and the portable cell phone was still a distant dream, I had a science fiction prediction. I told anyone who would listen that, someday, every person would be issued a phone number at birth. If someone called and you didn’t answer, that would mean you had died. On September 11, we experienced the dark obverse of this prediction—if you tried to get in touch with someone and couldn’t get through, you feared they had died.",
    "I expected, even in the early 1970s, that everyone—everyone—would want and need a cell phone. Others at Motorola shared this expectation of ubiquity because our two-way radio business had shown us firsthand how many businesses functioned magnitudes better when people were connected. The Mount Sinai providers, airport workers, and Chicago police officers taught us how being connected made organizations work. We remembered the physicians who refused to give up their pagers so we could fix them. Portable devices like the pager and cell phone, through both mundane use and tragedies like September 11, became anytime, anywhere companions, integral to identity itself.",
    "These experiences demonstrated a principle of technology that has shaped my outlook for decades. Proof of a product’s usefulness comes when users become so dependent upon and attached to it that they will not give it up, regardless of defects or negative impact. The cell phone has proved this many times over. In a 2014 Supreme Court decision, Chief Justice John Roberts wrote that cell phones “are now such a pervasive and insistent part of daily life that the proverbial visitor from Mars might conclude they were an important feature of human anatomy.”",
    "What surprised even me was the speed and scope of adoption. I did not imagine that more people in the world would eventually have access to cell phones than flush toilets.",
    "We tend to overestimate technology’s impact in the short run but underestimate its long-term impact. This is known as Amara’s Law, after Roy Amara, a Stanford scientist who ran the Institute for the Future think tank for twenty years. Cell phones are a classic example. In Motorola’s fact sheet about the DynaTAC produced for the media in April 1973, we said that “the portable phone is designed for use ‘on the go,’ when one is away from the office or home, where conventional telephones are not available.” We believed that most people were “on the go” most of the time. And that is even more true now than it was then.",
    "After cellular phones became a functioning business, the spark that my team and I ignited didn’t light much of a fire within the financial community at Motorola. When we prepared the budget for cell phone development, Jim Caile, my marketing manager, showed me a forecast for sales of portable cell phones. We agreed that the first phones would go to market by the mid- to late 1970s. The predicted quantities of product shipments, however, struck me as totally unacceptable.",
    "I knew what it would cost for the engineering and other talents needed to develop a manufacturable cell phone. I had done it enough times, and underestimated those costs enough times, to be pretty confident in my estimates. And I also knew that we would never get our leaders to buy into a plan that would sell too few cell phones to recover that investment. On the other hand, the naysayers, especially the financial managers, would laugh us out of the room if we were as optimistic as we wanted to be.",
    "I looked at the forecast again. “Double all the sales forecasts,” I told Caile, “and let’s see if we can sell the plan.” He dutifully did that, and management approved.",
    "We weren’t that far off on the sales forecast, but only because most of the early cell phones were car phones. The portable was too expensive, and there were not enough cell sites to support reliable portable communications. By 1990, portable performance and size became more practical, and sales grew rapidly. By 2000 it was difficult to buy a car phone; the handheld had taken over. By the 2000s, the collapse of wired telephone subscribers had started. People didn’t believe me when I predicted, in the 1970s, that the wired phone would, in the distant future, be made obsolete.",
    "Yet none of us at Motorola envisioned features like cameras on phones. After all, there weren’t digital cameras in 1973, so it wasn’t even on our radar of technological possibility. Throughout the 1960s, Motorola had been a leader in transistors and incorporated them into consumer electronics. This included the DynaTAC, so we had some notion that, to improve performance, cell phones would include more and more transistors. But we certainly didn’t imagine that the cell phone would become a smartphone, a computer in its own right. The personal computer was still in development at the time, and the internet was just being conceived.",
    "Almost universally, predictions about the use and popularity of cell phones were comically wrong.",
    "In 1984, Fortune magazine predicted there would be one million cell phone users in the United States by 1989. The actual figure was 3.5 million. In 1994, consultants estimated that by 2004, there would be between sixty and ninety million cell phone users globally. Even the generous margin of error they gave themselves was insufficient: the actual number in 2004 was 182 million.",
    "This is an excerpt from, Cutting the Cord, by Martin Cooper, the inventor of the first cell phone. (You can purchase the book from Amazon in hardcover for $22.99 or read it digitally on Kindle for just $2.99)."
  ],
  "headers": {},
  "links": {
    "Cutting the Cord": "https://www.simonandschuster.com/books/Cutting-the-Cord/Martin-Cooper/9781948122740",
    "Motorola": "https://www.techradar.com/news/best-moto-phones",
    "Amara’s Law": "https://www.techradar.com/news/world-of-tech/10-laws-of-tech-the-rules-that-define-our-world-1067906",
    "DynaTAC": "https://www.techradar.com/news/world-of-tech/the-10-most-influential-gadgets-ever-made-1093113",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FCutting-Cord-Phone-Transformed-Humanity-ebook%2Fdp%2FB08L9JCMHL%2Fref%3Dtmm_kin_swatch_0%3F_encoding%3DUTF8%26qid%3D%26sr%3D%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1432845034678842000-20"
  }
}