{
  "source": "https://www.techradar.com/news/wiz-has-almost-fixed-one-of-the-biggest-frustrations-with-smart-lights-but-not-quite",
  "title": "WiZ has almost fixed one of the biggest frustrations with smart lights – but not quite",
  "category": "smart-home",
  "updated": "2021-09-03T09:13:10Z",
  "author": "carrie-ann-skinner",
  "summary": "Opinion: Wiz and Philips missed a trick by not ensuring compatibility",
  "article": [
    "Smart lights make your life easier by letting you control the bulbs and lamps in your home from your phone without even leaving your sofa. They’re one of the easiest ways to start your smart home journey too, as you just need to replace your existing bulbs with smart versions.",
    "Smart light bulbs are one of the most affordable smart home devices you can buy. However, according to EnergyStar, the average US home has 50 bulbs and chances are they don’t all use the same fitting, which means you’re likely to rely on several different smart lighting brands to kit your whole home out with smart bulbs, without restoring to having to undertake extensive DIY work to change the fittings in your home. In turn, this automatically makes life harder as you need different apps to control them.",
    "Affordable smart lighting brand WiZ is one of the few brands hoping to change this with its Connected by WiZ partnership program that sees other brands put chips into their products so they can be controlled by the Wiz app.",
    "Wiz has announced it’s expanding the program to include Philips smart bulbs… but disappointingly it’s not the Philips Hue smart lighting we know and love. Instead, it’s a new range of Philips Smart LED bulbs.",
    "The smart lighting market is booming. According to market research firm Statista, it was worth $11 billion in 2020 and will quadruple in value to $44 billion by 2030. Philips Hue is arguably one of the most well-known names when it comes to smart lighting, but is also one of the most expensive too.",
    "Meanwhile, WiZ has positioned itself as a simplistic and affordable smart lighting brand, so when Philips Hue’s parent company, Signify, acquired WiZ in 2019, it was hoped that bulbs from the two brands would be compatible. This would provide a way for those on a more limited budget to still take advantage of some of the Hue features, including the newly announced Philip Hue and Spotify partnership that sees the smart lights flash, dim, brighten, and change color to suit the beat, mood, genre, and tempo or music playing on the music streaming service.",
    "However, the move to launch a new line of Philips smart LED bulbs that are part of the Connected by WiZ program – but don’t sit within the Philips Hue ecosystem – looks set to cause consumers confusion more than anything else. While WiZ said the bulbs will be clearly marked as ‘Connected by WiZ’, we think in consumers’ minds the Philips brand will automatically lead them to assume its Philips Hue.",
    "When they get the bulbs home and installed, they’ll be disappointed that they just don’t get access to the same level of features, such as the array of customizable scheduling options available on Hue – for example, you can set outdoor lights to come on at sunset but go off at 2am, rather than waiting for sunrise. They’ll also miss out on multi-user geofencing, which checks the Hue app to see if others are home first before activating location-based automations.",
    "Wiz did point out that using Alexa, Google Assistant and IFTTT means it is possible to control Philips Hue and WiZ bulbs at the same time, but in our eyes, this really is a missed opportunity for the brands to dominate the smart lighting market. However, it does mean that brands such as LIFX could potentially look to implement a similar system and maybe topple Philips Hue from its position of the best smart lighting brand right now."
  ],
  "headers": {
    "4": "Consumer confusion and a missed opportunity"
  },
  "links": {
    "Smart light bulbs": "https://www.techradar.com/news/best-smart-lighting",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "EnergyStar": "https://www.energystar.gov/sites/default/files/asset/document/LBR_2017-LED-Takeover.pdf",
    "Statista": "https://www.statista.com/statistics/813066/world-smart-lighting-market-revenue/",
    "Philip Hue and Spotify partnership": "https://www.techradar.com/news/this-philips-hue-and-spotify-feature-makes-color-changing-smart-bulbs-a-must-have"
  }
}