{
  "source": "https://www.techradar.com/news/xbox-series-x-dolby-vision-atmos",
  "title": "Xbox Series X Dolby Vision and Atmos: what’s supported, and what isn’t?",
  "category": "gaming",
  "updated": "2021-02-11T17:00:23Z",
  "author": "becca-caddy",
  "summary": "How to make the most of these audio-visual innovations",
  "article": [
    "The Xbox Series X is the first games console to enable gaming in both Dolby Vision and Dolby Atmos. But how does this support work and will it work with your TV set-up at home?",
    "Much has been made of Dolby Vision and Dolby Atmos support on the next-gen Xbox Series X console. But this isn't as simple as you might have imagined. For example, Dolby Vision support is, at the time of writing, only supported on streaming apps and videos and not Xbox Series X games – even if that's set to change in the coming year.",
    "What's more, certain TV set-ups might not make the most of Dolby's latest audio and visual innovations, which is worth bearing in mind if you're considering purchasing the new console.",
    "That's where this guide comes in. Below we've detailed when Dolby Vision and Dolby Atmos support is coming for your Xbox Series X and some of the things you'll need to have in place to take advantage of these innovative new technologies.",
    "Don't have a next-gen console yet? Check out our guide to where to buy Xbox Series X and where to buy Xbox Series S.",
    "The short answer is: yes, but not for everything yet.",
    "Before we begin, let's have a quick refresher of what Dolby Vision is. Dolby Vision is an HDR format that allows for superior contrast and color accuracy. It supports 12-bit color, enabling the console to display more than 68.7 billion colors, far more than the 10-bit HDR format could show.",
    "Right now, Dolby Vision is supported on streaming video apps, like Netflix and Disney Plus, on the Xbox Series X.",
    "However, the same support is not coming to games until later in 2021, according to Xbox. This isn't ideal if you were hoping to make the most of Dolby Vision straight away, but at least it's on its way – which is more than can be said for Blu-ray.",
    "Disappointingly, Dolby Vision support is not extending to 4K Blu-ray playback at all. This would be a bit of a shame to find out with any 4K Blu-ray player, but especially here with the Xbox Series X, as Dolby Vision is partially supported.",
    "Could Dolby Vision support come to 4K Blu-ray playback on the Xbox Series X in the future? Possibly with a firmware update, but we wouldn’t expect this any time soon.",
    "Importantly, you will also need a TV that supports Dolby Vision as well – this isn’t just about the console’s specs. The Xbox team has created this useful guide that helps you figure out if your current TV set-up is capable of making the most of the console’s visual and audio enhancements.",
    "The Xbox Series X supports a number of different sound formats, including Dolby Atmos, DTS:X and Windows Sonic.",
    "The default headphones setting is Windows Sonic. This is fine for those who aren’t too fussed about their audio, but Dolby Atmos and DTS provide a fuller spatial sound experience, meaning, for example, that you can tell from an enemy’s footsteps exactly where they are in relation to you.",
    "That means if you’re someone who plays a lot of online multiplayer then it could be worth picking up Dolby Access, which enables you to start a free trial of Dolby Atmos for Headphones or set up a Dolby Atmos device.",
    "It’s also worth noting that these sounds formats only work with games which support Dolby Atmos or DTS sound, which include the likes of Gears 5, Forza Horizon 4 and Rise of the Tomb Raider.",
    "Again, you will need a TV that supports Dolby Atmos and you'll need to enable it via the Xbox Audio settings page."
  ],
  "headers": {
    "5": "Does the Xbox Series X support Dolby Vision?",
    "12": "Does the Xbox Series X support Dolby Atmos?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "where to buy Xbox Series X": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "where to buy Xbox Series S": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Xbox": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-3464117152693739000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2020%2F11%2F06%2Fis-your-tv-ready-to-power-your-dreams%2F",
    "4K Blu-ray player": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "this useful guide": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4534209881063747000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2020%2F11%2F06%2Fis-your-tv-ready-to-power-your-dreams%2F",
    "DTS:X": "https://www.techradar.com/news/dtsx-vs-dolby-atmos-vs-dts-play-fi"
  }
}