{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-5g-leak-suggests-pastel-colors-are-in-for-the-cheap-flagship",
  "title": "Samsung Galaxy S21 FE 5G leak suggests pastel colors are in for the cheap flagship",
  "category": "phones",
  "updated": "2021-07-02T05:19:35Z",
  "author": "david-lumb",
  "summary": "Also, the Samsung S21 FE may pack regionally-different chipsets",
  "article": [
    "We’ve gotten another look at the Samsung Galaxy S21 FE thanks to a leak showing off alleged marketing renders with the phone in plenty of colors. We’ve also seen a rumor suggesting the phone will come in multiple chipsets, though you can probably expect why.",
    "We’ve seen these colors before – in fact, noted leaker Blass showed them off in renders already – but the new leak from Android Headlines shows them all in what looks like an official marketing image, adding more evidence that this could be the final array of colors for the upcoming affordable flagship. Those colors will allegedly be a (very dark) gray, white, light violet, and white, with possibly a fifth color (which other leaks suggest will be a blue-ish hue).",
    "The new leak affirms a more streamlined design in the S21 FE than the original S21 line, with a camera block the same color as the back of the phone. But unlike previous renders, which show a protruding camera bump, Android Headlines’ models seem to show a thinner block. Whether that’s a trick of the angles in the photo or just the nature of pre-release renders that don’t necessarily reflect the final design is hard to tell.",
    "But the newly-leaked renders do support the general design we’ve seen in previous leaks: a triple rear camera with an adjacent flash. There isn’t any new information on what those cameras will be, and we don’t have rumors outside of a 32MP front-facing camera.",
    "Via PhoneArena",
    "A separate new rumor spotted by SamMobile suggests that the Samsung Galaxy S21 FE will not just use the Snapdragon 888. S21 phones sold in the US and Europe will use Qualcomm’s Snapdragon chipset, while versions sold in other markets will pack Samsung’s own Exynos 2100 silicon.",
    "This isn’t too surprising given that both chipsets were used in the Samsung Galaxy S21 series of phones, with different regions getting different silicon: S21 phones sold in the US and China featured the Snapdragon 888, while those sold elsewhere used the Exynos 2100. The new rumor doesn’t specify which other countries will feature the latter in the S21 FE, but if it follows its previously-released flagship sibling, we wouldn’t be shocked.",
    "We’ll have to wait and see whether this bears truth when the phone is released, though rumors differ on when that will be: one suggests the S21 FE will launch in August alongside other expected devices like the Samsung Galaxy Z Flip 3 and the Samsung Galaxy Z Fold 3, while another hints its launch has been pushed back until October – and a third warns that the phone could have been canceled entirely due to the global chip shortage."
  ],
  "headers": {
    "5": "Chipset rumors: not just the Snapdragon 888?"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "showed them": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-reveals-full-design-in-a-range-of-colors",
    "Android Headlines": "https://www.androidheadlines.com/exclusive-samsung-galaxy-s21-fe-colors",
    "front-facing camera": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked",
    "PhoneArena": "https://www.phonearena.com/news/samsung-galaxy-s21-fe-5g-marketing-images-leak_id133111",
    "SamMobile": "https://www.sammobile.com/news/galaxy-s21-fe-snapdragon-888-exynos-2100/",
    "suggests": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-and-z-fold-3-foldables-tipped-to-launch-in-august",
    "pushed back": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "canceled": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-be-canceled-according-to-mysterious-report"
  }
}