{
  "source": "https://www.techradar.com/news/is-microsoft-defender-good-enough-for-your-pc",
  "title": "Is Microsoft Defender good enough for your PC – or do you need a better free antivirus?",
  "category": "computing",
  "updated": "2021-02-24T09:22:34Z",
  "author": "darren-allan",
  "summary": "How good a job does Defender do in defense, exactly?",
  "article": [
    "Microsoft Defender was once regarded as a poor means of protecting your PC from malware. However, that’s very much in the past now, and Microsoft’s antivirus which comes integrated with Windows 10 (it used to be known as Windows Defender) has built itself a better reputation these days.",
    "The key question is how much better, though? And is Microsoft Defender really a viable solution for keeping your system free of the various bits of nastiness which are floating around online? Or should you really download another free third-party antivirus app to give yourself a tighter defense against malware?",
    "As mentioned, Microsoft Defender is now looked upon as a much stronger contender in the free antivirus world than it was in the past, something that’s clearly reflected in the latest evaluations by the major independent labs that regularly test antivirus apps.",
    "In AV-Comparatives’ July-October 2020 Real-World Protection Test, Microsoft performed decently with Defender stopping 99.5% of threats, ranking 12th out of 17 antivirus programs (achieving a robust ‘advanced+’ status). And there were better findings from AV-Test, where Microsoft Defender has scored full marks in the past four tests (which took place over the course of 2020).",
    "SE Labs also found Defender had a total accuracy rating of 99%, placing it 5th out of a field of 13 in its home anti-malware protection report for Q4 2020 – a very respectable result.",
    "So the overall picture is that Microsoft Defender is now more than solid in terms of defending against malware threats – which is great to see – but the caveat is that it’s still not as good as some free offerings.",
    "In short, while Microsoft Defender might be very solid these days – more than solid, actually – it’s still not the ultimate free antivirus option out there. That's a plaudit reserved for Avira.",
    "Still, another major benefit of Microsoft Defender is that it’s fully integrated with Windows 10. It’s a no-effort solution that’s just there from the get-go within Microsoft’s OS, ready to protect you and provide robust defenses as we’ve just outlined.",
    "For less tech-savvy folks who may not even really be sure what an antivirus is or does, having a decent baseline form of protection by default in Windows is definitely a very good thing; there can be no argument on that score.",
    "However, if you can easily get somewhat better protection by downloading a superior free third-party antivirus, then the other argument is that you should do so. After all, how difficult is it to go through a quick download process, and a fairly simple installation? Most of the free antivirus apps out there are far from tricky to get up and running – so why not do so?",
    "Another potential minor sticking point that some folks might flag up with Microsoft Defender – particularly those who watch the tech news headlines like a hawk – is the occasional story that pops up about Microsoft unintentionally causing errors with its antivirus program.",
    "As we’ve seen in recent times, Microsoft has a bad habit of breaking things with updates for Windows 10, problems which have sometimes had a knock-on effect of torpedoing Defender in some way. In that respect, Microsoft still has a reputational problem here of sorts, although it’s a more general one.",
    "There’s more to an antivirus than its core anti-malware defenses, of course, and Microsoft Defender protects you in other ways. That includes a basic firewall, some additional anti-exploit measures, and a system of parental controls which has been improved in recent times (you can do things like specify how much time your children are allowed to spend online, for example).",
    "However, there’s not that much here, and some other free antivirus apps offer more in the way of extras – Avira Free Antivirus, for example, boasts a password manager, secure file shredder and other bits and pieces – plus rivals offer better fleshed out extras, too. For example, when it comes to Defender’s parental controls, the browser content filtering options are only available for Microsoft’s own Edge browser (when Chrome is by far the dominant player in the web browser world). Avira Free gives you web protection for Chrome, Firefox, Edge and also Opera.",
    "The short answer is, yes... to an extent. Microsoft Defender is good enough to defend your PC from malware on a general level, and has been improving a lot in terms of its antivirus engine in recent times.",
    "That said, there are still free antivirus apps out there which offer better levels of protection, or more features (with improved levels of depth); or indeed all of the above. Given how simple a task it is for the majority of users to go through the process of installing a different third-party antivirus, it’s worthwhile doing that to avail yourself of these benefits.",
    "Probably the trickiest issue in terms of using another third-party antivirus will be choosing which one to go for, but of course we’ve done all the hard work for you there – just look at our best free antivirus recommendations."
  ],
  "headers": {
    "2": "Big improvements",
    "7": "Seamless integration",
    "12": "Feature set",
    "14": "Is Microsoft Defender good enough for your PC?"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Microsoft Defender": "https://www.techradar.com/reviews/windows-defender",
    "free antivirus": "https://www.techradar.com/best/best-antivirus#best-free-antivirus-downloads",
    "bad habit of breaking things": "https://www.techradar.com/news/windows-10-update-is-reportedly-causing-serious-problems-that-prevent-pcs-from-starting",
    "Avira Free Antivirus": "https://www.techradar.com/reviews/avira-2020-antivirus-solutions#section-avira-free-antivirus",
    "best free antivirus": "https://www.techradar.com/best/best-antivirus#best-free-antivirus-downloads"
  }
}