{
  "source": "https://www.techradar.com/news/russian-doll-is-the-perfect-netflix-show-for-our-repetitive-times",
  "title": "Russian Doll is the perfect Netflix show for our repetitive times",
  "category": "entertainment",
  "updated": "2021-02-21T11:00:18Z",
  "author": "henry-st-leger",
  "summary": "Time? What a concept!",
  "article": [
    "Time is a funny thing. Sometimes it goes fast, sometimes it goes slow, and sometimes it just seems to repeat itself every time you fall down the stairs.",
    "I’m talking, of course, about the hit Netflix show Russian Doll – the smart-mouthed time-travel romp through modern-day New York, where the cynical video game designer Nadia Vulvokov (played so effectively by Orange is the New Black’s Natasha Lyonne) seems cursed to repeat the same day over and over again every time she dies.",
    "It’s been a while since Russian Doll was really in the news. After launching in 2019 to much fanfare, and a second season being confirmed shortly thereafter, there’s no word on when more Russian Doll episodes are coming to our screens. That’s a shame, given how eagerly fans of the show are expecting Nadia’s return, but it’s fitting that the first season is always there, waiting to be relived all over again.",
    "I’m of the opinion that Russian Doll has never felt more relevant than now, at a time when our lives lack variation, and most of us are condemned to look at the same walls, ceilings, and surroundings every single day.",
    "The time travel premise used in Russian Doll was really first set out in 1993’s Groundhog Day, where a nihilistic news reporter is forced to relive the same day in a sleepy American town until he starts to appreciate and see the joy in its humdrum encounters and miniature dramas.",
    "It takes Russian Doll, though, to push this premise to a new level. It follows a game designer caught in a time loop that doesn’t restart at dawn so much as go back to a checkpoint every time she dies – and die she does. You’ll see Nadia fall down the stairs of her apartment block, get hit by a car or bus, or even freeze in the cold as she pushes the limits of her quantum confinement to new places.",
    "I won’t spoil too much for new (or forgetful) viewers, but the genius of the show is in how broadly it ties in different philosophies and schools of thought, whether religious, scientific, or otherwise – and it’s Nadia’s own experience as a game designer that gives her the biggest lightbulb moments, using a modern understanding of gameplay loops or software bugs to enlighten and enhance the Groundhog Day formula. (It seems somewhat fitting that Natasha Lyonne credits a computer algorithm for the show’s success too.)",
    "There is a real vigor to the way the Netflix show repeats the same camera shots, snippets of dialogue, or environments – turning what should be stale into a deepening understanding of Nadia's life, home, and relationships every time she restarts her day.",
    "Near-identical conversations become thrilling for the slight variations, and how they spin into new narrative arcs – inevitably cut short, deleted and restarted, for Nadia to try again.",
    "It’s not all hopeless, though – it’d be a difficult eight episodes otherwise – and Russian Doll finds a way to make the repetition thrilling, even turning it into a catalyst for change.",
    "And that’s a sentiment I think we could all use right now.",
    "You can watch the trailer for Russian Doll season one below:"
  ],
  "headers": {
    "4": "Method in the madness"
  },
  "links": {
    "Netflix show": "https://www.techradar.com/best/best-netflix-shows",
    "credits a computer algorithm for the show’s success too": "https://www.techradar.com/news/russian-doll-star-thanks-netflix-algorithm-for-the-shows-success"
  }
}