{
  "source": "https://www.techradar.com/news/final-fantasy-creators-diorama-like-mobile-game-fantasian-finally-revealed-in-trailers",
  "title": "Final Fantasy creator’s diorama-like mobile game Fantasian finally revealed in trailers",
  "category": "gaming",
  "updated": "2021-03-03T09:59:33Z",
  "author": "david-lumb",
  "summary": "Fantasian’s diorama worlds come alive in a pair of trailers",
  "article": [
    "There’s been a lot of hype for Final Fantasy co-creater Hironobu Sakaguchi’s and studio Mistwalker’s upcoming Apple Arcade game, Fantasian, and its beautiful diorama-based settings. But now we’ve gotten a peek at the story and gameplay in a pair of new trailers.",
    "The ‘Features’ trailer peels back the cover a bit on the locales, which are actually around 150 models built by hand and scanned into the game, making it look like it’s set in a realm of miniatures that adds tactility to an otherwise digital experience.",
    "The Features trailer also shows how the combat and other gameplay will look – namely combat, which follows RPG convention with party characters lined up on one side of the screen taking turns attacking monsters on the other. Of course, if you want to deal with the monsters later, you can turn on the ‘Dimengeon System,’ which collects encountered enemies in a so-called dimengeon (dungeon dimension) which players can dive into to fight them all at once.",
    "The ‘Story’ trailer is less substantial – really a series of clips without dialogue or context – so you’ll have to interpret what’s happening for yourself:",
    "The video’s description explains more of the story: players take the role of Leo, who wakes in a strange land with only a lone memory for company. To restore the rest, he and his friends will have to solve the mystery of a strange mechanical infection slowly spreading all over the world – a story written by Sakaguchi and scored by Final Fantasy legend Nobuo Uematsu.",
    "Fantasian was originally announced as an Apple Arcade exclusive in late 2019, but we hadn’t heard much about it since – until a month ago, when Sakaguchi started tweeting out images of the dioramas that the game’s environments are based on.",
    "Now we’ve seen some of these diorama-built settings in action in the above trailers, miniature sets built by special effects veterans of Godzilla films, Attack on Titan, and Ultraman, the Features trailer description states.",
    "The game is expected to come out in May 2021, and will be an Apple Arcade exclusive, playable on iPhones, iPads, Macs, and Apple TVs."
  ],
  "headers": {
    "5": "Fantasian: details at last"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
    "announced": "https://twitter.com/mistwalker/status/1110423384356057088",
    "tweeting": "https://www.techradar.com/news/final-fantasy-creators-fantasian-is-made-with-real-models-and-its-gorgeous"
  }
}