{
  "source": "https://www.techradar.com/news/ibm-cloud-satellite-brings-secure-hybrid-cloud-services-to-any-environment",
  "title": "IBM Cloud Satellite brings secure hybrid cloud services to any environment",
  "category": "computing",
  "updated": "2021-03-04T20:39:27Z",
  "author": "anthony-spadafora",
  "summary": "Access hybrid cloud services on any cloud, on premises or at the edge",
  "article": [
    "IBM customers will now be able to use its hybrid cloud services from any environment and on any cloud, on premises or even at the edge with the launch of IBM Cloud Satellite.",
    "The tech giant also worked with Lumen Technologies to integrate its new offering with the Lumen edge platform enable customers to harness hybrid cloud services in near real-time and build innovative solutions at the edge.",
    "IBM Cloud Satellite brings a secured, unifying layer of cloud services for clients across environments regardless of where their data resides which can help address critical data privacy and data sovereignty requirements especially in industries such as telecommunications, financial services, healthcare and government. Organizations operating in these industries can now benefit from the reduced latency that comes from analyzing data securely at the edge.",
    "At the same time, IBM is also extending Watson Anywhere with the release of the IBM Cloud Pak for Data as a Service with IBM Cloud Satellite. This provides customers with a flexible and secure way to run their AI and analytics workloads as services across any environment without having to manage them on their own.",
    "The enterprise technology company Lumen using its Edge Compute platform to deliver IBM Cloud Satellite to its customers. By combining the flexibility of IBM's new offering with the broad availability, adaptive networking and connected security capabilities of the Lumen edge platform, Lumen's customers gain both choice and speed in how they securely tap into the benefits of edge computing services.",
    "Customers using the Lumen platform and IBM Cloud Satellite can deploy data-intensive applications such as video analytics across highly distributed environments including offices and retail spaces while taking advantage of infrastructure designed for single digit millisecond latency. As applications can be hosted on Red Hat OpenShift via IBM Cloud Satellite from the close proximity of a Lumen edge location, cameras and other sensors can function in near real-time to help improve quality and safety.",
    "SVP of enterprise product management and services at Lumen, Paul Savill explained how the combination of its platform and IBM Cloud Satellite can allow customers to drive innovation at the edge in a press release, saying:",
    "\"With the Lumen platform's broad reach, we are giving our enterprise customers access to IBM Cloud Satellite to help them drive innovation more rapidly at the edge. Our enterprise customers can now extend IBM Cloud services across Lumen's robust global network, enabling them to deploy data-heavy edge applications that demand high security and ultra-low latency. By bringing secure and open hybrid cloud capabilities to the edge, our customers can propel their businesses forward and take advantage of the emerging applications of the 4th Industrial Revolution.\"",
    "IBM is also collaborating with more than 65 ecosystem partners including Cisco, Dell Technologies and Intel to build secure cloud services that help customers run workloads in any environment via IBM Cloud Satellite."
  ],
  "headers": {
    "4": "IBM Cloud Satellite"
  },
  "links": {
    "IBM": "https://www.techradar.com/news/ibm-snaps-up-taos-in-latest-cloud-push",
    "hybrid cloud": "https://www.techradar.com/news/what-is-hybrid-cloud",
    "data privacy": "https://www.techradar.com/news/the-evolution-of-data-privacy",
    "data sovereignty": "https://www.techradar.com/news/internet/cloud-services/are-national-clouds-the-solution-for-data-sovereignty-issues-1283499",
    "Watson Anywhere": "https://www.techradar.com/news/ibm-frees-watson-ai-to-work-on-any-cloud",
    "IBM Cloud Pak": "https://www.techradar.com/news/ibm-is-making-all-its-software-cloud-native-following-red-hat-deal",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Red Hat OpenShift": "https://www.techradar.com/news/red-hat-and-ibm-launch-hybrid-cloud-software-marketplace",
    "press release": "https://newsroom.ibm.com/2021-03-01-IBM-Cloud-Satellite-Enables-Clients-to-Deliver-Cloud-Securely-in-Any-Environment-Including-at-the-Edge"
  }
}