{
  "source": "https://www.techradar.com/news/intel-joins-forces-with-asus-to-launch-its-first-iris-xe-desktop-graphics-cards",
  "title": "Intel joins forces with Asus to launch its first Iris Xe desktop graphics cards",
  "category": "computing",
  "updated": "2021-01-26T16:44:37Z",
  "author": "carly-page",
  "summary": "The DG1 graphics will be available in pre-built systems",
  "article": [
    "Intel has announced that its long-awaited Iris Xe graphics cards have finally begun shipping to OEMs.",
    "In its announcement, which comes months after the launch of Iris Xe Max GPU for laptops, Intel confirmed that the first Iris Xe graphics cards are now available for desktop systems.",
    "However, it won’t be that easy to get your hands on one. Intel is shipping the “entry-level” graphics cards to system builders who will use the Iris Xe in PCs aimed at mainstream users and small businesses, which means the cards can't be purchased separately.",
    "The chipmaker has already signed up two ecosystem partners - Asus and Colorful - with more likely to join in the near future.",
    "Intel said it and “its partners saw the opportunity to better serve the high-volume, value-desktop market with improved graphics, display and media acceleration capabilities.”",
    "The Intel Iris Xe - codenamed DG1 - is based on the 10nm SuperFin architecture. Oddly, the desktop cards feature slightly lower specification than the laptop parts, with Intel confirming that Iris Xe discrete graphics cards come with 80 execution units, rather than 96. Clock speeds haven’t yet been revealed, but the Iris Xe Max is clocked at 1,650MHz.",
    "Like its laptop counterpart, Iris Xe features 4GB of LPDDR4X memory across a 128-bit bus interface.",
    "Intel has also confirmed that the cards will ship with up to three display outputs, with Asus' card using a mix of HDMI, DisplayPort, and a DL-DVI-D port.",
    "Given the OEM-centric nature of Intel's Iris Xe announcement, the company hasn't revealed any specific availability dates. However, with the graphics cards now shipping to partners, they're likely to show up in PC systems starting any day now."
  ],
  "headers": {},
  "links": {
    "announcement": "https://newsroom.intel.com/articles/intel-releases-iris-xe-desktop-graphics-cards/#gs.r7ibuk",
    "the launch of Iris Xe Max GPU for laptops": "https://www.techradar.com/news/intel-iris-xe-max-gpu-is-launched-helping-thin-laptops-deliver-impressive-gaming",
    "DG1": "https://www.techradar.com/news/we-played-destiny-2-on-the-intel-xe-dg1-at-ces-2020"
  }
}