{
  "source": "https://www.techradar.com/news/when-will-ps5-restock-next-best-buy",
  "title": "It's been 10 days since the last PS5 restock – what it means for consumers",
  "category": "gaming",
  "updated": "2021-12-09T10:45:26Z",
  "author": "matt-swider",
  "summary": "Our PS5 restock prediction that there'd be an 'October deadline' was in fact accurate. Here's what's next.",
  "article": [
    "There's been no major PS5 restock news in the US for 10 days, a first for 2021, and the lack of a recent restock (the Best Buy Totaltech PS5 restock today doesn't count) has driven PS5 demand through the roof in October 2021.",
    "It's not unusual for PS5 to be sold out around the country. The Sony console is often in stock for just a few minutes each week, but that 'PS5 for sale' sign quickly vanishes as millions of consumers try to upgrade from the PS4 to PS5 – all at the same time.",
    "What's different is that no major and small retailer in the US has had the PS5 in stock since almost two Fridays ago, when a Best Buy PS5 restock took place on October 1. During that PS5 restock date, a few were able to beat bot-using resellers, who scooped up the console before average consumers could get them.",
    "There was a Best buy PS5 restock today for Totaltech members, but memberships to that program start at $199. Only a few who had a year-long trial membership from last Black Friday got the console. For others, it's just not worth it.",
    "Best Buy, Walmart and, to some extent, Amazon (which typically restocks on the 21st of the month) have been most popular with PS5 restock seekers. These three retailer stores have the most inventory, according to our sources. But they're also the most difficult to purchase from because of that popularity.",
    "That's how GameStop PS5 restocks became the best source to buy PlayStation 5 along with Antonline. PS5 bundles last longer simply because resellers skip on the restock inventory because they have a harder time marking up readily available PS5 games and accessories.",
    "We're at 10 days since the last PS5 restock today, and that's never happened before in the US since Sony launches the PlayStation 5 in November 2020.",
    "Yes, we've gone stretches of time without the $499 PS5 Disc (the version of the console we highly recommend as it'll save you more money in the long run). But at least there were $399 PS5 Digital consoles available at some point in time.",
    "Best Buy had the last PS5 restock during the afternoon of Friday, October 1, its first PS5 restock since the rare in-store PS5 restock event on September 23, 2021. During our in-person reporting, we learned that most stores had about 53 PS5 Disc consoles available to purchase among 301 Best Buy stores in the United States.",
    "There are obvious reasons for the waning PS5 restock supply in 2021, including the well-known global chip shortage. However, according to our exclusive retail sources, there are two other reasons we aren't seeing the Sony console in stock.",
    "The first involves waiting to release stock until there's enough, a tactic most retailers in the US follow. While the decision remains to always make PS5 for sale as soon as possible, stores do wait until they have enough PS5 stock on hand.",
    "\"We need to wait until we have enough [PS5 consoles] due to demand. Otherwise your followers strip our supply in seconds,\" one retail source told us anonymously in a text message.",
    "This wait-to-resupply procudre has become common. That magic number varies by retailer size – it's anywhere from 1,500 for a smaller store to 50,000 for major retail chains.",
    "Second, we've also been told that some specific consoles in high demand are behind held back artificially in rare cases. The Halo Infinite Xbox Series X, for example, won't launch until November 15 and while Walmart, GameStop and Microsoft have all sold the limited edition console, other retailers have expressed a desire to tie it until early Black Friday deals.",
    "The thinking is that holding back some consoles will lure consumers into checking out with games and accessories they'd be more willing to buy in mid-November rather than August, September or October.",
    "It seems as if Best Buy is going to pivot between online PS5 restock dates and in-store restock events, exactly like it currently does with GPU stock.",
    "However, according to our sources, online restocks will remain more frequent due to health and safety concerns. While the PS5 restock at Best Buy in late September was mostly civil when people camped out overnight, graphics cards remain harder to find in stock, so much so that fight fights actually broke out in select US cities.",
    "Retailers are going to want to avoid that chaos, especially as people become more desperate to obtain a prized PS5 console before Christmas.",
    "Finally, retailers are following the GameStop model of requiring memberships for PS5 console sales. After all, while the $499 console seems pricey to some consumers, the known secret is that retailers make little to nothing off of console sales. It's the games and accessories where they see real profit.",
    "So when GameStop started forcing bundles and charging $15 a year (not monthly) for its PowerUp Reards Pro membership, others started following suit. Gamefly, which only occasionally has PS5 in stock, requires people to be members to its game retnal service for 30 days.",
    "The newest on the block is Best Buy with its Totaltech membership for $199. Paying that fee yearly allows for discounts to its Geeksquad IT support help and access to consoles that aren't in stock for non-paying consumers. It's a lofty price to pay for priority access to the $499 PS5."
  ],
  "headers": {
    "6": "10 days since the last PS5 restock",
    "9": "Why there's a long wait for the next PS5 restock",
    "15": "PS5 in-store or online restock dates?",
    "18": "The package deal for a PS5 restocks"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "GameStop PS5 restocks became the best source to buy PlayStation 5": "https://www.techradar.com/news/gamestop-best-ps5-restock-source-in-2021",
    "global chip shortage": "https://www.techradar.com/news/ps5-in-stock-august-2021"
  }
}