{
  "source": "https://www.techradar.com/news/windows-10-now-runs-multiple-android-apps-with-your-phone",
  "title": "Windows 10 now runs multiple Android apps with Your Phone",
  "category": "computing",
  "updated": "2021-01-30T11:19:59Z",
  "author": "darren-allan",
  "summary": "App mirroring on the desktop has moved from testing to rolling out officially",
  "article": [
    "Microsoft’s Your Phone app now allows for the opening of multiple Android apps on your Windows 10 desktop, instead of just one application – if you have a supported Samsung handset, that is.",
    "As you may recall, this feature was implemented in testing back in November 2020, after official support for running a single Android app arrived in September. However, multiple apps are now officially supported, if you have certain models of more recent Samsung phones.",
    "The full list of supported Samsung handsets can be found here, and bear in mind you must also be running Windows 10 May 2020 Update or better when it comes to your PC. You’ll also need Your Phone app version 1.20102.132.",
    "Furthermore, to run multiple apps, Android 11.0 is required on your (supported Samsung) phone, as well as the Link to Windows app (version 1.20102.133.0). Finally, you’ll need Link to Windows Service app version 2.1.05.2 or better (from the Galaxy Store), as MS Power User makes clear. Oh, and naturally enough, your PC and phone need to be on the same Wi-Fi network for any Your Phone shenanigans.",
    "Running Android apps on your Windows 10 desktop is a nifty feature indeed, and using more than one simultaneously is a further boon, although many people are still unhappy that this is a Samsung-only feature when it comes to phones.",
    "From what we heard from Microsoft at the end of last year, that situation won’t change anytime in the near future, but it might do eventually. Getting it to work is not a trivial endeavor by any means, but Microsoft has said it’s exploring new ways to bring Your Phone features to other handsets besides Samsung models, so we can keep our fingers crossed.",
    "Meanwhile, the Your Phone app recently had another feature added, albeit just in testing, namely the ability to check your phone’s signal strength and Wi-Fi strength, as well as battery level, at a glance on the desktop. At the moment, this feature has only rolled out to a limited set of testers, though."
  ],
  "headers": {
    "4": "Other phones?"
  },
  "links": {
    "Your Phone": "https://www.techradar.com/news/microsoft-launches-your-phone-letting-android-users-connect-to-windows-10-pcs",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "implemented in testing back in November 2020": "https://www.techradar.com/news/windows-10-can-run-multiple-android-apps-via-your-phone-but-this-feature-will-remain-samsung-only",
    "arrived in September": "https://www.techradar.com/news/windows-10-running-android-apps-via-your-phone-is-fully-rolled-out-and-the-feature-will-soon-get-even-better",
    "here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-7975725972069712000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Fhelp%2F4551890%2Fsupported-devices-for-your-phone-experiences",
    "MS Power User": "https://mspoweruser.com/microsoft-your-phone-android-apps-windows/",
    "From what we heard from Microsoft": "https://www.techradar.com/news/windows-10-can-run-multiple-android-apps-via-your-phone-but-this-feature-will-remain-samsung-only",
    "added": "https://mspoweruser.com/windows-10-your-phone-app-wifi-indicator/"
  }
}