{
  "source": "https://www.techradar.com/news/intel-phantom-canyon-nuc-now-features-a-tiger-lake-cpu-and-an-nvidia-rtx-2060",
  "title": "Intel Phantom Canyon NUC now features a Tiger Lake CPU and an Nvidia RTX 2060",
  "category": "computing",
  "updated": "2021-01-14T15:56:32.046Z",
  "author": "carly-page",
  "summary": "Intel's NUC 11 lineup targets gamers with upgraded specs",
  "article": [
    "Intel has launched its next-generation NUC based on its 11th-generation Tiger Lake processors.",
    "The chipmaker has shown off four new mini PC systems in total, with the flagship model arriving in the form of the Intel NUC 11 Enthusiast ‘Phantom Canyon’.",
    "The pint-sized PC, which Intel claims is designed for \"high-end gaming\", is based on a quad-core Intel Core i7-1165G7 processor, which comes paired with 16GB of DDR4 memory, an Nvidia RTX 2060 discrete GPU with 6GB of GDDR6 memory, and Intel Optane Memory H10 (32GB + 512GB).",
    "The NUC 11 Enthusiast, which is follow-up to Intel’s Skull Canyon NUC, also packs two Thunderbolt 4 ports, six USB 3.1 Type-A ports, an HDMI 2.1 port, and a MiniDisplayPort 1.4 for connecting up to four displays. There’s also a headset jack and SD card reader on the front of the PC.",
    "Intel has also launched the NUC 11 Performance, a mainstream PC that features a Core i3-1115G4, Core i5-1135G7 or Core i7-1165G7 processor, with the latter two options also including Intel Iris Xe graphics.",
    "The PC, which is available in both kit and Mini PC formats, also offers up to 64GB of memory, Thunderbolt ports on both the front and rear and a Qi-compatible wireless charging lid.",
    "Next up is the Intel NUC 11 Pro, a mini PC designed for business. Codenamed Tiger Canyon, the device supports Intel vPro technology for remote management and hardware-based security, and ships with optional Dual LAN.",
    "Finally, Intel announced the Intel NUC 11 Compute Element, a tiny board aimed at system builders. The Compute Element features either an 11th-generation gen Intel Core i3, i5, and i7 processor, support for up to 16GB memory, and support for Thunderbolt 4 connectivity.",
    "Intel has yet to announce pricing and availability details for its new NUC lineup, although the NUC 11 Enthusast is up for pre-order at SimplyNUC for $1,349 (£990, AU$1,740) with a March shipping date."
  ],
  "headers": {},
  "links": {
    "11th-generation Tiger Lake processors": "https://www.techradar.com/news/intel-tiger-lake",
    "Nvidia RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "Intel’s Skull Canyon NUC": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/intel-skull-canyon-nuc-1322597/review",
    "SimplyNUC": "https://simplynuc.com/phantom-canyon/"
  }
}