{
  "source": "https://www.techradar.com/news/nokia-t20-could-launch-soon-as-one-of-the-best-cheap-tablets",
  "title": "Nokia T20 could launch soon as one of the best cheap tablets",
  "category": "tablets",
  "updated": "2021-07-30T09:57:48Z",
  "author": "jitendra-soni",
  "summary": "With a 10.36-inch screen",
  "article": [
    "While the last year and a half has adversely impacted the technology industry, it has proven to be a phoenix moment for Android tablets. Once down, out and forgotten by almost all brands apart from Samsung, Android tablets could soon be a thing again thanks to increasing demand for large-screened devices for remote learning and media consumption.",
    "The latest to join the bandwagon is HMD Global, which is reportedly working on a new Android Tablet to be released under the Nokia brand. The upcoming tablet is seemingly named the Nokia T20, and it's been spotted on multiple retailer websites, revealing possible specs and prices.",
    "NokiaMob found listings for both 4G and Wi-Fi-only models on morecomputers.com, and these listed a 10.36-inch screen, 64GB of storage, and a blue color scheme.",
    "Going by the retailer's listings, the 4G variant of the Nokia T20 tablet could be priced at £202 (around $280 / AU$380 / Rs. 20,900), while the Wi-Fi-only variant is expected to be slightly cheaper and could retail for £185 (roughly $260 / AU$350 / Rs. 19,190).",
    "NokiaPowerUser meanwhile spotted both versions of the slate on a different retailer's site, with the same specs and almost identical prices.",
    "While we'd take these listings with a pinch of salt, this isn't the first sign of the Nokia T20, as a Nokia tablet was previously spotted on a Russian certification website, so it's looking likely that one is on the way - though it's possible that some of the specs or prices here could be wrong.",
    "We mentioned above that Android tablets have been having a rough time, with Samsung being among the few brands to have much success, but that company largely deals in mid-range and high-end tablets.",
    "At the low-end, there's very little to choose from on the Android front, and even if you widen your search to other operating systems it's mostly just Amazon that seems to be pumping out decent budget slates at a regular rate, so some alternatives would be good.",
    "There are plenty of great options in the mid-range and high-end segments (even if they mostly only come from two or three companies) but if you want an affordable slate and don't want it to run Amazon's Fire OS then you might find yourself a bit stuck.",
    "If the Nokia T20 is really as cheap as store listings suggest - and if it's any good - then HMD Global could have found a profitable niche in the market. We hope so, and that this is the first of many affordable Android tablets to come."
  ],
  "headers": {
    "6": "Analysis: more low-end tablet variety can only be a good thing"
  },
  "links": {
    "adversely impacted": "https://www.techradar.com/news/covid-19-second-wave-havoc-indias-smartphone-market-falls-13-in-q2",
    "Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "NokiaMob": "https://nokiamob.net/2021/07/28/nokia-t20-hmd-globals-first-tablet-coming-with-10-36-display-uk-prices-out/",
    "both 4G": "https://www.morecomputers.com/a?pid=F20RID1A016%3E%3ENokia",
    "Wi-Fi-only models": "https://www.morecomputers.com/a?pid=F20RID1A012%3E%3ENokia",
    "NokiaPowerUser": "https://nokiapoweruser.com/nokia-mobiles-tablet-nokia-t20-coming-soon-size-pricing-revealed-via-retailer-listings/"
  }
}