{
  "source": "https://www.techradar.com/news/apple-mightve-accidentally-leaked-new-beats-true-wireless-earbuds-in-latest-ios-code",
  "title": "Apple might've accidentally leaked new Beats true wireless earbuds in latest iOS code",
  "category": "audio-visual",
  "updated": "2021-05-17T22:44:12Z",
  "author": "nick-pino",
  "summary": "The Beats Studio Buds could be coming our way soon in three different colors",
  "article": [
    "We could be getting a new pair of Beats true wireless earbuds sometime in the near future – in fact, we’d say it’s almost definitely going to happen.",
    "How can we be so sure? Information on the previously unannounced Beats Studio Buds appeared today in Apple’s latest beta software for tvOS and iOS. There’s even images of them in three different colors: red, white and black.",
    "The earbuds were spotted by Apple-focused publications MacRumors and 9to5Mac, both of which discovered images and animations for the new models.",
    "According to the information discovered by the outlets, the Beats Studio Buds will support active noise cancellation and will use silicone eartips instead of hard plastic like the Apple AirPods. That said, the Studio Buds won’t feature earhooks like the Powerbeats Pro that was released two years ago and, from what we can see, might utilize the same shorter nozzle that the AirPods Pro uses.",
    "Apple has yet to publicly confirm the existence of the earbuds, but considering a leak of this size it feels like it’s only a matter of time before it does.",
    "For a random Monday, Apple’s had a mixed day for news: First, it announced that Apple Music would soon offer lossless audio and hi-res audio format music to subscribers at no extra cost…except, according to Apple itself, it won’t work on the Apple AirPods Max.",
    "That would’ve been enough Apple news to fill an afternoon, but now we’ve discovered the existence of the Beats Studio Buds on top of that.",
    "The good news – for Apple at least – is that outside of the images, the animations and some key features of the Beats Studio Buds, we don’t have every detail. Nowhere in the source code did it say how much the earbuds will cost or when they’re due out on store shelves.",
    "Our guess is that they’ll sit somewhere above the Beats Powerbeats Pro in price – potentially between $200 and $249 (£140 and £219 or AU$270 and AU$349) – and will be available sometime in the next two months. With WWDC 2021 just a few weeks away Apple could make an announcement there – but we’ll report back if we hear anything beforehand."
  ],
  "headers": {
    "5": "Apple’s news day: leaks, drips and spills"
  },
  "links": {
    "MacRumors": "https://www.macrumors.com/2021/05/17/beats-studio-buds/",
    "9to5Mac": "https://9to5mac.com/2021/05/17/exclusive-these-are-apples-new-truly-wireless-in-ear-beats-studio-earbuds/",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "offer lossless audio and hi-res audio format music": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "it won’t work on the Apple AirPods Max": "https://www.techradar.com/news/airpods-max-airpods-pro-wont-support-new-apple-music-lossless-audio-but-theres-a-silver-lining",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog"
  }
}