{
  "source": "https://www.techradar.com/news/alienwares-new-gaming-laptops-are-its-thinnest-and-most-powerful-yet",
  "title": "Alienware’s new gaming laptops are its thinnest and most powerful yet",
  "category": "computing",
  "updated": "2021-06-01T05:00:02Z",
  "author": "carly-page",
  "summary": "The Alienware X-series is here",
  "article": [
    "Alienware has debuted its new X-series of gaming laptops, which it claims are its thinnest and most powerful yet.",
    "Unveiled at Computex, the Alienware X15 and Alienware X17 are high-performance gaming laptops that are the first to join the company’s all-new X-series lineup, which Alienware claims is commands an “innovation-first prerogative.”",
    "The Alienware X15 is being billed as the world’s most powerful sub-16mm gaming laptop, while the Alienware X17 is the firm’s thinnest 17-inch notebook to date, measuring in at 20.9mm-thick.",
    "Despite this, the laptops pack powerful internals: both the X15 and X17 come with either an 11th-gen Intel Core i7 11800H or 11900HK processor paired with Nvidia RTX 30-series graphics. The smaller model ships with up to an 8GB Nvidia RTX 3080, while the 17-inch version offers a higher-spec 16GB model.",
    "Alienware claims its Cryo-Tech cooling technology is what has enabled it to make its X-series laptops so thin. This includes an industry-first Client 31 thermal interface that delivers a 25% improvement in thermal resistance, Alienware’s new Quad Fan, and Smart Fan control technology where each individual fan can independently spin-up, slow-down or remain steady.",
    "The laptops are also crafted using magnesium alloy, along with various CNC machined aluminum parts to enable a new level of thinness, according to Alienware.",
    "Beyond their design and powerful innards, the Alienware X15 and X17 laptops also feature qHD 240Hz or FHD 360Hz display panels with built-in hardware-based low blue light technology, along with Alienware’s AlienFX lighting experience with customisable keyboard lighting. Models with Nvidia’s RTX 3080 graphics also include an AlienFX customizable touchpad.",
    "The Alienware X15 and X17 are available starting today in limited configurations, with the laptops starting at $1,999.99 (around £1,400, AU$2,600) and $2,099.99 (around £1,480, AU$2,700), respectively. Full configurations will be available starting June 15."
  ],
  "headers": {},
  "links": {
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Computex": "https://www.techradar.com/news/computex-2021",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}