{
  "source": "https://www.techradar.com/news/dont-get-spooked-this-halloween-stay-safe-with-our-security-hints",
  "title": "Don't get spooked this Halloween - stay safe with our security hints",
  "category": "computing",
  "updated": "2021-10-31T11:21:43Z",
  "author": "techradar-pro",
  "summary": "Stay protected from any security scares this Halloween",
  "article": [
    "It's the spookiest time of the year, with the nights drawing in and the temperature starting to drop.",
    "But inside and away from all the Halloween frights, there's still a risk of getting a significant scare this Autumn when it comes to workplace security. Whether you're still working from home, back in the office, or enjoying a hybrid mix of the two, you still need to be sure you're on the lookout for security issues.",
    "Here's some more of our top tips to making sure you don't get caught out this Halloween - read on if you dare....",
    "Now many of us are splitting our work lives between home and office, juggling the different security needs of all your devices can be a challenge.",
    "Although PCs and laptops are often prioritised when it comes to security, the shift to remote working means there's been a significant need to secure mobile and tablet devices, especially if you're connecting work devices to home networks or vice versa.",
    "Fortunately, Bitdefender Total Security is able to safeguard all your devices, running on Windows, macOS, Android and iOS, including several generations of each software. It can be used to cover up to 15 devices per household, keeping you and your family safe online, whatever threats you face this Halloween.",
    "When it comes to staying safe online, freshening up your security protections can also be a useful way to help clear your mind of extra worry.",
    "The importance of having strong, unique passwords for all of your accounts should be common practice by now, as is keeping these logins different for each account, as hackers only need to get access to one account to potentially crack all the others.",
    "Remembering all of this may sound like a big challenge, but Bitdefender Total Security features an in-built Password Manager service to help you keep track of all your login details, keeping all the information safe from hackers, and giving you one less thing to worry about.",
    "Another essential security tool to boost your protection is a Virtual Private Network, or VPN.",
    "Although you may have already used one in the workplace, a VPN can also keep you safe at home, allowing you not just to disguise your internet connection to put off snoopers, but also allow you to enjoy entertainment and sports streaming services from different countries.",
    "Bitdefender Total Security includes a Secure VPN service that offers complete online privacy - and with a 200MB/day free allowance, you can carry out tasks such as online banking and other sensitive tasks safely.",
    "Now many of us are embracing hybrid working, juggling work and personal devices can be tricky, as despite the convenience of checking your work email when away from the office or your workplace devices, accidentally opening up a scam link or email on your personal devices can have a serious knock-on effect.",
    "Hackers are still pushing large-scale phishing campaigns, where hackers spoof emails or messages from a legitimate company in an attempt to steal login details or personal information. The best course of action if you receive an email that looks or seems suspicious, take a few moments to examine it carefully - phishing messages often contain obvious spelling, imaging or formatting errors, or have clearly malicious links.",
    "Bitdefender Total Security goes beyond typical antivirus and malware blockers to keep you protected from all the latest phishing scams, including dedicated anti-phishing and anti-fraud systems to keep you safe online."
  ],
  "headers": {
    "3": "Don't get caught out - secure all your devices",
    "6": "Try these password tricks",
    "9": "Treat yourself to a VPN",
    "12": "Don't lose your head"
  },
  "links": {
    "Bitdefender Total Security": "https://www.bitdefender.co.uk/solutions/total-security.html"
  }
}