{
  "source": "https://www.techradar.com/news/new-macbook-pro-too-expensive-try-these-stunning-dell-xps-13-deals-from-dollar68599",
  "title": "New MacBook Pro too expensive? Try these stunning Dell XPS 13 deals from $685.99",
  "category": "computing",
  "updated": "2021-10-26T13:52:28Z",
  "author": "alex-whitelock",
  "summary": "Two very well priced Dell XPS 13 deals to check out",
  "article": [
    "New MacBook Pro price got you down? There are a couple of fantastic Dell XPS 13 deals on sale right now over at the official Dell store that will give any MacBook a run for its money - and come in much cheaper too.",
    "First up is this Dell XPS 13 for $685.99 (was $949.99), rocking a whopping $264 discount that makes it an absolute steal considering its specs. Inside its 11th gen Intel Core i5, 8GB of RAM, and 256GB SSD will get you some great performance, and all for a price that's actually lower than the cheapest Black Friday Dell XPS 13 deal last year (which had a Core i3, no less).",
    "The above entry-level Dell XPS 13 is a real bang for the buck champion this week, but if you're looking for something more premium consider this latest model for $1,293.59 (was $1,569.99). It's pricey, but the combination of an 11th gen Intel Core i7, 16GB of RAM, and 512GB SSD means it's going to output MacBook Pro levels of performance on even the most demanding of applications. This one also features the latest bezel-less design from Dell - an awesome touch that gives you an unbeatable screen-to-size ratio.",
    "Both these early Dell XPS 13 deals are part of the most recent sale from the manufacturer, which is set to end at the end of today. It's highly likely we'll see these prices crop up again on Black Friday but it's not a bad idea to buy now - not only will you beat the crowds but you'll be sure to snag one before they sell out.",
    "Outside the US? See today's best laptop deals in your region just below.",
    "Not what you're looking for? Check out our page on the upcoming Black Friday laptop deals to see all our predictions for HP, Dell, Apple, and others - as well as tons of early bird sales."
  ],
  "headers": {
    "5": "Today's early Black Friday Dell XPS 13 deals"
  },
  "links": {
    "for $685.99 (was $949.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1066529895825329200/https://deals.dell.com/en-us/member/productdetail/b0gm",
    "for $1,293.59 (was $1,569.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1227772499701170200/https://deals.dell.com/en-us/member/productdetail/ayva",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday laptop deals": "https://www.techradar.com/black-friday/black-friday-laptop-deals"
  }
}