{
  "source": "https://www.techradar.com/news/these-retro-gaming-inspired-shoes-deserve-more-footage",
  "title": "These retro gaming-inspired shoes deserve more footage",
  "category": "gaming",
  "updated": "2021-09-15T15:54:26Z",
  "author": "jess-weatherbed",
  "summary": "Shame they're only a concept",
  "article": [
    "It's been 20 years since the release of the Nintendo GameCube, a lovably square gaming console that has snuck itself into the category of 'Retro gaming' as time has passed by.",
    "While you might be reminiscing about early memories of console gaming, there's a bunch of memorabilia you can buy to show your allegiance to the console of your childhood such as officially branded SEGA t-shirts or Nintendo hats with recognizable mascots.",
    "Some of the coolest apparel we've seen are these incredible Retro Gaming shoes by The Sole Trader that combine popular sneakers such as Air Jordan 4s, Nike Air Max 97s, and Adidas Superstars with nostalgic games consoles, but there's a big caveat – they're purely a concept design and you can't go out and buy a pair.",
    "The Sole Supplier does sell real shoes, having been founded back in 2013 with the aim to provide sneaker news and information to the UK and European market, but it doesn't look like there are any plans to make these concept designs into a genuine collaboration.",
    "We think the Original Playstation and the purple Nintendo GameCube-inspired sneakers are the stand-out designs, but all of them will likely find favor with people who cherished different consoles.",
    "This isn't the first 'Sole Concept' series that The Sole Trader has done, with a similarly impressive range of designs inspired by popular superheroes. We're genuinely rather upset that we can't throw money at someone to materialize these into the real world, but it's surprising how often the word of shoes and Gaming clash.",
    "We saw a concept design emerge last year in collaboration between computing manufacturer NZXT and RTFKT studios of a compact gaming PC that resembles a hi-top sneaker said to contain a power RTX 3080 graphics card. This was never officially listed for sale but it was a cool idea that deserved to be showcased and would make an interesting build for any skilled modders."
  ],
  "headers": {
    "3": "A step into the world of footwear"
  },
  "links": {
    "Nintendo GameCube": "https://www.techradar.com/best/best-gamecube-games",
    "SEGA t-shirts": "https://shop.sega.com/collections/apparel",
    "Nintendo hats": "https://store.nintendo.com/merchandise/apparel.html",
    "The Sole Trader": "https://thesolesupplier.co.uk/thesoleconcept/pop-culture/gaming-glam",
    "designs inspired by popular superheroes": "https://thesolesupplier.co.uk/thesoleconcept/pop-culture/super-shoes",
    "collaboration between computing manufacturer NZXT and RTFKT studios": "https://www.techradar.com/news/this-rtx-3080-powered-sneaker-pc-from-nzxt-is-giving-us-a-real-kick"
  }
}