{
  "source": "https://www.techradar.com/news/what-does-footballs-european-super-league-mean-for-tv-and-gaming",
  "title": "What does football's European Super League mean for TV and gaming?",
  "category": "televisions",
  "updated": "2021-04-21T09:33:50Z",
  "author": "tom-wiggins",
  "summary": "European football may never be the same again",
  "article": [
    "UPDATE: Europe’s biggest football clubs announced they were intending to form a breakaway 12-team Super League on Sunday 18 April. Just a few days later on Wednesday 21 April all six Premier League teams that were set to sign up have now withdrawn from the competition after a monumental backlash from, well, pretty much everyone. Talk about a U-turn.",
    "Manchester City was the first Premier League club to withdraw, followed by Chelsea, Arsenal, Liverpool, Manchester United and Tottenham. What’s more, Italian club Inter Milan also looks set to withdraw soon too. The remaining clubs include Spain's Atletico Madrid, Real Madrid, Barcelona and Italy's Juventus and AC Milan. But it’s just a matter of time before plans fold as five teams doesn’t make a league, right?",
    "Here's our original story about the Super League...",
    "When 12 of Europe’s biggest football clubs announced on Sunday 18 April that they were intending to form a breakaway Super League, many of those not connected with the proposal were outraged. And quite rightly too.",
    "Under the terms of the new competition, 15 of the Super League’s 20 clubs would be permanent members no matter how well they perform, with the remaining five slots taken up on a season-by-season basis by those who qualify from their domestic leagues.",
    "Many fans, pundits, and people connected to the game have spoken out against the plans, concerned about its anti-competitive nature and the effect it will have on the already massive inequality that exists within football. And that's before considering the implications it may have for the gaming and TV industries that supplement our football passions.",
    "Of course, we have been in a similar position before – and we don’t mean when CDS Microsystems released European Super League for the Amiga in 1990. The Premier League was itself a breakaway back in 1992, when 20 teams split from the rest of the Football League. Back then Sky TV, the UK's leading sports broadcaster, was onboard from the beginning, taking a punt on the idea that people would be willing to fork out every month to watch this new-fashioned competition. But this time the traditional broadcasters appear to have been left out in the cold.",
    "When approached by TechRadar, Sky said:",
    "\"In the last 24 hours Sky Sports has passionately articulated the views of football fans on the importance of preserving and sustaining the whole football pyramid.",
    "\"We are completely focussed on supporting our long term football partners in the UK and in Europe, already providing fans with the best live action from the best football competitions in the world, and we have not been involved in any discussions with the proposed breakaway European Super League.\"",
    "In addition, a BT Sport spokesperson said: “BT recognises the concerns raised by many of football’s leading voices and fans, and believes the formation of a European Super League could have a damaging effect to the long-term health of football in this country.”",
    "Of course, it could also have a damaging effect on the health of BT Sport and Sky. According to The Times, part of the Super League proposal would see the teams being handed more control over the broadcasting rights of their games, with four per season being shown on the clubs’ own digital platforms around the world.",
    "How the rest will be shown is not yet known, but Kieran Maguire, author of The Price of Football and co-host of the podcast of the same name, suggests that forming a new competition could be the only way to break away from the current rights model and that a new approach could actually net the clubs more cash than they currently make from traditional TV deals.",
    "And it’s easy to see why. A 2019 survey by market research agency Kantar found that Manchester United had 1.1 billion fans and followers around the world. The club would only need to convince a fraction of them to fork out a few quid a month to watch live games and the amount it could bring in would absolutely obliterate the current numbers, which already add up to a minimum of nearly £100m per season.",
    "If the Super League clubs were to band together and sell the rights collectively, it could open the door to a truly global partner that could maximise worldwide revenues. Amazon has already proved that streaming is a viable option when it comes to live sport, so it’s easy to imagine what it would look like on an even larger scale.",
    "For those clubs left behind, though, things might not be so rosey, especially considering the value of the Premier League rights fell by 5% last time round. A competition without the so-called ‘Big Six’ is, in Maguire’s words, “not as appealing”, so expelling them “would be counterproductive”, but with less competition for the Champions League slots it could actually work out well for the aspirations of medium-sized clubs like Aston Villa, Leeds United and West Ham.",
    "Of course, the whole thing has ramifications across various industries connected to football, not least in video games. EA Sports only secured the rights to use the Champions League name and branding in its FIFA games in 2018, while Juventus are still conspicuous by their absence from FIFA 21, instead going by the name Piemonte Calcio. Meanwhile, Pro Evolution Soccer is arguably more famous for its licence-dodging club names, such as Man Blue and Merseyside Red, than its actual game.",
    "These licensing tussles are a huge part of what makes a football game successful. Authenticity is a huge part of their appeal, even if it’s only on a superficial level, and is what largely explains Pro Evo’s second-place finishes over the past decade.",
    "But with a completely new competition on the scene, there are no guarantees that EA Sports would win the rights to make the official Super League game, particularly if its organisers fall out with football’s governing body over whether SL players will be allowed to compete in international tournaments.",
    "Sports Interactive, the maker of Football Manager, also declined to comment when approached by TechRadar but did tweet the This Is Fine meme, along with the caption: “Us, the makers of a football management simulation game, this morning.” Clearly the move has potentially significant ramifications for the future of the management sim.",
    "And that gif of a cartoon dog sitting in the middle of a burning room just about sums up the current situation regarding the Super League. There’s a chance that it could change top-level football as we know it for good, including the way we watch and play it at home, but right now the various powers that be are engaged in an ugly power struggle – with the fans stuck in the middle watching everything they recognise of the beautiful game burn."
  ],
  "headers": {
    "6": "Back of the broadcasting net",
    "16": "Gaming and the European Super League"
  },
  "links": {
    "withdrawn from the competition": "https://www.bbc.co.uk/sport/football/56823501",
    "Super League": "https://thesuperleague.com/index.html",
    "Sky TV": "https://www.techradar.com/news/sky-tv-packages-deals-bundles-offers",
    "BT Sport": "https://www.techradar.com/news/bt-sport-deals-packages-offers",
    "The Times": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5549515891330915000&xs=1&url=https%3A%2F%2Fwww.thetimes.co.uk%2Farticle%2Feuropean-super-league-six-english-clubs-sign-up-to-breakaway-league-in-challenge-to-uefa-plans-xks8jdxtm&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhat-does-footballs-european-super-league-mean-for-tv-and-gaming",
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "Pro Evolution Soccer": "https://www.techradar.com/news/gaming/10-best-football-games-on-pc-1320530",
    "tweet the This Is Fine meme": "https://twitter.com/FootballManager/status/1384080217401028610?s=20"
  }
}