{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-family-was-just-listed-by-a-network-a-full-week-before-launch",
  "title": "Samsung Galaxy S21 family was just listed by a network a full week before launch",
  "category": "phones",
  "updated": "2021-01-07T09:53:50Z",
  "author": "james-peckham",
  "summary": "Yet another sneak peek",
  "article": [
    "The Samsung Galaxy S21 family is leaking left, right and center with a whole host of details about the handsets being provided by different sources online, and the latest news comes directly from a mobile network.",
    "Belgian network operator Voo listed all three devices on its website alongside images of the handsets and the Samsung Galaxy S21, Galaxy S21 Plus and Galaxy S21 Ultra specs.",
    "The listings were spotted by WinFuture and have since been removed. Despite being removed, the details look remarkably similar to what we've heard from other sources so we believe this information to be correct.",
    "The leaked details match other information we've heard before with the Samsung Galaxy S21 and S21 Plus set to come in 128GB and 256GB models with 8GB of RAM and the S21 Ultra sporting 12GB of RAM with the choice of 128GB, 256GB or 512GB of storage.",
    "Voo also provided pricing information, which again matches what we've previously heard from other sources. It listed the Samsung Galaxy S21 for €849, the S21 Plus for €1,049 and the S21 Ultra for €1,399.",
    "That's a little less for some models and a little more for others than what we saw for the Samsung Galaxy S20 range, so we'd expect to see similar prices in other markets.",
    "The Samsung Galaxy S20 launched at $999 / £899 / AU$1,499, the S20 Plus cost $1,199 / £999 / AU$1,649 and the S20 Ultra cost $1,399 / £1,199 / AU$1,999.",
    "Voo didn't provide any details on when you'll be able to own the phone, and we'll have to wait for Samsung to provide those details itself on January 14 when hosting its Unpacked event.",
    "The January 14 launch is set to start at 10am EST / 7am PST / 3pm GMT (and Friday 2am AEST) and we'll be covering the entire event so be sure to check back in on TechRadar for the launch."
  ],
  "headers": {
    "4": "How much will it cost?"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "WinFuture": "https://winfuture.de/news,120420.html",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review"
  }
}