{
  "source": "https://www.techradar.com/news/parler-is-making-a-return-to-the-apple-app-store",
  "title": "Parler is making a return to the Apple App Store",
  "category": "computing",
  "updated": "2021-04-20T10:15:44Z",
  "author": "joel-khalili",
  "summary": "Parler app will be relisted on the Apple App Store next week",
  "article": [
    "Social media network Parler has announced it will make a return to the Apple App Store next week, after a three-month period of absence.",
    "A previous attempt to re-launch was rebuffed by Apple last month over concerns about the continued dissemination of harmful content on the platform, but further changes appear to have appeased the Silicon Valley giant.",
    "According to Parler, an appeal from Senator Mike Lee and Congressman Ken Buck helped break the impasse, but the company offered little information about the specific concessions made.",
    "The Parler app will be available for download via the App Store from Monday, April 26 onwards.",
    "Marketed as the “free speech” social network, Parler is renowned for its laissez-faire attitude to content moderation and has long resisted any form of user surveillance. However, critics say this relaxed approach has allowed violent and hateful far-right content to proliferate on the platform.",
    "The Parler app was ejected from the App Store in January, in the aftermath of the assault on the US Capitol building. At the time, the company was told it would not be allowed to return until it had established comprehensive moderation policies.",
    "A raft of partners also came out against the social network. Apple and Google removed Parler from their respective app stores, while AWS withdrew its hosting services, effectively erasing Parler from the public internet.",
    "In a statement, interim CEO Mark Meckler explained Parler has now put new measures in place to prevent the spread of hateful content on the platform, but not at the expense of the company’s core values.",
    "“Parler has and will always be a free and open forum where users can engage in the free exchange of ideas,” he said.",
    "“We have worked to put in place systems that will better detect unlawful speech and allow users to filter content undesirable to them, while maintaining our strict prohibition against content moderation based on viewpoint.”",
    "Meckler rounded out his statement by thanking users for their patience and reiterating the company’s central goal: to provide a “non-partisan and pro-First Amendment alternative to other social media platforms”."
  ],
  "headers": {
    "4": "Parler re-launch"
  },
  "links": {
    "hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites"
  }
}