{
  "source": "https://www.techradar.com/news/the-next-batch-of-amazon-echo-devices-will-be-unveiled-on-september-28",
  "title": "The next batch of Amazon Echo devices will be unveiled on September 28",
  "category": "appliances",
  "updated": "2021-09-20T19:42:59Z",
  "author": "nick-pino",
  "summary": "Amazon is holding a virtual hardware and services event at 12 pm EST / 5pm BST",
  "article": [
    "Amazon will hold its annual hardware and services event on September 28 at 9 am PST / 12 pm EST / 5 pm BST, the company announced today.",
    "The annual event is Amazon’s chance to show off its latest Echo devices ahead of the holiday season and is typically the place we hear about upgrades coming to Amazon Prime Video, Amazon Luna and Amazon Music.",
    "Like previous years, a livestream of the event will be by invitation-only which means you won’t see it pop up on YouTube or Twitch – however, most mainstream technology outlets will be online covering the event, TechRadar included.",
    "Last year, Amazon announced the new Amazon Echo Dot, Amazon Echo (2020), new Amazon Echo Show devices, the Eero 6 Mesh Router and Amazon Luna.",
    "The first year Amazon held the event in its hometown of Seattle, the company made over 100 announcements of products and services. In the years since, the number of announcements has been slightly lower – and more manageable to cover – but it’s still a substantial event on par with Apple’s iPhone 13 event.",
    "This year we’re expecting to hear about the next series of Echo devices including new smart speakers, smart screens and wearables, alongside announcements on smart home devices from Eero and Ring. These brands always have something new to show off every year, and we’re expecting that trend to continue here in 2021.",
    "On the services side, it’s a little more of a mystery. We’ll probably hear some updates on Amazon’s new game-streaming service, Luna, and catch a few trailers for some upcoming Amazon Prime TV shows and movies. Hopefully we’ll get a trailer for Amazon’s nearly billion-dollar Lord of the Rings TV show – but that’s not a guarantee.",
    "Earlier this month, Amazon announced that it was making its own TVs and was expanding its range of partners, so we’ll likely hear additional details about those at the event as well."
  ],
  "headers": {
    "4": "Analysis: What are we expecting to see this year?"
  },
  "links": {
    "Amazon Prime Video": "https://www.techradar.com/deals/amazon-prime-video-subscription-cost-see-price-deals",
    "Amazon Luna": "https://www.techradar.com/news/amazon-luna-first-look-is-amazons-game-streaming-service-worth-trying",
    "Amazon Music": "https://www.techradar.com/reviews/amazon-music-hd",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Amazon Echo (2020)": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Eero 6 Mesh Router": "https://www.techradar.com/reviews/amazon-eero-6",
    "iPhone 13 event": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "Lord of the Rings TV show": "https://www.techradar.com/news/lord-of-the-rings-on-amazon"
  }
}