{
  "source": "https://www.techradar.com/news/facetime-is-coming-to-android-but-not-how-you-expect",
  "title": "FaceTime is coming to Android, but not how you expect",
  "category": "phones",
  "updated": "2021-06-07T17:31:22Z",
  "author": "james-rogerson",
  "summary": "By following a link",
  "article": [
    "FaceTime is one of the main things that might leave Android users looking jealously at iPhone owners, but with iOS 15 they won’t have to be quite as jealous anymore.",
    "As part of its WWDC 2021 keynote, Apple has announced that FaceTime users will soon be able to send a link for people to join a call from, and these links aren’t exclusive to Apple devices – Android and Windows users can join via them too.",
    "FaceTime calls will still be end-to-end encrypted, even for people not on iOS devices, so it sounds like Android users will be able to get pretty close to the full FaceTime experience once they’re on a call.",
    "That said, there still won’t be a dedicated FaceTime app on Android sadly. While we’d love for Apple to add that so Android users could fully use FaceTime, it’s understandable that the company hasn’t, and this is still a big step.",
    "This won’t just benefit Android users but also Apple ones, who will be able to keep using FaceTime while chatting to their Android friends. And maybe some of those friends will even be tempted to buy an Apple device when they’ve experienced FaceTime, so this seems like a smart move from Apple.",
    "We’re still hoping for a full FaceTime app on Android one day, and this news makes that look slightly more likely than it once did – but we still doubt it will happen.",
    "WWDC is in full swing at the time of writing, with more announcements still to come, so head over to our WWDC 2021 live blog for all the news as it emerges."
  ],
  "headers": {
    "3": "No app, yet"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "WWDC 2021 live blog": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog"
  }
}