{
  "source": "https://www.techradar.com/news/the-tcl-tab-pro-5g-is-one-of-the-cheapest-5g-tablets-you-can-buy",
  "title": "TCL's newest tablet gets 5G speeds at half the price of an iPad Pro",
  "category": "tablets",
  "updated": "2021-10-21T13:00:54Z",
  "author": "david-lumb",
  "summary": "5G connectivity for the price of a mid-range phone",
  "article": [
    "TCL has released plenty of affordable tablets, but its latest slate, the TCL TAB Pro 5G, may be one of the cheapest 5G-connected Android tablets in the US with its $399 (around £290 / AU$530), though it’s only sold through Verizon.",
    "On paper, the TCL TAB Pro 5G looks decent for its price, starting with a 10.3-inch Full HD Plus (2000 x 1200) display that comes with the brand’s NXTVISION color tech, SDR-to-HDR feature that auto-upscales content to HDR quality, and various eye protection modes (Reading, Comfort, and Dark).",
    "It doesn’t have a 3.5mm headphone jack, though (a USB-C to 3.5mm adapter comes in the box).",
    "The tablet packs a Qualcomm Snapdragon 480 5G chipset, 4GB of RAM, 64GB of storage (expandable up to 1TB via microSD), and runs Android 11 out of the box – specs in line with a mid-range phone around this price point.",
    "Its 13MP rear camera and 8MP front-facing shooter seem standard for tablets at this tier, and can both shoot 1080p video at 30fps, which is fine for casual video chatting.",
    "The TCL TAB Pro 5G has an 8,000mAh battery, which TCL claims lasts for 17 hours of ‘mixed use,’ presumably casual browsing and media watching, though its recharging time of four hours feels extensively long. On the plus side, it has reverse wireless charging, meaning it can charge up other devices.",
    "5G-capable tablets have started sprouting up, offering the advantages of LTE connectivity for data on the go but at potentially wildly fast speeds (depending on 5G coverage, of course). But most of the 5G-capable tablets we’ve seen have hefty pricetags: the cheapest 5G Apple tablet, the new iPad mini 2021, is priced at $649 / £619 / AU$979 for the 64GB of storage model, while the Samsung Galaxy Tab S7 FE’s 5G variant is priced at $669 (£629, about AU$1,180).",
    "Thus, the TCL TAB Pro 5G gives more affordable access to the fast 5G speeds while out and about. TCL’s slate may not have comparable specs compared to Apple and Samsung’s top-tier tablets, but the TAB Pro 5G is accessible to consumers who don’t need to do heavy graphical lifting but want something with fast data access.",
    "As a Verizon exclusive, the TCL TAB Pro 5G will obviously appeal to folks who may already have one of the carrier’s Unlimited 5G data plans (or is willing to sign up for one), and the tablet connects to Verizon’s sub-6 and mmWave networks (n2/5/66 and n260/n261, respectively)."
  ],
  "headers": {
    "6": "Analysis: Who needs a 5G tablet?"
  },
  "links": {
    "Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "Android 11": "https://www.techradar.com/news/android-11",
    "iPad mini 2021": "https://www.techradar.com/reviews/ipad-mini-2021",
    "Samsung Galaxy Tab S7 FE": "https://www.techradar.com/news/samsungs-galaxy-tab-s7-fe-is-finally-coming-to-the-us-but-youre-limited-to-5g-at-first"
  }
}