{
  "source": "https://www.techradar.com/news/avast-sells-family-safety-mobile-division-to-focus-on-iot-threats",
  "title": "Avast sells Family Safety Mobile division to focus on IoT threats",
  "category": "computing",
  "updated": "2021-03-10T17:31:46Z",
  "author": "anthony-spadafora",
  "summary": "Smith Micro will use Avast's portfolio to provide carriers with family mobile software",
  "article": [
    "The cybersecurity firm Avast has announced that it has entered into a definitive agreement to sell of its Family Safety Mobile Business to Smith Micro Software for $66m.",
    "As part of the deal, Smith Micro will acquire Avast's portfolio of parental control software and services for mobile which include location features, content filtering and screen time management.",
    "President and CEO of Smith Micro Software, William W. Smith explained in a press release how the acquisition will enable the company to deliver family mobile software solutions to the carrier industry, saying:",
    "“Acquiring the Family Safety Mobile Business from Avast will present a significant opportunity for Smith Micro to transform the global market for carrier-grade digital family mobile software. The acquisition will create one of the leading family safety software solutions providers for wireless carriers and will blend two highly experienced and talented development teams.\"",
    "By acquiring Avast's Family Safety Mobile division, Smith Micro plans to further expand its white-label digital safety solutions while strengthening its position as a family safety SaaS provider on a global scale. Avast on the other hand will retain its carrier IoT security and in-home protection services while continuing to serve its existing non-family customer base.",
    "SVP of Avast's partner team Nick Viney explained why the company is shifting its focus to IoT threats, saying:",
    "“Forecasts indicate there will be 24.1 billion active IoT devices by 2030 so we see great potential for our core digital security solutions as people’s lives become increasingly connected. This agreement gives Avast’s Partner team the opportunity to focus on building out our priority cybersecurity and privacy offerings and to expand into new vertical markets as well as the telecommunications space by partnering with Smith Micro to deliver our products and services to their customers as well as ours.”",
    "The acquisition is expected to close in April of this year and under the terms of the agreement, both companies will enter a preferred partner arrangement in which they will work together to provide carriers with both family mobile safety and IoT or digital security services."
  ],
  "headers": {
    "4": "Shifting focus to IoT"
  },
  "links": {
    "Avast": "https://www.techradar.com/news/avast-why-iot-security-should-be-your-number-one-security-worry",
    "parental control software": "https://www.techradar.com/best/parental-control",
    "screen time management": "https://www.techradar.com/how-to/how-to-stop-checking-your-phone-all-the-time",
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6410655648680306000/https://press.avast.com/smith-micro-software-avast-announce-purchase-agreemententer-into-strategic-partnership",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know"
  }
}