{
  "source": "https://www.techradar.com/news/millions-of-pcs-are-still-running-windows-7-and-xp",
  "title": "Millions of PCs are still running Windows 7 and XP",
  "category": "computing",
  "updated": "2021-03-26T13:01:49Z",
  "author": "sead-fadilpasic",
  "summary": "Outdated operating systems put systems at risk of data breach or cyberattack",
  "article": [
    "Millions of people are still using Windows XP and Windows 7 both at home and in the office, offering a hugely attractive sight to even newbie cybercriminals, a new report from Lansweeper claims.",
    "Analyzing more than 50 million devices currently running Windows operating systems, Lansweeper found that 5% ran Windows 7 (approximately 2.5m), while 3% ran Windows XP (roughly 1.5m).",
    "Microsoft stopped supporting Windows XP in early April 2014, and Windows 7 in early January 2020. That means that from those dates onward, any new flaws and vulnerabilities found will mostly remain unpatched.",
    "Running an operating system with known vulnerabilities could result in data breaches which, in today’s climate, may mean gargantuan fines to affected businesses - although Microsoft has said it may issue patches to subsequently discovered vulnerabilities to specific companies - for a price.",
    "Things have gotten even worse since the pandemic, Lansweeper’s report further states, due to many employees staying home for work. Among those employees are many whose cybersecurity knowledge and skills are subpar, and being away from the relative safety of their corporate networks, as well as IT departments, could exacerbate the problem.",
    "As an ecosystem, Windows nowadays powers more than a billion devices. Windows 10, the company’s latest operating system, alone powers a billion devices. Of the 50 million units Lansweeper analyzed, 5% (2.5m) still use Windows 8.",
    "The advice for users hoping to remain as secure as possible is to update to the latest Windows, Mac, or Linux OS and to protect their devices with a modern antivirus solution.",
    "\"The fact that people are still relying on systems more than a decade old is shocking,” says Roel Decneut, Chief Marketing Officer at Lansweeper. “A large number of these outdated PCs are predicted to be enterprise systems, which means it’s not just personal information that’s on the line.”"
  ],
  "headers": {
    "4": "Remote workers on the line"
  },
  "links": {
    "Windows 7": "https://www.techradar.com/news/windows-7-end-of-life-everything-you-need-to-know-about-the-death-of-windows-7",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "antivirus": "https://www.techradar.com/best/best-antivirus"
  }
}