{
  "source": "https://www.techradar.com/news/fxs-alien-tv-show-will-start-shooting-next-year-but-it-wont-star-ripley",
  "title": "FX's Alien TV show will start shooting next year – but it won't star Ripley",
  "category": "entertainment",
  "updated": "2021-07-01T15:18:45Z",
  "author": "tom-power",
  "summary": "Noah Hawley's Alien TV series will begin filming early 2022",
  "article": [
    "The Alien series is preparing to make the jump from the big screen to its smaller cousin: yes, an Alien TV series is officially in the works, and principal photography on the show will begin in spring 2022.",
    "That's according to Noah Hawley (Fargo), who recently revealed when filming would begin on his Alien TV show for FX. We already knew that an Alien TV series was in the works (Disney confirmed as much in December 2020), but this is the first we've heard about the project since then.",
    "Speaking to Vanity Fair about his upcoming projects, Hawley confirmed that his Alien TV series is the next production that he'll be working on.",
    "Hawley, though, didn't just confirm that he'd be bringing the iconic xenomorphs to TV screens. The Legion and Bones creator also revealed that he would begin shooting the TV series early next year.",
    "\"What's next for me, it looks like, is [an] Alien series for FX, taking on that franchise and those amazing films by Ridley Scott and James Cameron and David Fincher,\" Hawley revealed. \"I've written a couple of scripts, the first two scripts, and we're looking to make them next spring.\"",
    "If you were holding out hope that Sigourney Weaver would reprise her role as the legendary Ellen Ripley, though, it's time to rein in those expectations: Hawley said that Ripley would not be starring in his TV show.",
    "\"It's not a Ripley story,\" he added. \"She's one of the great characters of all time, and I think the story has been told pretty perfectly, and I don't want to mess with it.\"",
    "It would appear so. There's every chance that Hawley may bring Weaver back for a cameo appearance in his Alien TV series, but it sounds very unlikely, considering the comments he gave to Vanity Fair.",
    "Ripley's journey was set to continue in a new Alien movie, which was due to be helmed by District 9's Neill Blomkamp, after the director posted concept art of an unannounced Alien film on his personal Instagram account in 2015.",
    "Following the release of that concept art, interviews conducted by Blomkamp revealed that his Alien movie would follow 1986's Aliens, which would disregard 1992's Alien 3 and 1997's Alien: Resurrection. It was a pitch that even Weaver was apparently keen to pursue.",
    "Following the release of Ridley Scott's Alien: Covenant in 2015, however, Blomkamp's movie was put on ice before being scrapped entirely in 2018. At the time, Blomkamp confirmed he had \"moved on\" from the project:",
    "Since then, Blomkamp has commented (via JoBlo) on the cancelled project, and more concept art has come to light about his proposed vision for the film.",
    "It seems, then, that Ripley's story is done and dusted in the Alien universe. As fun as it would be to see Weaver reprise her role as the kick-ass Ripley in another Alien movie, the series is moving onto pastures new with new characters, setting (Hawley's TV series is set on Earth) and plot threads.",
    "Maybe it's time that Alien fans, us included, did the same."
  ],
  "headers": {
    "7": "Analysis: has Ripley's story in the Alien universe reached its end?"
  },
  "links": {
    "confirmed": "https://twitter.com/Disney/status/1337170752961974273",
    "Vanity Fair": "https://www.vanityfair.com/hollywood/2021/07/alien-tv-series-noah-hawley",
    "personal Instagram account": "https://www.instagram.com/p/5NUtoZKhM_/?hl=en",
    "JoBlo": "https://www.joblo.com/movie-news/ex-neill-blomkamp-on-the-future-of-oats-studios-funding-a-firebase-sequel-190",
    "more concept art": "https://twitter.com/avpgalaxy/status/1399605675341324289?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1399605675341324289%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.shortlist.com%2Fnews%2Fthis-cancelled-aliens-sequel-looks-absolutely-stunning-402768"
  }
}