{
  "source": "https://www.techradar.com/news/immerse-yourself-in-vr-music-videos-with-this-oculus-quest-2-update",
  "title": "Immerse yourself in VR music videos with this Oculus Quest 2 update",
  "category": "vr",
  "updated": "2021-09-21T10:29:15Z",
  "author": "rhys-wood",
  "summary": "Music videos are coming to Oculus VR",
  "article": [
    "If you've ever thought music videos would be a cool thing to experience in VR, then it seems like Oculus has heard you. This latest Oculus Quest 2 update lets users immerse themselves in a variety of music videos via the Oculus TV service.",
    "Announced via Oculus's official blog, the service (currently only available in the US) lets Oculus Quest 2 users browse music videos from a variety of genres from both new and classic acts. Oculus has even partnered with big music industry names like Sony Music Group, BMG, Merlin and more to ensure a variety of music videos are available to view.",
    "The blog post also states that music videos will be shareable to other Oculus users on your friends list, as well as directly to your Facebook feed. In terms of the service itself, Oculus mentions that it will \"continue working with our music partners to build unique social experiences,\" indicating that this could be just the beginning of an ongoing project for the companies involved.",
    "While being able to view your favorite music videos in a VR environment will surely be an enticing prospect for many, we have to argue that this is far from the most useful Oculus update the company could have worked on.",
    "For one, it's unclear as to how many of these music videos will be viewable in a full 360-degree experience, and how many will just be watchable on a virtual screen. One huge appeal of virtual reality is that you're directly immersing yourself into the experience. It's easy to feel like part of whatever experience you're in due to the nature of VR, something that's lost when, essentially, all you're looking at is a virtual screen.",
    "Oculus TV does support both VR180 and VR360 viewing, so we hope the latter will be a huge focus going forward if Oculus wants to commit to making music videos available on the service. Bespoke 360-degree music videos have been a thing for years now, and we'd love to see more of that kind of thing on Oculus TV, and would be something definitely worth sharing with your friends."
  ],
  "headers": {
    "3": "Analysis: just another VR gimmick?"
  },
  "links": {
    "VR": "https://www.techradar.com/news/the-best-vr-headset",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus's official blog": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-1008346044936867800&murl=https%3A%2F%2Fwww.oculus.com%2Fblog%2Fsurround-sound-introducing-music-videos-in-oculus-tv%2F",
    "Bespoke 360-degree music videos": "https://www.youtube.com/watch?v=SsFa5JhSDH4"
  }
}