{
  "source": "https://www.techradar.com/news/amazon-prime-day-2021-proved-lucrative-for-smbs-everywhere",
  "title": "Amazon Prime Day 2021 proved lucrative for SMBs everywhere",
  "category": "computing",
  "updated": "2021-06-24T12:02:24Z",
  "author": "rob-clymo",
  "summary": "SMEs enjoyed a sales boost during Amazon Prime Day 2021",
  "article": [
    "Small and medium-sized businesses enjoyed their biggest ever two-day selling period during this year’s Amazon Prime Day event, the e-commerce giant has claimed.",
    "In the two-week lead-up to 2021’s Amazon Prime Day, customers spent $1.9 billion on products offered by small business outlets during its Spend £10, Get £10 promotion period worldwide - a 100% year-on-year increase compared to the Prime Day promotion run a year earlier.",
    "Amazon Prime numbers are continuing to grow with many consumers opting to sign up for the service in the wake of the coronavirus pandemic in order to get the benefit of Prime Day online discounts. Members in 20 countries purchased more than 250 million items during the 48-hour sale period, resulting in the highest ever amount spent since Prime Day began back in 2015.",
    "“For the first time this Prime Day, we offered a double donation promotion through our charity initiative AmazonSmile, which saw more UK customers shopping through AmazonSmile than ever before,” said John Boumphrey, Amazon UK Country Manager. \"This year, Prime Day has also been good news for small businesses, with even more customers than last year taking advantage of our ‘Spend £10, Get £10’ promotion, providing a much-needed boost to small business sellers across the country.\"",
    "The latest figures from Amazon also offer up a unique snapshot of big-selling products and categories around the globe. Best-selling categories included Tools, Beauty, Nutrition, Baby Care, Electronics including Amazon Devices, Apparel and Household Products.",
    "Meanwhile, Prime Day favourite products worldwide included iRobot Roomba 692 Robot Vacuum, Keurig K-Slim Coffee Maker, Apple Cider Vinegar Gummy Vitamins by Goli Nutrition and Crest 3D White Professional Effects Whitestrips.",
    "“Amazon Prime Day exceeds our expectations every year,” commented Oliver Bristowe, Founder of Pets Purest. “This year we saw a 20% uplift in sales. And by using Fulfilment by Amazon (FBA), it means we can fulfil thousands of orders without worrying about having more resources. As a small business, Amazon allows us to maximise our potential.”"
  ],
  "headers": {
    "4": "Amazon Prime Day"
  },
  "links": {
    "Small and medium-sized businesses": "https://www.techradar.com/news/best-small-business-servers",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "small business outlets": "https://www.techradar.com/best/best-apps-for-small-business",
    "online discounts": "https://www.techradar.com/black-friday/black-friday-vs-cyber-monday-whats-the-difference",
    "Amazon Devices": "https://www.techradar.com/news/amazon-devices-will-soon-share-your-internet-with-the-neighbourhood-heres-how-to-switch-it-off",
    "iRobot Roomba 692 Robot Vacuum": "https://www.techradar.com/news/prime-day-robot-vacuum-cleaner-deals-will-save-you-money-and-time-on-chores",
    "Keurig K-Slim Coffee Maker": "https://www.techradar.com/news/keurig-k-slim-should-i-buy-one"
  }
}