{
  "source": "https://www.techradar.com/news/collaborating-over-microsoft-word-is-about-to-become-a-whole-lot-easier",
  "title": "Collaborating over Microsoft Word is about to become a whole lot easier",
  "category": "computing",
  "updated": "2021-02-03T15:02:18Z",
  "author": "barclay-ballard",
  "summary": "The Microsoft 365 roadmap has teased more new features for Word",
  "article": [
    "Microsoft is launching a couple of new features that should make collaborating much easier for Word users. The new additions, announced as part of the Microsoft 365 roadmap, include modern comments and intelligent suggestions.",
    "According to the roadmap, Word users will benefit from enhanced collaboration next month, when Microsoft rolls out its modern comments update.",
    "“Share your comments with co-authors only once they're complete, enjoy improved @mention notifications, and be more productive with a consistent commenting experience between Word, Excel and PowerPoint,” the Microsoft 365 roadmap explains.",
    "Microsoft first launched modern commenting in July 2020, changing how comments were viewed. Following the update, comments were shown to the right of the Word document by default, allowing users to focus on their work more easily, without missing active comments. The coming comments update should further enhance the collaborative experience.",
    "“The arrival of our new commenting experience sets the stage for a richer Word collaboration experience for your team by enabling modern features such as @mention notifications and more,” Kallie Bracken, a Program Manager for Word, said when modern comments were first announced. “Modern commenting provides a 'focused view' of comments (next to the page or slide, or as floating comment over cell) as well as an optional 'all comments' view via the Comments pane.\"",
    "In addition to the modern comment upgrade, Microsoft is also bringing intelligence suggestions to Office 365 later this month. These will help individuals quickly find the files they need, allowing them to collaborate more efficiently. With the coronavirus pandemic meaning that the vast majority of workplace collaboration must take place digitally, Microsoft’s newly announced features are sure to be welcomed by remote workers. Although they are only incremental additions, these can still have significant benefits for productivity."
  ],
  "headers": {
    "3": "Modern collaboration"
  },
  "links": {
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "explains": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-4731981346144015000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D76186",
    "said": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7557328060936240000&xs=1&url=https%3A%2F%2Finsider.office.com%2Fen-gb%2Fblog%2Fmodern-commenting-in-word&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcollaborating-over-microsoft-word-is-about-to-become-a-whole-lot-easier"
  }
}