{
  "source": "https://www.techradar.com/news/ultra-mobiles-summer-sale-can-score-you-a-six-month-3gb-plan-for-just-dollar11-per-month",
  "title": "Ultra Mobile's Summer Sale can score you a six month 3GB plan for just $11 per month",
  "category": "phones",
  "updated": "2021-07-22T14:44:03Z",
  "author": "alex-whitelock",
  "summary": "A nice promo to score some cheap data",
  "article": [
    "Ultra Mobile, a carrier with some of the best cheap cell phone plans available right now, is offering an additional three months of free service on its 3GB data for all new customers thanks to a limited-time Summer Sale.",
    "Paying just $66 upfront means you'll be averaging out at $11 per month for this 3GB prepaid plan - one that includes unlimited talk and text, 5G data speeds, and international calling to over 80 countries. Note, while you have 3GB of speedy 5G data with this plan, should you go over your allowance you'll still be able to use data, just at a much-reduced speed of 128KB/s. All in all, it's a great value option if you're strictly on a budget.",
    "Like its sister company Mint Mobile, Ultra Mobile operates a fairly unique 'buy-in-bulk' pricing scheme where you pay for your data upfront in a lump sum. Unfortunately, there's no way around this - but it does come with the benefit of not having to worry about your bills for a whole six months.",
    "Note, this latest Ultra Mobile promotion is available for new customers only. Sorry existing customers, but you'll have to sit this one out for now. Also, if you are interested in this latest Ultra Mobile deal, bear in mind that you'll be looking at paying for your next installment at full price after your six months are up, as this is a limited-time promo.",
    "Want to see how Ultra Mobile stacks up against its sister carrier? See our Mint Mobile vs Ultra Mobile feature. We also recommend checking out our best prepaid phone plans article if you're interested in seeing what other great services TechRadar recommends."
  ],
  "headers": {
    "4": "Ultra Mobile Summer Sale"
  },
  "links": {
    "best cheap cell phone plans": "https://www.techradar.com/deals/best-cheap-cell-phone-plans",
    "three months of free service": "https://imp.i127448.net/c/221109/797176/11371?subId1=trd-us-1283184646905047300&sharedId=trd-us&u=https%3A%2F%2Fwww.ultramobile.com%2Fplans%2F",
    "Mint Mobile": "https://www.techradar.com/deals/mint-mobile-what-is-it-and-is-it-worth-it",
    "Mint Mobile vs Ultra Mobile": "https://www.techradar.com/news/mint-mobile-vs-ultra-mobile-which-multi-month-prepaid-carrier-is-the-best",
    "best prepaid phone plans": "https://www.techradar.com/deals/best-prepaid-plans"
  }
}