{
  "source": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
  "title": "Where to buy Xbox Series X: all the retailers to check for the console",
  "category": "gaming",
  "updated": "2021-12-08T12:42:05Z",
  "author": "james-pickard",
  "summary": "Want to know where to buy Xbox Series X? Here are all the places you should be looking",
  "article": [
    "The Xbox Series X has still been difficult to find even after a number of restocks during Black Friday 2021. Even though the Xbox Series X stock situation has improved greatly a year from launch, consoles are still not readily available in stores at a moment's notice. The good news, though, is that Microsoft's latest Xbox isn't selling out in a matter of seconds so your chances of getting one when there is a restock are much higher. To get you in the best position possible, we're here to ensure you're kept up to date with where to buy the Xbox Series X.",
    "Latest: Although things have been getting better, we're still in a dry spell in terms of Xbox Series X stock. In the US, consoles were available in two waves at Walmart over Black Friday and Cyber Monday. It's a bit better in the UK, where recently there has been a restock at Amazon, Currys, and through the All Access program at Game. As soon as we hear of any news on future restocks for the standard Xbox Series X console we'll be back to update this page.",
    "If you're getting particularly desperate to buy Xbox Series X, it can be tempting to head to a reseller site. You will be able to get your hands on a console at some point, and even though restocks are selling fast it is still possible to scoop up the new console. That's why we recommend sticking to retailers you know and trust.",
    "You can check these stores in the US, along with our Xbox Series X restock tracker updates.",
    "These stock issues can only last so long - you'll be able to find where to buy Xbox Series X for a non-inflated scalper price relatively easily at some point in the future. We don't know when these stock issues will ease, but expect restocks of the new Xbox to appear over the next few weeks.",
    "In the US, in-store stock varies by region, but we are seeing some success with Target. Be sure to check in-store stock levels early in the morning and head down straight away if you spot consoles available. Stores are allocating what little stock they have on a first come first served basis, but it is possible to buy the new Xbox Series X in person.",
    "If you're in the UK, things are a little different. Obviously the current lockdown has scuppered many plans to buy Xbox Series X in store so you're at the mercy of online retailers for now.",
    "Read the full Xbox Series X review",
    "Is going cheaper worth it? Check out the full Xbox Series S review"
  ],
  "headers": {
    "3": "Where to buy Xbox Series X in the US",
    "4": "When will you be able to buy Xbox Series X?",
    "5": "Can you buy Xbox Series X in store?"
  },
  "links": {
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Xbox Series X restock tracker": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Xbox Series X review": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S review": "https://www.techradar.com/reviews/xbox-series-s"
  }
}