{
  "source": "https://www.techradar.com/news/sony-could-close-ps3-vita-and-psp-stores-in-july",
  "title": "PS3, Vita and PSP stores will close later this year",
  "category": "gaming",
  "updated": "2021-03-29T21:49:27Z",
  "author": "adam-vjestica",
  "summary": "Sony’s set to pull the plug on three generations of content",
  "article": [
    "Sony has announced that it will close the PlayStation Store on PS3, Vita and PSP stores later this year. Once they go dark, players will no longer be able to make digital purchases or buy any DLC on each of the respective platforms.",
    "The PS3 and PSP’s stores will officially close on July 2, while the PS Vita store will shut down on August 27. After these dates, you'll be able to re-download and play previously purchased games and video or redeem games via codes and PlayStation Plus vouchers, but you won't be able to purchase a game digitally.",
    "According to a PlayStation FAQ where the changes were announced, after those dates you'll no longer be able to add funds through those systems – but any money in your wallet will carryover onto the PS4 or PS5.",
    "Even though Sony ended PS3 production four years ago, the console sold 87 million units during its 11 years on the market, which means players will have had over a decade to build up a library of titles.",
    "The PSP and Vita represents Sony’s foray into the handheld market, and while the PSP was deemed a relative success, shifting 81 million units since its March 2005 release, the Vita didn’t fare so well and was widely considered a failure. So much so, that Sony all but pulled support for the handheld after only a few years on sale.",
    "With Microsoft committed to letting Xbox gamers play original Xbox, Xbox 360 and Xbox One games on Xbox Series X and Series S consoles, it’s disappointing to see Sony removing one of the only avenues left to purchase its back catalog. It also brings up the age old debate of digital storefronts, and what happens when they’re taken offline for good."
  ],
  "headers": {
    "3": "Tick tock"
  },
  "links": {
    "Vita": "https://www.techradar.com/news/gaming/handhelds/ps-vita-deals-1315753",
    "PSP": "https://www.techradar.com/news/psp-owners-beware-you-might-want-to-check-your-playstation-portable-battery",
    "PlayStation FAQ": "https://www.playstation.com/en-gb/support/important-notice/",
    "Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}