{
  "source": "https://www.techradar.com/news/how-to-watch-wandavision-online-stream-all-new-marvel-series-on-disney-plus-today",
  "title": "How to watch WandaVision online: stream every episode on Disney Plus today",
  "category": "computing",
  "updated": "2021-03-05T08:41:31Z",
  "author": "james-laird",
  "summary": "All nine episodes of Marvel's small screen debut available now",
  "article": [
    "Marvel is back with its first live-action release since way back in 2019, with new limited TV series WandaVision also representing Marvel Studios' first splash on the small screen. Follow our guide as we explain how to watch WandaVision online and stream the new Avengers spin-off on Disney Plus from just $6.99/£7.99 a month - the watching details below apply to the entire series, or we can tell you specifically how to watch WandaVision episode 9, the series finale, which has just been released.",
    "Starring Elizabeth Olsen and Paul Bettany, WandaVision represent our first look at the phase four of the Marvel Cinematic Universe, or MCU. It sees the Hollywood duo play Wanda Maximoff/Scarlet Witch (Olsen) and Vision (Bettany), two of the supporting superheroes from earlier stages of the MCU, most notably the Avengers movies (minor spoilers for which may exist below).",
    "On the surface, they're a happily married couple living the perfect suburban life in the white picket fence stronghold of Westview - and trying to keep their superpowers under wraps as a result. Us? Well, we'd really like to know how Vision is now very much not-killed-by-Thanos-after-all.",
    "There's time-warping and reality-bending in experimental WandaVision - and also plenty of humor - as the show pays homage to a range of classic TV eras from Bewitched and I Love Lucy to That 70s Show and more.",
    "Comprised of nine episodes, the first two dropped on January 15, with a new one released every Friday thereafter for the duration of the run, which continues to slowly reveal itself and build towards a climax that launches MCU phase 4 in full - Mephisto currently the internet's top pick to emerge as the show's villain now that (as of episode 6) we're starting to get an idea of the show's place in the wider Marvel universe.",
    "Follow our guide below as we explain how to watch WandaVision online and stream the new Avengers spin-off today - as one of six limited Marvel TV series to come to the platform this year, there's no reason for fans not to grab a great value Disney Plus subscription right now!",
    "Disney Plus is already cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. Obviously you have to splash the cash at the start, but with so much content to get stuck in to we very much doubt you'll run out of things to watch before the 12 months are up. You're looking at $69.99/£79.90/AU$119.99 for the year.",
    "Or if your interests are farther reaching (and you're in the US), then we'd seriously suggest looking at the fantastic value bundle package. It adds Hulu and ESPN+ to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Helstrom and Normal People. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $12.99 a month.",
    "Disney Plus is showing no signs of slowing down since the service first launched last November. WandaVision is just the latest in a string of recent blockbuster releases exclusive to the platform, including Soul, The Mandalorian, Mulan, Hamilton, and much more.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "In addition, now that Disney has set the precedent of releasing movies like its live-action Mulan remake on the service instead of in theaters through its Premiere Access program, expect the company to keep bring more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021. Most recently, it's the way to watch Raya and the Last Dragon online.",
    "Finally, the already vast amount of content available on Disney Plus has just doubled in many regions, thanks to a new channel, Star on Disney Plus, which will bring much of the content the House of Mouse now owns through its Fox acquisition to the service.",
    "This means the platform will finally offer a more healthy amount of grown-up shows and movies, with Family Guy, Solar Opposites, Love, Victor, Big Sky and Helstrom among the content that's going to be available on Disney Plus Star. It's available in the UK, most of Europe, and other select markets like Australia and New Zealand - but not in the US, where the media giant's Hulu service already has very similar ground covered.",
    "Read more:"
  ],
  "headers": {
    "6": "How to save money on Disney+",
    "8": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus from just $6.99/£7.99": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1052625143587329200&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "watch WandaVision episode 9": "https://www.techradar.com/news/how-to-watch-wandavision-online-stream-all-new-episode-8-on-disney-plus-today/news/how-to-watch-wandavision-episode-9-online-stream-the-series-finale-from-anywhere",
    "Disney Plus subscription": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-2075676197394332200&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "$69.99/£79.90/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-6686124785772512000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN+": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $12.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-9721509230804711000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Premiere Access program": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-3207221720016635400&sharedId=trd-us&u=https%3A%2F%2Fhelp.disneyplus.com%2Fcsp%3Fid%3Dcsp_article_content%26sys_kb_id%3Db0e20693db921c50b1e6c28d1396191a",
    "watch Raya and the Last Dragon online": "https://www.techradar.com/news/how-to-watch-raya-and-the-last-dragon-online-stream-the-full-movie-on-disney-plus-now",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}