{
  "source": "https://www.techradar.com/news/another-disgruntled-analyst-discloses-zero-day-ios-15-bugs",
  "title": "Another disgruntled analyst discloses zero-day iOS 15 bugs",
  "category": "computing",
  "updated": "2021-09-27T11:09:51Z",
  "author": "mayank-sharma",
  "summary": "Another developer claims to have done in one day, what Apple couldn’t do in six months",
  "article": [
    "Exasperated at Apple’s recent handling of its security bounty program, a cybersecurity researcher has released proof-of-concept (PoC) exploit code for three zero-day vulnerabilities in iOS 15.",
    "The researcher, who is only known by the alias IllusionOfChaos, said his action is in response to Apple’s inaction to fix the vulnerabilities.",
    "“I've reported four 0-day vulnerabilities this year between March 10 and May 4, as of now three of them are still present in the latest iOS version (15.0) and one was fixed in 14.7, but Apple decided to cover it up and not list it on the security content page,” wrote the researcher.",
    "The researcher added that while Apple initially apologized for their response, they later didn’t even respond to his email when he threatened to share details about the vulnerabilities within ten days.",
    "In the post, the researcher said that in their initial email Apple claimed the company failed to publicly acknowledge the vulnerabilities because of a “processing issue.”",
    "“When I confronted them, they apologized, assured me it happened due to a processing issue and promised to list it on the security content page of the next update. There were three releases since then and they broke their promise each time,” shared the researcher.",
    "IllusionofChaos then gave Apple ten days to explain the reason for the continued lethargy in fixing the bugs, warning them that the details will be shared post-expiry of the time frame. Since Apple didn’t respond, all the research has now been shared online.",
    "“My request was ignored so I'm doing what I said I would. My actions are in accordance with responsible disclosure guidelines (Google Project Zero discloses vulnerabilities in 90 days after reporting them to vendor, ZDI - in 120). I have waited much longer, up to half a year in one case,” the researcher reasons as he shared details of the vulnerabilities along with PoC exploit code for all of them.",
    "Interestingly, an anonymous jailbreak developer claims to have fixed all three vulnerabilities, barely a day after they were disclosed.",
    "TechRadar Pro has contacted Apple for comment."
  ],
  "headers": {
    "4": "Caught in red tape?"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "wrote": "https://habr.com/en/post/579714/",
    "claims to have fixed": "https://www.reddit.com/r/jailbreak/comments/pvaztb/free_release_entitlementfix_workaround_for_the_3/"
  }
}