{
  "source": "https://www.techradar.com/news/amazon-echo-show-10-finally-gets-a-much-needed-alexa-feature",
  "title": "Amazon Echo Show 10 finally gets a much-needed Alexa feature",
  "category": "smart-home",
  "updated": "2021-11-19T10:24:00Z",
  "author": "rhys-wood",
  "summary": "Longer, less awkward conversations with your voice assistant",
  "article": [
    "Owners of Amazon's Echo Show 10 smart display will soon be able to make use of a nifty new feature in that of Conversation Mode. This new setting will allow users to have longer, less awkward conversations with Alexa, forgoing the need to repeat your voice assistant's wake word for each singular request.",
    "As reported by SlashGear, users can begin Conversation Mode by saying \"Alexa, join the conversation.\" This will put the smart device in Conversation Mode, where users can continue making requests or asking questions to Alexa without saying the wake phrase ad nauseum.",
    "The feature, which will roll out to Echo Show 10 devices over the next few weeks, still has some restrictions to keep in mind. The user must be in view of the Echo Show 10's camera, and must also be looking at the screen in order to engage in Conversation Mode.",
    "Of course, Alexa doesn't need to stay in Conversation Mode forever, if you don't want it to. By saying \"leave the conversation,\" the voice assistant will revert back to its default state, requiring the wake phrase in order to issue requests.",
    "And for those of you wary of any privacy concerns the come about as a result of the Echo Show 10's camera being active in Conversation Mode, Amazon has stressed that the only data being sent to its cloud are the requests you make to Alexa.",
    "A feature like Conversation Mode has been a long time coming, and we're glad to finally see something like it arrive on Echo Show 10 smart displays. There may be times where having to stress the wake phrase each time you wish to make a request to Alexa can grow tiresome, and Conversation Mode is an adequate solution to that.",
    "Conversation Mode could prove to be useful if you need to learn or record a lot of information on the fly. Say, if you're studying for a test, and you need to refer to Alexa at a moment's notice. With Conversation Mode, you can more casually ask Alexa any queries you might have, without needing to sound off the wake phrase every single time.",
    "It's still bafflingly restrictive in some area, however. Needing to look directly at the Echo Show 10's screen to issue commands in Conversation Mode is arguably more obnoxious than just saying the wake phrase.",
    "That said, the restriction is understandable. It'll prevent any unnecessary requests being sent to Alexa as a result of background noise, and ensures it knows when and when not to respond to commands. It also stops Alexa from responding to absolutely everything you say. Ultimately, it's likely a necessary limitation, if a slightly awkward one."
  ],
  "headers": {
    "5": "Analysis: A real conversation starter?"
  },
  "links": {
    "Amazon's Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "smart display": "https://www.techradar.com/best/best-smart-displays",
    "SlashGear": "https://www.slashgear.com/echo-show-10-gets-conversation-mode-to-make-requests-less-awkward-18699896/"
  }
}