{
  "source": "https://www.techradar.com/news/shang-chi-ending-and-post-credits-scenes-explained",
  "title": "Shang-Chi ending and post-credits scenes explained",
  "category": "entertainment",
  "updated": "2021-09-03T12:00:00Z",
  "author": "tom-power",
  "summary": "Spoilers follow for Shang-Chi",
  "article": [
    "Spoilers follow for Shang-Chi and the Legend of the Ten Rings.",
    "Shang-Chi has arrived in theaters and, judging by its ending, the MCU’s latest superhero could play a big role in Phase 4 and beyond.",
    "Now that you’ve watched Shang-Chi, we imagine that you have questions about the movie’s ending and post-credits scenes.",
    "Below, we’ll break down the ending to Shang-Chi’s live-action debut. We’ll also explain how the mid-credits and post-credits scenes tie into the wider MCU, and what impact they may have on it.",
    "We’re heading into major spoiler territory for Shang-Chi. Turn back now if you haven’t watched it yet, or you’ll ruin the surprises for yourself.",
    "With Shang-Chi (Simu Liu) saving the day, although Katy (Awkwafina) and the Great Protector helped him to stop the interdimensional being known as the Dweller-in-Darkness.",
    "Xu Wenwu (Tony Leung), who believes that his deceased wife Jiang Li (Fala Chan) is calling out to him in Ta Lo, destroys the dragon-scale barrier that had prevented the Dweller-in-Darkness from escaping its tomb.",
    "With the entity freed from captivity, its bat-like minions start feeding it with the souls that they’ve acquired from Ta Lo’s and Wenwu’s armies. Having initially battled one another, both parties agree to join forces and prevent the Dweller-in-Darkness and its underlings from killing anyone else.",
    "Their efforts, though, are in vain. The Dweller-in-Darkness consumes enough souls to grow larger and more powerful than the Great Protector, Ta Lo’s mystical dragon that has watched over the magical village for eons.",
    "Unable to fight off its foe, the Great Protector is captured by the Dweller-in-Darkness, who begins to feast on its soul. Draining the dragon of its life force would make the Dweller-in-Darkness unstoppable and enable it to destroy the Earth.",
    "As it absorbs the dragon’s soul, Shang-Chi’s sister Xialing (Meng’er Zhang), who’s riding on the Great Protector alongside her brother, loses her grip and begins to fall. Shang-Chi grabs her hand, but she tells him to let her go so that he can save the Great Protector using the 10 rings. Remembering how he left her alone at Wenwu’s compound years earlier, Shang-Chi tells her he “won’t let her go again”, even if it means that the Dweller-in-Darkness wins.",
    "With the pair incapacitated, it’s up to Katy to stop the behemoth. Aiming for its neck, Katy fires an arrow that pierces the creature’s throat, halting its feast of the Great Protector’s soul.",
    "Recovering from the attack, the Great Protector traps the Dweller-in-Darkness in a giant column of water. Sensing an opportunity to kill it, Shang-Chi leaps from the dragon’s back and fires the 10 rings into the Dweller-in-Darkness’s stomach. Using his magic, he causes the rings to damage the creature from within before dealing one final punch that causes it to explode.",
    "With victory secured, the remaining forces honor the dead at a candlelit vigil before going their separate ways.",
    "Back in San Francisco, Shang-Chi and Katy tell friends Soo (Stephanie Hsu) and John (Kunal Dudheker) about their exploits. The duo scoff at their tale until Wong (Benedict Wong) unexpectedly appears through a sling-ring portal, and asks Shang-Chi and Katy to follow him to the Sanctum Santorum.",
    "Wong inspects the rings alongside Shang-Chi and Katy. The trio, though, are not alone. The camera pans to the right and reveals that two Avengers are also present: Bruce Banner (Mark Ruffalo), who is surprisingly back in his human form, and Carol Danvers (Brie Larson), aka Captain Marvel.",
    "Banner and Danvers, who are using the hologram technology seen in Avengers: Endgame, say they haven’t come across anything like the 10 rings before.",
    "Wong adds that the rings aren’t part of the Sanctum’s codex either and, when Shang-Chi used them to defeat the Dweller-in-Darkness, they sent a signal out into the universe. When Shang-Chi and Katy ask where it was sent to, Banner and Danvers receive unexpected messages and leave.",
    "Wong tells Shang-Chi and Katy that they’re part of a bigger universe now (i.e. the MCU) and that he’ll be in touch. However, in an amusing callback to earlier in the film, the duo invite Wong to karaoke night, where the trio end up drunkenly singing Hotel California.",
    "So it seems that the 10 rings are of alien origin, and that they’re potentially calling out to their creators – but to who, exactly?",
    "In the comics, the 10 rings were created by the Makluans, a shape-shifting cosmic race of space dragons (yes, you read that right). Born on the planet Kakaranthara, some Makluans became bored of how peaceful their world was, and set off to find new worlds to explore (or conquer) in the universe.",
    "This seems to tie into the Great Protector’s origins in Ta Lo. Many fans had assumed that Ta Lo’s dragon was Fin Fang Foom but, given the offensive stereotype that such a name elicits, Shang-Chi’s dragon was renamed for the movie. Even if the Great Protector isn’t Fin Fang Foom, though, its home in Ta Lo – which exists in a pocket dimension adjacent to Earth in the comics – appears to take its inspiration from the Makluans.",
    "It’s possible that other space dragons may find out that the rings have been used by humans and deem them unworthy of wielding such power. A Shang-Chi sequel, then, could lead to a space dragon invasion of Earth. Hey, stranger things have happened in the MCU.",
    "There are two other upcoming Marvel movies that may tie into Shang-Chi, too.",
    "The first is Doctor Strange 2. With Wong appearing in Shang-Chi, it’s plausible that the 10 rings could cameo in the Sorcerer Supreme’s sequel. We don’t expect him to try and use them, but it would be a cool nod to Shang-Chi if Doctor Strange examines them himself. This seems unlikely, though, given that he’ll be dealing with the fallout from the multiverse’s arrival.",
    "The second link is slightly more obscure. In the comics, Marvel’s iterations of legendary Arthurian characters Merlin and the Lady of the Lake seek to prevent Camelot’s destruction by projecting the Black Knight’s mind into his 21st century descendant.",
    "Who is this individual? Dane Whitman, who will be played by Kit Harington in Marvel’s upcoming Eternals movie.",
    "So there are more connections between Marvel’s upcoming slate than we realize. Could we see Dane and Shang-Chi fight together to stave off a space dragon attack? It’s possible, but it depends on whether Whitman attains his powers in Eternals or not, and whether Marvel wants the pair to unite on the big screen.",
    "Might we even see a magic Avengers lineup that features Doctor Strange, Scarlet Witch, Shang-Chi, Black Knight and Loki in the future? Something along the lines of Firaxis Games' forthcoming video game Midnight Suns, perhaps?",
    "It would make for an unusual but fun team-up, particularly if a Young Avengers movie isn’t coming yet. Magic is becoming a more prominent part of the MCU, so we wouldn’t completely rule it out.",
    "Shang-Chi’s post-credits scene is equally as intriguing as the mid-credits one. We find Xialing in her old bedroom at Wenwu’s compound. Razor Fist (Florian Munteanu) arrives and says “they’re here”.",
    "The duo walk to Wenwu’s throne room, which overlooks the courtyard where he used to train his Ten Rings warriors. Surprisingly, Xialing sits on the throne as the camera pans back to reveal that a new generation of warriors are being trained. The Ten Rings banner is now red rather than black, too, while graffiti and other art has been daubed on the compound’s walls.",
    "The screen turns black but, as it does so, a message appears: The Ten Rings will return.",
    "So Xialing is the new leader of the Ten Rings. What does this mean for the organization moving forward? In our view, there are three major ways that the Ten Rings can show up in the future.",
    "The first and most obvious is a Shang-Chi sequel. It’s too early to tell whether he’ll get a follow-up movie but, if he does, Shang-Chi may enlist his sister’s help with whatever problem arises.",
    "Next, the Ten Rings could appear in a Marvel TV series. How about Armor Wars, the upcoming show that will star Don Cheadle as War Machine? Iron Man has a history with the Ten Rings thanks to Iron Man 3, so maybe Xialing’s forces steal some of Stark’s old technology and weapons for their own means. War Machine, then, could be tasked with recovering them for the US Government.",
    "Finally, the Ten Rings might get their own dedicated TV show. If Xialing wants to take them in a heroic direction, the Ten Rings could attempt to stop other organized crime in the region. It may work best as a grounded show in the vein of Falcon and the Winter Soldier, and could build on Asian traditions, cultures and societal values that the MCU had been devoid of until Shang-Chi.",
    "However Shang-Chi’s adventures, and those of the Ten Rings, play out from now on, we’re excited to see how Marvel integrates them into the MCU."
  ],
  "headers": {
    "5": "Shang-Chi ending explained: how does the MCU movie end?",
    "15": "Shang-Chi mid-credits scene explained",
    "30": "Shang-Chi post-credits scene explained"
  },
  "links": {}
}