{
  "source": "https://www.techradar.com/news/were-finally-getting-a-ps5-pro-controller-but-its-not-being-made-by-sony",
  "title": "We’re finally getting a PS5 pro controller, but it’s not being made by Sony",
  "category": "gaming",
  "updated": "2021-12-06T10:00:18Z",
  "author": "adam-vjestica",
  "summary": "The Scuf Reflex will finally give PS5 gamers a competitive edge",
  "article": [
    "A PS5 pro controller is finally on the way thanks to renowned manufacturer Scuf, which should give PlayStation gamers an edge when playing online.",
    "Sony doesn’t have its own version of the Xbox Elite Wireless Controller Series 2, but the Scuf Reflex promises to deliver the types of competitive features pro gamers have come to expect.",
    "A full reveal of the Scuf Reflex is yet to take place, but the company says it has been “painstakingly designed from the ground up for instantaneous reaction times to get you the most wins.” The PS5 pro controller will also include “removable paddles” and “bumpers that make all your movements smoother than ever before.”",
    "With pro gaming and esports continuing to rise in popularity, more gamers are investing in hardware that can help make them as competitive as possible. Having the right controller can work wonders, and definitely deliver a competitive advantage in titles like Call of Duty: Vanguard and Fortnite.",
    "You can sign up to be among the first to purchase the Scuf Reflex here.",
    "Unlike Microsoft, Sony hasn’t created an official pro controller for its consoles yet. Instead, it chose to release the DualShock 4 Back Button Attachment add-on for the PS4, which added two remappable paddles that are often found on competitive pads.",
    "Unfortunately, though, the DualShock 4 Back Button Attachment doesn’t work on the PS5 DualSense controller, and the only other professional-grade pad available right now is the HexGaming Esports Rival Controller 2, which isn’t cheap.",
    "We’re expecting the Scuf Reflex to retail for a similar price to the company’s Xbox-specific Scuf Instinct and Scuf Instinct Pro controllers, which cost $170 / £159.99 and $200 / £189.99 respectively.",
    "With online multiplayer games continuing to be some of the most played titles out there, it’s honestly surprising that Sony hasn’t made its own version of the Xbox Elite Wireless Controller Series 2, which has proven there is a huge market available. Scuf will be hoping to capitalize on this, especially if Sony chooses not to release a pro controller for PS5 this generation."
  ],
  "headers": {
    "5": "Analysis: a PS5 pro controller is long overdue"
  },
  "links": {
    "PS5 pro controller": "https://www.techradar.com/news/ps5-pro-controller",
    "Xbox Elite Wireless Controller Series 2": "https://www.techradar.com/reviews/xbox-elite-wireless-controller-series-2-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "here": "https://scufgaming.com/playstation5",
    "DualShock 4 Back Button Attachment": "https://www.techradar.com/reviews/dualshock-4-back-button-attachment-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5 DualSense controller": "https://www.techradar.com/news/dualsense-ps5-controller-vs-xbox-series-x-controller/uk/reviews/dualsense-wireless-controller",
    "HexGaming Esports Rival Controller 2": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1405381610449768700&xs=1&url=https%3A%2F%2Fwww.hexgaming.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwere-finally-getting-a-ps5-pro-controller-but-its-not-being-made-by-sony",
    "Scuf Instinct": "https://www.techradar.com/news/scufs-instinct-controller-gives-pro-gamers-even-more-choice-on-xbox-series-x"
  }
}