{
  "source": "https://www.techradar.com/news/apple-podcasts-plus-could-launch-soon-should-spotify-be-worried",
  "title": "Apple Podcasts Plus could launch soon, should Spotify be worried?",
  "category": "audio-visual",
  "updated": "2021-04-19T14:47:25Z",
  "author": "hamish-hector",
  "summary": "Apple Podcasts, but better",
  "article": [
    "Apple’s Spring Loaded event is almost upon us, and as it draws near more leaks are popping up to hint at what we could see announced. Alongside a new iPad Pro and iMac for 2021, Apple might unveil a premium podcast service.",
    "According to Peter Kafka from Recode Media, the long-rumored ‘Apple Podcasts Plus’ could join the likes of Apple Music and Apple TV Plus as the latest paid subscription service from the tech giant. There’s no telling what could be included but we’d expect to see exclusive and advert-free versions of shows from various creators in an attempt to better rival Spotify.",
    "Hopefully, none of our favorite podcasts choose to gate themselves off behind the Apple paywall, though we won’t know anything for certain until it’s announced – be that tomorrow or at a later event. If you want to find out what is announced at Apple Spring Loaded we’ll be live blogging all the biggest news from the event as it happens – here’s how you can watch along yourself.",
    "It’s hard to say for certain, but if Apple is launching a premium podcast service we expect it will be the company’s latest move to compete with the likes of Spotify. If Apple can secure exclusive content from some big podcasting names they might be able to claw back a few victories after Spotify snagged huge exclusive deals with the likes of Joe Rogan.",
    "And while we don’t yet know what Apple will offer its collaborators, it could be a win-win for podcast creators. Not only might they be given a large cash incentive to stream exclusively through Apple Podcasts, but they could also be given a production budget boost for a new exclusive show for the premium service.",
    "All of this is only speculation – and there's a decent chance people won't want to pay for yet another premium subscription service – but an Apple Podcasts Plus service has the potential to revolutionize the podcasting space. If Apple comes out swinging at Spring Loaded, it might pull ahead in the podcasting race."
  ],
  "headers": {
    "3": "Why would Apple launch a paid podcast service?"
  },
  "links": {
    "Apple’s Spring Loaded event": "https://www.techradar.com/news/apples-april-20-event-is-official-heres-what-to-expect-including-ipad-pro/news/apple-april-20-spring-event",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iMac for 2021": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "Peter Kafka from Recode Media": "https://twitter.com/pkafka/status/1383878437119479811?s=20",
    "long-rumored ‘Apple Podcasts Plus’": "https://www.techradar.com/news/apple-could-be-planning-a-premium-podcast-subscription-service",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "favorite podcasts": "https://www.techradar.com/news/best-podcasts",
    "how you can watch along yourself": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Spotify": "https://www.techradar.com/reviews/spotify"
  }
}