{
  "source": "https://www.techradar.com/news/e3-2021-the-hosts-for-the-digital-event-have-been-revealed",
  "title": "E3 2021: the hosts for the digital event have been revealed",
  "category": "gaming",
  "updated": "2021-04-28T17:55:10Z",
  "author": "emma-boyle",
  "summary": "Three is a magic number",
  "article": [
    "As the list of game publishers confirmed to be taking part in E3 2021 grows, the ESA has now confirmed the hosts it’s enlisted for this summer’s all-digital show.",
    "E3 2021 will have three hosts, all known personalties within the gaming industry: Greg Miller, the co-founder of entertainment outlet Kinda Funny; Jacki Jing, an Emmy-nominated TV journalist, host and producer who has worked with IGN, Nerdist and others; and Alex ‘Goldenboy’ Mendez, a professional esports commentator and commentator for NBC’s The Titan Games.",
    "These three hosts will share the job of guiding this year’s show, which is to be a four-day broadcast taking place between June 12 and June 15. They'll be providing commentary, interviews with publishers and developers, and more besides.",
    "E3 is certainly going to be a different experience in 2021. Following the cancellation of 2020’s show due to the coronavirus pandemic, this year’s show is going to be entirely online.",
    "Consisting of a mix of live press conferences from exhibitors and a four-day-long video stream, which the now-confirmed hosts will presumably be leading, the event is going to be completely free for attendees.",
    "Despite being online-only, there’s been an impressive show of support for E3 2021. There are already some big names attached to the show, with Xbox, Nintendo, Ubisoft, Square Enix, Take-Two and Capcom all on the list of confirmed exhibitors.",
    "The notable absence for this year is PlayStation. Sony has confirmed that it will not be participating in the show, stating that it will “continue to focus on delivering the leading and reimagined showcase for video game news, announcements, reveals, networking and interactivity that has made E3 a beloved experience for decades.”",
    "We’re still waiting for a solid lineup for E3 2021’s press conferences, with only Ubisoft so far confirming that its Ubisoft Forward stream will take place on June 12. The announcement of hosts does, however, make the event feel more real and closer than ever, so we imagine more details on the show are just around the corner."
  ],
  "headers": {
    "4": "What to expect from E3 2021?"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "grows": "https://www.techradar.com/news/square-enix-confirms-its-part-of-the-e3-2021-lineup",
    "confirmed": "https://e3expo.com/news/e3-news/e3-2021-digital-event-hosts#:~:text=E3%202021%20Enlists%20Greg%20Miller,Event%20Hosts%20%2D%20Electronic%20Entertainment%20Experience",
    "cancellation": "https://www.techradar.com/news/e3-2020-has-been-cancelled",
    "on the list": "https://e3expo.com/",
    "Sony has confirmed": "https://www.techradar.com/news/sony-is-skipping-e3-again-but-what-does-that-mean-for-ps5",
    "Ubisoft so far confirming": "https://www.techradar.com/news/ubisoft-confirms-e3-2021-conference-details"
  }
}