{
  "source": "https://www.techradar.com/news/who-needs-google-io-google-pixel-6-pro-renders-and-specs-revealed-by-leaker",
  "title": "Google Pixel 6 Pro leak shows off new phone's design - who needs Google IO?",
  "category": "phones",
  "updated": "2021-05-21T08:07:04Z",
  "author": "michael-hicks",
  "summary": "Improved cameras, 6.67-inch display and more",
  "article": [
    "Are you disappointed that the Google IO 2021 keynote didn't give us a proper glimpse of the upcoming Google Pixel 6? Not to worry: an Android tipster has revealed possible renders of the Pixel 6 Pro – an XL-sized upgrade on the Pixel 6.",
    "Leaker OnLeaks gave Digit.In new renders of both phones, claiming on Twitter that Jon Prosser's leaked renders of the Pixel 6 from last week weren't 'flawless'. Instead, his renders supposedly have 'a more accurate look at this device + display size + dimensions'.",
    "The Google Pixel 6 Pro – renamed from the Pixel XL phones of the past – could have a 6.67-inch curved AMOLED display with very thin bezels except for a thicker black strip on the bottom. The Pro itself could measure 163.9 x 75.8 x 8.9 mm (6.45 x 3 x 0.35 in) with an 11.5 mm / 0.45 in camera bump.",
    "The Pixel 6 Pro's camera bump on the back shows off a triple camera array, two sensors, an LED flash and a mic. Digit.In claims that two of the three cameras will be a 'primary wide-angle camera' and a 'periscope telephoto camera'.",
    "Based on previous Pixels like the Pixel 5, you could guess that the third, undefined camera is an ultra-wide lens. Meanwhile, the new periscope camera should give the Pixel 6 Pro much better zooming capabilities for close-up shots – a weak point for some older Pixels.",
    "It also has a punch-hole cutout for the selfie cam. We may have to wait until the Pixel 7 for Google's patented under-display selfie cam.",
    "We also learned that the Pixel 6 Pro could have dual stereo speakers on the top and bottom of the phone (hence the thick bottom bezel). Wireless charging will also return for the Pixel 6 lineup, whereas the Pixel 5's physical fingerprint scanner has been replaced with an in-screen fingerprint sensor.",
    "What didn't we learn? There was no information on the CPU, RAM, storage, display refresh rate, battery life, or other key specs, nor how large the baseline Pixel 6 would be.",
    "The Pixel 6 and 6 Pro are shaping up to be much more exciting than the Pixel 5. Thanks to a striking redesign, plus Google's supposed custom chipset – codenamed Whitechapel – that should make it run the new Android 12 OS faster than any other Android phone.",
    "We can't deny, however, that Google's flagship phones haven't sold particularly well in recent years compared to their budget 'a' phones. The Pixel 6 Pro is designed to compete with flagships from Apple and Samsung, but its biggest competitor could be the smaller, more affordable Pixel 5a.",
    "Then again, our market analysis suggests that small, powerful phones aren't selling well. It could be that Google has decided to 'go big or go home' with its new phones. With a likely Pixel 6 release date of September 2021, we'll know soon if this gamble will get Pixel sales back on track.",
    "(Via Android Central)"
  ],
  "headers": {
    "8": "Will Android users go Pro?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "OnLeaks": "https://twitter.com/OnLeaks",
    "Digit.In": "https://www.digit.in/news/mobile-phones/exclusive-google-pixel-6-pro-rednders-leak-display-design-camera-59483.html",
    "Twitter": "https://twitter.com/OnLeaks/status/1395416470234992640",
    "leaked renders": "https://www.techradar.com/news/google-pixel-6-renders-show-the-massive-redesign-the-range-needs",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "under-display": "https://www.techradar.com/news/google-pixel-6-might-not-have-under-display-camera-but-pixel-7-might",
    "custom chipset": "https://www.techradar.com/news/heres-more-evidence-the-google-pixel-6-will-run-on-a-custom-chipset",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "aren't selling well": "https://www.techradar.com/news/asus-zenfone-8-tests-whether-anyone-wants-small-flagships-instead-of-the-full-sized-samsung-s21",
    "Android Central": "https://www.androidcentral.com/big-new-leak-confirms-google-pixel-6-pro-offers-first-pixel-6-specs?utm_source=ac_tw&utm_medium=tw_card&utm_content=101579&utm_campaign=social"
  }
}