{
  "source": "https://www.techradar.com/news/samsung-leaked-its-own-galaxy-bud-2-earbuds-but-are-they-worth-the-wait",
  "title": "Samsung leaked its own Galaxy Bud 2 earbuds – but are they worth the wait?",
  "category": "audio-visual",
  "updated": "2021-07-20T09:50:43Z",
  "author": "hamish-hector",
  "summary": "The reveal came sooner than anyone expected",
  "article": [
    "If you can’t wait much longer for the rumored August 11 release date of the Samsung Galaxy Buds 2, then Samsung may have a surprise for you. That’s because it has seemingly leaked most details about its upcoming true wireless earbuds through its own Galaxy Wearable app.",
    "Normally leaks don’t come from the source directly, though we should still take this one with a pinch of salt. The Galaxy Buds 2 aren’t official yet, and these app details could be incomplete. With that warning out of the way though, what could we expect from the Galaxy Buds 2?",
    "Well, based on the Galaxy Wearable app (as spotted by Android Community) it looks like the Galaxy Buds 2 will come in five colors (white, black, green, yellow, and purple) and feature active noise cancellation. While previous leaks seemed to include the ability to turn ANC on/off in a single earbud, though, there's no sign of it here – suggesting these earbuds' features aren't quite as comprehensive as we thought.",
    "We also learned that the Galaxy Buds 2 earbuds should each have a 61mAh battery, while the case has a 472mAh battery. This is the same as the Galaxy Buds Pro, meaning we could expect at least a similar battery life. Based on our testing this would be around five hours per charge / 13 hours from the case (ANC on) or seven hours per charge / 20 hours from the case (ANC off).",
    "The Galaxy Buds aren’t stealing everything from the Galaxy Buds Pro though, as some features like 360-degree sound appear to be absent. We hopefully won’t have much longer to wait before they release, as a rumored launch event is happening in under a month on August 11. But even if that’s the case, will the Galaxy Buds 2 be worth waiting for?",
    "There are likely plenty of details about the Galaxy Buds 2 that we don’t yet know, but if you’re anxious to get a new pair of headphones, you probably want to know if they might be worth the wait. Here we’ll compare them to Samsung’s other true wireless earbud offerings, the original Galaxy Buds, and the Galaxy Buds Pro.",
    "The regular Galaxy Buds will be perfect if you’re on a tighter budget. Sure, they won’t have all the bells and whistles of the incoming successor or existing Pro, but they'll cost considerably less thanks to regular discounts on sites like Amazon.",
    "If you’re wanting to splash out, we suggest going for the Galaxy Buds Pro, as they offer improved sound and microphone quality, as well as active noise cancellation. You might also want to check out our list of best wireless earbuds to get an even better audio experience.",
    "As for the Galaxy Buds 2, it looks like they’ll sit somewhere in the middle. Rumored to cost $179 / £129 / AU$239, the Galaxy Buds 2 would be cheaper than the Galaxy Buds Pro but should have improved features and more functions than the original Galaxy Buds. However, if you’re after a pair of wireless earbuds as soon as possible, check out the prices below or look at our roundup of the best budget wireless earbuds."
  ],
  "headers": {
    "5": "Should you wait for the Galaxy Buds 2?"
  },
  "links": {
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Android Community": "https://androidcommunity.com/galaxy-buds-2-details-leaked-through-galaxy-wearable-app-20210720/",
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "best wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "best budget wireless earbuds": "https://www.techradar.com/best/the-best-budget-wireless-earbuds"
  }
}