{
  "source": "https://www.techradar.com/news/iphones-and-androids-could-soon-keep-working-for-much-longer",
  "title": "iPhones and Androids could soon keep working for much longer",
  "category": "phones",
  "updated": "2021-09-06T08:54:37Z",
  "author": "james-rogerson",
  "summary": "Seven years of support",
  "article": [
    "Android smartphones could soon be safe to use for a lot longer, and it’s all thanks to the German federal government, which is trying to get the European Union to require smartphone makers to offer seven years of security updates and spare parts.",
    "That’s according to German tech news site Heise Online, and right now, most Android phones only come with around three years of security updates, and that’s true even if you drop four figures on a top-end handset.",
    "Some such as the Samsung Galaxy S21 range now come with four years of security updates, but that’s at the very top end, so a move to seven years would be a huge improvement. To a lesser extent this would also benefit iPhone users, as Apple tends to top out at around five or six years of software support.",
    "It’s worth noting here that security updates don’t bring new features, so there’s no guarantee you’d get more new versions of Android or iOS if this proposal passes, but your phone would be kept safer from security vulnerabilities.",
    "Whether this will happen though is currently unclear. There’s already a proposal on the table for five years of support, and both that one and this seven-year one have faced resistance from smartphone makers, which broadly want the requirement to just be three years.",
    "So it remains to be seen whether either proposal will actually be approved, let alone the longer seven-year one, but this shows that there’s at least a push to improve the situation.",
    "The arguments in favor of offering more long-term security updates for smartphones are many and varied, and we’ve covered them extensively in the past. But the main reason for it, is that it means you can keep safely using your phone for longer.",
    "Once it stops getting security updates it becomes more vulnerable to hackers and other issues, so ideally you should be upgrading, but many people either won’t want to or won’t be able to afford to do that every two or three years, especially if they’ve bought an expensive phone. Indeed, we’d argue that it’s completely unreasonable to only offer a few years of support for a high-end handset.",
    "Many people also probably aren’t even aware of the threats their un-updated phones face, so by providing security updates for longer, phone manufacturers would be keeping their customers safe, even if those customers don’t realize it.",
    "Making it viable to use phones for longer is also good for the environment of course, as people wouldn’t necessarily be ditching their old phones so often.",
    "That, of course, is one reason manufacturers might not want to support this, as they’re in the business of wanting people to upgrade their phones. Additional security updates also probably add to their costs.",
    "But from a consumer and environmental perspective this extended support would be massively beneficial, and while this proposal would only affect EU countries, there’s a fair chance that manufacturers might roll these updates out globally once they’ve gone to the trouble of preparing them. So this is something we really want to see.",
    "Via Engadget"
  ],
  "headers": {
    "6": "Opinion: longer support is vital"
  },
  "links": {
    "Heise Online": "https://www.heise.de/news/Bundesregierung-Smartphones-sollen-sieben-Jahre-lang-Updates-erhalten-6179995.html",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "covered them extensively": "https://www.techradar.com/news/google-pixel-6-with-5-years-of-support-is-good-but-other-android-makers-must-follow",
    "Engadget": "https://www.engadget.com/germany-phone-makers-7-years-security-updates-163601435.html"
  }
}