{
  "source": "https://www.techradar.com/news/apple-will-finally-let-you-repair-your-own-iphone-13-or-iphone-12",
  "title": "Apple will finally let you repair your own iPhone 13 or iPhone 12",
  "category": "phones",
  "updated": "2021-11-17T14:48:54Z",
  "author": "james-rogerson",
  "summary": "Or your Mac",
  "article": [
    "It’s about to get a little bit easier to repair an iPhone 13 or iPhone 12, as Apple will soon let you do it yourself.",
    "The company has announced that it’s launching Self Service Repair, which allows users to access manuals and parts for iPhone repairs. You’ll be able to order the parts from an Apple Self Service Repair online store, with over 200 parts and tools set to be offered initially.",
    "These parts will allow for the repair of the most common iPhone problems, including many of those that affect the display, camera and battery, but the company promises to expand the number of supported repairs over time.",
    "This initial service is launching in the US in early 2022, for both the iPhone 12 and iPhone 13 ranges, but it will expand to other countries throughout the course of the year, as well as expanding to include repairs for Mac computers featuring M1 chipsets.",
    "Apple also notes that customers who return their used parts for recycling will receive credit towards the parts they purchased to carry out the repair.",
    "We’d think it’s likely that other Apple devices such as iPads, and perhaps older iPhones, will be added to the service over time, but that remains to be seen.",
    "This could be a really useful service for some Apple customers, but the vast majority will probably still be best off getting repairs done the old-fashioned way.",
    "Apple emphasizes that Self Service Repair is intended for users who are technicians with the knowledge and experience to repair electronic devices, which probably counts out most iPhone owners.",
    "Plus, it doesn’t seem like Apple makes its devices super easy to repair. While access to official parts and manuals will help, an iFixit teardown of the iPhone 13 Pro awarded it a repairability score of just 5/10, and every model in the iPhone 12 range was awarded a 6/10. So repairs are probably best left to the experts.",
    "The good news is there’s no shortage of them, with more than 5,000 Apple Authorized Service Providers and 2,800 Independent Repair Providers being available to help."
  ],
  "headers": {
    "6": "Analysis: just because you can, doesn’t mean you should"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "announced": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6662429302605234000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F11%2Fapple-announces-self-service-repair%2F",
    "iFixit teardown": "https://www.ifixit.com/Teardown/iPhone+13+Pro+Teardown/144928"
  }
}