{
  "source": "https://www.techradar.com/news/battlefield-6-reveal-trailer-could-be-shown-in-june",
  "title": "Battlefield 6 reveal trailer could be shown in June",
  "category": "gaming",
  "updated": "2021-06-11T16:56:44Z",
  "author": "adam-vjestica",
  "summary": "Will we finally see Battlefield 6 in action?",
  "article": [
    "The first Battlefield 6 (now confirmed to be Battlefield 2042) reveal trailer could be shown in June, according to the game’s official Twitter account, which should finally give us a definitive look at DICE's upcoming first-person shooter.",
    "In a teasing tweet, the Battlefield 6 official account wrote: “Words that rhyme with Soon. June. Boom.”",
    "It doesn’t take a detective to determine when we’re going to get some more information on the next Battlefield, then, but exactly what remains to be seen. We'd be shocked, though if it wasn't the Battlefield 6 reveal trailer.",
    "The word “boom” indicates that we’ll finally see Battlefield 6 in action, with the game’s first trailer tipped to show an island location with aerial combat and extreme weather conditions that will impact gameplay. Apparently the game will see tornados causing havoc during matches, which could spice things up considerably. The game is also tipped to have wacky cosmetics and armed robot dogs.",
    "EA had promised that Battlefield 6 would be revealed in Spring (between March and June), so we’re fairly confident that we’ll finally see some gameplay of Battlefield 6, and possibly get a release date too.",
    "The reveal may coincide with E3 2021, which takes place on June 12 to June 15 this year and is a digital only event. It's also when the marketing for Battlefield tends to ramp up, with a release set for Holiday 2021 (between October and December).",
    "Battlefield 6 developer DICE recently shared more information in a blog post that said the team is working on “creating a jaw-dropping experience” and that the sixth entry has “everything we love about Battlefield – and takes all of it to the next level.”",
    "The game promises to deliver all-out military warfare with crazy, unexpected moments, game-changing destruction and massive battles. The game will be packed with more players and mayhem than ever before, though we still don’t have an exact figure as to how many players there will actually be.",
    "Battlefield 6 will hopefully be a return to form for the long-running series, which arguably fell flat after the release of Battlefield 5. It allowed Call of Duty to regain its foothold as the premiere first-person shooter, with Call of Duty: Warzone, the game’s free-to-play battle royale mode, a large factor in turning the fortunes of Activision’s blockbuster franchise."
  ],
  "headers": {
    "6": "Battlefield 6 \"takes it all of it to the next level\""
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "wacky cosmetics": "https://www.techradar.com/news/battlefield-6-will-have-a-customizable-robot-dog-says-leaker",
    "robot dogs": "https://www.techradar.com/news/battlefield-6-could-add-robot-dogs-to-your-arsenal",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "blog post": "https://www.ea.com/en-gb/games/battlefield/news/battlefield-franchise-update-oskar-gabrielson",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone"
  }
}