{
  "source": "https://www.techradar.com/news/demand-for-private-4g-and-5g-set-to-create-multi-billion-dollar-market-by-2024",
  "title": "Demand for private 4G and 5G set to create multi-billion-dollar market by 2024",
  "category": "computing",
  "updated": "2021-01-19T11:13:46Z",
  "author": "steve-mccaskill",
  "summary": "Businesses are clamouring for their own connectivity",
  "article": [
    "Demand for private cellular networking equipment to support mission critical applications will see the market reach $5.7 billion by 2024, according to a new study by IDC.",
    "A private cellular network is one that provides dedicated access to a specific customer, using either licensed, unlicensed or shared spectrum, with no resources shared by any third party.",
    "By pursuing this route, customers can define the scale, pace of rollout, and technology used, while guaranteeing a certain level of performance for their applications.",
    "IDC says many businesses are deploying private 4G networks but some are starting to invest in private 5G infrastructure. Although 5G will result in more advanced consumer mobile data services, most operators consider the technology’s real potential to be in the business market.",
    "5G promises ultrafast speeds, greater capacity, and ultra-low latency – characteristics that will allow mission critical business applications to be powered by a mobile network for the first time.",
    "Such qualities will also pave the way for the creation of new, revolutionary use cases. These include the Industrial Internet of Things (IIoT), robotics and Mixed Reality, all of which require reliable, real-time transmission of data.",
    "IDC says the market is being driven by mission critical, industrial, and traditional applications, and will grow at an annual rate of 43.4% over a five-year period.",
    "“Private LTE infrastructure is already used by select verticals worldwide to solve mission-critical networking challenges. However, the barrier to consumption has remained high, limiting adoption to organizations possessing in-house competency and access to dedicated spectrum,” said Patrick Filkins, senior research analyst, IoT and Mobile Network Infrastructure.",
    "“With more spectrum being made available for enterprise uses, coinciding with the arrival of commercial 5G, interest has grown toward using private LTE/5G solutions as a basis for connectivity across a multitude of mission-critical, industrial and traditional enterprise organisations.”",
    "The growing popularity of private networks, coupled with 5G use cases, is accelerating the convergence of the telecoms and IT industry. For examples, telecoms equipment manufacturers such and mobile operators are partnering with cloud firms such as Microsoft, Google and Amazon Web Services (AWS)."
  ],
  "headers": {
    "3": "5G business"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}