{
  "source": "https://www.techradar.com/news/bad-food-and-bands-ive-never-heard-of-the-sims-4-music-festival-is-almost-the-real-thing",
  "title": "Bad food and bands I've never heard of: The Sims 4 music festival is almost the real thing",
  "category": "gaming",
  "updated": "2021-07-03T09:00:41Z",
  "author": "vic-hood",
  "summary": "Opinion: The Sims 4 music festival was more Fyre than Glastonbury",
  "article": [
    "I’ve never attended a proper music festival. Sure, I’ve attended one-off days of live outdoor concerts but nothing that comes close to the likes of Glastonbury or Shambhala. According to friends, the true “festival experience” is an entirely different affair than what I’ve partaken in. Their tales paint the picture of a weekend of debauchery, live music and (most likely) rain - as well as some unsavory bathroom options.",
    "But, thanks to my anxiety, the prospect of committing to this for a weekend - in a field of thousands - is a nightmare. What would I do if I had an anxiety attack? How would I get home? What if I got lost? These compulsive and ever-nagging questions pick away at me every time I optimistically hover over the “buy now” button for festival tickets, ultimately winning out and leaving me with the determination that one day I will silence them and go. And I finally did pluck up that courage, only for the ongoing pandemic to shut down my quest once again.",
    "So when EA Maxis announced The Sims 4 would host an in-game music festival called Sims Sessions, I was excited. Sims Sessions was set to marry two of my loves: The Sims and live music (albeit in its own Sim-like way). And while Sims Sessions was ultimately a letdown, it did finally let me attend a music festival - despite my anxiety.",
    "Anyone who owns The Sims 4 can attend the Sims Sessions music festival from June 29 through July 7. You simply have to mosey on over to Magnolia Blossom Park in the Willow Creek neighborhood. A ticket that appeared in my Sims inventory told me the festival would take place on Sundays (in Sims time) between noon and midnight, so I had my Sim, April Jones, gussy up and make her way over.",
    "Here I fell into what seems to be the first issue of festival-going: finding the festival site. The ticket said the site would be “at the riverbend”, so I searched all over for (what I assumed would be) a big ol’ festival site. So imagine my disappointment when I located the site, only to find it was a measly little section of the park with a lowkey stage, three tents, a craft table, a merch stand, some toilets and a food stall. It wasn’t exactly what I imagined – the sort of thing that could be put up in your digital backyard for a few Simoleons, presumably.",
    "What I assumed the Sims Sessions would involve was a whole new lot that would be available for Sims to visit continuously through the festival period - or even just a weekend - with acts performing at set times, but otherwise allowing players to get nestled into festival living. It was like turning up to a party and realizing only you and Drew from accounting have shown up, you’re not in for a good time and it’s too late to back out.",
    "In an effort to get the “festival experience” I bought a tent from the merch stall and unceremoniously set it up right in front of the stage, which a colleague has since pointed out is a “rookie mistake”. “You don’t want to be that close to the music, and the drunks trampling your tent at the end of the day”, he advised. The lack of an actual camping site made placement non-negotiable and I pushed to the back of my mind why they were selling tents with no room - I bought a campfire and pop-up bench too, where the hell was that going to go? Probably next to the bins in my back garden. Lovely.",
    "The experience may leave a lot to be desired, but the main draw of Sims Sessions was meant to be the lineup. The festival featured musical performances from real-life artists (in Sims form) Bebe Rexha, Glass Animals and Joy Oladokun. What happened to Katy Perry? I’ll be honest: I had no idea who any of these artists were. But it didn’t stop me from picking up their t-shirts at the merch stand and bopping along to their...ballads?",
    "Yes, while all three performed one song each beautifully in Simlish - the festival only featured three songs total - each one was a piano-accompanied ballad: Joy Oladokun performed Breathe Again, Glass Animals (well, the lead singer) performed Heat Waves and Bebe belted out Sabotage. Not exactly the best for moving and/or grooving to, but it was nice. What made it all a bit anticlimactic was the fact there were only like 10 Sims in attendance, including April Jones.",
    "I’ll be honest, I started to tune out about half way through the performances and began to pursue some other festival activities that I’ve heard are “essential”. I paid for an overpriced slice of pizza, I picked up some more rubbish I didn’t need, I used the temporary bathrooms (no queuing required) and I attempted to chat up a fellow festival goer. The pursuit of this festival romance was also tarnished by a guy who literally stood between April Jones and Zoe-whatever-her-name-is and attempted to chat up my temporary beau. But I had the last laugh as I attempted to entice her back to my poorly placed tent, only to find you can’t woohoo on festival grounds. Which apparently is very unlike real festivals (though probably advisable).",
    "The whole event only lasted 12 hours and as I meandered back to my tent (alone), the whole setup disappeared from around me, with my Sim being unceremoniously booted from the site as soon as she woke up. From what I've gathered, this is a much worse affair when you’re suffering from the previous night’s activities.",
    "Sims Sessions was a bit of a disappointment, and a bit more like Fyre Festival than Glastonbury, but it was still my first festival experience. Sure, it’s not even close to being like a real music festival but, to be honest, it’s unlikely any game could truly capture that magic.",
    "Someday I’ll finally know what that real-life experience is like for myself. I’ll know what it feels like to be up to my knees in mud, woohooing in tents, belting my lungs out to my favorite anthems and in debt for dry shampoo.",
    "Until then, The Sims 4 let me attend a music festival on my terms - and I could leave anytime I wanted."
  ],
  "headers": {
    "3": "Capturing the “festival experience”",
    "7": "Sims Sessions",
    "11": "On my terms"
  },
  "links": {}
}