{
  "source": "https://www.techradar.com/news/cios-need-flexibility-to-drive-post-covid-19-work-experience",
  "title": "CIOs need flexibility to drive post-COVID-19 work experience",
  "category": "computing",
  "updated": "2021-05-13T08:57:01Z",
  "author": "suzanne-adnams",
  "summary": "How CIOs can embrace flexible working post Covid",
  "article": [
    "Despite the extensive obstacles and devastations caused throughout COVID-19, one silver lining to emerge from the rubble, is the global shift experienced from working in an office to working from home. This shift has shattered long-held beliefs about the relationships between work environment, productivity and responsibility.",
    "As a result, the post-COVID work environment now demands radical flexibility in work policies, changing work patterns and how the office supports different working requirements. In response, CIOs can lead workers and support the organization by implementing flexible work models that meet evolving employer and employee needs.",
    "Global research data collected throughout 2020 from all areas of the business highlight the changing expectations about the post-COVID work experience, with results pointing out that a return to a pre-COVID work environment is not desired.",
    "Employees feel strongly about having this flexibility, with half the survey respondents indicating they would leave their current employer if they are not offered a work-from-home option. Moving to a flexible work environment, however, introduces new variations of work patterns that were not part of most workplaces in the pre-COVID experience.",
    "These emerging work patterns that we continue to hear about and discuss include the employer office, home office and hybrid, however we’re also seeing a seeing a fourth pattern - borderless - taking shape in some organizations, with its own unique characteristics.",
    "The borderless pattern represents truly remote workers (employees, freelancers, contractors or gig workers) who are not in the same locality, region or perhaps country, and who work on a different schedule and arrangement. Organizations moving into a flexible work environment should expect this pattern to emerge and be relatively small at first, with the potential to increase over time, as organizations become more comfortable with the flexible work environment.",
    "Findings from current surveys reveal that clients expect that 57% of their workforces could work entirely remotely and 63% could work remotely at least sometimes. Business leaders must plan for the home office to be the primary workspace for more than half of the workforce in the post-COVID work environment. This dramatic shift in work location means that working from home can no longer be considered an exception to the normal workplace.",
    "As organizations make this transition, current remote work policies which were developed on the premise that working from home was an exception that required special criteria, justifications and approvals, will no longer be effective for guiding decisions and conducting workforce planning where location and schedule flexibility are the norm.",
    "Retiring the legacy remote work policy and replacing it with a new flexible work policy sends a clear signal across the enterprise, to management and workers, that the work environment is changing to accommodate new patterns and expectations.",
    "The traditional office was designed to function for a single, dominant work pattern: employees commuting into the location, sitting at a workstation, doing their assigned tasks within a set schedule and commuting home. Amenity places such as lunch rooms and other work and social function areas, when available, were viewed as secondary spaces but not necessities. In the post-COVID-19 workplace, the employer location requires a significant redesign to accommodate new work patterns.",
    "The post-COVID-19 office design should not be focused on replicating a workstation environment of the past, but instead designed to deliver a range of alternative work experiences. Some examples of creative use of space would be adding the potential use of “green spaces” as a restorative antidote to the cabin fever/social isolation of a home office. With business travel significantly reduced or eliminated, workers report that they miss the reflection and thinking time that travel provided. Consider creating retreat spaces similar to travel lounges to recreate that environment and experience."
  ],
  "headers": {
    "2": "Embrace flexible work patterns",
    "6": "Communicate new workplace expectations",
    "9": "Determine functional purpose of space",
    "11": "CIO actions:"
  },
  "links": {
    "office": "https://www.techradar.com/best/best-office-desks",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "employee": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "remote": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams"
  }
}