{
  "source": "https://www.techradar.com/news/plex-media-streamer-what-is-it-is-it-free-and-how-to-get-it",
  "title": "Plex Media Streamer: what is it, is it free and how to get it?",
  "category": "entertainment",
  "updated": "2021-01-26T16:56:24Z",
  "author": "ritoban-mukherjee",
  "summary": "Create your own streaming library with ease",
  "article": [
    "The Plex Media Streamer is an online application that enables you to stream your own media files through a private network to a device of your choosing. If you’re arriving from a streaming service like Netflix, Plex’s interface will feel very familiar.",
    "However, they only look the same. There’s a fundamental difference in concept between a media server like Plex and a streaming service like Netflix. In this article, we will go over everything as we explain what you need to know to get started with Plex.",
    "Well actually...Plex is a media server. Instead of streaming from a pre-designed library of shows and movies, it allows you to upload your own media files and stream them from any device of your choosing.",
    "On a streaming service like Netflix or Hulu, you pay a monthly subscription fee to access a library of shows and movies that you can watch from a device of your choice. With Plex, you host your own movies and shows.",
    "There’s a server: a desktop computer that’s always online and houses your entire collection of digital media. And then there’s the clients: desktops, laptops, smartphones, tablets, and smart televisions that can be used to remotely stream the server’s collection from afar.",
    "It’s hard to keep physical copies of all your favorite shows when you’re constantly running out of storage space. Streaming services are alright, but their libraries are always changing to make room for new shows by getting rid of old ones. If you want a service that combines the flexibility of digital storage with the permanence of physical storage, Plex might be the thing for you.",
    "Plex is available completely free of charge, and all you need to do is download the server-end software on your desktop to get started.",
    "However, Plex also offers a premium version of its service known as Plex Pass. For the monthly price of $4.99 USD, you gain access to a bunch of additional features: 4K support, offline downloads, and hardware transcoding. While a premium subscription is a steal at its current price, you probably won’t need one unless you are a very active user.",
    "Just head over to the website and download the server-side app to get started. To do that, you will need to sign up for a new account, click on your profile icon, and select Get Plex Apps.",
    "Once you have downloaded Plex Server to your Windows, Mac, or Linux PC, you can just point it to a directory within your computer that contains your digital media collection. Plex will automatically sync your collection with its library and display your media files on its client-side apps using the attached metadata. Note that your server computer will need to be online at all times for Plex to work.",
    "You will then want to download the client-side app on your preferred device(s), be it Windows, Mac, Android, or iOS. By logging into the client-side app, you can stream your media collection straight from your server computer.",
    "Plex is a media streamer that’s changing the way people manage their digital libraries. It’s available free of charge on a range of devices like Windows, Mac, Linux, iOS and Android.",
    "If you are looking for a readymade collection of shows and movies that you can start streaming from wherever you are, Plex might not be for you. However, if you are looking for a sustainable way to store and access all your existing media, this free service might just be worth your time."
  ],
  "headers": {
    "2": "What is Plex Media Server?",
    "6": "Is it free to use Plex?",
    "8": "How to get started with Plex?",
    "11": "Plex Media Streamer: what is it, is it free and how to get it?"
  },
  "links": {
    "Plex": "https://www.techradar.com/reviews/plex",
    "Hulu,": "https://www.techradar.com/reviews/hulu",
    "download the server-end software": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3586270146622633500/https://www.plex.tv/en-gb/apps-devices/",
    "head over to the website and download the server-side app": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2365197749437601300/https://www.plex.tv/"
  }
}