{
  "source": "https://www.techradar.com/news/oneplus-9r-is-the-oneplus-9-lite-weve-been-expecting-but-its-just-for-india",
  "title": "OnePlus 9R is the OnePlus 9 Lite we've been expecting, but it's just for India",
  "category": "phones",
  "updated": "2021-03-18T14:23:49.239Z",
  "author": "james-peckham",
  "summary": "Or at least that's what it seems like so far",
  "article": [
    "March 23 is the launch date for the OnePlus 9 series, and the company has just confirmed a third entry in the family of devices called the OnePlus 9R.",
    "The OnePlus 9R was confirmed by the company's CEO Pete Lau in an interview with News 18, and alongside the name of the device Lau seemingly confirmed it was an India-exclusive handset.",
    "Lau didn't entirely confirm it wouldn't come to other markets, but his wording suggests the OnePlus 9R is at least debuting as an India-only phone and that it's unlikely we'll see it in other locations.",
    "That likely means you won't be able to buy it around the rest of the world, so you'll probably be restricted to either the OnePlus 9 or the OnePlus 9 Pro, along with the OnePlus Watch, which the company has also confirmed it's launching next week.",
    "We've yet to see the design of the OnePlus 9R, and the company has yet to confirm many of the features the upcoming handset will have. We know that this is a 5G phone, but little else has been shared about the handset.",
    "Lau suggests the specs will be impressive though referring to this as a \"premium-tier device at a more affordable price point in India\".",
    "Lau said, \"Featuring the latest technologies that we see as must-have features of a flagship, the OnePlus 9R is targeted to empower users with smooth scrolling, immersive gaming controls and a superior viewing experience effectively bringing our flagship experience to more users.\"",
    "OnePlus has been consistently teasing details of its upcoming phones, so we may hear more ahead of March 23. Lau also commented on the success of the OnePlus Nord series in India, and he says that was an inspiration to bring the OnePlus 9R to the market.",
    "We don't yet know how much the OnePlus 9R will cost in India. We can make an estimate that with the top spec OnePlus Nord costing Rs 29,999 in the country and the OnePlus 8T starting at Rs 42,999 we may see this phone somewhere around the Rs 35,000 mark.",
    "That's just an estimate though, so we'll likely have to wait until the company's March 23 launch event to hear an accurate price.",
    "Via Android Authority"
  ],
  "headers": {},
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "News 18": "https://www.news18.com/news/tech/exclusive-oneplus-9r-signals-return-of-the-flagship-killer-gaming-credentials-and-made-for-india-3547673.html",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "Android Authority": "https://www.androidauthority.com/oneplus-9r-1209601/"
  }
}