{
  "source": "https://www.techradar.com/news/death-strandings-ps4-to-ps5-upgrade-isnt-hideously-expensive",
  "title": "Death Stranding's PS4 to PS5 upgrade isn't Hideo(usly) expensive",
  "category": "gaming",
  "updated": "2021-09-22T09:11:20Z",
  "author": "adam-vjestica",
  "summary": "Keep on keeping on, for less",
  "article": [
    "If you own Death Stranding on PS4 and fancy upgrading to Death Stranding: Director’s Cut on PS5, you’ll be pleased to know that it’ll only cost you $5 / £5 / AU$10 to do so.",
    "Sony has typically charged $10 / £10 / AU$20 for PS4 to PS5 upgrades, with some games, such as Ghost of Tsushima: Director's Cut priced slightly higher, as it included a large chunk of additional content in the form of the Iki Island DLC.",
    "That’s not to say you don’t get a significant amount of new things to do in Death Stranding: Director’s Cut. Hideo Kojima’s enigma of a game that sees you making deliveries as The Walking Dead’s Norman Reedus includes enhanced visuals, a firing range, new story missions, combat mechanics, traversal options, and, bizarrely, a racing mode.",
    "The game also features a ‘wide mode’, which adds horizontal black bars to the top and bottom of the screen and changes the aspect ratio from 16:9 to 21:9. The wide mode in Death Stranding: Director’s Cut will let players see more enemies, items, and the foreground.",
    "As you’d expect, the PS5 version of Death Stranding will also take advantage of the DualSense controller’s haptic feedback and adaptive triggers, as well as the PS5’s 3D audio, which can now be played through your TV speakers.",
    "The fact you can cheaply upgrade the PS4 version of Death Stranding means it's a good idea to pick up a disc version, which is cheaper than the game on the PlayStation Store. Of course, if you have a PS5 Digital Edition, you're out of luck.",
    "It’s honestly refreshing to see a smaller fee for a PS4 to PS5 upgrade, although Sony’s approach is still at odds with Microsoft’s Smart Delivery system, which gives Xbox Series X and Xbox Series S players the best version of the game for free.",
    "That’s not to say Sony hasn’t shown some generosity in the past: the PS4 versions of Ghost of Tsushima, The Last of Us 2, God of War, Horizon Zero Dawn, Ratchet and Clank, and Days Gone all received free updates that enabled 60fps support, though no other visual updates were included.",
    "Sony has said that from 2022, it’ll cost PS4 owners $10 / £10 to upgrade a PlayStation 4 version of the game to PS5. The company recently fell foul of fans after it revealed that Horizon Forbidden West would charge players the same fee to upgrade the PS4 version to PS5 after it was previously claimed that the upgrade would be provided for free. Sony later reverted on this decision due to the backlash.",
    "Death Stranding: Director’s Cut releases on September 24, 2021, for PS5. A sequel is apparently in the works as actor Norman Reedus, who plays Sam Bridges in the game, told Adoro Cinema \"I think we're doing a second Death Stranding. The game is in negotiations right now. So... yay!\""
  ],
  "headers": {
    "6": "Analysis: PS4 players on a budget aren't being left stranded"
  },
  "links": {
    "Death Stranding": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Ghost of Tsushima: Director's Cut": "https://www.techradar.com/news/ghost-of-tsushima-directors-cut-locks-ps5-features-behind-a-paywall-and-thats-dishonorable",
    "The Walking Dead’s": "https://www.techradar.com/news/the-walking-dead-season-11-episode-4-recap-the-reapers-disappoint-as-villains",
    "wide mode in Death Stranding: Director’s Cut": "https://www.techradar.com/news/death-stranding-directors-cut-ultrawide-support-on-ps5-isnt-quite-what-it-seems",
    "DualSense controller’s haptic feedback and adaptive triggers": "https://www.techradar.com/how-to/how-to-turn-off-ps5-adaptive-triggers-and-haptic-feedback",
    "PS5’s 3D audio": "https://www.techradar.com/news/best-ps5-headsets-for-3d-audio-experience-more-immersive-sound",
    "through your TV speakers": "https://www.techradar.com/how-to/how-to-enable-ps5-3d-audio-for-tv-speakers",
    "PS5 Digital Edition": "https://www.techradar.com/news/ps5-digital-edition-vs-xbox-series-s-which-digital-only-console-should-you-buy",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review?region-switch=SG",
    "Days Gone": "https://www.techradar.com/news/the-ps5-will-give-ps4-exclusive-days-gone-a-serious-backwards-compatibility-boost",
    "$10 / £10 to upgrade": "https://www.techradar.com/news/sony-backtracks-horizon-forbidden-west-ps5-upgrade-which-will-now-be-free",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Adoro Cinema": "https://www.adorocinema.com/noticias/series/noticia-160234/"
  }
}