{
  "source": "https://www.techradar.com/news/bad-news-for-gamers-the-new-rx-6600-xt-may-be-obscenely-good-at-cryptomining",
  "title": "Bad news for gamers – the new RX 6600 XT may be obscenely good at cryptomining",
  "category": "computing",
  "updated": "2021-08-11T19:28:01Z",
  "author": "john-loeffler",
  "summary": "32MH/s at just 55W hits a cryptomining sweet spot",
  "article": [
    "The AMD RX 6600 XT isn't even a week old and it's already sold out at major retailers just like every other graphics card. But if new reports about its cryptomining hashrate are true, this card might be even harder to find in the weeks and months ahead.",
    "According to Reddit user Trollatopoulous (flagged by Wccftech), AMD's latest midrange graphics card has the best cryptomining performance of any graphics card to date.",
    "While a mining hashrate of just 32MH/s might not sound like a lot next to the RTX 3090's 125MH/s, cryptomining performance isn't just about raw power. All those mining rigs need electricity to run and the more powerful the GPU, the more energy it's going to need to mine bitcoin, ethereum, or any other cryptocurrency. Unless you're stealing electricity, you're going to need to pay for that power consumption, and electricity costs are a crucial variable in assessing cryptomining profitability.",
    "That's what would make the RX 6600 XT so special. Apparently, it's able to achieve a hashrate of 32MH/s using only 55W, which is much more efficient than getting 114MH/s from 320W as in the case of the RTX 3090, which is 3.5 times faster but consumes nearly six times as much energy. With 330W of energy running six RX 6600 XTs, you could get a combined hashrate of 192MH/s.",
    "We haven't found the RX 6600 XT listed on any of the cryptomining performance charts we follow online like krytex.org, which are much more authoritative than a random Reddit poster, so until this hashrate is more widely confirmed we can't say for sure if there is truly a new cryptomining champion. But if the Reddit prediction does pan out in the next few days and weeks, these cards are going to get much harder to find.",
    "Graphics cards are already scarce due to a slurry of semiconductor scarcity, pent up consumer demand, and high cryptocurrency prices fueling the explosion of cryptomining around the world. This latter factor though has seen a lot more volatility lately, as governments like China and the US start cracking down more aggressively on the practice.",
    "There is also a greater push from within the cryptomining community itself to find \"greener\" ways to mine cryptocurrencies, since the ongoing Climate Crisis is leading more of the public to look critically on the enormous energy consumption of cryptomining. This, in turn, will likely increase pressure for more regulation on cryptomining as it is pretty low-hanging fruit when it comes to curbing emissions, should governments ever start actually taking real steps towards reducing our current level of emissions.",
    "More efficient graphics cards are therefore going to see much more demand in the future, since profit margins are likely to be thinner and power consumption becomes a much bigger factor than processing power. In short, if the RX 6600 XT's hashrate and power consumption is in line with this report, crypto-related demand for these cards will remain high even as it falls for other, more power-hungry cards like the RTX 3080 and RTX 3090."
  ],
  "headers": {},
  "links": {
    "AMD RX 6600 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6600-xt",
    "Trollatopoulous": "https://www.reddit.com/r/Amd/comments/p2ai8r/6600_xt_is_lowkey_the_best_mining_gpu_in_history/",
    "Wccftech": "https://wccftech.com/amd-radeon-rx-6600-xt-low-end-cryptocurrency-mining-king-insane-performance-efficiency/",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "stealing electricity": "https://www.techradar.com/news/bitcoin-rigs-steamroller-video-malaysia",
    "krytex.org": "https://www.kryptex.org/en/best-gpus-for-mining",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}