{
  "source": "https://www.techradar.com/news/i-loved-the-ipad-pros-center-stage-camera-until-i-lost-control-of-it",
  "title": "I loved the iPad Pro's Center Stage camera... until I lost control of it",
  "category": "phones",
  "updated": "2021-07-25T09:00:14Z",
  "author": "david-lumb",
  "summary": "Changing focus from me to someone else? Rude",
  "article": [
    "When Apple announced at its April Spring Loaded event that the next generation of iPad Pro tablets would have a new face-following camera feature called Center Stage, I rejoiced. Finally, an intelligent camera to perfectly frame myself in video chats! But the reality turned out to be, frankly, rude.",
    "Yes, my 11-inch iPad Pro (full disclosure: a loaned device from Apple) will skillfully pan and zoom to center my face and torso in video calls, essentially using the ultrawide camera yet cropping in to the most important subject (i.e. me). Normally – when it’s just me in the call as it has been throughout lockdown – the camera smoothly follows me should I lean in or out or walk around. All was well. And then I went back into the office.",
    "That’s when I discovered that my coworker who sat (safely distanced) behind me would get recognized by the camera, which would pan and zoom to his movements, even if he was turned around. The nerve! My iPad Pro was giving my colleague co-star billing in my own picture!",
    "Listen, I’m not a jealous tech reviewer. I’m happy for my iPad Pro to take video calls with other writers. Really! I can share. But when I’m in the middle of gesturing to illustrate a grandiose metaphor and the camera starts slowly zooming to match the movement of my unaware coworker, I am justifiably peeved.",
    "This is obviously just the camera’s advanced tech trying to capture everything going on in the scene, and something I would never notice while working from home. Being in an office reveals just how much ambient movement gets picked up by the front-facing camera, which benefits calling from a group or handing the iPad off to someone else.",
    "But my offense is rooted in how natural the pan-and-zoom action is, which almost feels like there’s an actual cameraman smoothly reframing the shot every time you shift position.",
    "The effect is truly cinematic, and distracting (in the best way) for others on the call. It lets them know that there is a star being recorded – know what I mean?",
    "It’s just rough when the focus gets shifted and a hypothetical subject of a film-quality video call suddenly, rudely, gets dropped from top billing because someone in the background moved enough to get noticed. I mean, is this a closed set or not?"
  ],
  "headers": {
    "3": "Mr. DeMille, I'm ready for my work Zoom"
  },
  "links": {
    "Spring Loaded event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Center Stage": "https://www.techradar.com/news/6-things-you-may-have-missed-from-apples-spring-loaded-event"
  }
}