{
  "source": "https://www.techradar.com/news/how-to-watch-soul-online-stream-the-new-pixar-movie-on-disney-plus-today",
  "title": "How to watch Soul online: stream the Pixar movie on Disney Plus today",
  "category": "computing",
  "updated": "2021-02-23T10:56:03Z",
  "author": "james-laird",
  "summary": "Instant animated classic stars Jamie Foxx, Tina Fey and more",
  "article": [
    "Starring Jamie Foxx, Tina Fey, Graham Norton and many others, Pixar animated epic Soul is out now on great value streaming service Disney Plus - which now has more than twice the content it did before in many countries thanks to the addition of Star on Disney Plus. Read on as we explain how to watch Soul online and stream the instant Pixar classic today.",
    "Released on Christmas Day 2020, it's certainly not your average cartoon flick on paper, with Foxx leading a stellar and diverse cast. In addition to SNL alumni Fey and British TV personality Graham Norton, cult comedian Richard Ayoade and Golden Globe winner Angela Bassett are some of the other major actors to star in the movie.",
    "Directed by Pixar mainstay Peter Docter (Monsters, Inc; Up; Inside Out), its a film with serious underlying existentialist concepts at play - its more metaphysical moments coming complete with a new-age musical score composed Nine Inch Nails frontman Trent Reznor and bandmate Atticus Ross.",
    "Soul sees Foxx take on the voice acting role of Joe Gardner, a middle school music teacher who's mad about jazz and has always dreamt of being a professional musician. It seems he's about to get his big break after impressing some fellow jazz aficionados with one of his performances, but then...well, then a whole lot happens.",
    "It's difficult to describe the plot of Soul without risking ruining too much, but let's just say that Mr Gardner's performance that night at the Half Note Club is just the beginning of a journey that takes him and his dreams of being a jazz star from this world to the next - and back again?",
    "In fact, Disney Plus has released a whole fair few exclusives recently - from Hamilton to Mulan - but this might be its most exciting VOD launch yet. Follow our guide below as we explain how to watch Soul online and stream the Pixar film today. Spoiler alert: it's as simple as grabbing a great value Disney Plus subscription!",
    "Disney Plus is already cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. Obviously you have to splash the cash at the start, but with so much content to get stuck in to we very much doubt you'll run out of things to watch before the 12 months are up. You're looking at $69.99/£79.99/AU$119.99 for the year.",
    "Or if your interests are farther reaching (and you're in the US), then we'd seriously suggest looking at the fantastic value bundle package. It adds Hulu and ESPN+ to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Helstrom and Normal People. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $12.99 a month.",
    "Disney Plus is showing no signs of slowing down since the service first launched last November and in addition to being the exclusive release platform of new Pixar movies like Soul, subscribers can look forward to Star Wars spin-off The Mandalorian, Mulan, Hamilton, WandaVision and much more.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "Now that Disney has set the precedent of releasing its live-action Mulan remake on the service instead of in theaters through its Premier Access program, expect the company to keep bring more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021.",
    "And finally, there's the new Star payload that most global markets get to enjoy and sees the amount of content available through Disney Plus more than double, with a particular eye to shows grown-ups are going to enjoy. It costs a tiny bit more, but is worth it based on our initial impressions - and you can still save big by going with an annual subscription.",
    "Read more:"
  ],
  "headers": {
    "6": "How to save money on Disney+",
    "8": "What else should I know about Disney+?"
  },
  "links": {
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained",
    "Disney Plus": "https://www.techradar.com/deals/disney-plus-price",
    "Disney Plus subscription!": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-8386607557173779000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "$69.99/£79.99/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1363143962144047600&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN+": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $12.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-2033394522376424000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device"
  }
}