{
  "source": "https://www.techradar.com/news/the-geforce-rtx-3060-is-so-good-at-4k-in-titles-like-call-of-duty-warzone-that-it-made-me-suspicious",
  "title": "The GeForce RTX 3060 is so good at 4K in titles like Call of Duty: Warzone that it made me suspicious",
  "category": "computing",
  "updated": "2021-07-22T12:59:27Z",
  "author": "jess-weatherbed",
  "summary": "DLSS really is witchcraft",
  "article": [
    "Whenever I see the GeForce RTX 3060 discussed online, it isn't uncommon to see folk dissuaded from upgrading to it from their current GPU, often from an older (but still capable) GTX series. The most common reasons for this are that without features like DLSS and Nvidia Reflex, the RTX 3060 is fairly on par with the GTX 1070 Ti, which leads people to believe that this wouldn't be an 'upgrade' at all. Discrediting DLSS is a grievous mistake however, and by overlooking it in favor of beefier GPUs you might actually be overspending, especially if first-person-shooters are your bread and butter.",
    "Call of Duty: Warzone is one of many popular battle royale games to support the feature, and my benchmark of choice given how pleasant it can look at a higher resolution to test just how much a difference DLSS and other features like Nvidia Reflex can make on Team Green's latest entry-level GPU.",
    "According to the Steam Hardware survey, the most popular GPU for gamers is still the NVIDIA GeForce GTX 1060, holding almost 10% of the entire market share. This isn't surprising given how hard newer, more powerful GPUs have been to find over the last year, but we're slowly getting to the stage where new games are increasing their recommended specifications beyond the most common hardware on the market. That means a lot of people will still be looking to upgrade to a recent GPU model in the coming months, but you don't need to overspend if the majority of titles you play support DLSS 2.0, even if you're aiming for 4K quality. Owning a 4K monitor is still a luxury for most, but surpassing 4K (or even 8K when testing the RTX 3090) is a fairly good measure of how much abuse you can throw at a GPU. When I was using the RTX 3060 with my 27-inch Acer Predator XB271HK 4K monitor I found very few issues when the AI-upscaling tool was enabled, and it actually achieved higher framerates than the 60Hz display could actually output. Something to bear in mind with FPS vs refresh rate is that even if your monitor or TV can't actually display more than X amount of frames per second (120FPS on a 60Hz monitor will only display 60FPS), any additional frames will still reduce input latency, but at the risk of a higher chance of screen tearing. The risk vs reward is a personal preference, but you won't visually see those additional frames. I was lucky enough to use something a little more substantial in order to actually see the difference in framerate though, using an Asus ROG Strix XG43UQ. This behemoth 43-inch gaming monitor has an output of 4K at 144Hz and is capable of HDMI 2.1 connectivity – a significant step up from my own 60Hz display, but I'm by no means suggesting you need something quite so luxurious to enjoy the game yourself. Testing the DLSS capabilities at 4K is more for illustrative purposes than a necessity. In fact, I purposely installed the RTX 3060 GPU into an older rig to prove you can get some fairly impressive results without splashing the cash to upgrade your entire system. The PC was rocking an Intel Core i7-5820K CPU that had been installed back in 2015, as well as 12GB of temperamental RAM in need of replacement. When the PC had been purchased six years ago it was capable of playing almost everything you threw at it, but as games got bigger and more demanding it's certainly seen better days.",
    "After I re-downloaded Warzone onto the system, I jumped into a few matches after playing around with the settings. All tests had the resolution set to 3840 x 2160, and prior to removing the GTX 1070 Ti that was already in the PC I was getting an average of 51 FPS. This isn't too dissimilar to what I saw when I got the RTX 3060 all hooked up, which achieved an average of 52 FPS with DLSS, raytracing and Nvidia Reflex disabled, though this tanked to around 30 FPS during heavy gunfire and some cutscenes. Given this is a raytracing capable GPU, I tried a match with the lighting feature enabled and while I certainly wouldn't recommend using anything that tanks your framerate in competitive titles unless you have the frames to spare, the results did fascinate me. I was expecting a jittery, unplayable mess, but the result was a fairly consistent 48 FPS average, with some admittedly terrible dips during cutscenes to 21 FPS. While that put me at a disadvantage, it ran a great deal more smoothly than I was anticipating. And then I enabled DLSS. You'd think i'd get sick of seeing the framerate fly but it really is incredible to see how much of a difference the AI-upscaling feature can make, especially on a display that wasn't limited to 60Hz. Without raytracing I was getting a buttery smooth 96 FPS, though the highest consistent number I recorded during that game was 107 FPS. But then with raytracing I was still getting between 98-89FPS, averaging around 92FPS when just running around the map. I was so suspicious of the framerate that I had to check the settings after the first match to make sure I had actually enabled everything correctly, despite seeing the funky lighting effects during gameplay. Naturally, none of this made me any better at the game but I never excelled at battle royales anyway. For someone who plays Warzone or similar titles daily, the smoother framerate and lower latency achieved by enabling Nvidia features like Reflex and DLSS would certainly give you an advantage over opponents. And for folk like myself who will suck at the game regardless, it just made the experience of playing so much more enjoyable. The gloriously high resolution paired with RTX and higher than expected framerates made me feel like I had just put on my first pair of correctional glasses for the first time, seeing everything in a quality that my brain hadn't previously comprehended possible.",
    "There will be some among you that won't find these results impressive, but given this is the latest entry-level GPU from Nvidia I'm excited about the prospect of accessibility. Introducing DLSS to more titles will open doors for folk with lower-powered machines to play more demanding titles at an enjoyable, even competitive quality that was previously only achieved if you had some cash to drop on powerful hardware. Not everyone can afford the best graphics cards on the market, and results like these have rekindled an excitement that had been previously burnt out from months of watching the state of the GPU market. With Cryptominers buying up available hardware for mining currencies like Ethereum and scalpers taking advantage of stock shortage, PC gaming was almost impossible to access for anyone who didn't have existing hardware. Things are, thankfully, starting to improve, and it seems that with China imposing greater restrictions on cryptomining we might start to see some affordable graphics cards appearing on the shelves again. With that in mind, you can invest in something that sits more comfortably into a lower budget without worrying that it won't have the juice to play your favorite titles, provided they support DLSS."
  ],
  "headers": {
    "2": "Fun with new and old hardware",
    "3": "Watching the numbers",
    "4": "Worth saving your cash?"
  },
  "links": {
    "GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "DLSS": "https://www.techradar.com/news/dlss-games-top-titles-that-support-nvidias-exciting-tech",
    "Nvidia Reflex": "https://www.techradar.com/news/call-of-duty-warzone-gives-nvidia-gpus-another-advantage-with-dlss-reportedly-coming-this-week",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Steam Hardware survey": "https://store.steampowered.com/hwsurvey/videocard/",
    "powerful GPUs": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "4K monitor": "https://www.techradar.com/news/best-4k-monitors",
    "refresh rate": "https://www.techradar.com/news/are-refresh-rates-really-that-important",
    "Asus ROG Strix XG43UQ": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3977904041791070700&xs=1&url=https%3A%2F%2Frog.asus.com%2Fuk%2Fmonitors%2Fabove-34-inches%2Frog-strix-xg43uq-model%2F%3Futm_source%3Dtechradar%26utm_medium%3Darticle%26utm_campaign%3DRTX3060-4K-article-techradar&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-geforce-rtx-3060-is-so-good-at-4k-in-titles-like-call-of-duty-warzone-that-it-made-me-suspicious",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "stock shortage": "https://www.techradar.com/news/whats-the-point-of-releasing-new-gpus-if-nobody-can-actually-buy-them",
    "China imposing greater restrictions on cryptomining": "https://www.techradar.com/news/cryptominers-are-selling-off-rtx-cards-in-bulk-after-chinas-crypto-crackdown"
  }
}