{
  "source": "https://www.techradar.com/news/this-oculus-vr-headset-could-feature-lifelike-resolution-heres-why-that-matters",
  "title": "This Oculus VR headset could feature lifelike resolution – here's why that matters",
  "category": "vr",
  "updated": "2021-10-14T09:32:13Z",
  "author": "rhys-wood",
  "summary": "'Retina resolution' headset is prototyping now",
  "article": [
    "Facebook CEO Mark Zuckerberg has teased a VR headset that's currently in the prototyping stages over at Facebook Reality Labs. The headset probably isn't the Oculus Quest 2 successor we're all waiting for, but according to Zuckerberg, will feature advanced 'retina resolution.'",
    "The Facebook CEO posted an image of himself wearing the prototype headset, stating that he \"spent the day with the Facebook Reality Labs research team in Redmond to demo our next-generation virtual reality, augmented reality and artificial intelligence tech. This one is an early retina resolution prototype.\"",
    "'Retina resolution' refers to the point at which a device's resolution is indistinguishable from real 20/20 vision, meaning that the headset's display could be as clear as the human eye. If the prototyped headset ever reaches a mass market, it could be the first consumer VR product to achieve retina resolution.",
    "A proper retina resolution hasn't yet been achieved by a consumer VR headset, and it's something we don't even expect to see in the Oculus Quest 3. But if Oculus, or any VR company, was able to implement retina resolution into their headsets, it would be a genuinely huge leap in widely available VR technology.",
    "While VR headset resolution, in general, has come on leaps and bounds from earlier attempts like PSVR (which maxed out at a soupy 960 x 1080 to accommodate the lacking specs of the PS4), we still haven't come close to lifelike retina resolution, and we're likely a few years away from that at the least.",
    "But what would retina resolution mean for VR? For one, it would make VR content that's more widely accessible. A resolution comparable to the human eye would significantly reduce motion sickness, as well as that often unshakeable uncanny feeling that lower resolutions produce.",
    "The tech could make augmented reality more immersive, too, as alluded to by Zuckerberg in the quote above. If there's little change between your own vision and that of the VR headset, then AR content like interactive objects and effects can blend even more seamlessly into your surroundings.",
    "We'd be interested to see how retina resolution tech would pan out for gaming, though. Surely, some compromises would have to be made depending on a VR game's graphical fidelity? As such, we're not entirely convinced the tech will be able to keep up with AAA-quality VR titles, not in the first half of this decade at least, as even some of the best VR games right now require powerful headsets like the Valve Index in order to fully enjoy.",
    "Still, retina resolution tech certainly does get the imagination going, if nothing else. We've all marvelled at science fiction-level VR tech in movies and shows before, so it's a little wild to think that we could be stepping ever closer to truly immersive VR, where the difference between your own vision and a device's resolution are negligible at best."
  ],
  "headers": {
    "3": "Analysis: What does retina resolution achieve?"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "posted an image": "https://www.facebook.com/zuck/posts/10113982963226401",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "best VR games": "https://www.techradar.com/best/the-best-vr-games",
    "Valve Index": "https://www.techradar.com/reviews/valve-index"
  }
}