{
  "source": "https://www.techradar.com/news/amds-ceo-gives-us-hope-that-gpu-and-cpu-shortages-will-soon-improve",
  "title": "AMD’s CEO gives us hope that GPU and CPU shortages will soon improve",
  "category": "computing",
  "updated": "2021-05-21T11:53:31Z",
  "author": "darren-allan",
  "summary": "Chip shortage is just a ‘megacycle’ apparently",
  "article": [
    "CEO Lisa Su has again predicted that the supply of AMD’s chips will improve as 2021 rumbles onward, and that the current chip shortage – which is making its effects felt across the entire tech industry, and not just with AMD’s GPUs and processors – is just a ‘megacycle’.",
    "Meaning that while the tech industry in general goes through cycles of increased demand outweighing supply (or vice versa) as a matter of course, this is a particularly pronounced one, in which demand has been massively stoked by the pandemic (spiking hardware sales as a whole load of folks are now working from home rather than going to the office).",
    "This all comes from a Bloomberg report, in which Su observed: “Semiconductors do go through these cycles. There are some times when supply is much greater than demand, and there are some times when demand is much greater than supply. And this particular cycle is special because what we’re seeing is the incredible demand for all things that require chips.”",
    "AMD’s chief executive admitted: “Yes, it’s a lot to manage. But I have to tell you, this industry is also really good at managing these things. And you know, it does take a while for the supply and demand imbalance to balance itself out, but we are very much working together as an industry.”",
    "Su is certainly doing her best not to appear fazed by the ongoing component shortage, but of course as AMD’s CEO, that’s what she’s paid to do: stop the boat from any danger of rocking in terms of investors.",
    "Nonetheless, it’s good to hear what seem to be reasonably firm assertions that the situation will improve regarding AMD’s graphics cards and CPUs throughout 2021, and this backs up similar promises we’ve heard from the company recently.",
    "Just a few weeks back, Su very firmly stated that AMD will be ramping up GPU production with the expectation that RX 6000 series graphics card sales will ‘grow significantly’ as the year progresses.",
    "And on the CPU front, a statement reportedly direct from AMD indicates that incoming new revisions of Ryzen 5000 processors are all about ushering in increased production levels for these chips, rather than revamping them to be faster (as a previous rumor claimed).",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "4": "Firm assertions"
  },
  "links": {
    "current chip shortage": "https://www.techradar.com/news/another-top-source-says-global-chip-shortage-could-drag-on",
    "AMD’s GPUs": "https://www.techradar.com/news/amd-big-navi",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-19/amd-ceo-lisa-su-says-chipmaker-s-path-gets-tougher-from-here",
    "AMD will be ramping up GPU production": "https://www.techradar.com/news/amd-promises-itll-sort-graphics-card-stock-shortages-this-year",
    "new revisions": "https://www.techradar.com/news/amd-has-good-news-and-bad-news-about-its-upcoming-cpus",
    "Ryzen 5000 processors": "https://www.techradar.com/news/amd-ryzen-5000",
    "as a previous rumor claimed": "https://www.techradar.com/news/new-amd-ryzen-rumors-could-be-good-news-for-intel",
    "Tom’s Hardware": "https://www.tomshardware.com/news/amd-ceo-lisa-su-discusses-chip-shortage"
  }
}