{
  "source": "https://www.techradar.com/news/businesses-can-no-longer-access-docker-desktop-for-free",
  "title": "Businesses can no longer access Docker Desktop for free",
  "category": "computing",
  "updated": "2021-09-01T12:28:12Z",
  "author": "sead-fadilpasic",
  "summary": "Want to use the app? Pay up",
  "article": [
    "Popular container company Docker has updated its subscription plans, and no longer allows enterprise customers to use the free version. Current users (with at least 250 employees or $10 million in revenue) have until January 31, 2022, to sign up to a paid subscription model or risk being barred from entry.",
    "In a blog post published by company CEO Scott Johnston, Docker said the current Free, Pro, Team, and Large plans are being replaced by Personal, Pro, Team and Business.",
    "Personal is still going to be free to use, but only for smaller businesses, personal use, education, and “noncommercial open-source projects,” which Johnston says make up roughly half of the company’s user base. Its customers will keep their free access to Desktop, as well as Docker CLI, Docker Compose, Docker Engine, Docker Hub, and Docker Official Images.",
    "The Pro plan will cost $5/month for individuals, while the Team plan will set you back $7 a month. The new Business plan costs at least $21 per user, per month.",
    "Further explaining the details, Johnston said that the Pro and Team plans won’t change that much, while large business users will have to pay for extra features such as registry restrictions, single sign-on, or secure software supply chain management.",
    "“The updated terms for Docker Desktop reflect our need to scale our business sustainably and enable us to continue shipping new value in all Docker subscriptions,” he explained.",
    "As explained by Infoworld, Docker is making substantial changes to its licensing terms, and these changes are just part of the process. Since selling its enterprise business in 2019, Docker has focused on developers that build containerized applications through the Docker Engine container runtime, Hub image repository and Desktop application.",
    "At press time, the Desktop app is installed on 3.3 million computers.",
    "Docker Engine runtime, upstream open source Docker, or Moby projects, have not been changed.",
    "Via: Infoworld"
  ],
  "headers": {
    "4": "Scaling the business"
  },
  "links": {
    "container": "https://www.techradar.com/news/what-is-container-technology",
    "Infoworld": "https://www.infoworld.com/article/3630393/docker-desktop-is-no-longer-free-for-enterprise-users.html"
  }
}