{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-release-date-and-crazy-camera-specs-rumored",
  "title": "Samsung Galaxy S22 release date and crazy camera specs rumored",
  "category": "phones",
  "updated": "2021-07-13T09:12:56Z",
  "author": "james-rogerson",
  "summary": "A 200MP penta-lens camera might be in the works",
  "article": [
    "With only a few flagships left to come in 2021, leakers are already turning their attention to 2022 and the Samsung Galaxy S22 range, which according to the latest leak could land as soon as January.",
    "That’s according to “multiple industry sources” speaking to Pulse News, and while they don’t get more specific than that, January has always looked likely, given that the Samsung Galaxy S21 range landed in January of this year.",
    "That said, the launch this year was slightly earlier than Samsung’s usual February or March window, so there’s a chance it will return to that for the Galaxy S22.",
    "In any case, the release date is only one of the claims made in this report. The site also says that the Samsung Galaxy S22 Ultra will have a penta-lens camera on the back, with a 200MP main sensor and Olympus technology.",
    "There’s a lot to break down there. That 200MP claim is one that we’ve heard before, and we even know that Samsung is working on a 200MP camera. But a recent leak from a reputable source suggested that this sensor won’t actually make it to the Samsung Galaxy S22 range, with the company sticking with a 108MP camera instead. So there’s some disagreement here.",
    "The Olympus branding is also something that we’ve heard rumored before, and other smartphone companies have partnered with camera brands (most recently OnePlus with Hasselblad), so it wouldn’t be surprising. That said, it’s not something Samsung has ever done before, and the cameras on its flagships are usually praised anyway, so it might not be necessary.",
    "Then there’s the claim that the Samsung Galaxy S22 Ultra will have five lenses on the back. This, as far as we know, is a new claim, but it too is possible. That would be one more than the Samsung Galaxy S21 Ultra, but it’s a number that we’ve previously seen on the Nokia 9 PureView, and it could help the S22 Ultra stand out.",
    "On the other hand, we’ve elsewhere heard that the Galaxy S22 Ultra might have a continuous zoom lens (meaning it would offer optical zoom at all levels up to its maximum). That’s in contrast to the S21 Ultra, which only offers optical zoom at 3x and 10x, and to achieve this requires two separate lenses.",
    "Why is this relevant? Because if the S22 Ultra does have continuous optical zoom then it could offer all the functionality of the Galaxy S21 Ultra’s camera (and more) with one less lens. So that would likely mean two new lenses added to the Samsung Galaxy S22 Ultra, with main, telephoto and ultra-wide already accounted for.",
    "We’re not sure what Samsung would choose to add in this case – macro and depth sensors are the obvious options, but they tend to be seen as filler, and aren’t often found on premium phones. So we’re not convinced that both the penta-lens and continuous optical zoom rumors are true, but either one of them could be.",
    "Finally, this report claims that the Samsung Galaxy S22 Ultra will support the S Pen, and that’s no surprise at all given that the S21 Ultra does, though there’s no word on whether there will be a slot for it this time.",
    "For now we’d take all of this with a pinch of salt, but hopefully the Samsung Galaxy S22 range’s specs will become a lot clearer well in advance of its 2022 launch.",
    "Via SamMobile"
  ],
  "headers": {
    "6": "Five lenses could two too many"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Pulse News": "https://pulsenews.co.kr/view.php?sc=30800024&year=2021&no=670245",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "one that we’ve heard before": "https://www.techradar.com/news/galaxy-s22-ultra-could-have-samsungs-best-camera-yet",
    "a recent leak": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-probably-wont-have-a-200mp-camera-after-all",
    "something that we’ve heard rumored": "https://www.techradar.com/news/samsung-could-partner-with-olympus-for-its-next-galaxy-camera-phone",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Nokia 9 PureView": "https://www.techradar.com/reviews/nokia-9-pureview",
    "might have a continuous zoom lens": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-may-have-a-major-zoom-upgrade-and-an-in-screen-camera",
    "SamMobile": "https://www.sammobile.com/news/galaxy-s22-200mp-olympus-camera-january-2022-launch/"
  }
}