{
  "source": "https://www.techradar.com/news/venom-2-post-credits-scene-was-in-flux-until-the-last-minute-says-andy-serkis",
  "title": "Venom 2 post-credits scene was 'in flux' until the last minute, says Andy Serkis",
  "category": "entertainment",
  "updated": "2021-10-05T10:53:48Z",
  "author": "samuel-roberts",
  "summary": "Spoilers follow",
  "article": [
    "Major spoilers follow for Venom: Let There Be Carnage.",
    "Venom 2 has released in the United States, and the mid-credits scene has got a lot of people talking. Why? In the scene, while Venom and Eddie Brock (Tom Hardy) are on vacation after the events of the movie, a flash of light appears to teleport them into the Marvel Cinematic Universe. The film ends with Eddie watching the news report shown at the end of Spider-Man: Far From Home, when JK Simmons' J Jonah Jameson outs Peter Parker as Spidey to the public.",
    "Venom then says \"that... guy!\" as the scene ends.",
    "The clear suggestion, then, is that Eddie has now entered the wider Marvel canon – and is likely on a collision course with Tom Holland's Spider-Man, who's expected to battle an array of villains in December's Spider-Man: Far From Home (Alfred Molina's Doc Ock is the only confirmed foe so far, but more are expected).",
    "Now, Venom: Let There Be Carnage director Andy Serkis has weighed in on the scene, explaining that it was being discussed before he even became involved with the project.",
    "\"[The mid-credits scene was] 100 percent in flux, yeah. It couldn’t have been more in-flux-y if you tried,\" Serkis reveals to THR. \"Yeah, of course, it was something that they talked about from before I even came on to the movie.\"",
    "At one point, Spider-Man – presumably played by Holland – was slated to appear in the second Venom movie. \"There were moments where [Spider-Man] was going to be in the story, potentially, and then he wasn’t. But no, we decided that we wanted to really examine the Venom-verse first. So as we were going through principal photography, the inevitable discussions had to be had, but it wasn’t until very, very late on that we reached the precise notion of the teaser that we wanted to lay in there.\"",
    "It's unclear how or when Venom's story will follow up from here, but it's an intriguing twist that suggests a unification of the Spider-Man spin-off universe and the MCU – something perhaps made possible by the Loki season 1 finale, when the Multiverse was unleashed.",
    "Venom: Let There Be Carnage is out now in the US. UK viewers who want to see Venom 2 have to wait until October 15 – given how rife spoilers are for this scene, the delayed release date looks more and more like a poor choice. (No Time To Die's September 30 UK release is likely to blame for that one. )",
    "Let's recap, then: we know Doc Ock is in the third Tom Holland Spider-Man movie. Electro actor Jamie Foxx has previously stated he's in the film. Green Goblin Norman Osborn is heavily hinted at in the trailer, and rumors have circulated Willem Dafoe will return to the role.",
    "That's three out of six. Let's speculate on the others. Could Venom be another member of a possible Sinister Six in the next Spidey film? Surely the timing of releasing Venom just two months before No Way Home is relevant to the events of that movie, given this mid-credits scene?",
    "That would leave two slots in the Sinister Six. Tom Holland already has two villains in his own universe – Michael Keaton's Vulture and Jake Gyllenhaal's (apparently) dead Mysterio. That would make six. Is this what No Way Home is actually about, and is that why Peter's going to need help this time around?",
    "Rumors are rife that Tobey Maguire and Andrew Garfield will appear as their respective Peter Parkers in this movie, of course, but that's never been confirmed by Sony or Marvel. On December 17, we'll finally find out when No Way Home releases."
  ],
  "headers": {
    "9": "Analysis: could the Sinister Six assemble in No Way Home?"
  },
  "links": {
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Spider-Man: Far From Home": "https://www.techradar.com/news/sorry-spider-man-no-way-home-isnt-as-secretive-as-mcu-fans-are-making-out/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "THR": "https://www.hollywoodreporter.com/movies/movie-features/venom-let-there-be-carnage-mid-credits-scene-andy-serkis-1235024005/",
    "Loki season 1 finale": "https://www.techradar.com/news/loki-episode-6-recap-a-disappointing-season-finale"
  }
}