{
  "source": "https://www.techradar.com/news/disney-plus-confirms-star-wars-the-bad-batch-season-2-is-on-the-way",
  "title": "Disney Plus confirms Star Wars: The Bad Batch season 2 is on the way",
  "category": "entertainment",
  "updated": "2021-08-05T15:10:19Z",
  "author": "hamish-hector",
  "summary": "The Star Wars animated series will continue",
  "article": [
    "Ahead of the show’s season 1 finale, Disney Plus has announced that Star Wars: The Bad Batch will be getting a season 2. Fans will pleased to learn the follow-up season is due to arrive in 2022 – so unlike The Mandalorian season 3, you won't have to go more than a year without learning what happens next.",
    "The Bad Batch is a spin-off of the popular The Clone Wars animated show, and it's set after the events of Episode III: Revenge of the Sith. Season 1 has included cameos from characters across all of Star Wars media, and has explored the rise of the Empire in detail we haven't previously seen.",
    "There’s no word on an exact release date for season 2 yet, though that’s the same for pretty much every upcoming Star Wars show headed to Disney Plus over the next few years. We'd expect to see it in the second half of 2022 – after The Book of Boba Fett (which begins in December 2021), and perhaps the Obi-Wan TV show too.",
    "As mentioned, The Bad Batch's current run isn't done yet, since part one of the season 1 finale drops on Disney Plus on August 6, with part two arriving next week. This closer will no doubt offer several clues about the shape of The Bad Batch season 2.",
    "The first season of the Bad Batch was welcomed by Star Wars devotees. Featuring the return of The Clone Wars' gorgeous animation style, as well as voice actor extraordinaire Dee Bradley Baker (who voices the clones and each member of the Bad Batch), it's close enough to a sequel series that it carries over a lot of its predecessor's goodwill.",
    "Fans of live-action Star Wars, meanwhile, got more backstory on characters like bounty hunter Fennec Shand (played by Ming-Na Wen), showing how the different parts of the canon are connected.",
    "One complaint we've leveled at the show previously, though, is that it's still finding its reason to be – and that being set in what's traditionally been a quieter part of the Star Wars canon is arguably more of a curse than it is a blessing.",
    "Still, there's a lot to appreciate in the series regardless. And a second season only allows the writers to go deeper with its cast of characters – and to take us to more unfamiliar Star Wars worlds. We're glad it's getting another shot."
  ],
  "headers": {
    "4": "Analysis: Finding a reason to exist"
  },
  "links": {
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "upcoming Star Wars show": "https://www.techradar.com/news/new-star-wars-movies-and-tv-shows",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "Obi-Wan TV show": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "it's still finding its reason to be": "https://www.techradar.com/news/star-wars-the-bad-batch-is-still-searching-for-its-reason-to-exist"
  }
}