{
  "source": "https://www.techradar.com/news/halo-infinite-wont-have-these-two-classic-features",
  "title": "Halo Infinite won’t have these two classic features",
  "category": "gaming",
  "updated": "2021-03-12T11:56:13Z",
  "author": "adam-vjestica",
  "summary": "No duel-wielding for you",
  "article": [
    "343 Industries has shared a ton of new information about Halo Infinite – and while most of it is bound to please those who are eagerly anticipating Master Chief’s latest adventure, it’s not all sunshine and Warthogs.",
    "According to developer 343 Industries, who shared a surprising amount of new Halo Infinite details in a lengthy video, said that dual-wielding is not in the game, nor is the ability to play as a Covenant Elite.",
    "343 said that playable Elites wouldn’t be present because “this is a Master Chief and Spartan story”, though they did say “never say never”, which means we could see them appear later down the line.",
    "Dual-wielding, a feature that was first added in Halo 2 but has by no means been a mainstay for the franchise, is also not on the cards. 343 acknowledged that while “We can do everything”, they wanted to focus primarily on nailing the game’s weapons, grenades, melee and equipment in Halo Infinite.",
    "Another interesting tidbit that came out of the video interview is that Halo Infinite isn’t actually an open world game, despite many believing it would be. Instead, it’s gameplay is inspired by more open-ended missions like The Silent Cartographer. The world will apparently have many paths to get to an objective, giving players a freedom to choose how they complete missions.",
    "You won’t be restricted, though, and could, for example, grab a banshee and fly to some objectives that are further along in the story. The game is structured so a general path is in place, but you can dip in and out and take on additional missions like saving marines, exploring structures or fighting off the Banished.",
    "We also learned that Halo Infinite will include different weather conditions, such as blustering winds, to go along with the game’s day and night cycle. Players can expect to encounter new enemies when the sun sets, and there will be multiple biomes to explore. 343 also hinted that new weather conditions could be added in the future.",
    "Those are the main highlights of the Halo Infinite interview, then, but you can watch it in full below to discover more. The team notes that it has addressed a lot of the community’s concerns from the game’s reveal back in July 2020, and they are thankful for the extra time to do so.",
    "While Halo Infinite’s delay was tough for Xbox owners to stomach, particularly as the game was pushed as being a day one Xbox Series X and Xbox Series S launch title, it’s clear that the team will be able to deliver a better game. In the end, that’s all that matters, especially for a game of Halo’s magnitude and importance to the Xbox brand."
  ],
  "headers": {
    "4": "Sandbox fun",
    "7": "Wake me, when you need me"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Halo 2": "https://www.techradar.com/news/halo-2-anniversary-will-finally-arrive-on-pc-next-week",
    "reveal back in July 2020": "https://www.techradar.com/news/halo-infinite-returns-to-the-series-roots-and-master-chief-has-never-looked-better",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}