{
  "source": "https://www.techradar.com/news/arm-pcs-will-be-a-threat-to-intel-and-amd-ceo-believes-after-apples-m1-success",
  "title": "ARM PCs will be a threat to Intel and AMD, CEO believes after Apple’s M1 success",
  "category": "computing",
  "updated": "2021-01-13T15:45:04Z",
  "author": "darren-allan",
  "summary": "Real innovation will win out, Segars argues",
  "article": [
    "Apple’s custom-designed ARM-based M1 chip has certainly made a big impact since it was launched inside MacBooks (and the new Mac mini), and ARM is keen to ride this wave of success, with the CEO making very optimistic noises about the chances of finally providing a meaningful challenge on the PC front.",
    "In other words, Simon Segars, CEO at ARM, believes that ARM-based silicon can expand from the mobile world to fully challenge Intel and AMD’s x86 chips which dominate the PC arena.",
    "ARM-based laptops have been around for some time, admittedly, but represent a niche set of devices like Microsoft’s Surface Pro X, or other Windows on ARM devices with Qualcomm Snapdragon (ARM) chips from the likes of HP and Acer.",
    "However, it’s taken Apple to show what can really be done with ARM-based silicon – given full control of the hardware and software stack – with the M1 processor running x86 apps (via Rosetta 2 translation tech) with impressively speedy performance levels in general, while maintaining the battery life strengths that ARM chips are known for.",
    "C-Net reports that during an interview at CES 2021, CEO Segars enthused: “What we’re starting to see now is real innovation going on in a market where there hasn’t been a huge amount of innovation. Any time there’s discontinuity that makes people question how we’re doing this, that injects energy into innovation.”",
    "Segars acknowledges the difficulty involved in breaking into the PC ecosystem for ARM, but C-net notes that he believes that ARM’s combination of both power-efficiency and performance is going to push it forward in the PC world, and mean it claims a ‘significant’ level of market share in the future.",
    "Tirias Research analyst Kevin Krewell agrees, and observes that: “The M1 is a beast with a more aggressive core design … [it] has validated that the ARM architecture can be highly performant and go toe to toe with x86.”",
    "Of course, Intel and AMD aren’t standing still. Indeed, AMD’s Ryzen 5000 mobile chips have just appeared at CES 2021, making big promises in terms of performance and battery life. And Intel has Alder Lake chips scheduled to arrive later in 2021, which are moving to adopt a model of high-powered and low-powered (more efficient) cores, very much in a similar vein to ARM’s big.LITTLE architecture. Intel promises that this silicon will be a ‘significant’ (there’s that word again) breakthrough, and it’s certainly an exciting development on the laptop front.",
    "How the future will pan out in terms of these massing CPU armies, of course, only time will tell – but it’s certainly looking like ARM has forces massing for a credible attack on the traditionally dominant powers in the PC arena.",
    "The other point of interest here, of course, is if the Nvidia purchase of ARM goes through, and exactly how that might impact the firm’s strategy going forward. There are still regulatory hurdles to be cleared with that deal, though, for sure."
  ],
  "headers": {
    "6": "M1 beast"
  },
  "links": {
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "MacBooks": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Microsoft’s Surface Pro X": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
    "C-Net": "https://www.cnet.com/news/apples-m1-macs-will-kick-start-a-new-arm-based-pc-era-arm-ceo-says/",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "making big promises in terms of performance and battery life": "https://www.techradar.com/news/amd-ryzen-5000-mobile-processors-arrive-at-ces-2021-to-steal-the-laptop-crown-from-intel",
    "Intel has Alder Lake chips": "https://www.techradar.com/news/intel-alder-lake-processors-could-bring-big-changes-but-youll-have-to-wait-until-the-end-of-2021",
    "this silicon will be a ‘significant’ (there’s that word again) breakthrough": "https://www.techradar.com/news/intel-teases-alder-lake-cpus-at-ces-2021-calling-them-a-significant-breakthrough",
    "regulatory hurdles": "https://www.techradar.com/news/nvidias-dollar40-billion-arm-acquisition-has-hit-a-speedbump",
    "cleared": "https://www.techradar.com/news/nvidia-arm-deal-under-investigaton-by-uk-watchdog"
  }
}