{
  "source": "https://www.techradar.com/news/pixel-buds-3-may-offer-3d-spatial-audio-thanks-to-new-acquisition",
  "title": "Pixel Buds 3 may offer 3D spatial audio thanks to new acquisition",
  "category": "audio-visual",
  "updated": "2021-04-05T19:05:02Z",
  "author": "nick-pino",
  "summary": "Google acquired Dysonics for future 3D audio products",
  "article": [
    "Some good sleuthing just revealed that Google bought a 3D audio company back in December 2020 to help amplify its audio product teams.",
    "The company Google acquired is called Dysonics and according to The Protocol, the publication that broke the story about the acquisition, the team could be helping to create a spatial audio-ready version of the next Pixel Buds, Google Nest Audio speaker or even Google’s next AR/VR project.",
    "So which one is it? Unfortunately, because the deal was only disclosed recently in a filing with the U.S. Patent and Trademark Office, it isn't exactly clear – and Google hasn’t publicly announced what it plans on doing with the acquisition.",
    "In the past, Dysonics has created a motion tracker for headphones that would alter the sound depending on which direction you’re facing, and has helped Virgin America to bring surround sound to its in-flight entertainment system – so chances are good that it’s going to bring some of that spatial audio knowledge to the team in Mountain View for at least one of Google's flagship audio products.",
    "It's hard to know at this point what Google will use Dysonics for – acquisitions like this one only hint at what’s to come for future products and don’t tell us exactly what to expect from future releases. Still, we'd put our money on new Pixel Buds.",
    "Last month, Jon Prosser tweeted that Google would be announcing new Google Pixel Buds in April, and it seems likely that Google will use the technology to create 3D audio-compatible headphones similar to what Apple’s done with the Apple AirPods Pro. With Dysonics’ knowledge in the 3D audio space, the new Pixel Buds could match the AirPods Pro in specs, potentially bringing Dolby Atmos to a new model.",
    "Whether we'll see those earbuds this month, however, is debatable. Considering the acquisition was just completed in December of last year, it might've been too late for Dysonics to incorporate the technology it's been working on into models that were nearly ready for production.",
    "It's always possible, though, and we’ll certainly keep our ears open for more information as we inch closer to the potential dates for Google IO 2021."
  ],
  "headers": {
    "4": "Pixel Buds 3, Nest Hub Pro or something else entirely?"
  },
  "links": {
    "The Protocol": "https://www.protocol.com/google-dysonics-acquisition-3d-audio",
    "Pixel Buds": "https://www.techradar.com/reviews/google-pixel-buds-2020",
    "Google Nest Audio": "https://www.techradar.com/reviews/google-nest-audio",
    "new Google Pixel Buds in April": "https://www.techradar.com/news/new-google-pixel-buds-could-launch-in-april-but-theyll-need-some-big-improvements",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066"
  }
}