{
  "source": "https://www.techradar.com/news/minecraft-finally-becomes-a-lego-simulator-heres-how-to-play-it",
  "title": "Minecraft finally becomes a Lego simulator – here's how to play it",
  "category": "computing",
  "updated": "2021-08-25T09:42:24.806Z",
  "author": "hamish-hector",
  "summary": "This texture pack is incredible",
  "article": [
    "Minecraft has often been called a virtual Lego simulator, and now it’s finally living up to that name thanks to a fan-created texture pack. The MineBricks pack turns most of Minecraft’s blocks, items, and mobs into bricky versions of themselves and even adds a distinctive clicking sound whenever you build or break objects.",
    "We’ve tried the mod out and absolutely love it. We particularly adore the intricate designs given to each block - they aren’t all just one brick but selections of multiple bricks stuck together to make them look more complex and like a real Lego creation.",
    "This isn’t an officially licensed pack though, and while MineBricks never uses the word Lego it’s possible the toy manufacturer might still ask them to take the project down at some point. If that’s the case you might want to head over to the MineBricks page ASAP to ensure you have a copy to keep hold of forever.",
    "Installing fan-made texture packs in Minecraft can be a little tricky if you haven’t done it before. So here’s our quick guide on what you’ll need to do to start playing with Lego-like bricks in Minecraft.",
    "Firstly you’re going to need Minecraft Java Edition on PC, sorry console players you’re out of luck this time. Also, you won’t be able to install the mod if you’re playing on the Windows 10 version of the game either; if you can play cross-platform with non-PC users and access the DLC store, that means you have the Windows 10 version.",
    "Next, you’ll want to head to the official MineBricks page to download the texture pack. If you’re looking to try out the pack without investing in it, you can download either a 128x or 256x resolution version for free. Alternatively for just $2 (around £1.5 / AU$3) you can snag the 512x resolution pack, or splash out for $5 (around £3.5 / AU$7) and score both the 512x and highest quality 1024x versions.",
    "No matter which MineBricks pack you secure, your next step is the same. Unfortunately, the texture pack doesn’t yet support the latest release of Minecraft, so instead you’re going to want to install the older 1.16 version of the game. This means some features will be lost, but you’ll be able to swap back to the more up-to-date version at any time.",
    "To install 1.16 open up the Minecraft Launcher and look for the Installations tab near the top of the window. Here, select New Installation and under Version look for release 1.16. With that option chosen, give the installation a name then hit Create and you should be good to go. Well, almost.",
    "The final step of installing the MineBricks mod is to open up your 1.6 version of Minecraft and before you jump into a game choose options. Here you should then see Resource Packs, and then you’ll want to click Open Resource Packs Folder. Drag and drop the .zip file (there’s no need to extract it) for MineBricks into the resource pack folder, then close it. Back on the Minecraft tab, you should now see a new option to use the mod and you are finally ready to get playing."
  ],
  "headers": {
    "3": "How to make Minecraft look like Lego"
  },
  "links": {
    "MineBricks page": "https://minebricks.gumroad.com/l/minebricksv5",
    "Minecraft Java Edition": "https://www.minecraft.net/en-us/store/minecraft-java-edition"
  }
}