{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s20",
  "title": "Samsung Galaxy S21 vs Samsung Galaxy S20: comparing Samsung's flagship phones",
  "category": "phones",
  "updated": "2021-12-05T13:33:35Z",
  "author": "jon-mundy",
  "summary": "The S21 isn't the clear winner you might expect",
  "article": [
    "The Samsung Galaxy S21 represented a shift in focus for the storied smartphone line after successive years of unequivocal flagships.",
    "For this reason alone, a comparison between the Galaxy S21 and its predecessor, the Samsung Galaxy S20, is a fascinating one to make. While Samsung debuted its Ultra line alongside the S20, the latter was still considered a compromise-free flagship phone in its day.",
    "The same can’t quite be said for the Galaxy S21, which in several ways fails to pull away from the Galaxy S20 as much as you might expect.",
    "So which phone is better overall? This one’s going to be unusually tight.",
    "The Samsung Galaxy S21 landed on January 29, 2021, with a starting price of $799 / £769 / AU$1,249 for the 128GB model. There’s also a 256GB model that costs $849.99 / £819 / AU$1,349.",
    "The Samsung Galaxy S20 launched on March 6, 2020. Pricing started at £799 / AU$1,34 for the 4G variant (which didn’t launch in the US), and shifted up to £899 / $999.99 / AU$1,499 for the 5G model.",
    "Over 18 months on from release, it’s tricky to find a brand new Galaxy S20 out in the wild. But we’ve seen a 4G Galaxy S20 on Amazon UK for £588, which is a saving of £211 (around $290 / AU$390) over the RRP.",
    "Both of these phones are compact and solid, but the older Samsung Galaxy S20 is undeniably the more premium and desirable of the two.",
    "While the Galaxy S20 is composed of an aluminum frame sandwiched by glass surfaces, Samsung adopted a cheaper ‘Glasstic’ composite for the Galaxy S21’s rear panel. It’s the only handset in the Galaxy S21 line to have this.",
    "Interestingly, despite this step down in quality, the Galaxy S20 is actually the lighter phone of the two at 163g for both the 4G and 5G variants. The Galaxy S21 weighs 169g for the sub–6GHz model, and 171g for the mmWave model, which are two different versions of 5G.",
    "The two phones share a very similar minimal footprint, with identical 151.7mm heights and 7.9mm thicknesses. However, the Galaxy S21 is wider by just over 2mm at 71.2mm. That’s because it drops the lavish curved display of the S20 for a dead flat one, complete with larger side bezels.",
    "Not that the Galaxy S21 is completely without visual appeal. Its swooping ‘Contour Cut’ camera module, in particular, is a notable advance over the S20’s more generic unit.",
    "Samsung has improved its in-display ultrasonic fingerprint sensor for the Samsung Galaxy S21, too, with a 70% bigger active area than before. Both phones pack an IP68 water and dust resistance rating.",
    "Generally speaking, however, the Galaxy S20 has the nicer and more flagship-feeling design.",
    "Both of these phones pack in 6.2-inch AMOLED displays that can run at a fluid 120Hz refresh rate. The difference comes with the resolutions, and it’s a notable one for the fact that the older phone is better.",
    "The Samsung Galaxy S21 screen peaks at a FHD+ (1080 x 2400) resolution, while the Galaxy S20 is capable of outputting at either that or QHD+ (1440 x 3200).",
    "Of course, the Galaxy S20 can’t output at a QHD resolution whilst maintaining that fluid 120Hz refresh rate. Given such a choice, we’d choose the latter every time, as it’s genuinely transformational to the experience. But the option of QHD alone gives the Galaxy S20 the win here.",
    "One way in which the Samsung Galaxy S21 bests its predecessor is peak brightness. While the Galaxy S20 can hit 1200 nits, the newer device manages 1300 nits. It’s not a big difference, but it’s there.",
    "Another win for the Galaxy S21's display is its toughness, with a Gorilla Glass Victus frontage as opposed to the Galaxy S20’s older Gorilla Glass 6.",
    "Both displays are bursting with contrast and color, however, and both support HDR10+ content.",
    "These two phones have the exact same camera hardware. That equates to a triple-lens system led by a 12MP main sensor with an f/1.8 aperture producing 1.8μm pixels, and backed by a 12MP ultra-wide.",
    "Both also pack the same meaty, if unorthodox, 64MP telephoto lens that only captures 1.1x optically zoomed shots. Instead, they apply clever software tricks to produce relatively sharp and balanced 3x hybrid zoom shots.",
    "What the Samsung Galaxy S21 adds, in the absence of any new hardware, is a bunch of new software tricks. Director’s View give you a live view of all three rear lenses at once, and then empowers you to jump between them. Vlogger mode enables you to record video from the front and rear cameras simultaneously.",
    "Both phones feature Single Take, which uses AI and slow-motion recording to capture and process a range of image types in one go. And on a more fundamental level, both phones can manage 8K video footage at 24fps or 4K at 60fps.",
    "All in all, the Galaxy S21’s camera doesn’t represent the leap forward that the Samsung Galaxy S20 did from the Galaxy S10. If you’re deciding between these two phones, then the camera offering doesn’t really need to come into it. They both take very good, but not great, pictures.",
    "From a global perspective, both of these phones suffer for Samsung’s curious split hardware strategy. The global models of both phones use Samsung’s own Exynos chips, while the US and China models use Qualcomm’s more generic - but also more capable - Snapdragon equivalents.",
    "There’s less of a gap with the Galaxy S21, however. The Exynos 2100 of the global model actually gets pretty close to the Snapdragon 888 of the US model.",
    "Conversely, the global Galaxy S20 runs on a Exynos 990 that’s a fair bit slower and less efficient than the Snapdragon 865 of the US model.",
    "Comparing them head to head, the Samsung Galaxy S21 absolutely blitzes its predecessor. Our Exynos 2100-powered Galaxy S21 scored 3,367 on the Geekbench 5 multi-core test, while the Exynos 990-powered Galaxy S20 could only manage 2,699. There’s a similar gap in the GPU stakes.",
    "In practical terms, our Samsung Galaxy S21 reviewer found that the phone felt more fluid than the S20 in everyday tasks such as gaming, multi-tasking and having multiple apps open in split-screen view.",
    "Both phones come with 8GB of RAM as standard, though there’s also a 12GB model of the Galaxy S20 5G out there. They also both come with 128GB of storage as standard, though the Galaxy S21 also comes in a 256GB variant. Conversely, only the Galaxy S20 packs a microSD slot.",
    "Naturally, both of these phones use Samsung’s heavily modified One UI, which isn’t to everyone’s taste, but is feature-packed and customizable. This is one of the key ways in which the Galaxy S21 being newer still pays off - it’ll receive an extra year’s worth of software support from Samsung.",
    "Both the Samsung Galaxy S21 and the Samsung Galaxy S20 run on 4,000mAh batteries, which isn’t massive by modern Android flagship standards. However, the Galaxy S21 has a couple of advantages here.",
    "For one thing, as we’ve just discussed, it runs on a more modern and thus more energy efficient processor. For another, its high refresh rate display implementation is more sophisticated, with the ability to scale between 48 and 120Hz reducing the demand for power.",
    "Both phones have reasonable, if not class-leading, stamina. We found that both will last through a full day of usage on a single charge, but that heavier usage could occasionally lead to an empty battery before bed time.",
    "Neither phone is particularly impressive when it comes to recharging, with both supporting a relatively modest 25W wired and 15W wireless. Rival manufacturers have long switched to 55W or 65W standards that can get you to full in half an hour, while the twin Galaxies will only get you to around half full in the same time.",
    "Still, at least the Samsung Galaxy S20 comes with a 25W charger in the box. The Galaxy S21 dropped the provision under the premise of minimizing e-waste.",
    "All in all, you wouldn’t choose either phone for their stamina, but nor should you rule them out on this basis. They’ll get you through most working days just fine.",
    "Typically when we directly compare a smartphone to its predecessor, it’s an open and shut case. The new phone is better in most if not all ways, except for price.",
    "This one’s different. After giving us a peak smartphone experience with the Galaxy S20, Samsung took a different approach with the Galaxy S21. For the first time, it appears to be treading water and even rolling certain areas back in a bid to bring that price tag down, and to create proper differentiation with the rest of the S21 range.",
    "To that end, the Samsung Galaxy S21 shares exactly the same camera system as its predecessor, sports a less premium design, and features a technically inferior display that doesn’t give you the option of a QHD resolution.",
    "On the other hand, the newer phone is notably faster, and will obviously receive better support from Samsung going forward. It’s the more future-proof purchase of the two.",
    "Still, if you can track down a new Galaxy S20 for a good chunk of dollars/pounds less than the equivalent Galaxy S21, you won’t be compromising on much at all in the here and now."
  ],
  "headers": {
    "4": "Samsung Galaxy S21 vs Samsung Galaxy S20 price and availability",
    "7": "Design",
    "14": "Display",
    "20": "Camera",
    "25": "Specs and performance",
    "32": "Battery",
    "38": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}