{
  "source": "https://www.techradar.com/news/metas-metaverse-plans-show-us-the-bad-ending-of-ready-player-one",
  "title": "Meta's metaverse plans show us the bad ending of Ready Player One",
  "category": "vr",
  "updated": "2021-10-31T09:00:35Z",
  "author": "hamish-hector",
  "summary": "Opinion: Meta's metaverse could be a nightmare come true",
  "article": [
    "Mark Zuckerberg’s opening keynote at the recent Facebook event (now called Meta) was a sight to behold. Over the course of one and a half hours, the CEO – joined by various experts from his company – rambled through his vision of a future with the metaverse at its core.",
    "No longer would we be constrained by our physical limitations as our digital and virtual worlds blend into one. According to Zuckerberg, we’d be able to work, live and play in this new universe, and Meta’s technology and innovation are what will usher us into this new always-online era.",
    "Yet as Zuckerberg continued to make grandiose promises of a future we might see in a decade or two, it dawned on us that we’d heard all of this already. This is Ready Player One – specifically, it's what would have happened if the bad guys had won.",
    "Love or hate the story of Ready Player One, the book’s main setting – the Oasis – sounds like a digital wonderland. It's an incredible virtual reality space where players can go anywhere, do anything and be anyone free from most of life’s restrictions – it’s the full realization of the internet’s potential. But the Oasis, like the internet, isn't flawless.",
    "Ready Player One’s Oasis is shown to be corrupted at its core by corporate greed, with individuals seeking total dominance of the space and already enacting significant control over how users can engage with the digital space. This is demonstrated by Ready Player One’s antagonist, Nolan Sorrento, and his company Innovative Online Industries (an organization with a name almost as silly as Meta).",
    "IOI sells tools that allow players to immerse themselves in the Oasis, with the best features coming at a premium price most can’t afford, and one day hopes to fill the Oasis with adverts that players will have no chance to avoid. Thankfully, by the story’s end the corporation has been defeated and players are left running the show for everyone’s benefit.",
    "Zuckerberg seems keen to avoid that outcome for his company’s version of the Oasis – named Horizon – and is already ensuring Meta has near-total dominance of the virtual space from day one.",
    "It’s doing so by coming at the problem from all angles. Epic Games, the company behind Fortnite, was name-dropped by Zuckerberg during the Connect event as working on its own gaming metaverse with its Battle Royale, but its public efforts are purely software-focused.",
    "Meta, on the other hand, has the software covered with its Horizon World title. But it's also working on the hardware that will let players engage with virtual reality through its Oculus Quest 2, the Ray-Ban Stories, and the soon to release Project Cambria headsets – as well as the general infrastructure that will enable the metaverse to operate.",
    "But, for all of Zuckerberg’s talk, it was what was left unsaid that has us concerned. Throughout the presentation, we saw Meta’s own devices delivering the next stage of the metaverse, but where is Valve or HTC or any of the other VR devices we have available today? And once we’re all equipped with ways to enter the metaverse, how will Meta fund itself and keep the lights on?",
    "When it comes to headsets, Zuckerberg’s emphasis on his company’s vital role in delivering the metaverse has us believing that its experiences will be exclusive to its own devices. It's a notion that would track, based on the Oculus Quest’s plethora of platform-exclusive games when compared to Valve’s platform-agnostic Steam VR hits.",
    "As for keeping the lights on, we’ve already been shown the potential for businesses to advertise and operate in the metaverse as part of the Connect presentation. Here, we saw how the brand Forever Mood could allow users to buy digital and physical versions of its candles. It’ll be easier than ever for businesses to integrate into our day-to-day lives in the digital space, likely giving us less freedom from ads than ever before and serving Meta a healthy revenue stream as it takes some kind of commission.",
    "On top of that, we can’t ignore that Meta’s announcements come as its social media platforms are accused of knowingly enabling criminal acts and allowing the rampant sharing of harmful misinformation. As guardians of a metaverse go, Meta wouldn’t be our number one choice.",
    "The issues that are starting to appear are eerily similar to the outcome readers and moviegoers would have seen if Ready Player One had ended with IOI becoming the leaders of the Oasis. It's a world that we don't want to live in.",
    "For all the promise in Meta's metaverse plans to revolutionize our lives, we're scared to see where it wants to take us over the next few decades – let's just hope our concerns aren't warranted."
  ],
  "headers": {
    "3": "The dark timeline"
  },
  "links": {
    "Facebook event": "https://www.techradar.com/news/facebooks-whole-metaverse-thing-its-simply-ridiculous-and-we-have-questions",
    "now called Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "Ready Player One": "https://www.techradar.com/best/ready-player-one-and-the-history-of-vr-in-movies-and-tv-virtual-reality-hollywood",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Ray-Ban Stories": "https://www.techradar.com/reviews/ray-ban-stories-facebook-smart-glasses",
    "Project Cambria headsets": "https://www.techradar.com/news/new-oculus-vr-headset-officially-teased-at-facebook-connect-2021",
    "Valve": "https://www.techradar.com/reviews/valve-index",
    "HTC": "https://www.techradar.com/reviews/htc-vive-pro",
    "Oculus Quest’s plethora of platform-exclusive games": "https://www.techradar.com/news/best-oculus-quest-games",
    "knowingly enabling criminal acts": "https://eu.usatoday.com/story/news/investigations/2021/10/27/facebook-profited-sex-trafficking-did-it-break-the-law/6124317001/",
    "rampant sharing of harmful misinformation": "https://www.washingtonpost.com/technology/2021/10/28/facebook-covid-misinformation/"
  }
}