{
  "source": "https://www.techradar.com/news/instagram-like-counts-could-soon-return",
  "title": "Instagram like counts could soon return",
  "category": "computing",
  "updated": "2021-04-15T02:05:30Z",
  "author": "jasmine-gearie",
  "summary": "Instagram is giving users the choice of seeing like counts or not in new test",
  "article": [
    "After hiding 'like' counts back in 2019, Instagram is now putting the choice back in the hands of users. In its latest global test, Instagram will give a small amount of users the choice of whether or not they want to see like counts on other people’s posts.",
    "The test will also allow participating users the choice of turning off like counts on their own posts. Similar to what’s already available for comments, the trial will let accounts turn off likes entirely, or control it on a post-by-post basis.",
    "Facebook, which owns Instagram, will also start similar testing soon.",
    "The trial seems to be a middle-of-the-road solution to one of Instagram’s challenges. Head of Instagram, Adam Mosseri, said when the tech giant first tested hiding like counts, it hoped to lessen the social pressure of having a well-liked photo.",
    "After receiving feedback, it seems not everyone agreed. “Some found this helpful and some still wanted to see like counts,” Mosseri wrote on Twitter, “in particular to track what’s popular.”",
    "When like counts were first hidden, there was also fear among influencers on Instagram who worried the lack of the metric data ‘like’ would affect their ability to show their value to brands and make money on the platform.",
    "Users were still able to privately view and share their likes, and it’s unclear whether hiding likes affected user engagement.",
    "Rather than removing likes entirely or keeping Instagram how it is, Mosseri now says “we’re testing a new option that lets you decide the experience that’s best for you.”",
    "With tools to combat cyberbullying already available on Instagram, putting control back in the hands of users feels like the most logical solution."
  ],
  "headers": {
    "3": "Why is Instagram doing this?"
  },
  "links": {
    "hiding 'like' counts": "https://www.techradar.com/news/instagram-is-now-hiding-like-counts-in-australia-canada-and-five-other-countries",
    "Mosseri wrote on Twitter": "https://twitter.com/mosseri/status/1382361892002275333",
    "combat cyberbullying": "https://www.techradar.com/news/instagram-is-hoping-to-combat-cyber-bullying-via-two-new-tools"
  }
}