{
  "source": "https://www.techradar.com/news/should-i-buy-a-film-camera-in-2021",
  "title": "Should I buy a film camera in 2021?",
  "category": "cameras",
  "updated": "2021-10-09T08:00:00Z",
  "author": "jason-parnell-brookes",
  "summary": "Film cameras are fine way to escape a photography rut",
  "article": [
    "Smartphones and digital cameras may have dominated to the past 20 years, but film cameras have been making a comeback – and not just as inspiration for retro mirrorless cameras like the glorious Nikon Z fc.",
    "Open up Instagram, search for the tag #filmisnotdead and you’ll find over 20 million posts showing that, yes, film is very much still alive. It's always had a place in the hearts of traditionalists and hobbyists who grew up with analogue shooting, but film is also making a splash with younger photographers thanks to social media and YouTube.",
    "There seems to be something about the tactile engagement of film cameras that photographers crave, which is no surprise when the rest of the world is largely powered by swipes and impersonal video chats.",
    "In an age of instant gratification we have developed the habit of “chimping” (checking photos on the back screen as soon as we’ve taken the shot) with our digital cameras, and this takes us out of the moment. Shoot film, though, and there is no image review, so we must engage with our subject and surroundings.",
    "In this introduction to film cameras, we'll first explore the reasons why they can help your digital photography – then tell you how to get started and choose the best film camera for you.",
    "Head to any college or university to study photography and you’ll notice a common thread through all of the courses: the first year is all about film. Well, maybe not entirely, but there’s a heavy emphasis on film photography including how to deal with and develop negatives, transparencies and more.",
    "There are a few reasons why this is the case, and all of them are beneficial to our photographic experience – even if we continue to shoot digitally on phones and mirrorless cameras.",
    "Possibly the biggest characteristic film has over digital photography is that you can’t review images during the shooting process. This inability to deconstruct composition and exposure values means there’s a lot more emphasis on getting things right in-camera first, before capturing the moment.",
    "Keeping your eyes in the landscape can help reveal details you’d otherwise overlook and this in-depth concentration should you develop a better 'eye' for composition and structure in photographs.",
    "It can also help improve your portraits by offering plenty of opportunity to chat and make eye contact with subjects, meaning they can feel more at-ease for a better, relaxing experience in front of the camera.",
    "By staying in the moment you can really hone in on what makes the photograph work. For example, by truly feeling the warm sun on your face you might want to slightly overexpose the shot to reflect the heat, something that will help add meaning to your photo beyond simple accuracy.",
    "Let’s take the gold standard of film shooting as our example here: the 35mm film roll. A typical roll of 35mm film offers just 36 exposures. That’s 36 single photos you have at your disposal to capture what you need before changing rolls and getting it developed.",
    "Depending on the film you buy, this could be quite expensive – so it’s important to make every shot count. This is a discipline that sharpens the preparatory nature of photographers. Digital photography seems to work in the opposite direction, with photographers rattling off shots just to get the right exposure, without ever looking at the light meter or paying attention to the available light or shifts in weather.",
    "For example, I took my Olympus Pen-EE out recently and captured some lifestyle images of my house and the surrounding area, more for posterity than anything else. But knowing that I couldn’t review images and had just 36 attempts to capture everything I wanted, I started to plan out where to angle shots to include as much information for my future self as possible. A skill which I automatically brought back to my digital photography and helped develop my work almost immediately.",
    "Speak to any photographer who’s in love with film and you’ll hear the same kind of responses when asked why they like to still shoot film: it’s about the sensory experience.",
    "This can be a preference for a certain 'clunk' from a shutter release, the ticking as film is wound on, the feel of the metal body, or just the pure sublime aesthetics of the camera itself.",
    "Film cameras seem to just engage strongly with all of our senses in a way that digital seems often fails to do. This is especially the case if you’re shooting on a fully-mechanical film camera, because you can see, hear, and feel every vibration that camera makes as you make your shot.",
    "There’s a physical intimacy inherent in film photography, I believe, largely because of the proximity you have to spend with the cameras. There are no back screens, no analyzing stills, so the camera must be held close to the eye, pressed against the nose, and looked at itself to determine how many more frames you have left on the roll.",
    "Once you’ve chosen your film and loaded it, you’re locked in. White balance and ISO sensitivity have been decided and there’s no switching up part-way through without destroying your other frames as light leaks can overexpose film to destruction.",
    "You have to think far in advance of what you’re going to shoot, right at the point of purchase of that roll of film. Where are you going to be shooting? Will it be inside with Tungsten lighting, or outside in bright sunshine? Perhaps you’re hoping for some low-light landscapes in which case a daylight balanced but high ISO roll may be handy?",
    "Of course, you can carry more than one roll of film, but again you’re locked in for 36 exposures before changing over, so it helps refine the thought patterns before shooting. This could be particularly beneficial for those who are quite flighty and dream-like in their approach to photography, as it will help complement that spontaneity with some added discipline.",
    "There are limits on how far you can push film – and the fact that you need to meter your light and be aware of camera settings before you press the shutter button, means you’re forced to engage with your environment first.",
    "Look at the exposure values of various zones around your scene – you can use Ansel Adams and Fred Archer’s Zone System if that helps. You’ll have to be aware of the specific filtration required for good exposure and to avoid overexposed highlights or underexposed shadows.",
    "There’s limited fixing that can be done after you’ve captured the shots, and those used to editing up or down 3-5 stops in Lightroom will need to pay close attention here. Do you need a UV filter to reduce glare in your scene? Or perhaps a graduated neutral density filter is essential for those seascapes you’ve been wanting to capture?",
    "You have to look at the scene (or visit it ahead of time) and make notes on what equipment you’ll need for it, in order to capture the details you’re hoping for.",
    "So you’ve decided to get started in film photography and want to get stuck in, but where do you start? There are loads of different cameras to choose from, and you can head to our separate guide on the best film cameras for more details on those. But what about choosing lenses, and where do you get film rolls these days? Luckily, we have the answers.",
    "There are many types of film camera to choose from and each have their own qualities and advantages.",
    "The best instant cameras are light, portable, and produce a photograph there and then, without the need for further development. Medium and large format cameras, meanwhile, are much bigger and bulkier, therefore require longer prep and setup times. Point-and-shoot cameras are perfect for those wishing to capture memories and holiday snaps who have little interest in the minutiae of manual settings. However, the gold standard when it comes to film cameras is 35mm film.",
    "That’s because they’re relatively small and portable like instant cameras, but provide a pretty big frame to capture detail on the film.There are so many models to choose from, and some new 35mm film cameras are still being produced today.",
    "The staple for those wishing to get into film photography is likely the Canon AE-1 (the shutter sound of which appears on all iPhones as the photo capture sound) or the Pentax K1000. Both are inexpensive and reliable. Their simple design makes it easy for newbies to get into film but also give enough control and manual settings to give more seasoned photographers the control they really need. They’re easy enough to find on eBay or through second-hand camera stores such as Park Cameras (in the UK) or Adorama (in the US).",
    "There are three main options when it comes to choosing film: color reversal, black-and-white reversal, and print film. The most common type of film many of us have likely seen before is the print film, which produces negatives.",
    "Negatives capture inverted colors and therefore need to be developed to provide the correct coloration. These are also the cheapest and most abundant in the shops. Kodak, Fuji and Ilford are the main manufacturers of 35mm print film and offer a range of color or black-and-white options in a variety of ISO sensitivities and white balances. The cheapest of all 35mm film options, single rolls can be purchased from anywhere between $7-13 (£5-£10), or cheaper in bulk.",
    "The second most common type of film is the color reversal, otherwise known as transparencies. These contain the normal color spectrum and can be viewed with a magnifying glass or loupe relatively accurately. Pop them in a small plastic casing and we call them slides, the same slides that some may have had to watch after relatives got back from holiday.",
    "There are currently two major manufacturers of slide film – Kodak and Fujifilm – with each roll costing around $20 (or between £15-20). Black-and-white reversal film works in the same way as standard color slide film, but due to it only producing a monochrome image is arguably less popular.",
    "The most important thing to master when new to film photography is to be incredibly aware of the exposure triangle.",
    "Aperture, shutter speed and ISO are all major factors in exposing your images – and with ISO being locked in during the use of one roll of film, it’s crucial to understand how to meter your light reliably.",
    "If the film camera you’re using doesn’t have a light meter and you don’t have an external one, you can always use the 'sunny 16' rule. This rule states that if it’s bright and sunny outside, then set your aperture to f/16 and make your shutter speed the reciprocal of your film's ISO value – so for ISO 200 film, for example, your shutter speed would be 1/200s or 1/250s.",
    "Picking a film camera body is only one part of the story, because your photographs will change based on which lens you used. Simply put, there are two main types of lenses for 35mm film cameras: fixed focal length and zooms.",
    "Fixed focal length lenses are, by their very nature, fixed at one focal length, for example 24mm or 50mm or 85mm. That means if you want to recompose your image you’ll have to physically move back and forth until you’ve got the right framing.",
    "The upside of these lenses though is that they’re typically smaller, lighter and sharper than zoom lenses, and have wider maximum aperture values. That’s because zoom lenses require many more pieces of glass inside the lens barrel in order to produce sharp and consistent results when zooming in and out.",
    "Zoom lenses also tend to suffer more from chromatic aberration, which is a color fringing issue around areas of stark contrast. However, zoom lenses offer the ability to recompose without moving your feet and make great do-it-all options for those looking to travel and keep the camera bag light.",
    "Part of the joy of shooting film photographs is to develop the film yourself. Depending on which type of 35mm film you go for though, this can be a lengthy and expensive process with lots of kit and chemicals required to process the film effectively.",
    "Still, there are simple DIY kits from the likes of Paterson, Stearman and The Film Photography Project, which are good options for beginners who want to have a go themselves. Once you've developed your snaps, you'll likely want to get them digitized by scanning them – a good budget option is the Pixl-latr , although higher-quality scanners are available from the likes of Epson and Plustek.",
    "Most beginner film photographers, though, will likely want to use a photographic laboratory to develop or scan their film – and there are still a surprising amount of options to choose from. In the UK, Max Spielmann and Analogue Wonderland are good choices. For US photographers, there's Indie Film Lab and State Film Lab, while those in Australia can mail their processing and scanning orders to the likes of Film Never Die or Blue Hour Photo Lab.",
    "If you'd rather get your processing done with your shopping, many supermarkets also provide film development services. In the US, Walmart, Walgreens and CVS all still offer in-store services, while in the UK Asda and Tesco both offer film development (though the latter is provided by Max Spielmann)."
  ],
  "headers": {
    "5": "Why film cameras are good for your photography",
    "7": "1. Staying in the moment",
    "11": "2. Improving your discipline",
    "14": "3. Full immersion",
    "18": "4. Creative restrictions",
    "21": "5. Improving your eye",
    "25": "How to get started with film photography",
    "26": "1. Choose a camera",
    "30": "2. Pick a film",
    "34": "3. Master the basics",
    "37": "4. Choose the right lens",
    "41": "5. Getting your film developed"
  },
  "links": {
    "Nikon Z fc": "https://www.techradar.com/reviews/nikon-z-fc",
    "best film camera": "https://www.techradar.com/best/best-film-cameras",
    "Ansel Adams and Fred Archer’s Zone System": "https://www.youtube.com/watch?v=x_k2iAgZfGs",
    "best film cameras": "https://www.techradar.com/best/best-film-cameras",
    "best instant cameras": "https://www.techradar.com/news/best-instant-camera",
    "Park Cameras": "https://www.awin1.com/awclick.php?awinmid=6241&awinaffid=103504&clickref=trd-us-1241228613975650000&p=https%3A%2F%2Fwww.parkcameras.com%2Fused%2Ffilm-equipment%2Ffilm-cameras",
    "Adorama": "https://adorama.evyy.net/c/221109/51926/1036?subId1=trd-us-1272209286276040400&sharedId=trd-us&u=https%3A%2F%2Fwww.adorama.com%2Fl%2FUsed%2FPhotography%2FCameras%2FSpecialty-Cameras",
    "exposure triangle": "https://www.techradar.com/how-to/the-exposure-triangle",
    "Pixl-latr": "https://www.pixl-latr.com/",
    "Max Spielmann": "https://www.maxphoto.co.uk/",
    "Analogue Wonderland": "https://analoguewonderland.co.uk/",
    "Indie Film Lab": "https://www.indiefilmlab.com/",
    "State Film Lab": "https://statefilmlab.com/",
    "Film Never Die": "https://filmneverdie.com/pages/mail-in-orders",
    "Blue Hour Photo Lab": "https://www.bluehourlab.com/"
  }
}