{
  "source": "https://www.techradar.com/news/lg-oled-tvs-are-getting-cheaper-but-it-might-not-happen-fast-enough",
  "title": "OLED TV panels are actually cheaper to make than Mini LED – but not for long",
  "category": "televisions",
  "updated": "2021-02-26T17:59:45Z",
  "author": "henry-st-leger",
  "summary": "Mini LED is set to become very affordable very quickly",
  "article": [
    "A new report from DSCC is shedding light on the production costs of Mini LED and OLED TV panels, and the results may surprise you.",
    "The DSCC (Display Supply Chain Consultants) report has some interesting tidbits on the disparity between WOLED (White OLED) and Mini LED manufacture, with the premium OLED tech actually being cheaper to manufacture than Mini LED panels of the same size – for now, at least.",
    "That runs slightly counter to the given wisdom around OLED as a pricey panel technology, especially because TV makers that support both OLED and Mini LED – like LG Electronics, or Philips – are selling Mini LED sets for much less than their OLED counterparts. So what's going on here?",
    "There are a few factors at work here. The data largely concerns LG Display, currently the sole manufacturer of OLED TV panels. LG Display is now producing far more of its panels at its Guangzhou factory in China, where \"lower costs for depreciation, personnel, indirect, and SG&A [Selling, general and administrative expense]\" make the total cost of panel manufacture much lower than in LG's Korean factories – despite initial issues getting the production line up and running.",
    "That basically means that lower wages for workers and reduced admin costs save LG money, even if the cost of making the actual panel hasn't meaningfully changed.",
    "OLED panel costs have been gradually decreasing over time anyway, as LG has learned to ramp up mass production and refined the technology, no doubt reducing the number of broken / unusable panels during manufacture (something that was something of a thorny issue for OLED TV makers earlier on in the technology's lifespan).",
    "That combination of factors has helped OLED panels to briefly become cheaper to manufacture than their Mini LED (LCD) counterparts, which are used in LG's QNED (LCD) range and so many new Samsung TVs.",
    "Mini LED is a newer technology, one that TCL has been utilizing for a good couple of years now, but which Philips, Samsung and LG have only started embracing this year.",
    "As a burgeoning technology – one that centers around a vast number of backlighting LEDs to precisely control brightness output across the screen – there are inevitably early-stage costs as these manufacturers start to scale up the technology for the first time.",
    "The end price of a television set obviously includes many things other than the panel, too. That's how Samsung's flagship sets can use Mini LED in tandem with high-spec processing, zero-bezel screens, and an advanced OTS+ audio system, and cost significantly more than LG's more mid-spec Mini LED displays.",
    "This manufacturing cost imbalance is set to change though. DSCC's report predicts that OLED and Mini LED's positions will soon reverse, with the latter tech decreasing in price significantly faster than OLED.",
    "DSCC estimates that a 65-inch OLED panel in 2021 would cost around $520 (around £370 / AU$660) to manufacture, with a Mini LED panel of the same size costing closer to $560 in total to make. It's a different picture looking ahead though, with both examples costing around $440 in 2024, and Mini LED gaining an edge by 2025 – costing just over $400 for a 65-inch panel, compared to around $420 for OLED.",
    "Much of the discourse around OLED TVs these days is affordability: how quickly prices are (or aren't dropping), what manufacturers are compromising on to bring down costs, and what budget OLEDs are already on the market.",
    "The DSCC report paints a positive, if gradual improvement on this front in the coming years. The cost of producing a 65-inch OLED panel by LG Display should drop by around 20% in the next five years to just $400.",
    "That won't mean we see a 20% price drop on OLED TV prices, of course – these figures are just for the panel, and not any of the casing, speakers, processors, stands, shipping, marketing or otherwise associated with turning a flat panel into a deliverable television set.",
    "But it does show that OLED televisions are only getting cheaper in the long run, which they will need to do to fend off competition from competing Mini LED sets. As this new LCD backlight technology gains traction, and lowers in price, it could challenge the dominance of OLED yet.",
    "Via OLED-info"
  ],
  "headers": {
    "7": "Competition from Mini LED",
    "12": "Price drops"
  },
  "links": {
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "despite initial issues getting the production line up and running": "https://www.techradar.com/news/lg-oled-tvs-are-having-production-issues-heres-why-that-matters",
    "QNED": "https://www.techradar.com/news/what-is-qned",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Samsung and LG": "https://www.techradar.com/news/samsung-vs-lg-tv-which-tv-brand-is-better",
    "OTS+": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "OLED-info": "https://www.oled-info.com/dscc-production-costs-miniled-tvs-be-higher-oled-tvs"
  }
}