{
  "source": "https://www.techradar.com/news/nvidia-rtx-3070-ti-leak-provides-good-news-on-the-vram-front",
  "title": "Nvidia RTX 3070 Ti leak provides good news on the VRAM front",
  "category": "computing",
  "updated": "2021-05-28T11:04:47.258Z",
  "author": "darren-allan",
  "summary": "GDDR6X RAM will be used going by leaked photos, not slower GDDR6",
  "article": [
    "If you haven’t already had your fill of Nvidia rumor stories, here’s another, with a sighting of the RTX 3070 Ti GPU in the form of official photos from MSI (which follows a similar recent leak of a Leadtek RTX 3080 Ti graphics card).",
    "The pics, which were brought to light by VideoCardz, show two MSI 3070 Ti models, and on the boxes of these product shots, you can clearly see that 8GB of GDDR6X video RAM is on board.",
    "A memory configuration of 8GB has been rumored for a while now, although we weren’t sure whether Nvidia would plump for faster GDDR6X VRAM, or plain GDDR6, and assuming this material is genuine, it confirms the former – and that’s good news.",
    "The two models pictured coming from MSI are the RTX 3070 Ti Suprim X and Ventus 3X, and are expected to use the GA104-400 GPU with 6,144 CUDA cores. Compared to the vanilla RTX 3070, that has 5,888 CUDA cores, and the Ti variant will also have faster memory (but the same amount), as the RTX 3070 has GDDR6 VRAM.",
    "As for clock speeds, the Ventus 3X will hit 1800MHz, meaning it’s 45MHz quicker than the RTX 3070 Ventus 3X. There’s no info on the clocks of the new Suprim X yet.",
    "Apparently MSI’s RTX 3070 Ti cards will have the same design as the existing RTX 3070 models, just as is the case with the RTX 3080 Ti and plain 3080. That’s no surprise as these are essentially just somewhat faster versions of the base cards.",
    "In the case of the RTX 3070 Ti, that faster memory will certainly help the cause – even if there are those out there hoping for more VRAM than just 8GB. There were rumors of a 16GB version of the 3070 Ti, as well as 8GB, but we haven’t heard much about the former in recent times, so don’t get your hopes up too much there.",
    "At any rate, we’ve not got long to wait for the launch of the RTX 3070 Ti and the 3080 Ti, because they should be unveiled in all their glory in just a few days’ time at Computex on May 31.",
    "In the meantime, for more details on this incoming GPU, check out our full roundup of RTX 3070 Ti news and rumors."
  ],
  "headers": {
    "6": "But what about 16GB?"
  },
  "links": {
    "Nvidia rumor stories": "https://www.techradar.com/news/nvidia-rtx-3080-ti-and-rtx-3070-ti-may-be-up-for-preorder-ahead-of-an-actual-announcement",
    "Leadtek RTX 3080 Ti graphics card": "https://www.techradar.com/news/nvidia-rtx-3080-ti-spotted-as-rumors-about-imminent-gpu-pile-up",
    "VideoCardz": "https://videocardz.com/newz/msi-geforce-rtx-3070-ti-suprim-and-ventus-3x-pictured-gddr6x-confirmed",
    "A memory configuration of 8GB": "https://www.techradar.com/news/nvidia-rtx-3070-ti-might-come-in-both-8gb-and-16gb-variants",
    "although we weren’t sure": "https://www.techradar.com/news/nvidia-rtx-3080-ti-and-3070-ti-gpus-could-have-12gb-and-8gb-of-vram-respectively",
    "RTX 3080 Ti and plain 3080": "https://www.techradar.com/news/nvidia-rtx-3080-ti-spotted-as-rumors-about-imminent-gpu-pile-up",
    "rumors of a 16GB version": "https://www.techradar.com/news/nvidia-rtx-3070-ti-might-come-in-both-8gb-and-16gb-variants",
    "the 3080 Ti": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-specs-have-leaked-and-you-wont-be-disappointed",
    "Computex on May 31": "https://www.techradar.com/news/maybe-nvidia-is-launching-the-rtx-3080-ti-at-computex-after-all",
    "full roundup of RTX 3070 Ti news and rumors": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti"
  }
}