{
  "source": "https://www.techradar.com/news/genshin-impact-on-iphone-is-getting-a-feature-it-doesnt-have-on-consoles-or-pc",
  "title": "Genshin Impact on iPhone is getting a feature it doesn't have on consoles or PC",
  "category": "phones",
  "updated": "2021-10-15T09:21:02Z",
  "author": "tom-bedford",
  "summary": "120Hz support",
  "article": [
    "Gaming on iPhones just got a lot more tempting, because the super-popular mobile game Genshin Impact just got a big upgrade, and it's only currently available on Apple smartphones.",
    "As spotted by GSMArena, Genshin Impact's version 2.2.0 update has rolled out, and according to the App Store listing it has a new feature: \"new Function: 120 FPS option for some devices\".",
    "The update log in the Google Play Store doesn't reference this feature, despite listing all the same other upgrades, implying support for 120fps isn't coming to Android phones, and the feature is also not available for PCs or consoles.",
    "For a phone to support 120fps, it needs to have a 120Hz display (which means it can update 120 times per second). While loads of Android devices have this kind of display, only the iPhone 13 Pro and Pro Max, and the last few generations of iPad Pro, do from Apple's line-up.",
    "Faster refresh rates, and frame rates, make motion look smoother; most smartphones support 60fps gameplay, and many TVs and monitors also top out at a lower level, so Genshin Impact at 120fps is a big win.",
    "As one of the most popular mobile games right now - and one TechRadar recently voted mobile game of the year in its Choice Awards - Genshin Impact getting 120fps support is a big step for mobile gaming.",
    "While many smartphones have 120Hz displays, the list of games that actually supports that hardware is pretty short. Many titles don't actually let you enjoy the smooth refresh rate, as it's quite intensive on the phone's processor.",
    "With Genshin Impact supporting 120fps gaming though, hopefully other games follow suit, letting mobile gamers enjoy the hardware their phone offers.",
    "The mobile gaming sector is rather innovative when it comes to hardware - with many different smartphones on the market, all touting different displays and processors, game developers have learnt to optimize their titles for a huge range of devices. This means games will work on low-power devices or giant screens the same way they would on powerful and normal-size devices.",
    "Lots of top-end mobile games do offer 120fps support already, but there are still many big titles that don't - as Genshin Impact doesn't on Android devices. Hopefully, as more titles offer it (and more phones get 120Hz displays) we'll see more big mobile titles with 120fps support."
  ],
  "headers": {
    "5": "Analysis: a step in the right direction for mobile gaming"
  },
  "links": {
    "GSMArena": "https://www.gsmarena.com/genshin_impact_gets_120fps_support_on_ios-news-51424.php",
    "App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1453385686761140700&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fgenshin-impact%2Fid1517783697",
    "Google Play Store": "https://play.google.com/store/apps/details?id=com.miHoYo.GenshinImpact&hl=en_GB&gl=US",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "mobile game of the year in its Choice Awards": "https://www.techradar.com/news/dell-g15-ryzen-edition-voted-best-budget-laptop-at-techradar-choice-awards-2021"
  }
}