{
  "source": "https://www.techradar.com/news/xiaomi-mi-11s-price-just-leaked-ahead-of-its-february-8-launch",
  "title": "Xiaomi Mi 11's price just leaked ahead of its February 8 launch",
  "category": "phones",
  "updated": "2021-02-05T09:35:14Z",
  "author": "aakash-jhaveri",
  "summary": "No word on the others in the series though",
  "article": [
    "We’re only a few days away from the global launch of the Xiaomi Mi 11 series, which means we have a lot more clarity about what to expect. A new leak now gives us a good idea of the price we should expect.",
    "Unveiled in China in late December, the Xiaomi Mi 11 is the company’s latest flagship smartphone that aims to take on the likes of Samsung and OnePlus. It will launch in Europe on February 8, and that will be followed by India a few weeks later.",
    "We're currently expecting the phone to be on sale in the UK and India, but that hasn't been confirmed and we don't yet know if it'll be available in the US or Australia.",
    "As per information received by 91mobiles, the Xiaomi Mi 11 will be available in two variants in Europe. The base variant with 8GB of RAM and 128GB of storage is said to be priced at €799 (around $950, £700, AU$1,250, Rs 70,000), while the 8GB + 256GB model will go for €899 (around $1,050, £800, AU$1,400, Rs 78,000).",
    "Those prices are significantly higher than their Chinese counterparts, where the base variant is priced at CNY 3,999 (around £450 / Rs 45,000) and CNY 4,699 (around £530 / Rs 53,000) for the higher variant.",
    "This leak also suggests the top-of-the-line 12GB + 256GB model will not be available globally at launch.",
    "The Mi 11 series is also confirmed to launch in India “soon”, which we expect to be March. Historically, the price in India has been closer to the Chinese pricing, which will be a sigh of relief for many.",
    "Rumors also suggest that the Mi 11's global launch will see more devices introduced. A Xiaomi Mi 11 Ultra and a Mi 11 Lite are also expected to share the stage, allowing the brand to refresh its offerings at multiple prices at once.",
    "On the other hand, we know almost everything there is to know about the vanilla Mi 11. It will be powered by the Qualcomm Snapdragon 888 chipset and will be 5G-capable globally. It sports a large curved 6.81-inch AMOLED display with a QHD+ resolution, 120Hz refresh rate, HDR10+ certification and Gorilla Glass Victus protection.",
    "As for cameras, the Xiaomi Mi 11 has a 108MP f/1.9 primary sensor, a 13MP ultra-wide lens and a 5MP macro shooter, along with a 20MP selfie camera. Other features include a 4,600mAh battery with support for 55W fast charging, dual stereo speakers and MIUI 12."
  ],
  "headers": {},
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "February 8": "https://www.techradar.com/news/xiaomi-mi-11-launch-date-confirmed-well-see-the-samsung-galaxy-s21-rival-soon",
    "91mobiles": "https://www.91mobiles.com/hub/mi-11-global-price-revealed-exclusive/",
    "confirmed to launch in India": "https://www.techradar.com/news/redmi-note-10-tipped-to-launch-in-india-in-february-followed-by-the-mi-11",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Gorilla Glass Victus": "https://www.techradar.com/news/dnp-gorilla-glass-victus-is-cornings-next-leap-for-smartphone-displays"
  }
}