{
  "source": "https://www.techradar.com/news/google-will-rewards-certain-developers-with-a-higher-sales-cut",
  "title": "Google will reward certain developers with a higher sales cut",
  "category": "computing",
  "updated": "2021-06-28T19:00:32Z",
  "author": "anthony-spadafora",
  "summary": "Play Media Experience Program aims to bring Android media apps to TVs, cars and smartwatches",
  "article": [
    "Although there are now 3bn smartphones running its mobile operating system, Google wants developers to get their Android apps onto even more devices which is why the company has announced its new Play Media Experience Program.",
    "In addition to smartphones and tablets, smartwatches, TVs and even cars now run Android though most developers have focused their efforts on creating apps for Android smartphones.",
    "This could soon change as Google plans to offer an incentive in the form of a 15 percent service fee (as opposed to Google Play's normal 30 percent fee) to developers in an effort to “invest in best-in-class media experiences across devices” according to a new post in the Android Developers Blog.",
    "VP of Play Partnerships at Google, Purnima Kochikar explained in her post that the company wants to bring apps offering video, audio and books to more Android-powered devices.",
    "To be eligible for a service fee of 15 percent, video apps will require integrations with Android TV, Google TV and Google Cast, audio apps will need to work across Wear OS, Android Auto, Android TV and Google Cast and reading apps will need to be optimized for tablets and integrate with Google's new Entertainment Space.",
    "Developers that want to participate in the Play Media Experience Program will need to fill out a Google Form to be considered for the program. However, the form also provides additional information on the criteria that must be met to be eligible.",
    "Interested developers will first need to have an app with over 100,000 monthly active installs on Google Play and the app will also need to offer a high quality user experience with a high Google Play rating. Additionally, their developer account must be in good standing to be eligible.",
    "If Google wants high-quality apps on even more devices running Android, then offering developers a higher sales cut is the right kind of incentive to encourage them to do so.",
    "We'll likely hear more regarding the Play Media Experience Program once developers accepted to the program begin offering their apps on WearOS, Android Auto, Android TV and Google Cast in addition to Android smartphones and tablets.",
    "Via Ars Technica"
  ],
  "headers": {
    "5": "Play Media Experience Program"
  },
  "links": {
    "Android apps": "https://www.techradar.com/best/best-android-apps-2021",
    "Play Media Experience Program": "https://play.google.com/console/about/mediaprogram/",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "30 percent fee": "https://www.techradar.com/news/google-cuts-play-store-commission-fee-but-indian-app-developers-unimpressed",
    "new post": "https://android-developers.googleblog.com/2021/06/continuing-to-boost-developer-success.html",
    "Entertainment Space": "https://www.techradar.com/news/googles-new-entertainment-space-for-tablets-takes-aim-at-the-amazon-fire-hd-10",
    "Google Form": "https://www.techradar.com/reviews/google-forms",
    "the form": "https://docs.google.com/forms/d/e/1FAIpQLScMVrqLonF5akIViuIlSVLQFCV_kVSWpn68X-uVY3HR2TcO-A/viewform",
    "Ars Technica": "https://arstechnica.com/gadgets/2021/06/google-to-android-devs-support-more-form-factors-get-a-higher-sales-cut/"
  }
}