{
  "source": "https://www.techradar.com/news/amazon-is-making-its-own-tvs-and-theyre-surprisingly-affordable",
  "title": "Amazon is making its own TVs – and they’re surprisingly affordable",
  "category": "televisions",
  "updated": "2021-09-09T13:00:27Z",
  "author": "nick-pino",
  "summary": "Here's your first look at the official Amazon Fire TV Omni Series",
  "article": [
    "Amazon has taken the wraps off its first-ever in-house 4K TV series, called the Amazon Fire TV Omni Series, that was designed to compete with LG, Samsung and Sony televisions.",
    "The new series of televisions will be available starting in October in 43-, 50-, 55-, 65-, and 75-inch sizes - but for now Amazon says they’ll only be available in the US at Best Buy and Amazon.",
    "What separates the Omni Series from other TVs - even the Amazon Fire TVs that were developed with Toshiba and Insignia - is a deeper level of integration with Amazon’s own services.",
    "For starters, it’s the first Alexa Home Theater device that can use Amazon Echo devices as surround sound speakers. In addition, the Omni comes with a built-in microphone for Alexa commands (similar to the Fire TV Cube) and they’ll offer several new commands like “Alexa, What Should I Watch?” that will make their debut on the Omni series.",
    "While they won’t support every new standard in 4K TVs - they’re basic LED-LCD TVs without a quantum dot filter - the Omni series does support a number of new standards including HDR10, HLG and Dolby Vision in the 65-inch and 75-inch models.",
    "Amazon didn’t specify whether the TVs will be native 120Hz with HDMI 2.1 ports (we’re leaning towards a no there) but they will support Dolby Atmos audio if they’re connected to an Amazon Echo Studio speaker.",
    "More surprising, however is their cost: they start at just $409 (around £300, AU$550). That puts them in the same range as most budget TVs from the big-name players, and you're getting a ton of features inside the box.",
    "At launch, Amazon says you’ll be able to use the TV like an Alexa device to turn devices on and off, but down the road it will become a whole home control center thanks to the all-new smart home dashboard. With it, you’ll be able to view security camera feeds on the TV and control groups of devices all while watching your TV.",
    "Finally, if you want to use your TV like a video conferencing device, Amazon says it will enable the Omni TV to work with Zoom and Alexa Calling by plugging in a webcam.",
    "If previous years' data is anything to go by, Amazon's got a huge hit on its hands with the Omni TVs - even if they aren't the best-looking TVs ever made.",
    "In an interview with TechRadar, Daniel Rausch, Vice President, Entertainment Devices and Services told us that, as you’d expect, Amazon devices sold incredibly well over Amazon Prime Day this last year. In particular, though, the Amazon Fire TV Stick 4K outsold everything - and it’s not a stretch of the imagination to think the same will be true for the Amazon Omni during Black Friday and Cyber Monday.",
    "Considering their low starting price of $409 (around £300, AU$550) and robust feature set, we’re expecting to see these TVs fly off the shelf… er, storage facility fast.",
    "“In terms of capabilities, which is where I think customers start, you’re going to find everything you’d want here from 4K TV across a whole range of sizes, prices and brands. Anyone looking for a 4K TV will find the features at the price point that fit them best,” Rausch said during our interview.",
    "Another nugget from the interview is the fact that the Amazon Omni TVs will support Amazon Luna right out of the gate - meaning you’ll have a TV that can play some of the latest games from Ubisoft as they’re released.",
    "We’ll have to wait to test them for ourselves to see how good they are - arguably the biggest question mark around the new TVs is their performance - but at this price point and Amazon’s clout in the TV sales business, they could sell like hotcakes."
  ],
  "headers": {
    "4": "Feature-rich at an affordable price",
    "9": "Analysis: They’re going to sell like hotcakes during Black Friday and Cyber Monday"
  },
  "links": {
    "Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Amazon Luna": "https://www.techradar.com/news/amazon-luna-first-look-is-amazons-game-streaming-service-worth-trying"
  }
}