{
  "source": "https://www.techradar.com/news/iphone-13-pro-vs-iphone-13-pro-max",
  "title": "iPhone 13 Pro vs iPhone 13 Pro Max: Apple's apex predator phones face off",
  "category": "phones",
  "updated": "2021-12-04T01:50:43Z",
  "author": "jon-mundy",
  "summary": "Which is the best 2021 iPhone?",
  "article": [
    "The iPhone 13 family is out in the wild, and the iPhone 13 Pro and iPhone 13 Pro Max stand as the apex predators.",
    "With unmatched power, formidable camera capabilities, and sharp-edged designs to die for, they’re two of the best phones on the market right now.",
    "But how do they compare to one another? Is bigger really better with this year’s batch? Or does the more compact Pro punch above its weight?",
    "We’ve spent a fair amount of time with both phones, so we feel pretty well qualified to supply the answers. This is a close one.",
    "Both the iPhone 13 Pro and the iPhone 13 Pro Max landed in shops on September 24, 2021.",
    "The entry-level iPhone 13 Pro 128GB costs $999 / £949 / AU$1,699, while the 256GB model comes in at $1,099 / £1,049 / AU$1,869, with the 512GB model priced at $1,299 / £1,249 / AU$2,219. There’s also a 1TB model this time around, costing $1,499 / £1,449 / AU$2,569.",
    "Prices for the iPhone 13 Pro Max start from $1,099 / £1,049 / AU$1,699 for the 128GB model, moving up to $1,199 / £1,149 / AU$1,869 for 256GB, and $1,399 / £1,349 / AU$2,219 for the 512GB model. The new 1TB model will cost you $1,599 / £1,549 / AU$2,569.",
    "The iPhone 13 Pro is cheaper by $100/£100 across the range, then. The question is, does that extra money get you a correspondingly superior phone?",
    "The iPhone 13 Pro and the iPhone 13 Pro Max look almost identical – and both continue the design approach laid out by last year’s iPhone 12 Pro and iPhone 12 Pro Max.",
    "This means the same flat-edged industrial design, with bodies made of shiny, surgical-grade stainless steel, and glass to the front and rear. The displays are again covered by Apple’s Ceramic Shield, which is a type of glass that’s said to be four times tougher than rival efforts.",
    "The one and only difference between these phones from a design perspective relates to size. The iPhone 13 Pro measures 146.7 x 71.5 x 7.65mm and weighs 204g, while the iPhone 13 Pro Max is 160.8 x 78.1 x 7.65mm and 238g.",
    "Both handsets are available in a fresh batch of matte color options, comprising Graphite, Gold, Silver, and Sierra Blue. All are relatively muted, but the latter is really quite striking from certain angles.",
    "You’ll have to contend with much larger camera modules with both phones. They share the same size which makes more of an impact with the smaller iPhone 13 Pro.",
    "Both are significantly larger than even last year’s iPhone 12 Pro Max. Neither phone will sit especially flat on a table, and last year’s iPhone 12 Pro and iPhone 12 Pro Max cases won’t fit these devices.",
    "One design element that’s fresh to both phones is a display notch that’s 20% smaller than before. Apple hasn’t done anything special with this extra screen space, but at least things are moving in the right direction. Here’s to a notchless future.",
    "The iPhone 13 Pro packs a 6.1-inch Super Retina XDR OLED display with a 2532 x 1170 resolution. The iPhone 13 Pro Max has a much larger 6.7‑inch 2778 x 1284 Super Retina XDR OLED.",
    "They’re essentially the same display, only in different sizes. Both can hit a peak brightness of 1200 nits for HDR content, and 1000 nits in bright outdoor lighting, which is ample.",
    "The main shared feature of note here is the new 120Hz refresh rate. Apple has finally caught up with its Android rivals, offering screens that are literally twice as fluid as last year’s models.",
    "While it’s late to the party, Apple’s implementation is predictably solid and fuss-free. This isn’t a feature you can toggle off to save battery. Rather, Apple has taken its new display technology into account, increasing the battery size and making use of LTPO (low-temperature polycrystalline oxide) technology to scale down to as low as 10Hz for static images and the like.",
    "LTPO is nothing new – phones such as the OnePlus 9 Pro and Oppo Find X3 Pro both make use of it. But Apple has gone one step further and optimised iOS for it, so the refresh rate will scale according to the speed of your touch inputs.",
    "The quality of both of these displays is a decent step up from what has come before. In terms of a comparison with one another, the iPhone 13 Pro Max’s more generous size obviously gives it the edge with all media content, but that’s really all there is to it.",
    "The iPhone 12 Pro Max had the best camera of the entire iPhone 12 range, which left the iPhone 12 Pro feeling like a bit of a second-tier disappointment. It isn’t what you want from your ‘Pro’ device.",
    "Thankfully, this isn’t the case with the iPhone 13 Pro and the iPhone 13 Pro Max. The camera systems are identical this time around.",
    "You’re looking at a trio of 12-megapixel sensors in both cases. These are led by an all-new larger wide sensor with a f/1.5 aperture (both of the previous models were f/1.6), which supplies a 2.2x improvement in low-light shots compared to the iPhone 12 Pro. It’s less of a jump forward for the iPhone 13 Pro Max compared to its predecessor, but still a major improvement.",
    "The ultra-wide sensor for both phones has been widened to an f/1.8 aperture, which is much larger than the f/2.4 equivalent in the iPhone 12 Pro and iPhone 12 Pro Max. All in all, this sensor enjoys a 92% low-light improvement over the iPhone 12 Pro’s ultra-wide.",
    "New to both phones is the ability to capture macro shots from as near as 2cm away, utilising the aforementioned ultra-wide sensor.",
    "The 12-megapixel telephoto lens has also received a boost to a 3x optical zoom. Again, that’s a bigger improvement for the iPhone 13 Pro than the iPhone 13 Pro Max, as is the presence of sensor-shift stabilization technology. It was present in the iPhone 12 Pro Max last year, but not the iPhone 12 Pro.",
    "This time around, you can take Night mode shots using the telephoto sensor, which is a great feature for those zoomed-in low-light shots.",
    "Both phones benefit from some cool new tricks, such as Photo­graphic Styles. These let you adjust the fundamental look of your shots, whether that’s more punchy Samsung-like tones or a cooler Pixel-like look.",
    "On the video front there’s the new Cinematic mode, which applies a Portrait-mode-like blur effect to everything but the subject. What’s more, it will intelligently switch this focus when the subject changes their gaze. You can also adjust the area of focus post-production.",
    "Apple needs to iron out the kinks with Cinematic mode, but it’s undoubtedly fun to experiment with even at this early stage.",
    "More goodies are still to come for the iPhone 13 Pro and iPhone 13 Pro Max. We’re expecting iOS 15.1 to bring support for the ProRes video codec, which lets you preserve more information in your footage for greater editing options. Get ready to boost those shadows post-production.",
    "All in all, these are comfortably the two best iPhone camera systems we’ve ever seen, and arguably the best two smartphone cameras on the market.",
    "Just as the iPhone 13 Pro and iPhone 13 Pro Max share identical camera systems, so too are they tied on performance. Both phones feature Apple’s latest A15 Bionic chip.",
    "And it isn’t just any A15 Bionic chip – this iteration has a fifth GPU core, unlike the 4-core iPhone 13 and iPhone 13 mini.",
    "This chip absolutely obliterates the competition. Both CPU and GPU are said to be 50% faster than their Android rivals.",
    "Our own tests certainly back this up. The iPhone 13 Pro Max trounced the Samsung Galaxy S21 Ultra (surely what Apple was referencing with its own comparisons) on frame rate, multi-core capability, and video transcoding speed. And the iPhone 13 Pro scored 4718 in our CPU-focused Geekbench 5 multi-core tests, which is a good 35% higher than most current Android flagships.",
    "That isn’t the comparison we’re focusing on here, of course. But that’s because there really is no comparison to make, given that the components are identical. All you really need to know is that these are the two fastest phones on the market in almost every respect – and it isn’t even close.",
    "Both phones give you the same storage options, too: 128GB, 256GB, 512GB, and 1TB. The latter is a first for Apple, and is a quite ridiculous amount of storage for a phone, unless you’re shooting a lot of 4K footage.",
    "5G support is better than ever with both phones, although delivery will depend on the territory in which you live. It still doesn’t seem like a particularly important feature to us, but coverage is improving across the developed world.",
    "Both the iPhone 13 Pro and the iPhone 13 Pro Max have upped their battery capacities by a fair amount. The iPhone 13 Pro packs a 3095mAh cell, while the iPhone 13 Pro Max gives you a 4352mAh cell.",
    "Apple’s new 120Hz display isn’t quite the battery hog you might expect it to be, either. Thanks to the use of LTPO display technology and some smart software optimisation, both phones will intelligently scale their refresh rates according to the task at hand.",
    "Ultimately, both phones offer an extension to their battery life compared to last year’s models. Apple is claiming an extra 1.5 hours for both, and we wouldn’t be inclined to disagree on either count.",
    "In our experience, the iPhone 13 Pro will get you through a long day of intensive usage with 10-20% left. Lighter days will get you closer to half a tankful remaining.",
    "The iPhone 13 Pro Max is even better, offering the best battery life we’ve ever seen from an iPhone to date. An intensive day of use here would leave us with a third left, while it sports the best 5G browsing stamina we’ve ever seen in a phone.",
    "Neither phone offers a particularly impressive charging provision, however. There’s no charger in the box, and both will only support up to 20W wired and 15W wireless.",
    "However, you do get MagSafe support with both phones, which is a cool magnetised wireless charging system that debuted with the iPhone 12 line.",
    "The iPhone 13 Pro and the iPhone 13 Pro Max offer solid if unspectacular improvements over their iPhone 12 equivalents.",
    "There’s the usual boost to power and camera quality, virtually unchanged designs (except for a smaller notch), and much-improved battery and camera provisions.",
    "Unlike last year’s models, the iPhone 13 Pro and iPhone 13 Pro Max are much closer in feature set to one another, which makes this a more difficult call to make. There’s literally no difference in terms of camera or display quality, while performance is identical.",
    "In fact, aside from the obvious size difference, the only edge the iPhone 13 Pro Max has over its smaller brother is battery life.",
    "That’s enough to give the Pro Max a narrow win in our book, but those with a lower budget and/or a dislike of large phones will want to plump for the Pro. Either way, you’re looking at two of the very best phones on the market right now.",
    "You might also want to check out the iPhone 12 Pro vs iPhone 12 Pro Max comparison."
  ],
  "headers": {
    "4": "iPhone 13 Pro vs iPhone 13 Pro Max price and availability",
    "8": "Design",
    "15": "Display",
    "21": "Camera",
    "33": "Specs and performance",
    "40": "Battery life",
    "47": "Takeaway"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iOS 15.1": "https://www.techradar.com/news/ios-151-news",
    "ProRes video": "https://www.techradar.com/news/what-is-apple-prores",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories",
    "iPhone 12 Pro vs iPhone 12 Pro Max": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-12-pro-max"
  }
}