{
  "source": "https://www.techradar.com/news/groceries-babies-picnics-raleighs-new-cargo-e-bikes-can-carry-them-all",
  "title": "Groceries, babies, picnics – Raleigh's new cargo e-bikes can carry them all",
  "category": "fitness",
  "updated": "2021-07-27T13:02:00Z",
  "author": "cat-ellis",
  "summary": "Ready to ditch your second car?",
  "article": [
    "Raleigh has launched a pair of new electric bikes to handle all your everyday chores, from grocery shopping to picking up the kids from school. The Stride 2 and Stride 3 can carry loads up to 80kg and 100kg respectively,",
    "Bikes in the new Stride line-up have the robust looks of a delivery vehicle for carrying pizzas and parcels – and Raleigh suggests that they can be used as such – but they're chiefly meant for personal use, making light work of daily errands.",
    "Companies like Cowboy and WAU Bike have proved that electric bikes can be chic, but the Stride lineup is built for strictly for practicality. That means a steel frame, integrated front and rear lights, full metal fenders and black paintwork, with what Raleigh calls \"a dash of playful mustard yellow\".",
    "The Stride 2 (a bike) and Stride 3 (a tricycle) both have front carriers made from aluminum with foam cushioning, and can be upgraded for the school run with the addition of a rain tent, box cover, bike cover, baby and toddler seats, bench cushions, and car seat brackets.",
    "Hydraulic disc brakes provide plenty of stopping power, which is always important for an e-bike, which is subject to greater forces than a conventional bicycle, and even more so for a cargo bike carrying a heavy load.",
    "As with any e-bike the range you can achieve will depend on its load, the terrain, and your power usage, but Raleigh cites a range of around 30-40 miles – more than enough for a long day of chores.",
    "The Stride 2 is on sale now for £4,395 (about $6,000 / AU$8,200), and the larger Stride 3 trike costs £4,695 (about $6,500 / AU$8,800). That's roughly twice the price of our current top-rated e-bike, the Cowboy 4,",
    "Evidence suggests that people want to drive less (a recent survey of 20,000 motorists by the Automobile Association in the UK found that 40% plan to cut their mileage) and e-bikes are one way to make that possible. They cost far less to buy and run than a car, and take the sweat out of daily errands.",
    "There's just one problem: however powerful the motor, a typical e-bike limits you to whatever you can carry using panniers, a luggage rack, and a backpack. For many errands, that's just not feasible.",
    "Raleigh's Stride bicycle and trike are built to help bridge that gap, but it isn't the only bike-maker to spot the need for something roomier, and we're starting to see an increasing number of electric cargo bikes hitting the streets.",
    "The Rad Power Bikes RadWagon, for example, is a super tough e--bike that can carry an adult rider, plus a huge amount of shopping or two children, with a total payload capacity of 158kg. The Tern GSD and Riese & Muller Load 60 both have a maximum capacity of 200kg, and the GSD can even carry a second adult as a passenger.",
    "All of these bikes with a longer wheelbase, more powerful motor, and greater battery capacity than your typical e-bike, and most have optional extras such as rain covers or tarpaulins, child seats, and trailer mounts to give you even more options.",
    "In , today's cargo e-bikes can fulfil almost all of the roles of a second car, providing a convenient and fast way to get around town. They're not a perfect solution (they're bigger and bulkier than a typical e-bike, which makes them somewhat trickier to lock up securely, and they're typically more expensive), but they're definitely worth considering if you want to reduce your reliance on a car."
  ],
  "headers": {
    "4": "Power to move – and stop",
    "7": "Analysis: can an e-bike replace the second car?"
  },
  "links": {
    "electric bikes": "https://www.techradar.com/best/electric-bike",
    "Cowboy": "https://www.techradar.com/reviews/cowboy-4",
    "WAU Bike": "https://www.techradar.com/reviews/wau-x",
    "Cowboy 4": "https://www.techradar.com/reviews/cowboy-4",
    "Rad Power Bikes RadWagon": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8176280294374378000&xs=1&url=https%3A%2F%2Fradpowerbikes.eu%2Fproducts%2Fradwagon-electric-cargo-bike&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fgroceries-babies-picnics-raleighs-new-cargo-e-bikes-can-carry-them-all",
    "Tern GSD": "https://www.ternbicycles.com/uk/bikes/472/gsd",
    "Riese & Muller Load 60": "https://www.r-m.de/en-gb/bikes/load-60/"
  }
}