{
  "source": "https://www.techradar.com/news/social-media-platform-parler-may-never-return-after-aws-shutdown",
  "title": "Parler 'may never return' after AWS shutdown",
  "category": "computing",
  "updated": "2021-01-14T14:20:26Z",
  "author": "joel-khalili",
  "summary": "Parler CEO has admitted the social network is in serious trouble",
  "article": [
    "Social media platform Parler “may never return” to service after it was abandoned by a series of technology partners last week, the firm’s CEO has conceded.",
    "The right-leaning social network was dragged offline after Amazon Web Services (AWS), which provided the infrastructure necessary for Parler to operate, pulled the plug over apparent insufficiencies in the platform’s content moderation policies.",
    "Before dropping offline, Parler was also removed from the Google Play Store and Apple App Store, the two largest app marketplaces in the world, over threatening and violent content that remained live on the platform.",
    "As suggested by John Matze, Parler CEO, the social network has found it impossible to secure another content distribution partner, made untouchable by its political associations and the actions of Apple, Google and Amazon.",
    "Marketed as the “free speech” social network, Parler is renowned for its laissez-faire attitude to content moderation and has long resisted any form of user surveillance.",
    "For this reason, it was clear favorite to become the platform of choice for disgraced US President Donald Trump after he was banned from Twitter and Facebook last week, and even topped the App Store download charts for a brief period in the aftermath.",
    "Although concerns had already been expressed that alt-right groups were using the platforms to organize rallies and spread misinformation, the widespread boycott was triggered by the storming of the US Capitol Building, which was said to have been organized in part over Parler.",
    "By preventing the platform from serving users and blocking the distribution of the app, Big Tech has effectively conspired to erase Parler from the public internet, in what some have described as a politically motivated move.",
    "Parler has since launched a lawsuit against AWS over alleged violations of antitrust law and breaches of the contractual agreement between the pair. Amazon, for its part, claims that threatening content hosted on Parler amounted to a breach of contract, justifying the shutdown.",
    "According to Matze, the best case scenario for Parler would be to resolve its dispute with AWS, which would offer the quickest path to a return of service.",
    "“We’re going to fight to do everything we can to come back, as soon as possible. And I’d like to think that’s viable,” he said in an interview with Reuters.",
    "“But really, in order to come back quickly, the best thing that could happen to us [would be to] get back on Amazon. The damage of them taking us off is far beyond financial; we cannot recover unless they put us back. It could be never, we don’t know yet,” he added.",
    "AWS did not respond immediately to our request for comment.",
    "Update:",
    "An AWS spokesperson has since provided the following statement:",
    "\"There is no merit to these claims. AWS provides technology and services to customers across the political spectrum, and we respect Parler’s right to determine for itself what content it will allow.\"",
    "\"However, it is clear that there is significant content on Parler that encourages and incites violence against others, and that Parler is unable or unwilling to promptly identify and remove this content, which is a violation of our terms of service. We made our concerns known to Parler over a number of weeks and during that time we saw a significant increase in this type of dangerous content, not a decrease, which led to our suspension of their services Sunday evening.\""
  ],
  "headers": {
    "4": "Parler boycott"
  },
  "links": {
    "pulled the plug": "https://www.techradar.com/news/aws-suspends-web-hosting-for-controversial-parler-app",
    "Reuters": "https://www.reuters.com/article/us-usa-trump-parler-exclusive-idUSKBN29I2Z7"
  }
}