{
  "source": "https://www.techradar.com/news/finance-industry-could-see-huge-benefits-from-cloud-computing",
  "title": "Finance industry could see huge benefits from cloud computing",
  "category": "computing",
  "updated": "2021-08-13T03:07:09Z",
  "author": "anthony-spadafora",
  "summary": "Financial services companies have begun to see the advantages of moving to the cloud",
  "article": [
    "Despite the fact that moving to the public cloud and adopting cloud computing services can greatly benefit the finance industry, new research from Google Cloud has revealed that a number of financial services companies remain hesitant in their cloud journeys.",
    "By moving to the cloud, organizations in the finance industry can advance operational resiliency, improve staff productivity, increase regulatory compliance and enhance business model innovation. However, barriers to cloud adoption for financial services companies include the complexity of legacy systems, skills gaps, regulatory uncertainty and fragmentation of compliance requirements.",
    "To better understand both the challenges and opportunities facing the finance industry when it comes to cloud adoption, Google Cloud commissioned Harris Poll to survey over 1,300 leaders in the field across the US, Canada, France, Germany, the UK, Hong Kong, Japan, Singapore and Australia.",
    "Research vice president for IDC Financial Insights, Jerry Silva provided further insight in a blog post on what financial services companies need to consider when moving their workloads and operations to the cloud, saying:",
    "\"While many banks have already deployed hybrid cloud environments, others are still in various stages of planning and deploying. Clearly, hybrid infrastructure is a reality, and financial institutions must focus not only on leveraging the modern infrastructure model to gain efficiencies, resilience and agility, but also on taking the necessary steps to manage such environments, including the security and compliance of cloud services.”",
    "According to Google Cloud's study, 83 percent of the financial services companies surveyed report they are deploying cloud technology as part of their primary computing infrastructures.",
    "When it came to the architecture of choice amongst these firms, hybrid cloud is the most popular at 38 percent, followed by single cloud at 28 percent and multicloud at 17 percent. However, 88 percent of respondents said they are considering adopting a multicloud strategy during the next 12 months.",
    "The survey also revealed that financial services institutions in North America are leading cloud adoption with institutions in the US (54%) and Canada (52%) taking the top spots while the lowest level of cloud adoption was reported in Japan (42%).",
    "Although there is some hesitancy when it comes to moving to the cloud, nearly all respondents (88%) agree that cloud adoption can help them adapt to changing customer behaviors and expectations, enhance operation resilience, support the creation of new innovative products and services and better connect siloed legacy software infrastructure within the finance industry.",
    "Now that the benefits of moving to the public cloud are beginning to become more obvious, expect organizations in the finance industry to adopt or begin their plans to adopt cloud computing services going forward."
  ],
  "headers": {
    "5": "Cloud adoption in the finance industry"
  },
  "links": {
    "public cloud": "https://www.techradar.com/news/what-is-public-cloud",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Google Cloud": "https://www.techradar.com/reviews/google-cloud-cdn",
    "barriers to cloud adoption": "https://www.techradar.com/news/businesses-are-finally-starting-to-trust-the-cloud",
    "Harris Poll": "https://www.techradar.com/news/stalkerware-cases-are-seeing-a-huge-rise",
    "blog post": "https://cloud.google.com/blog/topics/inside-google-cloud/new-study-shows-cloud-adoption-increasing-in-financial-services",
    "hybrid cloud": "https://www.techradar.com/news/what-is-hybrid-cloud",
    "multicloud": "https://www.techradar.com/news/what-is-multicloud",
    "legacy software": "https://www.techradar.com/news/where-to-start-modernizing-your-legacy-portfolio"
  }
}