{
  "source": "https://www.techradar.com/news/save-dollar750-and-bag-a-4k-touchscreen-model-in-one-of-the-best-dell-xps-13-deals-ever",
  "title": "Save $750 and bag a 4K touchscreen in one of the best Dell XPS 13 deals ever",
  "category": "computing",
  "updated": "2021-05-08T16:04:05Z",
  "author": "alex-whitelock",
  "summary": "Definitely don't miss this one",
  "article": [
    "Still available on the official Dell store this weekend is what is, perhaps, the best Dell XPS 13 deal we've seen all year - this new 4K touchscreen model for just $949.99 (was $1,699).",
    "Yes, that's a whopping $750 saving. This one doesn't just have a fancy screen either, there's also a fairly powerful Intel Core i7-1065G7 processor, 8GB of RAM, and a 256GB SSD hiding under the hood. While that's not the latest processor on the market it's still very, very powerful, and you're still getting the latest chassis design here - one that features a beautiful bezel-less display.",
    "We've actually previously written about this specific Dell XPS 13 deal over the past few weeks but it's such a strong sale we really think It's worth standing up and taking note of. We rarely see Dell XPS 13 deals this good on the latest models - especially those with 4K displays - and it's likely it'll be a while before the equivalent machines with 11th gen Intel Core processors hit this price range.",
    "For context, this 10th gen Core i7 model with a 4K display is actually cheaper than the standard non-4k model with an 11th gen Core i5 processor right now. Subsequently, we think it's absolutely amazing value considering you're getting an upgraded display and a more powerful, albeit slightly older processor.",
    "Looking for something a bit cheaper? We've included a more budget-friendly pick just below, alongside a round-up of the cheapest laptop deals in your region - which includes options for readers outside the US.",
    "If you'd like to do a bit of further reading or want to see options for other machines in the range, see our main page on the best Dell XPS 13 deals."
  ],
  "headers": {
    "5": "Dell XPS 13 deals this weekend"
  },
  "links": {
    "for just $949.99 (was $1,699).": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1197620999463770400/https://deals.dell.com/en-us/mpp/productdetail/8ka8",
    "cheaper than the standard non-4k model": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4341141125640428500/https://www.dell.com/en-us/member/shop/dell-laptops/new-xps-13-laptop/spd/xps-13-9310-laptop/xn9310ekkbh",
    "laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "Dell XPS 13 deals": "https://www.techradar.com/news/dell-xps-13-deals"
  }
}