{
  "source": "https://www.techradar.com/news/how-to-watch-ball-drop-2021-online-live-stream-times-square-new-years-eve-anywhere",
  "title": "How to watch Ball Drop 2021 online: live stream Times Square New Year's Eve anywhere",
  "category": "computing",
  "updated": "2021-01-01T03:01:09Z",
  "author": "james-laird",
  "summary": "Curtains finally close on annus horribilis 2020 tonight",
  "article": [
    "Now one of history's pre-eminent annus horribilis, 2020 is ready to squeeze one final ounce of joy out your year today, as spectators are barred from attending the spectacular New Year's Eve Ball Drop in Times Square, New York City. Fortunately, there are plenty of ways to watch the Ball Drop online tonight - including options for those with without cable and even some free ways to tune in to the virtual action from the Big Apple!",
    "As usual, US TV network coverage of the event is comprehensive, with national channels ABC, NBC and CNN all hosting New Year's Eve coverage led by some of their biggest names and featuring A-list celebrity guests and musical appearances. All also feature the big 2020 Times Square Ball Drop at midnight tonight, which can't come soon enough for most people.",
    "In addition, the official Times Square website is showing a free live stream of the Ball Drop - but it's a pure live feed and won't be hosted by your favorite TV personalities or feature the kind of star-studded lineups you'll get with ABC, CNN or NBC's New Year's Eve shows.",
    "Ready to learn more? Follow our guide below as we explain how to watch the Ball Drop online tonight without cable, for free, and from anywhere in the world! Plus, we'll give you all the details you need about each channel's New Year's Eve 2020 offering, in case you're loyalties aren't already decided.",
    "If you find yourself stuck abroad in a country where the service you'd normally use to tune in to NBC isn't available or you can't get the Times Square website up and running for whatever reason, don't worry.",
    "Downloading a VPN will allow you to watch the Times Square Ball Drop no matter where you are, simply by changing your IP address to one that's back in your country of residence. Here's how to get started with this essential bit of streaming software."
  ],
  "headers": {
    "4": "How to watch the Times Square Ball Drop 2020 online from abroad"
  },
  "links": {
    "website": "https://www.timessquarenyc.org/",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}