{
  "source": "https://www.techradar.com/news/microsoft-has-created-a-whole-new-programming-language-for-low-code",
  "title": "Microsoft has created a whole new programming language for low-code",
  "category": "computing",
  "updated": "2021-03-03T10:26:41Z",
  "author": "mayank-sharma",
  "summary": "Microsoft is in the process of extracting Power Fx from its low-code platform",
  "article": [
    "Microsoft has unveiled a new general purpose programming language for low code that’ll be based on Microsoft Excel.",
    "And as is increasingly becoming the norm with the Redmond-based software giant, the new language, christened Power Fx, will be available under an open source license and put up on GitHub for everyone to use and contribute.",
    "“We have this long history of programming languages and something really interesting happened over the last 15 years, which is programming languages became free, they became open source and they became community-driven,” reasoned Charles Lamanna, CVP of Power Platform engineering at Microsoft, speaking to TechCrunch.",
    "Explaining the need for a programming language for a low-code platform, Microsoft argues that “many real-world solutions need a layer of logic that goes beyond what is practical to drag and drop.”",
    "Microsoft Power Fx currently drives the Microsoft PowerApps canvas apps. On its GitHub page, Microsoft says that they are currently “extracting the language from that product” to enable it for use in other Microsoft Power Platform products.",
    "“Microsoft Power Fx is the low code language for expressing logic across the Microsoft Power Platform. It is the same language that is at the heart of Microsoft PowerApps canvas apps today and is inspired by Microsoft Excel,” explained Greg Lindhorst, a Principal Program Manager at Microsoft.",
    "The Microsoft Power Platform is its flagship business application platform that enables companies to create and deploy tailored apps and includes several services including PowerApps, PowerBI, and Power Automate.",
    "According to TechCrunch, besides Excel Power Fx takes inspiration from Pascal, Mathematica and Miranda, which was a functional programming language from the 1980s.",
    "Via: TechCrunch"
  ],
  "headers": {
    "3": "Low-code programming language"
  },
  "links": {
    "programming": "https://www.techradar.com/reviews/pc-mac/software/programming-software",
    "Microsoft Excel": "https://www.techradar.com/best/excel-online-courses",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "GitHub": "https://www.techradar.com/news/javascript-python-and-java-remain-most-popular-languages-on-github",
    "TechCrunch": "https://techcrunch.com/2021/03/02/microsoft-launches-power-fx-a-new-open-source-low-code-language-for-its-power-platform/"
  }
}