{
  "source": "https://www.techradar.com/news/one-of-the-worlds-most-important-programming-languages-is-in-trouble",
  "title": "One of the world's most important programming languages is in trouble",
  "category": "computing",
  "updated": "2021-11-26T15:16:56Z",
  "author": "mayank-sharma",
  "summary": "The PHP Foundation will help support PHP developers",
  "article": [
    "Heavyweight users of PHP, the programming language that powers 78% of the web have scrambled to create the PHP Foundation, as one of its core contributors switches his focus to the low level virtual machines (LLVM) project.",
    "PHP is one of the most popular languages used by web developers, and powers popular content management systems (CMS) like WordPress, Joomla, Drupal, Moodle, and more.",
    "“During PHP’s 26-year history, the language has been actively developed by a huge number of people, such as Rasmus Lerdorf, Zeev Suraski, Andi Gutmans, Nikita Popov, and many, many others. In 2021, PHP is in for another round of evolution,” shares JetBrains as it announced the formation of the foundation.",
    "JetBrains says the idea of a PHP Foundation was first floated earlier this year in May. However, everyone involved didn’t make any serious attempts to proceed with the idea since the existing ecosystem had been working well to support the development of the language.",
    "All that changed however with the announcement of the departure of Nikita Popov, who had been a central figure in PHP development for the past several years.",
    "JetBrains, who employed Popov, took upon itself to actualize the creation of the foundation and began engaging with several individual, and corporate members of the PHP community.",
    "Their discussion led to the creation of PHP Foundation, which counts Automattic, Laravel, Zend, PrestaShop, and five others, as its founding members.",
    "The PHP Foundation will primarily work to fund the development of PHP. The foundation hopes to raise about $300,000 every year, with JetBrains pledging to contribute $100,000 annually.",
    "Build your websites with the help of these best Wordpress website builders and use these best WordPress hosting providers to host them"
  ],
  "headers": {
    "3": "The PHP Foundation"
  },
  "links": {
    "PHP": "https://www.techradar.com/news/php-8-new-features-and-updates",
    "PHP Foundation": "https://opencollective.com/phpfoundation",
    "web developers": "https://www.techradar.com/news/best-web-development-tool",
    "CMS": "https://www.techradar.com/best/cms",
    "WordPress": "https://www.techradar.com/reviews/wordpresscom",
    "Drupal": "https://www.techradar.com/best/drupal-hosting",
    "Moodle": "https://www.techradar.com/reviews/moodle-lms",
    "shares": "https://blog.jetbrains.com/phpstorm/2021/11/the-php-foundation/",
    "Automattic": "https://www.techradar.com/news/automattic-takes-wordpress-security-company-wpscan-under-its-wing",
    "PrestaShop": "https://www.techradar.com/best/prestashop-hosting",
    "best Wordpress website builders": "https://www.techradar.com/best/wordpress-website-builder",
    "best WordPress hosting providers": "https://www.techradar.com/news/best-wordpress-hosting-providers"
  }
}