{
  "source": "https://www.techradar.com/news/microsoft-teases-new-super-simple-onedrive-interface",
  "title": "Microsoft teases new super simple OneDrive interface",
  "category": "computing",
  "updated": "2021-09-10T03:13:41Z",
  "author": "anthony-spadafora",
  "summary": "New command bar will make it easier to find files and access primary commands",
  "article": [
    "Finding the right files in Microsoft's cloud storage service will soon be even easier as the software giant is currently working on a new interface for OneDrive.",
    "According to a new post on the Microsoft 365 Roadmap, OneDrive will soon be getting a new command bar later this month.",
    "With this update, OneDrive users will easily be able to “identify the right file and access primary commands”. However, the simplified view in OneDrive's new interface will also help boost productivity as it allows users to focus on the content they're working on as they won't be distracted by additional menus.",
    "In two separate posts, Microsoft also revealed that OneDrive will also be getting a new sharing experience in November of this year.",
    "The company is updating OneDrive's Share menu to provide easy access to additional sharing options such as email, copy link, Teams chat as well as manage to access settings.",
    "However, the “Copy link” button is set to be replaced by a footer where users will be able to set permissions before copying links and sharing them with recipients.",
    "After releasing the 64-bit version of OneDrive earlier this year, Microsoft has continually updated its cloud storage service and it will be interesting to see how these visual and sharing updates pan out."
  ],
  "headers": {
    "3": "Improved sharing experience"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "new post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9470196677185053000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3DOneDrive%252CIn%2520development%23owRoadmapMainContent",
    "Microsoft 365 Roadmap": "https://www.techradar.com/news/microsoft-teams-can-now-be-used-for-work-and-play-simultaneously",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "replaced by a footer": "https://www.techradar.com/news/major-microsoft-onedrive-update-will-change-the-way-you-share-your-files",
    "64-bit version of OneDrive": "https://www.techradar.com/news/microsoft-unveils-64-bit-version-of-onedrive-for-windows-at-last"
  }
}