{
  "source": "https://www.techradar.com/news/reddit-is-taking-its-bug-bounty-program-public",
  "title": "Reddit is taking its bug bounty program public",
  "category": "computing",
  "updated": "2021-04-15T16:30:39Z",
  "author": "anthony-spadafora",
  "summary": "Now anyone can hunt for bugs on Reddit",
  "article": [
    "Reddit has announced that it will be taking its bug bounty program public after running it privately with HackerOne for the past three years.",
    "In a post on the news aggregator and discussion forum's site, the company's security wizard Spencer Koch provided more details on the success of its bug bounty program so far, saying:",
    "“This program has allowed us to quickly address vulnerabilities, improve our defenses, and help keep our platform secure alongside our own teams’ efforts. We’ve also seen great engagement and success to date, having awarded $140,000 in bounties across 300 reports covering the main reddit.com platform, which worked well for our limited scope during the private program.”",
    "Now though, Reddit plans to expand the scope of the program to help improve the security of its site as well as its mobile apps.",
    "In an interview with HackerOne, Koch explained that Reddit started its security team back in 2018 after formalizing its private bug bounty program. This was also the same year the site was hacked and the personal data of some users was exposed in a data breach.",
    "According to Koch, Reddit's security team performs an initial triage to gauge the severity of a bug after a vulnerability is reported. However, sometimes the company allows HackerOne's triage service to do the initial screening, reproduction information gathering and sanity check before its senior security engineers take a look at a bug.",
    "Now that Reddit's bug bounty program is open to the public, any security researcher or white hat hacker can look for bugs on the platform. Once a bug is found, they can earn $100 for low severity bugs, $500 for medium ones, $5,000 for high ones and $10,000 for discovering a critical vulnerability.",
    "Those interested in hunting for bugs on Reddit can find out more information on its bug bounty program here including the program terms, severity determination and what vulnerabilities are out-of-scope for the program.",
    "Via SC Magazine"
  ],
  "headers": {
    "4": "Public bug bounty program"
  },
  "links": {
    "bug bounty program": "https://www.techradar.com/news/nordvpn-maker-has-expanded-its-bug-bounty-program",
    "HackerOne": "https://www.techradar.com/news/building-the-worlds-largest-bug-bounty-platform",
    "post": "https://www.reddit.com/r/redditsecurity/comments/mqse9a/announcing_reddits_public_bug_bounty_program/",
    "mobile apps": "https://www.techradar.com/news/software/applications/reddit-finally-has-an-official-app-hopes-to-get-it-upvoted-1318555",
    "interview": "https://www.hackerone.com/blog/reddits-public-bug-bounty-program-kicks-qa-reddits-allison-miller-and-spencer-koch-and-top",
    "site was hacked": "https://www.techradar.com/news/reddit-got-hacked-exposing-the-personal-data-of-select-users",
    "security researcher": "https://www.techradar.com/news/bug-bounties-have-made-these-hackers-millionaires",
    "white hat hacker": "https://www.techradar.com/news/apple-offers-hackers-free-iphones-to-hunt-down-ios-security-bugs",
    "here": "https://www.redditinc.com/policies/bug-bounty-program",
    "SC Magazine": "https://www.scmagazine.com/home/security-news/reddit-takes-bug-bounty-program-public/"
  }
}