{
  "source": "https://www.techradar.com/news/google-vault-to-support-website-builders-transition-from-google-sites",
  "title": "Google Vault to support website builders transition from Google Sites",
  "category": "computing",
  "updated": "2021-04-29T08:16:37Z",
  "author": "anthony-spadafora",
  "summary": "Meeting regulatory obligations is now even easier for Google Sites users",
  "article": [
    "With the deadline for users of Google's classic Sites website builder to transition to the new Sites experience fast approaching, the search giant has announced that Google Vault now supports new Google Sites.",
    "For those who are unfamiliar, Google Vault is an information governance and eDiscovery tool for Google Workspace that allows its users to retain, hold, search and export their data from Gmail, Google Drive, Google Chat, Google Meet and many other of the company's products.",
    "Google Vault could prove to be a helpful tool for classic Sites owners that have either made the transition to new Google Sites or are preparing to do so ahead of the September 1 deadline.",
    "At the same time though, Google has also created an aid called Classic Sites Manager for converting existing classic Sites to new Google Sites as unpublished drafts.",
    "In a new post on the Google Workspace blog, Google revealed that Sites users can now set retention policies, perform searches and export content from their sties using Google Vault.",
    "For those already using the service to store Google Drive files, Sites files will now be covered by those holds but Sites-specific retention rules can also be set up.",
    "By adding support for Google Sites to Google Vault, individuals and organizations that use Google's website builder will have better control over their data which can help them meet regulatory or legal obligations concerning where their data is held."
  ],
  "headers": {
    "4": "Google Sites support"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "transition to the new Sites experience": "https://www.techradar.com/news/google-sets-hard-deadline-for-classic-sites-migration",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "new Google Sites": "https://www.techradar.com/reviews/new-google-sites",
    "Classic Sites Manager": "https://sites.google.com/classicsitesmanager",
    "new post": "https://workspaceupdates.googleblog.com/2021/04/google-vault-now-supports-google-sites.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite"
  }
}