{
  "source": "https://www.techradar.com/news/nintendo-sounds-like-it-wants-to-turn-more-games-into-movies-but-why",
  "title": "Nintendo sounds like it wants to turn more games into movies – but why?",
  "category": "entertainment",
  "updated": "2021-05-06T13:33:39Z",
  "author": "samuel-roberts",
  "summary": "Nintendo is going beyond games more than ever",
  "article": [
    "Mario will hit the big screen – for the second time – with 2022's Super Mario Bros movie, but it sounds like this is just the start of Nintendo's ambitions for the big screen.",
    "Announcing its financial results for the past year this week, it was revealed that Nintendo plans to add Chris Meledandri, CEO of the Mario movie's animation studio Illumination, as an outside director to the company on June 29, if shareholders approve it.",
    "That follows a Fast Company interview this week, where Nintendo's global president Shuntaro Furukawa stated its interest in animation beyond Mario. \"Animation, in general, is something that we are looking into, and not just this franchise,\" referring to Mario. That movie is being produced by Shigeru Miyamoto, Mario's creator. Illumination is the studio behind Despicable Me, Minions and The Lorax, among others.",
    "In general, Nintendo's ambitions to grow its remit beyond games seem more pronounced than ever before. In March, Universal Studios Japan opened its Mario-themed area of the park, after several years in development, with plans to open the attraction in US Universal Studios locations, too.",
    "Nintendo isn't as closed off to adaptations of its material as you might think – at least not in recent history. As well as releasing manga based on the Zelda series, it also allowed its characters to appear in the 2012 movie Wreck-It Ralph. There are Lego sets that feature Mario, now, and several mobile games featuring Nintendo characters, with a Pikmin-themed game to come.",
    "Getting directly involved in the creation of movies and theme parks is next-level, though – it shows that Nintendo sees the evergreen value in its characters beyond their video games, and wants to ensure their values are replicated in these different franchise offshoots. About a decade ago, Nintendo started getting serious about exploring possibilities beyond games, according to Furukawa's Fast Company interview.",
    "\"It's not that we’ve asked Illumination to handle everything,” Furukawa said about the creation of the Mario movie. “Mr. Miyamoto is very, very hands-on with the production of this movie.\" At the same time, Furukawa is conscious of not letting too many game developers' attention shift to these other offshoots. The games still come first, essentially.",
    "Nintendo's characters are world-renowned, but relatively untapped in other media. The Mario movie is a good starting point, yet the roster of recognizable heroes and villains in its library is probably better-known now than it's ever been, thanks to the success of the Nintendo Switch.",
    "Super Smash Bros Ultimate on Nintendo Switch is a fighting game that features most of the company's notable characters, and it's sold 23.84 million copies as of March 2021. Heroes that began life in more obscure games – the likes of Ice Climbers and Pit from Kid Icarus – are now familiar to tens of millions of players, regardless of whether they know their origins or not.",
    "Not all of them befit a TV or movie adaptation, but a lot of them do. And while games will always remain Nintendo's focus, it has always seemed like money has been left on the table when it comes to exploring these heroes' value beyond consoles.",
    "The success of Mario on the big screen will likely drive whatever Nintendo does next – but the fact it's pulling closer to Illumination seems to bode well for future collaborations."
  ],
  "headers": {
    "4": "Why is Nintendo expanding beyond games?"
  },
  "links": {
    "Fast Company interview": "https://www.fastcompany.com/90630113/nintendo-shuntaro-furukawa-doug-bowser-interview-universal-studios-illumination-mario-movie-animal-crossing",
    "Super Smash Bros Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review"
  }
}