{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-spotted-in-new-photo-is-this-the-best-evidence-yet",
  "title": "Nvidia GeForce RTX 3080 Ti spotted in new photo – is this the best evidence yet?",
  "category": "computing",
  "updated": "2021-04-30T10:45:04Z",
  "author": "matt-hanson",
  "summary": "Custom model all but confirms existence of RTX 3080 Ti",
  "article": [
    "A new image has appeared on the internet that appears to be the strongest evidence yet that an Nvidia GeForce RTX 3080 Ti graphics card is coming.",
    "The photo, found by the Videocardz website, appears to be of a third party model, the MSI GeForce RTX 3080 Ti Ventus 3X. As the image is of the box, this GPU is likely to be hitting store shelves soon, and the launch date may not be too far off. We’ve heard separate rumors that it’ll launch on May 26 (with an announcement on May 18).",
    "While we’ve had our doubts about seeing an RTX 3080 Ti so soon, the images of the box look very persuasive. If this is a fake, it’s a very realistic one.",
    "The Suprim X range are flagship models of MSI’s cards, so we expect the MSI GeForce RTX 3080 Ti Ventus 3X to be a pretty impressive card if (or when) it gets released.",
    "Rumors suggest it’ll come with 12GB GDDR6X 384-bit memory, a decent boost over the RTX 3080’s 10GB GDDR6X 320-bit memory.",
    "With this new image, it’s now increasingly likely that we will see the Nvidia GeForce RTX 3080 Ti sooner rather than later. As soon as we hear official word from Nvidia, we’ll let you know."
  ],
  "headers": {
    "3": "A flagship flagship"
  },
  "links": {
    "Nvidia GeForce RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "found by the Videocardz website": "https://videocardz.com/newz/msi-geforce-rtx-3080-ti-suprim-x-pictured",
    "Rumors suggest it’ll come with 12GB GDDR6X": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-could-arrive-in-april-with-12gb-vram",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}