{
  "source": "https://www.techradar.com/news/it-could-finally-be-easier-to-shut-down-microsoft-edge-tabs-using-task-manager",
  "title": "It could finally be easier to shut down Microsoft Edge tabs using Task Manager",
  "category": "computing",
  "updated": "2021-10-19T09:30:35Z",
  "author": "mike-moore",
  "summary": "One of the most vital tools in Windows 11 is getting a serious upgrade",
  "article": [
    "Helping Microsoft Edge run smoothly could soon be easier than ever due to a significant upgrade to one of the most useful, but also rarely-loved Windows 11 tools.",
    "Microsoft has revealed Task Manager in Windows 11 will be getting two major additions as it looks to offer users more customization and efficiency options when using Windows 11.",
    "The new updates include closer working with the Edge browser, and also potentially a new Eco Mode aimed at saving processing power and battery life.",
    "First up, Task Manager will now be better geared towards managing Microsoft Edge and the resources and memory used by the browser.",
    "The tool will now be able to display exactly what Microsoft Edge processes are using what amount of memory on your device. When clicking on Microsoft Edge in Task Manager, users will now see a list of processes under the browser, including specific tabs, extensions and subframes - and will now be able to select any of these to close individually.",
    "The GPU and crashpad will also be included in the list of processes, with tabs also displaying the specific site, icon and topic name to give you full visibility and pinpoint exactly which areas need shutting down.",
    "The new updates are available now as part of Microsoft Edge 94 and Windows 11 Build 22000.282.",
    "The rumored Eco Mode for Task Manager, set to launch within the next few months, will let users quickly identify and target particularly resource-hungry apps, giving their devices more space to work efficiently.",
    "When activated, the tool will reportedly allow users to set the priority of such processes to \"low\", giving other programs the chance to seize priority for system resources.",
    "Windows 11 is out now, with Microsoft keen to get users switched over to the newest offering as soon as possible - provided they have the right system requirements, although this may not always neccessarily help, reports have claimed.",
    "Via WindowsLatest"
  ],
  "headers": {
    "3": "Task Manager and Edge"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "browser": "https://www.techradar.com/best/browser",
    "WindowsLatest": "https://www.windowslatest.com/2021/10/18/windows-11s-task-manager-is-getting-new-features/"
  }
}