{
  "source": "https://www.techradar.com/news/black-adam-movie-casts-ex-james-bond-star-as-dr-fate",
  "title": "Black Adam movie casts ex-James Bond star as Dr. Fate",
  "category": "entertainment",
  "updated": "2021-03-25T09:46:26Z",
  "author": "tom-power",
  "summary": "The Justice Society of America is complete",
  "article": [
    "Black Adam, Warner Bros' upcoming movie on DC Comics' anti-hero, has found its final Justice Society of America member.",
    "Deadline has reported that former James Bond star Pierce Brosnan has been tapped to play Dr. Fate and, in the process, the British actor has rounded out the film's main cast before filming begins next month.",
    "The news was later confirmed by Black Adam's main star Dwayne 'The Rock' Johnson on Instagram. You can check out Johnson's announcement below:",
    "Brosnan's Dr. Fate is joined on the Justice Society of America's roster by Hawkman (Aldis Hodge), Cyclone (Quintessa Swindell), and Atom Smasher (Noah Centineo). Sarah Shahi has also been cast as superhero Isis, but she isn't a Justice Society member.",
    "There's currently no official release date for Black Adam due to the Covid-19 pandemic. The film was supposed to land in theaters on December 22, 2021, with principal photography set to start in July 2020. However, production on the Shazam spin-off flick will only kick off in three weeks' time, so don't expect it to arrive in cinemas until sometime in 2022.",
    "Dr. Fate – real name Kent Nelson – is a founding member of the Justice Society of America. There have been various iterations of the character in the comics, but Nelson is the original Dr. Fate.",
    "In the source material, Nelson discovers the tomb of the wizard Nabu during an expedition to the Valley of Ur. After Kent accidentally releases Nabu from suspended animation, he inadvertently kills his father when Nabu's reawakening releases a toxic gas. Taking pity on the boy, Nabu teaches him the ways of the sorcerer over the next two decades. Once his training is complete, Nabu gifts Kent a magical helmet, amulet, and cloak. It's the helmet that is the true source of Dr. Fate's powers, but he has many superpowered abilities that will be key to taking on Black Adam in the movie adaptation.",
    "Dr. Fate's powers include spellcasting, flight, superhuman strength, healing, telekinesis and teleportation. The superhero has other abilities, but it's unclear just how many Brosnan's iteration will have. Black Adam is an extremely powerful being, so Dr. Fate and his fellow Justice Society members will need all of the powers they can muster. However, it's unlikely that Warner Bros will utilize all of Dr. Fate's abilities in the film, otherwise he'd potentially be able to take on Black Adam alone, thus negating the appearance of the other Justice Society members."
  ],
  "headers": {
    "5": "Black Adam: Who is Dr. Fate?"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/03/black-adam-dwayne-johnson-dc-movie-taps-pierce-brosnan-as-dr-fate-1234721219/"
  }
}