{
  "source": "https://www.techradar.com/news/the-new-apple-tv-4k-remote-has-a-small-unfixable-problem",
  "title": "The new Apple TV 4K remote has a small, unfixable problem",
  "category": "televisions",
  "updated": "2021-05-26T21:52:38Z",
  "author": "nick-pino",
  "summary": "Due to its construction, repairing it is a pain in the buttons",
  "article": [
    "While you’re unlikely to ever come across it yourself, it turns out the Apple TV 4K (2021) remote – the new Siri Remote – has a small problem: its battery pretty much can’t be replaced.",
    "The problem, according to teardown specialists iFixIt, is that the battery is locked deep within the remote and the only way to dig it out is to snap off the new buttons to gain access to the lower half of the remote where the battery is located.",
    "Once you’re in, you should be able to swap out the 1.52 Wh battery without much of a hassle as it's not glued in there... but then you’ll have to snap back on the buttons and re-screw the plastic exterior all without breaking it.",
    "In short, it will be significantly easier and just go buy a new one for $59 / £55 / ‎AU$84 than it would be to try and take on a battery replacement yourself.",
    "Admittedly, difficult repairs aren't uncommon for Apple devices – the company doesn’t really love the idea of you tinkering with its hardware and hasn’t made it easy in the past to upgrade or swap out components in its iMacs, MacBooks or iPhones.",
    "That really wouldn't be a problem except some users have been known to keep their old Apple TV devices for years which means, at some point, the remote is either going to need to be replaced or repaired.",
    "The good news is that batteries should, in theory, last you a few years even with pretty heavy use, so you probably won't be replacing it anytime soon. Who knows, maybe by the time you do, there'll be an even better version of the remote out there that uses solar power to charge like the new Samsung TV remotes."
  ],
  "headers": {
    "4": "Repairing Apple devices can be a pain in the… buttons"
  },
  "links": {
    "Apple TV 4K (2021)": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "iFixIt": "https://www.youtube.com/watch?v=i-AmXttNmqA&feature=emb_title",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021"
  }
}