{
  "source": "https://www.techradar.com/news/wordpresscom-adds-new-theme-tailored-towards-lovers-of-photography",
  "title": "WordPress.com adds new theme tailored towards lovers of photography",
  "category": "computing",
  "updated": "2021-06-17T13:31:06Z",
  "author": "abigail-opiah",
  "summary": "Mayland theme allows creativity to flourish on WordPress",
  "article": [
    "Automattic, the parent company of WordPress.com, has released its second block theme to the WordPress theme selection.",
    "The design of the free WordPress Mayland theme looks to highlight the writing and photography projects of those who wish to use it.",
    "The WordPress photography theme, which was last updated on June 15, 2021, has been designed to showcase creativity and is flexible for photography work, including landscape, commercial, and portrait photographers, as well as photojournalists and visual artists.",
    "Mayland’s tiled galleries open up into a slide-viewing experience that allows website visitors to visually get the full scope of the work published on the website. The theme also enables users to publish additional content to a blog to tell the stories behind photoshoots.",
    "In a written blog, Wordpress.com mentions that the theme will be beneficial to freelancers or seasoned professionals who want to turn picture-taking hobbies into a source of income.",
    "Mayland fully supports the new WordPress Editor, and allows its users to choose any of the available blocks to create a range of content for the website they are trying to create.",
    "The theme also gives users the option to display links to social media accounts in the header, right below the main site navigation.",
    "WordPress,com powers more than 30% of the entire Internet, and along with that there are thousands of contributors to the WordPress ecosystem.",
    "Automattic owns and operates WordPress.com, which is a hosted version of the open source WordPress software with added features.",
    "Via WordPress Tavern"
  ],
  "headers": {
    "3": "Mayland on Wordpress.com"
  },
  "links": {
    "WordPress.com": "https://www.techradar.com/how-to/install-and-set-up-wordpress",
    "WordPress theme": "https://www.techradar.com/news/best-wordpress-theme",
    "WordPress Tavern": "https://wptavern.com/automattic-launches-mayland-blocks-its-second-fse-theme-on-wordpress-org"
  }
}