{
  "source": "https://www.techradar.com/news/best-free-ipad-apps",
  "title": "Best free iPad apps 2021: the top titles we've tried",
  "category": "tablets",
  "updated": "2021-12-08T15:05:11Z",
  "author": "craig-grannell",
  "summary": "The best free apps for iPad Pro, iPad Air, iPad and iPad mini",
  "article": [
    "Free apps sometimes have a bad reputation, but many are gems that are so good you won’t believe they’re free. We’ve scoured the App Store to find the very best, and sorted them into handy categories, which you can find on the following pages.",
    "On this page you'll find the best app of the month - our top new or updated selection to try out, and check back every month to find a new option to test. After that, it's the best entertainment apps (surely the best reason to own an iPad...) and a variety of categories on the following pages to tickle your fancy.",
    "Serial Reader wants you to read the classics. You might argue you don’t have time to wade through The Odyssey or War and Peace, but Serial Reader begs to differ, and cunningly chops up such tomes – and hundreds more you can choose from – into bite-sized chunks you can blaze through on a daily basis.",
    "Each ‘issue’ takes about ten minutes to read and arrives at a user-defined time, along with an optional notification. It’s a clever system that really does get you reading. And the reading experience itself is solid too, with all the usual layout and typography options you’d expect.",
    "Generously, you get all this for free, but pay $2.99/£2.49/AU$4.49 for premium and you get extra features, including cloud sync, ‘read ahead’ to future issues, highlights and notes, series pausing and the option to add your own EPUBs.",
    "Our favorite free iPad apps for having fun with your iPad, whether shopping, coloring, reading, watching TV or using Twitter.",
    "Reading List - Book Tracker is ideal if you buy loads of books and then forget about rather than read them. You add books to your virtual library by scanning barcodes or adding them from a web search results list. They then lurk in the sidebar.",
    "A single tap on any entry and you can peruse its various details, along with heading off to Amazon or Google Books. Through adding user-defined categories, you can manage larger collections, or even have Reading List act as a wish list for titles you’ve not yet purchased. Basic progress tracking is in the mix too.",
    "For free, the app is resolutely single-device, with no iCloud sync. But given the other features, it feels like a generous freebie for people who want to keep track of the books they’re reading.",
    "Sandbox – Physics Simulator is an entertainingly noodly mix of creation and wanton destruction. It gives you a blank screen and a bunch of icons, inviting you to select materials and draw components to fill the void. You can build levitating stone structures that can be filled with soil and seeds, at which point flowers will start to grow.",
    "Alternatively, you can explore what will happen when lightning blasts firework powder, or when you drop a bomb on your beautiful creation. Hint: nothing good for the things you’ve made. But Sandbox itself is plenty good. Sure, it’s a long way from real life, and its old-school pixel art aesthetic screams retro. But as a way to experiment and relax – whether you chill by making things grow or blowing them up – this is an excellent iPad freebie.",
    "MusicHarbor deals with a gap in Apple Music and other streaming services: keeping track of your favorite artists, rather than just playing their tracks.",
    "You can import artists from your local library or a streaming service. Imports appear as disc-shaped buttons. Tap on one and the artist/band page will display releases in reverse-chronological order, with a button to zip to a Google News search based on relevant keywords.",
    "Elsewhere, the sidebar provides instant access to latest and upcoming releases, music videos, and concerts. Go pro ($5.99/£5.99/AU$9.99) and you can filter releases by kind, adjust the app’s appearance, and filter concerts by proximity. Even if you don’t, this one’s a must to keep tabs on artists and bands.",
    "Photo Flashback! recalls services like Timehop that serve up photos you took years ago on today’s date. Here, though, the focus is solely on the contents of photos on your iPad and in iCloud Photo Library.",
    "On launching the app, you’ll see the day’s selection and can opt to add the current year via a quick trip to the app’s settings. To check out other dates, tap the calendar. In the window that appears, each date lists the number of photos available, along with a small preview of one of them.",
    "Photo Flashback! is another of those free apps that’s generous to the point you wonder what the catch is. But there isn’t one - this is just a wonderful and entirely free way to relive favorite memories.",
    "The Wallpaper App gives you endless wallpapers for your iPad. The designs are procedurally generated, based around 15 different styles that are accessed by horizontal swipes. Within each style, variations are previewed by you tapping on the left or right half of the screen. Swipe upwards and you find more controls, to subtly adjust the brightness and color within the current design.",
    "Unlike most free wallpaper apps, output is optimized specifically for your iPad - although you can long-press the Save button to export wallpaper for other screen sizes.",
    "The entire production feels elegant, perfectly matching the host hardware. And although it perhaps won’t suit every iPad owner - especially if you’re keen on using photography for screen backgrounds - it’s an ideal download if you fancy shaking up your Home screens with something arty and refined.",
    "Sofa is a free iPad app that’s all about organizing your downtime by making lists. Tap the + button and you can choose a category, search for something, and then add it to your collection. Using the sidebar, you can categorize items you add however you wish.",
    "Because Sofa uses existing online data for items you add, it will automatically import cover art and synopses. For movies, music, and podcasts in particular, it works very well as a means to remind yourself about things you plan to check out - and of what you’ve already watched and listened to.",
    "The app’s less impressive for books and games, but given the lack of a price tag (IAPs are for additional themes), and iCloud support to sync data between devices, Sofa’s a solid option when you want a fast, simple means to plan what media you’d like to experience in the future.",
    "NetNewsWire is an RSS reader - a news aggregator that lets you subscribe to website feeds, and have headlines and articles beamed directly to the app. In fact, for many people, it’s the news aggregator, having been a big name in various forms since 2002.",
    "This latest incarnation is open source and therefore free from a price tag. It’s also free from ads, IAP, and cruft. It’s less flashy than paid fare like Unread and Reeder, but has an elegant simplicity that sits well when you want a speedy no-nonsense experience that’s nonetheless friendly and usable.",
    "Although gunning for efficiency, this app gives you all the most vital features: direct feed subscriptions, Feedly/Feedbin sync, dark mode, reader view, and feed import/export. In fact, it’s so good it might tempt you away from its premium-priced contemporaries.",
    "Google News might seem redundant in the age of Apple News, but it serves a purpose. Like Apple’s equivalent, this free news app for iPhone learns as you use it, aiming to serve up stories you’ll be interested in. And in a similar fashion to Apple News, you can flag specific publications and topics you like to read.",
    "Where Google News diverges from Apple is with the ‘full coverage’ button. Tap this and you can view a story across a range of publications, and check out a reports timeline – useful in an era of increasingly partisan coverage.",
    "Beyond that, there are many other reasons to make the app one of your go-tos for news: fast access to any source’s list of stories; the means to hide any publication; a regularly updated briefing; an optional daily news email; and a stripped-back, cruft-free reading experience.",
    "GIFwrapped is designed for GIF obsessives. If you can’t get through an entire social media message without welding a looping animation to it, this is the app for you.",
    "Universal search provides fast access to more GIFs than you could conceivably hope to use in several lifetimes, even if you tried very hard. It’s also possible to import your own Burst and Live Photos. Whatever you find can be saved to your local library; GIFs can then be shared from the app itself, or in Messages by using the GIFwrapped iMessage app.",
    "For other use-cases, stashing GIFwrapped in Slide Over seems to work particularly well. And if you get very deeply into the app, affordable subscription IAP removes ads, powers up search, and lets you remove the watermark from shared GIFs.",
    "Lake: Coloring Books seems ideally suited to iPad owners who like dabbling in coloring – especially if they also own an Apple Pencil. The One A Day feature provides a daily freebie for 60 days, and each of the varied coloring books also offers you a free image to try your hand at.",
    "The coloring experience is solid. Friendly tool panels sit at the side of the screen. You can quickly swap palettes or switch from a brush to a spray can. If you don’t want to go over the lines, a single button press gives you a hand there, too.",
    "Beyond scribbling inside of someone else’s lines, you can make your own with a blank canvas option, and your masterpieces can be saved to a gallery, so you can later show them off online.",
    "Twitterrific is a client for Twitter that wants you to use the social network on your own terms. This means you get a slew of customization options – and a much richer user experience – compared to when using the official Twitter app.",
    "On iPad, this is very apparent on exploring the tabs at the top of the screen. You get five. Home returns you to your main feed, but the other four can be set to open anything from mentions to lists – it’s up to you. As is how the app looks, given its range of built-in themes.",
    "Twitterrific excels elsewhere, too. Next to the search field is a Center Stage button, which you press to browse through media tweets. Muting and sync are fully supported. All of this is free, in return for a single unobtrusive always-on ad banner.",
    "Infuse 6 enables you to watch your video collection – without first loading any of it on to your iPad. Instead, the app streams footage from files stored on local PCs, Macs, or network drives. Should you want to store some content on your iPad, though, Files integration makes that a cinch.",
    "In fact, the interface throughout is superb – usable and sleek. It serves up not only your videos, but also cover art and background information – assuming you’ve named your files reasonably sensibly. Subtitles can be downloaded with a tap.",
    "The free version doesn’t offer all the bells and whistles. Library/progress sync, streaming from cloud sources, AirPlay, and HD audio require a pro account, or the purchase of the standalone Infuse Pro 6. But even without these, you won’t find a better or more feature-packed free video player on your iPad.",
    "Feedly bills itself as a smart news reader. However, rather than attempting to second-guess what you’d like to read, based on you having tapped a few vague category buttons, Feedly takes a more old-fashioned approach: subscriptions.",
    "In short, using the magic of RSS, you (for free) subscribe to the newsfeeds of your favorite websites – anything from news corporations down to the most niche of blogs. New articles are then sent to Feedly, and can be read in-app.",
    "If you fancy discovering content beyond what you usually read, there’s an Explore tab; but Feedly’s best when you’re curating what you end up checking out, through focusing primarily on sources you trust.",
    "As an added bonus, if you like the idea but not the interface, a Feedly account can be used to power other RSS readers such as TechRadar favorite Reeder.",
    "Pocket is a read-later app. What this means is that rather than ending the day staring at dozens of unread browser tabs, you fling items of interest in Pocket’s direction. It then converts them into a streamlined personalized magazine you can peruse at your leisure.",
    "The default iPad interface is an appealing grid, and individual articles are stripped back to words and images. This can be a major improvement over the original websites, letting you delve into content without distractions.",
    "A night mode flips colors late in the day, to ensure you don’t get eye strain, but Pocket also allows you to ‘read with your ears’. This turns your reading list into an on-the-fly podcast. It’s an odd experience, but it can be nice to work through your reading list while cooking, walking or driving.",
    "Infuse 5 is a video player that lets you get at video from pretty much anywhere. This means if you have a massive video collection, you needn’t load it all on to your iPad. Instead, you can quickly copy across items as and when you want to play them – or just stream from local network storage.",
    "This app isn’t unique in the field, but it’s friendly and sleek. Set-up is a breeze, and even when streaming from your local network, metadata (cover art; item information) is automatically downloaded. It’s also possible to download subtitles on the fly.",
    "The free version has restrictions that require an annual subscription to unlock: some video/audio formats; AirPlay and Google Cast support; background playback; library sync. But as a freebie for anyone who wants to stream videos to their iPad, Infuse 5 really can’t be beaten.",
    "Fiery Feeds is a full-featured RSS reader. If you’re unfamiliar with RSS, it enables you to subscribe to almost any website’s content. You’ll then in Fiery Feeds get a list of headlines whenever you open the app, ensuring you don’t miss articles from sources you trust.",
    "Most free RSS readers are clunky, but Fiery Feeds bucks the trend with a sleek two-pane interface, and a slew of customization options. It feels modern, but gives you very direct control over what you read, unlike the likes of News or Flipboard.",
    "There’s a paid tier, too – US$9.99/£9.99/AU$14.99 per year – which unlocks additional features, including a ‘must read’ folder, a text view mode (which loads full articles for sites that otherwise only send you synopses), and custom actions. Whichever flavor you plump for, Fiery Feeds is well worth installing on your iPad.",
    "VLC for Mobile is an iPad take on the popular open source media player.",
    "On iPad, it has two main uses. The first is offline playback. You can load up VLC with videos, and – broadly speaking – be secure in the knowledge it’s actually going to be capable of playing them. During said playback, you can fiddle with the picture and audio, and use gestures to skip through boring sections – or backwards if you missed a bit.",
    "VLC is also good for streaming. You can stream movies from a PC or Mac right to your iPad, rather than having to sit in front of a computer like it’s 2005. The interface throughout is sleek and minimal (irritating zooming to the options sidebar aside), and impressive for a video streaming app that’s entirely free.",
    "JustWatch solves one of the biggest problems with the way we consume television and movies. With streaming services and on-demand increasingly rendering traditional schedules redundant, the key is usually finding out where and how to watch something, not when.",
    "JustWatch asks you to confirm your location and the services that interest you. If you’re still into the big screen, there’s a tab for currently showing movies, which makes it a cinch to access local showtimes.",
    "But this app’s mostly about TV, providing filterable feeds that list popular shows and bargains – and where to find them. Select a show, tap on an icon, and you’re whisked away to the relevant app. Whatever you want to see, JustWatch makes reaching it a whole lot easier.",
    "Letterboxd is an iPad take on a social network for film lovers. Sign up, and you can do all the usual following friends and bellyaching, only here you’re complaining about whether Blade Runner 2049 is 2049 times worse than the original, and who’s the best James Bond. If that sounds awful but you’re a film lover, Letterboxd has another use: the ability to log everything you’ve ever watched.",
    "You can quickly assign ratings and ‘likes’ to your personal favorites, which are subsequently displayed as a grid of artwork that can be sorted and filtered. Beyond that, you can add tags, a review, and the date when you last watched the film. On the iPad’s large display, the entire app looks great – not least when you start checking out trailers of those films you’re keen to see.",
    "If you’ve any interest in wildlife films, Attenborough Story of Life is a must-have. It features over a thousand clips picked from Attenborough’s decades-long journey through what he refers to as the “greatest story of all…how animals and plants came to fill our Earth”.",
    "The app is split into three sections. You’re initially urged to delve into some featured collections, but can also explore by habitat or species, unearthing everything from big-toothed sharks to tiny penguins skittering about. Clips can be saved as favorites, or grouped into custom collections to later peruse or share with friends.",
    "Some of the footage is noticeably low-res on an iPad – there’s nothing here to concern your Blu-Rays, and that’s a pity. Still, for instant access to such a wealth of amazing programming, this one’s not to be missed.",
    "The majority of comic-book readers on the App Store are tied to online stores, and any emphasis on quality in the actual apps isn't always placed on the reading part.",
    "But with many more publishers embracing DRM-free downloads, having a really great reading app is essential if you're into digital comics. Chunky Comic Reader is the best available on iOS.",
    "The interface is smart, simple and boasts plenty of settings, including the means to eradicate animation entirely when flipping pages.",
    "Rendering is top-notch, even for relatively low-res fare. And you get the option of one- or two-up page views. For free, you can access web storage to upload comics. A single $3.99/£3.99/AU$5.99 pro upgrade adds support for shared Mac/PC/NAS drives.",
    "Can't figure out which iPad to buy? Watch our guide video below!"
  ],
  "headers": {
    "2": "Free app of the month: Serial Reader",
    "5": "The best free entertainment apps for iPad",
    "6": "Reading List - Book Tracker",
    "9": "Sandbox – Physics Simulator",
    "11": "MusicHarbor",
    "14": "Photo Flashback!",
    "17": "The Wallpaper App",
    "20": "Sofa: Downtime Organizer",
    "23": "NetNewsWire",
    "26": "Google News",
    "29": "GIFwrapped",
    "32": "Lake: Coloring Books",
    "35": "Twitterrific",
    "38": "Infuse 6",
    "41": "Feedly",
    "45": "Pocket",
    "48": "Infuse 5",
    "51": "Fiery Feeds",
    "54": "VLC for Mobile",
    "57": "JustWatch",
    "60": "Letterboxd",
    "62": "Attenborough Story of life",
    "65": "Chunky Comic Reader"
  },
  "links": {
    "Serial Reader": "https://apps.apple.com/app/serial-reader-classic-books/id1077180804",
    "Reading List - Book Tracker": "https://apps.apple.com/app/reading-list-book-tracker/id1217139955",
    "Sandbox – Physics Simulator": "https://apps.apple.com/app/sandbox-physics-simulator/id1563185441",
    "MusicHarbor": "https://apps.apple.com/us/app/musicharbor/id1440405750",
    "Photo Flashback!": "https://apps.apple.com/gb/app/photo-flashback/id916556241#?platform=ipad",
    "The Wallpaper App": "https://apps.apple.com/us/app/id1518228413",
    "Sofa": "https://apps.apple.com/app/sofa-downtime-organizer/id1276554886",
    "NetNewsWire": "https://apps.apple.com/app/netnewswire-rss-reader/id1480640210",
    "Google News": "https://apps.apple.com/app/google-news/id459182288",
    "GIFwrapped": "https://apps.apple.com/app/gifwrapped/id782319880",
    "Lake: Coloring Books": "https://apps.apple.com/app/lake-coloring-books/id1183717726",
    "Twitterrific": "https://apps.apple.com/us/app/twitterrific-tweet-your-way/id580311103",
    "Infuse 6": "https://itunes.apple.com/app/infuse-5/id1136220934",
    "Infuse Pro 6": "https://itunes.apple.com/app/infuse-pro-6/id1444671526?mt=8",
    "Feedly": "https://itunes.apple.com/app/feedly-smart-news-reader/id396069556?mt=8",
    "Reeder": "https://itunes.apple.com/app/reeder-3/id697846300?mt=8",
    "Pocket": "https://itunes.apple.com/app/pocket-save-read-grow/id309601447?mt=8",
    "Infuse 5": "https://itunes.apple.com/app/infuse-5/id1136220934?mt=8",
    "Fiery Feeds": "https://itunes.apple.com/app/fiery-feeds-rss-reader/id1158763303?mt=8",
    "VLC for Mobile": "https://itunes.apple.com/app/vlc-for-mobile/id650377962?mt=8",
    "JustWatch": "https://itunes.apple.com/app/justwatch-movies-tv-shows/id979227482?mt=8",
    "Letterboxd": "https://itunes.apple.com/app/letterboxd-your-life-in-film/id1054271011?mt=8",
    "Attenborough Story of Life": "https://itunes.apple.com/app/attenborough-story-of-life/id1124476992?mt=8",
    "Chunky Comic Reader": "https://itunes.apple.com/gb/app/chunky-comic-reader/id663567628?mt=8"
  }
}