{
  "source": "https://www.techradar.com/news/small-business-in-the-post-covid-economy",
  "title": "COVID has changed the way SMB works: Here are the new tools that get things done",
  "category": "computing",
  "updated": "2021-08-05T08:30:42Z",
  "author": "jonas-p-demuro",
  "summary": "A different world is emerging, with digital tools enabling new opportunities",
  "article": [
    "It has always been a challenge to run a successful business, and with less resources, experience and cash than bigger organizations, keeping yours afloat gets even more daunting. And while this was true before the COVID-19 pandemic, this “Once in a lifetime” scourge on humanity has made this at least a few magnitudes more difficult with over 34.6 million cases and 610,000 deaths in the US according to the Johns Hopkins Resource Center as of the end of July. Also realize that while larger businesses often garner the attention, 99% of businesses in the US are considered small.",
    "Businesses, and particularly small businesses have been hard hit by the COVID-19 pandemic. A survey released in July 2021 done by NEXT Insurance gives us an idea of the toll this virus has taken on business. It really has represented the largest threat to business over the last century. This has included that 44% of small businesses have experienced a “Major impact” from COVID-19, consisting of loss of revenue. The toll has been even greater on some subgroups, as among Millennial, and Baby Boomer business owners, the revenue loss is greater than 50%. In this survey, over half of respondents- more precisely 56%- indicate that they took advantage of the Paycheck Protection Program (PPP) for revenue supplementation and to meet business expenses. According to the US Chamber of Commerce, a staggering 1 in 5 businesses had to close at some point during this pandemic, either fully, or partially, and approximately 80% of them had to make adaptations.",
    "Given such a severe situation, it should not come as a surprise that businesses were hit very hard from this pandemic. In fact, according to the Wall Street Journal, an additional 200,000 businesses permanently closed due to COVID-19 as the US hit the one year mark. However, what is more surprising is that US businesses have shown some resilience, and even optimism for the future. When asked, according to the NEXT Insurance survey, among small business owners, “84%... said they are somewhat, very or extremely optimistic about a recovery,” and they are even more optimistic about their own business with 94% expecting them to recover.",
    "While COVID-19 has created an unprecedented roadblock for small businesses, but they have risen to the occasion in many cases. Still, small businesses have their challenges, with in one study, 73% of them not being aware of digital resources.",
    "With increasing frequency, small businesses have been forced to turn to digital technology, and in fact embraced it to assist in the recovery. In a way, this should not be surprising as all of us have had to reexamine so many things we do for daily life, and adapt them for this pandemic, for example moving our shopping from in store to online, having online video parties, and remote education, to name but a few. With such rapid transition of these routine activities, it has created opportunities for small businesses as well to support these endeavors. Additionally, small businesses need to reexamine even simple processes from a pandemic standpoint, such as offering home delivery where there was no business case before, or even ditching reusable menus at restaurants in favor of QR code online menus.",
    "Many businesses were forced to completely shut down, literally closing their doors to customers. While some accepted this as a “COVID reality” moment when ‘Stay-At-Home’ orders were implemented, other businesses used this as an opportunity to trial remote working.",
    "While major corporations have offered remote work positions for years, this has not been embraced by small businesses historically. However, this trend is not going away, and it is expected that by 2025 that fully 70% of workers will work from home for five or more days each month. Furthermore, a survey done by Intermedia last year indicates that over half of small business owners plan to continue this work model even after the pandemic.",
    "While the remote work model may not be practical for all businesses, such as your local plumber, or restaurant, it is more than reasonable for a wide spectrum of activities, from financial advice, to tutoring, and insurance sales. It also does not need to be an all or none phenomenon with remote work being done as little as a few days a month, to a full time model.",
    "Supporting the remote workers is a key to productivity, and there are a variety of digital platforms to do this. It starts with verbal communication, so reliable phone access is a must. Smartphones can certainly be a simple solution, whether company provided, or on a ‘Bring your own device’ plan (BYOD) for work. This has advantages such as easy availability, minimal investment, and the employee can be working from anywhere, whether at their home, the local coffee shop, or in a car.",
    "Small businesses looking to take this a notch up should look at VoIP plans. These digital voice communication platforms facilitate more complex communication within a business structure.",
    "Examples of this include Ring Central Office, Ooma Office, and Aircall, among others. This can allow an employee to then forward their business phone calls to any phone line, whether a landline in the office, a business provided smartphone, or even their home phone number. This also opens up possibilities for a virtual receptionist on the small scale, to a unified virtual call center as your business grows.",
    "These VoIP services can also integrate neatly with other platforms, such as Customer Relationship Management software (CRM) that can offer additional automation and support, such as recording of phone calls, and robo dialing.",
    "Audio conference calls can be a good way to hold a meeting among remote workers. This can include meetings among team members, or also with clients as well. Check out services such as Free Conference Call for occasional use, or more dedicated solutions for more intensive use. Also keep in mind that just about every video conferencing solution can also be used for an audio conference as well, simply by users turning off their video cameras, or with dial in options.",
    "With COVID-19, travel has also been restricted, with challenges such as travel advisories against foreign travel to certain hotspots. Domestic flights have also had issues (many of which started prior to the pandemic), including high prices, baggage restrictions, limited availability, and less direct flights. Given the ongoing concerns, and also just perhaps the need for some human contact, it follows that businesses of all sizes have embraced video conferencing.",
    "While hardly new, video conferencing, given the availability of broadband internet connections- both via wired, and also mobile- has experienced significant growth fueled by the pandemic. According to Digital In the Round, their research indicates that among employees 76% of them use it for remote work, productivity via video meetings is improved by 50%, and 47% of video conference users indicate that they have been able to gain a benefit in the reduction of their travel costs. It is no wonder that for 2020, video conferencing internet traffic saw a staggering rise of 535%, resulting in a global video conference market that is valued at just over $6 billion in 2021.",
    "While just about any business smartphone can support video conferencing, a handful of platforms have emerged as the leaders when it comes to small business. Thankfully, what would have been a frustrating exercise a decade ago can now be done with ease with the available solutions that all have cross platform support via a web browser, and smartphone apps. Differentiating points to look for other than costs are the number of simultaneous users on the platform, the ease of which a screen can be shared among conference participants, the ability to record the conference, and whether there is support for custom backgrounds.",
    "Having video meetings for business has become such a thing these days, that the term “Zoom meeting” has become a vernacular statement. For small businesses looking to get started there are plenty of free options to try this out, such as Facetime for iPhone and other Apple devices, and support for video in Google Hangouts and Skype. Beyond the basics, there is no shortage of video conferencing platforms available via a subscription. Market leaders have emerged that include Zoom, GoToMeeting, and Google Meet.",
    "Small businesses also need platforms to gain efficiency, such as when making a proposal. For small companies that need to do such a task, such as a contractor or other service provider, this can be a bit of a time sink, with scraps of notes taken down on a clipboard as time is spent with the client, and then reviewing old proposals to formulate a competitive price. Also realize that all of this is done to try to get a job that you may never hear from the client again! Additional barriers are that regular mail has been slower in the pandemic making it truly snail mail, along with many clients would prefer to receive proposals electronically, eliminating issues of transmission of COVID (although paper is quite porous making this is an unlikely way to transmit the virus, although clients may not be aware of this).",
    "Given these issues, small businesses have looked to upgrade from clipboards and paper to proposal software. This allows a business to grab a template, which can automate the writing process, combine elements for a professional look, and use email to send out the proposal right away. All this combines to enable a small business to get the edge when making a proposal, and to get back to working. Market leaders that have emerged in this segment include Better Proposals, Pandadoc, Nusii, and Proposable. Features to seek out include the number of available templates, mobile support, flexible pricing plans, and integration with other software, such as Customer Relationship Management software.",
    "Not every solution for small business needs to be so fancy, or complex- enter mobile scanning. With workers remotely and more mobile during this pandemic, there is a definite need to be able to efficiently scan documents. While dedicated desk scanners with paper feed mechanisms are a good solution for office based workers, this would be an expensive outlay to give each remote worker. Also, factoring in the scanning of documents may be only an occasional task. Again realize that sending documents through email is 100% COVID-19 free. Once you enjoy the convenience of having the power to snap a pic of a document with a phone, and turn it into a PDF in seconds, there is no reason to go back to photocopying pages.",
    "Enabling your small business staff with mobile scanning is as simple as choosing which app to download onto the smartphone. Start with a look at Evernote Scannable, ABBYY FineScanner, Adobe Scan, and Microsoft Office Lens. Features to look for cover integration with online storage solutions, integration with email, tiered pricing plans to suit your needs, support for multi page documents, and optical character recognition (OCR) that can transform the scan into an editable Microsoft Word document.",
    "Restaurants are especially hard hit by COVID-19, with many forced to shut down their dining areas to comply with government mandates. Even when reopened, guests have been reluctant to return, and volume has been down. Enterprising restaurants have offered takeout to patrons, and for even more convenience, delivery.",
    "While a restaurant can offer the delivery inhouse, with the difficulties of finding help to employ, third party delivery has been an attractive route. After all, this way the delivery service is always available, ready to go when needed, and there is no need to pay someone while waiting for an order. Furthermore, the transportation is provided as well so the small business obviates the requirement to acquire a vehicle, with the included maintenance costs, and not to mention the fickle fuel prices. Finally, the third party delivery service can also work with the restaurant to put the menu online, and provide a method for consumers to order as well as pay, especially with a mobile app.",
    "With COVID-19, “Delivery has become a lifeline for restaurants and grocery stores, with 81% reporting that they would have had to lay off staff members if not for third-party delivery, and 75% reporting that they would have had to close their business,” according to UberEats. Furthermore, 82% of the restaurant owners report that UberEats has been a crucial partner during COVID-19, with over 90% indicating that the plan is to continue working with them even post pandemic.",
    "There are plenty of providers for third party delivery services to restaurants. In addition to UberEats mentioned above, also making the list are DoorDash, GrubHub and PostMates. Differentiating factors to assess when looking to partner in this space include the fees charged, which can be a hefty premium on top of the menu prices, the speed of the delivery, and the quality of the delivery. Also keep in mind that there are some potential downsides, so choose carefully, as the delivery service becomes the front face for the restaurant, and customers often get upset with late deliveries, cold food, or missing items, for example. An investment also needs to be made with themed bags and containers to bring forward branding with customers.",
    "With a risk of infection, consumers have shied away from using cash whether paper currency, and also coins. While the actual risk of COVID-19 infection is likely low from using cash, the experts continue to go back and forth on this more potential than actual route, raising concern from consumers. Perhaps it is hastening a trend already in progress away from cash, but in 2021, consumers are not using cash, and turning towards contactless payments. In fact, as related by CNBC, while the US Mint is encouraging consumers to use coins for payment, a rising 3 in 10 consumers go through an entire week, and never use cash to pay for anything.",
    "Small businesses are smart to embrace this trend. Rather than using the traditional credit card systems, with the older magnetic stripe technology, or the newer (and much more secure) chip readers, consumers are expecting to have contactless payment options. These are the so-called “Tap and go” transactions that happen via radio waves and antennas with digital tokens for security. This allows a fully contactless payment system, where the credit card has no chance of picking up COVID-19 viral particles by being placed into a credit card reading machine.",
    "Unfortunately, the US is behind the rest of the world, where contactless payments have become dominant, accounting for 79% of payments, according to CreditCards.com. Customers are also using digital wallets, with options such as Google Pay and Apple Pay. Beyond that, small businesses would be smart to get ahead of this trend, and consider accepting even more progressive payment options, such as PayPal, and Venmo to attract millennial customers.",
    "Small businesses should upgrade to these contactless payment platforms that do require hardware upgrades to enable the credit card to be read in this fashion. Services to look into include Square, Clover and Leaders Merchant Services. Differentiating factors cover pricing, the available hardware, available support, and which payment options are supported.",
    "Remote working has its challenges, and an important one is keeping the team synchronized, and working together from multiple locations. Keeping the team on the same page can start with a shared calendar, also known as a synced calendar. While this once may have represented a daunting task, with an executive assistant in charge of the coordination of multiple calendars, this has been simplified through the use of the cloud.",
    "Solutions in this space run the gamut, from established providers, such as Microsoft Outlook, iCloud and Google Calendar, that are practically household names in this segment. However, small businesses should choose this platform carefully, as it impacts other platforms chosen, and there are also dedicated providers in this area, so be sure to check out Calendly, Taskworld, and Teamup. When making a choice, be sure to consider integration with other apps, such as GoToMeeting, and mobile app support so that workers can access the calendar from anywhere they happen to be.",
    "Ask anyone that has run a small business, and any of them will tell you that you need to do more with less. This includes the important task of marketing, which is a crucial task for any organization, but for a small business the challenge is that the message needs to be communicated, while “Doing more with less,” so that the budget remains under control.",
    "With COVID-19, this became even more of a challenge, with small businesses having the burden of keeping engagement with its customers, while intermittently shut down, or working remotely. Also, there is a need to communicate a rapidly changing landscape of changing hours, reduced services, delivery menus, and even new or modified offerings, depending on the business. Some establishments that do this well can benefit from the opportunity to strengthen relationships with loyal customers.",
    "Depending on the small business, there are various methods to accomplish marketing. Direct outreach via phone can work with existing customers, and can be appropriate to a limited extent in some circumstances. Use of social media, such as Facebook, Instagram, Twitter and Yelp has also increased, which is well suited for a rapid roll out of short term info, such as a daily special at a restaurant.",
    "Beyond that, small businesses should look into digital marketing platforms that can take this process to the next level. This includes activities such as search engine optimization (SEO), influencer marketing, affiliate marketing, and mobile marketing, to name some of the more specific activities, among others. Examples of small business marketing firms to be evaluated include Sprout Social, SalesForce, Marketo, and TrueNorth. Be sure to assess your needs- and your budget carefully, as these services can run the spectrum from only focused marketing activities, to a much more widespread customer relationship management approach that covers more than just the marketing."
  ],
  "headers": {
    "5": "Remote work",
    "9": "Telephone plans",
    "12": "Audio conferencing",
    "13": "Video Conferencing",
    "17": "Proposal software",
    "19": "Mobile scanning",
    "21": "Third party delivery",
    "25": "Contactless payments",
    "29": "Synced calendars",
    "31": "Digital marketing"
  },
  "links": {
    "NEXT Insurance": "https://www.prnewswire.com/news-releases/new-research-shows-the-state-of-small-business-in-america-post-covid-19-digital-first-female-owned-and-optimistic-about-the-economy-301332675.html",
    "US Chamber of Commerce": "https://www.uschamber.com/report/small-business-coronavirus-impact-poll-june",
    "Wall Street Journal": "https://www.wsj.com/articles/covid-19s-toll-on-u-s-business-200-000-extra-closures-in-pandemics-first-year-11618580619",
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "BYOD": "https://www.techradar.com/news/computing/what-is-byod-and-why-is-it-important-1175088",
    "VoIP plans": "https://www.techradar.com/best/best-phone-service-for-business",
    "Ring Central Office": "https://www.techradar.com/reviews/ringcentral-office",
    "Ooma Office": "https://www.techradar.com/reviews/ooma-office-review",
    "Aircall": "https://www.techradar.com/reviews/aircall-voip-review",
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "Free Conference Call": "https://www.freeconferencecall.com/fcc/?marketing_tag=FCC20_PPC_GB_US_EN_0053&gclid=CjwKCAjwxo6IBhBKEiwAXSYBsyVuQziSGq3UXMXac378ooOYXn1nACUDLk1wRkae7waWhCo8JCDCmBoCYsoQAvD_BwE",
    "video conferencing solution": "https://www.techradar.com/best/best-video-conferencing-software",
    "Digital In the Round": "https://digitalintheround.com/video-conferencing-statistics/",
    "business smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "web browser": "https://www.techradar.com/best/browser",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "GoToMeeting": "https://www.techradar.com/reviews/gotomeeting",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "unlikely way to transmit the virus": "https://health.clevelandclinic.org/how-long-will-coronavirus-survive-on-surfaces/",
    "PDF": "https://www.techradar.com/best/free-pdf-editor",
    "Microsoft Word": "https://www.techradar.com/how-to/how-to-download-and-use-microsoft-word-for-free",
    "UberEats": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1358205045184739600&xs=1&url=https%3A%2F%2Fwww.uber.com%2Fnewsroom%2Ffood-for-thought-listening-and-learning-from-restaurants%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsmall-business-in-the-post-covid-economy",
    "from using cash": "https://pmj.bmj.com/content/96/1137/427",
    "CreditCards.com": "https://www.creditcards.com/credit-card-news/contactless-tap-and-go-cards-us-market/",
    "Square": "https://www.techradar.com/reviews/square-reader",
    "Clover": "https://www.techradar.com/reviews/clover-pos-point-of-sale-review",
    "Microsoft Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "iCloud": "https://www.techradar.com/reviews/apple-icloud",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "SEO": "https://www.techradar.com/news/best-seo-tool"
  }
}