{
  "source": "https://www.techradar.com/news/slack-the-pandemic-has-accelerated-the-demise-of-email",
  "title": "Slack: The pandemic has accelerated the demise of email",
  "category": "computing",
  "updated": "2021-04-07T11:15:48Z",
  "author": "joel-khalili",
  "summary": "Many workers would rather go without email than collaboration tools, report finds",
  "article": [
    "The pandemic and rise of remote working have contributed to a swing in public opinion that could see collaboration tools displace email as the communication method of choice, new research suggests.",
    "According to a report from Slack, based on a survey of 3,000 remote employees, a large proportion of workers (40%) would now rather go without email than their favorite collaboration tools. Half of UK IT decision-makers, meanwhile, believe an alternative form of digital communication will replace email within the next three years.",
    "Perhaps unsurprisingly, Slack’s research found that the shift in opinion is founded on various inadequacies inherent to email, which recently celebrated its 50th anniversary.",
    "The greatest problem users face has to do with the time it takes to manage their email inbox. Estimates based on the survey data suggest collaboration tools could save users 81 minutes per day on average, or 6.8 hours per working week.",
    "The rise of collaboration services was underway long before the pandemic, but the disruption to ways of working has only accelerated the trend, making tools such as Zoom, Microsoft Teams and Slack into household names.",
    "Although vaccine rollouts may soon pave the way for a return to the office, collaboration tools appear to have lodged themselves firmly at the heart of business communication. Of the respondents that had never used a collaboration platform before the pandemic, 78% said they will continue to do so once “normal” work resumes.",
    "One of the main advantages of collaboration tools is the ability to build closer relationships with fellow employees, and even between people that may never meet in person. The report also claims these services help virtually all users cultivate a healthier relationship with superiors.",
    "A major factor at play is the reputation of email as a serious and clinical form of communication. Of the Slack users surveyed, the majority (54%) said they reserve informal chat for collaboration platforms, while 80% said they would choose to send a joke or GIF over Slack rather than email.",
    "“Although it remains the default option among some more traditional firms, the pandemic has brought the truth about email to light: it is an archaic and ineffective means of workplace communication,” Stuart Templeton, Head of UK at Slack, told TechRadar Pro.",
    "“Email in the workplace is a tool suited to closed-door decision making, siloing key information away from those who need it most. The days of being copied into long email chains may well be numbered, and that is something we can all be grateful for.”",
    "However, while the benefits of collaboration services are clear, many signs still point to the continued longevity of email, not least the billions of users worldwide and complete openness of email standards.",
    "The case against email is predicated on the idea that collaboration services do everything that email does, while also addressing its shortcomings. But some would suggest it’s like comparing apples and oranges.",
    "For a quick request or informal chat, collaboration tools are the superior option, but email continues to thrive as the last bastion of purely functional, transactional and asynchronous communication."
  ],
  "headers": {
    "4": "Collaboration revolution"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "email": "https://www.techradar.com/news/best-email-provider",
    "Slack": "https://www.techradar.com/reviews/slack",
    "50th anniversary": "https://www.techradar.com/news/email-is-50-years-old-but-theres-life-in-the-old-dog-yet",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives"
  }
}