{
  "source": "https://www.techradar.com/news/netflixs-the-division-movie-is-still-happening-and-it-has-some-big-names",
  "title": "Netflix's The Division movie is still happening – and it has some big names",
  "category": "entertainment",
  "updated": "2021-02-26T11:52:16Z",
  "author": "gerald-lynch",
  "summary": "A new director and a star-studded cast",
  "article": [
    "The recent wave of game-to-movie projects shows no signs of stopping, with Netflix revealing its long-in-development adaptation of Ubisoft’s looter-shooter, The Division, is still on the way – and with some brand new talent attached.",
    "Set to star Brokeback Mountain’s Jake Gyllenhaal and Interstellar’s Jessica Chastain, the latest report from Deadline surrounding production sees original director David Leitch (of Deadpool 2 fame) step now instead into a producer role following scheduling conflicts with his current project, Bullet Train.",
    "He’s to be replaced by Rawson Marshall Thurber, director of Netflix's upcoming The Rock film Red Notice, Skyscraper and Dodgeball, who will also be co-writing the script with Ellen Shanman.",
    "The film, first announced back at E3 2019, is set to follow the original 2016 game’s plot fairly closely, covering the deployment of ‘Division’ agents as they fight to take back New York City following a bioterrorism attack involving contaminated cash during Black Friday.",
    "It isn’t the first time Jake Gyllenhaal has been part of a video game adaptation – nor the first time he’s been associated with an Ubisoft project. He starred in 2010’s Prince of Persia: The Sands of Time – another all-star affair, but one that failed to set the world alight.",
    "Ubisoft is also developing a Beyond Good and Evil movie with Netflix, with Detective Pikachu director Rob Letterman set to direct.",
    "There are many games currently being developed into movies or TV shows, from The Last of Us to Halo, Uncharted to Super Mario – not to mention the recent releases of Monster Hunter, Sonic The Hedgehog and Tomb Raider. Few, if any, have managed to garner critical acclaim, though the Resident Evil franchise at least made a fair whack of cash for its studio. Here’s hoping that, by sheer force of numbers, one of the in-development adaptations manages to break the so-called ‘video game movie curse’, and turns out to actually be as good as the game it is based upon."
  ],
  "headers": {
    "3": "The game-to-movie glut"
  },
  "links": {
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "The Division": "https://www.techradar.com/news/ubisofts-the-division-is-free-for-pc-gamers-and-xbox-live-gold-subscribers",
    "Deadline": "https://deadline.com/2021/02/rawson-marshall-thurber-netflix-the-division-jake-gyllenhaal-and-jessica-chastain-1234701353/",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "The Last of Us": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show",
    "Halo": "https://www.techradar.com/news/the-halo-tv-show-finally-has-a-tentative-release-date-and-a-new-streaming-home",
    "Uncharted": "https://www.techradar.com/news/new-uncharted-movie-images-tease-tom-hollands-first-adventure",
    "Super Mario": "https://www.techradar.com/news/new-super-mario-bros-movie-planned-for-2022-and-miyamoto-is-involved"
  }
}