{
  "source": "https://www.techradar.com/news/a-million-credit-card-details-have-been-leaked-onlineas-a-marketing-stunt",
  "title": "A million credit card details have been leaked online...as a marketing stunt",
  "category": "computing",
  "updated": "2021-08-10T13:46:51Z",
  "author": "sead-fadilpasic",
  "summary": "Criminals are giving away cards to promote a new venture",
  "article": [
    "What better way to promote a business than a giveaway, right? Well, it seems some criminals think just that way, as a group that recently set up a new underground website for stolen credit cards just started promoting a giveaway of a million cards.",
    "As reported by BleepingComputer, the group behind the newly set up AllWorldCards website took to multiple forums to promote their new “business”. In these promo posts, the group said all the card details were stolen between 2018 and 2019.",
    "They also said they randomly sampled 98 cards and found that more than a quarter (27%) were still active. Security experts D3Labs, BleepingComputer further found, claim roughly half of all cards are still active.",
    "\"At present, the feedback returned to our analysis team is still limited, but they are showing an incidence close to 50% of cards still operational, not yet identified as compromised.\" reported D3Lab in a blog post about the leak.",
    "It was also said that the leak contains all the data needed to make a purchase online: credit card numbers, expiration dates, CVVs, names, countries, states, cities, addresses, zip codes, and email and phone numbers.",
    "Criminals usually use stolen credit cards to purchase gift cards, as those are quite hard to trace - and although yet unconfirmed, it seems that the State Bank of India has the highest number of compromised cards, followed by JPMorgan Chase Bank, BBVA Bancomer, the Toronto-Dominion Bank and the Poste Italiane.",
    "The AllWorldCards site has more than two million credit cards on sale, with most of them costing between $3 and $5. The cheapest cards on the site cost $0.30, while the most expensive ones are $14.40. At the moment, there are more than two million cards for sale on the site, with the majority (more than a million) being from US banks.",
    "Via: Bleeping Computer"
  ],
  "headers": {
    "5": "Buying giftcards"
  },
  "links": {
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/security/one-million-stolen-credit-cards-leaked-to-promote-carding-market/"
  }
}