{
  "source": "https://www.techradar.com/news/first-look-elite-dangerous-odyssey",
  "title": "First Look: Elite Dangerous: Odyssey",
  "category": "computing",
  "updated": "2021-04-01T21:48:03Z",
  "author": "john-loeffler",
  "summary": "'An absolutely game-changing update to an already incredibly expansive game universe'",
  "article": [
    "Elite Dangerous: Odyssey – the upcoming expansion of Frontier Developments' massive sci-fi space trucking and dogfight simulator – introduces a whole new way to play the popular online space simulation by taking the commanders out of the cockpit and putting them on the ground, gun or scanner in hand, for a whole new exciting way to experience the 32nd-century.",
    "The alpha just started, so it's still early days, but I've played for several hours getting wasted by planetside commandos and sneaking documents out of strangers' lockers to get a good feel for the potential of this new update – and I can safely say that it's nothing short of game-changing.",
    "At this point long-time players of Elite Dangerous have seen some 400 billion stars of the Milky Way from inside the cockpit of a Sidewinder or planetside Scarab, but now, Odyssey allows them to step out into the black with just their flightsuits and their wits... and guns, scanners and arc cutters.",
    "So what's our first stop in the bold new frontier? Phase One is the Armstrong's Legacy station in the Adityan System, a trinary star system full of planets and moons for players to explore on foot.",
    "While different from what we've experienced before, my first impression is largely positive. After some initial issues with controller input acting wonky forced me to switch to the trusty mouse and keyboard, exploring the station and seeing actual human NPCs completely shifts your perception of the game.",
    "After spending years mostly locked into the lonely cockpit of various ships going from spaceport to space port, the Horizons expansion opened up planetside exploration in the form of Scarab Surface Recon Vehicles (SRVs), so you were moving from one cockpit to another. But Odyssey changes this up entirely by also making it a first-person shooter/exploration/action game that immediately reminds me of titles like Deus Ex (without the Blade Runner aesthetic).",
    "It's still early and the game isn't optimized yet, so there are some issues with framerates and NPCs shooting across the screen like lasers after they spawn to stand on their designated space in the map.",
    "There's also the uncomfortable moment when you spawn back into a base after you get \"critically injured\" – i.e. muerte, ded, cease-to-be, shot the hell up by security forces after getting caught stealing a metal coil from a locker – where you spawn inside another player and get to see the details of their dental work.",
    "Still, for an alpha, the game is definitely looking very sharp and the foundation appears solid without a whole lot of major bugs so far. What bugs there are are actively being hunted down with regular hotfixes, so already the game is quickly improving which makes me pretty hopeful for the full release.",
    "Despite spending a few hours with it, I've only successfully completed one mission so far, but that's more a problem with me biting off more than I can handle – repeatedly. Much like Elite Dangerous' initially outfitted Sidewinder will get you from station to station and take out the lowest level space pirate, it's not the kind of thing anyone would advise you to take into a high-intensity conflict zone.",
    "Right now, unfortunately, every planetside base can effectively turn into a high-intensity conflict zone if you trigger an alarm. Since even the lowliest scientist has a side arm, commandos acting as security have assault rifles and carbines, and drones overhead can track you into the desolation beyond the reach of a settlement's lights and gun you down like the thieving dog you are.",
    "Needless to say, it's better to start off with some easy stuff like fetch-a-document missions than covert sabotage jobs.",
    "The settlements themselves are a step up from those found in ED's Horizons expansion, though they are still algorithmically generated, so there's a good bit of repetition in their design. If you're a longtime Elite Dangerous player though, that's nothing new since we've been staring at the same windowed UI screens in a couple of similar looking space stations for years now.",
    "We can't say much about combat and hacking at this point since those will be rolled out in Phase Two and the new exobiology activities are due in Phase Three, but the combat I have encountered has been decidedly one-sided and not in my favor. That said, it's called Elite Dangerous – not Elite Squishy – so it's pretty much on brand.",
    "It's still really early, but Odyssey is really promising so far. Even the limited content available right now is enough to make me want to put aside Valheim and my PS5 and dive back into the fraught, expansive world of Elite Dangerous... even if I'm limited to a single star system at the moment.",
    "Phase Two and Phase Three are going to open up the playable space to 20 and then 50 light years, respectively, with missions in neighboring systems, faction combat, ship purchases, combat vouchers, and more becoming accessible, before the final integration of the new expansion into the larger game upon release.",
    "It will be exciting to see how well the two experiences of space exploration, combat, and trading that we've known for years meshes with the new first-person gameplay of Odyssey. If the two come together in a more-or-less seamless fashion, Odyssey looks like it's going to be an absolutely game changing update to an already incredibly expansive game universe."
  ],
  "headers": {
    "2": "First Footfall in Elite Dangerous: Odyssey",
    "9": "A change of pace from that space truckin' life",
    "14": "What we want to see in Elite Dangerous: Odyssey going forward"
  },
  "links": {
    "Deus Ex": "https://www.techradar.com/news/gaming/deus-ex-mankind-divided-review-1326902",
    "Valheim": "https://www.techradar.com/news/valheim-makes-me-love-the-survival-genre-again-heres-why",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5"
  }
}