{
  "source": "https://www.techradar.com/news/xbox-admits-its-not-keeping-up-with-sonys-biggest-ps5-games",
  "title": "Xbox admits it's not keeping up with Sony’s biggest PS5 games",
  "category": "gaming",
  "updated": "2021-10-21T13:39:44Z",
  "author": "jamel-smith",
  "summary": "Good competition is better for all gamers",
  "article": [
    "In an interview with Kinda Funny Games, Xbox Game Studio boss Matt Booty talked about Microsoft’s current efforts in competing with Sony first-party games, Booty acknowledged Xbox has “not been out in front,” and went on to say that Xbox hasn’t really “had the sort of 1:1 with Sony.”",
    "Booty praised PlayStation Studios and its leaders for creating “tentpole” games “that fit into a junction where everybody can play” and explore its big worlds. He also praised the really well-realized characters and high production values of Sony games, going on to say that “you can't argue with the quality and the craft and the games that [Sony] delivered and that they're working on now.”",
    "Booty did avoid discussions about Microsoft’s response to Sony’s blockbuster games like God of War or Uncharted, even though it has announced games similar to those like Indiana Jones. But, again, Booty did acknowledge those are absolutely the games Xbox wants to go after.",
    "With the previous Xbox One generation, many people felt that Microsoft lagged behind Sony when it came to the quality of its first-party games. After the incredible year Sony had in 2018 with the critically-acclaimed releases of Spider-Man and God of War, Microsoft followed up in early 2019 by releasing Crackdown 3.",
    "This was a game that didn’t have the same quality, gameplay, and story as Sony’s 2018 blockbusters. It became abundantly clear that Microsoft was failing with its first-party games, which also impacted sales of the Xbox One, and PS4 lifetime sales were double the amount of the Xbox One in 2019.",
    "However, it appears that Xbox is on the right track this generation with the Xbox Series X/S and its Game Pass service. Microsoft has expanded its game studios by acquiring an abundance of development studios like Obsidian Entertainment, Ninja Theory, and all the studios under Bethesda’s parent company Zenimax Media. Sony too has acquired more studios, like Bluepoint and Housemarque.",
    "Admittedly, Microsoft did get off to a slow start this generation compared to Sony. Sony released quality games like Spider-Man: Miles Morales, Returnal, Demon Souls, and Ratchet and Clank: Rift Apart in the first seven months of the PS5 release, while Microsoft had to delay its biggest game, Halo Infinite by a year, leaving its launch lineup looking pretty barren compared to the PS5.",
    "However, Microsoft’s upcoming games do show promise, with Halo Infinite, Forza Horizon 5, Starfield and Redfall releasing either at the end of this year or in 2022, and we expect a quality gaming experience from these titles to compete with Sony’s array of upcoming titles like God of War: Ragnarok and Horizon Forbidden West."
  ],
  "headers": {
    "3": "Analysis: Xbox will be better than the last generation – but is it enough?"
  },
  "links": {
    "Kinda Funny Games": "https://youtu.be/9yAxx4DaDmY",
    "Indiana Jones": "https://www.techradar.com/news/new-indiana-jones-game",
    "Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Crackdown 3": "https://www.techradar.com/reviews/crackdown-3",
    "PS4 lifetime sales were double the amount of the Xbox One in 2019": "https://www.vgchartz.com/article/440108/switch-vs-ps4-vs-xbox-one-global-lifetime-salesjuly-2019/",
    "Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Demon Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Redfall": "https://www.techradar.com/news/redfall-trailer-gameplay-release-date-and-more",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer"
  }
}