{
  "source": "https://www.techradar.com/news/best-ergonomic-keyboards",
  "title": "Best ergonomic keyboards 2021: top typing peripherals that are kind to your wrist",
  "category": "computing",
  "updated": "2021-09-28T14:13:40Z",
  "author": "michelle-rae-uy",
  "summary": "Type or button-mash for hours pain-free",
  "article": [
    "One of the best ergonomic keyboards might be what you need, especially if you’re already feeling the painful effects of pounding on your keyboard every day for hours on end. The best keyboards may be among the most comfortable keyboards out there. However, these ergonomic options take comfort to a whole new level, ensuring that you won’t eventually suffer from chronic injuries from long-term use.",
    "Instead of simply employing the usual rectangular keyboard form, these ergonomic keyboards are shaped specifically to keep ulnar deviation, forearm pronation, and repetitive strain injuries at bay. Whether that means that they’re domed at the center or have a split design that allows both pieces to stand in tent mode, these peripherals are shaped so that your hands and wrists are resting at their most natural positions. Quite a few also ensure that there’s enough support to avoid fatigue.",
    "As a result, the best ergonomic keyboards protect your upper appendages and help you push through long hours of working from home or gaming sessions. Whether you’re already dealing with carpal tunnel or looking to preempt any issues, you should consider investing in one. Give your wrists, shoulders, and fingers some love with one of our top picks, alongside our price comparison tool for the best keyboard deals.",
    "There’s a lot to love about Logitech’s Ergo K860 keyboard. Its PerfectStroke keys are comfortable to use. It’s got 12 programmable keys and four different connectivity options that let you connect up to four devices all at once. And, it’s got an impressive 33-foot wireless range.",
    "Its impressive list of features aside, however, this split domed keyboard boasts ultimate comfort and support for those who are prone to wrist, arm and shoulder pain. Its double layer foam wrist rest delivers maximum support while its curved key design encourages your hands and wrist to stay in a more natural form, minimizing strain and also promoting better posture. It’s not the cheapest, but between being rich in features and being better for your upper body, it’s actually a fantastic value. You can’t, after all, put a price on your health.",
    "Read the full review: Logitech ERGO K860",
    "It’s not surprising, with Microsoft’s track record for making great peripherals, that the company has also rolled out one of the best ergonomic keyboards out there. Microsoft Sculpt has been around for ages as well, making it all the more impressive that it still holds up years later.",
    "Boasting wireless connectivity, a cushioned palm rest, and a form factor that rotates your wrists outward so as to prevent ulnar compression, there’s definitely a lot to love here, even if it’s really only best for Windows users (naturally). There’s also a separate numeric pad for when you need to crunch numbers, easily stowed away when you don’t. And, unlike the Logitech Ergo K860, it’s affordable to most people.",
    "Read the full review: Microsoft Sculpt",
    "Cherry is another company known for its peripherals, and it’s recently launched the Cherry KC 4500 Ergo, adding yet another impressive (if perhaps, plain-looking) keyboard to its portfolio. And, it’s even cheaper than the crowd-favorite Microsoft Sculpt, which is why it’s earned the best budget ergonomic keyboard title.",
    "Being affordable, this doesn’t have a lot of bells and whistles on this. However, it does make up for that fact by offering all the basic features you could ever want in an ergonomic keyboard. The split curved design is there, as is the extra soft wrist rest. For added support, there are three extra feet that allow you to raise the front of the keyboard. Better yet, you can not only reprogram some keys but also record macros so you can shave off many precious minutes when performing heavier workloads.",
    "Read the full review: Cherry KC 4500 Ergo",
    "Just because you’re traveling doesn’t mean you should risk repetitive strain injury. These days, in fact, it’s no longer an excuse with the Goldtouch GTP-0044W Go!2 Bluetooth keyboard making it possible for remote workers to travel, work, and stay comfortable.",
    "This split foldable ergonomic keyboard comes with a simple yet ingenious set of latches and locks that let you set it to the angle that feels most comfortable for you. There are at least eight different tent and split positions to choose from. And, while it is portable, it hardly scrimps on the basics like comfortable keys with a satisfying bounce and reliable wireless connectivity. Just bear in mind that you won’t be getting a wrist rest and will have to pay a pretty penny for the entry fee.",
    "The ErgoDox EZ split layout isn’t exactly new. Many ergonomic keyboards have adopted such designs. Yet, this one has found several ways to stand out from the crowd, making it among the best ergonomic keyboards out there for folks looking for something feature-rich.",
    "It boasts linear columns of keys, which are meant to reduce finger travel and fatigue. It boasts dual-function and multiple layer keys. It comes with a custom tilt/tent kit so you can find an angle or position that’s most comfortable and stick with it, as well as custom-molded Wing wrist rests that you can position as close or as far to the keyboard as you need them. And, the whole thing is customizable so you’ll get exactly what you want. Its unique design does take a bit of getting used to, but when you do, you’ll never look back."
  ],
  "headers": {},
  "links": {
    "best keyboards": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011",
    "chronic injuries": "https://www.techradar.com/news/world-of-tech/9-tech-injuries-and-how-to-avoid-them-1250367",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "best keyboard deals": "https://www.techradar.com/deals/cheap-gaming-keyboard-deals-and-sales",
    "Logitech ERGO K860": "https://www.techradar.com/reviews/logitech-ergo-k860-keyboard",
    "Microsoft Sculpt": "https://www.techradar.com/reviews/pc-mac/peripherals/input-devices/keyboards/microsoft-sculpt-ergonomic-desktop-1223671/review",
    "Cherry KC 4500 Ergo": "https://www.techradar.com/reviews/cherry-kc-4500-ergo"
  }
}