{
  "source": "https://www.techradar.com/news/the-grand-tour-season-4-episode-3-release-date-and-upcoming-episodes-explained",
  "title": "The Grand Tour Presents: Lochdown: release date, trailer and new episodes explained",
  "category": "entertainment",
  "updated": "2021-07-15T09:19:18Z",
  "author": "samuel-roberts",
  "summary": "What we know about the show's Scotland and Russia specials",
  "article": [
    "The Grand Tour season 4, episode 3 is coming on July 30, Amazon has confirmed – and it'll take co-hosts Jeremy Clarkson, Richard Hammond and James May to Scotland in a special called Lochdown. The episode was actually filmed in 2020, mid-pandemic, so hopefully we won't have to wait too long to see it. The special will imitate the feeling of an American road trip – without actually requiring the British hosts to leave their country.",
    "There's a first trailer for The Grand Tour Presents: Lochdown, too, which you can see below.",
    "There's more good news if you're a fan of The Grand Tour Presents: a new episode has been filming this year in Wales and parts of England like Warwickshire. This dovetails with what James May said in an interview last year about filming more episodes closer to home in an effort to release them more regularly. Given how languid the releases have become lately – a year separated the release of the last two specials, Seamen and A Massive Hunt – that will come as a relief.",
    "Below, we'll tell you everything we know about the future of The Grand Tour Presents on Amazon Prime – including details about the Scotland-based Lochdown special, what we know about the new UK episode as it films, and what happened to the lost Russia special that was originally set to follow A Massive Hunt.",
    "The next special in The Grand Tour Presents series is called Lochdown – and it just got a release date of July 30 on Amazon Prime Video. Check out the trailer in the section below for confirmation.",
    "That's not all that's coming from Clarkson and pals in the foreseeable future, though.",
    "As of April 2021, another special for The Grand Tour was filming in the UK – the three hosts were spotted filming in Llandrindod Wells, Wales, by The Grand Tour Fans YouTube channel. They were each driving classic French cars, which hints a little at the theme for the episode. Jeremy Clarkson was apparently spotted driving a Citroën CX Break, James May was glimpsed in a Renault Avantime, while Richard Hammond was reportedly in a Matra Murena, according to the channel. Later, the hosts were spot in Leamington in England, filming near a retail park.",
    "That episode seems like it's probably a while away, though. Let's go through what we know about the Lochdown special's filming, first. A first teaser for that episode was released on social media earlier this year – Clarkson describes the special as The Grand Tour 'unplugged'.",
    "Earlier plans to record an episode in Russia were put on-hold because of the pandemic (see below) – so the Lochdown special was filmed in Scotland across nine days earlier in 2020 instead.",
    "\"We did it in area of Scotland with not many people,\" co-host James May told BT. \"We didn’t interact with the locals really. There were complicated systems set up for cleaning everything and it was a bit tiresome going through lots of procedures and being tested every day, but it didn’t get in the way of filming to be honest.\"",
    "The hosts couldn't go to the pub after filming the episode, which must've been a challenge.",
    "While it might be a long wait until the trio and their crew can head to more exotic locations, the intent is to keep making episodes in locations where it's easier to pull off – hence why a Wales-filmed special probably makes sense. \"In the short term we might have to reduce our travel ambitions and we’ll have a better chance of doing it,\" May says. \"Better to film in the UK and deliver regularly than promise the earth and not deliver anything. The Grand Tour may become a little more domestic. But it will still be us three which is the important thing. And cars.\"",
    "That bodes well for the future – and who knows, maybe we'll start seeing episodes of The Grand Tour season 4 land more regularly than once every year again.",
    "Check out the trailer for The Grand Tour Presents: Lochdown above, which was released in July 2021.",
    "To film the upcoming Scotland special during the pandemic, the crew formed a bubble, and no one caught Covid-19 during the shoot. It was reported that the hosts were seen driving classic American cars from Edinburgh to the Hebrides – which suggests some kind of Route 66-style road trip element.",
    "Clarkson was seen driving a blue Lincoln, May was seen driving a red Cadillac, and Hammond was seen in a green Buick. The trio also took part in a drag race on a runway somewhere in south Scotland, for which the cars mentioned were apparently modified, and were seen towing caravans at one point too.",
    "May says that being a bit closer to the home for the hosts doesn't matter that much – after all, viewers on Amazon Prime Video could be watching it from anywhere. \"If you're watching The Grand Tour from Sri Lanka, Scotland is as exotic and beautiful as Sri Lanka is from Scotland, so there's always going to be a large part of the audience which finds anywhere in the world fascinating.\"",
    "And hey, anything that gets the hosts to film new episodes faster seems like a good thing.",
    "The next planned episode for The Grand Tour Presents was meant to take the hosts to Russia – and this is still the idea, one day. It's just been postponed for now due to the pandemic. James May says that lots of preparation has been made for this special, but that it's \"just impossible right now\". Hopefully, with the incoming wave of vaccines, that might be able to change in future – but it seems unlikely you'll see a Russia special of The Grand Tour at any point in the next year or so.",
    "After the next UK special, though, Clarkson did confirm the plan was to film abroad – they're just not sure where yet."
  ],
  "headers": {
    "4": "The Grand Tour Presents: Lochdown release date is July 30, 2021",
    "13": "The Grand Tour Presents: Lochdown trailer",
    "18": "The Grand Tour season 4 Russia special: what we know"
  },
  "links": {
    "The Grand Tour Fans YouTube channel": "https://www.youtube.com/watch?v=P2LPcKtSsN0&feature=youtu.be&ab_channel=TheGrandTourFans",
    "BT": "https://www.awin1.com/awclick.php?awinmid=3041&awinaffid=103504&clickref=trd-us-2685213428543379500&p=https%3A%2F%2Fwww.bt.com%2Ftv%2Fentertainment%2Fgrand-tour-madagascar-special-release-date-presenters-locations-cars"
  }
}