{
  "source": "https://www.techradar.com/news/asics-turns-5-tons-of-waste-clothing-into-new-shoes",
  "title": "Asics turns 5 tons of waste clothing into new shoes",
  "category": "fitness",
  "updated": "2021-04-22T13:50:04Z",
  "author": "cat-ellis",
  "summary": "The equivalent of 25,000 T-shirts",
  "article": [
    "Asics has released a new collection of running shoes and sportswear made from tons of recycled waste clothing. The Earth Day Pack includes special versions of the Gel-Nimbus 23, Glideride 2, Gel-Lyte III, Skycourt and Tarther Blast shoes, and is being launched to mark World Earth Day on April 22.",
    "This isn't Asics' first foray into recycled materials. The company used the same tech to produce a line of sportswear for athletes in the (postponed) Tokyo Olympic Games, and last month released a pair of MetaRide and Gel-Quantum 360 TYO shoes made from textile waste gathered in Japan.",
    "The recycled polymer is colored using a technique called solution dying, where pigment is added to the material before it's processed into filaments, which uses up to 33% less water than traditional dying methods.",
    "The exact amount of recycled material in each product varies, and some virgin plastics are still necessary. Asics says that at least 30% of each running shoe's upper polyester will be recycled. For sports shoes it makes up 40% of the primary material of the upper, and for tennis shoes it's 40% of the shoe's upper base mesh.",
    "The Earth Day Pack will be available to buy from April 16 direct from Asics, and the Skycourt and Tarther Blast shoes will be release later in the month.",
    "Of course, the greenest option is always to get the most use possible out of what you have, but it's always good to see some more sustainable options when it comes to sports shoes, which get a lot of punishment and need replacing regularly.",
    "When your shoes have come to the end of their lives, check out your local independent running stores, many of which will accept old footwear for recycling in exchange for a voucher off your next pair."
  ],
  "headers": {
    "3": "Reduce, re-use..."
  },
  "links": {
    "running shoes": "https://www.techradar.com/best/best-running-shoes",
    "Earth Day Pack": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1384899268707050500&xs=1&url=https%3A%2F%2Fasics.com%2Fgeo%2Fmk%2Fsustainability%25E2%2580%258B&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fasics-turns-5-tons-of-waste-clothing-into-new-shoes",
    "MetaRide and Gel-Quantum 360 TYO": "https://www.techradar.com/news/asics-launches-sustainable-new-running-shoes-made-from-recycled-clothes",
    "direct from Asics": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3842041153250264000&xs=1&url=https%3A%2F%2Fasics.com%2Fgeo%2Fmk%2Fsustainability%25E2%2580%258B&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fasics-turns-5-tons-of-waste-clothing-into-new-shoes"
  }
}