{
  "source": "https://www.techradar.com/news/whatsapp-video-uploads-could-soon-eat-up-less-data",
  "title": "WhatsApp video uploads could soon eat up less data",
  "category": "computing",
  "updated": "2021-07-02T08:56:24Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Video quality options are on their way to WhatsApp",
  "article": [
    "The beta versions of WhatsApp always give an exciting glimpse into the future, and they pop up with far greater frequency than pretty much any other app. Some changes are merely aesthetic, while others are useful, timesaving or just, cool.",
    "In the latest beta of the Android edition of WhatsApp, we can see a test underway that will be welcomed by anyone who habitually shares videos via the chat platform. If you've ever been frustrated by a slow experience of uploading video when you're in an area with a poor data connection, there's some great news.",
    "In its latest test, WhatsApp is giving users the ability to choose the quality settings for uploaded videos. This means that it is possible to strike a balance between file size and video quality according to your needs and the situation you find yourself in.",
    "By default, WhatsApp will determine whether to prioritize quality or size, implementing video compression if it is deemed necessary. But it will also be possible to override this setting and opt instead to use the best quality setting, or switch top data saver mode as you see fit.",
    "Why might you want to switch away from the default, automatic setting? There are many potential reason, not least of which being that it is always nice to have a choice! But you may find yourself trying to upload a video for which the quality level needs to be high.",
    "If you have a slow data connection, WhatsApp may try to help out, and drop the quality. Thankfully, you have the option to intervene, and use the higher quality setting if you are happy to take the time and data hit.",
    "Conversely, WhatsApp uploading videos at high quality may mean that your monthly data allowance takes too much of a hit. As ever, choice is power.",
    "The same feature is expected to land in the iOS version of the app as well, but it's not clear quite when it might roll out to the main version WhatsApp rather than just the betas.",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "High quality vs high speed"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/how-to/how-to-use-whatsapp",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-14-6-whats-new/"
  }
}