{
  "source": "https://www.techradar.com/news/steam-deck-is-now-being-shipped-out-to-game-developers-anyway",
  "title": "Steam Deck is now being shipped out – to game developers anyway",
  "category": "gaming",
  "updated": "2021-09-15T11:35:02Z",
  "author": "darren-allan",
  "summary": "Valve’s portable PC reaches a milestone as first units are shipped to devs",
  "article": [
    "Steam Deck developer kits are now being sent to game developers for them to test the hardware with their products ahead of its big release at the end of the year.",
    "These dev kit models are “functionally identical” to the finished product, as we’ve heard before, and while there’ll be small differences, they won’t be anything that matters.",
    "This is not really a surprise seeing as at the start of September, Valve announced that it was getting ready to ship developer kits, and for requests to be made for the limited number of these which were being prepared.",
    "So those requests have been received, processed, and the lucky devs deemed important enough are getting a Steam Deck imminently. The engineering samples of the handhelds are intended to give Valve the “chance to guide game developers through the process of getting their games on Steam Deck”, the firm notes, and to get feedback on possible issues as the final phase of work on the device ramps up.",
    "We also got a glimpse of some pics of the dev units being given their final updates (above) and then subsequently packaged up ready to be shipped (below).",
    "To all intents and purposes, then, the Steam Deck hardware is done, with just polishing and honing to perform – and hopefully that’s something of a hint that Valve is on-track to launch the portable PC as planned in December.",
    "After all, it’s taken less than a fortnight to get the names of interested parties, process them and ship out dev sample units, so that seems to be pretty quick – even if at this point, it needs to be. Remember, we’re only a few months away from the actual retail launch now, so testing needs to proceed with some urgency.",
    "Of course, even if things seem to be on track right now for the big launch, exactly how many units might be available in December is another question entirely – particularly given how quickly pre-orders were pushed way out into 2022 when they first went live.",
    "What’s clear enough is that a great deal of gamers are going to be doing some waiting, it’s just a question of how much waiting. Currently, the Steam Deck pre-order page shows expected availability of ‘after Q2 2022’ for all models, which indicates July 2022 or later."
  ],
  "headers": {
    "5": "Analysis: Swift delivery of samples"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "test the hardware with their products": "https://www.techradar.com/news/steam-deck-might-only-be-able-to-run-72-of-the-top-50-games-on-steam",
    "process of getting their games on Steam Deck": "https://www.techradar.com/news/no-the-steam-deck-wont-run-every-game-in-your-library-but-does-that-matter",
    "notes": "https://store.steampowered.com/news/app/1675180/view/2963920750895461227",
    "just a question of how much waiting": "https://www.techradar.com/news/when-will-you-actually-get-your-steam-deck"
  }
}