{
  "source": "https://www.techradar.com/news/remote-working-a-short-term-fix-with-long-term-impact",
  "title": "Remote working: A short-term fix with long-term impact",
  "category": "computing",
  "updated": "2021-04-01T08:25:03Z",
  "author": "kristian-torode",
  "summary": "How has remote working technology affected business?",
  "article": [
    "As we pass the one-year mark since the first UK lockdown, the ‘work from home where possible’ order still stands for many businesses. Remote working technology enabled virtual connectivity when physical proximity wasn’t possible, but how has this affected business operations in the long-term?",
    "The pandemic forced businesses to quickly adapt to minimizing physical contact and human interaction. Many achieved this by making use of digital tools to keep people connected and productive while remaining safe. As the easing of lockdown restrictions comes into place and remote working is no longer legally enforced, we’re seeing the lasting impact of these policies and practices — a permanent change to working practices, improved employee wellbeing, and futureproofed operations.",
    "As plans to open cafés, restaurants and even borders become a reality, the concept of remote working could take on an entirely different meaning. Throughout the pandemic, remote working wasn’t a benefit, but a requirement. Many businesses had to scramble to implement effective communication systems to keep operations flowing while employees worked from make-shift home offices. And many saw this as a short-term measure until life returned to normal.",
    "Unified communication (UC) systems integrate all communication methods, including phone, instant messaging, video conferencing and email into one platform, which can be easily accessed from multiple compatible device modes, providing they have an internet connection. UC systems enable employees to remain connected in real time, ensuring that the lack of physical interaction does not hinder productivity.",
    "However, many businesses are considering how these systems can have a lasting impact on policy and practices. According to a survey conducted by Institute of Directors (IoD), 74 per cent of company directors in the UK are planning to keep some level of remote working policy after the pandemic ends. One year on, and home working is no longer a temporary solution.",
    "Now that businesses have appropriate communication systems installed, they have the opportunity to implement work from anywhere (WFA). For example, in response to the pandemic, Spotify recently introduced such a policy, giving its employees the freedom to choose where they want to work to suit their lifestyle — at home, on the go, even the potential to travel internationally without giving up their day job.",
    "Making work more flexible not only impacts employees, but also the entire business. According to analysis conducted by academics at the Centre for Economic Policy Research, improved employee wellbeing positively correlates with increased individual productivity and improved company performance. Therefore, if remote working can improve wellbeing, it is a valuable tool for business operations.",
    "However, productive remote working requires digital tools to facilitate seamless collaboration. File sharing and emails do not adequately meet the needs of employees in today’s society. In particular, those working in creative industries need to be able to bounce ideas off each other, and those in client-oriented roles need to be able to establish and maintain good relationships remotely.",
    "Technologies such as video conferencing play an essential role in enabling this, by offering real-time communication in an almost face-to-face scenario. This imitates in-person interactions to benefit employees in their work life, without the stress of juggling other responsibilities or battling a hefty commute that working in office would bring.",
    "The pandemic caught businesses by surprise, and many were left with the task of completely overhauling their communication systems in a matter of days to keep employees safe. For businesses working on more a traditional system, like the Integrated Services Digital Network (ISDN), this proved challenging as these phone systems are fixed in one place and cannot be moved.",
    "In comparison, those operating on a modern system, like Voice over Internet Protocol (VoIP), were able to adapt more easily. Unlike ISDN, VoIP phone systems work over an internet connection, making them completely mobile and versatile. Many businesses chose to install VoIP systems during the pandemic to enable remote working.",
    "Even for businesses wanting to return to the office full-time, establishing a VoIP communication system gives them the stability and mobility to work remotely if required. Businesses can be assured that their infrastructure can withstand any unexpected situations that may arise again — be it on a global scale, like the pandemic, or even a smaller, business-specific crisis.",
    "No one could have anticipated a global pandemic, but it has highlighted a previously unrecognised need for businesses to be geographically adaptable. Remote working technology provided a short-term fix, keeping employees connected and work collaborative. Now, businesses have the infrastructure and the knowledge that remote working works. Its impact on policy, wellbeing and crisis prevention supports the shift in how we understand what work is — becoming a thing that we do, rather than a place that we go."
  ],
  "headers": {
    "2": "Work from…anywhere?",
    "6": "Improved wellbeing, increased productivity",
    "9": "Ready for anything"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Unified communication": "https://www.techradar.com/best/best-ucaas",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "email": "https://www.techradar.com/news/best-email-provider",
    "VoIP": "https://www.techradar.com/news/best-voip-service"
  }
}