{
  "source": "https://www.techradar.com/news/your-favorite-pc-games-might-be-on-the-steam-deck-after-all",
  "title": "Your favorite PC games might be on the Steam Deck after all",
  "category": "gaming",
  "updated": "2021-09-27T09:05:35Z",
  "author": "hamish-hector",
  "summary": "Easy Anti-Cheat and BattlEye are coming to Proton",
  "article": [
    "For some time there have been fears that many of the most popular Steam games might not be compatible with the Steam Deck. Thankfully, it looks like that’s no longer going to be the case.",
    "The Steam Deck is a new handheld console that is effectively a shrunk-down Linux-operated computer. According to Valve, pretty much every game on Steam will be supported by the device – but fans quickly noticed there could be issues with hugely popular titles like Destiny 2: Beyond Light, Rainbow Six Siege and Apex Legends (among others).",
    "That’s because these games all rely on anti-cheat software like BattlEye and Easy Anti-Cheat which weren’t confirmed to be compatible with Proton – a tool that allows Windows programs to run on Linux and a key part in making games work on the Steam Deck.",
    "These problems meant that around 28% of the 50 most active Steam Games might not have worked on the Steam Deck, in a huge blow for those looking to take their favorite games on the go. However, BattleEye and Easy Anti-Cheat have said that fans don’t need to worry.",
    "The official BattleEye Twitter account issued a statement saying “BattlEye has provided native Linux and Mac support for a long time and we can announce that we will also support the upcoming Steam Deck (Proton).” Epic Games – the creators of Easy Anti-Cheat – also announced that its program now has Linux and Steam DeckSupport.",
    "It’s not all smooth sailing from here though, as developers will have to enable Proton support manually. BattlEye and Easy Anti-Cheat make this sound like a fairly simple process, though, and we imagine devs will feel incentivised to jump through any hoops – if the console builds up a decent following, that is.",
    "Depending on the complexity of this process, we could always see some devs enable Proton support from the off, with others lagging behind until there's a significant user base on the Steam Deck platform.",
    "So, while we expect most games will turn this feature on, we do recommend checking your favorite titles will be supported by the Steam Deck before nabbing a console.",
    "If you were on the fence about getting a Steam Deck and this has now persuaded you to go all-in, you can check out the models available on the official store page. Prices start at $399 / £349 and your new handheld will be available sometime after Q2 2022 (according to the website as of the time of writing)."
  ],
  "headers": {
    "5": "Analysis: will developers get on board?"
  },
  "links": {
    "popular Steam games might not be compatible with the Steam Deck": "https://www.techradar.com/news/steam-deck-might-only-be-able-to-run-72-of-the-top-50-games-on-steam",
    "BattleEye Twitter account": "https://twitter.com/TheBattlEye/status/1441477816311291906?s=20",
    "announced": "https://dev.epicgames.com/en-US/news/epic-online-services-launches-anti-cheat-support-for-linux-mac-and-steam-deck",
    "official store page": "https://store.steampowered.com/steamdeck"
  }
}