{
  "source": "https://www.techradar.com/news/television/chromecast-deals-1302163",
  "title": "The cheapest Chromecast prices and deals for December 2021",
  "category": "televisions",
  "updated": "2021-12-01T09:04:45Z",
  "author": "tabitha-baker",
  "summary": "Looking for cheap Chromecast prices? We can help you out",
  "article": [
    "The cheapest Chromecast prices keep getting better – and it's not hard to see why. With a market flooded with cheap, capable streaming devices, manufacturers are having to keep their pricing competitive, and the result is a buffet of Chromecast deals for shoppers.",
    "Why the Chromecast over the competition? Google's streamer manages to break ahead with a wide array of excellent features and excellent support from Google Assistant and the best Chromecast apps.",
    "Chromecast is a Wi-Fi HDMI dongle that you plug directly into your TV. From there you can use your smartphone or tablet to 'throw' video at your TV over Wi-Fi, whether it be Netflix movies, live football matches from the major broadcasters or simply just a funny YouTube video.",
    "With prices already pretty cheap, there's no need to hang on for specific Chromecast sales. If you're in the UK or US and would prefer to stream content from a standalone box, you should take a look at the latest Roku deals. Otherwise, there's a strong selection of streaming devices over on our Amazon Fire TV Stick prices and deals page.",
    "The Chromecast with Google TV is the newest member of the Chromecast family – with 4K HDR streaming, a bundled remote, and an improved Google TV interface. If you have a 4K TV or are planning on getting one, it's certainly worth picking one of these up. Chromecast with Google TV deals are usually around $49.99 / £59.99 / AU$99 – and as the latest model, it's well worth keeping an eye out for deals.",
    "The 4K Chromecast Ultra is a high-spec streamer that's since been outshone by the Google TV model above. The specs are pretty similar aside from the interface difference – the Ultra using Android TV instead – but you won't get a remote with this model.",
    "Chromecast Ultra deals are usually around £69/US$69/AU$95, so anything cheaper is an added bonus. It's worth noting though that the 4K-ready Amazon Fire TV Stick prices are cheaper nowadays though and that device also comes with a remote.",
    "The newest version of the standard (non-4K) Chromecast is this 3rd-gen iteration. Generally, you'll find it for the same prices as the previous model. It's phasing out stock of the older model, although if you spot the older one for a decent amount less, you're not missing much at all by skipping the new one.",
    "The only real improvement is a modest boost to the speed it'll load up videos and start running them in full HD. The actual dongle looks a bit different too (see images), but other than the speed boost, that's all your getting for the Chromecast 3. At least now we know why Google basically launched this without really letting anyone know.",
    "The Chromecast 2 is very similar to the now-discontinued 2013 Chromecast. Sure, it looks a little different. And it's got slightly faster network performance and a few other tweaks such as coming with a dangly cable instead of as a rigid stick. But essentially the same product in a different shape - that's why the prices were basically the same. There's a newer version out now, although it's only moderately faster."
  ],
  "headers": {
    "4": "The cheapest Chromecast with Google TV prices",
    "5": "The cheapest Chromecast Ultra prices",
    "7": "The cheapest Chromecast 3 prices",
    "9": "The cheapest Chromecast 2 prices"
  },
  "links": {
    "best Chromecast apps": "https://www.techradar.com/news/best-chromecast-apps",
    "Roku deals": "https://www.techradar.com/news/video/roku-deals-1315966",
    "Amazon Fire TV Stick prices and deals": "https://www.techradar.com/news/best-amazon-fire-tv-deals",
    "Amazon Fire TV Stick prices": "https://www.techradar.com/news/best-amazon-fire-tv-deals"
  }
}