{
  "source": "https://www.techradar.com/news/apps-that-have-updated-to-ios-15-and-your-new-iphone-13",
  "title": "Apps that have updated to iOS 15 and your new iPhone 13",
  "category": "computing",
  "updated": "2021-09-24T13:55:53Z",
  "author": "daryl-baxter",
  "summary": "App updates to take notice of",
  "article": [
    "With every major iOS release also comes with a plethora of updated apps that take advantage of the new features. This is no different with iOS 15, available to download and also comes loaded with the released iPhone 13 series.",
    "As widgets are now on iPadOS 15, developers have been trying to make sure that their widgets from iOS 14 also work on iPads, as well as the exclusive XL size of widgets for the tablet.",
    "But we've already seen a bunch of apps be updated to take advantage of iOS 15, and with that, here's some to highlight that could benefit your new iPhone or existing one.",
    "Wallpaper is built from the ground up to take advantage of Metal, Apple's graphics engine. Wallpaper allows you to create a collection of wallpapers in a slick design, but version 2 goes one step further.",
    "You can create live wallpapers as short as 3 seconds or as long as half a minute to really showcase the colors and effects that the app generates. The developer of the app, Ben Harraway made sure that it would only use math, code and pixels to create many unique wallpapers that could be fit for your iPhone, or as big as your iMac.",
    "There's also Shortcuts support, so you can automate wallpaper changes by the day or by the hour if you wish.",
    "Version 2 is available for $1.99 / £1.79 / AUS$1.99 for everyone on iOS, iPadOS and macOS.",
    "Remember in the early 90s where there would be toys that could play different sounds, and some could change your voice as well? This is where Yaktraks comes in.",
    "The app has been built for kids, but for everyone who remembers these games from the 90s, where you can record your voice and play it back with silly sound effects. It may sound simple for an app, but when you dig deeper, you have a great design with a color scheme that screams neon from Saved By the Bell.",
    "It's also built with privacy in mind, so no recordings are stored off your device and nothing is collected by the app.",
    "It's been released to coincide with iOS 15, which also comes with a one-time purchase of $0.99 / £0.99 / AUS$0.99, which offers added voice effects, longer recording durations and more.",
    "If you've been looking for an app that simply tracks your stats every time you go out for a jog, Runervals can help scratch that itch.",
    "Created by Ben Noland, the app detects when you're walking and running and gives you an easy to read table of your times, your distance, your average heart rate, and your pace.",
    "You can track your history and see how you can improve your exercises through a progress screen on both your iPhone and Apple Watch. Runervals also connects to the Health app, so you can look at your previous runs in that app as well.",
    "The app only runs on iOS 15 and above, due to Runervals being built entirely in SwiftUI, which is Apple's language to develop apps with. Alongside the watchOS app using the always-on display feature from watchOS 8, Noland told me that developing with these latest features made it easier for him to create Runervals, while showcasing some new features.",
    "While the app is free, there is also a subscription at $2.99 / £2.99 / AUS$2.99 a month which can record and save unlimited runs, alongside showing you trends in your exercises and able to adjust timers while you run.",
    "If there's one thing that many would like to see, it's more events to look forward to. Fortunately, Countdowns app can help with this, with it now updated to version 7.0 for iOS 15, featuring a bunch of small but significant improvements.",
    "While the app can already create a countdown based on any upcoming events in your calendar, you can search within the app for any you've missed, and add them into Countdowns.",
    "If there's a recurring event, you can repeat a countdown for this too. Does something occur every fortnight on Wednesdays and you need a countdown for it? It's now possible.",
    "Alongside these new improvements, you also can have countdowns as widgets, tailored notifications and support for Apple Watch, so a countdown could be a complication on your Watch face.",
    "If your career or hobby is DJing, a new update by Algoriddm for its djay app is one to use for iOS 15.",
    "The app integrates with TIDAL, SoundCloud, Beatport and Beatsource to enable anyone to build a DJ set that can easily cater to a party or an event, while also being able to mix in videos and photos.",
    "For the new update, djay now has Shazam integration thanks to what iOS 15 is offering developers. This allows the app to identify tracks which can be loaded into the app, ready to be used in your next set, as long as you have the song in your library or connected to a streaming service.",
    "“Integrating Shazam into djay completely transforms the creative workflow of DJs,\" explains Karim Morsy, CEO of Algoriddim. \"As a DJ you are constantly on the lookout for great new music to play at your next gig, but identifying a track and the process of getting it into your library has been a challenging task with no seamless way to do it. Now, whenever you hear a great song you can quickly load it into djay’s decks with the tap of a button and instantly unleash your creativity.”",
    "You can download djay for free on the App Store, while a Pro subscription, which adds full functionality, costs $6.99 / £5.99 / AUS$6.99 per month or $49.99 / £49.99 / AUS$49.99 per year."
  ],
  "headers": {
    "3": "Wallpaper App 2",
    "7": "Yaktraks",
    "11": "Runervals",
    "16": "Countdowns",
    "20": "djay"
  },
  "links": {
    "is available for $1.99 / £1.79 / AUS$1.99": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1129573251965404500&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fid1518228413",
    "Yaktraks": "https://sonasapps.github.io/Yaktraks/",
    "released": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1102736608263361700&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fyaktraks-90s-nostalgia%2Fid1583086555%3Fuo%3D4",
    "Runervals": "https://twitter.com/runervals",
    "Countdowns app": "https://countdowns-app.com/",
    "updated to version 7.0": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4792205563374622000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fapple-store%2Fid917514700%3Fmt%3D8",
    "Algoriddm": "https://www.algoriddim.com/djay-ios",
    "djay app": "https://www.algoriddim.com/store/djay-ios",
    "App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1264302650497776400&sharedId=mrd-gb&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fdjay-dj-app-mixer%2Fid450527929"
  }
}