{
  "source": "https://www.techradar.com/news/why-apple-arcade-is-perfect-for-follow-ups-to-no-mans-sky-oxenfree-spelltower-and-more",
  "title": "Why Apple Arcade is perfect for follow-ups to No Man’s Sky, Oxenfree, SpellTower, and more",
  "category": "gaming",
  "updated": "2021-04-06T00:08:52Z",
  "author": "david-lumb",
  "summary": "Big games have been added to the service, including a Game of Thrones title",
  "article": [
    "Over a year after going live, Apple Arcade has grown its library from 60 titles to over 180 stylized, family-friendly, and often contemplative indie games. For Apple, it feels like full steam ahead for Arcade with little apparent change in course.",
    "Apple just added 32 games that will probably have something for everyone who'd already been onboard with the service, from Sudoku and Solitaire to new versions of The Oregon Trail and a streamlined version of NBA 2K21. But all seem to suit the casual audience Apple originally planned the service around – and releasing their games on Apple Arcade seems to suit these games' developers, too, who don't have to include microtransactions or split the game into free and paid versions.",
    "\"For me as an artist this means i can go back to focusing more on just making great games nd players can go back to just experiencing without disruptions, without 'bad company snooping,' and without he pressure to spend more money,\" game creator Zach Gage said in a group interview. Four of his games, including Really Bad Chess and SpellTower Plus, were among the 32 games just added to Apple Arcade.",
    "Prior to this huge batch, Apple had added new games to the service in small drops. A trio of games added in August 2020 showcased Apple Arcade’s persisting strengths, and their development process gives insight into why we haven’t seen the directional shift toward adding more higher-engagement titles to Arcade’s library, as was reported back in July 2020.",
    "The three new games released in August 2020 came from well-known developers and publishers. The first to arrive on the service is even based on a very popular IP – Game of Thrones: Tale of Crows, an idle narrative game from Devolver Digital. The other two come from studios with similar pedigrees: Next Stop Nowhere was made by Night School Studio (Oxenfree), while The Last Campfire comes from Hello Games (No Man’s Sky).",
    "TechRadar briefly sat down with teams from all three games to chat and discuss how they fit what Apple was looking for in Arcade titles - and shed light on why other games don’t.",
    "Broadly, all three slower-paced games that rely on narrative and stylized visuals rather than fast action and twitchy response time. That makes them suitable for the touch controls on iPhones and iPads, the remote for Apple TV, or mouse/touchpad on Macs (though all Apple operating systems support PS4 and Xbox One controllers, some subscribers likely won’t go through the trouble). And the simpler controls make the games easier for younger players to pick up - players, like children or friends, who don’t have to pay for the games if they’re linked up to a subscriber’s family plan.",
    "These are existing perks of Apple Arcade - but other principles of the service guided the games, too.",
    "Game of Thrones: Tale of Crows, for instance, was conceived as an idle game before Devolver Digital approached Apple to include it in Arcade. But the service’s no-microtransactions let the game’s creator Jake Hollands craft it as a seamless experience without worrying about intrusive monetization alerts - and unlike other idle games, Tale of Crows has an ending.",
    "“The core idea was to make it a ‘healthy’ idle game that takes this style of gameplay and uses it in a way that can fit the player’s life, as opposed to trying to just keep them hooked constantly on the screen,” Hollands said.",
    "As a result, Tale of Crows is low-key, even meditative - and set 8,000 years before the characters and events from the show, we found it gave players enough distance from the divisive HBO series while retaining the flavor of its fantasy universe. And with the Telltale game series cancelled years ago, it’s one of the only Game of Thrones media (aside from George R.R. Martin’s supplementary books) to come out in years. As an exclusive on Apple Arcade, it’s a win for the service.",
    "Next Stop Nowhere from Night School Studio, the second of the trio, is also exclusive to Apple Arcade, though it’s fair to say that the developer’s house style - free-flowing conversations while exploring to further the story, as pioneered in the indie hit Oxenfree and follow-up Afterparty - fits Arcade so well that it’s no wonder Apple warmly received Night School’s pitch for a new game.",
    "“I was fairly dubious that a premium game could still survive in this world,” said Sean Krankel, co-founder of Night School Games. But then the studio’s debut title that started on PC, Oxenfree, hit iOS - and reached a new audience. “We weren’t just hitting art house gamer people and horror gamer people, but now on iOS we’re reaching tweens who read creepypasta and a much broader audience. This space game that we’ve been kicking around would be a good fit [for Apple Arcade], especially if we don’t need to cram in monetization hooks that we frankly are not good at.”",
    "Krankel describes the ‘space game’ Next Stop Nowhere as a classic American road trip set amongst the stars, following courier Beckett and companion Serra as they drive a ‘space Winnebago’ through the cosmic expanse on a search for the latter’s son. Conversations and player choices change the arc of the plot, but it’s easy to play on any of Apple Arcade’s devices. The only real change Night School made designing for the service? Make players feel comfortable taking a break every ten minutes or so.",
    "“Whereas our other games, you don’t know when to stop - you just lean back and play for an hour, but this we semi-intentionally made it feel like there’s really chapter caps,” Krankel said.",
    "In other words, bite-sized chunks - which are a hallmark of other Apple Arcade games. They’re easier to experience on devices that owners multitask with, flipping back and forth from the game to other apps.",
    "The final new Apple Arcade game of the trio, The Last Campfire by Hello Games, isn’t exclusive to the game service - it also launched on every modern console and PC the same day it arrived on Arcade. But the game was built with mobile in mind from the jump. Before No Man’s Sky, the studio grew on its indie platformer Joe Danger games, eventually releasing Joe Danger Infinity on iOS in 2014.",
    "Hello Games’ Steven Burgess had tackled the iOS version of Joe Danger, and had been tinkering with an idea for another game while the studio worked on the hit No Man’s Sky. Apple approached Hello Games sometime in 2018 asking for titles that might fit Arcade, and the end result of those talks brought Burgess’ project The Last Campfire to the gaming service. It’s perhaps no coincidence that Apple chose a game that had integrated touch controls from its inception.",
    "“We wanted the controls [in The Last Campfire] to feel native so we started on touch controls from basically day one - the very first builds five years ago were on an iPad and iPhone,” said Sean Murray, Hello Games cofounder. The game supports controllers, of course, and after decades of using them gamers have the muscle memory to navigate with physical joysticks - but not so much with touchscreens. “We started to build the game around what felt intuitive. We wanted it to feel like you’re reaching into the screen and turning a lever.”",
    "In The Last Campfire, players control the cute tunic-wearing Ember through a series of puzzles and lush environments to get them home. The vibe, Murray explained, was like wandering into the woods and then trying to return as dusk falls.",
    "With intuitive touch controls, stylized visuals, and a resonant theme, The Last Campfire feels emblematic of most of the titles that Apple has selected for its gaming service. As Murray recalls of the 2018 meeting when the tech giant explained Apple Arcade, “they wanted creatively-led premium experiences native to the device,” Murray said.",
    "But of course, that can all change.",
    "These three games represent Apple Arcade’s present, but not necessarily its future. Apple approached the studios behind these three titles at various points in 2018, the service went live in September 2019, and these games arrived on Arcade in the last few weeks.",
    "In other words, we haven’t begun to see the change in strategy Apple reportedly made in mid-April, when it allegedly cut some contracts for titles slated for the service (including some mid-development), according to a Bloomberg report published in July. The tech giant reportedly felt the cut games wouldn’t be engaging enough, and that Apple would be seeking titles on Arcade like the lauded Grindstone that hooked players and kept them coming back.",
    "Anyone who’s played Grindstone can attest to its engagement: the novel puzzle game centers around killing like-colored enemies in sequence to rack up big combos, with plenty of items to spare. But anyone versed in free-to-play games can see how easily Grindstone could include in-app monetization: there’s in-game gems and consumable health items that feel tailor-made for players to drop real-life money to buy. It’s so apparent that it seems like the game would have released with in-game purchases had Apple not come calling.",
    "In other words, part of what’s so engaging about Grindstone’s gameplay loop overlaps heavily with addictive loops that free-to-play games deploy to get players spending real money on in-app purchases.",
    "There’s nothing preventing Apple from adding more games to Arcade that use such gameplay loops to keep players subscribed to the service without betraying Arcade’s no-monetization policy.",
    "But it does seem to go against Apple Arcade’s philosophy of ‘creatively-led premium experiences’ that define Game of Thrones: Tale of Crows, Next Stop Nowhere, and The Last Campfire - games that, like many single-player titles that make up Arcade’s library, are involved single-player experiences that are slower, more meditative, and have no Grindstone-like engagement loop.",
    "It’s hard to tell how much Apple may swerve away from this model - especially since it took two years for these games to hit Arcade after they were approached by the tech giant. It could be months or years before we see the service finally add the type of engaging games it’s reportedly seeking. In the meantime, we’ll likely see more games that follow Apple Arcade’s original vision - and give the impression that Apple is staying the course."
  ],
  "headers": {
    "3": "Apple Arcade continues its developer appeal",
    "22": "Apple Arcade’s future"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
    "added": "https://www.techradar.com/news/apple-arcade-adds-30-new-games-including-fantasian-monument-valley-and-chess",
    "reported": "https://www.techradar.com/news/apple-arcade-games-could-see-a-dramatic-shift-to-retain-subscribers",
    "gave players enough distance": "https://www.techradar.com/news/cant-wait-for-the-game-of-thrones-prequel-in-2022-a-new-apple-arcade-game-scratches-that-itch",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2020-06-30/apple-cancels-arcade-games-in-strategy-shift-to-keep-subscribers?sref=9hGJlFio"
  }
}