{
  "source": "https://www.techradar.com/news/nokia-and-google-partner-on-cloud-native-5g-app-development",
  "title": "Nokia and Google partner on cloud-native 5G app development",
  "category": "computing",
  "updated": "2021-01-15T11:45:09Z",
  "author": "steve-mccaskill",
  "summary": "Two companies expand their 5G cloud partnership",
  "article": [
    "Google Cloud and Nokia are expanding their partnership to co-develop cloud-native 5G core technologies.",
    "The ultrafast speeds, enhanced capacity and ultra-low latency of 5G will allow mobile networks to power mission-critical applications for the first time and allow for the creation of entirely new use cases.",
    "However, this requires operators to rearchitect networks away from centralised, legacy core infrastructure and towards the cloud. By virtualising network functions, operators can rollout new services more rapidly, dynamically allocate resources to where they are most needed, and bring processing capabilities closer to the point of collection.",
    "This combination of cloud-based cores and edge computing promises to transfer consumer experiences and transform industries, while also reducing the need for businesses to invest in on-site-infrastructure.",
    "It is hoped the combination of Nokia’s core and network management technologies and Google’s AI, machine learning and analytics capabilities, will allow operators and large enterprises to deploy cloud-native applications at the network edge.",
    "Applications can also run on public and private clouds as well as on operator infrastructure, with Google’s Anthos for Telecom acting as the platform for deployment. Massive IoT projects will benefit from zero-touch deployments, while operators will have access to advanced billing capabilities that allow them to maximise revenue opportunities.",
    "“In the past five years, the telecom industry has evolved from physical appliances to virtual network functions and now cloud-native solutions,” said Ron Haberman, CTO of cloud and network services at Nokia. “Nokia is excited to work with Google Cloud in service of our customers, both CSPs and enterprise, to provide choice and freedom to run workloads on premise and in the public cloud. Cloud-native network functions and automation will enable new agility and use-cases in the 5G era.”",
    "“Communications service providers have a tremendous opportunity ahead of them to support businesses’ digital transformations at the network edge through both 5G connectivity and cloud-native applications and capabilities,” added George Nazi, VP, Telco, Media & Entertainment Industry Solutions at Google Cloud.",
    "“Doing so requires modernized infrastructure, built for a cloud-native 5G core, and we’re proud to partner with Nokia to help the telecommunications industry expand and support these customers.”",
    "Nokia itself is migrating the entirety of its on-premise IT infrastructure to Google’s cloud in the hope that the operational and cost efficiencies generated will support its pursuit of the 5G equipment market. As part of this transition, it will shut down its private data centres within the next two years.",
    "The Finnish telecoms equipment manufacturer is also working with Microsoft on joint products for enterprises and operators with a focus on digital transformation initiatives."
  ],
  "headers": {
    "3": "Nokia Google Cloud"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}