{
  "source": "https://www.techradar.com/news/global-computer-chip-shortage-could-last-for-months",
  "title": "Global computer chip shortage 'could last for months'",
  "category": "computing",
  "updated": "2021-04-26T14:12:16Z",
  "author": "mayank-sharma",
  "summary": "Market needs 12 to 18 months to recover says Cisco CEO",
  "article": [
    "Chairman and CEO of networking giant Cisco, Chuck Robbins, has said the shortage of computer chips might last for most of this year.",
    "The shortage of chips, which is now affecting the biggest semiconductor users across all industries, reportedly first surfaced in the fourth quarter of last year.",
    "The chip shortage was heightened by the coronavirus pandemic. At first, many vendors cut their orders for chips, thinking demand would fall, people delayed or abandoned purchases because of economic concerns, which led suppliers to reduce capacity.",
    "However, demand for consumer electronics rose during the pandemic. But by that time pandemic-enforced manufacturing unit shutdowns virtually froze the supply of chips.",
    "Even as the restrictions eased, other factors worsened the problems. In particular, the severe drought in Taiwan, which forced the country to divert water supply from several industrial areas, including one that is a hub of semiconductor manufacturing, meant demand far outpaced the supply of chips leading to the current predicament.",
    "Robbins’ views echo that of Qualcomm’s new CEO, as well as of Micron’s, both of whom also don't see the situation improving before the end of 2021.",
    "As per estimates by the US-based Semiconductor Industry Association, about 75% of global manufacturing capacity is in East Asia, with Taiwan's TSMC and South Korea's Samsung being the dominant players.",
    "To counter that imbalance, New Intel CEO Pat Gelsinger has revealed plans to invest $20 billion in two new chip making factories.",
    "\"The providers are building out more capacity. And that'll get better and better over the next 12 to 18 months,\" suggests Robbins.",
    "However, in a strange turn of events, the global semiconductor supply crunch is also being felt by manufacturers of chip making equipment. According to latest reports, wait times for specialized equipment now extend up to a year.",
    "While on the face of it the chip shortage might seem like a demand-and-supply problem, the issue has created blockades throughout the manufacturing process, which as the top bosses point out will take time to normalize.",
    "Via BBC"
  ],
  "headers": {
    "5": "Time to heal"
  },
  "links": {
    "Cisco": "https://www.techradar.com/news/cisco-is-inching-closer-towards-an-it-as-a-service-model",
    "Qualcomm’s new CEO": "https://www.techradar.com/news/incoming-qualcomm-ceo-warns-chip-shortage-wont-ease-until-end-of-2021",
    "Micron’s": "https://www.techradar.com/news/industry-chief-warns-severe-dram-shortage-wont-be-ending-any-time-soon",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "new chip making factories": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "wait times for specialized equipment": "https://www.techradar.com/news/the-global-chip-shortage-has-created-a-shortage-ofchipmaking-machines",
    "BBC": "https://www.bbc.com/news/technology-56847518"
  }
}