{
  "source": "https://www.techradar.com/news/industrial-3d-printing-giant-markforged-announces-merger-goes-public",
  "title": "Industrial 3D printing giant Markforged announces merger, goes public",
  "category": "computing",
  "updated": "2021-02-25T11:34:24Z",
  "author": "mike-moore",
  "summary": "Markforged joining with one SPAC as it looks to go public",
  "article": [
    "Top 3D printer firm Markforged has announced plans to go public following a merger with special purpose acquisition company (SPAC) one.",
    "The new merged entity, which will be known as MKFG on the NYSE, will have an estimated post-transaction equity value of approximately $2.1 billion at closing.",
    "Since its foundation in 2013, Markforged has looked to promote the use of 3D printing technology in manufacturing and industrial use cases, working across a range of verticals that includes industrial automation, aerospace, military and defense, space exploration, healthcare and medical and automotive.",
    "Markforged says its products are already in 10,000 facilities across 70 countries, and it has printed more than 10 million parts across the entire product development lifecycle, from R&D to aftermarket repair.",
    "It adds that it wants to combine 3D printing with industrial-grade materials and cloud-based machine learning software as it aims to offer manufacturers an efficient and cost-effective industrial stack, as well as more resilient and agile supply chains.",
    "This includes a new Markforged industrial-grade process that replaces traditionally manufactured plastic, steel and aluminum end-use parts with both easy-to-print metal alongside its own proprietary continuous Carbon Fiber Reinforced (CFR) composites.",
    "The deal, set to complete in summer 2021, looks to take advantage of the continued growth of the additive manufacturing industry, which has grown from $2 billion in 2012 to an expected $18 billion in 2021, and it is projected to reach $118 billion in 2029.",
    "“Our mission and vision are to reinvent manufacturing by bringing the power and agility of connected software to the world of industrial manufacturing. Today is a pivotal milestone as we progress towards making that vision a reality,” said Shai Terem, President and CEO of Markforged.",
    "“We’ve been at the forefront of the additive manufacturing industry, and this transaction will enable us to build on our incredible momentum and provide capital and flexibility to grow our brand, accelerate product innovation, and drive expanded adoption among customers across key verticals.\"",
    "\"We’re focused on making manufacturing even better by capitalizing on the huge opportunity ahead, and we are making this important leap through our new long-term partnership with Kevin Hartz and the entire team at one, a group of seasoned founders and operators with unparalleled experience. Their expertise and guidance will be invaluable as we continue to reinvent manufacturing today, so our customers can build anything they imagine tomorrow.”"
  ],
  "headers": {
    "3": "3D printing growth"
  },
  "links": {
    "3D printer": "https://www.techradar.com/best/best-3d-printers",
    "3D printing": "https://www.techradar.com/deals/3d-printer-deals-get-the-best-price-on-a-3d-printer-for-black-friday-2020"
  }
}