{
  "source": "https://www.techradar.com/news/redfall-trailer-gameplay-release-date-and-more",
  "title": "Redfall trailer, gameplay, release date and more",
  "category": "gaming",
  "updated": "2021-11-05T15:15:52Z",
  "author": "rhys-wood",
  "summary": "Vampiric action is coming to Xbox",
  "article": [
    "Redfall is a newly announced IP from Arkane Studios, first announced during E3 2021. There's still quite a lot we have to learn about the game but the trailer depicted four player characters battling vampires in a post-apocalyptic town setting, doused in a delightful retro horror aesthetic.",
    "Redfall is currently slated for a summer 2022 release and when it arrives it'll be an Xbox console exclusive, landing on Xbox Series X/S, PC and on Xbox Game Pass from day one. Xbox One was absent from the list of available platforms at the end of the trailer, meaning that Redfall could firmly be a current-gen title.",
    "While not much is currently known about Redfall, we'll be sure to update you on all the news about this upcoming co-op shooter as it lands.",
    "[Update: Images claimed to be from a Redfall playtest might give us a better idea of what to expect from the game. Read on to find out more.]",
    "While Redfall's debut trailer was a lovely bit of CG goodness, there's currently no gameplay footage to speak of. But judging by the scenes shown in the trailer, we can piece together some semblance of what we can expect from the Redfall in 2022.",
    "Redfall's debut trailer gave us the tentative release window of \"Summer 2022.\" At this point, expect the game to release anytime between June and September 2022, not accounting for any delays that could potentially take place as development continues.",
    "That said, it's possible that Redfall has already been in development for at least a couple of years. A few years back, a trademark dispute between Zenimax (Bethesda's parent company) and author Jay Falconer brought the name \"Redfall\" to light.",
    "Back then, Redfall was theorized to be the subtitle for The Elder Scrolls 6, due to the name being similar to both Daggerfall (a kingdom in The Elder Scrolls' setting of Tamriel) and the series' Redguard race.",
    "Redfall's official website describes the game as \"an open-world co-op shooter,\" and will be played from a first-person perspective. The trailer introduced four different characters who we'll likely get to play as.",
    "The main form of offense looks to be the firearms the characters are using, but each of the four heroes look to have unique abilities of their own, similar to the Borderlands series.",
    "The website states that Redfall will blend \"single and multiplayer options seamlessly, allowing the player to venture into the darkness alone or squad-up with up to three friends for four-player co-op.\"",
    "The use of the word \"seamlessly\" implies that a drop-in co-op system could be implemented in Redfall, which would allow players to join someone else's game without needing to back out to the main menu.",
    "Redfall looks to be embracing players who prefer solo play, with the official website stating you can choose to build your characters around playing alone. If you were worried about not being able to party up with friends in Redfall, it sounds like Arkane has you covered.",
    "Lastly, Redfall's website states that the game's open world will be \"ever-changing,\" and will be a \"setting that reacts to your choices and actions.\" It looks like Arkane's fondness for moment-to-moment gameplay and choices will bleed into Redfall, too, and we're curious to see just how far-reaching our personal decision-making will become in the final game.",
    "Redfall's website gives us a brief synopsis of the game's story, setting and the larger-than-life characters that inhabit the world.",
    "The vampiric enemies of the game are actually science experiments gone wickedly wrong. These creatures have cut off the town of Redfall from the rest of the world by blocking out the sun.",
    "The vampires are joined by a human faction that worships them, as was seen in the debut trailer. As such, it looks like firefights will often have us dealing with both enemy types - and perhaps a few more - at once.",
    "Our main characters are Devinder Crousley, Layla Ellison, Jacob Boyer and Remi De La Rosa. All have wildly different personalities and will most likely play very differently from one another. We'll be interested to see how these characters bounce off each other in the final game.",
    "In-game images reportedly leak online",
    "Images claimed to be leaked from a Redfall playtest have appeared online (via IGN), possibly giving us a better idea of what to expect from the game.",
    "The leaker claims that the game will step into the looter-shooter genre, with influence from Borderlands while incorporating elements from Arkane’s own Dishonored games. According to the leaker the test had six pre-made playable heroes (we only know of four thus far) and that these heroes “each have unique abilities which are reminiscent of those found in games like Dishonored” and these abilities “are improved via exp from kills and missions“",
    "They describe the game as “An open-world Hero-based looter shooter with co-op and solo play, with various forms of missions around the world as well as fast travel and safehouses. Very Borderlands-esque.”",
    "The leaker and images also points to characters being able to carry up to three weapons at a time, with there being “potentially 5 tiers” of weapons and those in the higher tiers appearing “to come with additional perks such as increased accuracy or higher damage.”",
    "Any leaks should, of course, be taken with a pretty large pinch of salt. It’s also worth pointing out that even if these images are real, what we see from them now and what’s actually released in 2022 could change a great deal."
  ],
  "headers": {
    "4": "Cut to the chase"
  },
  "links": {
    "Redfall": "https://www.techradar.com/news/arkane-austins-new-game-redfall-brings-vampires-in-summer-2022",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/the-best-games-of-pc-gaming-show-2021",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "trademark dispute": "https://www.techradar.com/news/the-elder-scrolls-6-redfall-naming-dispute-could-be-resolved-simply",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "appeared online": "https://www.reddit.com/r/redfall/comments/pm2v83/everything_we_know_from_the_redfall_screenshot/",
    "IGN": "https://www.ign.com/articles/redfall-images-playtest-leak-weapons-characters-loot"
  }
}