{
  "source": "https://www.techradar.com/news/has-the-ps5-dualsense-controllers-battery-life-gotten-worse-since-launch",
  "title": "Has the PS5 DualSense controller's battery life gotten worse since launch?",
  "category": "gaming",
  "updated": "2021-11-12T02:42:21Z",
  "author": "adam-vjestica",
  "summary": "Opinion: The PS5 DualSense's battery life can be a real drain",
  "article": [
    "I think the PS5 DualSense controller is the best gamepad Sony has ever made. Symmetrical analog stick placement aside, the PlayStation 5's clever controller continues to delight me with its innovative adaptive triggers and haptic feedback, even nearly a year after launch.",
    "However, one sticking point that I have with the DualSense controller is its mediocre battery life. It's never been able to rival the likes of the Xbox Series X controller, which can use AA batteries or a 'play and charge' pack. But, I am concerned that it might have gotten worse.",
    "During TechRadar's PS5 review in November 2020, I performed an unscientific test to monitor the DualSense controller's battery life. Using my phone's stopwatch, I'd punch start when playing a game and proceeded to stop the clock whenever I turned the PS5 off.",
    "Using this admittedly rather crude method, I recorded the PS5 DualSense controller lasting an impressive 12 hours when flicking between Marvel's Spider-Man: Miles Morales and the exceptional Astro's Playroom, which was a welcome surprise after the pitiful battery life of the DualShock 4 controller.",
    "However, in the last few months, I've noticed the 'Wireless Controller battery is low' prompt popping up far more frequently – to such an extent that the idea of hitting those heady heights of ten plus hours of battery life feels like an impossibility now.",
    "Arkane Studios' fabulous Deathloop – a game that uses the DualSense controller's adaptive triggers and haptic feedback quite liberally – has only served to increase this concern. My play sessions have been rudely interrupted by the now all-too-familiar battery level prompt on numerous occasions, even though I've only hit six hours of playtime at most.",
    "So has the DualSense controller's battery gotten worse over time? Well, the controller has received several updates since launch, but nothing significant of note.",
    "The simplest explanation, then, is that the games I initially tested likely don't drain the battery life as much as newer PS5 titles might. But that still wouldn't explain the massive disparity between hitting six hours of battery life and the previous double figures I recorded.",
    "Returning to the old stopwatch method, I decided to time the DualSense's battery life once again. I flicked back and forth between The Medium, Deathloop, and Sackboy: A Big Adventure throughout a weekend and did some other non-gaming tasks, too: watched YouTube, browsed the PlayStation Store, and left the controller idle.",
    "It's worth noting that my settings on the controller have remained unchanged since launch – the haptic feedback and the lightbar are all on 'Standard' – and I usually alternate between using the PS5 Pulse 3D Wireless Headset plugged into the controller and wirelessly.",
    "It took less than an hour for the first bar of the DualSense's three-bar indicator to disappear – around 53 minutes, to be exact, which was worrying. By the time I'd reached the five-hour mark, only a single battery bar was showing, and by the time six hours had passed, the prompt to charge my controller appeared.",
    "Now, as someone who generally tends to listen to the advice of their devices (surely they know best after all?), I usually switch to a new gamepad whenever this prompt appears.",
    "However, the repercussions of this now commonplace scenario have led me to believe that my PS5 DualSense controllers have 50% less battery life than I previously recorded, which is pretty dire. The reality, though, is a lot different.",
    "What I discovered during my second round of testing is that, while yes, some games do drain the DualSense quicker than others, it's Sony's low battery life prompt that is making things seem worse than they are.",
    "I've found that the low battery life indicator will appear around the six-hour mark, but you comfortably get to nine to 10 hours of playtime before the controller dies. In my book, that's an incredibly early warning from Sony, especially as Microsoft's controller tends to warn you when you have around 15 minutes of juice left.",
    "So what's the solution? The most obvious fix, it seems, is for Sony to change the low-level battery alerts to be more reflective of when the controller is about to run out of charge. And if you want to squeeze out some more battery life from the DualSense controller overall, you can always turn down the intensity of the haptic feedback, adaptive triggers, and the controller's light bar.",
    "To make life easier, I'd also recommend picking up the PS5 DualSense Charging Station Dock, which lets you switch pads at a moment's notice if you have a spare to hand. It's also a much more attractive solution than having a USB cable trailing from the front of your console.",
    "Though the DualSense controller's battery will inevitably degrade slowly over time – as all built-in lithium-ion batteries do – it seems that my initial fears may have been overblown. At least, for now."
  ],
  "headers": {
    "6": "Charge it up",
    "11": "Battery blues?",
    "15": "Stay charged and carry on"
  },
  "links": {
    "PS5 DualSense controller": "https://www.techradar.com/how-to/how-to-use-the-ps5-dualsense-controller-on-a-pc",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "PS5 review": "https://www.techradar.com/reviews/ps5",
    "Marvel's Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Astro's Playroom": "https://www.techradar.com/news/astros-playroom-will-make-you-fall-in-love-with-the-ps5-dualsense-controller",
    "DualShock 4 controller": "https://www.techradar.com/reviews/gaming/games-consoles/controllers/dualshock-4-controller-1157615/review",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "adaptive triggers and haptic feedback": "https://www.techradar.com/how-to/how-to-turn-off-ps5-adaptive-triggers-and-haptic-feedback",
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "Sackboy: A Big Adventure": "https://www.techradar.com/reviews/sackboy-a-big-adventure-review?region-switch=AU",
    "PS5 Pulse 3D Wireless Headset": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset"
  }
}