{
  "source": "https://www.techradar.com/news/gutenberg-101-should-provide-the-speed-upgrade-your-wordpress-site-needs",
  "title": "Gutenberg 10.1 should provide the speed upgrade your WordPress site needs",
  "category": "computing",
  "updated": "2021-03-08T11:01:53Z",
  "author": "mayank-sharma",
  "summary": "New Gutenberg 10.1 release will help make your pages load faster.",
  "article": [
    "The latest version of the WordPress Gutenberg editor has introduced several new changes including the ability to give your websites a ranking boost.",
    "Gutenberg has been the de facto editor of WordPress over the last few years, proving a welcome upgrade from the default TinyMCE editor used by the popular content management system (CMS) since its inception, and has now been demoted to a WordPress plugin.",
    "Nik Tsekouras, one of the core-developers of the Gutenberg editor announced the latest release particularly pointing to enhancements to major aspects and functions including widgets and navigation screens and global styles.",
    "Among the long list of changes in this release is a minor tweak that will reduce the code bloat, which will not just reduce page load times, but will also reportedly help improve Google’s ranking of the website.",
    "According to SearchEngineJournal (SEJ), Google is about to overhaul its ranking algorithm in May to promote websites that have a passing Core Web Vitals score. This new score is influenced by several factors, including the performance of a page.",
    "SEJ argues that by no longer loading every style code for each block on every page, the new Gutenberg release will help make WordPress websites more appealing to the new algorithm.",
    "Besides this change, the new Gutenberg 10.1 release also enhances the user experience for creating reusable blocks, polishes the Image block toolbar, in addition to several other user interface enhancements.",
    "Tsekouras also notes that the developers have ironed out over two dozen bugs and also continue to improve the plumbing for the full site editor, much like a website builder, that might debut later this year.",
    "Via: Search Engine Journal"
  ],
  "headers": {
    "3": "Faster page loads"
  },
  "links": {
    "WordPress": "https://www.techradar.com/reviews/wordpresscom",
    "content management system (CMS)": "https://www.techradar.com/best/cms",
    "WordPress plugin": "https://www.techradar.com/best/best-wordpress-plugins",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "later this year": "https://www.techradar.com/news/youll-soon-be-able-to-create-websites-with-drag-and-drop-in-wordpress",
    "Search Engine Journal": "https://www.searchenginejournal.com/wordpress-gutenberg-10-1-core-web-vitals/397910/amp/"
  }
}