{
  "source": "https://www.techradar.com/news/photoshop-vs-lightroom",
  "title": "Photoshop vs Lightroom: what's the difference and which is the best for you?",
  "category": "cameras",
  "updated": "2021-08-05T16:34:20.878Z",
  "author": "dave-stevenson",
  "summary": "Should you use Photoshop, Lightroom, or a bit of both?",
  "article": [
    "The Photoshop vs Lightroom conundrum is one of the most common causes of furrowed brows for anyone who's just starting out on their photo editing journey, but luckily we're here to help you choose the right tool for you.",
    "After all, knowing which tool is best suited to a job is the trademark of any skilled craftsperson. Are you the type of person to use a sledgehammer to crack a nut? An angle grinder to trim your nails? For photographers (amateur or otherwise), understanding how Lightroom and Photoshop differ – and how they can cooperate – can help smooth out your workflow, produce better images, and give you more time to do the thing you love. Which is taking photos, by the way, not slowly stewing in front of your computer.",
    "Here, we’ll spell out how Photoshop and Lightroom are different from each other, which tools and features are replicated, and where there are tools that produce similar results, but in often markedly different ways.",
    "If you’ve just started your Photoshop or Lightroom trial and don’t know where to start, this is the guide for you.",
    "At their hearts, Photoshop and Lightroom are image editors. Photoshop is the grandparent of the photo editing world – version one hit computers everywhere in 1990, while Lightroom arrived much later, in 2007. At the heart of Lightroom is a piece of code that you’ll also find in Photoshop; Adobe’s Camera Raw tool. It’s this that makes Lightroom such a powerful image editor.",
    "Slightly confusingly, Lightroom Classic – which is what we’re talking about here – differs a bit from what is now simply called Lightroom. Lightroom Classic is the full-fledged desktop application, complete with image editing, the catalogue and so on. Lightroom – without “Classic” appended to it – is a cloud application; great for those who want to edit on a tablet as well as a desktop or a phone. It’s less powerful, though, and those serious enough about their photo editing to be considering Photoshop as a photo editor should only really be thinking about Lightroom Classic – which is what we’re doing here.",
    "Photoshop and Lightroom Classic are both image editors, but they work in very different ways. Photoshop might have the word “photo” in its name, but over the years it’s grown from being a straightforward image editor to being an incredibly flexible program for illustration, page layout, video editing, animation and a few more things besides. That makes it almost outrageously powerful, particularly considering the price (more on that later), but it also means there are lots of tools that photographers will need either rarely, or in some cases, literally never.",
    "When it comes to editing photos, Photoshop is what’s known as a per-pixel editor. That means that while you can make changes to your image as a whole, you don’t have to. If there’s a single pixel you want to change, Photoshop will let you do that.",
    "Lightroom makes edits in much broader strokes – while it includes some per-pixel tools – a healing brush and a clone stamp, for example – its strength is generally in its ability to take an image and very quickly refine it. Lightroom also has some unbelievably powerful cataloguing and organizational tools – it could be argued that if all it included were these, it would still be worth the price of admission.",
    "Quite a bit. If you can imagine it, and you’re prepared to take the time to learn, you can do just about anything to a photograph that you can imagine using Photoshop.",
    "From a photography standpoint, the ability to create layers, including adjustment layers, is unbelievably useful, and a feature that seems unlikely to ever make it to Lightroom. The beauty of layers is they allow to carefully, invisibly, composite images together to create photorealistic effects, or to merge photographs with different subjects. They’re an incredibly powerful, flexible tool and one of the main reasons our images get round-tripped out of Lightroom.",
    "That’s not all, though. Photoshop also has a proper clone stamp tool (for cloning pixels in an image), complete with the ability to rotate the source of your cloning as you brush onto the image. And speaking of brushes, just about every mouse stroke you can make in Photoshop can be adjusted for size, weight, flow rate and opacity, meaning you can make changes to your images ranging from the almost infinitely subtle to the (literally) broadest of strokes.",
    "Indeed, one of Photoshop’s biggest strengths is that it provides a number of ways to skin just about any cat you can name. Exposure problems? You can load up the Adobe Camera Raw filter and make them there, or you can make your adjustments via the Levels panel. Or, you can create an adjustment layer and make changes there, using a clipping mask to determine precisely which bits of your image you want to change.",
    "This is just an example – Photoshop routinely allows you lots of different ways to get virtually any effect, allowing you to experiment endlessly to discover the look that suits you best. It takes a bit of experimentation and research, but Photoshop lets you edit images with an almost surgical level of precision. Speaking of which, if you want to isolate or cut out a subject from an image, placing it, say, on a new background, we can save you a Google – copying elements or selections from one image to another is a Photoshop-only trick.",
    "There’s also the small matter of proofing images before export. Soft-proofing is the practice of applying a filter to your image based on the printer and ink set you’re going to produce a hard copy with, allowing you to correct your image so it looks the same in your hand as it does on your screen. Lightroom added soft-proofing back in 2012, but it only supports soft-proofing on RGB devices – like inkjet printers. CMYK devices – commercial printers, for example – aren’t supported, limiting Lightroom’s soft-proofing prowess for those with ambitions beyond glossy holiday prints. Photoshop offers far more powerful soft-proofing tools.",
    "Finally, there’s interoperability with the Photoshop for iPad app. First released in rather hamstrung form in 2019, Photoshop for iPad has grown impressively with time, and now offers a pretty full-on set of tools. Layers, subject selection, brushes are all included, as well as interoperability with PSD files from the desktop version of Photoshop. If you have aspirations towards commercial imaging, Photoshop offers an almost unrivaled selection of tools and ways of working that Lightroom doesn’t compete with.",
    "Lightroom doesn’t need to compete with Photoshop, though, because it’s a completely different beast. If you want to start with a decent photograph, spend a few minutes editing it, and then export the final piece, Lightroom makes outstandingly light work of most mainstream photo editing jobs. It’s absolutely built for speed.",
    "It’s also absolutely built to make photographers’ lives easier. Photoshop doesn’t include any cataloguing tools whatsoever, so if you’re the kind of person whose photographs are spread across a bunch of external disks, randomly scattered across your hard disk and in folders called “Sort me today” on your desktop, it can’t help at all. The closest photographers had to a proper cataloguing application for years was Bridge, which instantly became second-best when Lightroom came along.",
    "With Lightroom, the physical location of a file doesn’t matter – Lightroom brings them all into the Library view irrespective of what disk they’re on. From there, you can sort images by folder, or you can arrange images into virtual collections for easy recall. Lightroom also makes searching via metadata easy – if you want to find all images shot on a particular camera, or lens, or aperture value, or shutter speed (the list goes on for quite some time) – you can do so in seconds.",
    "Once you get in the habit of keywording and captioning your images, Lightroom is also incredibly quick at plain text searches, so you can quickly find the images you tagged with a name, or a place, and so on. This almost-instant recall of images – particularly once you get your Lightroom catalogue into the hundreds of thousands – is incredibly valuable and a real time-saver.",
    "Lest we forget, Lightroom also edits images. It’s not so much for the nitty-gritty of commercial image production, so its editing tools skew towards whole-image fixes – it’s got curves and levels tools, as well as things like exposure and white balance. In fact, all its tools can be found in Photoshop’s Adobe Camera Raw plugin. There are a few nice touches – lens profiles are baked in, allowing you to automatically correct an image based on the lens you used to shoot it; there’s also a Color Grading panel, allowing you to shift the hue of the shadows, mid-tones and highlights of an image.",
    "Last but not least – by a long way – is Lightroom’s batch-processing powers. Photoshop can automate certain jobs courtesy of the Actions tool, but nothing soars through repetitive processing or exporting work like Lightroom. You want 2,000 pictures all set to the same white balance? Lightroom can do that. You’ve got a favorite way of processing your images and you want every picture you import to get the same treatment? Lightroom can do that, too. Ditto for export – if you want every image to have the same resolution, or JPEG compression ratio, Lightroom can do it irrespective of how many images you’re working with.",
    "Yes. Without a shadow of a doubt, whether or not you want to use Lightroom to edit your images, you should absolutely be using it for cataloguing and organizing your library. You’ll never need to scratch your head as to the whereabouts of an image again. Mind you, you’ll quite possibly find that for most of your images – perhaps all of them – Lightroom provides all the processing and developing power you’ll never need.",
    "Still, for those times when an image produces an itch that Lightroom just can’t scratch, Photoshop will always be there for you. To that end, Lightroom provides a graceful way of round-tripping an image to Photoshop – right-click an image, choose 'Edit in Photoshop' and your shot will be exported and opened in Photoshop, as a PSD where you can edit it as normal.",
    "Once you’re done, hit save and the image will be reimported into your Lightroom library, from which point you can either edit it some more or simply have it in your collection ready for export later. Of course, you can always open your PSD (Photoshop file) later to continue editing it. The system works really well and is great for those times when Photoshop is the only tool that does the job.",
    "Better yet, if you do see the sense in using Lightroom and Photoshop as part of your editing ecosystem, you won’t break the bank. Adobe’s Photography Plan for Creative Suite includes Lightroom, Lightroom Classic, Photoshop, Photoshop for iPad and 20GB of cloud storage. Bear in mind that Photoshop used to cost about $500 / £500 to buy standalone and suddenly Adobe’s subscription model starts to look actually appealing.",
    "Even when they were totally different products, the 'Photoshop vs Lightroom' conundrum was never really an either/or proposition. There were always things that Photoshop did better than Lightroom (per-pixel editing, subject selection and cutouts, layers, masks), and things Lightroom did better than Photoshop (batch processing, cataloguing, keywording and captioning). So the question of which is best for you is possibly answered with, 'both'!",
    "That said, it’s good to be thoughtful about the job you’re trying to do. If an image needs basic exposure, curves or saturation changes, Lightroom will – generally – do just as good a job as Photoshop, in (probably) less time, and will be more graceful in terms of how it treats your edited image afterwards. No more files with names like 'IMG0349_EDIT_FINAL_FINAL2_EXPORTED.JPG'.",
    "On the other hand, if you have 40 images of the Milky Way and you want to stack them to reduce noise, that’s the kind of in-depth, power-hungry job that Lightroom just can’t touch, and Photoshop will be your best bet. If for no reason other than the fact that the tools you’ll want to use simply don’t exist in Lightroom.",
    "You might also find some jobs benefit from different approaches – Lightroom allows you to paint on sharpening, for example, using the brush tool, but Photoshop provides far more ways to skin that particular cat, so the more you learn about image editing, the more likely you are to appreciate how Photoshop gives you lots of ways to do the same job.",
    "And with Lightroom able to gracefully round-trip images to Photoshop and then invisibly re-import them for future editing or export, there’s no reason not to use both."
  ],
  "headers": {
    "9": "What can you do in Photoshop that you can't do in Lightroom?",
    "16": "When should you use Lightroom instead of Photoshop?",
    "22": "Should I use both Photoshop and Lightroom?",
    "26": "Photoshop vs Lightroom: which is the best for me?"
  },
  "links": {
    "Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021",
    "Lightroom": "https://www.techradar.com/reviews/adobe-photoshop-lightroom-cc",
    "Photoshop for iPad": "https://www.techradar.com/reviews/photoshop-for-ipad"
  }
}