{
  "source": "https://www.techradar.com/news/google-accused-of-hiding-privacy-settings-from-smartphone-users",
  "title": "Google accused of hiding privacy settings from smartphone users",
  "category": "computing",
  "updated": "2021-05-31T11:24:46Z",
  "author": "mayank-sharma",
  "summary": "Google pressures everyone from device vendors to third-party apps, documents claim",
  "article": [
    "Google not only made it difficult for smartphone users to keep their location data private, but that it was a conscious decision that came down the company’s hierarchy, a set of unredacted internal Google correspondence has appeared to show.",
    "According to Business Insider, the documents were filed as part of a lawsuit brought by Arizona’s Attorney General Mark Brnovich in May 2020 that accused Google of illegally collecting location data from smartphone users despite their lack of consent.",
    "A judge recently ordered new sections of the filed documents to be unredacted in response to a request by groups aiming to bring Google's data collection malpractices to the fore.",
    "The documents reportedly suggest that Google kept collecting location data even after users had explicitly turned off location sharing, while at the same time making privacy settings difficult for users to find.",
    "Business Insider adds that the documents reveal how Google pressured phone manufacturers to keep the privacy settings hidden because these were being frequently accessed by users.",
    "When Google tested versions of Android that made privacy settings easier to find, the company reportedly viewed it as a “problem” when users exercised the option to take charge of their privacy.",
    "Google also apparently worked out its problem by burying those settings deeper within Android.",
    "The unredacted documents show how Google employed a variety of ways to collect user location data including extra permissions for using certain third-party apps.",
    "In a spectacular revelation, Jack Menzel, a former vice president who oversaw Google Maps, deposed that the only way Google wouldn't be able to figure out a user's home and work locations is if that person intentionally threw Google off the trail by setting their home and work addresses as some other random locations.",
    "A Google spokesperson dismissed the charges calling it an attempt by their competitors to \"mischaracterize our services,\" in an email to The Verge.",
    "Via The Verge"
  ],
  "headers": {
    "4": "What privacy?"
  },
  "links": {
    "smartphone": "https://www.techradar.com/news/best-phone",
    "part of a lawsuit": "https://www.techradar.com/news/google-accused-of-illegally-tracking-android-phone-users",
    "privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "The Verge": "https://www.theverge.com/2021/5/29/22460070/google-difficult-android-privacy-settings-arizona"
  }
}