{
  "source": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
  "title": "The Suicide Squad is refreshingly ridiculous – but too chaotic for its own good",
  "category": "entertainment",
  "updated": "2021-08-06T09:09:05Z",
  "author": "axel-metz",
  "summary": "Too much of a good thing",
  "article": [
    "James Gunn was recently quoted as saying today’s \"mostly boring” superhero movies have left audiences clamoring for something different – and there’s certainly some truth in that sentiment.",
    "Save for the director’s own Guardians of the Galaxy movies – and outliers like Birds of Prey and Zack Snyder’s Justice League – the comic book-led productions of recent years have arguably been hampered by stylistic conformity and the need to build themselves into wider studio projects.",
    "It’ll come as no surprise, then, to learn that Gunn’s The Suicide Squad is anything but boring, borrowing the best parts of its obvious inspirations to form an unashamedly ridiculous antihero adventure which is as unexpected as it is hilarious.",
    "But The Suicide Squad also falters under the weight of its own personality, trading a relentless commitment to style and humor for the streamlined storytelling and emotional impact that have made its comic book contemporaries so popular.",
    "As for where Gunn’s take on the supervillain group sits in the DC Extended Universe (DCEU), The Suicide Squad is a standalone sequel to David Ayer's 2016 movie of the (almost) same name. So, while the plot takes place in the same world as the first Suicide Squad adventure, this is an independent project bearing little reference to its predecessor.",
    "A handful of familiar DC faces return from the first instalment – including Harley Quinn, Rick Flag and Amanda Waller – but Gunn introduces a huge number of quirky DC characters to the live-action screen for the very first time, with obscure Superman villain Bloodsport (Idris Elba), Peacemaker (John Cena) and King Shark (Sylvester Stallone) among the most notable additions.",
    "This new-look Task Force X is deployed to the fictional island of Corto Maltese to destroy Jotunheim, a Nazi-era laboratory which also happens to be home to a giant, telepathic alien starfish known as Starro, another DC supervillain making their live-action debut.",
    "The plot, though, is entirely superfluous. Instead, the mission is a deliberately outlandish vehicle for the chaos that ensues the moment the team touchdown on the island – and that’s a great thing for everyone involved. The Suicide Squad doesn’t waste time giving reasons for its existence or laying the groundwork for future movies, which gives its director – and more importantly, its audience – the freedom to have fun from the get-go.",
    "And make no mistake, The Suicide Squad is a good time. An R rating means blood, gore and profanity are in abundance here, with Gunn’s trademark humor ramped up to the max thanks to some obvious parallels between characters like Peacemaker and Drax, or King Shark and Groot. The likes of John Cena and Pete Davidson keep proceedings suitably stupid – don’t expect all that much wit, rather heaps of toilet humor and one-upmanship – but it all works to the benefit of the movie’s no-holds-barred attitude.",
    "That silliness seeps into The Suicide Squad’s general aesthetic, too. Zack Snyder’s influence is evident in Gunn’s camerawork and editing choices, with excessive slow-mo shots and an often-incongruous soundtrack – think Johnny Cash and Queen – more akin to Army of the Dead than any superhero adventure we’ve seen before (Guardians of the Galaxy notwithstanding).",
    "The special effects in use throughout are also exceptional. Crumbling buildings and exploding heads appear as real as they ever have done on film, and it’s rare that a project so reliant on CGI never seems so. Reports suggest Gunn was handed $175 million and a blank canvas to play with, including the freedom to kill whoever he wanted, however he wanted. Unlike Ayer’s preceding movie, the investment pays dividends here.",
    "All that said, The Suicide Squad also suffers because of its craziness. If ever there were a movie which encapsulates the saying ‘too much of a good thing’, it’s this one.",
    "Gunn tries so many different ideas in such a short time, both stylistically and tonally, that he’s unable to make us care about the rising body count or establish any meaningful stakes. The consequence is less immediate when it comes to the muddling styles – it’s fun, at least, to watch a director juggle those Snyder-esque sequences with seemingly random bouts of animation and color – but the movie lacks any emotional substance because it's just so damn busy.",
    "In fairness, this comes primarily from the sheer size of its cast. By including so many wacky characters, Gunn is forced to rush the exposition behind both their powers and motivations, which ultimately sells them short. We don’t care enough about their strife because we’ve only just met them, and there’s so much of it to absorb that it’s easy to lose track of why one character is lamenting the loss of their father and another is haunted by visions of their overbearing mother.",
    "Even in moments when Gunn makes a clear play for our heartstrings (a scene in which King Shark discovers an aquarium certainly counts here) we’re pulled away to the next chaotic action sequence before being given the chance to understand why we were supposed to feel sad in the first place.",
    "The exception to this rule is Harley Quinn, whose relationship (that’s all we’ll say) with one of the movie’s villains offers some of The Suicide Squad’s best dialogue and its most powerful scene. But then again, Harley isn’t a character we need to spend time getting to know. We’re already aware of her backstory – her relationship with the Joker, her emotional frailties – so there’s real poignance to her words and actions.",
    "Other characters for whom this isn’t the case can therefore never benefit from the same emotional weight, so Gunn is stuck between offering too little backstory for each and trimming the cast down entirely to allow more time to get to know them. Avengers: Endgame, for instance, was a staggeringly successful ensemble adventure because audiences knew the stakes involved before the opening credits – but that same emotional investment just isn’t possible here. Still, swapping characterization for the delightful chaos of this movie's plot was arguably a justifiable trade-off.",
    "Gripes aside, The Suicide Squad rights most of the wrongs committed by its 2016 namesake, and may well be, for many, the most accomplished DCEU entry to date. Audiences can expect a colorful and chaotic supervillain adventure that is unmistakably the work of James Gunn, who lives up to his self-proclaimed ‘horribly beautiful mind’ through a barrage of bullets and blood.",
    "Just leave the tissues at the theatre door – unless you easily empathize with bipedal sharks, of course.",
    "The Suicide Squad is due to be released in theatres on July 30, 2021 in the UK, and will also be available to stream for 30 days via HBO Max in the US."
  ],
  "headers": {
    "4": "A soft sequel",
    "7": "Bullets and brawn",
    "11": "Identity crisis"
  },
  "links": {
    "recently quoted": "https://www.techradar.com/news/superhero-movies-have-become-boring-suicide-squad-director-says",
    "Zack Snyder’s Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Army of the Dead": "https://www.techradar.com/news/army-of-the-dead-ending-explained-will-there-be-a-sequel",
    "Reports": "https://www.forbes.com/sites/scottmendelson/2021/03/26/suicide-squad-trailer-margot-robbie-idris-elba-james-gunn-dc-films-will-smith-joker/?sh=2702b72478a3"
  }
}