{
  "source": "https://www.techradar.com/news/xiaomi-12-ultra-could-have-an-absolutely-bananas-rear-camera-bump",
  "title": "Xiaomi 12 Ultra could have an absolutely bananas rear camera bump",
  "category": "phones",
  "updated": "2021-12-10T09:46:00Z",
  "author": "tom-bedford",
  "summary": "A very chaotic design",
  "article": [
    "We've been seeing a constant stream of Xiaomi 12 leaks trickle in for a few weeks, and while most have got us to gently nod or shake our head, or give gruff mumbles of 'interesting...', one leak has really piqued our interest, and caused us to yell in shock 'what?!'.",
    "Photos of the protective cases for the entire Xiaomi 12 range have leaked - that means a vanilla, a Pro and an Ultra model - courtesy of a leaker on Chinese social media platform Weibo called WhyLab. It seems the photos have been removed by the poster at the time of writing this article, but not before GizmoChina copied them.",
    "The standard and Pro cases look similar, and line up with what we know of the Xiaomi 12 so far - we can only see them from the back though, so can't tell about speakers or ports.",
    "Regarding the camera bump, on both there's one big main camera and three smaller cut-outs, one of which is presumably for the flash module and the other two are for the second and third cameras.",
    "The real eye-catching case is that of the Xiaomi 12 Ultra though, and that's because its camera bump is absolutely wild. The camera module is a giant circle - in the center there's a gap for one lens, but there are seven other spaces for more things besides, and they're spread seemingly without rhyme or reason around the block.",
    "It's also worth noting that, while the Xiaomi Mi 11 Ultra had a mini screen on the back, it doesn't seem like that's the case for the Xiaomi 12 Ultra, but we're not exactly lamenting the loss, given its limited functionality.",
    "The Xiaomi Mi 11 Ultra only had three rear cameras, which was a little surprising given the 'more-cameras-is-better' battle of attrition that some smartphone manufacturers find themselves waging.",
    "That was okay, though, because they were three giant sensors paired with powerful lenses, and so the phone was fantastic for photography.",
    "Judging by this case leak, the Xiaomi 12 Ultra will have plenty more cameras, but they might not be as big as the 11 Ultra's.",
    "There are eight gaps on the back of the phone - three are almost definitely for a main and ultra-wide camera and a flash module. Judging by the shape of the gaps, another one will likely be a periscope lens for long-distance zoom, and we could also see a depth sensor too.",
    "That leaves three cameras, and we'll have to look at Xiaomi's past to speculate on what these are. We imagine one is a Xiaomi Mi 11-style macro camera, which had a terrific lens for taking close-up pictures. Another could be a 2x telephoto portrait lens, as seen in the Xiaomi Mi Note 10, which is designed exclusively for taking good-looking pictures of people with natural-looking depth effects.",
    "And what's left? Well, it could be a directional microphone for recording audio for videos, though it's possible it's an extra monochrome sensor for improved black-and-white photography or something entirely different.",
    "The Xiaomi 12 is expected to launch before the end of 2021, though based on the Mi 11 series, we might not see all three phones at once. We'll just have to wait and see."
  ],
  "headers": {
    "6": "Analysis: what are all these spaces for?"
  },
  "links": {
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "WhyLab": "https://weibo.com/WHYLAB?tabtype=home",
    "GizmoChina": "https://www.gizmochina.com/2021/12/10/xiaomi-12-series-case-leaks-reveal-peculiar-rear-camera-setups/",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review"
  }
}