{
  "source": "https://www.techradar.com/news/why-the-best-winter-workout-tech-is-a-pair-of-over-ear-waterproof-headphones",
  "title": "Why the best winter workout tech is a pair of over-ear waterproof headphones",
  "category": "audio-visual",
  "updated": "2021-10-28T11:03:33Z",
  "author": "tom-bedford",
  "summary": "No rain, no gain",
  "article": [
    "In London, we're in the midst of a \"wet\" season. Every few months, more often if we're unlucky, the heavens open for a week, and the city is bathed in a constant deluge that washes the dirt and grime away. This isn't the kind of weather you just turn up your collar up, and an umbrella isn't going to offer much protection, either; the downpours clean the streets of people as much as they do litter.",
    "As you can imagine, this kind of weather isn't exactly ideal for someone writing a column about running – it's difficult to write about your running-related experiences if you're spending all your time snuggled up in a dressing gown playing Dark Souls 2.",
    "I don't mind the rain, and I don't mind getting wet. But the same can't be said for my tech. I try to avoid getting caught in a downpour since there isn't enough rice in the world to dry out all the gadgets I carry around with me on a daily basis (being a tech reporter).",
    "But something new recently turned up for me to test: the UA Project Rock Over-Ear Training Headphones. They're a collaboration between JBL and Under Armour, and themed around Dwayne 'The Rock' Johnson, which I'm due to test out (and to see if they help me go into Beast mode, come back to my column in two weeks time to find out).",
    "These over-ear wireless headphones are IPX4-rated, so they're rainproof as well as sweatproof. However, the protection these waterproof headphones provide from the elements isn't the only reason they've helped me continue running in the wind and rain.",
    "Some tech is stated as being waterproof, and some isn't – and, clearly, I'm not setting going to set off on a long jog in the rain with any gadget that's likely to malfunction at the first sign of moisture. However, while some devices are technically waterproof (they'll easily survive a sprinkle of water), others are more practically waterproof, which means they'll continue to work nearly as well in water as they do when dry.",
    "Take, for example, a smartwatch. All running models will likely be water-resistant. However, while some will prove no problem at all to use when the screen is flecked with water, or if your hands are sweaty, on others the moisture will cause the device to stop registering your swipes with any degree of accuracy.",
    "Many of the gadgets I own are 'technically waterproof'. My pre-Project Rock headphones didn't let some water get in the way of how they performed, but when they were wet from rain they could slide around my ears, and since they weren't very loud, the sound of any music playing was often drowned out over the pitter patter or rain.",
    "I need to listen to music whilst running, and these (admittedly, very cheap) older headphones put me off going out if it was raining. I'm wasn't going to appreciate that energy-infusing power song if I couldn't make it out. But this isn't an issue now.",
    "What I like most about the Project Rock Over-Ear Training Headphones is that I can actually hear the music through the rain pounding down on the pavement.",
    "This is because the cans have noise-cancellation tech to filter out the worst of the weather, and this is but one of the headphone's features that has helped me get through those super-wet outings. The other key one is the IPX4 rating; technically the Project Rock Headphones are guarded against splashes of water, but on a practical level, they can survive the rain.",
    "There's plenty more I like about the headphones, though. The fit is tight, they're easy to set up and the physical controls are convenient to use. In addition, the battery life is an impressive 45 hours. I often forget to charge my workout tech until I'm about to head off, but given the UA cans last that long between charges, I don't need to worry about them.",
    "I didn't initially want to test out the Project Rock Over-Ear Training cans in the rain – I would have been perfectly content to wait for the soggy season to pass. However, as I've experienced countless times in London, you can set out on what appears to be a dry day, only to find yourself suddenly suffering a soaking just a few minutes after.",
    "Instead of turning back, though, I found the headphones well suited to the wetness.",
    "One added bonus of using over-ear headphones over my previous wireless pair, is the protection against \"hairy\" situations. While I don't have long hair, when it's sodden, it can easily flop in front of my eyes; here, though, I've been able to tuck it under the band of the headphones.",
    "Another feature I welcome is the music automatically pausing when I take the headphones off my head. Sure, I won't be doing this much on a run, but it's still a decent add-on. There are a few different devices that come with this ability, but it rarely works well.",
    "The Brahma bull logo on the Project Rock headphones is inspired by Dwayne Johnson's tattoo. It doesn't quite feel appropriate for me to have this powerful mammal on my head – I'd think maybe a calf or something gentle like a chimpanzee or penguin would be more appropriate. Nevertheless, these headphones have helped me to keep up my running routine through the rainy days, turning me a bit more into a gazelle."
  ],
  "headers": {
    "5": "Putting the 'oof' in 'waterproof'",
    "9": "Have you ever heard the rain?",
    "12": "No rain, no gain"
  },
  "links": {
    "someone writing a column about running": "https://www.techradar.com/news/im-running-across-the-entirety-of-america-and-i-cant-do-it-without-technology",
    "UA Project Rock Over-Ear Training Headphones": "https://www.techradar.com/news/channel-your-inner-beast-mode-with-the-rocks-sweat-proof-workout-headphones",
    "wireless headphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "waterproof headphones": "https://www.techradar.com/best/best-waterproof-headphones"
  }
}