{
  "source": "https://www.techradar.com/news/how-to-watch-hockey-at-olympics-2020-key-dates-free-live-stream",
  "title": "How to watch Hockey at Olympics 2020: key dates, free live stream and more",
  "category": "computing",
  "updated": "2021-07-26T16:47:36Z",
  "author": "nikshep-myle",
  "summary": "Will the Netherlands clinch gold this time?",
  "article": [
    "Ever seen a sport and instantly known you’re not cut out for it? Field hockey can have that effect on people, and that’s also why it’s so captivating to watch! Read on to see how to watch an Olympics hockey live stream at Tokyo in 2021 with free otions, streaming platforms and dates listed below.",
    "From 1928 to 1960, the Indian hockey teams ruled the sport—their six consecutive gold medals are an impressive testimony to this. But for the last 40 years, they haven’t secured any Olympic medals. Fans are hoping that’ll change under the new captain, Manpreet Singh, who was named the FIH Player of the Year in 2019.",
    "The top-performing countries of recent times are Germany and the Netherlands. And Argentina’s steady rise continues, especially with their historic win at the 2016 Olympics, where they became the first South American men’s team to clinch gold in the sport.",
    "But the team that’s going to light up the competition is Belgium. The men’s team is currently the world champion, and getting past them will not be easy for the other contenders.",
    "On the women’s side, keep an eye out for the Netherlands, who lost their third consecutive gold medal at the Rio Olympics to Great Britain. The Netherlands tied the game but lost in the shootouts, so you can imagine they’ll be back with a phenomenal drive this time.",
    "Wondering where you can watch hockey at Olympics 2020? We’ll cover that in this article and go over some of the event’s key dates too. To learn more about the other games, read our comprehensive article on the Olympics live stream.",
    "- Men's Bronze Medal Match: Wednesday, August 4 from 9.30pm ET / Thursday, August 5 from 10.30am JST / 2.30am BST - Men's Gold Medal Match: Thursday, August 5 from 7pm JST / 11am BST / 6am ET - Women's Bronze Medal Match: Thursday, August 5 from 9.30pm ET / Friday, August 6 from 10.30am JST / 2.30am BST",
    "- Women's Gold Medal Match: Friday, August 6 from 7pm JST / 11am BST / 6am ET",
    "One of the world’s most-viewed sporting events, the Olympics is covered by broadcasters worldwide. While the Olympics channel will be airing highlights, it is regional domestic broadcasters who will have the full footage.",
    "For example, those in the UK can get coverage of a lot of the main events via the free BBC service on BBC iPlayer. The same goes for Australia with Channel 7 (or 7plus online). Ireland has RTE for its free coverage, France has TF1 and many other countries are in a similar place with free coverage.",
    "We have further information about worldwide Olympics streams below.",
    "While you'll be able to watch an Olympics live stream from the large majority of countries, you may face difficulties if you're trying to tune in to your usual streaming platform while abroad.",
    "That's because streaming platforms tend to geo-block their content, stopping you when you're abroad. Luckily, there is a very simple way to resolve this issue - by using a VPN.",
    "Download one of the best VPN services and you'll be able to override these geo-blocks and watch the Olympics like you're back home. This saves you having to track down a dodgy stream while you're on holiday.",
    "Use a VPN to watch Tokyo 2020 Olympic Games from anywhere",
    "Using a VPN is as easy as one-two-three...",
    "1. Download and login to a VPN - as we've said above, our top choice is ExpressVPN",
    "2. Connect to the appropriate server location - open the VPN app, hit 'choose location' and select the appropriate location",
    "3. Go to the broadcaster's live stream - For example, those from the UK can head on over to BBC iPlayer",
    "Don't live in any of the countries we've listed above? Not to worry, the Olympics are available to watch from the large majority of countries around the world. While some countries won't have free viewing options or as many choices, you should have an option available in your region.",
    "Unsurprisingly, the list of viewing platforms is very extensive but luckily, there is a dedicated Wikipedia page with all of the different channels airing the Olympics."
  ],
  "headers": {
    "6": "Olympics 2020 hockey: key dates and times",
    "8": "Free Olympics hockey live stream",
    "11": "How to watch your Olympics live stream when abroad",
    "19": "More 2020 Olympics broadcasters around the world"
  },
  "links": {
    "Olympics live stream": "https://www.techradar.com/news/olympics-live-stream-how-to-watch-tokyo-2020-olympic-games-free-2021-dates-schedule-events",
    "Olympics channel": "https://olympics.com/en/live/",
    "BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "7plus online": "http://7plus.com.au/",
    "best VPN services": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "to BBC iPlayer": "https://www.bbc.co.uk/iplayer",
    "Wikipedia": "https://en.wikipedia.org/wiki/List_of_2020_Summer_Olympics_broadcasters"
  }
}