{
  "source": "https://www.techradar.com/news/huawei-p50-leak-suggests-smartphone-cameras-are-only-getting-bigger",
  "title": "Huawei P50 leak suggests smartphone cameras are only getting bigger",
  "category": "phones",
  "updated": "2021-05-14T16:00:03Z",
  "author": "david-nield",
  "summary": "The camera module is big... very big",
  "article": [
    "A pair of newly leaked images have given us our best look yet at the rear camera module on the Huawei P50, and in line with previous leaks it looks as though the phone will bring with it some rather large camera enclosures on the back.",
    "The pictures shared by tipster @RODENT950 on Twitter look like official renders obtained from Huawei, though we can't be sure of their authenticity at this stage. They show the rear of one of the P50 models, in what appears to be a golden finish.",
    "We've got two large camera openings, as seen in previous leaks, with several elements inside. With three models expected (the P50, the P50 Pro and the P50 Pro Plus), we might see a different camera configuration in each of these handsets.",
    "When it comes to these pictures, we can see three cameras inside the upper circle and another camera and an LED flash inside the lower one. The label just says ‘Huawei P50 Series’ so there's no indication of which model this is – but that's a lot of cameras. Another LED flash is visible outside of the two main camera bumps.",
    "This looks like it will be the biggest camera block ever placed on a Huawei phone, but the company isn’t alone in bumping up the camera size. This year already we’ve seen a big camera enclosure on the Samsung Galaxy S21 Ultra and a borderline comically large one on the Xiaomi Mi 11 Ultra.",
    "With cameras being one of the major smartphone battlegrounds right now we expect more handsets will follow this trend, and some might get even bigger camera blocks. After all, that tends to be necessary to pack in lots of lenses and larger sensors – two things that can benefit the photography experience.",
    "Actual lenses don’t seem to be getting too much bigger in general, but don’t be surprised if they start growing too. So if you want to avoid hulking camera enclosures on otherwise sleek phones, you might soon have to avoid flagships.",
    "We can't tell you too much more from these pictures, but an earlier leak from the same source showed a similar design, with a Leica label – that hints that Huawei will continue its partnership with the camera manufacturer with its 2021 handsets.",
    "Other tidbits we've heard around the Huawei P50 phones are that we'll see a 6.3-inch screen on the Huawei P50 and a 6.6-inch display on the Huawei P50 Pro. The phones are expected to come running the same Kirin 9000 processor as the Huawei Mate 40.",
    "The big question is when the Huawei P50 is actually going to see the light of day. The Huawei P40 made its debut in March 2020, and we're way past March 2021 – the P50 launch was rumored to have been pushed back to May, and is now being tipped to happen in June.",
    "Component shortages are said to be partly to blame, but there's likely to be another reason for these delays too: the word is that the P50 will be the first phone to run Huawei's new HarmonyOS 2.0 software in place of Android, and the company will want to make sure everything is working and bug-free before pushing it out into the world."
  ],
  "headers": {},
  "links": {
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "@RODENT950": "https://twitter.com/RODENT950/status/1392540964279963655/",
    "previous leaks": "https://www.techradar.com/news/huawei-p50-images-include-the-pros-massive-camera",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "earlier leak": "https://www.techradar.com/news/huawei-p50-series-camera-sensors-and-other-details-leaked",
    "Huawei Mate 40": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "Huawei P40": "https://www.techradar.com/reviews/huawei-p40-review",
    "pushed back to May": "https://www.techradar.com/news/huawei-p50-release-date-might-be-delayed-until-may",
    "happen in June": "https://www.techradar.com/news/huawei-p50-may-not-launch-until-june",
    "HarmonyOS 2.0": "https://www.techradar.com/news/harmonyos-2"
  }
}