{
  "source": "https://www.techradar.com/news/apples-next-macbook-pros-could-boast-higher-resolution-screens",
  "title": "Apple's next MacBook Pros could boast higher resolution screens",
  "category": "computing",
  "updated": "2021-09-25T16:30:06Z",
  "author": "david-nield",
  "summary": "Upgrades on the way",
  "article": [
    "We're patiently waiting for Apple to unveil updated versions of its 14-inch MacBook Pro and 16-inch MacBook Pro, fresh for late 2021, but until the official announcements we'll have to make do with leaks – like the screen resolutions spotted in the latest beta edition of macOS Monterey.",
    "As reported by MacRumors, the preview software code refers to as \"3456 x 2234 Retina\" and \"3024 x 1964 Retina\" displays – resolutions that don't match up with any current or previous Apple products. In other words: the plot thickens.",
    "You don't necessarily have to be a world-famous detective to figure out that these mysterious listings could refer to the upcoming 14-inch and 16-inch laptops from Apple, which are rumored to be packing a brand new M1X chip inside them as well.",
    "Right now, the current 16-inch MacBook Pro has a native screen resolution of 3072 x 1920 pixels, while the smaller 13-inch MacBook Pro (expected to be replaced with a 14-inch version very soon) has a native resolution of 2560 x 1600 pixels.",
    "If these hidden specs turn out to be accurate, then both laptops are going to get a higher pixel density next time around. We've heard plenty of other rumors around these computers as well, including hints that the Touch Bar is getting removed.",
    "As for when we're actually going to be able to see these new laptops, it doesn't seem as though there will be much longer to wait: various sources have pointed to a launch happening in October time, and we will of course let you know as soon as anything is made official.",
    "For several weeks now, the narrative emerging from the rumor mill has been that Apple was planning to have two big events around September and October time: one to show off new mobile devices, and one to show off new MacBook Pros.",
    "If those predictions are right, we're half way through. Last week we saw the unveiling of the iPhone 13, the Apple Watch 7, the iPad mini 6 and a new entry-level 10.2-inch iPad as well. There isn't much left that needs a refresh besides Apple's iconic laptop computers.",
    "Some predictions suggested that the iPads would be saved to the second of Apple's late 2021 showcases, but obviously Apple saw fit to include them in the first one. That leaves the stage clear for Macs, whenever the second event happens to be.",
    "Among the improvements said to be coming to the new MacBook Pros are innovative mini-LED displays – which may be why the screen resolutions are getting a boost as well. None of this is certain yet though, and we'll have to wait for the official event to see exactly what MacBook Pro upgrades Apple has been busy working on."
  ],
  "headers": {
    "3": "Specs appeal",
    "6": "Analysis: brace for Apple's second big hardware launch of late 2021"
  },
  "links": {
    "14-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "16-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "MacRumors": "https://www.macrumors.com/2021/09/23/macbook-pro-2021-resolutions/",
    "a brand new M1X chip": "https://www.techradar.com/news/apple-m1x-macbook-pro-might-drop-as-early-as-october",
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "is getting removed": "https://www.techradar.com/news/apple-could-be-killing-off-one-of-the-macbook-pro-16-inchs-most-controversial-features",
    "various sources": "https://www.techradar.com/news/apples-new-m1x-macbook-pros-could-be-on-shelves-in-just-a-few-weeks",
    "two big events": "https://www.techradar.com/news/new-rumor-points-to-two-apple-hardware-launch-events-in-september",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "iPad mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "10.2-inch iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Some predictions": "https://www.techradar.com/news/expect-iphone-13-and-apple-watch-7-on-september-14-ipad-and-mac-to-come-later",
    "innovative mini-LED displays": "https://www.techradar.com/news/powerful-new-m1-macbook-pro-models-expected-to-feature-mini-led-display"
  }
}