{
  "source": "https://www.techradar.com/news/marvels-the-eternals-director-chloe-zhao-confirms-shes-also-the-films-writer",
  "title": "Marvel’s The Eternals director, Chloé Zhao, confirms she’s also the film’s writer",
  "category": "entertainment",
  "updated": "2021-01-04T21:23:36Z",
  "author": "emma-boyle",
  "summary": "“I am the writer on Eternals”",
  "article": [
    "In a sightly “I am Iron Man” moment, director of Marvel’s The Eternals, Chloé Zhao, has confirmed that she’s also the movie's writer.",
    "The announcement from Zhao came in an interview with Margaret Gardiner (via ScreenRant), during the course of which Zhao revealed “I am the writer on Eternals, the credits just aren’t updated yet, you know, so I still don't know what it would be like if I don't write the film, that I'm not at least a huge part of the writing process.” Zhao went on to say “in the writing process, that’s where I bring my sensibility in, that’s a huge part of it.”",
    "At the moment, the writing credits for the film, prior to the expected update, don’t mention Zhao with only Kaz Firpo and Ryan Firpo named.",
    "Zhao, who has been acclaimed for her intimate indie films such as Nomadland and The Rider, also shed some light on the freedom that she’s been given to bring her own distinctive directorial touch to The Eternals, offering praise for the Marvel team:",
    "“They knew from the moment I pitched the film that I really wanted the scope and scale at the same time as the intimacy, they knew I wanted both. They have been so incredible holding my hand through the entire process allowing me to go as far as possible and as small as possible, and how that fit into the MCU.”",
    "With its brand new cast of characters, The Eternals is sure to feel like new territory for Marvel as it gets into Phase 4. The film will revolve around the creations of comic book artist and writer Jack Kirby, The Eternals, a group of super-powered alien beings who’ve been living on Earth for thousands of years and generally use their powers for good.",
    "In terms of its place in the wider MCU, The Eternals will be set after the events of Avengers: Endgame. Its ensemble cast includes some big names, including Angelina Jolie, Richard Madden, Kumail Nanjiani, Selma Hayek, Kit Harrington and Gemma Chan.",
    "The Eternals is scheduled to release in November 2021 after being moved from its original February 2021 release date in September of last year."
  ],
  "headers": {
    "3": "Freedom to create"
  },
  "links": {
    "The Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "Margaret Gardiner": "https://www.youtube.com/watch?v=npo23hZr3EU",
    "ScreenRant": "https://screenrant.com/eternals-movie-writer-chloe-zhao/",
    "being moved": "https://www.techradar.com/news/black-widow-pushed-to-may-2021-other-phase-4-mcu-and-disney-films-shift-to-late-next-year"
  }
}