{
  "source": "https://www.techradar.com/news/small-tv-vs-pc-monitor-whats-the-best-display-technology",
  "title": "Small TV vs PC monitor: what’s the best display technology?",
  "category": "televisions",
  "updated": "2021-08-21T15:00:00Z",
  "author": "jeremy-laird",
  "summary": "Small TVs and PC monitors: does either have an advantage?",
  "article": [
    "The TV versus PC monitor question used to be a classic horses for courses conundrum. For computing of any kind you wanted a monitor; for watching movies and playing console games, a TV was a no brainer.",
    "But is that still true? In this age of multi-platform media and all-digital connectivity do small TVs now make sense for use with a PC? And are monitors now more versatile as all-purpose displays rather than as devices for consuming raw data?",
    "Certainly many of the core features and functionalities of the two display types have converged. Everything from resolutions to refresh rates, panel types to pixel performance and interfaces to input lag are more closely matched than ever – yet not entirely equal. Here’s what you need to know when weighing up a small TV versus a monitor as your display of choice.",
    "Small TVs are generally those sized up to around 32 inches, which puts them at the upper end of the mainstream monitor market, size-wise. Given the low price of even quite large TVs, the smaller option is often considered not only based on price but also when space is at a premium. There’s only so big you can go on the desktop.",
    "Still, smaller TVs do tend to be lower-end models with limited features and spec. If you want a really high-quality small display, a monitor is your best bet. Of course, sheer scale is just one aspect, and shape is quite another. Pretty much all TVs are 16:9 aspect ratio, matching the format of typical TV content, though films tend to be wider still. Monitors, meanwhile, are available in a much broader array of form factors.",
    "16:9 is still the most popular aspect ratio – meaning that, for every 16 pixels along the horizontal axis of the display, there are nine pixels along the vertical – but 21:9 and even 32:9 monitors like the monstrous Samsung Odyssey Neo G9 are available, plus a few oddball panels with taller ratios like 3:2 including the Huawei MateView. For watching video and playing most games, 16:9 remains the best overall compromise.",
    "Wider panels can be great for multi-tasking when computing, for instance viewing multiple web pages or documents side by side. They can also add immersion for certain gaming scenarios like driving games and adventure titles. However, not all PC games work well with ultra-wide monitors and console gaming support is very limited indeed.",
    "A less discussed and yet critical issue involving the comparison between TVs and monitors is sub-pixel structure. Each and every pixel on any full-colour display is made up of a number of sub-pixels. The most common structure is known as RGB, which indicates red, green and blue subpixels in that order.",
    "Almost all PC monitors are RGB – indeed, for computing, anything other than standard RGB is a problem. That’s because operating systems like Windows rely on sub-pixel structure to render fonts accurately and smoothly.",
    "Many TVs also use RGB, but some stick with BGR (blue, then green and then red), and it means computing applications and browsers largely aren’t ideal – while more complex RBGW systems found on some TVs also tend to reduce detail and sharpness.",
    "If a TV uses an IPS panel, it’s probably RGB, while a VA panel could be either RGB or BGR – but as TV makers don’t always list sub-pixel information, this can be much harder to discern with small TVs than with PC monitors.",
    "HDR or high dynamic range rendering has to be the trickiest current display technology. It’s a minefield of competing standards, of confusing and sometimes misleading claims.",
    "In its simplest sense, a HDR display can show both very bright and very dark image elements at the same time and without compressing any details. If that’s the idea, the reality is more complicated. In terms of panel technology, OLED displays are better at rendering darker elements, while the best LCD panels are superior when it comes to hitting those eye-popping peaks.",
    "It’s all a bit of a moving target as OLED panels get brighter and LCD screens improve their contrast and low-light performance. All of which begs the question of how TVs and monitors compare when it comes to HDR. For starters, there are almost no OLED monitors and equally few small TVs with OLED panels. So in practice, it’s LCD versus LCD – just remember that TVs and monitors sold as ‘LED’ models are actually LCD displays with LED backlights.",
    "In the TV market up to 32 inches, few if any sets offer true HDR performance courtesy of local dimming. The same applies to most so-called HDR monitors, which tend to be VESA DisplayHDR 400 certified. In both cases, they’re not very bright and lack local dimming.",
    "Some of the very latest high-end PC monitors, such as the Asus ROG Swift PG32UQX, have mini-LED backlights with thousands of dimming zones. But these are extremely expensive displays costing upwards of $1,000 / £1,000. Long story short, proper HDR performance remains out of reach on small TVs and most monitors.",
    "One area where monitors offer far more choice is resolution. You can have anything from 1080p to 1440p and 4K from just a 27-inch 16:9 aspect ratio monitor, let alone other shapes and sizes. In other form factors, you can have anything from 3,440 by 1,440 pixels to 5,120 by 2,160.",
    "The small TV market, meanwhile, is dominated by 1080p sets. That keeps pricing down and it’s arguably fine for watching TV and playing console games. But for serious PC gaming and general PC productivity use, 1080p lacks detail and precision.",
    "There are exceptions. The Samsung Q50R is a 32-inch TV with full 4K resolution. It’s not exactly cheap at $500, but a reasonable option if you want full smart TV functionality in a compact package.",
    "The main benefits of higher resolutions are detail and sharpness, which can really matter for font rendering in Windows on a PC. It’s less critical for TV and video, especially with smaller screen sizes. As for gaming, only the very latest consoles can do anything above 1080p.",
    "For PC gaming, higher resolutions give better image quality, but also make for much more load on your graphics subsystem. 4K gaming makes for huge detail, but also much lower frame rates. Currently, many gamers view 1440p or 2,560 by 1,440 pixels as the best compromise between detail and frame rates. So, for serious PC gaming, a small TV probably isn’t a great choice.",
    "The fastest display tech in terms of pixel response is OLED. But as we’ve discovered, few small TVs or monitors are available with OLED panels. So, it’s a question of comparing LCD panel types.",
    "Theses days, most monitors and TVs are either IPS or VA panel types, with TN panels now quite rare. Unfortunately, many TV manufacturers do not quote pixel response performance, especially for smaller sets. But as a rough rule of thumb, IPS is faster than VA, though some cutting edge VA panels now rival IPS for outright speed.",
    "As for monitors, the fastest IPS panels now achieve 1ms grey-to-grey or 0.5ms MPRT response, representing two slightly different ways of measuring response. Long story short, the best gaming PC monitors are better tuned for pixel response than small TVs. That said, a general purpose or productivity orientated monitor will have pixel response comparable to a small TV and measuring around 5-8ms gray-to-gray.",
    "The other half of the speed equation is refresh rate. It’s what determines how responsive a screen feels to inputs when playing games but far less important for watching video or general computing. The fastest gaming monitors can now hit 360Hz, while small TVs are capped at just 60Hz.",
    "That said, high refresh gaming is a relatively niche concern and 60Hz is fine for most console and PC gaming, especially given a very powerful PC or one of the latest consoles is required to really make the most of a high refresh display. Just be aware that some cheap TVs can suffer from significant input, making them unsuitable for anything but casual gaming.",
    "How you hook up to a display used to be a major issue when comparing monitors to TVs. Today? Not so much. TVs use HDMI while monitors typically offer both HDMI and DisplayPort. In other words, you shouldn’t have any problem connecting a TV or monitor to anything from a PC to a set-top box or games console.",
    "HDMI 2.1 and support for 4K at 120Hz refresh is currently a hot topic in the TV and console gaming market. But it’s not hugely relevant to small TVs up to 32 inches, none of which run above 60Hz. That said, if you are planning on hooking up a cheaper 4K TV to a PC, make sure it has at least HDMI 2.0 to ensure 60Hz refresh running at native resolution.",
    "For monitors, meanwhile, the higher refresh rates offered by some models are more widely supported by the DisplayPort interface, which is a standard interface on pretty much all recent graphics cards. So, you’re unlikely to run into issues.",
    "In this age of multi-platform streaming services, you can watch most content on almost any device. However, a smart TV is probably the simplest solution for accessing the widest array of content. You can have an integrated tuner plus a smart TV platform with the usual apps including Netflix, Amazon Prime, Disney Plus and the rest pre-installed, and also plug it into a PC and console and have literally every option covered.",
    "You don’t miss out much with a monitor plugged into a PC. But some streaming services can be problematical in terms of accessing the highest streaming quality. Likewise, without a TV tuner, you won’t be able to access broadcast TV.",
    "What about something slightly bigger?",
    "It’s worth noting that going for a slightly larger TV set opens up a lot of options. Countless cheap and not-so-cheap 4K TVs are available in the 40-inch to 48-inch segment. For some, that’s too big for desktop use. However, this class of TV offers access to features like true HDR capability with full-array local dimming and 120Hz refresh.",
    "Even more exciting, LG’s OLED TVs start at 48 inches and bring with them all the usual OLED advantages including per-pixel lighting, infinite contrast and super speedy pixel response. What’s more, a slightly larger TV doesn’t necessarily mean a more expensive TV. 40-inch to 43-inch TVs are now among the very cheapest available.",
    "So, what makes for the best overall screen, a small TV or a monitor? If optimal image quality, a monitor wins with ease. Likewise, for easy access to the widest range of content, go with a TV.",
    "The tricky choices lie in between those two poles. A small, cheap TV can make for a good all-round display for everything from gaming and watching movies to occasional computing. You get an awful lot of screen for remarkably little money. On the other hand, the more often you’re likely to use a given screen with a PC, the more benefit you’ll get from a monitor. That’s true for everything from surfing the web to playing games on PC. Some things, like really high refresh rates can only be had in a monitor, not a TV.",
    "We’d also recommend considering slightly larger TV sets in the 40-inch range. For some, that may be impractical in terms of sheer size. But that slightly larger segment of the market offers much more choice in terms of specs and often without a huge price penalty."
  ],
  "headers": {
    "3": "Does size matter?",
    "7": "Sub-pixel structure",
    "11": "HDR performance",
    "16": "Resolution",
    "21": "Speed",
    "26": "Interfaces",
    "29": "Content",
    "34": "Small TV vs PC monitor: which is best?"
  },
  "links": {
    "PC monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "small TVs": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "large TVs": "https://www.techradar.com/news/best-tv",
    "Samsung Odyssey Neo G9": "https://www.techradar.com/reviews/samsung-odyssey-neo-g9",
    "Huawei MateView": "https://www.techradar.com/reviews/huawei-mateview",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "ultra-wide monitors": "https://www.techradar.com/news/ultrawide-monitor",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "OLED displays": "https://www.techradar.com/news/what-is-oled",
    "LCD": "https://www.techradar.com/news/television/lcd-or-plasma-tv-which-should-you-buy-900295",
    "Asus ROG Swift PG32UQX": "https://www.techradar.com/news/asus-shows-off-its-worlds-fastest-360hz-rog-swift-monitor-at-ces",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Amazon Prime": "https://www.techradar.com/reviews/amazon-prime-review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "LG’s OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today"
  }
}