{
  "source": "https://www.techradar.com/news/trello-unveils-new-look-to-help-you-be-more-productive-working-from-home",
  "title": "Trello unveils new look to help you be more productive working from home",
  "category": "computing",
  "updated": "2021-02-17T14:36:09Z",
  "author": "barclay-ballard",
  "summary": "The revamped Trello comes with a host of new features",
  "article": [
    "Project management tool Trello has undergone a major redesign in response to recent workplace changes. With COVID-19 leading to substantial shifts in how most people work, the new version of Trello hopes to be better suited to remote working.",
    "In addition to aesthetic changes like a new logo and illustrations, Trello will now come with new views to give managers better insights into how projects are progressing.",
    "The four new views include Timeline, Table, Dashboard, and Calendar views. The views will enable project leaders to drill down into the progress for day-to-day tasks, as well as gaining enhanced high-level top-down insight.",
    "“We are building for an entirely new era of teamwork—where people live in different locations, but work stays connected. This is the beginning of a whole new Trello,” Michael Pryor, head of product at Trello, said. “We’re rolling out new ways to visualize your data on a Trello board: as a dashboard, a timeline, a table, and more. With these new views, you can better visualize the work to be done, who needs to do it, and which tasks are at risk. You’ll gain insight to manage both the project at large and the tasks at hand.”",
    "The Timeline view makes it easy for a manager to visualize each team’s pipeline, adjust due dates, and keep track of critical tasks. With Table view, cards from selected boards can be compiled into a single spreadsheet to help larger teams stay abreast of company goals and meeting agendas.",
    "With the Dashboard view, key metrics can be easily analyzed to prevent bottlenecks and identify inefficiencies. Calendar view, meanwhile, provides teams with a clear overview of to-dos, checklist items, and due dates.",
    "In addition to the new views, the revamped Trello will also come with new card types, including link cards, board cards, and mirror cards, so more data is accessible from Trello and other workplace apps. A new sidebar with better navigation has also just begun its rollout.",
    "Via The Verge"
  ],
  "headers": {
    "4": "A new view"
  },
  "links": {
    "Project management": "https://www.techradar.com/best/best-project-management-software",
    "Trello": "https://www.techradar.com/reviews/trello",
    "logo": "https://www.techradar.com/best/best-logo-designer",
    "said": "https://www.google.com/search?q=michael+pryor+trello&oq=michael+pryor+trello&aqs=chrome..69i57j69i60.6189j0j4&sourceid=chrome&ie=UTF-8",
    "Calendar": "https://www.techradar.com/best/best-calendar-apps",
    "workplace apps": "https://www.techradar.com/best/best-apps-for-small-business",
    "The Verge": "https://www.theverge.com/2021/2/16/22284873/trello-redesign-new-cards-board-views-remote-work-future?scrolla=5eb6d68b7fedc32c19ef33b4"
  }
}