{
  "source": "https://www.techradar.com/news/transformers-7-has-a-silly-name-and-a-release-date",
  "title": "Transformers 7 has a silly name – and a release date",
  "category": "entertainment",
  "updated": "2021-06-23T02:24:19Z",
  "author": "axel-metz",
  "summary": "It’s a robot safari, basically",
  "article": [
    "Another Transformers movie is on the way, and this one has a slightly odd title – it’ll be called Rise of the Beasts.",
    "The name was revealed at a virtual press event, alongside a release date of June 24, 2022. The film will be helmed by Creed 2 director Steven Caple Jr, and take place in ‘90s New York.",
    "A press release suggests Rise of the Beasts, which will become the seventh mainline Transformers movie since 2007, will “introduce the Maximals, Predacons and Terrorcons to the existing battle on earth between Autobots and Decepticons.\"",
    "For the uninitiated, Maximals are a subgroup of animal-like Autobot ancestors, while both the Predacons and Terrorcons are Decepticons (though also typically transform into animal-like machines). Basically, you can expect robot dogs to appear in this one.",
    "Following the announcement, Fandom's Eric Goldman took to Twitter to share further details surrounding the project. In one post, Goldman claims its producers “felt like the previous movies had exhausted the Autobot vs. Decepticon battle on its own,” hence the desire to “look at different ‘tribes’ of Transformers.”",
    "Goldman also added that Rise of the Beasts will avoid the timeframe of Michael’s Bay’s previous entries in the franchise, and that the studio is “not considering this a full reboot of what came before.”",
    "Optimus Prime will, however, once again be the movie’s main hero – as per information disclosed in the press event – and do battle with Scourge, its primary antagonist.",
    "Goldman’s tweets suggest production art shown to event attendees revealed the villain has “big clawed hands and smoking exhaust ports on [his] shoulders” – though, at this point, we’re still in the dark about Scourge’s motivations. We’re betting it’s one of either revenge or world domination, though.",
    "As for its cast, Rise of the Beasts will star In the Heights’ Anthony Ramos as Noah, an army veteran, alongside Spider-Man: Into the Spider-Verse star Luna Lauren Vélez and Project Power’s Dominique Fishback.",
    "Rise of the Beasts isn’t the only Transformers movie currently in development, either.",
    "Another as-yet-unnamed project, directed by Charm City Kings' Angel Manuel Soto and written by The Defenders showrunner Marco Ramirez, is confirmed to be in the works – so expect a flurry of shape-shifting super soldiers over the next few years.",
    "Given that the last film in the franchise, 2018’s Bumblebee, focused on the plight of a single Transformer, there’s every chance that Soto’s project will likewise centre around an individual Transformers character, though we don’t have any plot details for that one just yet.",
    "In the meantime, we await the arrival of Rise of the Beasts with bated breath – or a mild degree of enthusiasm, at least."
  ],
  "headers": {
    "9": "Transformers fever"
  },
  "links": {
    "Twitter": "https://twitter.com/TheEricGoldman",
    "confirmed": "https://variety.com/2021/film/news/transformers-angel-manuel-soto-marco-ramirez-1234939086/"
  }
}