{
  "source": "https://www.techradar.com/news/aws-wants-to-let-all-businesses-build-their-own-5g-networks",
  "title": "AWS wants to let all businesses build their own 5G networks",
  "category": "computing",
  "updated": "2021-11-30T19:51:00Z",
  "author": "mike-moore",
  "summary": "Deploy a private network quicker than ever with AWS Private 5G",
  "article": [
    "Getting your business up to speed with 5G could soon be easier than ever thanks to a new announcement from Amazon Web Services (AWS).",
    "The company has revealed AWS Private 5G, a new managed service that allows enterprises set up and scale private 5G mobile networks in their facilities in days instead of months.",
    "AWS says that with just a few clicks, customers can specify where the network will be, what kind of capacity they need, and then get everything they need, with the process taking just days rather than months as it may have done previously.",
    "\"There's nothing like AWS Private 5G network out there,\" noted AWS CEO Adam Selipsky as he unveiled the new offering at the company's re:Invent 2021 event in Las Vegas.",
    "“You get all the goodness of mobile technology without the pain of long planning cycles, complex integrations and the high upfront costs,” he added.",
    "Once all the demands are in, AWS will deliver everything needed, whether that's hardware or software-based - even right down to SIM cards for mobile devices.",
    "AWS notes that there are no upfront fees or per-device costs involved with the new platform, with customers only paying for the network capacity and throughput they ask for.",
    "All network set-up and deployment is automated, with the platform able to scale capacity when needed, such as if a customer needs to support additional devices and increased network traffic.",
    "AWS Private 5G is only available in preview to customers based in the US for the time being, but will likely expand to other markets soon.",
    "“Many of our customers want to leverage the power of 5G to establish their own private networks on premises, but they tell us that the current approaches make it time-consuming, difficult, and expensive to set up and deploy private networks,” noted David Brown, Vice President, EC2 at AWS.",
    "“With AWS Private 5G, we’re extending hybrid infrastructure to customers’ 5G networks to make it simple, quick, and inexpensive to set up a private 5G network. Customers can start small and scale on-demand, pay as they go, and monitor and manage their network from the AWS console.”"
  ],
  "headers": {
    "3": "\"Shockingly easy\""
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Amazon Web Services": "https://www.techradar.com/news/aws"
  }
}