{
  "source": "https://www.techradar.com/news/the-best-cyber-monday-nintendo-switch-sd-card-deals-are-right-here",
  "title": "The best Cyber Monday Nintendo Switch SD card deals are right here",
  "category": "gaming",
  "updated": "2021-11-28T23:52:52Z",
  "author": "jamel-smith",
  "summary": "SD card discounts galore",
  "article": [
    "The Cyber Monday deals are starting to land, and whether you're looking for a massive 1TB or smaller 128GB storage expansion we've found the best Cyber Monday SD card deals in both the US and the UK.",
    "As the Nintendo Switch comes with a puny amount of internal storage (32GB on the original model and 64GB on the OLED model) you'll likely want to upgrade your storage with an SD card to hold the massive amount of games downloadable on the Nintendo eShop – and we're live-blogging all the deals we're finding for the main console, if we you want to get an up-to-date look at the sales.",
    "We'd recommend you take a look at the storage amount and the transfer speeds when buying an SD card. Nintendo also recommends a high-speed memory card for optimum performance, so look out for a card with UHS-I support, and a minimum ‘read speed’ of 60-95mb/s (all the cards featured below meet these requirements), while fast transfer speeds ensure you're not sitting around waiting for your files to transfer from your Switch to your SD card.",
    "We saw some great SD card deals on Black Friday, and some of those are carrying on into Cyber Monday, while new deals are also dropping. And make sure you check out our Cyber Monday Nintendo Switch deals if you're still looking for one. You'll find US deals directly below, and UK deals a little further down the page – if you're not in the US or UK, scroll to the end of this article to see deals in your region.",
    "No matter where you live, you'll find the best Cyber Monday deals on SD cards and microSD cards from around the web below."
  ],
  "headers": {
    "4": "More Cyber Monday SD card deals",
    "5": "More Cyber Monday deals"
  },
  "links": {
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "and we're live-blogging all the deals we're finding for the main console, if we you want to get an up-to-date look at the sales.": "https://www.techradar.com/news/live/live-now-all-the-latest-cyber-monday-nintendo-switch-deals",
    "Cyber Monday Nintendo Switch deals": "https://www.techradar.com/cyber-monday/nintendo-switch-cyber-monday-deals-2020-bundles-games-accessories-and-more"
  }
}