{
  "source": "https://www.techradar.com/news/whatsapp-users-can-now-migrate-chats-from-ios-to-android-with-some-huge-caveats",
  "title": "WhatsApp users can now migrate chats from iOS to Android – with some huge caveats",
  "category": "phones",
  "updated": "2021-10-27T09:02:49Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Have you been deemed worthy of this incredibly useful option?",
  "article": [
    "The ability to migrate WhatsApp messages between devices is something that has been talked about for a long time now – and users have been practically begging for it. Now WhatsApp has made it is possible to migrate chat history from iOS to Android, with a catch.",
    "And it is quite a big catch. Far from being an option that is being made available to everyone, it is something that only a certain group of people can take advantage of.",
    "But the limitations do not end there. Even if you find yourself falling within these fairly narrow parameters, you’ll probably need to invest in an extra piece of hardware as the migration is not performed wirelessly or via the cloud.",
    "The limitations are not because chat history migration is part of beta testing or anything like that. Firstly, migration is only possible if you’re running Android 12, so that immediately cuts down the field quite dramatically. Secondly, you need to have an eligible Samsung handset or Pixel device.",
    "As Google helpfully points out, “all you need is a USB-C to Lightning cable to get started” – well, plus having the right phone running the correct version of Android, of course. With the two phones physically connected to each other, a quick scan of a QR code is all it takes to start the transfer.",
    "Google also says that it has worked with WhatsApp to ensure secure data transfer, and this could explain the need for a cable. But there’s no getting away from the fact that most people would prefer to be able to forego the wired connection and make do with end-to-end encryption and a wireless transfer.",
    "While the arrival of the iPhone to Android migration option will be welcomed by WhatsApp users switching platforms, there are many questions remaining. The first of these has to be “why did it take so long?”. The exclusivity of the feature to such a small selection of phones is curious. Clearly there are bragging rights for Samsung and Google here, but users will undoubtedly question the thinking behind such narrow availability.",
    "Then, of course, there is the question of Android versioning. Why make the option exclusive to Android 12? And there is a requirement for a physical cable in 2021? Why is it not easier and more user-friendly?",
    "While the chat migration option is nice, it’s extremely unlikely to sway many people’s buying decisions. It’s not really attractive enough to make phone shoppers choose a Samsung or Pixel handset over their first preference.",
    "Via Google"
  ],
  "headers": {
    "4": "Time to move",
    "6": "Analysis: a long-time coming"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Google": "https://blog.google/products/android/whatsapp-chat-history/"
  }
}