{
  "source": "https://www.techradar.com/news/the-nintendo-switch-oled-is-harbouring-a-4k-secret-and-we-want-answers",
  "title": "The Nintendo Switch OLED is harbouring a 4K secret – and we want answers",
  "category": "gaming",
  "updated": "2021-10-12T13:14:10Z",
  "author": "henry-st-leger",
  "summary": "Could the Nintendo Switch OLED get 4K upscaling?",
  "article": [
    "The Nintendo Switch OLED looks to have a few tricks under its sleeve, after someone cracked open the Switch OLED's new and improved TV dock and found evidence of 4K capability hidden in plain view.",
    "Twitter user @KawlunDram posted about the specific chipset inside the Switch OLED dock, a Realtek chip listed as a “4K UHD multimedia SoC”. That, added to the inclusion of an HDMI 2.0 cable with the new Switch OLED consoles, shows that the dock itself should be capable of outputting 4K/60fps to a compatible television, even if the Switch hardware itself isn't.",
    "So, what does that mean? It certainly fans the flames of 4K rumors around a Nintendo Switch Pro, suggests VGC, and the recent Bloomberg report that said up to 11 developers already had 4K dev kits to develop Ultra HD Switch games.",
    "It's worth noting, too, that the Tegra X1 chip used in the Switch OLED – as well as the older Nintendo Switch and Switch Lite models – does technically support 4K. The 2015 and 2017 models of the Nvidia Shield TV streaming box both used the same Tegra X1 chip, and output in 4K resolution and even HDR.",
    "4K gaming is more demanding than simply video to output, of course, and there's nothing to suggest that the Switch's current processor is going to magically start performing in that area without any issue. But it does look like groundwork is being laid for 4K – we just need to figure out how it all pieces together.",
    "An HDMI 2.0 cable certainly suggests that the Switch OLED dock is intended to be used for higher-resolution output at some point. It could be a canny bit of backwards compatibility for those who choose to buy a 4K Switch when and if it eventually releases – allowing gamers to buy a standalone console without the dock, or at least have two 4K-capable docks in their home to shuttle their consoles around.",
    "There's also the possibility of a firmware update opening up some hidden capabilities, as we saw with Nintendo releasing Bluetooth headphones support – four whole years after the console first launched.",
    "However, as dataminer @SciresM points out, the Realtek chip could be there to support improved audio transfer, or to support the introduction of an Ethernet port – new to the Switch OLED – rather than necessarily 4K upscaling.",
    "It's also possible that Nintendo is simply using some 4K-ready hardware in its console chain ahead of a 4K model. It's likely cheaper to buy 4K-ready chips en masse, and Nintendo may have made the business decision to invest in certain chipsets and cables preemptively, even if they're not being used to their full potential just yet.",
    "When a 4K Switch releases, it might just release with an identical (or near-identical dock), requiring fewer alterations and therefore obstacles to proceed to a next-gen iteration.",
    "You shouldn't expect your Nintendo Switch to start churning out 4K gameplay overnight, then. We would love to see the Switch OLED dock aid upscaling and take some of the pressure off a 4K TV's processor, given cheap 4K displays can struggle on this count, or the introduction of HDR – though watching the hype cycle around the long-rumored 'Switch Pro' means we're a bit tired of disappointment in this area.",
    "For the record, we have reached out to Nintendo, though the company usually stays pretty quiet, or simply shuts down speculation – even if it turns out to be true. It's likely that Nintendo wants to keep the focus on its Switch OLED model, which has only just launched, and we don't expect a 4K iteration to launch imminently.",
    "Given that releases of Switch consoles so far have been roughly two years apart, it's likely that a 4K Switch, or at least a Switch OLED follow-up, wouldn't arrive until 2023 at the earliest.",
    "In the meantime, we hope the 4K upscaling on your Ultra HD TV is working out ok for you."
  ],
  "headers": {
    "5": "Conspiracy theories"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "@KawlunDram": "https://twitter.com/KawlunDram/status/1447617010792292356",
    "VGC": "https://www.videogameschronicle.com/news/more-evidence-suggests-switch-oleds-dock-can-support-4k/",
    "Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nvidia Shield TV": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Nintendo releasing Bluetooth headphones support": "https://www.techradar.com/news/nintendo-switch-finally-gets-bluetooth-audio",
    "@SciresM": "https://twitter.com/KawlunDram/status/1447620273142915078/photo/1",
    "or simply shuts down speculation": "https://www.techradar.com/news/nintendo-makes-it-official-a-4k-switch-pro-definitely-isnt-happening",
    "4K upscaling": "https://www.techradar.com/news/4k-upscaling-everything-you-need-to-know-about-how-tvs-turn-hd-into-4k",
    "Ultra HD TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405"
  }
}