{
  "source": "https://www.techradar.com/news/a-crackdown-on-piracy-and-illegal-streaming-is-coming",
  "title": "A crackdown on piracy and illegal streaming is coming",
  "category": "computing",
  "updated": "2021-08-16T09:00:57Z",
  "author": "joel-khalili",
  "summary": "It’s probably time to kick your piracy habit",
  "article": [
    "The content piracy game has come a long way since the days of camcorders at the movie theatre and knock-offs sold on the street corner.",
    "In the last decade and a half, the arrival of digital distribution methods and the acceleration of internet speeds have created a problem of a different magnitude entirely. VPNs and other privacy-centric technologies, meanwhile, have helped people conceal their shady online activity.",
    "According to Kieron Sharp, who heads up anti-piracy organization FACT, the complexity of the modern landscape demands a new approach. Previously, it was all about prosecuting the people running illegitimate sites, whereas now the focus is on trying to prevent and disrupt.",
    "“When you look back to the mid-2000s it’s night and day, because technology continues to change both the legal and illegal landscape,” Sharp told TechRadar Pro.",
    "“Video streaming in particular has been transformative for the entertainment industry, but it has also made life easier for criminals. It has changed the public perception of piracy too; when there’s no physical product, it’s harder to convince people an illegal act has taken place.”",
    "The scale of the piracy problem means it can be difficult for FACT to determine where best to invest its resources. But Sharp says his strategy is to continue to apply pressure and wear criminals down with “relentlessness” - and action against consumers of pirated content is on the cards too.",
    "A common justification for content piracy is that it’s a victimless crime; production companies and Hollywood stars can afford to make a little less cash, the argument goes. Others have painted pirates as Robin Hood-like figures, stealing from the rich and giving to the poor.",
    "This is a narrative Sharp has heard time and again in his 17 years at FACT and one he rejects as a misconception. The people who lose out as a result of piracy are not the wealthy actors and executives, he claims, but rather the everyman.",
    "“The amount of money it takes to produce a film or TV series is considerable, in the hundreds of millions,” he explained. “So if production companies are unwilling to take the risk on lower margin projects due to piracy, these kinds of productions just won’t exist. The fans will ultimately be the people that suffer.”",
    "“At even greater risk are those who have ‘normal' jobs in the industry - the sound engineers, camera operators, set builders and so forth. These people rely on ordinary wages in a business that’s fickle at the best of times, but money concerns will only create more insecurity.”",
    "Asked whether broadcasters and other industry players should take responsibility for their role in incentivizing piracy, by pricing people out of the legitimate market, Sharp was sceptical. “Broadcasters would probably say the pricing is commensurate with the cost of production...And there will always be a situation where people think they pay too much,” he said.",
    "Perhaps this is precisely the problem. As long as people think they are overpaying and resent the amount of money sloshing around in entertainment and sports, piracy will continue to feel like an act of sticking it to the man.",
    "The ethical questions surrounding piracy aside, a factor that is often overlooked is the potential for the end users themselves to find themselves in a perilous situation.",
    "According to security company Webroot, cybercriminals frequently abuse illegal streaming and torrenting websites to distribute malware and phish for personal data. And there is no way to eliminate this security risk, no matter how savvy or experienced the user.",
    "“The owners of illegal streaming sites need a way to create a stream of revenue and are therefore often happy to sell out the advertising space on their sites via illegitimate means,” explained Kelvin Murray, Senior Researcher at Webroot.",
    "“This then results in attackers occupying such space to plant links and pop-ups that cause serious security threats to the users.”",
    "The types of threats encountered on piracy sites are many and various, ranging from malware and ransomware to phishing and banking scams. Cryptojacking campaigns have also reportedly surged in popularity this year, as a result of the crypto boom.",
    "The long and short, says Murray, is that it’s impossible to remain safe on illegitimate websites, because their operators are not incentivized to put any of the usual structures in place that would usually shield visitors from attack.",
    "Although Webroot does not endorse the use of illegal streaming websites, it says there are a few red flags web users in general should be aware of, including pop-ups, multiple redirects and requests for browser settings to be changed.",
    "“We also recommend that, when browsing any site on the web, users update their software and operating systems, employ antivirus and anti-phishing detection, and double-check any links before clicking, especially when they profess to offer something that seems too good to be true,” added Murray.",
    "That said, however, not even the very best antivirus in the world will protect consumers of pirated content in the event of a law enforcement crackdown.",
    "Historically, while those that operate piracy websites and illegal streams have faced the prospect of legal action, the people who consume pirated content have largely gone unpunished.",
    "In recent months, for example, FACT has been involved in the arrest and prosecution of multiple individuals found to be selling or providing access to premium channels and sports content illegally, but in none of these cases were charges brought against end users.",
    "However, Sharp says a crackdown is on the horizon that will affect the parties on both sides of the piracy equation. Naturally, he couldn’t offer any specifics, but he promised something is in the works.",
    "“First and foremost, we want to educate people,” he said. “They need to be made aware they are putting money into the hands of criminals, that industries could be destroyed as a result of their failure to pay and that there are security risks attached.”",
    "“But people who continue to use illegal sites need to know there are sanctions as well. Beyond warning notices, there hasn’t really been a campaign to date that targets people who consume content illegally - but it’s coming.”",
    "It’s hard not to wonder whether the matronly tone and finger wagging have worked against FACT over the years. After all, some people love to rebel, especially if they think they can get away with it. But this time, Sharp warns, “it’s not an empty threat”."
  ],
  "headers": {
    "6": "A victimless crime?",
    "12": "The forgotten risk",
    "21": "A crackdown is coming"
  },
  "links": {
    "VPNs": "https://www.techradar.com/vpn/best-vpn",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "browser": "https://www.techradar.com/best/browser",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "arrest and prosecution": "https://www.fact-uk.org.uk/category/news/"
  }
}