{
  "source": "https://www.techradar.com/news/bitfinex-launches-system-for-contactless-crypto-payments",
  "title": "Bitfinex launches system for contactless crypto payments",
  "category": "computing",
  "updated": "2021-03-04T22:30:37Z",
  "author": "anthony-spadafora",
  "summary": "Paying for goods and services using crypto is about to get a whole lot easier",
  "article": [
    "The cryptocurrency exchange Bitfinex has announced the launch of its new payment technology Bitfinex Pay which will allow online merchants to receive contactless and borderless cryptocurrency payments.",
    "Through the use of an integrated widget, the company aims to appeal to both small and large businesses by providing online merchants with a way to receive digital token payments.",
    "The Bitfinex Pay widget can be added to any website that facilitates online payments and users will be able to pay with Ethereum, Bitcoin, Lighting Network BTC and Tether tokens using Ethereum or Tron. Payments made using the new system will then be directly deposited into a merchant's cryptocurrency wallet on Bitfinex.",
    "In a statement to CityAM, CTO at Bitfinex, Paolo Ardoino explained that the next generation of consumers are well aware of the benefits and possibilities offered by digital payments, saying:",
    "“As a native of the cryptocurrency space, we’re aiming to take on established behemoths in the technology and payments fields, leveraging our knowledge of the tech to bring crypto payments into the mainstream. When it comes to paying in crypto, there is a generational change in thinking, with the next generation of consumers attuned to the many new possibilities offered by digital payments.”",
    "Once a merchant integrates Bitfinex Pay with their online store, their customers can simply click on the Bitfinex Pay button to be directed to the payment gateway. Once the payment made using cryptocurrency is accepted by the merchant, the customer is then redirected back to the merchant's website.",
    "Although there are no processing fees for using the service, any transaction fees incurred on a cryptocurrency's blockchain will be paid by online merchants and their customers. Additionally, the value of payments made by customers using Bitfinex Pay is capped at $1,000.",
    "In order to get started using Bitfenix Pay, eligible merchants will need to register for a Bitfinex account, verify the account to at least the intermediate level and then apply for merchant verification. Once completed, a merchant sub-account can be created and merchants will then be able to add the Bitfinex Pay widget to their online stores.",
    "While cryptocurrency has grown in popularity as a means of investing, Bitfinex Pay and other similar solutions will make it easier for consumers to begin using their cryptocurrency for payments as opposed to just holding on to it.",
    "Via CityAM"
  ],
  "headers": {
    "5": "Bitfinex Pay"
  },
  "links": {
    "cryptocurrency exchange": "https://www.techradar.com/best/mining-rigs",
    "cryptocurrency payments": "https://www.techradar.com/news/you-can-now-pay-with-bitcoin-on-your-iphone",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "cryptocurrency wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "CityAM": "https://www.cityam.com/bitfinex-pay-launches-as-a-cryptocurrency-payment-system/",
    "digital payments": "https://www.techradar.com/news/contactless-and-digital-payments-set-to-boom-after-coronavirus",
    "payment gateway": "https://www.techradar.com/best/best-payment-gateways",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know"
  }
}