{
  "source": "https://www.techradar.com/news/the-mandalorian-season-3-will-start-shooting-soon-star-says",
  "title": "The Mandalorian season 3 will start shooting 'soon' – so when will it arrive?",
  "category": "entertainment",
  "updated": "2021-08-03T12:32:04Z",
  "author": "tom-power",
  "summary": "Filming on The Mandalorian season 3 is yet to begin",
  "article": [
    "The Mandalorian season 3 is set to begin filming soon, according to one of the Disney Plus show's supporting cast members.",
    "Giancarlo Esposito, who portrays Moff Gideon on the Star Wars spin-off series, revealed that principal photography on the third season of The Mandalorian would start in the near future.",
    "The actor was speaking during an appearance at GalaxyCon (per WRAL.com) and, when asked if production on The Mandalorian season 3 was still a long way off, Esposito explained that the wait wouldn't be too long.",
    "\"They [The Mandalorian's showrunners] just finished shooting Boba Fett and soon they will start on season three,\" Esposito said.",
    "The Book of Boba Fett – the other Star Wars TV show that Esposito mentions – is a Mandalorian spin-off series that is due to premiere in December 2021.",
    "According to star Ming Na-Wen, who will reprise her role as Fennec Shand in The Book of Boba Fett, filming wrapped on the series in early June, so it shouldn't be too much of a wait before season 3 of The Mandalorian kicks into gear.",
    "You'd be forgiven for thinking that filming on season 3 of The Mandalorian wouldn't begin for a long time.",
    "The series' main star – Pedro Pascal – is currently shooting the first season of HBO's The Last of Us live-action TV show. So, on the surface, you may be wondering how Disney and LucasFilm could shoot The Mandalorian's next instalment without its protagonist.",
    "Esposito, though, revealed that the rest of the cast and crew wouldn't have to wait for Pascal's schedule to clear up before they could begin shooting season 3.",
    "Asked if Pascal's absence would throw a spanner in the works, Esposito said (per WRAL.com): \"We never have to wait on Pedro.\"",
    "As viewers will already know, Pascal's character – Din Djarin, otherwise known as 'Mando' – is almost never seen without his helmet.",
    "It's a very rare occurrence for Djarin to remove his headgear, even though he has done so in the show on a couple of occasions now. However, the fact that Djarin wears a helmet will allow Disney and LucasFilm to press on with filming season 3.",
    "How? Well, by simply using a stand-in actor. As long as Pascal's stunt double, or another actor with a similar build, is available to wear Mando's suit, filming can take place without Pascal being present.",
    "The ex-Game of Thrones star can simply record his lines, for scenes he wasn't available for, at a later date in the studio. Filming on The Last of Us season 1 isn't expected to end until June 2022, so it's very likely that this will be the only way that Pascal will be able to be a part of season 3's production.",
    "With those plans in place, work on The Mandalorian season 3 could start sooner than we think. Our guess? It'll begin around October time (seasons 1 and 2 began filming in October 2018 and 2019 respectively) and it'll take until February or March 2022 for principal photography to be completed."
  ],
  "headers": {
    "6": "Analysis: when will The Mandalorian season 3 start filming?"
  },
  "links": {
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "WRAL.com": "https://www.wral.com/mandalorian-villain-talks-season-3-at-galaxycon-raleigh/19800325/",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "in early June": "https://twitter.com/MingNa/status/1402290182779375618?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1402290182779375618%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.cbr.com%2Fbook-of-boba-fett-ming-na-wen-gift-wrap-outfit%2F",
    "The Last of Us": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show"
  }
}