{
  "source": "https://www.techradar.com/news/bayonetta-3-is-back-and-she-has-a-brand-new-hairstyle",
  "title": "Bayonetta 3 is back, and she has a brand-new hairstyle",
  "category": "gaming",
  "updated": "2021-09-24T10:54:52Z",
  "author": "adam-vjestica",
  "summary": "Umbra-leivable",
  "article": [
    "It’s been three years, nine months, and 16 days since Bayonetta 3 was announced at The Game Awards 2017. But at long last, we got an official trailer and release window during the September 2021 Nintendo Direct.",
    "The trailer, which began with a clever Astral Chain 2 bait and switch, showed off plenty of trademark Bayonetta-style action, along with a brand-new look for the sadistically seductive witch. The short bob from Bayonetta 2 is gone, as the titular character is now rocking long, beautiful braids, which can of course transform into demonic creatures.",
    "Speaking of demons, it appears that Bayonetta will now be able to summon and control gigantic creatures during battles, which should mix up the game’s hack and slash formula quite a bit.",
    "We also saw Bayonetta briefly transform into some sort of spectacular butterfly to deliver a devastating combo, which wouldn’t look out of place on a Ru Paul’s Drag Race contestant – the outfit, that is.",
    "The action looks typically stylish, chaotic, and satisfyingly violent as usual, as enemies get slammed into spiked coffins and players can slow down time by performing a perfectly-timed dodge. If you like Bayonetta, then, there’s a strong chance you’ll love Bayonetta 3.",
    "The Nintendo Switch-exclusive Bayonetta 3 is the third entry in developer Platinum Games’ beloved series, and it’s almost a relief to see the game in action at this point. After teasing nothing but a logo at The Game Awards 2017, the wait for Bayonetta 3 has been drawn out, to say the least. Thankfully, a release window of 2022 was also provided in the game’s trailer.",
    "The game closed out the September 2021 Nintendo Direct presentation, which included the reveal of N64 and Sega Genesis games coming to Nintendo Switch Online, Kirby and the Forgotten Land, and a closer look at Splatoon 3. Overall, it was a pretty strong showing for Nintendo ahead of the Nintendo Switch OLED’s launch on October 8, 2021.",
    "If you're new to the Bayonetta franchise, both the original game and Bayonetta 2 are available to play on Nintendo Switch right now."
  ],
  "headers": {
    "5": "Analysis: absence makes the heart grow fonder"
  },
  "links": {
    "Bayonetta 3": "https://www.techradar.com/news/bayonetta-3",
    "September 2021 Nintendo Direct": "https://www.techradar.com/news/nintendo-direct-september-2021-all-the-biggest-announcements-you-need-to-know",
    "N64 and Sega Genesis games coming to Nintendo Switch": "https://www.techradar.com/news/nintendo-switch-online-to-offer-n64-and-genesis-games-with-new-subscription-plan",
    "Kirby and the Forgotten Land": "https://www.techradar.com/news/kirby-and-the-forgotten-land",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}