{
  "source": "https://www.techradar.com/news/new-apple-macbook-shipments-set-to-plummet-in-2022-over-silicon-shortage",
  "title": "New Apple MacBook shipments set to plummet in 2022 over silicon shortage",
  "category": "computing",
  "updated": "2021-09-27T18:02:55Z",
  "author": "john-loeffler",
  "summary": "Getting an M1 MacBook Air is about to get even harder",
  "article": [
    "Despite massive growth in Mac shipments in the early part of 2021 – a 115% increase for Q1 2021 to be exact, driven no doubt by the release of the new MacBook Air and 13-inch MacBook Pro powered by the Apple M1 chip – new Mac shipments are likely to see a huge drop-off in the first half of 2022.",
    "The report comes courtesy of Apple analyst Ming-Chi Kuo's latest investor's brief, which was picked up by MacRumors. Kuo expects a drop of about 15% in the first half of 2022 due to several factors.",
    "\"We forecast that the shipment of Apple Silicon processor-based MacBook models will be cut by approximately 15% in 1H22 and attribute it to three reasons: 1) component shortages, 2) structural demand change in the post- COVID-19 era, and 3) product transition between legacy and new models,\" Kuo wrote.",
    "While the structural demand for tech products of all kinds are expected to decline as more workers return to the office, there is also anticipation of new MacBook products powered by the Apple M1X chip being released sometime in October or November, which could cut into demand for last year's M1 powered models.",
    "At the same time, Unimicron, one of Apple's main suppliers, is making a major investment in expanding its capacity, and so is expected to take on more orders from other buyers to reduce the threat of revenue disruption from relying too much on Apple.",
    "It seems like every day a new story comes out about a delay of some product tied to the ongoing silicon draught, so the fact that MacBook shipments are likely to also be affected by it isn't really surprising.",
    "The news does reinforce something we talked about last week, namely that the silicon shortage isn't really a shortage as much as it is a systemic deficit.",
    "It looks increasingly like Apple is going to have problems meeting the demand for M1 MacBook products, even as it is releasing newer MacBook models with an improved in-house processor, which it is also likely to have difficulty sourcing for the foreseeable future.",
    "New tech products are constantly being released and the pace and growth in the number of products is increasing every year, so whatever capacity does get built, that extra capacity is going to be quickly eaten up by a growing number of products, so it's likely that it will have little effect on the overall problem of semiconductor supply – a technological analog of how building additional lanes for a highway to alleviate traffic doesn't do anything to actually reduce traffic.",
    "It might be time to recognize that our reliance on technological solutions to every conceivable problem is running into the limits of our ability to build those solutions."
  ],
  "headers": {
    "5": "Analysis: the silicon shortage is a systemic problem that isn't going away"
  },
  "links": {
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "MacRumors": "https://www.macrumors.com/2021/09/27/kuo-apple-silicon-macbook-orders-cut-1h-2022/",
    "Apple M1X chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "a systemic deficit": "https://www.techradar.com/news/semiconductor-firms-report-shortage-of-workers-prolonging-chip-woes-to-2022",
    "building additional lanes for a highway": "https://arstechnica.com/cars/2021/08/please-stop-adding-more-lanes-to-busy-highways-it-doesnt-help/"
  }
}