{
  "source": "https://www.techradar.com/news/xboxs-buying-spree-is-definitely-not-done-so-which-studio-is-next",
  "title": "Xbox's buying spree is ‘definitely not done’ – so which studio is next?",
  "category": "gaming",
  "updated": "2021-10-19T09:47:38Z",
  "author": "hamish-hector",
  "summary": "Is a Japanese studio on the cards for Xbox?",
  "article": [
    "Microsoft has spent the last few years acquiring company after company to collect a wide range of titles under its banner. Recent comments from Phil Spencer – the company's executive vice-president of gaming – have let us know that it has no plans to stop this strategy soon.",
    "The Xbox One was plagued by complaints that its library of exclusives wasn’t as strong as what was on the PS4, and Microsoft don't want the Xbox Series X to lose out to the PS5 for the same reasons. Its strategy has been to buy out multiple game developers and Spencer revealed at the Wall Street Journal Tech Live event that Xbox isn’t finished done yet.",
    "We don’t have a time frame for when the next studio could be bought up, with Spencer adding that he’s not under any pressure “to go acquire studios by a certain time, but if we find a studio where we have a good fit... absolutely”. Previously it has been suggested that another Japanese studio could fit well into Microsoft’s lineup, so who could it be looking to acquire?",
    "Xbox has a lot of studios to consider, and after the Bethesda acquisition, it's clear that Xbox is willing to spend some major cash to make a deal happen. This makes predicting its next move a little challenging.",
    "The Xbox brand has famously struggled in the Japanese market – especially against PlayStation and Nintendo with their home-court advantage. However, Xbox Series X and Series S are selling significantly better than past-gen consoles according to comments from earlier this year; if Xbox owns another Japanese studio this success might continue.",
    "With this in mind, we wouldn’t be surprised if Xbox wanted to join forces with a major player in the region.",
    "If this is the case, Capcom could make a perfect choice. The studio is home to some of gaming’s most iconic characters, and the renewed success of the Resident Evil franchise has cemented it as the kind of series that could help shift consoles if it was exclusive.",
    "Monster Hunter, Devil May Cry, and Street Fighter are equally beloved franchises, and under the Xbox banner, they would undoubtedly make the company’s consoles and services a much more enticing selection for fans of those series.",
    "A more left-field choice would be Square Enix. Over the years Square Enix has positioned itself as a strong Sony partner thanks to its significant array of PlayStation-exclusive content and support – from whole games like Final Fantasy 7 Remake to DLC such as Spider-Man in Marvel’s Avengers.",
    "Snatching up this company would not only net Xbox hugely popular gaming franchises (including Tomb Raider, Final Fantasy, and Kingdom Hearts to name a few) but it would also be a direct blow against its rival Sony.",
    "There are certainly other great picks out there for studios and publishers that could be just what Xbox is after – Bandai Namco and its anime game licenses could help attract plenty of fans, though the studio’s relationship with Nintendo and Super Smash Bros. would likely make this a difficult buy.",
    "However, in terms of another industry-shattering acquisition Xbox would be best snapping up one of these two companies. As always though, for now, we’ll just have to wait and see."
  ],
  "headers": {
    "3": "Analysis: Who could Microsoft acquire next?"
  },
  "links": {
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "PS4": "https://www.techradar.com/reviews/ps4-pro",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Wall Street Journal Tech Live event": "https://techlive.wsj.com/",
    "another Japanese studio could fit well into Microsoft’s lineup": "https://www.gamespot.com/articles/microsoft-reportedly-looking-to-acquire-japanese-game-studios/1100-6484223/",
    "comments from earlier this year": "https://www.techradar.com/news/xbox-series-x-is-seeing-phenomenal-growth-in-japan-no-seriously"
  }
}