{
  "source": "https://www.techradar.com/news/should-i-buy-an-outdoor-tv",
  "title": "Should I buy an outdoor TV?",
  "category": "televisions",
  "updated": "2021-10-01T11:27:48Z",
  "author": "christian-de-looper",
  "summary": "Outdoor TVs are expensive, but for some people, they’re worth it",
  "article": [
    "Let’s face it, most people do not have the budget, space or set-up for an outdoor TV. But for those that do, is an outdoor TV worth it or a waste of time and money?",
    "Budget concerns aside, outdoor TVs (much like outdoor projectors are a great idea if you have outdoor space that can accommodate an entertainment area – ideally with some cover so you can watch it without being rained on.",
    "Whether that means you have a patio with furniture and a TV would be the perfect addition to create your own garden cinema or you spend a lot of time outside BBQ-ing and entertaining so it’d add to the atmosphere.",
    "No matter your reason for considering an outdoor TV, there are a few things you should know before you pull the trigger on what is likely to be an expensive investment.",
    "There are plenty of reasons to consider buying an outdoor TV. You might want to use it for general entertaining, keeping your kids occupied as they play, watching sports as you cook on a grill. Whatever the reason, it’s important to know what to expect and how to get the most out of your money.",
    "Indoor TVs are getting better and better every year thanks to technology including OLED, HDR, and high resolutions like 4K. Thankfully, outdoor TVs aren’t missing out. But the latest technology is often a little slower to show up on outdoor TVs compared to indoor ones. The outdoor TVs that do have this tech are often more expensive than indoor options too.",
    "Having said that, if you don’t mind spending a little extra cash to get the right product, and feel that an outdoor TV would complete your outdoor setup (you really need to think about whether you’ll watch it enough to justify the price tag), then it may be worth buying one.",
    "There are two main issues to consider when buying a TV for outdoor use: weather, and security. Let’s start with weather.",
    "There are a few ways to ensure that your TV doesn’t get damaged in bad weather. The first way to do this is to buy a TV that was designed and built to be used outside. TVs specifically made for outdoor use usually have some kind of weather-proofing, and a display that's bright enough to offer a good image even in direct sunlight – but these are often bulkier and more expensive than their indoor counterparts.",
    "The other option is you buy a regular TV, but keep it in a weather-proof case that you close when you’re not using it. In this situation, you’ll have to ensure that you’re not using the TV when it’s raining or snowing, and this probably isn’t the best option for areas where it gets really cold or really hot. The advantage to this, however, is that you can spend less on your new TV – and in some situations, it may look better too.",
    "Ultimately, if you can afford to, we recommend buying a TV that's designed for outdoor use. This ensures that even if the weather gets a little crazy, your TV should remain unscathed – and you don’t have to worry about perfectly sealing up your TV when you’re not using it either. That’s true even under a covered patio. There are other risks besides rain – such as insects, temperature variation, and so on that are worth considering, depending on where you live.",
    "The other main issue is security. It’s a good idea to ensure that the area you keep your outdoor TV in is as hidden as possible from passers-by. And, it’s also a good idea to have a security camera set up outside near it in case something does happen. Of course, you should also make sure that your TV is properly bolted into a wall, rather than just having it on a stand like you might use inside your home.",
    "If you want to put a TV outdoors, you’re going to have to pay a premium for it. If you buy a purpose-built TV, you’re looking at around $1,000 on the low-end, around $3,000 for a mid-range outdoor TV option and in excess of $6,000 for one of the premium models, like Samsung's The Terrace Full Sun model 2.",
    "In terms of which models to go for, not every brand makes outdoor TVs. However, SunBrite makes a range of outdoor TVs, and the Samsung “The Terrace” series is purpose-built for outdoor use too.",
    "If you want to save cash, buying a standard TV and outdoor TV cabinet may be the way to go, considering you could buy a normal TV for a relatively small amount, and a cabinet for not much more. All in, you should be able to put together a solution for well under the cost of a dedicated outdoor TV.",
    "If you go for this option, you should consider looking at reviews for models before buying, and specifically looking for any mention of how the TV handles glare or reflections. The Samsung Q80T series is a good example of a TV that excellently handles reflections and glare to make for a clear image.",
    "One solid alternative to an outdoor TV is to invest in a great outdoor project instead. This is a good option if you want to be able to move your tech inside and outside your home relatively easily, if you don't want to commit to outdoor viewing or if you want to have a cinema-worthy movie night with a massive screen space that a TV could never give you."
  ],
  "headers": {
    "4": "Should I buy an outdoor TV?",
    "7": "Is it safe to put a TV outdoors?",
    "12": "What does an outdoor TV cost?",
    "16": "Outdoor TV alternatives"
  },
  "links": {
    "outdoor projectors": "https://www.techradar.com/best/outdoor-projector",
    "OLED": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "4K": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "have a security camera": "https://www.techradar.com/news/best-home-security-camera",
    "Samsung's The Terrace Full Sun model 2": "https://www.techradar.com/news/samsung-launches-new-75-inch-outdoor-tv-for-those-sunny-days",
    "SunBrite makes a range of outdoor TVs": "https://www.techradar.com/news/should-i-buy-a-sunbritetv-a-look-at-the-outdoor-weatherproof-tv-manufacturer",
    "Samsung “The Terrace” series": "https://www.techradar.com/news/take-your-samsung-tv-outdoors-with-this-weatherproof-qled-display",
    "Samsung Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv"
  }
}