{
  "source": "https://www.techradar.com/news/windows-10-update-could-make-it-easier-to-optimize-your-device-for-specific-use-cases",
  "title": "Windows 10 update could make it easier to optimize your device for specific use cases",
  "category": "computing",
  "updated": "2021-02-16T15:13:00Z",
  "author": "barclay-ballard",
  "summary": "Applications may benefit from a settings tweak",
  "article": [
    "Microsoft is exploring some new optimization options for Windows 10 that would allow users to personalize their devices depending on what they are predominantly used for. The new feature is only being tested in Preview builds so it’s not entirely clear how it will eventually look when it gets a general release, or if it will be pursued at all long-term.",
    "The change will be part of a revamped Settings app that will include a new “Device Usage” section, which will appear under the “Personalization” page. Users will be given six main usage categories to choose from: Gaming, Family, Creativity, Schoolwork, Entertainment, and Business.",
    "Currently, it’s not clear how Windows 10 will optimize a device for the user’s chosen category. For example, if users select “Gaming,” the operating system could tweak the battery, visual effects, and mouse settings to ensure that the device is set up in the best possible way for video game players.",
    "The “Device Usage” feature could be an extension of the update coming to Microsoft’s out of the box experience (OOBE) screen, which is designed to help users set up their device following Windows 10 feature updates.",
    "“When customers turn on their Windows PCs for the first time, they will see the Windows Out of Box Experience,” Microsoft documentation explains. “OOBE consists of a series of screens that require customers to accept the license agreement, connect to the internet, log in with, or sign up for a Microsoft Account, and share information with the OEM.”",
    "However, the OOBE has been around for a few years now and it seems as though Microsoft is trialing new customization options for the feature. It’s possible that more information will be released during Windows 10’s next major feature update coming later this year.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "The personal touch"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Gaming": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Schoolwork": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385",
    "Business": "https://www.techradar.com/news/best-business-desktop-pcs",
    "operating system": "https://www.techradar.com/news/best-alternative-operating-systems",
    "explains": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1228830846116860000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fwindows-hardware%2Fcustomize%2Fdesktop%2Fcustomize-oobe%23%3A~%3Atext%3DWhen%2520customers%2520turn%2520on%2520their%2Cshare%2520information%2520with%2520the%2520OEM.",
    "Windows Latest": "https://www.windowslatest.com/2021/02/16/windows-10-is-getting-device-usage-personalization-settings/"
  }
}