{
  "source": "https://www.techradar.com/news/turns-out-onlyfans-wont-be-banning-porn-at-least-for-now",
  "title": "Turns out OnlyFans won't be banning porn – at least for now",
  "category": "computing",
  "updated": "2021-08-25T23:31:13Z",
  "author": "david-lumb",
  "summary": "OnlyFans has suspended its porn ban, but for how long?",
  "article": [
    "After pushback, OnlyFans has suspended its planned ban on sexually-explicit content, which was set to occur on October 1.",
    "OnlyFans announced the decision via Twitter, explaining that the company had “secured assurances necessary to support our diverse creator community.”",
    "Presumably, the company is referring to assurances from financial institutions (banks and payment providers) – when OnlyFans previously announced that it had changed its policies to ban sexually explicit material, it did so “to comply with the requests of our banking partners and payout providers,” according to an official statement.",
    "In a recent Financial Times article, OnlyFans CEO Tim Stokely laid the blame squarely on banking: ““The change in policy, we had no choice — the short answer is banks.” He cited increased roadblocks from financial institutions, which claimed reputational risk in permitting such services and made it harder for payments to go to creators.",
    "Stokely rejected that providers like Mastercard or investor pressure were to blame, as suggested in the initial Bloomberg report laying out the potential reasons behind OnlyFans’ decision."
  ],
  "headers": {},
  "links": {
    "planned ban": "https://www.techradar.com/news/onlyfans-bans-sexual-content-leaving-its-future-uncertain",
    "Twitter": "https://twitter.com/OnlyFans/status/1430499277302816773",
    "Financial Times": "https://www.ft.com/content/7b8ce71c-a87a-440e-9f3d-58069ca0480b",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-19/onlyfans-to-block-sexually-explicit-videos-starting-in-october"
  }
}