{
  "source": "https://www.techradar.com/news/almost-all-experts-say-multi-cloud-needs-a-serious-security-upgrade",
  "title": "Almost all experts say multi-cloud needs a serious security upgrade",
  "category": "computing",
  "updated": "2021-07-08T09:58:14Z",
  "author": "mayank-sharma",
  "summary": "Securing the cloud is still “somewhat ambiguous”",
  "article": [
    "The move towards a multi-cloud computing environment, while beneficial, also poses a great security threat to businesses, a new survey has claimed.",
    "A study by Tripwire covered security professionals responsible for the security of the public cloud infrastructure within their organization.",
    "A majority of the respondents (73%) currently operate in a multi-cloud environment, but virtually all (98%) of the security professionals responsible for these environments report that relying on multiple cloud providers also creates additional security challenges.",
    "“Given the growing complexity of systems and threats that come with moving to a cloud environment and security policies that are unique to each provider, it makes sense that organizations are finding it increasingly difficult to secure the perimeter,” said Tim Erlin, vice president of product management and strategy at Tripwire.",
    "With the survey, Tripwire hoped to evaluate the cloud security practices across enterprise environments in 2021.",
    "It discovered that while a majority (59%) have configuration standards for their public cloud and many (78%) use best-practice security frameworks, only a small subset (38%) applies them consistently across their cloud environment.",
    "Shared responsibility was another aspect that was highlighted in the survey. Many of the respondents expressed that the shared responsibility models for security between cloud service providers and their customers isn’t always clear.",
    "In fact, three-quarters of the respondents admitted to relying on third-party tools or expertise to secure their cloud environment.",
    "The respondents were also unanimous (98%) in their demand for seeing specific security improvements from their cloud providers, including communicating security issues faster and following consistent security frameworks."
  ],
  "headers": {
    "4": "Securing the cloud"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Tripwire": "https://www.techradar.com/news/nearly-all-security-professionals-are-struggling-to-secure-their-iot-and-iiot-devices",
    "public cloud": "https://www.techradar.com/news/what-is-public-cloud"
  }
}