{
  "source": "https://www.techradar.com/news/lg-rollable-teased-as-the-first-phone-with-a-rollable-screen",
  "title": "LG Rollable finally shown off as a foldable phone alternative at CES 2021, launching later this year [updated]",
  "category": "phones",
  "updated": "2021-01-12T21:55:03Z",
  "author": "james-rogerson",
  "summary": "It's official, and launching sometime in 2021",
  "article": [
    "Update: Sources familiar with LG's plans told CNET that the LG Rollable will be coming in 2021, and an LG spokesperson just confirmed to Nikkei that it will be \"launched this year.\"",
    "Original story: We’ve been hearing rumors of the LG Rollable for a while now, but at CES 2021, LG officially confirmed the name of the phone, while also providing a brief glimpse of it in a teaser.",
    "From the teaser you can see something that starts out looking much like a conventional smartphone, but with edges that extend to create a small tablet, as shown in the image above.",
    "This makes it very different in design to a foldable phone then, but the end result is somewhat similar, giving you the option of either a large screen or a smaller one at any given time.",
    "We don’t know anything else about the LG Rollable yet, including when you’ll be able to buy it, but with LG providing a clear view of the front of the phone in a teaser it’s very likely that it will go on sale this year, and possibly sooner rather than later.",
    "Hopefully you’ve been saving though, because a recent leak suggested that the LG Rollable might cost as much as $2,359 (roughly £1,775, AU$3,130).",
    "Still, LG isn’t the only company working on a rollable phone – the Oppo X 2021 concept phone also rolls, as does a concept device from TCL. There’s no guarantee either of those will ever actually go on sale, but sooner or later there are likely to be multiple rollable phones on the market, so hopefully some of them are affordable."
  ],
  "headers": {
    "4": "Lots left to learn"
  },
  "links": {
    "CNET": "https://www.cnet.com/news/the-lg-rollable-phone-unveiled-at-ces-is-actually-real-coming-out-in-2021/",
    "Nikkei": "https://asia.nikkei.com/Business/CES-2021/LG-to-release-world-s-first-rollable-smartphone-developed-with-BOE",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "recent leak": "https://www.techradar.com/news/lg-rollable-price-leak-suggests-it-could-be-the-most-expensive-foldable-phone",
    "Oppo X 2021": "https://www.techradar.com/news/oppos-next-foldable-phone-will-have-a-rollable-oled-display-but-you-cant-buy-it"
  }
}