{
  "source": "https://www.techradar.com/news/audacity-reverses-opt-in-telemetry-plans-following-user-revolt",
  "title": "Audacity reverses opt-in telemetry plans following user revolt",
  "category": "computing",
  "updated": "2021-05-17T15:30:20Z",
  "author": "mayank-sharma",
  "summary": "Developers say they failed to communicate their intentions",
  "article": [
    "The developers behind popular open source app Audacity have reversed their decision to enable opt-in telemetry data collection after a strong backlash from its community.",
    "It’s been an eventful year for the cross-platform free audio editor. First, it reached a major milestone with the 3.0 release in March, almost a decade after its previous major release. Then, at the end of April, it was acquired by the Muse group, which hosts a variety of tools, content, and communities for musicians.",
    "Following the change in leadership, one of Audacity’s core developers Dmitry Vedenko sent in code to enable a \"strictly optional and disabled by default\" telemetry data collection option.",
    "Despite it being optional, the feature was universally panned by Audacity’s community, forcing the developers to backtrack and remove it altogether.",
    "Explaining the introduction of the feature as a coordination blunder, Muse Group’s head of creative software Martin Keary said the backlash caught them completely by surprise.",
    "“We're very sorry for causing so much alarm. Our intention was to make an initial announcement about our plans to introduce telemetry on the Audacity forum, similar to how we discussed the topic for MuseScore in 2019. In that instance, I think the fact that we introduced the issue openly resulted in a lot less suspicion,” explained Keary.",
    "Keary believes that the community misunderstood their intentions behind enabling the feature, and rightly so, since Muse didn’t share them with the community before introducing the code.",
    "He stressed that Muse has no interest whatsoever in harvesting or selling user’s personal data and the fact that the feature was opt-in would allay any privacy concerns.",
    "The use of third-party tools for analytics from Google and Yandex didn’t help matters either, and created further rift.",
    "Keary acknowledged this as well, saying that Muse management has realized that the convenience of using Yandex and Google doesn’t sit well with the public perception of trustworthiness, which is why the company will self-host the telemetrics collection, if and when it does so.",
    "“In the future, we may want to determine if there are any acceptable alternative solutions that could achieve the same goal. Feedback would be appreciated on this point,” he concluded.",
    "Via ZDNet"
  ],
  "headers": {
    "6": "Miscommunication or misadventure?"
  },
  "links": {
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Audacity": "https://www.techradar.com/reviews/audacity",
    "free audio editor": "https://www.techradar.com/news/the-best-free-audio-editor",
    "3.0 release": "https://www.techradar.com/news/audacity-30-finally-lands-after-years-of-waiting",
    "Google": "https://www.techradar.com/reviews/google-seo-tools",
    "ZDNet": "https://www.zdnet.com/article/audacity-reverses-course-on-plans-to-add-opt-in-telemetry-after-outcry/"
  }
}