{
  "source": "https://www.techradar.com/news/i-shouldnt-care-that-my-running-watch-isnt-pretty-but-i-kinda-do",
  "title": "I shouldn't care that my running watch isn't pretty... but I kinda do",
  "category": "fitness",
  "updated": "2021-06-11T15:08:01Z",
  "author": "cat-ellis",
  "summary": "Opinion: if I'm wearing a watch 24/7, it needs to look grown up",
  "article": [
    "I feel like I shouldn’t care how my tech looks – it’s the components that actually matter – but I can’t help being bothered that most running watches are, frankly, pretty ugly. The Garmin Instinct Solar is one of my favorite wearables of all time – it’s packed with so many sports tracking tools and has such great battery life – but it’s a chunky beast of a thing. One of its colorways is a pleasing shade of lilac, but you can’t escape the fact it’s built like a tank.",
    "Right now, I use a Garmin Vivoactive 4S for running. I’ve tried and enjoyed a lot of great running watches from various companies, but the Garmin Connect app remains my favorite. It just has so many features, including free training plans and workouts, which you might normally have to pay for separately, and it pools data from all your Garmin devices in one handy, well organized dashboard.",
    "However, I only strap it on when I’m about to head out on a run, or to the gym – for everyday use, it just feels too chunky and, frankly, inelegant. That’s a problem for a device that’s meant to be worn 24/7 to track your sleep, recovery, stress levels and activity – not just training sessions.",
    "My everyday timepiece is a little solar-powered Seiko analog watch (a birthday gift from my parents 10 years ago) with a 33mm case and matching two-tone metal bracelet. It’s nothing extraordinary, but it’s grown up, while even high end running watches more closely resemble the turquoise Baby-G I wore to school in the late 90s.",
    "I’m not asking wearable companies to ‘shrink it and pink it’ – the tired and pretty insulting marketing theory that if women aren’t buying a particular product, you can simply make it smaller and paint it a rosy hue and they’ll be unable to resist.",
    "I’m not imagining a watch specifically for women either. Neutral colors and metallics are great, provided it's something that looks like something an adult could wear for all occasions. Is this something that you could reasonably wear to job interview, a nice dinner, or a friend's wedding?",
    "Some of the big companies are starting to take notice, and developing fitness trackers designed for people with an aversion to chunky plastic and silicone wearables. A few days ago, Fitbit launched its latest fitness tracker, the Fitbit Luxe. As the name implies, it’s a classy looking device; although its basic shape is very similar to the Fitbit Inspire 2, it has a stainless steel case and buckle rather than plastic and, most interestingly, is available in a special edition version with a gold-toned bracelet designed by a jeweller.",
    "In a similar vein, Garmin recently launched the Garmin Lily – a fitness tracker designed for and by women, with a particularly thin band (silicone or leather) and a face measuring a mere 34.5mm across that’s backlit with a patterned design that looks attractive even when switched off.",
    "Unfortunately, both of these devices have one major drawback: while they’re great everyday fitness trackers, there’s no on-board GPS, and certainly no advanced training tools like a virtual coach. If you’re a runner who wants to train smarter, you’re trading functionality for style and will need a second device when it's time for a workout.",
    "There are all-purpose smartwatches that may seem to fill this niche – things like the Apple Watch 6 and Apple Watch SE, or the Amazfit GTS 2 Mini – but again, these lack the sports-specific tools you’d get from an unpretty Polar or Coros device, and they're not as attractive as the Lily or as slender as the Luxe.",
    "So what would such a watch be like? Well, first of all, GPS would be essential (on-board rather than connected) so routes can be mapped accurately without piggybacking on your phone, plus a dedicated running app for tracking metrics like distance, pace, speed, heart rate and cadence.",
    "Of course, size is a limiting factor; a small face is able to display much less information than the broad display of the Garmin Fenix 6, and on-screen mapping would be downright impractical on a super-small device.",
    "One alternative would be spoken directions, and voice instructions for training plans. Spoken-word training plans would be great too, as would the ability to hear your current pace and distance through wireless headphones with a quick tap, or hear advice from a coach if following a training plan.",
    "Similarly, voice controls would be an excellent feature. They're nothing new for smartwatches, and would be a handy supplement to a little touchscreen and/or physical buttons for performing common tasks.",
    "Some of the data you'd get on a full-scale sports watch may only be visible in the app, such as training load and recovery stats, which might be a little less convenient, but it's not the type of info you'll need while you're mid-workout.",
    "In short, there would certainly be some sacrifices necessary to make a true running watch that's more compact and mature in design, but perhaps the introduction of more fashion-forward fitness trackers in recent months means that such a device might not be too far off."
  ],
  "headers": {
    "10": "My ideal running watch"
  },
  "links": {
    "running watches": "https://www.techradar.com/best/running-watches",
    "Garmin Instinct Solar": "https://www.techradar.com/reviews/garmin-instinct-solar",
    "Garmin Vivoactive 4S": "https://www.techradar.com/reviews/garmin-vivoactive-4",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Luxe": "https://www.techradar.com/reviews/fitbit-luxe",
    "Fitbit Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "Garmin Lily": "https://www.techradar.com/reviews/garmin-lily",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Amazfit GTS 2 Mini": "https://www.techradar.com/reviews/amazfit-gts-2-mini",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "wireless headphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}