{
  "source": "https://www.techradar.com/news/windows-11-for-mac-is-on-its-way",
  "title": "Windows 11 for Mac is on its way",
  "category": "computing",
  "updated": "2021-07-01T11:44:49Z",
  "author": "joel-khalili",
  "summary": "Parallels will do ‘everything possible’ to bring Windows 11 to Mac",
  "article": [
    "Windows 11, the newly announced OS from Microsoft, will be coming to Mac devices sooner rather than later, Parallels has confirmed.",
    "Speaking to our sister site iMore, the virtualization software company announced it is ready to start digging into Windows 11 to gain a better understanding of the new features and changes.",
    "“Since Windows 11 has just been announced recently, the Parallels Engineering team is waiting for the official Windows 11 Insider Preview build to start studying changes introduced in the new OS to deliver full compatibility in future Parallels Desktop updates,” said Nick Dobrovlskiy, SVP of Engineering and Support.",
    "Although he was unable to say precisely when users will be able to run Windows 11 on Mac, Dobrovolskiy did promise Parallels will “do everything possible to make it happen”.",
    "First launched in 1999, Parallels offers a variety of Windows virtualization software, for ChromeOS as well as Mac. The firm also provides a range of mobile device management and virtual desktop services geared towards business customers.",
    "Last year, Parallels launched the latest version of its service for Mac, Parallels Desktop 16. This version is optimized to run Windows 10 on macOS Big Sur, with testing underway on the macOS Monterey beta “to ensure compatibility as soon as it is released”.",
    "The company was also quick to roll out native support for Apple’s new M1 chip, which was found to deliver 30% greater performance than an Intel Core i9 CPU when running Windows 10 on Mac.",
    "Given the first Windows 11 preview build went live earlier this week, it’s safe to assume Parallels engineers are already getting their hands dirty in preparation of a future Parallels Desktop update.",
    "Although not all new Windows 11 features are available in the current build - notable absences include Android and Microsoft Teams integrations - the preview has given early access members a first glimpse of the new interface, Start menu, widgets and more.",
    "Microsoft’s new OS won’t be made available to the public until the end of the year at the earliest, while those updating from Windows 10 will have to wait until 2022, so Parallels has a few months yet to set the stage for Windows 11 on Mac.",
    "Via iMore"
  ],
  "headers": {
    "4": "Windows 11 for Mac"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "virtualization software": "https://www.techradar.com/best/best-virtual-machine-software",
    "mobile device management": "https://www.techradar.com/best/best-mdm-solutions",
    "virtual desktop": "https://www.techradar.com/best/virtual-desktop-services",
    "native support for Apple’s new M1 chip": "https://www.techradar.com/news/parallels-desktop-165-runs-windows-10-on-an-m1-chip-much-faster-than-an-intel-macbook",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "iMore": "https://www.imore.com/windows-11-mac-works-parallels-confirms"
  }
}