{
  "source": "https://www.techradar.com/news/dwayne-johnson-wants-black-adam-to-fight-a-specific-dc-superhero-and-it-isnt-shazam",
  "title": "Dwayne Johnson wants Black Adam to fight a specific DC superhero – and it isn't Shazam",
  "category": "entertainment",
  "updated": "2021-12-07T16:57:35Z",
  "author": "tom-power",
  "summary": "Black Adam vs Superman? Consider us sold",
  "article": [
    "Black Adam star Dwayne Johnson has revealed which DCEU superhero he wants his anti-hero to fight – and it isn't the character's arch nemesis Shazam.",
    "In an interview with Total Film magazine, Johnson said that he'd like to see Black Adam face off against Superman in a future DCEU movie. That's despite the fact that Black Adam is more commonly associated with another DC comics superhero in Shazam, who is expected to go head to head with Teth-Adam in a future DCEU project.",
    "Speaking as part of a wider ranging chat, Johnson teased the prospect of a Black Adam vs Superman battle in the DCEU's future, but the popular actor admitted that it may be a while before such a possibility occurs.",
    "That's because Superman's DCEU future, unlike that of Batman, Wonder Woman, The Flash or Aquaman, is still unclear. Henry Cavill has suggested that his time as Superman isn't over (per The Hollywood Reporter), while the same news outlet suggested that Warner Bros. are searching for a Black actor to portray the character if they reboot Superman's live-action iteration again.",
    "\"We can do anything if we keep the audience first,\" Johnson said. \"So to me, there’s a battle that’s going to go down one day, between Black Adam and Superman. I don’t know who that Superman is going to be, and I don’t know who’s going to play him. That’s OK. I don’t need to know right now. But I’m confident in knowing that [laughs]. And that’s based out of what fans want. We worked backwards from there.\"",
    "After seven years in development hell, Black Adam's solo movie will finally see the light of day next year. Starring Johnson as the titular anti-hero, as well as other big-name actors including Pierce Brosnan (James Bond), Aldis Hodge (Straight Outta Compton), and Noah Centineo (To All the Boys I've Loved Before), Black Adam will launch exclusively in theaters on July 29, 2022.",
    "Given Johnson's comments about wanting to see Black Adam duke it out with Superman, some Shazam fans may be concerned that Teth-Adam may not end up crossing paths with Zachary Levi's magic-imbued superhero.",
    "Shazam and Black Adam, though, are expected to engage one another in the DCEU: it just won't be happening for a while yet.",
    "The duo were lined up to clash in 2019's Shazam! but, in January 2017, Warner Bros. made the decision to give both characters their own standalone movies, with the view to building up to a Batman vs Superman-style face-off in the future.",
    "While Black Adam's live-action debut will arrive next year, however, the sequel to Shazam! – Fury of the Gods – won't arrive in theaters until June 2023. That means that it'll be a few more years before we see Black Adam and Shazam cross paths as intended.",
    "Given how busy Johnson is right now, too, it might be more than a few years before we see these two particular DC characters go toe to toe. Currently, Johnson is filming Young Rock season 2, while he's also lined up to appear in forthcoming movies including San Andreas 2 and The King, as well as remakes of Big Trouble in Little China and Doc Savage.",
    "So yes, we'll see Shazam and Black Adam fight at some point: just don't expect it to be anytime soon, unfortunately. We'll just have to enjoy seeing Johnson as Black Adam in July 2022 instead, as well as the actor portraying Superman's dog Krypto in Warner Bros' animated superhero movie DC League of Super Pets, which arrives in theaters on May 20, 2022."
  ],
  "headers": {
    "6": "Analysis: will Black Adam still fight Shazam?"
  },
  "links": {
    "Total Film magazine": "https://www.gamesradar.com/uk/dwayne-johnsons-confident-that-we-will-see-his-black-adam-take-on-superman/",
    "Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer",
    "Wonder Woman": "https://www.techradar.com/news/why-wonder-woman-1984-is-disappointing",
    "The Flash": "https://www.techradar.com/news/the-flash-movie-release-date-cast-multiple-batman-actors-and-more-explained",
    "Aquaman": "https://www.techradar.com/news/aquaman-2-release-date-cast-and-what-else-we-know-about-dcs-return-to-atlantis",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-features/henry-cavill-interview-witcher-superman-1235044553/",
    "the same news outlet": "https://www.hollywoodreporter.com/movies/movie-news/black-superman-ta-nehisi-coates-warner-bros-movie-1234947599/"
  }
}