{
  "source": "https://www.techradar.com/news/walmart-is-slashing-the-price-of-this-4k-google-chromecast-for-black-friday",
  "title": "Walmart is slashing the price of this 4K Google Chromecast for Black Friday",
  "category": "gaming",
  "updated": "2021-11-25T14:54:28Z",
  "author": "rhys-wood",
  "summary": "With some tempting Chromecast bundles too",
  "article": [
    "After a Walmart Black Friday deal on a a top-tier streaming device? The Google Chromecast with Google TV is an astonishingly good streamer that launched in late 2020, and we're now seeing it sell with a decent discount across the United States' biggest retailers.",
    "The Google Chromecast with Google TV is now just $39.00 at Walmart in a white coloring, marking an $11 discount on this heavy-duty streamer. The blue edition appears to have been selling for just $30, but is now sold out.",
    "There's also a similar $10 discount on the older Google Chromecast (3rd gen), which carries Android TV and is now just $19.98.",
    "We were huge fans of the Chromecast with Google TV in our review, calling it \"a revelation – it fixes something that wasn't broken, and improves a nearly perfect technology in a tangible way. And it's all thanks to the remote and Google's 'new' software, Google TV.",
    "\"Combined, the two offer a massive uptick in usability over previous Chromecasts that required you to use your phone or tablet to Cast content rather than giving you an on-screen interface to interact with.\"",
    "But any of the Chromecast hardware above should serve you well, with thousands of apps on offer, a sensible and straightforward interface (Android and Google TV both), and support for Google Assistant voice commands.",
    "No matter where you live, you'll find all the lowest prices for streamers from around the web right here, with offers available in your region.",
    "Shop more offers with our roundup of the best Amazon Black Friday deals and see more bargains with our guide to the best Black Friday Apple deals that are happening right now."
  ],
  "headers": {
    "3": "Today's best Google Chromecast Black Friday deals",
    "6": "More streaming device deals",
    "7": "See more of today's best Black Friday sales"
  },
  "links": {
    "Walmart Black Friday deal": "https://www.techradar.com/news/live/walmart-black-friday-deals-launch-today-and-were-live-updating-all-the-top-sales",
    "just $39.00": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-6255204723667088000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FChromecast-with-Google-TV%2F403830906",
    "now just $19.98": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-5600387650429929000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FGoogle-Chromecast-3rd-Gen%2F435188866",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
    "Black Friday Apple deals": "https://www.techradar.com/black-friday/apple-black-friday-deals"
  }
}