{
  "source": "https://www.techradar.com/news/beat-saber-teasing-facebook-connect-update-what-else-do-we-expect-to-see",
  "title": "Beat Saber teasing Facebook Connect update – what else do we expect to see?",
  "category": "gaming",
  "updated": "2021-10-28T15:13:21Z",
  "author": "hamish-hector",
  "summary": "What new games will be announced at Facebook Connect?",
  "article": [
    "We’re counting down to today’s Facebook Connect Oculus Quest event, and we’re starting to get a good idea of what we’re likely to see. Following leaks earlier this week that suggest a new Oculus Quest VR headset will be making an appearance, we now know that Beat Saber, the VR rhythm game for Oculus, will feature too.",
    "Beat Saber’s appearance was teased by the game’s official Twitter account, and plenty of fans are excited to see what could be shown off. Most likely it’ll be new tracks to play in the game, following the most recent updates that added Billie EIlsih songs and the Interscope Mixtape (which includes tracks by LMFAO, One Republic, and The Pussycat Dolls) among others). We just hope these new additions are free, rather than paid DLC.",
    "It’s no surprise to hear that Beat Saber will be at the Facebook Connect event later today. Not only is it a first-party Facebook title, but it’s one of the best Oculus Quest Games we’ve played (and one of the best VR games in general).",
    "In addition to games and hardware, what else can we expect to see at Facebook Connect?",
    "We’ve already mentioned the potential reveal of the Oculus Quest 3 or an Oculus Quest 2 Pro, as well as updates to Beat Saber, but the event is expected to be fairly long – with events going on for as much as seven hours after Mark Zuckerberg’s introductory keynote. That gives Facebook plenty of time for announcements.",
    "The potential announcement we’re most anticipating is a new name for Facebook. Facebook has been teasing its name change – most likely for the company rather than the social media platform – for a while now as it works towards crafting a ‘metaverse’. Announcing the change at an event focused on its popular VR platform would be a smart move by Facebook, as a way to distance its new name from the terrible press its social media platforms have been getting recently.",
    "While Facebook’s new name is still a mystery at this point, our best guess would be something like Horizon – branding the company is already using with its Horizon Worlds social platform. It’s a name that carries a sense of heading into a bright future – a notion that the company would very much like to sell both to its users and the wider world. If this rebrand happens, we might also see the Oculus Quest 2’s Facebook account stipulation lifted, in exchange for a new ‘Horizon account’. Currently, players need to have a Facebook account to use Oculus headsets, something which many fans aren’t happy about. A move away from this restriction would again help to put some space between Facebook’s social media woes and the company’s less contentious venture – though we still expect that you’ll need some form of centralized account as Facebook moves towards its interconnected metaverse.",
    "As for Oculus itself, there are a few games we’d like to see announced. Following Facebook’s acquisition of Crayta developer Unit 2 (now part of Facebook Gaming) earlier this year, we think that the game creator tool might be headed to Oculus Quest platforms. Crayta, which was formerly exclusive to Google Stadia, is a Roblox-like game in which you make games and can play the content created by other users, and it would be a perfect addition to the Quest lineup.",
    "This kind of game is exactly what VR needs, as it will give creatives a unique chance to develop VR experiences, and players a plethora of new content to explore.",
    "Beyond that, we might also see announcements from other Facebook Gaming studios, such as a new game from BigBox VR, the team behind Population: One, and Downpour Interactive, which created Onward – although along with Unit 2, these studios are fairly recent acquisitions, so we don’t necessarily expect any of these new games to drop soon. Most likely we’ll be waiting until 2022 for new Oculus Quest titles to drop."
  ],
  "headers": {
    "4": "What we expect to see at Facebook Connect"
  },
  "links": {
    "Facebook Connect": "https://www.techradar.com/how-to/how-to-watch-facebook-connect-and-what-we-want-to-see-at-the-oculus-event",
    "new Oculus Quest VR headset": "https://www.techradar.com/news/new-oculus-quest-vr-leaks-ahead-of-this-weeks-facebook-connect",
    "official Twitter account": "https://twitter.com/BeatSaber/status/1453436558502203402?s=20",
    "Billie EIlsih": "https://www.techradar.com/news/hit-vr-game-beat-saber-just-got-10-new-tracks-from-no-time-to-die-singer",
    "best Oculus Quest Games": "https://www.techradar.com/news/best-oculus-quest-games",
    "best VR games": "https://www.techradar.com/best/the-best-vr-games",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "Oculus Quest 2 Pro": "https://www.techradar.com/news/oculus-quest-pro-will-arrive-long-before-any-oculus-quest-3-vr-headset",
    "Facebook has been teasing its name change": "https://www.techradar.com/news/facebook-will-rebrand-with-new-name-as-it-looks-to-future-products-report-suggests",
    "crafting a ‘metaverse’": "https://www.techradar.com/news/facebook-is-hiring-10000-new-workers-to-help-build-the-metaverse",
    "terrible press its social media platforms have been getting": "https://www.wsj.com/articles/the-facebook-files-11631713039",
    "Horizon Worlds social platform": "https://www.techradar.com/news/facebook-is-launching-a-ready-player-one-like-vr-world-for-you-to-hang-out-in",
    "Facebook account to use Oculus headsets": "https://www.techradar.com/news/oculus-will-require-new-users-to-use-facebook-logins-starting-in-october",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia"
  }
}