{
  "source": "https://www.techradar.com/news/facebooks-news-ban-in-australia-everything-you-need-to-know",
  "title": "Facebook's news ban in Australia: everything you need to know",
  "category": "computing",
  "updated": "2021-02-20T16:00:10Z",
  "author": "james-o-malley",
  "summary": "We answer your concerns",
  "article": [
    "Australians logging on to Facebook to check the morning headlines received a shock earlier this week: there was no news.",
    "Don’t worry, notable things were still happening and the Earth continued to rotate on its axis, but if you were to check the Facebook pages of Australian broadcaster ABC, or tried to post a link to a news story from the Sydney Morning Herald then you might find the page blank, or and an error message telling you that computer says no.",
    "This was no accident. Facebook really has banned all of the news in Australia. Crikey.",
    "So what’s going on? And how will Australia cope with its horrifying new status as an island paradise with relentlessly good weather and no one arguing about politics on Facebook? Read on to find out.",
    "This actually all began as a dispute between the Australian government and Google. In December 2020, the government introduced a new law to its Parliament that would create a new “Media Bargaining Code” that would force designated “platforms” - Google, Facebook and the like - to pay news organisations if they want to link or extract snippets of their content.",
    "The plan was motivated by concerns that the balance of power between big tech and news organisations was out of whack, with the news organisations doing the hard, expensive work of writing the news, but then the likes of Google News reaping the rewards by aggregating stories. So that when people check the news, instead of heading to the website of a news publisher, they are simply checking out Google or scrolling through Facebook instead.",
    "The proposed solution is to tip the scales back towards the news publishers, and have the cash-rich tech platforms directly subsidise the struggling news industry by strong-arming them into paying to license news content.",
    "The way it would work is that the new code would enable news publishers to team up to negotiate with Google and Facebook, the theory being that by working together they can get a better deal, leading to more richly funded news outlets.",
    "The idea isn’t completely crazy. Taxing oil companies with green taxes to pay for solar panels, or taxing cigarettes to pay for healthcare would both be reasonable ideas for political debate. But if the new law passes, Australia would be the first country in the world to try it.",
    "But unsurprisingly, both Google and Facebook are not happy with this plan. They characterise it as an assault on the open internet, because a core principle of how the internet works is that anyone can link to anyone else, for free.",
    "The debate over the law has been simmering since last year. At one point, Google even suggested it might block Google Search from Australia in retaliation. But it was Facebook that lobbed the first grenade onto the negotiating table, and took the dramatic step of stopping users of its platform from linking to news content.",
    "Facebook’s initial rollout of the ban is rather wide-ranging. All of the pages of Australian news outlets are now blank. And links to news websites - whether Australian or international - cannot be posted.",
    "If you try, a message pops up explaining the unusual situation. So the residents of Erinsborough will have to stick to posting pictures of their pets for the time being.",
    "It appears Facebook used a rather crude filter, blocking anything tagged with the word “news”, which has also led to lots of non-news outlets being flagged, such as posts from government agencies and even Facebook-the-company’s own Facebook Page. So Facebook banned Facebook on Facebook.",
    "These false-positives are being restored, but it illustrates how wide-ranging the new restrictions are, with Facebook not taking any chances that any news might get through.",
    "Arguably, that’s the point. It could also be because the Australian government hasn’t actually passed the new law yet. This could simply be Facebook trying to prepare for the new law, so that it doesn’t have to pay up. If the law passes, Facebook could face fines of up to AUS$10m, or 10% of its Australian revenue for unauthorised linking.",
    "Or what is perhaps more likely is that this could be Facebook executives taking the calculated risk that by kicking up a massive storm, they might be able to force the government to withdraw or change the proposed law. It’s a deliberately provocative tactic to draw attention to the possible implications of what might happen if it passes.",
    "It’s not the first time tech has tried such tactics. Back in 2012, Wikipedia and a host of other websites “went dark” for the day in protest at a proposed US anti-piracy law. And most importantly from Facebook’s perspective: they won. US Senators quickly withdrew their support sending the proposals back to the drawing board.",
    "Well, it is basically tech’s fault that news outlets are struggling. Before the advent of the internet, newspapers were both important and profitable. Not just because they were the only way to find out what was going on in the world, but because they were a bundle of different services.",
    "They contained advertising for local businesses, classified ads, family announcements and sometimes even had a dating section, and could make money from all of these things.",
    "Today though, all of these functions have been gobbled up by Facebook, Google and other tech companies: eBay replaced classified ads, Google sells advertising, Facebook is where you go for family news, and Tinder is where people go to find a date. The only thing left is news, which isn’t very profitable on its own.",
    "So it isn’t simply that there is much more competition for attention, or that news is available from all over the world. It isn’t even simply that there is much more competition for your attention. It’s that the business model of news no longer works. Which is bad, because news is perceived as a thing that is a good and important thing to have if democracy is to function correctly.",
    "So somehow, news has to be paid for. And this is how to Australian government is trying to do it.",
    "Surprisingly, Microsoft has taken the side of the news industry in this debate. Company President Brad Smith has said that the Australian proposals should be given “serious consideration” in the United States too.",
    "It’s just a massive coincidence that the proposed law would damage the business of its biggest competitor, and provide an opening to grow the market share for Bing and win some Brownie Points with journalists.",
    "This is an important question. And the answer is… it’s complicated.",
    "Google has called the Code’s definition of news “vague”, citing language which defines it as “content that reports, investigates or explains current issues or events of interest to Australians.”",
    "But even if Australia does manage to create some functional system where a subset of publishers technically count as “news” and others do not, it could lead to the unusual situation where news-adjacent content, like memes, blog posts and status updates that talk about politics are allowed and yet actual, credible, factual news content is not. That does not seem like a good outcome.",
    "This is what makes what is happening in Australia interesting for people in other countries, as what happens there will influence how the rest of the world reacts. Some countries have also toyed with the idea of taxing big tech to pay for news in the past, most notably France.",
    "This maybe explains why Facebook is pushing back so hard now. If it gives in and pays up, it won’t be surprising to see other countries implement something similar. Every country’s press will want their share of Facebook’s billions.",
    "Google’s reaction to the proposed law shows one way the current dispute could play out. In recent days, it has announced a new deal with Rupert Murdoch’s News Corporation for what it calls a “global partnership on news”.",
    "Essentially, Google will pay Uncle Rupert for content from many of the company’s outlets, including The Times and The Sun in the UK, the Wall Street Journal in the US, and The Australian newspaper in, well, Australia. In return, Murdoch’s outlets will make more use of Google’s platforms, such as YouTube, for sharing video.",
    "It’s a good deal for News Corp, and in the press release, News Corp even goes as far as thanking Australian Competition and Consumer Commissioner Rod Sims and Prime Minister Scott Morrison for their support in ‘persuading’ Google to make the move.",
    "So arguably, the mere threat of the new law means that it is working as intended.",
    "But for Facebook? Ultimately, the new news-free status quo seems unsustainable. The elephant in the room is that as frustrating as news outlets find Google and Facebook, they also rely on them for traffic. Similarly, restricting news content degrades the experience for users. So both sides have incentives to reach some sort of accommodation. The only question is which side will blink first."
  ],
  "headers": {
    "4": "Why did Facebook block the news?",
    "11": "Who does the block impact?",
    "15": "Wowzer, why such a broad approach? Won’t that annoy Facebook users?",
    "18": "Why is the news industry struggling anyway? Why should Big Tech have to pay for it?",
    "23": "Do all of Big Tech agree that it is bad?",
    "25": "How exactly does the law define 'news'?",
    "28": "Will other countries follow suit?",
    "30": "What does this mean for the future?"
  },
  "links": {
    "Facebook really has banned all of the news in Australia": "https://www.techradar.com/news/facebook-has-banned-news-in-australia",
    "went dark": "https://www.techradar.com/news/internet/24-hour-wikipedia-blackout-will-protest-sopa-pipa-1055164",
    "taken the side of the news industry": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8297852975357255000&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fon-the-issues%2F2021%2F02%2F11%2Fendorsement-australias-proposal-technology-news%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ffacebooks-news-ban-in-australia-everything-you-need-to-know",
    "most notably France": "https://www.techdirt.com/articles/20200411/11092344281/french-government-says-google-must-pay-french-news-agencies-sending-traffic-their-way.shtml"
  }
}