{
  "source": "https://www.techradar.com/news/russia-blocks-top-vpn-services",
  "title": "Russia blocks top VPN services",
  "category": "computing",
  "updated": "2021-09-06T15:08:26Z",
  "author": "mayank-sharma",
  "summary": "The VPN ban follows other similar moves as the country prepares for parliamentary elections",
  "article": [
    "The Russian federal agency responsible for the supervision of communications, Roskomnadzor, has blocked access to six virtual private network (VPN) services, in its latest bid to strengthen its hold on the flow of information on the internet.",
    "The ban covers Hola! VPN, ExpressVPN, KeepSolid VPN Unlimited, Nord VPN, Speedify VPN, and IPVanish VPN, according to a press note put out by Roskomnadzor.",
    "Roskomnadzor has justified its move by suggesting that the blocked service can be used to access prohibited content such as child pornography, and narcotic drugs, according to a machine translated version of Roskomnadzor’s statement.",
    "Bloomberg suggests that the ban comes as the country prepares for parliamentary elections later this month, and follows a series of curtailments on independent media groups, and imposing fines on international platforms such as Google and Facebook for failing to remove content that violated the country’s laws.",
    "According to reports, the country has been flexing its muscles lately and technology platforms have been in the firing line.",
    "Google, and Apple have both reportedly run foul of Roskomnadzor’s guidelines, with the state-owned media reporting that the communications watchdog will hold them guilty of interfering with the country’s election process if they fail to remove an app by President Vladimir Putin’s most vocal critic, Alexey Navalny.",
    "“Plans to block VPNs are just another move to strengthen governmental control over online communications,” NordVPN told Bloomberg via an emailed statement, adding that the country has a series of laws that enable authorities to ban websites without a court order.",
    "NordVPN has had its fair share of run-ins with the Russian government, and even chose to destroy its servers in the country when the government sought access in 2019. This time around, the service has vowed to continue to offer its products “through available channels,” according to Bloomberg.",
    "Via Bloomberg"
  ],
  "headers": {
    "4": "Crackdown on tech"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Hola! VPN": "https://www.techradar.com/reviews/hola-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "KeepSolid VPN Unlimited": "https://www.techradar.com/reviews/pc-mac/software/utilities/keepsolid-vpn-unlimited-1325618/review",
    "Nord VPN": "https://www.techradar.com/reviews/nordvpn",
    "Speedify VPN": "https://www.techradar.com/reviews/speedify",
    "IPVanish VPN": "https://www.techradar.com/reviews/ipvanish-vpn",
    "machine translated version": "https://translate.google.com/translate?sl=auto&tl=en&u=https://rkn.gov.ru/news/rsoc/news73836.htm",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-09-03/russia-blocks-nord-vpn-express-vpn-in-bid-to-control-content"
  }
}