{
  "source": "https://www.techradar.com/news/would-you-wear-a-vr-headset-in-bed",
  "title": "This sleepy VR headset lets you lie down while playing games – but is it a good idea?",
  "category": "vr",
  "updated": "2021-09-24T16:06:24Z",
  "author": "henry-st-leger",
  "summary": "A look at the sleepy HalfDive",
  "article": [
    "We're not the first to make a connection between dreams and VR – both are otherworldly experiences, where we wander through places that aren't real, or physical, and yet can feel surreal and even profound.",
    "So it's no wonder that someone sought to take VR to the next level by letting you lie down in bed while wearing a VR headset. Virtual reality? Dreams? What's the difference anymore?",
    "Diver-X is a Japanese startup that's set to release its Kickstarter-funded VR headset in November 2021.",
    "The HalfDive, as it's called, packs in four speakers for a \"3D sound system\" around the user's head, as well as force feedback for \"a sense of touch, sword slashes, and friction within the virtual world.\" It even comes with a foot controller, which means that tilting your ankle will enable you to move while lying down, as well as hand controllers for more traditional control inputs.",
    "The company's website argues that \"the stationary and large-size design of the HalfDive\" – exactly what would make it too heavy to lift as easily as the cordless Oculus Quest 2 – is what enables it to offer superior \"optical systems [with \"134 degrees super-FOV, and a significantly improved image quality.\"",
    "Anyone who's watched the hit anime Sword Art Online will understand the inspiration – though the similarity to that show's comatose teenagers, trapped in VR headsets in their beds with no easy way to wake up again, isn't the most comforting thing to think about.",
    "However, there's definitely a case for accessibility. Anyone with motor issues, or trouble standing and moving around in the way that Quest 2 users are expected to be able to, may find that a more stationary VR experience is more accessible for them.",
    "It may also make longer sessions more palatable for able-bodied users, reducing motion sickness, increasing comfort and preventing physical strain while wearing bulky hardware.",
    "The HalfDive supports SteamVR, much like the Valve Index – and starts at $700 for a basic model, going up to $1,100 for a full suite of headset and controllers, or $3,900 for a unit with advanced varifocal lenses (which aid far-away or close-up vision, depending where on the lens you're looking).",
    "With a 90Hz refresh rate, and 4.5 degrees of freedom, it's not shabbily specced by any means. We're unsure whether games designed for standing users will translate effectively – Beat Saber, for one, seems a little too energetic – but it's possible that calmer walking sims, in-VR movies, music videos, and the like will find a home here.",
    "So until Oculus releases a bed accessory for the Quest 2, this is going to be your best bet for a more horizontal VR experience.",
    "Via VRScout"
  ],
  "headers": {
    "5": "Do we need in-bed VR systems?"
  },
  "links": {
    "Diver-X": "http://diver-x.jp/halfdive/en/",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "varifocal lenses": "https://www.specsavers.co.uk/glasses/glasses-lenses/varifocals",
    "Beat Saber, for one, seems a little too energetic": "https://www.techradar.com/news/hit-vr-game-beat-saber-just-got-10-new-tracks-from-no-time-to-die-singer",
    "VRScout": "https://vrscout.com/news/this-japanese-vr-headset-is-meant-to-be-used-in-bed/"
  }
}