{
  "source": "https://www.techradar.com/news/nintendo-switch-oled-burn-in",
  "title": "Nintendo Switch OLED burn-in: do you need to worry?",
  "category": "appliances",
  "updated": "2021-07-10T10:00:10Z",
  "author": "henry-st-leger",
  "summary": "The experts think not",
  "article": [
    "The Nintendo Switch OLED is set to seriously upgrade the Switch console's display, with many a player looking towards the new hardware for an improved experience – but do prospective buyers need to worry about burn-in?",
    "For those who don't know, burn-in has long been a bugbear around OLED panels. It describes the image retention that can occur from looping logos or HUDs on OLED screens, when displaying the same image over and over again permanently scars the panel's pixels, leaving residual 'ghost' patterns that can't be turned off.",
    "It's a relatively contained issue, though. It's only really seen on OLED screens that are on for many hours a day with static or looping images, such as those used in retail spaces. (Anecdotally, we have also had readers using an OLED display so heavily that they eventually come across this issue.)",
    "OLED panel manufacturers have only got better at handling the issue, too. LG makes use of a 'screen shift' technology that subtly moves the image onscreen to ensure individual pixels aren't continuously outputting the same information, and we know that Philips makes use of similar technology.",
    "We spoke to an expert in the field – OTI Lumionics CEO Michael Helander, who tells us that \"Modern OLED display panels have active compensation that will prevent the effect of burn-in. This records how much time each pixel has been turned on individually and will then in the back-end hardware adjust the output signal [...] to ensure that screen output remains uniform and effect of burn-in is eliminated.\"",
    "Helander cites Nintendo's ability to control \"the UI of games launched on their platform\", allowing it to \"shift UI boxes slightly during gameplay session to eliminate the issue of individual pixel burn-in.\"",
    "We also need to remember that the Nintendo Switch OLED isn't the first OLED gaming handheld to hit the market.",
    "The long-discontinued PS Vita also carried an OLED panel, after all – and Helander adds that \"there were not a lot of complaints in the PS Vita regarding burn-in from OLED devices 8-10 years ago [...] The lifetime of OLED devices has improved at least 10x over the last 8 to 10 years, thus I don't expect burn-in to become an issue for the Switch OLED.\"",
    "With a few months still to go until the Switch OLED releases, we can only speculate as to the exact quality of its new screen – but the history of the PS Vita, as well as the past decade of enhancements regarding OLED degradation, means that the new Switch seems to be destined for the media cabinet rather than the dustheap."
  ],
  "headers": {
    "4": "Under control"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "PS Vita": "https://www.techradar.com/news/gaming/handhelds/ps-vita-deals-1315753"
  }
}