{
  "source": "https://www.techradar.com/news/oculus-quest-2-recall",
  "title": "Oculus Quest 2 recall: Facebook pauses sales, promises 128GB model",
  "category": "gaming",
  "updated": "2021-07-28T07:06:23Z",
  "author": "will-shanklin",
  "summary": "Here's when Oculus Quest 2 are going to resume – and what to do it you need a fix",
  "article": [
    "If you’re shopping for an Oculus Quest 2 today, you may be wondering why the VR headset is nowhere to be found. That’s because Facebook is temporarily pulling the product from physical and online store shelves after receiving mounting complaints of skin irritation. The social media company also announced that once Quest 2 sales resume, the entry-level tier will double its storage.",
    "Facebook is pulling sales “in response to reports from a very small percentage of users who have experienced skin irritation where the foam portion of the facial interface rests on the skin,” according to Facebook Reality Labs head Andrew Bosworth in an official blog post. Facebook added that the recall is “in cooperation with the U.S. Consumer Product Safety Commission (CPSC).”",
    "As part of the Oculus Quest 2 recall, the company will provide Oculus Quest 2 owners with a new silicone cover that fits over the existing headset.",
    "Oculus Quest 2 sales will resume on August 24 with a couple of critical changes. In addition to including the silicone face covering by default, Oculus will also offer 128GB storage in the entry-level ($299) Quest 2 model. That cheapest version previously only offered 64GB. A 256GB model will remain at $399.",
    "If you own an Oculus Quest 2, you can sign up for your free silicone face covering by navigating to the Oculus My Devices page. After signing in with your headset’s account, you should see an option to “Request silicone facial interface cover” next to your headset.",
    "Skin irritation problems first surfaced in December 2020. At the time, Facebook said the problems affected approximately 0.01% of Oculus Quest 2 users. In May, Amazon delisted the headset from multiple European storefronts, including in the UK, France, Spain, and the Netherlands.",
    "“We hope the larger storage size will give people more flexibility to instantly access and manage more content on a single device,” wrote Bosworth, “while the new silicone cover will give people more ways to have a comfortable experience with both the 128GB and 256GB Quest.”",
    "The Oculus Quest 2 released in October 2020. TechRadar's review said it was \"one of the best VR systems available for both beginners and seasoned VR veterans alike.\" Compared to the original Oculus Quest, we praised the more responsive experience and higher-resolution display."
  ],
  "headers": {
    "4": "What to do with your current Oculus Quest 2"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "blog post": "https://tech.fb.com/community-letter/",
    "My Devices page": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-1400334861541442000&murl=https%3A%2F%2Fsecure.oculus.com%2Fmy%2Fdevices%2F",
    "first surfaced": "https://www.techradar.com/news/oculus-quest-2-is-causing-skin-irritation-such-as-bumps-and-swelling-for-some-users",
    "delisted": "https://www.techradar.com/news/oculus-quest-2-skin-irritation-issue-sees-vr-headset-delisted-from-amazon"
  }
}