{
  "source": "https://www.techradar.com/news/huawei-p50-pro-camera-specs-officially-revealed-for-the-first-time",
  "title": "Huawei P50 Pro camera specs officially revealed for the first time",
  "category": "phones",
  "updated": "2021-07-20T08:38:28Z",
  "author": "tom-bedford",
  "summary": "Finally, a camera leak",
  "article": [
    "While the Huawei P50 series doesn't exactly have a boatload of 'buzz' around it - it feels like most phone fans have forgotten all about the once-great company - new information keeps popping up ahead of the July 29 China launch.",
    "Case in point: on Chinese social media platform Weibo, Huawei posted a teaser video for the P50 Pro. While lots of the visuals are just moving versions of pictures we've already seen, a few new ones are used, and savvy watchers have spotted a few hidden details in them.",
    "You see, most premium phones have some of the snappers' specs listed by the lenses, mainly for the purposes of bragging: '100x zoom', '108MP', and so on. As spotted by the video watchers, the Huawei P50 Pro video shows 'VARIO-SUMMILUX-H1:1.8-3.4/18-125ASPH'.",
    "No idea what this means? Well, Vario-Summilux is a type of lens, made by Leica. The reference to 1.8-3.4/18-125 is a reference to the aperture and lens size, so we know the various cameras will have apertures between f/1.8 and f/3.4, and sizes between 18mm (likely an ultra-wide camera) and 125mm (likely a periscope camera).",
    "Finally, ASPH refers to an aspherical lens, which, when used for wider apertures, takes sharper images and reduces visual issues.",
    "So that gives us a good look at the Huawei P50 Pro's camera array, and it seems the snappers will be well-specced. The 125mm camera will likely hit 5x optical zoom, a distance which some leakers are backing up, and the aspherical lens could really improve snaps for the cameras it's attached to (though there could be more than one - P50 renders show a boatload of cameras).",
    "There's no solid specs written on the phone, and that suggests Huawei may have tapped out of the 'specs race' to use unnecessarily high-resolution cameras, in favor of hardware that actually does the job well.",
    "With a Huawei P50 series launch on July 29, we don't have long to wait to see what the new phones are like. That July 29 event is set for a China-only reveal, so we will have to wait longer to see when the phones will be released in the UK and other countries.",
    "Via ITHome"
  ],
  "headers": {},
  "links": {
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "July 29 China launch": "https://www.techradar.com/news/huawei-p50-launch-date-confirmed-for-july-29-and-it-wont-be-alone",
    "teaser video": "https://weibo.com/1839167003/KpuJawbIN?from=page_1006061839167003_profile&wvr=6&mod=weibotime&type=comment",
    "ITHome": "https://www.ithome.com/0/563/831.htm"
  }
}