{
  "source": "https://www.techradar.com/news/google-chrome-is-getting-a-small-but-seriously-useful-upgrade",
  "title": "Google Chrome is getting a small but seriously useful upgrade",
  "category": "computing",
  "updated": "2021-04-19T10:20:51Z",
  "author": "balakumar-k",
  "summary": "Google Chrome 90 comes with a handy new linking option",
  "article": [
    "Google has rolled out an update for its web browser Chrome that streamlines the process of sharing information with friends and colleagues.",
    "Launched last week, Chrome 90 allows users to link to specific pieces of text on a website. When the recipient opens the link, the page scrolls automatically to the highlighted section.",
    "These links can be created by highlighting a block of text and selecting “Copy link to highlight” from the right-click dropdown menu.",
    "The feature is currently only available with the desktop version of Chrome, but will reach Android and iOS in future.",
    "Although Google had already launched the new linking feature as a browser extension, the latest update makes the functionality available to all Chrome users by default.",
    "According to a Google blog post, the feature was designed chiefly with productivity in mind, cutting the time it takes to identify the most salient pieces of information. It might sound like a small optimization, but will be a welcome addition for students and professionals required to handle lengthy online resources.",
    "The new linking option is also reminiscent of featured snippets, a relatively new variety of Google Search result that directs to a specific part of the web page, based on keywords in the search query.",
    "The featured snippets system was developed with similar principles in mind, but the approach is a little hit-and-miss in practice; sometimes, users don't want to be directed to the middle of a web page.",
    "However, the new Chrome update places control in the hands of the link sender, who can determine for themselves what type of link should be used."
  ],
  "headers": {
    "4": "Google Chrome update"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "Launched last week": "https://www.techradar.com/news/google-chrome-90-with-default-https-rolls-out",
    "blog post": "https://blog.google/products/chrome/more-helpful-chrome-throughout-your-workday/"
  }
}