{
  "source": "https://www.techradar.com/news/blinks-first-smart-doorbell-camera-can-last-up-to-two-years-on-battery-and-costs-a-lot-less-than-ring",
  "title": "Blink's first smart doorbell camera can last up to two years on battery and costs a lot less than Ring",
  "category": "smart-home",
  "updated": "2021-12-05T22:47:36Z",
  "author": "nick-pino",
  "summary": "The Blink Video Doorbell has all the features at half the cost",
  "article": [
    "Smart home company Blink has just taken the wraps off its first-ever smart doorbell camera at the Amazon September event.",
    "According to Amazon, the Blink Video Doorbell can be installed both wired and wirelessly and has a two-year battery life.",
    "Other specs include 1080p HD day and night video, two-way audio, chime app alerts, and the ability to connect to and sound your existing in-home chime.",
    "Of course, what folks will find most appealing about the Blink Video Doorbell is its price – it's just $49 (around £37, AU$70).",
    "In addition to the Doorbell, Blink announced two more devices that can keep an eye on every corner of your house.",
    "Among them, the Blink Floodlight Camera is a battery-powered LED mount that works with Blink Outdoor that can act as a motion-triggered floodlight for the back yard. There's also a new Blink Solar Panel Mount that supplies a nonstop sustainable charge from the sun for Blink Outdoor.",
    "These devices are available for pre-order from Amazon, but they unfortunately aren't quite as cheap as the Video Doorbell: the Blink Floodlight Camera mount will start at $39 (around £28, AU$55), or you can buy a Blink Floodlight Camera bundle with Blink Outdoor starting at $139. The Blink Solar Panel Mount bundled with Blink Outdoor will start at $129 (around £95, AU$180).",
    "For now, these devices are US-only, but we're expecting to hear some news about global availability in the next few weeks.",
    "You might also want to check out the Blink vs Ring comparison."
  ],
  "headers": {
    "4": "Blink's got an eye on every corner of your house"
  },
  "links": {
    "Amazon September event": "https://www.techradar.com/news/live/amazon-event-2021-live-blog",
    "Blink vs Ring": "https://www.techradar.com/news/blink-vs-ring-what-are-the-differences-between-amazons-cams"
  }
}