{
  "source": "https://www.techradar.com/news/black-friday-tablet-deals-the-best-savings-on-ipads-fire-tabs-and-android-slates",
  "title": "Black Friday tablet deals 2021: save cash on the iPad, Fire and Galaxy Tab",
  "category": "tablets",
  "updated": "2021-11-28T01:34:34Z",
  "author": "tom-bedford",
  "summary": "The Black Friday tablet deals keep coming!",
  "article": [
    "Black Friday is technically behind us, but it's still Black Friday weekend, which means there are still loads of great tablet deals to find. Better still are all the Cyber Monday tablet deals also coming thick and fast.",
    "That means there's still time to save money on a tablet! We're seeing price cuts on Fire tablets, Galaxy Tabs, Lenovo slates and the odd iPad (we've also got a dedicated Black Friday iPad deals guide).",
    "So far we haven't seen a lot of savings on the latest, most premium tablets, but there are some hefty discounts on older slates and even small savings on recent ones. Plus, Cyber Monday deals are just around the corner, so we may yet see some bigger savings to come.",
    "So you're looking at a calendar, flipping the pages until November 26, and realizing there's quite a while until the sales. Should you go tablet-less until then, just to save a bit of money, or just buy one now?",
    "Well, it depends why you want one. University term starts months before Black Friday, so if you're a student (or buying for one), you shouldn't wait. Likewise if you've got a creative project you need one for, or require a tablet for business, it's worth buying now.",
    "It's only worth waiting until Black Friday if a tablet is something you want, but don't need. That includes if you've got an older slate which serves you well, but maybe struggles for certain tasks - keep on keeping on until the sales if that's the case."
  ],
  "headers": {
    "3": "Should I wait for the Black Friday tablet deals?"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday tablet deals": "https://www.techradar.com/cyber-monday/cyber-monday-tablet-deals-2021",
    "Black Friday iPad deals": "https://www.techradar.com/black-friday/black-friday-ipad-deals",
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}