{
  "source": "https://www.techradar.com/news/microsoft-teams-notifications-are-getting-a-whole-new-look",
  "title": "Microsoft Teams notifications are getting a whole new look",
  "category": "computing",
  "updated": "2021-06-16T10:53:14Z",
  "author": "mike-moore",
  "summary": "New default aesthetic coming to Microsoft Teams notifications",
  "article": [
    "Spotting notifications on Microsoft Teams should soon get a whole lot easier thanks to a new upgrade from the service.",
    "The company's video conferencing tool has revealed an update that should make it simpler to spot when a new notification comes in from Microsoft Teams, meaning you shouldn't be left out of the loop on chats or calls.",
    "The update is still in development for the time being, but Microsoft says it hopes to begin rolling it out in July 2021.",
    "In the Microsoft 365 roadmap entry for the update, entitled \"New default for Teams notification style\", the company notes that going forward, Teams notification style will be defaulted to native notifications for new users.",
    "Currently the default style is \"Teams purple\", but Microsoft says that this change to native notifications will mean users can benefit from support for assist mode, action center, accessibility and other features.",
    "The change should affect Microsoft Teams users across both Windows and Mac, and as mentioned, should be rolling out within the next few weeks.",
    "The update is the second notification-themed change coming to Microsoft Teams announced within the last few days.",
    "Microsoft recently also revealed a new feature that should mean you never again miss a private message sent during a Microsoft Teams call.",
    "Similar to the likes of WhatsApp and Facebook Messenger, the new \"chat bubbles\" will display a floating notification on your screen, much like it would on a mobile device.",
    "Microsoft says that the new feature will make \"chat more central to the conversation\", and that users can also simply switch off the alerts if they desire."
  ],
  "headers": {
    "3": "Microsoft Teams notifications"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft 365 roadmap entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-7408627356393376000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D83062",
    "chat bubbles": "https://www.techradar.com/news/microsoft-teams-is-finally-solving-one-of-its-biggest-issues"
  }
}