{
  "source": "https://www.techradar.com/news/xiaomi-black-shark-4-leak-suggests-it-could-be-a-budget-gaming-phone",
  "title": "Xiaomi Black Shark 4 price could be a lot lower than we expected",
  "category": "phones",
  "updated": "2021-02-10T15:05:07Z",
  "author": "tom-bedford",
  "summary": "Low-cost gaming",
  "article": [
    "While most gaming phones tend to have upper-mid-range or premium prices, the upcoming Xiaomi Black Shark 4 might buck that trend as new information suggests it'll have low specs in a few areas, suggesting it could release at a lower cost than its predecessors and rivals.",
    "The Black Shark 4 has been certified on Chinese certification website TENAA, as spotted by PlayfulDroid, and the accompanying photos mean we've got some early snaps of the smartphone.",
    "Now it's worth pointing out that this phone has the model number PRS-A0, while we'd previously heard the Black Shark 4 was the KRS-A0. That has lead some to speculate this isn't the Black Shark 4, but a sibling in its series.",
    "PlayfulDroid speculates this is the Black Shark 4 Pro, but judging by the specs, it's possibly actually a Lite model, or, more likely, the 'standard' Black Shark 4 while the other handset is the Pro.",
    "As the Black Shark 4 hasn't been announced yet, and this rumor implies big changes for the line, we'd recommend taking it with a pinch of salt until it's verified by the company. It's possible this PRS-A0 phone is a version that'll only get a China launch, for example, or doesn't do justice to the finished product.",
    "If you've seen previous Black Shark phones, or most gaming phones in general for that matter, you'll likely find the above Black Shark 4 renders surprising - it's a rather normal looking phone. It's certainly a mile from the distinctive, angular, LED-packed designs most gaming phones use.",
    "On the left edge of the phone is a volume rocker, with the power button on the right edge - so far, so similar to other Black Shark phones. However, also on the right are two physical trigger buttons, for gaming, and a side-mounted fingerprint scanner.",
    "Black Shark phones typically have in-screen fingerprint scanners, so the placement of one on the side is quite a big change. PlayfulDroid speculates the fingerprint scanner moving is a symptom of a downgrade in screen quality, indicative of the phone's budget nature, though this is all speculative.",
    "As in the Black Shark 3, there seem to be three rear cameras for the Black Shark 4, housed in a horizontal bump like the Samsung Galaxy S10. The cameras are quite small in terms of the phone's overall size, which may suggest it's a big handset.",
    "Were it not for the Black Shark logo on the back of the phone, we'd scarcely believe this was in fact the next-gen version of Xiaomi's Black Shark gaming phone, due to its looks.",
    "We're expecting the Black Shark 4 to launch around March 2021, so we'll have to wait until then to see what the phone is really like."
  ],
  "headers": {
    "5": "Black Shark 4 pictures"
  },
  "links": {
    "gaming phones": "https://www.techradar.com/news/best-phone-for-gaming",
    "Xiaomi Black Shark 4": "https://www.techradar.com/news/xiaomi-black-shark-4-and-4-pro",
    "PlayfulDroid": "https://playfuldroid.com/black-shark-4-pro-prs-a0-images-surface-through-tenaa-appearance/",
    "Black Shark 3": "https://www.techradar.com/reviews/xiaomi-black-shark-3-review",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}