{
  "source": "https://www.techradar.com/news/ios-15-beta-still-hasnt-fixed-decade-old-bug",
  "title": "iOS 15 beta still hasn't fixed decade-old bug",
  "category": "phones",
  "updated": "2021-08-22T18:00:04Z",
  "author": "david-lumb",
  "summary": "Sending a photo in Messages? Nope, can’t, sorry.",
  "article": [
    "I’ve been really enjoying the iOS 15 public beta for weeks now, and the new features like Live Text and UX refinements like clustered notifications already make it a better experience than iOS 14. But week after week, new beta update after new update, I’ve made a nauseating discovery: iOS 15 isn’t fixing a bug that’s been in iOS for a decade.",
    "Let me preface by saying this is not some experience-ruining glitch or phone-bricking calamity; this is an annoyance, a malformation so benign that it’s been kicked to the bottom of every priority list since it appeared, if the iPhone’s devs noticed it at all.",
    "What am I talking about? Okay, picture this: you’re chatting away in the Messages app and you want to send a photo. You tap the action bar to open your photos and tap the one you want to send, which then appears in your message draft window. You hit the send button, and the draft goes away. But the photo is not sent. You repeat the process – open photo gallery, tap photo, hit send – and still it isn’t sent.",
    "Has this happened to you? Perhaps, once? You can’t remember?",
    "That is the insidious genius of this bug, which I’m convinced is sentient, to only wreak occasional havoc before going dormant. It’s difficult to cause intentionally, and thus not reproducible. It remains off the radar.",
    "But this glitch happens at the most inopportune times, leaving me embarrassingly on the hook: I’ll smugly text friends “You won’t BELIEVE this!” and then gear up to send them a jaw-dropping photo or perfectly-timed meme, and then, I can’t. The bug strikes! My friends laugh at my seeming ineptitude! I am undone!",
    "Now, there is a fix of sorts – just manually close the Messages app and open it up again. Poof, the photos load and send as normal. But even that process can take precious seconds that eclipse the opportune window for sending a funny photo. I curse the bug, who has been clearly lying in wait, and lament all the laughs I failed to bring into this world.",
    "Sometimes I’ll go months without experiencing the bug, and I’ll wonder – did I imagine this whole thing? Have I ever actually not been able to send photos? Maybe I’m misremembering to cover up for remembering too late that I had a perfect photo rebuttal in an argument, a visual l’esprit d’escalier. Maybe my brain misfires and has invented a digital gremlin that has it out for me every once in a great while.",
    "But then it happens again, and I look like a doofus who can’t figure out how to send a simple photo. Again, this is far from a crippling flaw of iOS, and I duly enjoy using it 99.99% of the time. I really dig iOS 15, and its new features are exciting.",
    "Yet, I can’t help but ask, humbly, for Apple to fix this one thing. It may be small, but I’ve been seeing it seemingly since I got my iPhone 4 in 2010. As the saying goes, “it isn’t the mountain ahead that wears you out — it’s the grain of sand in your shoe.” Or the misfortune to have the perfect photo to send and no way to send it (for a few seconds)."
  ],
  "headers": {
    "6": "Yes, okay, there's a fix. BUT."
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "better experience": "https://www.techradar.com/news/weve-used-ios-15-public-beta-for-a-day-and-its-already-better-than-ios-14"
  }
}