{
  "source": "https://www.techradar.com/news/whatsapp-is-introducing-great-new-group-chat-options",
  "title": "WhatsApp is introducing great new group chat options",
  "category": "computing",
  "updated": "2021-09-22T09:45:32Z",
  "author": "sofia-wycislik-wilson",
  "summary": "It is going to be much easier to identify different group chats",
  "article": [
    "While it's safe to say that the majority of conversations and calls in WhatsApp take place between two individuals, there are plenty of instances in which group calls make much more sense. Whatever the reason for participating in a WhatsApp group, two new features are landing that improve things greatly.",
    "Group icon editing and group call shortcuts are new options that have been spotted in the iOS and Android versions respectively, but it shouldn't be long before all users of Facebook's popular chat app have access to these functions.",
    "It is iOS beta testers who get the first look at a new group icon editor option. This makes it possible to create a distinctive icon for a group based on emoji and stickers. It’s a feature that is not yet available for everyone, but you can check to see whether you have access to it by opening Group Info for a group you are involved in.",
    "You can then tap the camera icon to change the group icon and, hopefully, see a new Emoji & Sticker option. You can then browse through the available imagery as well as choosing a background color to quickly create your custom icon to aid identification at a glance.",
    "Android beta testers have access to a different new option related to groups – the ability to place group voice and video calls via new shortcuts. New buttons to start voice or video calls can be found on the group card giving you a way to very quickly instigate a call.",
    "At the moment, both of these features are visible to testers using the latest beta versions of the WhatsApp mobile app, but it hopefully won’t be too long before they roll out to everyone. Equally, while the two diffident features have been spotted in the iOS and Android versions separately, WhatsApp tends to strive for feature parity, so it shouldn’t be the case that iPhone users have access to something that Android users don’t, and vice versa – at least not for long.",
    "There is no denying that the arrival of Covid-19 and the ensuing lockdowns, quarantining and self-isolating that followed around the world has changed the way we communicate. More and more people turned to video chat tools to keep in touch with friends, family and work colleagues.",
    "In many instances, this means chatting with several people at once rather than operating on a one-on-one basis. As such, it makes complete sense that WhatsApp would introduce tools to help make life a little easier in group calls and chats.",
    "The ability to edit a group icon means that the potential risk of jumping into a chat and saying the wrong thing to the wrong people is reduced. Similarly positive is the arrival of calling shortcuts – it's something else that just helps to make life a little easier.",
    "Via WABetaInfo"
  ],
  "headers": {
    "4": "Group options",
    "6": "Analysis: modern options for modern times"
  },
  "links": {
    "group icon editor": "https://wabetainfo.com/whatsapp-is-releasing-a-group-icon-editor/",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-19-15-whats-new/"
  }
}