{
  "source": "https://www.techradar.com/news/spotifys-new-update-aims-to-shake-you-free-from-your-listening-loop",
  "title": "Spotify's new update aims to shake you free from your listening loop",
  "category": "audio-visual",
  "updated": "2021-03-23T02:30:42Z",
  "author": "harry-domanski",
  "summary": "Recently played history and more rolling out to mobile app home screens",
  "article": [
    "Spotify has announced an update for its mobile app on both iOS and Android platforms that introduces new ways for users to access their recently played tracks, as well as discover new music.",
    "The redesigned Home interface will begin rolling out to users globally this month and features updates for both free members and Premium subscribers.",
    "The update adds or adjusts three main features – improved access to listening history, podcast tracking and discovery, and a more prominent and reactive 'new release' section.",
    "The first of these takes the shape of a small 'history' icon at the top of the Home screen, next to the settings cog, which displays up to three months of listening history in the form of individual tracks, including the playlists or albums these songs were accessed from.",
    "For Premium subscribers, the six tiles that sit at the top of the Home screen will now show progress bars over podcast episodes you've already started, as well as displaying new episodes for followed podcasts, marked with a blue dot.",
    "Finally, another Premium-exclusive feature is a new section that will sit just under these six tiles to highlight new releases from followed artists, which Spotify claims will be \"personalized, timely, and reactive to your taste\".",
    "A side-effect of music streaming services and their 'recently played' sections is that they make it rather easy to fall into cyclical listening habits. Often, this can come at the expense of discovering newer music, or even rediscovering artists from your not-so-distant past.",
    "While Spotify has arguably worked to combat this with its focus on discovery – powered by its famous algorithm – this latest update could wind up helping as much as hindering listeners.",
    "The removal of a 'recently played' tile section from the home screen will no doubt assist in kicking these habits, as will the dilution of the top six tiles with new podcast content and the additional 'new release' section.",
    "But what about that 3-month listening history? While this isn't shown directly on the home screen, it's only one click away and is more detailed than ever. There's a strong possibility that this timeframe will be large enough to shake listeners out of shorter listening loops but, on the other hand, may just enable the habits to take hold more thoroughly thanks to its granularity.",
    "It's as yet unclear how 'reactive' the new release section will be – we hope it lives up the company's claim – as a constantly refreshing sampler of new content will go a long way in breaking these listening cycles."
  ],
  "headers": {
    "6": "Listening habits"
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "announced": "https://newsroom.spotify.com/2021-03-22/new-features-on-spotifys-home-hub-make-navigation-and-discovery-even-simpler/"
  }
}