{
  "source": "https://www.techradar.com/news/older-iphones-can-now-download-a-new-ios-update",
  "title": "An iOS update is coming to the seven-year-old iPhone 5S (and other older iPhones)",
  "category": "phones",
  "updated": "2021-05-05T13:52:16Z",
  "author": "tom-bedford",
  "summary": "The iOS 12.5.3 update is here for you.",
  "article": [
    "If you've got an older iPhone, and don't get iOS 14.5, that doesn't mean you're out of the loop. iOS 12.5.3 has launched too, in a win for people who don't feel the need to get a new Apple smartphone just yet.",
    "iOS 12.5.3 is rolling out right now, and you're eligible for it if your device can't get iOS 13 but can get iOS 12. That list includes the iPhone 5S, iPhone 6 and 6 Plus, iPad Mini 2, iPad Mini 3 and original iPad Air.",
    "Don't expect this new iOS update to re-invigorate your aging iPhone, as its feature list is short. 12.5.3 is mainly a security patch, but also solves a few memory corruption issues and brings a few memory optimization tweaks.",
    "So while it's worth updating your iPhone to get the security patch and memory improvements, you won't be getting iOS 14 features like widgets or an app library.",
    "The important subtext of this news is that Apple is clearly still looking after its older devices - just because your iPhone is relatively ancient (at least in tech terms) it doesn't mean Apple is abandoning you.",
    "There's no guarantee of iOS updates for older iPhones or iPads, and usually, when an iOS generation doesn't come to a family of iPhones, it means they're cut off from updates. For this reason you shouldn't take future iOS updates for granted if you have an older device, but that just means they'll be pleasant little surprises if and when they come along.",
    "Even though the iOS 12.5.3 patch is small, it'll still give eligible devices an extra lease of life that we weren't expecting.",
    "Clearly Apple isn't pressuring you to update your iPhone or iPad, and you can stick with your aging device if you don't feel you need the iPhone 12 or the upcoming iPhone 13."
  ],
  "headers": {
    "4": "Supporting old iPhones"
  },
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "iOS 13": "https://www.techradar.com/news/ios-13-release-date-features-and-everything-you-need-to-know",
    "iPhone 5S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5s-1179315/review",
    "iPhone 6": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-1264565/review",
    "6 Plus": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-plus-1264566/review",
    "iPad Mini 2": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-mini-2-1191349/review",
    "iPad Mini 3": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-mini-3-1269214/review",
    "iPad Air": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-air-1191350/review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13"
  }
}