{
  "source": "https://www.techradar.com/news/bentleys-flying-spur-mulliner-is-the-most-luxurious-plug-in-hybrid-weve-ever-seen",
  "title": "Bentley’s Flying Spur Mulliner is the most luxurious plug-in hybrid we’ve ever seen",
  "category": "car-tech",
  "updated": "2021-08-13T16:11:09Z",
  "author": "chris-teague",
  "summary": "We can dream, can’t we?",
  "article": [
    "Monterey Car Week is a time for excess in the automotive world. Some of the rarest, most expensive and most desirable cars are on display, but automakers also take the time to show off new models – which is exactly what luxury British brand Bentley did at this year’s event.",
    "The automaker’s coachbuilding division, Mulliner, is applying its know-how to the Flying Spur, an over-the-top four-door saloon with an equally crazy price tag. Surprisingly, the car will be available with a plug-in hybrid powertrain, too – a first for Mulliner.",
    "The Flying Spur will launch with the option of a 2.9-liter V6 plug-in powertrain, a twin-turbocharged 4.0-liter V8 boasting 542 horsepower and a twin-turbocharged 6.0-liter W12 engine generating well over 600 horsepower. The plug-in hybrid version is no slouch, though. Bentley says it will propel the giant car to 60 mph from a standstill in just 4.3 seconds, and on to a top speed of 177 mph.",
    "Separating the ultra-luxe Flying Spur Mulliner from the ‘normal’ model took some work.",
    "For starters, the coachbuilders added exclusive 22-inch wheels with a grey painted and polished finish, as well as self-leveling wheel caps to maintain the Bentley logo in an upright position while the wheels are in motion. Special badging and exclusive Mulliner bodywork, such as the “Double Diamond” grille and silver painted mirror caps, were also applied.",
    "Inside, buyers can choose from one of eight custom-made, tri-color themes, one of which is called Ascot. Cars wearing an Ascot interior will get Imperial Blue leather stretching across the instrument panel, door trim, and headliner, as well as Camel leather on the seats with hand-stitching and white micro-piping.",
    "The interior features a diamond stitching pattern that Bentley says took 18 months to develop. Each diamond contains 712 individual stitches, aligned to the center of the shape.",
    "Before you start thinking this is some sort of easy-going, cheap-to-operate plug-in hybrid, we’ve got to step in with a reality check. Bentley, as a brand, is just a few inches short of Rolls-Royce in the price and exclusivity department. Mulliner vehicles, especially, take the Bentley brand deeper into excess, and are even closer to that luxury benchmark.",
    "No exact pricing details have been released as yet, but the standard Flying Spur’s price tag already exceeds the $200,000 mark – so it’s reasonable to expect a coach-built version of the car to slide well north of $300,000.",
    "Better start saving now, then."
  ],
  "headers": {
    "3": "A yacht on wheels"
  },
  "links": {}
}