{
  "source": "https://www.techradar.com/news/iphone-13-satellite-communications-might-be-available-in-just-a-few-markets",
  "title": "iPhone 13 satellite communications might be available in just a few markets",
  "category": "phones",
  "updated": "2021-09-07T14:33:49Z",
  "author": "david-nield",
  "summary": "More details emerge",
  "article": [
    "Last week the iPhone 13 rumor mill was buzzing with speculation that the upcoming flagship would connect to satellite networks, enabling users to bypass cell networks for calls and texts. Now it seems the feature is coming – but only in certain parts of the world.",
    "Notable Apple tipster Mark Gurman has revealed in his Bloomberg Power On newsletter that these features are only going to be available \"in areas without any cellular coverage\" and even then \"only in select markets\".",
    "When the rumor first appeared, the idea was that the iPhone 13 might even turn into a full-on satellite phone, capable of operating free from 4G and 5G signals. Now it's clear that the functionality is going to be much more limited, and used for emergencies – at least as far as the next few iPhones are concerned.",
    "Gurman reveals that the satellite connectivity will enable users to send short text messages when they need help, even when there's no phone signal or Wi-Fi available. These will apparently appear as gray in the iOS Messages app, alongside blue for iPhone texts sent over iMessage, and green for standard SMSes on Android.",
    "Further down the line, it sounds like Apple has grander plans for this satellite communications option, with its own satellite network a possibility (we've heard rumors about this before). That's apparently still a long way off though.",
    "Full satellite connectivity requires hardware that's bulkier than the current iPhone, which is one potential problem. Another is that it would be unlikely to be well received by the carriers that Apple needs to stay friendly with – so it's going to be a few years yet before the iPhone can make calls and browse the web over space internet.",
    "Mark Gurman is usually a reliable source of Apple information, and if he's right this time, it sounds as though the satellite connectivity available in the iPhone 13 (or iPhone 14) is going to be a more stripped-down affair than was initially thought. What's more, it won't be available everywhere the iPhone is sold.",
    "The new report says that satellite connections would only be possible outside, and they might take up to a minute to be established. This isn't something you're going to be able to FaceTime your friends with, at least not initially.",
    "Even in this limited form though, it sounds pretty compelling – imagine being stuck out at sea or halfway down a mountain and in need of urgent assistance, and then when you look at your smartphone you find there's no signal at all. The iPhone might be able to keep you in touch with the rest of the world.",
    "That's definitely a reason to pick the iPhone 13 over any other phone on the market, including the upcoming Google Pixel 6 and Samsung Galaxy S22, assuming Apple gets at least some of the tech ready in time. After years of iterative progress in smartphones – with small performance and camera quality bumps – it looks as though another truly innovative feature might be about to arrive."
  ],
  "headers": {
    "3": "Blue, green, gray",
    "6": "Analysis: the iPhone innovates to stand out"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "connect to satellite networks": "https://www.techradar.com/news/iphone-13-satellite-link-could-keep-you-connected-even-when-networks-are-down",
    "Bloomberg Power On": "https://www.bloomberg.com/account/newsletters/power-on",
    "rumors about this": "https://www.techradar.com/news/apple-reportedly-working-on-a-satellite-network-for-its-own-devices",
    "iPhone 14": "https://www.techradar.com/news/four-iphone-14-leaks-you-need-to-know-even-though-it-isnt-coming-until-2022",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22"
  }
}