{
  "source": "https://www.techradar.com/news/windows-10-update-waves-goodbye-to-adobe-flash-player-once-and-for-all",
  "title": "Windows 10 update waves goodbye to Adobe Flash Player once and for all",
  "category": "computing",
  "updated": "2021-03-17T11:44:13Z",
  "author": "barclay-ballard",
  "summary": "The update automatically removes the program from Windows 10",
  "article": [
    "The latest update to Windows 10 will represent a final goodbye to Adobe Flash Player for many users, with the patch removing the version of the software that was bundled with the operating system. The update is currently optional and available from Microsoft’s Update Catalog, but it will be pushed via Windows Update and Windows Server Update Services over the next few weeks.",
    "But while the new Windows 10 update will remove Flash Player from users’ Control Panels, it won’t affect any versions of the software that have been installed as browser plug-ins. It is, however, recommended that any manually installed versions of Flash are also removed as soon as possible.",
    "Microsoft is planning a separate automatic update later this month to remove Flash from its Edge web browser, while Chrome got rid of Flash support last year. Mozilla’s Firefox web browser announced a similar move back in November.",
    "Although Adobe Flash Player remains a source of nostalgia for internet users of a certain age, the software’s farewell has been long in the making. Adobe announced that it would stop supporting Flash all the way back in 2017, and users had been turning away from the service since before even then.",
    "With other solutions being employed effectively on websites, notably HTML5, there became less and less reason to use Flash, aside from playing old browser-native games. What’s more, Flash became increasingly known for slowing web loading speeds, pop-up ads, and, most worryingly of all, security issues.",
    "Even with the new Windows 10 update installed, it’s possible that some Flash components may continue to reside on an individual’s computer, so it’s advisable to carry out a manual uninstall as well, lest they continue to pose a security risk. Microsoft has also warned that its latest update cannot be removed once installed, so once Flash is gone, it will be gone for good.",
    "Via Windows Latest",
    "VSDC Free Video Editor is a feature-packed non-linear suite that can compete with even expensive video editing software. There are no extra programs bundled in the installer – just the occasional prompt to upgrade to the premium edition.",
    "With VSDC you can create video projects from a combination of video clips, still images and audio files, with a resolution of up to 1,980 x 1,080 (full HD) and a maximum frame rate of 30fps. There's also a built-in screen capture tool for recording video and taking still images from your desktop – ideal for software reviews and tutorials. VSDC also offers an extensive range of video and audio filters, plus stylish transitions.",
    "You can export finished projects in a variety of formats, with handy ready-made profiles for popular devices. VSDC also provides a way to burn your project onto DVD – a feature rarely available in free video editors."
  ],
  "headers": {
    "3": "The long goodbye"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "last year": "https://www.blog.google/products/chrome/saying-goodbye-flash-chrome/",
    "announced": "https://www.techradar.com/news/mozilla-firefox-will-no-longer-support-adobe-flash-player",
    "Windows Latest": "https://www.windowslatest.com/2021/01/02/windows-10-update-to-kill-off-adobe-flash-player-permanently/",
    "VSDC Free Video Editor": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1431814752185714000&xs=1&url=http%3A%2F%2Fwww.videosoftdev.com%2Ffree-video-editor&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-10-update-waves-goodbye-to-adobe-flash-player-once-and-for-all",
    "video editing softwar": "https://www.techradar.com/best/free-video-editing-software",
    "free video editors": "https://www.techradar.com/best/free-video-editing-software"
  }
}