{
  "source": "https://www.techradar.com/news/dying-light-2-release-date-confirmed-for-december",
  "title": "Dying Light 2 release date confirmed for December",
  "category": "gaming",
  "updated": "2021-05-27T19:31:55.689Z",
  "author": "samuel-tolbert",
  "summary": "Stay out of the dark",
  "article": [
    "Dying Light 2 is back and it has a new subtitle. Dying Light 2: Stay Human is the new name and the game is now set for a December 7, 2021 release date, in line with the date that previously leaked.",
    "The new subtitle, Stay Human, is meant to indicate the lines that players shouldn't cross, remembering to stay human no matter how brutal the world has become.",
    "Set 20 years after the events of the original game, Dying Light 2: Stay Human has been described as \" the modern dark ages,\" where players take on the role of Aiden Caldwell in a bastion of humanity known as The City. It's a first person game with a heavy emphasis on physics-based parkour and brutal melee combat.",
    "Alongside the release date announced, Techland showed off new gameplay footage for Dying Light 2: Stay Human, detailing how The City is made up of different competing factions. We also got to see footage of what happens at night, when deadlier infected begin to roam.",
    "Going out to explore at night brings higher risk but also higher reward, as infected freely roaming means their nests are ripe for plundering. Player decisions will have an impact on the world, with different factions weakening or growing in strength and The City evolving in unique ways that reflect the benefits or consequences of player choice.",
    "Dying Light 2 was one of many games delayed due to the ongoing global pandemic that broke out in 2020, slipping past its initial Spring 2020 release window.",
    "Dying Light 2 was first announced back at E3 2018, with the game undergoing turmoil with the departure of writer Chris Avellone after sexual misconduct allegations surfaced.",
    "Dying Light 2: Stay Human is currently available for preorder on Xbox Series X, Xbox Series S, Xbox One, PC, PS5 and PS4."
  ],
  "headers": {
    "5": "Keep on running"
  },
  "links": {
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "previously leaked": "https://www.techradar.com/news/dying-light-2-release-date-confirmed-for-december",
    "sexual misconduct allegations surfaced": "https://www.windowscentral.com/games-writer-chris-avellone-accused-sexual-harassment-social-media",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}