{
  "source": "https://www.techradar.com/news/cheap-phone-deal-get-the-blade-x1-5g-for-just-dollar384-from-visible",
  "title": "Epic phone deal: get the Blade X1 5G for just $384 from Visible",
  "category": "phones",
  "updated": "2021-01-27T16:53:48Z",
  "author": "mackenzie-frazier",
  "summary": "Plus, get a $150 prepaid Mastercard and a free Fire TV Stick",
  "article": [
    "If you're on the hunt for a cheap phone deal and plan, then you've come to the right place. Right now, you can snag the brand-new Blade X1 5G phone for just $384 and receive a $150 prepaid Mastercard and a free Fire TV Stick when you sign up with Visible. Visible's Blade X1 is the latest in the Blade smartphone lineup and is the first 5G device to ever hit the market under $400. The Blade X1 features a 6.5-inch full-screen display, a quad-camera setup, and an all-day battery life. You're also getting Snapdragon 765G coupled with 6GB of RAM, 128GB of storage, and DTS:X Ultra audio to meet all of your entertaining needs. To receive the $150 prepaid Mastercard and Fire TV Stick, you must sign up with Visible and bring your number. The Blade X1 is priced at just $384 or $16 a month and can be paired with Visible's prepaid plans that start at just $25. This is a fantastic deal if you're looking feature-packed phone under $400 on Verizon's 5G network and want a cheap plan to pair with it.",
    "See more offers with our roundup of the 15 best unlocked SIM-free phones, prices, and deals that are currently being offered. Looking for a new phone and other plans? We also have the best mobile phone deals and plans that are currently going on."
  ],
  "headers": {
    "1": "Visible Blade X1 5G phone deal"
  },
  "links": {
    "for just $384": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-4797889099910906000&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Fshop%2Fsmartphones%2Fvisible-blade-x1-5g",
    "15 best unlocked SIM-free phones, prices, and deals": "https://www.techradar.com/deals/unlocked-mobile-phones",
    "best mobile phone deals and plans": "https://www.techradar.com/deals/mobile-phone-deals"
  }
}