{
  "source": "https://www.techradar.com/news/fable-4-combat-could-feel-like-the-witcher-3-and-were-breathing-a-sigh-of-relief",
  "title": "Fable 4 combat could feel like The Witcher 3 – and we're breathing a sigh of relief",
  "category": "gaming",
  "updated": "2021-08-11T10:44:44Z",
  "author": "henry-st-leger",
  "summary": "Fable 4 is shaping up to be a very interesting game",
  "article": [
    "The upcoming Fable reboot – or Fable 4, as it's colloquially known – is sounding better and better, as we learn that a developer from CD Projekt RED (The Witcher series, Cyberpunk 2077) will be working on the game's combat system.",
    "As reported by PCGamesN, gameplay designer Paweł Kapała is heading up the combat at Fable developer Playground Games, with his LinkedIn page confirming the role entails \"designing and implementing combat in Fable.\"",
    "While the shadow of Cyberpunk 2077's botched launch and shoddy last-gen console performance makes us loath to make too many comparisons there, Kapała's previous role at CDPR saw him working on guns and melee, along with weapons balance – while he had prior experience working on \"boss fights\" in The Witcher 3.",
    "When it was first announced that Playground would be developing the Fable reboot using the Forza engine, there was a general sense of shock that a dev primarily known for racing games would be taking on a fantasy RPG – a potential mismatch that made it hard to predict the end result.",
    "However, it's clear that Playground has made some smart hiring decisions for the game, too – given that the kind of sword-and-spells combat of The Witcher 3, one of the bestselling video games of all time, would be a perfect template for a Fable game.",
    "The Witcher's combat systems are built around a mix of melee weapons and both ranged and area-of-effect spells that can distort time, hurl fire, telekinetically shove enemies, and the like.",
    "Looking back at the spells used in Fable 2, for instance, it's clear that there's some shared DNA – with the game's Time Control, Inferno, and Force Push matching up closely with the and Yrden, Igni, Aard spells in The Witcher described above.",
    "Head of Xbox Phil Spencer seems confident that Playground can do the Fable franchise justice, and there are plenty of aspects of the Forza series – like its dynamic weather system, or gorgeously-rendered landscapes – that could make Fable 4's world a spectacular sandbox.",
    "Let's not forget the caliber of the game's writers, either, including the lead quest designer for the Borderlands series, a level designer for GTA 5 and GTA Online, and a whole load of writers who worked on Batman: Arkham Knight.",
    "With Playground bringing their experience in developing open-world games, and the combat taking some help from gameplay designers that have worked on some of the best in-game combat systems out there – systems that are very compatible to the Fable games of years past – the key elements are in place to make Fable 4 a reboot well worth getting excited for."
  ],
  "headers": {
    "5": "A Fable to remember"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "PCGamesN": "https://www.pcgamesn.com/cyberpunk-2077/fable-combat",
    "Playground would be developing the Fable reboot": "https://www.techradar.com/news/fable-on-xbox-series-x-could-be-built-using-an-unlikely-engine",
    "seems confident that Playground can do the Fable franchise justice": "techradar.com/uk/news/forza-horizon-5-should-speak-for-fables-quality-xbox-boss-insists",
    "like its dynamic weather system": "https://www.techradar.com/news/forza-horizon-5s-weather-system-makes-me-excited-for-fable-4",
    "the caliber of the game's writers": "https://www.techradar.com/news/fable-4-probably-wont-be-an-mmo-heres-why",
    "GTA 5": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x"
  }
}