{
  "source": "https://www.techradar.com/news/life-in-the-queue-meet-the-gamers-camping-out-for-an-rtx-3080-ti-across-the-us",
  "title": "Life in the queue: meet the gamers camping out for an Nvidia RTX 3080 Ti across the US",
  "category": "computing",
  "updated": "2021-06-03T20:30:53Z",
  "author": "john-loeffler",
  "summary": "Friends are made and tempers flare over the RTX 3080 Ti at Best Buy",
  "article": [
    "Ray got the news on Wednesday that Best Buy would get a limited number of RTX 3080 Ti graphics cards the next morning and he rushed to the company's Midtown Manhattan store, the nearest of dozens of stores nationwide receiving stock of one of the best graphics cards money could buy. Ray was in luck; the roped-off queue on the corner of 5th Ave and W. 44th St was empty. He stood next to the door and remained there for nearly 20 hours.",
    "\"You do what you gotta do, at this point,\" Ray told TechRadar at around 7am EST on Thursday morning, about half an hour before a handful of store employees came outside with printed, individually-numbered flyers that would guarantee that the bearer could buy one of the newly-released graphics cards. The Best Buy workers were flanked by two New York City Police Officers. A fight almost broke out anyway.",
    "The line behind Ray had grown to more than 200 people by 8am EST, wrapping around the corner and running down the entire length of W. 44th St. before curling onto Madison Ave. That's when the coveted flyers were handed out – but there were just 62 of them in total for the store, which covered all of New York City and its surrounding metro area.",
    "Months of low GPU supplies and intermittent restocks has made gamers desperate to get their hands on a next-gen Nvidia Ampere graphics card, and to a lesser extent AMD's Big Navi cards. Tracking \"drops\" and wading through digital queues or retailer lotteries overrun with scalping bots has been a test of will, requiring patience and a good bit of luck.",
    "But a bot can't physically stand outside a Best Buy overnight and into the morning, so Thursday's release of the RTX 3080 Ti has added physical endurance to the host of challenges facing gamers and PC enthusiasts trying to buy a new graphics card. Add to that the standard friction that comes with these kinds of product events and bitterness, frustration, and distrust can run rampant.",
    "If you wanted an RTX 3080 Ti Thursday morning, you had to show up the day before and earn it. That’s what Emon Novin and Jairo Velasco planned to do as two of the first people in line at the Costa Mesa, CA Best Buy, seated in fold-out chairs just outside the entrance. They’d arrived at around 10am, and were actually coming over from Micro Center in nearby Tustin, where they’d been camping out for the past two days awaiting the same June 3 drop – but they’d heard that more RTX 3080 Ti cards would be at the Best Buy and drove over.",
    "Novin claimed to have called the Best Buy help line and asked his way up the corporate ladder, eventually getting to someone who said the Costa Mesa location – one of seven in the state selling the cards on June 3 – had 64 Nvidia RTX 3080 Ti units in stock. By 5:45pm on Wednesday, over 80 people lined up behind Novin and Velasco, waiting for the morning.",
    "Whether there were enough cards to satisfy the line is anyone’s guess – a manager in the store declined to comment, pointing TechRadar to official Best Buy PR channels. But after months of failing to get graphics cards due to scalpers, bots, and poor luck in retailer lotteries, sitting in line overnight for a guaranteed drop in a physical location is surely better odds. Those could get better overnight as folks drop out of line.",
    "Even so, it’s still a far cry from ideal.",
    "“It’s ridiculous,” Novin said. Two weeks ago, he’d been at Micro Center for a drop of the standard RTX 3080, and camped out for three nights; that retailer’s policy is to only sell one GPU per customer per 30 days – and by the time he got to the front of the line, only the 3070 was in stock, which wouldn’t do for Novin’s plans for streaming.",
    "He and Velasco affirmed that they wanted the cards for their own computers, not for scalping – Novin said he had all the other components he needed to build a rig inside a Corsair case he estimated was big enough for the 3080 Ti. Compared to previous efforts at Micro Center, waiting overnight at Best Buy seemed less of an ordeal, and he planned to pass the time playing games with friends who were also waiting in line, like an impromptu in-queue LAN party.",
    "Around 8pm Wednesday night, Jack and Steven took their place in the slowly growing line on Manhattan's 5th Ave. They didn't know each other, but with literally 12 hours to kill, they spent the night and early morning hours talking and trying to ease the burden of their vigil.",
    "Neither of them got a flyer, in the end, and for his effort Jack also got a parking ticket shortly before the flyers were handed out. Both expressed their frustration to us when we spoke after the Best Buy staff told the disappointed crowd that there were no more flyers.",
    "\"I counted at least seven times,\" Steven said, \"from 8pm, 9pm, 10pm, 11pm, and also 12am, 1am and 2am, because I wanted to see if people were leaving. There were rumors that there were around 60 cards, and we were like 66th and 67th.\"",
    "\"We were below sixty in line,\" Jack said, \"but 25, 30 people cut in line in front of us at the last minute.\"",
    "There was some chaos in the final moments as the last of the flyers, stacked in a manila folder and visibly shrinking by the second, were handed out. One customer stepped forward to claim their flyer and was shoved by another from behind. Whether on purpose or by accident, the tension almost boiled over as the two police officers had to physically separate the two.",
    "The last flyer went to Shah, the 62nd person in the final single-file line that the NYPD officers tried to enforce. \"It was really bad,\" he told us, \"people were cutting over [in front of me] and I didn't think I was going to get it.",
    "\"It would have been such a waste of time. I've been sitting here since 5pm [Wednesday]. I've been trying to get an RTX – any RTX – for months.\"",
    "The one complaint we heard over and over from people on line was scalpers, who were undoubtedly among those who got one of Best Buy's flyers. With the prices for the RTX 3080 Ti already doubling its MSRP on sites like eBay and StockX, there's no shortage of profiteers looking to cash in on gamer's desperation who are willing to cut a line or push their way forward if it means a huge payday.",
    "Chow, who drove in from Suffolk County, Long Island with two friends, said that the $1,200 MSRP for the RTX 3080 Ti wasn't an issue: \"I just don’t want to pay extra money for it.\"",
    "\"It’s not really about the money,\" Chow added, \"I just don’t want to give [scalpers] the satisfaction.\"",
    "Shah agrees. \"I wanted to get the 3080, over the Ti,\" Shah told us, \"but I don't care at this point. I'm not paying their scalping price.\""
  ],
  "headers": {
    "5": "Want an RTX 3080 Ti today? Get in line yesterday",
    "11": "The real RTX 3080 Ti is the friends we made along the way",
    "16": "Luck of the ray-traced render"
  },
  "links": {
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere"
  }
}