{
  "source": "https://www.techradar.com/news/sorry-spider-man-no-way-home-isnt-as-secretive-as-mcu-fans-are-making-out",
  "title": "Sorry, Spider-Man: No Way Home isn't as secretive as MCU fans are making out",
  "category": "entertainment",
  "updated": "2021-08-21T14:00:00Z",
  "author": "tom-power",
  "summary": "Opinion: We know more about Spider-Man: No Way Home than we think",
  "article": [
    "Has a Marvel movie generated as much hype or conjecture as Spider-Man: No Way Home? Based on the last few months, it doesn’t initially appear so.",
    "As No Way Home’s release date draws closer, fan fervour concerning the webslinger’s third MCU outing has grown with each passing week. Some fans have resorted to pouring over the movie’s licensed merchandise to garner clues about its plot, while others have become frustrated about when a teaser trailer will actually arrive.",
    "The clamor has been so great, in fact, that Marvel Studios President Kevin Feige recently weighed in on the supposed secrecy (per CinemaBlend) surrounding the film.",
    "Speaking during the press tour for Marvel’s Shang-Chi, Feige said that it “has not necessarily occurred to me that it [No Way Home] is any more or less secret than any of our other projects”, before confirming that “there will be a trailer” before the movie’s December 17 release.",
    "Fans have welcomed and, in some cases, scoffed at the news that a trailer will eventually arrive, given that we’ve waited a long time for one. But Feige is right: No Way Home isn’t more secretive than previous MCU movies – not by a long shot – and there are a myriad of reasons why.",
    "Of the 24 MCU movies released so far, Avengers: Endgame has been the most secretive by far. Add in forthcoming movies like Shang-Chi, Eternals and No Way Home, and we’d still consider Marvel’s tight-lipped approach to Endgame to be greater than any previous or upcoming film project.",
    "Endgame’s first trailer didn’t arrive until four months before its April 2019 release. Even then, the trailer’s footage primarily drew from the film’s opening hour and was spliced together with scenes from previous Marvel flicks. The second trailer wasn’t released until a month before Endgame’s launch, too, and was even more nondescript than its predecessor.",
    "Combine this with the film’s ensemble cast being reticent to discuss the movie during its press tour (for fear of letting secrets slip) and Endgame being the culmination of 11 years of MCU movies, and it’s unsurprising that Marvel played its cards so close to its chest.",
    "Sure, some fans will point out that No Way Home still doesn’t have a trailer. The longer that wait goes on, too, the less time there will be between the trailer’s release and the launch of the movie. So there's still time for No Way Home to overtake Endgame as the Marvel movie with the shortest time span between its initial trailer arriving and the movie’s actual release.",
    "There are reasons behind the trailer’s supposed delay, though. Asad Ayaz, Disney’s Head of Marketing, recently told The Hollywood Reporter that it’s Sony Pictures – not Marvel – who dictates when No Way Home’s trailer will arrive. While Marvel is closely partnered with Sony on the flick, it’s the latter that owns the Spider-Man IP, so it’ll decide when the first trailer drops.",
    "According to the latest rumors, Spider-Man: No Way Home’s first footage could debut at CinemaCon between August 23 and 26. If that’s true, we might not have much longer to wait for the trailer to be made public.",
    "Still, No Way Home’s apparently secretive approach pales in comparison to Endgame. Or even Marvel Disney Plus shows like WandaVision and Loki, for that matter, with fans heavily speculating where each series would go in between their weekly episodic instalments.",
    "How so? No Way Home’s merchandise and casting leaks hold the answers.",
    "Marvel Studios may have a tight handle on the information that it releases, but other companies and individuals aren’t so hush-hush.",
    "Take No Way Home’s official merchandise, for example. Various tie-in toys and collectibles, such as Lego sets, Funko Pops and other figurines, have revealed potentially spoiler-heavy elements of the movie. Alright, we don’t know how these factor into the film’s story, but some of these merchandise drops, coupled with Doctor Strange’s role in the movie, have given us a glimpse at what the plot could entail.",
    "Members of the cast, though officially unconfirmed by Marvel as of yet, haven’t been shy about confirming that they’ll appear in No Way Home, either.",
    "Alfred Molina, who portrayed Doc Ock in 2004’s Spider-Man 2, has already stated that he’ll be reprising his role (per Variety) in the forthcoming threequel – something that Feige responded to during the Black Widow press tour (via ET Online). Jamie Foxx – Electro in 2014’s The Amazing Spider-Man 2 – has also pre-emptively confirmed he will be part of No Way Home’s cast.",
    "Add in the continuous speculation surrounding the return of former Spider-Man actors Tobey Maguire and Andrew Garfield – rumors that Garfield and current Spider-Man star Tom Holland have denied – and some of No Way Home’s biggest secrets may have been revealed ahead of time.",
    "Spider-Man is historically one of Marvel’s most popular superheroes. With such a big fanbase, any live-action property concerning the wallcrawler is bound to elicit numerous rumors.",
    "No Way Home is expected to be Holland’s final outing as Spider-Man, as well as the movie to provide greater clarity on how the multiverse’s arrival will affect the MCU moving forward. We’ve received glimpses of its impact in Loki season 1 and Marvel’s What If…? series, but No Way Home will offer a much clearer indication of the chaos that’s about to ensue.",
    "While Marvel is yet to officially confirm whether any of the above rumors are true, though, the secrecy surrounding Spider-Man: No Way Home isn’t as grandiose as we’re being led to believe.",
    "Yes, it’s being driven by a simple desire for a trailer – one that will hopefully corroborate some of the speculation surrounding the film – but we haven’t been left in the dark completely. There are things we know outside of what Marvel has officially revealed, so much so that Spider-Man: No Way Home’s apparent secrecy is inferior to some of the studio’s other recent productions.",
    "It’s frustrating that we have to wait so long for an official look at No Way Home but, at this point, there’s a big chance that the first trailer will just reveal what we already know about the movie.",
    "We know more about Spider-Man: No Way Home than we think – so let’s stop blowing its supposed secrecy out of proportion."
  ],
  "headers": {
    "5": "We’re in the Endgame now",
    "13": "Ruining the surprise"
  },
  "links": {
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "garner clues about its plot": "https://www.techradar.com/news/spider-man-no-way-home-lego-sets-suggest-peter-parker-might-lose-his-powers",
    "weighed in on the supposed secrecy": "https://www.techradar.com/news/is-a-spider-man-no-way-home-trailer-actually-dropping-kevin-feige-weighs-in",
    "CinemaBlend": "https://www.cinemablend.com/news/2572263/marvel-kevin-feige-opens-up-about-spider-man-no-way-home-trailer",
    "Shang-Chi": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-features/loki-marketing-disney-marvel-studios-1234970535/",
    "latest rumors": "https://twitter.com/spideysnews/status/1427406086429024256",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Loki": "https://www.techradar.com/news/loki-season-2",
    "other figurines": "https://www.techradar.com/news/spider-man-looks-like-hell-get-a-big-suit-upgrade-in-no-way-home",
    "Variety": "https://variety.com/2021/film/news/alfred-molina-spider-man-no-way-home-doc-ock-1234953527/",
    "ET Online": "https://www.etonline.com/kevin-feige-on-how-black-widow-elevates-the-mcu-and-whats-next-for-marvel-movies-and-tv-exclusive",
    "pre-emptively confirmed": "https://twitter.com/DanielRPK/status/1312139410696146944",
    "rumors that Garfield": "https://www.techradar.com/news/spider-man-far-from-home-wont-feature-andrew-garfield-actor-says-is-the-hype-out-of-control",
    "have denied": "https://www.gq-magazine.co.uk/culture/article/tom-holland-cherry-interview",
    "Marvel’s What If…? series": "https://www.techradar.com/news/marvels-what-if-is-a-surreal-disney-plus-anthology-show-with-limitless-potential"
  }
}