{
  "source": "https://www.techradar.com/news/photoshop-for-ipad-inches-closer-to-desktop-version-with-new-tools",
  "title": "Photoshop for iPad inches closer to desktop version with Magic Wand tool",
  "category": "cameras",
  "updated": "2021-08-17T13:00:00Z",
  "author": "mark-wilson",
  "summary": "Adobe hands its iPad users a magic wand",
  "article": [
    "Photoshop for iPad has been given some handy new retouching tools, including the 'Magic Wand', that help move it a little closer to the desktop version of the editing app.",
    "In its August update (version 2.7), Photoshop for iPad gives you the ability to quickly choose parts of your image thanks to the 'Magic Wand' tool, which is a popular staple of the desktop app.",
    "Adobe admits that the 'Magic Wand' has been a \"highly requested\" feature for the iPad version of Photoshop, which first arrived back in November 2019, so it's good to see it finally added. The tool is particularly handy if you want to edit a distinctly-colored part of an image, or quickly remove an object from a background.",
    "The 'Magic Wand' tool also joins a boosted version of the 'Healing Brush' in Photoshop for iPad, which arrived in its June (version 2.6 update). That update let you use the 'Healing Brush' to paint over areas using sampled pixels – in other words, existing parts of an image that you're looking to replicate when painting over an imperfection.",
    "One other addition to Photoshop for iPad in the August (version 2.7) update is the ability to 'project your canvas'. Plug your iPad into an external display like a monitor or TV via HDMI or USB-C and it'll show your real-time workings in the app (minus the Photoshop UI) on the bigger screen.",
    "This feature could be handy for anyone who teaches Photoshop for iPad, and is something we've already seen on rival apps like Procreate.",
    "It's not just Photoshop for iPad that's been given some tweaks for August. The desktop version of the app (version 22.5) has been given an improved 'Sly Replacement' feature, which lets you automatically swap out a drab sky in your photo for a more exciting one.",
    "The new version now has more sky presets to choose from, thanks to integration with the Adobe Discover community of photographers and artists.",
    "These August updates to Photoshop for iPad are in keeping with Adobe's approach towards the app – small, incremental tweaks that collectively take the tablet version a few inches closer to the desktop equivalent. But there's still a fair way to go and rivals like Affinity Photo and Procreate arguably still offer better value.",
    "The addition of the 'Magic Wand' and 'project your canvas' tools aren't ground-breaking on their own, but they do represent the sixth incremental update that Adobe has made to Photoshop for iPad this year.",
    "In June, we got improvements to the 'Healing Brush' and the long-awaited ability to bring custom brushes into the app, while earlier in the year the focus was on polishing the cloud experience.",
    "But Adobe's decision to build a 'full' version of Photoshop for the iPad, based on the same code-base as the desktop equivalent, has been double-edged.",
    "Its user experience is comfortably familiar to anyone who's a Photoshop veteran, but the technical challenge of porting such a powerful app to the iPad has meant a pretty slow rollout of features – which is why it's only just received the 'Magic Wand'.",
    "The appeal of alternatives like Procreate (which is stronger at illustration) and Affinity Photo (currently top of our guide to the best photo editing apps) is that they feel more at home on the iPad and are also available as one-time purchases, rather than requiring a Creative Cloud subscription.",
    "Naturally, Photoshop regulars will feel more at ease with the interface of Photoshop for iPad, and it is slowly becoming a powerful standalone tool for professionals.",
    "But if you're looking for an image editing tool with desktop power and aren't fully immersed in the Adobe world, you may well see Affinity Photo (US$19.99/£19.99/AU$30.99) as the better option – at least until Adobe rolls out a few more updates to Photoshop for iPad."
  ],
  "headers": {
    "8": "Analysis: Photoshop for iPad makes slow progress"
  },
  "links": {
    "Photoshop for iPad": "https://www.techradar.com/reviews/photoshop-for-ipad",
    "best photo editing apps": "https://www.techradar.com/best/best-photo-editing-apps"
  }
}