{
  "source": "https://www.techradar.com/news/google-pixel-foldable-phone",
  "title": "Google Pixel Fold release date rumors, price, news and leaks",
  "category": "phones",
  "updated": "2021-10-19T18:25:56Z",
  "author": "james-rogerson",
  "summary": "Google's next phone might fold",
  "article": [
    "The Google Pixel 6 and Pixel 6 Pro have now launched and while there was an outside chance that the Pixel Fold could have landed alongside them, that didn't happen.",
    "At the moment there are only a few companies really making foldable phones, and Samsung is dominating the market with handsets like the Samsung Galaxy Z Fold 3. But it might soon have some serious competition, as it looks like Google has a foldable phone on the way.",
    "We don’t know what this handset will be called yet, so for now we’re just referring to it as the Google Pixel Fold (since it’s likely to have Pixel branding in line with the company’s other phones).",
    "We have heard some details of the possible design, screen and specs though, all of which you’ll find below. We’ve also included information on a possible release date, which some rumors suggest could be by the end of 2021, as well as speculation about the price.",
    "As soon as we hear anything else about the Google Pixel Fold, we’ll add it to this article, so make sure to check back regularly if you want to stay up to date.",
    "Rumors currently suggest that the Pixel Fold will land either in late 2021 or early 2022. At least, that's what Jon Prosser (a leaker with a solid track record) has claimed, and he's not alone, with display analyst Ross Young also claiming that a Google foldable phone will land in the second half of 2021.",
    "Plus, a report claims that Google (among other companies) has purchased foldable phone screens from Samsung Display, and it goes on to say that smartphones using these screens will launch this year. The same site has more recently said the same thing again, and another leak regarding phones coming with screens from Samsung Display listed the Pixel Fold as launching in Q4 2021 – the same window it gave for the Pixel 6.",
    "Finally, mention of the 'Passport' codename and GPQ72 model number have been spotted in Android 12 beta code, and they're believed to be attached to the Pixel Fold. Their presence in the code suggests not just that the phone exists, but that it might arrive before too long.",
    "That said, if a Pixel foldable phone was to launch in 2021, our best guess for the timing would have been alongside the Google Pixel 6, and while a leak even specifically said the Fold would land alongside it, that didn't happen, so we're not optimistic that we'll see it this year.",
    "As for what it might cost, there’s no news there, but foldables are always expensive. That said, the Google Pixel 5 is cheaper than most flagship phones. That’s in part because Google opted not to put a cutting-edge chipset in it, but it might take a similar approach with the Pixel foldable. Even then though we’d expect at least a very high three-figure or low four-figure price.",
    "The main information about the Google Pixel foldable phone comes from a report which claims that Google has ordered foldable OLED panels of around 7.6 inches from Samsung Display - a claim that we've now heard multiple times.",
    "That’s the same size as the main screen on the Samsung Galaxy Z Fold 2, and big enough that the Pixel foldable could have the same form factor as the Galaxy one – that is, a typical phone-sized screen when shut, but opening out like a book to reveal a more tablet-sized display. That said, we can’t rule out it having a clamshell design like the Samsung Galaxy Z Flip.",
    "Beyond this leak, we’ve also seen a Google patent which shows a screen that opens out to a tablet size, but then can additionally be stretched a little further, like the rollable phone concepts we’ve seen. This however looks ambitious for Google’s first foldable phone, so we’re not convinced it will have this design.",
    "Patently Mobile has also spotted two additional Google Pixel foldable phone patents, one of which shows a fairly conventional clamshell design, while the other has two hinges, allowing it to form a Z-shape as it unfolds, and go from smartphone size to full tablet size.",
    "So Google seems to be experimenting with a lot of different foldable designs, but it remains unclear which if any of these will be used.",
    "Code spotted in an Android 12 beta suggests that the Google Pixel Fold will have the same modem as the Pixel 6 range. That suggests - but by no means guarantees - that it will also have the same chipset, which is confirmed in the case of the Pixel 6 to be the new Google Tensor.",
    "Given that this chipset seems designed to make the most of the new cameras on the Pixel 6 range, that could additionally mean the same cameras will be used too, but we're not at all certain of that. If it does have those cameras, then you can expect either a dual-lens or triple-lens setup, with main, ultra-wide and possibly also telephoto (4x optical zoom) snappers.",
    "Beyond that we don’t know anything about the specs of the Google Pixel foldable phone, but we can speculate a little. For one thing, it will probably run Android 12, but will certainly run whatever the latest Android version is at the time of its launch.",
    "Going by the standard Pixel range, it will probably also have decent cameras, but perhaps fewer lenses than rival phones. We’d also expect the company’s foldable will support 5G."
  ],
  "headers": {
    "5": "Google Pixel Fold release date and price",
    "10": "Design and display",
    "15": "Specs and features"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "either in late 2021 or early 2022": "https://www.techradar.com/news/the-google-pixel-fold-could-be-real-and-coming-this-year",
    "a report": "https://www.techradar.com/news/google-pixel-foldable-phone-may-come-in-2021-but-dont-expect-it-to-replace-pixel-6",
    "said the same thing again": "https://www.techradar.com/news/five-new-foldable-phones-leak-including-the-pixel-fold-and-a-giant-xiaomi-phone",
    "leak": "https://www.techradar.com/news/google-pixel-fold-could-launch-before-the-end-of-2021",
    "spotted in Android 12 beta code": "https://www.techradar.com/news/google-pixel-6-and-pixel-fold-mentioned-in-android-12-beta-code",
    "the Fold would land alongside it": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "has ordered foldable OLED panels": "https://www.techradar.com/news/google-pixel-foldable-phone-may-come-in-2021-but-dont-expect-it-to-replace-pixel-6",
    "heard multiple times": "https://www.techradar.com/news/five-new-foldable-phones-leak-including-the-pixel-fold-and-a-giant-xiaomi-phone",
    "Samsung Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "also seen a Google patent": "https://www.techradar.com/news/a-future-google-pixel-foldable-phone-may-slide-in-with-a-fun-party-trick",
    "Patently Mobile": "https://www.patentlymobile.com/2019/03/patents-from-google-and-zte-show-that-theyre-working-on-folding-smartphones-too.html",
    "spotted in an Android 12 beta": "https://www.techradar.com/news/google-pixel-fold-could-be-a-foldable-pixel-6",
    "Google Tensor": "https://www.techradar.com/news/google-pixel-6s-new-tensor-chipset-3-ways-it-may-top-apple-and-samsung-silicon",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}