{
  "source": "https://www.techradar.com/news/canon-reportedly-making-first-ever-tilt-shift-autofocus-lens-for-mirrorless",
  "title": "Canon reportedly making first-ever tilt-shift autofocus lens for mirrorless",
  "category": "cameras",
  "updated": "2021-05-07T00:58:33Z",
  "author": "sharmishta-sarkar",
  "summary": "One could be the widest tilt-shift lens ever",
  "article": [
    "A leaked Canon roadmap from October 2020 mentioned a couple of tilt-shift RF lenses for the brand's full-frame mirrorless camera system. At the time, not much was known about the TS-series lenses, but a new report from the oft-reliable Canon Rumors suggests we could see two of them by the end of this year.",
    "The most exciting part of this fresh leak is that these lenses could be the first to feature autofocus capabilities in the TS line-up, most likely thanks to the advances made in mirrorless technology.",
    "Tilt-shift lenses have, so far, only featured manual focus as AF systems can only work on a flat focal plane, while TS lenses (as the name suggests) have been designed to tilt and shift that flat plane to create different perspectives.",
    "That's not the only obstacle Canon will need to account for – it's also the amount of light that passes through to the sensor. Because of the physical movement of the optics within the lens, the amount of light passing through is also diminished, which is usually seen as vignetting in the results of many tilt-shift lenses. This, too, will affect a camera's AF calculations.",
    "Although it's never been done before, Canon has proved recently that the company is still capable of huge feats of innovation – take the new fixed-aperture f/11 RF 600mm and 800mm as an example.",
    "And then there's Canon's excellent AF algorithms in the EOS 1D-X Mark III, the EOS R5 and the R6. So anything is possible.",
    "Including making the widest-ever tilt-shift lens. According to Canon Rumors, the two lenses coming are the Canon TS-R 14mm f/4L and Canon TS-R 24mm f/3.5L. If true, then the 14mm lens will be the widest yet – currently the Laowa 15mm f/4.5 Zero-D Shift is the widest TS lens available for the RF mount.",
    "When Canon announced the EOS R (2018) and EOS RP (2019), and the accompanying lenses, it felt as though the company had entered a slump. Canon has since proved us wrong by coming up with some very impressive innovations. So if the camera maker can pull of making tilt-shift lenses with AF, then it may just be its biggest achievement yet."
  ],
  "headers": {
    "4": "Open wide"
  },
  "links": {
    "Canon Rumors": "https://www.canonrumors.com/canon-will-introduce-new-tilt-shift-lenses-with-a-high-megapixel-camera-cr2/",
    "fixed-aperture f/11 RF 600mm and 800mm": "https://www.techradar.com/news/canon-rf-600mm-and-800mm-f11-are-these-fixed-aperture-telephotos-worth-it",
    "EOS 1D-X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii"
  }
}