{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-november-19-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-11-19T15:00:08Z",
  "author": "axel-metz",
  "summary": "Here’s what’s new on Netflix and other streamers this weekend",
  "article": [
    "We’re just over a week away from Black Friday 2021, which means the TechRadar site is awash with deals on all the latest and greatest hardware – but those worried we’d be distracted from this week’s new streaming arrivals need not fear.",
    "In fact, this weekend marks the most impressive weekend of new movies and TV shows we’ve seen for some time. As well as highly-anticipated series like Amazon’s The Wheel of Time and Netflix’s Cowboy Bebop, we’re being treated to a slew of film awards hopefuls, too, including Lin Manuel-Miranda’s tick, tick...BOOM! and the Will Smith-starring King Richard.",
    "Below, we’ve rounded up the seven biggest arrivals coming to the likes of Netflix, Prime Video and HBO Max over the next few days.",
    "Amazon’s big-budget fantasy show, The Wheel of Time, has finally arrived on Prime Video. An adaptation of Robert Jordan’s best-selling novel series, it follows powerful sorceress Moiraine (Rosamund Pike) on her quest to find the Dragon Reborn, a powerful warrior prophesied to either save mankind, or destroy it.",
    "Game of Thrones comparisons have been rife ahead of its release, but this show is much more about high fantasy than George R. R. Martin’s series – think magic, witches and wizards in place of silver-tongued charlatans and incestuous siblings.",
    "To get a better idea of what to expect, we sat down with The Wheel of Time’s cast and showrunner, Rafe Judkins, to discuss the pressures of bringing Jordan’s sweeping fantasy epic to life.",
    "Episodes 1-3 are now available to stream on Prime Video",
    "Three-and-a-half years after it was first announced, the live-action adaptation of beloved anime series Cowboy Bebop has arrived on Netflix.",
    "The original Cowboy Bebop was a Japanese-produced, jazz-inspired anime series from the 1990s which followed a band of intergalactic bounty hunters through the solar system, and this remake looks to breathe new life into its winning blend of science fiction and noir tropes.",
    "John Cho, Mustafa Shakir, Daniella Pineda and Alex Hassell all star in this 10-episode debut season, with original composer Yoko Kanno returning to helm its famously jazzy soundtrack.",
    "Now available to stream on Netflix",
    "An early Oscars contender, HBO’s King Richard follows the tireless journey of Richard Williams (Will Smith), an undeterred father committed to taking his gifted daughters, Venus and Serena, to the top of the tennis game.",
    "Saniyya Sidney, Demi Singleton, Jon Bernthal, Tony Goldwyn and Dylan McDermott star alongside Smith in this one, which has been produced by the Williams sisters themselves – so expect an authentic portrait of passion and sacrifice.",
    "King Richard is available to stream on HBO Max in the US as part of Warner Bros’ ongoing day-and-date release schedule, but UK audiences will have to catch this one in theaters.",
    "Now available to stream on HBO Max in the US",
    "No, we didn’t ask for it. No, reviews haven’t been kind. But Netflix couldn’t resist the urge to cash in on the massive pandemic popularity of its wild docuseries, Tiger King.",
    "This time around, with Joe Exotic behind bars and Carole Baskin closing in on ownership of his disreputable zoo, audiences are supposedly exposed to even more unbelievable revelations surrounding the lives of America’s most notorious big cat owners.",
    "Despite Baskin’s refusal to take part in Tiger King 2, though, she’s more the focus than Exotic himself – so expect to hear more (or less?) about the mysterious disappearance of her husband, Don Lewis.",
    "Now available to stream on Netflix",
    "In Lin-Manuel Miranda’s feature directorial debut, promising young theater composer Jonathan Larson (Andrew Garfield) navigates love, friendship and the pressures of life as an artist in New York City on the cusp of his 30th birthday.",
    "Incidentally, tick, tick...BOOM! is actually based on the semi-autobiographical musical of the same name by Larson himself, whom Garfield plays in this one, so fans of the playwright (and musicals in general) should find lots to love here.",
    "We reckon, like King Richard, it’ll be the subject of awards noise over the next few months, too, so tick, tick...BOOM! is definitely worth a watch for those who like to stay on top of the Oscars rumor mill.",
    "Now available to stream on Netflix",
    "HBO Max's latest comedy series, The Sex Lives of College Girls, centers on four randomly assigned roommates (Pauline Chalamet, Amrit Kaur, Reneé Rapp and Alyah Chanelle Scott) of varying backgrounds as they begin their first year at a fictitious New England university.",
    "Created by Mindy Kaling and Justin Noble, this one looks to bear more than a few similarities to the former’s Netflix show, Never Have I Ever, and though early reviews have been mixed, we’d say it’s a safe bet for fans of Kaling’s trademark humor.",
    "Episodes will arrive in batches of two or three each Thursday, with the first two available now. And yes, in case you were wondering, Pauline Chalamet is the sister of Timothée.",
    "Now available to stream on HBO Max in the US",
    "The first of HBO’s five new Music Box documentaries (further entries will arrive every Thursday), Jagged traces the early career and troubled personal life of Canadian singer Alanis Morissette.",
    "Interestingly, despite appearing in the film through an in-depth interview, Morissette has since come out publicly against the depiction of events in Jagged which, in our opinion, makes it an all-the-more intriguing watch.",
    "The New York Times described this one as “thrilling”, which is rare praise for a seemingly run-of-the-mill music doc.",
    "Now available to stream on HBO Max in the US"
  ],
  "headers": {
    "3": "The Wheel of Time (Prime Video)",
    "7": "Cowboy Bebop (Netflix)",
    "11": "King Richard (HBO Max)",
    "15": "Tiger King 2 (Netflix)",
    "19": "tick, tick...BOOM! (Netflix)",
    "23": "The Sex Lives of College Girls (HBO Max)",
    "27": "Jagged (HBO Max)"
  },
  "links": {
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "The Wheel of Time": "https://www.techradar.com/news/amazons-the-wheel-of-time-season-1-release-date-cast-plot-trailer-and-more",
    "Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Game of Thrones comparisons": "https://www.techradar.com/news/the-wheel-of-time-5-things-we-learned-at-the-amazon-fantasy-shows-world-premiere",
    "we sat down with": "https://www.techradar.com/news/the-wheel-of-time-is-amazon-primes-big-budget-fantasy-show-that-cant-afford-to-fail"
  }
}