{
  "source": "https://www.techradar.com/news/ethan-hawke-joins-marvels-moon-knight-cast-for-disney-plus-tv-show",
  "title": "Marvel's Moon Knight may have its series villain – here's why we're excited",
  "category": "entertainment",
  "updated": "2021-01-18T16:17:44Z",
  "author": "henry-st-leger",
  "summary": "After sunset",
  "article": [
    "Another actor has been confirmed for the upcoming Disney Plus TV show Moon Knight, with Ethan Hawke joining the cast as the the series main antagonist (via The Hollywood Reporter).",
    "Hawke has a long and esteemed list of film credits, including Richard Linklater's Before Sunrise / Before Sunset / Before Midnight trilogy, as well as Linklater's Boyhood and horror movies Sinister and The Purge. It will be the first time he's appeared in the Marvel Cinematic Universe, though, or even a comic book adaptation. Welcome to the club, Hawke!",
    "We expect Hawke's horror experience will serve him well, given the series is being directed by Justin Benson and Aaron Moorhead – the duo behind indie horror flicks The Endless and Synchronic. And we hope Hawke's prior Oscar-nominated performances will add some gravitas to the series when it airs on Disney Plus.",
    "We recently heard that Oscar Isaac (Star Wars: The Rise of Skywalker, Inside Llewyn Davis) was taking on the lead role of Marc Spector / Moon Knight – from the show's choreographer, no less.",
    "There's no word on exactly which character Hawke is set to play, though The Hollywood Reporter states that \"Moon Knight's archnemesis is a villain named Bushman, a fellow mercenary who turned on the hero when Egyptian gold came into the picture\" – which could well be the plot Marvel has planned for the show.",
    "We're yet to hear more about his daughter Maya Hawke reprising the role of Robin in Stranger Things season 4, which has been hit by numerous production delays and yet to receive a firm release date.",
    "Marvel’s Moon Knight series is one of a lot of MCU projects bound for the streaming service in 2021. WandaVision has just begun rolling out weekly episodes, before The Falcon and the Winter Soldier, Loki, She-Hulk, Ms. Marvel and Hawkeye all make their way to the platform later on in the year.",
    "Marvel's Chief Creative Officer Kevin Feige had previously suggested that both She-Hulk and Ms. Marvel would wrap production in 2020, but Covid restrictions meant filming was halted for most of its projects – meaning its release slate has gone a little awry.",
    "Moon Knight was first announced at D23 way back in August 2019, so there’s no telling when to expect it’s arrival on Disney Plus. Given we're still in the early days of cast announcements, though – Marvel hasn't confirmed Oscar Isaac's casting in the show – we expect it could be a while yet."
  ],
  "headers": {
    "6": "What else is on the way?"
  },
  "links": {
    "Disney Plus TV show": "https://www.techradar.com/news/disney-plus-best-upcoming-tv-shows-and-movies",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/heat-vision/ethan-hawke-to-play-villain-opposite-oscar-isaac-in-marvels-moon-knight-exclusive",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "from the show's choreographer": "https://www.techradar.com/news/moon-knight-oscar-isaac-in-talks-for-lead-role-in-latest-disney-plus-mcu-casting-news",
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained"
  }
}