{
  "source": "https://www.techradar.com/news/some-of-playstations-biggest-game-franchises-could-come-to-mobile",
  "title": "Some of PlayStation’s biggest game franchises could come to mobile",
  "category": "gaming",
  "updated": "2021-04-10T10:41:51Z",
  "author": "emma-boyle",
  "summary": "PlayStation Studios is looking for a Head of Mobile",
  "article": [
    "It looks like PlayStation could be planning to develop and expand its mobile gaming offering, if a recent PlayStation Studios job listing is anything to go by.",
    "The job listing, shared on the ResetEra forums (via IGN), is for a new Head of Mobile at PlayStation Studios. According to the job description, Sony Interactive Entertainment is looking for someone based in San Mateo or Los Angeles to “own and develop the mobile games strategy for PlayStation Studios” and be “responsible for building and scaling a team of mobile leaders and will serve as the Head of this new business unit within PlayStation Studios.”",
    "Although the listing talks in general terms about the Head of Mobile having to lead “all aspects of the expansion of our game development from consoles and PCs to mobile & Live Services”, it also mentions a particular “focus on successfully adapting PlayStation’s most popular franchises for mobile.”",
    "It also appears that Sony and PlayStation are thinking long-term when it comes to mobile games; the listing states that the Head of Mobile will work with PlayStation Studios Leadership Team to “develop mobile product roadmap for a 3-5-year time frame”, though it does also note that the role will involve managing an “existing mobile slate already in development”.",
    "Bringing some of its most popular franchises to mobile wouldn’t be a completely unthinkable move from PlayStation. PlayStation Mobile Inc. previously released a mobile version of Uncharted with the puzzle adventure Uncharted: Fortune Hunter. It also dropped its popular character Sackboy into the endless runner Run, Sackboy, Run!",
    "You might even remember the time in 2012 when PlayStation Mobile was announced, intending to offer “an enticing entry point into the PlayStation world to all owners of a PlayStation Certified smartphone or tablet, while giving PlayStation Vita gamers the chance to expand their collection with a host of innovative, affordable titles.” That venture ended in 2015.",
    "Regardless of previous attempts, there’s no denying that now is far from the worst time for PlayStation to really make a go at creating successful mobile games from its existing franchises. After all, some of the most popular mobile games today, like Call of Duty Mobile and PUBG Mobile, have been adapted from established console or PC titles.",
    "Activision Blizzard has previously suggested that it’s planning to go all in on its mobile games and Nintendo has, with varying levels of success, been trying to make mobile hits out of his biggest IPs for a few years now.",
    "PlayStation has some of the biggest gaming franchises to its name and it’d certainly be interesting to see how it might bring some of them to Android and iOS in the future, especially after distancing itself from the idea of more handheld consoles."
  ],
  "headers": {
    "6": "The right time?"
  },
  "links": {
    "job listing": "https://boards.greenhouse.io/sonyinteractiveentertainmentplaystation/jobs/3051283",
    "ResetEra": "https://www.resetera.com/threads/sony-is-hiring-for-a-new-mobile-business-unit-within-playstation-studios.407487/",
    "IGN": "https://www.ign.com/articles/playstation-studios-is-hiring-a-head-of-mobile",
    "PlayStation Mobile": "https://blog.playstation.com/archive/2012/10/03/welcome-to-playstation-mobile/",
    "Call of Duty Mobile": "https://www.techradar.com/news/call-of-duty-mobile-season-5",
    "PUBG Mobile": "https://www.techradar.com/news/pubg-mobile-season-18",
    "previously suggested": "https://www.techradar.com/news/activision-blizzard-is-going-all-in-on-mobile-games",
    "distancing itself from the idea of more handheld consoles": "https://www.techradar.com/news/sony-hints-that-its-done-with-handheld-consoles-ruling-out-a-ps-vita-or-psp-return"
  }
}