{
  "source": "https://www.techradar.com/news/new-marvel-movie-leak-reveals-the-eternals-in-costume",
  "title": "New Marvel movie leak reveals the Eternals in-costume",
  "category": "entertainment",
  "updated": "2021-01-20T15:11:51Z",
  "author": "samuel-roberts",
  "summary": "Get a closer look at Marvel's new superhero team",
  "article": [
    "Even with last week's debut of WandaVision, the Marvel Cinematic Universe feels like it's a way off returning to the big screen. Nonetheless, an apparent new leak has revealed the costume designs for Marvel's next superhero team, The Eternals – and it comes via a piece of merchandise, photographed and posted on the Marvel Studios subreddit.",
    "Check it out below:",
    "Comic Book was the first to post about the image. While it's in something of a storybook-y style, the design of Angelina Jolie's character, Thena – the figure in white – tallies pretty closely with set photos of the actress taken in 2019. The image also looks pretty close to the first concept art revealed of The Eternals back at D23 in 2019.",
    "Marvel's Eternals cast is massive: as well as Jolie, Richard Madden stars as Ikaris, Kumail Nanjiani as Kingo, Lauren Ridloff as Makkari, Brian Tyree Henry as Phastos, Salma Hayek as Ajak, Gemma Chan as Sersi, Barry Keoghan as Druig and Kit Harington as Dane Whitman – also known in Marvel's comics as the Black Knight.",
    "The characters are relatively obscure in Marvel's history. A Jack Kirby creation like the Fantastic Four, they're ancient alien beings created by god-like entities known as the Celestials who have been hiding out on Earth for many years.",
    "It's hard to get a grip on why this particular group is at the center of a major new Marvel movie, or why they're exciting exactly, but the same was asked about the Guardians of the Galaxy at one point. Perhaps we'll see the MCU take a deeper step into cosmic fantasy.",
    "Eternals was supposed to be released by now, but we haven't even seen a trailer yet, likely due to the ever-shifting nature of the movie release date calendar. Its current release date is set for November 5, 2021, and director Chloé Zhao – of the acclaimed upcoming Oscar contender movie Nomadland – is behind Eternals.",
    "Here's our first look at the Eternals' costumes from all the way back in August 2019:",
    "Two more MCU movies are set for release in 2021 before Eternals, as it stands – Black Widow and Shang-Chi and the Legend of the Ten Rings. The former releases on May 7, while the latter will arrive on July 9. Of course, that's assuming no other changes occur to the movie release schedule, and that's hard to believe when you look at the number of Covid-19 cases across the United States and other parts of the world.",
    "Still, on the bright side, the Marvel TV on Disney Plus will never stop in 2021. As it stands, Marvel has WandaVision airing weekly right now, with The Falcon and the Winter Soldier to follow in March and Loki to come in May. Animated anthology show What If...? is also coming towards the middle of the year, while Ms Marvel and Hawkeye are also planned for 2021."
  ],
  "headers": {
    "8": "When is the next Marvel film released?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-release-date-trailer-disney-plus/news/when-is-wandavision-episode-3-released-on-disney-plus",
    "Comic Book": "https://comicbook.com/movies/news/marvel-eternals-movie-costumes-promo-art/",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more"
  }
}