{
  "source": "https://www.techradar.com/news/quantum-computing-startups-are-suddenly-raking-in-millions",
  "title": "Quantum computing startups are suddenly raking in millions",
  "category": "computing",
  "updated": "2021-10-11T15:35:10Z",
  "author": "sead-fadilpasic",
  "summary": "VCs are betting big on quantum",
  "article": [
    "Venture capitalists have invested almost $1.02 billion in quantum computing companies this year, financial research firm PitchBook has said.",
    "That's a 68% increase compared to last year’s $684 million, and up more than 500% compared to 2019, when businesses invested $188 million.",
    "Among the high-profile investments are the BlackRock-led investment in PsiQuantum ($450 million) and Supernova Partners Acquisition Company II’s merger with quantum hardware makers, Rigetti, valued at $1.5bn.",
    "These news may be making headlines, but they’re also highly speculative, as there’s a good chance these companies fail their missions. Right now, investments in quantum computing companies are a high-risk, high-reward game.",
    "This doesn’t prevent companies from keeping high hopes for quantum computers, be it through investments, or through building in-house solutions. In April, PitchBook forecasted that businesses would allocate roughly a fifth of their annual IT budgets to quantum computing in 2023, up 7% compared to this year.",
    "Most of the time, businesses are interested in advancing their Artificial Intelligence (AI) technologies, and cybersecurity solutions, through the use of quantum computers.",
    "As a technology, quantum computing promises devices that are infinitely faster than traditional computers. Unlike traditional computers, in which a computing bit (a binary digit, the smallest increment of data on a computer) can either be a 0 or a 1, quantum computing’s bit, called qubit, can be both, at the same time. It’s a blatant oversimplification, but essentially, quantum computers can work with multiple sets of data simultaneously, while classical computers can only work sequentially.",
    "Right now, all of this is still just a promise, with system stability being one of the biggest challenges in need of overcoming. \"Solving the error-rate problem will require substantially new approaches. If researchers can meet that challenge, quantum processors will provide an excellent complement to classical processors\" Linley Gwennap, president of Linley Group, explained in a research note earlier this year.",
    "Via: The Register"
  ],
  "headers": {
    "5": "Quantum computing for AI and cybersecurity"
  },
  "links": {
    "The Register": "https://www.theregister.com/2021/10/08/quantum_computing_startups/"
  }
}