{
  "source": "https://www.techradar.com/news/this-mobile-website-builder-could-give-you-everything-you-need-in-minutes",
  "title": "This mobile website builder could give you everything you need in minutes",
  "category": "computing",
  "updated": "2021-02-17T10:09:12Z",
  "author": "barclay-ballard",
  "summary": "Monetization is becoming more important for online stars",
  "article": [
    "There is a new website builder specifically targeting content creators on Instagram and TikTok, with e-commerce and monetization features built-in. Beacons promises to deliver “a website that can keep up with your content” and comes with a list of tools to help social media stars monetize their output.",
    "On the surface, a Beacons-built site resembles those simple “link in bio” webpages that often accompany Instagram accounts. However, Beacons also offers users the option of receiving donations, collecting followers’ emails, accepting paid requests, and enabling affiliate shopping. Collectively, it means that it offers a fair number of e-commerce services for social media influencers to tap into.",
    "As with most website builders, Beacons values simplicity above all else. When creating a website on the platform, users are asked a series of yes/no questions that are used to create a landing page. This is filled with configurable “blocks” that could contain features like email marketing solutions, social media integration, or the option of embedding video content.",
    "Where Beacons really wants to stand out, however, is through its list of monetization options. The platform has four revenue generation tools, including one that takes fan requests for personalized content, one that allows website owners to accept donations, and another offering digital downloads. The fourth solution is a TikTok shopping feature, which allows users to recommend products and add affiliate marketing links alongside their TikTok videos.",
    "Beacons may have entered the website building market at the right time. Social media platforms have long been able to attract a large audience but have only recently explored ways of monetizing their popularity. TikTok has just announced its plans to enter the e-commerce space and the likes of WhatsApp and Instagram have both recently looked at ways of enticing businesses to use their platforms.",
    "As a new solution, Beacons may be better placed to attract the young audiences using social networks to shop and make money. Although the platform offers its tools for free, it also boasts a premium plan accompanied by a custom domain name for $10 a month.",
    "Via TechCrunch"
  ],
  "headers": {
    "3": "Revenue generation"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "e-commerce services": "https://www.techradar.com/best/best-e-commerce-website-design-services",
    "email marketing": "https://www.techradar.com/best/best-email-marketing-software",
    "social media integration": "https://www.techradar.com/best/best-social-media-management-tools",
    "embedding video content": "https://www.techradar.com/best/video-hosting",
    "TikTok": "https://www.techradar.com/news/tiktok-launches-range-of-new-e-commerce-tools",
    "WhatsApp": "https://www.techradar.com/news/facebook-now-lets-you-do-all-your-shopping-via-whatsapp",
    "Instagram": "https://www.techradar.com/news/instagram-launches-professional-dashboard-to-help-run-business-accounts",
    "TechCrunch": "https://techcrunch.com/2021/02/10/beacons-debuts-a-link-in-bio-mobile-website-builder-that-helps-creators-make-money-not-just-list-links/?guccounter=1"
  }
}