{
  "source": "https://www.techradar.com/news/google-pixel-6-will-show-off-deep-technology-investments-according-to-ceo",
  "title": "Google Pixel 6 will show off 'deep technology investments', according to CEO",
  "category": "phones",
  "updated": "2021-07-29T09:12:10Z",
  "author": "james-peckham",
  "summary": "A big claim for the Google Pixel 6",
  "article": [
    "The Google Pixel 6 is expected in the coming months, and now Google's CEO has commented on the upcoming smartphone range for the first time.",
    "While Sundar Pichai didn't refer to the Google Pixel 6 or Google Pixel 6 XL by name, he did refer to the company's \"fall lineup\" of hardware, which is heavily expected to include its next flagship phone.",
    "Pichai said, \"I'm very excited by our fall lineup, which will showcase Android 12 and some of the deep technology investments that are helping us push boundaries.\"",
    "Pichai continued, \"Pixel remains at the heart of that long-term strategy and I’m proud of how the team continues to deliver the best of Google through our family of helpful devices, including Nest and Fitbit. You can see all of these devices at our first retail store in New York City and I'm looking forward to seeing some new ones there soon.\"",
    "That doesn't give us anything firm around the Google Pixel 6, but if Pichai is starting to tease the upcoming phones we can likely expect to hear more about the new handsets in the coming months.",
    "Google's \"deep technology investments\" that Pichai refers to aren't confirmed, but it's heavily suspected it will be referring to the chipset you can expect in the Google Pixel 6 series.",
    "Many leaks and rumors, including a detailed report from 9to5Google, suggest that Google is working on its first processor, so the upcoming phones won't feature Qualcomm chipsets like previous Pixel handsets have done.",
    "The new chipset is thought to be codenamed Whitechapel, and it has apparently been fully developed with the Pixel series in mind. Exactly what this chipset will be able to achieve that a third-party option can't is unclear.",
    "We'll have to wait until the Google Pixel 6 debuts to see how powerful this Whitechapel alternative to the Snapdragon 888 and other top-end chipsets really is. We expect to hear official news about the Google Pixel 6 toward the end of 2021.",
    "Via Phone Arena"
  ],
  "headers": {
    "5": "Analysis: what are the deep technology investments?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "9to5Google": "https://9to5google.com/2021/04/02/pixel-6-google-gs101-whitechapel/",
    "Phone Arena": "https://www.phonearena.com/news/google-pixel-6-android-12-technology_id133943"
  }
}