{
  "source": "https://www.techradar.com/news/final-fantasy-xiv-is-so-popular-now-that-it-completely-sold-out-of-digital-copies",
  "title": "Final Fantasy XIV is so popular now that it completely sold out of digital copies",
  "category": "computing",
  "updated": "2021-07-12T19:24:14Z",
  "author": "bill-thomas",
  "summary": "Everyone is flocking from World of Warcraft to Eorzea",
  "article": [
    "Final Fantasy XIV has been a huge success, but that success may be growing a little too fast, as the game has completely sold out – and we're not just talking about the physical version.",
    "This was first spotted by gaming Youtuber Skill Up on Twitter, where he posted a screenshot that says the Final Fantasy XIV Complete Edition (which includes all the expansions up to Shadowbringers) is sold out on PC. But beyond that, every single one of the worlds was marked as congested, which means you can't create new characters on that server.",
    "It's definitely an odd time for Final Fantasy XIV to blow up like this. Right now, the game has had its last update for Shadowbringers, with no new content coming until Endwalker launches in November 2021. This is typically the time that an MMO's playerbase starts to wane, not explode in growth.",
    "As of the time of writing, the game is still sold out, but it seems that the servers have cleared up a bit, with just a few Worlds per Data Center blocking players from creating new characters.",
    "It's an exciting time for the game, as there will probably be another explosive growth for the game when Endwalker launches on November 23. And if you want to try the game for yourself, there's a free trial up to level 60, which includes the hit expansion Heavensward.",
    "It's kind of weird that an MMORPG like Final Fantasy XIV is blowing up in popularity in the waning period of an expansion, but looking to the game's biggest competitor, World of Warcraft, gives a pretty good idea why this is happening.",
    "World of Warcraft's 9.1 patch finally launched in late June after more than 6 months without any new content for the fledgling Shadowlands expansion. As Windows Central notes, it hasn't been popular.",
    "But it's not just the players that are frustrated with the game. Huge influencers in the community, like Asmongold and Bellular have been talking about and playing Final Fantasy XIV, and even Preach Gaming has been showing off Final Fantasy XIV raid content on his channel.",
    "These are all WoW creators with a massive following, and it seems like there's been a massive exodus from World of Warcraft over to Final Fantasy XIV. There's no hard numbers on the amount of players that have made the move, so we can't say for sure, but it seems to be a lot.",
    "We've even noticed this ourselves when just playing the game like we usually do. Leveling alternative jobs, we've seen way more \"Sprouts\" than usual – new players have a little sprout icon next to their name. Again, this is far from actual evidence, and is only based on our personal experience, so take it with a grain of salt.",
    "Still, World of Warcraft must be feeling the pressure, as even its new content updates are being outshadowed by another MMO. Maybe the WoW killer has finally arrived.",
    "Via Windows Central"
  ],
  "headers": {
    "5": "Why now?"
  },
  "links": {
    "Final Fantasy XIV": "https://www.techradar.com/news/final-fantasy-14",
    "World of Warcraft": "https://www.techradar.com/reviews/world-of-warcraft",
    "Windows Central": "https://www.windowscentral.com/final-fantasy-xiv-about-eat-world-warcrafts-lunch",
    "Asmongold": "https://www.twitch.tv/Asmongold",
    "Bellular": "https://www.youtube.com/c/BellularClips/featured",
    "Preach Gaming": "https://www.youtube.com/watch?v=sMVubPZUG_g&ab_channel=PreachGaming",
    "Via Windows Central": "https://www.windowscentral.com/final-fantasy-xiv-sold-out-popularity-surges-cause-server-congestion?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+wmexperts+%28Windows+Central%29"
  }
}