{
  "source": "https://www.techradar.com/news/google-connects-subsea-cable-between-us-and-europe",
  "title": "Google connects subsea cable between US and Europe",
  "category": "computing",
  "updated": "2021-02-04T11:52:34Z",
  "author": "anthony-spadafora",
  "summary": "Dunant cable will deliver record-breaking capacity",
  "article": [
    "Google has confirmed that its Dunant subsea cable connecting Europe and the US is now operational.",
    "Joining Virginia Beach in the US to the French Atlantic coast, the cable is named after Henry Dunant, the founder of the Red Cross and the first recipient of the Nobel Peace Prize.",
    "Google’s cable, which was developed in partnership with telecommunications equipment company SubCom, will greatly improve interconnection with other network infrastructure in the region, delivering record-breaking capacity. The cable should also help facilitate the rapidly growing demand for cloud computing services.",
    "Google’s new offering is unique among subsea cables in that it does not rely on pump lasers to amplify each fiber pair as data travels along it. Instead, SDM technology allows pump lasers and other optical components to be shared among multiple fiber pairs.",
    "The technology giant believes that the new cable will substantially improve its cloud capabilities, allowing more customers to build innovative applications that work in a multitude of environments while benefitting from transformative collaboration opportunities.",
    "“Dunant is the first long-haul subsea cable to feature a 12 fiber pair space-division multiplexing (SDM) design, and will deliver record-breaking capacity of 250 terabits per second (Tbps) across the ocean – enough to transmit the entire digitized Library of Congress three times every second,” Chris Ciauri, president for the EMEA region at Google Cloud, explained.",
    "“Increased cable capacity is delivered in a cost-effective manner with additional fiber pairs (twelve, rather than six or eight in past generations of subsea cables) and power-optimized repeater designs.”",
    "The Dunant cable is just one part of Google’s growing cloud infrastructure. The company is also working on the Grace Hopper subsea cable, connecting the US, the UK, and Spain, and is present at over 90 internet exchanges and at more than 100 interconnection facilities around the world."
  ],
  "headers": {
    "3": "Global connectivity"
  },
  "links": {
    "explained": "https://cloud.google.com/blog/products/infrastructure/googles-dunant-subsea-cable-is-now-ready-for-service",
    "Grace Hopper subsea cable": "https://cloud.google.com/blog/products/infrastructure/announcing-googles-grace-hopper-subsea-cable-system"
  }
}