{
  "source": "https://www.techradar.com/news/china-set-to-embrace-open-source-in-new-software-push",
  "title": "China set to embrace open source in new software push",
  "category": "computing",
  "updated": "2021-12-02T15:50:33Z",
  "author": "mayank-sharma",
  "summary": "New five-year plan plan places importance on homegrown open source software",
  "article": [
    "Hailing software as the “foundation of digital economic development,” China’s Ministry of Industry and Information Technology (MIIT) has reportedly called for pushing the growth of homegrown open source software.",
    "The Register gleaned these details from a machine-translated version of MIIT’s 14th Five-Year Plan for the Development of Software and Information Technology Services.",
    "The plan argues that despite the strides made by China's software industry thanks to the 13th five-year plan, China's software industry is still underperforming internationally.",
    "In order to help improve the “international competitiveness” of the country as far as software is concerned, MIIT suggests facilitating deeper international exchange programs and open cooperation schemes, which it argues will help the country match up to its global peers.",
    "As part of the strategy, the plan seeks not just to improve the state of homegrown software, but also build \"two or three open source communities with international influence.\"",
    "According to The Register, MIIT cites a lack of open source foundations, insufficient control of the underlying technology, a weak open source culture, and inadequate policy support as impediments that have constrained China's leadership in the open source ecosystem.",
    "MIIT offloads some of the blame for its lack of software leadership to a weak software supply chain which doesn’t look at software and intellectual property with the respect it commends globally.",
    "One project that does find mention in the document is Huawei’s Euler OS, which the company has recently donated to the Open Atom Open Source Foundation, which The Register says works on open source hardware, silicon, and content.",
    "Interested in learning Linux? Take the best Linux distros for a spin on one of these best Linux laptops"
  ],
  "headers": {
    "3": "Open Source FTW"
  },
  "links": {
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "The Register": "https://www.theregister.com/2021/12/01/china_five_year_software_plan/",
    "Huawei": "https://www.techradar.com/news/best-huawei-phones",
    "best Linux distros": "https://www.techradar.com/best/best-linux-distros",
    "best Linux laptops": "https://www.techradar.com/best/linux-laptops"
  }
}