{
  "source": "https://www.techradar.com/news/where-to-buy-sonos-speakers-the-best-places-to-find-your-next-home-audio-system",
  "title": "Where to buy Sonos speakers: the best places to find your next home audio system",
  "category": "audio-visual",
  "updated": "2021-12-10T18:36:48Z",
  "author": "olivia-tambini",
  "summary": "Find a new Sonos speaker hassle-free",
  "article": [
    "If you're looking to buy a Sonos speaker, you may be wondering where to start your search.",
    "Sonos makes some of the best wireless speakers, soundbars, Bluetooth speakers and other audio devices right now – especially for those that value excellent connectivity, space-saving design and great sound.",
    "However, recent price increases and dwindling stock following the global chip shortage mean that retailers you could usually depend on won't always have Sonos devices available to buy.",
    "That became very apparent during the Black Friday and Cyber Monday sales, where Sonos deals were few and far between. We'd normally expect to see discounts of at least $100 / £100 on the brand's flagship products, but any deals this year only brought these devices down to their previous prices – before Sonos hiked up the cost of most of its range.",
    "Prices also varied drastically between retailers, with some offering Sonos devices at much higher costs than usual – the few good deals we saw came from either Sonos itself or from smaller third-party stores like Crutchfield and Sevenoaks.",
    "All of that means it can be tricky to know the best place to buy a Sonos speaker or if you're being ripped off.",
    "That's where we come in: we've put together this useful guide to all the best places you can buy a Sonos speaker right now, along with buying advice and the latest Sonos deals available in your area.",
    "But first, here's a round-up of the best Sonos deals in your region:",
    "In a hurry? You'll find all the retailers we'd usually expect to sell Sonos speakers and peripherals below so you can shop for yourself.",
    "Want to save some money? Sonos speakers can be very expensive, so it's well worth keeping an eye out for any deals across the entire range.",
    "Right now, we'd specifically recommend looking out for deals on the first-gen Sonos Beam, as it has recently been usurped by a newer model. The Sonos One is also likely to be discounted, as it was released way back in 2017 (and could be due an upgrade in the near future).",
    "Unfortunately, Sonos deals have been thin on the ground for the past few months, most likely due to the global chip shortage resulting in low stock.",
    "Whatever Sonos speaker you go for, don't be fooled by the company's recent price increases, which span most of its products. A $100 / £100 discount on the Sonos Arc may seem like a bargain, but this would only bring the soundbar down to its original RRP. You can find the full list of Sonos price increases below for more information:",
    "Sonos produces many different speakers and sound systems, so picking the best one can be tough.",
    "If you're after the best speaker around, check out the Sonos One. Not only is it at the top of our best wireless speakers guide, but it's also the best smart speaker around. The soundstage it produces is splendid, and with Google and Amazon Alexa assistant support you'll be able to listen to your favorite tracks just by asking the Sonos One to play them.",
    "For those with a bigger budget to play with, the Sonos Play: 5 is a powerful speaker that will fill your home with great-sounding tunes from your favorite streaming services. During the sales period, you're sure to find a slight discount on this speaker, which could make it an exceptionally tempting offer.",
    "However, if you value portability you'll want to find the best Sonos Move and Sonos Roam deals. Not only are these Bluetooth speakers great for setting up on-the-go party tunes, but the excellent sound quality and full support of the Sonos app make them brilliant speakers to have in your home too.",
    "Looking for a soundbar? The Sonos Arc is a fantastic soundbar that's sure to make your home cinema experience even more spectacular. It's the best soundbar for good reason, providing excellent audio quality thanks to Dolby’s latest TrueHD and Dolby Digital Plus sound codecs. Setting up the Arc is super simple too. It can be pricey when it isn't on sale, though.",
    "If you're after something a little cheaper and smaller, the Sonos Beam (Gen 2) is a great choice, coming with virtual Dolby Atmos and HDMI eARC compatibility. Its compact size makes it ideal for smaller spaces, and you can easily hook it up to a Sonos Sub or a pair of Sonos One SL rear speakers to boost the sound. It's worth keeping an eye out for deals on the original Sonos Beam, too. Although it's been discontinued, you may find some retailers trying to shift leftover stock or refurbished models."
  ],
  "headers": {
    "8": "Where to buy Sonos speakers in the US",
    "9": "Sonos prices: what you need to know"
  },
  "links": {
    "Sonos speaker": "https://www.techradar.com/best/best-sonos-speakers",
    "best wireless speakers": "https://www.techradar.com/news/best-speaker",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "recent price increases": "https://www.techradar.com/news/sonos-speakers-are-getting-more-expensive-for-no-real-reason",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "best smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Sonos Play: 5": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/sonos-play5-657133/review",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "Sonos Roam": "https://www.techradar.com/reviews/sonos-roam",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "best soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Sonos Beam (Gen 2)": "https://www.techradar.com/news/sonos-beam-gen-2-vs-sonos-beam-whats-new-with-the-pint-sized-soundbar",
    "Sonos Sub": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-sub-1082735/review",
    "Sonos One SL": "https://www.techradar.com/reviews/sonos-one-sl-review",
    "original Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review"
  }
}