{
  "source": "https://www.techradar.com/news/these-new-xbox-series-x-monitors-will-get-the-most-out-of-your-console",
  "title": "These new Xbox Series X monitors will get the most out of your console",
  "category": "gaming",
  "updated": "2021-06-22T16:30:32.896Z",
  "author": "rhys-wood",
  "summary": "Philips, Asus and Acer unveil their Designed for Xbox monitors",
  "article": [
    "Philips, Acer and Asus are among the first manufacturers to develop monitors tailor-made for the Xbox Series X console. The ‘Designed for Xbox’ program is ushering forward a new fleet of 4K gaming monitors designed to make the most of the Xbox Series X’s powerful capabilities, among which are 4K resolution, 120Hz gameplay, HDR and variable refresh rates.",
    "Xbox’s official news hub has confirmed that the Philips Momentum, a 55-inch 4K HDR monitor boasting a 120Hz output, will be the first Designed for Xbox model to launch. The monitor is equipped with a soundbar and will feature AMD’s FreeSync technology which helps to reduce screen tearing. The Philips Momentum releases worldwide in August 2021 and will cost $1,599 / £1,199 (around AU$2,129).",
    "The Philips Momentum will be followed by the Asus Strix Xbox Edition 43-inch Gaming Monitor releasing in October 2021 (price to be announced), as well as the Acer Xbox Edition 28-inch Gaming Monitor scheduled to launch sometime towards the end of the year for $949 (around £689 / AU$1,269). Both have similar features to the Philips Momentum including 4K 120Hz output and AMD FreeSync support.",
    "Microsoft’s Designed for Xbox is a program that partners with other manufacturers in an effort to develop hardware and accessories with specifications that best match the capabilities of the latest Xbox consoles. This is evidenced by these Designed for Xbox monitors which feature HDMI 2.1 ports, and should work seamlessly with the AMD tech powering both the Xbox Series X and Xbox Series S.",
    "It’s important to note that the Philips Momentum and other Designed for Xbox monitors support HDMI 2.1 connectivity, the new input standard which is able to better facilitate high-end features like 120Hz refresh rates at high resolutions",
    "It remains to be seen just how effective Designed for Xbox monitors like the Philips Momentum will be. They’re a bit on the expensive side, so we imagine they’ll only be on the radar of console gaming enthusiasts looking to squeeze the most out of their Xbox Series X gameplay experience."
  ],
  "headers": {
    "3": "Designed for Xbox?"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "4K gaming monitors": "https://www.techradar.com/news/best-4k-monitors",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Xbox’s official news hub": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1018732940995397400&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F06%2F22%2Fintroducing-new-designed-for-xbox-monitors%2F",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know"
  }
}