{
  "source": "https://www.techradar.com/news/why-the-dji-fpv-feels-like-the-drone-that-gopro-should-have-built",
  "title": "Why the DJI FPV feels like the drone that GoPro should have built",
  "category": "cameras",
  "updated": "2021-08-25T11:55:33Z",
  "author": "mark-wilson",
  "summary": "It isn't just a flying action cam – the DJI FPV is an action sport itself",
  "article": [
    "The DJI FPV drone darted into our lives this week like a slightly friendlier Sentinel from The Matrix. But one of the most intriguing things about it, other than those otherworldly looks, is how much its launch felt like a GoPro event.",
    "With vertiginous videos of wingsuit fliers, drifting cars and motocross riders, it was all a little more extreme than your average DJI drone event. In fact, it was barely distinguishable from GoPro's crowd-sourced highlights reels.",
    "There are a few good reasons for this. Firstly, the DJI FPV is a bold new step from the drone king onto GoPro's home turf of capturing hi-octane events at close quarters. But it's also an attempt to turn drones into a kind of extreme sports simulator, and hints at a shared history with GoPro that could have turned out very differently.",
    "Before we fly back to the early days of drones, what exactly is the DJI FPV? A speedy 'first-person view' drone that comes with a pair of video goggles that give you a live video feed from the sky, the DJI FPV is inspired by racing drones – but isn't designed to compete directly with them.",
    "Instead, this $1,299 / £1,249 / AU$2,099 flying machine wants to bring the FPV experience – which, like VR headsets, comes with all sorts of practical downsides – to complete beginners. And also help them capture aerial 4K footage that's of a similar quality to the likes of the DJI Mini 2.",
    "In this sense, the DJI FPV feels like the drone that the ill-fated GoPro Karma, which launched back in 2016, could have been. FPV drones have been around since way before then, and GoPro has always marketed action cams like the GoPro Hero 9 Black as the perfect accessory for extreme sports – even if most us are more likely to fly economy that pull on a wingsuit.",
    "Strangely, if discussions between the action cam giant and a fledgling DJI had gone differently a few years ago, the DJI FPV could well have arrived sporting a GoPro logo, too...",
    "Back in the early 2010s, GoPro was flying in a very different way – its action cam sales were going through the roof and it had very little competition. DJI, on the other hand, was an unknown drone manufacturer with a promising UAV (Unmanned Aerial Vehicle) called the DJI Phantom.",
    "That first-gen drone didn't have its own camera, but it was compatible with GoPros, so it made sense for DJI and GoPro to discuss collaborating on a drone. As DJI founder and current CEO Frank Wang revealed in a 2015 interview with Forbes, the two companies \"wanted to make a product together for GoPro to sell, but the negotiation never came to fruition\".",
    "The problem, according to DJI's Wang, was that GoPro \"treated us like the original equipment manufacturers\". So, with DJI \"not willing to be someone else's accessory\", the two companies went their separate ways – before colliding head-on when GoPro launched the ill-fated GoPro Karma in late 2016.",
    "Leaving aside the delicious irony of that product name, at least from DJI's perspective, GoPro's decision to make a drone certainly made sense (and arguably, still does). After all, these flying cameras were increasingly being used at the same action sports events as ground-based cams like its then-flagship GoPro Hero 4.",
    "Sadly, the Karma was a disaster. Soon after its launch, GoPro was forced to issue a recall after battery issues caused power failures during the flight of some models. Inevitably, this meant that GoPro's attempt to give its cameras an aerial platform ending up bombing harder than Wile E. Coyote.",
    "Of course, we don't yet know what problems could yet befall the DJI FPV. Many early reviewers on YouTube have crashed the drone (albeit largely thanks to pilot error) and does come with practical complications that mean it's very unlikely to match the popularity of all-rounder drones like the DJI Mavic Air 2.",
    "For example, you're legally required to have an observer or 'spotter' with you when flying FPV drones – this is because the video goggles mean you can't maintain a line of sight with the drone, which somewhat dampens the new model's pick-up-and-play appeal.",
    "Still, there's no doubt that the concept of an affordable, 87mph drone that shoots 4K/60p video and gives you the sensation of being a fearless paraglider has got GoPro written all over it – and feels like the natural evolution of the company's somewhat plateauing action cams.",
    "FPV drones have been around since way before the GoPro Karma launched, but they've largely been a hobbyist niche for tinkerers and solderers – until now.",
    "The DJI FPV is unique because, in theory, it combines the speed and agility of a racing drone with the filmmaking powers and user-friendliness of models like DJI Mini 2 and DJI Mavic Air 2. It's also attempting to bring extreme aerial sports to a new audience – which is again why it feels like a GoPro-style play.",
    "The early Hero action cams sprang from hobbyist beginnings to create a brand-new camera niche for themselves. But as GoPro found when it made the Karma, drones are on another level of complexity – and the DJI FPV is far from a guaranteed home run.",
    "Aside from that prospect of high-speed crashes (DJI sells lots of replacement parts), the DJI FPV also faces the potential danger of truly satisfying no one.",
    "Yes, it has a top speed of 87mph and can accelerate from 0-62mph in just two seconds, but it can't hit the 120mph top speeds of the homemade flying machines seen in pro racing leagues; and at 795g, it's way too heavy for hardcore drone racers.",
    "And yet the DJI FPV also can't match some of the company's Mavic models when it comes to capturing high-quality aerial footage. Its relatively small 1/2.3-inch CMOS sensor is more in the realm of smaller fliers like the DJI Mini 2, rather than the DJI Mavic 2 Pro, and you also don't get any of the intelligent flight modes, like QuickShots or subject tracking, that have made DJI's drones such user-friendly aerial filmmaking companions.",
    "What you do get, however, is the RockSteady image stabilization from the DJI Osmo Action to help keep your videos smooth. Would GoPro's HyperSmooth stabilization be ideal for an FPV drone? Most definitely – in fact, many of today's affordable FPV drones, like the Shendrones Squirt, are designed to be fronted by GoPros for that very reason.",
    "What this all means is that, rather than truly satisfying drone racers or aerial filmmakers, the DJI FPV is instead a bold attempt to spark mainstream demand for a new hobby – one that involves simply flying a drone for the fun of it.",
    "Whether or not DJI will be able to give 'ready-to-fly' FPV drones their GoPro Hero moment is up for debate, but one thing's for sure: it's now too late for GoPro to play catchup.",
    "GoPro's history may be closely linked with those of both DJI and FPV drones – it's frequently been the choice of camera for FPV hobbyists' kits – but once it decided to go it alone with the development of the Karma, there was never any real chance of a future drone like a GoPro FPV.",
    "In a pretty frank interview with Mashable back in 2018, GoPro CEO Nick Woodman admitted that the action cam giant simply underestimated how much time and money is needed to produce drones – and that it was better off putting that energy into the GoPro Hero series.",
    "To be fair, that decision certainly bore fruit, as from the GoPro Hero 7 Black onwards the action cams rediscovered their mojo and, propelled by excellent features like GoPro's HyperSmooth stabilization, got a second lease of life that's ultimately led to the impressive GoPro Hero 9 Black. In the process, GoPro even saw off the threat from the DJI Osmo Action.",
    "But despite all this, it's hard not to imagine an alternate timeline where GoPro collaborated with DJI in those early days, or managed to develop its own FPV system, which could have given us a serious alternative to the DJI FPV – or at least given first-person view drones more mainstream appeal.",
    "Instead, the DJI FPV will be taking to the skies without any real competition – and while the so-far lukewarm reception to VR headsets suggests it might face a challenge to become anything more than a niche and somewhat pricey toy, we're certainly looking forward to strapping on those goggles, and escaping the pandemic by flying like an eagle."
  ],
  "headers": {
    "7": "Bad Karma",
    "15": "Fly hard",
    "24": "Land vs air"
  },
  "links": {
    "DJI FPV drone": "https://www.techradar.com/reviews/dji-fpv-drone",
    "GoPro's crowd-sourced highlights reels": "https://www.techradar.com/news/this-annual-gopro-hero-9-black-highlights-reel-is-ludicrously-exciting-for-2020",
    "DJI Mini 2": "https://www.techradar.com/reviews/dji-mini-2",
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black",
    "Forbes": "https://www.forbes.com/sites/forbesasia/2015/05/07/drone-overlord-frank-wang-on-djis-milestones-miscarried-gopro-partnership-corporate-espionage/?sh=796ac128525a",
    "GoPro Karma": "https://www.techradar.com/reviews/gadgets/gopro-karma-drone-1328954/review",
    "GoPro Hero 4": "https://www.techradar.com/reviews/cameras-and-camcorders/camcorders/gopro-hero4-black-1272356/review",
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review",
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "Shendrones Squirt": "http://www.shendrones.com/squirt-v2",
    "Mashable": "https://www.youtube.com/watch?v=pzsxxlorkck",
    "GoPro Hero 7 Black": "https://www.techradar.com/reviews/gopro-hero7-black-review"
  }
}