{
  "source": "https://www.techradar.com/news/star-wars-could-recast-gina-caranos-cara-dune-according-to-new-report",
  "title": "Cara Dune is not expected to be recast in future Star Wars projects, says report (Updated)",
  "category": "entertainment",
  "updated": "2021-02-17T11:19:11Z",
  "author": "samuel-roberts",
  "summary": "A Lucasfilm source apparently says that Cara Dune is not expected to be recast",
  "article": [
    "Update: THR later updated its article with a Lucasfilm source saying that Cara Dune will not be recast, though retained its original passage about 'insiders' expecting a recast.",
    "Original story: Last week, it was confirmed The Mandalorian star Gina Carano was removed from the Star Wars franchise by Lucasfilm, following an offensive message being reposted onto the actress's Instagram account. Now, though, Lucasfilm is reportedly expected to recast the Cara Dune character in future, rather than writing her out of the Star Wars universe completely.",
    "That's according to The Hollywood Reporter, which cites insiders who \"expect\" the character will be recast \"down the road\" for the purposes of story and merchandise. This week, Hasbro confirmed it had cancelled plans to re-release a Cara Dune toy in its Black Series of nice-looking Star Wars figures, sending bids for existing figures skyrocketing on eBay.",
    "The report again underlines something that we'd previously learned about Carano – that she was being set up to lead a Star Wars spin-off TV show on Disney Plus before Lucasfilm severed ties with her. This was largely expected to be the Rangers of the New Republic show.",
    "Could we see a different actress reprise the role when that series gets made?",
    "The report also notes that Cara Dune wasn't planned to appear in the next live-action show coming to Disney Plus in the Star Wars universe – December's The Book of Boba Fett.",
    "Star Wars has recast characters before, but usually for the purposes of depicting them when they were younger – as we saw with Solo, for example, though Lucasfilm has also experimented with having original trilogy actors de-aged with CGI.",
    "This is a very different case, obviously. But we don't think it'd be a big deal if Cara Dune was recast – in a show packed with pretty amazing actors, Carano was not the highlight. She was perfectly fine, but after a couple of episodes with a new actor, we imagine the world would move on pretty quickly."
  ],
  "headers": {
    "6": "Time to move on?"
  },
  "links": {
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/heat-vision/behind-disneys-firing-of-mandalorian-star-gina-carano",
    "for existing figures skyrocketing on eBay": "https://www.ebay.co.uk/itm/Cara-Dune-Star-Wars-6-Inch-Black-Series-Opened/133664587489?hash=item1f1f07bee1%3Ag%3A2OAAAOSw-MpgKPAV&mkevt=1&mkcid=1&mkrid=710-53481-19255-0&campid=5337827784&customid=trd-us-7358908471839517000",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know"
  }
}