{
  "source": "https://www.techradar.com/news/microsoft-finally-confirms-the-next-windows-10-update-wont-be-anything-exciting",
  "title": "Microsoft finally confirms the next Windows 10 update won’t be anything exciting",
  "category": "computing",
  "updated": "2021-02-18T09:52:28Z",
  "author": "darren-allan",
  "summary": "Another minor upgrade, and the second one in a row for Windows 10",
  "article": [
    "Windows 10’s feature update for the first half of 2021 (known as 21H1) has finally been announced by Microsoft, with the software giant confirming that it will be a minor update, as has long been rumored.",
    "An official blog post by John Cable, VP of Windows Servicing and Delivery at Microsoft, noted that this was the first time an H1 update – one that arrives in the first half of the year – will be “delivered in an optimized way using servicing technology”.",
    "That’s fancy talk for the 21H1 update being an enablement package, or a minor update which is a tiny download and simply flicks a switch to turn on the small amount of changes and tweaks involved (content which has already been preloaded for recent Windows 10 versions). You’ll likely recall that this was the case with the most recent October 2020 Update (20H2).",
    "As Cable observes, it’s always been those H2 updates which have been minor ones, so it’s unusual for an H1 upgrade to do this (and for that matter, it’s the first time we’ve ever seen two minor feature updates in a row like this).",
    "Cable clarifies: “Version 21H1 will be delivered with servicing technology (like that used for the monthly update process and how 20H2 was delivered). Windows 10, version 21H1 will have a scoped set of features improving security, remote access and quality.”",
    "Again, that reference to a “scoped set of features” is how we’ve seen Microsoft previously refer to these minor updates (they’re not ‘small’, they’re ‘scoped’).",
    "Those running either of last year’s updates – the May 2020 Update or October 2020 Update – will be able to upgrade using the fast and convenient enablement package, but users on previous versions of Windows 10 will have to go through the full download process (as they won’t have the files for 21H1 preloaded).",
    "Cable also outlines some of the changes delivered by the 21H1 update, which include beefing up Windows Hello with multi-camera support and various security tweaks, as well as work on Windows Defender Application Guard. So yes – this underlines that there’s stuff going on, but nothing hugely riveting.",
    "The 21H1 update is now rolling out to testers in the ‘beta’ channel, but no target release date was mentioned in the blog post, unsurprisingly; only that the upgrade will be rolling out in the first half of the year, which of course we already knew.",
    "Recent rumors have pointed to the arrival of the update later in H1, and indeed speculation was even pointing to a June debut, although we’ve more recently heard that May is Microsoft’s likely intended release timeframe."
  ],
  "headers": {
    "7": "Hello changes"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "rumored": "https://www.techradar.com/news/windows-10s-next-update-could-pop-up-earlier-in-2021-but-you-might-be-disappointed",
    "blog post": "https://blogs.windows.com/windowsexperience/2021/02/17/introducing-the-next-feature-update-to-windows-10-version-21h1/",
    "20H2": "https://www.techradar.com/news/windows-10-20h2-update",
    "May 2020 Update": "https://www.techradar.com/how-to/windows-10-may-2020-update-problems-how-to-fix-them",
    "speculation was even pointing to a June debut": "https://www.techradar.com/news/windows-10s-next-major-update-could-arrive-much-later-than-hoped",
    "May is Microsoft’s likely intended release timeframe": "https://www.techradar.com/news/windows-10s-next-feature-update-wont-be-arriving-late-rumor-has-it"
  }
}