{
  "source": "https://www.techradar.com/news/the-best-free-iphone-games",
  "title": "The best free iPhone games of 2021",
  "category": "phones",
  "updated": "2021-11-18T14:41:27Z",
  "author": "craig-grannell",
  "summary": "Top quality free fun for your iPhone",
  "article": [
    "Free iPhone games have a reputation for being rubbish and full of IAP. But whether you've got an iPhone 13 Pro Max, an iPhone SE (2020), or any other model, loads of superb free titles await your twitchy gaming thumbs – if you know where to look.",
    "To save you the effort of finding them, we’ve compiled the best here, split into handy categories. So if you fancy an arcade blast, a brain-bending puzzle, or a thrilling racer – for free – read on.",
    "Plus, check back every month for our latest favorite free iPhone game, which you'll find below.",
    "Cards of Terra exists halfway between solitaire and a collectable card game with deeper mechanics. It features an alien princess stranded on a hostile world. Fortunately, she pits the locals against each other by way of magic, and games involve you dragging cards atop each other to deplete their scores and remove them from the board.",
    "The basics are compelling as you try to figure out how to make best use of limited moves. But as new cards are unlocked, the game gradually reveals its complexity, with cards that amble about of their own accord, call allies, or start shooting up the place.",
    "What would be easy to dismiss as yet another solitaire game, then, is instead a brilliantly conceived and hugely replayable card-based adventure. It’s packed full of levels, charm and smarts, making it one of the best free games on iPhone."
  ],
  "headers": {
    "3": "Cards of Terra"
  },
  "links": {
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "Cards of Terra": "https://apps.apple.com/app/id1520013966"
  }
}