{
  "source": "https://www.techradar.com/news/disneys-ryan-reynolds-video-game-movie-looks-like-gta-5-meets-fortnite",
  "title": "Disney's Ryan Reynolds video game movie looks like GTA 5 meets Fortnite",
  "category": "entertainment",
  "updated": "2021-06-10T10:10:28Z",
  "author": "tom-power",
  "summary": "Free Guy arrives in theaters this August",
  "article": [
    "Summer blockbuster movie season is right around the corner and, as theaters safely reopen their doors to the public amid the Covid pandemic, there's plenty to look forward to.",
    "Free Guy, the Ryan Reynolds-starring video game flick from Disney and 20th Century Studios, is one of those upcoming films – and, judging by its latest trailer, it could be one of the summer's biggest hits.",
    "The new trailer dropped online on Thursday, June 10 and, helped by the fact that Reynolds is in it, Free Guy looks as funny as it does action-packed.",
    "Free Guy also stars Jodie Comer (Killing Eve), Joe Keery (Stranger Things) and Taika Waititi (Thor: Ragnarok) among others, so there's an extremely solid cast to back Reynolds up. Real Steel and Night at the Museum director Shawn Levy – one of the figures behind Stranger Things – is behind the camera on this one, too.",
    "Check out the new trailer below:",
    "We hope so. As we mentioned, Free Guy is full of actors who are household names and, in Reynolds, it has an A-list star who should attract plenty of punters when it's released this summer.",
    "Doing so won't be easy, however. Free Guy is launching around some of the biggest (and most anticipated) movies of the year, so it'll have a fight on to earn itself a portion of the box office pie.",
    "Fast 9, Black Widow, Space Jam: A New Legacy, Jungle Cruise and The Suicide Squad are all being released before Free Guy.",
    "Sure, that quintet launch anywhere from a month to one week before Free Guy arrives in theaters, but there are always film fans who wait a few weeks (until the crowds have died down) to catch the latest blockbuster.",
    "It's possible that some viewers may go and see Black Widow or Space Jam 2 instead of Free Guy, which would eat into its potential profits.",
    "The biggest advantage that Free Guy has, however, is that it's an original movie. Those other films are sequels, new instalments in a movie series, reboots or (in Jungle Cruise's case) based on a Disney theme park ride.",
    "Free Guy, then, stands out from the summer blockbuster crowd through its originality. You don't need to have seen any of the Fast and the Furious movies, or MCU superhero flicks, in order to follow Free Guy's plot.",
    "There's still plenty of hype ahead of its release, too. Free Guy was originally supposed to launch in July 2020, but the Covid-19 pandemic put paid to it.",
    "Even though it's coming out a year after its initial release, people are still eager to watch Free Guy. Judging by comments left on the new trailer on YouTube (and the replies to the above tweet), fans are excited to see Reynolds star in a movie that looks like Grand Theft Auto 5 meets Fortnite. Here's hoping that it's as good as it sounds.",
    "Free Guy will arrive in theaters worldwide on Friday, August 13."
  ],
  "headers": {
    "5": "Analysis: will Free Guy succeed at the box office?"
  },
  "links": {
    "Stranger Things": "https://www.techradar.com/news/stranger-things-season-4",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Space Jam: A New Legacy": "https://www.techradar.com/news/space-jam-a-new-legacy-release-date-cast-plot-cameos-and-more",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-release-date-plot-cast-trailer-and-more",
    "YouTube": "https://www.youtube.com/watch?v=cttnRmcr_ME&t=1s"
  }
}