{
  "source": "https://www.techradar.com/news/who-is-the-power-broker-in-falcon-and-the-winter-soldier",
  "title": "Who is the Power Broker in Falcon and the Winter Soldier?",
  "category": "entertainment",
  "updated": "2021-04-07T17:07:50Z",
  "author": "hamish-hector",
  "summary": "Who is this secretive villain?",
  "article": [
    "The Falcon and the Winter Soldier is already halfway through its six-episode run, and while the show isn't as heavy on mysteries as WandaVision was, there is one question that's troubling viewers: who is the Power Broker, the mysterious figure behind the new Super Soldier threat?",
    "In this piece, we'll examine the evidence so far on who the Power Broker could be, and give you a few of our own theories on their identity in the MCU. We’ll be talking about everything that’s happened in The Falcon and the Winter Soldier so far, so if you haven’t yet watched the most recent episode on Disney Plus, we suggest you do that first.",
    "With that spoiler warning out of the way, let’s get into it. First, we'll explain the background of the Power Broker in the comics, then run you through our theories on this unseen villain.",
    "Power Broker is both the name of a supervillain and an organization known as Power Broker Inc in the comics. Initially headed up by Curtiss Jackson, Power Broker developed a device which could give people superpowers. In return, the newly augmented individual promises to give 70% of their future earnings to Power Broker.",
    "To tie the group into The Falcon and the Winter Soldier, the Marvel Comics version of John Walker (known as U.S. Agent) and his sidekick Lemar Hoskins (Battlestar) both received their powers thanks to Power Broker’s device.",
    "Perhaps we’ll see this repeated in the MCU, if they take the Super Soldier Serum that Power Broker has made - maybe in a pinch to give them the edge over Sam and Bucky. That's just speculation on our part, though.",
    "More recently, a new Power Broker has entered the comics, though he’s more of a small-time villain. He was last seen being investigated by Cassie Lang - Scott Lang’s daughter - because of his work on an app designed for super villains called Hench.",
    "Sharon Carter",
    "We’ll start with the frontrunner in the debate over Power Broker’s identity: Sharon Carter. Debuting back in 2014's Captain America: The Winter Soldier, she makes an appearance in episode 3 of Falcon and the Winter Soldier, and in just a brief guest spot, there are multiple clues that suggest she could be our mysterious villain.",
    "For starters, we’ve learned that Sharon is leading a new life of crime, and that she isn’t just some petty thug. When she invites Bucky and Sam back to her Madripoor apartment, the pair learn that Sharon has started dealing in rare and valuable items since the events of Civil War. It isn’t outside the realm of possibility that she’d want to trade in substances like Super Soldier Serum, too - though this would be a depressing step down for the morally well-adjusted character we met in The Winter Soldier.",
    "Sharon was able to lead Sam and Bucky to the new creator of the Serum in this episode. We don’t see how she got that information, so it's possible she already knew thanks to her dealings with him in the past.",
    "Finally, after Sharon leaves Sam, Bucky and Zemo, she returns to her associate and says “We’ve got a big problem, actually a couple of them.” This could be in reference to all the mess she’s caused for herself in Madripoor, but her use of “couple” could also be the dual threat of Sam and Bucky who could soon realize she’s the Power Broker.",
    "Considering the episode Sharon is introduced in is called ‘Power Broker’, it all ties together nicely. Though perhaps a bit too nicely, if you ask us. We feel like Sharon has been set up as too obvious a choice, especially this soon after WandaVison, which employed a similar sort of twist. Would Marvel really try ‘close friend is secretly evil’ twice in a row?",
    "We can’t quite work out what her motivation would be, either, but future episodes could elaborate on this further. We’ll just have to wait and see.",
    "Zemo",
    "Since Zemo has been incarcerated for the past few years, and has formed a tenuous alliance with Sam and Bucky for the time being, we don't think the villain of Captain America: Civil War is the most likely candidate to be the Power Broker. Having Zemo double-cross our heroes would be the most obvious twist the writers could pull off.",
    "Operating as the Power Broker from his prison cell doesn't seem completely out of the question, though, especially when we see how easily he can escape incarceration. It seems unlikely that he'd want any other Super Soldiers out in the world, however. After all, in Civil War, we saw how he assassinated HYDRA agents created as part of the Winter Soldier program - the destruction of Sokovia gave him a distaste for superpowered beings.",
    "We don't think it'll be Zemo, but he's worth ticking off regardless.",
    "The US government or the Global Repatriation Council",
    "In the comics, Power Broker is a company rather than an individual, so perhaps the MCU has also gone for a collective for its portrayal.",
    "Our reasoning here comes down to a few pieces of evidence. First off, much like the Power Broker, these groups are trying to hunt down the Flag Smashers. It could just be because they are a terrorist group - but then why only send in the new Captain America and his buddy, rather than a whole trained squad? It could be because these organizations are also trying to get back their secret Super Soldier Serum and don’t want to make too many people aware of their secret intentions as the Power Broker.",
    "Secondly, John Walker could be the reason they want the Super Soldier Serum. While the government supposedly cancelled the new project, it’s possible not everyone was happy with that decision. When their lead scientist returned after the blip, a it's possible a group gathered together to find a superpowered replacement for the newly retired Captain America.",
    "Finally, we know that secretly evil government agencies are a favorite of MCU writers - just look at Captain America: Winter Soldier and WandaVision.",
    "The major problem with this theory, of course, is that it wouldn't be much of a reveal when the true Power Broker finally emerges. Presumably, the point of setting up the mystery is that it'll shock us when we find out their identity, which simply works better when it's an individual character rather than a group.",
    "Someone we haven’t met yet",
    "What if the Power Broker is someone who's yet to debut in The Falcon and the Winter Soldier? If Sharon is a red herring, we feel like this is the next most likely outcome.",
    "When actress Emily VanCamp was asked by Variety if Sharon is the Power Broker, she alluded to the idea it could be a character we haven't met yet. \"Well, that’s a good question. I mean, the Power Broker could be anybody. Also, there are several characters that have yet to be seen. So, I mean, I can’t say anything.\"",
    "The Falcon and the Winter Soldier already feels rather character-heavy, so we hope there aren't too many more faces left to be added to the cast. Still, right now, no one other than Sharon really sticks out as a definite pick for the true identity of Power Broker.",
    "It's always a little disappointing when a big question like this can’t be unraveled by the viewers, but given that WandaVision was so focused on giving fans a mystery to solve, perhaps the MCU is trying something different with this Disney Plus outing.",
    "Wild theory – Ultron!",
    "How about a wild guess, just to see us out? This wouldn’t necessarily fit the real-world espionage vibe The Falcon and the Winter Soldier is going for, but we have some method in our madness. Maybe Ultron is really the Power Broker.",
    "Episode 2 of the show introduced the ‘Big Three’, a joke about how every problem comes down to androids, aliens or wizards. It would be a neat callback to this gag if one of those three is actually pulling the strings from the shadows in this show. Who better to pull those strings than an android who famously has no strings on him?",
    "While Ultron was eradicated by the Vision at the end of Age of Ultron, the main attribute of the villain in the comics is his ability to never actually die - which, to be honest, is true of most comic book heroes and villains.",
    "Our wild theory: when Vision died in Infinity War, perhaps some well-hidden Ulton backup could have steadily started to make a return.",
    "Ultron could have adopted a new plan, where he manipulates humanity more subtly while waiting for the perfect time to strike. Perhaps giving specific people Super Soldier Serum to cause chaos is one step in his overall scheme.",
    "Okay, we know this is out there, but hey, this is Marvel. Remember when a witch turned an entire New Jersey town into a sitcom for a while?",
    "Assuming we're wrong and it’s a different member of the Big Three, we have two more quick wild guesses. For our alien, we have the Grandmaster from Thor: Ragnarok as an outside possibility. Now that his champions have abandoned him, a new batch of warriors fueled by Super Soldier Serum could be what the Grandmaster needs to restart his contests.",
    "For a Wizard, how about...Mephisto? He has to show up at some point, right?",
    "Hopefully we won't have to wait much longer to find out the truth. The Falcon and the Winter Soldier releases every Friday on Disney Plus."
  ],
  "headers": {
    "3": "Who is Power Broker in Marvel Comics?",
    "7": "Who could be the Power Broker in the MCU?"
  },
  "links": {
    "Falcon and the Winter Soldier": "https://www.techradar.com/news/when-is-the-falcon-and-the-winter-soldier-set-in-the-mcu",
    "WandaVision": "https://www.techradar.com/news/when-is-wandavision-set-in-the-marvel-cinematic-universe-timeline",
    "MCU": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "John Walker": "https://www.techradar.com/news/new-captain-america-in-the-falcon-and-the-winter-soldier-explained",
    "episode 3 of Falcon and the Winter Soldier": "https://www.techradar.com/news/new-captain-america-in-the-falcon-and-the-winter-soldier-explained/news/the-falcon-and-the-winter-soldier-episode-3-recap-review",
    "Variety": "https://variety.com/2021/tv/news/emily-vancamp-falcon-and-winter-soldier-power-broker-1234944318/",
    "famously has no strings on him?": "https://www.youtube.com/watch?v=tmeOjFno6Do",
    "Mephisto": "https://www.techradar.com/news/wandavision-is-mephisto-secretly-the-main-villain"
  }
}