{
  "source": "https://www.techradar.com/news/how-expressvpn-pipped-nordvpn-to-the-post-in-our-latest-vpn-reviews",
  "title": "How ExpressVPN pipped NordVPN to the post in our latest VPN reviews",
  "category": "computing",
  "updated": "2021-05-19T11:03:47Z",
  "author": "adam-marshall",
  "summary": "Two fantastic VPNs, but only one winner",
  "article": [
    "It's like Jordan vs Bird, Barcelona vs Real Madrid, The Rock vs Stone Cold Steve Austin - some rivalries are so even that you just don't know which way the next match-up is going to go. And over the last few years, it's been exactly the same in the world of VPNs.",
    "Two providers have been on top of the pile for a fair while now - ExpressVPN and NordVPN.",
    "And whichever of the two you were to choose, you would have the benefit of a VPN provider with superb security smarts, a fantastic range of clients and apps, irresistible geo-restriction unblocking, lots of servers around the world, fast connections and attentive 24/7 live chat customer support.",
    "But ultimately there can be only one winner, and ExpressVPN has retained its spot as the #1 VPN in the world once again. It was certainly a tight call, but below we have explained some of the reasons why our reviewer raised ExpressVPN's glove in this bout.",
    "Performance isn't everything, but it's a handy way to measure whether you're likely to be affected on a day-to-day basis by having your VPN running in the background.",
    "Make no mistake, both of these providers are fast, but NordVPN's median US speeds lagged behind ExpressVPN this time (240-480Mbps vs 490-630Mbps) in our tests this year.",
    "Once the sole possession of dark and dingy dev offices, 'UX' is now a common abbreviation that we bandy around to describe how software looks and feels. In our view, no other VPN provider has this area better perfected than ExpressVPN.",
    "And it really is the little things that make all the difference - like having all of your selected, smart and recent locations in view at all times, disconnecting with one-click (Nord takes two), not being pestered to 'Rate your connection speed' after every session.",
    "And then there's the design. ExpressVPN keeps things very simple - think alphabetically ordered, clear lists of server locations with easy-to-use search for less common corners of the globe. We don't entirely dislike Nord's use of a map interface - in fact, we think it looks rather snappy - but it can make finding locations quickly a tad fiddly, especially on mobile.",
    "Of course we recognize that the very nature of 'user experience' is that it's subjective and one person's \"just right\" is another user's pet peeve. But we think for most everyday users, ExpressVPN has really landed right on the money.",
    "The impression one gets about ExpressVPN is that its engineers have tried to cut out as many steps as possible when it comes to getting you started with your VPN. And for a piece of software that will still be rather unfamiliar to many, knowing that your provider has got your back is comforting.",
    "We really like the way that Express uses activation codes to help you get your clients and apps set up across devices. It means that if your system is set up in a slightly unusual way, there are no workarounds needed or incorrect assumptions about your set-up to overcome. Using an activation code (which copies to a clipboard with one click) makes set-up consistent across all platforms and means that there are no technical underlying steps in the installer or the app.",
    "Again, by no means a game-changer, but its simpler, more elegant set-up is yet more evidence of a provider that has really thought about its users.",
    "ExpressVPN's router VPN app already put it ahead of most of the competition (not just NordVPN), but the new auto-update feature is a significant plus.",
    "Only the most technical users are going to take on the task of installing and configuring the app, but many of those will be entitled to feel at least a little nervous about the process. So the idea that once you've done it, the app will handle future updates itself, is very attractive.",
    "We've gone to great pains in this article to point out that the overall difference between ExpressVPN and NordVPN is very slight indeed.",
    "There are other minor quibbles with Nord that we've not mentioned above, such as some of the behaviors it has trialled around auto-renewals (removing certain premium features, for example, if the auto-renewal box isn't ticked), slightly unnerving account credential dumps online, and some lack of transparency around pricing and crash reports.",
    "But we see NordVPN making improvements to its service constantly, and it does have its nose ahead of Express in other areas. It's around $2.50 a month cheaper if you commit to two years, has around 2,000 extra servers and probably a stronger set of security features.",
    "So ExpressVPN sits at the top of our best VPN chart for now, but that's not to say it will be there forever...",
    "Compare the top VPNs:"
  ],
  "headers": {
    "4": "Server speed",
    "6": "User experience",
    "10": "Set-up",
    "13": "Router app",
    "15": "The ExpressVPN vs NordVPN battle will continue"
  },
  "links": {
    "VPNs": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN has retained its spot as the #1 VPN in the world": "https://www.techradar.com/news/the-results-are-in-weve-found-the-official-1-best-vpn-of-2021",
    "router VPN": "https://www.techradar.com/vpn/best-router-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}