{
  "source": "https://www.techradar.com/news/what-are-honor-phones-a-guide-to-the-company-and-its-smartphones",
  "title": "What are Honor phones? A guide to the company and its smartphones",
  "category": "phones",
  "updated": "2021-03-15T09:42:45Z",
  "author": "tom-bedford",
  "summary": "The company with a second wind",
  "article": [
    "There’s a good chance you’ve heard of Honor, the tech brand that has brought quite a few different products to market. And it’s likely you’re aware of it as a sub-brand of Huawei. Well, the latter is no longer the case, as we’ll explain in our ‘History’ section below.",
    "Honor is most well known for its smartphones, but it also has laptops, earbuds, and a fantastic range of wearables under its umbrella of products. The company chiefly serves its home country of China, but we also see many of its products launch worldwide, albeit sometimes only in selected regions.",
    "In the main, the company puts out affordable devices, with its smartphones serving the mid-range and budget markets, and its wearables offering plenty of features at relatively low prices.",
    "To help you understand Honor, we’ve written this guide on the company, so you can get a flavor of the brand’s story to date, as well as the types of products it launches to market.",
    "Huawei originally created Honor as a sub-brand in 2013, to focus on creating low-cost products – and, in particular, targeted towards a young audience. Through the following year, the brand rolled out globally, setting up its own online stores in Europe in 2015.",
    "Honor started selling fitness trackers in 2016, laptops and smartwatches in 2018, and earbuds and TVs in 2019. The majority of those products are available in most regions, although some, such as TVs, have limited availability.",
    "Everything changed for the company in mid-2019, when the Huawei ban began. This effectively stopped Huawei phones, and Honor ones by extension, from carrying Google apps such as the Play Store, Maps, Gmail and Chrome. Since these are important to the running of a smartphone – especially the former, which permits the download of new apps – Honor and Huawei were hit hard.",
    "It’s difficult to come by exact sales figures to illustrate the extent to which Honor has been affected by the lack of Google apps, but we do know that the brand’s output has significantly decreased. In the UK, for example, since the Huawei ban, Honor has released only four smartphones affected by the changes (this doesn’t include the one handset launched immediately after the ban was put in place, which remained unaffected).",
    "For a year and a half thereafter, Honor continued to launch laptops, wearables and audio devices, but slowed its global release of smartphones, only releasing its top models in China, where Google apps aren’t used.",
    "Then, in late 2020, it was announced that Huawei was to sell Honor to the Shenzhen Zhixin New Information Technology Co, which would likely save it from the effects of the Huawei ban. We’re yet to see the fruits of this sale – the few products Honor has put out since then are remnants of its Huawei days – but it’s likely the company is on track for a second wind.",
    "Honor’s main smartphone series has a numerical indicator, with the Honor 20 phones launching in 2019 and the Honor 30 range in 2020. These are sometimes joined by Lite and Pro siblings too.",
    "Honor’s second line of smartphones have different names, depending on where you are. In China it’s known as the V series, but worldwide the phones are launched with that V extended into View. So while China saw the launch of the Honor V30, elsewhere it was the Honor View 30. This series is typically used as a way to test out features that eventually make their way to the flagship line.",
    "Another key series in Honor’s lineup of smartphones is the X series, which is a budget range offering generous screen sizes and long-lasting batteries. The last few generations of X phones have featured pop-up cameras as well, and are sometimes available in Pro and Lite variants, too.",
    "Those are Honor’s three key lines of note, but the brand also has a fair few other models that often aren’t released as widely, and typically have affordable price tags. There are the -S, -A, -I and -C lines, identified by those letters coming after the generation number. Of those, only the -A line has models currently for sale in the UK.",
    "Honor smartphones are available in most countries around the world, although some are only launched in China, or in certain European countries. Not many Honor phones make their way to Australia; likewise, Honor used to sell smartphones in the US, but hasn’t done for several years now.",
    "Honor’s V-series of smartphones will tend to launch in China at the end of a year, followed by a global launch at the beginning of the next year under the View name. That’s followed up in the first few months of the year by the numerical equivalent, so the V20 was launched as the Honor View 20 shortly after, then a few months after that, the Honor 20 series launched.",
    "Most of Honor’s other series receive a new entry each year, with the Honor 9X line coming out in 2019 and the X10 devices in 2020. However, it’s harder to pin-point an exact time in the year this happens, since it varies.",
    "Honor may have slowed down its smartphone arm following the aforementioned Huawei ban, but the company has instead put greater focus on other products, making great strides in certain areas.",
    "The Honor MagicBook line of laptops, like the MagicBook Pro, are low-cost but fairly powerful devices that look good and come with some useful features.",
    "Honor has two TVs, the Vision and Vision Pro from 2019, although they didn’t get a wide release – and we haven’t seen any newer versions of these models.",
    "The company also puts out affordable earphones, in the form of its FlyPods series (also called the Magic Earbuds in some regions), and home internet routers too.",
    "Perhaps the company’s biggest non-phone output is in wearables, however. The brand has brought a series of feature-packed affordable fitness trackers to the market, called the Honor Band, and a line of fitness-orientated smartwatches too. These wearables are available at low prices but include lots of useful features for fitness fans. For example, the Honor Watch ES offers exercise modes that guide you through particular workout routines, and the Honor Watch GS Pro is a rugged smartwatch with tools that are useful for outdoors types."
  ],
  "headers": {
    "4": "A brief history of Honor",
    "10": "What phones does Honor make?",
    "14": "Honor phone availability information",
    "17": "Other tech Honor sells"
  },
  "links": {
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "MagicBook Pro": "https://www.techradar.com/reviews/honor-magicbook-pro-2020-16-inch-laptop",
    "Magic Earbuds": "https://www.techradar.com/reviews/honor-magic-earbuds",
    "Honor Watch ES": "https://www.techradar.com/reviews/honor-watch-es-review",
    "Honor Watch GS Pro": "https://www.techradar.com/reviews/honor-watch-gs-pro-review"
  }
}