{
  "source": "https://www.techradar.com/news/teamsters-was-hit-by-ransomware-in-2019-but-refused-to-pay-up",
  "title": "Teamsters was hit by ransomware in 2019, but refused to pay up",
  "category": "computing",
  "updated": "2021-06-15T12:11:55Z",
  "author": "mayank-sharma",
  "summary": "Teamsters approached law enforcement but never disclosed the attack until now",
  "article": [
    "When the International Brotherhood of Teamsters, more widely known simply as Teamsters, was targeted by ransomware back in 2019, the US and Candian labor union simply refused to pay, new reports have revealed.",
    "Asked for $2.5 million, Teamsters decided to simply rebuild its entire network instead of caving in to the demands of the attackers, NBC News reported, based on details shared by anonymous sources.",
    "The sources familiar with the previously unreported attack claim that back then even the Federal Bureau of Investigation (FBI) advised the union to just pay the ransom, a far cry from its current stance.",
    "When Teamsters officials alerted the FBI and asked for help in identifying the source of the attack, they were informed that theirs wasn’t an isolated incident and that the bureau had their hands full.",
    "\"They said 'this is happening all over D.C. ... and we’re not doing anything about it,'\" one of the three anonymous sources told NBC News.",
    "The sources added that Teamsters officials initially bargained with the attackers over the dark web, negotiating the ransom down to $1.1 million.",
    "However, unlike the FBI, the group was advised by its insurance company not to settle with the attackers, which is why they decided to restore their network from backup.",
    "An official Teamsters spokesperson told NBC News that the perpetrators only managed to lock one of the union's two email systems along with some other data, though personal information for its millions of active and retired members was never compromised.",
    "The spokesperson added that while Teamsters was able to restore virtually all of its data from backups, some of it had to be imported from hard copies.",
    "Those were simpler times, and ransomware gangs hadn’t learned the art of double extortion.",
    "No data was exfiltrated and there were no threats of leaks. If a victim refused to pay, the threat actors would chalk it up to experience and simply move on to their next target.",
    "However, the revelation once again highlights how many organizations simply don’t share details about the attacks.",
    "If it wasn’t for Avaddon releasing the decryption keys for their victims, we wouldn’t have found out that the group attacked 2934 targets, a staggeringly large number compared to the mere 88 reported victims."
  ],
  "headers": {
    "5": "No easy way out",
    "9": "Tip of the iceberg"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "NBC News": "https://www.nbcnews.com/tech/security/ransomware-attack-hit-teamsters-2019-they-refused-pay-n1270461",
    "its current stance": "https://www.techradar.com/news/the-fbi-recorded-more-than-dollar4bn-in-cybercrime-costs-last-year",
    "backup": "https://www.techradar.com/best/best-backup-software",
    "email": "https://www.techradar.com/news/best-email-provider",
    "group attacked 2934 targets": "https://www.techradar.com/news/avaddon-ransomware-shuts-down-distributes-thousands-of-decryption-keys"
  }
}