{
  "source": "https://www.techradar.com/news/google-down-docs-drive-and-more-services-not-working",
  "title": "Google outage: Docs, Drive, Sheets and more were down, but are working again now",
  "category": "computing",
  "updated": "2021-04-13T08:03:51Z",
  "author": "mike-moore",
  "summary": "Google Docs, Drive, Sheets, Slides see issues",
  "article": [
    "UPDATE: Google has fixed the issues, with all services running as normal. “On April 12, as of 9:20 Pacific Time, we resolved an issue with creating new and copying existing Google Docs, Slides and Sheets within Google Workspace and Google Workspace for Education accounts. More details can be found on the Workspace Status Dashboard.” a Google spokesperson told TechRadar Pro.",
    "Google has suffered what appears to be a significant outage across a number of its online services, with popular apps such as Docs and Drive affected.",
    "Users across the world are reporting issues on outage tracker website DownDetector, beginning around 6am PT/2pm BST as much of the Americas came online for work on their Monday morning.",
    "The official Google Workspace dashboard showed issues for Drive, Docs, Sheets, Slides and Google Classroom, with the outage lasting for several hours for some users.",
    "In a tweet, the official Google account had told users that, \"We are aware of a service disruption and are working right now to resolve it. We apologize for the inconvenience and thank you for your patience.\"",
    "Google reported the issues fixed by 9.20am PT/5.20pm BST, with all the affected services back to full health.",
    "Users had reported issues with creating new documents in Google Docs, and being unable to access files in Google Drive. However, users do still appear to be able to access and edit older documents across Google's services.",
    "Many reported that when trying to create a new docuemnt in Google Docs, the page appears to load for a long time, before displaying an error message that says the service \"encountered an error”. Users are told to reload or try again in a few minutes.",
    "The same issue occured within Google Drive in and the Android Google Docs app."
  ],
  "headers": {
    "5": "Google Workspace problems"
  },
  "links": {
    "Workspace Status Dashboard": "https://www.google.com/appsstatus#hl=en&v=status",
    "DownDetector": "https://downdetector.co.uk/status/google/",
    "Google Workspace dashboard": "https://www.google.com/appsstatus#hl=en&v=status",
    "tweet": "https://twitter.com/Google/status/1381608391924187138"
  }
}