{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-leak-points-to-minor-camera-upgrades",
  "title": "Samsung Galaxy Z Fold 3 leak points to minor camera upgrades",
  "category": "phones",
  "updated": "2021-04-26T09:06:16Z",
  "author": "david-nield",
  "summary": "Not the bump we were hoping for",
  "article": [
    "New and improved camera arrays on the Samsung Galaxy Z Fold 3 were perhaps not top of the priority list while the foldable phone was being developed, based on the latest leak we've spotted – in fact it seems that the camera setup could be the same as the one on the Galaxy Z Fold 2.",
    "Twitter tipster @FrontTron has posted specs for the cameras on the Galaxy Z Fold 3, and the rear camera is apparently a triple-lens 12MP+12MP+12MP affair – matching what its 2020 predecessor came with.",
    "The cover camera (the one that points at you from the second screen when the phone is folded shut) is said to use a 10MP Sony IMX374 sensor, which also matches the cover camera on the Galaxy Z Fold 2.",
    "Lastly, the selfie camera (the one that points at you from the main screen when the phone is unfolded) is being tipped to be the 16MP Sony IMX298 sensor – a minor upgrade from the Galaxy Z Fold 2 but still a component that's been around for several years.",
    "Samsung could argue that the cameras didn't really need an upgrade – in our review we described them as being able to \"capture some of the best photos on a smartphone\" – but it's still disappointing to see that not much has changed in this department. It's perhaps one way Samsung is trying to keep the price of this handset as low as it can.",
    "The source does say they're \"not sure\" on the selfie camera spec, and we don't get exact sensor details for the triple-lens rear camera here, so a substantial increase in photo and video quality is still a definite possibility.",
    "It's also fair to say that phone makers have focused a lot on improvements to computational photography in recent years, with the likes of Apple and Google using software tweaks to get better results out of their camera hardware, even when that hardware doesn't get a major upgrade – and perhaps that's what Samsung is planning here.",
    "We're expecting to see the Samsung Galaxy Z Fold 3 appear within the next few months, with other leaks pointing to a Snapdragon 888 chipset inside, and the addition of water resistance for the first time on a folding Samsung phone.",
    "Via SamMobile"
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "@FrontTron": "https://twitter.com/FrontTron/status/1385056804330098690",
    "our review": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "SamMobile": "https://www.sammobile.com/news/galaxy-z-fold-3-might-not-bring-the-camera-changes-we-are-hoping-for/"
  }
}