{
  "source": "https://www.techradar.com/news/super-mario-bros-movie-release-date-and-cast-announced-and-it-stars-chris-pratt-as-mario",
  "title": "Super Mario Bros. movie release date and cast announced and it stars... Chris Pratt as Mario?",
  "category": "gaming",
  "updated": "2021-09-24T17:14:07Z",
  "author": "matt-swider",
  "summary": "Nintendo Direct gets us insight into the voice actors to the cartoon reboot of the Super Mario Bros. film",
  "article": [
    "The full-length animated Super Mario Bros. movie release date is still far away – now scheduled for December 21, 2022 in North America, with other regions expected to premier the film during 'holiday 2021'.",
    "But Nintendo did announce the main cast at its most recent Nintendo Direct event, which includes familiar actors who will be lend their voices to the characters that inhabit the iconic Mushroom Kingdom.",
    "Guardians of the Galaxy's Star-Lord Chris Pratt will voice star-power-up loving Mario, The Queen's Gambit actress Anya Taylor-Joy will voice Princess Peach and 'wildcard' It's Always Sunny in Philadelphia actor Charlie Day will be everyone's favorite green-shirted sidekick, Luigi.",
    "Jack Black, no stranger to voice acting given his Kung Fu Panda animated films, will give us some gruff Bowser dialogue, Key & Peele's Keegan-Michael Key will voice Toad, and Seth Rogan will monkey around with Donkey Kong lines.",
    "Kevin Michael Richardson, who recently reprised his role as Mortal Kombat's Goro, will apply some magic as Kamek, and SNL and Portlandia's Fred Armisen will give us wisdom as the ever-old stodgy Cranky Kong.",
    "Don't worry, legendary Mario voice actor Charles Martinet is going to be a part of this movie, as Nintendo assured fans he's been cast to voice several cameos.",
    "There's no Super Mario Bros. 2022 trailer ready to show off right now, however, and Nintendo says it's going to be some time before we get our first glimpse of the animated reboot of the poorly reviewed 1993 adventure comedy film cult classic."
  ],
  "headers": {},
  "links": {}
}