{
  "source": "https://www.techradar.com/news/forza-horizon-5-isnt-messing-around-when-it-comes-to-multiplayer-madness",
  "title": "Forza Horizon 5 isn't messing around when it comes to multiplayer madness",
  "category": "gaming",
  "updated": "2021-09-21T15:42:48Z",
  "author": "rhys-wood",
  "summary": "Horizon 5 will be a real playground game",
  "article": [
    "Forza Horizon 5 looks like it isn't shying away from the madcap multiplayer that's always been a draw to the franchise, as detailed by the latest Forza Horizon 5: Let's Go! showcase video presented by developer Playground Games.",
    "The 50-minute Let's Go! showcase detailed what we can expect of Forza Horizon 5's multiplayer offerings when it launches on November 9, 2021 on Xbox Series X/S, Xbox One and PC as well as the Xbox Game Pass subscription service.",
    "Chief among these new modes is the return of the minigame-centric Playground Games mode and the ever-unpredictable Eliminator battle royale, returning from its debut in Forza Horizon 4.",
    "A new game mode, Pinata Pop, will also feature in Forza Horizon 5. Here, players will race through a course attempting to run over as many papier-mâché critters as possible.",
    "The Forza Horizon series has always offered a fantastic suite of multiplayer options, and that's looking to be even further enhanced in Forza Horizon 5. All the options to free-roam, compete in co-op championships, or mess around in Playground minigames are present and accounted for.",
    "We're also happy to see the return of moreish modes like The Eliminator, a novel idea when it debuted in Forza Horizon 4 that turned out to be a shocking amount of fun. We only hope that players can queue with friends this time around to help spice up the battle royale chaos.",
    "New modes are equally welcome, too, including Pinata Pop which looks to be an incredibly satisfying distraction given that the Forza Horizon series actively encourages the destruction of property through its scoring and progression system.",
    "It's generally great to see so many multiplayer options at launch, especially as Forza Horizon 5 is going to be landing on Xbox Game Pass on day one of release, which is sure to allow for a sizeable playerbase at launch, something that the UK-based Forza Horizon 4 enjoys to this day."
  ],
  "headers": {
    "4": "Analysis: Multiplayer madness in Mexico"
  },
  "links": {
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review"
  }
}