{
  "source": "https://www.techradar.com/news/building-your-dream-website-just-got-a-whole-lot-quicker-and-simpler",
  "title": "Building your dream website just got a whole lot quicker and simpler",
  "category": "computing",
  "updated": "2021-01-29T22:35:13Z",
  "author": "anthony-spadafora",
  "summary": "Single-page websites are a great way to create an online presence",
  "article": [
    "Creating an online presence by building a website in WordPress allows you to showcase your interests or even kick start a new business venture.",
    "With WordPress, users can create blogs, online stores, newsletter signup forms and more but what if you want to create a simple one-page website? Up until now, doing so in WordPress was difficult as you would have to set up a database, install software and keep everything updated.",
    "To make it easier for users to build single-page websites in WordPress, Automattic has created a new Blank Canvas theme on WordPress.com. The company's new WordPress theme comes with no header, navigation menus or widgets so that the page a user designs in the WordPress editor is the exact same page seen on the front end.",
    "Automattic's Blank Canvas theme comes with a handful of ready-made Block Patterns to help users quickly create single-page websites in WordPress.",
    "As many people create single-page sites to tell others more about themselves, the company has created an “About Me” block pattern which allows site owners to create a concise introduction about themselves and what they do.",
    "The Blank Canvas theme also makes it simple for users to create a site showcasing a collection of links to their work, social media profiles and more. This can be done by selecting the “Links” pattern after opening the Block Patterns panel in the theme. You can also add a user photo, your name and a description if you like.",
    "Let's say you already have an existing WordPress site that you want to convert into a single-page site, thankfully Automattic has this covered too. The company has added a new setting to 20 of its most popular themes that will allow users to hide the header and some footer elements on the homepage, giving them a blank slate to build from.",
    "There's never been a better time to create your own website and with the Blank Canvas theme on WordPress.com, doing so is remarkably easy and fast.",
    "Via WordPress Tavern"
  ],
  "headers": {
    "3": "Block Patterns"
  },
  "links": {
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "WordPress.com": "https://www.techradar.com/reviews/wordpresscom",
    "WordPress theme": "https://www.techradar.com/news/best-wordpress-theme",
    "Blank Canvas theme": "https://wordpress.com/theme/blank-canvas",
    "Automattic": "https://www.techradar.com/news/automattic-buys-prospress-in-digital-subscription-push",
    "create your own website": "https://www.techradar.com/news/internet/web/creating-a-website-for-your-business-1076170",
    "WordPress Tavern": "https://wptavern.com/automattic-launches-the-blank-canvas-wordpress-theme-for-building-single-page-websites"
  }
}