{
  "source": "https://www.techradar.com/news/fitbit-charge-4-vs-fitbit-charge-5-what-you-need-to-know",
  "title": "Fitbit Charge 5 vs Fitbit Charge 4: how to choose your next fitness tracker",
  "category": "fitness",
  "updated": "2021-10-10T10:47:17Z",
  "author": "cat-ellis",
  "summary": "The Fitbit Charge 5 is impressive, but that Charge 4 is still worth considering",
  "article": [
    "The Fitbit Charge 5, which launched just a few months ago, is a very impressive fitness tracker, but its predecessor, the Charge 4, might be better suited to your needs – particularly if you're on a tight budget.",
    "The Charge series has always been workout-focused, and the Fitbit Charge 4 was a real game-changer when it arrived in 2020 thanks to its on-board GPS, which allowed wearers to track runs, walks and bike rides without carrying their phone.",
    "It wasn't the first Fitbit with a GPS chip (the Fitbit Surge and Ionic also had their own), but it was by far the slimmest and lightest, making it a great choice for anyone starting to get serious about their running.",
    "It was a tough act to follow, but the Fitbit Charge 5 has even more to offer. Not only does it keep the GPS chip (packed into a case that's 10% thinner), it also has an EDA (electrodermal activity) stress monitor, as seen in the Fitbit Sense, plus an ECG (electrocardiogram) sensor for checking your heart health.",
    "There's also a new bright color AMOLED screen in place of the Charge 4's monochrome display, plus a smart new design that replaces the older watch's hard angles with smoother lines.",
    "That doesn't necessarily mean that the Charge 5 is the best choice for everyone, though. Read on to find out all the key differences between the two fitness trackers, and choose the right one for you.",
    "The Fitbit Charge 4 launched in April 2020, priced at $149.95 / £129.99 / AU$229.95 (the same as the Charge 3's launch price). It can now be found much more cheaply though, particularly during sales events like Amazon Prime Day and Black Friday.",
    "The Fitbit Charge 5 was released in September 2021, priced at $179.95 / £169.99 / AU$269.95. we're not likely to see any significant price discounts for a while yet.",
    "In short, if you're on a tight budget, the Charge 4 is the cheaper option, and that's unlikely to change.",
    "Both the Fitbit Charge 4 and Charge 5 are slender devices, with a narrow rectangular case that sits flush with the band. However, that's where the similarities end.",
    "The Charge 4 has a plastic case with an angular design and a dark color scheme (black, dark blue, and deep purple). The standard edition has a silicone strap with a plastic buckle, and the special edition comes with an additional woven nylon band with reflective threads worked into the material.",
    "The Charge 5 has a stainless steel case, and is 10% thinner than the Charge 4. Its lines are smoother and softer (matching those of the Fitbit Versa 3, Sense, Inspire 2 and Luxe) and it's available in three colors: black, lunar white, and steel blue. All versions have a silicone Infinity Band, which uses a soft loop and tang rather than a hard buckle, which is more comfortable to wear while sleeping.",
    "Extra silicone, fabric and leather bands for both watches are available to buy separately, but bear in mind that they use different fittings, so you can't use Charge 4 bands with a Charge 5, or vice versa.",
    "One of our biggest complaints about the Fitbit Charge 4 is its display, which is perfectly serviceable, but doesn't really do the watch justice. It's a monochrome OLED touchscreen, with a relatively low resolution that limits the amount of workout data that can be displayed at once, and makes checking app notifications tricky as you can only see a small snippet of text.",
    "The Fitbit Charge 5's screen is about the same size, but is a full color AMOLED, with crisp graphics and animations. It looks very much like that of the Fitbit Luxe, and may indeed be the same unit. It's a huge upgrade, and one that brings the Charge series in line with rival device from the likes of Xiaomi and Amazfit.",
    "Neither the Fitbit Charge 4 or the Charge 5 are fully-fledged smartwatches (for that, you'll want the Fitbit Sense or Versa 3), but they still offer a handful of useful features outside of fitness tracking.",
    "For example. both watches can display smartphone notifications, and both feature NFC for making contactless purchases through Fitbit Pay (which could prove extremely handy for picking up a bottle of water during an unexpectedly hot run).",
    "Both also have a 'smart wake' alarm, which makes the watch vibrate gently at the optimum point in your sleep cycle, so you wake feeling fresh and without disturbing your partner.",
    "If you're a Spotify Premium subscriber, you may be surprised to learn that while the Fitbit Charge 4 allows you to control your playlist from your wrist, this feature has been dropped for the Charge 5.",
    "Both the Fitbit Charge 4 and Charge 5 have a good suite of workout tracking modes, plus on-board GPS. That means you'll still be able to track your location and pace during outdoor workouts, even if you opt for the slightly older model.",
    "The Charge 5 has lots more health and fitness tools to offer, though – including an EDA (electrodermal activity) sensor, as seen on the Fitbit Sense. This uses your skin's conductivity to assess physiological changes brought about by stress. The Fitbit app then helps you understand the factors that affect your stress levels, and take steps to manage it.",
    "Another feature borrowed from the Sense is an ECG sensor and app, which allow you to check for signs of atrial fibrillation. This can be an early sign of heart disease, and while the Charge 5 isn't a medical tool, if it detects something amiss, you can generate a report using the Fitbit app that you can share with your doctor.",
    "If you're a Fitbit Premium subscriber, the Fitbit Charge 5 will also give you a daily a Readiness Score. Each morning, this tells you how energized and well recovered you are, based on your sleep, recent activity, and heart rate variability. It also uses this data to suggest some activities for you to try from the Fitbit app's catalog of workouts, meditation sessions, and breathing exercises.",
    "For example, if you're well rested and have lots of energy, the app may suggest a tough run, but if you're more tired it might suggest you try some active recovery with a gentle yoga session. The Readiness Score tool will only be available to Fitbit Premium subscribers though, so it's worth factoring this extra cost into your decision-making."
  ],
  "headers": {
    "9": "Design",
    "13": "Display",
    "15": "Smartwatch features",
    "19": "Fitness tracking"
  },
  "links": {
    "Fitbit Surge": "https://www.techradar.com/reviews/gadgets/fitbit-surge-1270574/review",
    "Ionic": "https://www.techradar.com/reviews/fitbit-ionic-review",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Charge 3": "https://www.techradar.com/reviews/fitbit-charge-3",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}