{
  "source": "https://www.techradar.com/news/google-chrome-will-now-automatically-fix-your-breached-passwords",
  "title": "Google Chrome will now automatically fix your breached passwords",
  "category": "computing",
  "updated": "2021-05-19T18:27:21Z",
  "author": "anthony-spadafora",
  "summary": "Let Google Assistant update compromised passwords in Chrome for you",
  "article": [
    "Google has updated Chrome with a new feature designed to help users quickly fix any of their passwords that have been compromised as the result of a data breach.",
    "Memorizing long, complex and unique passwords can be difficult which is why more users are turning to password managers to securely store the passwords for their online accounts. While paid services like 1Password and LastPass offer additional functionality, most modern browsers have their own built-in password managers.",
    "Chrome's built-in password manager can not only store your passwords and allow you to access them across devices, it can also check to see if they have been exposed online through Google's Password Checkup feature. In addition to showing you which of your passwords have been compromised, Password Checkup also tells you if you have any reused passwords as well as which of your accounts are using weak passwords.",
    "Going forward though, Chrome will help users change their passwords with a single tap on Android smartphones in the US and this feature will roll out to users in other countries in the coming months.",
    "On supported sites whenever a user checks their passwords and Chrome finds that a password may have been compromised, a “Change password” button from Google Assistant will appear. When a user taps on this button, Chrome will then replace their compromised password with a complex and unique one.",
    "However, what makes this feature particularly interesting is the fact that Chrome is using Google's Duplex on the Web technology to automate the entire process of changing user's passwords. First announced back in 2019, Duplex on the Web allows Google Assistant to help complete tasks on the web such as buying movie tickets, ordering food or checking into flights.",
    "With the power of Duplex on the Web, Assistant will now take over the tedious parts of updating your compromised passwords. However, users can also choose to go through the process of changing their passwords manually.",
    "If a person reuses the same password across multiple sites, a single data breach can lead to all of their online accounts being compromised which is why Google's latest addition to Chrome's password manager makes a great deal of sense."
  ],
  "headers": {
    "4": "Powered by Duplex on the Web"
  },
  "links": {
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "password managers": "https://www.techradar.com/best/password-manager",
    "1Password": "https://www.techradar.com/reviews/1password",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "browsers": "https://www.techradar.com/best/browser",
    "Password Checkup": "https://www.techradar.com/news/google-boosts-password-security-with-password-checkup-chrome-extension",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Duplex on the Web": "https://www.techradar.com/news/what-is-google-duplex-the-worlds-most-lifelike-chatbot-explained",
    "data breach": "https://www.techradar.com/news/what-is-a-data-breach",
    "online accounts being compromised": "https://www.techradar.com/news/see-if-your-credentials-have-been-compromised-with-this-new-data-leak-tool"
  }
}