{
  "source": "https://www.techradar.com/news/dji-mavic-3-pro-rumor-suggests-super-drone-could-shoot-8k-video",
  "title": "DJI Mavic 3 Pro rumor suggests super-drone could shoot 8K video",
  "category": "cameras",
  "updated": "2021-05-01T16:16:12Z",
  "author": "axel-metz",
  "summary": "Crystal clarity",
  "article": [
    "We’ve only just been treated to the new DJI Air 2S, but fresh rumors are suggesting that DJI has an even more powerful drone up its sleeve this year – a DJI Mavic 3 Pro that’s capable of shooting 8K video.",
    "The rumor, which comes from a DroneDJ source, would see the Mavic 3 Pro become the first consumer drone capable of shooting 8K video and would likely succeed DJI’s current Mavic 2 Pro, which tops out at 4K/30p video.",
    "It’s worth noting that while DroneDJ has called its insider a “trusted source”, some of its sources have a mixed track record when it comes to DJI predictions. The information is also apparently based on Mavic 3 Pro prototypes being tested by DJI, one of which apparently has 8K/30p powers, so it’s far from certain that this will find its way into the final version.",
    "Still, given the mid-range Air 2S recently arrived with 5.4K video powers, the move to 8K for DJI’s ‘pro’ line would certainly make sense in theory – and bring some exciting possibilities.",
    "The Air 2S, for example, uses its extra resolution to provide a useful digital zoom function, which works well at 2x zoom. And with high-end rivals like the Autel Evo II Pro already boasting 6K video capabilities, it seems likely that DJI would look to set a new benchmark for premium-level drones with a Mavic 3 Pro.",
    "Should DJI’s next flagship arrive with 8K shooting abilities, it could represent an excellent option for professional aerial videographers looking to boost the quality of their footage. Currently, there are no consumer drones capable of shooting video at such a high resolution, with the latest top-end mirrorless cameras – like the Canon EOS R5 – only recently benefiting from the feature.",
    "That said, a DJI Mavic 3 Pro would need to significantly upgrade the Mavic 2 Pro’s 1-inch sensor to maintain decent image quality at that resolution. Right now, there are no rumors about which sensor the drone might use, but a Four Thirds chip could be a possibility within the size constraints of the series.",
    "While it’s very early days for rumors about a DJI Mavic 2 Pro successor, that drone is now approaching three years old – and it certainly seems likely to be the next model in DJI’s line-up to get an upgrade.",
    "In fact, the arrival of the Air 2S has arguably made the Mavic 2 Pro redundant, given both drones feature a 1-inch sensor. Currently, the only real benefit of going for the Mavic 2 Pro over its cheaper and newer sibling is its camera’s variable aperture, which lets you control your exposure without having to land and swap in ND (neutral density filters).",
    "With the mid-range DJI Air 2S now offering a 1-inch sensor and 5.4K video, it certainly seems likely that a Mavic 2 Pro successor would move to a larger sensor and higher video resolution. This could give pro shooters the option of shooting higher-quality oversampled 4K footage, or use the extra resolution to crop within the frame, all from a relatively compact folding drone.",
    "Of course, this would likely make the Mavic 3 Pro more expensive than its predecessor, which cost $1,599 / £1,349 / AU $2,499 at launch. As expected, DroneDJ’s source does suggest that the “the price [of the Mavic 3 Pro] will definitely be way up” – so don’t expect an easily-stomachable price tag if indeed the drone does arrive later this year.",
    "It would also cap a very busy year for DJI. In the past 12 months alone, the China-based company has added more than 10 new consumer-level products to its lineup, including the DJI Mini 2 and DJI Pocket, as well as the FPV drone and Air 2S in 2021.",
    "What’s more, DJI also recently announced its intentions to enter the automotive industry as a developer of self-driving car tech, partnering with big-name manufacturers to integrate its drone tech into future vehicles.",
    "That curveball might have spelled bad news for fans worried the company might abandon its drone-building roots, but it seems there’s no chance of that happening any time soon – especially after rumors surrounding its next high-end drone hint at a mightily impressive machine.",
    "Via DroneDJ"
  ],
  "headers": {
    "7": "Raising the bar"
  },
  "links": {
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "DJI Mavic 3 Pro": "https://www.techradar.com/reviews/dji-mavic-3",
    "DroneDJ": "https://dronedj.com/2021/04/26/looks-like-the-new-mavic-3-pro-will-shoot-8k-video-resolution-at-30-fps/",
    "Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "DJI Mini 2": "https://www.techradar.com/reviews/dji-mini-2",
    "DJI Pocket": "https://www.techradar.com/reviews/dji-pocket-2",
    "FPV drone": "https://www.techradar.com/reviews/dji-fpv-drone",
    "intentions to enter the automotive industry": "https://www.techradar.com/news/the-dji-air-2s-is-old-news-dji-is-officially-moving-into-self-driving-cars"
  }
}