{
  "source": "https://www.techradar.com/news/oneplus-could-put-out-an-android-tablet-in-the-near-future",
  "title": "OnePlus could put out an Android tablet in the near future",
  "category": "tablets",
  "updated": "2021-07-05T08:56:28Z",
  "author": "tom-bedford",
  "summary": "The OnePlus Pad has been trademarked",
  "article": [
    "We frequently hear rumors about various Chinese smartphone companies potentially releasing Android tablets, and now we can add OnePlus to that list, as a new device called the 'OnePlus Pad' has been trademarked.",
    "As spotted by MySmartPrice, the European Union Intellectual Property Office has a new listing for a device called the OnePlus Pad which, at least judging by the name, could be a new tablet.",
    "The listing doesn't reveal much else about the tablet, though it does specify that the trademark is for the name and not any particular tablet. This suggests the listing is just OnePlus setting the groundwork for a slate, which in turn means such a device from the company could still be a long way out.",
    "Presumably it would be an Android tablet too, as OnePlus phones use the Android operating system.",
    "With all that in mind, it's worth not getting your hopes high for this Android tablet just yet, as we could be waiting a year or more for it.",
    "While the OnePlus Pad might be a long way out, you might not need to wait as long for a similar tablet. That's because OnePlus' parent company, BBK Electronics, which also owns companies like Realme, Vivo and Oppo, has other slates coming.",
    "In particular, Realme has already unveiled (but not released) its first tablet, and we've also heard Vivo could have one soon. While these are technically from different brands, BBK's different companies sometimes share tech between them - and the world of Android tablets doesn't exactly have a huge diversity of devices anyway.",
    "So Realme and Vivo's tablets could give us an early glimpse at what the OnePlus Pad looks and works like. We'll have to wait and see though - that's all speculation for now."
  ],
  "headers": {
    "5": "Pad-dling along"
  },
  "links": {
    "Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "MySmartPrice": "https://www.mysmartprice.com/gear/oneplus-pad-trademark-euipo-website-oneplus-tablet/",
    "Vivo could have one soon": "https://www.techradar.com/news/vivo-might-be-about-to-launch-an-affordable-android-tablet"
  }
}