{
  "source": "https://www.techradar.com/news/oneplus-nord-2-is-real-company-confirms-in-a-surprise-announcement",
  "title": "OnePlus Nord 2 is real, company confirms in a surprise announcement",
  "category": "phones",
  "updated": "2021-07-07T11:23:18Z",
  "author": "tom-bedford",
  "summary": "And it has a bespoke chipset",
  "article": [
    "OnePlus has a pretty peculiar way of preparing for phone launches as it'll typically confirm new features in a drip-feed over the weeks before the actual launch. It's doing this for the OnePlus Nord 2... which is somewhat of a surprise as we weren't expecting that phone so soon.",
    "In a press release, OnePlus has confirmed the name 'Nord 2 5G', though the announcement itself is actually about the phone's chipset - the MediaTek Dimensity 1200-AI.",
    "OnePlus claims this is the first MediaTek chipset in one of its phones, which is correct, but it also says it's a chip that's exclusive to OnePlus. That's technically true, but a version called the Dimensity 1200 (without the AI) is already in use in various Realme, Oppo and Xiaomi phones.",
    "The unique element here is a host of AI features, including one that OnePlus calls AI Photo Enhancement that will automatically adjust color and contrast depending on the scenario. OnePlus says this will work with 22 different scenarios, but we don't yet know what they are.",
    "Other improvements include an AI Color Boost technology that can introduce high dynamic range even when it's not available, as well as an AI Resolution Boost feature that will enhance video resolution in certain apps (but OnePlus has yet to tell us what they are).",
    "The chipset isn't the big news here - what's important is that this is the first time the OnePlus Nord 2 has been confirmed by the company. We weren't expecting that to happen in a release about a chipset, but that's OnePlus for you.",
    "We've been hearing about this phone since the original OnePlus Nord launched in mid-2020, which is why this is such a surprise - we'd heard so many rumors of potential launches that we'd become desensitized to them.",
    "There's no solid launch or release date right now, but judging by OnePlus' typical patterns, we'd expect a new piece of information to be announced every week or fortnight for a month or so, before a launch event perhaps in August some time.",
    "By that time, we'll likely know a lot about the phone, as OnePlus often provides loads of juicy bits of information through its forums and press releases in these tease-seasons.",
    "We'll report every new thing we hear about the OnePlus Nord 2, so stay tuned for that in the coming weeks."
  ],
  "headers": {
    "5": "The OnePlus Nord 2 is coming"
  },
  "links": {
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord"
  }
}