{
  "source": "https://www.techradar.com/news/zoom-free-users-are-getting-this-super-helpful-feature-at-last",
  "title": "Zoom free users are getting this super helpful feature at last",
  "category": "computing",
  "updated": "2021-10-25T21:30:27Z",
  "author": "anthony-spadafora",
  "summary": "Live transcription is now available for all free Zoom accounts",
  "article": [
    "Zoom has announced that it will bring a popular feature from the paid version of its video conferencing software to all of its free users in an effort to make its platform more accessible.",
    "While auto-generated captions or live transcription was previously only available to the company's paid users, the feature, which provides automatic captioning during a Zoom video call, is now available on all free Zoom Meetings accounts according to a new blog post.",
    "Auto-generated captioning is just one of the accessible features built into Zoom. The company also provides keyboard accessibility, pinning or spotlighting interpreter video, screen reader support and voicemail transcription to make its video conferencing software accessible to even more users.",
    "In order to enable closed captioning for a personal account, you first need to sign into the Zoom web portal, navigate to the Settings option and click the Meeting tab. Under In Meeting (Advanced), you can click on the Closed captioning toggle to enable or disable it.",
    "Zoom's video conferencing software even allows you to use caption API Tokens to integrate with other third-party closed captioning services if you have a preferred one you're already using.",
    "It's also worth noting that the company's auto-generated captions are viewable in Zoom Rooms for those that have already returned to the office.",
    "By adding auto-generated captions to its free plan, Zoom is making its platform more accessible which should help prevent users from choosing to host their video calls on Google Meet, Microsoft Teams or another competing video conferencing service."
  ],
  "headers": {
    "3": "Enabling auto-generated captions"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "auto-generated captions": "https://www.techradar.com/news/zoom-is-set-to-eliminate-one-of-the-worst-aspects-of-video-conferencing",
    "live transcription": "https://www.techradar.com/best/best-transcription-services",
    "blog post": "https://blog.zoom.us/zoom-auto-generated-captions/",
    "screen reader support": "https://www.techradar.com/best/best-text-to-speech-software",
    "Zoom Rooms": "https://www.techradar.com/news/zoom-launches-hardware-subscription-service",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams"
  }
}