{
  "source": "https://www.techradar.com/news/okay-so-i-kind-of-love-the-darkplates-that-have-given-me-a-black-ps5",
  "title": "Okay, so I kind of love the 'Darkplates' that have given me a black PS5",
  "category": "gaming",
  "updated": "2021-07-09T12:48:42.831Z",
  "author": "john-mccann",
  "summary": "The black PS5 we've all been waiting for",
  "article": [
    "A couple of months ago I placed an order for black PS5 face plates, with the hope that they'll improve the aesthetics of Sony's gigantic new console.",
    "The PS5's design has divided opinion, and while I was all for the radical look when Sony showed it off for the first time back in 2020 - having lived with the original white console under my TV for the best part of six months, its bright white hue has begun to grate.",
    "Enter the 'Darkplates', which I purchased from dbrand. We covered them when they went on sale back in February 2021 - and dbrand's controversial marketing around its PS5 accessory, where it explicitly calls out for someone (i.e. Sony) to sue.",
    "Currently, there's no lawsuit on the horizon though, and Darkplates have been steadily shipped to customers around the world. Mine arrived this weekend, and I'm loving the mini transformation they've given my console.",
    "Sony revealed the face plates on the PlayStation 5 are easy to remove in the console tear down video it shared ahead of the system's release date - which immediately sparked talk of potential custom face plates for the machine.",
    "A firm grip on the horizontally-laid console is required, and pushing the plates from the top of the console sees them slide off nicely - it does require a little bit of force however.",
    "Popping the 'Darkplates' on is as easy as lining up the corresponding slots, and sliding them in, in the opposite direction to the plates you just removed. And voilà - a black PS5 is now yours!",
    "So, how does my now black PS5 look in its home under my TV? For me, it's a marked improvement. It's now more subtle in its presence, almost merging into the shadow of the shelf it resides in when not in use, but remaining eye-catching when I do power it on and the blue strip lights illuminate the inner channels.",
    "Now, not everyone will agree that this is an upgrade in terms of looks, and it can be argued that $59 (although at time of writing they're currently discounted to $49) for a couple of sheets of (admittedly well-made) plastic is a little extreme.",
    "But for those who are dreaming of a black PS5, this does provide an easy way to make that dream a reality (assuming there's actual PS5 stock available to get the console in the first place).",
    "The question is, which do you prefer? Take part in our Twitter poll below to let us know which team you're on."
  ],
  "headers": {
    "4": "Installation is easy",
    "7": "The final look"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "when they went on sale back in February 2021": "https://www.techradar.com/news/black-ps5-finally-becomes-a-reality-as-faceplates-go-on-sale-but-not-from-sony",
    "in the console tear down video": "https://www.youtube.com/watch?v=CaAY-jAjm0w",
    "PS5 stock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart"
  }
}