{
  "source": "https://www.techradar.com/news/google-pixel-4a-5g-is-hard-to-buy-does-that-mean-the-pixel-5a-is-near",
  "title": "Google Pixel 4a 5G is hard to buy - does that mean the Pixel 5a is near?",
  "category": "phones",
  "updated": "2021-11-30T21:17:53Z",
  "author": "tom-bedford",
  "summary": "Ditching the old to make way for the new",
  "article": [
    "If you head on over to your favorite internet store and try to pick up the Google Pixel 4a 5G, odds are you'll have a bit of trouble, because the device has become very hard to buy. Stock issues? Or perhaps the Google Pixel 5a is on its way.",
    "Very few retailers in the US or UK currently sell the Pixel 4a 5G - in the US it's not on sale at Walmart or Best Buy. As spotted by PhoneArena, B&H Photo and Video explicitly calls the phone 'discontinued'.",
    "In the UK, as per Mobiles.co.uk, none of the major UK carriers sell the Pixel 4a 5G, though it's available SIM-free from some places including Google's own store. So it's still purchasable in the UK, just not as readily as before (and not on a contract).",
    "We've contacted Google asking for comment on the Pixel 4a 5G's store-shelf disappearance, and will update this article if we hear back.",
    "It's possible shops are dropping the Pixel 4a 5G for stock reasons, or possibly because it competes too heavily with the Pixel 5 (they're both very similar devices). It's also plausible, though, that Google is doing so to prepare for the Pixel 5a.",
    "Often, before a company unveils a new smartphone, it'll stop selling the older version of it - this way, people won't accidentally buy a phone when they're unaware a new one is coming.",
    "We see this frequently with iPhones, and also devices from a few other companies too, so it'd make sense for Apple to pull such a move.",
    "The only concern is that rumors suggested the Pixel 5a would only launch in the US and Japan, making the limited UK availability of the 4a 5G a little confusing.",
    "Google has previously confirmed the Pixel 5a 5G is only coming to the US and Japan when it launches, but it has yet to comment on whether there will be a 4G only variant. If a standard Google Pixel 5a without 5G exists, we're unclear on whether that will be available in more markets.",
    "So we can't say for sure that Google canned the Pixel 4a 5G to make way for the Pixel 5a - or even that the former is officially discontinued - but the evidence does point that way. Hopefully we'll find out soon, if and when the latter is released."
  ],
  "headers": {
    "4": "Making way for the new"
  },
  "links": {
    "Google Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "PhoneArena": "https://www.phonearena.com/news/google-could-be-planning-to-discontinue-pixel-4a-5g_id132702",
    "Mobiles.co.uk": "https://www.awin1.com/awclick.php?awinmid=380&awinaffid=103504&clickref=trd-us-2703408221368758300&p=https%3A%2F%2Fwww.mobiles.co.uk%2F",
    "Pixel 4a": "https://www.techradar.com/deals/google-pixel-4a-deals",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "rumors suggested the Pixel 5a would only launch in the US and Japan": "https://www.techradar.com/news/google-pixel-5a-may-be-canceled"
  }
}