{
  "source": "https://www.techradar.com/news/marvels-eternals-first-reactions-get-ready-for-a-spectacularly-weird-mcu-movie",
  "title": "Marvel's Eternals first reactions: get ready for a 'spectacularly weird' MCU movie",
  "category": "entertainment",
  "updated": "2021-10-19T09:22:07Z",
  "author": "samuel-roberts",
  "summary": "Has Marvel landed another winner?",
  "article": [
    "Of all the Marvel movies coming in Phase 4 of the MCU, Marvel's Eternals has been the hardest to nail down. Focused on a group of god-like beings who have lived on Earth in secret for many years, it's hard to watch the trailers and know exactly what their unique selling point is as a superhero group – the marketing is instead leaning into the movie's dazzling ensemble cast, its cosmic-level stakes and director Chloé Zhao's eye for a beautiful shot.",
    "Now, though, the first reactions are in for the film following its world premiere in the US. TechRadar is also seeing the film imminently, and you can expect a full review closer to release – but to tide you over until then, here are some of the first reactions to the film from across social media.",
    "It's worth saying that these reactions are almost always positive, coming out of any Marvel movie, so it's worth waiting until reviews land before making your mind up (just see the positive notices for Ant-Man and the Wasp from 2018, which was clearly a lesser MCU movie). But they do offer more of a hint at the shape of the film, which is described as the \"most different\" MCU flick, as well as \"spectacularly weird\".",
    "Let's get started, with a notice calling the film 'massive' but 'down-to-earth' at the same time:",
    "There's praise for the cinematography of Ben Davis, who has previously worked on the Marvel movies Doctor Strange and Captain Marvel.",
    "Rotten Tomatoes' Erik Davis praises the film as \"soulful and thoughtful\", which aren't the kind of adjectives you usually associate with an MCU blockbuster.",
    "It's long been rumored that this film will be enormously important to the MCU's future – and it sounds like the post-credits will be worth sticking around for once again.",
    "Expect a movie that defies categorization – THR's Aaron Couch suggests this film is nothing like past MCU efforts, which is self-evident from the trailers released to date.",
    "Here's another positive notice for the movie's post-credits sequences, which seemed to drive the premiere audience wild:",
    "Interestingly, a couple of critics compare the movie to DC's films – not in a negative way.",
    "Menzel notes in a follow-up tweet, however, that the story structure in the film is \"bloated and convoluted\". Hooray, some criticism!",
    "We'd advise a bit of caution in seeking out further reactions yourself – a couple of potential spoilers are doing the rounds for this movie from critics, which seems like poor form, considering the public hasn't seen it yet. You don't have long to wait until Marvel's Eternals gets here: it's releasing in theaters on November 5, 2021."
  ],
  "headers": {},
  "links": {
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Phase 4 of the MCU": "https://www.techradar.com/news/marvel-phase-4",
    "Marvel's Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "Ant-Man and the Wasp": "https://collider.com/ant-man-and-the-wasp-reviews/"
  }
}