{
  "source": "https://www.techradar.com/news/new-macbook-pro-14-inch-and-16-inch-could-arrive-disappointingly-late-in-2021",
  "title": "New MacBook Pro 14-inch and 16-inch could arrive disappointingly late in 2021",
  "category": "computing",
  "updated": "2021-07-08T16:44:12Z",
  "author": "darren-allan",
  "summary": "Rumor claims we could see a late October or early November launch",
  "article": [
    "Just when the leaks seem to point to the MacBook Pro 14-inch and 16-inch coming out sooner than expected, another rumor pops up to adjust the timeline. And, this one suggests that we should be expecting these laptops much later in the year.",
    "As was reported by 9 to 5 Mac, this particular rumor comes by way of Apple leaker Dylandkt, who has been correct in the past. Supposedly, the 14-inch and 16-inch MacBook Pro models should drop in Q4, specifically late October or early November.",
    "Dylandkt also states that a new Mac Mini should accompany the two MacBook Pros, and that they will all come equipped with the M1X, Apple’s alleged successor to the M1 chip. But, when asked about an iMac Pro also getting a refresh, the leaker stated that there “most likely” would not be an update for the premium machine.",
    "While Dylandkt has said in the past that a new ‘higher-end Mac mini’ and a higher-end iMac would get the new M1X chip, the leaker appears to have changed their mind on the latter.",
    "As ever, sprinkle plenty of condiments around here, because as we mentioned at the outset, there has been a lot of buzz on the rumor mill of late about the new MacBook Pro models potentially turning up very soon indeed.",
    "We’ve heard that these overhauled laptops, or at least one of them, could emerge in early August, possibly sporting that rumored mini-LED display. And renown leaker Mark Gurman (of Bloomberg fame) is expecting these mean machines to debut in the summer with a chip that has more cores (some 10-cores in fact, compared to 8-cores in the current M1 – although Gurman didn’t actually name this new silicon as the M1X).",
    "Plus some clues from WWDC 2021, where there was no sign of any MacBook Pro, also suggest that it (or they) could be coming soon enough.",
    "Dylandkt’s current prediction is, however, in line with some of the gloomier lines of speculation that we’ve heard recently, including that there’s even a chance these MacBook Pros could be postponed until 2022."
  ],
  "headers": {
    "4": "Sooner, or later..."
  },
  "links": {
    "leaks seem to point to": "https://www.techradar.com/news/apple-might-be-releasing-the-m1x-macbook-pro-sooner-than-we-thought",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "9 to 5 Mac": "https://9to5mac.com/2021/06/18/leaker-claims-new-redesigned-macbook-pro-will-be-launched-in-q4-along-with-m1x-mac-mini/",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "Dylandkt has said in the past": "https://www.techradar.com/news/rumored-macbook-pros-could-use-m1x-chip-this-year-with-m2-coming-in-2022",
    "We’ve heard that these overhauled laptops": "https://www.techradar.com/news/apple-might-be-releasing-the-m1x-macbook-pro-sooner-than-we-thought",
    "mini-LED display": "https://www.techradar.com/news/powerful-new-m1-macbook-pro-models-expected-to-feature-mini-led-display",
    "expecting these mean machines to debut in the summer": "https://www.techradar.com/news/rumored-macbook-pros-could-use-m1x-chip-this-year-with-m2-coming-in-2022",
    "Plus some clues from WWDC 2021": "https://www.techradar.com/news/the-macbook-pro-was-a-no-show-at-wwdc-but-it-may-still-be-coming-soon",
    "MacBook Pros could be postponed until 2022": "https://www.techradar.com/news/the-latest-macbook-rumor-could-disappoint-a-lot-of-people"
  }
}