{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-gets-more-features-to-make-it-a-better-apple-watch-7-rival",
  "title": "Samsung Galaxy Watch 4 gets more features to make it a better Apple Watch 7 rival",
  "category": "wearables",
  "updated": "2021-10-20T14:00:55Z",
  "author": "tom-bedford",
  "summary": "One main upgrade and a few small ones",
  "article": [
    "If you've been considering buying a Galaxy Watch 4, a new update to Samsung's latest smartwatch (as well as the Watch 4 Classic) could make it a more tempting buy - well, as long as you were on the fence anyway, because it's not a huge upgrade.",
    "Announced at the Samsung Unpacked event alongside new Galaxy Z Flip 3 colors and a collaboration with fashion brand Maison Kitsuné, the Galaxy Watch 4 is getting an update rolling out from October 20, with one big and two minor updates.",
    "Firstly, fall detection is getting an upgrade - before, this noticed if you had a trip during exercise, but now you can change the sensitivity, so even if you're not working out it'll still send an SOS call if you take a tumble.",
    "Secondly, four new watch faces have been added - since there were already many of these which you could customize, alongside the option to add your own picture and design your own watch face, this is a tiny change.",
    "The big update is gesture controls, so you can navigate the smartwatch interface by shaking the device in certain ways. For example, you can rotate your arm to shut up an alarm or decline a call, and apparently you'll be able to customize what certain gestures do.",
    "This sounds like a system fraught with potential problems, and we'll have to test it out to see if it improves the Galaxy Watch experience or not.",
    "The Apple Watch 7 was released recently, and as two close tech rivals, it's only natural to compare Apple's latest with the Galaxy Watch 4.",
    "Both watches have their pros and cons, but this new Galaxy Watch 4 update doesn't really shift the balance much either way.",
    "Of the three 'new' features, only the gesture navigation is actually new in any way, with the fall detection just tweaking an existing tool, and the watch face change arguably bringing nothing important.",
    "And while some people might enjoy gesture controls, they tend to be very hit-or-miss in tech - sometimes they work flawlessly and bring extra functions to devices, but other times they feel useless, gimmicky, or actually make a device harder to use.",
    "So Samsung hasn't brought a showstopper feature to its smartwatches - hopefully future upgrades will bring more tools."
  ],
  "headers": {
    "6": "Analysis: a better Apple Watch 7 rival?"
  },
  "links": {
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "Samsung Unpacked": "https://www.techradar.com/news/live/samsung-galaxy-unpacked-live-blog-todays-colorful-launch-as-it-happens",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news"
  }
}