{
  "source": "https://www.techradar.com/news/10-things-to-stream-on-netflix-amazon-prime-disney-plus-and-more-in-september-2021",
  "title": "10 things to stream on Netflix, Amazon Prime, Disney Plus and more in September 2021",
  "category": "entertainment",
  "updated": "2021-09-11T11:32:46Z",
  "author": "samuel-roberts",
  "summary": "What's worth streaming in September 2021",
  "article": [
    "Looking for something to stream on Netflix, Amazon Prime Video and other services in September 2021? We'd describe the next month of new TV and movies as fairly strong – big dramas like Y: The Last Man and Impeachment: American Crime Story show that TV is kicking into high gear again, as productions catch up after pandemic-related delays.",
    "Netflix, meanwhile, has a heap more original movies coming out, like the action movie Kate featuring Mary Elizabeth Winstead, as well as some more serious dramatic stuff. All of that is covered below, along with the debut of Star Wars: Visions on Disney Plus.",
    "Here's what you'll be able to watch over the next month, in the US and the UK.",
    "Release date: September 3",
    "Amazon is rolling out its own musical version of Cinderella in September, which looks like comforting family stuff with a contemporary and knowing approach to the material. Billy Porter plays Fab G, the Fairy Godmother-shaped role, while the supporting cast features Idina Menzel and Pierce Brosnan.",
    "While on paper, another version of Cinderella – minus the Disney aesthetic – doesn't seem very appealing, this one is directed by Kay Cannon, who has credits on 30 Rock and all three Pitch Perfect movies. If you're dubious, watch the trailer. It looks fun.",
    "Release date: September 3",
    "Netflix's popular Spanish heist drama ends this year, with part 1 rolling out in September, with the series finale coming on December 3. Basically, you'll need to get caught up if you want to understand the plot at this point, but the novel aspect of Money Heist is that you see the titular crime(s) play out from a number of different perspectives. That makes each episode feel tense and unpredictable.",
    "In this season, the story picks up with the heist crew still stuck in the Bank of Spain after more than a hundred hours – and now the army are moving in, which spells possible doom. Fans will no doubt devour every episode the second it drops.",
    "Release date: September 3",
    "If you're in the market for a more serious drama in September, Worth covers a subject matter that's as complex and heavy as it gets. It's about an attorney (played by Michael Keaton) who has to calculate the settlements paid out to victims of the 9/11 attacks. Sara Colangelo, director of the award-winning movie The Kindergarten Teacher, is behind this one, which also features Stanley Tucci and Amy Ryan.",
    "Release date: September 10",
    "This preposterous-looking action thriller has the potential to be fun. Mary Elizabeth Winstead plays an assassin who gets poisoned after a botched killing, who then seeks revenge – accumulating a Sigourney Weaver in Aliens-like style while doing so. The trailer's lighting is certainly going for that John Wick and Atomic Blonde visual direction, and we're prepared to bet this will be great fun to watch on a Friday night after a beer or two (maybe only after a beer or two). Woody Harrelson is also involved.",
    "Release date: September 17",
    "Netflix's popular sitcom remains a perennial favorite in the UK, and fans have been waiting well over a year for Sex Education season 3 to drop. The show has frequently been praised for its progressive depiction of sexuality – it's generally considered heartwarming and funny, which is a tough combo to pull off these days. Hopefully we won't be waiting more than 18 months for season 4.",
    "Release date: September 13 (US, September 14 on Hulu), September 22 (UK)",
    "After years and years of development hell, FX has finally got its adaptation of Y: The Last Man out of the door. Based on Brian K Vaughan and Pia Guerra's acclaimed Vertigo comic book, it's about a world where a virus has wiped out every creature with a Y chromosome – minus Yorick (Ben Schnetzer) and his pet monkey. Diane Lane features in the supporting cast.",
    "If they get it right, this could be phenomenally successful. If they get it wrong, well, we don't want to think about that scenario. Viewers can watch this on FX and Hulu in the US, while Star on Disney Plus gets the first three episodes on September 22.",
    "Release date: September 22",
    "Lucasfilm employs the talents of anime powerhouses like Production IG and Trigger for this anthology show, which presents imaginative interpretations of the Star Wars universe from Japanese creators. While we're excited about The Mandalorian season 3 and The Book of Boba Fett landing on Disney Plus, this nine-episode series looks gorgeous – and any excuse for more 2D animation set in the Star Wars universe is good by us.",
    "Release date: September 23",
    "HBO Max has gobbled up all of the old DC Universe shows that didn't get the chop already – Titans, Harley Quinn and Doom Patrol, giving it a great base of DC content for subscribers to check out. And this unusual drama, about DC's equivalent of the X-Men (except, it's much stranger, and features Timothy Dalton), is constantly called underrated by those who love it.",
    "The trailer probably gives off a few Umbrella Academy vibes, and if you like that show, you'll definitely enjoy this one. Plus, Brendan Fraser is in it! Check out the first season and see if it's your sort of thing. In the UK, past seasons have released on Starzplay (available via Amazon Prime Video's channels), so hopefully the third will drop there too.",
    "Release date: September 24",
    "Here's the month's possible low-key hit. The Haunting of Hill House creator Mike Flanagan is launching another horror series on the streamer, this time a slightly Wicker Man-y story about a group of people living on the remote Crockett Island. When a man returns to the island after a long absence, weird stuff goes down – coinciding with the appearance of a handsome priest (Hamish Linkater). It's hard to pin down exactly what The Midnight Mass is from the trailer, other than that it's a religion-tinged spooky show, but Flanagan's track record has us convinced it'll be at least a little bit scary. Early Halloween, anyone?",
    "Release date: September 24",
    "How do you cover a thousand years' worth of story in one weekly TV show? That's for executive producer David S. Goyer – who worked on the Dark Knight trilogy – to figure out. Apple TV Plus, fresh off the success of Ted Lasso, will no doubt hope to rope in more subscribers with this new big-budget sci-fi drama, an adaptation of Isaac Asimov's books. Jared Harris and Lee Pace are among its recognizable stars."
  ],
  "headers": {
    "3": "Cinderella (Amazon Prime Video)",
    "6": "Money Heist season 5, part 1 (Netflix)",
    "9": "Worth (Netflix)",
    "11": "Kate (Netflix)",
    "13": "Sex Education season 3 (Netflix)",
    "15": "Y: The Last Man (Hulu/Disney Plus)",
    "18": "Star Wars: Visions (Disney Plus)",
    "20": "Doom Patrol season 3 (HBO Max)",
    "23": "Midnight Mass (Netflix)",
    "25": "Foundation (Apple TV Plus)"
  },
  "links": {
    "Y: The Last Man": "https://www.techradar.com/news/y-the-last-man-tv-show-is-finally-happening-and-looks-insanely-good-in-first-trailer",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know"
  }
}