{
  "source": "https://www.techradar.com/news/dell-memorial-day-laptop-deals-sales-big-savings-across-the-range",
  "title": "Memorial Day laptop deals: don't miss these excellent offers from Dell",
  "category": "computing",
  "updated": "2021-05-30T18:33:59Z",
  "author": "tabitha-baker",
  "summary": "All the best Dell Memorial Day laptop deals in one place",
  "article": [
    "Memorial Day laptop deals are offering some particularly enticing discounts at Dell this weekend, with big savings on both everyday PCs, more premium configurations, and even gaming laptops. That means there's something for everyone in this weekend's Memorial Day laptop deals, with discounts to suit every budget. We're bringing you all the best Dell sales right here, but you'll find plenty more Memorial Day sales around the web as well.",
    "Those shopping in the budget category will want to take a look at the excellent range of Inspiron models in this year's Dell Memorial Day sales. At the cheapest end we have the Dell Inspiron 15 3000, a full-sized 15.6-inch machine that manages to pack some serious specs into a low price tag (as little as $289.99 right now). However, if you're after something a little more flexible you'll also find some great Memorial Day laptop deals on the Inspiron 14 5000 2-in-1 (now $599.99, was $809.99) and the premium XPS 13 as well (now $899.99, was $999).",
    "For a new gaming rig, however, we'd recommend checking out the Dell G-Series line for a more budget-conscious build (they start at $799.99 this weekend), or heading straight over to Alienware for something a little sturdier.",
    "You'll find all our top Dell Memorial Day laptop deals just below, with some gaming laptop options further down the page as well.",
    "Dell's Memorial Day laptop deals are offering some excellent discounts on cheaper Inspiron 15 3000 models and big savings on premium XPS configurations. Plus, you'll find a range of gaming laptop deals available further down the page as well.",
    "We're also rounding up all the best Memorial Day mattress sales, as well as the best Memorial Day appliance sales and Memorial Day TV sales as well."
  ],
  "headers": {
    "4": "Today's best Dell Memorial Day laptop deals",
    "5": "More Memorial Day sales"
  },
  "links": {
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "as little as $289.99 right now": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1069116888307089700/https://deals.dell.com/en-us/productdetail/8q8s",
    "now $599.99, was $809.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1433764057376312300/https://deals.dell.com/en-us/productdetail/8weq",
    "now $899.99, was $999": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8168052000802354000/https://deals.dell.com/en-us/productdetail/8q94",
    "they start at $799.99 this weekend": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7125389742860068000/https://deals.dell.com/en-us/productdetail/8uvs",
    "best Memorial Day mattress sales": "https://www.techradar.com/news/memorial-day-mattress-sale-2021",
    "Memorial Day appliance sales": "https://www.techradar.com/news/the-best-memorial-day-appliance-sales-deals-from-home-depot-lowes-and-more",
    "Memorial Day TV sales": "https://www.techradar.com/news/memorial-day-tv-sales-2021"
  }
}