{
  "source": "https://www.techradar.com/news/own-a-chevrolet-bolt-dont-park-within-50-feet-of-others-cars-chevy-warns",
  "title": "Own a Chevrolet Bolt? Don't park within 50 feet of others cars, Chevy warns",
  "category": "car-tech",
  "updated": "2021-09-17T15:06:26Z",
  "author": "chris-teague",
  "summary": "And only use the top floor of parking garages",
  "article": [
    "General Motors' decision to recall the Chevrolet Bolt to correct battery construction issues and reduce fire risk was the right move, but as time has gone on, the list of offenses against Bolt owners has continued growing.",
    "The recall came first, but then there were instructions to not leave the car charging unattended. Okay, fine, but now GM is telling Bolt owners to park away from other vehicles and structures, and if the car must be left in a parking garage, it needs to be parked on the top deck.",
    "At this point, it's starting to feel like the cars need to be isolated and stored until a permanent fix is developed.",
    "In an email picked by by Bloomberg, GM spokesperson Dan Flores stated the requested fixes would \"reduce potential damage to structures and nearby vehicles in the rare event of a potential fire.\"",
    "\"We recommend parking on the top floor or on an open-air deck and park 50 feet or more away from another vehicle.\"",
    "The recommendation regarding charging was also reiterated in the statement from Flores. \"Additionally, we still request you do not leave your vehicle charging unattended, even if you are using a charging station in a parking deck.\"",
    "So, if you're a Bolt owner whose home or place of employment requires that you park in a garage, you're looking at a longer walk, at the very least.",
    "As some have pointed out, how does valet parking or a quick trip to the grocery store work if you can't park or can't have someone else park your car in a reasonable spot?",
    "For Bolt owners, the recall and subsequent messaging has to have been more than frustrating.",
    "Now that the group of affected cars has grown to include every Bolt ever made and owners have been told not to park inside or leave their car charging unattended, what's left for GM to do, other than start buying the cars back?",
    "Production is on hold due to battery pack shortages and issues related to the recall, so it's not as if there's a backlog of new Bolts hitting dealers lots that need selling.",
    "The issues are deep and widespread enough for Bolt owners to be skeptical of any fix, especially since this is not the first time the cars have been recalled for battery problems.",
    "Via Reuters"
  ],
  "headers": {
    "8": "Analysis: it's time for GM to buy back"
  },
  "links": {
    "The recall came first": "https://www.techradar.com/news/more-woe-for-chevrolet-bolt-ev-owners-as-electric-car-gets-recalled-again-over-fire-risk",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-09-15/gm-tells-some-bolt-owners-to-park-50-feet-away-from-other-cars",
    "Reuters": "https://www.reuters.com/business/autos-transportation/gm-tells-bolt-ev-owners-park-away-vehicles-decks-2021-09-15/"
  }
}