{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-march-13-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-03-13T00:06:33Z",
  "author": "axel-metz",
  "summary": "What's worth streaming this weekend",
  "article": [
    "After the mega-popular WandaVision reached its conclusion on Disney Plus last week, many of us are in desperate need of something new to watch as we roll through another pandemic-hampered weekend. Well, until The Falcon and the Winter Soldier starts on March 19, anyway.",
    "Luckily, the biggest streaming services have heeded those calls and served up some exciting new TV series, movies and even documentaries to sink our teeth into, from gritty character dramas to expletive-laden animated adventures.",
    "Below, we round up seven of the biggest highlights coming to Netflix, Amazon Prime Video, HBO Max, Apple TV Plus and Disney Plus this weekend. We'll explain how to stream each one in the US and the UK, too (whenever possible).",
    "In a role that’s decidedly less Spider-Man and more American Sniper, Tom Holland stars in Cherry, an adaptation of Nico Walker's semi-autobiographical novel about a college dropout turned Iraq War hero suffering from PTSD. Helmed by the Russo brothers (of Avengers fame), this character drama examines issues of crime, addiction and patriotism in noughties America.",
    "The critical response to the movie has been something of a mixed bag, but Cherry seems worth the watch just to see Tom Holland bereft of his usual red suit and Spidey senses. Especially if you've bought an Apple device recently, which nets you a free year of the service.",
    "Now available to stream on Apple TV Plus",
    "Sticking with the Marvel theme, Assembled: The Making of WandaVision takes a look behind the scenes of Westview to reveal what went into making Disney Plus’ biggest show. The documentary marks the first in a series of standalone features to be released after each new Marvel production on the streamer – including the aforementioned The Falcon and the Winter Soldier – which will all feature exclusive interviews with cast and crew members.",
    "If you’re comfortable with shattering the illusion of superhero action, this first instalment will shine a light on the sets, stunts and CGI that brought the world of WandaVision to life.",
    "Now available to stream on Disney Plus",
    "The latest season of the popular animated sitcom arrives on Netflix this weekend, ready to re-introduce some laughs into your life with its customarily-juvenile joke-making. For the uninitiated, Paradise PD focuses on an inundated but wildly incompetent titular small-town police department. If you want a reason to check it out, Tom Kenny, the iconic voice of SpongeBob SquarePants, lends his talents to Chief Randall Crawford, the show’s main character.",
    "Season 3 comes packed with 12 episodes, the most of any Paradise PD season so far, so expect even more gun-toting stupidity than usual.",
    "Now available to stream on Netflix",
    "Generation, the latest original series on HBO Max, takes a dark look at the sex lives of a diverse group of high school students in conservative America. Lena Dunham, creator of fellow HBO hit Girls, is among the show’s producers.",
    "The first three episodes are available to stream right now, followed by two more on each of the next two Thursdays and a single-episode finale on April 1. Judging by the success of 2019’s Euphoria, Generation is one to watch before the whole of the internet does.",
    "We're not sure when this one releases in the UK, though.",
    "Episodes 1-3 are now available to stream on HBO Max",
    "Jennifer Garner stars in this family-friendly comedy about two beleaguered parents who decide to give their three kids a \"Yes Day\" – 24 hours where they get to make the rules. Naturally, chaos ensues, but not before the family embarks on everything from water balloon fights to fairground bust-ups to frighteningly-large tree climbing.",
    "The critical response has been nothing to write home about, but Yes Day looks like it'll inoffensively kill a few hours either way.",
    "Now available to stream on Netflix",
    "Still pining after a quality sports docuseries after the addictive trip of 2020’s The Last Dance? Amazon Prime Video might have the answer. Making Their Mark journeys into the inner sanctum of the Australian Football League during the most challenging year in its history.",
    "Players, coaches and executives across six teams detail the pressures of the global pandemic on the country’s biggest sport. Expect tackles, trophies, and, of course, tears.",
    "Now available to stream on Amazon Prime Video",
    "Based on the novel by John Marrs, The One tells the story of a future where a simple DNA test can determine your soulmate. Naturally, this isn’t a practise to everyone’s liking, and conspiracy ensues when tech boss Hannah Ware becomes blinded to the dangers of her work.",
    "The source material was well-received upon its publication in 2017, so expect this Black Mirror-esque vision of a dystopian future to leave some scratching their heads, and others wishing for simpler times.",
    "Now available to stream on Netflix"
  ],
  "headers": {
    "3": "Cherry (Apple TV Plus)",
    "6": "Assembled: The Making of WandaVision (Disney Plus)",
    "9": "Paradise PD season 3 (Netflix)",
    "12": "Generation (HBO Max)",
    "16": "Yes Day (Netflix)",
    "19": "Making Their Mark (Amazon Prime Video)",
    "22": "The One (Netflix)"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/when-is-wandavision-set-in-the-marvel-cinematic-universe-timeline",
    "its conclusion": "https://www.techradar.com/news/wandavision-episode-8-recap-review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare"
  }
}