{
  "source": "https://www.techradar.com/news/nvidia-hits-new-highs-in-gpu-sales-as-ampere-dominates-amd-big-navi",
  "title": "Nvidia hits new highs in GPU sales as Ampere dominates AMD Big Navi",
  "category": "computing",
  "updated": "2021-03-10T10:37:38Z",
  "author": "darren-allan",
  "summary": "But both firms are suffering at the hands of stock shortages",
  "article": [
    "Nvidia’s graphics cards are more dominant than they’ve ever been in recent years in the discrete GPU market, going by some freshly released figures.",
    "This number crunching comes from Jon Peddie Research (JPR), an analytics firm that regularly chimes in with GPU stats, and this latest report provides some eye-opening stats for the discrete desktop market.",
    "As of Q4 2020, Nvidia has an 83% share of the discrete (meaning standalone) graphics card market, according to JPR, with AMD obviously left with the remaining 17% share. We are used to seeing Nvidia’s dominance hovering around the 80% level, or at least close to it, but 83% is the highest it’s ever been going by JPR’s historical figures.",
    "The last time Nvidia was over 80% was in Q4 2018, when Team Green hit an 81.2% market share. Since then, though, that share has fallen as low as 67.9% (in Q2 2019), and indeed it was still at 69% in Q1 of 2020. In the following quarters of last year, though, Nvidia witnessed its share surge upwards strongly, with a major uptick in Q2 2020 of almost 9%.",
    "In total, Nvidia shipped over 9.1 million discrete graphics cards throughout 2020, with AMD achieving a total of close to 1.9 million. Exactly how many of Nvidia’s tally were Ampere GPUs isn’t known, but it’s likely to have been a robust amount, considering that as Tom’s Hardware (which spotted this) notes, Nvidia was running down its RTX 2000 stocks for a couple of quarters before the RTX 3000 launch in September of last year.",
    "All that said, while Nvidia may be clearly winning the battle in relative terms against AMD in the discrete graphics card market, both GPU makers have suffered at the hands of production woes and failing to get enough stock out there.",
    "AMD may have struggled more, given its commitments to console GPUs, and new Ryzen 5000 CPUs as well, but Nvidia has been beset by similar struggles, as we’ve seen repeatedly in comments from the top brass at both companies.",
    "Normally, the launch of new GPUs, namely Ampere and Big Navi, which arrived in September and November from Nvidia and AMD respectively, would be expected to considerably spike sales, as gamers rush out to buy them in numbers. Particularly given that much-hyped new games like Cyberpunk 2077 also came out in Q4 of last year (selling a ton – despite all the controversy around the title – and making some major leaps in terms of visual quality).",
    "And indeed there was a big demand for new graphics cards, but not nearly enough supply, which meant that overall discrete GPU sales actually dropped in Q4 compared to Q3, with those (still very much continuing) stock shortages to blame.",
    "It would definitely have been interesting to see how sales of graphics cards might have panned out if both Nvidia and AMD had been able to meet demand. Even with those production problems, though, total discrete GPU shipments for 2020 still exceeded the figure achieved in 2019, with 41.5 million units shipped throughout last year. Of course, the fact that demand for PCs was up sharply – due to coronavirus lockdowns and many more people working from home – certainly helped the sales of GPU makers with products inside those prebuilt machines.",
    "Tom’s notes that Gartner’s figures (another big analyst firm) showed that PC shipments increased by nearly 11% in Q4 2020, compared to the same quarter in 2019.",
    "As for the overall picture of GPUs including integrated graphics (in other words, graphics solutions built into the CPU), Intel leads the pack by a long way (reflecting the dominance of laptops in the PC arena, many of which don’t have a separate GPU).",
    "In Q4 2020, JPR’s stats show that Intel held 69% of the market for overall GPU share, with Nvidia on 15%, and AMD actually ahead of its rival on 17% (remember that Team Red has an advantage here in that it also sells Ryzen CPUs with integrated graphics)."
  ],
  "headers": {
    "5": "Taking stock"
  },
  "links": {
    "Nvidia’s graphics cards": "https://www.techradar.com/news/nvidia-geforce",
    "AMD": "https://www.techradar.com/news/amd-graphics-cards",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/gpu-sales-report-q4-2020-jpr",
    "Nvidia has been beset by similar struggles": "https://www.techradar.com/news/nvidia-rtx-3080-stock-shortage-is-set-to-worsen-and-it-could-cause-prices-to-rise",
    "both companies": "https://www.techradar.com/news/nvidia-rtx-3000-stock-may-not-improve-until-may-and-amds-gpu-outlook-isnt-great-either",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "controversy around the title": "https://www.techradar.com/news/cyberpunk-2077-loses-over-75-of-players-on-steam",
    "Ryzen CPUs": "https://www.techradar.com/news/amd-ryzen-cpus-help-drive-record-breaking-revenue-but-the-news-isnt-all-good"
  }
}