{
  "source": "https://www.techradar.com/news/disneys-cruella-trailer-shows-emma-stone-as-the-iconic-villain-and-its-out-this-may",
  "title": "Disney's Cruella trailer shows Emma Stone as the iconic villain, and it's out this May",
  "category": "entertainment",
  "updated": "2021-02-17T15:44:48Z",
  "author": "hamish-hector",
  "summary": "To see her is to take a sudden chill",
  "article": [
    "Disney has dropped the first trailer for Cruella, its next live-action film remake. Based on the classic villain from the Disney film One Hundred and One Dalmatians, Cruella will show viewers how the fashion designer became the dog fur-obsessed criminal we know her to be.",
    "Emma Stone will star as Cruella de Vil opposite Emma Thompson, who plays the Baroness, a prestigious fashion designer who will allegedly be pivotal in Cruella’s transformation. Joel Fry and Paul Walter House are set to play Jasper and Horace Badun - Cruella’s partners in crime - while Emily Beecham will appear as Dalmatian owner and Cruella’s schoolmate, Anita.",
    "Cruella is set to come out in theaters on May 28, 2021. There’s currently no information on when and how the film will debut on Disney Plus, but we'd expect it some time after the theatrical release.",
    "Based on this first look footage, it feels like Disney is taking a Joker-esque approach to Cruella. While it likely won’t be R-rated, Cruella will be another origin story for a mysterious villain who’s synonymous with evil (devil is literally in her name).",
    "Because of this, Cruella definitely looks like an interesting way to retell the One Hundred and One Dalmatians story.",
    "It also seems that Disney won’t be toning down the villainous nature of the character, unlike Maleficent in the live-action remake of the Sleeping Beauty story, so that should be exciting.",
    "We just hope that Cruella doesn't fall into the movie trope of vilifying mental illness. The use of \"psycho\" and \"mad\" in the trailer to describe Cruella set some of those alarm bells ringing, but we'll just have to wait and see when the full film releases."
  ],
  "headers": {
    "3": "What we think so far"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review"
  }
}