{
  "source": "https://www.techradar.com/news/dragon-raja-x-evangelion-is-now-on-pc",
  "title": "Dragon Raja x Evangelion is now on PC",
  "category": "gaming",
  "updated": "2021-10-26T20:12:05Z",
  "author": "sponsored",
  "summary": "Alongside another Evangelion collaboration, MMORPG Dragon Raja launches on PC",
  "article": [
    "Doomsday is coming.",
    "In addition to ancient magical beasts trying to reclaim ownership of the world, you now must deal with extra-terrestrial monstrosities. Good thing you aren't doing it alone – or unarmed. You'll have plenty of allies at your side, along with the opportunity to unlock two of the most iconic mechas in anime history, EVA-01 and EVA 02'γ.",
    "Android / iOS Download Free Here",
    "PC Download Free Here",
    "Available for a limited time only, these exclusive vehicles are part of the Dragon Raja X Evangelion crossover event – or more specifically, the second crossover. In addition to experiencing a whole new set of stories and missions, players will have the opportunity to unlock new limited battle uniforms, including the outfits of Asuka Langley and Rei Ayanami. The event also features an entirely new limited game mode, known as Video Game Duels, Evangelion Version.",
    "This event will see players face off against other players in card matching battles to hone their skills and prove themselves the best of the best.",
    "This crossover would be exciting enough, but it's happening concurrently with something else. Something big. Dragon Raja's PC launch features enhanced graphics, optimized gameplay, and full support for cross-platform play. If you already have an account all you need to do to play on PC is log in.",
    "And you should be logging in. To celebrate its PC launch, Dragon Raja is offering an unprecedented amount of free gifts and login rewards, including Special Stat Boosts, Coupons, Evolution Stones, and Avatar Frames. Better yet, if the number of active players on PC exceeds the developer's milestone number, everyone will receive even more gifts.",
    "This is in addition to 5 Polishing Dye and 5 Underworld Flames provided to any player that logs into either of the two new servers brought online to support the launch.",
    "Download Dragon Raja on Android/iOS or PC.",
    "As the developer and publisher of Dragon Raja, Archosaur games has been embedded in the American and European gaming markets for years. Leveraging the new Unreal Engine, it regularly revisits and optimizes its existing titles, even as it works to develop new experiences. You can learn more about it at https://dragonraja.archosaur.com, or follow their Facebook Page for news and updates."
  ],
  "headers": {
    "10": "About Archosaur Games"
  },
  "links": {
    "Here": "https://lzhx-eu.onelink.me/kmOG/68fe86b0",
    "Android/iOS": "https://lzhx-eu.onelink.me/kmOG/f7dab480",
    "PC": "https://lzhx-eu.onelink.me/kmOG/68fe86b0",
    "https://dragonraja.archosaur.com": "https://lp.archosaur.com/drag/en10/index.html%20",
    "follow their Facebook Page": "https://www.facebook.com/DragonRajaEN/"
  }
}