{
  "source": "https://www.techradar.com/news/microsoft-may-finally-make-the-surface-pro-more-repairable",
  "title": "Microsoft may finally make the Surface Pro more repairable",
  "category": "computing",
  "updated": "2021-10-08T20:18:57Z",
  "author": "allisa-james",
  "summary": "The tech giant is set to act by the end of 2022.",
  "article": [
    "Microsoft has always been unwavering on its repair policies in the past. However, the tech giant is considering supporting more research and policies so users can more easily repair devices like the Surface Pro 8 and its other Windows tablets, after receiving pressure from an investors group.",
    "In June 2021, the company held an investor’s meeting with investor advocacy nonprofit As You Sow. The results of that meeting cemented Microsoft’s commitment to researching the “environmental and social benefits” making it easier for users to repair their own devices. This would include making parts, information, and other resources more readily available to consumers.",
    "This is the first time a US manufacturer has agreed to such conditions after investor pressure, but most likely won’t be the last if recent patterns are any indication. For example, back in September mutual fund company Green Century filed two right-to-repair resolutions. The first was with Apple and the second was with Deere & Co., an agricultural equipment manufacturer.",
    "Microsoft agreed to look into how 'right to repair' would affect its contributions to climate change and electronic waste, with the study evaluating the social impacts and serving to “determine new mechanisms to increase access to repair, including for Surface devices and Xbox consoles,\" as stated by a recent news release from As You Sow. Microsoft will then be required to share a summary of those findings by May 2022 and act on them by the end of 2022.",
    "In statements given to both Grist and Tom’s Hardware, a Microsoft spokesperson stated “We believe customers are entitled to repair options that are safe and reliable. We currently provide customers with repair services that ensure the high quality of repairs, safeguard customers’ privacy and security, and protect customers from injury.”",
    "It's too early to say whether this will mean Surface devices will be easier to upgrade in the future, but it's looking good. The Surface Pro 8 has a user-replaceable SSD that's pretty easy to access, so hopefully it's a step in the right direction for Microsoft.",
    "Via PC Gamer"
  ],
  "headers": {
    "3": "What does this mean?"
  },
  "links": {
    "Surface Pro 8": "https://www.techradar.com/news/this-is-it-the-worst-gaming-chair-ive-ever-seen",
    "Windows tablets": "https://www.techradar.com/news/mobile-computing/tablets/windows-8-tablets-release-date-specs-and-prices-916134",
    "As You Sow": "https://www.asyousow.org/press-releases/2021/10/7/microsoft-agrees-expand-consumers-repair-options",
    "Gre": "https://www.greencentury.com/",
    "e": "https://www.greencentury.com/",
    "n Century": "https://www.greencentury.com/",
    "Grist": "https://grist.org/accountability/bowing-to-investors-microsoft-will-make-its-devices-easier-to-fix/",
    "Tom’s Hardware": "https://www.tomshardware.com/amp/news/microsoft-will-make-devices-easier-to-repair-following-investor-pressure?__twitter_impression=true",
    "PC Gamer": "https://www.pcgamer.com/microsoft-right-to-repair-study-research-agreement/"
  }
}