{
  "source": "https://www.techradar.com/news/rip-windows-10-windows-11-could-be-unveiled-by-microsoft-in-a-few-weeks",
  "title": "RIP Windows 10? Windows 11 could be unveiled by Microsoft in a few weeks",
  "category": "computing",
  "updated": "2021-06-15T11:34:57Z",
  "author": "darren-allan",
  "summary": "Rumors are flying – but how likely is a name change, really?",
  "article": [
    "Windows 11 could be the name of the next-generation of Microsoft’s desktop OS, or at least a bunch of clues and rumors appear to be vaguely pointing this way – ignoring the software giant’s insistence in the past that it wouldn’t turn things up to ‘11’ (or any other number) with Windows.",
    "We already know that Microsoft is planning to show off the “next generation of Windows” on June 24, ahead of the Sun Valley revamp emerging later this year, with apparently revolutionary changes in terms of the overall look and interface.",
    "So, rather than the Windows 10 21H2 update as we’re expecting, could this actually be an entirely new version of Windows with an uptick in the number? Is Windows 11 really about happen, and what evidence is there for this possibility?",
    "The main pillar of the current Windows 11 speculation is built around the somewhat tenuous observation that in the teaser for the aforementioned Microsoft event in June, which you can see tweeted below, light coming through the ‘window’ forms two vertical bars in the shadow on the floor – kind of like a very thick ‘11’ – with no horizontal bar present.",
    "This could purely be the way the scene and lighting has been rendered and mean absolutely nothing, although it does seem a little odd – and the fact that Microsoft has chosen the time of 11am for the event backs up the ‘11’ theory. This also isn’t typical timing for a Microsoft press shindig...",
    "As The Verge points out, other Microsoft executives have been stoking the rumor flames too, with comments like this one from the VP of Modern Life, Search & Devices Group, Yusuf Mehdi: “I haven’t been this excited for a new version of @Windows since Windows 95!”",
    "Note that it’s not a new version of ‘Windows 10’ he’s talking about…",
    "Then some leakers are getting in on the act too, like Evan Blass, who (as spotted by Windows Latest) tweeted: “From the ‘Don't take screenshots of this build’ department: a forthcoming Microsoft OS called Windows 11.”",
    "Cue a bunch of other tin foil hat-leaning theories alongside all this, like ‘Sun Valley’ (remember, that’s the codename for the 21H2 revamp) having an ‘11’ in it: Sun Va11ey. (For that matter, Satya Nade11a – right!?).",
    "What to make of all this? As we said at the outset, in the past Microsoft has made it very clear that “Windows 10 is the last version of Windows”, and there won’t be a Windows 11 (or indeed anything else, like Windows 365 to pull another idea out of the hat).",
    "But then again, originally Microsoft also promised fancy names and themes for the big Windows 10 updates – like the Creators Update – which were quickly abandoned in favor of simply dating upgrades.",
    "And besides, things will have to change eventually, right? Windows 10 won’t live forever… but six years? We suppose that’s certainly a good deal more than the typical lifespan of a Windows OS…",
    "In a few weeks, we’ll know the truth behind this, but for now, while there are admittedly plenty of clues and leaks around, Windows 11 just feels rather unlikely. Especially if macOS 12 is about to be unleashed (and Microsoft might feel that symbolically, Windows 11 could subconsciously be seen as a step behind Apple in this respect).",
    "What might be a more realistic prospect is that Microsoft might simply rename the operating system plain ‘Windows’, and ditch the numbering entirely. In a similar kind of vein to the way in which the Surface Pro 5 was simply called the Surface Pro.",
    "If the name is changed away from Windows 10 – to Windows 11, just Windows, or something else entirely like Windows 365 – that also begs another question: presumably this will be a free upgrade for everyone on Windows 10? That would surely have to be the case…"
  ],
  "headers": {
    "9": "Past promises"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "next generation of Windows": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows",
    "Sun Valley": "https://www.techradar.com/news/windows-10-update-will-bring-a-new-look-that-will-ditch-its-windows-95-era-charm",
    "revolutionary changes": "https://www.techradar.com/news/windows-10-will-get-a-revolutionized-new-look-according-to-microsoft",
    "21H2 update": "https://www.techradar.com/news/windows-10-21h2-update",
    "The Verge": "https://www.theverge.com/2021/6/3/22466394/microsoft-windows-11-launch-teaser-rumors",
    "one": "https://twitter.com/yusuf_i_mehdi/status/1400125771746746371",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows Latest": "https://www.windowslatest.com/2021/06/04/windows-11-new-hints-point-to-next-gen-microsofts-desktop-os/",
    "tweeted": "https://twitter.com/evleaks/status/1400562158325452803",
    "Microsoft has made it very clear": "https://www.techradar.com/news/software/operating-systems/microsoft-confirms-there-will-be-no-windows-11-1293309",
    "macOS 12": "https://www.techradar.com/news/macos-12"
  }
}