{
  "source": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699",
  "title": "The best cheap MacBook deals in December 2021",
  "category": "computing",
  "updated": "2021-12-07T17:04:32Z",
  "author": "james-pickard",
  "summary": "Our roundup of all the cheap MacBook sales available this month.",
  "article": [
    "This week's MacBook deals now look a lot weaker with the biggest sales events of the year behind us. We saw some record low prices for Apple's range of premium laptops last month, but now the savings are restricted to a few specific models in December. We're hoping we might see a return to the previous low prices in the Christmas sales, we're on hand to bring you the very best offers on Apple's premium laptops in both the US and the UK.",
    "Starting with the MacBook Air model, it now only has a small discount on the standard $999 / £999 price and it's now reduced to $929 / £889. That looks a lot better for anyone in the UK as it's the cheapest price for some time. However, the current US price is over $100 more than the lowest we've seen, so it's not the best time to buy. You might want to go for the 512GB version instead, which is only $50 away from a record low price.",
    "As for the MacBook Pro, there is actually a good $200 saving on the 512GB model at Amazon right now, which brings it down to $1,249. That brings this mode down to the cheapest MacBook we've seen and a solid discount if you're looking to buy before the end of the year. Just remember to apply the voucher at the checkout to get this price.",
    "When it comes to the latest MacBook Pro 14-inch (2021) and MacBook Pro 16-inch (2021), though, you're going to be paying full price no matter where you look. There have been small savings on these devices on Black Friday and Cyber Monday but we don't expect them to return for a while now.",
    "We'll be back to update this hub every week with all the latest cheap MacBook deals, so you can pick up a luxury laptop without breaking the bank.",
    "If you're after a performance boost, but still need that lightweight form factor, the new MacBook Air M1 might be your best bet. Don't worry though, there's a serious performance boost in this model but you're not paying as much for it as you may think. In fact, we even saw some early discounts over Black Friday 2020, so Apple certainly isn't afraid to introduce MacBook deals on this model every now and then.",
    "The new M1 chip gives Intel a serious run for its money, and battery life doesn't even suffer for it. Plus, you're getting it all for the same price as the previous model which makes this the go-to for a 2020 release right now.",
    "The original 2020 MacBook Air doesn't look quite so good now that the M1 version is out in the wild. However, as prices start to fall on the early-2020 model, you may well find some significant MacBook deals up for grabs here.",
    "You'll find Intel 10th generation processors with up to quad-core CPUs available here. Plus, this model was the first to offer 256GB of storage space at entry level, with up to 16GB RAM on offer as well. Like the M1 model, the entry level 2020 MacBook Air also starts at a lower sub-$1,000 / £1,000 price.",
    "The new M1 MacBook Pro is now available, which means you'll want to decide whether you go for a potentially cheaper price point with the previous generation or what looks like a stark performance upgrade with Apple's own chip. We've already seen some surprise price cuts over Black Friday - mere weeks after the latest MacBook Pro was released, however, which means the latest model may be more affordable than you think.",
    "The new MacBook certainly delivers on Apple's promise of a revolutionary experience. Performance sees a considerable boost from the new M1 hardware, even running legacy apps designed for previous Intel machines. Things still look pretty similar from the outside, but you're running a serious powerful machine here, with a price that even manages to undercut other high end ultrabooks in value.",
    "The 2020 MacBook Pro (Intel) does have its place in the market now that the M1 model has hit the shelves. While you're only picking 8th generation processing here, which is a little old for a laptop priced well over $1,000 / £1,000, you're able to configure far more RAM and storage in this model. That makes it a go-to if you're looking for bigger storage but you're happy to grab a cheaper processor to do so.",
    "The M1 version does retail for a similar MSRP, which would make it a go-to for most users. However, if you spot a MacBook deal below the standard $1,200 / £1,200 above, it's worth a look.",
    "Released just as 2019 was drawing to a close, the 16-inch MacBook Pro was set upon the world in order to replace the 15-inch model released earlier in the year. There's far more than a few inches tacked onto the display, however.",
    "Top of the range specs will bring you an 8-core 9th generation i9 processor, 64GB RAM and an 8TB SSD - at a price that pushes $6,000. That means there's some mind-blowing power on offer here, but very few will actually get to experience it. At entry level you can expect a MacBook Pro price of just over $2,000, which is far more manageable but far from the cheap MacBook sales we all dream of.",
    "Keeping all that power contained is, of course, the larger 16-inch chassis, but there's also an improved keyboard and brighter Retina display on offer here. 11 hours of battery life is an impressive feat at this spec, but if you're after a portable laptop to throw into a backpack, you might want to take a look at some smaller models - this beast weighs in at 2kg.",
    "Apple hasn't released a standard MacBook in a while, which means the prices below are likely on refurbished units. However, if you're looking for an Apple machine under $800 then this is likely your best shot. MacBooks are made to last, which means many of these older models will still hold up for everyday usage as well.",
    "This is the newest regular MacBook you can buy. The screen and compact dimensions on the 2017 MacBook are the same as the 2016 edition. The main improvement with the latest version is the inclusion of the 7th-gen Kaby Lake processors in either m3, i5 or i7 configurations.",
    "2015 MacBook owners are the most likely to notice and appreciate the improvements, but if you're still looking for cheap MacBook deals and don't want to go near a $1,000 price tag, this could be the model for you.",
    "The internal specifications on the 2016 12-inch MacBook might be lagging behind the most recent version nowadays, but if you're not planning on pushing the device too hard with demanding tasks then it could be a great money-saving option for you.",
    "While some of the cheapest prices might be reserved for refurbs, the 2016 MacBook is still a fantastic device and it's one of the most portable options in Apple's laptop lineup.",
    "MacBook deals are hard to come by for a reason - these machines last. That means Apple rarely discounts its older laptop lines with new generations, so it's harder to find that standout price if you're willing to swallow a few years on the market.",
    "That doesn't mean you're stuck with launch prices, however. In fact, MacBook sales are fairly common around certain times of the year, and do generally fall in line with new releases. While you might not find major discounts on cheaper entry level models, those shopping for the more specced out lines can enjoy some significant price drops around the holidays and major Apple launch windows.",
    "We'll say it again, MacBooks last. Many 2015 MacBook Pros are still running healthy to this day, though you might struggle to cram the latest MacOS releases onto them. But we'll say something else again, cheap MacBooks don't tend to lose their value. That means you can easily spend $1,000 on a MacBook from before 2017 and miss out on the latest processors, RAM speeds, hardware features, and SSD storage sizes of the newer models, sitting at similar prices.",
    "That means if you do spot a particularly good MacBook deal on an older model, it may well be worth your time. If you find yourself shopping between the $1,300 and $2,000 mark, however, double check you can't pick up something newer for the same price.",
    "MacBook sales tend to offer creepingly reduced prices on the entry level Air and Pro models while reserving the big drops for the more expensive configurations. While these deals tend to stick around the same sale prices every time they are reduced, keen shoppers will notice that traditional discount does grow a little every now and then. That will knock an extra $50 off the price sporadically in order to make headlines, but it also means that if you spot a particularly good MacBook deal it's not worth sticking around and waiting for a better sale in the future.",
    "It's worth shopping older models if you're looking to score a more impressive price drop, as retailers are keen to shift these units before any big release. Shop these MacBook deals if you're after a bigger spec in particular, as you'll often find the older mid-range models offering bigger power than entry level fresh releases for either the same price or slightly less.",
    "However, it's always worth keeping one eye on the prices of those latest versions. As we've learned with the 2020 MacBook Air, Apple is looking to make the MacBook more cost effective moving forwards. That means you might be able to find MacBook deals offering entry level new releases for less than their ancestors."
  ],
  "headers": {
    "5": "This week's best cheap MacBook deals in the UK",
    "21": "How to find the best MacBook deals",
    "23": "Cheap MacBook prices: is it worth buying a pre-2017 MacBook?",
    "25": "What to look for in MacBook sales"
  },
  "links": {
    "Christmas sales": "https://www.techradar.com/news/after-christmas-sales-2020",
    "MacBook Pro 14-inch (2021)": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "MacBook Pro 16-inch (2021)": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021"
  }
}