{
  "source": "https://www.techradar.com/news/end-of-pandemic-might-lead-to-a-drop-in-cybercrime-says-kaspersky-ceo",
  "title": "End of pandemic might lead to a drop in cybercrime, says Kaspersky CEO",
  "category": "computing",
  "updated": "2021-03-03T12:38:49Z",
  "author": "sead-fadilpasic",
  "summary": "But not everyone agrees with his assessment.",
  "article": [
    "When it comes to Covid-19, there's one thing civilians and cybercriminals have in common: everyone is in desperate need of a vacation. At least that's what Eugene Kaspersky thinks.",
    "During the recent Asia Pacific Online Policy Forum, the CEO of Kaspersky Lab predicted a drop off in cybercrime as soon as Covid-19 is over. According to Kaspersky, criminals will step away from their machines to spend whatever they managed to steal during the pandemic.",
    "\"If the pandemic goes away, criminals will go away and on vacation,” he was quoted saying.",
    "Kaseprsky added that the global pandemic and lockdowns have drawn a greater number of people into cybercrime, with a new set of goals.",
    "“More junior criminals are joining cyberspace,” he said. “I'm afraid this is the next step in a cyber war, to hack not just the traditional computer systems and smartphones, but also to get into the industrial systems, into infrastructure, including critical infrastructure.”",
    "But not everyone agrees with Kaspersky's assessment. Australian infosec expert Dr. Greg Austin, for example, claims the exact opposite will happen.",
    "The professor of Cyber Security, Strategy and Diplomacy at the University of New South Wales said that workers will start flocking back to their offices once the pandemic subsides. Cybercriminals, being the opportunists that they are, will try to take advantage by amping up phishing campaigns, he said.",
    "Dr. Austin claims it will be pivotal for organizations everywhere to keep an eye on changes in group behavior that may result in data incidents, as well as increase their cybersecurity training efforts.",
    "The Covid-19 pandemic forced many people into remote working, away from the safety of corporate networks and work devices. Many used their devices for both private and professional work, often looking for information on the pandemic, relief programs and vaccines in faraway corners of the internet.",
    "Cybercriminals took advantage of this fact, preying on people's fears to distribute ransomware and malware, as well as to steal sensitive information.",
    "Via The Register"
  ],
  "headers": {
    "5": "Conflicting opinions"
  },
  "links": {
    "computer": "https://www.techradar.com/news/best-business-desktop-pcs",
    "smartphones": "https://www.techradar.com/best/best-android-antivirus-app",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "The Register": "https://www.theregister.com/2021/03/03/eugene_kaspersky_post_covid_security_predictions/"
  }
}