{
  "source": "https://www.techradar.com/news/7-mortal-kombat-characters-we-want-to-see-in-a-potential-movie-sequel",
  "title": "7 Mortal Kombat characters we want to see in a potential movie sequel",
  "category": "entertainment",
  "updated": "2021-04-25T13:00:00Z",
  "author": "tom-power",
  "summary": "Select your Mortal Kombat character",
  "article": [
    "Spoilers follow for Mortal Kombat's 2021 movie and the video game series.",
    "Mortal Kombat has arrived in US theaters and on HBO Max. The latest movie adaptation of the iconic video game series is an average film at best but, if it does well enough, Warner Bros. could opt to greenlight a sequel or two.",
    "Sub-Zero actor Joe Taslim has already revealed that he could feature in four more Mortal Kombat movies if Warner Bros. press ahead with future instalments. Given that there's a sizable roster of Mortal Kombat characters these days, too, sequels wouldn't be struggling for new characters to introduce.",
    "We already know of one fan favorite who would appear if development on Mortal Kombat 2 is to begin, but what about other inclusions? Here are our picks for seven other characters, in no particular order, that we'd like to see make the cut in a Mortal Kombat sequel:",
    "Let's start off with a character who could be utilized in a very fun way.",
    "Originally a supposed glitch in the very first Mortal Kombat game - one that proved to be nothing more than a rumor - Ermac is a telekinetic ninja made up of the many souls destroyed by Outworld's wars.",
    "As someone who has joined forces with good and bad individuals in the games, Ermac would be an intriguing addition to the film series. Having someone who swaps their allegiances at the drop of a hat would add a new dimension to the battle between Raiden and Shang Tsung's forces, and potentially swing any contest in either side's favor.",
    "Ermac's inclusion could also be used in a joke capacity, too. In the movie, someone like Johnny Cage (more on him in a moment) could make a reference to the fact that Ermac is nothing more than a mythical being before Ermac eventually turns up. This would be a cheeky nod to his video game origins and would surely delight fans as a result.",
    "Yes, we'll be getting Johnny Cage in Mortal Kombat 2 (judging by the first movie's final scene) already, so introducing another Cage might be overkill.",
    "Cassie, though, could add a huge twist to whatever the sequel's plot would be. In the video game series, Cassie is the daughter of Johnny and Sonya Blade. While there are no hints towards Sonya having a child in the first movie, there is a way that a sequel could address this.",
    "As we know, Johnny Cage is living it up in Hollywood as an A-list actor (if that poster is anything to go by). It's possible that he's the sole custodian of Cassie and she ventured out west with him if Johnny and Sonya have split up in the movie universe.",
    "Alright, Sonya's backstory in the Mortal Kombat movie may not add up if she had a daughter. As she tells Cole, Sonya was an ex-soldier who served under Jax and she's spent years trying to work out what the dragon mark means.",
    "What if Johnny and Cassie were part of her life after leaving the military, though, and they left her because she became obsessed with working out what the mark means? She could have kept that part of herself secret from Cole and the others to save herself more heartbreak.",
    "Either way, it would be cool to see Cassie make an appearance. She wouldn't even need to be an adult in Mortal Kombat 2. She could be a child or even a teenager and, given that the Mortal Kombat game series has dabbled in time travel elements before, the movie series could do similar. We could get a time jump from Mortal Kombat 2 to Mortal Kombat 3 and, if a third instalment is ever greenlit, which would allow Cassie to be a grown-up with her own abilities.",
    "A character who made her debut in Mortal Kombat II, Kitana's potential appearance in a second Mortal Kombat movie would be an ironic but worthy nod to her gaming past.",
    "Another highly-skilled ninja assassin, Kitana would do two things for Mortal Kombat 2. First, she'd start to shift the cast away from its predominantly male lineup as there were only three female characters in the first film. And, second, she could be a love interest for Liu Kang, which would be another callback to her video game origins.",
    "Like Ermac, Kitana has ties to one of Mortal Kombat's big bads, so the pair's additions to Mortal Kombat 2's cast would make a second instalment even stronger through those connections. Who is this antagonistic figure we're referring to? Well, see our next pick below.",
    "Yep, Shao Khan is who we've been hinting at. Sure, adding him to Mortal Kombat 2's cast might be a bit premature, seeing as he's one of the most powerful villains in video game history, and might be better suited for later on.",
    "However, his role in proceedings wouldn't need to be extensive at this early stage. He could be used in a Thanos-like MCU role, with Shao Khan teased as the main villain that Raiden, Cole and Earth's other champions have to beat to ultimately save Earthworld in future films.",
    "A powerful tyrant who rules over Outworld, Shao Khan has a multitude of superpowers and various weapons with which to dispatch his enemies. He would be the Mortal Kombat movie series' final boss, so to speak, but there's no reason he couldn't be teased in a Mortal Kombat mid or post-credits scene. It would certainly get fans excited and hint at a bigger villain than Shang Tsung in the movie universe.",
    "If we're going for characters who are more grounded in their look and personality - think Sonya Blade - then Kurtis Stryker would be a solid inclusion.",
    "Seen as something of a joke figure when he made his debut in Mortal Kombat 3, Stryker has gone on to be something of a cult favorite among some fans. A police officer by trade, he uses guns, grenades and punches to defeat his foes, so he'd be an able replacement for Sonya Blade who - spoilers - had superpowers of her own by the end of the movie.",
    "Plus, Stryker is something of a smart-ass. Given that Kano is no more, we'll need someone to bring the quips alongside Johnny Cage.",
    "Mortal Kombat may have disappointed some fans regarding its plot, humor and/or source material homages, but it's done right by representing its characters as they're depicted in the video games.",
    "Unlike the 1995 movie adaptation, there's no whitewashing of characters, such as Raiden – in the 2021 film as the cast is as representative as it comes. If Mortal Kombat 2 wants to continue its diversity push, it need look no further than Nightwolf.",
    "One of the most high profile Native American video game characters of all-time, Nightwolf would be a solid addition to a sequel. He's not overpowered by any means, but he has a wide range of weapons and abilities that would be of use to Earth's champions. What's more, he can channel his aura into producing an energy shield around himself and allies - a defensive maneuver that would come in handy for Cole and the others.",
    "It's a daft name for a character (one based on Mortal Kombat creators Ed Boon and John Tobias) but Noob Saibot has already appeared in the Mortal Kombat movie. Yes, you read that right.",
    "Noob Saibot is Sub-Zero, except now he's a wraith instead of an icy assassin. In the games, Sub-Zero is killed by his adversary Scorpion and his soul descends to the fifth plane of the Netherrealm. There, the necromancer Quan Chi resurrects him as Noob Saibot, a living embodiment of evil that has been stripped of everything that made him human.",
    "As we see in the Mortal Kombat movie, Sub-Zero seemingly dies after Scorpion exacts revenge on Sub-Zero for killing Scorpion's wife and son. The last time we see Sub-Zero is when Shang Tsung is whisking him back to Outworld, so we don't actually know if he's dead.",
    "If Sub-Zero has died, it's possible that Shang Tsung will resurrect him - using Quan Chi or performing the task himself - as Noob Saibot. It would probably be a good idea to change his name so as not to confuse audiences, but Sub-Zero's resurrection would reignite his and Scorpion's feud in Mortal Kombat 2. He'd be devoid of his ice-based powers, but his shadow and phantom abilities would make up for that loss."
  ],
  "headers": {
    "4": "Ermac",
    "8": "Cassie Cage",
    "14": "Kitana",
    "17": "Shao Khan",
    "20": "Kurtis Stryker",
    "23": "Nightwolf",
    "26": "Noob Saibot"
  },
  "links": {
    "Mortal Kombat": "https://www.techradar.com/news/how-to-watch-mortal-kombat-online-see-where-to-stream-new-movie",
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-4338946927473150000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2F7-mortal-kombat-characters-we-want-to-see-in-a-potential-movie-sequel",
    "four more Mortal Kombat movies": "https://www.techradar.com/news/mortal-kombat-may-get-a-sequel-but-what-does-it-depend-on",
    "one fan favorite": "https://www.techradar.com/news/mortal-kombat-ending-explained-who-is-cole-young"
  }
}