{
  "source": "https://www.techradar.com/news/gearbox-software-president-steps-down-to-focus-on-borderlands-films-and-tv-shows",
  "title": "Gearbox Software President steps down to focus on Borderlands films and TV shows",
  "category": "gaming",
  "updated": "2021-10-07T11:25:05Z",
  "author": "vic-hood",
  "summary": "Opinion: Is Gearbox counting its chickens before they've hatched?",
  "article": [
    "Randy Pitchford, President of Borderlands developer Gearbox Software, has stepped down from his role and will instead head up the newly-formed Gearbox Studios, focusing on TV and film.",
    "Pitchford remains CEO and President of parent company Gearbox Entertainment, but will now act as the President of Gearbox Studios also, the studio working on the upcoming Borderlands film. Pitchford's role at Gearbox Software has been filled by former CTO Steve Jones.",
    "In a tweet announcing the leadership shuffle, Pitchford explained that he will be \"working to develop and grow\" Gearbox Studios but will also serve as a \"hybrid\" Chief Creative Officer, meaning he will still have creative input in all Gearbox projects.",
    "Gearbox Studios is currently working on its first big project, the star-studded Borderlands movie, which will feature Jamie-Lee Curtis, Jack Black, Kevin Hart and more famous voices. But, while the cast is exciting, I can't help but be concerned about whether Borderlands will become yet another poor video game-to-film adaptation.",
    "With Pitchford moving to head Gearbox's film and TV division, I can't help but feel the company is counting its chickens before they've hatched. Sure, Borderlands has been a successful game franchise but it's unclear right now whether that will translate to other media. Tiny Tina's Wonderlands, the spinoff game starring the likes of Andy Samberg and Wanda Sykes, is on the way but it arguably has seen less fanfare than main entries in the series.",
    "It's unclear whether Gearbox plans to release more Borderlands films, or maybe even a TV show or two, but until the release of the Borderlands movie, we won't be able to judge how well those projects would go down as adaptations. But who knows, Gearbox Studios may tap into other game franchises owned by the company including Brothers in Arms and Duke Nukem, rather than solely focusing on Borderlands.",
    "Maybe I'm being a bit cynical. The recent re-emergence of video game TV shows and films, such as the Sonic the Hedgehog movie and Castlevania TV show, has been received somewhat better than the adaptations of yore (I'm looking at you Super Mario Bros.). Maybe Gearbox Studios will surprise me and create a film franchise or TV series with longevity. But, what we know for sure is Randy Pitchford seems to have faith in the franchise's media expansion. Let's just hope it pays off."
  ],
  "headers": {
    "3": "Opinion: don't count your chickens..."
  },
  "links": {
    "Borderlands film": "https://www.techradar.com/news/borderlands-movie-cast-likely-release-date-and-what-we-know-so-far",
    "Tiny Tina's Wonderlands": "https://www.techradar.com/news/borderlands-tiny-tina-is-finally-getting-her-own-game-with-a-star-studded-cast"
  }
}