{
  "source": "https://www.techradar.com/news/the-next-realme-gt-model-could-be-a-true-samsung-galaxy-s22-and-xiaomi-12-rival",
  "title": "The next Realme GT model could be a true Samsung Galaxy S22 and Xiaomi 12 rival",
  "category": "phones",
  "updated": "2021-10-14T14:50:16Z",
  "author": "tom-bedford",
  "summary": "A super-premium Realme phone",
  "article": [
    "Realme is pulling a Xiaomi: after brewing up a storm in the mid-range Android phone market with its fantastic Realme GT, the company is apparently making the jump to the top-end market in 2022.",
    "In an interview with GSMArena, Realme CEO Madhav Sheth apparently said that the company is planning an \"ultra-premium flagship\" phone which will join the GT series.",
    "It's not clear how Sheth would define 'ultra-premium', as while we'd typically consider that a super-pricey phone like the Xiaomi Mi 11 Ultra, iPhone 13 Pro Max or Samsung Galaxy S21 Ultra, the company might define it differently - instead, this mystery upcoming Realme phone could be a Samsung Galaxy S22 or Xiaomi 12 rival.",
    "All Realme's current phones are budget or mid-rangers, so it would be quite a jump for the company to release a super-premium phone - that's why we think this is more likely a rival to Samsung or Xiaomi's anticipated mainstream flagships.",
    "Those two phones are expected to launch in the first few months of 2022 - that's a window when we normally see lots of big new phones announced, so a Realme GT 2 or GT Pro would fit right in, though GSMArena doesn't quote Sheth on giving a particular release plan.",
    "In addition, Sheth mentioned that Realme is looking to use 125W chargers in more phones in 2022, something he previously told TechRadar, though there's no indication that this will be used in the upcoming Realme GT phone.",
    "Details are light on this upcoming Realme phone, but take this information with a pinch of salt for now; while this is official confirmation from the company, we've previously been given this kind of access from Realme on an upcoming phone only for the device to never materialize. We'll have to see what launches before we can say anything for sure.",
    "No smartphone company holds the crown of 'mid-range champion' for long, as it seems that each brand holds the title for a short time before forgetting these roots and trying to win big.",
    "We saw this happen with OnePlus and Xiaomi in the past few years, as for a time each brand ruled the mid-range market - until their devices escalated in price to become premium handsets. Now, the OnePlus 9 and Xiaomi Mi 11 are decidedly top-end phones.",
    "Even though OnePlus and Xiaomi still have mid-range phones coming out, they're not as competitively spec'd or priced as their forebears. That's what let Realme get a foothold in the mid-range market in the last year.",
    "The difference between OnePlus and Xiaomi, and Realme, is that the former two held the mid-range market for some time before jumping up. Realme's still a relative newcomer to the west, and wasn't a huge presence in the phone market before its eye-catching Realme GT.",
    "OnePlus and Xiaomi successfully stuck the landing when they started making premium devices, but Realme might not have the legacy or stopping power to do so.",
    "So for now, we'd like to see Realme continue to focus on the mid-range market and become a bigger player there, because at the moment while the Realme GT is arguably the best mid-range smartphone, casual buyers still aren't familiar with the brand's name as much.",
    "Then, when Realme becomes a household name as much as Huawei or Xiaomi, then perhaps it should consider top-end phones more."
  ],
  "headers": {
    "7": "Analysis: don't forget where you came from"
  },
  "links": {
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "GSMArena": "https://www.gsmarena.com/realme_125w_ultradart_charging_smartphone_launch_date-news-51404.php",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "kind of access from Realme on an upcoming phone": "https://www.techradar.com/news/exclusive-realme-is-ending-one-of-its-phone-lines-and-for-an-exciting-reason",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review"
  }
}