{
  "source": "https://www.techradar.com/news/beware-the-low-cost-proxy",
  "title": "Beware the low-cost proxy",
  "category": "computing",
  "updated": "2021-07-07T13:43:21Z",
  "author": "vaidotas-sedys",
  "summary": "Selecting the wrong proxy provider can be disastrous for businesses",
  "article": [
    "In the last few years, residential proxy networks have become an essential tool for business operations across many sectors. However, I will not be telling you about all the benefits of this practice. There are plenty of articles for that. Here you will learn how to protect your company from the harm that comes with irresponsible proxy selection. In particular, I will discuss the consequences of using unethical or even illegal residential proxy networks. I understand that data acquisition operations are complex enough considering the issues that might arise with speed, stability, and quality assurance. So, the least thing you want to worry about is the legal and ethical aspects of your residential proxy provider - rails that feed data into your infrastructure. And, in fact, some companies don't worry about it at all until it’s too late.",
    "Let’s make sure that you never arrive at the “too late” stage. After reading this article you will know how to approach ethical issues of residential proxy acquisition, identify the risks associated with them and successfully avert them.",
    "A residential proxy network is a service that can be misused by dishonest players in the web scraping space. The ethical consequences can be severe because residential proxies are the only proxy type directly linked to the devices of actual people. This is how it works. Each proxy has a unique IP address. These IP addresses can come from users who download applications to their devices that turn them into unknowing participants of a proxy network. That participation is not always voluntary because some users are tricked into installing malicious apps to their phones with complex or confusing terms of service. People install these apps because they are presented as having a completely different function, such as a sudoku game, weather forecast or random video streaming app. They are not aware that the app has a secondary purpose of connecting the device to the proxy network. A problem arises when companies start using proxies that come from users who have never consciously consented to join the network. Not only does this practice reduce trust across the entire industry, but it also brings grave risks for companies themselves.",
    "Methods for obtaining proxies can be factored into a four-level tier system. High-tier proxies rely on full cooperation and awareness from users, while tier B proxies are obtained from users who may not truly understand the purpose for which they agree their device to be used for. At the bottom of the list is tier C, where malware automatically connects users to the proxy network without their permission or awareness.",
    "Besides violating user privacy and consuming their device resources, the use of unethically sourced proxies carries many risks.",
    "The residential proxy industry throughout the years had its fair share of scandals, ranging from DDoS attacks, battles between scrapers and their targets to leaked databases of proxy service providers. These leaks are a serious concern because they can expose client lists. If you are keeping an eye on the media, you will notice how often this is happening. And when your brand gets associated with unethical or illegal activities of your provider, the effects can be devastating. It comes to the conclusion that the irresponsible choice of a residential proxy supplier threatens your brand image, reputation, and even security. And it is not limited to proxy supply. Think of the scandals companies like Apple have to go through when information about human rights violations, environmental, and ethical issues in their outsourced global supply chains get to the media.",
    "Usually, these companies are not aware of ethical issues with their provider or choose to ignore their scandals. Either way, in the eyes of the public and the market - ignorance is not an excuse.",
    "The use of unethical proxies carries a range of dangers that can harm your company on multiple levels.",
    "Reputational damage As described above, companies engaged in corrupt data scraping practices can suffer irreparable damage to their brand and public perception from association with an unethical provider.",
    "Consumers are becoming increasingly aware of issues concerning data use. Businesses connected to companies that engage in data-based cybercrime can suffer permanent damage in the form of lost sales, clients, and partnerships.",
    "Data breach Data fuels the internet and hackers are always looking for opportunities to get their hands on it.",
    "Low-quality proxies are particularly exposed to malicious actors, who can target unaware proxy users and access the information to their internet traffic. In case of a “Man In The Middle” attack, companies can experience security breaches and leak sensitive information.",
    "Legal issues The use of unethically sourced proxies through illegal botnets can lead to extended legal issues, particularly in the case of class-action lawsuits. Should your company be found responsible for damages connected to those claims, you may be subjected to litigation and expensive legal fees.",
    "Financial damages Using an unethical proxy provider can lead to more than just legal issues and class-action lawsuits. Companies found liable for damages connected to the use of an unethical proxy network can face fines that have serious financial consequences.",
    "Unstable web scraping operations On top of everything else, questionable origin proxies could compromise your business operations due to their instability, increased time-outs, and sensitivity to server bans.",
    "This can result in poorly executed web scraping operations that require increased time and resources to fix - often leading to additional costs in the long run.",
    "Along with increased operational costs, stalled data extraction efforts caused by poorly performing proxies can compromise service agreements and harm client relationships.",
    "With so many proxy providers on the market, I understand that it can be a challenge to source only the best quality, most ethical proxies. Following the tier system can be a great guide towards educated businesses choices.",
    "Other considerations to keep in mind when choosing a proxy provider can include making sure the company has strong ethical policies in addition to using comprehensive Know Your Customer (KYC) procedures when vetting suppliers.",
    "Check if the company is not only talking the talk but also walking the walk. Make sure to look into their media footprint, social proof, case studies, independent research or even previous scandals.",
    "I believe that ethical residential proxy procurement benefits users, data providers and the overall industry. Not only does it contribute to a more ethical cyber environment, it also empowers companies to evolve, innovate, and thrive to its fullest potential."
  ],
  "headers": {
    "2": "Corrupt practices",
    "3": "Categories of residential proxy acquisition",
    "5": "Suppliers and your reputation",
    "7": "Risks of using unethical proxies",
    "17": "How to choose the right proxy provider"
  },
  "links": {
    "proxy": "https://www.techradar.com/best/proxies"
  }
}