{
  "source": "https://www.techradar.com/news/amazon-prime-videos-the-boys-spin-off-is-close-to-reality",
  "title": "Amazon Prime Video's The Boys spin-off is close to reality",
  "category": "entertainment",
  "updated": "2021-03-12T10:51:27Z",
  "author": "samuel-roberts",
  "summary": "It's about college superheroes",
  "article": [
    "The Boys season 3 might've already begun filming, but Amazon is about to push the button on making a full series of a new spin-off show, a report suggests.",
    "Variety says the spin-off show, which is about an American college ran by Vought International – the shady company behind The Seven and other superpowered beings in the show – is nearing a series order. The show has added the actresses Jaz Sinclair and Lizze Broadway to its cast, too, with Broadway playing a young superhero named Emma.",
    "The show will apparently be R-rated and just as in-your-face as The Boys series itself. It'll see \"hormonal, competitive Supes\" push the different boundaries of their abilities – and their morality. The show was previously revealed back in September, but now it's accelerated through the development phase, and it seems likely Amazon is going to just make it.",
    "It's no surprise that Amazon Prime Video wants to expand on The Boys. Its second season was the streamer's most-watched TV show launch to date – and this series will feature the same creative team as the main show, including creator Eric Kripke and executive producers Seth Rogen and Evan Goldberg. Writer Craig Rosenberg is behind this spin-off, which doesn't seem to have a name yet.",
    "Don't expect this show to land on Amazon Prime Video any time this year, then, but Amazon could eventually get to the point where it's rolling out two The Boys series a year.",
    "Amazon Prime Video makes plenty of originals that aren't based on books, comics or other properties – but in recent years, its biggest moves have been around recognizable pop culture series. The Lord of the Rings TV show is expected to release this year, while Amazon is also working on a Fallout series with the creators of Westworld.",
    "This is just part of what we've come to expect during the streaming wars: it's why Disney Plus is making 11 Star Wars TV shows and 10 Marvel series, or why Peacock in the US revived Saved By the Bell, and is planning a new version of Battlestar Galactica. If audiences recognize the new thing you're selling, it's more likely to get attention.",
    "Amazon is doubling down on The Boys for much the same reason: it's a comic book-based series it has that no one else does. A whole universe of The Boys shows doesn't seem out of the question to us, and this spin-off is the first step towards that."
  ],
  "headers": {
    "5": "Amazon builds its own franchises"
  },
  "links": {
    "The Boys season 3": "https://www.techradar.com/news/the-boys-season-3",
    "Variety": "https://www.techradar.com/news/the-boys-season-3",
    "previously revealed back in September": "https://www.techradar.com/news/a-spin-off-from-the-boys-is-already-in-development",
    "The Lord of the Rings TV show": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "Fallout series": "https://www.techradar.com/news/fallout-tv-show-on-amazon-prime-trailer-release-date-predictions-and-what-we-know",
    "11 Star Wars TV shows and 10 Marvel series": "https://www.techradar.com/news/disney-plus-confirms-its-making-10-marvel-and-10-star-wars-tv-shows"
  }
}