{
  "source": "https://www.techradar.com/news/grab-the-lo-and-sons-hanover-deluxe-2-for-30-off-and-keep-that-new-laptop-safe",
  "title": "Grab the Lo & Sons Hanover Deluxe 2 for 30% off and keep that new laptop safe",
  "category": "computing",
  "updated": "2021-11-26T09:21:04Z",
  "author": "john-loeffler",
  "summary": "Save big on one of the best backpacks around",
  "article": [
    "Grab one of the best backpacks around with this Black Friday deal on the Lo & Sons Hanover Deluxe 2 for $173.60, a 30% discount on a seriously premium item.",
    "While it sports a very minimalist design, don't let that fool you – the Lo & Sons Hanover Deluxe 2 is more than capable of securing your essential tech on a lengthy commute or just down the block to the coffee shop. Normally retailing for a pricey $248, seeing this backpack getting a hefty discount makes it one of the best Black Friday deals we've seen so far.",
    "(Not in the US? Scroll down for deals in your region).",
    "The Lo & Sons Hanover Deluxe 2 backpack helped us carry around a bunch of laptops over the last few weeks with remarkable ease. The biggest knock against it is its pretty steep price, but with a $74.40 discount, this phenomenal backpack is even better.",
    "Right now, only the deep navy version is in stock and we're not sure if the black version will also get a price cut for Black Friday – assuming it comes back in stock at some point today – but this one is likely to sell out quick.",
    "If you're looking for a classy-looking and well-crafted backpack for a bargain, we'd move on this one rather than wait too long.",
    "No matter where you live, you'll find all the lowest prices for the Lo & Sons Hanover Deluxe 2 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Lo & Sons Hanover Deluxe 2 Black Friday deal",
    "6": "More Lo & Sons Hanover Deluxe 2 deals",
    "7": "More Black Friday deals in the US"
  },
  "links": {
    "best backpacks": "https://www.techradar.com/news/best-backpack",
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Lo & Sons Hanover Deluxe 2 for $173.60": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1272311014203636200&xs=1&url=https%3A%2F%2Fwww.loandsons.com%2Fcollections%2Fsale%2Fproducts%2Fhanover-deluxe-2-600d-recycled-poly-deep-navy&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fgrab-the-lo-and-sons-hanover-deluxe-2-for-30-off-and-keep-that-new-laptop-safe",
    "Lo & Sons Hanover Deluxe 2": "https://www.techradar.com/reviews/lo-and-sons-hanover-deluxe-2"
  }
}