{
  "source": "https://www.techradar.com/news/this-free-microsoft-office-alternative-just-received-a-bumper-upgrade",
  "title": "This free Microsoft Office alternative just received a bumper upgrade",
  "category": "computing",
  "updated": "2021-07-16T14:09:42Z",
  "author": "mayank-sharma",
  "summary": "LibreOffice can handle Office documents with a lot more ease",
  "article": [
    "The Document Foundation has isued the first release candidate (RC1) of the upcoming LibreOffice 7.2, which includes a lot of work to improve the open source office suite’s compatibility with Microsoft Office.",
    "Parsing through the release notes, The Register noticed that the major changes in this release are the dozens of fixes and improvements to the open source office suite’s ability to import and export documents in Microsoft Office’s proprietary formats.",
    "In addition to improving the filters for handling proprietary document formats such as DOCX, XLSX, PPTX, the release of the popular Microsoft Office alternative also adds support for importing files in the Windows-only image formats, namely WMF and EMF.",
    "Several of the features in the extensive release notes, The Register notes that most new ones are small tweaks and bug fixes.",
    "Several however have been the result of collaboration between various commercial entities that make up the LibreOffice ecosystem.",
    "For instance, the feature to create multi-column layout in text boxes, which debuts in this release was developed jointly by SUSE and Collabora, both of whom also work together to offer commercial support services around the office suite.",
    "Another big new feature in the release is meant for the LibreOffice development community and comes in the form of a developer tool panel for inspecting Universal Network Objects (UNO).",
    "UNO is LibreOffice’s component model, and reportedly performs a similar function as that of the Components Object Model (COM) in Microsoft Office.",
    "The feature is the result of the work by Collabora developers in response to a tender issued by LibreOffice last year.",
    "Via The Register"
  ],
  "headers": {
    "3": "Numero Uno"
  },
  "links": {
    "LibreOffice": "https://www.techradar.com/reviews/libreoffice-7",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Microsoft Office": "https://www.techradar.com/news/buy-microsoft-office-prices",
    "release notes": "https://wiki.documentfoundation.org/ReleaseNotes/7.2",
    "open source office suite": "https://www.techradar.com/best/free-office-software",
    "Microsoft Office alternative": "https://www.techradar.com/news/best-microsoft-office-alternative",
    "The Register": "https://www.theregister.com/2021/07/15/libreoffice_72_release_candidate/"
  }
}