{
  "source": "https://www.techradar.com/news/insta360-teases-launch-of-what-could-be-the-worlds-smallest-action-cam",
  "title": "Insta360 teases launch of what could be the world's smallest action cam",
  "category": "cameras",
  "updated": "2021-03-02T10:08:41Z",
  "author": "mark-wilson",
  "summary": "Impressively small, but potentially very easy to lose",
  "article": [
    "Insta360 has just teased the launch of its next camera – and from the early footage, it looks like it could be one of the smallest vlogging cams we've seen so far.",
    "The launch photo (above) shows a camera that appears to be no larger than a small coin. And on the same page, Insta360 says that the camera will be launching on March 9.",
    "Even more intriguing is the teaser video (below), which reveals the kind of footage you can expect to shoot with Insta360's new camera – very wide-angle videos from tight spaces that look ideal for creating compelling cut scenes for your YouTube channel.",
    "It's not clear whether the promo footage was shot with another accessory like an equally small gimbal, but it wouldn't be a surprise if Insta360 went this route – previous cameras like the Insta360 One X2 have come with fancy add-ons, like a 'Bullet Time' cord for swinging the 360 camera around your head.",
    "So what could the new camera be? There have been no other leaks yet, but it appears to have most in common with the Insta360 Go – a camera that arrived in 2019 with claims of being the 'world's smallest stabilized camera'.",
    "That model, which came with Insta360's FlowState stabilization, weighed just 18.3g, but this new camera looks like it could potentially break that record.",
    "Insta360 has steadily built a name for itself as a compelling GoPro alternative, particularly for those who want to create videos that contain special 'trick shots' or from unique angles.",
    "While it dominates our list of the best 360 cameras, not all of Insta360's cameras shoot the entire scene around you – for example, we recently reviewed the Insta360 One R 1-Inch edition, which is more of a traditional action camera with a large sensor.",
    "That said, the One R does also have a modular design that lets you swap in a 360-degree module, if you fancy capturing all of the action around you and choosing which parts to edit into a traditional 'flat' video later.",
    "If this new Insta360 camera is indeed a successor to the Insta360 Go, though, then it'll likely be a more traditional wide-angle action cam that can go pretty anywhere and can shoot things like hyperlapses and barrel rolls through extremely tight spaces. We're looking forward to finding out for sure on March 9."
  ],
  "headers": {
    "6": "Trick shots"
  },
  "links": {
    "teaser video": "https://www.youtube.com/watch?v=e6Vb2U8F94g&feature=youtu.be",
    "Insta360 One X2": "https://www.techradar.com/reviews/insta360-one-x2",
    "Insta360 Go": "https://www.techradar.com/news/the-insta360-go-is-the-worlds-smallest-stabilized-camera",
    "best 360 cameras": "https://www.techradar.com/news/best-360-degree-camera",
    "Insta360 One R 1-Inch edition": "https://www.techradar.com/reviews/insta360-one-r-1-inch-edition"
  }
}