{
  "source": "https://www.techradar.com/news/cyberpunk-2077-meets-super-mario-bros-in-this-amazing-mash-up-trailer",
  "title": "Cyberpunk 2077 meets the Super Mario Bros movie in amazing mash-up trailer",
  "category": "gaming",
  "updated": "2021-01-18T10:49:35Z",
  "author": "gerald-lynch",
  "summary": "Mash-up trailer is far, far better than it has any right to be",
  "article": [
    "Sometimes, 2 + 2 can equal 5, when the sum of the parts of two things come together to be greater than their individual components. Such is this magical mash-up between Cyberpunk 2077’s trailer, and the 1993 Super Mario Bros. film.",
    "Put together by Twitter user @Mangerive, it takes the audio from the debut Cyberpunk 2077 trailer, and cuts it with clips from the bizarre Super Mario Bros. film.",
    "And you know what? It works really, really well. There’s no pretending the Mario Bros. film is anything but a mess. Its dark sci-fi stylings were totally at odds with not only the source material of the series, but also the kid-friendly film it was supposed to be.",
    "But it does highlight that, aside from the narrative trappings that cause it to stumble, it had some fantastic set design and set pieces, and an aesthetic that leans quite heavily into cyberpunk tropes – something likely lost on the majority of teeny viewers just wanting to see a mushroom-headed Toad, rather than a Stalinist apocalypse take on the Mushroom Kingdom.",
    "There’s more in common between Cyberpunk 2077 and the 1990s Super Mario Bros movie than there might first appear to be. As I wrote many moons ago for the excellent Gizmodo, the Super Mario Bros. film had an equally-troubled development. Rather than the blue skies of the Mushroom Kingdom, as an early script described, a directorial change saw the film put into the hands of Max Headroom creators Rocky Morton and Annabel Jankel.",
    "Despite a relatively big budget and Hollywood names like Dennis Hopper and Bob Hoskins starring in it, the film turned into a dystopian disaster. The late Bob Hoskins, who got through the film by drinking heavily between takes, eventually branded the shoot his worst job, biggest career disappointment and the only thing he'd change about his past.",
    "Still, there’s hope for redemption for both Cyberpunk 2077 and the Super Mario Bros.' silver screen appearances. Cyberpunk 2077 developers CD Projekt Red have committed to months of fixes and patches for the game, while the Mario Brothers are returning to cinemas, not as a live action adventure, but as a CGI flick in development at Illumination Entertainment, the brains behind the Despicable Me and Minions franchises."
  ],
  "headers": {
    "4": "Cyber similarities"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "@Mangerive": "https://twitter.com/Mangerive/status/1350869449558142977",
    "As I wrote many moons ago": "https://gizmodo.com/the-ugly-behind-the-scenes-history-of-video-game-movies-1520529642",
    "CD Projekt Red have committed to months of fixes": "https://www.techradar.com/news/cyberpunk-2077-apology-promises-fixes-for-the-ps4-and-xbox-one-versions",
    "Mario Brothers are returning to cinemas": "https://www.techradar.com/news/new-super-mario-bros-movie-planned-for-2022-and-miyamoto-is-involved"
  }
}