{
  "source": "https://www.techradar.com/news/by-the-power-of-greyskull-netflixs-masters-of-the-universe-looks-amazing",
  "title": "By the power of Greyskull, Netflix’s Masters of the Universe looks amazing",
  "category": "entertainment",
  "updated": "2021-06-15T11:40:49Z",
  "author": "stephen-lambrechts",
  "summary": "First teaser also offers a release date",
  "article": [
    "Many of us who came of age in the 1980s will have fond memories of He-Man and the Masters of the Universe, a Saturday morning cartoon slash glorified-action-figure-commercial which followed the battle between our hero He-Man and his arch-nemesis Skeletor for the fate of the planet Eternia.",
    "Several reboots have attempted to bring He-Man back over the years, and Netflix is the latest to try its hand with Masters of the Universe: Revelation, a new animated series created by none other than cult director Kevin Smith (Clerks, Mallrats).",
    "If you had any reservations about 'Silent Bob' leading the charge to bring He-Man back to our screens, you can officially rest easy – the show's first teaser has arrived and it seems like Smith and Co. have absolutely nailed the spirit of Masters of the Universe.",
    "Brought to life by Powerhouse Animation Studios (Castlevania, Blood of Zeus), Masters of the Universe: Revelation delivers a perfect evolution of the original show's art style without impacting its iconic designs and color palette.",
    "If there's one change we're glad to see, its that Prince Adam now has a much slighter build, making his transformation into He-Man feel more significant than ever before.",
    "To top it all off, Masters of the Universe: Revelation has assembled a fantastic voice cast, with Chris Wood (Supergirl) playing He-Man, Diedrich Bader (Harley Quinn) as Trap-Jaw, Kevin Conroy (Batman: The Animated Series) as Mer-Man, Liam Cunningham (Game of Thrones) as Man-At-Arms, Sarah Michelle Gellar (Buffy the Vampire Slayer) as Teela and Mark Hamill (Star Wars) as Skeletor.",
    "The first part of Masters of the Universe: Revelation will arrive on Netflix on July 23. Until then, you can kill some time by raising your Power Sword to the sky and yelling \"I have the power!\""
  ],
  "headers": {
    "3": "Why we're excited about Masters of the Universe: Revelation"
  },
  "links": {}
}