{
  "source": "https://www.techradar.com/news/google-workspace-update-now-lets-you-block-off-calendar-time-to-focus",
  "title": "Google Calendar now lets you block out meeting invites for good",
  "category": "computing",
  "updated": "2021-10-21T14:55:30Z",
  "author": "mike-moore",
  "summary": "Focus time lets Google Calendar help you avoid meeting overload",
  "article": [
    "Seeing your calendar swamped by meetings should soon be a thing of the past thanks to a new Google Workspace update.",
    "The online collaboration suite is introducing a new \"Focus time\" feature in Google Calendar that will allow users to block out periods of time where they can avoid meetings and get their heads down for actual work.",
    "Most importantly, setting such a marker in your Google Calendar will also allow you to automatically decline meetings, meaning no last-minute rush to finish off work or cross off your to do list.",
    "Focus time will be included as a new entry type for Google Calendar, similar to when setting an event or Out of Office marker, giving your co-workers a clear indication that you need some time to concentrate and get some work done.",
    "The ability to automatically decline meetings is unticked as a default, so you'll need to make sure it's selected if you truly want some peace.",
    "When finalized, the blocked-out time will appear in your Google Calendar with a headphones icon included, showing your contacts exactly how long you need to focus for. Users can alos set a new color for Focus time blocks in order to have a different visibility from your events and other meetings, and any scheduled focus time will also be tracked in your Time Insights.",
    "\"With the changes to our working environments in the past year, having more chats and meetings make it more difficult for people to carve out time for their core individual work,\" Google noted in a blog post announcing the update. \"With the new focus time feature, we hope to make it easier to create dedicated time for thinking and core work.\"",
    "The feature is rolling out to most Google Workspace users now, and should be arriving to Google Workspace Business Standard, Business Plus, Enterprise Standard, Enterprise Plus, Education Fundamentals, Education Teaching & Learning Upgrade, Education Standard, Education Plus, and Nonprofits customers by the end of October 2021.",
    "However it won't be available to Google Workspace Essentials, Business Starter, Enterprise Essentials, and Frontline and as well as G Suite Basic and Business customers.",
    "The launch is the latest in a list of Google Calendar features as the company looks to help workers re-adjust to office life.",
    "It recently announced an integration with Google Chat that will mean calendar markers now give users the option to quickly message other attendees in the run-up to a meeting, provided they work for the same organization.",
    "You can also check out our pick of the best hybrid working tech - everything you need for the return to the office."
  ],
  "headers": {
    "3": "Focus time"
  },
  "links": {
    "calendar": "https://www.techradar.com/best/best-calendar-apps",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "to do list": "https://www.techradar.com/best/best-to-do-list-apps",
    "blog post": "https://workspaceupdates.googleblog.com/2021/10/set-aside-time-for-focus-in-google.html",
    "Google Calendar features": "https://www.techradar.com/news/google-calendar-update-will-help-you-clear-up-that-mess-you-call-an-inbox",
    "Google Chat": "https://www.techradar.com/reviews/google-chat",
    "best hybrid working tech": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}