{
  "source": "https://www.techradar.com/news/microsoft-teams-is-getting-this-vital-security-tool-at-last",
  "title": "Microsoft Teams is getting this vital security tool at last",
  "category": "computing",
  "updated": "2021-06-03T09:25:17Z",
  "author": "mike-moore",
  "summary": "End-to-end encryption means safer calls for Microsoft Teams",
  "article": [
    "Using Microsoft Teams is set to be more secure than ever after the company revealed news of a major security upgrade.",
    "As spotted by MSPowerUser, the video conferencing service will now support end-to-end encryption (E2EE), meaning users can share private information such as proprietary or valuable business data on calls without fear of this being intercepted.",
    "Using E2EE means that data created within Microsoft Teams is encrypted at the point it originates before being decrypted at its destination, without any interference within these two points by any other systems.",
    "Microsoft first announced that E2EE would be coming to Teams back in March 2021 at its Igntie conference, with the feature now apparently finally ready to roll out.",
    "It will initially be supported on one-to-one voice calls in Teams, with both users needing to turn on the feature (which will be switched off by default) in order to activate.",
    "Turning on E2EE will mean some Microsoft Teams features won't be available, includes recording the call, with transcription tools also not on offer. Microsoft adds that IT teams will have full control on who can use E2EE within a business, with admins able to cretae new policies to ensure company data is protected.",
    "End-to-end encryption on Micorosft Teams will start rolling out to desktop and mobile users alike in July 2021.",
    "The launch follows a similar move from rival video conferencing service Zoom, which suffered an embarassing incident last year when it emerged that claims it offered full E2EE were unfounded. After acquiring specialist firm Keybase and bringing on a dedicated team of developers, Zoom eventually implemented E2EE protection six months later.",
    "Back at Microsoft Ignite, the company also announced meeting controls to protect against gatecrashers, as well as a disable video function that should help to limit potential disruptions.",
    "Multigeo support, meanwhile, will allow businesses that operate in multiple territories to have greater visibility and control over the location of the data centers holding their data, which Microsoft says will help them guarantee compliance with data protection regulations.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "E2EE on Teams"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "E2EE would be coming to Teams": "https://www.techradar.com/news/microsoft-teams-is-finally-getting-end-to-end-encryption-and-bunch-of-other-security-upgrades",
    "Zoom": "https://www.techradar.com/news/microsoft-teams-is-finally-getting-end-to-end-encryption-and-bunch-of-other-security-upgrades",
    "it offered full E2EE": "https://www.techradar.com/news/zoom-calls-are-not-end-to-end-encrypted-even-though-it-says-they-are",
    "MSPowerUser": "https://mspoweruser.com/end-to-end-encryption-is-coming-to-microsoft-teams-calls-soon/"
  }
}