{
  "source": "https://www.techradar.com/news/one-of-the-best-prime-day-laptop-deals-is-still-live-but-its-selling-out-fast",
  "title": "One of the best Prime Day laptop deals is back from the dead – but for how long?",
  "category": "computing",
  "updated": "2021-12-03T08:15:36.538Z",
  "author": "matt-hanson",
  "summary": "Prime Day has some awesome laptop deals but many have sold out",
  "article": [
    "This year has seen some of the best Prime Day deals for laptops we've ever seen, and while quite a few of them have now sold out, one of the best Prime Day laptop deals is still live, offering the excellent Samsung Galaxy Book Flex for just £750.",
    "Not in the UK? Scroll down for Samsung Galaxy Book Flex deals in your region.",
    "In fact, this deal did go out of stock earlier today. We thought that was that, after all, this is a brilliant £600 saving off Samsung's great 2-in-1 laptop, and with a price cut like that, it's no surprise it's out of stock.",
    "Usually selling for £1,349, this price cut means it's one of the best value laptops you can buy today.",
    "However, we've checked and the deal is now back in stock! We're not sure if it going out of stock was a glitch, or Amazon just found a load more Galaxy Book Flex units lying around behind some boxes. Either way, the deal is live, and you don't want to miss it.",
    "Make sure you check out our best laptop Prime Day deals page as well for more great offers.",
    "This is an amazing laptop deal for anyone looking for a fast and powerful laptop, that can also double as a tablet-like touchscreen device. You can use a stylus to create notes or draw on the screen, and the Core i5 processor and 8GB of RAM means Windows 10, and any app you install, will run brilliantly. For this price, this is an amazing laptop.",
    "No matter where you live, you'll find all the lowest prices for the Samsung Galaxy Book Flex from around the web right here, with offers available in your region."
  ],
  "headers": {
    "6": "Today's best Samsung Galaxy Book Flex deals on Prime Day",
    "7": "More Samsung Galaxy Book Flex deals",
    "8": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Samsung Galaxy Book Flex for just £750": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB088KLXG55%2Fref%3Dredir_mobile_desktop%3F_encoding%3DUTF8%26aaxitk%3D021117fb2f0ac16dabb99379692dd0e1%26hsa_cr_id%3D1081859560602%26pd_rd_plhdr%3Dt%26pd_rd_r%3D7337b87a-3e71-40cc-812c-1869edc9b764%26pd_rd_w%3D7uOoS%26pd_rd_wg%3DFn8u3%26ref_%3Dsbx_be_s_sparkle_mcd_asin_2_badge%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1119723033232232200-21",
    "laptop Prime Day deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-laptop-deals"
  }
}