{
  "source": "https://www.techradar.com/news/gotham-knights-has-been-delayed",
  "title": "Gotham Knights has been delayed",
  "category": "gaming",
  "updated": "2021-03-19T16:20:24Z",
  "author": "vic-hood",
  "summary": "We won't get our hands on Gotham Knights this year",
  "article": [
    "Gotham Knights has been delayed until 2022 to give developer Warner Bros. Montréal extra time to polish the game before release.",
    "The delay was announced on the official Gotham Knights Twitter page, with Warner Bros. revealing that the upcoming action RPG will now launch worldwide in 2022 rather than in its initial 2021 release window.",
    "\"We are giving the game more time to deliver the best possible experience for players,\" the statement reads. \"Thank you to our amazing fans for your tremendous support of Gotham Knights. We look forward to showcasing more of the game in the coming months.\"",
    "Gotham Knights is an upcoming open-world action RPG set in what is described as the \"most dynamic and interactive Gotham City yet\". Players will patrol the five different boroughs, facing off against the Caped Crusader's rogue gallery and widespread criminal activity, in either solo or two-player co-op.",
    "Whereas the upcoming Suicide Squad: Kill the Justice League from Rocksteady is set in the same Arkham-verse as its predecessors, Gotham Knights takes place in an entirely new universe that does not connect to any of Warner Bros. past titles.",
    "While disappointing, it's not a huge surprise that Warner Bros. has decided to delay Gotham Knights. We've already seen a plethora of games being delayed this past year, including Returnal, Outriders, Deathloop, Far Cry 6, The Lord of the Rings: Gollum and Kena: bridge of Spirits.",
    "While many of these games have likely been delayed due to logistical issues caused by the Covid-19 pandemic, it's also possible that, following the rocky launch of Cyberpunk 2077, studios may be taking more time to fine-tune their big releases.",
    "It means that we can look forward to getting our hands on both Gotham Knights and Suicide Squad in 2022, as well as the new The Batman film - it's going to be quite the year for DC fans."
  ],
  "headers": {
    "3": "No surprises"
  },
  "links": {
    "Suicide Squad: Kill the Justice League": "https://www.techradar.com/news/suicide-squad-game",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Outriders": "https://www.techradar.com/how-to/how-to-play-the-free-outriders-demo",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "The Lord of the Rings: Gollum": "https://www.techradar.com/news/the-lord-of-the-rings-gollum-game",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer"
  }
}