{
  "source": "https://www.techradar.com/news/apple-lets-start-releasing-ios-and-macos-when-theyre-ready",
  "title": "Apple, let's start releasing iOS and macOS when they're ready",
  "category": "computing",
  "updated": "2021-08-21T10:00:11Z",
  "author": "daryl-baxter",
  "summary": "Opinion: Timing is no longer key",
  "article": [
    "Apple announced that SharePlay was being delayed to a future software release once iOS 15, iPadOS 15 and macOS 12 Monterey are made public later this year, disappointing users and developers alike.",
    "However, while this is understandable in the grand scheme of things, it does raise the question of why there should still be yearly software releases from the company.",
    "With developers under significant pressure to implement updated features based on the new releases, it could benefit everyone if we went back to the two-year release schedule that macOS once had and greatly benefited from.",
    "It’s almost a normalized scenario these days that we see new software releases every year. Apple users await June and WWDC with baited breath to see what’s coming to their iPhone and Mac devices, and whether their wishes will finally be granted in some way.",
    "However, if you watch back the keynote of WWDC 2021, you’re going to see features that have already changed or rescinded from the latest updates.",
    "It’s not only SharePlay, but Safari has seen its redesign mostly reversed, while other small features have also seen a delay, such as 3D navigation in CarPlay and the weekly App Privacy report that shows you which apps have been using certain data.",
    "We’re now seeing a release of iOS 15 that arguably has just one standout feature - notifications, where Focus can curate certain calendar events and apps to display notifications when you deem fit.",
    "Many users still remember how iOS 13 went in 2019, with many features announced at WWDC that year, but with some not arriving until as late as April 2020. But it wasn’t always like this with macOS.",
    "While iOS has always been on a yearly schedule, macOS used to be available when it was ready. Mac OS X Tiger 10.4 was released in April 2005, while the next version, Mac OS X Leopard 10.5 came out in October 2007 – over two years between releases.",
    "In that time we saw substantial features and improvements, while the Mac saw updates through hardware instead in the intervening time between software releases.",
    "It wasn’t until Mac OS X Mountain Lion 10.8 that the yearly schedule began, with releases in July and then October, which is still occurring.",
    "Since that time, some users have been vocal in noticing a dip in quality. Apple’s release of macOS 10.15 Catalina for example would bombard users with many notifications to allow apps to use certain features, or some message boxes would appear with no information to help users find the cause of the issue, confusing matters.",
    "The same has applied to iOS, with some versions causing random issues and slowdowns, which meant some users would simply wait until the next update was available.",
    "With iOS 15 seeing just one tentpole feature, both of these operating systems could benefit hugely from a two-year release cycle, regardless of hardware still arriving every year.",
    "Apple could hint at a future release of both iOS and macOS, while being clear about the new release schedules The company has done this before in previous years, especially with macOS, and it could build up more anticipation for these major releases rather than expecting an appearance at WWDC every year.",
    "We’re seemingly at a point where both iOS and macOS don’t need to be showcased every year with huge features. iPadOS 13.4 brought trackpad support for the tablet for instance, and it wasn’t a feature mentioned once at WWDC 2019 when iOS 13 was first announced.",
    "It’s only further proof that major releases should be announced when they’re ready, otherwise we’re going to look back on certain keynotes and wonder where those features went or why they changed so drastically when the update was eventually released for devices."
  ],
  "headers": {
    "3": "No more yearly releases",
    "8": "A new macOS and iOS release every two years"
  },
  "links": {
    "delayed": "https://www.techradar.com/news/shareplay-is-delayed-for-ios-15-is-it-time-for-a-two-year-release-schedule",
    "reversed": "https://www.techradar.com/news/latest-ios-15-beta-for-developers-walks-back-radical-safari-url-bar-redesign"
  }
}