{
  "source": "https://www.techradar.com/news/skrill-offers-fiat-to-crypto-withdrawals-for-its-digital-wallet-service",
  "title": "Skrill offers fiat-to-crypto withdrawals for its digital wallet service",
  "category": "computing",
  "updated": "2021-02-24T08:57:26Z",
  "author": "rob-clymo",
  "summary": "Europe is first to get the service with the UK following suit shortly",
  "article": [
    "Skrill, a digital payments provider that forms part of the integrated payments platform Paysafe has launched a fiat-to-crypto currency withdrawal service.",
    "Added as a new feature for Skrill’s digital wallet, users will be able to withdraw funds and transfer them directly to their preferred cryptocurrency address.",
    "This is the first time that Skrill customers have been able to instantly convert their fiat balance in such a way. Customers can access the feature simply by selecting ‘Crypto Wallet’ from their account when they withdraw funds.",
    "Users have the option of selecting either a Bitcoin address or Ethereum wallet destination after keying in the required balance amount. Skrill plans to add other additional cryptocurrencies for withdrawals in the near future. The new feature is already available within the European Economic Area (EEA), with the UK being tipped for inclusion in the scheme shortly.",
    "Skrill has been growing in popularity since launching back in 2018. Its cryptocurrency service allows customers to convert 40 fiat currencies, which include the Euro, British Pound and US dollar into a raft of crypto options. These include Bitcoin, Bitcoin Cash, Dash, Ethereum, Ethereum Classic, Kyber, Litecoin, Tezos, Stellar, XLM and Ox.",
    "“More people than ever are buying cryptocurrency as a long-term investment, particularly in light of recent institutional backing from the likes of Tesla, which has driven Bitcoin to fresh all-time highs,” said Lorenzo Pellegrino, CEO of Skrill, NETELLER, and Income Access at Paysafe.",
    "“Our customers have been enjoying the ability to interact with both fiat currencies and digital assets through Skrill for some time. Expanding a crypto portfolio is incredibly simple with Skrill, thanks to our fiat on-ramp. The new withdraw feature further enhances our service by enabling users to quickly and conveniently move their existing fiat balance to a crypto address of their choosing, saving them both time and money on fees. ”"
  ],
  "headers": {
    "4": "Cryptocurrency service"
  },
  "links": {
    "digital payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "currency withdrawal": "https://www.techradar.com/best/best-money-transfer-apps",
    "digital wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Ethereum": "https://www.techradar.com/news/best-mining-rig/how-to/how-to-mine-ethereum-on-your-pc",
    "cryptocurrencies": "https://www.techradar.com/news/the-best-bitcoin-exchange/how-to/how-to-mine-bitcoin-and-other-cryptocurrencies",
    "Bitcoin Cash": "https://www.techradar.com/how-to/how-to-claim-bitcoin-cash-bcc-using-the-electron-cash-wallet"
  }
}