{
  "source": "https://www.techradar.com/news/microsoft-edge-thinks-it-can-dramatically-improving-online-shopping",
  "title": "Microsoft Edge thinks it can dramatically improving online shopping",
  "category": "computing",
  "updated": "2021-09-24T10:33:11Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Easy access to reviews and quick jump to your cart with Edge",
  "article": [
    "Since switching to the Chromium engine, the development of Microsoft Edge has accelerated at a great pace.",
    "Microsoft has just revealed details of the latest batch of changes and improvements that are coming to its web browser, including great news for anyone who makes use of the internet for shopping and planning travel.",
    "Among the benefits of ecommerce are not only speed and convenience, but also the ability to compare prices and check out reviews before committing to a purchase. Microsoft's latest browser improvements help in these areas to further enhance the online shopping experience.",
    "To save you from having to use multiple tabs to break away from your to check reviews of whatever it is you're thinking of buying, Microsoft has introduced a new blue tag button in the address bar. Click this when you're in the middle of shopping, and Edge will conduct a micro-search in a pop-up that enables you to see customer ratings and expert reviews of the product you're looking at without having to navigate away from the online store.",
    "Another very handy feature for Edge users is express checkout. When you've filled your shopping cart with goodies, you can click the Try express checkout link in the address bar. Edge will not only check discount coupons to see if you can save any money, but will also give you the option of autofilling your delivery and payment information so you cab checkout and pay in just a few clicks.",
    "There are more money saving options available when you’re planning a trip. When you start to look for travel tickers, Edge can suggest things that you might like to do at your destination – such as places to visit and restaurants to eat at. If you search for flight tickets using Bing, you'll automatically see an info panel containing a list of the best prices from companies Microsoft has teamed up with,",
    "Last – but by no means least – there is a new feature that remembers details of your travel plans for you. This means that when you go to a site to book tickets, Edge will remember offer to fill in your last-used departure point and destination, as well as the number of passenger that will be travelling to save you from having to constantly enter the same information into site after site.",
    "With these latest changes, Microsoft is acknowledging that one of the most common uses for a web browser is online shopping. Having spent a good deal of time and effort making improvements to the general browsing experience, the focus is now rather more focused on enhancing specific experiences. The company has already enhanced online shopping with its deal finder, so it is perhaps little surprise that the software giant is looking for more ways to improve things even further.",
    "Making shopping easier and faster is a classic example of giving people exactly what they want. Shopping is supposed to be a fun experience, but the sheer amount of choice available online has transformed in into something of a chore. But by removing some of the frustrating elements of shopping online, Microsoft is helping to re-empower users, and this is only to be welcomed."
  ],
  "headers": {
    "5": "Spend, spend, spend",
    "7": "Analysis: money saving and people pleasing"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "web browser": "https://www.techradar.com/best/browser",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform"
  }
}