{
  "source": "https://www.techradar.com/news/oneplus-9t-might-be-the-companys-first-truly-good-camera-phone",
  "title": "OnePlus 9T might be the company's first truly good camera phone",
  "category": "phones",
  "updated": "2021-01-07T12:09:42Z",
  "author": "tom-bedford",
  "summary": "Camera improvements could be the focus",
  "article": [
    "OnePlus isn't a mainstay of our best camera phones list and while we've sometimes seen fairly impressive snappers on the company's devices, other phones generally perform much better. Well, that might be set to change by the end of 2021.",
    "On their personal Weibo (a Chinese social media platform) OnePlus CEO, Pete Lau, (who goes by the name Liu Zuohu in their home country) stated, 'This year we will invest huge resources in cameras and strive to be the world's number one image function.' We can't find this post itself, but MyDrivers snapped a screenshot of it.",
    "That doesn't tell us a huge amount about any specific upcoming phone, and it likely has nothing to do with the upcoming OnePlus 9 which is expected to launch in the first few months of this year. However, it could spell good fortune for the OnePlus 9T that we expect to come towards the end of 2021.",
    "An increase in R&D (that's research and development) for camera features could improve the hardware, or lenses and sensors, of the snappers. It'll probably focus more on software though, like image processing and AI optimization, as well as perhaps extra novelty features.",
    "OnePlus is owned by the same parent company as several other phone companies, most notably Oppo, and both brands' phones are often pretty similar. For example, try finding the differences between the OnePlus 8 Pro and Oppo Find X2 Pro as there are very few.",
    "But Oppo phones often trump OnePlus ones in camera tests for a key reason - it has a special relationship with Sony.",
    "Sony is one of the biggest manufacturers of smartphone camera parts, making the Exmor sensors that you'll find in a variety of smartphones. With the Oppo Find X2, the Oppo Reno 5 Pro Plus, and apparently also on the upcoming Oppo Find X3, Oppo used exclusive premium camera sensors from Sony, and this gave the cameras that extra cutting edge.",
    "Perhaps OnePlus needs to source its own unique lenses, from Sony or another manufacturer, to get ahead of the competition. The Oppo Find X2's camera later made its way to the OnePlus 8, so hardware isn't the only issue but it's very important.",
    "We've heard rumors OnePlus is collaborating with lens maker Leica, which also collaborates with Huawei on its phone cameras, for the OnePlus 9 and this could go part of the way to giving the smartphones great camera hardware.",
    "If the OnePlus 9, or future OnePlus phones, had great camera hardware, it'd make developing great software easier too, as the phones would take pictures with more information for the AI optimization to use.",
    "Of course, smartphone photography is hard to boil down to a few paragraphs like this, but it's also hard to argue that OnePlus collaborating with other companies more than it already does would be a bad thing. Most things in life are improved with teamwork.",
    "We're expecting the OnePlus 9 to launch in the first few months of 2021 and the OnePlus 9T to come around six months after that - whether the dividends of OnePlus' R&D work appear in that phone, or a later one, remains to be seen.",
    "Via GSMArena"
  ],
  "headers": {
    "4": "Taking a leaf out of Oppo's book"
  },
  "links": {
    "best camera phones": "https://www.techradar.com/news/best-cameraphone",
    "Weibo": "https://weibo.com/liuzuohu?is_all=1",
    "MyDrivers": "https://m.mydrivers.com/newsview/733508.html",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Oppo Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "Oppo Find X2": "https://www.techradar.com/reviews/oppo-find-x2-review",
    "Oppo Reno 5 Pro Plus": "https://www.techradar.com/news/oppo-reno-5",
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "GSMArena": "https://www.gsmarena.com/pete_lau_says_oneplus_will_focus_its_r_d_efforts_at_camera_improvements-news-47074.php"
  }
}