{
  "source": "https://www.techradar.com/news/apple-airpods-pro-lite-what-we-want-to-see-from-the-rumored-true-wireless-earbuds",
  "title": "Apple AirPods Pro 2 release date, news, and rumors",
  "category": "audio-visual",
  "updated": "2021-12-08T12:14:47Z",
  "author": "olivia-tambini",
  "summary": "When will the AirPods Pro 2 be released?",
  "article": [
    "When will the Apple AirPods Pro 2 be released? Speculation is mounting around the next iteration of the noise-cancelling AirPods, which offer an audio upgrade and additional features over the standard Apple AirPods.",
    "While we've yet to hear anything official about the AirPods Pro 2, the AirPods 3 have been released recently, bringing a much improved listening experience than their predecessors, the AirPods 2.",
    "We are expecting another 'Pro' or premium model in the relatively near future, especially after a recent price leak – which will be good news for those keen on noise-cancelling wireless earbuds like the AirPods Pro that offer a slightly more robust feature set than their cheaper counterparts.",
    "Right now, everything is pointing to a 2022 release date for the second-gen AirPods Pro, with respected analyst Ming-Chi Kuo predicting a launch in the tail-end of the year.",
    "Whenever they materialize, we're hoping Apple will introduce some big upgrades to its flagship true wireless earbuds. Here's everything we know so far about the rumored Apple AirPods 2 earbuds, plus a few features we'd like to see.",
    "There's been a bit of back and forth with AirPods Pro 2 release date rumors.",
    "Initial rumors suggested new 'regular' AirPods would crash into the market before 2020 is out, but later comments from industry analyst Ming-Chi Kuo suggested we'd be waiting a while longer – as indeed we have been.",
    "Ming-Chi Kuo said we'd likely get a new AirPods iteration in 2021, and a new AirPods Pro model in 2022 too (via AppleInsider) - and he's recently expanded that to say that the AirPods Pro 2 will be released in late 2022.",
    "That's backed up by information - which supposedly comes from a supply chain insider - that was released by @FrontTron (via MacRumors), who says that the launch of the premium wireless earbuds has been pushed back from Q2 2022 to Q3. The source didn't give a reason for this delay.",
    "In any case, we're not expecting previous rumors that the AirPods Pro 2 would emerge in 2021 to come true now that we're nearly at the end of the year.",
    "According to tweet from LeaksApplePro, the AirPods Pro 2 will cost the same as their predecessors ($249 / £249 / AU$399) – which contradicts previous reports that the new earbuds will be an entry-level version of the AirPods Pro (hence the AirPods Pro Lite name).",
    "If we do get a budget-friendly version of the AirPods Pro 2, that would really shake up the competition with a genuinely affordable pair of Apple earbuds. We don't think that's super likely though; Apple recently reduced the price of the AirPods 2 in the wake of the AirPods 3 being released, making them the cheapest AirPods you can currently buy.",
    "Interested in buying some Apple headphones now? Check out the best deals we've found below:",
    "Improved noise cancellation",
    "We don’t think there would be much point in releasing an entry-level version of AirPods Pro if they didn’t come with its best feature: active noise cancellation.",
    "This was a true upgrade over the original AirPods, and signaled a shift in the true wireless earbuds market that means we can now expect to see features previously reserved for premium over-ear headphones in cordless models.",
    "The noise cancellation offered by the AirPods Pro is very good indeed, particularly for true wireless earbuds – but it could be improved. And according to LeaksApplePro, the noise cancellation will be adjusted, if not given a complete overhaul.",
    "Fitness tracking features",
    "A previous report by Digitimes said future AirPods will use ambient light sensors to take biometric measurements – potentially for monitoring blood oxygen levels like the Apple Watch 6.",
    "According to AppleLeaksPro, this feature is coming to the AirPods Pro 2 – and as posited by MacRumors, this could work in a similar way to the ear-based clip on pulse oximeters used in hospitals, which shine light through the earlobe to detect the amount of oxygen in a patient's bloodstream. It's not clear whether the design of the AirPods Pro would have to change materially to allow this to happen, but we think it's unlikely that Apple would ditch the design that has made its earbuds so ubiquitous.",
    "That's not all. Earlier this year, Apple was awarded a number of new patents, one of which suggests that the next AirPods could come with a nifty feature for fitness fans, possibly cementing their place among the best running headphones in the world.",
    "According to Patently Apple, the patent describes AirPods that use inbuilt sensors to \"gather orientation information such as accelerometer measurements during user movements\".",
    "That's not all. Future Apple AirPods – including the rumored AirPods 3 and AirPods Pro Lite – could automatically pause or lower the volume of your music if they detect hazards in your surroundings, according to a patent granted to the company on August 11.",
    "The patent describes a pair of true wireless earbuds that are capable of adjusting their audio output based on the user's activities and location, including \"adjusting audio volume, stopping or preventing audio from playing, providing feedback, directions, encouragement, advice, safety information, instructions, and the like\".",
    "Gesture controls",
    "Apple has also been awarded a patent that describes the ability to control true wireless earbuds with futuristic 'in-air gestures'.",
    "Spotted by Patently Apple, the patent describes how in-air gestures – for example hovering a hand over the AirPods – could work alongside the touch controls already employed by the AirPods Pro, allowing you to trigger different actions.",
    "More recently, Apple filed a patent describing earbuds that could be controlled by touching your face, shaking your head, and even clicking your teeth together. Whether these features will actually materialize remains to be seen, but it's clear that Apple is investigating some exciting new tech for its wireless earbuds.",
    "A streamlined design",
    "According to a Bloomberg report that cites \"people familiar with the plans\" the AirPods Pro will get a design overhaul in 2021, eliminating the ear stems altogether, for a \"more rounded shape that fills more of a user's ear\" – perhaps taking a few design cues from the Samsung Galaxy Buds and the Google Pixel Buds.",
    "That design isn't set in stone, however. Bloomberg says that fitting the features of the AirPods Pro, including the antennas and microphones, into a more compact build has been a challenge so far, which \"could result in a less ambitious design when the final product is finalized\".",
    "If Apple does keep the protruding stems we’d love the brand to include haptic feedback when you touch them – it would add a little bit of tactility to the user experience that we think would be really beneficial.",
    "Sports-friendly features",
    "Some earfins wouldn’t go amiss to make the AirPods Pro Lite appeal to the running crowd. While we find that the AirPods Pro are generally quite secure during workout sessions, some extra security could win over diehard fans of the earhook-toting Beats Powerbeats Pro.",
    "Another way to steal some custom from Beats (and therefore itself)? Adding some cool color options to the AirPods Pro Lite. If they really are a cheaper version of the AirPods Pro, and therefore not a flagship product, what’s the harm in a little experimentation? We’d love to see true wireless earbuds in the same space gray and rose gold colors we’ve seen with some iPhone and MacBook Pro models.",
    "Longer battery life",
    "The battery life offered by the AirPods Pro doesn't match some of the best true wireless earbuds you can buy today. While perfectly acceptable, just under 25-hours of playtime has been far outmatched by the likes of the Lypertek PurePlay Z3 2.0 (though these admittedly don't come with noise cancellation, which can drain battery life).",
    "Improved audio",
    "While the AirPods Pro don't sound bad by any means, they can't compete with the Sony WF-1000XM4 and Cambridge Audio Melomania 1 Plus in this respect.",
    "For a start, we'd like to see aptX HD support, which would allow for wireless streaming of hi-res audio codecs at 24-bit/48kHz – which Qualcomm claims makes for better-than-CD quality. That way, Apple could get the audiophiles on side – and it seems a bit of an oversight now that the original AirPods Pro can support other codecs like Dolby Atmos spatial audio and Apple Music now offers lossless audio at no extra cost for subscribers.",
    "We'd also like to see the ability to customize the EQ of the AirPods Pro, which could make them suitable for a wider range of musical genres. While the original earbuds are great for listening to pop music, they just don't have the right EQ curve to do justice to classical music."
  ],
  "headers": {
    "5": "AirPods Pro 2 release date",
    "10": "Apple AirPods Pro 2 price",
    "13": "AirPods Pro 2 rumors",
    "32": "AirPods Pro 2: what we want to see"
  },
  "links": {
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "AirPods 2": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "recent price leak": "https://www.techradar.com/news/apple-airpods-pro-2-price-leak-reveals-bad-news-for-true-wireless-earbuds-fans",
    "noise-cancelling wireless earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "AppleInsider": "https://appleinsider.com/articles/20/04/23/third-generation-airpods-expected-in-2021-new-airpods-pro-in-2022",
    "AirPods Pro 2 will be released in late 2022": "https://www.techradar.com/news/airpods-pro-2-release-date-could-fall-in-late-2022-but-can-we-believe-the-rumors",
    "@FrontTron": "https://twitter.com/FrontTron/status/1459000065247219718",
    "MacRumors": "https://www.macrumors.com/2020/05/25/digitimes-future-airpods-ambient-light-sensors/",
    "LeaksApplePro": "https://twitter.com/LeaksApplePro/status/1318146299913490433",
    "Apple headphones": "https://www.techradar.com/news/airpods-beats-and-the-best-apple-headphones-you-can-buy-in-2020",
    "report": "https://www.digitimes.com/news/a20200525PD200.html",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "the next AirPods could come with a nifty feature for fitness fans": "https://www.techradar.com/news/the-airpods-3-could-coach-you-through-your-workouts",
    "best running headphones": "https://www.techradar.com/best/best-running-headphones",
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2020/08/apple-wins-airpods-pro-with-force-sensors-patent-that-also-reveals-possible-future-features-like-offering-in-air-gestures-m.html",
    "automatically pause or lower the volume of your music": "https://www.techradar.com/news/apple-airpods-3-could-come-with-an-important-safety-feature",
    "patent": "http://patft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=10743095.PN.&OS=PN/10743095&RS=PN/10743095",
    "ability to control true wireless earbuds with futuristic 'in-air gestures'": "https://www.techradar.com/news/new-airpods-pro-could-be-controlled-with-futuristic-in-air-gestures",
    "Apple filed a patent describing earbuds that could be controlled by touching your face": "https://www.techradar.com/news/the-apple-airpods-pro-2-could-be-controlled-by-clicking-your-teeth",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "Google Pixel Buds": "https://www.techradar.com/reviews/google-pixel-buds-2020",
    "Beats Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "MacBook Pro": "https://www.techradar.com/news/the-best-cheap-macbook-pro-deals",
    "Lypertek PurePlay Z3 2.0": "https://www.techradar.com/reviews/lypertek-pureplay-z3-20-review",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Cambridge Audio Melomania 1 Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}