{
  "source": "https://www.techradar.com/news/xbox-series-x-games-on-pc-are-a-hit-as-microsoft-throws-shade-at-ps5-approach",
  "title": "Xbox Series X games on PC are a hit, as Microsoft throws shade at PS5 approach",
  "category": "gaming",
  "updated": "2021-06-10T13:07:13Z",
  "author": "adam-vjestica",
  "summary": "‘We’re now reaching hundreds of millions of people’",
  "article": [
    "When Microsoft first announced that Xbox Series X games would release on PC the same day as its console counterparts, the decision was met with raised eyebrows by many. The consensus seemed to be, “Why would anybody buy an Xbox if you could just play all Microsoft’s exclusives on PC?”",
    "Well, as it turns out, Microsoft’s wasn’t focused on solely pushing Xbox hardware. Instead, the company saw an opportunity to expand the Xbox ecosystem to reach more players, and offer more value to consumers. And it looks like it’s done exactly that.",
    "Speaking at a pre-E3 2021 What’s Next For Gaming briefing, Head of Xbox Phil Spencer explained how Microsoft is now able to reach hundreds of millions of players, and that it's no longer reliant on building an install base via console sales.",
    "“Across the Xbox ecosystem, we're now reaching hundreds of millions of people every month, and our total addressable market is going to grow while others are relatively static,” Spencer said. “As the Xbox ecosystem grows in both content and total size, it becomes more valuable to both players and our partners.”",
    "Spencer went on to add that Microsoft is the only company that ships its games on console, PC, and cloud simultaneously, and that subscribers of Xbox Game Pass also receive all first-party games on day one.",
    "“So right now, we're the only platform shipping games on console, PC, and cloud simultaneously,” Spencer said. “Others bring console games to PC years later, not only making people buy their hardware up front, but then charging them a second time to play on PC. And of course, all of our games are in our subscription service day one, full cross-platform included.”",
    "In what might be seen as a slight against Sony, more PlayStation exclusives have slowly come to PC in the last few years, which is at odds with Microsoft’s approach. Horizon: Zero Dawn, Death Stranding and Days Gone have all received PC ports, and Uncharted 4 is tipped to be next in line. As Spencer alluded to, however, these ports arrived years after the games’ initial release on console, and may result in players having to pay to play them again. Some PC players may have bought a PS4 specifically for those games, only to find that they’re now available on PC.",
    "Of course, the biggest driver for Microsoft is Xbox Game Pass, which Spencer admits has changed the gaming landscape, specifically by changing the traditional retail model, and how the subscription service lets Xbox reach more players than ever before by moving away from dedicated hardware.",
    "“For the last couple of decades, the only way you could play games was to buy them outright. And, for many players, this is an investment that will limit their ability to play,” Spencer explained.",
    "“That cost, and that retail model, for some, have limited the audience for creators and for the entire industry. That’s why we created Game Pass, to open up the way that players can play more games with their friends, ultimately bringing more players in and making games more accessible to anyone.”",
    "Microsoft’s approach is once again at odds with Sony, which doesn’t put its first-party exclusives on its subscription service, PlayStation Now, until many years after release. Sony is also charging $70 / £70 for its first-party titles like Ratchet and Clank: Rift Apart, as opposed to Microsoft, who release all its exclusives like Halo Infinite on Xbox Game Pass on day one.",
    "Both Microsoft and Sony’s approaches are fascinating, with one banking on the strength of its internal studios, while the other aims to deliver a more all-encompassing and value driven model. Clearly Sony has taken a page out of Microsoft’s book when it comes to PC, but Xbox now needs to match what Sony’s studios are capable of delivering when it comes to exclusive games if it really wants to shake up the competition."
  ],
  "headers": {
    "6": "PC builder",
    "10": "Xbox vs PlayStation"
  },
  "links": {
    "Xbox Series X games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Horizon: Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Death Stranding": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "Days Gone": "https://www.techradar.com/news/days-gone-is-coming-to-pc-and-more-playstation-exclusives-are-on-the-way",
    "Uncharted 4": "https://www.techradar.com/news/ps4-hit-uncharted-4-could-be-headed-to-pc",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review/news/xbox-game-pass-vs-playstation-now-which-is-the-best-game-subscription-service",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite"
  }
}