{
  "source": "https://www.techradar.com/news/heres-how-much-us-consumers-spent-per-minute-on-cyber-monday",
  "title": "Here's how much US consumers spent per minute on Cyber Monday",
  "category": "computing",
  "updated": "2021-12-01T20:30:36Z",
  "author": "anthony-spadafora",
  "summary": "While down slightly year-over-year, consumers spent a total of $10.7bn on Cyber Monday 2021",
  "article": [
    "The holiday shopping season is far from over but we now know what products were the most popular and exactly how much consumers spent on Cyber Monday 2021 according to a new report from Adobe.",
    "As part of its Adobe Digital Economy Index, the company, known for its Creative Cloud software suite, provides a comprehensive view into the ecommerce market in the US by analyzing direct consumer transactions online. To do so, it uses Adobe Analytics data compiled from over one trillion visits to retail sites, 100 million SKUs and 18 product categories.",
    "During Cyber Monday 2021, consumers spent a total of $10.7bn and during the peak hour (11pm-12am ET / 8pm-9pm PT) of the biggest online shopping day of the year, they spent $12m every minute.",
    "Director of Adobe Digital Insights, Taylor Schreiner provided further insight in a blog post on why Cyber Monday sales were down 1.4 percent year-over-year in 2021, saying:",
    "“With early deals in October, consumers were not waiting around for discounts on big shopping days like Cyber Monday and Black Friday. This was further fueled by growing awareness of supply chain challenges and product availability. It spread out e-commerce spending across the months of October and November, putting us on track for a season that still will break online shopping records.”",
    "Although the term Black Friday was first used in the New York Times back in 1975, Cyber Monday is still a relatively new shopping holiday and the phrase itself was coined by the Consumer Brands Association's Ellen Davis during the 2005 holiday season.",
    "According to Adobe, online spending during Cyber Monday 2021 was driven by a number of categories including toys which was up nearly 11 times compared to pre-season levels in September, gift cards (up by seven times), books (also up by seven times) video games (up by six times) and baby/toddler products (also up by six times).",
    "When it came to electronics, this year's top sellers were AirPods, Apple Watches, Apple Pencils, laptops from HP, Lenovo and Dell, game consoles such as the Nintendo Switch and Xbox Series S and smart TVs from Sony and Samsung.",
    "One interesting trend that Adobe observed this year was an increase in the use of Buy Now Pay Later services which saw revenue up 21 percent year-over-year. Although more retail stores are now open to shoppers, curbside pickup remained popular and was used in 18 percent of all Cyber Monday orders vs 20 percent last year.",
    "While Black Friday and Cyber Monday continue to be some of the biggest shopping days of the year, they no longer hold the allure they once did as retailers have begun to offer their best deals earlier in October and these prices often remain unchanged all the way up to the end of December.",
    "Looking to improve your online sales? Check out our roundups of the best shopping cart software, best payment gateways and best ecommerce hosting"
  ],
  "headers": {
    "5": "Cyber Monday sales"
  },
  "links": {
    "Cyber Monday 2021": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Adobe Digital Economy Index": "https://www.techradar.com/news/us-ecommerce-could-be-a-trillion-dollar-market-by-2022",
    "Creative Cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "blog post": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-6711467347792458000&url=https%3A%2F%2Fblog.adobe.com%2Fen%2Fpublish%2F2021%2F11%2F30%2Fadobe-consumers-spent-10-8-billion-on-cyber-monday-109-8-billion-so-far-this-holiday-season%3Fmv%3Daffiliate%26mv2%3Dred%23gs.i610xa",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Xbox Series S": "https://www.techradar.com/cyber-monday/buy-the-xbox-series-s-on-cyber-monday-for-backwards-compatibility-heres-why",
    "Buy Now Pay Later": "https://www.techradar.com/news/amazon-will-soon-let-you-buy-now-pay-later",
    "best shopping cart software": "https://www.techradar.com/best/best-shopping-cart-software",
    "best payment gateways": "https://www.techradar.com/best/best-payment-gateways",
    "best ecommerce hosting": "https://www.techradar.com/news/best-ecommerce-hosting"
  }
}