{
  "source": "https://www.techradar.com/news/netflix-has-cancelled-the-irregulars-so-what-went-wrong",
  "title": "Netflix has cancelled The Irregulars – so what went wrong?",
  "category": "entertainment",
  "updated": "2021-05-05T09:03:00Z",
  "author": "tom-power",
  "summary": "The game is no longer afoot",
  "article": [
    "The Irregulars, the Sherlock Holmes fantasy horror spin-off series, was a big success for Netflix. The show's first season quickly climbed the top 10 charts in the US and UK, and even edged out Disney Plus' The Falcon and the Winter Soldier in Nielsen's US streaming charts at the end of April.",
    "That impressive showing hasn't saved it from the chopping block, though. Yep, The Irregulars has been cancelled by Netflix after a solitary season.",
    "First reported by Deadline, and quickly confirmed by Variety, the young adult (YA) TV show is the latest Netflix Original series to be canned by the streaming giant. At the moment, Netflix hasn't commented on why it's chosen to cancel The Irregulars and, if history is any indication, we won't be given a reason either.",
    "According to Nielsen's data, The Irregulars pulled in around 643 million minutes of viewers' streaming time across its eight episodes. Compare that to The Falcon and the Winter Soldier, which posted 628 million minutes across its six-episode run, and The Irregulars hasn't done too badly at all.",
    "Right now, Thaddea Graham – who portrays Bea in the TV show – is the only cast member to express their sadness at the series' cancellation, but we expect the other main actors to follow suit shortly.",
    "It's hard to pinpoint one exact cause for The Irregulars' cancellation. In our review, we said that the show had a number of plot and action missteps, but its young cast and unique spin on the Sherlock legend made for an intriguing watch.",
    "Those are sentiments that a lot of fans and critics appear to have agreed with, too. The Irregulars season one currently holds a 78% approval rating, from critics, on metrics website Rotten Tomatoes, but that score drops down to 55% when you factor in audience review scores. Take to social media, search for 'The Irregulars' and you'll see a similar spread of people who really enjoyed the TV show and those who thought it wasn't very good.",
    "Of course, Rotten Tomatoes and social media reviews and opinions only represent a small fraction of the critical reception that shows receive. It's difficult, then, to truly judge if Netflix cancelled The Irregulars based on these figures. After all, the series held the number one spot in the US and UK Top 10 most popular shows lists for almost two weeks post-release, so clearly there was an appetite for it.",
    "That all said, it's not unlike Netflix to end a series after one season. The Dark Crystal: Age of Resistance is arguably the biggest example of this, with Netflix cancelling the prequel series to the 1982 movie after a solitary season. Given the widespread acclaim that the fantasy series received, fans and critics were stunned by the streamer's decision to end it after one season. Netflix will have its reasons for doing so, but there's still no public acknowledgement from them as to why Age of Resistance was canned.",
    "That'll almost certainly be the case here, too. It's highly unlikely that we'll find out why The Irregulars was dropped after one outing and fans will spend the next few days and weeks speculating why this was the case.",
    "If nothing else, The Irregulars didn't end on a cliffhanger, so there aren't any major story threads that needed to be wrapped up before it was cancelled. Admittedly, there are a couple of loose plot points left over, but they weren't hugely important components as to where the story could go in season two and beyond.",
    "That may be small comfort to fans right now, but the series' plot was tied up nicely. It'll be up to those ardent supporters of The Irregulars to decide, in their own minds, what happens to Doctor Watson, Bea and the rest of the crew moving forward."
  ],
  "headers": {
    "5": "What went wrong for The Irregulars on Netflix?"
  },
  "links": {
    "The Irregulars": "https://www.techradar.com/news/how-netflixs-the-irregulars-reinvents-the-sherlock-legend-through-a-horror-lens",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Deadline": "https://deadline.com/2021/05/the-irregulars-sherlock-holmes-detective-drama-canceled-netflix-1234749852/",
    "Variety": "https://variety.com/2021/tv/news/the-irregulars-canceled-netflix-1234966411/",
    "express their sadness": "https://www.instagram.com/stories/thaddeagraham/2566460481982013357/?hl=en",
    "our review": "https://www.techradar.com/news/the-irregulars-on-netflix-is-far-from-the-best-take-on-sherlock-holmes",
    "Rotten Tomatoes": "https://www.rottentomatoes.com/tv/the_irregulars/s01",
    "really enjoyed": "https://twitter.com/ChuckWendig/status/1389699681727356930",
    "wasn't very good": "https://twitter.com/CeejayNightwing/status/1389699277576884225"
  }
}