{
  "source": "https://www.techradar.com/news/new-self-assessment-tool-will-tell-you-whether-youll-survive-a-ransomware-attack",
  "title": "New self-assessment tool will tell you whether you'll survive a ransomware attack",
  "category": "computing",
  "updated": "2021-07-02T16:08:47Z",
  "author": "mayank-sharma",
  "summary": "Preparation is better than cure",
  "article": [
    "The US Cybersecurity and Infrastructure Security Agency (CISA) has added a new ransomware assessment component to the Cyber Security Evaluation Tool (CSET).",
    "Developed and maintained by the US Department of Homeland Security (DHS) since 2006, CSET is a web-based tool that helps assess the security mechanisms implemented by businesses in order to point out any chinks in the armor.",
    "The latest version of the tool, v10.3.0, now sports the Ransomware Readiness Assessment (RRA) component, which will help businesses determine how well equipped they are to defend and recover from a ransomware attack.",
    "“The Ransomware Readiness Assessment (RRA) will help you understand your cybersecurity posture with respect to the ever-evolving threat of ransomware,” reads the CSET release notes.",
    "CISA says that RRA is based on a “tiered set of practices” that are designed to help businesses better assess their readiness to defend as well as to recover from a ransomware attack.",
    "According to the release notes, the RRA poses a series of questions to users about their cybersecurity policies. It focuses on the basics first, before moving onto intermediate and advanced questions, with the aim of helping businesses improve their defenses against ransomware, based on government and industry recommendations and standards.",
    "Furthermore, in its bid to make RRA useful for businesses of all sizes irrespective of their current cybersecurity measures, CISA has tailored the new component to assess different levels of ransomware threat readiness. This will help make the tool useful for small businesses that lack dedicated security personnel to actively monitor their network against threats.",
    "CISA explains that RRA evaluates both operational technology (OT) and information technology (IT) network security practices against the threat of ransomware attacks, and provides the results of its assessment through a graphical dashboard laced with easy to comprehend graphs and tables."
  ],
  "headers": {
    "4": "Path for improvement"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "CSET": "https://github.com/cisagov/cset",
    "release notes": "https://github.com/cisagov/cset/wiki/CSET-10.3.0-Release-Notes",
    "CISA says": "https://us-cert.cisa.gov/ncas/current-activity/2021/06/30/cisas-cset-tool-sets-sights-ransomware-threat"
  }
}