{
  "source": "https://www.techradar.com/news/you-can-now-finally-run-microsoft-office-on-ipad",
  "title": "You can now finally run Microsoft Office on iPad",
  "category": "computing",
  "updated": "2021-02-17T17:13:16Z",
  "author": "barclay-ballard",
  "summary": "An iPad-optimized Office app is finally here",
  "article": [
    "Microsoft Office is now available as a single unified app for iPad users. The release means that users of the Apple tablet will now be able to access Word, Excel, and PowerPoint combined in one app.",
    "“Office is now available on iPad: We're combining the Word, Excel, and PowerPoint apps you know into a single, iPadOS-optimized app,” Sameer Gupta, program manager on Microsoft’s Office team, explained. “Plus, you’ll see additional tools to keep you more productive than ever. For example, you’ll be able to quickly create and sign PDFs, and transform pictures into documents.”",
    "Previously, iPad users that wanted access to a unified Office app had to make do with the iPhone app launched in February last year, which opened in a separate window. Although the iPhone Office app reportedly worked well for iPad users, it did come with a sizeable warning that it was “optimized for iPhone.”",
    "Listing some of the key features to try, Microsoft boasted that the new iPad Office app would allow users to easily get started on important documents using a number of helpful templates, and provide cloud storage for Word, Excel, and PowerPoint files.",
    "Document creation also promises to be more straightforward with the iPad app. Users can now take a picture of a document and turn it into an editable Word file with just one button, with similar functionality also available for Excel and PowerPoint. PDFs can also be instantly created from images and documents, while e-signing options are available using either your finger or Apple Pencil.",
    "One notable drawback is that an Office 365 subscription will be required to edit and create documents on iPadOS. If that’s not too much of a downside, however, the new app is available now for all tablets running iPadOS 13 or later.",
    "Via MSPoweruser"
  ],
  "headers": {
    "3": "New features"
  },
  "links": {
    "Microsoft Office": "https://www.techradar.com/news/buy-microsoft-office-prices",
    "Word": "https://www.techradar.com/news/the-best-free-word-processor",
    "Excel": "https://www.techradar.com/best/excel-online-courses",
    "PowerPoint": "https://www.techradar.com/best/free-presentation-software",
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6254320076600664000&xs=1&url=https%3A%2F%2Finsider.office.com%2Fen-us%2Fblog%2Foffice-app-on-ipad&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyou-can-now-finally-run-microsoft-office-on-ipad",
    "Office": "https://www.techradar.com/best/free-office-software",
    "iPhone app": "https://www.techradar.com/best/best-iphone-apps-2021",
    "iPad": "https://www.techradar.com/best/best-business-ipad-apps",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "MSPoweruser": "https://mspoweruser.com/unified-microsoft-office-app-now-supports-the-ipad/"
  }
}