{
  "source": "https://www.techradar.com/news/microsoft-surface-laptop-4-could-disappoint-with-older-amd-hardware",
  "title": "Microsoft Surface Laptop 4 could disappoint with older AMD hardware",
  "category": "computing",
  "updated": "2021-03-26T13:08:08Z",
  "author": "hamish-hector",
  "summary": "Not Ryzen to the occasion",
  "article": [
    "It looks more and more likely that Microsoft’s long-awaited Surface Laptop 4 could be using an outdated AMD processor. A leaked benchmark for a computer using a so-called ‘Surface Edition’ CPU suggests we could be stuck with a Ryzen 4000 series chip, and not newer 5000 series ones.",
    "The UserBenchmark entry was spotted for an unknown PC using an ‘AMD Ryzen 7 Microsoft Surface Edition’, with an integrated ‘RX Vega 8 4000’ - the generation of graphics used by the older Ryzen 4000 CPUs. Specifically the chip on the supposed Surface Laptop 4 looks a lot like an eight-core Ryzen 7 4800U.",
    "This is certainly disappointing to hear given that better processors are out there, but the 16GB RAM included in the benchmark could give these older chips a boost. Nothing’s confirmed yet so Microsoft could still surprise us with a more powerful hardware than we’re expecting, but with all the rumors flying around we aren’t hopeful.",
    "A 2020 benchmark suggested that we could be getting a Surface Laptop 4 with a choice of either an AMD Ryzen 4000 processor or an Intel Tiger Lake-U CPU. This was later backed up by benchmarks this year which showed a custom AMD CPU and an 11th gen Intel Core i5 CPU being used in suspected Surface Laptop 4s.",
    "It seems odd for Microsoft to use newer Intel chips alongside older AMD processors, but evidence is suggesting this could be the case. However, it might not be a knockout punch for AMD, as rumored benchmark scores for each device place Intel behind with its multi-core score of 4970 - compared to 5726.",
    "Until an official reveal, we won’t know for certain what hardware the Surface Laptop 4 will come packaged with. So, we’ll have to wait and see which version comes out on top in this latest battleground for AMD and Intel.",
    "Via APISAK"
  ],
  "headers": {
    "3": "What are the other Surface Laptop 4 CPU leaks?"
  },
  "links": {
    "Surface Laptop 4": "https://www.techradar.com/reviews/surface-laptop-4",
    "UserBenchmark": "https://t.co/m15U4TkirR?amp=1",
    "rumored benchmark scores": "https://www.techradar.com/news/microsoft-could-team-up-with-amd-again-for-the-surface-laptop-4",
    "APISAK": "https://twitter.com/TUM_APISAK/status/1375299537447743494?s=20"
  }
}