{
  "source": "https://www.techradar.com/news/venom-comes-to-ps5-in-marvels-spider-man-2",
  "title": "Venom is ready to hunt in Marvel's Spider-Man 2 on PS5",
  "category": "gaming",
  "updated": "2021-09-10T11:46:00Z",
  "author": "hamish-hector",
  "summary": "Insomniac won't sleep until 2023",
  "article": [
    "Sony just revealed Marvel's Spider-Man 2 at the PS5 Showcase, with a teaser trailer that shows Miles and Peter facing off against the iconic villain Venom – an outer-world symbiote with a passion for violence.",
    "Venom could be the Spider-Men's biggest challenge yet as they're a damn-sight tougher than the goons we see Miles and Peter taking out earlier on in the clip. Venom won't be alone either as an ominous voiceover suggests another hunter could be looking to challenge the Spider-Men as well.",
    "At the end of the teaser it was revealed that Marvel's Spider-Man 2 will drop on the PS5 in 2023. That, unfortunately, means we've still got a while to wait before we can play the game for ourselves, but that will also give us more time to enjoy Marvel's Wolverine - the other Marvel project Insomniac is working on.",
    "The roughly one-and-a-half-minute-long trailer doesn't give us too many details about what to expect (unfortunately it was all cinematic so there's no gameplay to analyze) but we can glean a few details from what was shown to us.",
    "For one it looks like we'll be playing as both Peter Parker and Miles Morales. Both characters were seen fighting goons – Peter even had his Iron Spider arms giving him a power boost – and even performed a team-up move to take out one tough-looking foe.",
    "Also, while Venom is the only named villain we see make an appearance, they aren't the only one we hear. Another evil-doer is heard through the teaser's voiceover suggesting Peter and Miles will have to face off against several threats. We aren't 100% sure who this is right now, but our money would be on Kraven the Hunter – especially with the talk of searching for a worthy opponent to take on given his history in the comics.",
    "Given that Marvel's Spider-Man on the PS4 featured the whole Sinister Six we wouldn't be surprised if Insomniac's sequel had a whole host of enemies take on our duo of Spider-Men too."
  ],
  "headers": {
    "3": "Marvel's Spider-Man 2: trailer breakdown"
  },
  "links": {
    "Marvel's Spider-Man 2": "https://www.techradar.com/news/marvels-spider-man-2",
    "PS5 Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Marvel's Wolverine": "https://www.techradar.com/news/marvels-wolverine",
    "Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Marvel's Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review"
  }
}