{
  "source": "https://www.techradar.com/news/should-you-cancel-netflix-in-2021",
  "title": "Should you cancel Netflix in 2021?",
  "category": "entertainment",
  "updated": "2021-03-09T17:10:46Z",
  "author": "samuel-roberts",
  "summary": "Still worth the fee?",
  "article": [
    "Netflix's prices have crept up in recent years. Netflix's cost for new users in April 2014 was $8.99 for its standard plan. Now, it's $13.99 (£9.99/AU$15.99) per month – or $17.99 (£13.99/AU$19.99) per month if you want the 4K tier. Significantly, Netflix's competition is getting pricier in some cases, too. Disney Plus is raising its monthly prices by $1 in the US on March 26, and has already bumped Disney Plus UK up to £7.99 per month in the UK as it launched a new content arm in Star.",
    "The number one problem in streaming generally is escalating cost and choice. Surely few people want to spend upwards of $40 per month on streaming services – but that's exactly what you'll be doing right now in the US if you subscribe to Disney Plus ($7), Netflix's standard tier ($14), HBO Max ($15) and Paramount Plus' ad-supported tier ($6). And there are many more services on top of those.",
    "So, as the first in a series of articles, we're going to take a second look at each major service to see if they're worth keeping in 2021. We'll start with Netflix, the dominant premium subscription streamer.",
    "Is Netflix still worth it in 2021? Below, we'll examine the factors that determine that, and give you an answer.",
    "In the US, where more streaming services are available, Netflix has lost some valuable pieces from its library – The Office is a big one, and the previous selection of Disney titles has been drained to a handful of titles in the wake of Disney Plus' launch.",
    "Still, the service regularly gets great older movies from other studios (The Social Network, Batman Begins and Training Day are just some of the highlights you can watch right now), and still has a big selection of non-Netflix original series that are worth streaming, like The Good Place, Chappelle's Show or New Girl. It's clear the service is reacting to a market where all the places it used to license movies are (belatedly) trying to launch their own streaming services, but it's definitely holding its own.",
    "That said, it's hard not to miss the old world where Netflix was the only real game in town.",
    "In the UK, Netflix feels in particularly healthy shape. As well as ongoing local originals like Sex Education and Top Boy, with many more to come, Netflix's overall library differs significantly to the US.",
    "For example, the British version has niceties like the Studio Ghibli library of animated movies, as well as a suite of highly bingeable US sitcoms you simply can't get on the service in America: The Office, Superstore, Parks and Recreation and It's Always Sunny in Philadelphia for example. It's also the home to a number of US imports made by other studios, like RuPaul's Drag Race, Star Trek: Discovery and DC series Titans, as well as every episode of Rick and Morty.",
    "Netflix's originals are consistent across the globe – but these local factors are worth considering when judging the value of the service overall.",
    "When Netflix started its rollout of original shows with House of Cards, this seemed like a statement of intent – that the service perhaps saw itself as a rival of HBO, or other homes to prestige-style shows with big movie actors. This was how it'd make a mark as an outlet of original programming, by turning fancy TV into something of an arms race.",
    "Over time, it became clear that Netflix saw itself as more all-encompassing than that. Reality shows like Love is Blind, documentaries like Tiger King or the service's numerous cooking shows are just as important to Netflix now as House of Cards was then.",
    "The identity of Netflix has instead solidified into that of a service designed to appeal to all – everything from anime to kids' entertainment is part of the package, here.",
    "But that's not to say prestige TV has gone away on Netflix. The Crown continues to be a serious awards contender, and so was breakout hit The Queen's Gambit. The Witcher feels like something that only really existed because Game of Thrones – a big budget production – came first and proved it viable for Netflix to invest similarly in a big fantasy drama.",
    "Would The Queen's Gambit have become a success in 2020 if it wasn't on Netflix? It's possible, but not certain: it did feature a rising star in Anya Taylor-Joy, and was made by Scott Frank, a veteran screenwriter and director with everything from Get Shorty to Logan to his name. But Netflix's enormous subscriber base – 200 million users worldwide and counting – absolutely helped in turning the show into a quick viral success.",
    "That's because no matter where you are in the world, you can get Netflix, and its library of original content will follow you around. This breaks down the barriers of something becoming a worldwide phenomenon – it's a far cry from the olden days, where something like Desperate Housewives or Lost would break out on US network TV, and other countries would have to wait for a local broadcaster to pick it up.",
    "In short, Netflix can be an instant hitmaker.",
    "When the streamer rolled out The Queen's Gambit, it launched everywhere. Maybe this period chess drama could've been a success if it started on a US network and slowly got picked up around the world. But sometimes, it feels like Netflix's content is a perfect match for the platform – and this was one of those occasions. If you didn't have Netflix, you could've missed out on a massive TV event.",
    "Even if Netflix doesn't pack a big property like Star Wars or Marvel, it's proven it's able to dominate the pop culture conversation without anything like that.",
    "Essentially, Netflix is designed to give you all the same kinds of programming you find elsewhere, but in one place. It's trying to be a single destination for all your entertainment needs – which is different from Disney Plus, which feels more specifically targeted around families, at least in the US.",
    "Netflix's originals, then, won't always be targeted at you. And that can mean that a month or so might go by without something you really want to watch – which isn't an issue limited to just Netflix. Still, the service can't really be faulted for its range of shows, and the inclusion of international series gives it a more varied library than you'll find on some of the other streamers.",
    "It's also proven to be a big winner during the pandemic by actually having movies in an otherwise fallow time – and a new Netflix original movie will land at least once a week throughout 2021. They won't all be great, of course, but Netflix is making some good moves in this area.",
    "When a new service launches without a watch list function – which happened just last week with Paramount Plus – our immediate impulse is to compare the features of a service to Netflix. That's because it's still the high watermark for how a streaming app is designed, and how broad the functionality is.",
    "Not everyone likes Netflix's algorithmic approach to highlighting content, which is probably why competitors like Disney Plus and HBO Max have embraced more curated libraries, and branded sections on their apps.",
    "But really, for a service with as much stuff as Netflix, the way it hazards a guess at what you might like is kind of novel – and you can always reject the suggestions and watch something else. If nothing else, with Netflix, your subscription fee always gets you a great technical experience.",
    "No, we don't think so. It's definitely easy to see there being some months where you're not feeling it on the content Netflix puts out – but generally, we're pretty happy with the volume of originals landing on the service. This year alone, we're excited to see The Witcher season 2, Sex Education season 3 and Stranger Things season 4 arrive on the service, each of which will absolutely be at the center of pop culture when they land.",
    "That said, streaming services are an indulgence. And we live in an economically challenging time for a lot of people – so if you feel like you can live without Netflix shows for a few months, cancelling it might not be the worst thing in the world. Both the US and UK have numerous free (or at least licence fee-supported, for British users) streaming options which are likely to have something you want to watch. In the US, these include Pluto TV and Peacock's free tier, and in the UK you've got BBC iPlayer and All4, among others.",
    "Ultimately, FOMO is the weapon of these services – it's why they go so big on originals that get people talking. What you don't want to end up with is a multitude of monthly bills to services you're not going to use.",
    "We don't think that's likely to ever be the case with Netflix, however. We've found that it's still at the center of our streaming lives – even if not every original show hits the mark."
  ],
  "headers": {
    "4": "Where you live might determine the value of Netflix",
    "10": "Netflix Originals are mixed overall – but there are so many of them",
    "22": "The app experience is still world class",
    "25": "So, should you cancel your subscription to Netflix in 2021?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Star": "https://www.techradar.com/news/disney-plus-star-explained",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "many more to come": "https://www.techradar.com/news/netflix-just-revealed-7-new-tv-shows-including-one-you-wont-want-to-miss",
    "The Crown": "https://www.techradar.com/news/the-crown-season-5",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4"
  }
}