{
  "source": "https://www.techradar.com/news/we-hope-the-elder-scrolls-6-looks-as-good-as-this-ps5-and-xbox-series-x-upgrade",
  "title": "We hope The Elder Scrolls 6 looks as good as this PS5 and Xbox Series X upgrade",
  "category": "gaming",
  "updated": "2021-04-01T10:30:34Z",
  "author": "vic-hood",
  "summary": "The Elder Scrolls Online's next-gen upgrade is arriving in June",
  "article": [
    "The Elder Scrolls Online Console Enhanced edition releases for PS5 and Xbox Series X on June 8, 2021 and could give us an idea of what to expect from the upcoming The Elder Scrolls 6.",
    "According to the ESO website, this enhanced edition allows the online multiplayer RPG to \"run natively on the Xbox Series X/S and PlayStation 5, harnessing the horsepower of new-generation console tech to dramatically improve the game’s visual fidelity and performance on those machines\".",
    "That means players can look forward to a 60fps \"performance mode\", doubled draw distance, reduced loading times, high-resolution textures, updated antialiasing, as well as improved reflections, lighting and depth of field.",
    "Those who already own a PS4 and Xbox One version of The Elder Scrolls Online can upgrade to the PS5 or Xbox Series X version for free, with the upgrade immediately available to those who purchase the game.",
    "You can check out how all these improvements look in the video below, which shows side-by-side comparisons of the last-gen versions and the new-gen versions.",
    "With news on The Elder Scrolls 6 thin on the ground, we're hoping that this next-gen upgrade for ESO points to some of the visual fidelity and performance we can expect from the next mainline entry in The Elder Scrolls series.",
    "It still remains unclear when The Elder Scrolls 6 will arrive but we're hoping to hear more on the new Elder Scrolls during Microsoft/Bethesda's showcase this \"Summer\", so likely sometime in June.",
    "The Elder Scrolls Online: Console Enhanced launches on Xbox Series X/S and PlayStation 5 alongside the Blackwood Chapter and Update 30 on June 8."
  ],
  "headers": {
    "5": "A look at things to come?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "ESO website": "https://www.elderscrollsonline.com/en-us/news/post/59775?linkId=115039773"
  }
}