{
  "source": "https://www.techradar.com/news/dji-mavic-3-leak-confirms-one-key-upgrade-that-could-help-it-soar-above-rivals",
  "title": "DJI Mavic 3 leak confirms one key upgrade that could help it soar above rivals",
  "category": "cameras",
  "updated": "2021-10-18T11:16:29Z",
  "author": "mark-wilson",
  "summary": "DJI's battery-themed teaser now makes more sense",
  "article": [
    "The DJI Mavic 3 drone appears to be edging closer to its official take-off – and a new leak seemingly confirms that it'll have one crucial upgrade over its predecessor.",
    "As spotted by @DronefriendlyB on Twitter and picked up by @OsitaLV (below), a battery label for the incoming drone has appeared in the FCC database, which is the US licensing body for certifying radio-based tech.",
    "As well as confirming that the much-anticipated drone with be called the DJI Mavic 3, dropping the 'Pro' moniker from its DJI Mavic 2 Pro predecessor, it also shows that its battery will be a 5,000mAh affair. If so, that would be a huge boost in capacity from the Mavic 2 Pro's 3,950 mAh battery.",
    "While this doesn't necessarily mean a huge boost in flight time, previous leaks from @JasperEllens on Twitter have suggested that the DJI Mavic 3 will be able to stay in the air for 46 minutes per charge. If that's case, it'd mean a huge 15-minute (or 48%) battery life increase over the Mavic 2 Pro.",
    "Flight times are affected by a variety of factors, including local conditions and wind speeds, so we'll be keen to test how well this official battery life stands up to real-world conditions. For example, we found that the Mavic 2 Pro's official 31-minute flight time was more like 20-25 minutes in practice.",
    "But it's a promising spec that would take DJI's flagship consumer drone to the next level – and above most of its compact, folding rivals. By comparison, the Skydio 2's 4,280 mAh battery only produces around 23-minute flight times. That said, the larger Autel Evo II Pro has really taken compact drone battery lives up a notch with its 7,100 mAh battery for a 40-minute flight time.",
    "The battery leak also means DJI's teaser for its next three launches, which it revealed on social media last week, makes a little more sense. The icon for its November 5 launch appeared to match leaked images of the Mavic 3's battery. And if the drone does indeed make a 48% improvement over its predecessor in this area, then it'll likely be a key selling point that DJI will want to crow about.",
    "Battery life is an unglamorous but crucial spec when it comes compact drones. While we were impressed with the autonomous smarts of early folding drones like the original DJI Mavic Pro in 2016, they could barely stay in the air for more than 20 minutes. When you factor in take-offs and landings, that gives you very little time to get the aerial shots or footage you want.",
    "The DJI Mavic 2 Pro remains an excellent drone, but its limited battery life has always been one of our main complaints. Still, the difficulty for drones, compared to ground-based cameras, is that any added weight will directly affect their flight times – which is also a problem when you factor in growing expectations for the performance of their camera.",
    "If the DJI Mavic 3 is indeed able to squeeze a 46-minute flight time from that 5,000mAh battery, it wouldn't necessarily set a new bar for compact drones – the Autel Evo II Pro has been class-leading in that regard with its 40-minute battery life. But it would be very impressive for a drone that is strongly rumored, thanks to a leaked manual, to have a Four Thirds sensor.",
    "A Four Thirds sensor has almost twice the surface area of a 1-inch sensor – that means a much more light-gathering power, but also a lot more work for its on-board processor. Throw in all of the other demands on a drone, including obstacle avoidance and autonomous flight modes, and it's easy to see why small drones still aren't able stay in the air for hours.",
    "But if the leaks are true, the DJI Mavic 3 could well give us 30-minutes of usable flight time (beyond take-offs and landings) to get our aerial 4K videos and photos. And that would make it the leader of DJI's range in terms of sheer practicality, leaving aside the performance of that new camera."
  ],
  "headers": {
    "7": "Analysis: Lift-off for more practical drones"
  },
  "links": {
    "DJI Mavic 3": "https://www.techradar.com/reviews/dji-mavic-3",
    "@DronefriendlyB": "https://twitter.com/DronefriendlyB",
    "@JasperEllens": "https://twitter.com/JasperEllens/status/1441091686654906370/photo/2",
    "revealed on social media last week": "https://www.techradar.com/news/dji-announces-huge-triple-launch-will-we-see-the-dji-action-2-and-dji-mavic-3-pro",
    "DJI Mavic Pro": "https://www.techradar.com/reviews/gadgets/dji-mavic-pro-1329469/review",
    "a leaked manual": "https://twitter.com/JasperEllens/status/1441091686654906370/photo/2"
  }
}