{
  "source": "https://www.techradar.com/news/this-device-could-turn-your-xbox-series-s-into-the-ultimate-portable-console",
  "title": "This device could turn your Xbox Series S into the ultimate portable console",
  "category": "gaming",
  "updated": "2021-06-11T16:47:16Z",
  "author": "hamish-hector",
  "summary": "Move over Nintendo, Xbox has its own ‘Switch Pro’",
  "article": [
    "Update: We previously stated that the xScreen could power itself and the Xbox Series S using an internal battery. This was an error and we've edited the following piece accordingly.",
    "Your Xbox Series S might soon become the world’s best portable console thanks to a new Kickstarter that’s launching soon. The newly announced xScreen can attach to your Series S to finally give you the on-the-go Xbox experience you’ve been waiting for.",
    "The xScreen is an 11.6” 1080p 60hz IPS designed to fit your Xbox Series S like a laptop screen; it’s just the right size so that it sits flush with the edge of your console when closed. Weighing only 1.5lbs (695g) it’ll bring the total mass of your console up to just 5.75 lbs (around 2.7kg) - so if you can slip it in a backpack this shouldn’t be too hard to carry around with you.",
    "It comes with all the required adapters and clips you’ll need to attach it to your console. The only downside is that you'll need to carry around a power cable, though UPspec Gaming has informed us that they have plans to sell an add-on to power the setup with batteries at some point in the future.",
    "UPspec Gaming, the company behind the xScreen, has put out a promotional video showing off what the xScreen will look like in action. You can check it out for yourself here.",
    "As with many other Kickstarter projects, it's worth taking everything that's currently known about the xScreen with a pinch of salt as the final product might look and act a little differently.",
    "However, if you’re interested in getting an xScreen as soon as you can you can, head to the official website to register your interest and be alerted when the Kickstarter launches. You can also reserve the xScreen and net an early bird discount if you act fast, with the full retail price set at $249 (around £175 / AU$320)."
  ],
  "headers": {
    "4": "Check out the xScreen in action"
  },
  "links": {
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "official website": "https://xscreen.upspecgaming.com/"
  }
}