{
  "source": "https://www.techradar.com/news/apple-podcast-subscriptions-delayed-to-june-for-last-minute-tweaks",
  "title": "Apple Podcast Subscriptions delayed to June for last-minute tweaks",
  "category": "phones",
  "updated": "2021-05-28T23:28:32Z",
  "author": "david-lumb",
  "summary": "Apple has delayed its Podcast Subscriptions launch by a month",
  "article": [
    "If you’ve been eager to sign up for Apple Podcasts Subscriptions, first announced during the April Spring Loaded event, you’ll have to wait a little longer: originally slated to launch in May, paid subscriptions in the iOS Podcasts app has been delayed until June to make last-minute tweaks.",
    "Apple announced the delay in an email to podcasters seen by 9to5Mac, but didn’t explain exactly why the rollout would happen a month later – only that the company needed more time:",
    "“To ensure we are delivering the best experience for creators and listeners, Apple Podcasts Subscriptions and channels will now launch in June. We will communicate further updates on availability, and best practices to help you prepare your subscriptions and channels, through this newsletter,” the email reportedly read.",
    "Separately, Apple also acknowledged issues some creators have experienced with the Apple Podcasts directory, which has led to slower show updates for listeners – and some podcast feeds disappearing entirely from searches, an issue that could affect third-party apps and clients that rely on the iTunes Store API for data, as 9to5Mac pointed out when the issue surfaced in April.",
    "Apple also apparently acknowledged that fans weren’t terribly happy with the Apple Podcasts application redesign that launched with iOS 14.5 – and based on the feedback, changes will be coming to the app, starting with the just-released iOS 14.6 with more improvements for the Library arriving in the coming weeks."
  ],
  "headers": {},
  "links": {
    "Apple Podcasts Subscriptions": "https://www.techradar.com/news/apple-podcasts-subscriptions",
    "April Spring Loaded": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "9to5Mac": "https://9to5mac.com/2021/05/28/apple-delaying-podcasts-subscriptions-launch-until-june-promises-improvements-to-podcasts-app/amp/?__twitter_impression=true",
    "surfaced": "https://9to5mac.com/2021/04/21/apple-podcasts-directory-issues/",
    "iOS 14.6": "https://www.techradar.com/news/ios-146-has-landed-and-it-includes-some-big-new-features"
  }
}