{
  "source": "https://www.techradar.com/news/macbook-pro-models-could-regain-hdmi-ports-and-sd-readers-in-2021",
  "title": "MacBook Pro models could regain HDMI ports and SD readers in 2021",
  "category": "computing",
  "updated": "2021-03-10T12:29:44Z",
  "author": "jess-weatherbed",
  "summary": "Is Apple going back to basics?",
  "article": [
    "The HDMI port and SD card reader could be making a return to at least two MacBook Pro models expected to release in the second half of 2021 according to respected analyst Ming-Chi Kuo, who outlined his predictions in a note to investors. The last time a MacBook Pro included these features was back in 2015, with all models since omitting those ports in favor of USB-C and Thunderbolt 3 connections that require a separate dongle for image transfers or additional displays.",
    "A Bloomberg report initially suggested the return of the SD reader and HMDI port, with Kuo's statements giving some additional weight to those claims. This was in addition to the rumor that Apple will be releasing redesigned MacBook Pros in two sizes in late 2021 with a 16-inch model and a new 14-inch model. These new MacBook Pros will reportedly come with upgraded versions of Apple’s M1 chip, which debuted to great acclaim last year with the MacBook Air (M1, 2020), MacBook Pro 13-inch (M1, 2020) and Mac mini (M1, 2020). The report also suggests that Apple could be killing off the controversial Touch Bar and bring back the MagSafe charger, both of which have had mixed reactions from Mac users since the features were introduced. It hasn't been confirmed if these features would be rolled out across the new MacBook Pro models or offered as an optional variant.",
    "Kuo claims that Taiwan's Genesys Logic will exclusively supply the SD card readers set to feature in the unreleased MacBook Pro models, and the company could be playing a larger ongoing role in Apple's product line. These predictions have already gained some criticism due to the modern advancements in technology that make the port inclusions feel outdated. Many new monitors support a USB-C connection, and some DSLR camera models have moved on to XQD and CFexpress Type B. For anyone that still requires HDMI connectivity or SD card readers, not having to carry around an additional dongle could bring some quality of life features back into the MacBook range. As with all rumors, we won't know for sure until the updated range of MacBook Pro launches or Apple makes an official statement.",
    "Via Apple Insider"
  ],
  "headers": {
    "2": "Intuitively in-built (again)"
  },
  "links": {
    "Bloomberg report": "https://www.bloomberg.com/news/articles/2021-01-15/apple-macbook-pros-with-magsafe-return-in-the-works",
    "MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro 13-inch (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Mac mini (M1, 2020)": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "SD card": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "DSLR camera": "https://www.techradar.com/news/best-dslr",
    "Apple Insider": "https://appleinsider.com/articles/21/02/23/macbook-pro-will-regain-sd-card-reader-and-hdmi-port-in-2021-kuo-says"
  }
}