{
  "source": "https://www.techradar.com/news/12-month-ps-plus-deals-are-now-under-dollar-30-big-savings-annual-membership",
  "title": "12 month PS Plus deals are now under $30 - save over 50%",
  "category": "gaming",
  "updated": "2021-04-21T15:49:55Z",
  "author": "tabitha-baker",
  "summary": "PS Plus deals are now over half off",
  "article": [
    "PS Plus deals are offering half price memberships at CDKeys this weeks, with 12 month PlayStation Plus subscription only costing $29.39. That's a significant price crash, and far cheaper than simply renewing your PS Plus membership at the usual $59.99 annual rate.",
    "Of course, if you're just looking to test out the service you can always sign up for a shorter membership. CDKeys has also cut the price of a three-month PS Plus subscription in half to $15.39 (was $27.99) as well. While the annual price offers far better value, you can use the cheaper three-month option to see whether a PS Plus membership really is worth it for you.",
    "PS Plus is required for online play, but it also gives you access to free games every month, exclusive store discounts, and a collection of PS4's greatest hits as well. If you're on PS5, you'll also be able to find hints and walkthroughs straight from your game.",
    "So, whether you've just managed to buy a PS5 or you need to sign up for another year, CDKeys' latest PS Plus deals stand to save you some considerable cash this weekend.",
    "Not in the US? You'll find more PS Plus prices in your region further down the page.",
    "We're rounding up all the latest PS5 game deals for even more savings, or if you're looking to kit out your console check out the latest PS5 DualSense prices and cheap gaming headset deals."
  ],
  "headers": {
    "5": "More PS Plus membership deals"
  },
  "links": {
    "only costing $29.39": "https://www.cdkeys.com/1-year-playstation-plus-membership-ps3-ps4-ps-vita-digital-code?mw_aref=games16&data1=trd-us-5787237404662514000",
    "to $15.39 (was $27.99)": "https://www.cdkeys.com/3-month-playstation-plus-membership-ps3-ps4-ps-vita-digital-code-usa?mw_aref=games16&data1=trd-us-7413326528626412000",
    "buy a PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "PS Plus prices": "https://www.techradar.com/news/playstation-plus-deals",
    "PS5 game deals": "https://www.techradar.com/deals/best-cheap-ps5-game-deals-and-prices",
    "PS5 DualSense prices": "https://www.techradar.com/news/dualsense-ps5-controller-deals-price-sales",
    "cheap gaming headset deals": "https://www.techradar.com/deals/the-best-cheap-gaming-headset-deals"
  }
}