{
  "source": "https://www.techradar.com/news/apple-vr-headset-project-gets-a-boost-as-ex-ipad-lead-apparently-joins-the-team",
  "title": "Apple VR headset project gets a boost, as ex-iPad lead apparently joins the team",
  "category": "wearables",
  "updated": "2021-02-09T17:20:33Z",
  "author": "hamish-hector",
  "summary": "From iPad to eye-Pad",
  "article": [
    "We may finally know who is overseeing Apple’s rumored VR and AR projects. After a secret move within the company last month it appears that Dan Riccio will be lending his insight into the Apple VR headset and AR glasses.",
    "The ex-senior vice president of hardware has been with Apple since 1998. While he would have supervised his new team in his previous role, this new job allows all of his time and effort to be devoted to VR and AR projects.",
    "Dan Riccio allegedly joins Mike Rockwell, along with estimates of over a thousand engineers that are currently working on the (as of yet) unannounced projects.",
    "Through both his vice president of iPad hardware engineering and later senior vice president of hardware positions, Riccio would have played a key part in some of Apple’s biggest hardware from the past decades, including iPhone, iPad, Mac and iPod devices.",
    "While none of this instantly lends itself to VR and AR technologies specifically, his understanding of the Apple brand shows he has the capabilities to help bring yet another product to fruition. He already did so with the iPad, being one of the team’s earliest leads, so we’re sure his expertize will do him well with Apple’s latest VR and AR endeavors.",
    "The first Apple VR headset is expected in 2022 and is rumored to cost around $3,000. At this price tag, your typical consumer might not be able to pick one up, but some pretty impressive tech could await those who do. Allegedly boasting dual 8K screens, LiDAR sensors, and all in a wireless format, the Apple VR headset could very quickly rise as the cream of the industry’s crop."
  ],
  "headers": {
    "3": "Who is Dan Riccio?"
  },
  "links": {
    "rumored VR and AR projects": "https://www.techradar.com/news/apple-vr-headset",
    "allegedly": "https://www.bloomberg.com/news/articles/2021-02-08/apple-s-riccio-shifts-from-hardware-chief-to-ar-vr-headsets",
    "Apple VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "8K screens": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "LiDAR": "https://www.techradar.com/news/what-is-a-lidar-scanner-the-iphone-12-pros-rumored-camera-upgrade-anyway#:~:text=As%20we'll%20discover%2C%20LiDAR,a%20lesser%20extent%2C%20photography%20too."
  }
}