{
  "source": "https://www.techradar.com/news/how-to-watch-the-morning-show-season-2-online-and-stream-the-apple-tv-plus-series-now",
  "title": "How to watch The Morning Show season 2 online and stream the Apple TV Plus series now",
  "category": "computing",
  "updated": "2021-09-17T05:00:45Z",
  "author": "daniel-pateman",
  "summary": "Stream season 2 of this award-winning drama from Apple TV Plus",
  "article": [
    "Will The Morning Show recover after Alex and Bradley blew the whistle on UBA executives live on air, putting their careers and the network’s future in jeopardy? This flagship series from Apple TV Plus is back for more behind the scenes drama, on-air rivalry, and awards worthy performances from an excellent A-list cast. Read on for how to watch The Morning Show season 2 online from anywhere now.",
    "The Morning Show unites American sweethearts Jennifer Anniston and Reese Witherspoon as Alex Levy and Bradley Jackson respectively: two strong willed women thrown together to co-anchor a beloved news programme when a sexual misconduct scandal breaks. Steve Carell is at the center of the storm as Mitch, whose golden boy reputation implodes after accusations of inappropriate behavior, while Billy Crudup dazzles as the devil-may-care network executive hired to boost flagging ratings.",
    "Season 2 begins a few months after the damning revelations. Bradley is still waking up America, alongside her ostensible new co-host Eric Nomani (Hasan Minhaj), and “this coronavirus thing” is quickly gaining momentum. Alex, meanwhile, has stepped out of the limelight. But the imminent publication of an exposé by journalist Maggie Brenner (Marica Gay Heart) could just total the success of her TV comeback.",
    "In addition to the original cast, there’s new blood in the form of the Patriot Act’s Hasan Minhaj, multi-award winner Julianna Margulies, and Greta Lee as a UBS tech wunderkind. Plus, there’ll be guest appearances from Will Arnett and Kathy Najimy.",
    "Don’t let this riveting Apple Original drama pass you by. Find out below how to watch The Morning Show season two online, with a subscription to Apple TV Plus.",
    "While Apple's answer to Netflix has a comparatively tiny library of films and shows to get stuck into – 80 and counting – what's available is top-notch, well-produced fare with little in the way of filler.",
    "The Morning Show was the calling card for Apple TV Plus at launch, costing $15 million per episode. It was complemented by the epic sci-fi drama See starring Jason Momoa, space drama For All Mankind, and period comedy Dickinson. Following this was exciting new programming like M. Night Shyamalan’s moody horror series, Servant, and the experimental thriller Calls.",
    "Of course, the service's breakout hit has been the Jason Sudeikis comedy Ted Lasso, following the titular American football coach hired to manage a Premier League football team. It's earned an army of fans and a impressive amount of awards attention, netting 20 Primetime Emmy nominations this year – a record for a freshman series.",
    "The small but great library is set to grow at a steady pace - alongside recent seasons of Ted Lasso and The Morning Show, Apple TV Plus looks to have a pretty strong-looking upcoming schedule of new exclusive content.",
    "The Martin Scorsese-directed Killers of the Flower Moon, promises a 'large-scale Western' that stars big guns Leonardo DiCaprio and Robert De Niro.",
    "The Shrink Next Door, meanwhile, is a new comedy series based on the 2019 podcast of the same name, that is set to bring together Will Ferrell and Paul Rudd, while on September 24 Foundation arrives, the much-anticipated sci-fi series based on the books by Isaac Asimov, and starring Chernobyl's Jared Harris and Lee Pace.",
    "Read more:"
  ],
  "headers": {
    "5": "What else should I know about Apple TV Plus?"
  },
  "links": {
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "The Morning Show": "https://www.techradar.com/news/season-2-of-apple-tv-plus-flagship-show-finally-has-a-release-date",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know"
  }
}