{
  "source": "https://www.techradar.com/news/ted-lasso-season-3-what-we-know-so-far",
  "title": "Ted Lasso season 3: what we know so far",
  "category": "entertainment",
  "updated": "2021-12-02T12:45:52Z",
  "author": "tom-power",
  "summary": "Believe one final time in Ted Lasso season 3",
  "article": [
    "Spoilers follow for Ted Lasso seasons 1 and 2.",
    "Ted Lasso season 3 is on the way – but, for fans of the award-winning soccer comedy-drama TV show, it may well be the final entry in the series. Well, for Apple TV Plus' mainline show, anyway.",
    "The unexpected hit show has provided lots of laughs, emotional story beats and surreal anecdotes since August 2020 but, as the saying goes, all good things must come to an end. And, judging by more comments made by co-creator Brett Goldstein, it seems like the series' chief creative team isn't deviating from their original plan for a three-season arc.",
    "Before we get into that, though, what can we expect from Ted Lasso’s third season? Lots of humor, positivity, character development and an increase in the drama stakes, mostly. But there are also plenty of story threads that the show needs to wrap up, so its showrunners have a lot to fit into Ted Lasso season 3.",
    "Below, you’ll find everything you need to know about Ted Lasso season 3, including its cast, potential plot points, when it might be released and more.",
    "A word of warning: spoilers follow for seasons 1 and 2 of Ted Lasso. If you aren’t caught up on the TV show, turn back now or you'll have it ruined for you.",
    "There’s no official release date yet. Speaking to Deadline, however, co-creator Bill Lawrence revealed that he’d like Ted Lasso season 3 to stick to the show’s annual summer release. Providing that there are no issues with filming or post-production, season 3 could debut in late summer 2022.",
    "“We always try to be close to a year apart,” Lawrence said. “So I would hope to see the show back in the August-type area. We worked around the Olympics for this past season.”",
    "Work has already begun on season 3’s scripts, too. Appearing on an episode of Ellen in October 2021, co-creator and lead actor Jason Sudeikis confirmed that the show’s writers had spent three weeks working on scripts so far. At this point, then, the writing team should have a clearer idea about what season 3's story will entail.",
    "As for when filming could begin, Nick Mohammed, who plays Nate in Ted Lasso, suggested that principal photography may begin in January (per Collider), which mirrors when season 2 production kicked off. If it does, season 3 may again arrive around August time as Lawrence hints at, providing the first couple of episodes are shot and edited in time.",
    "Once we learn more about a concrete launch date, we’ll update this section.",
    "You can expect most (if not all) of Ted Lasso’s main stars to return. That includes:",
    "Prominent members of Ted Lasso’s supporting cast are also likely to return. That should include Kola Bokinni as Isaac McAdoo, David Elsendoorn as Jan Maas, Annette Badland as pub landlord Mae and Anthony Head as Rupert Mannion.",
    "Lawrence has also confirmed that James Lance’s Trent Crimm and Sarah Niles’ sports psychologist Sharon will feature in season 3. Speaking to Deadline, Lawrence teased: “I can tell you both of them have significant roles next year.”",
    "Other guest stars may be brought back into the fold but, right now, we aren’t sure who will reprise their roles. One potentially amusing cast addition would be Anthony Hopkins. Speaking as part of Mythic Quest’s season 3 and 4 renewal, which you can see in the tweet below, Hopkins revealed that he’d like to join Sudeikis and company. But, he joked, only if he could be Keeley’s new boyfriend. We think Roy would have something to say about that.",
    "We’ll let you know once we have confirmation of who’s returning, as well as any new cast members (Richmond are bound to make some new signings, right?).",
    "There are two major plot points that season 3 needs to deliver on.",
    "The first concerns AFC Richmond’s Premier League return. After they secured promotion on the final day of last term, Richmond are back in the big time, but it won’t be easy to try and secure an unprecedented Leicester City-level title triumph.",
    "19 other clubs stand in their way, of course, including Manchester City. It was the Citizens who relegated Richmond in their final top-flight match in season 1, and it was also City who thrashed them 5-0 in season 2’s FA Cup semi-final. So we’re hoping that Richmond will finally get one over one of their biggest rivals in Ted Lasso season 3.",
    "But City won’t be the only rival that Ted and his players have to contend with in the show’s third outing. In the season 2 finale, viewers were furious to learn that Nate, Ted’s former prodigy, had joined West Ham to become their new manager. His appointment comes in the aftermath of Rebecca’s former husband, Rupert Mannion, becoming the Hammers’ new owner.",
    "So season 3 is gearing up to pit the master versus his apprentice at some point. Taking to Twitter after season 2’s last episode, Nate actor Nick Mohammed posted an intriguing 12-point document that reveals why Nate came to resent Ted and opted to join West Ham. It’s a fascinating insight into Nate’s character arc throughout season 2, so it’s worth checking out:",
    "Hopefully, one of Ted Lasso season 3’s episodes will deliver a titanic clash between Richmond and West Ham, which would put Ted and Nate at odds on the pitch. As much as we can’t wait to see if Richmond will beat Manchester City, we’re also very eager to see Ted and Nate clash, from a tactical standpoint, from the dugout.",
    "For what it’s worth, Mohammed isn’t giving anything away about Nate’s season 3 arc. “I know where things are heading,” he told Collider. “But I obviously can’t give anything away about season 3. They’re writing season 3 right now, so everything is still up for grabs. Obviously, I can imagine the fans of the show would love to see the circle complete and it become a redemption arc, but who knows?”",
    "Away from the pitch, Ted Lasso season 3 will also need to wrap up smaller story threads. For one, audiences need some closure on Rebecca and Sam’s on-off relationship. The pair were no longer dating by the season 2 finale, but we imagine this isn’t the end of their romantic dalliance.",
    "Speaking of relationship issues, it appears that Roy and Keeley may be hitting a rough patch, too. Keeley rejected Roy’s efforts to take her on a much-needed vacation in season 2 episode 12 – electing to stay in the UK and work on her newly-formed PR firm. It’s unclear what the future holds for this pair but, given that they haven’t officially broken up, we imagine that they’ll make amends and maybe tie the knot.",
    "From Ted’s perspective, it’ll be interesting to see if his panic attacks remain. Sports psychologist Sharon had helped him to get to grips with them by the end of season 2, but we suspect that they’ll continue to plague him. If Sharon has as big a role as Lawrence has teased, could she return to offer more counselling sessions to Ted? It’s plausible.",
    "Not only that, but we wouldn’t be surprised if Ted offered Trent Crimm a role at the club. In the season 2 finale, Trent revealed that The Independent had fired him for revealing the identity of his source (i.e. Nate) who leaked Ted’s panic attacks. Ted could use Trent’s expertise in a media capacity, so why not hire him? It would mean that all of the series’ main characters are under one roof (Nate aside), which would be a somewhat fitting way to bring the curtain down on the show.",
    "Regardless of where season 3 takes the show’s overall story, Lawrence promises that viewers could have worked out many of the series’ surprises from the beginning. So much so, in fact, that nothing in Ted Lasso season 3 should come as a shock when it does happen.",
    "“There will be lots of surprises,” he told Deadline. “But anyone who says, oh, where Nate ends up in the finale is a big surprise…we felt like we were setting that up from the very first episode of last year. The clues are there. Jason and I are huge non-spoiler people, but yeah, I think some of the writing is already on the wall, hopefully.”",
    "No. Shooting hasn’t begun yet, so it’ll be a while before we get a teaser. Once one is released, we’ll update this page.",
    "Right now, it would appear so. Sudeikis and Lawrence have previously spoken about Ted Lasso being a trilogy of sorts – i.e. a series that comprises three seasons. So we should prepare ourselves that this will be the series’ final season.",
    "That's a point that co-writer Brett Goldstein added further weight to in a chat with Mr. Porter, saying: \"We had a three-season arc planned. We are writing the end of that story. Whether there'll be more after that, we'll see, I genuinely don't know. But I do know that the story that we were telling over three years will be complete.\"",
    "Still, never say never on future instalments. Lawrence has teased the prospect of returning for more if Ted Lasso’s story warrants it, and told Deadline that there may be a way of stretching the show’s overarching narrative out for another two seasons.",
    "“What’s tough to process for me as a writer who is used to writing network comedy is, this was the end of the season, but the midway point of the show,” Lawrence said. “When we first pitched this particular story, we said this series was only going to be three seasons. And I would probably stay clean and say that even if Ted Lasso goes on, the story the writing staff has been telling had a beginning, middle and end for the first three seasons. And then it might veer off from that.”",
    "The ‘veering off’ aspect , which Lawrence alludes to, may be an entirely new tale told in the Ted Lasso universe. Speaking to THR, Lawrence said: “When we started, we plotted out everybody’s beginning, middle and end of a three-season arc. This story is going to be over next year, regardless, even if the show finds another story to tell and goes on.”",
    "Sudeikis, though, was more reluctant to discuss the show’s future after season 3. “I feel like a real coach when I have to tell folks you can’t look at season 4 when we're in the middle of season 3,\" he told Entertainment Tonight. \"We can’t worry about the championships when we're in the first round of playoffs, you know?”",
    "Hopefully, then, we do get a fourth season or even a couple of one-off specials. And, honestly, we’d be down for that. We’re not ready to say goodbye to any of Ted Lasso’s characters yet, and we could certainly use more of the show’s wonderful positivity. In the vein of the show’s iconic single-word phrase – “Believe” – we’re keeping faith that Ted Lasso will continue after season 3’s final episode. And we won’t be convinced otherwise."
  ],
  "headers": {
    "6": "Ted Lasso season 3 release date: 2022?",
    "11": "Ted Lasso season 3 cast: who is returning?",
    "16": "Ted Lasso season 3 plot: what will it be about?",
    "29": "Ted Lasso season 3 trailer: is there one?",
    "30": "Ted Lasso season 3: is this the final season?"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/10/ted-lasso-season-2-finale-recap-spoilers-bill-lawrence-interview-1234852277/",
    "episode of Ellen": "https://www.youtube.com/watch?v=TypzX2WPgLU",
    "Collider": "https://collider.com/ted-lasso-nate-nick-mohammed-interview-season-2-episode-12-explained/",
    "Mr. Porter": "https://www.prf.hn/click/camref:1101l4JyV/pubref:trd-us-5925992567325645000/destination:https%3A%2F%2Fwww.mrporter.com%2Fen-us%2Fjournal%2Ffashion%2Factor-brett-goldstein-ted-lasso-roy-kent-interview-10146676%3Fcm_mmc%3DPartnerizeUK-_-skimlinks_phg-_-True%2BContent-_-305950%26utm_source%3Dpartnerize%26utm_medium%3Daffiliation%26utm_campaign%3Duk_305950%26utm_content%3Dskimlinks_phg%26clickref%3D1100liDs8t5z",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/will-success-keep-ted-lasso-from-sticking-to-its-three-season-plan-1235030460/",
    "Entertainment Tonight": "https://www.etonline.com/jason-sudeikis-on-ted-lasso-season-3-and-the-possibility-of-season-4-exclusive-174034"
  }
}