{
  "source": "https://www.techradar.com/news/did-microsoft-just-tease-windows-11-at-build-2021",
  "title": "Did Microsoft just tease Windows 11 at Build 2021?",
  "category": "computing",
  "updated": "2021-06-15T11:36:12Z",
  "author": "matt-hanson",
  "summary": "CEO references “next generation of Windows”",
  "article": [
    "At Satya Nadella’s keynote speech at Microsoft’s Build 2021 conference, which is running all week, the CEO mentioned that Microsoft is working on “one of the most significant updates to Windows of the past decade,” and that he was “incredibly excited about the next generation of Windows.”",
    "Many people assumed that he was talking about the Windows 10 Sun Valley update (also known as the Windows 10 21H2 update), which is a major update coming to Windows 10 later in 2021.",
    "After all, when Microsoft launched Windows 10 back in 2015, it declared that it was the “last version of Windows,” and rather than releasing a whole new version every few years, like it used to do.",
    "While the Sun Valley update is looking like a pretty big overhaul, bringing an updated look and new features, it was always assumed that it would be a Windows 10 update.",
    "To be fair to Microsoft, that’s exactly what it did. Six years later, Windows 10 remains the latest version, though regular major updates have meant that the Windows 10 of 2021 is quite different from the one launched in 2015.",
    "Crucially, though, it remains the same operating system, and has meant that there’s been no need for anyone to buy a new version.",
    "Nadella’s talk of the “next generation of Windows” could just be a bit of hype, or it could hint at a much larger shift for Windows in the future, perhaps Windows 11. While Apple followed a similar pattern – releasing 10.x updates to its rival macOS operating system every year (for free), last year it changed to macOS 11 for the Big Sur update, due – it said – to the changes that the new version brought.",
    "Could that spur Microsoft to move on from Windows 10? We know that Microsoft isn’t keen on having product names with lower numbers than its competitors – hence why the second Xbox console was the Xbox 360, not the Xbox 2, while Sony had the PlayStation 3.",
    "If Microsoft is moving on from Windows 10, then maybe we actually will see Windows 11. Microsoft was also working on Windows 10X, which was set to be a departure from Windows 10, but that operating system has been shelved, with many of its features now being rolled into Windows 10.",
    "So, was this a tease for Windows 10’s successor? Perhaps. At the time of writing, Build 2021 is still ongoing, so we will hopefully get more clues about the future of Windows there."
  ],
  "headers": {
    "4": "Change of plans?"
  },
  "links": {
    "Build 2021": "https://www.techradar.com/news/microsoft-build-2021",
    "Windows 10 Sun Valley update": "https://www.techradar.com/news/windows-10-21h2-update",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "Windows 10X": "https://www.techradar.com/news/windows-10x"
  }
}