{
  "source": "https://www.techradar.com/news/fan-of-the-pokemon-tv-show-now-you-can-watch-it-for-free-on-nintendo-switch",
  "title": "Fan of the Pokémon TV show? Now you can watch it for free on Nintendo Switch",
  "category": "phones",
  "updated": "2021-08-26T22:31:25Z",
  "author": "david-lumb",
  "summary": "Pokémon TV app on Switch has decades of the anime for free",
  "article": [
    "Did you watch the Pokémon cartoon show as a kid, or kept up through the years? Now you can watch episodes of the anime for free on the Nintendo Switch with the Pokémon TV app, which also includes a bunch of extra videos and other content.",
    "The Pokémon TV app has been available for phones and smart TVs since 2019, but its arrival on the Switch brings the content to a platform where plenty of Pokémon fans already are – not just those playing Pokémon Sword and Shield, but players of the new Pokémon Unite MOBA and waiting for the upcoming open-world Pokémon Legends: Arceus game.",
    "There’s more than just seven full series of the Pokémon anime – the app also includes videos for tips on Pokémon games, competitive broadcasts of Pokémon games, and even stuff specifically for younger viewers in a dedicated ‘Junior’ content category.",
    "While it doesn’t have every episode of every season of the anime, it does have complete seasons of the earliest and latest series along with some of the films, some of which are only on the service for a limited time, suggesting the content might rotate in and out. The Pokémon TV app is available to download for free on the Nintendo eShop.",
    "There’s nothing suggesting Nintendo will join the streaming content wars, and it’s not like there are many shows or movies of its characters over the years beyond a few Saturday morning cartoons and one infamous film. Pokémon has been the only Nintendo property to spread across multiple media, and has persisted over the years, so it makes sense that the Pokémon TV app would migrate to the Nintendo Switch.",
    "While the Switch’s 720p display isn’t the best for watching media, the Pokémon anime isn’t exactly known for high-resolution graphics – especially the original series that debuted in 1997 in Japan (1998 in the US and elsewhere), a time when cathode ray tube (CRT) screens and TVs commonly maxed out at 480p resolution.",
    "It’s interesting that so much Pokémon content is migrating from smartphones to the Nintendo Switch and vice versa – the Pokémon TV app started on mobile before coming to the console, while Pokémon Unite launched on the Switch and will soon become available on phones. Pokémon has always been synonymous with on-the-go gaming, a tradition which has lived on in Pokémon Go.",
    "While we wouldn’t expect the latter to arrive on the Switch given its reliance on location data and rear camera (for the AR purists), the relationship between console and smartphone seems to be getting stronger – which is good news for Pokémon fans.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Analysis: Pokémon is the only streaming Nintendo content"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Pokémon Sword and Shield": "https://www.techradar.com/reviews/pokemon-sword-and-shield-review",
    "Pokémon Unite MOBA": "https://www.techradar.com/news/pokemon-unite-release-date-announced-ios-android",
    "Pokémon Legends: Arceus": "https://www.techradar.com/news/pokemon-legends-arceus-trailer-release-date-news",
    "The Verge": "https://www.theverge.com/2021/8/26/22643450/pokemon-tv-now-available-on-nintendo-switch"
  }
}