{
  "source": "https://www.techradar.com/news/hubspot-challenges-wix-and-weebly-with-crm-focused-website-builder",
  "title": "Hubspot challenges Wix and Weebly with CRM-focused website builder",
  "category": "computing",
  "updated": "2021-08-04T08:28:24Z",
  "author": "abigail-opiah",
  "summary": "Another website builder has entered the scene",
  "article": [
    "Customer Relationship Management (CRM) platform HubSpot is looking to take the fight to popular website builder offerings such as Wix and Weebly with the launch of its CMS Hub Starter.",
    "An addition to the company's existing web CMS, Hub Starter is a tool for developers that looks to help generate new business through an organization's website.",
    "HubSpot says CMS Hub Starter can be utilised by marketers to build new websites, as it includes security features like SSL, a web application firewall, and a globally hosted CDN included in the package.",
    "Compared to other popular website builders, HubSpot's CMS Hub Starter for now costs $25 per month and is also available as part of the Starter CRM Suite bundle. It is usually $50 per month, or $45 per month if paid upfront.",
    "Speaking on the launch, Angela DeFranco, VP of product management at HubSpot, said: \"Over the past year, we've seen just how important it is for companies to be able to create reliable and effective digital experiences.",
    "\"In addition to providing the tools our customers need to get their website up and running, CMS Hub Starter is also built on top of our CRM platform to help companies leverage their own data to create a better end-to-end customer experience.\"",
    "The tool also features website themes that users can edit, which is common practise among website builders offering similar services.",
    "HubSpot said that the rationale behind the launch of CMS Hub Starter was to give companies the option to both adopt a simple web page builder that enables content creation, and have a legacy enterprise CMS that is extensible.",
    "\"CMS Hub Starter is going to be a game changer for scaling companies looking to take their digital experiences to the next level,\" said Kevin Barber, CEO and founder of Lean Labs.",
    "\"Where a traditional CMS can add pain and complexity to a marketer's day, CMS Hub Starter does the opposite by giving them the essential tools they need to build a remarkable website and start generating revenue, all at a price point that's accessible for smaller teams.\""
  ],
  "headers": {
    "3": "CMS overload"
  },
  "links": {
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Weebly": "https://www.techradar.com/reviews/weebly",
    "CMS": "https://www.techradar.com/best/cms",
    "CDN": "https://www.techradar.com/news/best-cdn-providers"
  }
}