{
  "source": "https://www.techradar.com/news/rtx-3080-in-stock-today-newegg-shuffle",
  "title": "Nvidia RTX 3080 and RTX 3070 Ti in stock at Newegg – and so is Xbox Series X",
  "category": "computing",
  "updated": "2021-06-25T17:02:55Z",
  "author": "matt-swider",
  "summary": "The Newgg Shuffle offers a chance to buy the RTX 3080, RTX 3070, RTX 3080 and RTX 3090. An Xbox Series X bundle is there too.",
  "article": [
    "Update: The Newegg Shuffle entries are about to close. Here's how to enter and get GPU restock alerts for next time.",
    "The RTX 3080 and RTX 3070 Ti are among the GPU restock items at Newegg today, June 17, as inventory for RTX graphics cards shows signs of improving. The retailer's 'Newegg Shuffle' lottery for popular items also has RTX 3090 and RTX 3060 available and an Xbox Series X bundle that's a better price than the Xbox Series X GameStop restock price we reported on first-hand in stores yesterday.",
    "Our 24/7 GPU restock Twitter tracker Matt Swider will send you can alerts when new graphics cards are in stock and you can get those GPU alerts – if you follow his Twitter account and turn on notifications. We're still waiting for a possible Best Buy RTX restock this week, including the overdue RTX 3070 Ti sale. It hasn't put this brand new GPU up for sale at MSRP even though the card launched last week, though we're not expecting a Best Buy PS5 restock today.",
    "Trust and credibility: Matt Swider has helped over 43,000 people get next-gen consoles through his Xbox and PS5 restock alerts, and he's now tracking GPU stock in the US. Here's an example of a GPU restock Twitter alert.",
    "There are four GPU options in the Newegg Shuffle today and that lone RTX 3080 GPU from Asus costs $1,379.98 as it comes with a $320 monitor by, you guessed it, Asus.",
    "The RTX 3070 Ti comes in two flavors: Gigabyte RTX 3070 Ti with a monitor for $1,539.98 and the MSI RTX 3070 Ti without a bundle required for $929.99. The RTX 3060 is the cheapest of the bunch with an unbundled option costing $469.99.",
    "The RTX 3090 is in stock, but costs more than $3,000 with either a motherboard or monitor. The Gigabyte RTX 3090 graphics card bundled with a PC case is a little more reasonable at $2,379.98, but still way above MSRP.",
    "Best Buy sometimes has weekly RTX GPU stock, and we saw some graphics cards in stock last Thursday, including the RTX 3080 and RTX 3070. Strangely, the RTX 3070 Ti, which launched on June 7, didn't go in stock at Best Buy. In fact, the add-to-cart button still saying 'Coming soon.'",
    "That's where GPU restock Twitter tracker Matt Swider is going to be able to help alert you to when to buy the RTX 3070 Ti and other GPUs including the RTX 3080 and RTX 3080. Best Buy GPU stock goes much faster than next-gen console restocks.",
    "It's a difficult process to actually be able to buy any RTX 30-series card right now. Hence why we've reported the news that eBay prices are more than three or four times the original MSRP for some RTX GPUs.",
    "We'll keep this page updated and RTX graphics cards go in stock and very quickly out of stock. There are very few options right now and we might not get much better until 2022, according to analysts we've talked to. Getting alerts at least gives you an edge when it comes to GPU restock opportunities."
  ],
  "headers": {
    "4": "GPU restock Twitter tracker news for June 17",
    "7": "RTX 3080 at Best Buy"
  },
  "links": {
    "shows signs of improving": "https://www.techradar.com/news/rtx-3080-prices-might-start-dropping-following-bitcoin-bust-says-nvidia-partner",
    "Xbox Series X GameStop restock": "https://www.techradar.com/news/exclusive-gamestop-xbox-series-x-restock-in-store-no-ps5",
    "GPU restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider.",
    "PS5 restock": "https://www.techradar.com/news/ps5-restock-today-best-buy-and-sony-direct"
  }
}