{
  "source": "https://www.techradar.com/news/the-new-mortal-kombat-movie-trailer-looks-gorgeously-gory",
  "title": "The new Mortal Kombat movie trailer looks gorgeously gory",
  "category": "entertainment",
  "updated": "2021-02-18T17:43:00Z",
  "author": "vikki-blake",
  "summary": "\"FINISH HIM\"",
  "article": [
    "Warner Bros. has dropped an all-new trailer for the Mortal Kombat movie coming to HBO Max in the US and theaters worldwide later this year.",
    "Given it hails from one of gaming's most violent franchises, the teaser is suitably gory, complete with a handful of the game's notorious finishers. Characters from the roster spotted so far include Sonya, Kano, Liu Kang, Jax, Kung Lao, and Lord Raiden.",
    "Here, check it out yourself, but because it's age-gated you might need to watch it on YouTube to confirm you're old enough:",
    "The movie follows the fortunes of Cole Young, a MMA fighter unaware of his heritage and clueless as to why Outworld's Emperor Shang Tsung has sent his best warrior, Sub-Zero, to hunt Cole down.",
    "\"Fearing for his family's safety, Cole goes in search of Sonya Blade at the direction of Jax, a Special Forces Major who bears the same strange dragon marking Cole was born with,\" the video description teases. \"Soon, he finds himself at the temple of Lord Raiden, where he trains with experienced warriors as he prepares to stand with Earth’s greatest champions against the enemies of Outworld in a high stakes battle for the universe.\"",
    "The new project will be led by director Simon McQuoid – a commercial filmmaker making his directorial debut – alongside producers James Wan (The Conjuring universe films, Aquaman), Todd Garner (Into the Storm, Tag), E. Bennett Walsh (Men in Black: International, The Amazing Spider-Man 2), and McQuoid himself.",
    "It was written by Greg Russo and Dave Callaham (Wonder Woman 1984), and is based upon a story by Oren Uziel and, obviously, the videogame series created by Ed Boon and John Tobias.",
    "This live-action Mortal Kombat movie was supposed to release in mid-2020, but it's been pushed back several times due to the ongoing pandemic. The reboot of the video-game-turned-movie franchise was scheduled to launch at the start of the year, but is now due to air stateside on HBO Max on April 16.",
    "As yet, there's no news yet on when it'll be available in the UK and beyond – the UK and Ireland Warner Bros' YouTube account will still only report it's \"coming soon\"."
  ],
  "headers": {
    "7": "Finish him"
  },
  "links": {
    "April 16": "https://www.techradar.com/news/mortal-kombat-movie-2021-release-date"
  }
}