{
  "source": "https://www.techradar.com/news/y-the-last-man-cast-and-crew-reveal-how-the-show-updates-the-comics-for-2021",
  "title": "Y: The Last Man cast and crew reveal how the show updates the comics for 2021",
  "category": "entertainment",
  "updated": "2021-09-18T13:00:00Z",
  "author": "tom-power",
  "summary": "“I wanted to escape this binary way of thinking”",
  "article": [
    "Few comic book live-action adaptations have had as turbulent a development cycle as Y: The Last Man. For 13 years, studios have tried to bring Brian K. Vaughan and Pia Guerra’s revered graphic novel series to life on both the big and small screens.",
    "Now, after multiple failed attempts, a TV show based on the comics has risen from the ashes – and Y’s live-action adaptation serves not only as a tribute to the source material, but also updates the 20-year-old graphic novel series to reflect modern-day societal values.",
    "Set in the aftermath of a global catastrophe in which every mammal with a Y chromosome has mysteriously died, Y: The Last Man follows Yorick Brown (Ben Schnetzer), the last living cisgender male human. Accompanied by his pet capuchin monkey Ampersand, Yorick traverses a post-apocalyptic world, the female human population of which – led by Yorick’s mother and US President Jennifer Brown (Diane Lane) – is struggling to restore society while grieving for their loved ones.",
    "Ahead of the show’s release, TechRadar sat down with creator Eliza Clark, Schnetzer and fellow actor Ashley Romans, to discuss Y’s protracted development process. We also talked about how the show finds a balance between honoring the source material while modernizing its story for today’s audience.",
    "Y: The Last Man’s live-action adaptation hasn’t been straightforward. In July 2007, New Line Cinema acquired the rights to develop a movie based on Vaughan and Guerra’s works. However, the film adaptation spent seven years in development hell – a period that saw two directors, four screenwriters and three producers come and go – before it was scrapped.",
    "In October 2015, reports surfaced that FX was developing a TV series based on the property. However, Y’s second live-action production was also beset with problems. Initial co-showrunners Michael Green and Aida Mashaka Croal departed over creative differences, while Barry Keoghan (Dunkirk, Calm With Horses), who had been hired to play Yorick, left for undisclosed reasons.",
    "It was up to Clark to pick up the pieces of the faltering TV production. But, as a longtime fan of the comics – Clark reveals that she’s been “obsessed with the book” since 2009 – the ex-Animal Kingdom scribe felt she could do justice to Y’s story, characters and world.",
    "“I had a really specific point of view about how I wanted to see the series,” Clark explains. “I was able to rewrite the pilot and reshoot it entirely, which gave us a clean slate. I was lucky that FX was excited about my take on the material and that they were willing to start over with me. I feel pressure and responsibility [to do justice to the comics], but I know that I would love this show if I were a fan of the books, so I think people will like it.”",
    "Retaining a semblance of continuity from Green’s vision, including keeping hold of the show’s original cast, helped Clark and her creative team to hit the ground running. That extended to using the source material’s overarching narrative as a base to work from, but some creative liberties have been taken with Y: The Last Man’s plot.",
    "For one, the cataclysmic event, which occurs very early on in the comics, is reserved for the final few minutes of the TV series’ premiere. In Clark's view, moving this key moment to the climax of episode one was crucial not only for building tension, but also to give enough room for the show to introduce its various characters.",
    "“I love the way that the event happens in the first five pages [of the comics],” Clark says. “I think it’s strong and you're just thrown right into it. But I think that it's so important to know who these people are before you’re thrust into who they will become [after the event]. It's important to see where their allegiances lie and where their blind spots are. If you don’t know who they are before things happen, it’s not as fun to watch them dramatically change in exciting and surprising ways.”",
    "With large swathes of humanity wiped out in a few harrowing minutes, what’s left of humankind are forced to forge new alliances and friendships in order to survive. In Yorick’s case, his pre-pandemic bond with Ampersand – the only other male mammalian survivor – becomes the key relationship in his life as society falls apart.",
    "To capture the intensity of Yorick and Ampersand’s relationship, Y’s showrunners had hoped to use a real-life capuchin during production. However, after animal rights group PETA slammed the decision to “force [monkeys] to endure a miserable life inside cages and in front of cameras” during the show’s initial pilot, the series’ creative team opted to bring Ampersand to life using CGI.",
    "Acting alongside an empty space could have caused problems for Schnetzer, who plays Yorick. But, as he explains, his experience on the 2016 VFX-laden Warcraft movie helped him to adapt to such a scenario.",
    "“It took time to get used to this empty animal crate that’s supposed to have a monkey in it,” Schnetzer says. “You have to remember that there’s supposed to be this precious cargo inside. But we had animal handlers and monkey trainers that showed me how to carry the crate, or pretend how to talk to an animal that isn’t there. We went back to the basics of using your imagination, but it was a really fun experience.”",
    "As the story progresses, Yorick becomes close to another of Y’s main characters: Agent 355. Thrown together by circumstance, the duo embark on a globetrotting adventure to find a way to save humankind – with Agent 355 tasked to keep Yorick safe as they do so.",
    "Commanding, resourceful and rational as she is, much of Agent 355’s backstory remains a mystery for portions of the comics and, by proxy, the TV adaptation. For Ashley Romans, who portrays Agent 355, the opportunity to peel back the layers of this complex character was what drew her to the character in the first place.",
    "“She’s confident, grounded and has strong boundaries,” Romans says. “But I felt most connected to her insecurities. She never reveals her real name and, after the event happens, she doesn’t know what she’s doing. Everything’s going exactly how it should [for Agent 355] until that point, but then she has to fake it until she makes it, despite being disoriented by everything.”",
    "Y: The Last Man’s comics pose tough questions about gender identity and inequality, but its TV adaptation goes further. The source material examines sexism and misogyny, but doesn’t challenge the notion that gender identity can exist outside of the male-female binary with much vigor. Transgender men are mentioned in passing, but little else is done to reflect the wider gender spectrum.",
    "By contrast, Y’s TV series explores the ramifications of its world-changing events on the LGBTQ+ community. As Clark explains, anyone with a Y chromosome perishes, including transgender, intersex and non-binary people, as well as some females with conditions like androgen insensitivity syndrome.",
    "Survivors who identify outside of the male-female binary are also affected. The addition of Sam Jordan, an original character played by real-life transgender actor Elliot Fletcher, provides an insight into the problems that LGBTQ+ people would likely continue to face in a post-apocalyptic world. Access to hormone therapy and discrimination are two such examples.",
    "For Clark, examining the implications of Y’s harrowing event on the LGBTQ+ community stemmed from how societal attitudes have changed for the better since the comics’ first issue launched in September 2002. Updating Y’s story and world building to reflect this sea change, then, was a necessary step to represent greater gender diversity.",
    "“The reality is that our world is gender diverse and not equal to chromosomes,” Clark explains. “I wanted to reflect that diversity, escape this binary way of thinking, and add a real richness and beauty to the human experience. That was also a by-product of the Me Too movement, and the ways that we think about gender and intersectional identities across the world. I had a lot of anger that I wanted to express [in the show], and I have a lot of thoughts about my loved ones’ experiences [regarding sexism and gender identity]. So I was keen to explore that in this adaptation.”",
    "It’s unclear if the TV adaptation’s trans, intersex and non-binary characters will feature prominently in the series’ narrative. Sam Jordan aside, Y’s first three episodes are lacking in LGBTQ+ representation, so the show runs the risk of appearing tokenistic with its gender-diverse character quota.",
    "If Y: The Last Man keeps its promise to better reflect the world around us, it should resonate with audiences in a way that similar shows have before. Its post-apocalyptic tale is standard fare by now – The Walking Dead, Netflix’s Sweet Tooth, and other TV productions are proof that dystopian stories haven’t outstayed their welcome yet.",
    "But Y: The Last Man has the potential to deliver a level of LGBTQ+ authenticity that’s comparable to shows including Pose, Queer Eye and Orange is the New Black. If it does place its gender diverse characters front and center, rather than sideline them, Y: The Last Man may be remembered as more than just another post-apocalyptic TV adaptation.",
    "Episodes 1-3 of Y: The Last Man are available to stream on FX on Hulu now. The show will launch on Disney+ in the UK on September 22 with new episodes releasing weekly on both platforms."
  ],
  "headers": {
    "4": "Recreating a beloved comic series",
    "11": "Building relationships",
    "18": "Valuing gender representation"
  },
  "links": {
    "slammed the decision": "https://www.cbr.com/y-last-man-recast-ampersand-cg-monkey-peta/"
  }
}