{
  "source": "https://www.techradar.com/news/semiconductor-shortage-reaches-a-new-and-unwelcome-landmark",
  "title": "Semiconductor shortage reaches a new and unwelcome landmark",
  "category": "computing",
  "updated": "2021-08-12T18:52:15Z",
  "author": "sead-fadilpasic",
  "summary": "OEMs have to wait weeks to receive their orders",
  "article": [
    "It can now take more than 20 weeks (20.2, to be exact) for an OEM such as Nvidia or AMD, to get their hardware, once they had been ordered - the longest stretch since records began.",
    "The news was first broken on Bloomberg, which cited a report from the Susquehanna Financial Group, a company that tracks semiconductor shortages, which added that it takes even longer (26.5 weeks) for microcontrollers and logic chips.",
    "This basically means the chip shortage is escalating, and if something doesn’t change, soon, the prices of various CPUs and GPUs may go even higher in the future, especially with the holiday season fast approaching.",
    "According to Tom’s Hardware, one of the things that can move the needle in the right direction is large customers (such as Apple, AMD or Nvidia), ordering new batches as early as possible, thus keeping production going.",
    "As with almost anything these days, the shortage can be blamed on the Covid-19 pandemic. When it first hit, and everyone started saving money in fears of a prolonged lockdown, OEMs shrunk their orders, expecting sales to plummet.",
    "However, the exact opposite happened, as people locked inside their homes during the pandemic turned to their electronic devices for entertainment, shopping, and work - with many forced into refreshing their tech stack.",
    "As a consequence, a global tech shortage occurred, which analysts expect to end either next year, or the year after.",
    "Tom’s Hardware also claims the automotive market took the biggest hit from the long-term impact of the shortage, mostly because those chips get built on older process nodes that aren’t produced that much. Desktop chips, on the other hand, are produced on cutting-edge nodes, meaning it’s easier to expect that segment to recover faster.",
    "Via: Bloomberg"
  ],
  "headers": {
    "5": "Recovery next year"
  },
  "links": {
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/semiconductor-delivery-times-get-worse",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-10/chip-delivery-time-surpasses-20-weeks-in-no-sign-shortage-easing"
  }
}