{
  "source": "https://www.techradar.com/news/expect-the-galaxy-watch-4-and-the-galaxy-watch-active-4-in-the-next-few-months",
  "title": "Expect the Galaxy Watch 4 and the Galaxy Watch Active 4 in the next few months",
  "category": "wearables",
  "updated": "2021-03-07T14:30:30.749Z",
  "author": "david-nield",
  "summary": "A launch in Q2 is predicted",
  "article": [
    "The rumors are steadily building up when it comes to the smartwatches that Samsung could have in store for 2021, and according to a new tip we could be in line for both a Galaxy Watch 4 and a Galaxy Watch Active 4 in the first half of the year.",
    "That's according to well-known tipster Ice Universe on Twitter, who has specifically mentioned both models by name and then suggested they'll be here in \"Q2\" – which would be either April, May or June.",
    "We don't get any more information than that, but it's an interesting tidbit of information to take on board: the Samsung Galaxy Watch 3 was launched in August 2020, which suggests that this year's smartwatch refresh is going to be significantly earlier in the year.",
    "The new leak would also indicate that Samsung is skipping the Galaxy Watch Active 3 entirely. It's been two years since the Galaxy Watch Active 2, and there was no Active wearable last year – an omission that has been something of a mystery.",
    "At least if we are getting the Galaxy Watch 4 and the Galaxy Watch Active 4 it should be easier to keep track of Samsung's smartwatch releases and numbering system in the future – one flagship watch and one more affordable sporty variant.",
    "Samsung jumped straight from the Galaxy Watch to the Galaxy Watch 3 (with the Active 2 sort of filling the gap), and it now looks as though executives at the company have realized just how confusing that is for tech journalists, consumers, and everyone else.",
    "We're starting to hear quite a bit more about what these smartwatches might have in store. There's a rumor that they'll abandon Tizen in favor of Wear OS from Google, and a couple of potential model numbers for the devices have already been put forward.",
    "If the Q2 prediction is right, then we should get an official unveiling within the next three months or so. Assuming Apple sticks to its usual scheduling this year, the Galaxy Watch 4 will be out three months before we see the Apple Watch Series 7.",
    "Via SamMobile"
  ],
  "headers": {},
  "links": {
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Ice Universe on Twitter": "https://twitter.com/UniverseIce/status/1368048315925864450",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Galaxy Watch Active 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "in favor of Wear OS from Google": "https://www.techradar.com/news/samsung-galaxy-watch-4-could-switch-back-to-wear-os",
    "have already been put forward": "https://www.techradar.com/news/the-samsung-galaxy-watch-active-4-and-watch-active-3-could-both-be-on-the-way",
    "Apple Watch Series 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "SamMobile": "https://www.sammobile.com/news/next-generation-galaxy-watch-coming-sooner-than-expected/"
  }
}