{
  "source": "https://www.techradar.com/news/venom-2-looks-absolutely-ridiculous-but-were-here-for-it",
  "title": "Venom 2's latest trailer looks absolutely ridiculous – but we're here for it",
  "category": "entertainment",
  "updated": "2021-08-02T14:10:17Z",
  "author": "tom-power",
  "summary": "Venom 2 is about to unleash maximum Carnage",
  "article": [
    "The official trailer for Venom: Let There Be Carnage has dropped online – and it looks as brutal and funny as we expected it to be.",
    "Sony Pictures' forthcoming sequel, which stars Tom Hardy and Woody Harrelson and Eddie Brock/Venom and Cletus Kasady/Carnage respectively, is less than two months from release, so it's high time we got another look at the anti-hero comic book flick.",
    "And, ahead of the film's September release, Sony has duly obliged by offering fans another peek at Venom 2, with a trailer packed with new footage landing on Sony's social media channels.",
    "Take a look at the new trailer below:",
    "Unexpectedly, Venom: Let There Be Carnage follows in the footsteps of its predecessor with a more mature superhero/supervillain offering.",
    "Teasing plenty of violence, jokes (with adult humor likely to be part of proceedings) and CGI-laden set-pieces, Venom 2 will hope to be as big a success at the global box office as the original 2018 film was.",
    "Venom: Let There Be Carnage will also star Michelle Williams as Eddie's ex-fiancé Anne Weying, Naomie Harris as Kasady's love interest Frances Barrison/Shriek, Reid Scott as Anne's new boyfriend and Stephen Graham as police cop Mulligan.",
    "With its over-the-top action and penchant for barbarity, Venom: Let There Be Carnage appears to be building on the foundations of 2018's Venom.",
    "While Marvel Studios continues to corner the market for more family-friendly entertainment, and Warner Bros. experiments with its DCEU line up, Sony seems to be trying to carve out a niche in the increasingly congested superhero movie market.",
    "How so? Well, through its over-elaborate set pieces, corny humor and more mature content. Venom didn't stray into R-rating territory – it received a PG-13 rating in the US and 15 rating in the UK – but, based on its new trailer, it appears that Let There Be Carnage could do.",
    "Even if it does end up being a more adult movie, though, Venom 2 looks like it's sticking to a formula that worked extremely well for the first entry.",
    "Venom was as silly and overblown as Let There Be Carnage's trailer sets it out to be, but that didn't stop it from being a surprise success. Venom grossed $856.1 million at the global box office – a figure eight times bigger than its production budget – so, clearly, there's an audience for its grandiose style and tone.",
    "Sure, Venom has a popular lead actor in Tom Hardy, which went some way to boost Sony's coffers. Ultimately, though, it was the kind of blockbuster, switch-off-your-brain fun that viewers occasionally want from these kinds of movies.",
    "Our view? Sony has seemingly done a good job of doubling down on what made Venom great with Let There Be Carnage. If the film is as good as the trailer makes it out to be, Sony should nail down this eccentric corner of the superhero market – offering genuinely interesting counter-programing to a genre always at risk of being too samey.",
    "Venom: Let There Be Carnage will launch in theaters on September 24 in the US and September 15 in the UK."
  ],
  "headers": {
    "7": "Opinion: Venom 2 looks as ludicrous as the first movie – but that's a good thing"
  },
  "links": {
    "DCEU": "https://www.techradar.com/how-to/how-to-watch-the-dceu-movies-in-order"
  }
}