{
  "source": "https://www.techradar.com/news/the-ps5s-ssd-is-actually-a-game-changer-for-exclusives",
  "title": "The PS5’s SSD is actually a game-changer for exclusives, developer Insomniac explains",
  "category": "gaming",
  "updated": "2021-08-30T02:03:36Z",
  "author": "jamel-smith",
  "summary": "A promise that's been realized",
  "article": [
    "The PS5’s SSD looks to be the game-changer Sony promised, at least according to PlayStation developer Insomniac Games.",
    "Insomniac has revealed that without the PlayStation 5's ultra-fast storage, Ratchet and Clank: Rift Apart's impressive graphics wouldn't have been possible.",
    "Speaking to Axios, Insomniac detailed why the PS5's SSD was so pivotal in creating the dense worlds found in Rift Apart, and how it enabled new opportunities for the team that simply weren't available on last-gen consoles. Insomniac's director of core technology Mike Fitzgerald told Axios that the \"hugest jump\" from PS4 to PS5 is the console's super-fast SSD, and that the new storage solution freed the studio from the limitations imposed by the PlayStation 4's hardware.",
    "Fitzgerald also shared how the team were able to create faster transitions and load entire environments almost instantly, something that would have been unheard of on PS4. “We’re actually entirely unloading one (environment) and loading the other one,” Fitzgerald said.",
    "In fact, Insomniac’s game director Mike Daly shared that the scenes where Ratchet enters his spaceship to fly between levels are actually just for show. “We’ll fly in the spaceship for a while and then we still do the whole load in that fraction of a second,” Daly said.",
    "The SSD also meant that Insomniac didn't have to reserve any memory for things that might be off-screen and behind the player. This restriction resulted in Marvel's Spider-Man on PS4, a game developer by Insomniac, to have less buildings and materials in a given scene, as more memory would need to be reserved for keeping assets loaded for when a player spins around. Now though, through a combination of the PlayStation's 5 SSD, RAM and advanced hardware pipeline, Insomniac said it \"can get them (more assets) there in time\" if a player quickly spins around.",
    "The high level of visual fidelity in Ratchet and Clank: Rift Apart should excite PS5 owners about upcoming PS5 exclusives. However, the majority of upcoming PS5 games will be cross-gen, which they will release on both PS4 and PS5. As a result, these games won't be designed to take full advantage of the PS5's super-fast SSD, as they will still have to run on the PS4, which will restrict developers due to its weaker specs.",
    "Rift Apart, meanwhile, was designed exclusively for the PS5, so it wasn’t held back by the PS4’s aging hardware, and that provided Insomniac with the tools to deliver a visual showcase.",
    "With PS5 blockbusters God of War: Ragnarok, Horizon Forbidden West, and Gran Turismo 7 now confirmed to be coming to PS4 as well as PS5, it's unlikely that they will be able to fully harness the power of the PS5’s SSD. This could jeopardize our dream of seeing Kratos have an epic, seamless battle against Thor across the nine realms from being realized.",
    "What is certain, though, is that Insomniac is one of PlayStation’s best developers, and we can’t wait to see what the studio has in store for us next. If it's another Spider-Man game, we'd love to battle the Green Goblin across the entirety of Manhattan, something which might be a possibility thanks to the PS5's SSD."
  ],
  "headers": {
    "6": "PS5 players, rejoice?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Ratchet and Clank: Rift Apart's": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Axios": "https://www.axios.com/sony-ps5-insomniac-ratchet-clank-1ad70cf8-398f-4adb-aea2-716b03860ad9.html",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "upcoming PS5 games": "https://www.techradar.com/news/new-ps5-games",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers"
  }
}