{
  "source": "https://www.techradar.com/news/ps5-restock-sony-direct-email-invite-meltdown",
  "title": "PS5 restock meltdown at Sony Direct has console seekers livid at email invite fiasco",
  "category": "gaming",
  "updated": "2021-09-21T20:46:22Z",
  "author": "matt-swider",
  "summary": "Glitches during the Sony Direct PS5 restock have confused and frustrated would-be customers. Here's what happened.",
  "article": [
    "The PS5 restock at Sony Direct today can be described as having a meltdown, and if you follow our PS5 and Xbox restock Twitter tracker Matt Swider you'll get an alert when the PlayStation 5 is for sale – that's if you follow his Twitter account and turn on notifications. Of course, Matt sends instant alerts, which have helped 83,000 people secure a next-gen console; he doesn't control the Sony Direct restock or know how to prevent its many glitches.",
    "Here's what happened:",
    "Sony Direct hasn't been as reliable for PS5 restock events as it once was. During the first half of 2021, the official PlayStation Store was slinging PS5 consoles four times a week, and it became the go-to store to buy from.",
    "Fast forward to September 2021 and we're lucky if we get a Sony Direct PS5 restock twice a month, and it often sells out before people make it through the virtual queue. GameStop has taken Sony's place as becoming the most reliable source for PS5 restocks, having new PS5 stock every seven to fifteen days.",
    "This is a growing trend. There hasn't been a Best Buy PS5 restock in over a month, Walmart just canceled orders after hundreds of people waited a month to receive their shipment, and Amazon has been overrun by reseller bots until recently.",
    "We had previously reported that between October and Christmas, things were going to get much harder. We said that earlier this year – we were off by one month. By the second week of September, it became nearly impossible to find a PS5 restock.",
    "The glitches today at Sony Direct are just part of a long line of disappointments people can expect between now and the end of the year, especially as more parents join the fray to find a console in stock in time for Black Friday and Cyber Monday."
  ],
  "headers": {
    "2": "Sony Direct PS5 restock has become hard",
    "4": "The PS5 restock at Sony Direct today: sign of the times"
  },
  "links": {
    "PS5 and Xbox restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Best Buy PS5 restock": "https://www.techradar.com/news/exclusive-ps5-xbox-restock-best-buy-in-store-september-23",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}