{
  "source": "https://www.techradar.com/news/the-cowboy-bebop-netflix-tv-show-will-finally-release-this-year",
  "title": "The Cowboy Bebop Netflix TV show will finally release this year",
  "category": "entertainment",
  "updated": "2021-06-15T11:41:34Z",
  "author": "samuel-roberts",
  "summary": "It's been a long time coming",
  "article": [
    "Netflix has confirmed that its live-action adaptation of the anime Cowboy Bebop will finally release in 'Fall 2021' – so, some time in the final few months of the year. The show will also feature music from original series composer Yoko Kanno, Netflix confirmed.",
    "This was all confirmed during Netflix's Geeked week, which is spotlighting particularly nerdy upcoming content from the streamer's library. Cowboy Bebop has been a long time coming – production started all the way back in 2019, before pausing due to star John Cho injuring his knee. Filming then continued in late 2020, before wrapping up in March 2021.",
    "Check out the announcement below:",
    "The series stars Cho as Spike Spiegel, Mustafa Shakir as Jet Black and Daniella Pineda as Faye Valentine. And yes, for fans of the show, it will feature an actual corgi playing the role of the iconic dog from the series, Ein.",
    "Writer Christopher Yost, who has credits on two of the Thor movies and The Mandalorian, is an executive producer of this show. Cowboy Bebop is one of the most internationally popular anime series there is – it was released back in 1997-1998 and, for many western viewers, it was their 'gateway' series into anime.",
    "Its reputation has only really grown in the intervening years. And Netflix has really taken the time to get this right – when the adaptation gets here, it will have been more than two years since the cast of the show was announced.",
    "Getting details right like hiring the original composer bodes well, and this can't be a small budget show to pull off the kind of sci-fi imagery we know from the anime. This could be Netflix's biggest new show of the year.",
    "Here's a glimpse of the show's set from all the way back in October 2019:"
  ],
  "headers": {
    "4": "Will it be any good?"
  },
  "links": {
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}