{
  "source": "https://www.techradar.com/news/the-problem-with-playstation-now-and-how-to-fix-it",
  "title": "The problem with PlayStation Now – and how to fix it",
  "category": "gaming",
  "updated": "2021-08-21T14:45:00Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Sony’s PS Now service could be so much more",
  "article": [
    "PlayStation Now should be Sony’s answer to Xbox Game Pass, but right now, it’s being handsomely bested by Microsoft’s subscription service and (even worse) ignored by PlayStation’s own player base.",
    "In January 2021, the last official figures that Microsoft shared showed that Xbox Game Pass had amassed over 18 million subscribers – a figure that has likely been eclipsed by now thanks to strong Xbox Series X and Xbox Series S sales throughout the year.",
    "Sony’s PlayStation Now service, meanwhile, has just over three million subscribers. That’s despite the PS4 and PS5 amassing a significantly larger install base than Microsoft’s last-gen and current-gen consoles. PS Now also had a two year head start over Xbox Game Pass, which arrived two years later in 2017.",
    "So why is there such a large discrepancy when it comes to PS Now subscribers and Xbox Game Pass subscribers? Is PlayStation Now really that unappealing? Fundamentally, no, but the execution is lacking.",
    "PS Now operates in almost exactly the same way as Xbox Game Pass: you pay a monthly fee that lets you download and play hundreds of games. You can even stream games on Sony’s platform, which right now is an advantage that Sony’s service has over Xbox Game Pass – though this might change when Microsoft brings Xbox Cloud Gaming to its console hardware in the near future.",
    "But right now, it’s hard to make a compelling case for Sony’s service due to a few frustrating flaws. It isn’t beyond redemption, though – in fact, it’s a problem that’s actually rather easy to fix, if Sony is willing to make the following changes.",
    "One of the biggest differences between PlayStation Now and Xbox Game Pass is that Microsoft’s service lets you play Xbox Series X and Xbox Series S games. You can play countless titles that take full advantage of the power of the new Xbox consoles, and I’ve found it to be a great way to experience next-gen titles like Dirt 5, Doom Eternal and Sea of Thieves.",
    "In fact, there are currently 62 Xbox Series X|S optimized games on Xbox Game Pass (thanks, Game Pass Counter), which means if you own either of Microsoft’s new Xbox consoles, there’s plenty of shiny new games to play right now.",
    "On PlayStation Now, there are no PlayStation 5 games available. Zilch. Nada. Zero. Sony’s service only includes PS4, PS2 and PS3 games, the latter of which can only be streamed and not downloaded.",
    "When Marvel’s Avengers and Borderlands 3 were added to PS Now in April, it seemed like a great win for Sony’s service. But, despite having free PS5 upgrades available for both titles, subscribers could only play the PS4 version, something which wouldn’t be the case if these games were on Xbox Game Pass.",
    "Sony needs to start offering PS5 games in its PS Now library, then, as there’s no doubt that such a seemingly simple move would attract countless new subscribers.",
    "Xbox Game Pass isn’t Microsoft’s only offering in its subscription service. It also has the value-packed Xbox Game Pass Ultimate for consumers to consider, which includes an embarrassment of riches and perks.",
    "Xbox Game Pass Ultimate subscribers get Xbox Game Pass, Xbox Game Pass for PC, EA Play (which includes hundreds of games from EA), Xbox Live (which includes Games with Gold), Xbox Cloud Gaming (available on mobile and PC) and various perks for a slightly higher monthly fee. It’s easily the best deal in gaming right now, and I’ve touched on how it’s made the PS5 feel like it isn’t good value in the past.",
    "Sony should be offering a higher tier version of its subscription services to compete with Xbox Game Pass Ultimate, and one that crucially includes PS Now. PlayStation Plus seems to be the only avenue where Sony is willing to give away PS5 titles, so why not create a PlayStation Plus Platinum tier?",
    "Add PS Now, all the usual PlayStation Plus perks, and throw in a subscription to the online anime streaming platform Crunchyroll (recently bought by Sony) to sweeten the deal.",
    "It might not quite match the value proposition of Xbox Game Pass Ultimate, but it would at least be a start. I’d certainly be interested in a tier that gave me both PS Now, PS Plus and extras for a more compelling price than the current option of subscribing to both with no additional benefits.",
    "While there’s no chance that Sony will ever offer its first-party exclusives on PlayStation Now on day one like Microsoft does with its titles, it would be nice to see PlayStation Now snag some day one releases of third-party games for its subscription service and add more current releases in general.",
    "It’s hard to deny the allure of a freshly released game that’s available for “free” as part of your existing subscription. I’ve played so many games on Xbox Game Pass that I never would have given a passing glance to before because of this, so I think Sony is missing out on a big opportunity to snag some day one releases on PS Now.",
    "PlayStation has always had a great history in supporting indie games, so instead of leaving them to the mercy of the PlayStation Store, why not give developers a much-needed windfall by paying to put some titles straight into PS Now? It would also help spice up PlayStation Now’s library of games, which can have a tendency of feeling outdated compared to Game Pass’s lineup.",
    "It’s clear that PlayStation Now isn’t in dire need of an overhaul, then, but a couple of smart tweaks inspired by the competition would do Sony’s service wonders. As of today, PS Now isn’t doing enough to entice subscribers to the platform, and only Sony has the power to change that. Let’s hope it acts sooner rather than later."
  ],
  "headers": {
    "6": "It’s time to add PlayStation 5 games",
    "11": "Create a premium PlayStation Plus tier",
    "16": "Snag some day one releases",
    "19": "A little would go a long way"
  },
  "links": {
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "over 18 million subscribers": "https://www.techradar.com/news/xbox-game-pass-hits-18-million-subscribers-as-microsofts-strategy-pays-off",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "three million subscribers": "https://www.pushsquare.com/news/2021/05/ps_now_has_a_respectable_3_2_million_subscribers",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series S games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
    "Game Pass Counter": "https://gamepasscounter.com/",
    "PlayStation 5 games": "https://www.techradar.com/best/best-ps5-games",
    "Marvel’s Avengers and Borderlands 3 were added to PS Now in April": "https://www.techradar.com/news/ps-now-finally-hits-back-at-xbox-game-pass",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "PS5 feel like it isn’t good value in the past": "https://www.techradar.com/news/ps5-isnt-good-value-compared-to-xbox-series-x-and-im-sick-of-it",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "Crunchyroll": "https://www.techradar.com/news/crunchyroll-and-funimation-unified-is-the-future-of-streaming-wars-summed-up",
    "games on Xbox Game Pass": "https://www.techradar.com/news/10-xbox-game-pass-titles-were-so-glad-we-played"
  }
}