{
  "source": "https://www.techradar.com/news/fortnites-best-feature-is-fishing-and-heres-why-im-hooked",
  "title": "Fortnite’s best feature is fishing, and here’s why I’m hooked",
  "category": "gaming",
  "updated": "2021-03-28T13:00:45Z",
  "author": "hamish-hector",
  "summary": "Opinion: teach a man to fish, and he’ll reel in victory",
  "article": [
    "Lay down your weapons, drop your building supplies and take a break from chasing that Victory Royale. Fortnite may seem like a game that consists mainly of gunfights and build battles, but none of that is as satisfying, as fulfilling in its simplicity, as what I’ve come to realize is Fortnite’s best feature: fishing.",
    "Sure, the mechanic is simple – you just cast your lure, and reel it back in when you see your float disappear below the surface of the water – but of all the features added over three years’ worth of updates, nothing comes close to beating fishing.",
    "So grab a six-pack of Chug Splashes, pick up a rod and come join me by Lake Canoe, as I explain why you should be fishing more in Fortnite – especially if you want to get better at the more demanding elements of the game.",
    "Battle royales are stressful. As a game’s playable area shrinks and the player count drops, the adrenalin pump goes into overdrive and your heart begins to race. With the prospect of winning edging ever closer, every action could be make or break.",
    "Even after the match is over, and whether you win or lose, that pent-up energy persists, and it can take a while before you begin to calm down. This is where fishing can come in. Out there by the water, you aren’t concerned with elimination counts and Victory Royales – it’s just you and the fish.",
    "Fishing was added in Chapter 2 Season 1 of Fortnite Battle Royale. Using a rod or a harpoon gun, players can pull useful items and weapons out of the depths. There are also various catchable fish – or Floppers as they’re called in the game – which offer different benefits, such as healing or a temporary speed boost. But what you reel in isn’t necessarily what matters in these post-match relaxation periods.",
    "What matters is achieving that zen-like state that any angler will tell you about. The meditative, flowing sensation of casting out your rod, focusing all your attention on the float in the water, waiting for the splash to tell you that’s time to reel it in and then pouncing on your catch. In those moments, with every sense focused on the task in hand, your mind clears, and your body – to the extent that you’re still in it – relaxes.",
    "A degree of concentration is needed. For one thing, you’ll want to keep an eye out for fishing spots – patches of water where Floppers can be seen swirling – that offer the most interesting variety of catches. And not everyone in the game is likely to share your desire to get away from it all. You may sometimes find your quiet place invaded by gunfire, and in those moments your concentration will be tested. But keep your cool.",
    "Being able to maintain focus on the fish while dodging bullets; learning to succeed at two tasks at once without feeling the pressure from either, is a mark of a great Fortnite fisher.",
    "Another mark is mastering the competitive aspect of this tranquil act. Fortnite offers a Fishing Collection, a record of the fish you’ve captured since the last season-reset. It tracks the different varieties of fish, how you catch them, and what size the biggest of each kind you’ve caught is. Importantly, your stats are shared with your friends.",
    "Each new season brings a new competition, a race to be the first to fill out your collection with the biggest Floppers you can find. You and your friends will come to learn that Victory Royales are meaningless by comparison – it’s all about catching the most fish.",
    "As you catch more, you’ll learn the way of the Floppers, and be given clues as to where you can find new varieties. There are different fish to be found across the entire map, so you’ll need to explore from high to low, north to south, east to west in order to achieve your goal of catching every fish.",
    "With your Flopper collection complete, you’ll be ready for the final test – how to apply what fishing has taught you elsewhere in Fortnite.",
    "You’ll discover that fishing has taught you how to be better at Fortnite without you even noticing. In looking for fishing spots, you’ve learned how to spot opportunities when they arise, and you’ll know where to find sources of useful loot. Dodging gunfire while staying focused on your fishing will help you in battle. If you’re engaged with an enemy, you’ll be prepared for if a third party gets involved – looking to take you both out while you’re distracted – and you’ll find it easier to come away as the victor.",
    "The fish you’ve discovered on your journey will aid you too. They offer useful benefits like quick healing or a smokescreen to disappear behind, and you'll know how and where to find them when a match starts so you can quickly build out a game-winning arsenal. Your adventure across the island will also have given you an insight into different locations, giving you a better idea of the best places to search for loot.",
    "And you’ll do all of this while keeping your cool, having learned how to master your impulses at the water’s edge.",
    "Most importantly, you'll hopefully have a laugh doing it. There’s plenty of humor to be found in Fortnite fishing, from the silly names of the Floppers to the futility of comparing randomly generated virtual fish sizes with your mates.",
    "Whether you’re a super-competitive Fortnite champion or completely new to the game, fishing is a simple feature that’s really easy to immerse yourself in, and I’d strongly urge you to give it a try, or spend more time at it if you’ve already felt the lure of the lure.",
    "After all, maybe the fish can school you in the ways of Fortnite too."
  ],
  "headers": {
    "3": "Rest and relaxation",
    "9": "Competition in peacetime",
    "13": "The Way of the Flopper"
  },
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review"
  }
}