{
  "source": "https://www.techradar.com/news/even-sega-thinks-the-new-sonic-game-was-announced-too-fast",
  "title": "Even Sega thinks the new Sonic game was announced too fast",
  "category": "gaming",
  "updated": "2021-07-26T13:12:18Z",
  "author": "rhys-wood",
  "summary": "Gotta go fast",
  "article": [
    "Sonic Team lead Takashi Iizuka has admitted that the announcement of the upcoming (as of yet unnamed) Sonic game may have been a bit premature – while justifying its reveal by way of the special occasion that was Sonic’s 30th anniversary.",
    "In an interview with 4Gamer that was translated by Nintendo Enthusiast, Iizuka stated: \"We haven't announced a brand new action game for the Sonic series since Sonic Forces, and that caused fans to worry. While it was a bit premature, I wanted to at least take the occasion of the 30th anniversary to announce that a brand new title was in development.\"",
    "The new Sonic game, currently thought to be called Sonic Rangers thanks to a leak, is scheduled to release sometime in 2022 on all major platforms, including PS4, PS5, Xbox One, Xbox Series X/S, Nintendo Switch and PC.",
    "Originally announced during Sega’s first ever Sonic Central showcase in May 2021, Sonic 2022 basked in the 30th anniversary spotlight with a quick-as-lightning teaser trailer that didn’t really tell us much of anything.",
    "It bookended a rather limp debut for the Sonic Central format, which also featured announcements on the Sonic Origins collection, as well as details on the Sonic the Hedgehog 2 movie and upcoming Netflix series Sonic Prime.",
    "Focusing on Iizuka’s phrasing of “a bit premature” hints to us that not only could Sonic 2022 still be quite early in development, it may also see a significant delay, perhaps into 2023. Such a delay would be understandable, since disruption caused by the Covid-19 pandemic has caused many big name titles to see delays, God of War: Ragnarok and Ghostwire Tokyo among them.",
    "Whether or not you think Sonic 2022 was announced too early really depends on how excited you are for the game. While many fans were disappointed that the teaser didn’t reveal anything besides a cryptic logo (which Iizuka admitted in the 4Gamer interview we’re not quite supposed to understand just yet), the official announcement that Sonic Team is indeed working on something is a relief.",
    "Sonic Team certainly has its work cut out for itself, though, if it means to impress with Sonic 2022. 2017’s Sonic Forces, while not terrible, failed to ignite the series in the same way the classic-inspired Sonic Mania did, so a new 3D Sonic game will undoubtedly be a tougher sell for many series fans.",
    "Still, we’re happy for Sonic Team to take as much time as it needs on Sonic 2022 (or perhaps Sonic 2023?). 3D Sonic titles can and have been good in the past (Unleashed and Generations are testament to that), and the powerful hardware provided by PS5 and Xbox Series X could make for a truly impressive looking title."
  ],
  "headers": {
    "5": "Analysis: was Sonic 2022 really announced too early?"
  },
  "links": {
    "Nintendo Enthusiast": "https://www.nintendoenthusiast.com/takashi-iizuka-talks-about-sonic-2022-and-his-introduction-to-sonic-in-1992/",
    "thanks to a leak": "https://www.eurogamer.net/articles/2021-05-28-sega-mentions-sonic-rangers-in-its-own-press-release",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Sonic the Hedgehog 2": "https://www.techradar.com/news/sonic-the-hedgehog-is-officially-getting-a-sequel",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Ghostwire Tokyo": "https://www.techradar.com/news/ghostwire-tokyo-ps5-exclusive-delayed"
  }
}