{
  "source": "https://www.techradar.com/news/how-long-is-the-falcon-and-the-winter-soldier-episode-2s-runtime",
  "title": "Falcon and the Winter Soldier: This is how long episode 2 will be",
  "category": "entertainment",
  "updated": "2021-03-24T16:43:38Z",
  "author": "tom-power",
  "summary": "The next entry glides into view",
  "article": [
    "The Falcon and the Winter Soldier episode 2 lands on Disney Plus this week, and you might be wondering how long it'll be – especially since these episodes run longer than WandaVision's did. Well, you don't have to dwell on this any longer, as the next entry's runtime has leaked ahead of schedule.",
    "According to Reddit user Plenty_Echidna_545 (via GamesRadar) on the Marvel Studios' spoiler sub-Reddit, episode 2 will be the same length as its predecessor. That means that the next instalment will clock in at the 50-minute mark, with the end credits included in that time frame.",
    "Plenty_Echidna_545 has also revealed that Sam and Bucky will reunite in this episode, which is nice to know. The pair didn't cross paths in episode 1, which will certainly be down to the showrunners setting up their respective arcs before they team up once more. The Reddit post didn't provide other details on what to expect from episode 2, however, so we'll have to wait and see what's in store for the duo when the episode arrives on Friday, March 26.",
    "We're not sure yet, but each entry in the Disney Plus TV show will be around a similar length of time. Marvel Studios President Kevin Feige has already explained that The Falcon and the Winter Soldier's episodes won't be \"eight hours long\" (via ComicBook.com) but instalments would be longer than WandaVision's episodes. That means that Sam and Bucky's adventure will be told over less episodes than Wanda and Vision's TV series.",
    "While Sam and Bucky will reunite in episode 2, we may also finally get a glimpse of some new and returning characters. Helmut Zemo was notably absent from the series premiere, and we were only briefly introduced to the new Captain America in episode 1's final scene. According to Wyatt Russell, who will portray this individual, some viewers may end up \"hating\" the fact that someone has assumed the mantle that Steve Rogers gave to Sam at the end of Avengers: Endgame.",
    "The Falcon and the Winter Soldier launches exclusively on Disney Plus on Friday, Match 26."
  ],
  "headers": {
    "3": "How long will every Falcon and the Winter Soldier episode be?"
  },
  "links": {
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1026715564208840800&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Plenty_Echidna_545": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/masqjt/falcon_and_winter_soldier_episode_2/",
    "GamesRadar": "https://www.gamesradar.com/falcon-and-the-winter-soldier-episode-2-runtime-marvel-leak/",
    "ComicBook.com": "https://comicbook.com/marvel/news/falcon-and-the-winter-soldier-wont-be-8-hours-long-kevin-feige/",
    "\"hating\"": "https://www.techradar.com/news/people-might-hate-the-falcon-and-winter-soldiers-new-captain-america"
  }
}