{
  "source": "https://www.techradar.com/news/tesla-cybertruck-looks-unbelievably-cool-in-new-off-road-footage",
  "title": "Tesla Cybertruck looks unbelievably cool in new off-road footage",
  "category": "car-tech",
  "updated": "2021-10-25T13:18:57Z",
  "author": "axel-metz",
  "summary": "OK, now we want one",
  "article": [
    "Earlier this year, Tesla CEO Elon Musk described his company's in-development Cybertruck as a \"special project\" near and dear to his heart – and thanks to some brand new footage of the all-electric vehicle in action, we can see why.",
    "In a minute-long teaser video (which you'll find below) filmed by Twitter user Harsimran Bansa, the Tesla Cybertruck is seen driving on urban roads, drifting through a field and slaloming across the grounds of Tesla's unfinished Texas Gigafactory in theatrical style.",
    "Interestingly, Bansa caught a glimpse of the footage in a Tesla showroom, suggesting the video isn't a leak, per se, but an official Cybertruck teaser the company hasn't yet shared through its own social channels.",
    "Either way, it shows off the upcoming vehicle in an awesome new light – check it out below.",
    "The new footage is so cool, in fact, that it looks like Tesla has taken inspiration from the cornfield chase in Christopher Nolan's Interstellar, with the Cybertruck kicking up plumes of dirt as it speeds through grassland in pursuit of… something – perhaps a release date?",
    "On that front, the news is less exciting. We recently learned that the Cybertruck may not hit the road until 2023, as Tesla continues to weather a supply chain storm whipped up by both the global pandemic and global microchip shortage.",
    "To those unfamiliar with Elon Musk’s much-anticipated vehicular project, the Tesla Cybertruck is unlike any road vehicle we've seen before.",
    "For starters, it will supposedly offer \"better utility than a truck with more performance than a sports car,\" according to Tesla's official product page for the vehicle.",
    "The Cybertruck has been designed with a \"nearly impenetrable\" exterior shell made from \"Ultra-Hard 30X Cold-Rolled stainless-steel structural skin\" and \"Tesla armor glass\" – which should keep passengers and the vehicle itself protected from all types of damage.",
    "As for that impressive utility, the truck has been engineered with 100 cubic feet of exterior, lockable storage – found in places such as the under-bed, trunk and sail pillars – and will come prepared with on-board power and compressed air.",
    "It's heavy, sure, but the Cybertruck will also be mighty quick. Tesla is claiming it can sprint from 0-60mph in as little as 2.9 seconds, thanks to a powerful drivetrain and low center of gravity providing \"extraordinary traction control and torque.\"",
    "As for range, the Cybertruck is set to offer up to 500 miles – which is an equally mind-blowing figure given the state of the competition right now.",
    "If these credentials prove accurate when it finally hits the road, the Cybertruck will rival ultra-premium EVs like the Mercedes EQS for performance while offering the practical versatility of utility vehicles like the electric Hummer.",
    "Musk himself has already described his latest four-wheeled project as \"a glitch in the Matrix\" for the auto industry – and judging by this latest footage, the Cybertruck is looking more and more like an extremely exciting reality."
  ],
  "headers": {
    "6": "What is the Tesla Cybertruck?"
  },
  "links": {
    "Twitter": "https://twitter.com/harsimranbansal/status/1450861013432250373?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1450861013432250373%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Finsideevs.com%2Fnews%2F542870%2Fofficial-tesla-cybertruck-teaser-video%2F",
    "recently learned": "https://www.techradar.com/news/musk-says-tesla-cybertruck-will-be-like-a-glitch-in-the-matrix-as-its-delayed-again",
    "official product": "https://www.tesla.com/en_gb/cybertruck",
    "Mercedes EQS": "https://www.techradar.com/news/mercedes-eqs",
    "electric Hummer": "https://www.techradar.com/news/yes-the-fully-electric-hummer-suv-can-also-walk-like-a-crab"
  }
}