{
  "source": "https://www.techradar.com/news/iphone-13-may-use-ltpo-screen-tech-so-what-actually-is-it",
  "title": "iPhone 13 may use LTPO screen tech, so what actually is it?",
  "category": "phones",
  "updated": "2021-04-13T10:28:49Z",
  "author": "hamish-hector",
  "summary": "Are LTPO displays the way of the future?",
  "article": [
    "Following rumors that Apple would be adopting LTPO screens for the iPhone 13 Pro and Pro Max, analysts believe more phones could adopt the technology soon. In the next two years, we might see more smartphones using the LTPO displays instead of the LTPS ones they currently do.",
    "Ross Young, the lead analyst at Display Search and DSCC, tweeted out a projection where by 2023 the new LTPO phones will overtake the standard LTPS OLED displays. Obviously, this news should be taken with a pinch of salt - as not only is it a prediction, but it’s based on a rumor - but Young’s figures suggest that adoption of the new displays could be rapid if the iPhone 13 Pro does use LTPO OLED screens.",
    "So if our phones are all going to start using LTPO displays, it might be a good idea to understand what they are and why they are so great. Keep reading to find out just that, as we explain LTPO displays.",
    "An LTPO is an electronic component and LTPO stands for low-temperature polycrystalline oxide. When you look at your phone screen, it’s not just one thing, it’s made up of multiple layers of components that deliver the image you see.",
    "Using a mixture of different display types, the LTPO replaces various layers in a typical OLED screen allowing it to achieve a variable refresh rate without the need for additional hardware.",
    "LTPO displays are already in use in phones like the OnePlus 9 Pro and Oppo Find X3 Pro, plus you can find it in smartwatches like the Apple Watch Series 6.",
    "At first glance, LTPO screens don’t seem all that special - especially if you aren’t a framerate snob. However, wherever you care about achieving 120Hz or not there’s a reason you should be excited: better battery life.",
    "The LTPO component allows a device to have a variable refresh rate that's dynamically changed depending on what’s going on. If you’re using your electronics then the refresh rate can run at the max setting, though if it’s idle then it can drop much lower and conserve battery.",
    "On the Apple Watch Series 6 the refresh rate scales between 60Hz while in use all the way down to 1Hz when not, that’s 60 times a second to 60 a minute. This dynamic changing let’s the smartwatch last for much longer, while also giving you the smoothest frame rates possible when you’d appreciate them.",
    "We’ll have to wait and see if LTPO displays really do take off thanks to the iPhone 13; in two years time they might be used in all our favorite devices."
  ],
  "headers": {
    "3": "What is an LTPO display?",
    "6": "Why should you want an LTPO display?"
  },
  "links": {
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13",
    "tweeted out a projection": "https://twitter.com/DSCCRoss/status/1381676395974254595?s=20",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Apple Watch Series 6": "https://www.techradar.com/reviews/apple-watch-6-review"
  }
}