{
  "source": "https://www.techradar.com/news/hp-and-dell-see-revenues-rise-as-remote-working-demand-continues",
  "title": "HP and Dell see revenues rise as remote working demand continues",
  "category": "computing",
  "updated": "2021-08-27T10:03:35Z",
  "author": "mike-moore",
  "summary": "Results are largely up on last year as PC sales recover",
  "article": [
    "The resurgent PC market has meant good news for both HP and Dell, which have both revealed encouraging financial results.",
    "Driven by demand for new devices to help facilitate the growth in remote and hybrid working necessitated by the pandemic, both companies saw strong performance across their hardware and cloud services divisions.",
    "The news comes as analyst figures estimate the global PC market is beginning to recover and grow again following the effects of the pandemic.",
    "Dell said its Q2 2021 was the best in its history as Dell Technologies, with record second quarter revenues of $26.1bn, up 15% compared to the previous year. The company also reported a record second quarter operating income of $1.4bn, up 21%, helped by revenue from its commercial PC division, where sales of its Latitiude and Precision platforms helped a 32% year-on-year rise to hit $10.6bn, with consumer sales up 17% from a year ago to hit $3.7bn for the quarter.",
    "Elsewhere, Dell's Infrastructure Solutions Group saw a 3% revenue rise to hit $8.4 billion as demand for multi-cloud systems continued to grow, with server and networking revenue also up 6%, although storage sales fell 1%. VMware revenue hit $3.1bn in the quarter, an 8% rise.",
    "“We’re well known for our unique ability to adjust and lean into growth opportunities, as evidenced by our results with record second quarter revenue of $26.1 billion,” said Jeff Clarke, vice chairman and co-chief operating officer, Dell Technologies.",
    "“We’re innovating and helping customers grow with a focus on multi-cloud solutions and modern infrastructure delivered traditionally and as-a-Service.\"",
    "HP saw year-on-year revenues rise 7% from 2020 to hit $15.3bn in its Q3 2021, but also saw the effects of rising demand for hybrid working, as sales of desktop devices fell 7%, but notebook sales performing better than expected with a 2% rise.",
    "The company saw a strong performance in its printing division, where revenue was up 24% year-on-year to hit $4.9bn, and its supplies division seeing a 20% rise.",
    "\"Strong and sustained demand for our technology drove another quarter of top and bottom-line growth and we more than doubled non-GAAP EPS year over year,\" said Enrique Lores, HP President and CEO.",
    "\"We are performing while we are transforming our business models and service offerings to accelerate growth opportunities across our portfolio. The evolving hybrid world is driving innovation and market expansion for HP and we are well positioned to capitalize on trends in our markets.\""
  ],
  "headers": {
    "3": "Dell records",
    "7": "Mixed fortunes for HP"
  },
  "links": {
    "PC": "https://www.techradar.com/news/best-business-desktop-pcs",
    "HP": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710",
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "global PC market is beginning to recover": "https://www.techradar.com/news/this-could-be-a-great-time-to-buy-a-new-work-pc"
  }
}