{
  "source": "https://www.techradar.com/news/leicester-city-vs-man-united-live-stream-how-to-watch-free-fa-cup-2021-quarter-final",
  "title": "Leicester City vs Man United live stream: how to watch FA Cup quarter-final online",
  "category": "entertainment",
  "updated": "2021-03-21T16:46:22Z",
  "author": "kevin-lynch",
  "summary": "Can the Foxes end Ole's Red Devils' 22-match unbeaten away run?",
  "article": [
    "Ole Gunnar Solskjaer's side's pursuit of the club's 13th FA Cup title on Sunday sees them come up against the high-flying Foxes in this tasty-looking quarter-final clash. Follow our guide for all the ways to watch a Leicester City vs Man United live stream, no matter where you in the world, where it's being shown exclusively in the US on ESPN Plus.",
    "United come into the match on a high after their 1-0 win at the San Siro on Thursday, with Paul Pogba's deft strike seeing them edge past AC Milan and book a place in the Europa League semi-finals.",
    "With the games coming thick and fast, they now face a side battling it out with them for second place in the Premier League, who head into this tie off the back of a 5-0 drubbing of Sheffield United. And with Leicester having had a week's rest since their last game, it now remains to be be seen how much United's gruelling exploits in Italy in midweek will have an effect on them coming into this tie.",
    "The Foxes will also be boosted by the news that Marcus Rashford is a major doubt for Sunday's game, after the England forward was substituted at the start of the second half against AC Milan.",
    "Here's how to get a Leicester City vs Man United live stream and watch this FA Cup quarter-final fixture online today."
  ],
  "headers": {
    "5": "How to watch Leicester City vs Man United: live stream the FA Cup in the US"
  },
  "links": {
    "where it's being shown exclusively in the US on ESPN Plus": "https://go.web.plus.espn.com/c/221109/718846/9070?subId1=trd-us-3089683051923517400&sharedId=trd-us&u=https%3A%2F%2Fplus.espn.com%2F"
  }
}