{
  "source": "https://www.techradar.com/news/resident-evil-village-is-allowing-the-franchise-to-explore-the-bizarre",
  "title": "Resident Evil Village is allowing the franchise to explore the bizarre",
  "category": "gaming",
  "updated": "2021-04-24T15:00:27Z",
  "author": "samuel-tolbert",
  "summary": "Opinion: less zombies, more vampire dommes",
  "article": [
    "Resident Evil is a bit long in the tooth. The franchise is far removed from the strange manor filled with horrors that first unfolded for players in 1996. As time goes on and the games grow beyond exploring the streets and sewers of Raccoon City, so too has the franchise grown beyond the zombies that first shuffled after Jill Valentine and Chris Redfield.",
    "This is why I'm happy that with Resident Evil Village, Capcom doesn't seem to be afraid about branching out and trying something very new, while still keeping the DNA of what makes the most-revered games tick. We've had plenty of games with zombies, including gorgeous remakes of both Resident Evil 2 and Resident Evil 3. It's time for a change.",
    "Moving forward, I want more snow-capped mountains and remote villages, less ruined cities and sterile Umbrella labs. More snarling werewolves and domineering vampires, less shuffling hordes of zombies and multi-eyeballed blobby monsters. The series is changing radically and I'm here for it.",
    "Now it's true that this isn't the first time that Resident Evil has changed up. Resident Evil 4 eschewed the T-Virus infected creatures of Raccoon City for the Las Plagas-infected villagers. Still, the trappings a zombie horde (or something close to it) were still there and other changes weren't exactly for the better, culminating in the over-the-top action set pieces of Resident Evil 6.",
    "Following this, the bold changes made in Resident Evil 7: Biohazard seeded the foundations of a good start, with a Southern Gothic dressing that turned a bayou plantation into a house of horrors. The game wears its inspiration from grindhouse horror on its sleeves, with the terrifyingly fantastic Baker family drawing inspiration from films like The Evil Dead, The Texas Chainsaw Massacre and Saw.",
    "Still, the more common enemies again fell back on a zombie-esque presentation, shambling corpse-like creatures called Molded. While the Molded are ostensibly entirely different from Zombies, encounters with them play out in an overall similar way, a weak point in an otherwise excellent reinvention of Resident Evil.",
    "After the critical and commercial success of the Resident Evil 2 and Resident Evil 3 remakes, I imagine it would've been easy for Capcom to lean in harder on everything traditional about the franchise. Seeing a third-person perspective, zombies and the threat of Umbrella as a backdrop again wouldn't have been surprising.",
    "Instead, what Capcom has aimed for is anything but safe. The hapless Ethan Winters again returns as protagonist, while the setting couldn't be more different. A mysterious European village and castle, with the enemies composed of vicious Lycans and seductive vampires straight out of medieval folklore.",
    "In particular, lightning has struck for Capcom in the imposing form of Lady Dimitrescu, known across the internet as the Tall Vampire Lady with practically universal approval and massive popularity. I'm happy to see Capcom take a risk with a character like this instead of yet another generic Tyrant or other bioweapon.",
    "The positive reception to Dimitrescu as the raw embodiment of an intimidating, enthralling woman will probably have an effect on female antagonists entirely in the years to come.",
    "Outside of the central opposing forces though, even the basic enemies are more interesting to me. In the trailers, we see Lycans approaching on all fours, jumping across rooftops and ripping through doors, shaking up the gameplay and providing a new avenue for keeping players tense and alert.",
    "Resident Evil Village is widely rumored to be the middle entry in a trilogy. If this really is the case, regardless of what happens to poor Ethan Winters, I'm hopeful to see Capcom continue to double down on widely varied environments and a range of imposing figures as more creative antagonists.",
    "No matter what form the setting takes, there are basics that clearly need to stay, such as finding different hidden items to unlock new paths, shortcuts and puzzles. Mainline Resident Evil games just won't feel right without these elements in at least some capacity.",
    "Still, the fact is Resident Evil has to change in order to keep going. I couldn't possibly predict where the next game after this will take place and that's incredibly exciting."
  ],
  "headers": {
    "3": "Venturing into unknown territory",
    "12": "Keeping it fresh while staying true"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Tall Vampire Lady": "https://www.androidcentral.com/tall-vampire-lady-stole-show-during-todays-resident-evil-village-showcase",
    "middle entry in a trilogy": "https://www.techradar.com/news/resident-evil-village-rumored-to-be-middle-entry-in-a-resident-evil-trilogy"
  }
}