{
  "source": "https://www.techradar.com/news/iphone-13-could-come-with-1tb-of-storage-according-to-new-report",
  "title": "iPhone 13 could come with 1TB of storage, according to new report",
  "category": "phones",
  "updated": "2021-03-01T01:36:21Z",
  "author": "stephen-lambrechts",
  "summary": "Apple's iPhone 12 Pros currently top out at 512GB of storage",
  "article": [
    "If you're the type who believes you can never have too much smartphone storage, you might be happy to hear that Apple may be planning on releasing an iPhone 13 model with up to 1TB of storage, as reported by 9to5Mac.",
    "The claim is based on a new report from the investment firm Wedbush Securities, which notes a supply chain check that suggests the Cupertino company's next-generation iPhone will offer a 1TB storage for the first time.",
    "At present, Apple's iPhone 12 Pro and iPhone 12 Pro Max models offer up 512GB of storage, and both are already quite expensive – we can only imagine how much an iPhone 13 Pro model with 1TB will end up costing.",
    "This isn't the first time that an iPhone 13 with 1TB of storage has been mooted – the YouTube channel Front Page Tech made the same claim back in January.",
    "In terms of iOS devices, Apple has offered a 1TB version of its iPad Pro since 2018, so it's entirely plausible that the company will eventually offer the same amount of storage on the iPhone.",
    "Of course, we won't know for sure until Apple officially announces its new handsets later in the year. Thankfully, it seems that iPhone 13 is still tipped to be launching in September 2021 as normal."
  ],
  "headers": {},
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "9to5Mac": "https://9to5mac.com/2021/02/28/report-iphone-13-to-offer-1-tb-storage-option/",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Front Page Tech": "https://www.youtube.com/watch?v=MgeTioKF6mU&feature=emb_title",
    "launching in September 2021 as normal": "https://www.techradar.com/news/iphone-13-tipped-to-be-launching-in-september-2021-as-normal"
  }
}