{
  "source": "https://www.techradar.com/news/10-best-detective-games-on-pc",
  "title": "The 10 best detective games on PC",
  "category": "computing",
  "updated": "2021-08-31T09:12:07Z",
  "author": "robert-zak",
  "summary": "Cracking the case",
  "article": [
    "There’s something about the pathos of the hard-boiled detective - stubble as thorny as their wit, a hip-flask for a best friend - that reflects the historical solitude of being a PC gamer.",
    "While 90s console gamers were squealing with delight at split-screen Mario Kart, we were solving grisly murders as Gabriel Knight or George Stobbart - our faces split by shadows cast by the venetian blinds behind the computer, immersed in a fog of cigarette smoke (or perhaps steam rising up off a takeaway pizza).",
    "But detective games aren’t just a cold case from the 90s. The genre is well represented today, with all kinds of variations from classically styled noir tales to choice-driven adventures and experimental indies where your conclusions drive the story. Here are the best of them.",
    "It’s fitting to start this list with one of the great ancestors of the detective game. Released in 1993, Gabriel Knight: Sins of the Fathers threw us into a muggy world of murder, voodoo and mystery in New Orleans. You play the titular character - a southern-drawling author voiced by none other than Tim Curry - who is more intricately connected to the area’s grisly events than he’d like to be.",
    "While some of the puzzles have that frustrating 90s insolvability, the voicework, art, music and story are still wonderful. Yes, Gabriel Knight is a dirtbag in a way that wouldn’t fly in a game made today, but that’s part of his anachronistic charm. The bizarre FMV sequel is worth a look too.",
    "You’re Sonny Featherland, one half of the legendary ‘Chicken Police’ detective duo. Like every great noir tale, it starts with a dame stepping into your office, and duly pulling you into a murder mystery way above your pay-grade. Interesting deduction and questioning mechanics give you a nice bit of agency in this story-focused adventure.",
    "A cursory look at this game will quickly grab the attention of fans of pulp fiction novellas, Raymond Chandler and anthropomorphic animals. The distinctive aesthetic - high contrast black-and-white with photos of animal heads stuck onto human bodies - combined with its slick script makes for a captivating adventure.",
    "A ship long thought lost floats into a port with nothing but a bunch of dried-out corpses onboard. As an insurance investigator, you step aboard to figure out what happened to the entire crew, using a magical timepiece that you hover over bodies to pull you into a vignette showing their moment of death.",
    "Return of the Obra Dinn is quite possibly the best crime-scene investigation game out there, as you freely walk inside dead peoples’ memories to figure out who they were and how exactly they died. As you go about establishing each person’s fate through the stippled aesthetic of an old Macintosh game, you unravel the vessel’s tragic, riveting story.",
    "This death-filled tale comes to life through lovely music and intertitle voicework worthy of a BBC radio play.",
    "Most detective games implement systems to aid you in your investigations - whether it’s a glowing marker or voiceover line nudging you about where to go next. This beautifully illustrated point-and-click adventure, set in a moody steampunk city, strips away such conveniences and leaves you to carry out investigations your way.",
    "Investigate crime scenes, gather suspects, and even falsely accuse the wrong person - you’re the detective, and your ability alone will dictate the outcomes of the five investigations you embark upon. A genuinely tough test of your sleuth skills.",
    "You are Rosangela Blackwell, a socially-awkward spirit medium who with the help of her wise-cracking ghost guide wanders around beautifully drawn scenes in New York City to help ghosts move onto the afterlife.",
    "You do this by working out who they are and how they died. You make phone calls, explore the city, ask tough questions, and uncover the story of Rosa’s unique family across this episode-style series.",
    "The series’ creator Dave Gilbert may well be one of the most overlooked writers in videogames. Choice-driven adventure Unavowed is his most popular work, but the five games of the Blackwell series are a better fit if you’re looking for investigation and deduction.",
    "A lot of detective work is done out in the field, but Silicon Dreams is one of the best videogame representations of that other side of detective work: the interrogation.",
    "You’re an android working for an all-powerful android manufacturer, and it’s your job to interrogate your fellow androids suspected of ‘deviancy’, dictating whether they live or *ahem* get ‘decommissioned’. As you question androids, you can track and manipulate their emotions to get more revealing answers. There’s no voice-acting, but the writing is superb, and will give you moral quandaries to rival Rick Deckard’s.",
    "Still among the only big-budget games brave enough to slow down the pace and deliver an intriguing detective odyssey. As LAPD detective Cole Phelps, you’re faced with solving a string of crimes that inevitably connect some of the city’s most powerful figures in a sleazy and corrupt 1950s Los Angeles.",
    "One of the unique things introduced here was hyper-detailed facial animation, which you can read to gauge whether someone is lying to you during questioning and interrogations. Along with the next entry on this list, L.A. Noire is one of the most full-blooded detective stories in videogames, even if it feels a little creaky in the way of combat these days.",
    "No game pulls you into the tormented psyche of a self-loathing detective quite like this. As the initially anonymous ‘Detective’, you wake up to a splitting hangover and just about pull yourself together enough to investigate a body hanging from a tree. From here, you can pursue the investigation, or explore the semi-ruined city of Rivachol at your leisure.",
    "The only RPG on this list, Disco Elysium offers untold directions to take your character - whether you want to be a neoliberal evangelist or a tough guy who believes people are more likely to tell you what you want if they have a black eye. With the Final Cut update, the game’s already impressive voice-acting has expanded, and there are some new paths to take your character down, making it a great time to spiral into its sordid and decrepit world.",
    "In a nocturnal world where fairy tales collide with reality in often brutal fashion, you’re the werewolf sheriff of a district in 80s New York called Fabletown, tasked with keeping its colorful denizens safe.",
    "Like other titles from Telltale Games, this dark and engrossing mystery is less about investigation and more about making big decisions that will alter characters’ fates and the outcome of your story.",
    "The Wolf Among Us is an episodic game about a detective rather than a true detective game, but is still a brilliantly written noir thriller worth experiencing.",
    "Coming up just behind Lamplight City as the most unguided detective game on this list, Paradise Killer sweeps you away to a resort island where you’re called in to investigate a murder. Along the way you uncover myriad other mysteries and a glorious cast of campy characters - one of whom is ultimately the killer.",
    "You freely explore the island in first-person, building up your case and pointing your finger at whoever you like in this most vibrant and psychedelic of whodunits. Things get pretty weird and demonic, so best leave your expectations back on the mainland before heading out to Paradise Island."
  ],
  "headers": {
    "3": "1. Gabriel Knight: Sins of the Fathers",
    "5": "2. Chicken Police - Paint it RED!",
    "7": "3. Return of the Obra Dinn",
    "10": "4. Lamplight City",
    "12": "5. The Blackwell series",
    "15": "6. Silicon Dreams",
    "17": "7. L.A. Noire",
    "19": "8. Disco Elysium",
    "21": "9. The Wolf Among Us",
    "24": "10. Paradise Killer"
  },
  "links": {}
}