{
  "source": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
  "title": "Apple Arcade price, games, controllers and if it's worth it",
  "category": "gaming",
  "updated": "2021-04-03T08:03:26.434Z",
  "author": "gerald-lynch",
  "summary": "Apple's constantly-growing premium games service",
  "article": [
    "If you own an i-device, Apple Arcade is very possibly something you're aware of; it's a gaming service that offers you access to a big collection of titles in a wide range of genres.",
    "Running on iPhones, iPads, Apple TVs and Macs, Apple Arcade was launched in 2019 and since then has grown considerably, with its initial list of 60 games nearly tripled in size as of early 2021.",
    "It's Apple's take on the whole 'Netflix-for-gaming' approach – and like the popular video streaming company, Apple has put plenty of money into its own productions too, so lots of the games on Apple Arcade can't be played anywhere else.",
    "Whether you're on the fence about paying the subscription fee, or already do and want to know how to make the most of the Apple Arcade service, we'll run you briefly through what you need to know.",
    "Apple Arcade bucks the trend for Apple's usual pricing strategies. While Apple Arcade offers a monthly family subscription plan in the vein of Apple News Plus, Apple Music, and Apple TV Plus, it will only cost only $4.99 / AED 19.99 / £4.99 / AU$7.99 per month rather than the $9.99 cost of some of its sibling platforms. In addition, you get a one-month free trial.",
    "That low price may be a sign of Apple trying to find a competitive foothold in a pretty packed market – Android phones have the rival Google Play Pass which has some big-name games on it.",
    "If you want, you can also get Apple Arcade access through Apple One - that's the company's all-in-one subscription services that gives you access to many of its platforms, including Arcade.",
    "Any good gaming platform needs a great controller – but Apple Arcade is in the rather unique position of having to work across multiple hardware platforms and input devices – be that over a touchscreen for iPad and iPhone, a keyboard and mouse for Mac, or a remote for Apple TV.",
    "When it comes to gaming, nothing beats a gamepad. While Apple doesn't sell a specific Apple Arcade controller, wireless support for the PS4 DualShock 4 and Microsoft's Xbox One controllers is available on tvOS, iPadOS and iOS 13, so you'll be able to pair the gamepads with these devices. In addition, some games support MFi Bluetooth controllers.",
    "Additionally, support for Xbox Series X and PS5 controllers is being added with iOS 14.5, which is in beta at the time of writing.",
    "If you're an Apple Arcade subscriber, it's very easy to download games.",
    "On iOS and iPadOS, head on over to the App Store, then click Arcade on the bottom. The titles here can only be downloaded by subscribers, so you can take your pick from the selections, and make the most of the categories tabs to find what you're looking for.",
    "On a Mac, the process is similar, but the Arcade button will be in the sidebar in the App Store.",
    "If you're an Apple TV user, you'll find there's a specific Apple Arcade app you can use to find titles to play, but you can also find Arcade games in the App Store.",
    "With about 180 games available at the time of writing, we're not going to list every single title here, but we've got a list of every Apple Arcade game, as well as a ranking of the best Apple Arcade games you should try.",
    "Some of the titles on Apple Arcade include exclusives, like Lego Brawls - however we must point out that many titles billed as 'Apple Originals' are not, in fact, exclusive to Apple Arcade, curiously.",
    "A few popular new and old indie games, like Monument Valley and Don't Starve: Pocket Edition are available on the service too, and these games are on the App Store as well, but you have to pay lots for them there, so an Apple Arcade subscription could be worth it.",
    "Apple Arcade titles cross a large selection of genres, from sport to action to puzzle to family games, and while they're typically quite lightweight, a few are more intensive and engaging.",
    "We've got a full Apple Arcade review which delves into whether it's worth your money or not, but we can bring you the key points.",
    "In our review we state: \"if you don’t need AAA titles, Apple Arcade has a lot of surprises and genuinely pleasant games across plenty of genres.\", due to its large catalog of smaller titles.",
    "We found some hardware problems though: \"[iPhones] get very hot to the touch when playing even short sessions of five to ten minutes. It can become very uncomfortable to hold iPhones when this happens, as the aluminum rim and the buttons get toasty.\"",
    "When writing our initial review in 2019 we decided \"more games are coming each month, Apple insists, but how many - and of what quality - we don’t know. The games we’ve played in the existing catalog, while universally stylish in their art, vary in appeal and depth. Some are clearly extensive labors of love, while others are pretty simple in concept and execution. It’s a grab bag of experiences.\"",
    "So if you're looking for some fun new titles to play on mobile, it's a good choice, but there aren't too many large-scale or AAA games to entertain you for long amounts of time. Perhaps that'll change in the future, though."
  ],
  "headers": {
    "4": "Apple Arcade price",
    "7": "Apple Arcade controllers",
    "10": "How to download Apple Arcade games",
    "14": "Apple Arcade games",
    "18": "Is Apple Arcade worth it?"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/reviews/apple-arcade",
    "Apple News Plus": "https://www.techradar.com/news/apple-news-plus",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Apple One": "https://www.techradar.com/news/apple-one-subscription-service-release-date-price-and-news",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "list of every Apple Arcade game": "https://www.techradar.com/news/apple-arcade-games-list-every-game-you-can-play-right-now",
    "best Apple Arcade games": "https://www.techradar.com/best/best-apple-arcade-games",
    "Apple Arcade review": "https://www.techradar.com/reviews/apple-arcade"
  }
}