{
  "source": "https://www.techradar.com/news/cisa-urges-all-microsoft-cosmos-db-users-to-update-passwords-now",
  "title": "CISA urges all Microsoft Cosmos DB users to update passwords now",
  "category": "computing",
  "updated": "2021-08-30T11:12:25Z",
  "author": "mayank-sharma",
  "summary": "It’s difficult to estimate who has been hit, experts say",
  "article": [
    "The Cybersecurity and Infrastructure Security Agency (CISA) is urging all users of Microsoft’s Azure Cosmos DB database service to regenerate their certificate keys, following the discovery of a serious security flaw that could hand over control of the databases to unauthorized individuals.",
    "The Cosmos DB flaw was discovered by cloud infrastructure security company Wiz, who were able to exploit a vulnerability in the service’s Jupyter Notebook implementation, which gave attackers access to the database’ primary keys and other highly sensitive secrets such as its blob storage access token.",
    "Upon being notified, Microsoft quickly disabled Jupyter, and emailed a section of its users to rotate their keys. The CISA however suggests all Cosmos DB to follow this precautionary step.",
    "“Although the misconfiguration appears to have been fixed within the Azure cloud, CISA strongly encourages Azure Cosmos DB customers to roll and regenerate their certificate keys and to review Microsoft’s guidance on how to Secure access to data in Azure Cosmos DB,” notes CISA in its advisory.",
    "According to the Wiz researchers, the flaw would equip threat actors with everything they need to access and exercise full read/write/delete control over the database from across the internet.",
    "In a blog post, Microsoft said that its investigation indicated that “no customer data was accessed because of this vulnerability,” adding that they’ve notified the customers whose keys may have been affected by the researchers.",
    "However, the Wiz researchers sided with CISA’s directive that extended the advisory to all Cosmos DB users, since it’s difficult to gauge the true impact of the vulnerability.",
    "\"In my estimation, it's really hard for them, if not impossible, to completely rule out that someone used this before,\" Wiz Chief Technology Officer Ami Luttwak told Reuters.",
    "Via Reuters"
  ],
  "headers": {
    "4": "Don’t take it lightly"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "database": "https://www.techradar.com/best/best-database-software",
    "Cosmos DB flaw": "https://www.techradar.com/news/microsoft-warns-thousands-of-azure-cloud-databases-may-have-been-exposed",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Wiz": "https://www.techradar.com/news/google-amazon-forced-to-patch-dns-platforms-after-serious-bug-discovered",
    "Secure access to data in Azure Cosmos DB": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-7671140832162940000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fazure%2Fcosmos-db%2Fsecure-access-to-data%3Ftabs%3Dusing-primary-key%23primary-keys",
    "In a blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1235815877660829200&xs=1&url=https%3A%2F%2Fmsrc-blog.microsoft.com%2F2021%2F08%2F27%2Fupdate-on-vulnerability-in-the-azure-cosmos-db-jupyter-notebook-feature%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcisa-urges-all-microsoft-cosmos-db-users-to-update-passwords-now",
    "Reuters": "https://www.reuters.com/technology/researchers-cybersecurity-agency-urge-action-by-microsoft-cloud-database-users-2021-08-28/"
  }
}