{
  "source": "https://www.techradar.com/news/microsoft-mocks-apple-ipad-pro-in-new-ad-but-is-attacking-its-rival-the-right-move",
  "title": "Microsoft mocks Apple iPad Pro in new ad – but is attacking its rival the right move?",
  "category": "computing",
  "updated": "2021-04-06T10:46:33Z",
  "author": "matt-hanson",
  "summary": "Going on the offensive",
  "article": [
    "Microsoft has gone on the attack in a new advert for the Surface Pro 7, this time mocking Apple’s iPad Pro.",
    "In the advert, which you can watch below, Microsoft points out how the Surface Pro 7 has a built-in kickstand, while the iPad Pro does not.",
    "The fact that the iPad Pro doesn’t have a kickstand probably isn’t a major problem for many people, so the fact that Microsoft kicks off the advert by bringing that up makes us feel like the company is on shaky ground when comparing its Surface Pro tablet to Apple’s much more popular iPad Pro.",
    "Things don’t improve much when the advert starts complaining about the iPad Pro’s heavy keyboard – again not something that a lot of people will care about, especially when they don’t use the keyboard.",
    "As Neowin points out, the reason why Microsoft may be focusing on the rather irrelevant aspect of keyboard weight is that the Surface Pro 7 is actually heavier than the iPad Pro (1.7 pounds vs 1.41 pounds). However, comparing both tablets with their keyboards attached, the iPad Pro becomes heavier than the Surface Pro 7.",
    "It’s a bit of a cheeky comparison, then, considering how both tablets are sold without the keyboards, and the majority of people use them without them – in which case the iPad Pro has the weight advantage.",
    "Microsoft is on much firmer ground, however, when it compares ports, with the Surface Pro 7 coming with two USB ports, including a legacy USB Type-A port, compared to the iPad Pro’s single port.",
    "This is an actual genuine advantage that the Surface Pro 7 has over the iPad Pro, making it a more useful tool for people who want to use these tablets for productivity.",
    "Microsoft also claims that while the iPad Pro is ‘just a tablet’, the Surface Pro 7 is a ‘full computer and a tablet’ – referring to the fact that the Surface Pro 7 runs a full version of Windows 10, while the iPad Pro uses the iPadOS mobile operating system.",
    "Microsoft highlights the price difference too, with the Surface Pro costing $880 (around £630, AU$1,150) compared to the iPad Pro’s $1,348 (around £1,000, AU$1,800). Of course, this is highly selective, as there are a wide range of Surface Pro 7 configurations, many of which are a lot more expensive than the prices quoted here.",
    "However, these feel like the only areas where Microsoft’s attacks on Apple land. It also leaves us wondering if this aggressive marketing will pay off. In a way, we’d rather see a more positive advert where Microsoft focussed on the Surface Pro 7’s features, rather than comparing it to a more popular rival. It would certainly make Microsoft appear more confident in its own product.",
    "The fact that Microsoft struggles to find areas where the Surface Pro 7 beats the iPad Pro doesn’t help either – seriously, are kickstands and the weight of an optional keyboard really that important to most people?",
    "That’s not to say Microsoft shouldn’t criticize Apple – there are plenty of valid reasons to dunk on the fruit-themed company – and arguably Apple started it first with its Mac vs PC adverts from years ago.",
    "However, maybe Microsoft should target its attacks a bit better, otherwise it just comes off as a bit defensive. On the other hand, perhaps the advertising worked as intended – after all, it’s got us talking about it."
  ],
  "headers": {
    "6": "Ports in a storm"
  },
  "links": {
    "Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "Neowin points out": "https://www.neowin.net/news/new-surface-pro-7-ad-targets-the-ipad-pros-heavy-keyboard/",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "iPadOS": "https://www.techradar.com/news/new-ipados-15"
  }
}