{
  "source": "https://www.techradar.com/news/spacexs-inspiration4-mission-is-all-anyone-can-talk-about-in-this-weeks-science-news",
  "title": "SpaceX's Inspiration4 mission is all anyone can talk about in this week's science news",
  "category": "appliances",
  "updated": "2021-09-17T21:35:44Z",
  "author": "john-loeffler",
  "summary": "There were definitely other things that happened up there though",
  "article": [
    "What else is there to say? This week was all about the lead-up to and successful launch of SpaceX's historic all-civilian Inspiration4 space mission. The excitement for the launch had been palpable all last week and weekend, making the day-by-day countdown and the spectacular launch itself that much more thrilling.",
    "You've probably heard by now that the Inpiration4 crew is currently orbiting the Earth at an distance of 363 miles (585 km), but they didn't just radio back their report. The newly-minted astronauts took photos of the Crew Dragon Resilience capsule's massive cupola – the largest-ever single window in space – giving Inspiration4 a spectacular 360-degree view of outer space and Earth.",
    "This wasn't the only SpaceX launch this week, with SpaceX sending up another round of Starlink satellites to start the week and continue to build its global satellite broadband network, which can't come quickly enough.",
    "To help get those and other satellites and manned space missions safely into orbit, Apple Co-Founder Steve Wozniak announced that he was getting into the private space company game, something that definitely feels different than what's become a billionaire's space race. He's not going up for pleasure, thought – his company's mission is to clean up after over half a century of human activity in space.",
    "And finally, there was a fascinating study this week that shows how, when the end game of all these rocket launches finally comes and we start to establish settlements on another world, a sustainable construction solution on the ground of the moon or Mars could rely on some old fashion construction practices you might not be expecting.",
    "SpaceX's Inspiration4 mission is without question the science story of the week as media around the world covered the historic-first, all-civilian space flight launch from Kennedy Space Center in Florida on the night of Wednesday, September 15.",
    "The launch, which we've embedded below in case you missed it, went off almost entirely without a hitch. Several minutes after the Crew Dragon Resilience space capsule made it into orbit, the nose cone of the craft was supposed to lift, revealing a specially made cupola that gives the crew a 360-degree view of space and the Earth below.",
    "Unfortunately, the video feed from the capsule cut out shortly before the nose cone was set to lift, so we missed out on Wednesday night of the spectacular views Inspiration4 would get to enjoy during its three-day mission.",
    "We didn't have to wait long for images of the crew free-floating in zero-gravity to make their way back to Earth though, but it truly was the cupola on the Crew Dragon Resilience that stole the show as Friday rolled around.",
    "While we don't get to enjoy the kinds of views that the Inspiration4 astronauts will enjoy for the remainder of the mission, the photos they sent back still have that touch of sublime wonder that only planet Earth in all its blue-wrapped glory can inspire.",
    "Meanwhile, while Inspiration4 was entering orbit and starting its mission, SpaceX's latest additions to its Starlink satellite constellation have been moving themselves into position among the more than 1,600 other Starlink satellites that SpaceX previously put into orbit.",
    "SpaceX's Starlink, a network of as many as 12,000 satellites in orbit around Earth when it is completed, is expected to provide high-speed broadband internet access to any point on the surface of the Earth, from the summit of Mt. Everest to sparsely populated rural areas that are typically underserved by internet providers who have no financial incentive to invest money into laying fiber optic cable for so few customers.",
    "SpaceX is making that investment though, much to the annoyance of its competitors.",
    "Legendary Apple co-founder Steve Wozniak announced a new private space venture this week in partnership with Ripcord Inc.'s founder Alex Fielding to help clean up space debris to make the lanes of space travel safe for people and material to move though them.",
    "A huge part of the problem are the incredible number of satellites orbiting the planet (especially those that have been decommissioned) along with spent rocket boosters, fairings, and other debris left over by the astronauts that came before.",
    "This floating debris is no joke: over 500,000 pieces of space junk larger than a marble are currently orbiting the planet at speeds of up to 17,500 mph. If any hit you going the wrong way, you better hope the walls of your spacecraft are good and thick to withstand the incredible force of the blow.",
    "It's this shooting gallery of outer space that Wozniak and Fielding hope Privateer could clean up, but having just announced themselves, it will take time for Privateer to prove itself but there will be a lot of relived space engineers and astronauts out there who will breathe a sigh of relief if it does.",
    "All this talk of rocket launches, orbital debris, and civilian space flight ultimately has one end goal, to established an inhabitable settlement on another world, first the moon, and then Mars after that.",
    "Getting the material for building them into space, however, is a very expensive proposition. The challenge of how to establish a moon base economically has been a long-standing engineering challenge, but a new study might have come up with a novel solution: the blood of astronauts (and also their urine, sweat, and tears).",
    "As it turns out, there's a protein in all of our blood that when mixed with moon or Mars dust forms a biomaterial that has a compressive impact strength comparable to concrete, and adding urea for our urine or sweat can make this material about 300% stronger on top of that.",
    "It might not be the same as carving out stone and building a base out of steel and glass, but any base we establish on the moon or Mars are going to rely almost exclusively on locally sourced materials, which apparently could include the astronauts themselves."
  ],
  "headers": {},
  "links": {
    "Inspiration4 space mission": "https://www.techradar.com/news/inspiration4-successfully-lifts-off-in-historic-first-all-civilian-mission-to-space",
    "launch from Kennedy Space Center in Florida": "https://www.techradar.com/news/inspiration4-successfully-lifts-off-in-historic-first-all-civilian-mission-to-space",
    "cupola on the Crew Dragon Resilience": "https://www.techradar.com/news/first-images-of-spacex-inspiration4-crew-in-orbit-reveal-their-window-onto-the-world",
    "SpaceX's latest additions to its Starlink satellite constellation": "https://www.techradar.com/news/watch-spacex-launch-its-next-round-of-starlink-satellites-into-orbit",
    "Steve Wozniak announced a new private space venture": "https://www.techradar.com/news/apple-co-founder-steve-wozniak-announces-private-space-venture-unlike-the-others",
    "blood of astronauts (and also their urine, sweat, and tears)": "https://www.techradar.com/news/could-future-moon-and-mars-bases-be-built-from-astronaut-blood-and-space-dust"
  }
}