{
  "source": "https://www.techradar.com/news/your-amazon-echo-speaker-is-getting-an-update-that-matters",
  "title": "Your Amazon Echo speaker is getting an update that matters",
  "category": "smart-home",
  "updated": "2021-07-22T16:13:07Z",
  "author": "rhys-wood",
  "summary": "Amazon joins the Matter initiative",
  "article": [
    "Amazon will be updating its plug-in Echo speakers with open-source platform Matter later this year, joining other big tech companies like Samsung, Google, Philips Hue and more in a joint effort to simplify the smart home setup process.",
    "As reported by The Verge, Amazon is the latest tech company to join the Matter initiative, and will be updating its Echo Studio, Echo Show, Echo Flex and Echo Plus speakers, as well as most speakers in the popular Echo Dot range. No release date for the update has been announced as of yet, with just a vague ‘late 2021’ to go off for now.",
    "Not every Amazon Echo speaker will receive the update, unfortunately, with the first-gen Echo and Echo Dot missing out alongside the Echo Tap. That’s understandable, given the age of these speakers compared to more recent models, so it’s likely these earlier devices don’t meet the Matter standard.",
    "For the uninitiated, Matter is a joint open-source platform that’s composed of tech companies that specialize in smart home tech, like the aforementioned Amazon, Samsung, Google and others. The concept stems from the desire to create a unified smart home brand that’s compatible with the voice assistant of your choice.",
    "Connections supported by Matter include all the usuals you've come to expect, such as Bluetooth, Thread and WLAN. It's also possible that Ethernet connections will be supported sometime after launch.",
    "In theory, this should make the process of setting up a smart home easier than ever, minimizing the amount of incompatibilities that might otherwise crop up. With Matter, for example, a user could keep their desired voice assistant (such as Alexa or Google Assistant) and use it to control Matter branded devices like Philips Hue smart lights or wireless Bluetooth speakers.",
    "Matter is comprised of over 170 tech companies dedicated to unifying a smart home experience. It was set up by the Connectivity Standards Alliance (formerly the Zigbee Alliance). The Matter branding is also license-free, making it just about as accessible as it gets.",
    "So why is Amazon joining the Matter initiative noteworthy? For one, and most obviously, it shows that the tech giant is willing to play ball with other manufacturers. Amazon likely already has good relations with most of these other companies - particularly Samsung and Philips - that host storefronts on Amazon's site.",
    "It also means that Amazon Echo users have nothing to fear if they want to either get started with - or improve - a smart home environment. They can be safe in the knowledge that Amazon smart devices will be largely compatible with other products under the Matter umbrella.",
    "The concept of Matter is an ambitious endeavor that will still rely on each individual tech company to do their bit in updating their respective devices. Ultimately, though, we’re happy to see these companies working together to simplify the smart home process, which will potentially introduce the concept and its litany of useful perks to a wider audience."
  ],
  "headers": {
    "6": "Analysis: what's the Matter?"
  },
  "links": {
    "Echo speakers": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Samsung": "https://www.techradar.com/news/best-samsung-phones",
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "The Verge": "https://www.theverge.com/2021/7/21/22586377/amazon-echo-matter-standard-dot-show-studio-flex-plus-upgrade",
    "Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Echo Show": "https://www.techradar.com/news/echo-show-8-2021-vs-echo-show-5-2021-which-amazon-smart-display-is-for-you",
    "Echo Flex": "https://www.techradar.com/reviews/echo-flex",
    "Echo Plus": "https://www.techradar.com/reviews/amazon-echo-plus-review",
    "Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you"
  }
}