{
  "source": "https://www.techradar.com/news/apple-wwdc-2021-keynote-date-and-time",
  "title": "Apple locks in WWDC 2021 keynote date and time – here's when we'll see iOS 15",
  "category": "phones",
  "updated": "2021-05-24T20:49:50Z",
  "author": "michael-hicks",
  "summary": "Will Apple Glasses or the new MacBook make a WWDC 2021 appearance?",
  "article": [
    "Lock the Apple WWDC 2021 keynote time into your iCal: Tim Cook will take the stage Monday, June 7 at 10am PDT, according to some official news by the company today.",
    "The means you'll be able to tune into the Apple WWDC 2021 live stream at 10am PDT / 1pm EDT / 6pm BST and 3am AEST (technically June 8 by that time), and you can now peruse the developer conference's program schedule.",
    "At the WWDC keynote, we expect to see a variety of product and software reveals, from the nearly confirmed iOS 15 to the still theoretical Apple Glasses.",
    "The date isn't actually new news. Apple revealed back in March that its Worldwide Developers Conference was scheduled for Monday, June 7 through Friday, June 11. Now we know more about how Apple will fill the rest of the week after the keynote.",
    "With the rest of the conference so developer-focused, most Apple consumers are focused on the keynote, wondering what Tim Cook and company have planned.",
    "We're fairly positive that each of the latest operating systems will make an appearance. Beyond iOS 15, we should see the latest tricks of iPadOS 15, tvOS 15, macOS 12 and watchOS 8. The latter will have to combat Google's exciting new Wear OS upgrades announced at Google IO last week.",
    "We don't expect the iPhone 13 or Apple Watch 7 to make appearances, but leaker Jon Prosser claimed on Twitter today that he can 'confirm macbook pro is coming' to WWDC 2021. We last heard that the new MacBook Pro with M1 chip could get a huge upgrade with up to 64GB of RAM, so we're excited to see if this proves true.",
    "Plus, the promo images for WWDC 2021 have all hinted at something related to Apple Glasses, so we've speculated for some time that Apple could finally show off its long-rumored AR/VR glasses next month.",
    "After the keynote, Apple will hold a Platforms State of the Union at 2pm PT specifically targeted to developers; it will take a 'deeper dive into the new tools, technologies, and advances across Apple platforms' and stream on the Apple Developers app.",
    "On the Developers app, you'll find Pavilions where devs can search for relevant information on new products or a given topic. Apple will stream over 200 Sessions focused on iOS app development to the app as well across the five days, plus allow you to schedule 'one-on-one lab consultations' with Apple developers."
  ],
  "headers": {
    "4": "What to expect at the Apple WWDC 2021 keynote"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "news": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3924286944978969600&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F05%2Fapples-worldwide-developers-conference-kicks-off-june-7%2F",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses",
    "revealed": "https://www.techradar.com/news/wwdc-2021-date",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "Wear OS upgrades": "https://www.techradar.com/news/wearos-is-finally-getting-an-update-that-might-make-its-smartwatches-good-again",
    "Google IO": "https://www.techradar.com/news/google-io-2021-live-blog",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "claimed": "https://twitter.com/jon_prosser/status/1396915038154334214?s=21",
    "upgrade": "https://www.techradar.com/news/apples-next-m1-macbook-pro-may-boast-a-huge-upgrade",
    "Apple Developers app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8648499773229208000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fapple-developer%2Fid640199958",
    "Sessions": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1022090509040470900&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fwwdc21%2Fsessions%2F"
  }
}