{
  "source": "https://www.techradar.com/news/should-i-buy-a-full-frame-camera-in-2021",
  "title": "Should I buy a full-frame camera in 2021?",
  "category": "cameras",
  "updated": "2021-07-17T08:00:00Z",
  "author": "tim-coleman",
  "summary": "Is it time to go all-in on full-frame?",
  "article": [
    "If you're getting serious about photography (or video), then you've probably looked into full-frame cameras. There's a degree of camera snobbery when it comes to this sensor size and you might think that you need full-frame in order to get better photos than from a smartphone or crop-sensor digital camera.",
    "While this is isn't strictly true, most camera brands are certainly keen to push the idea that we need full-frame. This part of the market has exploded recently – Sony, Nikon, Canon, Panasonic and Leica are all part of this full-frame flurry, mainly through new mirrorless cameras and the occasional DSLR.",
    "So why such intense full-frame competition now? To an extent, it's down to smartphones. Yes, phones. Camera tech has improved so much in our pocket devices, that point-and-shoot cameras have now been all-but-obliterated. So if we're prepared to cough up for a dedicated camera (and once we have, to bother using it and buy expensive lenses), then it needs to offer a whole lot more than our smartphone.",
    "What trump card does full-frame hold? In theory, superior image quality. A full-frame sensor equals pro image quality, or so the over-simplification goes. There are popular cameras with smaller sensor sizes in 2021, too, from the likes of Panasonic, Olympus and Fujifilm. These cameras with Four Thirds and APS-C sensors rely more on retro styling and putting EVFs in small form factors to set themselves apart from phones and full-frame cameras.",
    "But before we dive into the benefits of full-frame, let's take a quick lesson in what it actually is...",
    "In digital cameras, full-frame refers to the sensor size and measures 36x24mm, which emulates a regular single frame of 35mm film. In analogue days pushing back 100 years, 35mm (or full-frame) was originally considered small, but today it's seen as the playground for pros.",
    "Full-frame is the reference point for all other sensor sizes, bigger and smaller. Those smaller than full-frame are known as crop-sensors, with the common formats being; APS-C (smaller by 2.5x approx), micro-four-thirds (almost 4x) and 1in (by around 7.5x). Sensors in decent smartphones are around 25x smaller. (Those size differences are not to be confused with crop factor, a term we'll touch on later.)",
    "In 2021 we're spoilt for choice; the Panasonic S series, the Canon EOS R collection (and DSLRs), Sony's a7 mirrorless range, plus Nikon's Z6 and Z7 models and its DSLRs and let's not forget Leica M rangefinders. That's a lot of full-frame cameras to choose from. These latest full-frame mirrorless cameras are especially well poised to accommodate photography and video users simultaneously.",
    "Not all brands have embraced full-frame. Fujifilm has straddled this format with its smaller APS-C sensor 'X' series and its larger medium format 'GFX' range, while Olympus has stuck with its smaller-still micro-four-thirds OM-D range.",
    "So does sensor size really matter? Just what can you expect by going full-frame and is superior image quality guaranteed? As with anything, it's not that simple.",
    "The topic of sensor size is a genuine rabbit hole, with plenty of contrary information out there. Many of the perceived benefits to full-frame are not technically categorical, though in real-world use are often more practical. It's complicated. However, we'll do our best to keep the key points clear and concise...",
    "1. Superior image quality",
    "A physically larger sensor can host larger and/or more pixels (also technically known as photosites), which make up the image. Firstly, larger pixels are better equipped to gather light, especially when drawing fair comparisons between same generation sensors. Two aspects of image quality that consequently reap the rewards are low light performance and dynamic range.",
    "Indoors and at night, whenever light is low, it is easier to make sharper looking images with more contrast by shooting full-frame. That's because better light gathering reduces the adverse impact of 'noise' (grain). Provided all the exposure information is the same, full-frame is superior in low light to crop-sensor shots.",
    "There are workarounds for improving low-light performance such as increasing your exposure (using shutter speed or aperture). However, depending on what you're shooting, that's not always possible. Phones also have a few tricks up their sleeves to artificially reduce noise, provided your subjects are stationary (for example, night mode boosts image brightness), but you'll need to hold the phone steady and it's useless if your subjects are on the move.",
    "In scenes containing bright highlights and dark shadows – high contrast light – a full-frame sensor will capture more of those tones in a single image. We call this dynamic range – the amount of detail that can be captured from white to black. Again, smartphones use a high dynamic range (HDR) trick to extend the range of tones in the final image, being achieved by combining multiple identical images shot at different brightness values.",
    "Although smartphones emulate brighter low-light images and high dynamic range, it's nowhere near as practical as achieving the real thing in a single full-frame image.",
    "2. Larger images",
    "As we said previously, the larger the sensor, the more space there is to host pixels. The more pixels you have, the larger the image size (known as enlargement). This doesn't matter so much if your images are only ever going to be seen on a phone or tablet, for which 12MP is ample. However, if you're looking at displaying and printing big, then you'll want more pixels.",
    "Many flagship full-frame cameras have around 45MP sensors, while the smaller APS-C and Micro Four Thirds cameras tend to have around 20MP to 24MP, making for images about half the size. Not all full-frame cameras have more pixels than those with crop sensors, but in such a case the pixels are larger and low light image quality will be noticeably better.",
    "3. Bokeh",
    "Full-frame has an indirect advantage over a crop-sensor for acquiring a shallow depth-of-field, which is an important consideration especially for portrait photographers. This is because the more the surroundings are out of focus, the more the subject stands out. The quality of those blurry bits is known as bokeh and full-frame has greater bokeh potential.",
    "Technically, it's possible to get the same image composition and depth of field with a crop-sensor camera by adjusting the lens focal length and aperture plus your distance from the subject. However, this might not be possible, and if it is, full-frame has a higher magnification of out-of-focus areas, which usually results in a more pleasing bokeh.",
    "A blur effect is also possible by using the portrait mode available in most smartphones. Often surprisingly effective, portrait mode is computational, recreating blur with a uniform strength. However, in a full-frame camera, the blurry goodness possesses genuine depth – the further objects are from the area of sharp focus, the more out-of-focus they are. Plus there's no risk of digital artifacts like in portrait mode.",
    "Sensor size is not a one-way street, with inevitable drawbacks when going bigger. In general, though not always, a bigger sensor means a bigger and heavier camera (and the same goes for lenses). Again, full-frame cameras are usually more expensive than crop-sensor cameras.",
    "Price and size can put a lot of first-timers off, and for many a crop-sensor camera might make more sense. Forgetting whether you can afford full-frame, the greater size and weight can make or break your choice in taking the camera out and about regularly. Full-frame cameras are rarely inconspicuous, too, which means they're often less suitable for street photography (unless you have a Leica Q2).",
    "We've mentioned depth of field already – and the flip-side to gaining shallow depth of field with full-frame is that it's easier to get a greater depth of field by using a crop-sensor camera. Increasing the amount of the scene that is in sharp focus can be particularly beneficial to, say, landscape photographers.",
    "Sensor size also affects how much of the scene is captured by the camera. That's the angle of view, which is also known as crop factor. Full-frame has a crop factor of 1x, while a crop-sensor camera has a narrower angle of view, meaning a higher crop factor.",
    "A narrower angle of view can be super helpful to get you close-ups of distant subjects – think wildlife and sports. For example, APS-C has a crop factor of 1.5x (or 1.6x for Canon cameras), Micro Four Thirds is 2x, 1-inch sensors are 2.7x, while a smartphone is around 4.5x. So if you could use the same lens on a full-frame camera and a Micro Four Thirds one, the latter will seemingly get you twice as close.",
    "Video makers should also know that sensor read out speed and power consumption are one step behind in full-frame compared to, say, Micro Four Thirds. A higher sensor readout speed can give better high-speed shooting performance and less rolling shutter distortion, too.",
    "In addition to the likely extra weight and size of full-frame lenses, it's helpful to know that crop factor is also applied to lens focal length. If a lens focal length is described as 50mm, that's 50mm on a full-frame camera, and 100mm on a Micro Four Thirds camera, given the 2x crop factor.",
    "Lenses are primarily designed for a particular sensor size, though it is possible to mix and match. For example, Sony mirrorless cameras are available in full-frame and APS-C formats and the lens mount is the same size, therefore an APS-C lens can be put on a full-frame camera and vice versa.",
    "However, given an APS-C lens is designed for a smaller sensor and image area, you'll see dark corners (vignetting) in the image of a wide-angle APS-C lens when used on a full-frame camera with its larger image area. If it's a wide-angle zoom lens, you would need to zoom in from the widest setting by at least 1.5x to remove vignetting, so you're not getting the wide-angle benefit.",
    "Still, if you plan to go for a crop-sensor camera before full-frame, it could pay off to buy full-frame lenses instead of dedicated crop-sensor ones, in order to future proof your purchases. If you do, remember the crop factor is applied to lenses when used on a crop-sensor camera. That 50mm f/1.8 full-frame lens becomes a 75mm lens on APS-C.",
    "Whether it be focal length or maximum aperture, you'll get a wider choice with full-frame lenses, though when used on APS-C the ultra-wide angle choices are limited.",
    "Convinced by full-frame? Well, if you are, then you're probably wondering which system is the best one to start out with. The truth is, there are no real bad eggs in full-frame camera systems, though some are more established than others.",
    "The Sony a7 series, now led by the likes of the Sony A7R IV and aging Sony A7 III, came to the full-frame mirrorless camera party first. This means its lens choice is broader than the rest. With the recent announcement of the Sony 14mm f/1.8 GM, it now offers 44 of its own full-frame lenses (including 14 so-called 'G-Master' lenses, which are pro-quality offerings with premium price tags). With Sony also opening up its E-mount to third-party manufacturers like Sigma, Tamron and Zeiss, it has pretty much every focal length covered at most price points.",
    "This isn't quite the case with Canon and Nikon's full-frame mirrorless camera systems yet, although they've certainly come a long way. The additional factor in their favor is that, if you already own one of their cameras, an upgrade within the same brand often makes the most sense. This is because you can adapt older lenses from Canon EF and Nikon F-mount models to use on newer mirrorless cameras, and are likely also familiar with their control systems and designs.",
    "Canon RF-mount mirrorless cameras, like the Canon EOS R5 and Canon EOS R6, now have 15 different native lens options, many of which are focused on the pricier, professional end. That said, it did recently launch two intriguing telephoto prime lenses (the Canon RF 600mm f/11 STM and 800mm f/11 STM) for those looking to dabble in wildlife photography without spending thousands.",
    "Nikon, meanwhile, has woken from its recent slumber and confirmed that it is still planning to expand its Nikkor Z lens lineup to \"approximately 30 lenses by the end of the fiscal year 2021\". Right now, its lineup is focused more on smaller prime lenses, with some notable gaps at focal lengths longer than 200mm.",
    "And finally, there's the L-mount, used by full-frame cameras from Panasonic and Leica, which is also strongly backed by Sigma (the third player in the so-called 'L-Mount Alliance'). These are compatible with cameras like the Panasonic Lumix S5 and Sigma FP L and the backing of three big manufacturers means the system now has the biggest range of native full-frame lens options outside of Sony.",
    "As you can see, there's no single correct answer to the best full-frame mirrorless system – each system has strengths in different areas, and it also depends on whether or not you currently own a camera and lenses that could be adapted to a new model.",
    "Sony's considerable head-start on its rivals means its lens system is the most established and versatile, but at the same time its most hobbyist-friendly body – the Sony A7 III – is now well over three years old. For our more detailed thoughts on the cameras themselves, check out our guide to the best full-frame mirrorless cameras."
  ],
  "headers": {},
  "links": {
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "full-frame mirrorless camera": "https://www.techradar.com/news/best-full-frame-mirrorless-camera",
    "Sony 14mm f/1.8 GM": "https://www.techradar.com/news/sony-launches-widest-ever-prime-lens-for-its-full-frame-cameras",
    "Panasonic Lumix S5": "https://www.techradar.com/reviews/panasonic-lumix-s5",
    "Sigma FP L": "https://www.techradar.com/news/sigma-fp-l-is-a-61mp-version-of-the-worlds-smallest-full-frame-camera",
    "best full-frame mirrorless cameras": "https://www.techradar.com/news/best-full-frame-mirrorless-camera"
  }
}