{
  "source": "https://www.techradar.com/news/microsoft-wants-to-listen-to-your-voice-recordings-but-will-ask-for-permission-first",
  "title": "Microsoft wants to listen to your voice recordings - but will ask for permission first",
  "category": "computing",
  "updated": "2021-01-19T16:01:41Z",
  "author": "barclay-ballard",
  "summary": "Privacy advocates now have the option to opt-out",
  "article": [
    "Microsoft has confirmed some important changes to how it processes voice recordings. From now on, users of the company’s voice-enabled services like Cortana can decide whether their audio recordings are stored and analyzed by the company to improve speech recognition or not.",
    "“If customers choose to opt-in, people may review these voice clips to improve the performance of Microsoft’s artificial intelligence systems across a diversity of people, speaking styles, accents, dialects, and acoustic environments,” John Roach, Microsoft’s Executive Architect of Digital Transformation Services, explained. “The goal is to make Microsoft’s speech recognition technologies more inclusive by making them easier and more natural to interact with… Customers who do not choose to contribute their voice clips for review by people will still be able to use all of Microsoft’s voice-enabled products and services.”",
    "While individuals that opt-in to Microsoft's new policy may have their actual recordings listened to, even those that opt-out won’t have their privacy completely protected. Microsoft will still be able to access the transcriptions that are automatically generated by AI algorithms during audio engagements, for example.",
    "Microsoft’s decision to give users a choice as to whether their audio recordings are listened to or not is a reflection of the changing nature of the privacy debate. Many other major tech firms, including Google and Apple have also made efforts to improve user privacy of late.",
    "The coronavirus pandemic has shifted the privacy policies at many firms, with workplaces often trying to harvest more information about their employees’ activities and platforms keen to capture more data in order to improve their services.",
    "Although Microsoft’s change to its voice recording policy is likely to be welcomed by privacy advocates, the company’s Teams platform will surely continue to be scrutinized, after reports suggested that the digital solution was tracking more user information than strictly necessary.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "We can hear you"
  },
  "links": {
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4518285929836753400&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fai%2Fmicrosoft-gives-users-control-over-their-voice-clips%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-wants-to-listen-to-your-voice-recordings-but-will-ask-for-permission-first",
    "Apple": "https://www.techradar.com/news/apple-wants-to-eliminate-dodgy-apps-with-nutritional-info-esque-privacy-labels",
    "employees’ activities": "https://www.techradar.com/news/one-in-five-firms-admit-to-illegally-spying-on-employees-working-from-home",
    "ZDNet": "https://www.zdnet.com/article/still-talking-to-cortana-microsoft-gives-you-more-control-over-how-your-voice-recordings-are-used/"
  }
}