{
  "source": "https://www.techradar.com/news/google-pixel-5a-is-here-with-a-big-battery-and-water-resistance",
  "title": "Google Pixel 5a is here with a big battery and water resistance",
  "category": "phones",
  "updated": "2021-08-17T16:00:13Z",
  "author": "james-rogerson",
  "summary": "Not much else is new",
  "article": [
    "The Google Pixel 5a has finally been unveiled – months after Google confirmed that it existed, and its headline features include the biggest battery yet in a Pixel phone, and water resistance for the first time in an A-series model.",
    "That battery is 4,680mAh, which compared to other non-Pixel phones is an above average but not massive size. The affordable Moto E7i Power for example has a 5,000mAh one, but the Google Pixel 5 has just a 4,080mAh one, and the Pixel 4a 5G only has 3,885mAh of life. So this is certainly an upgrade compared to its predecessors.",
    "As for that water resistance, the Google Pixel 5a has an IP67 rating, granting it both water and dust resistance, which should allow it to be submerged in up to a meter of water for 30 minutes without lasting damage. It's a nice feature to have and something you don’t often get in the mid-range.",
    "Elsewhere though this is a very similar phone to the Pixel 4a 5G, with the same Snapdragon 765G chipset, and the same RAM and storage amounts, at 6GB and 128GB respectively. The cameras are only negligibly improved too – it once again has a 12MP main camera, a 16MP ultra-wide one, and an 8MP selfie snapper, though the field of view on the ultra-wide is a bit wider this time, at 117 degrees.",
    "The screen has grown a little to 6.34 inches, which makes it the biggest Pixel with a bezel-free design – at least until the Google Pixel 6 Pro lands. It’s a 1080 x 2400 OLED display with a standard 60Hz refresh rate, and other than the slightly larger screen size, the design is much the same as on the Pixel 4a 5G too, complete with a plastic back.",
    "Rounding out the specs you get 5G and Android 11 (though this being a Google phone it should be first in line for Android 12 when that launches), plus there’s 18W charging.",
    "If you want the Google Pixel 5a hopefully you live in the US or Japan, because it’s not launching anywhere else. In those countries it’s available to pre-order now in a single color dubbed Mostly Black, at a price of $449 (around £325 / AU$610). Its release date in those regions is August 26.",
    "The Google Pixel 5a is a phone that’s hard to get excited about from the specs list. The battery boost and water resistance are nice, but otherwise this is seriously similar to a year-old handset. Given its limited availability, it almost seems like Google isn’t very excited by this phone either.",
    "But that’s okay – it’s still likely to be a dependable mid-ranger with Google's great camera software, and for anyone with more money to throw at Google, some far more exciting stuff is coming soon.",
    "The Google Pixel 6 and Pixel 6 Pro are expected within the next couple of months, and they sport wild new designs, custom chipsets, and strong all-round specs from what we know so far. Then there’s the Pixel Fold, which is more mysterious but could also land before the year is done, and might give the Samsung Galaxy Z Fold 3 some competition."
  ],
  "headers": {
    "7": "Opinion: the Pixel 5a looks set to be the least exciting Google phone this year"
  },
  "links": {
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Moto E7i Power": "https://www.techradar.com/reviews/moto-e7i-power-review",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Google Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review"
  }
}