{
  "source": "https://www.techradar.com/news/amazon-snaps-up-facebooks-mobile-internet-arm",
  "title": "Amazon snaps up Facebook's satellite internet team",
  "category": "computing",
  "updated": "2021-07-16T00:57:01Z",
  "author": "anthony-spadafora",
  "summary": "Several wireless experts from Facebook will now be working on Amazon's Project Kuiper",
  "article": [
    "Several employees from Facebook have joined Amazon where they'll work with the company to improve its efforts to deliver broadband internet to Earth from Space.",
    "As first reported by The Information, Amazon has acquired more than a dozen wireless internet experts from the Facebook Connectivity team that were designing and testing new ways to advance satellite connectivity using optical communications and radio frequency systems.",
    "Now these experts will instead be working on the ecommerce giant's Project Kuiper satellite network that shares many similarities with SpaceX's Starlink.",
    "Just last year Amazon received approval from the US Federal Communications Commission (FCC) to launch more than 3,000 internet satellites into Earth's orbit.",
    "Once complete in 2029, the Kuiper Satellite Constellation will feature a total of 3,236 satellites though it will cost approximately $10bn to launch the satellites and develop the technology to bring Project Kuiper to life.",
    "Amazon is currently in the process of launching half of the satellites the project will need by 2026 while the remaining satellites will be launched into orbit during Kuiper's final three years. In order for these satellites to be able to send data back and forth between Earth and space, the company will also build 12 ground stations around the world.",
    "In addition to acquiring experts from Facebook, Amazon has ramped up its hiring efforts for Project Kuiper and there are currently 200 open positions that still need to be filled. There are already 500 employees working on the project but with the help of the talented former Facebook Connectivity team members, Amazon could potentially be able to move up its timeline for Kuiper's official launch.",
    "Via Engadget"
  ],
  "headers": {
    "3": "Project Kuiper"
  },
  "links": {
    "broadband internet": "https://www.techradar.com/broadband/broadband-deals",
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7408897031606471000&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Famazon-acquires-facebooks-satellite-internet-group&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Famazon-snaps-up-facebooks-mobile-internet-arm",
    "Starlink": "https://www.techradar.com/news/everything-you-need-to-know-about-spacexs-starlink-plans-for-space-internet",
    "received approval": "https://www.techradar.com/news/amazon-to-launch-3000-internet-satellites-into-orbit",
    "ground stations": "https://www.techradar.com/news/microsoft-is-taking-its-azure-cloud-into-space",
    "Engadget": "https://www.engadget.com/amazon-has-acquired-facebooks-satellite-internet-group-115312282.html?"
  }
}