{
  "source": "https://www.techradar.com/news/amd-loses-gpu-market-share-to-nvidia-so-why-cant-this-underdog-fight-back",
  "title": "AMD loses GPU market share to Nvidia, so why can’t this underdog fight back?",
  "category": "computing",
  "updated": "2021-03-08T11:05:58Z",
  "author": "hamish-hector",
  "summary": "Supply can’t meet demand",
  "article": [
    "Nvidia’s domination over AMD in the PC graphics card market is continuing, with AMD’s market share dropping by a third in the dedicated GPU space. This loss comes despite AMD releasing some of the best graphics cards on the market right now.",
    "The reason AMD wasn’t able to steam ahead despite its critically-acclaimed launches is lis likely down to its flagship Radeon 6900 XT and 6800 XT graphics cards being largely unavailable, though we can’t just blame cryptominers for this one. The Covid-19 pandemic caused a surge in the PC market - increasing it by 35% in 2020 over 2019 according to JPR - with stay-at-home orders put in place across the globe. But those same orders restricted the rate at which important chips could be made.",
    "So, why has AMD been hit so hard? It could be that the chip manufacturer it uses, TSMC, is under pressure to deliver to numerous customers, including Sony and Microsoft for their PS5 and Xbox Series X|S consoles (which ironically use AMD chips), as well as Apple, which might have resulted in AMD being pushed further back in the queue.",
    "The data might be uncomfortable reading for AMD, but that doesn’t mean the GPU war is over. While the lack of Radeon 6900 XT GPUs will upset PC gamers, AMD has less to complain about. There’s obvious demand for its hardware and its chips are selling as quickly as it can make them, and that’s not an awful position to be in. It could be better - especially when it comes to supply - but it could be much worse as well.",
    "On top of that AMD, has its CPUs to help boost revenue, and according to PassMark Software, the percentage of users benchmarking AMD chips has been on the rise - with its chips used in just 40% of all PCs up from around 22% at the end of 2018. For desktops specifically, AMD has finally overtaken Intel with 51% of benchmarked machines carrying an AMD processor, as of the latest numbers.",
    "While it's worth taking those last numbers with a pinch of salt - as they aren’t tracking actual sales numbers but instead an estimate of usage figures - they suggest that AMD might not quite be the underdog some think them to be. We’ll have to see if AMD can keep up its momentum this year, and how it fares in 2022 when chip shortages are set to end.",
    "Via JPR"
  ],
  "headers": {
    "3": "Is AMD down and out?"
  },
  "links": {
    "Radeon 6900 XT": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "cryptominers": "https://www.techradar.com/news/how-cryptomining-is-making-it-harder-to-find-the-graphics-cards-you-want",
    "JPR": "https://www.jonpeddie.com/press-releases/gpu-shipments-soar-once-more-in-q4",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X|S": "https://www.techradar.com/reviews/xbox-series-x",
    "data": "https://www.jonpeddie.com/press-releases/gpu-shipments-soar-once-more-in-q4",
    "PassMark Software": "https://www.cpubenchmark.net/market_share.html"
  }
}