{
  "source": "https://www.techradar.com/news/instagram-and-facebook-users-can-now-finally-hide-like-counts-heres-how",
  "title": "Instagram and Facebook users can now finally hide like counts - here's how",
  "category": "computing",
  "updated": "2021-05-27T10:59:39Z",
  "author": "daryl-baxter",
  "summary": "Like it or not",
  "article": [
    "Facebook and Instagram users can now hide the amount of likes in a post through a new settings option, which is slowly rolling out to everyone.",
    "This comes after a few years of heavy testing from both apps, where many mental health advocates have been pushing the company to hide the amount of likes a post gains, as it can heavily affect a person’s mental health, especially since the Covid-19 pandemic.",
    "With the feature now slowly becoming available for everyone on both platforms, there’s a straightforward method in having the likes show or not show at all.",
    "According to a report from the RSPH back in 2017, Instagram came out on top as the most detrimental to someone’s mental health, and called for a series of recommendations, such as pop-ups to warn users that there’s been heavy usage on an app.",
    "Since then, we’ve seen features such as ScreenTime on iOS, and usage alerts on both Facebook and Instagram, but mental health is still a large concern with social media. Many allegedly try to find self-worth from how many likes, shares and comments one gets from a post, and Facebook are keenly aware of this.",
    "In Instagram, go to Settings > Posts > Hide Counts to have posts never show the amount of interactions from a post you have either posted or yet to post.",
    "In Facebook, you can soon choose to hide the amount when you’re about to share a post, while being able to set this across all of your posts is being enabled in the coming weeks.",
    "If there’s anything to learn from social media, it’s that it can be a double-edged sword mentally. Especially over the last year, we’ve been reaching for our favored social media corner to contact close friends and family just to strike up a conversation, no matter how irrelevant or small the topic is.",
    "With many people self-isolating however, it’s become one of the few avenues to communicate, and likes have almost become a currency in happiness.",
    "For instance, you may post a photo that relates to something you consider incredibly important, but others may see it as inconsequential, something irrelevant, and so the few likes that the post gets can impact someone’s confidence and self worth.",
    "It can amalgamate into something where it affects the mental health heavily, and soon after there’s even more posts shared, just to meet an unrealistic ‘like’ target.",
    "However, with options like these that Facebook is finally rolling out, and more restrictions being lifted, social media has an even greater chance of being a healthy outlet, rather than a toxic one for mental health."
  ],
  "headers": {
    "3": "How to hide your like counts",
    "7": "Analysis: It’s about time"
  },
  "links": {
    "report from the RSPH": "https://www.rsph.org.uk/our-work/campaigns/status-of-mind.html"
  }
}