{
  "source": "https://www.techradar.com/news/iphone-13-and-iphone-13-mini-might-miss-out-on-a-key-upgrade",
  "title": "iPhone 13 and iPhone 13 mini might miss out on a key upgrade",
  "category": "phones",
  "updated": "2021-07-12T08:55:01Z",
  "author": "james-rogerson",
  "summary": "Losing out on LiDAR",
  "article": [
    "We have a good idea about what to expect from the iPhone 13 range now, thanks to a seemingly endless stream of leaks and rumors. But there’s one thing that leakers can’t agree on, and that’s whether or not the whole range will get a LiDAR (Light Detection and Ranging) scanner. However, it looks increasingly unlikely that the two cheapest models will.",
    "According to @dylandkt (a developer and leaker), LiDAR will only come to the iPhone 13 Pro and iPhone 13 Pro Max. Apparently Apple originally wanted to include it on all four upcoming models (which might be why a lot of leaks say it is coming to all four), but for undisclosed reasons that’s supposedly not now happening.",
    "That would mean no change on this front from the iPhone 12 range, where the Pro models already have a LiDAR scanner – a sensor that uses laser beams to measure distance, aiding photography and augmented reality.",
    "As ever with leaks we’d take this with a pinch of salt, especially as @dylandkt isn’t as prominent a leaker as some, but 9to5Mac – which spotted the tweet – claims that they’ve been right about unreleased Apple products in the past.",
    "The most recent leak about LiDAR that we’d seen prior to this also pointed to only the top two iPhone 13 models getting it. So despite a number of earlier leaks saying that all four would, we’d think this latest information is more likely.",
    "We should know for sure before too long, as the iPhone 13 range is expected to land in September, but we expect this mystery will largely be solved by leakers ahead of that. Stay tuned to TechRadar for all the leaks over the coming weeks, and for all the official details once the iPhone 13 range is announced."
  ],
  "headers": {},
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "@dylandkt": "https://twitter.com/dylandkt/status/1414338686314074116",
    "say it is coming to all four": "https://www.techradar.com/news/iphone-13-range-could-be-thicker-but-with-all-sorts-of-upgrades",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "9to5Mac": "https://9to5mac.com/2021/07/11/leaker-corroborates-that-lidar-scanner-will-remain-exclusive-to-the-iphone-13-pro-lineup/",
    "leak about LiDAR": "https://www.techradar.com/news/iphone-13-price-might-not-be-any-higher-than-the-iphone-12s"
  }
}