{
  "source": "https://www.techradar.com/news/foundation-episode-7-recap-shocks-and-raised-stakes-for-those-lost-in-space",
  "title": "Foundation episode 7 recap: shocks and raised stakes for those lost in space",
  "category": "entertainment",
  "updated": "2021-10-29T11:00:00Z",
  "author": "tom-power",
  "summary": "Big spoilers follow",
  "article": [
    "Huge spoilers follow for Foundation episodes 1 to 7. Proceed at your own risk.",
    "Foundation fans don’t need reminding how important Gaal Dornick is to its story. As a prominent character in Isaac Asmiov’s original works, Hari Seldon’s former prodigy was always destined for big things in Apple TV Plus’ adaptation.",
    "Thanks to Mysteries and Martyrs, the seventh entry in Foundation season 1, now we know just how vital she is to The Foundation’s survival. Not only that, but episode 7 also delivers more compelling drama and action in its other branching narratives: suffice to say, then, Apple’s adaptation of Asimov’s novels is certainly hitting its stride.",
    "What’s so important about Gaal that makes her integral to The Foundation’s success, then? Initially, it appeared that this particular secret wouldn’t be revealed until its eighth episode as we didn't expect to be reunited with Gaal in Mysteries and Martyrs – but we’re glad that we were.",
    "Before his death, Hari uploaded a digital version of his consciousness to the Raven, the spaceship that located Gaal’s stasis pod back in episode 4. Hari’s digital avatar, though, is glitching out and, despite Gaal’s best efforts, it disappears. But not before it inadvertently turns off the ship’s life support systems, which is obviously bad news for Gaal’s survival.",
    "Luckily, Hari’s avatar stabilizes itself and brings the ship’s systems back online. It’s here that we learn more about Hari’s plan for The Foundation, as well as a major revelation concerning Gaal.",
    "As it happens, Hari was already dying due to an illness that he inherited from his father’s side of the family. In being murdered, Hari hoped that he’d become a mythical symbol for The Foundation and galvanize its members into realizing his vision. Of course, Gaal interrupting Raych’s murder of Hari ruined that: Raych is now dead and Gaal, who was supposed to be leading The Foundation on Terminus by this point, took his place on the Raven.",
    "What ensues is a bitter back-and-forth between the two. An angry Gaal lambasts Hari for not caring what she or Raych wanted, while Hari’s terse riposte suggests that everything she did was a choice, so he's not to blame. It’s a riveting exchange – Hari and Gaal’s interactions were the highlight of Foundation’s early stuttering episodes, so it’s pleasing to see Jared Harris and Lou Llobell converse again, even if it’s in trying circumstances.",
    "Despite their emotionally charged exchange, it’s clear that there’s a mutual respect between the pair. It’s inevitable, then, that they forgive each other for their previous actions even if they don’t say it outright. The overarching mood onboard the Raven is depicted in a fun way during this sequence, too. Red lighting is used to depict the frustration that both feel during their tense chat, eventually making way for a blue hue that represents a calming of the atmosphere once they’ve aired their grievances.",
    "It’s during the latter part of their discussion that Foundation episode 7 makes its big play: Gaal can predict the future. Well, sort of. It’s the reason why she ‘felt’ that the Starbridge’s imminent attack in episode 1 and that something was wrong before she found Raych murdering Hari in episode 2.",
    "It’s a revelation that feels like it’ll be an easy way of explaining how The Foundation will combat any major problems that befall it down the line – that is, if Gaal ever makes it to Terminus. Still, it’s a fun cliff hanger to end Mysteries and Martyrs on, and inevitably leaves viewers wanting Foundation’s next instalment to be released immediately.",
    "Away from events on the Raven, episode 7’s Terminus storyline is arguably the most intriguing of its other narrative strands.",
    "Having located the Invictus – a planet killing imperial warship – the ragtag band of Anacreons and Foundation members board it in order to restart its engines.",
    "But not everyone makes it onto (or into) the vessel. Empire Commander Dorwin is killed by Phara when he’s no longer useful to the mission, while Hugo misses the Invictus’ landing pad and ends up drifting off into space. Given how close he is to Salvor Hardin, we’d expected his possible death to hit as hard as Abbas’ did in episode 6, so it’s a shame that it doesn’t. Although, we don’t actually see Hugo die, so there’s a possibility his demise is another cop out like it was in episode 4.",
    "So what’s the plan for the Invictus? The Anacreons want to use it to destroy Trantor in retaliation for their planet’s destruction in episode 2. The problem is that the Invictus will start to jump to random points in space once its systems are fully operational. This, Phara explains, means that the crew only have a few hours to shut its randomized space jump sequence down. Failure to do so will strand them in an unknown location and, with no supplies, lead to their deaths.",
    "But Salvor isn’t having this. She convinces The Foundation’s members to spring a surprise attack on their captors which, unsurprisingly, doesn’t go very well. It’s a good thing that this particular fight sequence doesn’t drag on for long, however. Foundation’s close-quarters combat has left a lot to be desired so far, and it’s not much better here. Foundation has solved many of its teething issues, but its physical combat continues to be an issue. Here’s hoping it’s fixed in future entries.",
    "Tensions are similarly high on Maiden. Following episode 6’s events, Day isn’t happy that Demerzel chose to bow after Zephyr Halima’s rousing speech. Calling his advisor disloyal to the Empire, Day decides to go on the offensive on his own terms, rather than risk the prospect of Demerzel seemingly betraying him again.",
    "Naturally, Day’s plan backfires. Meeting with Halima once more, he tries to flatter her with a new offer: not only will he build a new desalination station on Maiden to provide clean, drinking water to its population, but his army will also protect Maiden from any Outer Reach attacks.",
    "To his surprise, Halima declines. The only thing she wants is an end to the Cleonic dynasty and its cloning program – something that Day is unwilling to compromise on. Another fraught conversation plays out between them but, again, Halima more than holds her own. It’s intriguing to see someone go up against Day and win a verbal sparring contest. Despite their reign of tyranny and infinite resources, it seems that the Imperium’s leaders don’t have all the answers.",
    "Undaunted, Day raises the stakes. The next day, he informs Halima and Maiden’s population that he plans to walk the Great Spiral: a pilgrimage to the womb of the Mothers, which will prove that Cleon’s clones do have a soul. It’s a Hail Mary move on Day’s part as it could prove that Halima' episode 6 proclamation was right all along. Regardless, it’ll be fascinating to see the outcome of this in one of Foundation’s final three episodes.",
    "If there’s one somewhat weak storyline in Mysteries and Martyrs, it’s events that transpire on Trantor. Here, we see Dawn and Azura’s secret liaison continue apace, but it’s pretty standard fare as romances go and doesn’t add much to proceedings.",
    "We do get to see more of the Empire’s cloning facility, with Dawn revealing that Cleon’s clones can be destroyed and replaced by replicas if they’re found to be defective. It’s why Dawn is so reluctant to tell Day and Dusk about his color blindness and other differences, which he reveals in episodes 6 and 7.",
    "It does, though, offer an interesting insight into Dawn’s dilemma: he’s torn between his loyalty to his royal duties and his burgeoning romance with Azura. With Dusk indicating that he knows something is wrong with Dawn during an awkward conversation later on, too, there’s a strong possibility that this version of Dawn may not live to see out Foundation’s first season. It's that, or he may take Azura up on her offer and flee Trantor for good.",
    "Mysteries and Martyrs is an episode laden with exposition, but it’s a necessary and much welcome entry in the series.",
    "With Foundation barrelling towards its final few episodes, it’s likely that there won’t be much more room for in-depth plot explanations. Episode 7, then, leans heavily into this side of Foundation’s narrative, which hopefully means that it’s setting up more action-oriented instalments to come.",
    "That isn’t to say Mysteries and Martyrs isn’t without its issues. Hari and Gaal’s reunion aside, episode 7’s key emotional moments struggle to stick the landing. It’s a shame as the show has ironed out this problem in recent weeks, so this feels like a step back for Foundation.",
    "Still, episode 7 is a good entry rather than an average or bad one. With Foundation’s various plot strands likely to collide soon, providing each one with their fair share of screen time is the right move to make at this juncture. Mysteries and Martyrs lives up to its title: let’s hope that season 1’s final entries do likewise.",
    "New episodes of Foundation debut exclusively on Apple TV Plus every Friday."
  ],
  "headers": {
    "23": "Our verdict",
    "27": "Foundational facts"
  },
  "links": {}
}