{
  "source": "https://www.techradar.com/news/the-sony-whch710n-noise-cancelling-headphones-are-half-price-at-just-dollar98",
  "title": "The Sony WHCH710N noise cancelling headphones are half price at just $98",
  "category": "audio-visual",
  "updated": "2021-03-09T15:29:48Z",
  "author": "mackenzie-frazier",
  "summary": "Score a massive $101 price cut on Sony's wireless headphones",
  "article": [
    "If you're looking to score a price cut on a quality pair of noise cancelling headphones, then you're in luck. Right now, you can get the Sony WHCH710N headphones on sale for $98 (was $199.99). That's a massive 51% discount and the best price we've found for the wireless earphones.",
    "The Sony WH-CH700N headphones feature artificial intelligence noise cancelation, which blocks unwanted noise by analyzing background sound. Whether you're traveling, walking, or in a busy office, the Sony headphones will adapt to the sounds around you with the push of a button.",
    "The Bluetooth headphones also feature a built-in microphone for hands-free calls and use with your voice assistant. The most impressive feature of the Sony WH-CH700N is the long-lasting battery which delivers up to 35 hours of wireless playback on a single charge, and a quick 10-minute charge provides an impressive 60 minutes of playback time. As we mentioned above, this is the best deal we've found for the Sony WH-CH700N and only $10 more than the Black Friday record-low price. We don't know how long Amazon will have the noise cancelling headphones at this price, so you should take advantage now before it's too late.",
    "See our roundup of the best noise-cancelling headphones and shop for more of the cheapest noise canceling headphone deals that are currently available."
  ],
  "headers": {
    "1": "Sony noise cancelling headphones deal",
    "3": "More Sony headphone deals"
  },
  "links": {
    "on sale for $98": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB085RNVJ3P%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4076975123379234300-20",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "cheapest noise canceling headphone deals": "https://www.techradar.com/deals/cheap-noise-canceling-headphone-deals"
  }
}