{
  "source": "https://www.techradar.com/news/ive-avoided-buying-a-printer-for-years-but-even-ill-be-tempted-on-black-friday",
  "title": "I’ve avoided buying a printer for years, but even I’ll be tempted on Black Friday",
  "category": "computing",
  "updated": "2021-11-14T12:27:04Z",
  "author": "joel-khalili",
  "summary": "But the deals will need to be right",
  "article": [
    "Until recently, the digitization of documents and rise of online collaboration tools, productivity apps and e-sign software had made it easier than ever to go without a home printer.",
    "For many people, this was a blessing, because printers (and their ink) can be seriously expensive, not to mention unsightly and difficult to squeeze onto the average home office desk. Plus, there are the environmental benefits of exclusively using digital formats too.",
    "Personally, I’ve avoided buying a printer for years for precisely these reasons. And there are bound to be many others in a similar situation.",
    "However, the pandemic and rise of remote working has changed the equation somewhat, making home printers an all-but-essential piece of equipment once again. Suddenly, when the need inevitably arises (say, to print a copy of your kid’s math homework or proof of vaccination ahead of a flight), it’s no longer possible to lean on the office printer to get you out of a fix.",
    "So even I, a print naysayer, will be on the lookout for printer deals on Black Friday and Cyber Monday, which this year fall on November 26 and November 29, respectively.",
    "Although I’ve now reconciled myself with the idea of purchasing a printer on Black Friday, the price will still need to be right for me to justify pulling the trigger.",
    "While there are usually plenty of hefty discounts on printers from leading brands (like Epson, HP, Canon, Brother and others), it’s not always easy to separate the best Black Friday printer deals from the average ones.",
    "To make this easier, we’ll be combing through deals from all the brands and online retailers to sort the wheat from the chaff, highlighting any deals we consider genuinely worthwhile. But for anyone that would rather go it alone, it’ll be about surfing major marketplaces and cross-referencing any potential purchases with review scores, as well as weighing up the size of the discounts.",
    "For context, the price tags of some older (but still trusty) printers were slashed almost in half last year, and there were many similarly significant discounts besides. Here are a few examples of last year’s best deals, for reference:",
    "It’s also worth keeping an eye out for early Black Friday printer deals this time around. As a result of ongoing supply chain issues, many people are looking to get their shopping done early to ensure their purchases arrive in good time. And retailers and printer vendors are alert to this fact, which could lead to early discounts as the largest players compete for custom.",
    "Once you’ve established a strategy for unearthing the best Black Friday printer deals, you’ll need to determine which kind of device best fits your needs, whether an inkjet printer, laser printer or perhaps an all-in-one.",
    "Inkjet printers are solid all-rounders, ideal for printing documents and photos from home. Generally, they produce good-quality prints and tend to be smaller, which means they’re great for people with a modest home office (like this writer).",
    "However, the best laser printers have the upper hand when it comes to both speed and price. If you need to churn through a large quantity of prints, then, a laser printer could be the way to go. That said, they are typically larger and louder than their inkjet counterparts.",
    "Finally, there are all-in-one printers, which offer additional functionality like copying, scanning and faxing. As such, all-in-ones are usually a little more expensive and quite considerably larger than basic inkjet or laser printers.",
    "Of course, there are also more obscure options, such as A3 printers, large format printers or even 3D printers, but these are for niche audiences.",
    "Ahead of the big day itself, it’s worth weighing up the pros and cons of each type of printer, setting a budget (factoring in the ongoing cost of ink), and identifying the specific models you might like to get your hands on. That’s my plan, at least."
  ],
  "headers": {
    "5": "The price still needs to be right",
    "10": "But what kind of printer should I buy?"
  },
  "links": {
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "productivity apps": "https://www.techradar.com/best/best-productivity-apps",
    "e-sign software": "https://www.techradar.com/best/best-esign-software-solutions",
    "home printer": "https://www.techradar.com/news/best-home-printer",
    "office desk": "https://www.techradar.com/best/best-office-desks",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "office printer": "https://www.techradar.com/best/best-small-business-printers",
    "Black Friday": "https://www.techradar.com/news/best-black-friday-printer-deals",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best Black Friday printer deals": "https://www.techradar.com/news/best-black-friday-printer-deals",
    "inkjet printer": "https://www.techradar.com/news/best-inkjet-printers",
    "laser printer": "https://www.techradar.com/news/best-laser-printer",
    "all-in-one": "https://www.techradar.com/news/best-all-in-one-printer",
    "A3 printers": "https://www.techradar.com/news/best-a3-printers",
    "large format printers": "https://www.techradar.com/best/best-large-format-printers",
    "3D printers": "https://www.techradar.com/best/best-3d-printers"
  }
}