{
  "source": "https://www.techradar.com/news/rings-home-security-drone-is-one-step-closer-to-going-on-sale",
  "title": "Ring’s home security drone is one step closer to going on sale",
  "category": "smart-home",
  "updated": "2021-09-28T16:57:23Z",
  "author": "carrie-ann-skinner",
  "summary": "The Ring Always Home Cam invite list is open",
  "article": [
    "How would you like an autonomous indoor drone that flies around your home and gives you a live, mobile feed of your house if it spots an intruder or emergency? What if it came from Amazon - a company notorious for privacy challenges?",
    "At Amazon's latest gadget smorgasbord event on Tuesday in Seattle, the company finally opened up an invite list to get your hands on its home security drone, the Ring Always Home Cam. The device, which is the first of its kind from Amazon-woned company Ring, was first revealed to the public at last year’s Amazon event.",
    "If you’re interested in getting your hands on the home security camera, which is the first of its kind and is priced at $249.99, you can request an invite at Amazon.com. However, if you live outside the US, it’s not possible to get yourself on the waitlist. We spoke to Amazon and it couldn't confirm if the Always Home Cam would eventually be made available in other territories, such as the UK and Australia. However, it didn't rule it out completely. \"Internationalisation of all of our products and services is incredibly important. We are working hard to make all of the features and devices we’ve announced available everywhere our customers want them,\" it told TechRadar.",
    "Unlike our current pick of the best drones, the Ring Always Home Cam can’t be flown manually, instead you create preset routes for the drone to move around the rooms in your home, so you can choose which areas of your property are protected with surveillance. However, this can come in handy if you’re forgetful and want peace of mind by checking whether you left a window open or the coffee maker plugged in.",
    "The Always Home Cam, which measures 7.48in x 7.48in x 5.43in, records color footage during the day at a resolution of 1440 x 1440, which means the video isn’t captured in Full HD. It also has a built-in LED, which Ring says is designed to illuminate the surroundings when recording at night or in low light. Many of the best home security cameras have built-in LEDS, and that ensures the video recorded at night in is color so we'd expect this to be the case with the Always Home Cam.",
    "Ring says the Always Home Cam, which has a field of view of 120 degrees, can accommodate up to 50 different flight paths, each of which can be up to five minutes long - as this is the runtime of the rechargeable battery that power the security drone. However, the Always Home Cam can’t fly between different stories in a home. If you want to use the security drone of different floors, you’ll need a separate Always Home Cam for each floor.",
    "As we’ve already mentioned, it is powered by a rechargeable battery, which Rings says will last for five minutes, before the security drone returns to its base station to recharge. Ring also confirmed the drone will never record footage when it’s docked in its base station."
  ],
  "headers": {
    "4": "Smarter than your average security camera"
  },
  "links": {
    "gadget smorgasbord event": "https://www.techradar.com/news/live/amazon-event-2021-live-blog",
    "Ring Always Home Cam": "https://www.techradar.com/news/amazon-rings-new-dronecamera-hybrid-will-fly-around-and-record-your-home",
    "Amazon.com": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08YH144XD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1213247930912979000-20",
    "best drones": "https://www.techradar.com/news/best-drones"
  }
}