{
  "source": "https://www.techradar.com/news/samsung-makes-great-phones-so-why-do-its-laptops-fail-to-excite",
  "title": "Samsung makes great phones – so why do its laptops fail to excite?",
  "category": "computing",
  "updated": "2021-05-03T11:30:43Z",
  "author": "matt-hanson",
  "summary": "Struggling to make headway",
  "article": [
    "When it comes to smartphones, Samsung is the biggest company in the world by some margin – even the mighty Apple struggles to rival it. But, when it comes to laptops, Samsung just can’t compete.",
    "The PC market (which includes laptops) is dominated by Lenovo and HP at the very top, followed by Dell, then Apple. You’ve also got Asus and Acer, but Samsung is nowhere near the top.",
    "It’s been that way for years, with only Lenovo and HP occasionally swapping places, while Apple has slowly crept up.",
    "So, why is Samsung not a player, when it’s one of the biggest companies in the world? Why does a company that is such a power in smartphones and TVs, for example, struggle against seemingly smaller companies like Lenovo.",
    "You’d think it would find it easy. After all, the Galaxy Book Pro and Galaxy Book Pro 360 that the company recently showed off have a lot going for them. They look fantastic, with the kind of build quality and design that Samsung has built a formidable reputation with when it comes to its smartphones, are incredibly light, and pack cutting-edge Intel 11th generation processors.",
    "Their prices are pretty competitive as well. On paper, these laptops look like they could be some of the best laptops released in 2021.",
    "I’ve been covering computing releases for years now, and I just don’t see the same kind of buzz around a Samsung laptop launch as I do around a new laptop from Apple – or even Microsoft, which has slowly been building up hype with its Surface products.",
    "One of the main issues, I think, is that while Samsung is a familiar name in phones, for example, when it comes to laptops, it’s a relative newcomer.",
    "In fact, Samsung’s a bigger force when it comes to monitors and hard drives than laptops. In the early 2000’s Samsung released a string of laptops, but these were rather boring, no-nonsense notebooks aimed at business users. Think of a less inspiring Inspiron, if such a thing is possible.",
    "With the new Galaxy range of laptops, Samsung is clearly trying to make it into the premium laptop market, aligning these laptops with its Galaxy smartphones and tablets – its flagship products.",
    "It’s also taking a leaf out of Apple’s book, and trying to cultivate an ecosystem where a Samsung Galaxy phone works best with a Galaxy laptop. Samsung’s dream of someone going all-in on their devices is an ambitious one, but is it realistic?",
    "Sony tried that before and failed, but Apple has done a much better job. Too good a job, in a way. You see, when Apple releases a new Apple Watch, the fact that I don’t have an iPhone means I have no interest in it, as it won’t work with my Android device. Worse, it feels like Apple isn’t keen on getting me interested in the Apple Watch if I'm not in the ecosystem already. Same with the HomePod. At least I can use a MacBook without an iPhone, though I’m still missing out on certain features.",
    "I can see the appeal of Apple’s way of doing things – it makes them a lot of money after all, and Samsung wants its laptops to be the obvious choice for anyone who owns a Samsung phone. Considering how many people that is, it’s a smart move in some respects, though Samsung doesn’t have the kind of control over its laptops that Apple has. For a start, its laptops run Windows 10. If in the future Samsung makes an operating system for a laptop… well, that’s a future that’s too scary to contemplate. And I say that as a fan of its phones.",
    "Instead it has to rely on pre-installed apps and software, such as Samsung Notes, instead. Bloatware, basically, and something most people end up never using when they get a new laptop.",
    "Meanwhile, Lenovo and HP (and Dell) have been players in the laptop market for a lot longer, and cover not just high-end laptops, but mid-range as well. From ultra-glamorous devices like the Dell XPS 13 or the HP Spectre x360, to budget day-to-day laptops as well. So, it’s no wonder that Samsung is struggling to cut through.",
    "However, it can be done. Just look at Microsoft. It, too, is a relatively new player in the laptop space (being primarily a software company). Slowly over the years it’s been releasing premium Surface products that have gradually won over fans.",
    "While Microsoft is also nowhere near competing with HP and Lenovo, each Surface launch event seems to get more people hyped, more people excited. Something the Samsung launches have lacked.",
    "But, it proves it can be done. As long as the Galaxy Book Pro and Galaxy Book Pro 360 prove to be as good as they look, and Samsung follows them up with yet more solid, aspirational, beautifully designed, laptops, then it can start becoming a bigger name in laptops. It’ll take time, but it’ll be worth it."
  ],
  "headers": {
    "6": "But where’s the excitement?",
    "11": "Bad apple",
    "15": "It can be done"
  },
  "links": {
    "Galaxy Book Pro": "https://www.techradar.com/reviews/samsung-galaxy-book-pro",
    "recently showed off": "https://www.techradar.com/news/samsung-reveals-powerful-new-laptops-at-its-galaxy-unpacked-april-2021-event",
    "new Apple Watch": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "MacBook": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "HP Spectre x360": "https://www.techradar.com/reviews/hp-spectre-x360-2021"
  }
}