{
  "source": "https://www.techradar.com/news/google-chat-is-getting-an-important-security-upgrade",
  "title": "Google Chat is getting an important security upgrade",
  "category": "computing",
  "updated": "2021-10-15T18:00:50Z",
  "author": "anthony-spadafora",
  "summary": "Data loss prevention is now in beta for Google Chat",
  "article": [
    "Preventing data leaks is of the utmost importance to businesses which is why Google is launching a new beta to add data loss prevention (DLP) to Google Chat.",
    "The search giant announced the beta at its Google Cloud Next '21 virtual event this week in an effort to help prevent sensitive and confidential information from leaking outside of organizations.",
    "By adding DLP to Google Chat, admins will be able to create custom policies to prevent sensitive data leaks when using Google's online collaboration software.",
    "Once enrolled in the new beta, Google Workspace admins can choose to monitor any DLP violations or they can outright block end users from sending sensitive content. They'll also be alerted about policy violations so that they can quickly investigate and take action.",
    "This feature will be turned off by default but it can be enabled at the domain, OU or group level according to a new update from the Google Workspace blog. Admins can create DLP rules from the Admin console by going to Security and finding the Data Protection option.",
    "Organizations interested in further securing their workplace communication that takes place in Google Chat can sign up here to take part in the beta.",
    "This feature will likely roll out to all Google Workspace users once the beta concludes but Google has not yet set a date for when that will happen."
  ],
  "headers": {
    "3": "Data loss prevention in Google Chat"
  },
  "links": {
    "data loss prevention": "https://www.techradar.com/best/best-data-loss-prevention-service",
    "Google Chat": "https://www.techradar.com/reviews/google-chat",
    "virtual event": "https://www.techradar.com/best/best-virtual-event-platforms",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "new update": "https://workspaceupdates.googleblog.com/2021/10/new-beta-to-add-data-loss-prevention-to.html",
    "sign up here": "https://docs.google.com/forms/d/e/1FAIpQLSdaaQFwmo2-RF2-AKTl7w262tbYlj5DXLyhKNYF0qOQAr5tow/viewform"
  }
}