{
  "source": "https://www.techradar.com/news/tvos-145-code-describes-an-apple-tv-remote-that-doesnt-exist-yet",
  "title": "tvOS 14.5 code describes an Apple TV remote that doesn't exist yet",
  "category": "televisions",
  "updated": "2021-03-31T22:33:52Z",
  "author": "nick-pino",
  "summary": "Hard to press a button that’s not there, unless…",
  "article": [
    "Another day, another rumor about a new Apple TV – but this one's special in that it comes from Apple itself.",
    "A strange string of text was discovered in the latest batch of tvOS 14.5 beta code that mentions pressing “the center button” to make a choice on Apple TV. The problem? Well, there isn’t actually a center button on either the Apple TV HD or Apple TV 4K.",
    "This discrepancy was flagged on Twitter by Steve Moser, a contributor at MacRumors.",
    "As Moser rightly points out, the center button phrasing is incredibly strange. It simply doesn't exist on either of the two most widely used models (we'll cover the exceptions below) and could be the next clue of a revamped remote that MacRumors had uncovered earlier this week – or the sign of a completely retooled Apple TV coming our way during WWDC 2021 in June.",
    "Here’s what makes this story so credible: it’s coming directly from Apple’s tvOS 14.5 beta source code that’s being rolled out to developers this week. It’s not from an unknown source or a Jon Prosser tweet – it’s from Apple’s own coding team.",
    "Now, that being said, it’s possible that they slipped up or – another possibility – that the code refers to the Apple TV OEM remote that other manufacturers can distribute with their set-top box. (In fact, MacRumors published a story earlier saying that it had an exclusive image of the new remote that it now says is just an image of the old OEM remote.) But there's a good chance it's 100% legit, too.",
    "Still, the fact that the verbiage is appearing now – two months ahead of WWDC – is suspect.",
    "We’ll keep digging to find out more, and hopefully we’ll be able to tell you more about the rumored Apple TV before it potentially is unveiled on-stage in just a few months."
  ],
  "headers": {
    "4": "Another red herring or the real deal?"
  },
  "links": {
    "new Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple TV HD": "https://www.techradar.com/reviews/audio-visual/av-accessories/apple-tv-1269228/review",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k",
    "Twitter": "https://twitter.com/SteveMoser/status/1377359027466858504",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "Jon Prosser tweet": "https://twitter.com/jon_prosser/status/1258366598710206464",
    "exclusive image of the new remote": "https://9to5mac.com/2021/03/31/exclusive-heres-our-first-look-at-the-all-new-apple-tv-remote/"
  }
}