{
  "source": "https://www.techradar.com/news/microsoft-teams-could-finally-stop-one-of-the-most-embarassing-video-call-mistakes",
  "title": "One of the worst things about Microsoft Teams calls could have been solved at last",
  "category": "computing",
  "updated": "2021-11-18T16:58:01Z",
  "author": "mike-moore",
  "summary": "Microsoft Teams should soon detect if music is playing when you're on a call",
  "article": [
    "Having loud music or other sounds interrupt a video call could soon be a thing of the past thanks to a new Microsoft Teams update.",
    "The video conferencing service has announced it is working on an upgrade that it claims will detect music automatically, and suppress it so that your audio feed is not affected.",
    "The company is using machine learning-based noise suppression tools to detect non-speech signals during a Microsoft Teams call, and working out whether or not to keep them quiet, meaning your audio is not affected.",
    "\"ML-based noise suppression considers any non-speech signal picked up by the microphone as noise which should be suppressed,\" the entry in the official Microsoft 365 roadmap read.",
    "\"To avoid suppressing music and to allow users to enable the new high-fidelity music mode, we have built an ML-based music detector which will inform the user whenever music is present through a notification.\"",
    "Microsoft says the tool could be vital when blocking unwanted background noise, such as music playing in a coffee shop if you're working remotely.",
    "But the tool will also allow users to choose whether music is a desired input in certain use cases, such as during an online music lesson.",
    "The update is still in development, with Microsoft saying it hopes to release in January 2022. The good news is that the update is set for general availability, meaning most Microsoft Teams users should receive the upgrade - although it does appear to be limited to desktop users for the time being.",
    "The news is the latest in a long series of upgrades for Microsoft Teams as it looks to continue its success in the video conferencing industry. Microsoft recently unveiled a similar boost for users looking to get tighter control over their activity feed notifications, allowing them to change the type of notification that appears in the activity feed, hopefully avoiding the risk of drowning in pings."
  ],
  "headers": {
    "3": "Noise suppression in Microsoft Teams"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "read": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-7851621344718709000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2FRoadmapFeatureRSS%2F89016",
    "tighter control over their activity feed notifications": "https://www.techradar.com/news/microsoft-teams-update-will-help-you-cut-through-all-the-nonsense"
  }
}