{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-vs-mi-10-vs-mi-10t",
  "title": "Xiaomi Mi 11 vs Mi 10 vs Mi 10T: key face-off for the savvy phone buyer",
  "category": "phones",
  "updated": "2021-02-14T10:00:51Z",
  "author": "jon-mundy",
  "summary": "Three Xiaomi phones",
  "article": [
    "Xiaomi is rapidly establishing a name here in the West as the provider of high quality, generously-specced yet competitively-priced Android smartphones. Did you know that the Chinese manufacturer is the third biggest smartphone maker in the world by some estimations, placing it above the mighty Apple?",
    "If you want to check out a signature Xiaomi phone, you need look no further than the mainline Mi range. The Xiaomi Mi 11 is the latest flagship handset in the series, following in the footsteps of 2020’s Xiaomi Mi 10. For mid-range kicks, meanwhile, the cheaper Xiaomi Mi 10T would be a great place to start.",
    "With so many Mi handsets doing the rounds, a little comparative clarification might be in order. Here’s how these three highly capable and desirable phones stack up.",
    "As numerical convention dictates, the Xiaomi Mi 11 is the newest phone of the three. It was announced in China in December 2020, received a second global announcement in February 2021, and started landing in European markets in the same month. Prices start from €749 (around $900, £660, AU$1,175).",
    "The Xiaomi Mi 10 was announced in its home country in February 2020, which was followed by a global launch in March. It then received a staggered global rollout, with prices starting from £799 / AU$1,699 (roughly $990).",
    "In many ways the Xiaomi Mi 10T is the odd one out among this trio. It launched globally in late September 2020 and rolled out to Western markets in October. This is more of an upper mid-ranger than an outright flagship, and it’s priced accordingly at just £469 (about $600 / AU$820).",
    "One other important note: while we’ve stated the RRPs above, the Xiaomi Mi 10 can currently be had for much cheaper thanks to its age. At the time of writing, you can pick one up for less than £500 (around $690) on Amazon, which is about the same price as the newer but technically inferior Xiaomi Mi 10T.",
    "All three phones sport similar glass-and-aluminum constructions, and similar all-screen fronts with hole punch selfie cameras. But there are subtle differences everywhere you look",
    "The front of the Xiaomi Mi 11 represents an evolution of the Mi 10 design, with both sporting slightly curved displays. However, the Mi 11’s screen also tapers away on the top and bottom edges for a more premium effect.",
    "One of the first ways in which the Mi 10T shaves off some of the expense of the other two is by providing a dead flat display. It’s less ‘premium’, sure, but it’s arguably an improvement when it comes to practical matters such as watching landscape video content. There’s also a slightly more pronounced chin here, which is always a good signifier that you’re not quite dealing with a flagship.",
    "Flip all three phone around to the back, and the main differentiating factor is the camera module. The Mi 10’s is arguably the dullest of the three, with a long vertical lozenge-shaped that was very late–2019/early–2020.",
    "The Mi 10T feels far fresher, with a sharp industrial-looking oblong module that clusters its sub-lenses in a way that screams (or rather gently whispers) ‘cool pro camera’ - even though it’s actually the least impressive of the three in terms of performance.",
    "As for the new Xiaomi Mi 11, it takes an altogether rounder, smoother and more artistic approach. Its camera module has the kind of rounded square look that’s vaguely reminiscent of the iPhone 12 Pro’s, but with its own distinctively rounded lens mounting.",
    "They all sport similar dimensions, but the Xiaomi Mi 11 is the lightest of the three at 196g, coming in well short of the Mi 10 (208g) and Mi 10T (216g). The Mi 11 is also much thinner than the other two at 8.1mm, with both the Mi 10 (9mm) and Mi 10T (9.3mm) feeling quite chunky by comparison.",
    "Both the Xiaomi Mi 10 and the Xiaomi Mi 10T pack 6.67-inch displays, with similar Full HD+ resolutions. The Xiaomi Mi 11 screen is much bigger than both at 6.8-inches, and its a good deal sharper too at WQHD+.",
    "The Mi 10 and the Mi 11 use vibrant AMOLED panel technology, whereas the Mi 10T cuts costs by going with a more traditional IPS LCD approach. This means that the two pricier flagship models output richer, contrast-ier pictures with superior dynamic range and deeper blacks.",
    "On the other hand, it might surprise you to learn that the Xiaomi Mi 10T screen is the smoothest of the three, with an impressive 144Hz refresh rate. The Xiaomi Mi 11 is just a little behind on 120Hz, while the Xiaomi Mi 10 brings up the rear with a still-respectable 90Hz.",
    "We liked the Mi 10’s display back when we reviewed it, appreciating its HDR10+ credentials and all-round balance, but the Xiaomi Mi 11 promises to take things to the next level. With its ability to run at 120Hz and QHD simultaneously, it’s potentially right up there with the Galaxy S21 Ultra and the OnePlus 8 Pro.",
    "All of these phones bring meaty numbers to the table when it comes to camera specs, though all miss out on top notch zoomed shots thanks to the lack of a dedicated telephoto lens.",
    "The Xiaomi Mi 11 and Xiaomi Mi 10 go an extra step in an attempt to compensate for this. The cheaper Xiaomi Mi 10T runs a 64MP wide sensor, while the Xiaomi Mi 10 and the Xiaomi Mi 11 both go with huge 108MP equivalents, which opens the possibility of cropping in for digital zoomed shots without a massive drop in quality.",
    "Interestingly, the Mi 10 has the fastest main lens of the three at f/1.7, while the Mi 11 and Mi 10T have to make do with f/1.9.",
    "That 108MP figure is a dead give away as to the source of those image sensors: Samsung. That said, these are actually two different sensors, with the Mi 10 taking the ISOCELL HM2 from the Galaxy S20 Ultra, and the Mi 11 borrowing the ISOCELL HM3 sensor from the Galaxy S21 Ultra. The newer sensor features larger 0.8μm pixels (as opposed to 0.7μm), among other enhancements.",
    "All three camera systems feature 13MP f/2.4 ultrawide sensors. Both the Xiaomi 11 and the Xiaomi 10T back their two primary cameras with a 5MP macro camera, while the Xiaomi 10 goes with a pair of 2MP sensors - one for macro, one for depth.",
    "There’s no contest when it comes to the fastest phone out of these three. The Xiaomi Mi 11 uses Qualcomm’s latest top-end chip, the 5nm Snapdragon 888, which represents a sizeable 25% performance leap over the 7nm Snapdragon 865 that powers both of the others.",
    "Breaking things down a little, the Snapdragon 888’s Adreno 660 GPU can render graphic 35% faster than the Snapdragon 865’s Adreno 650, whilst being 20% more power efficient.",
    "Qualcomm also claims that the Snapdragon 888 packs a much faster AI Engine than its predecessor, one that’s capable of 26 tera operations per second next to the Snapdragon 865’s 15 TOPS for a performance improvement of more than 70%. Its ISP is 35% faster than before too, which greatly bolsters the potential camera performance of the Xiaomi Mi 11.",
    "There’s no context at the top, but it’s worth reiterating that the Mi 10T is just as fast as the more expensive Mi 10 - with one minor caveat. While both the Xiaomi Mi 10 and Xiaomi Mi 11 come with 8GB of RAM in their base configuration, the entry level Xiaomi Mi 10T packs 6GB.",
    "All three offer starting storage capacities of 128GB, but certain regions will offer 256GB options for the Xiaomi Mi 10 and Xiaomi Mi 11. None of them offer the potential for storage expansion.",
    "On the connectivity front, all three phones boast 5G connectivity. However, the Xiaomi Mi 11 packs a newer X60 modem, which has slightly higher potential download and upload speeds, and improved carrier aggregation across sub–6GHz and mmWave spectrums.",
    "None of which will make much difference to most people, but it does make the Mi 11 the more future-proof of the three. Hopefully its more power-efficient nature will also make it less of a battery hog. Speaking of which…",
    "The Xiaomi Mi 11 runs on a 4,600mAh battery, which is a little concerning when you consider that its predecessor the Xiaomi Mi 10 packed in a 4,780mAh cell. Meanwhile, the Xiaomi Mi 10T tops them both with a chunky 5,000mAh battery.",
    "It’s not just the relative size of the Mi 11’s battery that would appear to hamper it in a straight face-off, but the fact that the phone has to drive a sharper QHD display at a rapid 120Hz refresh rate.",
    "Counteracting that somewhat is the aforementioned Snapdragon 888 SoC, which should prove to be a much more power-efficient chip. We’re particularly hopeful that the newer 5G modem will sip the juice rather slower than its older brother.",
    "When it comes time to recharge, the Xiaomi Mi 11 definitely has the edge. Its 55W wired fast-charging comfortably beats the other two, with the Mi 10 capable of 30W and the Mi 10T capable of 33W.",
    "The newest handset is also capable of impressively rapid 50W wireless charging, whereas the Mi 10 can only hit 30W. The Mi 10T doesn’t support wireless charging at all.",
    "It’s early, days, but the Xiaomi Mi 11 looks set to be a strong upgrade on its predecessors in almost every regard. Its display is bigger and sharper than both the Mi 10’s and the Mi 10T’s, while being more responsive than the former and more vibrant than the latter.",
    "The newer handset also benefits from a considerably faster processor and the most advanced camera module of the three phones, not to mention a new generation of 5G modem.",
    "Just about the only area of concern is the Xiaomi Mi 11’s battery, which is smaller than both of the others. That said, with more efficient internal components, we have faith that Xiaomi won’t leave us short at the end of the day. And even if we do need a top-up, it supports much faster charging - both wired and wireless.",
    "Of course, you’ll pay a premium for having the latest and greatest. The Xiaomi 10T represented great value at launch with its combination of top-end components and mid-range price, but the Xiaomi Mi 10 is arguably even better value now that it’s been heavily discounted owing to age."
  ],
  "headers": {
    "3": "Xiaomi Mi 11 vs Xiaomi Mi 10 vs Xiaomi Mi 10T price and availability",
    "7": "Design",
    "14": "Display",
    "18": "Camera",
    "23": "Specs and performance",
    "30": "Battery life",
    "35": "Takeaway"
  },
  "links": {
    "Xiaomi phone": "https://www.techradar.com/news/best-xiaomi-phones",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Xiaomi Mi 10T": "https://www.techradar.com/news/xiaomi-mi-10t-release-date",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro"
  }
}