{
  "source": "https://www.techradar.com/news/new-microsoft-outlook-update-looks-to-keep-all-your-mobile-emails-safe",
  "title": "New Microsoft Outlook update looks to keep all your mobile emails safe",
  "category": "computing",
  "updated": "2021-04-09T20:53:29.118Z",
  "author": "anthony-spadafora",
  "summary": "New external label can help protect against spam and phishing threats",
  "article": [
    "Microsoft has released a new update for its Microsoft Outlook app on mobile which aims to keep Android and iOS users better protected from email-based threats.",
    "With the release of version 4.2112.1 of the app, the software giant has added a new feature to make it easier for mobile users to identify emails from senders outside of their organization.",
    "While this may seem like a small update to some, the feature will help users stay protected from spam and phishing threats which typically arrive in one's inbox from unknown senders.",
    "After updating to the latest version of Microsoft Outlook, users will see a new external label at the top of emails in their inbox. Tapping on the label will reveal the sender's email address so that users can decide whether or not it is safe to open links or attachments in the email.",
    "As smartphone use has increased especially with more employees working from home, mobile phishing has become an even greater threat to both organizations and individuals. In fact, a 2020 report from the cybersecurity firm Lookout revealed that unmitigated mobile phishing threats could end up costing organizations with 10,000 mobile devices as much as $35m per incident and up to $150m for organizations with 50,000 mobile devices.",
    "In addition to the new external label, Outlook version 4.2112.1 also includes a number of general bug fixes and other performance improvements."
  ],
  "headers": {
    "3": "External label"
  },
  "links": {
    "Microsoft Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "email-based threats": "https://www.techradar.com/news/email-is-still-the-biggest-security-risk-around-today",
    "spam": "https://www.techradar.com/news/spam-calls-and-emails-saw-a-huge-rise-this-year",
    "phishing threats": "https://www.techradar.com/news/wfh-phishing-threats-are-on-the-risk",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "2020 report": "https://www.techradar.com/news/just-one-mobile-phishing-attack-could-cost-your-business-hundreds-of-millions"
  }
}