{
  "source": "https://www.techradar.com/news/squid-game-season-2",
  "title": "Will there be a Squid Game season 2? Here's what we know",
  "category": "entertainment",
  "updated": "2021-09-29T10:49:52Z",
  "author": "samuel-roberts",
  "summary": "Will Netflix's latest hit return for more?",
  "article": [
    "Will there be a Squid Game season 2? Netflix's latest surprise hit has become so popular that it may rank as the streamer's biggest show ever when the dust clears – dethroning Bridgerton, and other popular series like The Witcher.",
    "But even though the popularity of the Korean series is enormous, a second season is not confirmed yet. It's partly because creator Hwang Dong-hyuk found working on the show to be difficult.",
    "Squid Game is a drama about a group of 456 desperate people who sign up to try and survive a series of deadly challenges, all with the hope of winning 45.6 million won. They're corralled by mysterious people in red overalls, and while the rules of each game are theoretically simple, the consequences for failure are grim.",
    "To say anything more would be spoiling it – since the show is a lean nine episodes long, it's worth seeing it for yourself, though we'd warn it's not for the squeamish.",
    "So, what has the show's creator said about the possibility of Squid Game season 2? Below, we'll talk you through it.",
    "Squid Game season 2 has not been confirmed yet, but it's not a matter of numbers – the show is on course to become the streamer's most popular show ever globally. That puts it in the realm of fellow hits like Bridgerton (82 million), Lupin, and The Witcher (both 76 million each).",
    "Netflix renewed all of those shows for a second season – so there's no reason to think it won't want Squid Game to return. The creator's challenges in making the show might make the wait for a new season extra-long, though.",
    "In an interview with Variety, Hwang Dong-hyuk explained the mostly solitary process of writing the show – it took six months just to write the first two episodes. He also plans on making a movie before a second season of the show, having previously made films like Silenced in 2011 and The Fortress in 2017.",
    "Still, while Hwang doesn't sound too thrilled about the prospect of returning to the show right now, it sounds like he's at least thought about how he'll do it.",
    "“I don’t have well developed plans for Squid Game 2,\" he told Variety. \"It is quite tiring just thinking about it. But if I were to do it, I would certainly not do it alone. I’d consider using a writers’ room and would want multiple experienced directors.”",
    "That would potentially expedite the process of making Squid Game season 2 – but it sounds like it won't happen any time soon as it stands. Perhaps the popularity of the show overseas will change that."
  ],
  "headers": {
    "5": "Squid Game season 2: renewal status"
  },
  "links": {
    "Bridgerton": "https://www.techradar.com/news/bridgerton-season-2-first-look-and-what-we-know",
    "Variety": "https://variety.com/2021/global/asia/squid-game-director-hwang-dong-hyuk-korean-series-global-success-1235073355/?cx_testId=49&cx_testVariant=cx_1&cx_artPos=5#cxrecs_s"
  }
}