{
  "source": "https://www.techradar.com/news/apple-watch-8-could-be-joined-by-two-other-wearables-and-the-iphone-se-3",
  "title": "Apple Watch 8 could be joined by two other wearables and the iPhone SE 3",
  "category": "phones",
  "updated": "2021-12-08T11:15:01Z",
  "author": "james-rogerson",
  "summary": "Two news SEs could be on the way",
  "article": [
    "2022 could be a busy year for Apple, and not just because of the iPhone 14 range with all its rumored changes, as Apple might additionally have three new wearables on the way.",
    "That’s according to Ming-Chi Kuo (an analyst with a good track record for Apple leaks) in a report seen by 9to5Mac. Apparently as well as the Apple Watch 8, we’ll also see the Apple Watch SE 2 and a rugged Apple Watch designed for sports.",
    "And that’s not all, as Kuo adds that apparently the iPhone SE 3 will also land at some point in 2022. This might not be terribly exciting, as supposedly it will have more or less the same design as the iPhone SE (2020), along with 3GB of RAM again, and just a minor spec bump. But it could be followed by another iPhone SE in 2023, which might have a larger screen and 4GB of RAM.",
    "Kuo doesn’t say at what point in the year any of these devices would launch, but based on past form we’d think it’s likely that the iPhone SE 3 will be announced in either March or April (probably at Apple’s spring event), with all three new Apple Watch models possibly landing in September, alongside the iPhone 14 range.",
    "Of course, there’s no guarantee that all of these devices will launch at all, but Kuo is often right, and this isn’t the first time we’ve heard that any of these things are in the works. Still, the only one that we’re certain we’ll see next year is the Apple Watch 8 – the others could easily arrive later or never.",
    "So far we haven’t heard a huge amount about any of these devices, but some details have emerged. The Apple Watch 8 for example is rumored to have a body temperature sensor. It might also come in a larger size than the Apple Watch 7, but with an otherwise similar design.",
    "The iPhone SE 3 meanwhile might have an A15 Bionic chipset (just like the iPhone 13 range), and support 5G.",
    "Information on the Apple Watch SE 2 and the rugged Apple Watch is rather more lacking, but with neither of them expected to launch before late 2022, there’s plenty of time for rumors to roll in."
  ],
  "headers": {
    "5": "Analysis: what we know so far"
  },
  "links": {
    "iPhone 14": "https://www.techradar.com/news/iphone-14",
    "9to5Mac": "https://9to5mac.com/2021/12/08/kuo-airpods-pro-apple-watch-8/",
    "Apple Watch 8": "https://www.techradar.com/news/apple-watch-8",
    "Apple Watch SE 2": "https://www.techradar.com/news/apple-watch-se-2",
    "rugged Apple Watch": "https://www.techradar.com/news/if-apples-next-watch-is-built-for-extreme-sports-itll-need-an-extreme-redesign",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "to have a body temperature sensor": "https://www.techradar.com/news/this-apple-watch-8-upgrade-may-make-you-want-to-skip-the-apple-watch-7",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13"
  }
}