{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-probably-wont-have-an-under-display-camera",
  "title": "Samsung Galaxy S22 probably won't have an under-display camera",
  "category": "phones",
  "updated": "2021-06-07T08:58:09Z",
  "author": "james-rogerson",
  "summary": "The Z Fold 3 probably still will",
  "article": [
    "Not so long ago it was rumored that the Samsung Galaxy S22 would have an under-display camera, but now another source is claiming it’s not to be, and for some good reasons.",
    "In a blog post on Naver (a South Korean site), a source claims that the production yield is currently too low to build enough units for a phone as popular as the Samsung Galaxy S22 is sure to be. On top of that, the image quality apparently doesn’t meet Samsung’s standards, and the camera itself is apparently still slightly visible under the screen.",
    "None of this is surprising. The ZTE Axon 20 5G included the first under-display smartphone camera, and that was both slightly visible and uninspiring in terms of photo quality. So it makes sense that Samsung would wait until these problems are solved before equipping its main flagships with such a snapper.",
    "The source appears to additionally say that – as has long been rumored – the Samsung Galaxy Z Fold 3 will launch this year with an under-display camera. We say ‘appears to’ because this is via slightly clunky machine translation.",
    "Still, we’d expect that phone to have this snapper, as beyond it having been repeatedly rumored, given that the Z Fold 3 will probably have a secondary selfie camera, the quality concerns are less significant. It's also sure to sell a lot less than the Galaxy S22 range, so the limited production yield is less likely to be a problem.",
    "Apparently the first perfected under-display camera (with ideal photo quality and no visible lens) is now planned for the second half of 2022 at the earliest, with next year’s Samsung Galaxy Note model (if there is such a phone) being a likely candidate for it.",
    "As ever with leaks we’d take all of this with a pinch of salt, but these claims sound convincing, especially as a recent leak from @UniverseIce (a leaker with a solid track record) supports the idea that Samsung’s under-display camera hasn’t been perfected just yet, with a mosaic-like effect apparently visible where the lens sits under the Z Fold 3’s display.",
    "Via SamMobile"
  ],
  "headers": {
    "3": "Still coming to the Z Fold 3"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "an under-display camera": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-may-have-a-major-zoom-upgrade-and-an-in-screen-camera",
    "Naver": "https://m.blog.naver.com/yeux1122/222388210039",
    "ZTE Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1401465918388162561",
    "SamMobile": "https://www.sammobile.com/news/galaxy-s22-no-under-display-camera/"
  }
}