{
  "source": "https://www.techradar.com/news/swiss-non-profit-turns-public-internet-into-decentralized-global-computer",
  "title": "Swiss non-profit turns public internet into decentralized global computer",
  "category": "computing",
  "updated": "2021-05-07T14:51:27.936Z",
  "author": "abigail-opiah",
  "summary": "The Internet Computer is the world’s first blockchain that runs at web speed",
  "article": [
    "Zurich-based non-profit organization DFINITY Foundation is launching the Internet Computer, the world's first blockchain that runs at web speed with unlimited capacity.",
    "DFINITY plans to turn the public internet into a decentralized global computer that extends the functionality of the internet to a network that provides millions of developers and entrepreneurs with a public compute platform for crypto-based startups and blockchain-ready enterprises.",
    "Supported by 48 independent data centers across North America, Europe, and Asia, the Internet Computer will solve the “blockchain trilemma” by producing a blockchain network that is decentralized, secure, and scalable.",
    "Dominic Williams, DFINITY Chief Scientist and Founder told TechRadar Pro that the project is essentially to extend the internet as we currently take it for granted.",
    "\"Creating this revolutionary, permissionless open domain cyberspace that has led to an enormous amount of innovation and growth and all kinds of transformations in the way society works. But the one thing it didn’t do was move how we build systems and services into the public domain.",
    "“If you want to build an internet service or an enterprise system or a website, you have to build that on closed private infrastructure. Our aim is to extend the internet so that it’s not just the public network that connects everybody and everything.”",
    "For the crypto industry, the Internet Computer has been designed to complete a trinity of public blockchain innovations — starting with Bitcoin, progressing to Ethereum, and ending with the Internet Computer.",
    "The creation of the Internet Computer now makes a new breed of software possible: open mass-market internet services run by tokenized governance systems (also known as autonomous software), such as open versions of TikTok, WhatsApp, and LinkedIn, using less than a thousand lines of code, and capable of supporting millions of users.",
    "DFINITY reveals that the Internet Computer launch also reveals a scientific breakthrough called “Internet Identity,” a new approach that allows the Internet Computer to natively manage user identities without usernames, passwords, or cryptographic keys.",
    "Williams added: “Going forward, the DFINITY Foundation, the newly formed Internet Computer Association, and many other organizations will work tirelessly to improve Internet Computer technology and support those participating in the ecosystem.”",
    "“In five years, there will be widespread understanding of the Internet Computer and its revolutionary capabilities for both entrepreneurs and end users. In 10 years, the wider tech community will realize that the Internet Computer is on a trajectory to one day become humanity’s primary compute platform for building software, and the “Open Internet” will predominate over Big Tech’s closed proprietary ecosystem.",
    "\"Finally, in 20 years, the Open Internet will be significantly bigger than Big Tech’s closed proprietary ecosystem, which will be in terminal decline, but will take forever to disappear for similar reasons COBOL code is still running.”",
    "In DFINITY’s plans, 123 data centers running 4,300 nodes will uphold the Internet Computer by the end of the year, and eventually thousands of data centers running millions of nodes to support the decade-long building out of the Open Internet."
  ],
  "headers": {
    "6": "Built on crypto"
  },
  "links": {
    "blockchain": "https://www.techradar.com/news/what-is-enterprise-blockchain-everything-you-need-to-know",
    "entrepreneurs": "https://www.techradar.com/news/14-profitable-business-ideas-to-start-in-2021",
    "crypto industry": "https://www.techradar.com/best/mining-pools"
  }
}