{
  "source": "https://www.techradar.com/news/how-to-watch-legacies-season-3-online-stream-every-new-episode-from-anywhere",
  "title": "How to watch Legacies season 3 online: stream every new episode from anywhere",
  "category": "computing",
  "updated": "2021-01-21T23:55:11Z",
  "author": "kevin-lynch",
  "summary": "Vampire Diaries spin-off returns",
  "article": [
    "Fantasy drama Legacies returns to The CW’s primetime lineup in 2021. While initially dismissed by some critics for being an unnecessary spin-off from The Vampire Diaries and The Originals, the show has gone on to build-up a fanbase of its own over the course of its preceding two seasons. Read for how to watch Legacies season 3 online and stream every new episode of the show, including for free.",
    "Set a couple of years after the events of The Originals, the show follows the trials and tribulations of the supernatural alumni of The Salvatore School for the Young and Gifted - home to young witches, vampires and werewolves.",
    "The new season sees the pupils continue to battle their inner demons to become the heroes they want to be — or decide to be the villains they were perhaps born to be. As before, the central character is Hope Mikaelson, played by Danielle Rose Russell, the teenage daughter of \"hybrid\" couple and key Vampire Diaries character's Klaus Mikaelson and Hayley Marshall.",
    "The show's second season ended somewhat abruptly thanks to the coronavirus pandemic, leaving a number of cliffhangers to resolve - namely that Hope was in a coma-like state when we last saw her.",
    "There's also the small issue of the evil Necromancer using werewolf Rafael (Peyton Alex Smith) to stab his foster brother Landon (Aria Shahghasemi) with the golden arrow, leaving fans of the show wondering if he has been killed permanently. Follow our guide below for how to watch Legacies online and stream every new season 3 episode as soon as it's released, no matter where you are in the world right now.",
    "While the ongoing pandemic means that international travel might be limited, it’s still possible for many of us to visit countries on government ‘approved travel’ lists. For those abroad on business or getting some winter sun when Legacies: Season 3 airs, you’ll be unable to watch the show due to annoying regional restrictions.",
    "Luckily, there’s an easy solution. Downloading a VPN will allow you to stream the the new series online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch Legacies seasosn 3 from anywhere"
  ],
  "headers": {
    "5": "How to watch Legacies online from outside your country",
    "8": "How to watch Legacies season 3 online in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}