{
  "source": "https://www.techradar.com/news/nvidia-rtx-3060-ultra-leak-suggests-a-surprise-new-12gb-gpu-is-imminent",
  "title": "Nvidia RTX 3060 Ultra leak suggests a surprise new 12GB GPU is imminent",
  "category": "computing",
  "updated": "2021-01-05T14:09:18Z",
  "author": "darren-allan",
  "summary": "Pics of Asus graphics card have been spilled online",
  "article": [
    "Nvidia could be planning to unleash an RTX 3060 Ultra with 12GB of VRAM, at least going by leaked pictures of this purported graphics card which have turned up online.",
    "Wccftech has furnished us with the images which supposedly show an Asus TUF Gaming GeForce RTX 3060 Ultra.",
    "The pics looks convincing enough – although as ever with leaked images, there’s always the possibility they could be faked – and the box clearly states the ‘3060 Ultra’ name, and that it has 12GB of GDDR6 video RAM. Apparently, it will be a 2.7-slot card using a triple-fan cooling solution, as pictured.",
    "While this is the TUF model, Wccftech asserts that Asus will make others including a more powerful ROG Strix version. The site says its sources believe that the ‘Ultra’ GPU will be above the Ti and Super models (or presumably could even replace the Super versions we saw with Turing GPUs).",
    "If true, that’ll mean we will have an RTX 3060 Ti and RTX 3060 Ultra, with possibly a vanilla RTX 3060 eventually nestling beneath those two cards.",
    "We’ve recently been hearing a fair bit of chatter on the GPU grapevine regarding a 12GB version of the RTX 3060 – Lenovo spilled some rumored details in PC spec listings very recently – so the theory is that this could be it.",
    "Nvidia has a GeForce Special Broadcast event scheduled for CES 2021, on January 12, and this is where the RTX 3060 Ultra will purportedly be revealed with a claimed price tag of $449.",
    "However, despite the weight of rumors around all this, we should still be very careful about drawing any firm conclusions here – there are some major caveats to be aware of.",
    "For starters, other sources, such as Igor’s Lab, have noted that they have been unable to get any indication that this RTX 3060 Ultra version is coming from other graphics card makers – and that seems a little odd given that the launch is supposedly so very close.",
    "Not that we can discount this speculation on that basis, by any means, but just in general terms, pushing out an RTX 3060 Ultra loaded with 12GB of memory seems rather a strange move by Nvidia.",
    "Remember, this would mean that there would be an RTX 3060 model out there with more memory than the RTX 3070 – much more memory, in fact, as the latter only runs with 8GB. And indeed, 12GB is more than the 10GB found on the RTX 3080, even – so owners of the latter could find their noses put out of joint in some respects (although the 3080 does have faster GDDR6X RAM, rather than GDDR6 in this rumored GPU).",
    "Of course, there could be Ultra variants of the RTX 3070 and 3080 in the wings, too, as seen in other rumors, such as the existence of an RTX 3080 with 20GB of VRAM (which was rumored to be happening, then not happening, and is supposedly back in the cards, so to speak).",
    "And some folks are theorizing that perhaps Nvidia needs a fresh and pepped up take on the RTX 3060 to head off AMD’s incoming Radeon RX 6700 offerings, which could arrive in January – potentially with 12GB of VRAM on-board.",
    "It’s a rather confusing picture of arguments and possibilities, then, but if this new RTX 3060 Ultra rumor is true – and these Asus images are genuine – we’ll find out soon enough (in a week’s time, in fact). Until then, the speculation will doubtless continue…"
  ],
  "headers": {
    "8": "Odd move?"
  },
  "links": {
    "RTX 3060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Wccftech": "https://wccftech.com/nvidia-geforce-rtx-3060-ultra-12-gb-gddr6-graphics-card-449-usd-asus-tuf-gaming-oc-pictured/",
    "Lenovo spilled some rumored details": "https://www.techradar.com/news/nvidia-rtx-3050-rtx-3050-ti-and-rtx-3060-might-debut-at-ces-next-week",
    "Igor’s Lab": "https://www.igorslab.de/en/nvidia-geforce-rtx-3060-ultra-12-gb-schneller-als-eine-rtx-3060-ti-asus-tuf-gaming-geleakt-2/",
    "Ultra variants of the RTX 3070 and 3080 in the wings": "https://www.techradar.com/news/nvidia-may-be-preparing-to-release-the-rtx-3080-super-and-rtx-3070-super",
    "rumored to be happening": "https://www.techradar.com/news/nvidia-rtx-3080-ti-leak-suggests-a-powerful-gpu-with-20gb-of-vram-to-take-on-amd-big-navi",
    "Radeon RX 6700": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-and-rx-6700-may-be-coming-in-january-2021"
  }
}