{
  "source": "https://www.techradar.com/news/new-hublot-wear-os-smartwatch-is-an-expensive-way-to-get-premier-league-updates",
  "title": "New Hublot Wear OS smartwatch is an expensive way to get Premier League updates",
  "category": "wearables",
  "updated": "2021-02-16T14:21:05Z",
  "author": "sofia-wycislik-wilson",
  "summary": "A special app delivers the very latest football news to your wrist",
  "article": [
    "If you keep yourself up to speed with news about some of the most expensive smartwatches available, Hublot may well be a name that you're familiar with. Last year, the company released the startlingly priced Big Bang e, and now there is a limited edition model that will – well… might – appeal to soccer fans.",
    "The Swiss watchmaker has been producing timepieces for just four decades, and it has managed to carve out something of a niche for itself in the slightly more luxurious end of the market.",
    "The company's latest partnership sees it teaming up with the Premier League in the UK as not only the official timekeeper for matches, but also the producer of a pricey, limited-run model that will keep you up to speed with games.",
    "The Hublot Big Bang e Premier League smartwatch is limited to just 200 units, and features the Premier League's iconic purple for its fabric strap. The 42mm watch features a satin-finished and polished titanium case, a 390 x 390 screen and the device runs Google's Wear OS.",
    "But in addition to the purple daubing, it's the exclusive Hublot Loves Football Premier League app that helps to make this watch stand out from the crowd.",
    "For those with the cash to spare for such a timepiece, the app provides animated alerts warning about impending kick-offs. In \"Match Mode\" the app will display VAR decisions and team line-ups.",
    "Of course, true fans will likely be glued to every match they can possibly see but the app will alert users to key events such as goals, penalties and substitutions. But if you're interested in two fixtures that are taking place at the same time, a quick tap of the screen is all it takes to switch between matches.",
    "The smartwatch is powered by a Qualcomm Snapdragon Wear 3100, and it features 1GB of RAM and 8GB of storage – the same as the standard Hublot Big Bang e. The device is waterproof to 30 meters and includes a 300mAh which should be enough to get you through the day.",
    "If you have £4,300 / $5,200 (about AU$6,700) burning a hole in your pocket, the Hublot Big Bang e Premier League is available here.",
    "Via Pocket-lint"
  ],
  "headers": {
    "6": "Match time"
  },
  "links": {
    "startlingly priced Big Bang e": "https://www.techradar.com/news/hublots-big-bang-e-is-a-smartwatch-that-costs-the-same-as-13-apple-watches",
    "Google's Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "here": "https://www.hublot.com/watches/big-bang/big-bang-e-premier-league-42-mm",
    "Pocket-lint": "https://www.pocket-lint.com/smartwatches/news/155730-hublot-big-bang-e-premier-league-smartwatch"
  }
}