{
  "source": "https://www.techradar.com/news/the-most-advanced-windows-10-users-have-something-new-to-celebrate",
  "title": "Windows 10: Power users can now squeeze out even more efficiency",
  "category": "computing",
  "updated": "2021-08-05T16:32:17Z",
  "author": "joel-khalili",
  "summary": "PowerToys update delivers a few performance upgrades",
  "article": [
    "Microsoft has pushed out a new version of its PowerToys utilities suite for Windows 10 that delivers a number of small but important improvements.",
    "The new version does not come bundled with any new features or tools, instead packaging up a range of “stability updates and optimizations, installer updates, general bug fixes and accessibility improvements,” the GitHub change log suggests.",
    "Perhaps the most eye-catching change is an update to the PowerToys Run utility that remedies a crashing issue and improves the performance of the tool at launch.",
    "Smaller upgrades include an expansion to the bug reporting tool, new UI elements, and bug fixes across a number of different PowerToys utilities.",
    "PowerToys is an open source suite of tools for the most advanced Windows 10 users, offering the ability to bypass certain settings and perform actions unavailable to regular users. It also gives people a wider range of customization options.",
    "The utility library includes tools such as Color Picker, which can copy color data from any running application to the clipboard, and Fancy Zones, which lets users create complex window layouts specifically suited to their applications (although the arrival of Windows 11 may diminish the usefulness of this particular tool).",
    "Others, like Image Resizer and PowerRename, are designed to help Windows 10 users perform common actions with greater ease and speed, maximizing productivity.",
    "The PowerToys Run utility, meanwhile, is a lightweight Start Menu alternative that helps users launch into files and applications more quickly (and even more so with the latest update). It can also be used to navigate to active applications and perform system-level actions, such as shutdown or restart.",
    "Although the latest PowerToys update is unlikely to make waves, it demonstrates the community remains committed to maintaining and improving the utility suite. In fact, according to the GitHub commits log, PowerToys has never enjoyed greater support."
  ],
  "headers": {
    "4": "PowerToys update"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "GitHub change log": "https://github.com/microsoft/PowerToys/releases/tag/v0.43.0",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "GitHub commits log": "https://github.com/microsoft/PowerToys/graphs/contributors?from=2019-07-31&to=2021-08-05&type=c"
  }
}