{
  "source": "https://www.techradar.com/news/genshin-impact-ps5-version-is-coming-soon-with-faster-loading-and-dualsense-features",
  "title": "Genshin Impact on PS5 is coming soon with faster loading and DualSense features",
  "category": "gaming",
  "updated": "2021-03-31T13:51:04Z",
  "author": "samuel-tolbert",
  "summary": "Ready to grind out even more heroes but with increased quality and performance?",
  "article": [
    "Genshin Impact is a popular anime-inspired free-to-play game available on mobile devices, PC and on PS4. While it can be played on the PS5 through backward compatibility, it doesn't take advantage of the system's advanced hardware or unique DualSense controller.",
    "That's going to be changing soon, as developer miHoYo confirmed today that the PS5 version of Genshin Impact is coming \"very soon.\"",
    "You can check out a brief trailer below celebrating the announcement of the PS5 version:",
    "There aren't a lot of exact details for what this update will entail. The official PlayStation Twitter account indicates that the update will allow faster loading, which is made possible by the PS5's ultra-fast SSD.",
    "Genshin Impact on PS5 will also be joining the list of games supporting DualSense features, which could mean inventive uses of the haptic feedback and adaptive triggers. While there's no specific confirmation, it also seems fair to expect the game will have a better framerate and a higher resolution than the current PS4 version.",
    "The phrase \"coming soon\" isn't a super-specific timeframe so hopefully we'll learn exactly when this update arrives in the next couple of weeks. Genshin Impact is not only free-to-play but supports co-op, so you can your friends can grind for different heroes together in the fantastical world of Teyvat."
  ],
  "headers": {
    "3": "Genshin Impact on PS5: what to expect"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "haptic feedback and adaptive triggers": "https://www.androidcentral.com/list-ps5-games-dualsense-haptic-feedback-adaptive-triggers"
  }
}