{
  "source": "https://www.techradar.com/news/these-black-friday-wireless-earbuds-deals-see-the-sony-wf-1000xm3-drop-to-lowest-price",
  "title": "Buying some wireless earbuds this Black Friday? The Sony WF-1000XM3 are the ones to go for",
  "category": "audio-visual",
  "updated": "2021-11-26T18:38:00Z",
  "author": "hamish-hector",
  "summary": "Don't miss these incredible Sony WF-1000XM3 deals",
  "article": [
    "The Sony WF-1000XM3 wireless earbuds have plummeted to their lowest price in the US and the UK in some incredible Black Friday deals from Amazon. (Not in the US or UK? Scroll down for the best deals in your region.)",
    "Usually $199.99 in the US, Amazon has slashed the price of the Sony earbuds to just $128, saving you $71.99 – a deal made even more impressive when you consider their original $230.",
    "UK buyers can also get the Sony WF-1000XM3 at an all-time-low price, where Amazon has reduced them from £129 to £99 – and while £30 may not seem like the biggest saving it's actually £105 off the original RRP, and a price that's continued to plummet as Black Friday progresses.",
    "When the Sony WF-1000XM3 wireless earbuds were released back in 2019 we gave them five stars and even awarded them Product of the Year.",
    "While they have now been usurped by the Sony WF-1000XM4 earbuds, they are no less fantastic. The Sony WF-1000XM3 earbuds come with great noise cancellation, a comfy design and they can conjure a wide, expansive soundstage, with believable spatial detail.",
    "If you're after a new pair of earbuds and don't want to splash out too much, you can't beat these earbuds that are at their lowest price ever on Amazon right now. They might sell out though, so if you think this deal is for you you'll want to act fast - especially in the UK, where the price has dropped further and further as Black Friday goes on.",
    "No matter where you live, you'll find all the lowest prices for Sony's wireless earbuds from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Sony wireless earbuds Black Friday deals",
    "6": "More Sony wireless earbud deals",
    "7": "More Black Friday deals in the UK"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "to just $128": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07T81554H%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6412338046378804000-20",
    "Amazon has reduced them from £129 to £99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB07T3HHM55%3Fth%3D1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8849385010911915000-21",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Sony WF-1000XM4 earbuds": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds"
  }
}