{
  "source": "https://www.techradar.com/news/apple-watch-6-could-one-day-help-detect-covid-19-if-this-trial-works",
  "title": "Apple Watch 6 could one day help detect Covid-19, if this trial works",
  "category": "wearables",
  "updated": "2021-04-14T14:46:59Z",
  "author": "hamish-hector",
  "summary": "It’s a very smart watch",
  "article": [
    "The Apple respiratory study is now recruiting participants to determine if the Apple Watch 6 can detect Covid-19 symptoms. Apple announced it would be working in collaboration with the Seattle Flu Study and University of Washington late last year as part of the Apple Watch Series 6 reveal event.",
    "Using the Apple Watch 6’s blood oxygen sensor and heart rate monitor, the study hopes to see if there is a link between changes in those levels and early signs of respiratory illnesses, such as Covid-19. Apple hopes to launch studies in the future that will see if these features could also detect early signs of asthma attacks and heart failure.",
    "If you are interested in getting involved and fulfill the study’s criteria - which includes being 22 or over and living in Seattle in the US - then you can visit the Apple respiratory study page to see if you qualify.",
    "In short, no. Unless the Apple Watch starts taking swabs like current Covid-19 tests we’re fairly confident it won’t be able to determine the exact illness you have, though it may still be able to detect if you are experiencing some of the symptoms and provide you with guidance on what to do.",
    "Apple is instead looking to be able to detect the early signs of respiratory illness in general - such as seasonal flu. This would still be very useful, as while we’ve previously taken being ill as something to just deal with, we might want to take extra precautions to not spread respiratory illnesses in the future.",
    "When it comes to detecting the presence of any respiratory illness, the Apple Watch study might find success. Blood carries oxygen from your lungs to your organs and muscles to keep them functioning; respiratory illnesses - which affect your breathing - would likely impact your oxygen intake and oxygen levels. So, monitoring changes to your blood oxygen levels with the Apple Watch could be an effective way to know if you’re sick before other symptoms flare-up.",
    "Apple is likely hoping its Series 6 Watch will turn out to be an effective tool, but we’ll have to wait and see if the results of the study are in its favor. We’ll be sure to keep you updated when the study announces its findings."
  ],
  "headers": {
    "3": "Could the Apple Watch detect Covid-19 specifically?"
  },
  "links": {
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple respiratory study": "https://seattleflu.org/applerespiratorystudy"
  }
}