{
  "source": "https://www.techradar.com/news/some-of-chinas-biggest-technology-companies-are-trying-to-bypass-apples-new-privacy-rules",
  "title": "Some of China’s biggest technology companies are trying to bypass Apple’s new privacy rules",
  "category": "computing",
  "updated": "2021-03-17T15:59:22Z",
  "author": "mayank-sharma",
  "summary": "New mechanism takes advantage of a loophole in the wording of upcoming privacy policy",
  "article": [
    "A Chinese state-backed association that counts some of the world's biggest tech companies as members is testing a new mechanism to bypass Apple’s upcoming stringent privacy protocols on its App Store.",
    "Apple’s new App Tracking Transparency standards will force app developers to seek consent from iPhone users before allowing advertisers to track them across different websites and apps.",
    "To get around this, the 2000-member strong China Advertising Association has launched a new system dubbed CAID that will continue to track iPhone users - with the tool reportedly being tested by Chinese tech giants including Tencent and TikTok-owner ByteDance.",
    "Speaking to the Financial Times, Yang Congan, chief executive of Digital Union, a Beijing-based data privacy company, claims that CAID exploits a loophole in the wording of the new Apple privacy policy, which apparently has no issues with apps that don’t uniquely identify an individual user.",
    "According to reports, several Chinese companies are testing the system with ByteDance even encouraging its use in its app developer guide. Furthermore, it’s also said that while CAID is meant for Chinese developers, several multinational companies that also operate in China, have also applied to roll CAID in their apps.",
    "While Apple hasn’t officially responded to news of mechanisms to outwit its new protocols, it seems the company would be able to detect the use of the bypass mechanisms.",
    "However, based on their interactions with three unnamed individuals, Financial Times reports that Apple might be vary of taking any adverse action against apps that use CAID, especially if its use is condoned by China’s tech giants.",
    "While Apple hasn’t announced a date for enforcing its new guidelines, CAID is reportedly scheduled for public release perhaps as soon as later this week.",
    "Via: Financial Times"
  ],
  "headers": {
    "3": "May get a free pass"
  },
  "links": {
    "privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "App Store": "https://www.techradar.com/best/best-iphone-apps-2021",
    "App Tracking Transparency": "https://www.techradar.com/news/apple-could-ban-mobile-apps-that-dont-block-ad-tracking",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Financial Times": "https://www.ft.com/content/520ccdae-202f-45f9-a516-5cbe08361c34?segmentid=acee4131-99c2-09d3-a635-873e61754ec6"
  }
}