{
  "source": "https://www.techradar.com/news/slack-steps-back-on-new-dm-feature-following-harassment-concerns",
  "title": "Slack steps back on new DM feature following harassment concerns",
  "category": "computing",
  "updated": "2021-03-25T16:26:50Z",
  "author": "mike-moore",
  "summary": "Slack Connect rolled back after users air concerns",
  "article": [
    "Messaging platform Slack has rolled back a new messaging feature just hours after release following widespread concerns from users.",
    "The update to Slack Connect would have allowed any paid users of the online collaboration service to send a direct message (DM) to any other Slack user as long as they had their email address.",
    "However users were quick to point out that the feature could be used to message people without their consent, raising issues around harassment.",
    "\"We are taking immediate steps to prevent this kind of abuse, beginning today with the removal of the ability to customize a message when a user invites someone to Slack Connect DMs,\" Jonathan Prince, Slack's VP of communications and policy, told The Verge.",
    "\"We made a mistake in this initial roll-out that is inconsistent with our goals for the product and the typical experience of Slack Connect usage.\"",
    "Slack says it has now disabled the feature, and has not said if it will be returning.",
    "To get started using Slack Connect DMs, users simply needed to send an invite to anyone else using Slack - and once this was accepted, they could communicate using direct messages. The company had also planned to offer Slack Connect DM invitations to all teams soon, including those on free plan, but it's not known if those plans have been affected now.",
    "Later this year, the company had hoped that businesses would be able to use Slack Connect to securely connect to external organizations, making it easier for them to work with trusted partners without having to deal with long email threads.",
    "Over the past year, there has been a huge increase in the number of phishing scams and cyberattacks as cybercriminals attempt to capitalize on the massive number of employees working from home. While Slack Connect already restricts certain file types from being sent in channels and DMs, Slack will soon add malware protection and link scanning to the service to further prevent phishing scams and spam.",
    "Finally, the company also planned to allow two or more organizations to create their own private business network using Slack Connect. These networks will allow for unified directories, direct messaging, channel discovery and shared applications when they roll out this winter - provided Slack can assuage customers over safety.",
    "Via The Verge"
  ],
  "headers": {
    "3": "Slack Connect canned?"
  },
  "links": {
    "Slack": "https://www.techradar.com/reviews/slack",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "certain file types": "https://slack.com/help/articles/1500002249342-Restricted-file-types-in-Slack-Connect",
    "malware protection": "https://www.techradar.com/best/best-malware-removal",
    "The Verge": "https://www.theverge.com/2021/3/24/22348743/slack-connect-dm-abuse-harassment-disable-message-invite-response"
  }
}