{
  "source": "https://www.techradar.com/news/netflixs-shadow-and-bone-trailer-teases-your-next-fantasy-tv-show-binge-watch",
  "title": "Netflix's Shadow and Bone trailer teases your next fantasy TV show binge watch",
  "category": "entertainment",
  "updated": "2021-02-26T16:52:29Z",
  "author": "tom-power",
  "summary": "Netflix's Grishaverse is here",
  "article": [
    "Shadow and Bone, the fantasy TV show which comes to Netflix on April 23, has received its first trailer. Netflix dropped the two-and-a-half minute video on its social media channels on Friday, and provided fans with a first look at its adaptation of Leigh Bardugo's Grishaverse book series.",
    "Among fans, this series is a massive deal – and it could prove to be Netflix's next big fantasy hit, following The Witcher and, to a lesser extent, Cursed.",
    "The footage provides an overview at Shadow and Bone's main plot, with the TV show's synopsis interspersed with plenty of action shots and supernatural horror encounters.",
    "Check out the trailer in the tweet below, and read on for more information about what to expect from Shadow and Bone:",
    "Netflix's Shadow and Bone adaptation is based on Bardugo's internationally bestselling set of novels, which are collectively known as the Grishaverse. Bardugo's books are comprised of the Grisha trilogy – Shadow and Bone, Siege and Storm, and Ruin and Rising – and the Six of Crows duology, which is formed from the Six of Crows and Crooked Kingdom novels.",
    "Shadow and Bone's first season is based on the Grisha trilogy's first instalment. It tells the tale of Alina Starkov, a lowly soldier and orphan who unleashes an extraordinary magic power after the fleet she is traveling on is attacked by monsters from the Shadow Fold. With the looming threat of this darkness, Alina is recruited by an elite army of magic wielders known as the Grisha, but she soon finds that her enemies and allies might be one and same.",
    "Created for television by Eric Heisserer (Lights Out, Bird Box), Shadow and Bone stars Jessie Mei Li (Strangers, All About Eve) as Alina. Ben Barnes (The Punisher, Westworld) portrays General Kirigan, Freddy Carter (Free Rein, Pennyworth) has been cast as Dregs leader Kaz Brekker, and Archie Renaux will play Alina's childhood best friend Malyen Oretsev. Heisserer and Bardugo are among the show's executive producers.",
    "Something to keep an eye out for on Netflix this year, then."
  ],
  "headers": {
    "4": "What is Shadow and Bone about, and why should you care?"
  },
  "links": {
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Cursed": "https://www.techradar.com/news/could-cursed-be-your-next-netflix-obsession"
  }
}