{
  "source": "https://www.techradar.com/news/thales-picks-ovhcloud-to-host-citadel-team-encrypted-messaging-data",
  "title": "Thales picks OVHcloud to host Citadel team encrypted messaging data",
  "category": "computing",
  "updated": "2021-04-30T08:20:13Z",
  "author": "anthony-spadafora",
  "summary": "Partnership will provide 'Made in France' sovereign data hosting for Citadel Team",
  "article": [
    "As cybercriminals are increasingly targeting employees working from home, Thales has chosen OVHcloud to provide hosting for its encrypted messaging service Citadel Team.",
    "According to France's national agency for information system security ANSSI, there were four times the number of cyberattacks in 2020, compared to 2019. At the same time, there has also been a growing demand for greater security in both data sharing and communication apps.",
    "For these reasons, Thales and OVHcloud have joined forces to provide 'Made in France' sovereign data hosting for the company's Citadel Team trusted messaging service and Europe's largest web hosting company will ensure that its data is protected in transit and at rest.",
    "VP for France and Benelux at OVHcloud, Caroline Comet-Fraigneau praised the two company's expanded partnership in a press release, saying:",
    "“We welcome Thales' choice to host Citadel Team data on OVHcloud infrastructures. The combination of our strengths is good news for users looking for guarantees that their data will be respected. They can now be sure to benefit from an alternative, trusted and secure end-to-end solution.”",
    "In order to register for Thales' secure instant messaging service, users are required to sign up with a company email address. So far, the service has been adopted by more than a third of CAC 40 companies and it uses the same encryption system used by 50 NATO countries.",
    "Citadel Team provides users with the guarantee that their organization's data will not be used or sold to third parties while also ensuring that all of the data sent using the service is stored in France. Organizations will be able to manage user devices themselves and the Citadel development team recently obtained the France Cybersecurity 2021 label.",
    "In addition to end-to-end encrypted messaging and voice services, Citadel Team also includes video conferencing, group calls and screen sharing to facilitate collaboration. The service is available free of charge and Thales continues to add new functionality to it to ensure that professionals have an all-in-one communication solution without having to sacrifice data security or usability.",
    "VP of cyber defense solutions at Thales, Pierre-Yves Jolivet explained how the company's partnership with OVHcloud will allow it to to take Citadel Team to the next level, saying:",
    "“We are especially proud to announce this partnership to our customers and the general public. Thales and OVH have been trusted partners for many years, and by combining our strengths under this new hosting arrangement, we are taking the sovereign Citadel Team solution to the next level to offer our customers the very best data hosting option available.”"
  ],
  "headers": {
    "5": "Citadel Team"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "OVHcloud": "https://www.techradar.com/news/ovhcloud-looks-to-bounce-back-with-new-bare-metal-servers",
    "ANSSI": "https://www.ssi.gouv.fr/publication/lanssi-et-le-bsi-alertent-sur-le-niveau-de-la-menace-cyber-en-france-et-en-allemagne-dans-le-contexte-de-la-crise-sanitaire/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "press release": "https://www.businesswire.com/news/home/20210429005027/en/As-Cyber-Attacks-Rise-Thales-Chooses-OVHcloud-for-Made-in-France-Hosting-of-Citadel-Team-Encrypted-Messaging-Data",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}