{
  "source": "https://www.techradar.com/news/windows-xp-just-refuses-to-die",
  "title": "Windows XP just refuses to die",
  "category": "computing",
  "updated": "2021-10-26T10:43:50Z",
  "author": "joel-khalili",
  "summary": "An astounding number of computers are still running Windows XP",
  "article": [
    "Microsoft’s long-defunct Windows XP operating system (OS) is still alive and kicking, despite turning 20 years old this week, new data shows.",
    "According to the latest figures from Statcounter, Windows XP is still used by 0.59% of Windows users, who make up 75.4% of the desktop market.",
    "Rough estimates suggest there are now more than two billion laptops and computers in circulation worldwide, which would mean that nine million PCs continue to run the decades-old OS.",
    "Although many people look fondly upon Windows XP, thanks to its iconic interface and performance improvements over Windows 2000, its continued popularity is likely to cause problems.",
    "Windows XP officially reached end of life on April 14 2014, meaning Microsoft has not provided important technical and security updates for the OS for more than seven years now.",
    "Safe in the knowledge that Microsoft will no longer deliver security patches, cybercriminals can dedicate resources to developing malware designed specifically to exploit older flaws. And given the significant pool of computers that still run the unsupported operating system, the potential scope of attacks remains significant.",
    "The emergence of WannaCry ransomware in 2017, for example, forced Microsoft to make an exception and deliver a patch for Windows XP devices. But this was just a one-off.",
    "The advice for users hoping to shield against potential Windows XP exploits is to update to either Windows 10 or 11, no matter how heart-rending it may be. It’s also advisable to protect devices with a modern antivirus solution, only download content from reputable sources and exercise care when opening unsolicited email attachments.",
    "If you’re looking for a new piece of hardware, check out our list of the best business laptops and best mobile workstations."
  ],
  "headers": {
    "3": "Windows XP fans"
  },
  "links": {
    "latest figures": "https://gs.statcounter.com/os-market-share/desktop/worldwide",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "computers": "https://www.techradar.com/news/best-business-desktop-pcs",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "email": "https://www.techradar.com/news/best-email-provider",
    "best business laptops": "https://www.techradar.com/news/best-business-laptops",
    "best mobile workstations": "https://www.techradar.com/news/best-mobile-workstations"
  }
}