{
  "source": "https://www.techradar.com/news/intels-secret-weapon-could-make-your-next-laptop-upgrade-much-cheaper",
  "title": "Intel's secret weapon could make your next laptop upgrade much cheaper",
  "category": "computing",
  "updated": "2021-03-01T12:43:02Z",
  "author": "mayank-sharma",
  "summary": "Plug and play upgrades, anyone?",
  "article": [
    "Intel has quietly upgraded its enigmatic Compute Element that now sports an i7-1165G7 Processor that can be clocked up to 4.70 GHz.",
    "Code named Elk Bay, the miniscule board measures just 95 x 65 x 6 mm, and is part of Intel’s Next Unit of Computing (NUC) lineup of small-form-factor barebones computer kits that enable DIYers to roll them inside all kinds of projects.",
    "The Compute Element 11 takes NUC’s modularity one-step further by allowing users to directly plug it into a custom connector to get an instant computing boost.",
    "The quad-core i7-1165G7 Tiger Lake processor in the recently launched NUC 11 ships with 12M of cache and 16GB of LPDDR4 RAM. It also gets all the benefits of Intel’s 11th generation platform such as Iris Xe graphics, and ships with the standard complement of ports including HDMI and USB.",
    "In fact, just think of the plug-and-play computer as a self-sufficient module complete with CPU, integrated graphics, WiFi, and memory. All it requires is a standard power cable and it’s good to go.",
    "In essence, you can just plug the NUC 11 Compute Element into a spare PCIe slot on your existing PC’s motherboard. It won’t interfere with the existing processing unit, but you’ll be able to use the ports on the Compute Element and literally have one PC inside another, saving you the rigmarole of upgrading individual components.",
    "Another interesting use case is the Elite Group NU50 laptop. It’s powered by the Compute Element, which makes it easy to upgrade. Instead of replacing the entire laptop, if you need more juice you can just swap out the Compute Element, saving your old laptop for ending up in a landfill."
  ],
  "headers": {
    "3": "Environmentally-friendly computing"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Compute Element 11": "https://ark.intel.com/content/www/us/en/ark/products/212012/intel-nuc-11-compute-element-cm11ebi716w.html",
    "RAM": "https://www.techradar.com/news/best-ram",
    "graphics": "https://www.techradar.com/news/best-1080p-graphics-cards",
    "Elite Group NU50 laptop": "https://www.ecs.com.tw/en/Product/Notebook/NU50/overview"
  }
}