{
  "source": "https://www.techradar.com/news/amd-could-be-samsungs-first-3nm-customer",
  "title": "AMD could be Samsung's first 3nm customer",
  "category": "computing",
  "updated": "2021-11-18T22:30:45Z",
  "author": "anthony-spadafora",
  "summary": "Both AMD and Qualcomm are reportedly interested in Samsung's 3nm chips",
  "article": [
    "US-based AMD may be enlisting Korean tech giant Samsung to build its first 3nm chips instead of Taiwan Semiconductor Manufacturing Company (TSMC).",
    "According to a new report from Taiwan's DigiTimes, sources close to the matter believe that the close relationship between Apple and TSMC is why AMD is allegedly considering going with Samsung to manufacture its 3nm chips instead.",
    "At the same time, AMD's semiconductor business has seen strong growth this year with the research firm IC Insights estimating that it could grow its revenue by 65 percent this year. During the first three quarters of this year, the chipmaker has brought in a total of $11.5bn in revenue and if IC Insights' predictions come to be, AMD will bring in $4.5bn in Q4 2021.",
    "AMD's growth is fueled by strong data center sales and its EPYC server chips are now found in four of the top ten most powerful supercomputers according to the latest edition of the Top 500 list which ranks the world's most powerful supercomputers on a biannual basis.",
    "In addition to Samsung, it also appears that Qualcomm is interested in 3nm chips from Samsung according to a separate report from DigiTimes.",
    "The publication's sources believe that TSMC's close relationship with Apple has also left Qualcomm dissatisfied and it too could enlist Samsung to build 3nm chips.",
    "The Taiwanese semiconductor manufacturer believes that it will begin production using its 3nm manufacturing process during the first half of next year. Wccftech notes that TSMC is often believed to give Apple preference when it comes to procuring semiconductors made using its newest technologies due to their close relationship and this has allowed the iPhone maker to ship devices with the latest processors.",
    "While Samsung is expected to begin shipping devices that use its 3nm chips during the first half of next year, TSMC is a bit behind as it will start 3nm production in the second half of next year with products using its latest chips showing up in 2023. By switching from TSMC to Samsung, both ARM and Qualcomm could end up getting their hands on 3nm chips faster without having to compete with Apple for them.",
    "Looking for a new computer? We've rounded up the best business computers, best workstations and even the best mobile workstations",
    "Via Wccftech"
  ],
  "headers": {
    "4": "Moving away from TSMC"
  },
  "links": {
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "Samsung": "https://www.techradar.com/news/best-samsung-phones",
    "TSMC": "https://www.techradar.com/news/tsmc-5nm-chip-bad-news",
    "IC Insights": "https://www.icinsights.com/news/bulletins/Annual-Revenue-Growth-To-Skyrocket-Among-Top-25/",
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "four of the top ten": "https://www.techradar.com/news/watch-out-intel-amd-is-quietly-gaining-momentum-in-a-major-market",
    "Top 500 list": "https://www.top500.org/lists/top500/list/2021/11/",
    "Qualcomm": "https://www.techradar.com/news/qualcomm-wants-to-become-the-preferred-platform-for-pcs-over-intel-and-apple-m1",
    "Wccftech": "https://wccftech.com/amd-rumored-to-become-samsungs-first-3nm-customer-along-with-65-revenue-growth/",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "best business computers": "https://www.techradar.com/news/best-business-desktop-pcs",
    "best workstations": "https://www.techradar.com/best/best-workstations",
    "best mobile workstations": "https://www.techradar.com/news/best-mobile-workstations"
  }
}