{
  "source": "https://www.techradar.com/news/airpods-pro-2-release-date-could-fall-in-late-2022-but-can-we-believe-the-rumors",
  "title": "AirPods Pro 2 release date reportedly pushed back - but they could be the best AirPods yet",
  "category": "audio-visual",
  "updated": "2021-12-08T16:18:31Z",
  "author": "olivia-tambini",
  "summary": "They're set to launch alongside three new Apple Watch models",
  "article": [
    "The Apple AirPods Pro 2 – the second generation of the company's noise-cancelling true wireless earbuds – will launch in late 2022, according to respected Apple analyst Ming-Chi Kuo.",
    "Kuo says the new AirPods Pro will also come with a \"significantly upgraded chip\", which means Apple might be moving away from the H1 headphones chip that powers its current lineup of AirPods earbuds and over-ear headphones.",
    "The chip inside the AirPods is the processor that enables them to connect to your device and deliver audio to your speakers. Therefore, a new chip for the AirPods Pro 2 could bring with it a host of upgrades, both to Bluetooth connectivity and audio performance.",
    "The H1 chip was launched with the 2019 AirPods, and brought in faster pairing times, lower latency for gaming, and the ability to summon Siri with your voice alone. If Apple is introducing a new chip with the AirPods Pro 2, we'd love to see support for aptX HD, which would allow for wireless streaming of hi-res audio codecs at 24-bit/48kHz.",
    "Hi-res audio isn't a priority for everybody, especially if you're someone that just wants to stick a pair of earbuds in to listen to a podcast on your commute.",
    "There's nothing wrong with that - but hi-res audio does make a big difference to how much detail you can get from your music. More detail means more subtleties are revealed in the sound - from the previously unheard scratches of fingers on a guitar fretboard to the full dynamic range of an orchestral crescendo - and that's exciting for anyone who counts themselves as a music lover.",
    "AptX HD could also help Apple get the audiophiles onside in a way it hasn't managed to do with the recently released AirPods 3; while the AirPods lineup has been typically seen as headphones for the casual listener, Apple could afford itself a lot more credibility in the audio space if it reached out to more discerning ears.",
    "Plus, the lack of hi-res audio support seems a bit of an oversight now that the original AirPods Pro can support other codecs like Dolby Atmos spatial audio and Apple Music offers lossless audio at no extra cost for subscribers.",
    "As well as hearing about when they might arrive, we've also heard a few rumors about the new features that will come with the AirPods Pro 2. According to LeaksApplePro, the new earbuds will launch with improved active noise cancellation and fitness tracking features – including the ability to measure your blood oxygen levels, as on the Apple Watch 6.",
    "They could look very different to the original AirPods Pro, too. According to a Bloomberg report that cites \"people familiar with the plans\", the AirPods Pro will get a design overhaul in 2021, eliminating the ear stems altogether, in favor of a \"more rounded shape that fills more of a user's ear\" – just like the Samsung Galaxy Buds and the Google Pixel Buds.",
    "A revision of the controversial design it's stuck to for so long would certainly shake things up. We don't hate the protruding stems of the AirPods Pro, but they seem quite unnecessary when so many other companies have managed to pack in all the tech they need into smaller, stem-less designs.",
    "That design isn't set in stone, however. Bloomberg says that fitting the features of the AirPods Pro, including the antennas and microphones, into a more compact build has proved to be a challenge so Apple far, which \"could result in a less ambitious design when the final product is finalized\".",
    "Whatever the AirPods Pro 2 look, sound, and perform like, it doesn't look like we'll be finding out for around another year – and if the previous year's rumor-then-disappointment cycle of the AirPods 3 is anything to go by, we could be waiting longer still.",
    "As with any rumor, we can't say for sure that the AirPods Pro 2 will launch in late 2022 – Apple hasn't confirmed if or when it plans to release a new version of its noise-cancelling earbuds.",
    "However, Ming-Chi Kuo has often been proven right in his predictions, and his claims back up a previous report from Twitter user @FrontTron (via MacRumors), who said the launch of the premium wireless earbuds has been pushed back from Q2 2022 to Q3 2022 for an as-yet-unspecified reason."
  ],
  "headers": {
    "8": "Analysis: how does this rumor fit in with what we know so far about the AirPods Pro 2?"
  },
  "links": {
    "Apple AirPods Pro 2": "https://www.techradar.com/news/apple-airpods-pro-lite-what-we-want-to-see-from-the-rumored-true-wireless-earbuds",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "2019 AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "podcast": "https://www.techradar.com/best/podcast-hosting/news/the-best-podcast-apps-for-mac-users/uk/news/best-podcasts",
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "LeaksApplePro": "https://twitter.com/LeaksApplePro/status/1318146299913490433",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-28/apple-plans-redesigned-airpods-for-2021-new-airpods-pro-in-2022",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "Google Pixel Buds": "https://www.techradar.com/reviews/google-pixel-buds-2020",
    "noise-cancelling earbuds.": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "@FrontTron": "https://twitter.com/FrontTron/status/1459000065247219718",
    "MacRumors": "https://www.macrumors.com/2021/11/12/airpods-pro-2-release-third-quarter-2022/"
  }
}