{
  "source": "https://www.techradar.com/news/the-oneplus-watch-is-arriving-on-march-23-alongside-the-oneplus-9",
  "title": "The OnePlus Watch is arriving on March 23 alongside the OnePlus 9",
  "category": "wearables",
  "updated": "2021-03-13T16:30:24Z",
  "author": "david-nield",
  "summary": "A not-so-subtle hint from OnePlus",
  "article": [
    "The OnePlus Watch has been a long time coming, but the wait is almost over: OnePlus has all-but-confirmed that the wearable will be making its official debut on March 23, when we'll also be getting our first proper look at the OnePlus 9.",
    "In a tweet and a forum post, OnePlus revealed a glimpse of what looks very much like a smartwatch, adding that \"You asked for it. You're getting it.\" on social media. If this isn't the OnePlus Watch we'd be absolutely amazed.",
    "\"This fresh addition to the OnePlus family is healthy, punctual and even takes care of you while you sleep,\" OnePlus goes on to say in its forum post – so we're guessing the device tracks your sleep, tells the time, and has plenty of fitness features built in.",
    "The tweet also references March 23, which is when OnePlus has told us it's going to be unveiling the OnePlus 9 series. A partnership with Hasselblad on the smartphone cameras is one feature that OnePlus has teased so far.",
    "Rumors of a OnePlus smartwatch stretch back years. Back in 2016 the company confirmed that such a device had been in the early stages of development, but that the company had decided to focus exclusively on phones in the future.",
    "Eventually, OnePlus changed its mind. There had been plenty of speculation that the OnePlus Watch was back on the drawing board once again even before CEO Pete Lau said that the wearable was definitely on the way.",
    "That announcement was made at the end of last year and since then the question has been when it would see the light of day. With a OnePlus 9 event on March 23, that date was already a good bet, but it's now just about confirmed.",
    "We haven't heard too much about what the OnePlus Watch might bring with it in terms of specs and features, but based on patent filings it looks as though there will be a couple of variants at least. In a couple of weeks, all will be revealed."
  ],
  "headers": {},
  "links": {
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "tweet": "https://twitter.com/oneplus/status/1370374027127099401",
    "forum post": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-3045966412053232000&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Fcontest-watch-this-space-for-something-new.1396677%2F",
    "OnePlus has told us": "https://www.techradar.com/news/oneplus-9-phones-launch-march-23-and-its-hasselblad-cameras-are-the-focus",
    "Back in 2016": "https://www.techradar.com/news/wearables/here-s-what-the-oneplus-smartwatch-you-ll-never-own-looks-like-1324119",
    "definitely on the way": "https://www.techradar.com/news/oneplus-watch-officially-confirmed-by-ceo-pete-lau",
    "based on patent filings": "https://www.techradar.com/news/oneplus-watch-could-come-in-a-sporty-design-as-well-as-a-standard-one"
  }
}