{
  "source": "https://www.techradar.com/news/jamf-boosts-security-offering-with-wandera-deal",
  "title": "Jamf boosts security offering with Wandera deal",
  "category": "computing",
  "updated": "2021-05-12T16:07:50Z",
  "author": "mayank-sharma",
  "summary": "Jamf touts zero trust as the ideal mechanism to serve remote-first work environments",
  "article": [
    "Mobile device management (MDM) firm Jamf is set to acquire cloud security and network access provider, Wandera.",
    "Jamf is one of the most popular MDM providers, used across 20 million Apple devices worldwide, and the company says its Wandera acquisition will help bolster security offerings for enterprise users.",
    "According to Jamf, Wandera brings Zero Trust Network Access (ZTNA), mobile threat defense and data policy features to the Jamf offerings. Together these will help remote mobile workers safely access corporate network resources, in full compliance with organizational policies, while reducing their mobile charges.",
    "“The combination of Wandera and Jamf will provide our customers a single source platform that handles deployment, Application Lifecycle Management, policies, filtering, and security capabilities across all Apple devices while delivering Zero Trust Network Access for all mobile workers,” said Jamf CEO, Dean Hager.",
    "The pandemic-enforced move towards remote-first work environments brings with it added security burdens on enterprises to maintain the integrity of company resources, without adding needless barriers for its remote workforce.",
    "Citing IDC’s 2020 US enterprise survey, which finds iPhone devices account for 49% of the smartphone installed base among enterprises, Jamf says that together with Wandera they’ll now be able to help corporate IT and security teams protect the devices, data and applications used by their mobile workforce.",
    "The all cash deal is valued at $400 million and is expected to take place over two transactions and is expected to close in Q3 2021, after the necessary regulatory approvals."
  ],
  "headers": {
    "4": "Securing mobile workforce"
  },
  "links": {
    "MDM": "https://www.techradar.com/best/best-mdm-solutions",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Apple devices": "https://www.techradar.com/news/best-iphone",
    "remote mobile workers": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}