{
  "source": "https://www.techradar.com/news/microsoft-teams-update-will-help-you-cut-through-all-the-nonsense",
  "title": "Microsoft Teams update will eliminate one of the most common remote working problems",
  "category": "computing",
  "updated": "2021-11-15T17:26:38Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams will help you keep notifications in check",
  "article": [
    "Microsoft is working on a new feature for collaboration platform Teams that should help address a common remote working problem.",
    "According to a new post in the company’s product roadmap, Microsoft Teams will soon afford users tighter control over their activity feed notifications.",
    "“Users will be able to change the type of notification that appears in the activity feed. Right click on the feed item, and you will be able to turn on/off all reactions and select the apps you would like to get notifications from,” explained Microsoft.",
    "The new feature is currently under development, but is set to roll on in preview later this month and go live for all users in December.",
    "Since the start of the pandemic, plenty has been said about the effects of remote working on business culture and mental health.",
    "Some remote workers have said they feel pressured to make themselves available outside of traditional hours, making it difficult to strike an effective work-life balance.",
    "Others, meanwhile, have been buried in a storm of notifications as a result of the switch to digital forms of communication (whether via email, text chat or video conference). And this problem is only aggravated by the rising number of third-party integrations for platforms like Teams.",
    "By allowing users to specify which types of alerts they receive, the latest Teams update should help alleviate (if not eliminate) the kinds of problems that have cropped up as a result of the new reliance on digital collaboration tools and online productivity software.",
    "Notification customization will also synergize with another feature that’s also under development, which will allow Teams users to switch off notifications during meetings. As per a separate roadmap entry, users will be able to turn off notifications during all meetings, or on a per meeting basis.",
    "Clearly, Microsoft is aware of the damaging effects of notification storms on both productivity and wellbeing. And these latest Teams updates should at least go some way to correcting the issue."
  ],
  "headers": {
    "4": "Microsoft Teams notifications"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "new post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1371257263393518800&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D88400",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "email": "https://www.techradar.com/news/best-email-provider",
    "video conference": "https://www.techradar.com/best/best-video-conferencing-software",
    "productivity software": "https://www.techradar.com/best/best-productivity-apps",
    "switch off notifications during meetings": "https://www.techradar.com/news/microsoft-teams-update-will-help-you-focus-during-meetings"
  }
}