{
  "source": "https://www.techradar.com/news/the-first-ever-quantum-computing-powered-security-platform-is-here",
  "title": "The first-ever quantum computing-powered security platform is here",
  "category": "computing",
  "updated": "2021-12-07T15:43:16Z",
  "author": "sead-fadilpasic",
  "summary": "Cryptographic keys generated by quantum computers are coming to the market",
  "article": [
    "Cryptographic keys generated by quantum computers are coming to the market after Cambridge Quantum announced the launch of a platform that can generate such keys.",
    "The company uses quantum computing to create a “particularly random” encryption key, its head of cybersecurity, Duncan Jones, told Reuters. He claims that quantum computers can generate a more secure, less vulnerable encryption key, as this type of key is more random.",
    "Called “Quantum Origin”, the service will first be offered to financial services firms and cybersecurity orgnaizations, before moving into other high priority sectors, such as telecommunications, energy, manufacturing, defence, and government.",
    "\"We have been working for a number of years now on a method to efficiently and effectively use the unique features of quantum computers in order to provide our customers with a defense against adversaries and criminals now and in the future once quantum computers are prevalent,\" Ilyas Khan, CEO of Quantinuum and founder of Cambridge Quantum said in a statement.",
    "\"Quantum Origin gives us the ability to be safe from the most sophisticated and powerful threats today as well threats from quantum computers in the future.\"",
    "Quantum computing is described as the next major milestone in the development of computing machines, but it was also viewed with angst as it was believed to be able to threaten today’s encryption solutions.",
    "Being infinitely faster than traditional machines, it was feared quantum computers could break the industry-standard encryption algorithm, the Advanced Encryption Standard (AES). This algorithm is used by the US Government, as well as numerous other organizations, according to Storagecraft.",
    "Its 128-bit form is “highly efficient”, it was said but 192 and 256-bit keys are also in use.",
    "Unlike standard computers, whose bits can either assume the state of 0 or 1 (hence, binary) quantum computers’ bits (or qubits, as they’re called) can assume both states at once, creating exponentially more paths for solutions."
  ],
  "headers": {
    "3": "Industry standard on encryption"
  },
  "links": {
    "Reuters": "https://www.reuters.com/technology/honeywell-backed-company-sell-super-secure-quantum-encryption-key-2021-12-07/",
    "according to Storagecraft": "https://blog.storagecraft.com/5-common-encryption-algorithms/"
  }
}