{
  "source": "https://www.techradar.com/news/theres-a-secret-web-browser-hidden-on-ps5-heres-how-to-access-it",
  "title": "There's a secret web browser hidden on PS5 – here's how to access it",
  "category": "gaming",
  "updated": "2021-08-30T01:56:58Z",
  "author": "vikki-blake",
  "summary": "Surf’s up",
  "article": [
    "While the PS5 is superior to its predecessor in many ways, one downgrade has been the removal of the integrated web browser that is available on PS4. At least, that's what we were led to believe before today, anyway.",
    "It turns out that the PS5 has had a web browser all along – we just didn't know about it. As spotted by ArsTechnica, there's a \"limited, hidden web browsing interface\" that can be used to surf the web.",
    "To access it, hit System Settings > User's Guide, which takes you to the website manuals.playstation.net. As ArsTechnica explains it, accessing the website from your usual device, you'll get nothing but an error message denying you access, but if you navigate there from within your PS5, you'll get instructions on how to use the guide with your DualSense controller.",
    "At that point, it's easy to presume you can't load up any other websites, but if you scroll down to the Users and Accounts submenu and hit \"Link with Other Services\", you can link to your Twitter account. From there, all links you find on Twitter – be it images, videos, or standard websites – will be accessible. Well. Kind of.",
    "We say they'll be \"accessible\", but it's fair to say that you'll have more luck loading text-rich sites as pictures and videos don't always function correctly. For instance: though you can watch videos it's not possible to go full-screen on YouTube for some reason, and while you can load music sites like Bandcamp and Spotify on the limited browser, testers were unable to stream music through it.",
    "If you're still trying to find out where to buy PS5, you're not alone. Sony's next-gen system is still pretty hard to get hold of, but we've seen more regular drops at certain retailers, like Best Buy and Walmart in the US, and Very and Game in the UK. If you're getting desperate, it can be tempting to head over to a reseller site, but we'd recommend staying well clear of these price hiked sites and instead sticking with retailers you know and trust.",
    "Let's face it; while we use our consoles for many things – playing videos, watching TV, streaming music, or spectating livestreams – browsing the internet isn't necessarily at the top of that list.",
    "While things may have been different in the early days of PS4, today we can go online via a number of other devices, including our phones and watches. Coupled with Sony's less than elegant UI – have you ever tried to type in a long URL with random letters and numbers at the end with nothing but your controller? – it would come as no surprise if players failed to use their PS4 browser at all, let alone regularly.",
    "That said, using a small, hidden browser to host the console's user manual is a stroke of brilliance. Not only does it enable Sony to easily and quickly update the manual without having to rely on us keeping our systems updated, it also shows that if demand suddenly should spike again, Sony could reintroduce a fully-functionable browser that much more easily.",
    "It’s worth noting that Microsoft’s Xbox Series X and Xbox Series S do have browser support, and a new version of Microsoft Edge will soon let users play Stadia on their Xbox devices. The new Edge browser will also support keyboard and mouse so you could technically use your Xbox Series X as a mini, albeit extremely limited PC, if you like."
  ],
  "headers": {
    "6": "Analysis: why did Sony hide the PS5 browser?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "ArsTechnica": "https://arstechnica.com/gaming/2020/11/the-playstation-5-has-a-hidden-web-browser-heres-how-to-find-it/",
    "manuals.playstation.net": "http://manuals.playstation.net/",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "where to buy PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "play Stadia on their Xbox devices": "https://www.techradar.com/news/you-can-play-stadia-on-xbox-series-x-soon-but-should-you-bother"
  }
}