{
  "source": "https://www.techradar.com/news/amazons-smart-fridge-could-be-more-trouble-than-its-worth",
  "title": "Amazon’s smart fridge could be more trouble than it's worth",
  "category": "smart-home",
  "updated": "2021-10-06T09:01:28Z",
  "author": "carrie-ann-skinner",
  "summary": "Opinion: a fridge that order on your behalf means you’ll get bored of your favorite dishes",
  "article": [
    "Smart gadgets that let us outsource our chores, so we can enjoy our free time as we see fit, are extremely handy. Let’s face it, we’d all rather put our feet up and enjoy a good book or movie, rather than focus on vacuuming or putting a grocery order together.",
    "These days the best smart speakers and smart displays can read a recipe aloud, or in the case of smart displays show it on screen, so you don’t have to keep picking up your smartphone when cooking. The best robot vacuums can take on the chore of cleaning your floors for you, too. But is a smart refrigerator that orders the groceries on your behalf really a good idea?",
    "That’s what Amazon is working on, according to Insider. Known internally as Project Pulse, the smart fridge is designed to track your grocery habits, predict what items you want and get them delivered so you never run out of your favorite foods.",
    "At the same time, Amazon’s smart fridge would also offer the features found on other cutting-edge refrigerators such as the Samsung Family Hub by monitoring expiration dates and even offering recipe suggestions based on the items in the fridge. However, the report claims it would build on this by allowing you to quickly order supplies from Amazon Fresh, or in the US, Whole Foods.",
    "In theory, this might sound like the ultimate time-saver. Whether you prefer to purchase your groceries in person, or use an online shopping service, as I do, it can still take quite some time to complete the task; from booking a delivery slot to amending the order and sourcing alternatives if what you want isn't available, it’s certainly not my favorite past time.",
    "Amazon hasn’t disclosed how the smarts of the fridge will work when it comes to predicting the groceries you want and ordering them for you, but it’s likely it will be based on your habits. There are some items I buy every week; I’ll pick up certain fruits and vegetables to form a mirepoix and make up the base for everything from ragu for bolognese and lasagne to soups and stews.",
    "However, aside from these items, my weekly shops are often full of different items, as I like to vary the meals I cook so I don’t get bored of routine dishes. But leaving the Amazon fridge to order my groceries for me isn’t going to let that happen.",
    "Instead, I’ll find myself with a static meal plan that rarely changes, and eventually, I’ll become uninspired by my favorite meals. Unfortunately, food boredom for me leads to picking up the nearest take-away menu too, which isn’t helpful when you’re trying to stay healthy.",
    "Finally, if you leave the ordering to someone else, in this case, Amazon, you’re likely to miss out on special offers too – something which you can easily access when ordering online yourself.",
    "As we’ve already mentioned, other fridges on the market already offer the ability to track expiration dates and suggest recipes based on the ingredients inside, and this is a handy feature, especially as it means you don’t have to reach for your smartphone. While I think Amazon is giving traditional appliance manufacturers a run for their money, just as the brand has done with TVs, I’m not sold on the automatic ordering. While I’d love some more free time in my life, I’ll stick to handling this chore myself, for my palette’s sanity at least."
  ],
  "headers": {
    "4": "Automation reduces choice"
  },
  "links": {
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "smart displays": "https://www.techradar.com/best/best-smart-displays",
    "best robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "Insider": "https://www.businessinsider.com/amazon-is-building-smart-fridge-that-monitors-your-buying-patterns-2021-10?r=US&IR=T"
  }
}