{
  "source": "https://www.techradar.com/news/spacex-surpasses-apollo-with-tallest-ever-rocket-on-a-launchpad",
  "title": "SpaceX surpasses Apollo with tallest-ever rocket on a launchpad",
  "category": "appliances",
  "updated": "2021-08-06T22:10:50Z",
  "author": "john-loeffler",
  "summary": "SpaceX beats the Saturn V moon rocket by a healthy margin",
  "article": [
    "SpaceX set a world record this week for the tallest rocket ever assembled after it stacked and mated its Starship spacecraft onto the company's main Super Heavy rocket booster, beating out the NASA Saturn V rocket that sent Apollo 11 astronauts to the moon.",
    "Starship Serial No. 20 (SN20) was hoisted up by crane onto the main Super Heavy booster on the morning of Friday, August 6, outside of Boca Chica, Texas, as part of a stacking test in preparation for Starship's first ever orbital launch later this year, per Space.com.",
    "There was no official SpaceX livestream of the testing, but the stacking was captured by both NASASpaceflight.com and Spadre.com's 24/7 livecams of the testing site. The company, along with SpaceX founder Elon Mush, tweeted out some pretty impressive pics of the towering rocket from the launchpad as well.",
    "NASA's Saturn V rocket, which carried Apollo 11 astronauts to the moon in 1969, topped out at 363 feet, while the stacked Starship spacecraft and the Super Heavy Booster combined for a total of 395 feet, about as tall as a 36-story building.",
    "Successfully mating SpaceX's crew-carrying Starship with the powerful Super Heavy rocket system (which will hopefully carry it into orbit as early as this year) is a major step for the company, and not just for its record-setting height.",
    "Earlier this week, Boeing and United Launch Alliance (ULA) had to scrub their second attempt at launching the Boeing Starliner to the International Space Station (ISS) after an unexpected \"valve position indication\" appeared in pre-launch tests.",
    "Boeing, one of the biggest names in aerospace, still has not managed to get an automated, uncrewed Starliner capsule docked with the ISS more than two years after SpaceX accomplished its automated, uncrewed docking with the orbiting station, and more than a year after SpaceX's first successful crewed flight and docking with the ISS in May 2020.",
    "Back in April of this year, NASA chose SpaceX's Starship to bring the first astronauts back to the moon after a decades-long absence as part of NASA's Artemis program. The rocket that was assembled today will make up the core of that launch, which is expected to take place in 2024.",
    "Starship and Super Heavy still need to undergo server further tests before it is ready for lift off, according to TechRadar's sister site Space.com, including testing its thermal shielding and other launch equipment. It is also awaiting a US Federal Aviation Administration environmental review of its launch operations, with no word yet on when that will be finished."
  ],
  "headers": {},
  "links": {
    "Space.com": "https://www.space.com/spacex-starship-super-heavy-booster-stacked-1st-time",
    "NASASpaceflight.com": "https://www.youtube.com/watch?v=mhJRzQsLZGg",
    "Spadre.com's": "https://www.youtube.com/watch?v=YbKEWlhWN5c",
    "tweeted out": "https://twitter.com/SpaceX/status/1423700328717840385?s=20",
    "scrub their second attempt": "https://www.techradar.com/news/nasa-boeing-scrub-starliners-iss-launch-at-last-minute",
    "NASA chose SpaceX's Starship": "https://www.nasa.gov/press-release/as-artemis-moves-forward-nasa-picks-spacex-to-land-next-americans-on-moon"
  }
}