{
  "source": "https://www.techradar.com/news/facebooks-app-could-soon-see-video-and-voice-calls-added",
  "title": "Facebook’s app could soon see video and voice calls added",
  "category": "computing",
  "updated": "2021-08-24T03:35:07Z",
  "author": "jasmine-gearie",
  "summary": "Is the social media giant looking to integrate Messenger into Facebook again?",
  "article": [
    "Years after removing direct messaging features from the main Facebook app, the social media giant looks to be considering their return as it tests the addition of voice and video calls to Facebook, according to Bloomberg.",
    "Facebook users were previously only able to make voice and video calls to other users through Facebook’s separate Messenger app when on mobile, but the testing will see some accounts able to make these calls using the main app.",
    "Facebook’s director of product management, Connor Hayes, told Bloomberg the test is looking to streamline communication by removing the need to switch between the main Facebook app and Facebook Messenger.",
    "It’s as yet unclear whether Facebook will bring the primary feature of Messenger – text chat – back into the main app, but some integration of other Facebook properties has already started to happen.",
    "Instagram and WhatsApp are both owned by Facebook, and it has already enabled users to connect their Messenger and Instagram chats together since September last year. There’s also talk of connecting WhatsApp and Messenger chats as well.",
    "Speaking to Bloomberg, Hayes said: “You’re going to start to see quite a bit more of this over time”.",
    "Facebook first removed messaging features from its mobile app in 2014, which meant users needed to download Messenger if they wanted to continue sending direct messages to other Facebook users from mobile.",
    "While there’s argument to be made for streamlining messaging back into the main Facebook app, there’s also a good case for keeping them separate. Facebook certainly isn’t what it used to be – moving from a social media site where users shared text or status posts to one that now primarily sees users sharing links and viewing ads.",
    "Some users may still want to bypass the stream of news, advertisements and shared posts by using Messenger to communicate with friends and family, while others have removed the main Facebook app from their phone altogether.",
    "Data collected by SimilarWeb shows that while WhatsApp is the messaging app of choice in most countries, Messenger comes in second, and is the app of choice in countries such as the United States, Australia, Canada and France.",
    "Either way, Facebook wins when it comes to messaging apps, but the question is whether integrating Messenger features back into the main app will help the business, or have users looking for alternatives in the long term."
  ],
  "headers": {
    "6": "Analysis: are two apps better than one?"
  },
  "links": {
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-23/facebook-retools-messaging-again-by-adding-calling-to-main-app",
    "connect their Messenger and Instagram chats together": "https://www.techradar.com/news/facebook-begins-connecting-messenger-and-instagram-chats-together",
    "connecting WhatsApp and Messenger chats": "https://www.techradar.com/news/facebook-may-be-planning-a-huge-change-for-whatsapp-and-messenger-users",
    "SimilarWeb": "https://www.similarweb.com/corp/blog/research/market-research/worldwide-messaging-apps/"
  }
}