{
  "source": "https://www.techradar.com/news/libreoffice-urges-businesses-to-switch-to-enterprise-edition",
  "title": "LibreOffice urges businesses to switch to Enterprise edition",
  "category": "computing",
  "updated": "2021-02-08T11:30:37Z",
  "author": "mayank-sharma",
  "summary": "New releases of the office suite will now be labelled as “Community”",
  "article": [
    "The developers of LibreOffice, the popular open source alternative to Microsoft Office, have urged their business and other commercial users to switch to the enterprise edition of the office suite.",
    "The Documentation Foundation (TDF) makers of LibreOffice, argue that they've long been recommending business users to use the commercial edition of the software from one of its ecosystem partners such as Collabora and Red Hat.",
    "“Despite this recommendation, an increasing number of enterprises have chosen the version supported by volunteers over the version optimized for their need,” note TDF as it announced the latest v7.1 release of the cross-platform office suite.",
    "LibreOffice v7.1 includes several noteworthy features and improvements.",
    "Starting with this release, the open source edition of LibreOffice has officially been branded as \"LibreOffice Community”. This, the developers reason, will further emphasize that these releases are intended primarily for personal and individual use.",
    "TDF remarks that the lack of enterprise support has become a problem and is in fact slowing down the evolution of the office suite.",
    "It adds that the use of the community edition by for-profit companies adds nothing of value to the community and is actually “a poor use of volunteers’ time, as they have to spend their time to solve problems for business that provide nothing in return to the community.”",
    "On the other hand, thanks to the arrangement the TDF has with its ecosystem companies, any piece of code they develop for paying customers makes its way into the open source community edition, which “improves the product and fosters the growth of the LibreOffice Technology platform.”"
  ],
  "headers": {
    "3": "Two-fold impact"
  },
  "links": {
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "alternative to Microsoft Office": "https://www.techradar.com/best/free-office-software",
    "LibreOffice": "https://www.techradar.com/reviews/libreoffice-7",
    "LibreOffice v7.1": "https://blog.documentfoundation.org/blog/2021/02/03/libreoffice-7-1-community/"
  }
}