{
  "source": "https://www.techradar.com/news/youre-wrong-about-the-environmental-impact-of-video-streaming-heres-why",
  "title": "You're wrong about the environmental impact of video streaming - here's why",
  "category": "computing",
  "updated": "2021-07-07T03:03:58Z",
  "author": "abigail-opiah",
  "summary": "We’ve been looking at the environmental impact of streaming from the wrong angle",
  "article": [
    "The Covid-19 pandemic saw a surge in online streaming as the world was forced to stay indoors as part of lockdown measures put in place to keep people safe.",
    "According to Ofcom’s annual study into UK media habits, at the height of the pandemic, people spent twice as much time watching subscription streaming services such as Netflix, Disney+ and Amazon Prime Video.",
    "With newcomers like Disney+, Discovery+, and NBC’s Peacock all entering a highly competitive market, digital services monetization company Vindicia found that the average US household subscribed to more media services than ever last year.",
    "However, entertainment value aside, another narrative has been circulating, regarding data usage, power consumption and the effects of streaming on the environment.",
    "A recent article from MIT analyzed the increase in emissions caused by working from home during the pandemic, with researchers predicting that if remote work continues through the end of 2021, the global carbon footprint could grow by 34.3 million tons in greenhouse gas emission - caused by streaming and video conferencing.",
    "And a research paper from Simon Fraser University in Canada put it even more bluntly: \"Streaming large files in large quantities ... ethically implicates spectators in the warming of the planet.\" But just how much of a negative impact does streaming have on the environment?",
    "Emma Fryer, Associate Director and Susanne Baker, climate, environment and sustainability associate director at non-profit think tank techUK, both highlighted that contrary to what you might think, the rates at which we stream videos is having a relatively small impact on climate change. They both challenged the assumption that streaming video is by definition harmful.",
    "“Yes, streaming uses energy but it is replacing consumption models that were much more carbon intensive; previously we travelled to the cinema physically to watch new releases and for video on demand we had to go out and buy or rent physical media – DVDs or, for those who remember them, VHS tapes,” Fryer and Baker told TechRadar Pro.",
    "“Streaming video is a much more efficient way to consume content than traditional approaches, but the result is that we consume much more – a classic rebound factor.”",
    "A white paper published in June 2021 by the Carbon Trust concerning online streaming concluded that the amount of carbon emitted per hour of video streaming in Europe is actually relatively small compared to other use cases. The two biggest factors impacting the amount of carbon generated were the electrical grid’s carbon intensity and the kind of devices used to stream the content.",
    "“In Europe, it is estimated that 56g of carbon are emitted per hour of streaming, while in the UK, as we are slightly more advanced in bringing renewables on to the grid, 48g of carbon is emitted,” Fryer and Baker added.",
    "“The lowest was in Sweden and France (3g and 10g respectively), due to their decarbonised and efficient electricity grid. So, the more we decarbonise our electricity sector, the lower the emissions associated with streaming will become.”",
    "For the average user in Europe, an hour of video streaming is approximately 55gCO2e (carbon dioxide equivalent), which is comparable to boiling an electric kettle three times, the report found.",
    "With this in mind, tackling the emissions associated with streaming continues to be on the world's agenda. Earlier this month, world leaders gathered in Cornwall for the G7 Summit, where the UK government launched a new partnership on infrastructure investment aimed at boosting global green economic growth as part of a commitment to increased international climate finance.",
    "Fryer and Baker note that the most important thing the world can do is continue to decarbonize electricity grids to limit the carbon associated with streaming (and any other activity that uses electricity).",
    "Streaming giants, tech leaders and many countries around the world have all made pledges to become carbon neutral, however their deadlines and the scope of their ambitions vary widely.",
    "Netflix promised to achieve net zero greenhouse gas emissions by 2022, Microsoft pledged back in January 2020 to be completely carbon neutral by 2030, Amazon set a target for 2040, and the EU gave itself till 2050 to be climate neutral.",
    "Meeting these ambitious targets will eventually require complete decarbonization and getting to net-zero requires significant abatement of greenhouse gas emissions across all sectors of the economy to ultimately reduce carbon dioxide emissions.",
    "Steven Chung, President, Worldwide Field Operations at software company Delphix, said: “Sustainability is a mandate and without having that mandate as an organization, I don’t think they will be viable in the future. Nobody wants to do business with or be part of an organization that is short sighted.",
    "“The pandemic has helped organizations rethink how they operate moving forward for the benefit of sustainability.”",
    "Globally, 36% of network operators have now signed up to the UN’s Race to Zero campaign and committed to net zero emissions by 2050 at the latest – judged to be a breakthrough moment by the UNFCCC, when sufficient momentum is generated by a critical mass of key actors to enable the whole sector to break away from business as usual.",
    "Fryer and Baker both found that data center operators are actively exploring options such as power purchase agreements, which stimulate additional utility scale renewable generation, and are positioning themselves as anchor customers for green hydrogen and industrial scale battery storage when those markets mature.",
    "“But we can also do lots at an individual level. Since the majority of the impact of streaming relates to the use of green energy and end user devices individuals can really make a difference: switching to renewable power in the home is a great start, watching on smaller devices, extending the life of those devices and not being profligate in consumption of content,” they added.",
    "“And as consumers we can exert power through personal choice: we can check out the carbon credentials of our streaming service providers and our device manufacturers, we can choose our content and how it is delivered accordingly and we can continue to demand that our government decarbonise the electricity sector.”",
    "They explained that, for data centre operators, it is pretty easy to be transparent about energy and carbon, both to customers and at sector level.",
    "“However, it gets a lot more complicated when you look at cloud services, but we are seeing good progress here in providing more transparency,” they noted.",
    "“Netflix has recently commissioned third party research and reported publicly on the carbon impact of streaming which sets a great example.”",
    "In 2018, around 31% of U.S. television households made use of 4K Ultra HDTV products. Since first becoming commercially available in the early 2010s, ultra-high-definition products have transitioned from a luxury good to a standard for household devices.",
    "HD-quality video uses about 0.9GB (720p), 1.5GB (1080p) and 3GB (2K) per hour and a 4K stream uses about 7.2GB per hour. With 4K resolution containing four times the information of a regular HD frame, the push for cost-effective and environmentally friendly solutions to accelerate video delivery will also continue to rise.",
    "However, the Carbon Trust report pointed out that it’s not the quality of the streaming but how you view it which is important.",
    "It’s perhaps no surprise that watching something on a big TV vs a laptop or smartphone will require more energy. The smaller the device, the smaller the energy needed to power it, added Fryer and Baker.",
    "Assume that on average, a person watches TV for six hours every day and their LED TV uses 50 watts of electricity - this would mean that the TV is using a total of 300 watt-hours per day. However, phones and tablets are more energy efficient because they are designed to run on a battery for a long period of time. Phones typically use 2-6 watts when charging, while a charger left plugged in without a phone will consume 0.1-0.5 of a watt.",
    "“We need to keep an eye on system boundaries – what are we not doing, what consumption can we avoid by streaming? Secondly, buy renewable energy tariffs and support the government in decarbonising the electricity grid. Third, whilst grids are being decarbonized, stream content on smaller devices if you can,” they added.",
    "Andie Stephens, Associate Director at the Carbon Trust and lead author of the white paper, commented: “Our white paper shows that the carbon footprint of watching an hour of streamed video content is minor compared with other daily activities.”",
    "“As the electricity grids continue to decarbonize, and telecoms network operators increasingly power their networks with renewable electricity this impact is set to reduce even further. By undertaking this research with the support of the industry and academic experts, we hope to help inform discussions about the carbon impact of video streaming and of wider ICT use, and address some misunderstandings and outdated estimates that have been previously reported.”",
    "With the population consuming a lot more content through streaming, the amount of content streamed will have an impact if peak demand cannot be met. This will require an increase in green infrastructure capacity.",
    "And until grids are decarbonized, minimizing the carbon impact associated with streaming by signing up to a renewable energy tariff is a step in the right direction."
  ],
  "headers": {
    "9": "Bad streaming",
    "15": "Reducing carbon emissions",
    "27": "From HD to 4K",
    "33": "A solution"
  },
  "links": {
    "streaming": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Ofcom’s annual study": "https://www.ofcom.org.uk/about-ofcom/latest/media/media-releases/2020/lockdown-leads-to-surge-in-tv-screen-time-and-streaming",
    "Disney+": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Amazon Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "Vindicia": "https://vindicia.com/company/in-the-news/digital-streaming-choices-drive-content-subscriptions",
    "MIT": "https://news.mit.edu/2021/how-to-reduce-environmental-impact-next-virtual-meeting-0304",
    "Carbon Trust": "https://prod-drupal-files.storage.googleapis.com/documents/resource/public/Carbon-impact-of-video-streaming.pdf",
    "Netflix": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7995166908319326000/https://about.netflix.com/en/sustainability",
    "Microsoft pledged": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5062403872422674000&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fblog%2F2020%2F01%2F16%2Fmicrosoft-will-be-carbon-negative-by-2030%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyoure-wrong-about-the-environmental-impact-of-video-streaming-heres-why",
    "Amazon set a target": "https://sustainability.aboutamazon.com/about/the-climate-pledge",
    "the EU": "https://ec.europa.eu/clima/policies/strategies/2050_en",
    "a breakthrough moment by the UNFCCC": "https://racetozero.unfccc.int/mobile-sector-breakthrough/",
    "31% of U.S. television households": "https://www.statista.com/statistics/736142/4k-ultra-hdtv-us-household-penetration/",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "300 watt-hours per day": "https://the-motherload.co.uk/the-energy-consumption-of-your-tv/"
  }
}