{
  "source": "https://www.techradar.com/news/get-90-off-your-gsm-kit-with-boost-mobiles-new-black-friday-deal",
  "title": "Get 90% off your GSM kit with Boost Mobile's new Black Friday deal",
  "category": "phones",
  "updated": "2021-11-16T11:22:26Z",
  "author": "alex-whitelock",
  "summary": "A total of $15 off for new customers",
  "article": [
    "Boost Mobile's Black Friday promotion has just started and it's offering a $9 price cut plus free shipping on its GSM kit - a nice little bonus if you're looking for a discount on one of the best prepaid plans on the market right now ahead of Black Friday 2021.",
    "Since the postage and packaging fees are $4.99 on this kit, you're essentially getting a $15 price cut as a new customer. And, considering this carrier offers prepaid plans from $15 per month, you could view this as getting the first month on the house if you go for the basic 2GB/mo plan.",
    "All of Boost Mobile's plans include unlimited talk and text, as well as 5G speeds where applicable so you don't need to worry about being stuck in the slow lane with these prepaid plans. As always with most prepaid plans there are also no lengthy contracts to sign up to either - you're free to come and go as you wish without any big commitments.",
    "Note, Boost Mobile runs on the T-Mobile network and this promo is 'bring your own phone' only. You'll need a GSM-compatible unlocked phone to be able to use the SIM in the kit. If you're coming over from another network (Verizon or a subsidiary, in particular) you'll want to check if your device is compatible before you jump in with this Black Friday promo.",
    "If you're looking for more excellent options for saving some hard-earned cash on your phone bill, check out our round-up of this month's best cheap cell phone plans. Alternatively, expand your search with fantastic family and unlimited options with our top-down guide to the best cell phone plans."
  ],
  "headers": {
    "4": "Boost Mobile Black Friday sale"
  },
  "links": {
    "$9 price cut plus free shipping": "https://www.prf.hn/click/camref:1101l7qAu/pubref:trd-us-4744821755144023000/destination:https%3A%2F%2Fdeals.boostmobile.com%2Fpromo%2Fsimpromos99-7",
    "best prepaid plans": "https://www.techradar.com/deals/best-prepaid-plans",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "basic 2GB/mo plan": "https://www.prf.hn/click/camref:1101l7qAu/pubref:trd-us-5810202223912816000/destination:https%3A%2F%2Fwww.boostmobile.com%2Fplans.html",
    "check if your device is compatible": "https://www.prf.hn/click/camref:1101l7qAu/pubref:trd-us-1581658451826273000/destination:https%3A%2F%2Fwww.boostmobile.com%2Fbring-your-phone",
    "best cheap cell phone plans": "https://www.techradar.com/deals/best-cheap-cell-phone-plans",
    "best cell phone plans": "https://www.techradar.com/deals/best-cell-phone-plans"
  }
}