{
  "source": "https://www.techradar.com/news/nvidia-rtx-3050-ti-gpu-could-soon-power-up-budget-gaming-laptops",
  "title": "Nvidia RTX 3050 Ti GPU could soon power up budget gaming laptops",
  "category": "computing",
  "updated": "2021-03-08T11:04:20Z",
  "author": "darren-allan",
  "summary": "Or at least usher in more affordable gaming portables…",
  "article": [
    "Nvidia has an RTX 3050 Ti laptop graphics card incoming, at least if a leak from notebook maker Asus is on the money.",
    "This one was spotted by @momomo_us (via VideoCardz), an ever-present source of hardware leaks on Twitter, with the mobile graphics card being present in the tech spec of an Asus TUF Dash F15 thin-and-light gaming laptop.",
    "Pinches of condiments to hand as ever, but one of the GPU options is clearly marked as the RTX 3050 Ti, although no other spec information is imparted by the product listing, save for the amount of memory on-board: 4GB of GDDR6 VRAM.",
    "If indeed this info is correct – as ever with these kind of leaks, it’s possible that it could be a mistake – then we might soon expect Nvidia to launch this fourth mobile GPU. As you’re probably aware, there are already RTX 3080, RTX 3070 and RTX 3060 laptop graphics cards.",
    "VideoCardz further theorizes that based on other details previously leaked elsewhere about the mobile GPU codenamed ‘GN20-P0’ – which was what the 3050 Ti was previously referred to as on the Asus website – it’ll draw (up to) 60W of power.",
    "The card is likely to be built on the GA107 GPU and feature a 128-bit memory bus, with 4GB VRAM as mentioned. Previous rumblings from the rumor mill suggested that the RTX 3050 Ti could be based on the GA106 GPU (as seen in the RTX 3060), but apparently this is not the case.",
    "From a broader perspective, the 3050 Ti could give gaming laptop makers a more wallet-friendly option for a mobile Ampere GPU, which would obviously be welcome for those whose budget can’t stretch to one of the higher-end GPUs for their portable gaming needs.",
    "Rumors about Nvidia’s purported RTX 3050 Ti and indeed vanilla RTX 3050 have been floating around for quite some time now, and these would be the first GPUs to introduce ray tracing cores to a card under the 60 series (the RTX 2060 was the baseline product for hardware acceleration of ray tracing in Nvidia’s last generation, Turing)."
  ],
  "headers": {
    "4": "Further rumors"
  },
  "links": {
    "Nvidia": "https://www.techradar.com/news/nvidia-in-2021-amperes-continued-domination",
    "VideoCardz": "https://videocardz.com/newz/asus-confirms-geforce-rtx-3050-ti-laptop-gpu-with-4gb-gddr6-memory",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Ampere GPU": "https://www.techradar.com/news/nvidia-ampere",
    "have been floating around": "https://www.techradar.com/news/nvidia-rtx-3050-rtx-3050-ti-and-rtx-3060-might-debut-at-ces-next-week",
    "some time now": "https://www.techradar.com/news/nvidia-rtx-3050-rumor-gets-gamers-excited-about-a-powerhouse-budget-gpu"
  }
}