{
  "source": "https://www.techradar.com/news/dell-expands-enterprise-nas-line-up",
  "title": "Dell expands enterprise NAS line-up",
  "category": "computing",
  "updated": "2021-09-16T13:33:21Z",
  "author": "mayank-sharma",
  "summary": "New NAS devices can handle demanding workloads for modern use cases",
  "article": [
    "Dell has announced several updates to its Dell EMC PowerScale NAS solutions, particularly to support all kinds of data workloads, while ensuring they remain cyber resilient.",
    "The new enhancements are designed to give users more dexterity in deploying and managing the devices, while adding security capabilities to address the prevailing cyber threats that plague businesses, particularly ransomware.",
    "“These new, more powerful hybrid and archive nodes offer more cores, memory and cache, additional networking options, and deliver complete node compatibility with your existing PowerScale and Isilon clusters,” writes David Noy, Vice President of Product Management, Unstructured Data Solutions, Dell Technologies.",
    "Noy added that the new PowerScale hybrid devices (H700 and H7000) provide 75% more performance than comparable nodes while archive nodes (A300 and A3000) are two times more effective than similar products.",
    "Two of the biggest concerns that Dell has addressed with the update to its NAS portfolio are flexibility and data security.",
    "Leveraging on an IDC survey that highlighted flexibility as one of the key requirements that businesses look for in their data management solutions, Noy said the new lineup can support a mix of enterprise file-based workloads and tackle demanding workloads such as artificial intelligence (AI) and machine learning (ML) along with traditional use cases.",
    "Furthermore, the devices are now protected against unplanned outages including ransomware attacks.",
    "“We are further strengthening our data protection offerings for PowerScale with enhancements to our cyber protection offering with Superna and a new Dynamic NAS capability, enabled by our Dell EMC PowerProtect portfolio,” shared Noy.",
    "The Cyber Protection and Recovery solution from Superna for PowerScale is designed to help customers recover their data affected during a cyberattack by leveraging the public cloud from providers such as Azure, AWS and Google Cloud.",
    "For traditional outages, Noy also announced the Dynamic NAS Protection solution that offers incremental-forever NAS data protection with rapid recovery at the file level."
  ],
  "headers": {
    "4": "Flexible and safe"
  },
  "links": {
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "NAS solutions": "https://www.techradar.com/news/the-10-best-nas-devices-reviewed",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "PowerScale and Isilon": "https://www.techradar.com/news/dell-emc-powerscale-wants-to-conquer-all-your-unstructured-data",
    "writes": "https://www.delltechnologies.com/en-us/blog/how-flexibility-is-redefining-nas-for-the-data-era/",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "ML": "https://www.techradar.com/news/what-is-machine-learning",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "AWS": "https://www.techradar.com/news/aws",
    "Google Cloud": "https://www.techradar.com/news/google-cloud-pledges-to-keep-its-apis-accessible-to-businesses"
  }
}