{
  "source": "https://www.techradar.com/news/google-is-turning-docs-into-a-more-serious-word-rival",
  "title": "Google is turning Docs into a more serious Word rival",
  "category": "computing",
  "updated": "2021-11-10T13:13:04Z",
  "author": "joel-khalili",
  "summary": "New features add extra depth to Google Docs",
  "article": [
    "Google has lifted the lid on new functionality for its word processor that it says adds greater depth to Docs.",
    "In a blog post, the firm detailed a new process for formal document approvals for high-priority files (such as contracts, legal documents and the like), building upon existing comment and suggested edit features.",
    "“Securing document approvals can be difficult when collaborating with multiple stakeholders and competing priorities. This feature makes it easy to secure those approvals and see who has approved them,” wrote Google.",
    "Once all designated reviewers have provided their approval, Google explained, the document will lock and can no longer be edited, thereby “securing the integrity of your document.”",
    "The new document approval system is currently rolling out to all Google Workspace users and should appear under the File menu within the next few days.",
    "Although Google Docs has long had the edge on Microsoft Word when it comes to real-time collaboration and ease of use, the latter has traditionally boasted a deeper and more complete feature set.",
    "Now, however, Google appears to be making a concerted effort to close the gap on Word, with new features designed to address a wider range of use cases.",
    "In addition to the new approval functionality, for example, Google is also building out the citations feature, making Docs a more viable choice for students and academics.",
    "When adding a citation to an essay or research paper, users will soon be able to search for sources via an in-built database, and then automatically populate the necessary fields (title, publisher, date of publication etc.).",
    "“By automating part of the source creation process, and ensuring correct formatting, we hope to save you time and reduce manual errors while managing citations,” said Google.",
    "This feature is set to roll out far and wide starting November 29, although members of the Rapid Release track will gain access a little sooner.",
    "Additions like these, coupled with a new drive to create new synergies between Workspace apps and increased investment in the Workspace marketplace, could give businesses and personal users cause to reconsider their choice of office software."
  ],
  "headers": {
    "5": "Google Docs vs. Microsoft Word"
  },
  "links": {
    "word processor": "https://www.techradar.com/news/the-best-free-word-processor",
    "blog post": "https://workspaceupdates.googleblog.com/2021/11/request-and-review-formal-document.html",
    "collaborating": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "citations feature": "https://workspaceupdates.googleblog.com/2021/11/more-easily-add-citations-in-google.html",
    "synergies between Workspace apps": "https://www.techradar.com/news/google-is-creating-new-synergies-between-workspace-apps",
    "Workspace marketplace": "https://www.techradar.com/news/google-has-a-cunning-plan-to-dethrone-microsoft-365",
    "office software": "https://www.techradar.com/news/office-365-vs-g-suite-whats-the-best-office-software"
  }
}