{
  "source": "https://www.techradar.com/news/hades-on-nintendo-switch-is-the-most-addicted-ive-ever-been-to-a-video-game",
  "title": "Hades on Nintendo Switch is the most addicted I’ve ever been to a video game",
  "category": "gaming",
  "updated": "2021-03-27T15:00:07Z",
  "author": "nick-pino",
  "summary": "Some nights I wake up thinking about my next boss fight",
  "article": [
    "Some nights I wake up in a cold sweat thinking about my next boss fight – or about the one I just beat before going to bed. Some days it gets so bad that, when I close my eyes, I can still see Zagreus dodging bolts of purple energy, leaving behind him a trail of flashing thunder. When I’m not playing it, I’m plotting out upgrades for my next run.",
    "I can’t help myself. Hades on Nintendo Switch is a hell I just can't quit.",
    "You’re reading Download This, TechRadar’s new weekly guide to the must-have downloads to fill your phones, tablets, consoles and computers with. Games, eBooks, albums, apps or movies – we’ve got you covered.",
    "Where traditional action RPGs might give you a skill tree or a list of stats for you to slowly sink your points into, Hades gives you something better – the power of the gods. Each run up through the Underworld towards Mount Olympus will give you different powers from the Greek gods, each of which can in turn be enhanced or combined every few levels.",
    "Because the game’s a roguelike (a game that’s procedurally generated rather than linear), the levels themselves change, as do each level’s enemies and final bosses. That, combined with the powers, means no two runs ever look the same.",
    "Not only does the game incentivize you by showing you a new power or a new boss each time you play, but it also drip-feeds you permanent upgrades that makes each successive run the tiniest iota easier than the last, allowing you to keep pushing forward.",
    "Well now, you must be thinking, that doesn’t sound like it’d be that addictive. Surely tons of games have similar mechanics, and all those are easy to put down after a few hours?",
    "You’re right, sort of. Hades isn’t the first roguelike to ever be made and the powers system, while unique, does bear a resemblance to other popular ARPGs like Diablo where gems allow you add status effects to your weapons that also grow more powerful with each playthrough.",
    "But when you combine those elements, and put them on a handheld device like the Nintendo Switch that is simply made to be brought with you anywhere and everywhere you go, you have a recipe for a powerful dopamine ride that you rarely have to get off of.",
    "Because runs are fairly short – say 20 to 30 minutes – it’s easy to die, invest any new materials into upgrades and start anew again ad nauseum, all to get one step closer to the game’s ending… er, well, its true ending.",
    "While others have made defeating the Soul of Cinder in Dark Souls 3 or clearing the b-sides in Celeste their white whale, mine’s defeating Hades not once or twice, but 10 times to reach the ‘true’ ending. It’s going to take me some time, but with the rate I’m playing – and improving – it’s only a matter of time before I beat it. If not, there’s always tomorrow. Or the next day. Or the next day… in fact, maybe I better try my luck again right now.",
    "I’m pretty addicted to the game (I’m not lying when I say I’m losing sleep over it) but I know its hold is temporary. Sooner or later I’ll get through it or try all the combinations of powers. Eventually I’ll reclaim my free time, but for now I’m hopelessly addicted to what I honestly think is the best roguelike since FTL: Faster Than Light. If you’ve got some free time in your schedule, you might want to lose yourself to it, too."
  ],
  "headers": {
    "6": "One more run then I’m done"
  },
  "links": {
    "Download This": "https://www.techradar.com/tag/download-this"
  }
}