{
  "source": "https://www.techradar.com/news/iss-just-had-to-swerve-out-of-the-way-of-space-junk-left-over-from-1994",
  "title": "ISS just had to swerve out of the way of space junk left over from 1994",
  "category": "appliances",
  "updated": "2021-12-03T21:59:13Z",
  "author": "john-loeffler",
  "summary": "Space debris is threatening to shut down space for decades",
  "article": [
    "The International Space Station just had to dodge space junk in orbit, demonstrating the increasing risk to the orbital station and smaller satellites from the proliferation of space trash in Low Earth Orbit.",
    "According to Reuters, Roscosmos reported that the International Space Station (ISS) descended by just over 300 meters for almost three minutes to avoid a piece of space junk left over from a 1994 US space launch before returning to its typical orbit.",
    "The news came from Dimitry Rogozin, the head of the Russian space agency Roscosmos, and marks the latest in a series of incidents involving the fast growing cloud of space junk surrounding the planet.",
    "Earlier this week, NASA had to postpone a spacewalk to fix an antenna on the ISS over space debris concerns, and the ISS was forced to maneuver out of the way of a piece of a disabled Chinese satellite just last month.",
    "Russia also conducted an anti-satellite missile test last month that destroyed a decommissioned Russian satellite, forcing astronauts in the ISS to lock themselves in docked Soyuz and SpaceX Dragon Crew capsules for safety as the ISS passed the debris field.",
    "Russia isn't the only one to have conducted anti-satellite missile test recently. In early 2019, India launched an anti-satellite missile test that produced a debris field that is now in orbit around the planet.",
    "The US isn't innocent either, as it shot down a failed satellite in the 2008, citing safety reasons, while China also shot down one of its own satellites in 2007.",
    "And like with today's incident, space launches often leave behind booster rocket pieces, fairings, and other debris that typically fall back to Earth and burn up in the atmosphere, but not always. This debris can remain in orbit, posing a serious threat for decades afterward.",
    "To understand why space junk is such a concern, all you need to know is how fast things move up there.",
    "Objects in orbit travel at speeds up to 17,500 mph (about 28,160 km/h), according to NASA, and since nearly all of the space junk up there is made of metal, collisions of any kind are inherently dangerous.",
    "If objects are traveling at the same speeds, the relative speeds of the collisions might be greatly reduced, but smacking the ISS into a piece of old satellite the size of an air conditioner at 75 mph (about 120 km/h) is still more than enough to cause serious damage, and maybe even threaten the integrity of the ISS.",
    "Even smaller pieces of debris can pose a serious danger. There are roughly 23,000 pieces of debris in orbit that are the size of a softball or larger, and getting hit with a softball-sized piece of metal debris at 200 mph (about 320 km/h) can easily punch a hole in the side of a spacecraft or satellite.",
    "In fact, it has already done so to numerous satellites, producing even more space debris as a result, causing a cascading proliferation of space debris which many fear will lead to something known as Kessler syndrome.",
    "In this scenario, space junk essentially becomes so out of control that it takes on a momentum of its own, destroying an ever-increasing number of satellites which only grows the cloud of swirling high-velocity debris to the point where Low Earth Orbit becomes too dangerous to operate in.",
    "There are half a millions pieces of debris the size of a marble or larger, and about 100 million pieces of debris 1mm or larger. According to NASA, several space shuttle windows had to be replaced over damage caused by debris that was later determined to be flecks of paint.",
    "\"In fact, millimeter-sized orbital debris represents the highest mission-ending risk to most robotic spacecraft operating in low Earth orbit,\" NASA says. If Low Earth Orbit becomes a swirling hurricane of metal shrapnel travelling at 17,500 mph, then attempting to pass through it becomes impossible.",
    "You have to accelerate as you ascend into Low Earth Orbit, so essentially any kind of spacecraft or satellite you try to put up into orbit in a post-Kessler environment would have to do so under a bullet-hell of debris travelling hundreds or even thousands of miles an hour faster than whatever you're trying to put into orbit.",
    "If that then gets destroyed and torn up by space debris in the process, you just end up creating more space debris you have to contend with the next time you attempt to put something into orbit.",
    "Eventually, you simply can't put anything new into orbit any more than you can stay dry in a rain storm by avoiding all the individual drops of rain. We'd have to wait for that cloud of debris to eventually fall into the Earth's atmosphere and burn up, a process that could take many decades.",
    "Former NATO Secretary General Anders Fogh Rasmussen wrote in the Financial Times on Thursday that regulation is desperately needed in order to keep space safe for humanity in the future.",
    "\"Unless we change course,\" he writes, \"the opportunities of space to improve our lives on earth could be closed off for generations.\""
  ],
  "headers": {
    "8": "Space junk could lock humanity out of space for generations"
  },
  "links": {
    "Reuters": "https://www.reuters.com/lifestyle/science/international-space-station-swerves-dodge-space-junk-2021-12-03/",
    "NASA had to postpone a spacewalk": "https://www.cbsnews.com/news/russia-space-missile-test-satellite-debris/",
    "Russia also conducted an anti-satellite missile test": "https://www.space.com/russia-asat-test-space-debris-dangerous-irresponsible",
    "India launched an anti-satellite missile test": "https://www.space.com/india-tests-anti-satellite-weapon.html",
    "according to NASA": "https://www.nasa.gov/mission_pages/station/news/orbital_debris.html",
    "Kessler syndrome": "https://www.space.com/kessler-syndrome-space-debris",
    "Financial Times": "https://www.ft.com/content/01e1961b-ca40-41b9-b10d-e8107b641550"
  }
}