{
  "source": "https://www.techradar.com/news/e-commerce-fraud-cost-tops-dollar20-billion-a-year",
  "title": "E-commerce fraud cost tops $20 billion a year",
  "category": "computing",
  "updated": "2021-04-27T09:14:11Z",
  "author": "rob-clymo",
  "summary": "Data suggests digital sales fraud is up by 18% year-on-year",
  "article": [
    "Losses from increasing e-commerce fraud will continue to rise this year, rising from $17.5 billion in 2020 to over $20 billion in 2021, new data suggests.",
    "Juniper Research has identified that fraudsters are continuing to target consumers who have been using e-commerce services to shop online more frequently, especially since the arrival of Covid-19.",
    "The growing prevalence of fraud, which has risen by 18% year-on-year, has shone the light on the insecure fraud mitigation processes still being used by many merchants. Indeed, many business selling goods or services online still appear to be unfamiliar with the challenges they face. Others seem reluctant to invest in a more secure digital sales setup.",
    "While e-commerce businesses are generally anxious and keen to improve their security arrangements many company owners worry about potential issues arising as customers progress to the digital checkout. Juniper’s report suggests that increased and more efficient levels of automation could help relieve the pressure, with the implementation of Artificial Intelligence-based systems having the potential to improve the sales journey.",
    "Research co-author Susan Morrow explains: “While the need for security is greater than ever, the competitive e-commerce environment means merchants will need to ensure that extra security checks are justified to the user, or they risk higher cart abandonment rates.”",
    "Fraud within the e-commerce world might be on the increase globally, but China looks to be the leading the growth. The research predicts that the country will account for over 40% of e-commerce fraud losses globally by the year 2025, with a staggering $12 billion lost due to fraudulent e-commerce transactions.",
    "Again, the report cites a lack of investment in fraud detection and the limited preventative measures being employed as being key factors in the growing issue."
  ],
  "headers": {
    "4": "Greater security"
  },
  "links": {
    "e-commerce fraud": "https://www.techradar.com/news/internet/how-to-combat-mobile-commerce-fraud-1203160/2",
    "shop online": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "secure digital sales": "https://www.techradar.com/best/best-payment-gateways",
    "e-commerce businesses": "https://www.techradar.com/news/best-ecommerce-hosting",
    "digital checkout": "https://www.techradar.com/best/best-shopping-cart-software"
  }
}