{
  "source": "https://www.techradar.com/news/shang-chi-first-reactions-heres-what-the-critics-thought",
  "title": "Shang-Chi first reactions: here's what the critics thought",
  "category": "entertainment",
  "updated": "2021-09-01T15:29:18Z",
  "author": "tom-power",
  "summary": "Marvel's Shang-Chi movie has received universal praise",
  "article": [
    "The first reactions for Shang-Chi and the Legend of the Ten Rings have landed online – and critics have been lauding the latest Marvel movie as an unexpected triumph.",
    "With the MCU film's global premiere taking place in Los Angeles last night (August 16), a few lucky journalists and influencers were given the chance to see Shang-Chi's live-action debut before the superhero flick officially launches on September 3.",
    "So what did those individuals think of Marvel's first origins movie since 2019's Captain Marvel? Judging by their reactions, many film aficionados may be surprised by just how good Shang-Chi is.",
    "Collider's Steven Weintraub was one of the first to drop his thoughts on Shang-Chi – and it'll come as no surprise that he really enjoyed it. Weintraub says it's like \"no Marvel movie you've seen\" before going on to praise Simu Liu's \"perfect\" casting as the titular character:",
    "ComicBook.com's Brandon Davis stated that \"lots of people are about to have a new favorite Marvel hero\" and claimed that Shang-Chi's \"darker than expected\" solo adventure is \"integral\" to Marvel's Phase 4 plans:",
    "Light the Fuse podcast co-host Drew Taylor called Shang-Chi an \"absolute triumph\", paying particular tribute to the numerous nods to the film's influences including Hayao Miyazaki and Jackie Chan:",
    "Content creator and Hollywood Critics Association member Wendy Lee Szany lauded the film's action and \"killer soundtrack\", while stating that this is a movie that fans will want to catch on the big screen:",
    "Insider correspondent Kirsten Acuna praised the movie's focus on \"badass women\" alongside its titular character and, whisper it quietly, followed up her initial tweet by saying she preferred it over Black Widow's solo movie:",
    "Finally, YouTuber John Campea gushed over how Shang-Chi, describing it as \"part Shakespearean tragedy, part mythological epic, part martial arts masterpiece\". High praise indeed, we think you'll agree:",
    "TechRadar's entertainment reporter Tom Power will be checking out Shang-Chi at a separate press screening very soon, so make sure you follow him on social media for his thoughts on the movie.",
    "We'll also be covering Shang-Chi and the Legend of the Ten Rings in detail in the coming weeks, such as posting our spoiler-free review once the embargo lifts, so stay tuned for more coverage soon."
  ],
  "headers": {},
  "links": {
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "preferred it": "https://twitter.com/KirstenAcuna/status/1427499248078135300"
  }
}