{
  "source": "https://www.techradar.com/news/facebook-messenger-voice-and-video-calls-are-getting-end-to-end-encryption",
  "title": "Facebook Messenger voice and video calls are getting end-to-end encryption",
  "category": "computing",
  "updated": "2021-08-16T07:22:27Z",
  "author": "david-nield",
  "summary": "Privacy and security boosted",
  "article": [
    "Voice and video calls on Facebook Messenger are getting more secure, with the option of end-to-end encryption now rolling out – so no one else can tap into your communications, not even the team at Facebook.",
    "The update means that video calls and voice calls are now as private as one-to-one text chats, which have had end-to-end encryption since 2016 (although you do need to use the secret conversation feature for it to be enabled).",
    "\"People expect their messaging apps to be secure and private, and with these new features, we're giving them more control over how private they want their calls and chats to be,\" writes Ruth Kricheli, Director of Product Management at Facebook Messenger.",
    "Facebook says that it's also starting to test end-to-end encryption for group chats inside Messenger, and for direct messages inside Instagram – though only a selected number of users are going to be able to see these options for the time being.",
    "More controls are coming to one-to-one chats that use disappearing messages as well, which is an option inside secret, encrypted conversations: users will be able to choose a duration, from 5 seconds to 24 hours, for messages to stick around for after they've been viewed.",
    "The new end-to-end encryption on voice and video calls will be optional, so if you do want to take advantage of the extra security and privacy, make sure that you enable the feature once it appears on your devices.",
    "End-to-end encryption works a little bit like a lock and a set of keys: only you and the person you're chatting to have the right key to unscramble the communications and see what's being said. If someone else intercepts the messages or calls, they won't be able to interpret them.",
    "No one else – whether it's a hacker trying to catch your chats as they're transferred across the web, or a rogue Facebook employee wanting to tap into your communications, or a government agency wanting to spy on what you're up to – can make sense of what's being said, as they don't have the right keys.",
    "It's not perfect, because someone could still get into your phone and view your messages as if they were you, but it's a big step in the right direction. It's also now standard across plenty of apps, including WhatsApp, Signal and Google Messages on Android.",
    "While some companies and governments don't like the idea of end-to-end encryption – suggesting that it makes it harder to identify and stop criminal activity happening online – it really is an essential security feature, and it's good to see it rolling out to more apps and more types of communication."
  ],
  "headers": {
    "3": "More features coming soon",
    "6": "Opinion: end-to-end encryption should be the default"
  },
  "links": {
    "video calls": "https://www.techradar.com/best/best-video-conferencing-software",
    "The update": "https://messengernews.fb.com/2021/08/13/messenger-updates-end-to-end-encrypted-chats-with-new-features/",
    "Google Messages on Android": "https://www.techradar.com/news/google-adds-end-to-end-encryption-to-android-messages-app"
  }
}