{
  "source": "https://www.techradar.com/news/forza-horizon-5-should-speak-for-fables-quality-xbox-boss-insists",
  "title": "Forza Horizon 5 should speak for Fable’s quality, Xbox boss insists",
  "category": "gaming",
  "updated": "2021-06-24T11:05:33Z",
  "author": "rhys-wood",
  "summary": "Xbox head confident in Fable’s developer",
  "article": [
    "Head of Xbox Phil Spencer has assured Fable fans that Playground Games is the right developer for the long-awaited reboot. The company is currently putting the finishing touches on Forza Horizon 5, which was announced during the Xbox & Bethesda E3 2021 showcase.",
    "Reported by VGC, Spencer talked about Fable when asked about the project on the Dropped Frames podcast. He stated: “The only thing I can really say about Fable is, seeing the pedigree of the team and Playground, and where they set the bar for themselves in building a game...",
    "I think that showed with the Forza Horizon 5 preview that they had – I think people should just take confidence in that [studio director] Gavin [Raeburn] and the team there has that same level of focus on doing something amazing with an IP that we know is really important to a lot of Xbox fans, so we can’t wait to get to show more, but the team is just amazing.”",
    "Spencer’s comments should come as welcome news for Fable fans, who have received little to no details about the game since its CG reveal trailer back in July 2020. Especially for those who might think Playground Games is an odd fit for an action RPG, given its penchant for racing sims like the Forza Horizon series.",
    "The peculiarities continue when you realize Fable is being developed with ForzaTech which, as the title implies, is the engine used to develop both the Forza Motorsport and Forza Horizon series. But when you think about it, ForzaTech will likely be a great fit for Fable if the game is to go for vast landscapes showcasing impressive scale. We wouldn’t even be surprised if we get to drive some kind of high-speed vehicle in Fable at this point.",
    "Fable’s development team is also looking quite promising, with several industry veterans from companies like Rockstar, Remedy, and Gearbox heading up key positions in the game design and writing departments.",
    "It’s been over a decade since the last mainline entry in the series, Fable 3, landed on the Xbox 360 back in 2010. At the time, the series was still being developed by the now-defunct Lionhead Studios, headed by Peter Molyneux, a charismatic and controversial figure in the gaming industry at the time.",
    "Fable’s hopes of a resurgence were short-lived when the Xbox One exclusive Fable Legends was canceled in 2016. This asymmetrical multiplayer title looked promising in previews at the time, but the game was unfortunately canned alongside the closure of Lionhead Studios.",
    "After Fable Legends’ cancellation and Fable 3’s divisive reception among fans, the rebooted Fable on Xbox Series X/S has a lot to prove. Here’s hoping that Playground Games turns out to be the right developer for the job, and to be honest, the company’s previous work on the Forza Horizon series gives us reason to believe it is."
  ],
  "headers": {
    "3": "The perfect playground",
    "6": "Molyneux? Moly-no"
  },
  "links": {
    "Fable": "https://www.techradar.com/news/fable-4-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Reported by VGC": "https://www.videogameschronicle.com/news/xbox-boss-says-fable-fans-should-take-confidence-from-playgrounds-forza-horizon-work/",
    "several industry veterans": "https://www.videogameschronicle.com/news/analysis-whos-working-on-fable-4/",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}