{
  "source": "https://www.techradar.com/news/the-most-exciting-indie-pc-games-in-development-right-now",
  "title": "The most exciting indie PC games in development right now",
  "category": "computing",
  "updated": "2021-02-28T12:00:32Z",
  "author": "rosario-blue",
  "summary": "We check out promising indie games in development",
  "article": [
    "This year’s run of upcoming indie titles on PC due for release is on a different level. The Steam Game Festival 2021 took place from February 3 through February 9 and gave us a taste of what’s to come, with demos, developer interviews and showcases throughout.",
    "The festival showed off games from many genres, with varied art styles, rich storylines, and abstract concepts. Indie developers continue to push the boat of creativity and innovation despite working from small teams and having limited budgets.",
    "Here’s a list of our pick of some of the best indie games due for release this year.",
    "Sands of Aura is a visually stunning dark fantasy action RPG developed and published by indie studio Chashu Entertainment.",
    "SoA is an open world buried under sand and divided in to islands. Each one has a unique style, lore and varying difficulty levels. The Combat is “souls-like” with seven distinct styles. There are different magical runes to modify your gear and several armor sets to personalize your build.",
    "While the release date is yet to be confirmed, you can add the title to your Steam Wishlist and follow Chashu Entertainment’s Twitter page to keep up with related news and updates.",
    "Potentia is a third-person action-adventure shooter. It’s developed and published by indie studio Wily Pumpkin.",
    "It has an interesting story, but choose wisely when playing as it’s a tactical shooter. You can either go all-in for full action with your pistol, long-distance by sniping your enemies, or go stealth mode by sneaking up on them with a close combat take down. You have limited supplies of ammo and medkits, but how you win is up to you.",
    "Potentia was released February 11 on Steam for $19.99 and has received “mostly positive” reviews, and the demo is still available to try out.",
    "Arid is an open-world survival craft game with a dry name, the first project by student-led, Sad Viscacha Studio and published by Breda University of Applied Sciences.",
    "You have to survive the harsh conditions of the Atacama Desert - think sun exposure, dehydration, and other natural dangers.",
    "Prepare and craft items that allow you to hunt, gather materials and repair equipment. Climb mountains, explore caves and abandoned locations that double up as temporary refuges.",
    "Arid is free-to-play, and a pre-alpha demo is available to play on Steam. While there is no specific release date, it’s expected to be out very soon.",
    "Foregone is a 2D action side-scroller with 3D elements, developed and published by Indie game Studio, Big Blue Bubble.",
    "Made with gorgeous pixel art, this single player title is an exciting Metroidvania-style game with a rich storyline, banging weapons and tasty loot. It’s action-packed, with satisfying slasher-and shooter-style combat.",
    "Out on consoles since October 2020, Foregone will be available on PC to purchase on Steam from March 1, but you can add it to your wishlist in the meantime. The demo is still available to play and we strongly suggest you give it a try: you will not be disappointed.",
    "Unbound: Worlds Apart is a 2D adventure puzzle-platformer developed and published by Romanian indie game company, Alien Pixel Studios.",
    "Unbound: Worlds Apart is a gorgeous, atmospheric, dark fantasy world ravaged by an unknown disaster that destroyed the home of the main character, Soli.",
    "There are boss fights and brutal enemies to overcome while solving puzzles and jumping in and out of different realities via a portal you can conjure at will.",
    "Due for release in the second quarter of 2021, you can add Unbound: Worlds Apart to your Steam wishlist and try out the free demo that’s still available to play.",
    "The Riftbreaker is a base-building strategy survival game developed and published by EXOR studio.",
    "Heavily reminiscent of real time strategy (RTS) games like StaCraft 2, Command and Conquer and similar titles, in this game you hack, slash and shoot down beasts to research and gather rare minerals and substances and use them for crafting and upgrading weapons, equipment and technologies.",
    "The Riftbreaker is developed on EXOR Studio’s in-house engine, the Schmetterling 2.0, which offers uncapped frame rate, customizable controls and widescreen monitor support.",
    "There’s no specific release date, but it will be sometime. In the meantime, you can add it to your wishlist and try out the demo on Steam.",
    "The Undying is an interesting and touching take on the familiar zombie apocalypse genre.",
    "Developed by Vanimals and published by Skystone Games Inc and Vanimals, Undying is an adventure-survival game with a deep story that follows Anling and her son, Cody through their fight for survival.",
    "Anling has been bitten by a zombie. Now infected, she must stay alive for Cody and teach him survival skills; searching for materials, cooking, crafting and fighting zombies to survive.",
    "Undying is due for release mid 2021. You can add it to your wishlist and play the demo on Steam while you wait.",
    "Genesis Noir is a story-rich exploration point-and-click, published by Fellow Traveller and developed by Feral Cat Den.",
    "In Genesis Noir you jump through pockets of time, create life, destroy a whole civilization and pass through moments in the universe while trying to change the course of destiny to save your love, Miss Mass.",
    "A delightfully abstract and otherworldly game with an interesting take on the start of creation, and an inspired art style.",
    "It’s expected to be released at some point during the first quarter of 2021, but for now you can add it to your Steam wishlist.",
    "Chicory: A Colorful Tale is a top-down adventure- RPG set in a coloring book world where you play as a dog wielding a magic brush and paint color and life back into the world.",
    "You can explore the world in single-player or co-op mode and paint and solve puzzles to unlock new places and paint abilities. Chicory: A Colorful Tale is developed by Greg Lobanov and published by Finji.",
    "There’s no specific release date just yet, but it will be out this year. You can add it to your Steam wishlist and keep up to date on its developments via Discord or email.",
    "You Suck at Parking is a fun and hilarious racing game where you have to, well, park, but perfectly.",
    "Developed and published by award-winning game studio Happy Volcano, You Suck at Parking is a racing game with a twist. Apart from putting your skills to the test on “the world’s most EXTREME parking game”, in which you must attempt to stop and park at a precise spot; the tracks are user-generated so you can even have a go at designing levels.",
    "Due for release sometime this year, you can add it to your Steam wishlist in the meantime, and try out the free demo."
  ],
  "headers": {
    "3": "Sands of Aura",
    "6": "Potentia",
    "9": "Arid",
    "13": "Foregone",
    "16": "Unbound: Worlds Apart",
    "20": "The Riftbreaker",
    "24": "Undying",
    "28": "Genesis Noir",
    "32": "Chicory: A Colorful Tale",
    "35": "You Suck at Parking"
  },
  "links": {
    "festival": "https://store.steampowered.com/curator/39641083-Steam-Game-Festival-Showcase/list/73824/",
    "Chashu Entertainment": "http://www.chashuentertainment.com/",
    "SoA": "https://www.sandsofaura.com/",
    "Steam Wishlist": "https://store.steampowered.com/app/1119840/Sands_of_Aura/",
    "Twitter": "https://twitter.com/ChashuStudios",
    "Wily Pumpkin.": "https://www.wilypumpkin.com/",
    "Potentia": "https://www.wilypumpkin.com/potentia/",
    "Steam": "https://store.steampowered.com/app/837880/You_Suck_at_Parking/",
    "Breda University of Applied Sciences": "https://igad.itch.io/",
    "pre-alpha demo": "https://store.steampowered.com/app/1463730/Arid/",
    "Big Blue Bubble": "https://www.bigbluebubble.com/",
    "Unbound: Worlds Apart": "https://unboundthegame.com",
    "StaCraft 2": "https://starcraft2.com/en-gb/",
    "Command and Conquer": "https://www.ea.com/en-gb/games/command-and-conquer",
    "The Riftbreaker": "https://www.riftbreaker.com/",
    "EXOR Studio’s": "https://www.exorstudios.com/",
    "Vanimals": "https://undying.vanimals.net/",
    "Skystone Games": "https://skystone.games/",
    "Genesis Noir": "http://www.genesisnoirgame.com/",
    "Chicory: A Colorful Tale": "https://chicorygame.com/",
    "Greg Lobanov": "http://dumbandfat.com/",
    "Finji": "https://finji.co/",
    "Discord": "https://discord.com/invite/finji",
    "email": "https://phantasmaburbia.us5.list-manage.com/subscribe?u=a6f910bba13c5e5644ebbfc72&id=88dec3e30f",
    "You Suck at Parking": "https://store.steampowered.com/app/837880/You_Suck_at_Parking/",
    "Happy Volcano": "https://www.happyvolcano.com/"
  }
}