{
  "source": "https://www.techradar.com/news/10-things-we-did-with-mobile-phones-that-will-baffle-the-youth-of-today",
  "title": "10 things we did with mobile phones that will baffle the youth of today",
  "category": "phones",
  "updated": "2021-06-24T08:40:00Z",
  "author": "esat-dedezade",
  "summary": "Remember these?",
  "article": [
    "It’s the year 2000. The world is breathing a sigh of collective relief after the catastrophic plane-plummeting effects of the Y2K bug fail to materialize. The PlayStation 2 launches, captivating gamers around the world. And I walk into school with swag levels I’ll never come close to achieving again, thanks to the mobile phone I’ve got in my pocket.",
    "It’s a Nokia 8210, aka the mind-bogglingly miniature Charlie’s Angel phone. While it was originally a vivid red color, I’ve replaced the front and back covers with a textured basketball cover that looked and felt like the real deal. If anyone cares to look at the screen, they’ll notice that the “Orange” network logo has been replaced by an Xtreme “No Fear” logo instead.",
    "On the very rare occasion my phone rang, a crappy, monophonic rendition of Jumpin’ Jumpin’ by Destiny’s Child would emit from the speakers. I dread to think how much money I spent on this cavalcade of tackiness.",
    "If you’re reading this and connecting with me on a spiritual level, then this article will be a fuzzy, warm, and safe space, filled with the golden rays of comforting nostalgia. If, however, you’re from a more recent generation, and have stumbled upon this page accidentally in between shooting a new TikTok vid or looking for a way to earn more V-Bucks, then the following section will fill you with a mixture of confusion, disbelief, and pity for the generations that came before you.",
    "Either way, we hope you enjoy a look back at the way things were in the Before Times. No touchscreens, no color, and proprietary accessories as far as the eye can see. Welcome to the pre-smartphone world.",
    "Long before the arrival of the onscreen full QWERTY keyboard, we had to make do with forging messages using the basic number keys. Each key had three letters, with the four last members of the alphabet living on the ‘9’ key.",
    "If you wanted to write the letter ‘B’ for example, you’d have to tap the number 2 (the abc key) twice, to cycle through to ‘B’. While it sounds like a tedious, convoluted mess, most people would still swear by the speed and accuracy of it, thanks to the magical powers of the predictive dictionary, which lets you cycle through common words based on what you’ve typed so far.",
    "If you were particularly good you could even send text messages to people without even looking at your phone, for extra bragging rights. 8-)",
    "With modern smartphones mostly resembling boring rectangular slabs, the only way to really stand out from the crowd is to cover up your phone with a case.",
    "In the old days though, phones themselves had removable shells, letting you instantly and dramatically change the look without faffing around with any sticky skins or bulky cases. The cheesy, erotic 90s-fuelled ad above proves the point far better than our words ever could.",
    "Another benefit to having removable covers is the fact that you could easily swap out your battery for an instant 100% charge. Combined with the fact that handsets could last a week with heavy use without breaking a sweat, you could theoretically go travelling for a month with a few spare batteries and no charger in sight.",
    "Try doing that at a weekend festival today, and you’ll be in the firm grasp of battery anxiety’s ruthless hands long before you’ve run out of cider.",
    "It’s easy to look back on things with rose tinted glasses, but some things in the pre-smartphone world were rather annoying. Take chargers for example. The idea that you could share the same charging cable between different manufacturers’ handsets wasn’t even a distant pipedream — it seemed downright impossible.",
    "Nokia, Samsung, Sony Ericcsson and others all had proprietary charging cables for their handsets, so if you were round a friend’s house and needed to juice up, you’d be out of luck unless they had the same phone.",
    "As phones developed the power to let you listen to music, they had their own specific bundled headphones too that would use all manner of strange connections rather than the normal 3.5mm audio jack we know (and miss) today. Today’s world of USB-C and Lightning ports is a dream in comparison.",
    "Are you too young to remember ASCII emoticons, the precursor to the modern emoji? Without fancy graphics available, humans conveyed their emotions via text using 100% organic characters and symbols.",
    "From the classic smiley and winky faces :-) ;-) to disappointed expressions -_- and even cute little animals <(^_^)>, the world of emoticons fuelled creativity, encouraging people to come up with more and more complex ways to express themselves.",
    "Paying for ringtones seems like an utterly alien concept today, but back then we’d happily part with cash for horribly rendered versions of monophonic songs.",
    "When polyphonic ringtones came out (adding multiple channels of sound), our collective minds were blown. On certain models, you could even create your own ringtones with cryptic button presses, as the above video of a 2020 meme song demonstrates.",
    "Long before the idea of custom wallpapers ever came to fruition, you could pay to have your network logo replaced with a different image. Replacing the boring “Orange” text with the Nike swoosh was viewed as the pinnacle of cool, and there’s nothing you can say today that will change our minds.",
    "Back when phones weren’t too far off the size and weight of house bricks (think SIM cards the size of credit cards), people were forced to carry them around in hideously ugly belt holsters, like the world’s un-coolest six shooter.",
    "Thankfully when things began to slim down in the Nokia 3210 era, the only people still rocking ugly holsters were business folk, who wanted a fast-draw for all the important Business Calls that they were making and taking.",
    "Originally debuting on the Nokia 6110, this simple pixellated time waster sucked people in with the most addictive gameplay in videogame history.",
    "Controlling a snake so that it can gobble up a tasty square with basic up, down, left and right controls, countless hours were spent staring at screens and fending off thumb cramps.",
    "You can keep your fancy modern Call of Zombies: #2Flossing4Furious 3D games, thank you very much. We prefer the mind numbing simplicity that this legendary title brings to the table.",
    "If you drop a phone today, you’ve already worked out the staggering repair costs before the glass has even smashed on the tarmac. The phones of yesteryear, however, laugh in the face of concrete.",
    "Those indestructible 3310 memes you’ve seen floating around aren’t works of fiction — older handsets with their all-plastic build and tiny screens were practically indestructible, as long as they were kept from falling into water. Even then, you could try the bag of rice trick as a last resort, which would often bring your beloved phone back from the brink of death."
  ],
  "headers": {
    "5": "T9 predictive text",
    "8": "Instant facelifts covers",
    "10": "Replaceable batteries",
    "12": "Proprietary everything",
    "15": "ASCII emoticons",
    "17": "Paying for (and creating your own) ringtones",
    "19": "Replacing your Network with random images",
    "20": "Holsters",
    "22": "Snake",
    "25": "Invincible handsets"
  },
  "links": {
    "PlayStation 2": "https://www.techradar.com/news/best-ps2-games-anniversary"
  }
}