{
  "source": "https://www.techradar.com/news/yet-another-samsung-galaxy-s22-leak-spells-good-news-for-selfie-fans",
  "title": "Yet another Samsung Galaxy S22 leak spells good news for selfie fans",
  "category": "phones",
  "updated": "2021-09-15T15:13:41Z",
  "author": "hamish-hector",
  "summary": "Under-display cameras aren't likely to make an appearance",
  "article": [
    "The Samsung Galaxy S22 series of smartphones aren't likely to have an under-camera display, according to yet another leak.",
    "This latest nugget of information comes from Ice Universe, a smartphone leaker with a decent track record, adding even more evidence to existing claims that Samsung’s under-camera tech will be absent from two of Samsung’s S22 devices.",
    "While they don’t namecheck the S22 Ultra and Galaxy S22 Plus specifically, we’d be a little surprised if the under-display camera made an appearance in either of those models.",
    "While some users may be sad that the hole punch from the Galaxy S21 smartphones seems to be making a comeback, those that value selfie picture quality will be more than happy at the news. Under-display cameras aren’t quite up to snuff when it comes to taking good-looking pictures, and are mostly suited to video calls.",
    "So, what cameras could the Galaxy S22 be getting instead? We've heard from one leaker that both the Samsung Galaxy S22 and Galaxy S22 Plus will boast a 50MP main sensor, a 12MP ultra-wide, and a 12MP telephoto (capable of 3x optical zoom).",
    "That’s a big change from its predecessors (the Galaxy S21 and S21 Plus) that each sported 12MP main, 12MP ultra-wide, and 64MP telephoto lenses. It looks like there could be some give and take on the Galaxy S22’s snappers, but for your day-to-day photos you'll likely see be a big boost from 12MP to 50MP.",
    "As for the S22 Ultra, we did at one point see a report claiming that it would come with a 200MP main camera, which would be made better than ever thanks to a rumored partnership with Olympus.",
    "Other reports have suggested it will come with a 108MP snapper instead of the 200MP camera, but it will supposedly have a “polish” we haven’t seen on previous versions - perhaps in reference to Olympus’ supposed involvement.",
    "We’ll have to wait until Samsung officially unveils its latest Galaxy smartphones to know what cameras it has up its sleeve, but with the likely January 2022 release coming closer by the day, it might not be long before we get an official announcement."
  ],
  "headers": {
    "4": "What cameras could the Samsung Galaxy S22 come with?"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1437754451087921173?s=20",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "heard from one leaker": "https://www.techradar.com/news/samsung-galaxy-s22-range-could-have-the-biggest-camera-upgrades-in-years",
    "200MP main camera": "https://www.techradar.com/news/galaxy-s22-ultra-could-have-samsungs-best-camera-yet",
    "partnership with Olympus": "https://www.techradar.com/news/samsung-could-partner-with-olympus-for-its-next-galaxy-camera-phone",
    "reports": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-probably-wont-have-a-200mp-camera-after-all"
  }
}