{
  "source": "https://www.techradar.com/news/macbook-air-2022-could-arrive-in-may-with-apples-biggest-redesign-in-a-decade",
  "title": "MacBook Air 2022 could arrive in May with Apple’s biggest redesign in a decade",
  "category": "computing",
  "updated": "2021-10-26T09:29:50Z",
  "author": "darren-allan",
  "summary": "Fresh mock-up renders have been shared showing what the laptop might look like",
  "article": [
    "Apple’s MacBook Air 2022 revamp has already been rumored to be arriving mid-2022, and now a heavyweight Apple leaker has underlined this, stating that it could be out in about six to eight months.",
    "This is the latest from Mark Gurman’s newsletter, as highlighted by MacRumors, in which he asserts that he expects the launch to take place in said timeframe, meaning that the MacBook Air 2022 could arrive as soon as next May.",
    "Gurman also notes that there will not be another Apple event this year, or any further new products for 2021, so the leaker is seemingly letting us know that there won’t be any November launches.",
    "The next MacBook Air is expected to be built around the M2 SoC and will have a completely fresh design – in fact, it’ll be the most major revamp of the Air since 2010, Gurman believes. In theory, it’ll take cues from the new iMac 24-inch, meaning off-white bezels and multiple striking color choices, as we’ve already gathered from the rumor mill.",
    "In fact, this is exactly what we heard from another leaker, Dylandkt, very recently, who reckons that an off-white color keyboard and bezels are coming, and a new Mini-LED screen (as seen on the freshly unveiled MacBook Pros).",
    "Speaking of which, new renders (well, actually updated versions of images shared a while back) of what the MacBook Air 2022 could look like have been put together based on Dylandkt’s leakage. These come from Jon Prosser and Ian Zelbo (which Tom’s Guide spotted), and show the laptop mocked-up with thin white bezels, and a notch for the webcam – although Dylandkt did make it clear that they couldn’t confirm whether the notch would be present, or not.",
    "They also show the keyboard with a white deck, and the Air having the rumored MagSafe charging port.",
    "Additionally, in his newsletter Gurman said that next year we can expect a larger iMac with an Apple SoC, and a new Mac mini (the rumor mill previously believed that the latter would be arriving this year).",
    "We need to take the renders for what they are – simply mock-ups of what the MacBook Air 2022 could look like, if these current rumors pan out – but the idea of the off-white bezel (and keyboard) is already proving seriously divisive. And if it’s accompanied by a notch (as seen on the new MacBook Pro models), then that’s likely to really stir up the controversy pot around the laptop’s appearance; the white rather than black bezel certainly highlights the notch further.",
    "However, as we noted above, speculating about the notch seems to be jumping the gun, seeing as Dylandkt was pretty clear about being unsure on whether the notch will happen with the Air (what won’t happen, apparently, is the ProMotion tech seen on the new MacBook Pros which allows for faster refresh rates with the Mini-LED display).",
    "Regarding the possible release timeframe, Dylandkt also believes that the next MacBook Air will arrive mid-2022, so that would mean June or July roughly, which falls pretty much in line with Gurman’s prediction – although the latter seems slightly more optimistic with that suggestion of a May release."
  ],
  "headers": {
    "8": "Analysis: To notch, or not to notch? That is the question…"
  },
  "links": {
    "Apple’s MacBook Air 2022 revamp": "https://www.techradar.com/news/macbook-air-2022",
    "MacRumors": "https://www.macrumors.com/2021/10/22/november-apple-event-unlikely-gurman/",
    "built around the M2 SoC": "https://www.techradar.com/news/rumored-macbook-pros-could-use-m1x-chip-this-year-with-m2-coming-in-2022",
    "iMac 24-inch": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "heard from another leaker, Dylandkt, very recently": "https://www.techradar.com/news/macbook-air-2022-could-get-mini-led-screen-and-no-controversial-notch",
    "freshly unveiled": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "MacBook Pros": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "new renders": "https://www.frontpagetech.com/2021/10/23/exclusive-new-renders-of-apples-m2-redesigned-macbook-air-coming-next-year/",
    "Tom’s Guide": "https://www.tomsguide.com/news/macbook-air-2022-design-looks-stunning-in-new-renders",
    "already proving seriously divisive": "https://www.techradar.com/news/macbook-air-2022-could-get-mini-led-screen-and-no-controversial-notch"
  }
}