{
  "source": "https://www.techradar.com/news/outriders-inventory-wipe-bug-remains-unfixed-and-a-seriously-scary-prospect",
  "title": "Outriders inventory wipe bug remains unfixed – and a seriously scary prospect",
  "category": "gaming",
  "updated": "2021-04-08T18:13:25Z",
  "author": "darren-allan",
  "summary": "Resolution is being discussed – but numbers of affected players are seemingly mounting up",
  "article": [
    "An Outriders bug which can wipe out your inventory is still not fixed, with complaints from frustrated players affected by this worrying flaw still flooding in via various online forums.",
    "The ‘lose all your gear’ glitch is one of the most dreaded bugs in gaming – alongside other gems like the ‘corrupted save’ – and it’s causing posts to pop up on the likes of Reddit with some regularity now.",
    "As highlighted by PC Gamer, AJacks 28 complained: “So, yesterday, I was playing with friends and I got kicked with a connection error. I logged back in, and my inventory is completely gone, even things I had equipped.”",
    "A more recent post from Qwallas says: “My game crashed during an expedition, loaded the game [and] it crashed logging me in. After I signed [in] successfully my whole inventory was gone. Pls fix this bug.” The player adds: “If the devs don’t fix this bug [and] restore my whole inventory am done with the game.”",
    "Other folks are chiming in on these threads and elsewhere, along with the Square Enix known issues thread on the bug, all saying they have suffered the same fate. Another variation of the bug seems to be the primary weapon disappearing, and that slot becoming unusable (a gremlin that might reportedly be cured by switching to your secondary weapon, and emptying it of ammo, so it auto-swaps over to a primary gun). Accolades are also being wiped in some cases, too.",
    "So what’s going on? As is made clear in that known issues thread, the inventory wipe is an issue the developer has been ‘keeping an eye on’, and the most recent update posted during the launch weekend notes: “We’re currently discussing the best possible ways to resolve this issue and ensure we are able to help everyone who has been affected. For now we are focusing efforts on stabilizing servers, which in turn should reduce these first weekend occurrences.",
    "“Once that’s been done, I’m hoping to share news around the way we intend to get players back on their feet.”",
    "The problem being, of course, that some players will effectively be in limbo, and not wanting to play the game, until a resolution has been put forward or implemented.",
    "The devs further note: “We’re still figuring out whether the best way would be a one-to-one customer support team method (which may be more accurate but would take much longer and may not be feasible if there are many cases), or whether we are able to (as previously) run a mass-one-off restoration event via our backend.”",
    "What’s especially worrying here is that some players believe this is happening to more and more folks, and as PC Gamer points out, it’s a glitch in the game which was seemingly occurring pre-launch in the demo.",
    "There’s still no actual timeframe for when or how the bug might be solved, but we can keep our fingers crossed that we get another official update soon enough.",
    "The only possible workaround floated by players – such as it is – is to avoid playing co-op, as it seems that if you’re a lone wolf, this particular bug (hopefully) won’t happen (take that with a pinch of salt, though).",
    "*Update: The developer has posted the following on Steam about how it plans on addressing the inventory bug:",
    "\"We believe that the rate of this bug appearing should be greatly reduced once the upcoming [first major] patch has been published. With crash fixes in place, we intend to run a one-off mass restoration. Here are our intentions for this restoration:",
    "Restoration should take place on a specific day and should be a one-time event.",
    "The exact date is TBC but we’re hoping for this to occur in the coming week(s).",
    "We will update you when we have confirmation of date and timings.",
    "We will only be able to restore the most valuable tiers of items lost, e.g. Epics and Legendaries.",
    "We will be unlikely to restore an inventory full of blue gear.",
    "The restoration should be additive to your inventory. It should not replace your current inventory.",
    "Restored items may not have the exact same stats as the lost items.",
    "Note that restoration will not be possible for items that were acquired but where the game connection was terminated before an autosave could complete as those items would never have made it into your server inventory/our logs. Such suspended autosaving is noticeable when the yellow autosave icon stays active for a longer period of time.\""
  ],
  "headers": {
    "5": "Wipeout watch"
  },
  "links": {
    "Outriders": "https://www.techradar.com/how-to/outriders-class-guide",
    "PC Gamer": "https://www.pcgamer.com/uk/outriders-inventory-wipe-reset-bug/",
    "AJacks 28": "https://www.reddit.com/r/outriders/comments/mjmc4l/inventory_wipecant_equip_weapons/",
    "Qwallas": "https://www.reddit.com/r/outriders/comments/mmcr3f/inventory_wipe/",
    "elsewhere": "https://www.reddit.com/r/outriders/comments/mlcsuq/outriders_inventory_wipe_and_chest_too/",
    "Square Enix known issues thread": "https://www.reddit.com/r/outriders/comments/mh3etc/outriders_launch_info_known_issues_tracking/gsx3n8w/?sort=new"
  }
}