{
  "source": "https://www.techradar.com/news/microsoft-flight-simulator-for-xbox-series-x-s-5-things-to-do-first",
  "title": "Microsoft Flight Simulator for Xbox Series X / S: 6 things to do first",
  "category": "gaming",
  "updated": "2021-07-27T16:12:45Z",
  "author": "gerald-lynch",
  "summary": "Earn your wings in Microsoft Flight Simulator",
  "article": [
    "It’s one of the most impressive games on PC at the moment – and it’s worthy of the same accolades on Xbox. Microsoft Flight Simulator launches on Xbox Series X and Xbox Series S today, bringing the entire world (yes, you read that correctly, the entire world) to your TV, ready to be explored from high in the sky.",
    "It’s a ridiculously ambitious feat, harnessing the power of the new consoles and cloud data services in tandem (not to mention a huge amount of Xbox storage space), and Microsoft’s Asobo Studio has pulled it off with aplomb.",
    "But it’s also quite a daunting game, too. With the entire world at your fingertips, and the minutiae of dozens of aircraft to get your head around, where is best to start?",
    "Our Microsoft Flight Simulator guide for Xbox below will walk you through your first few hours in the game, getting you up in the sky and ready for the more challenging flights in the weeks ahead as you earn your wings over five steps. Plus, we've thrown in a bonus sixth tip for those ready to really invest in the experience.",
    "This sounds like an obvious one, but you’d be surprised how many people skip the tutorial and just jump straight into a game as first timers. With Microsoft Flight Simulator, that’s a bad idea. There are lots of complex controls to learn and flight instrumentation to understand. It’ll quickly become second nature – but without an early guiding hand you’re going to struggle.",
    "There are eight scenarios in flight training to complete, taking about 30 minutes to work though, and covering everything from camera control to take off and landing. If you’ve only access to a control pad (remember, Xbox consoles can accept keyboard and mouse input, too), it’s particularly important to run Flight Training, as some controls may not be instantly obvious.",
    "You can’t do much in terms of tweaking the controls while you’re in Flight Training, but once you’re out of it, you’ve free rein to reassign inputs, change assist levels, and mess with sensitivity levels.",
    "That last one is super important if you’re playing on Xbox Series X or Xbox Series S and are limited to a pad, as the default sensitivity level is incredibly high, making fine-tuned landings a bit difficult to pull off.",
    "It’s also worth heading into the menu and changing at least one of the in-game flight assists. While some are pivotal for keeping a newbie’s plane in the air, we’d encourage you to switch off ‘Assisted Yoke’. That’s what’s in charge of pitch (altitude) and roll and, seeing as that’s where you’ll be doing the most silly, fun in-flight moves, you want control over that once you’ve settled in.",
    "There’s in-game air traffic control in Microsoft Flight Simulator, as you’d imagine, and as you fly around you’ll get little radio calls letting you know about those in the skies around you. You can tweak your tail number to give your plane a little personalisation (pop your name on your tail, why don’t you?), but it’s the call sign that has a more profound effect on radio messaging.",
    "If you edit your call sign, air traffic control teams will use that to identify you on the radio, using the Phonetic Alphabet (alpha, bravo, charlie, etc) to speak to you. If you pop a short word into your call sign though, they may use that to call you instead. It’s a nice little touch that makes you feel part of the bigger gaming world – though don’t bother messing with profanities, as it’ll just ignore them and replace them with something generic instead.",
    "You’ve got your wings, you’ve got the whole world to explore… and yet the first place you want to check out is a bird’s eye view of your home right? Yep, us too.",
    "You can quite easily find your house by flying around from a nearby airport, providing you have the patience and a decent sense of local geography. But here are a few tips to make sure your fly-by goes off without a hitch.",
    "If you just want to appear in the sky directly above your home, you can click anywhere on the World Map / Free Flight mode that isn’t an airport and select “set as departure”. You’ll appear high above the location at a cruising speed though, so you’ll speed right past if you’re not careful.",
    "If you want the exact coordinates, pop your address into Google Maps and right click on the red pin that appears on the location – that top string of numbers that appears is the exact coordinates of your home! Copy them into the World Map search field and you’ll be able to set it as a starting point or destination. It’s more fun to fly to it from a local airport, though, so look up some nearby runways and set one as your takeoff location.",
    "Remember the Microsoft Flight Simulator trailers that looked more like an Attenborough documentary, complete with herds of grazing animals to fly over? That wasn’t just marketing rubbish – they are actually in the game, but can be quite difficult to find just aimlessly flying.",
    "To make it a bit easier, type in “fauna” on the World Map search bar, which will bring up a list of locations for different species, from flamingoes to elephants. Once you’re up in the air relatively nearby, hit pause and bring up the Assistance tab. From the navigational menu you’ll then want to turn the toggle for “Fauna Markers” on. You’ll then get a heads up marker making it way easier to spot the little (or large) critters.",
    "Now you're up to speed with all that the game has to offer, it's time to step it up a gear. No pilot worth their wings plays with a keyboard and mouse, let alone a gamepad. If you're truly looking at ascend, you need to invest in a flight stick.",
    "While there are plenty of options for PC gamers, you're a bit more limited when it comes to console compatibility. Our pick is the above Thrustmaster T-Flight Hotas One.",
    "The Hotas One bundles together the main joystick, a throttle and a detachable base, allowing you to position the peripheral to your liking, and giving you all the controls you'll need easily within reach. Being an official flight accessory to the game and console means there should be little to no compatibility issues to get in the way of your flying, either."
  ],
  "headers": {
    "4": "Complete Flight Training",
    "6": "Turn your Xbox pad’s sensitivity down, and turn Assisted Yoke off",
    "9": "Change your call sign",
    "11": "Do a fly-by past your home",
    "15": "Find a herd of animals",
    "17": "BONUS! Invest in a flight stick"
  },
  "links": {
    "Microsoft Flight Simulator": "https://www.techradar.com/reviews/microsoft-flight-simulator",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "a huge amount of Xbox storage space": "https://www.techradar.com/news/want-microsoft-flight-simulator-on-xbox-series-x-or-s-better-upgrade-your-storage",
    "plenty of options for PC gamers": "https://www.techradar.com/news/the-best-microsoft-flight-simulator-peripherals-on-pc-and-xbox-series-x"
  }
}