{
  "source": "https://www.techradar.com/news/oppo-find-x3-pro-fcc-listing-reveals-the-battery-size-and-charging-speeds",
  "title": "Oppo Find X3 Pro FCC listing reveals the battery size and charging speeds",
  "category": "phones",
  "updated": "2021-01-20T10:05:37Z",
  "author": "james-rogerson",
  "summary": "Matching what we've seen before",
  "article": [
    "The Oppo Find X3 is set to land in March, but ahead of that we’re already learning things about it, with a listing on the FCC (Federal Communications Commission) all but confirming the battery specs of the phone.",
    "The listing (spotted by leaker Abhishek Yadav) is for the Oppo ‘CPH2173’ – a model number that has previously been linked to either the Oppo Find X3 or Oppo Find X3 Pro, so we don’t know for sure which one we’re looking at here, but the specs match leaks about the Pro model.",
    "In any case, the FCC listing mentions a battery with a 2,200mAh rated capacity and a 2,250mAh typical capacity, which is small, but almost certainly means the phone has a dual-cell battery with a total capacity that’s double that, so 4,400mAh or 4,500mAh. That's still not massive, but it's more in line with what we'd expect.",
    "As noted, that’s also in line with previous leaks, which pointed to the Oppo Find X3 Pro having a 4,500mAh battery, and the charging speed is a match too, as the charger listed here is capable of up to 65W, which is the exact spec we’d previously heard rumored.",
    "There’s not much else of note listed here, other than mention of the phone running the company’s ColorOS 11.2 interface on top of Android. However, we can take the details that are included as basically confirmed, given that the information submitted to the FCC should be accurate.",
    "In terms of what else to expect from the Oppo Find X3 Pro, leaks and rumors point to a top-end Snapdragon 888 chipset, a 6.7-inch curved 1440 x 3216 screen with a 120Hz refresh rate, and a quad-lens camera, with 50MP main, 50MP ultra-wide, 13MP telephoto (with 2x optical zoom), and 3MP macro lenses.",
    "In all, the Oppo Find X3 range sounds like it could be a real rival for the Samsung Galaxy S21 range, so if you want some more 2021 flagship choice, you shouldn’t have long to wait.",
    "Via GizmoChina"
  ],
  "headers": {},
  "links": {
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "FCC": "https://fccid.io/R9C-CPH2173",
    "Abhishek Yadav": "https://twitter.com/yabhishekhd/status/1351716229963157504",
    "previous leaks": "https://www.techradar.com/news/oppo-find-x3-pro-specs-leaked-in-full-revealing-a-microscope-camera",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "GizmoChina": "https://www.gizmochina.com/2021/01/20/oppo-find-x3-pro-receives-fcc-certification-ahead-of-march-launch/"
  }
}