{
  "source": "https://www.techradar.com/news/sony-xperia-pro-i-is-an-on-the-go-youtubers-dream-phone",
  "title": "Sony Xperia Pro-I is an on-the-go YouTuber’s dream phone",
  "category": "phones",
  "updated": "2021-10-26T03:05:00Z",
  "author": "david-lumb",
  "summary": "Pro specs, big camera sensors, and more",
  "article": [
    "The Sony Xperia Pro was released in January as a device for video professionals, and now a new version – the Sony Xperia Pro-I – has been announced as a phone that's custom-made for vloggers. The phone will be available for preorder starting October 28 and will be sold unlocked starting in December 2021 in the US, though availability in other regions hasn't been announced.",
    "The Xperia Pro-I (‘I’ for imaging) has nearly all the perks of its predecessor and a few improvements of its own at a lower price – $1,799 / £1,599 (around AU$2,400), compared to the staggering $2,500 (around £1,830 / AU$3,245) price tag of the Xperia Pro. The new Pro-I doesn’t have the HDMI port central to the Xperia Pro’s use as an external display for expensive professional cameras, so it’s more a general use phone built for videographers.",
    "The Xperia Pro-I does have an improved main camera with a 1-inch sensor. It’s one of the first mainstream phones to have a sensor of that size (and the first coming to the US), which enables better low-light performance, dynamic range, and more natural depth-of-field compared to the computational bokeh seen in phones with smaller sensors. The main camera's dual aperture lens, which lets you switch between f/2.0 and f/4.0, gives you added control over this background blur.",
    "The megapixel count hasn’t changed from the Pro – all three rear cameras are 12MP, so the main, telephoto, and ultra-wide cameras aren’t improved in that regard. But the Xperia Pro-I has other improvements on the standard Pro, like having 315 points of autofocus (the green grid of boxes shown when taking photos) covering 90% of the viewfinder, compared to 247 points on the Xperia Pro covering 70% of the viewfinder. The phone can also take burst shots up to 20 frames per second with autofocus, as well as improved anti-distortion over earlier Xperia models.",
    "Other than its rearranged rear camera block, the Xperia Pro-I is physically similar to the Xperia Pro, though it does bump the chipset up to the Snapdragon 888 found in this year’s flagship Android phones. It has the same 6.5-inch OLED display as the Xperia 1 III, though that should be fine for most smartphone owners – its 4K resolution (3840 x 1644) is rare among modern smartphones.",
    "It packs a 4,500mAh battery and 30W charger, as well as the Xperia I III’s front-facing speakers as well as a 3.5mm headphone jack. It has a shortcut button that can be set to open any app, and the dedicated shutter button has the same shutter switch module as Sony's RX100 series compact cameras. There’s even a little hole to secure a wrist strap.",
    "And, crucially, the Xperia Pro-I can record video – which the Xperia Pro couldn’t. But there’s more for the modern vlogger that Sony’s new phone can offer.",
    "The Xperia Pro-I is dedicated to video recording, with some firsts in the world of smartphones: it’s the first to natively record 120fps – and saving every frame, unlike other phones that record at that speed, but save in 30 or 24fps to play back in slow motion at a specific speed. Saving every frame means users can choose whatever slow-mo rate they want.",
    "There’s also new software, Video Pro, which offers a similar level of manual control and editing as Sony’s Cinema Pro app that came with the Xperia Pro. The phone’s wide 21:9 screen enables the phone to show the viewfinder in 16:9 with enough room on the side for manual video controls. With software called Optical Steadyshot and StableEye that stabilizes the footage and tracks moving subjects, the phone promises a lot for action videographers.",
    "There’s also an optional $199 / £169 (around AU$265) Vlogging accessory – a 3.5-inch external display that can magnetically mount on the back of the Xperia Pro-I to show what’s recording from the rear cameras. And for those who want to protect their phone in style, a $90 (around £65 / AU$120) leather case.",
    "The Sony Xperia Pro-I has a few 'world first' claims, but perhaps the most significant is that Sony has officially called it a part of its camera lineup. Considering that lineup contains some of the world's best cameras, it's a symbolic moment for camera phones – and for premium compact cameras, too.",
    "That's because the Xperia Pro-I is effectively the phone equivalent of the Sony ZV-1 and Sony RX100 VII. Those two compact cameras are built on a similar 1-inch sensor and Bionz X processors. Until now, they've also held an advantage over the Xperia range (and most other smartphones) when it comes to sensor size and professional features.",
    "The Xperia Pro-I sees Sony effectively abandon any concerns about cannibalization in favor of making a smartphone that can compete, on paper, with its best compact cameras for stills and video. It also sees Sony tread a very different path to its big camera phone rivals like Apple, Google and Samsung. While the latter are now largely focused on computational point-and-shoot photography, the Xperia Pro-I is a pro-focused camera that's built on Sony's more traditional advantages in sensors, lenses and real-time tracking autofocus.",
    "Traditional cameras, like the Sony RX100 series, do still hold some advantages in areas like lenses. Despite the Xperia Pro-I's inclusion of a glass Zeiss Tessar lens, size constraints do still limit what's possible in a smartphone – so we'll have to see how that plays out in some real-world tests.",
    "But there's no doubt that the Xperia Pro-I is a bold statement of intent from Sony, which is the only smartphone maker that also makes world-class standalone cameras. The question is how many people, other than Sony camera fans, want that type of experience in a phone, compared to the more beginner-friendly smarts of the best camera phones."
  ],
  "headers": {
    "7": "Xperia Pro-I: what’s here for video fans?",
    "10": "Analysis: A significant moment for camera phones"
  },
  "links": {
    "Sony Xperia Pro": "https://www.techradar.com/news/sony-xperia-pro-is-a-5g-uploading-second-screen-for-professional-content-streamers",
    "best cameras": "https://www.techradar.com/news/best-camera",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "Sony RX100 VII": "https://www.techradar.com/reviews/sony-cyber-shot-rx100-vii",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone"
  }
}