{
  "source": "https://www.techradar.com/news/windows-11-could-get-a-lot-more-popups-but-hopefully-microsoft-has-learned-from-windows-10s-mistakes",
  "title": "Windows 11 could get a lot more popups – but hopefully Microsoft has learned from Windows 10’s mistakes",
  "category": "computing",
  "updated": "2021-09-16T09:58:24Z",
  "author": "darren-allan",
  "summary": "Of course this is all still in testing, and novices may find numerous tip popups very useful anyway",
  "article": [
    "Windows 11 could witness the introduction of a bunch more popups, although this is just what we’re seeing in testing for the OS right now, and to be fair to Microsoft, the popups in question may well be helpful for novice computing users.",
    "What’s happened here is that a new Windows 11 preview has been pushed out (build 22458 to be precise) complete with a number of more minor changes and things like fixing issues with the reliability of the Start menu.",
    "However, Windows 11 has a new revamped Tips app which Microsoft is now encouraging folks to try out in the blog post announcing build 22458, requesting feedback in order to fine-tune the tips supplied and maybe add new ones (there are over 100 tips already in place in the app, incidentally). These are all aimed at helping users unfamiliar with the interface to find out how to do stuff easily, of course.",
    "But as PC World spotted, Microsoft goes on to mention that help popups won’t just be confined to the Tips app with Windows 11, stating: “And it doesn’t quite stop there with the Tips app – you’ll notice tips appear throughout Windows 11 to help you discover new things as you go! Check out the new Tips widget on the widgets board, tips as First Run Experiences, and tips for specific experiences within Windows 11.”",
    "Of course, helpful tips popping up around the operating system in various contexts is far from a bad thing in itself – certainly for novice users, as we’ve already touched upon. These could be genuinely useful additions, and obviously testing should help to ensure that nothing too intrusive comes about here – you’d hope.",
    "That said, plenty of more tech-savvy users won’t want any kind of popup help, so presumably there’ll be a way to easily disable any – or rather, all – extra tips which are floating about the OS outside of the Tips app itself. If that’s the case, then obviously all well and good (it could even be an option when you first set up Windows 11 – enquiring whether you might not want to be bothered by any tip popups at all).",
    "The danger here is that Microsoft’s track record regarding more intrusive or dubious popups isn’t that great, as those who were cajoled into upgrading to Windows 10 (when it first came out) from either Windows 7 or 8.1 will doubtless recall. And in case you’re inclined to think that kind of behavior is now well in the past, don’t forget that much more recently Microsoft has been pushing its new Edge browser with some pretty over-the-top measures, including placing ads in the Windows 10 search box.",
    "Okay, so we shouldn’t judge Microsoft’s efforts to make the Windows 11 desktop a more helpful environment, but when there’s talk of popup tips appearing “throughout Windows 11”, it’s difficult not to get at least a touch concerned about exactly how that’ll manifest. And indeed whether part of the operating system’s assistance will be pointing out just how much you can do with the Edge browser these days (which, we might add, is an impressive browser, but obviously that’s not the point).",
    "We’re still in testing with all this right now, of course, so whatever the current situation is with tips throughout Windows 11, it could (and likely will) change. It’s a good bet that if Microsoft does start overstepping the mark somehow, testers will let the company know, and hopefully that feedback will be heard loud and clear."
  ],
  "headers": {
    "4": "Analysis: One step closer to the Edge?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "PC World": "https://www.pcworld.com/article/3633590/brace-yourselves-windows-11-may-have-more-popups.html",
    "stating": "https://blogs.windows.com/windows-insider/2021/09/15/announcing-windows-11-insider-preview-build-22458/",
    "Microsoft’s track record regarding more intrusive or dubious popups": "https://www.techradar.com/news/software/operating-systems/microsoft-employs-more-underhand-tactics-to-push-windows-10-upgrade-1311279",
    "Microsoft has been pushing its new Edge browser": "https://www.techradar.com/news/fed-up-of-microsoft-edge-ads-here-have-some-more-this-time-in-onedrive",
    "ads in the Windows 10 search box": "https://www.techradar.com/news/windows-10-now-has-ads-for-edge-browser-in-its-search-box-is-microsoft-going-too-far-in-pestering-users",
    "Edge browser": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review"
  }
}