{
  "source": "https://www.techradar.com/news/memorial-day-mattress-sale-2021",
  "title": "Memorial Day mattress sale 2021: top deals from Nectar, Tempur-Pedic and more",
  "category": "news",
  "updated": "2021-10-15T06:47:07Z",
  "author": "mackenzie-frazier",
  "summary": "The Memorial Day mattress sale event is here - and there are plenty of savings to be made",
  "article": [
    "The Memorial Day mattress sale event has well and truly launched. Memorial Day is finally here, and there are thousands of dollars to be saved on mattresses today. Whether you're looking to buy one of the best mattresses for less, or you need a good-quality cheap mattress, we've got you covered. We've rounded up all the top online offers from Nectar, Purple, Tempur-Pedic, Casper, and more in one handy guide.",
    "Mattresses receive some of the biggest discounts during the Memorial Day sales - many of the discounts here are bigger than those we saw on Black Friday. The best deal comes from Nectar, where there's a $400 discount on the Nectar Memory Foam mattress - and you get $399-worth of free sleep accessories with every mattress too.",
    "We also have a special deal from luxury mattress maker Saatva. The company sits at the top of our best mattress guide, and with this offer you can get a $225 discount when you spend $1,000 or more on a mattress at Saatva. That's a bigger discount than Black Friday. To help you find the best Memorial Day mattress sale, we've split our selection of deals into four categories: the outright best mattress deals; followed by a breakdown of the best memory foam mattress deals, the best hybrid, and the best organic mattress sales. Many of these offers end today - but we wouldn't be surprised to see some of these sales extended into the coming week. Still, if you see an offer you like the look of it's best to grab it while you can.",
    "See more early offers with our roundup of the best Memorial Day sales that are happening now. If you're interested in other bargains, you can see the best Memorial Day appliance sales and the best Memorial Day TV sales."
  ],
  "headers": {
    "3": "The best Memorial Day mattress sales"
  },
  "links": {
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "$400 discount on the Nectar Memory Foam mattress": "https://nectar.xovt.net/c/221109/473932/8338?subId1=trd-us-1224567153109478100&sharedId=trd-us&u=https%3A%2F%2Fwww.nectarsleep.com%2Fmattress",
    "best mattress": "https://www.techradar.com/best/best-mattress",
    "$225 discount": "https://www.prf.hn/click/camref:1100l8udd/pubref:trd-us-1347039512516267800/destination:https%3A%2F%2Fwww.saatva.com%2Fmattresses%2Fsaatva-classic%2F%3Fcoupon%3Dicvjaqxxuweyyhgc",
    "best Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "best Memorial Day appliance sales": "https://www.techradar.com/news/the-best-memorial-day-appliance-sales-deals-from-home-depot-lowes-and-more",
    "best Memorial Day TV sales": "https://www.techradar.com/news/memorial-day-tv-sales-2021"
  }
}