{
  "source": "https://www.techradar.com/news/what-does-a-luxury-ev-look-like-this-is-bentleys-answer",
  "title": "What does a luxury EV look like? This is Bentley’s answer",
  "category": "car-tech",
  "updated": "2021-07-21T18:37:56.263Z",
  "author": "david-lumb",
  "summary": "I drove a Bentley hybrid and got the scoop on its all-EV fleet",
  "article": [
    "When you think Bentley, you think luxury, power, and a traditional design hearkening back through the automaker’s 100-year history. But its upcoming range of all-electric vehicles offers the brand a unique challenge: how do you preserve luxury while transitioning to a new motorist lifestyle bound to a network of charging stations and slow recharging cycles?",
    "It won’t be easy for any automaker in Britain which must adhere to the UK Government’s aspiration that every car rolling off an assembly line in the country be at least hybrid gas- and electric-powered by 2030, and fully electric vehicles (EV) by 2035. Other nations and US states have set similar deadlines – New York and California, for instance, have both enacted their own plans to ban the sale of gas vehicles in 2035.",
    "Bentley, with production based in Crewe, England, gamely announced its own timeline to shift its vehicles to more environmentally-friendly models: hybrid versions of its fleet by 2023, its first EV in 2025, and make its entire range electric by 2030.",
    "This seems especially challenging coming off the Covid-19 lockdowns that led Bentley to lay off a quarter of its workforce last year. As some parts of the world open back up, the automaker invited me to San Diego, for a chance to drive its current cars and hear about its future autos.",
    "That includes the Bentayga hybrid, which I was able to compare to the traditional petrol model - and didn't feel much difference at all. The drive feel and performance felt nearly the same, and I couldn't really tell when the car switched between electric and gas power. The interior trim, on the other hand, was at an identical level of high quality.",
    "While I didn't get a chance with the Flying Spur hybrid (it had been announced days before), Bentley talked extensively about its hybrid plans. On the other hand, the company was tight-lipped about the EV coming in 2025, sharing vague plans and aspirations but explaining little,",
    "Despite that secrecy, I did learn several things: the company is passing around design mock-ups internally and has largely finalized the look of the 2025 EV, and they’ve even been focus-testing a potential model with consumers. The vehicle can’t drive yet, but there are more pressing, nigh-existential questions to answer first – namely, how much can the design change and have it still be a Bentley?",
    "Bentley’s 2025 EV is something of an existential crisis for an automaker that has built a brand on traditional decor, performance, and driving feel. EVs, most popularly embodied by Teslas, evoke modern design inside and out, with sleek minimalist exteriors and an interior defined by expansive touchscreens. The contrast between old and new is stark: Bentley’s legacy of auto design is both a strength and an anchor, a century of identity that new brands like Tesla aren’t beholden by.",
    "In an early morning presentation, Bentley Head of Exterior Design John Paul Gregory illustrated the luxury carmaker’s most basic design language that lets onlookers know they’re looking at a Bentley: an iconic silhouette defined by a ‘power line’ from the headlight to the rear door that meets a ‘haunch’ line curving over the rear wheel that juts out far enough to see in rearview mirrors, like a svelte metal lion preparing to leap. But casual observers can pick out Bentleys thanks to their more telltale signifiers – the flat winged ‘B’ icon on the hood and trunk of most models, the ‘flying B’ hood ornaments, and the classic-looking silver front grilles.",
    "Tradition rules Bentley’s design language, so much that its hybrid variants - the crossover Bentayga and the just-released sedan Flying Spur - look just like their petrol versions. And judging by my test drive time with the Bentayga hybrid, they drive just like their more conventional gas-powered versions, too, with identical interior design and fancy trim. Bentley wants its customers to transition easily into hybrid models when it starts offering each of its cars in hybrid by 2023.",
    "But the 2025 EV won’t just be an electrified alternate version of an existing model - it will be an entirely new car, with an entirely new design, Gregory said. It will likely borrow a lot from the all-electric 2019 Bentley EXP 100 GT, including its design materials. Whether that means they’ll integrate the naturally-fallen wood preserved in peat bogs for millennia or the ‘leather-like’ seats made from winemaking byproducts, as described by Car and Driver, remains to be seen.",
    "“It will be a lot more modern, a lot more reduced and elevated, and more about the integration of technology, and how you keep that richness and that craft that you see today,” Gregory said. “It’s leveraging technology to drive the luxury experience. We always do fairly big cars that’s not going to change, but the batteries are spread in an area on the floor, but the proportions might be different and the design might be different, driven more by modern expressions and aerodynamic expressions than luxury.”",
    "And given the long design process, it’s not surprising to hear that the look of the 2025 EV is largely finished, according to Jeff Kuhlman, Bentley Chief Communications and Marketing Officer.",
    "“2025 is tomorrow, essentially, in our world. So that design is done, to a large degree,” Kuhlman told TechRadar. “The more difficult question is how you design for 2030. It’s really looking out to when our full lineup is all electric. How do you design for that?”",
    "Consumer feedback will influence those vehicles, leaving a lot unknown - especially if Bentley decides to carry over current names and designs to the new all-electric range. That would seem appealing - the current Continental GT, for instance, hearkens back to a vehicle of the same name from Bentley’s heritage in the 1950s. But more than legacy are the practical possibilities of designing cars without needing to accommodate engines, and what design space that opens up.",
    "“So now, you’re looking at how I balance those lines, how I give you more balanced performance when the weight has shifted with a battery pack that sits throughout the car,” Kuhlman said. “I would expect designs to change. I would expect performance to be within consumer expectations - but different, in the sense that it might be quiet, but will still have the torque we’ve exhibited.”",
    "The elephant in the room is that Bentleys are expensive, even by luxury car standards; the company’s most ‘affordable’ model is the Bentayga with a base price of $160,000 / £177,000 / AU$364,800. But any additions, from the tri-panel screen upgrade to the ‘winged B’ emblem stitched on the seats, costs extra.",
    "When asked about the perception of luxury vehicles, Bentley North American CEO Georges considers this — not to think about introducing a lower-cost model, but rather to wonder how to improve the brand’s image.",
    "“There are places in the world where luxury cars are not always considered positively – some places it’s ‘oh, you are a gas guzzler’ and others it’s ‘oh you are wealthy, how did you get your money,’” Georges said. “But with electrification, some people will be comfortable showing their wealth.”",
    "The Bentley EV is a seeming solution to several problems, both real and speculated. There is surely a visible benefit to being a more ecologically-mindful consumer, but there might be a practical one, too.",
    "Georges speaks of American buyers and how their electric Bentleys will be able to drive in their cities should their legislators decide to ban gas- and diesel-using vehicles, as Paris, Madrid, and other European metropolises already have. That’s worth planning for, even if the electric car recharging network isn’t robustly spread quite yet.",
    "“If you cannot enter into Los Angeles in the future because it is CO2-emitting, like any other city in the world, what happens? Maybe you don’t have enough charging stations but if you can’t enter a city, what is most painful?” Georges said.",
    "Georges considers this proactive focus on sustainability – including going all-EV by 2030 — part of Bentley’s tradition of disrupting the luxury market. And yet, he believes there’s a market for electric luxury, and points to the Porsche Taycan as satisfying a market demand. But at the end of the day, climate change is happening, he said.",
    "To plan ahead for that, you design a car early for an estimated 5-7 year lifespan, and develop it for years before; in Georges estimation, that’s crafting a car to appeal to consumers 11 years later. Pragmatically, that includes catering to the next potential owners of Bentley cars: Millennials, who will make up over 50% of the luxury item purchasing market by 2025, per Forbes.",
    "Appealing to this younger demographic means embracing sustainability, but also how they use their luxury items; usage, not owning, is more important. So Bentley is thinking about how it can pitch its vehicles to the leasing market: “This is part of the trend of the younger generation. You don’t need to own,” Georges said. “What you buy is exclusive usage of your car, and give it back after three years.”",
    "While Bentley isn’t explicitly thinking about expanding into the services market, Georges theorized about how its cars could work for renters who want an upper-cruft vehicle when they travel: “We did a pilot with Bentley on Demand only for our customers in New York, you go to Los Angeles or Miami and you don’t want to enter a regular car, with your application you can use Bentley on Demand and a fee that is more than acceptable,” he said.",
    "Imagine dropping off said Bentley at the airport, but you don’t have to surrender a key and only have to give whoever’s picking it up a phone code to open the doors and turn it on - this is tech that’s already being developed, including with keyless entry in iOS 15 on some BMW models. “This is what the younger generation want, too. For the most part, they don’t want to own the product, they just want to use it. Look at Spotify,” Georges said.",
    "As futuristic as Teslas and other EVs look, driving them requires relying on a network of charging stations that aren’t as ubiquitous as gas/petrol stops, and they take longer to juice your vehicle back up to full capacity.",
    "The Bentley executives I spoke with weren’t really concerned with how this will limit the grand tourer experience their luxury vehicles are built for – and in truth, since every EV car will face the same compromises on range and recharging, there seemingly isn’t much Bentley can do to ease that experience by 2025.",
    "Like other automakers, Bentley is focused on at least mitigating that range issue, aiming to expand it to over 400 miles in the next 15 years, per Car and Driver. But if it takes that long, Bentley will fall behind its competitors: Tesla’s Long-Range Model S reaches up to 405 miles on a charge, while the Mercedes EQS sedan which is expected to roll off production lines this year has a range of 770km (~480 miles).",
    "Volvo has even claimed it will offer EV models with over 550 miles of range within the next five years. Given the prices potential Bentley owners will be paying, it’s fair to expect better.",
    "But I did discover a line that Bentley design won't cross in replicating gas cars: replicating the muffler rumble of a petrol car with excessive fake noise. Georges vehemently rejected the possibility that the Bentley would include tech to acoustically simulate the tuned growl of a Bentley V8 or W12 engine.",
    "While adding sound to EVs is considered a safety feature for nearby pedestrians that needs to be added to cars in the EU, per The Verge, and Ford added engine-mimicking sounds for inside the car as an option for the Mustang Mach-E, they’re inauthentic in the Bentley exec’s point of view.",
    "Which gets at the central anxiety of electric vehicles: will they fall short in replicating the petrol experience enough to diminish how it feels to drive cars?",
    "Given how well Bentley vehicle sound-proofing is at blocking wind and engine noise, it’s likely that drivers won’t notice the silent electric propulsion in the upcoming EV. That leaves me wondering about every Bentley’s reputation of fast acceleration and top speed, and the company execs didn’t comment on how the EV’s performance would compare to the current petrol/gas-powered lineup.",
    "There are sporty EVs on the market now, so it's feasible to expect speed and acceleration close to what Bentley’s current range delivers - for instance, the Porsche Taycan 4S delivers 490 brake horsepower (bhp) / 360kW, while the Mercedes EQS 580 4MATIC is slated to offer a 385kW power output with a more powerful AMG model in the future offering 560kW power output.",
    "How close it will get to the 552 brake horsepower (bhp)/412 kW/650 Nm of torque that the Bentley Flying Spur’s 12-cylinder W12 engine can deliver is tough to guess without knowing more about the Bentley EV's specs, but the competition suggests it shouldn’t be too much of a stretch to reach comparable performance with the petrol version.",
    "And as for next-generation technology, Bentley isn't shying away from something that could be anathema to its driving experience: autonomous driving.",
    "\"We acknowledge the fact that autonomy is coming, we acknowledge that we wanted to integrate that technology as part of our future product portfolio and design language, but that the identity of Bentley cars is to drive and be driven: we had to make sure that you have the element of taking control of the car,\" Gregory said.",
    "\"Bentley is a driver's car; I think it is just about integrating the right level of technology for the customer at the right time. Optionality is a luxury; the ability to turn it off is a luxury.\"",
    "Ultimately, Bentley is getting ahead of the regulatory curve by setting goals before gas-powered cars stop being sold in countries and get locked out of cities entirely.",
    "But it's in no rush to take the lead in EV capability from the automakers that already have a hold on the electric market (Tesla) or who are upping the ante with premium EVs (Mercedes, Porsche).",
    "Instead, Bentley seems like it's competing with itself to marry its legacy with new technology, and tweak its appeal to the next generation of luxury buyers in the process.",
    "The company seems content to take time evolving and refining its electric range to meet its own deadline: five years after the first Bentley EV arrives in 2025, the others will completely replace the automaker's current lineup of gas and hybrid vehicles."
  ],
  "headers": {
    "7": "Bentley Electric: a turning point?",
    "16": "EV as image control - and brand evolution",
    "27": "Bentley EV: rolling with the compromises"
  },
  "links": {
    "New York": "https://nyassembly.gov/leg/?default_fld=%0D%0A&leg_video=&bn=A4302&term=&Summary=Y&Actions=Y&Committee%26nbspVotes=Y&Floor%26nbspVotes=Y&Memo=Y&Text=Y&LFIN=Y",
    "California": "https://www.gov.ca.gov/2020/09/23/governor-newsom-announces-california-will-phase-out-gasoline-powered-cars-drastically-reduce-demand-for-fossil-fuel-in-californias-fight-against-climate-change/",
    "Car and Driver": "https://www.caranddriver.com/news/a28339028/bentley-exp-100-gt-photos-info/",
    "Forbes": "https://www.forbes.com/sites/pamdanziger/2019/05/29/3-ways-millennials-and-gen-z-consumers-are-radically-transforming-the-luxury-market/?sh=42ef65b4479f",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Mercedes EQS": "https://www.techradar.com/news/mercedes-eqs",
    "claimed": "https://www.techradar.com/news/volvos-fully-electric-cars-will-offer-over-550-miles-of-range-within-five-years",
    "The Verge": "https://www.theverge.com/2019/7/1/20676854/electric-cars-artificial-safety-noise-low-speeds-european-union-rules-2019-2021",
    "Mustang Mach-E": "https://www.techradar.com/news/ford-mustang-mach-e"
  }
}