{
  "source": "https://www.techradar.com/news/obi-wan-kenobi-tv-show-adds-game-of-thrones-actress-as-mystery-character",
  "title": "Obi-Wan Kenobi TV show adds Game of Thrones actress as mystery character",
  "category": "entertainment",
  "updated": "2021-03-02T10:36:59Z",
  "author": "tom-power",
  "summary": "Will she join forces with Ewan McGregor's Jedi Knight?",
  "article": [
    "Disney Plus' upcoming Obi-Wan Kenobi series has added Game of Thrones actress Indira Varma to its cast, according to reports.",
    "Deadline and Variety report that Varma will join Ewan McGregor and Hayden Christensen for the Star Wars spin-off, but it's unclear what role Varma will play in the show. Deadline has reported that details for Varma's character are being kept firmly under wraps, so don't expect any major announcements any time soon.",
    "Varma's name will be familiar to Game of Thrones fans, with the British actress playing the role of Ellaria Sand in HBO's hit adaptation of George R.R. Martin's book series. Varma currently stars in ABC drama For Life, and has also featured in Amazon Prime Video's Carnival Row and Netflix's Paranoid.",
    "Filming on the series is expected to begin in late Spring, and the show thought to launch sometime in 2022 exclusively on Disney Plus.",
    "Plot details are thin on the ground and, much like Varma's potential character, Disney and Lucasfilm won't want any leaks before they officially announce details themselves. What we do know is that the series will take place between Star Wars Episode III and IV - Revenge of the Sith and A New Hope - and star McGregor and Christensen as Kenobi and Darth Vader respectively.",
    "The show was thought to take place eight years after the events of Revenge of the Sith, which had seemingly been confirmed during Disney's D23 2019 Expo. However, a further update on the story's development revealed that the series will occur a decade after Revenge of the Sith instead.",
    "Speaking during a charity livestream in February (via the Star Wars Leaks Reddit page), McGregor also confirmed that the Obi-Wan series would make use of The Mandalorian's Stagecraft technology, and that the show would be filmed in Los Angeles.",
    "Deborah Chow, who has directed two episodes on The Mandalorian, Disney Plus' hit Star Wars spin-off starring Pedro Pascal, will direct the series, while Joby Harold - King Arthur: Legend of the Sword and Army of the Dead screenwriter - has penned the series' script."
  ],
  "headers": {
    "4": "What is the Obi-Wan Kenobi Disney Plus series about?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Deadline": "https://deadline.com/2021/03/obi-wan-kenobi-series-star-wars-game-of-thrones-indira-varma-disney-plus-1234704207/",
    "Variety": "https://variety.com/2021/tv/news/obi-wan-kenobi-disney-plus-series-indira-varma-1234918782/",
    "confirmed": "https://www.starwars.com/news/the-galaxy-far-far-away-just-got-a-little-bigger",
    "revealed": "https://www.starwars.com/news/future-lucasfilm-projects-revealed",
    "Star Wars Leaks Reddit page": "https://www.reddit.com/r/StarWarsLeaks/comments/lalc83/ewan_mcgregor_talking_about_star_wars_and_the/"
  }
}