{
  "source": "https://www.techradar.com/news/first-psvr-2-game-revealed-and-its-a-doozy",
  "title": "First PSVR 2 game revealed – and it’s a doozy",
  "category": "gaming",
  "updated": "2021-03-30T13:53:28Z",
  "author": "adam-vjestica",
  "summary": "One of many on the way",
  "article": [
    "We’re still eagerly awaiting more details on Sony’s PSVR 2 headset, but that hasn’t stopped a developer from confirming that its game will be coming to PS5’s new virtual reality device.",
    "In a surprisingly candid admission on Twitter, developer Vankrupt Games revealed that Pavlov Shack, a game that draws similarities to Counter-Strike, will be coming to PSVR 2 after a fan asked if it would be making its way to the original PSVR.",
    "In fact, Vankrupt Games not only noted that Pavlov Shack was coming to PSVR 2, but said the game wouldn’t be able to run on the older headset as PSVR “doesn’t have the fidelity for Pavlov”.",
    "After suggesting for much of last year that PSVR 2 was nothing more than a pipe dream, Sony has shared more information about its next foray into virtual reality in recent weeks, confirming that the headset will “enable the ultimate entertainment experience with dramatic leaps in performance and interactivity“.",
    "Sony also shared what the PSVR 2 controllers will look like. The controllers will make use of haptic feedback and also adaptive triggers, which are found on the PS5 DualSense controller. The PSVR2 controllers will also support motion gestures and include finger touch detection, so a game can determine where your fingers are resting without you pressing a button.",
    "We’re expecting Sony to show off the PSVR 2 headset design in the near future, but technical specifications are probably still in a state of flux. The headset is likely to undergo various changes before an official announcement is made, but this revelation by Vankrupt Games suggests it may already be in the hands of developers in some form or another.",
    "The PSVR 2 won't be wireless like the Oculus Quest 2, but Sony has promised that there will only be one wire that connects the headset to the PS5. Whether a breakout box will be necessary again is another question, but we wouldn’t be surprised if that was the case.",
    "While Microsoft has dashed hopes of virtual reality support on Xbox Series X, Sony is clearly feeling bullish in its pursuit of capturing a market that's still arguably yet to hit the mainstream."
  ],
  "headers": {
    "5": "More to come"
  },
  "links": {
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "PSVR 2 controllers": "https://www.techradar.com/news/psvr-2-controllers-revealed-heres-what-vr-on-ps5-will-feel-like",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "dashed hopes of virtual reality support": "https://www.techradar.com/news/xbox-series-x-vr-hopes-dashed-by-microsoft",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}