{
  "source": "https://www.techradar.com/news/should-you-buy-the-skyworth-oled-tv",
  "title": "Should you buy the Skyworth OLED TV?",
  "category": "televisions",
  "updated": "2021-09-06T11:00:32Z",
  "author": "henry-st-leger",
  "summary": "Skyworth's OLED TV comes to the US for the first time, but should you buy one?",
  "article": [
    "There's a new OLED TV contender in town – the Skyworth XC9000.",
    "The Chinese television brand has finally made a foray into the US market with its reasonably-priced XC9300 model, and anyone looking for an affordable OLED screen in this day and age will likely be paying attention.",
    "Costing just $1,399 for a 55-inch size, and coming in a larger 65-inch option, the Skyworth OLED is certainly priced on a par with screens like the Vizio OLED or LG B1 – though before the screen is widely reviewed it's going to be hard to say whether it can compete in performance.",
    "The Skyworth OLED in the US isn't quite as impressive on paper as the W82 model available in China, which packs in 8K resolution with an OLED panel, as well as a built-in 12MP camera – though a successful US launch for the XC9000 could well see the range increase in size in the years to come.",
    "For now, we're going to run you through the specs and features of this OLED challenger, to let you know whether it's likely to be an OLED TV worth buying.",
    "The Skyworth OLED comes in both 55-inch and 65-inch sizes, costing $1,399 for the 55-inch model, and $1,999 for the larger size.",
    "The US portal for Skyworth is now shipping out its OLED screens, and the XC9000 is in stock – though an alternative 55-inch XC9300 model (with a TV stand instead of a pair of feet, plus a 120Hz panel) is listed as 'sold out' for the time being.",
    "While Skyworth does use the LG webOS smart platform on some of its screens, this OLED model will make use of Android TV instead. That means you'll get the same broad app support, Google Cast functionality, and Google Assistant integration as on any Android TV – though not the sleeker experience available on Google TV devices.",
    "This is a 4K resolution screen, though you'll only get basic HDR10 support (and HLG, for SRD-HDR broadcasts) rather than the dynamic Dolby Vision and HDR10+ formats found on more premium sets.",
    "Gamers won't find a next-gen experience, sadly: you'll only get HDMI 2.0 ports here, which when paired with the 60Hz panel will limit you to 4K/60Hz gameplay at best. VRR (variable refresh rate) is supported, though – and the alternative XC9300 model does pack in an 120Hz panel, for those of you who'd rather wait for a truly PS5-ready TV.",
    "As an OLED TV, though, you should be getting some decent picture performance out of the box, with true blacks (thanks to those pixels able to turn off entirely) and 'infinite' contrast between light and dark areas of the screen.",
    "The peak brightness of \"500 nits\", though, isn't majorly impressive – the LG C1 hits around 750 nits peak brightness, while OLED evo models like the LG G1 or Sony A90J can hit another 100 or nits even above that, meaning the XC9000 is likely about half as bright as top-tier OLED models. It is, however, on a par with other budget OLEDs like the LG A1.",
    "The Skyworth OLED, or XC9000, is mostly interesting as the first OLED screen to ship from the company in the US so far.",
    "Its specs are equivalent to what you can already get on the market for the price, though having more challengers in the budget OLED space can only be a good thing when it comes to driving down prices and ensuring competition.",
    "Our time with the Vizio H1 OLED taught us that cheap(er) OLED screens aren't best for complex specifications like HDMI 2.1, or connecting current-gen consoles (with the Vizio OLED struggling to display PS5 games at launch). And you simply won't get the performance of higher-end screens, some of which – as in the case of the 48-inch LG C1 – are already undercutting this price point.",
    "For a cheap OLED TV, though, Skyworth's offering is still worth paying attention to, especially if it enjoys any flash discounts in the upcoming Black Friday sales."
  ],
  "headers": {
    "5": "Skyworth OLED pricing, models and sizes",
    "7": "Skyworth OLED specs and features",
    "12": "Should I buy the Skyworth OLED?"
  },
  "links": {
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Vizio OLED": "https://www.techradar.com/reviews/vizio-oled-4k-tv",
    "LG B1": "https://www.techradar.com/news/lg-b1-oled-price-release-date-specs",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "$1,399": "https://na.skyworth.net/collections/shop-by-series/products/xc9000-series-oled-tv-4k-android-tv",
    "$1,999": "https://na.skyworth.net/collections/shop-by-series/products/xc9000-series-oled-tv-4k-android-tv",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "OLED evo": "https://www.techradar.com/news/lg-oled-evo",
    "LG G1": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "Sony A90J": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "budget OLED": "https://www.techradar.com/best/budget-oled-tv",
    "LG A1": "https://www.techradar.com/news/lg-a1-oled-price-release-date-specs-sizes",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}