{
  "source": "https://www.techradar.com/news/totally-rated-nier-replicant-stuns-and-horizon-zero-dawn-goes-free",
  "title": "Totally Rated: Nier Replicant stuns and Horizon Zero Dawn goes free",
  "category": "appliances",
  "updated": "2021-04-30T12:44:33Z",
  "author": "rhys-wood",
  "summary": "Totally Rated goes games galore this week",
  "article": [
    "It’s games all-round on Totally Rated this week as TechRadar and Tom’s Guide cast a verdict on remastered Nier Replicant, while GamesRadar and TechRadar give us the rundown on Horizon Zero Dawn Complete Edition, which is free to download this month.",
    "Nier Replicant dazzles with a revitalized PS4, Xbox One and PC version of the 2010 cult classic. If that wasn’t enough, the critically acclaimed Horizon Zero Dawn Complete Edition goes completely free on PS4 and PS5.",
    "Nier Replicant returns after 11 years with a complete remaster and revisiting for PS4, Xbox One and PC. This refurbished version gives the PS3 and Xbox 360 cult classic a fresh coat of paint on last-gen consoles.",
    "The 2021 revisit of Nier Replicant remains incredibly faithful to the 2010 original while smartly overhauling visuals, combat and audio, as Rhys Wood from TechRadar explained: \"For many, Nier Replicant will be exactly the game they’ve been waiting for.",
    "\"It’s easily one of the highest quality remasters we’ve seen for quite some time, and will definitely appeal to fans familiar with the original 2010 release.",
    "\"Nier Replicant succeeds in matching the quality of Nier Automata in almost every way. The improved visuals, combat and music paired with Yoko Taro’s signature storytelling present an ideal jumping-on point for newcomers to the series, as well as those only familiar with Nier Automata.\"",
    "Nier Replicant deserves praise for its memorable characters, bizarre fantasy world and gripping storytelling, even if the gameplay and level design can get repetitive by the end, as Marshall Honorof from Tom’s Guide said: \"Nier Replicant is a tough game to categorize.",
    "\"The story swings for the fences, but the game mechanics play it safe. The characters are delightful, but the level design isn’t.",
    "\"Still, it’s hard to walk away from Nier Replicant without feeling mostly positive about the experience. It’s something different — even though it’s not really \"new,\" if you played the alternate version 11 years ago.\"",
    "Staying with games, it's over to Sony now, as Horizon Zero Dawn Complete Edition is free to download on PS4 and PS5. The best part? You don't even need a PS Plus or PlayStation Now subscription to take advantage of this excellent offer.",
    "From now until May 14, you can download Horizon Zero Dawn at zero cost, and given the incredible quality of this 2017 release from Guerilla Games, you’ll definitely be kicking yourself if you miss out.",
    "GamesRadar’s Rachel Weber said of Horizon Zero Dawn: “The game is an endless sense of wonder and awe that pushes you onward no matter what you’re doing. The more time I spend in Horizon: Zero Dawn’s world, the less I want to leave.”",
    "TechRadar’s Nick Pino agreed it was one of the best games of 2017: \"Horizon: Zero Dawn is one of the best games of the last-generation and is well worth the download space if you have yet to play it.",
    "“In our 2017 review of the game, I called it an absolute must-play and a staple in any PS4 owner's library – all of which still holds true today.\"",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every Thursday."
  ],
  "headers": {
    "2": "Nier Replicant revisits a revered release",
    "9": "Horizon Zero Dawn is free to download"
  },
  "links": {
    "Nier Replicant": "https://www.techradar.com/reviews/nier-replicant",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}