{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-october-29-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-10-29T15:00:06Z",
  "author": "axel-metz",
  "summary": "Here’s what’s new on Netflix and other streamers this weekend",
  "article": [
    "It’s almost Halloween, folks! That must surely mean we’re in for a slew of new horror movies this weekend, right? Wrong. In our pick of this week’s biggest streaming additions, there’s only one major horror movie to note – yet another Paranormal Activity flick – in amongst a decidedly eclectic mix of sequels, series and quirky new animations.",
    "But horror fans needn’t fear. Interestingly, many of this year’s scary movies dropped on streamers a couple of weekends ago (or are arriving after Halloween itself), so there’s still plenty of blood and gore to sink your teeth into.",
    "Below, then, we’ve rounded up the seven biggest movies and TV shows arriving on streaming services this weekend – with picks from the likes of Netflix, Amazon Prime and HBO Max.",
    "In this prequel to Zack Snyder's Army of the Dead, small-town bank teller Dieter (Matthias Schweighöfer, reprising his role) is recruited into a crew of Interpol's most wanted criminals in order to heist a sequence of legendary, impossible-to-crack safes across Europe.",
    "Schweighöfer inherited the directing chair from Snyder in this one, and is joined in the cast by the likes of Natalie Emmanuel, Guz Khan and Stuart Martin. Don’t expect too much of its predecessor’s uber violent style, but Army of Thieves nonetheless sounds like an enjoyable, easy-to-watch mix of Money Heist and The Suicide Squad.",
    "Criticism has so far been kind, so Schweighöfer’s debut seems a safe pick for a good time this weekend.",
    "Now available to stream on Netflix",
    "In a rare case of a movie’s release being brought forward (from a planned March 2022 date), Paranormal Activity: Next of Kin heads to Paramount Plus today as an “unexpected reimagining of the beloved horror franchise,” according to ViacomCBS’ streaming bosses.",
    "A reimagining? Maybe. But unexpected? We don’t reckon so. Expect more of the series’ customary handheld horror, which should pack enough jump scares to pique the interest of returning fans.",
    "UK audiences, though, will have to wait until this one lands in theaters. Our advice? Watch any of the previous six movies for an equivalent experience.",
    "Now available to stream on Paramount Plus in the US",
    "A new adult animated comedy series that supposedly targets the “pulsing heart of hypebeast culture,” Fairfax lands on Prime Video this weekend to add some cartoon satire to your entertainment routine.",
    "The show follows the “never-ending quest for clout” of four middle school best friends on Fairfax Avenue in Los Angeles, and stars the likes of Billy Porter, Zoey Deutch, Rob Delaney, Ben Schwartz and John Leguizamo.",
    "Its humor seems pretty on-the-nose, but given our fondness for Netflix’s Neo Yokio – a similarly satirical skewering of today’s young people – we’re willing to give Fairfax a shot.",
    "Now available to stream on Amazon Prime Video",
    "Star Trek: Prodigy was originally ordered as a Nickelodeon series, but finds its way to Paramount Plus this weekend as the first animated Star Trek series aimed exclusively at younger audiences – as well as Trekkies everywhere.",
    "It follows a motley crew of young aliens aboard the U.S.S. Protostar, who must learn to work together as they make their way towards the Alpha Quadrant. Jason Mantzoukas, Jameela Jamil, Jason Alexander and Daveed Diggs are among the show’s extensive voice cast.",
    "Star Trek: Prodigy is only available to stream on Paramount Plus right now, but UK viewers will be able to catch it on – wait for it – Nickelodeon later in the year.",
    "Now available to stream on Paramount Plus in the US",
    "Hot on the coattails of Foundation and Invasion, Apple’s latest drama series takes the action away from space and towards a very different type of star.",
    "Swagger is set in the world of youth basketball and is inspired by the childhood of NBA ace Kevin Durant, who serves as a producer alongside series creator Reggie Rock Bythewood. The ensemble cast features O'Shea Jackson Jr., Quvenzhané Wallis and newcomer Isaiah Hill.",
    "Sports-based shows aren’t all that common nowadays, but given Apple’s success with soccer drama Ted Lasso, we’d say this one is absolutely worth a look.",
    "Now available to stream on Apple TV Plus",
    "Doctor Who returns for the thirteenth (!) season since its 2005 revival this Saturday, marking the final bow of both Jodie Whittaker and head writer Chris Chibnall before ex-showrunner Russell T Davies takes back the reins in 2022.",
    "For only the second time in the programme's history – and the first since 1986 – this latest season will tell one complete story across its entirety, rather than comprising self-contained episodes.",
    "Mandip Gill and John Bishop both return as the Doctor’s travelling companions, so expect more of the show’s customary space-hopping hijinks.",
    "Now available to stream on BBC iPlayer",
    "The second season of Sam Boyd’s romantic comedy series lands on HBO Max this weekend, this time stepping back from Anna Kendrick’s Darby to instead focus on William Jackson Harper's character, Marcus Watkins.",
    "Kendrick will appear again – though not in a lead capacity – alongside the likes of Jessica Williams, Chris Powell, Punkie Johnson and Ego Nwodim. The anthology is made up of 10 episodes, streaming in three weekly batches, with the first three episodes available to watch now.",
    "UK viewers: season 1 aired on BBC One a few months after streaming in the US, so we expect season 2 to do the same.",
    "Now available to stream on HBO Max in the US"
  ],
  "headers": {
    "3": "Army of Thieves (Netflix)",
    "7": "Paranormal Activity: Next of Kin (Paramount Plus)",
    "11": "Fairfax (Amazon Prime Video)",
    "15": "Star Trek: Prodigy (Paramount Plus)",
    "19": "Swagger (Apple TV Plus)",
    "23": "Doctor Who season 13 (BBC iPlayer)",
    "27": "Love Life season 2 (HBO Max)"
  },
  "links": {
    "new horror movies": "https://www.techradar.com/news/new-horror-movies",
    "couple of weekends ago": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-october-8-2021",
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Army of the Dead": "https://www.techradar.com/news/army-of-the-dead-on-netflix-is-zack-snyders-best-movie-yet",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "Neo Yokio": "https://www.techradar.com/news/neo-yokio-is-the-bizarre-netflix-anime-you-need-to-put-at-the-top-of-your-watch-list",
    "Foundation": "https://www.techradar.com/news/foundation-on-apple-tv-plus-release-date-plot-cast-and-what-we-know-so-far",
    "Invasion": "https://www.techradar.com/features/inside-invasion-apple-tvs-alien-sci-fi-show-thats-really-about-human-isolation",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-3-what-we-know-so-far"
  }
}