{
  "source": "https://www.techradar.com/news/future-microsoft-surface-could-get-a-feature-that-might-win-over-ipad-fans",
  "title": "Future Microsoft Surface could get a feature that might win over iPad fans",
  "category": "computing",
  "updated": "2021-07-28T13:17:39Z",
  "author": "darren-allan",
  "summary": "Nifty hinge design is reminiscent of Apple’s Magic Keyboard for iPad Pro",
  "article": [
    "Microsoft could be planning a fancy hinge for a future piece of Surface hardware which allows for adjusting the angle of the display in a very different manner when the device is open, going by a newly uncovered patent.",
    "The patent filed with FPO, as spotted by Windows Latest, shows a concept where the laptop hinge is connected to a stand mechanism which the display is on, allowing the screen to be rotated to different angles relative to the stand when the portable is opened up.",
    "For those who’ve seen Apple’s Magic Keyboard for iPad Pro, Microsoft’s would-be invention functions in a similar method to its stand, except Microsoft is looking at a far more advanced implementation of a stand and hinge mechanism – one which would offer much more freedom in terms of the angles of adjustment available.",
    "Microsoft’s theoretical Surface device using this mechanism would allow the user to have the screen in a normal laptop-style position, or tilted upwards, and indeed tilted so far that it’s almost flat (and nearly parallel to the base keyboard section) if needed.",
    "As ever, a patent being filed does not mean Microsoft will ever use the concept outlined in a finished product, but it’s certainly a possibility. It’s also possible that the company will experiment with different implementations of this kind of hinge and decide that they aren’t worth the trouble. More patents disappear into the R&D darkness never to be seen again than are realized, after all.",
    "This potential innovation does make sense for Microsoft in some respects, and could be a good fit for a future Surface Book, at least in theory. That’s because the flexibility of being able to angle the screen in any fashion could be particularly useful in terms of productivity, allowing for the display to be put almost flat if needed (as seen with the Surface Studio all-in-one).",
    "It would also fit with the Surface Book range given that it looks like possibly being an expensive little mechanism, and the Books are premium pieces of hardware that folks are used to paying a good deal of cash for (higher-end models are eye-wateringly costly).",
    "Who knows, though, maybe this could even usher in an entirely new category of Surface device. Or we’ll never hear of it again…"
  ],
  "headers": {
    "5": "Analysis: Surface Booker’s prize?"
  },
  "links": {
    "Surface": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "FPO": "https://www.freepatentsonline.com/WO2021145886A1.pdf",
    "Windows Latest": "https://www.windowslatest.com/2021/07/28/microsoft-patent-hints-at-surface-book-with-new-keyboard-hinge-design/",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Apple’s Magic Keyboard for iPad Pro": "https://www.techradar.com/news/older-apple-magic-keyboards-will-work-with-new-129-inch-ipad-pro-but-wont-precisely-fit",
    "Surface Book": "https://www.techradar.com/reviews/surface-book-3",
    "Surface Studio": "https://www.techradar.com/reviews/microsoft-surface-studio-2"
  }
}