{
  "source": "https://www.techradar.com/news/amazon-music-unlimited-adds-dolby-atmos-spatial-audio-at-no-extra-cost",
  "title": "Amazon Music Unlimited adds Dolby Atmos spatial audio at no extra cost",
  "category": "audio-visual",
  "updated": "2021-10-19T16:07:21Z",
  "author": "rhys-wood",
  "summary": "Sony's 360 Reality Audio is being added, too",
  "article": [
    "Amazon Music listeners are getting a boost to their subscriptions, as Dolby Atmos and Sony's 360 Reality Audio are launching on the streaming service across iOS and Android devices. The best part is the update comes at no extra cost to existing subscribers.",
    "Users can experience these new spatial audio options with the headphones and earbuds they already own, with no extra special peripherals required. If you prefer wireless speakers, then you're in luck as spatial audio has also been added to Alexa Cast-supported products like the Amazon Echo Studio.",
    "The service will be adding and remastering music in its vast library with music from artists like Alicia Keys, Coldplay, Lil Nas X and more having been mixed in Dolby Atmos and 360 Reality Audio for a heightened listening experience. Additionally, an upcoming Imagine Dragons EP will release exclusively on Amazon Music Unlimited in November, which has been specially mixed in Dolby Atmos.",
    "Amazon Music Unlimited has upped the music streaming service competition by offering spatial audio via iOS and Android devices, and at no extra cost at that. Its biggest competitor, Spotify, currently does not offer Dolby Atmos or other spatial audio options natively(though you never know what may come with the soon-to-be-released Spotify HiFi).",
    "The next best option for Spotify users in this regard is to listen to the streaming service on an iOS 15 device with a pair of AirPods Pro or AirPods Max, both of which support the feature and can spatialize any audio source.",
    "Being able to experience spatial audio formats like Dolby Atmos on any pair of headphones is also a massive bonus to customers who might not be willing to shell out for a new, expensive pair of cans. The fact that the feature is now readily available on your preferred device - and without needing pricey equipment - is a genuine advantage that Amazon Music Unlimited has over Spotify.",
    "However, Apple Music also offers spatial audio options at no extra cost to subscribers, something that's also available on both iOS and Android devices. So, while spatial audio options are certainly robust on Amazon Music Unlimited, it's certainly not the first music streaming service to offer it."
  ],
  "headers": {
    "3": "Analysis: a genuine advantage over the competition?"
  },
  "links": {
    "Amazon Music": "https://www.techradar.com/reviews/amazon-music-hd",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Sony's 360 Reality Audio": "https://www.techradar.com/news/first-look-sony-360-reality-audio",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "Alexa Cast": "https://www.techradar.com/news/alexa-cast-lets-you-control-speakers-through-your-smartphone",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "iOS 15": "https://www.techradar.com/how-to/how-to-get-ios-15-developer-beta-on-your-iphone",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Apple Music": "https://www.techradar.com/reviews/apple-music"
  }
}