{
  "source": "https://www.techradar.com/news/mobvoi-ticwatch-pro-s-updates-an-older-design-with-more-storage-and-fitness-apps",
  "title": "TicWatch Pro S smartwatch gives an older design more storage and fitness apps",
  "category": "wearables",
  "updated": "2021-03-09T15:00:36Z",
  "author": "david-lumb",
  "summary": "The MobVoi TicWatch Pro S is an update on the 2018 TicWatch Pro",
  "article": [
    "Mobvoi has released another annual upgrade to its TicWatch Pro smartwatch to update it for 2021. The newly-named TicWatch Pro S has double the storage for more songs, apps, and data.",
    "The original TicWatch Pro came out in 2018, and Mobvoi updated it a year ago, so this is more a refresh of a popular model than a wholly new smartwatch – that was the TicWatch Pro 3, which launched in September 2020. The new TicWatch Pro S inherits some apps from the latter and is a bit cheaper to boot, costing $259 / £222 (around AU$339), under the Pro 3’s $299 / £279 / AU$449 pricetag. It's available in the US, UK, and Europe on Mobvoi.com and Amazon.",
    "The TicWatch Pro S has twice the storage of its predecessor (4GB to 8GB) and gets Mobvoi’s upgraded TicExercise 3.0 fitness tracking with a refined UI, lap counter, and Vo2 Max tracking. Sleep tracking has also been improved with TicSleep 2.0, adding weekly sleep reports and guidance for improving sleep – but perhaps most usefully, you can keep it on while the smartwatch’s battery-saving Essential Mode is active.",
    "There are also more Tic-branded apps, like TicBreathe to monitor heart rate and suggest breathing exercises when it detects stress along with TicHearing to monitor ambient volume and notify you if it’s dangerously loud outside.",
    "The TicWatch Pro 2020 update doubled the RAM to 1GB and the TicWatch Pro S doubled the storage to 8GB, making it more modern and competitive against other fitness-tracking smartwatches.",
    "But the TicWatch Pro S’ battery hasn’t improved, and despite its 415mAh capacity, we would expect it to still last around two days before recharging. It also retains the Snapdragon Wear 2100 chipset that debuted on the original TicWatch Pro and has since been surpassed – even the TicWatch Pro 3 has a Snapdragon Wear 4100.",
    "While only a few other smartwatches are packing the Wear 4100, other fitness-tracking wearables feature the still-powerful Snapdragon Wear 3100, including the Samsung Galaxy Watch Active 2. If you absolutely need power, there are other watches to consider."
  ],
  "headers": {
    "4": "Mobvoi TicWatch Pro S: Some improvements, some aging specs"
  },
  "links": {
    "TicWatch Pro": "https://www.techradar.com/reviews/ticwatch-pro-review",
    "updated": "https://www.techradar.com/news/theres-a-new-ticwatch-pro-from-mobvoi-for-2020-with-a-few-minor-upgrades",
    "TicWatch Pro 3": "https://www.techradar.com/reviews/ticwatch-pro-3"
  }
}