{
  "source": "https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers",
  "title": "Leaked Sony FX3 looks like it could be a Sony A1 for pro filmmakers",
  "category": "cameras",
  "updated": "2021-02-11T13:16:24Z",
  "author": "mark-wilson",
  "summary": "Sony really is on a camera roll, it seems",
  "article": [
    "Not content with dropping an 8K curveball in the form of the new Sony A1, the camera giant appears to preparing another attack on the likes of Canon and Blackmagic in the form of the Sony FX3 – if a new leaked image is to be believed.",
    "The Santa Claus of camera rumors, Nokishita, posted the above image on Twitter with the caption 'image of Sony FX3'. While the post contained no info about the cinema camera's possible specs, Sony Alpha Rumors yesterday speculated that the rumored FX3 would be an 8K video camera that can also shoot oversampled DCI 4K footage.",
    "So what exactly is the strange mix of a Sony cinema camera and Alpha body? The leaked FX3 image contains references to both camera lines, which traditionally divide Sony cameras between filmmaking models and consumer hybrid cameras.",
    "It's possible that the rumored Sony FX3 might blur the lines and effectively act as an equivalent of the Sony A1 for filmmakers. Like the A1, the camera's 'FX' branding suggests it will be a full-frame camera, but with some filmmaking-specific design touches and a body size that's similar to Alpha cameras like the Sony A6600. In other words, cinema camera power in an Alpha-style body.",
    "Of course, this is all speculation right now, but it also raises interesting questions about what features will be packed into the Sony FX3. Will it have built-in ND filters, which are absent on the Sony A1, or perhaps in-body image stabilization (IBIS)?",
    "Given its professional leanings, we'd imagine the former is a more likely inclusion – and the Sony FX3's form factor suggests it could also be ideal for aerial videography duty in the forthcoming Sony Airpeak drone.",
    "Whatever its final specs, the Sony FX3 looks like it'll be another powerful rival to the likes of the Canon EOS C70 and Blackmagic Pocket Cinema Camera.",
    "Both of those cameras squeeze powerful cinema camera specs into compact bodies that were previously unavailable to professional videographers. This means they can be used in tricky shooting situations, like cramped spaces, or in action scenes that require filmmakers to be fleet of foot.",
    "While Sony isn't exactly short of video-focused cameras – from the Sony A7S III to the Sony FX6, which only arrived at the end of last year – it does appear to be going all-out for pro filmmaking dominance, and the Sony FX3 would be another weapon in its growing arsenal.",
    "Between its FX cinema camera line and its pro-friendly Alpha models, there will soon be Sony options available at all price points and sizes. While the Sony A1 arrived with claims of being 'one camera to rule them all', it does still lean towards photographers – so the FX3 could simply be its compact, video-leaning sibling.",
    "Whether or not the FX3 will have the same 8K sensor as the A1 is something we'll likely have to wait until the CP+ show (from February 25) to find out, as that's rumored to be where the camera will be fired from Sony's launch canon. But between the FX3 and Sony Airpeak drone, it's certainly an exciting time to be a pro filmmaker with E-mount leanings."
  ],
  "headers": {
    "6": "Gunning for glory"
  },
  "links": {
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Nokishita": "https://twitter.com/nokishita_c/status/1359623975278583808",
    "Sony Alpha Rumors": "https://www.sonyalpharumors.com/confirmed-sony-registered-this-new-ilme-fx3-camcorder/",
    "Sony A6600": "https://www.techradar.com/reviews/sony-a6600",
    "Sony Airpeak drone": "https://www.techradar.com/news/sony-airpeak-drone-release-date-price-rumors-and-leaks",
    "Canon EOS C70": "https://www.techradar.com/news/canon-eos-c70-is-a-cross-between-a-canon-eos-r5-and-cinema-camera",
    "Blackmagic Pocket Cinema Camera": "https://www.techradar.com/reviews/blackmagic-pocket-cinema-camera-4k",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii"
  }
}