{
  "source": "https://www.techradar.com/news/what-if-episode-8-may-be-hiding-a-star-wars-easter-egg-in-plain-sight",
  "title": "What If episode 8 may be hiding a Star Wars Easter egg in plain sight",
  "category": "entertainment",
  "updated": "2021-09-30T09:22:19Z",
  "author": "tom-power",
  "summary": "What If... Star Wars crossed over into the Marvel multiverse?",
  "article": [
    "Spoilers follow for What If episode 8. You have been warned.",
    "What If...?, Marvel's animated anthology TV show, is nearing its end point on Disney Plus. And the series has contained many call backs and Easter eggs to the MCU (and Marvel comics) ahead of its upcoming season 1 finale.",
    "But there's one unusual reference that Marvel fans think they've spotted in episode 8: some believe the penultimate episode – What If... Ultron Won? – is hiding a Star Wars Easter egg in plain sight.",
    "The secret in question is seen during the battle between Uatu the Watcher and Ultron. After the latter discovers the multiverse, and vows to destroy humanity in each dimension, the pair duke it out. One powerful Ultron attack sends the Watcher careering through numerous universes, and it's the backdrop to one of these realities that has intrigued MCU and Star Wars fans.",
    "Take a look at the apparent Easter egg below (courtesy of Twitter user Nadav Gill):",
    "As Gill speculates, this background looks eerily similar to Mustafar, the lava planet where Obi-Wan Kenobi and Anakin Skywalker's duel takes place in Star Wars: Revenge of the Sith. It's also the volcanic world where Darth Vader builds his castle on the site of an old Sith temple.",
    "Gill isn't the only Marvel and Star Wars fan to present this Easter egg theory either. Redditors, such as thefalcon85, and other Twitter users are convinced that this scene is a reference to Mustafar, too. There are lava-based worlds in the Marvel multiverse, but fans claim that one of the background's buildings is almost identical to Fortress Vader – hence their excitement over this revelation.",
    "What If's showrunners are yet to confirm if this is a Star Wars Easter egg. If it is, though, this would represent the first Marvel-Star Wars crossover in the MCU. And that would be very cool.",
    "It's highly unlikely. As surreal and fan service-y as it would be, we wouldn't expect characters from the MCU or Star Wars to ever meet in a movie or TV production.",
    "It hasn't been for a want of trying, however. Ahead of What If's premiere on August 11, head writer A.C. Bradley told Collider that she had tried to convince Marvel to include a story that involved a Star Wars character.",
    "\"I was kind of notorious for trying to get a Star Wars character involved, and we did try at one point,\" Bradley explained. \"But there was just... It's kind of like, 'Play with the sandbox you're given. We gave you the entire [Marvel Cinematic Universe], run with that'. Still, Luke Skywalker would be an amazing Jedi. [Laughs] He'd be an amazing Avenger, he IS a Jedi.\"",
    "Meanwhile, Marvel Studios president Kevin Feige has also downplayed such a possibility. Speaking to Yahoo in February, Feige was asked if a Marvel-Star Wars crossover would ever happen.",
    "“If you’d ask me if anything we’re talking about right now was in the realm of possibility 20 years ago, I would’ve said, ‘I don’t think so,’” Feige said, before adding: “But I really don’t think so. I don’t think there’s any reason for it [an MCU-Star Wars crossover event].”",
    "So it sounds like a Star Wars and MCU team up is out of the question. Still, we can't help but think that Marvel fans are right in their assertions that What If episode 8 does contain a Star Wars/Mustafar reference.",
    "After all, Feige is currently developing an untitled Star Wars movie alongside LucasFilm's Kathleen Kennedy, and he's a self-confessed Star Wars fan. It wouldn't be a huge surprise to us, then, if Feige was the individual responsible for this plausible Star Wars Easter egg's inclusion."
  ],
  "headers": {
    "8": "Analysis: could we see Marvel and Star Wars live-action crossovers?"
  },
  "links": {
    "thefalcon85": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/pxprsb/episode_discussion_what_if_season_1_episode_8/het3cdb/?utm_source=reddit&utm_medium=web2x&context=3",
    "other": "https://twitter.com/Seven_of_7_/status/1443463502182580224",
    "Twitter": "https://twitter.com/chiconesve/status/1443378988504829952",
    "users": "https://twitter.com/CruzaderJC/status/1443229320332386305",
    "Collider": "https://www.youtube.com/watch?v=Qz-wFxVurmE&t=1s",
    "Yahoo": "https://www.yahoo.com/entertainment/marvel-star-wars-movie-crossover-kevin-feige-160027143.html"
  }
}