{
  "source": "https://www.techradar.com/news/google-says-chrome-is-helping-ease-the-transition-to-hybrid-working",
  "title": "Google says Chrome is helping ease the transition to hybrid working",
  "category": "computing",
  "updated": "2021-06-03T01:23:39Z",
  "author": "anthony-spadafora",
  "summary": "A modern browser is a must for hybrid working",
  "article": [
    "As organizations prepare to make the transition from solely working from home to hybrid working, Google has highlighted how its Chrome browser is purpose-built for flexible work.",
    "In a new blog post, Chrome Group Product Manager RK Popkin explained how having a modern browser will be essential to the success of organizations' hybrid working strategies, saying:",
    "“As our organization, and other organizations of all sizes, transition to a more hybrid way of working, it’s absolutely key to have a modern browser that’s built to support both admins and end users. The good news is, Chrome is made for this! Literally. It’s purpose-built for flexible work—and as the future unfolds and businesses’ needs continue to evolve, we’re committed to making sure our browser is even easier to manage, even more secure, and even more helpful, so all of us can be more productive.”",
    "Going forward, the search giant plans to build Chrome to be a stronger asset for the enterprise by focusing on simpler management, modernized security, productivity and helpful integrations.",
    "Recent releases have made it much easier for admins to track Chrome deployments and this also includes the apps and Chrome extensions used across their organizations.",
    "For instance, Google's new daily version report allows IT teams to see all versions (including minor versions) in a single report to support compliance make it easier for them to manage their entire deployment. At the same time, a new Apps & Usage report provides helpful visibility into all installed extensions, Progressive Web Apps (PWAs), Chrome apps and Android apps. The report even allows admins to force install or block individual apps as well as see their versions and permissions.",
    "Another recent feature in Chrome that was created based on customer requests allows admins and even service desk employees to clear an end user's browsing data, cookies and cache remotely to help with troubleshooting.",
    "Later this summer Google plans to launch new extension management improvements that will change how the Chrome Web Store behaves so that end users can request extensions and admins can then approve or deny these installations from a centralized list in the Admin Console. Another new release is extension details which allows admins to find out exactly what extensions are installed where, who makes them, what resources they're using and other additional details right from the Admin Console.",
    "As more of our work is done from a browser than ever before, giving admins the tools to manage Chrome deployments and apps will likely help keep both end users and their organizations secure when adopting a hybrid working strategy."
  ],
  "headers": {
    "4": "Chrome deployments and management"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "blog post": "https://cloud.google.com/blog/products/chrome-enterprise/how-chrome-browser-is-helping-google-transition-to-hybrid-work",
    "browser": "https://www.techradar.com/best/browser",
    "Chrome extensions": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "PWAs": "https://www.techradar.com/news/google-starts-ditching-android-apps-in-favor-of-web-apps-on-chrome-os",
    "service desk": "https://www.techradar.com/best/best-helpdesk-software",
    "Chrome Web Store": "https://www.techradar.com/news/google-announces-chrome-web-store-security-crackdown",
    "Admin Console": "https://www.techradar.com/news/google-drive-is-getting-an-important-security-upgrade"
  }
}