{
  "source": "https://www.techradar.com/news/the-sony-a7-iv-is-a-late-contender-for-mirrorless-camera-of-the-year",
  "title": "The Sony A7 IV is a late contender for mirrorless camera of the year",
  "category": "cameras",
  "updated": "2021-10-21T16:05:49Z",
  "author": "mark-wilson",
  "summary": "But the big upgrades comes with a big price increase",
  "article": [
    "The Sony A7 IV is one of the most hotly-anticipated cameras of the past few years – and now the full-frame camera has landed, it's pretty clear to see why. On paper, it's shaping up to be one of the best mirrorless cameras you can buy. (Want to jump straight to our first impressions? Head to our hands-on Sony A7 IV review).",
    "The A7 IV is the successor to the Sony A7 III, a camera that arrived in March 2018 and immediately changed our expectations for entry-level full-frame cameras. The bad news is that the A7 IV will be pricier than its predecessor, costing $2,499 / £2,400 / AU$$4,299 (body only) when it becomes available from December (or late November in Australia). But its new treats could well justify that 20%-30% price hike from the A7 III.",
    "So what's new? The A7 IV brings six main improvements. Firstly, it has a new 33MP full-frame sensor, up from 24MP on the A7 III. Sony says the dynamic range is unchanged at 15 stops, but that you'll get better detail in good lighting at low ISOs. That extra resolution should also be a boon for those who like to crop their photos.",
    "Sitting alongside that new sensor is a new Bionz XR processor, the same as the one in the ultra high-end Sony A1. This dramatically improves the A7 IV's burst-shooting powers – not in terms of frames-per-second speed (that's still a max of 10fps), but instead for the camera's buffer. When shooting uncompressed raw files, you can rattle off an impressive 828 frames in one go when using a CFexpress Type A card.",
    "The A7 IV's electronic viewfinder and rear screen have both been upgraded from the A7 III, too. You now get a 3.69-million dot viewfinder (up from its predecessor's 2.36-million dot affair) and a 3-inch vari-angle screen, which means it can swivel round to face the direction you're shooting.",
    "The latter is likely to be popular with video shooters, and Sony has crammed in other treats for filmmakers, too. There's a new 4K/60p mode, although this is sadly only available in the cropped 'Super 35' mode (which uses an area of the sensor that's similar to an APS-C sensor).",
    "Still, you can shoot 4K/30p video using the full width of the sensor (oversampled from the 7K resolution) and the A7 IV makes the leap to 10-bit 4:2:2 color sampling, giving you much more editing leeway than the 8-bit A7 III.",
    "The fifth improvement from the A7 III is autofocus performance. The A7 IV has Sony's latest AF system, which means real-time Eye AF tracking for humans, animals and birds. But the crucial improvement is that all of these modes are available when shooting video, too. You also get some new focus aids, including the 'Focus Map' (a grid of colored blocks that show which parts of your frame are in focus).",
    "Lastly, the A7 IV has much-improved connectivity compared to the A7 III. Its USB-C port has twice the bandwidth of its predecessor's connector, and there's now 5GHz Wi-Fi for speedier photo-sharing with your phone. Throw in Sony's Multi-Interface shoe (for powering external mics like the Sony XLR-K3M) and you have a very compelling all-rounder for both stills and video.",
    "As we've discovered, all of these extras have increased the Sony A7 IV's price tag to $2,499 / £2,400 / AU$$4,299 (body only). So while the A7 IV remains the 'basic' option in Sony's full-frame Alpha range, its price now pushes it well beyond that description.",
    "If you've been thinking of buying a full-frame mirrorless camera, then you've probably been waiting for the Sony A7 IV to arrive. Now it's here, is it really the best option at this price?",
    "While we can't be absolutely sure until we've fully tested Sony's new A7 all-rounder, it's certainly a very strong alternative to the current options from Canon, Nikon and Panasonic.",
    "For sheer value, we still think the Nikon Z5, Panasonic S5 and Sony A7 III (which will hopefully see some price cuts) remain good full-frame choices. We're also still fans of the Fujifilm X-T4, despite its smaller APS-C sensor. But when you move up to the next price bracket, the Sony A7 IV is certainly more than a match for the Canon EOS R6.",
    "It's a shame the A7 IV isn't a little closer to its predecessor's price tag. Still, when you consider its new sensor, processor, screen, EVF, autofocus and video powers, then the price hike doesn't feel excessive. The Canon EOS R6 offers a comparable feature set for $2,499 / £2,499 / AU$4,499, but the A7 IV's 33MP resolution (compared to the EOS R6's 20.1MP sensor) might just swing it for stills shooters.",
    "Ultimately, your decision is likely going to come down to the kind of photos and videos you take. If your image-making diet is pretty varied, then the A7 IV and Sony's E-mount are a compelling sweet spot, offering a great range of features and lenses to suit most situations.",
    "Whether or not that makes it worth the considerable price jump from today's entry-level full-frame options, like the Nikon Z5, Nikon Z6 II or Sony A7 III, is something we'll find out in our full review very soon."
  ],
  "headers": {
    "10": "Analysis: The A7 IV mostly lives up to the hype"
  },
  "links": {
    "best mirrorless cameras": "https://www.techradar.com/news/best-mirrorless-camera",
    "Sony A7 IV review": "https://www.techradar.com/reviews/sony-a7-iv",
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Nikon Z5": "https://www.techradar.com/reviews/nikon-z5",
    "Panasonic S5": "https://www.techradar.com/reviews/panasonic-lumix-s5",
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4",
    "Canon EOS R6": "https://www.techradar.com/reviews/canon-eos-r6-review"
  }
}