{
  "source": "https://www.techradar.com/news/nintendo-is-being-sued-over-joy-con-drift-again",
  "title": "Nintendo is being sued over Joy-Con drift… again",
  "category": "gaming",
  "updated": "2021-01-25T11:27:34Z",
  "author": "adam-vjestica",
  "summary": "Another class-action lawsuit has been filed",
  "article": [
    "Nintendo is being sued over Joy-Con drift again.",
    "Canadian firm Lambert Avocat Inc. has filed an application to bring a class action against the Japanese company (thanks, Eurogamer), as it seeks to “obtain a compensation for all Québec consumers who bought the Nintendo Switch and Nintendo Switch Lite gaming systems, as well as Joy-Con and Nintendo Switch Pro controllers” .",
    "The firm believes that the Joy-Con controllers have a “hidden defect”, and fail to meet the standards under the Consumer Protection Act.",
    "Lambert Avocat Inc. says its client bought a Nintendo Switch in November 2017, and after 11 months of using it “noticed that her left Joy-Con controller was defective. Her character would move in a direction without her input, a problem known as the Joy-Con Drift.”",
    "Lambert Avocat Inc.’s client then contacted Nintendo who repaired the faulty Joy-Con, but drifting occurred on her right Joy-Con, a second pair of Joy-Con controllers she purchased, as well as her Nintendo Switch controller.",
    "After previously being sued by a child, and even issuing a formal apology, it appears that Nintendo’s Joy-Con drift woes refuse to go away.",
    "Nintendo president Shuntaro Furukawa has previously said: \"Regarding the Joy-Con, we apologize for any trouble caused to our customers. We are continuing to aim to improve our products, but as the Joy-Con is the subject of a class-action lawsuit in the United States and this is still a pending issue, we would like to refrain from responding about any specific actions.\"",
    "Nintendo isn’t the only company to have been sued over controller issues, though. Microsoft has also been sued by an angry gamer who claimed Xbox One controllers suffer from the same problem.",
    "The issue of Joy-Con drift is more damaging for Nintendo Switch Lite owners in particular. While the Joy-Con can be removed from the standard Switch, you'd need to send in your Nintendo Switch Lite system for repair as they cannot be detached."
  ],
  "headers": {
    "5": "Objection!"
  },
  "links": {
    "Joy-Con drift": "https://www.techradar.com/how-to/how-to-fix-joy-con-drift-on-nintendo-switch",
    "filed an application": "https://lambertavocatinc.com/class-action-nintendo",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-01-24-nintendo-is-now-facing-a-further-joy-con-drift-class-action-suit-in-canada",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo Switch Pro controllers": "https://www.techradar.com/reviews/nintendo-switch-pro-controller",
    "Consumer Protection Act": "http://legisquebec.gouv.qc.ca/en/ShowDoc/cs/P-40.1",
    "sued by a child": "https://www.techradar.com/news/now-nintendo-is-being-sued-by-a-child-over-joy-con-drift",
    "issuing a formal apology": "https://www.techradar.com/news/nintendo-finally-apologizes-for-joy-con-drift-amid-lawsuit",
    "angry gamer who claimed Xbox One controllers suffer from the same problem": "https://www.techradar.com/news/an-angry-gamer-is-suing-microsoft-over-xbox-one-controller-stick-drift-issue"
  }
}