{
  "source": "https://www.techradar.com/news/fresh-leak-hints-at-how-amd-vs-nvidia-next-gen-gpu-battle-is-shaping-up",
  "title": "Fresh leak hints at how AMD vs Nvidia next-gen GPU battle is shaping up",
  "category": "computing",
  "updated": "2021-11-12T13:27:34Z",
  "author": "darren-allan",
  "summary": "RTX 4090 could appear to have the advantage – but let’s not get carried away yet",
  "article": [
    "We’ve had some new material float down from the GPU grapevine, theorizing how both the next-gen Nvidia ‘Lovelace’ and AMD RDNA 3 graphics cards will pan out.",
    "This comes from Greymon55, now a regular hardware leaker on Twitter, who has shared what they believe to be the likely core spec of the flagship GPUs from both Teams Green and Red – although note the use of question marks with some of the contended details, meaning that those parts are educated guesswork at this stage.",
    "Of course, this is an early stage rumor so all of it should be treated with a very healthy dollop of skepticism, but Greymon asserts that what will presumably be the RTX 4090 will run with 18,432 CUDA cores, plus 24GB of GDDR6X video memory and a 384-bit memory interface.",
    "Clock speeds will be pitched in the area of 2.3GHz to 2.5GHz – that’s one of the nuggets of info with a big question mark hanging over it – offering something in the order of around 90TFlops of raw (FP32) performance (ditto on the question mark there).",
    "Moving to the AMD RDNA 3 champion, this GPU is purportedly set to come bristling with 15,360 stream processors (cores), as previously rumored, and 32GB of GDDR6 with a 256-bit memory interface. And while the latter may sound thin, there's the key addition of 3D Infinity Cache to ensure better competitivity with Nvidia, as we heard recently from Greymon (there could be 256MB or 512MB of Infinity Cache).",
    "As you may know, 3D V-Cache or vertical cache – meaning simply that it’s stacked up vertically – is what’s coming to Ryzen CPUs with new models (possibly Ryzen 6000 chips) at the start of 2022.",
    "Clock speeds for the next-gen AMD flagship, presumably the RX 7900, are roughly pegged at around the same as Nvidia – 2.4GHz to 2.5GHz – offering about 75Tflops of FP32 performance, Greymon reckons.",
    "We’d be foolish to try to engage in any real comparative debate based on the above-rumored specs at this stage in the next-gen GPU game, so bear that firmly in mind. Still, it’s worth putting some tentative initial thoughts together, huge amounts of salt clutched in both hands.",
    "So, the theory is that the RTX 4000 flagship will pull around 85-90TFlops of raw (FP32) performance. Now, the RTX 3090 comes in at 36TFlops, so that’d make its successor around 2.5x more performant, in theory: a huge leap.",
    "On the AMD side, the RDNA 3 flagship is pulling a purported 75Tflops, as noted, which isn’t far off Nvidia, but it’s a bit behind. However, even if these figures are in the correct ballpark – which is obviously a big if – that performance metric does not equate to real-world gaming performance.",
    "We’ve also heard this week that Nvidia’s next-gen graphics cards could be twice as powerful as current models, and these purported specs look to back up this assertion. And with AMD set to crank the cache (and use that 3D V-Cache, of course), plus adopt a fresh multi-chip module strategy with the RX 7900, according to previous rumors, Team Red’s flagship could also turn out to be ridiculously powerful as we’ve reported before.",
    "The reality is that it sounds like both Nvidia and AMD’s next GPUs are shaping up very nicely, and will represent big jumps in performance above the current graphics cards on both teams.",
    "The real worry, perhaps, is not exactly how powerful these cards will turn out to be in comparison to each other, but how much they will cost. Indeed, the true next-gen GPU battle may be fought on value proposition and availability (if component shortages continue as predicted) – and indeed with power consumption being a further concern (and it’s here that what we’ve been hearing about Nvidia in recent times is rather alarming, condiments aplenty of course).",
    "But perhaps all this could leave a path open for Intel, the wild card in next year's GPU landscape...",
    "Via Wccftech"
  ],
  "headers": {
    "7": "Analysis: Worrying about the wrong thing…"
  },
  "links": {
    "AMD RDNA 3 graphics cards": "https://www.techradar.com/news/amds-rdna-3-flagship-gpu-could-be-one-step-closer-to-launch",
    "we heard recently from Greymon": "https://www.techradar.com/news/amds-3d-infinity-cache-could-be-its-secret-weapon-in-its-fight-against-nvidia",
    "3D V-Cache or vertical cache": "https://www.techradar.com/news/amd-3d-chiplet-technology-meet-the-future-of-processors",
    "at the start of 2022": "https://www.techradar.com/news/amd-could-launch-ryzen-6000-cpus-in-early-2022-to-fight-back-against-intel",
    "RTX 4000": "https://www.techradar.com/news/nvidia-geforce-rtx-4080",
    "graphics cards": "https://www.techradar.com/news/nvidia-geforce",
    "twice as powerful as current models": "https://www.techradar.com/news/next-gen-nvidia-rtx-4000-gpus-could-be-twice-as-fast-and-power-hungry-as-rtx-3000",
    "ridiculously powerful": "https://www.techradar.com/news/amds-rdna-3-flagship-gpu-could-be-ridiculously-powerful-but-at-what-cost",
    "power consumption being a further concern": "https://www.techradar.com/news/amd-and-nvidia-next-gen-flagship-gpus-could-force-you-into-a-psu-upgrade",
    "we’ve been hearing about Nvidia in recent times": "https://www.techradar.com/news/next-gen-nvidia-rtx-4000-gpus-could-be-twice-as-fast-and-power-hungry-as-rtx-3000",
    "Wccftech": "https://wccftech.com/amd-nvidia-next-gen-flagship-gpus-detailed-rdna-3-radeon-rx-7900-xt-with-15360-cores-ada-lovelace-geforce-rtx-4090-with-18432-cores/"
  }
}