{
  "source": "https://www.techradar.com/news/cyberpunk-2077-updates-will-keep-the-game-from-dying-says-ceo",
  "title": "Cyberpunk 2077 updates will keep the game from dying, says CEO",
  "category": "gaming",
  "updated": "2021-12-02T11:21:28Z",
  "author": "rhys-wood",
  "summary": "Keeping the Night City lights on",
  "article": [
    "Cyberpunk 2077 updates are beginning to roll out more frequently, but if you feel like the game could’ve used a bit more time in the oven prior to launch, then your thoughts might now be shared by the game’s developer, CD Projekt Red, as hinted by president and joint CEO Adam Kicinski.",
    "Cyberpunk 2077’s reputation can be salvaged, according to Kicinski in a statement to Reuters. How? He sees Cyberpunk 2077 updates improving the overall quality of the game, saying: “I don’t see an option to shelve Cyberpunk 2077. We are convinced that we can bring the game to such a state that we can be proud of it and therefore successfully sell it for years to come.”",
    "Kicinski’s statement comes shortly after the release of the Cyberpunk 2077 1.2 patch, which addressed a litany of bugs and improving certain aspects of the game’s control scheme. Patch 1.2 is part of a larger (and rather vague) roadmap for Cyberpunk 2077 support throughout 2021, which also includes free DLC packs, more performance updates and, perhaps most importantly, the upgrades for PS5 and Xbox Series X consoles.",
    "Cyberpunk 2077 updates have certainly shaken things up at CD Projekt Red since it launched late last year. After witnessing the deluge of game-breaking bugs and overall poor performance plaguing the game on PS4, Sony opted to delist Cyberpunk 2077 from the PlayStation Store, and it remains unavailable on the platform at the time of writing.",
    "CD Projekt Red has also cancelled the planned Cyberpunk 2077 standalone multiplayer component, as part of a restructuring of how the developer approaches online functionality in all of its future titles. This seems like it could benefit Cyberpunk 2077 in the long run, with the developer potentially able to focus more on improving the core experience, rather than risking half-baked products on two fronts.",
    "While Kicinski’s comments should be positive news for fans waiting on Cyberpunk 2077 updates, it of course would’ve been nice for the game to launch in a state the developer could be proud of instead of addressing glaring issues months (and potentially years) after its release. Still, if CDPR decides to go above and beyond in supporting Cyberpunk 2077 for the long term, then Night City might end up being a nice place to stay, after all."
  ],
  "headers": {
    "3": "Wake up, Samurai"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "in a statement to Reuters": "https://www.reuters.com/article/us-cdprojekt-poland-idUSKBN2BZ11I?taid=607425e4b509cb00014096f9&utm_campaign=trueAnthem:+Trending+Content&utm_medium=trueAnthem&utm_source=twitter",
    "Cyberpunk 2077 1.2 patch": "https://www.techradar.com/news/huge-cyberpunk-2077-patch-12-is-imminent-finally-adds-ray-tracing-for-amd-gpus",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Cyberpunk 2077 from the PlayStation Store": "https://www.techradar.com/news/sony-pulls-cyberpunk-2077-from-playstation-store-offers-full-refund",
    "Cyberpunk 2077 standalone multiplayer component": "https://www.techradar.com/news/cyberpunk-2077s-multiplayer-game-has-been-cancelled"
  }
}