{
  "source": "https://www.techradar.com/news/microsoft-onedrive-gets-photo-editing-features-but-its-no-photoshop",
  "title": "Microsoft OneDrive gets photo editing features... but it’s no Photoshop",
  "category": "computing",
  "updated": "2021-12-02T14:34:26Z",
  "author": "darren-allan",
  "summary": "Cloud storage locker benefits from more in-depth image editing features",
  "article": [
    "Microsoft has just revealed some more in-depth options for editing photos directly within its cloud storage service OneDrive.",
    "Midway through 2021, basic photo editing options were brought to OneDrive (crop, rotate, and so forth), and today these have been further fleshed out, with the addition of in-line Filter options, plus a Markup feature is also in the pipeline.",
    "Filters can be applied to an image simply by clicking on the relevant filter, and they include the likes of warm contrast, cool tones, a ‘film’ effect along with various black and white filters.",
    "We’ve got that option in our OneDrive now, but the Markup tool has still yet to arrive, with Microsoft noting that it will be here later in December. This will allow you to highlight areas of an image and quickly jot notes as to the kind of editing you might want to later apply.",
    "While any serious work on a photo is, of course, best undertaken with a heavyweight app – like one of the best photo editors – it’s great to have the ability to perform simple editing tasks right there in OneDrive while you’re browsing through your photo collection online.",
    "The Filters are simple but definitely good to have, while the incoming Markup feature certainly won’t hurt, although probably won’t see any use from the average OneDrive denizen (who probably will use the basic functions like crop and maybe the filters from time to time).",
    "Once an image has been edited in OneDrive, you can either save it over the current image in the cloud, or save it separately as a copy in case you don’t want to lose the original. And should you accidentally overwrite, the good thing about OneDrive is that it has a version history to enable you to recover the lost snap (at least for 30 days anyway – that’s the time limit when older versions get binned).",
    "Looking to move your files to the cloud? Check out our roundups of the best cloud storage and best cloud backup",
    "Via MS PowerUser"
  ],
  "headers": {
    "4": "Analysis: A bit more meat to photo editing in OneDrive, but do your real work elsewhere"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "addition": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2219470674624667100&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-onedrive-blog%2Fnow-it-s-easier-than-ever-to-edit-photos-in-onedrive%2Fba-p%2F3022076&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-onedrive-gets-photo-editing-features-but-its-no-photoshop",
    "best photo editors": "https://www.techradar.com/news/best-photo-editor",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "best cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "MS PowerUser": "https://mspoweruser.com/microsoft-photo-editing-onedrive-on-the-web/"
  }
}