{
  "source": "https://www.techradar.com/news/why-windows-11-going-with-amazon-for-its-android-apps-and-not-google-is-a-masterstroke",
  "title": "Why Windows 11 going with Amazon for its Android apps, and not Google, is a masterstroke",
  "category": "computing",
  "updated": "2021-07-03T12:00:00Z",
  "author": "daryl-baxter",
  "summary": "More than meets the eye",
  "article": [
    "One of the biggest surprises of the Windows 11 launch event was the announcement that Android apps are coming to the new Microsoft Store... but through Amazon.",
    "While the decision was praised, it’s also been met with some trepidation and puzzlement, leaving people wondering why there hasn’t just been an arrangement made with Google itself.",
    "The redesigned Microsoft Store on Windows 11 is very welcome, but users will have far less Android apps to choose from, compared to the amount that’s available on Google’s own Play Store.",
    "With this in mind, here’s why this decision may have come to Amazon’s Store instead.",
    "Google announced recently that it is changing the format for Android apps, called APK, and moving to a new format from August called the ‘Android App Bundle’, or AAB.",
    "When you download an app from Google’s Play Store for your Android device, it uses the ‘.APK’ naming convention, similar to how you install an app on Windows as ‘.exe’, or ‘.DMG’ on Apple’s macOS operating system.",
    "However, this new type of file, according to Google, reduces the size of the app, alongside being able to be signed, which essentially means that Google will be able to track the app from within its Play Store with an ‘Upload Key’, so it can help recover the app for a developer if something occurs.",
    "This is where I believe Amazon’s App Store on Windows 11 comes in.",
    "For years now, Amazon has had its own Android app store, which enables users of Kindle Fire devices to download apps from Amazon’s own site, and from within the company’s own storefront.",
    "Since the store’s launch in 2011, there are almost 500,000 apps available from Amazon, which seems minimal compared to the millions available on Google’s Play Store.",
    "However, Amazon has total control over this store, so developers that make apps that illegally offer games and apps for free that are otherwise available for a fee are blocked, similar to Apple’s own guidelines.",
    "This, along with Google’s plans for AAB and its plan for signing every app with an upload key, may be why we are seeing Amazon’s store on Windows 11 instead. It helps give focus to what’s available from Amazon’s storefront, and doesn’t flood the new Microsoft Store with copycat apps. More so, it doesn’t require Microsoft to police the apps coming in from Android, as Amazon already does this.",
    "It’s an ingenious move when you think about it. It enables more apps on the new Microsoft Store with minimal effort from Microsoft, and helps it become a substantial rival to Apple’s Mac App Store, with iOS apps now available on M1 Macs.",
    "With extensions being available for Microsoft Edge as well in the Microsoft Store, it’s a fantastic outlet for new and existing users to discover apps they might not have otherwise found before.",
    "There’s already an early version of Windows 11 available to download for testing, but it doesn’t include Android apps at the moment, so we’ll have to wait to see just how successful Microsoft’s inclusion of these mobile apps turns out to be."
  ],
  "headers": {
    "4": "Seeing what was in front of us all along",
    "8": "The Amazon Windows 11 Store"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Android apps are coming": "https://www.techradar.com/news/windows-11-will-bring-native-android-apps-to-the-microsoft-os",
    "moving to": "https://android-developers.googleblog.com/2021/06/the-future-of-android-app-bundles-is.html",
    "signed": "https://play.google.com/console/about/keymanagement/",
    "own Android app store": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fb%3Fnode%3D14054721031%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-6593248231700235000-21",
    "available": "https://www.statista.com/statistics/307330/number-of-available-apps-in-the-amazon-appstore/"
  }
}