{
  "source": "https://www.techradar.com/news/could-valve-be-making-a-nintendo-switch-killing-steam-handheld",
  "title": "Could Valve be making a Nintendo Switch-killing Steam handheld?",
  "category": "gaming",
  "updated": "2021-05-25T15:24:55.536Z",
  "author": "darren-allan",
  "summary": "‘SteamPal’ and related references could be read as hinting at a handheld console",
  "article": [
    "Clues dug up in a fresh beta of the Steam app suggest the possibility that Valve could be looking at making a new piece of hardware, with speculation that perhaps some kind of dedicated handheld could be in the works – which sort of marries up with recent comments from Gabe Newell (more on that later).",
    "Okay, so this might seem to be pushing it a bit on the rumor front, but the material found by Pavel Djundik, founder of SteamDB (highlighted by VGC), in the new update for the Steam software is certainly interesting to chew over.",
    "There are references to a project ‘Neptune’ buried in that beta client, and a ‘SteamPal’ device and ‘SteamPal Games’. Tellingly there are also references to ‘power’ menus, and options for ‘shut down’, ‘restart’ and ‘suspend’, plus settings for the likes of Wi-Fi and Bluetooth, airplane mode, plus battery notifications (for when low on power).",
    "Now, that in itself hardly means that an incoming handheld console is likely in the pipeline, but you can see how it could get folks excited about some kind of possible new hardware from Valve, at least.",
    "Particularly given that as we mentioned at the outset, Gabe Newell, president of Valve, recently made an interesting comment when asked a question about whether Steam would be porting games to consoles. Newell replied: “You will get a better idea of that by the end of this year … and it won’t be the answer you expect.”",
    "And this latest rumor would certainly fit in the unexpected category – so, you never know what might be around the corner. Valve has, of course, tried its hand with various bits of hardware over the years, including Steam Machines and the Steam Controller – which were both ditched – although VR centerpiece the Valve Index is still going.",
    "Whatever the purported ‘SteamPal’ device turns out to be – if it’s ever realized as anything concrete at all – if you’re not willing to wait on Valve’s potential announcement, or the release of the rumored Nintendo Switch Pro (which may not be coming for some time yet), you could always have a gander at the Onexplayer handheld PC. It’s a tasty, if pricey, portable PC gaming proposition.",
    "We could be in for a very interesting ride in the near-ish future in the handheld sphere.",
    "Via PC Gamer"
  ],
  "headers": {
    "4": "Tales of the unexpected"
  },
  "links": {
    "Steam": "https://www.techradar.com/news/the-best-free-to-play-steam-games",
    "VGC": "https://www.videogameschronicle.com/news/steams-latest-update-could-hint-at-valve-plans-for-a-console-like-device/",
    "Newell replied": "https://www.techradar.com/news/valves-gabe-newell-teases-console-related-plans-for-steam-games",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "may not be coming for some time yet": "https://www.techradar.com/news/nintendo-switch-pro-may-have-accidentally-been-confirmed",
    "Onexplayer handheld PC": "https://www.techradar.com/news/cant-wait-for-nintendo-switch-pro-onexplayer-handheld-pc-is-the-answer",
    "PC Gamer": "https://www.pcgamer.com/steam-client-update-code-points-to-possible-handheld-console-in-the-works/"
  }
}