{
  "source": "https://www.techradar.com/news/home-cinema-systems-could-change-the-way-we-consume-art-heres-why",
  "title": "Home cinema systems could change the way we consume art – here’s why",
  "category": "televisions",
  "updated": "2021-01-17T11:00:50Z",
  "author": "sandy-yu",
  "summary": "Your living space might be the next big cultural venue",
  "article": [
    "Many have taken the opportunity to upgrade their home cinema systems over the past year, to ensure the picture and sound of TV shows and films are shown off at their best – but there may be potential for home cinemas beyond merely action flicks and Oscar-winning movies in a wide aspect ratio.",
    "The cultural sector had been dealt some heavy blows in 2020, with continued closures of museums and galleries, as well as cinemas and theaters. Despite ongoing challenges, the arts have remained afloat – a testament to both its resilience and our collective hunger for culture even in the darkest times.",
    "The sector has been forced to adapt to new regulations and routines, though, in the process largely shifting from physical venues to online spaces – something only made possible by the ubiquity of home entertainment technologies, as well as the groundwork laid digital art distribution systems in the years before the current pandemic.",
    "And as consumers deck their living rooms out with equipment of increasingly better quality, the arts may find a new home yet, splashed across 4K (or 8K) televisions and flowing from 5.1 sound systems.",
    "As internet technologies evolved in the years leading up to the pandemic, so did internet art and online art events in terms of their breadth and reach.",
    "New concepts such as Sedition Art, a platform for selling and collecting digital art, came about as 4K television screens dropped to more attainable prices – handy for artworks best viewed on higher resolutions. Art AI, a website selling unique one-off artworks generated by artificial intelligence, also offers digital files along with physical counterparts so that screens can be adorned with art when walls aren’t adequate.",
    "But it’s not just that art is learning how to adapt to digital spaces; modern AV technology is also moving in the other direction. Popular televisions such as the Samsung Q95T 4K QLED TV – or the Samsung 2020 Frame, for the design-inclined – can double for both high brow art contemplation and lighter Netflix bingeing. Samsung’s Art Mode, in particular, allows you to access display iconic artworks or high-quality photography, with the option to sign up for a paid subscription (£3.99 in the UK) for a larger catalogue from galleries like the V&A or Van Gogh Museum.",
    "LG’s Gallery Series OLED has a similar schtick, with a new-for-2021 Gallery Stand accessory to help TV owners showcase onscreen art and images in a stylish way.",
    "The affordability of digital signage with 4K resolution certainly helps too, ensuring even those purchasing a low-spec LCD TV have a way of displaying unique artworks made for digital displays. In times where we’re confined indoors more than ever, having forms of art on display that don’t depend on buying priceless paintings and sculptures may be the stand-in we all need.",
    "Curators are clearly rising to the challenge, too. The interactive Van Gogh Experience – a travelling exhibition about the life and works of Vincent Van Gogh – consists of several videos, projections and immersive environments but not a single painting. It educates on art history through projection mapping, individualised audio and digital signage whilst the original and near-priceless paintings are stored safely away from the potential damage that can incur from travel and display.",
    "Although this exhibition is somewhat location-based, the technologies used are those that can be found in many homes, including projectors and immersive sound systems which are readily adapted into any home entertainment set up. This indicates a potential avenue of exploration for art events of the near future that may include immersive environments within the home.",
    "Beyond simply digital art, art events such as time-limited exhibitions have been held online by acclaimed arts producers before even the current closures. The Serpentine Galleries in London have had online components to exhibitions taking place in their physical spaces in Kensington Gardens for years. At the time of the first UK lockdown, too, website visitors were able to stream Catharsis, an artwork in the form of an augmented reality dreamscape by Jakob Kudsk Steensen complete with serene sounds composed by Matt McCorkle.",
    "By November 2020, 45% of the shows on arts event listing platform ArtRabbit were online, showing a massive increase over past years and a continued interest in online entertainment even in periods when restrictions were temporarily lifted. The online events ranged from theatre performances to artist talks and exhibition tours, as well as web-based exhibitions and workshops. Similar to sporting events, many live arts events yielded better experiences with improved resolutions and sound.",
    "Whilst the use of online art as a stand-in for attending physical art events can, of course, be attributed to a lack of alternatives during lockdown months, cultural producers and consumers alike have found that this way of engaging with art had its own merits.",
    "Events could be attended by anyone from anywhere, provided that they had an adequate internet connection and a device that would enable participation. It made certain events less costly and more convenient to produce, as well as providing access to those who may be faced with mobility impairments, not to mention the possibility of wooing a worldwide audience.",
    "With home cinemas easily set up for live events, and a continued need for arts that can reach people in times of lockdown, it’s clear that many of these changes are here to stay.",
    "But these new ways of bringing culture into homes also carry potential for new ways of circulating technology. Some organisations are already taking an initiative in this direction by renting out equipment for those who do not own the adequate means to enjoy certain types of art. One example is VR art space Synthesis Gallery in Berlin joining forces with INVR.SPACE to provide rentals of Oculus Go or Oculus Quest headsets along with access to virtual reality artworks, an initiative that coincided with German lockdown restrictions.",
    "This could prove to be an interesting way for consumers to test out new technologies in the home before investing in a purchase, or else getting over the initial hump of imagining this type of equipment in a home setting. As we unfurl this exciting new chapter in culture and technology, the friendship between the two will likely propel each other forward, with home cinema technologies begetting new ways of art consumption and new innovations in art even altering the technologies found in the home. All you have to do is sit back and watch."
  ],
  "headers": {
    "4": "Setting the stage for digital art",
    "11": "Moving online"
  },
  "links": {
    "home cinema systems": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "TV shows": "https://www.techradar.com/best/best-tv-shows-2020-new",
    "5.1 sound systems": "https://www.techradar.com/best/surround-sound-systems",
    "Sedition Art": "https://www.seditionart.com/",
    "Art AI": "https://www.artaigallery.com/",
    "Samsung Q95T 4K QLED TV": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv",
    "Samsung 2020 Frame": "https://www.techradar.com/reviews/samsung-the-frame-tv-2020",
    "LG’s Gallery Series OLED": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "digital signage with 4K resolution": "https://www.techradar.com/news/this-75-inch-large-format-display-makes-a-great-affordable-digital-signage-solution",
    "Van Gogh Experience": "https://www.vangoghexpo.co.uk/",
    "projectors": "https://www.techradar.com/best/4k-projector",
    "immersive sound systems": "https://www.techradar.com/best/surround-sound-systems",
    "Serpentine Galleries": "https://www.serpentinegalleries.org/",
    "ArtRabbit": "https://www.artrabbit.com/",
    "Synthesis Gallery": "http://www.synthesis.gallery/",
    "INVR.SPACE": "http://invr.space/",
    "Oculus Go": "https://www.techradar.com/reviews/oculus-go",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review"
  }
}