{
  "source": "https://www.techradar.com/news/call-of-duty-mobile-season-1",
  "title": "Call of Duty: Mobile Season 1 start date, new modes and why it's not called Season 14",
  "category": "phones",
  "updated": "2021-01-27T00:00:18Z",
  "author": "tom-bedford",
  "summary": "Call of Duty: Mobile Season 1 is here now",
  "article": [
    "If you were expecting Call of Duty: Mobile Season 14 to follow the thirteenth season, and don't keep up with the game's news, you'll be surprised that it's actually Season 1 that's out right now.",
    "That's right, this is a soft refresh for the popular mobile game, but Call of Duty: Mobile Season 1 is available right now on your phone.",
    "So what can you expect from Call of Duty: Mobile Season 1, and when does it start? We'll explore that below, but it's worth mentioning none of this is official just yet.",
    "The official Call of Duty: Mobile Season 1 start date was January 26, in particular at 4pm PT / 7pm ET / midnight BST.",
    "At this time Season 13, or Winter War, became Season 1, or New Order. This name is a sly reference to the refresh the new update brings about. It seems this change was to make the game more accessible to new players, who could be put off by the ever-increasing numbers of the seasons.",
    "Activision has introduced two new guns for Season 1, and they are the FR .556 assault rifle and SKS marksman rifle. There are also plenty of new weapon camos and operators.",
    "On Reddit, the official Call of Duty: Mobile account stated there are 'two new weapons coming next season and one of them isn’t an assault rifle' so it seems these are almost definitely the new guns for Season 1.",
    "There's one new map for Season 1 called Reclaim, and it's brand new for Call of Duty: Mobile (as in, it hasn't been in any of the console games). It's medium-sized, set in a shopping center, and is exciting as it brings unique content to the mobile game. It's not the first bespoke map, and it joins Cage to have this accolade.",
    "A new game mode comes along in Season 1, and it's a version of Gunfight but with 3-person teams. Gunfight gives you a random loadout and one life, and with three players this should make for tense firefights.",
    "That's just one of the new modes that will be introduced through the season - we also know a new version of Attack of the Undead is coming, as well as a new Battle Royale mode called Blitz which has a bigger focus on close-quarters combat.",
    "The Call of Duty: Mobile Season 8 battle pass costs the same every time: that’s 800 COD Points ($9.99 / £9.99). A premium pass is also available, which automatically unlocks the first 25 tiers of the pass for 2000 COD Points ($24.99 / £24.99) and gives you some additional unique items.",
    "As we’ve come to expect, the battle pass lets players unlock new skins for their weapons and operators, vanity items and XP boosts.",
    "With COD: Mobile Season 1 here, you can check out if you want to pay for all the new extras or wait for a future season.. For now, though, you can hot drop into the action and start improving your kill/death ratio."
  ],
  "headers": {
    "3": "When does Call of Duty: Mobile Season 1 start?",
    "5": "What’s included in Call of Duty: Mobile Season 1?",
    "10": "How much is the Call of Duty: Mobile Season 1 battle pass?"
  },
  "links": {
    "Reddit": "https://www.reddit.com/r/CallOfDutyMobile/comments/ky6xqe/call_of_duty_mobile_january_15th_community_update/"
  }
}