{
  "source": "https://www.techradar.com/news/will-the-google-pixel-6-release-at-google-io-2021",
  "title": "Will the Google Pixel 6 release at Google IO 2021?",
  "category": "phones",
  "updated": "2021-05-07T17:00:47Z",
  "author": "hamish-hector",
  "summary": "Don't expect the Pixel 6",
  "article": [
    "Google IO 2021 is coming very soon and we’re sure to get a load of new announcements when it does, but will we see the Pixel 6 released during the event too? Fans of Google’s flagship phones will be desperate to get their hands on this year’s model, though we wouldn’t recommend holding your breath.",
    "While we don’t know anything for certain – so never say never – typically Pixel flagships release towards the end of the year. Google IO 2021 is just too early for us to expect a Pixel 6 reveal, but that doesn’t mean there won’t be anything of note at the event.",
    "Be sure to check back for our coverage of the Google IO event (which will be going on from May 18-20) if you want to know everything that was or wasn’t announced, and keep reading to find out the tech we actually expect will be at Google IO.",
    "Here's a run down of when every Google Pixel phone has been announced:",
    "As you can see, the main-series Pixel phones tend to pop up towards the end of the year, while the only phone to arrive at Google IO was the Pixel 3a and 3a XL - though we likely would have seen the 4a series at Google IO 2020, had it not been cancelled for Covid-19 reasons.",
    "As a result it's unlikely we'll see the Pixel 6 at the May event.",
    "If you're looking for a Google Pixel announcement at Google IO 2021, then while the Pixel 6 might not be there we could see the Pixel 5a. The Pixel 3a was announced at the event in 2019, so something similar could happen this year. Unfortunately, it might only be released in the US and Japan, likely due to ongoing chip shortages keeping it in limited supply.",
    "The Pixel Watch is also a possibility for the event, as we’ve seen a fair few leaks about the device already. This would be Google’s first entry into the smartwatch market (not counting its Fitbit acquisition), so it makes sense that they might want to announce the launch at a large event like Google IO.",
    "Beyond that, we’d also expect an Android 12 announcement (probably a date for public beta testing or its official release) and Pixel Buds A (earphones like the Pixel a line of phones in that they’re more of a budget tech option).",
    "Be sure to check back May 18-20 to find all the latest for the Google IO 2021 event."
  ],
  "headers": {
    "3": "When were previous Google Pixel phones announced?",
    "6": "What could be at Google IO 2021?"
  },
  "links": {
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "US and Japan": "https://www.techradar.com/news/google-pixel-5a-may-be-canceled",
    "Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Pixel Buds A": "https://www.techradar.com/news/google-pixel-buds-a"
  }
}