{
  "source": "https://www.techradar.com/news/how-steam-refunds-are-a-blessing-and-a-curse",
  "title": "How Steam refunds are a blessing and a curse",
  "category": "computing",
  "updated": "2021-10-16T11:00:06Z",
  "author": "carlos-l-hernando",
  "summary": "Opinion: The pros and cons of Steam's refund system",
  "article": [
    "Getting a refund on a game purchased on Steam is easy. If you've played a particular title for less than two hours, and you're within 14 days of having purchased, then you're entitled to your money back – whatever the reason; no questions asked.",
    "This system has its advocates and detractors, but what is certain is that there are ramifications for the very roots of PC gaming. And, at the center of that relationship between developer and player, it's Valve (the company behind Steam) that's setting the rules. In this scenario, who has the most to lose? How could the system be improved? Is there even a problem?",
    "First and foremost, I believe a fair refund policy is a guarantee of good practice between customers and retailers. It builds trust, sets a quality standard, and avoids scams (from all parties involved). But this is the theory, and theory is a mirage of perfection.",
    "In the case of Steam refunds, we have three main players: the customers, Steam itself (or Valve, its owner) and the developers (and publishers, in many cases). Of the three, only Steam is monolithic. Each customer is unique, as is the situation of each developer and publisher.",
    "So what is fair? What are the problems with the current refund system? And how can it be improved? Let’s dive in!",
    "Steam started offering refunds in June 2015, setting up the system that you'll find in place today. Before 2015, if you wanted a refund, you needed to contact Valve and state your case. It was a difficult and slow process. Valve stated with capital letters that “ALL CHARGES INCURRED ON STEAM, AND ALL PURCHASES MADE WITH THE STEAM WALLET, ARE PAYABLE IN ADVANCE AND ARE NOT REFUNDABLE IN WHOLE OR IN PART, REGARDLESS OF THE PAYMENT METHOD”. You can check the old Steam Subscriber Agreement here.",
    "The new system is radically different: refunds are automatic and player-oriented. There's no need to interact with developers, publishers or even Valve employees. It's a hands-off approach in which there are only two requirements that must be met in order to obtain a refund on a game:",
    "That’s it. Easy and fast. You can check out all the information here.",
    "The first is a pretty common condition of refund for both physical and digital stores around the world. But the issue lies with the second. Consider that the reason behind a refund doesn’t matter here. In the words of Valve itself, “you can request a refund for nearly any purchase on Steam – for any reason. Maybe your PC doesn't meet the hardware requirements; maybe you bought a game by mistake; maybe you played the title for an hour and just didn't like it”.",
    "Compare this with Android, where a full refund can be requested within two hours. After that, there is a 48-hour period during which a refund request can be processed by Google. Then, it’s up to the developer to decide whether or not a player should get their money back.",
    "Steam's system mostly benefits players, but also Steam itself. Although obvious, it's important to note that Steam’s return costs are minimal (as they are for any other retailer of digital goods). For each refund, Valve simply loses its 20-30% revenue share (which will depend on the game’s sales). There's no need for employees to process it, and transportation or repackaging expenses are nonexistent. This isn't the case with refund costs across the globe, however. For example, according to Clear Returns, returns cost UK retailers £60bn a year.",
    "But that’s not all. If Steam isn't able to return the money through the original payment method, the refund will be added to the customer's Steam Wallet. In those cases, Steam retains that 20-30%, even if the player doesn’t use that wallet currency to purchase another game. The developer, on the hand, directly loses a sale. It's easy to see who bears the risk here, without even taking into account the fact that Steam has more products in circulation than any developer.",
    "One could say that this automated system also benefits developers, who don't have to process refunds. However, that would depend on the number of refunds and the nature of those refunds. Especially for indie studios that are working to tight sales numbers to survive.",
    "So if we summarize this situation as a balance of power, we have the players holding the upper hand, Steam never losing, and the developers at the mercy of the goodwill of their players.",
    "However, I don’t want to be cynical here; it’s too easy to blame players. And consider that when Steam introduced Steam Direct, it opened the floodgates to a whole host of games of questionable quality on the platform. So, if we assume that players are always honest, then all the refunds will be justified. They'll be for broken games, hardware issues, accidental purchases (more common than it seems), for example. We can also see some positive side effects, in that players will be more willing to try new products. They could end up trying out genres with which they haven't dabbled, or even experimental games.",
    "But, again, that’s theory. There are plenty of reasons that a player may want a refund on a game. Whether those reasons are fair or unfair is debatable – but this debate doesn't really matter because of Steam's policy.",
    "Plus, there are many other factors at play, too. Did you know that players from some countries are more prone to refund a game than others? It would be great to have official data, but after reaching out to some developer friends and reading several post mortems, the average refund rate seems to be around 5% and 10%. This becomes a useful stat against which developers can measure their relative success.",
    "Whatever the reason, a refund still needs to be issued within that two-hour timeframe. For AAA games, this appears to be a good deal. You can play an hour of a massive expansive open-world RPG or similar and see if it appeals to you. Some of those games can last more than 100 hours, so a player can play an hour and experience 1% of the game. That way, they can make an informed decision about whether they want to commit to it. And if they still haven't come to a decision an hour into the game, they have another of hour of play left.",
    "However, what about 50-hour games? An hour of play in this instance would equate to 2%. A 10-hour game? 10%. 2-hour games? Effectively, it becomes a “pay if you want” in practice.",
    "Shorter games are usually made by small developer teams, sometimes made up of just a single individual. The risk they undergo to put out these projects is really high, especially if they don’t have a publisher. Getting noticed on Steam is more difficult with every passing day – there are more than 50,000 games on the platform right now. Refunds further increase the risk for small developers, while AAA games usually remain unaffected.",
    "Regardless, there's an underlying problem here: measuring the value of a game by its duration. Quality versus quantity. In theory, it’s best to have both, but that’s another mirage. Some experiences lose impact with time and must end soon to be valuable. Imagine a 100-hour The Stanley Parable. It just makes no sense.",
    "But that’s a matter for another article. Even without taking into account the supposed value of each hour of gameplay, each game has its own pace – both in story and mechanics. It’s really difficult to set a “refund point” that can be applied to every game out there. Each experience is different.",
    "In addition, regardless of the total length of a game, doesn't this policy turn every Steam game into a de facto free to play (F2P) title? This is a bit extreme, but the main objective of F2P games is to convert installs into sales.",
    "This gives rise to marketing, gameplay and even thematic implications. It’s not only important to convince players to buy a game, but also to get them hooked in its early stages. Of course, this has always been important, but now a player may decide to return a game and buy another one before having spent sufficient time to get into the experience.",
    "Should developers invest more time and money in the first two hours of the game, then? The rest could be a little less polished, but at least then they could secure the sale. Or maybe focus their products on countries with a lower refund rate.",
    "Another strategy would be to form bundles with other games (something that's really common nowadays). When a player purchases a bundle, the two-hour grace period applies to all the games in that bundle combined. This can be a good strategy for short games. Unity is strength. Or even better, short games can join bigger ones to capitalize on their duration.",
    "This situation, taken to the extreme, makes me wonder: is there still room for short paid games on Steam? I guess it depends on who you ask, but the risk is undeniable. A straightforward solution for developers would be to stop developing short games. However, that undermines the range of games and experiences offered.",
    "Recently, there has been a case that has received a lot of attention. Solo developer EMIKA_GAMES announced on August 26, 2021, that it was stopping making video games. The reason? Its short game Summer of ‘58 was being refunded en masse – Even by players who had left positive reviews (this can be easily checked on Steam, since the reviews of returned games are marked). Players finished playing the game then refunded it.",
    "This isn't the first such case and, with the current refund policy, it probably won't be the last. How many developers are affected, and what's the scale of the issue? Once again, only Valve has the answer. At least, it seems that EMIKA_GAMES predicament has attracted new players, so maybe this won’t the end of that particular developer.",
    "Be that as it may, what is clear is that we have an imperfect system. A system that hasn't been updated for six years. At least the issue with short games should be addressed. So now comes the time for me to offer a win-win-win solution...",
    "I wish. Unfortunately, this isn't an easy problem to solve. For starters, players have already become accustomed to the current policy. Introducing restrictive changes could provoke heavy backlash from Steam users. Any changes would need to be implemented with care.",
    "Probably the quickest way to revise the system would be to move closer to Google's system. That would mean the sharing of responsibility between Steam and each developer, following some basic rules. For example, hardware-related refunds could be mandatory (where a game cannot run properly on a customer's PC) but other reasons could be left in the hands of the developer after a shorter period of time.",
    "Maybe a dynamic time window could be added. It could be shorter for small games, but also extended for longer titles. I mean, in some games you can spend an hour modifying your character’s eyebrows. How can you evaluate if that game is for you if you've barely made it through the tutorial, following two hours of just messing around?",
    "However, this could be difficult to manage on Steam’s end. Without a moderately thorough review, it would all be left to the goodwill of the developers. A risky move, and confusing for the players.",
    "Another solution would be to implement “refund points” to games, maybe tied to special achievements, so they're easy to spot by players. However, circumventing this would be trivial with a guide. A player would only need to press Alt-F4 just before the refund point achievement, get the money back and watch the rest on YouTube.",
    "All of these attempts at solutions are imperfect in one way or another, but they're a starting point for healthy debate. At the end of the day, what would surely help would be for Valve to share global refund data. Transparency as a first step.",
    "Everything is in its hands. I think the company should try to make a perfect system – which is impossible, I know. But that theory, that mirage, could lead to a fairer situation.",
    "Meanwhile, give some experimental games a chance and be mindful if you end up thinking about refunding them."
  ],
  "headers": {},
  "links": {
    "here": "https://store.steampowered.com/steam_refunds/",
    "stopping making video games": "https://twitter.com/EmikaGames/status/1430941640001265673"
  }
}