{
  "source": "https://www.techradar.com/news/no-guardians-3-hasnt-starting-filming-yet",
  "title": "No, Guardians 3 hasn't starting filming yet",
  "category": "entertainment",
  "updated": "2021-10-20T09:20:19Z",
  "author": "tom-power",
  "summary": "'But we are pretty close', director reveals",
  "article": [
    "Guardians of the Galaxy Vol. 3 hasn't starting shooting just yet, despite one of its stars appearing to confirm that it had.",
    "Taking to Twitter on October 20, director James Gunn set the record straight after Star-Lord actor Chris Pratt suggested that principal photography had begun on the MCU movie.",
    "Gunn did, however, hint that filming would begin in the near future. Take a look at Gunn's tweet below:",
    "Speaking in a Twitter video on Monday, October 19, Pratt had seemingly confirmed that production on Guardians 3 had begun. The actor said: \"I'm on the set of Guardians of the Galaxy Volume 3. This is day one, which is why these sick-ass mutton chops are back.\"",
    "Gunn, though, followed up his initial tweet to explain why there were crossed wires over Pratt's revelation. In a separate tweet, Gunn said that the Parks and Rec. star is \"rehearsing and doing camera tests and stuff\" before adding that \"shooting is a while off\".",
    "Guardians of the Galaxy 3 will be filmed in conjunction with the Guardians' upcoming Holiday Special for Disney Plus. The latter project is slated for release in December 2022, while Guardians 3 will arrive in theaters on May 5, 2023.",
    "Guardians 3 may not have entered production yet, but that's proven to be a blessing in disguise for the upcoming Marvel flick.",
    "On the same day that Pratt appeared to confirm its filming start date, Marvel Studios announced that several of its upcoming movies' launch dates were being pushed back. Doctor Strange 2, Thor: Love and Thunder, Black Panther: Wakanda Forever, The Marvels, and Ant-Man and the Wasp: Quantumania have all been delayed by three months – a decision that leaves each production with more development time.",
    "Guardians 3 was slated to arrive in 2023 alongside Ant-Man 3 but, unlike its fellow threequel, its release wasn't shunted back by Marvel. Why? Simply because it hasn't started filming. Principal photography began on Ant-Man 3 in July 2021, while the other movies listed above are either in their post-production phase or are currently being shot.",
    "So the fact that Guardians 3 is yet to enter full production has been a blessing in disguise. Sure, it sounds like it'll be a while before filming begins, but at least Guardians fans won't be forced to wait longer to find out how their story ends.",
    "One thing we do know about Guardians 3 is that it'll finally introduce fan favorite hero Adam Warlock to the MCU. Will Poulter was recently cast in the role, so it's been a busy time for the film ahead of it going into full production."
  ],
  "headers": {
    "6": "Guardians 3's release date is safeguarded"
  },
  "links": {
    "Twitter video": "https://twitter.com/TeamCoco/status/1450502704904560640?t=SjCkrIdx16h5IG3ZL7dK3w&s=19",
    "separate tweet": "https://twitter.com/JamesGunn/status/1450606226216296450",
    "Marvel Studios announced": "https://www.techradar.com/news/marvels-phase-4-plans-in-tatters-as-it-delays-thor-4-black-panther-2-and-more",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Black Panther: Wakanda Forever": "https://www.techradar.com/news/black-panther-2-release-date-cast-plot-and-everything-you-need-to-know-about-wakanda-forever",
    "was recently cast in the role": "https://variety.com/2021/film/news/will-poulter-adam-warlock-guardians-of-the-galaxy-vol3-1235086598/"
  }
}