{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-leak-shows-fewer-options-than-for-the-galaxy-s20-fe",
  "title": "Here’s what the Samsung Galaxy S21 FE could look like in newly leaked colors",
  "category": "phones",
  "updated": "2021-05-06T11:23:03Z",
  "author": "tom-bedford",
  "summary": "Color us unimpressed",
  "article": [
    "While the Samsung Galaxy S20 FE launched in a wide range of colors, giving you loads of choice for your smartphone, it sounds like the Galaxy S21 FE might not offer as many options.",
    "Sporadic leaker and analyst Ross Young tweeted letting us know the Galaxy S21 FE will enter production in July – that means we probably won't see the phone until likely August or September (which would line up with the S20 FE launch).",
    "A subsequent tweet also gave us what are apparently the colors of the phone: white, gray, light green and light violet. That's a small list, compared to the S20 FE's navy, lavender, mint, red, white and orange, with fewer bold options.",
    "As the Samsung Galaxy S21 wasn't a huge design change from the Galaxy S20, we likewise wouldn't expect the S21 FE to be that much different than the S20 FE - though, apparently, the color choice will be limited.",
    "Using complicated computer magic, we've created some rough knock-ups of what the Galaxy S21 FE could look like based on the S20 FE and the above colors, and you can see them below (well, the white one is literally just a picture of the white S20 FE, we haven't edited that one at all).",
    "Sure, that's not quite magic, but it gives an early – and very rough – impression as to what shades the S21 FE could come in.",
    "We rather like the violet shade, but that might just be because we're the ones who picked it.",
    "For anything more solid (or real) we'll have to wait until much later in the year, when the phone is released. Hopefully the four listed colors won't be the only options to buy the phone in."
  ],
  "headers": {
    "3": "What could they look like?"
  },
  "links": {
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Ross Young": "https://twitter.com/DSCCRoss/status/1389273736474365952",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review"
  }
}