{
  "source": "https://www.techradar.com/news/android-tv",
  "title": "Android TV explained: what you need to know about Google’s TV OS",
  "category": "audio-visual",
  "updated": "2021-03-12T12:32:57.925Z",
  "author": "nick-pino",
  "summary": "Learn the basics of Android TV",
  "article": [
    "What is Android TV? While many of you may be used to scrolling through the Android operating system on non-Apple smartphones, there's also a version developed especially by Google for TVs, set-top boxes and soundbars.",
    "Other TV platforms include Amazon's Fire TV, Roku TV and Samsung's Tizen OS, all running inside respective smart TVs and allowing you to access smart services, apps, movies, music and TV shows.",
    "Android TV is currently built into a number of TVs from brands including Philips TVs, Sony TVs and Sharp TVs. You can also find it in streaming video players, like the Nvidia Shield TV Pro.",
    "In this guide, we'll take a closer look at what Android TV offers, the new features to expect from the smart TV platform, the products running Android TV, as well as what sets it apart from other TV platforms on the market.",
    "Android TV has been around since 2014, but it's regularly updated and new features are often added to bring it up to speed with the smart TV platform competition.",
    "Here are a few of the most recent announcements and updates coming to the Android TV platform and smart TVs with it already built-in:",
    "Android TVs are getting TikTok: Android smart TVs across UK and Europe now support the TikTok app – the US might not be too far behind. The app launched on new Samsung TVs in late 2020, but it looks like TikTok's plans for world domination are well underway as TVs with Google TV and Android TV operating systems now have the app too.",
    "Android TV gets a slick makeover for 2021: Google has been rolling out a new user interface for Android TVs since January 2021. What's the difference? The home screen will now have more content recommendations from the services you use the most, the Apps tab will collect all of your installed apps and the Discover tab will be easier to use too.",
    "The Xiaomi Mi TV Q1 is a gorgeous, affordable 75-inch 4K TV: Xiaomi has lifted the lid on its new 75-inch Mi TV Q1. Its flagship TV supports 4K HDR and incorporates both Dolby Vision and HDR10+. It also packs Android 10. It’s Xiaomi’s most premium TV to date and, the company told TechRadar in an interview that it could rival the Samsung Q80T in both specs and usability.",
    "There's a huge range of apps available on Android TV via the Google Play Store.",
    "These include most of the streaming favourites, like Netflix, Disney Channel, Spotify, HBO Now and YouTube. Depending on your country, there are also a lot of live TV channels, including NFL, Bloomberg TV and ABC. There are plenty of gaming apps, too, such as Crossy Road, Final Fantasy IX and Minecraft.",
    "What's important here is the Google Play Store on Android TV only displays apps that are supported by the TV platform – not all of the apps available on other devices, including smartphones.",
    "Curated content: Android TV analyzes the kinds of TV shows and movies that you usually watch, play and listen to, and serves up similar things you're likely to be interested in.",
    "Universal search: You can use the search bar at the top of the Android TV interface or the voice search button on your remote to find what you're looking for. Android TV crawls a number of services, including Netflix, Hulu, YouTube and Google Play Movies and TV to find what you need, and usually lists the lowest price first.",
    "Native Google Cast support: All Android TV players and TVs have Google Cast built-in. That means you can stream content from your device to your TV whenever you see the Google Cast icon. This is sometimes referred to as Chromecast built-in.",
    "Voice search via the remote: Instead of scrolling all the way up to the top of the interface and typing out the name of the show, movie or actor you’re looking for, you can simply speak the name into the Android TV remote – this is a great time-saver.",
    "Google Assistant integration: Near the end of 2017, Google's smart assistant made its way into Android TV. Google Assistant on Android TV is the same one that’s built into the Google Home and some higher-end Android phones. Just say \"OK Google\" to begin.",
    "For the most part, it’s a lot like Siri or Cortana – Google Assistant can make calendar appointments, check your to-do list and answer inquiries about popular topics. What makes it unique is that it also can control your smart home products like thermometers, light bulbs and smart locks, too.",
    "Games via the Google Play Store: Fancy playing a game of Pong between seasons of Breaking Bad? Android TV currently has more games on its store than any other TV operating system. Like Android on phones, some games are free and others cost money.",
    "Actor bios and filmographies: Let's say you've just watched Guardians of the Galaxy 2 and now you want to see what other films Zoe Saldana has been in. Search Zoe Saldana on Android TV and you’ll find every title she's starred in. Click a TV show and you’ll find a synopsis, where you can watch the show and the rest of the show’s cast.",
    "A number of different TV brands have Android TV built-in. Right now these mostly include Sony and Philips. A number of Hisense TVs also have Android TV, as do some Cello and Sharp models.",
    "Some TV brands run their own OS, like Samsung and its Tizen platform. Whilst others have deals with third-party companies, like TCL and its partnership with Roku.",
    "What's important to note is that Android TV doesn't run in exactly the same way on every device. Why? Well, each hardware manufacturer has the ability to modify the base Android TV code to tailor it for their system.",
    "For example, for a short period of time, Nvidia Shield was the only device that had access to Amazon. One device might have PlayStation Now, while others might use a spot on the Android TV interface for a first-party app. (LeEco, for example, has a space for its LeTV on the Android TV homepage, for example.)",
    "But these are generally minor differences and not ones to lose sleep about.",
    "With that in mind, let's take a look at just a few of the Android TVs we've reviewed here on TechRadar:",
    "Sony A8H OLED: In our smart TV guide we crowned the Sony A8H OLED the best smart TV with Android TV. That's because, out of all the brands with smart TVs, Sony has the most comprehensive Google solution.",
    "For UK viewers, it has rather cleverly layered a YouView program guide platform on top, deftly addressing one of Android TV’s big weaknesses – catch-up TV provision.",
    "The latest Android version 9.0 (Pie) also features a few Sony-specific improvements. Highlighting an option in the Settings menus, for instance, now brings up a cool ‘exploded’ explanation of what that feature does. There are also new voice control onscreen ‘tips’, and enhanced external device detection and information.",
    "Read our full review: Sony A8H OLED review",
    "Hisense H8G Quantum Series (65H8G): The Hisense H8G Quantum Series does so much at a price that will make you wonder why you'd even consider “premium” televisions. Overall this is an affordable, high-quality television and we highly recommend it for those of you in the US.",
    "This is a feature-packed television, thanks to Google. Android TV is powerful, flexible, and useful all at the same time. We had no problems with the initial setup, which took about 15 minutes total including several app installs.",
    "Google handles the interface for the television, and even during the few weeks of testing, there were several updates and tweaks. So Hisense doesn’t have to create its own interface and the viewer doesn’t have to learn something new. It's a real win-win.",
    "Read our full review: Hisense H8G Quantum Series (65H8G) review",
    "Philips OLED+935 TV: The addition of AI to Philips’ already highly-evolved video processing feels like the discovery of some sort of missing link, enabling the brand to skip a few generations ahead with its always ambitious picture quality dreams. The glorious pictures are accompanied, too, by arguably the finest sound system ever found on a mainstream TV.",
    "However, the Android smart system Philips uses for its UI isn’t the most user-friendly around, but it does run relatively stable on the OLED+935, and comes loaded up with Freeview Play to provide all the UK’s key catch up TV services.",
    "Read our full review: Philips OLED+935 TV review",
    "Cello Smart Android TV: This budget TV from Cello boasts all-round picture quality and smart TV features galore courtesy of the latest Android TV system and Freeview Play. It is exclusive to the UK.",
    "But while the Android operating system is rich in content, it’s not the most intuitive platform to use on this TV. It runs sluggishly on the C2420G, especially when trying to use Google Assistant voice control.",
    "Read our full review: Cello Smart Android TV review",
    "One of the easiest ways to get Android up and running quickly on almost any TV is with a set-top box that runs the smart TV platform.",
    "The Nvidia Shield TV Pro is one of the best streaming boxes on the market. It's an Android-powered set-top-box / games console, it's about as powerful as streaming devices come, and is jam-packed with features that will tempt movie and video game fans alike.",
    "The Xiaomi Mi Box S doesn’t compare to the likes of the Nvidia Shield TV, but if you’re looking for Android TV on a budget, it’s an option to consider.",
    "The simplest and cheapest solution is probably a Google Chromecast streaming stick, though, which can plug into an HDMI port and supply thousands of apps as well as the Android TV platform.",
    "Some of you may be aware of a new 'Google TV' platform featuring on the kinds of devices that would traditionally feature Android TV instead.",
    "Google TV is essentially a successor with a simplified interface that tried to tackle some of the perceived issues of the Android platform, but much of the layout and app support is carried over direct.",
    "There's even a new Chromecast with Google TV model showcasing the benefits of the new platform, with better organization and a personalized recommendation tab, a watchlist and a Live TV menu for folks who subscribe to YouTube TV.",
    "We expect to see it rolled out further in the future, possibly on some smart TVs as well as streaming sticks, though it's unclear whether Android TV is going to be shuttered for good – especially given different TV makers use their own spins on the base Android platform.",
    "It's worth noting that Google TV didn't support the Stadia streaming platform at launch, though."
  ],
  "headers": {
    "4": "What's new with Android TV?",
    "9": "Android TV apps",
    "12": "Android TV key features",
    "20": "Android TVs: what screens run the Android OS?",
    "40": "Other Android TV devices",
    "44": "What's all this about Google TV?"
  },
  "links": {
    "set-top boxes": "https://www.techradar.com/news/best-set-top-box",
    "smart TVs": "https://www.techradar.com/news/best-tv",
    "Philips TVs": "https://www.techradar.com/news/philips-tv-2021-every-oled-miniled-and-ambilight-tv-coming-this-year",
    "Sony TVs": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Nvidia Shield TV Pro": "https://www.techradar.com/reviews/nvidia-shield-tv-pro",
    "now support the TikTok app": "https://www.techradar.com/news/smart-tvs-get-social-with-new-tiktok-app-as-the-samsung-sero-gets-left-behind",
    "a new user interface for Android TVs": "https://www.techradar.com/news/your-android-tv-is-getting-a-free-upgrade-to-google-tv-today",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "TechRadar in an interview": "https://www.techradar.com/news/the-xiaomi-mi-tv-q1-is-the-most-gorgeous-affordable-75-inch-4k-tvs-youll-never-see",
    "Samsung Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "smart TV guide": "https://www.techradar.com/news/best-tv",
    "YouView": "https://www.techradar.com/reviews/bt-tv-with-ultra-hd-youview-box-review",
    "Sony A8H OLED review": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "Hisense H8G Quantum Series (65H8G) review": "https://www.techradar.com/reviews/hisense-h8g-quantum-series-65h8g",
    "Freeview Play": "https://www.techradar.com/news/freeview-play",
    "Philips OLED+935 TV review": "https://www.techradar.com/reviews/philips-oled935-tv",
    "Cello Smart Android TV review": "https://www.techradar.com/reviews/cello-smart-android-tv-review",
    "Xiaomi Mi Box S": "https://www.techradar.com/reviews/xiaomi-mi-box-s",
    "Google Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "but much of the layout and app support is carried over direct": "https://www.techradar.com/news/the-new-chromecast-with-google-tv-is-finally-a-usable-device-for-everyone",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "Stadia": "https://www.techradar.com/reviews/google-stadia"
  }
}