{
  "source": "https://www.techradar.com/news/forget-alexa-astro-is-the-next-step-in-amazons-infiltration-of-your-home",
  "title": "Forget Alexa, Astro is the next step in Amazon's infiltration of your home",
  "category": "smart-home",
  "updated": "2021-10-12T13:12:09Z",
  "author": "david-lumb",
  "summary": "Astro, your robot assistant getting Amazon even deeper in your home",
  "article": [
    "Amazon capped off its late-year event with a surprise announcement: Astro, a new robot that’s essentially a tablet on wheels with enough cameras to host a video chat and map your house. It’s the next big venture for Amazon to get into your house, serve your needs, and make its devices essential to your daily life.",
    "Astro is a ‘one more thing’ we would expect from more experienced consumer tech companies – see the LG Rolling Bot in 2016 and the Samsung Ballie in 2020. While both were pitched to fill similar roles of patrolling homes, notifying users of atypical events, and taking notes, neither of the latter made it much farther than the concept stage.",
    "The Astro bot, which Amazon seemingly started developing in 2018 per The Washington Post, appears more capable than the others based on its listed features: it will follow you around as a mobile video chat platform, livestream footage to your mobile app from afar, patrol the home and investigate disturbances, and likely serve as a mobile Alexa station. We’ll see how the actual units perform when they start heading to testers toward the end of 2021 (though a Vice report from product developers isn't promising), and further understand whether there’s a lot to gain from a vacuum-sized ‘bot wheeling around underfoot to answer queries and wander your home.",
    "Here’s the teaser video showing what we can expect an Astro to do:",
    "For Amazon, on the other hand, Astro serves a clear purpose: entrench its services even deeper in the home. There wasn’t a new Echo speaker launched during Amazon’s event, and only a new wall-mounted Amazon Echo Show 15 product, which tells us the company sees Astro as the way to service consumers now that Echoes have saturated the market.",
    "The big service linked to Astro is the existing Ring Protect Pro, without which the ‘bot can’t perform its autonomous patrols and ‘intelligent investigation’ of suspicious activity, nor can it save videos to Ring cloud storage for up to 60 days. Another service, Alexa Guard, uses Astro to detect sounds of smoke, carbon monoxide alarms, or glass breaking and warn users.",
    "If you’re not signed up for either (purchase of an Astro comes with six months of Ring Protect Pro subscription), you can still manually control the robot through the mobile app and livestream footage from the included cameras (including a few hidden in an extendable mast that rises from its cylindrical ‘neck’). But clearly, for the $999 ‘Day 1 edition’ test group price ($1,499 normally, and no plans to test or sell outside the 50 US states), you’re probably going to want the full range of functionality.",
    "And for that, you’ll want to sign up for all the services, tying your daily workflow even closer with Amazon’s products and services in ways that Echo speakers haven’t been able to do. Which reflects what Amazon’s priorities are for Astro, as Dr. Robin Gaster, President of data analytics firm Incumetrics and author of Behemoth, Amazon Rising: Power and Seduction in the Age of Amazon, told TechRadar over email.",
    "“Obviously, Astro is potentially the end data collection mechanism, and seems to fit with the Echo for information and entertainment, the Ring for security, and the Halo for health and wellness,” Gaster said. “All aimed at making Amazon indispensable around the home.”",
    "“Becoming the key assistant around the home is obviously a top long term strategic priority for Amazon – far more than it is for Google, its main competitor,” Gaster said. “Astro seems like a highly preliminary toe in the water for a physical assistant – miles from being useful now, but perhaps a first step on the path to a robot butler, which could in the end be integrated with the Echo/Ring/Halo. Note that in that case, the Astro would need to gather no data at all: Amazon would already have all it needs.”",
    "While Amazon has its work cut out for it justifying such high prices, there are things the Astro can do that the Echo or Echo Show can’t. But they are all situational and, for now, theoretical, as the product doesn’t have much competition in terms of functional consumer-facing assistant robots.",
    "First, the video chats: yes, an Echo Show can do it, but it can’t follow you around the house. How much easier is it to command Astro to head over to someone else in another room during a voice call instead of carrying the device there yourself? Or, if the Astro can follow such subtle commands, point at a subject and have the robot point its cameras at it (say, to show home damage to a technician or have someone walk you through a recipe)?",
    "And while a network of Echos could also handle assistant duties, Astro can trail its owner to set up reminders and deliver messages, calls, and other communications – which could be more convenient coming from a screen-equipped robot nearby rather than talking through verbal commands or walking over to an Echo Show. Astro even has some detachable add-ons that make use of its rear cargo area to carry drinks or, and I quote from its Amazon listing, ‘a Furbo Dog Camera that tosses treats to your pet.’",
    "But the big pitch is for security: with that Ring Protect Pro subscription, you can set up Astro to use its cameras and microphones to map your home and patrol for disturbances or strangers. It certainly seems like it could comfort folks away from home, especially with Astro’s live camera feed to check on pets. You can also save footage for up to 60 days should you worry your living space will be subject to heists.",
    "And there’s another subscription service not yet on the market that Amazon revealed at its recent event: Alexa Together, which Astro is linked to in some capacity. While details are vague, this service is described to help users remotely care for aging loved ones, and it's possible Astro could be a sort of go-between for younger helpers to set up reminders and video chat with folks in their care.",
    "Amazon is pitching Astro as an assistant that could make everyone’s life just a bit easier – they just have to give it access to their home and listen in on everything. To be clear, Amazon has included a physical button on the ‘bot that turns off all microphones, cameras, and motion sensors, so you can at least put the blinders on when you need privacy. Since you need cameras and motion sensors for Astro to move around at all, though, it’s kind of an all-or-nothing proposition if you want the robot performing most of its duties.",
    "Astro runs into the same privacy concerns as the Echo and other always-listening/watching products, but with far more visual and motion sensors: the new product follows you around and maps your home to effectively navigate and spot disturbances, as well as identify inhabitants with facial recognition. That’s a lot of very personal data, which might make privacy-minded consumers squeamish, so we reached out to Amazon to clear up which data is going where. (The company also provided a four-page white paper on Astro's data collection for the curious.)",
    "The facial recognition (called ‘Visual ID’) data is securely stored on the device, an Amazon spokesperson told TechRadar – it isn’t stored in the cloud, but mapping data is. When Astro explores your home, it sends mapping information derived from its navigation sensors to the cloud, where Amazon processes it and related information to create and store your Map. This allows you to view a rendering of your Map in the Astro app, where you can edit room names manually as well as set boundaries where Astro cannot enter (the Map data can be deleted at any time). Data that is sent to the cloud is encrypted in transit and securely stored on Amazon’s servers.",
    "There are other topical concerns with data collected by Amazon cameras, especially since the company has extended partnerships with more police and fire departments in 2021, per The Verge, which has led Amazon to hand over recordings and information captured by its Ring video doorbell devices. Crucially, though, these cameras don’t point in the home, and are subject to subpoenas. As the Amazon spokesperson told Techradar: “Requests for Assistance posts from public safety agencies do not support sharing of videos from indoor cameras, including Astro.”",
    "And then there’s the big worry: that Amazon will do what Amazon has done with user data on its platforms and sell data collected by Astro. To be clear, there is no record of Amazon doing so with audio data recorded by Echo speakers, as a point of comparison. When TechRadar asked Amazon whether it would use Astro-collected customer behavior (house heatmaps, daily schedules, overheard conversations) for any other purpose, like refining non-Astro services or sending to partners or advertising, an Amazon spokesperson replied curtly: “For us to consider that change, it would have to offer outsized benefits to customers and provide the right customer controls.”",
    "Whether or not it passes along data to any party outside Amazon, the Astro will certainly collect more than any of the company’s products has before – something that may not sit well with privacy advocates and security experts, but which the public may not care enough about.",
    "“Astro may also be a litmus test – an opportunity to see where exactly concerns about privacy become operational,” Gaster told TechRadar. “So far, the success of the Echo/Ring/ suggests that privacy concerns aren't much of a barrier for Amazon's home ambitions at all.”"
  ],
  "headers": {
    "10": "What can Astro do that Echoes can’t?",
    "15": "Amazon deeper in your home: should you be worried?"
  },
  "links": {
    "late-year event": "https://www.techradar.com/news/live/amazon-event-2021-live-blog",
    "Astro": "https://www.techradar.com/news/amazons-astro-robot-is-a-24-hour-security-guard-and-smart-assistant-all-rolled-into-one",
    "LG Rolling Bot": "https://www.techradar.com/reviews/gadgets/lg-rolling-bot-1315699/review",
    "Samsung Ballie": "https://www.techradar.com/news/samsung-ballie-is-a-cute-rolling-robo-pal-that-narcs-on-your-messy-dog",
    "The Washington Post": "https://www.washingtonpost.com/news/innovations/wp/2018/04/23/amazon-is-reportedly-building-a-home-robot-an-expert-explains-how-close-we-are-to-the-jetsons/",
    "Vice": "https://www.vice.com/en/article/93ypp8/leaked-documents-amazon-astro-surveillance-robot-tracking",
    "Behemoth, Amazon Rising: Power and Seduction in the Age of Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2F1736001205%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5195554271721272000-20",
    "Amazon listing": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB078NSDFSB%3Fref_%3Dods_surl_va%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1070090967712139300-20",
    "white paper": "https://customerdocumentation.s3.us-west-2.amazonaws.com/Amazon+Astro/Amazon+Astro+Privacy+Whitepaper.pdf",
    "The Verge": "https://www.theverge.com/2021/1/31/22258856/amazon-ring-partners-police-fire-security-privacy-cameras"
  }
}