{
  "source": "https://www.techradar.com/news/new-suicide-squad-trailer-teases-the-impossibly-huge-starro",
  "title": "New Suicide Squad trailer teases the impossibly huge Starro",
  "category": "entertainment",
  "updated": "2021-06-24T10:15:42Z",
  "author": "axel-metz",
  "summary": "Like a starfish, but bigger",
  "article": [
    "James Gunn’s The Suicide Squad just received a brand new trailer – and we’ve got a much better look at the movie’s gigantic starfish baddie, Starro.",
    "Officially known as Starro the Conqueror, the massive, tentacle-laden creature can be seen destroying cities, launching the movie’s main characters across the screen and shooting lasers out of its slippery limbs. And if that's not villainous enough, it’s also telepathic. Because why not, right?",
    "Although not strictly a series reboot or canon sequel to David Ayer’s 2016 movie of the (almost) same name, Gunn’s The Suicide Squad will follow a similar-but-not-the-same gang of DC supervillains – including Harley Quinn, Bloodsport and Captain Boomerang – tasked with destroying a mysterious Nazi-era laboratory.",
    "The movie is scheduled for release in theatres on August 6, and will debut concurrently for 30 days on HBO Max for those in the US.",
    "In addition to those DC characters listed above, The Suicide Squad will also feature the likes of Rick Flag, Peacemaker and King Shark, and boast an all-star cast including Idris Elba, John Cena, Peter Capaldi and Sean Gunn, among others. Margo Robbie, Viola Davis, Joel Kinnaman and Jai Courtney reprise their roles from Ayer’s 2016 original.",
    "The director previously helmed both Guardians of the Galaxy movies, and is currently working on a third instalment in the popular space-hopping series. For a time, though, Gunn had been fired from his directorial role on Guardians of the Galaxy Vol. 3, and so was offered the chance by Warner Bros. to hop from one extended universe to another to play around with some of DC’s most obscure characters.",
    "As part of the deal, Gunn also signed on with the studio to create a standalone Peacemaker series for HBO Max, which is expected to star Idris Elba.",
    "This latest trailer – set to the made-for-the-movie tune of \"Rain\", by grandson and Jessie Reyez – didn’t arrive quite as Warner Bros. had hoped, with it leaking online before being shared by Gunn himself.",
    "An unlisted YouTube video containing the new footage prematurely circulated online, which some of the movie’s cast saw as the green-light to re-share. Gunn subsequently called out the actors (albeit light-heartedly) in a tweet.",
    "Still, with the movie’s release just over a month away, it’s likely that the trailer’s accidental circulation only worked to further stoke the fires of enthusiasm for DC’s latest superhero (or supervillain?) adventure.",
    "Come on, who doesn't want to see this telepathic mega-starfish in action?"
  ],
  "headers": {
    "7": "Someone jumped the Gunn"
  },
  "links": {
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-release-date-plot-cast-trailer-and-more",
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-7756056342199162000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fuk%2Fnews%2Fthe-suicide-squad-official-trailer-will-arrive-very-soon"
  }
}