{
  "source": "https://www.techradar.com/news/his-final-fantasy-jrpg-legend-hironobu-sakaguchi-talks-apple-exclusive-fantasian-next-gen-gaming-and-an-iconic-career",
  "title": "His Final Fantasy? JRPG legend Hironobu Sakaguchi talks Apple exclusive Fantasian, next-gen gaming and an iconic career",
  "category": "gaming",
  "updated": "2021-06-30T08:24:11Z",
  "author": "gerald-lynch",
  "summary": "Is Apple Arcade's Fantasian really going to be the Final Fantasy creator's last game? Hironobu Sakaguchi speaks to TechRadar",
  "article": [
    "If Nintendo’s Shigeru Miyamoto is the king of platform games, then Hironobu Sakaguchi is the grandfather of role playing games. Creator of the massively popular Final Fantasy series, he’s been the driving force behind some of Japan’s all-time greatest gaming exports. No Hironobu, no chocobos, no moogles and, arguably (not to discount Dragon Quest fans), no JRPG (Japanese role playing game) genre altogether – at least when it comes to its popularity in the western world.",
    "Leaving long-time collaborators (and home of Final Fantasy) Square in 2003, he formed his own development company, Mistwalker, and has been pushing the envelope for JRPGs on mobile and consoles ever since.",
    "His latest project, Fantasian, is a nod back to the classic, sweeping RPGs of old on which Sakaguchi built his career, all the while taking advantage of the latest technologies and a unique, hand-crafted diorama-focused art style. And it could well be his last.",
    "“Working on Fantasian was such a huge colossal scope of work and it was a bit overwhelming, to be honest,” he tells TechRadar over video call from his base of operations in Hawaii.",
    "“My next step is probably to kind of take a step away, maybe rest a little bit, and kind of see where we are. I'm not saying that it is it, but if this were my retirement project, I think that that would still leave me feeling pretty whole. I felt I didn't really leave much on the table with Fantasian and not that it is but, yeah, that's kind of my sentiment right now.”",
    "You can hardly blame him. It’s an ambitious game, certainly in the sense of what’s expected from a mobile experience. Set to land in two chapters later this year, each 30+ hours in length, the Apple Arcade platform itself brought challenges that would have been unheard of earlier in Sakaguchi’s career.",
    "“The biggest issue I would say is really adapting to the different screen ratios and resolutions,” says Sakaguchi. “You take an iPad which is basically almost a square type ratio all the way into platforms in between – your iPhone which is the most extreme kind of elongated horizontal aspect ratio, for instance – and making the game playable on either extreme and all platforms. Making it fun across every device was definitely a big challenge for our development team.”",
    "Then there’s the multitude of input options available to Arcade players today – across Mac, MacBook, iPhone, iPad and Apple TV, Mistwalker had to prepare control schemes for touchscreens, keyboards and mice and gamepads simultaneously. Touch seems Sakaguchi’s preferred approach for Fantasian.",
    "“We really pushed ourselves, on the touch interfaces, making sure that when when you're manipulating the characters and are going through the stages or battles, that it felt really really good. The idea of touching was really almost synergistic with the idea of using hand-made dioramas, like you're touching these hand-crafted scenes with your hand, which is really a cool experience. But we know some players do prefer using a controller input method, too.”",
    "And those environments, all 150-plus of them, are sublime. Like a high-fantasy model railway set, the texture and detail provided by the diorama settings – whether across a dusty village or lush green expanse – offers a tangibility that would be otherwise near-impossible to achieve digitally. It’s the difference between the original Star Wars films and the godawful prequels – a sense of a lived-in world; worn, used and real.",
    "The use of diorama models was decided upon “at the inception of the project,” says Sakaguchi. “The entire concept was an RPG where you get to traverse through handcrafted dioramas,” and it comes from a long-held love of handcraft skills.",
    "“I would say definitely there was a hobby element to it. I liked crafting these sort of plastic models or model kits from a very young age,” says Sakaguchi (before nipping away to another room, returning with his own Warhammer 40,000 Space Marine. “I hand-painted him myself,” he says proudly.",
    "“I think there is a very unique and cute sort of movement that could only be done with these handcrafted dioramas. Alongside my previous work on Terra Battles [another Sakaguchi title that employed hand-crafted elements, Ed.], it helped me realise that that was an awesome new visual expression that you can use in the medium.”",
    "But for every visual opportunity the art-style presented, so too came development challenges.",
    "“While on a very basic level, I would say using dioramas doesn’t change the game mechanics or how the gameplay unfolds, very much – but it was more challenging with the development pipeline,” explains Sakaguchi.",
    "“For example, when working with dioramas, later on in the development cycle when I would say, ‘Hey I want to add another path here or link these two stages together,’ of course that would be impossible because you've already committed to building a physical set. So, changes to the environment were extremely tough if not impossible in that regard. You have to be really, really intentional with the first blueprints or designs that you make for the environment.”",
    "Thematically, though, it’s classic Sakaguchi fare – the natural world at odds with the creeping spread of industrialization. A sci-fi / fantasy adventure, players will take the role of Leo, an amnesiac hero in a multi-dimensional quest to reclaim his memories – all the while preventing gods from disturbing the balance of ‘chaos and order’ and a ‘mechanical infection’ from engulfing the world. Naturally.",
    "Such inspiration comes quite easily for Sakaguchi, even four decades into his career. It’s partly down to his reading habits (“I read a lot of articles in scientific journals that have to do with the physics and metaphysics that happen in our universe, and use it as a foundation to try to imagine how everything might be interconnected”), and partly the star-studded company he keeps – even if their involvement on this latest project hasn’t been direct.",
    "“I worked with Akira Toriyama, one of the world’s most famed manga artists, on Blue Dragon and Chrono Trigger, and with Takehiko Inoue on Lost Odyssey, who did the Vagabond and Slam Dunk manga. Imagining their illustrations and the worlds that they create, and taking that and placing it into a video game, moving about them and kind of manipulating them to me is a big source of inspiration.”",
    "One big name who is making a massive contribution however is renowned composer Nobuo Uematsu, who has worked with Sakaguchi on almost all of the Final Fantasy creator’s projects, including scoring Fantasian. Responsible for some of the most memorable tunes in all of gaming, there’s the suggestion that health issues may mean that Fantasian is Uematsu’s last big gaming project, and final complete soundtrack.",
    "But it seems Fantasian will be a worthy swan-song for both collaborators, should retirement rumours prove true – mobile gaming projects now rival the scale of a console undertaking.",
    "“I think over the past 10 years there have been a lot of innovations,” says Sakaguchi. “There’s the graphic fidelity as well as the sheer scope of what is possible to put onto a mobile platform.”",
    "But perhaps not all that innovation has been positive.",
    "“I think the ‘Gatcha’, or kind of random loot box system has become a real mainstream game mechanic, and just random number generators and kind of randomising to monetize on microtransactions is really pushing companies in that direction,” laments Sakaguchi.",
    "“That’s almost become the foundation of a genre, where you layer different gameplay on top of that core loot box mechanic. So over the years I would say a lot of the games kind of converge on similar points and there lacks a bit of diversity in terms of the gameplay because of that.”",
    "Apple Arcade as a platform thankfully side-steps many of mobile gaming’s worst impulses, and has provided mobile developers an apparently-healthily financed way of building innovative, premium mobile games. But Sakaguchi’s fondness for Apple goes beyond its gaming business model.",
    "“My introduction or first exposure to the game industry was on an Apple II – I was still a student at the time and it was just so shocking what I saw on Apple II and that's almost what brought me to the game industry. So here we are 35 or 40 years later, to be able to work on the Apple platform I think is a very interesting kind of cycle.",
    "“The Apple II is wonderful.”",
    "Apple Arcade is one of a growing number of game subscription services shaking up gamers’ expectations and bank balances, from Xbox Game Pass to PlayStation Plus. It’s a far cry from the boxed-cartridges of Sakaguchi’s early gaming career, but one he’s quietly hopeful about.",
    "“This is the similar path that the music industry and the movie industry has gone down. There are a lot of subscription services now that I think the average consumer has been attuned, or kind of groomed to be able to understand how it works and what that means,” says Sakaguchi.",
    "“I think players are ready for it but it also increases the accessibility for a lot of the games that we create, and gives the people the options to play what they want. The challenge will be finding the right business model to translate that back to the developers and the guys creating the games, and making sure they're able to earn enough or generate a profit. And I think we're still exploring a lot of those business models together, but I think once everyone is on board with it, it will be a really cool way for people to experience many games.”",
    "Of less interest to Sakaguchi is the new wave of console hardware. When quizzed on the PS5 and Xbox Series X, the Fantasian producer is more interested in the potential that virtual reality and augmented reality hardware could bring.",
    "“Virtual reality is a really interesting innovation,” he says, “But the hardware itself is still a little too heavy, it's a bit cumbersome. So, augmented reality, AR, might be a more interesting innovation, especially if they can adapt that into a much lighter pair of glasses, like you would normally wear. I feel we're on the verge of a breakthrough in that. It could be really interesting when you throw on a pair of AR glasses, you look at your reality and then you could start putting CG elements into that world.”",
    "Indeed, Sakaguchi’s Fantasian, blending real-world settings with digital character models, lends itself well to the promise of AR. And the ideas quickly begin to flow.",
    "“Maybe you're looking at the ocean for example, and the luxury cruise liner from Fantasian, and that just starts showing up in the ocean, or maybe you're staring at the mountains and this massive airship just comes over the mountains. I think there's a lot of interesting visual things you could do.”",
    "It’s befitting of a man whose career has always looked to push the genre forwards – despite owning a copy, he’s yet to try the Final Fantasy VII Remake (though sang the praises of long-time collaborator and FF7 director Tetsuya Nomura, calling him “a really talented man”).",
    "“I heard from him that this was going to happen and looking at what he talked about, the innovation in different hardware capabilities as well as the growth in their own CG team, really Final Fantasy VII Remake was almost a pursuit or an exercise to challenge and really push everything to the max. I think it's really, really admirable what he's doing in that space and I support and encourage him in any way that I can.”",
    "It would be difficult to tempt Sakaguchi to revisit his past, classic works then. But there is perhaps one person that could do it.",
    "“I don't really have a strong desire to explore remakes. I think I've always gravitated towards jumping onto new ideas or new worlds and crafting more original characters. But one thing I can say is that I am a huge Akira Toriyama fan, so if I look back on the games that I've created with him – of course there is Chrono Trigger and Blue Dragon – it would be interesting to make something with Toriyama-san again.",
    "“Whether it is a remake or something that could be original... whether or not that's possible of course is an entirely different story, but that would be something that would interest me.”",
    "It’s an enviable past to revisit. But across Hironobu Sakaguchi’s entire career, it’s always been most exciting to see what comes next. Should it truly be his final fantasy, Fantasian is shaping up to be an exquisitely-crafted epilogue.",
    "Fantasian will launch exclusively on Apple Arcade devices later this year."
  ],
  "headers": {},
  "links": {
    "Fantasian": "https://www.techradar.com/news/final-fantasy-creators-fantasian-is-made-with-real-models-and-its-gorgeous",
    "Apple Arcade": "https://www.techradar.com/reviews/apple-arcade",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "MacBook": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Chrono Trigger": "https://www.techradar.com/news/10-classic-games-the-snes-mini-is-missing",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-deals",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}