{
  "source": "https://www.techradar.com/news/how-business-leaders-can-adapt-for-the-covid-rebound",
  "title": "How business leaders can adapt for the Covid rebound",
  "category": "computing",
  "updated": "2021-05-17T14:19:58Z",
  "author": "mike-smith",
  "summary": "How to adapt businesses for the Covid rebound",
  "article": [
    "Covid-19 hasn’t just transformed the working day. It has fundamentally changed what it means to be a business leader and has created a new and demanding set of priorities. These include building a strong company culture as we move from mass remote working to a more hybrid model, and digitizing and streamlining services to improve employee collaboration and acquire new customers. Boosting resilience and protection from cyber threats is another key consideration.",
    "Leaders shouldn’t be intimidated by these challenges. They should be excited by them. Our study with the Centre for Economics and Business Research (Cebr) shows that if CEOs make the right decisions, they can drive a £232bn boost to UK GDP by 2040. And I believe there are several straightforward steps leaders can take to meet new expectations and set organizations up for a successful bounce back from Covid-19.",
    "As the vaccine rollout and the Prime Minister’s roadmap towards the opening of society progresses, most organizations are going to move from mass homeworking to a more hybrid model, in which employees operate from different locations, including the office.",
    "While there will be differences between sectors, and some leaders may encourage employees to return to the office more than others, more flexibility in working patterns will become the norm. This raises questions for leaders. How do they build a clear and unified corporate identity and prevent siloed cultures developing between those operating at home and in the office? How do they ensure that new starters, including those at the beginning of their career with no experience of the workplace, feel like they belong to the organization and have the chance to learn from colleagues?",
    "The answers lie in taking bold and visible action to reinforce corporate identity and values. As the authors of a recent Stanford Social Innovation Review commented: “Culture persists only because people act in ways that uphold its principles and codes.” And leaders have a responsibility to set an example.",
    "Leaders must provide a clear vision and purpose for their employees so that regardless of their role or where they’re located, everyone understands how they are contributing to success.",
    "A key part of this is using digital tools to sustain a sense of togetherness. Marc Boscher, CEO of the workflow management platform company, Unito, has done this well by encouraging his teams to use collaboration tools and document every change and decision that gets made, which has helped ensure that everyone stays on the same page while working towards their ultimate goal. And he has used a matching tool in Slack that has helped colleagues from different departments meet each other for quick virtual coffees, which has been important for ensuring that new joiners feel part of the team.",
    "Bold, symbolic actions are also important. For example, after the pandemic hit, IBM set up a grassroots Work From Home Pledge, led by its CEO, to reaffirm its company ethos and show how employees could support each other in balancing work and life while operating remotely – and how to stay socially connected. This kind of action demonstrates an understanding of the pressure on frontline employees and positions the leadership team as compassionate and approachable.",
    "Communicating their vision and purpose with strength, integrity and compassion is critical for leaders as they look to implement hybrid working in the right way, and ensure organizations retain that sense of togetherness and spirit which defined predominantly office-based working.",
    "Consumer expectations have dramatically changed since Covid-19.",
    "McKinsey’s global behavior survey identified a flight to digital affecting almost every product category – as well as a “shock to loyalty” – with increasing numbers trying out different shopping behaviors. In reviewing business performance and considering plans to rebound from the pandemic, leaders must think more like consumers and question whether existing products and services are meeting evolving needs and expectations.",
    "An example of a business that has done this successfully is Nike – whose CEO, John Donahoe, recently said that “digital is here to stay.”",
    "The leadership team responded to consumer appetite for services in local rather than national settings by setting up smaller neighborhood stores to serve as pickup hubs for online orders. These initiatives helped digital sales to soar by 82% during the first stage of the pandemic.",
    "The business’ success over the last year is an example of what can be achieved when leaders think like consumers and invest in digital services that create a sense of loyalty. The flight to digital and disruption to customer loyalty aren’t going to disappear. These are permanent changes to purchasing behavior, underlined by McKinsey’s finding that 65% will continue to behave in these new ways post-pandemic.",
    "So, leaders need to continue investing in digital platforms that will work for consumers and ensure a focus on customer centricity permeates every level of their organization.",
    "Covid-19 has led to a significant rise in cyber-attacks – something which has been recognized by Europol and the UK National Cybersecurity Centre.",
    "To combat this, leaders need to consider business resilience and cybersecurity strategies as a matter of urgency. But it is important they consult their employees. 95% of cyber-attacks are successful because of human error, according to IBM – so if a security strategy doesn’t work for staff, then it’s probably going to expose an organization to a threat.",
    "Developing an effective cyber security strategy should be a consultative process. Leaders should seek to listen to employees about what would work best for them and assess levels of technical understanding throughout their organizations.",
    "This inclusive and transparent way of handling business resilience will strengthen leaders’ relationships with staff and mean that costly mistakes are much less likely to happen.",
    "This is a challenging climate which has placed unprecedented demands on leadership teams. But now there is an opportunity to switch thinking from surviving and stabilizing towards bouncing back. And by tackling issues like hybrid working, digitalization and business resilience head on, business leaders can ensure their organizations emerge from the crisis stronger than they were before and unlock a £232bn opportunity for the UK economy."
  ],
  "headers": {
    "2": "Strengthening culture",
    "9": "Think like a consumer",
    "15": "Recognize the relationship between people and security",
    "19": "From survival to recovery"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "employee": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "employees": "https://www.techradar.com/best/best-employee-scheduling-software",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses"
  }
}