{
  "source": "https://www.techradar.com/news/your-amazon-kindle-might-look-a-bit-different-soon-but-its-a-good-change",
  "title": "Your Amazon Kindle might look a bit different soon, but it's a good change",
  "category": "tablets",
  "updated": "2021-08-18T15:38:09Z",
  "author": "tom-bedford",
  "summary": "Home screen redesigns",
  "article": [
    "A new Amazon Kindle update is changing the way your ereader looks - not physically, of course, but with a software resdesign that spruces up the home screen design.",
    "The new home screen looks roughly similar to the older one, but with some important changes. Mainly, the toolbar at the top is gone, and now one big search bar takes its place. There are also two buttons at the bottom, one for 'Home' and the other for 'Library', so you can easily navigate around - a central icon can also be used to jump into your last-read book.",
    "The new update feels a little more like the Kindle Android app, which has a few of the same layout features, though it's still pretty similar to the older Kindle menu.",
    "The best change, though, is for the quick-settings menu. Before, you had to tap around the top of the screen and hope these options would appear - now, an easy-to-see arrow near the top lets you swipe down to bring up the settings.",
    "It seems this update is very popular, with Reddit threads full of people singing its praises - people have reported improved touch response and UI smoothness along with the redesign.",
    "This new Kindle firmware update, version 5.13.7 for those who care, is currently rolling out to Amazon's ereader family - most devices should be eligible in the next few weeks. You'll need to connect to Wi-Fi to get it though.",
    "It's great to see Amazon bring improvements to its older products, as the continued support of long-lasting devices like Kindles is partly what you're paying for. Unlike a smartphone, you don't want to be replacing an ereader every couple of years.",
    "We're seeing fairly regular Kindle updates, in fact - every few months there's an improvement brought out, like book art lock screens in April. With older devices getting such regular updates, it begs the question 'do we really need new devices'?",
    "It's been a while since we saw a hardware update for the Kindle line - the last 'standard' and Oasis device were in 2019, and we haven't seen a new Paperwhite since 2018, and we used to see new versions basically every other year.",
    "People are hoping for a new Kindle, as well as an upgraded Kindle Paperwhite or Kindle Oasis, but it doesn't sound like Amazon is in a huge rush to release these products.",
    "But if this new update teaches us anything, it's that owning an old Kindle doesn't lock you out of new updates. So if you buy a current model, you might be missing out on whatever tweaks and improvements any new ones bring, but you'll still likely get software updates for years.",
    "So while we're crossing our fingers for new Amazon Kindles to test out, if you're looking for a new ereader to buy, it's probably not worth waiting for a new generation to launch. Just buy one of the oft-discounted current-gen ones.",
    "Via Goodereader"
  ],
  "headers": {
    "6": "Analysis: in with the old, but where is the new?"
  },
  "links": {
    "Reddit threads": "https://www.reddit.com/r/kindle/comments/p5zw8n/kindle_updated_successfully_to_5137_my_views_on/",
    "book art lock screens in April": "https://www.techradar.com/news/amazon-quietly-rolled-out-a-kindle-feature-users-have-been-requesting-for-years",
    "new Kindle": "https://www.techradar.com/news/new-amazon-kindle-2021",
    "Kindle Paperwhite": "https://www.techradar.com/news/new-amazon-kindle-paperwhite",
    "Kindle Oasis": "https://www.techradar.com/news/new-amazon-kindle-oasis-2021",
    "Goodereader": "https://goodereader.com/blog/kindle/amazon-introduces-new-home-screen-on-the-kindle"
  }
}