{
  "source": "https://www.techradar.com/news/facebook-really-wants-to-become-a-proper-online-shopping-site",
  "title": "Facebook really wants to become a proper online shopping site",
  "category": "computing",
  "updated": "2021-09-17T11:38:42Z",
  "author": "mike-moore",
  "summary": "New business tools should help brands spread their reach",
  "article": [
    "Facebook is ramping up its efforts to become a real e-commerce hub with the launch of new tools for businesses to help boost their brands online.",
    "The social media giant has unveiled a number of new features which it says will help brands better appeal to users, offering a more complete online shopping experience.",
    "The new additions include better ways for users to get in touch with their favorite brands, improved discovery options, and new Work Accounts for those that want to use Facebook purely for business purposes.",
    "Described by Facebook as \"products for the next era of personalized experiences\", the launch comes as the company aims to safeguard its strong online advertising position, particularly following the recent launch of new privacy features from Apple aimed at ensuring consumers aren't unnecessarily tracked online.",
    "Facebook says its new additions allow companies to reach the most appropriate customers, as well as communicate with them better. Going forward, brands will be able to choose which specific Facebook-owned platforms to advertise on, with WhatsApp, Instagram, Messenger and the Facebook News Feed all available.",
    "As many businesses now tie together multiple platforms, such as advertising on Instagram but communicating with customers on WhatsApp or Messenger, Facebook says it will make such tasks easier by adding in click-to-chat WhatsApp buttons to existing Instagram profiles.",
    "Businesses will also soon be able to build ads that direct users directly to their WhatsApp profile from their Instagram account, helping to drive sales.",
    "The news comes shortly after Facebook revealed that WhatsApp will soon let users find and search for shops and other e-commerce businesses within the app itself.",
    "The company also revealed updates to its Facebook Business Suite platform, which gives brands an in-depth overview of their profiles and activities across the company's offerings. Going forward, brands will be able to directly email customers using the service, as well as launching a new File Manager feature that allows businesses to easily create, manage and post content.",
    "Lastly, Facebook is now testing Work Accounts, which will allow employees manage business pages without needing to log in to the site using their personal accounts, a move it says will simplify work processes whilst maintaining security.",
    "\"Today is just a step towards the future we’re building for and with businesses in this next era of personalization and we’ll share more on this as it progresses,\" the company wrote in a blog post announcing the news."
  ],
  "headers": {
    "3": "Personalized experiences"
  },
  "links": {
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "within the app itself": "https://www.techradar.com/news/whatsapp-wants-to-let-you-search-for-businesses-within-its-app",
    "Facebook Business Suite": "https://www.techradar.com/news/facebook-is-making-it-easier-to-run-a-business-online",
    "a blog post": "https://www.facebook.com/business/news/introducing-products-for-the-next-era-of-personalized-experiences"
  }
}