{
  "source": "https://www.techradar.com/news/pc-games-to-put-a-scream-in-your-halloween",
  "title": "PC games to put a scream in your Halloween",
  "category": "computing",
  "updated": "2021-10-31T15:00:04Z",
  "author": "rosario-blue",
  "summary": "Fright Night, but make it PC",
  "article": [
    "It's Halloween, and you’re in the mood for a legitimate reason to get properly spooked? Well, our list of the scariest PC games to put that fright in your night is here.",
    "For some of you, Halloween is every day. It’s a full-time commitment. To that, we say, well done! But this list is mainly for those who lack a continuous taste for the macabre.",
    "First up is Outlast, definitely one of the more terrifying titles on our list. Many have attempted to complete it but couldn't take the heat.",
    "Set in an asylum called Mount Massive, you play Miles Upshur, an investigative journalist hunting for information for his article following a tip from a source.",
    "Your only hope for survival is to hide, run, and hide well. That's not such a bad strategy considering some of the monstrosities and horrors that await you in Outlast. Think you‘ve got what it takes? Be our guest.",
    "Outlast and Outlast 2 are available to purchase on Steam.",
    "Developed by Bloober Team and published by Aspyr, Layers of Fear is a first-person psychological horror game filled with scary sounds, jump scares, and twisted mind games to make you question your sanity.",
    "You play as a schizophrenic painter on a mission to create his great masterpiece, but you have to make it through the psychedelic twists and turns of a Victorian mansion.",
    "While it’s not laced with gruesome ghoulies like other titles on this list, it does induce an atmosphere of fear that will keep you on edge from start to finish.",
    "LoF is available on Steam, and there’s a VR version too if you’re brave.",
    "This classic Capcom title serves true survival-horror, which some of its previous titles lacked. It provides the atmosphere, tension and the kill it with fire-worthy opponents you want from a horror game.",
    "Inspired by the Texas Chainsaw Massacre and more recent survival horror games like Outlast, RE7, is set in an abandoned farmhouse in rural America. You play as Ethan Winters, a civilian looking for his missing wife.",
    "Set in first-person view (a new approach for RE games) RE7, creates an immersive experience, unlike any other RE game.",
    "RE7: Biohazard is available to purchase on Steam and all the other titles in the franchise, including the less scary (but still spooky) sequel, Resident Evil 8.",
    "Issac Clarke is your name, and engineering is your game, but you have to save your last remaining crew members on the USG Ishimura instead. Well, your other crew members are technically alive, just infected with alien gunk.",
    "While it may cause you to whimper for your mother and require regular breaks to recoup, Dead Space is an elite title and should be respected as such.",
    "So good luck, and remember headshots are not your friend dismembering is.",
    "You can get this now classic, third-person thriller on Steam, where you can also pick up the other entries, and all the DLC’s, from the series.",
    "In this procedurally generated, roguelike survival-horror game, you have to find tools to help you survive and outrun the scary creatures that are after you.",
    "Developed and published by Team Junkfish, the indie studio gave the horror genre a welcome refresh.",
    "There are AI-driven monsters and permadeath, so survival means survival. You’re going right back to the start otherwise, but likely in another location and with different monsters. You’ll be screaming for someone to save you in no time, but no one’s coming, so survive!",
    "Monstrum is available to purchase on Steam. Oh, and if you're feeling especially brave, you can play it in VR!",
    "Arguably the scariest game on our list, Alien: Isolation, is a 2014 horror-survival game developed by Feral Interactive and published by SEGA for the PC. This game understood the assignment and truly put the “phere” in atmosphere (ahem).",
    "If you’re a fan of the Alien movies, you’ll be familiar with the legendary Ellen Ripley. In this masterful title that expertly captures the feel of the 1979 classic, you play as Ripley’s daughter Amanda, who goes on a search for Ripley as she has been missing for 15 years.",
    "Be ready for the dread and terror this award-winning and stunning masterpiece has in store for you.",
    "Grab a copy on Steam.",
    "Still in Steam Early Access, this four-player online co-op psychological-horror game developed and published by Kinetic Games is a fright. And no, having three other friends to play along with doesn’t make it any less scary.",
    "Hunt down ghosts in this immersive experience. Support your team by keeping a close watch on the CCTV cameras from your van, or get into the thick of things and collect paranormal data and evidence to sell to a ghost removal team.",
    "What’s even better about Phasmophobia? It’s cross-platform and available on VR. So, grab yourself and your crew a copy on Steam.",
    "Little Nightmares is an atmospheric, adventure horror game developed by Tarsier Studios and published by Bandai Namco Entertainment. Although it's not necessarily the scariest game on our list, it feels very disconcerting.",
    "You have to navigate a terrifying place called the Maw filled with hungry monstrosities and twisted beings trying to devour a tiny innocent child named Six.",
    "As Six, you have to avoid the many dangers of the Maw while constantly dodging new dangers.",
    "One of the most distinct things about Little Nightmares, especially for a horror game, is its stunning art style.",
    "Little Nightmares is available to purchase on Steam.",
    "Whatever you do choose to play to keep you in Halloween spirit, be sure to bolt your doors and close your curtains as you never know who or what might be lurking outside.",
    "Released in 2019 by Hitchcock Games and developed by Shawn Hitchcock, Pacify is a multiplayer, co-op survival- horror game that's genuinely twisted and scary.",
    "Pacify is split into three missions with unique stories, gameplay, monsters, and environments. You have to capture paranormal entities to assist an organisation named PAH Inc. with dealing with them.",
    "In Pacify, there is a co-op and single-player mode, and interestingly, it also has a PVP mode.",
    "So, if you want a good fright, then you must try Pacify, plus it’s available on Steam for only £3.99."
  ],
  "headers": {
    "2": "1. Outlast",
    "6": "2. Layers of Fear",
    "10": "3. Resident Evil 7: Biohazard",
    "14": "4. Dead Space",
    "18": "5. Monstrum",
    "22": "6. Alien: Isolation",
    "26": "7. Phasmophobia",
    "29": "8. Little Nightmares",
    "34": "9. Pacify"
  },
  "links": {
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Outlast": "https://redbarrelsgames.com/games/outlast/",
    "Outlast 2": "https://redbarrelsgames.com/games/outlast-2/",
    "Steam": "https://store.steampowered.com/app/967050/Pacify/",
    "Bloober Team": "https://www.blooberteam.com/",
    "Aspyr": "https://www.aspyr.com/",
    "LoF": "https://www.blooberteam.com/layers-of-fear",
    "Capcom": "https://www.capcom.com/us/",
    "RE7: Biohazard": "http://residentevil7.com/",
    "Resident Evil 8": "https://www.techradar.com/reviews/resident-evil-village",
    "Dead Space": "https://www.ea.com/en-gb/games/dead-space/dead-space",
    "Team Junkfish,": "https://www.teamjunkfish.com/",
    "Monstrum": "https://www.teamjunkfish.com/monstrum",
    "Alien: Isolation": "https://www.feralinteractive.com/en/switch-games/alienisolation/",
    "Feral Interactive": "https://www.feralinteractive.com/en/",
    "SEGA": "https://www.sega.com/",
    "Kinetic Games": "https://kineticgames.co.uk/",
    "Tarsier Studios": "https://tarsier.se/",
    "Bandai Namco Entertainment": "https://en.bandainamcoent.eu/",
    "Little Nightmares": "https://tarsier.se/games/little-nightmares/",
    "Hitchcock Games": "http://hitchcockgames.com/emily-wants-to-play/",
    "Pacify": "http://hitchcockgames.com/pacify/"
  }
}