{
  "source": "https://www.techradar.com/news/iphone-se-plus",
  "title": "iPhone SE Plus release date, price, leaks and what we want to see",
  "category": "phones",
  "updated": "2021-10-26T09:29:03Z",
  "author": "david-lumb",
  "summary": "All we've heard about a powerful mid-range Plus-size iPhone",
  "article": [
    "We originally heard about the iPhone SE Plus just before iPhone SE (2020) debuted, as rumors suggested a larger version would come at the same time or slightly after. A year and a half later, it's starting to look like that might not be right.",
    "In fact, the iPhone SE 3 might come before a Plus-sized model does - but that's ok, because the iPhone 13 mini is probably the exact same size an SE Plus would be. Sure, it's a little pricey, but rumors did suggest Apple wouldn't put out a new iPhone SE if a mini iPhone was coming.",
    "Phones have got a lot bigger since the original iPhone SE launched. Even though the 2020 model is larger than the original with a 5.5-inch display, today’s handsets have screens getting ever closer to 7 inches.",
    "So could the iPhone SE Plus still be coming? Well, never say never, though it's looking increasingly unlikely.",
    "We haven’t heard too much about this larger model of the mid-range handset – including why it’s being released later than its smaller sibling. But we’ve gathered what we’ve heard below, along with a section about what we want to see.",
    "We don’t know when the iPhone SE Plus will come out, though rumors have suggested that the iPhone SE Plus is at least in the works. Noted analyst Ming-Chi Kuo estimated we might not see the iPhone SE Plus until the second half of 2021, but that's starting to seem unlikely.",
    "Prolific Apple leaker Jon Prosser also suggested the iPhone SE Plus could come out in 2021, though they sound pretty vague about that fact, and it was a small tidbit added to news about the iPhone 13 mini. Instead, 2022 seems more likely. Indeed, the latest leak points to a launch in 2022.",
    "Similarly, we haven’t heard any official word on how much the iPhone SE Plus will cost. Given the SE 2020 has a starting pricetag of $399 / £419 / AU$749, which was lower than the latest official price of the iPhone 8 before it was discontinued, it wouldn’t be too out of line to guess the SE Plus will be cheaper than the iPhone 8 Plus’s last official price of $549 (£579, AU$949).",
    "The only real specs leak about the iPhone SE Plus so far suggests that it could have a 4.7-inch LCD display and 5G. Though we'd take that with a pinch of salt, as previously Apple has used 'Plus' to denote a larger display.",
    "Beyond that, there are things we can intuit from the release of its possibly smaller sibling. The iPhone SE 2020 inherited its hardware (aside from chipset and RAM) from the iPhone 8, including its 4.7-inch LCD display at SD (1334x750) resolution.",
    "By that notion, the iPhone SE Plus will likely have similar specs to the iPhone 8 Plus – getting a 5.5-inch FHD (1920x1080p) display that, while still LCD, is sharper than its smaller sibling. Likewise, it will probably also inherit the iPhone 8 Plus’s dual rear cameras: a 12MP wide and 12MP telephoto with 2x optical zoom. It can manage 4K video at 60fps, or 1080p HD at 30fps through the 7MP front-facing camera.",
    "Having said that, the iPhone 8 Plus is a lot older now than it was when the iPhone SE (2020) came out, so we may well see more upgrades.",
    "The big differentiator between the iPhone 8 and 8 Plus was the extra rear camera on the back of the latter, which produced stereoscopic images that could be combined to create a depth effect – thus enabling the first Portrait Mode photos. While the iPhone SE 2020 can pull off depth using software algorithms, doing so digitally produces more visual flaws than using two (or more) lenses to achieve it.",
    "And hey, don’t stop at the iPhone 8’s two rear cameras – why not give us the better lenses and sensors on the iPhone 11 line to shoot better night photos? While the iPhone SE 2020 has the leading A13 Bionic chipset, its older camera tech keeps it from managing the same fantastic Night Mode photos taken on the new flagships.",
    "Yes, yes, Apple seems to have kept costs down on theiPhone SE 2020 by recycling the hardware, display, and shell from the iPhone 8, but this has resulted in keeping the same thick chin, top, and bezel as the older models – which are extensive by today’s standards. Given most phones released today have very high screen-to-body ratios by stretching the display nearly completely around the front of the handset, it’s pretty rough to see the iPhone SE 2020 fail to live up to the times.",
    "The iPhone 8 Plus’s 2,691mAh battery was certainly larger than the iPhone 8’s 1,821mAh capacity, but we’re still not expecting any more than the three-year-old model in the new iPhone SE 2020 Plus. Given how many compromises the iPhone SE 2020 line has made to shave down costs (i.e. inheriting virtually the same iPhone 8 design), we’d love to see some practical benefits – like more battery for your buck. We’ll settle for a faster 18W charger in the box, though.",
    "Okay, this one’s a pipe dream, but we’d love to get our 3.5mm jack back. One of the hardest things to lose from the iPhone 6S was the headphone port, especially since the iPhone 7 and iPhone 8 kept the same physical dimensions, so it would be a great gesture to get this feature – which is present on many other mid-range phones."
  ],
  "headers": {
    "5": "IPhone SE Plus price and release date",
    "8": "iPhone SE Plus rumors and leaks",
    "12": "1. Multiple rear cameras",
    "13": "2. Better lenses and sensors",
    "14": "3. Less bezel",
    "15": "4. Bigger battery",
    "16": "5. 3.5mm jack"
  },
  "links": {
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "rumors did suggest": "https://www.techradar.com/news/iphone-13-series-could-still-get-a-mini-model-at-the-cost-of-the-iphone-se-3",
    "rumors": "https://www.techradar.com/news/iphone-se-plus-with-a-bigger-display-may-be-coming-soon",
    "estimated": "https://www.techradar.com/news/iphone-se-plus-release-date-might-not-be-for-a-long-time",
    "the iPhone SE Plus could come out in 2021": "https://www.techradar.com/news/iphone-13-series-could-still-get-a-mini-model-at-the-cost-of-the-iphone-se-3",
    "a launch in 2022": "https://www.techradar.com/news/iphone-se-3-could-be-years-away-but-an-iphone-se-plus-might-land-first",
    "discontinued": "https://www.techradar.com/news/iphone-8-has-been-discontinued-now-the-new-iphone-se-is-here",
    "specs leak": "https://www.techradar.com/news/iphone-se-3-could-be-years-away-but-an-iphone-se-plus-might-land-first",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review"
  }
}