{
  "source": "https://www.techradar.com/news/windows-11-users-could-be-set-for-a-significant-security-upgrade",
  "title": "Windows 11 users could be set for a significant security upgrade",
  "category": "computing",
  "updated": "2021-10-26T11:06:01Z",
  "author": "mike-moore",
  "summary": "Upgraded security protection for Windows 11 is on the way",
  "article": [
    "Microsoft's new Windows 11 software suite could soon enjoy better security protection than ever thanks to a rumored new release from the company.",
    "A new version of Windows Defender Preview for Windows 11 has been spotted online, offering a significant upgrade in terms of the safety tools on offer for users.",
    "Although little is known about what features the new antivirus upgrade will offer, it is thought the release could form part of an improved package of security protections as Windows 11 user numbers continue to grow.",
    "Promising \"simple, seamless, and personalized protection, so you and your family can enjoy peace of mind\", the new release was spotted by Italian account @ALumia_Italia.",
    "The new offering apparently has the code-name GibraltarApp and appears to be built using WPF and XAML - featuring the softer color scheme, rounded edges and new design seen in Windows 11.",
    "Microsoft has yet to comment on the new release, but if the image is legitimate, we'd expect the software to be available to users on the Windows Insider program soon. The company continues to provide a rolling system of updates for Microsoft Defender and all its other software tools to ensure users stay protected against the latest malware threats.",
    "Windows Defender debuted in 2008, originally appearing to help the once-lacklustre security of Windows XP, but has come a long way since, and Windows 11 shipped with Defender built in as part of its existing security protection, promising \"next-generation antivirus and malware defense\".",
    "Microsoft recently asked users to enable Microsoft Defender for Endpoint's Tamper Protection feature to protect themselves against ransomware campaigns, as it released the final version of its security configuration baseline settings for Windows 11.",
    "Enabling the Tamper Protection feature should help prevent threat actors from overriding the security features of the Windows 11 installation, the company said.",
    "To see if your PC is ready for the new software, you can check out our handy Windows 11 system requirements guide.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Windows 11 security upgrade"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows Defender": "https://www.techradar.com/reviews/windows-defender",
    "antivirus": "https://www.techradar.com/best/best-windows-10-antivirus",
    "@ALumia_Italia": "https://twitter.com/ALumia_Italia/status/1452738046969978885?s=20",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "Tamper Protection feature": "https://www.techradar.com/news/microsoft-offers-advice-for-foiling-ransomware-attacks-in-windows-11",
    "Windows 11 system requirements guide": "https://www.techradar.com/news/windows-11-system-requirements-is-your-pc-compatible",
    "MSPowerUser": "https://mspoweruser.com/microsoft-appears-to-be-working-on-a-new-windows-defender-app-for-windows-11/"
  }
}