{
  "source": "https://www.techradar.com/news/halo-infinite-season-1-battle-pass-length-trailer-and-everything-you-need-to-know",
  "title": "Halo Infinite Season 1 – battle pass, length, trailer, and everything you need to know",
  "category": "gaming",
  "updated": "2021-11-17T16:43:58Z",
  "author": "adam-vjestica",
  "summary": "Halo Infinite Season 1 is now underway",
  "article": [
    "Halo Infinite Season 1 has kicked off early as Microsoft surprisingly released the game's free-to-play multiplayer mode early to celebrate Halo: Combat Evolved and Xbox's 20th anniversary.",
    "While Halo Infinite's multiplayer is technically still in beta, all of the progress you make in the run-up to the game's official release on December 8, 2021, will carry over. That means any Battle Pass rewards you earn, as well as your precious kill/death ratio, will come with you.",
    "It's worth repeating that Halo Infinite's multiplayer is free-to-play. You don't need to have pre-ordered the game or subscribe to Xbox Game Pass to play it. And like many other free-to-play titles on Xbox, you don't even need Xbox Live Gold in order to hop online and start slaying some Spartans.",
    "If you own an Xbox One, Xbox One S, Xbox One X, Xbox Series S, Xbox Series X, or PC, nothing's stopping you from jumping in. Thanks to Xbox Cloud Gaming, you can also play on Android, iOS, and PC, but you need to be an Xbox Game Pass Ultimate subscriber to access this service.",
    "So what does Halo Infinite Season 1 – Heroes of Reach have in store? And how long do you have to work through everything that's on offer? Here's everything you need to know about Halo Infinite Season 1.",
    "Even though Halo Infinite's multiplayer is out now, it's still in beta. That means bugs, glitches, and errors can occur, though we've found the game to be surprisingly solid since launch. The game's multiplayer officially launches alongside Halo Infinite's campaign on December 8, 2021.",
    "Unlike before, all your progress from the Halo Infinite multiplayer beta will carry over when the game launches, including your rank, customizations, and Battle Pass progression.",
    "For those interested in unlocking all the goodies on offer, the first season of Halo Infinite runs until May 2022. That's plenty of time, then, to work towards achieving every reward.",
    "The beta contains a full suite of modes and maps representing the experience players will get on December 8, 2021. Quickplay, Ranked, Big Team Battle, objective-based game modes, and a practice arena known as The Academy are all present here.",
    "Quickplay includes the four classic Halo gameplay types: Slayer, Capture the Flag, Strongholds, and Oddball.",
    "Slayer is essentially your classic deathmatch – the team that reaches 50 kills first wins. Capture the Flag involves stealing your opponents’ flag and returning it to your base without them taking yours in the process. Strongholds, meanwhile, sees your team trying to control and capture three areas of the map for a set period of time, and Oddball sees the team who holds onto “the ball” the longest win.",
    "Big Team Battle is a 12v12 mode that takes place on larger maps and includes vehicles to spice things up. There are three game modes: Slayer, Stockpile, and Total Control.",
    "Slayer works exactly like before but with more players and a higher target score to reach. Stockpile has players gather ‘power seeds’ scattered across the map and deposit them at their base to score. A team needs to deposit five power seeds to score one point, and the first team to three points wins. Finally, there’s Total Control, which operates a bit like Strongholds; however, a team needs to capture three zones simultaneously to score a point. The first to three points wins.",
    "The Academy is where you can hone your skills with particular weapons and complete a tutorial if you’re new to the game. There’s also Bot Arena, where you can play the modes above but against AI-controlled opponents.",
    "Developer 343 Industries has released a trailer for Halo Infinite Season 1 – Heroes of Reach that shows some of the unlockables and the game in action. You can check it out below.",
    "Yes! Halo Infinite's multiplayer is free-to-play, so you don't need to purchase, pre-order, or subscribe to Xbox Game Pass to play it. You don't even need Xbox Live Gold anymore, as Microsoft removed the need to have an Xbox Live Gold membership to play free-to-play games online.",
    "If you want to play Halo Infinite's campaign, you'll need to purchase the game on the platform of your choosing or subscribe to Xbox Game Pass.",
    "Halo Infinite's Battle Pass works a little differently from other games, for better and for worse. You earn experience points by completing daily and weekly challenges and gain levels as you do so. The problem is, you can only earn XP by completing challenges; you won't be rewarded for doing anything else in the game, which can make progression feel slow and arduous. However, 343 Industries is already looking at ways to improve this based on player feedback.",
    "Some examples of the challenges you’ll need to complete include getting a certain amount of kills with a weapon, winning a game mode, or performing a specific action like capturing the flag in CTF (Capture the Flag).",
    "However, the flip side is that your Battle Pass doesn't run out, unlike in other titles. Halo Infinite Season 1 may end in May 2022, but your Battle Pass will remain after this date, and you can choose to continue unlocking things or move onto the next available pass. That means there’s no ‘fear of missing out’ factor if you want to carve out some time to play other games.",
    "But what's in the Halo Infinite Battle Pass? Cosmetics and boosters, mainly. You can unlock new armor, armor coatings, XP boosts, AI companions, and visors as you progress, allowing you to customize your Spartan however you see fit.",
    "The Halo Infinite Battle Pass costs $8 or £7.99. You can also buy boosts using purchasable in-game credits if you want to progress quicker. Of course, you don't have to buy the Battle Pass at all and can earn rewards without paying any extras, but you'll only have access to specific unlocks.",
    "There are currently 10 maps in Halo Infinite. Check out the full list below:",
    "We've already explained how to download the Halo Infinite multiplayer beta on every platform if you're unsure, but you'll need to reserve around 26GB of space if you wish to install it. While most users haven't had trouble installing the Halo Infinite beta, here's how to fix the Halo Infinite blue screen error if you encounter it."
  ],
  "headers": {
    "5": "How long is the Halo Infinite multiplayer beta?",
    "8": "What can you play in the Halo Infinite multiplayer beta?",
    "14": "Every Halo Infinite multiplayer trailer",
    "15": "Will Halo Infinite multiplayer always be free?",
    "17": "What's in the Halo Infinite Battle Pass?",
    "21": "How much does the Halo Infinite Battle Pass cost?",
    "22": "List of Halo Infinite multiplayer maps",
    "23": "How to download the Halo Infinite beta"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox's 20th anniversary": "https://www.techradar.com/features/xbox-at-20-our-favorite-memories-games-and-moments",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Live Gold": "https://www.techradar.com/news/xbox-live-gold-deals",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Xbox Live Gold membership to play free-to-play games": "https://www.techradar.com/news/xbox-free-to-play-games-no-longer-require-xbox-live-gold-subscription",
    "how to download the Halo Infinite multiplayer beta": "https://www.techradar.com/how-to/how-to-download-the-halo-infinite-multiplayer-beta-on-xbox-and-pc",
    "how to fix the Halo Infinite blue screen error": "https://www.techradar.com/how-to/how-to-fix-halo-infinite-blue-screen-error"
  }
}