{
  "source": "https://www.techradar.com/news/microsoft-365-will-ditch-internet-explorer-11-support-in-a-few-days",
  "title": "Microsoft 365 will ditch Internet Explorer 11 support in a few days",
  "category": "computing",
  "updated": "2021-07-26T17:00:59Z",
  "author": "anthony-spadafora",
  "summary": "Microsoft 365 users will need to switch to a modern browser",
  "article": [
    "Microsoft is warning customers that the apps and services which make up Microsoft 365 will no longer support Internet Explorer 11 beginning next month.",
    "Microsoft 365 will drop support for the legacy browser beginning on August 17 and from that point on, users may experience connection failures or even a degraded user experience.",
    "The software giant provided further details in a new post on the Microsoft 365 blog, saying:",
    "“Beginning August 17, 2021, Microsoft 365 apps and services will no longer support Internet Explorer 11 (IE11) and users may have a degraded experience, or be unable to connect to, those apps and services. These apps and services will phase out over weeks and months to ensure a smooth end of support, with each app and service phasing out on independent schedules.”",
    "It's also worth noting that users that try to access Microsoft 365 apps or services using Internet Explorer 11 after August 17 will not be offered support from Microsoft to fix any of the issues they may encounter.",
    "Once Microsoft 365 ditches support for IE11 next month, no new features will be released and the user experience of its apps and services will become steadily worse over time which means that more users will finally switch to using Microsoft Edge instead.",
    "At the same time, using Microsoft Edge's new Internet Explorer mode will not extend IE11 access to Microsoft 365's apps and services once support for the browser is ended.",
    "Beginning on August 17, users logging in with Azure Active Directory (AAD) accounts on IE11 will still be able to use the full Outlook Web App (OWA) experience but it will no longer receive new features. Users logging in with Microsoft Accounts though will be redirected to the Outlook Web App Light experience.",
    "Users that rely on the Open with Explorer and View In File Explorer features in SharePoint to access document libraries will still be able to use them when they go to a document library in IE11. However, these features will remain in maintenance mode and won't be receiving further development. Instead, Microsoft recommends that users switch to a modern browser and OneDrive sync for a better user experience and easier access to the their files.",
    "In order to ensure a smooth end of support for IE11, Microsoft has said that other Microsoft 365 apps and services will phase out over weeks and months.",
    "Via BleepingComputer"
  ],
  "headers": {
    "5": "End of IE11 support"
  },
  "links": {
    "Microsoft 365": "https://www.techradar.com/news/microsoft-365-is-getting-a-significant-security-boost",
    "Internet Explorer 11": "https://www.techradar.com/news/microsoft-is-finally-killing-off-internet-explorer",
    "browser": "https://www.techradar.com/best/browser",
    "new post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2206665562879254300&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-365-blog%2Fmicrosoft-365-apps-say-farewell-to-internet-explorer-11-and%2Fba-p%2F1591666&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-365-will-ditch-internet-explorer-11-support-in-a-few-days",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Internet Explorer mode": "https://www.techradar.com/news/microsoft-gives-diehard-internet-explorer-fans-a-passive-aggressive-nudge",
    "Outlook Web App": "https://www.techradar.com/news/microsoft-wants-to-unite-all-its-email-programs-into-one-outlook",
    "SharePoint": "https://www.techradar.com/news/microsoft-teams-update-will-stop-you-overloading-your-cloud-storage",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-drops-support-for-internet-explorer-11-in-august/"
  }
}