{
  "source": "https://www.techradar.com/news/many-users-are-still-doing-nothing-to-protect-our-iot-devices",
  "title": "Many users are still doing nothing to protect our IoT devices",
  "category": "computing",
  "updated": "2021-07-21T10:13:28Z",
  "author": "sead-fadilpasic",
  "summary": "Users take no action to protect home IoT gadgets, report warns",
  "article": [
    "Many users take no action at all to secure their Internet of Things (IoT) devices, placing their personal files and their devices, at risk of a breach or other similar incident, new research has found.",
    "A poll of 7,000 people from Australia, Canada, France, Germany, the Netherlands, the UK, and the US from NordVPN found that while 95% of people in the UK have some kind of IoT device in their household, almost a fifth took no measures to protect them.",
    "IoT devices, such as routers, smart TVs, smart speakers, smart doorbells, air quality monitors and smoke detectors, may be abused to access a home network, spy on the users and obtain sensitive data such as chat logs, passwords or payment information, the company warned.",
    "In many cases, the problem lies in a false sense of obligation, as more than two in five (41%) believe the manufacturer should be responsible for the security of the devices. A further 56% see it as their own responsibility. And while the report concludes that “all of us need to pick up the slack”, it does state that manufacturers, as well as government bodies, should be doing more to protect the consumers.",
    "“Users must demand that companies follow the best security practices,” the report reads, adding that consumers should be taking better care of their own privacy, as well. Furthermore, IoT manufacturers “have to come up with additional ways to protect their devices and their users’ data.”",
    "As for the government, the agencies “need to regulate this process,” due to the rising usage of IoT devices across sectors.",
    "Among the security-wary respondents, most (76%) are worried about deprecation, with privacy issues (75%) and design problems (mostly around encryption), being close second and third."
  ],
  "headers": {
    "3": "IoT regulation"
  },
  "links": {
    "routers": "https://www.techradar.com/best/best-secure-router",
    "passwords": "https://www.techradar.com/best/password-manager"
  }
}