{
  "source": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
  "title": "Dolby Atmos: The ins, outs and sounds of the object-based surround system",
  "category": "audio-visual",
  "updated": "2021-10-27T13:45:21Z",
  "author": "nick-pino",
  "summary": "An in-depth guide to the spatial audio technology",
  "article": [
    "Dolby Atmos is everywhere right now, from the best soundbars to the Amazon Echo Studio.",
    "And while there's a lot of excitement around the Dolby Atmos format, it's one that's still a bit tricky to wrap your head (and ears!) around.",
    "In brief, Dolby Atmos a new audio format that allows you to hear sound in a 360-degree bubble. With its object-oriented audio engineering and its up-or-down-firing speakers, Atmos is changing the way home theaters are setup and, more importantly, how sound is distributed in the room.",
    "In the past, we've explored how exactly Dolby Atmos is the future of cinema sound, as well as how the technology is hacking our ears. But we've never sat down to truly explain what the technology is, why it's important and, most importantly, how you can get it in your own home. Until now.",
    "Dolby Atmos is an audio format – like stereo sound or surround sound that takes recorded audio from a movie soundtrack or a video game and spits it out in a more immersive way. Dolby Atmos gives sound a more three-dimensional effect – imagine the difference between hearing a helicopter flying a few hundred yards away versus directly over your head.",
    "The technology is being developed by Dolby Laboratories, an audio company that specializes in sound reproduction and encoding. You've probably seen their logo on DVD or Blu-ray boxes or on the latest audio equipment.",
    "The audio mixing happens in sound studios where audio engineers take sound effects in movies and digitally move them around three-dimensional space. When you play the movie back using Dolby Atmos-enabled audio devices, you'll be able to hear the effects move around you, just like the audio engineers intended.",
    "Of course, to hear Dolby Atmos, you'll need a Dolby Atmos-compatible film or TV show file (found on Netflix and now iTunes), as well as a Dolby Atmos-enabled player and a Dolby Atmos soundbar or speaker system.",
    "So how does Dolby plan on creating a sound bubble? For the answer to that question, all you have to do is look up.",
    "Dolby Atmos creates a bubble of sound by bouncing beams of audio off your ceiling and then to your ears. As you might imagine, this takes a bit of calibration, and a fairly flat ceiling. As long as you have the latter and don't mind doing the former when it comes time, let's press on.",
    "So how do you get Dolby Atmos? The first part is getting the right hardware - audio equipment that supports Dolby Atmos as well as a Dolby Atmos-compatible player.",
    "Of course, if that sounds too challenging, you can always just buy a system that integrates both: The Dolby Atmos-ready LG W7 OLED is fantastic with a built-in 5.0.2 soundbar that's just all-too-happy to bring you room-filling audio for a mere $6,999 / £6,999 / AU$13,499.",
    "If you don't have $7,000 burning a hole in your pocket, however, there are plenty of cheaper entry points – an Xbox One S or an Oppo UDP-203 4K Blu-ray player hooked up to the Sonos Arc soundbar would do the trick.",
    "If you'd rather just expand the home system you already have, major audio manufacturers like Onkyo, Denon, Yamaha and Pioneer all make audio/visual receivers capable of processing Dolby Atmos audio tracks, with few distinctions for the layman between the mid-tier models.",
    "The key point here is that as long as you have Dolby Atmos content fed through a Dolby Atmos player to a pair of Dolby Atmos speakers, you're all set.",
    "If you're still a bit hazy about where to start shopping for Atmos products, Dolby offers a handy catalog of all the current Dolby Atmos-ready products.",
    "Let's turn on the system and connect it to a Dolby Atmos-capable player (Xbox One or a Dolby Atmos-enabled Blu-ray player). Good job! Now, all that's left to find is some Dolby Atmos content.",
    "Thankfully, that's a task that becomes easier with each and every passing day. The best way to test out the new system is with Netflix's DeathNote, BLAME! or Okja (available with both Dolby Atmos and Dolby Vision, a version of HDR that enhances the colors and contrast of your favorite films).",
    "How do you know it's playing in Dolby Atmos? Look for the Atmos icon next to the title of the film.",
    "If you're looking for more content to watch, check out one of the 100+ titles available on 4K Blu-ray that have Dolby Atmos. (For a full list, click here.)",
    "For gamers, however, native Dolby Atmos content is still a bit sparse. Right now, only two games are mixed for Dolby Atmos: Overwatch and Star Wars Battlefront – both of which require the PC versions of the game.",
    "There is another way to get Dolby Atmos in games, though.",
    "Dolby has recently launched the Dolby Access app on Xbox One and Windows 10 PCs that upmixes stereo and 5.1 surround mixes to Dolby Atmos. The app is free to try and available to own for $14.99. Upmixed content never quite sounds as good as native Atmos, but hey, $15 is a whole lot cheaper than a brand-new soundbar or receiver, that's for sure.",
    "So, what are you looking for once you've got your content? Dolby Atmos creates a sound bubble of audio. You should be able to hear raindrops falling from the sky and thunder in clouds that sound like they're 10 feet above your head. Ideally, it should feel like your room is filled with sound from every direction. If it doesn't, re-check the connections or dive back into the settings.",
    "Dolby Atmos works best in a smaller room with a level ceiling. Changing the slope of the ceiling messes with the reflection angle of the surround sound.",
    "Dolby outlines three other primary sources for Atmos content: there are games on PC like Star Wars Battlefront and Battlefield 1, Dolby Atmos-compatible Blu-rays and movies from streaming services like Netflix and Vudu, the Walmart-owned video streaming service.",
    "Now, problematically, you might didn't have all of these on hand. The landscape is still a bit scattered at the moment. It's something Dolby has done its best to correct, but because it depends on partnerships to bring content to the masses (see: Microsoft, LG, Netflix, Vudu, Oppo, etc...) finding all the content in one spot is, at this point, a technical impossibility.",
    "The good news is that the technology is still in its infancy. In conversations with top Dolby engineers, they've admitted that there are still some kinks to the distribution process that they hope will be alleviated when the platform grows larger and more robust. In our opinion, it's still really clever and interesting technology that will revolutionize the home cinema once it becomes the standard, rather than something reserved for audiophiles like myself.",
    "Like Ultra-HD, there's not a lot of content out there to support the tech, but do a bit of digging and you'll uncover some real ear-candy.",
    "The big question: Should you upgrade your system to Dolby Atmos?",
    "If you're an entertainment junky keen on having the latest and greatest tech – i.e. you already own a 4K TV and a seriously sweet surround sound system – then yes. But if you're an average movie or TV buff, I would wait until the tech begins to normalize and comes down a bit more in price.",
    "The technology is almost ready for mainstream consumption with a number of game developers working on titles that support Atmos and with Hollywood seemingly loving the technology which means now might be the best time to jump on the bandwagon.",
    "Like 4K TVs a few years ago, Dolby Atmos isn't for everyone. It's not the easiest thing to wrap your head around and content isn't as much of a buffet as it is a fine three-course dinner. It's an investment in the future of audio technology, one that will pay off down the road but right now feels like a bit of a risk."
  ],
  "headers": {
    "4": "The basics: what is Dolby Atmos?",
    "10": "Step 1. Finding the system",
    "16": "Step 2. Finding content and testing it out",
    "25": "Atmos is a lot like 4K, in a way",
    "29": "Should you upgrade to Dolby Atmos?"
  },
  "links": {
    "best soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Dolby Atmos is the future of cinema sound": "https://www.techradar.com/news/audio/is-dolby-atmos-the-future-of-cinema-sound-1088428",
    "hacking our ears": "https://www.techradar.com/news/home-cinema/hacking-our-ears-how-dolby-is-bringing-atmos-into-the-home-1262350",
    "Dolby Atmos soundbar": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "LG W7 OLED": "https://www.techradar.com/reviews/lg-oled-w7-signature-series",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Oppo UDP-203 4K Blu-ray player": "https://www.techradar.com/reviews/oppo-udp-203-ultra-hd-blu-ray-player",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "catalog of all the current Dolby Atmos-ready products": "http://www.dolby.com/us/en/technologies/dolby-atmos/home-theater-products.html",
    "here": "https://www.dolby.com/us/en/experience/dolby-atmos/bluray-and-streaming.html"
  }
}