{
  "source": "https://www.techradar.com/news/most-searches-for-the-dark-web-just-want-to-know-how-to-find-it",
  "title": "Most searches for the dark web just want to know how to find it",
  "category": "computing",
  "updated": "2021-02-25T12:31:37Z",
  "author": "sead-fadilpasic",
  "summary": "Majority of queries comes from a handful of countries",
  "article": [
    "People are using Google (and other mainstream search engines) to find out just two things about the dark web: what it is, and how to get in.",
    "That's according to a new report from VPN provider NordVPN, which found just 0.3% of all online queries associated with the dark web have to do with people looking to buy illegal items.",
    "Approximately the same amount (0.5%, or around 700 queries a month) is from people looking if their personal data ended up in the underworld.",
    "Of all the people interested in what the dark web is in the first place, most are Americans (47%), with India (19%) and the UK (9%) making up the vast majority of the queries. Brazilians, on the other hand, seem to be most interested in finding a way into the famed cyber underworld, as 75% of all dark web-related queries coming from Brazil are about getting in.",
    "“You won’t find real hackers “googling” the dark web, because dark web sites are not indexed and are not discoverable without special tools. And hackers know that,” says Daniel Markuson, digital privacy expert at NordVPN.",
    "However, they should be more interested in safeguarding their data, he added.",
    "“It is surprising that only 0.5 percent of all queries associated with the dark web, which is an average of 700 queries a month, are trying to find out if their personal information ended up for sale there. And the only concerned country is the US,” he says.",
    "An unindexed part of the internet that, as such, cannot be found through traditional search engines, or accessed by traditional web browsers, is colloquially called the dark web. It was designed to be a censorship-resistant place of free speech, where data and ideas could flow freely. It can only be accessed with the help of specialized software, such as anonymous browsers and VPN solutions.",
    "However, it was quickly overrun by cybercriminals looking to advance their illegal acts under the veil of anonymity. The dark web is now almost synonymous with stolen data, malware, ransomware and cybercrime best practices.",
    "The report added that when it comes the items that people want to buy from the dark web, its almost exclusively related to illegal substances - with all searches coming either from the US or the UK, each of which generates approximately 150 such queries a month."
  ],
  "headers": {
    "4": "Dark web searches"
  },
  "links": {
    "dark web": "https://www.techradar.com/news/what-is-the-dark-web-how-safe-is-it-and-how-to-access-it-your-questions-answered",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "anonymous browsers": "https://www.techradar.com/best/anonymous-browsing",
    "VPN solutions": "https://www.techradar.com/vpn/cheapest-vpn"
  }
}