{
  "source": "https://www.techradar.com/news/windows-10s-next-feature-update-wont-be-arriving-late-rumor-has-it",
  "title": "Windows 10's next feature update won’t be arriving late, rumor has it",
  "category": "computing",
  "updated": "2021-02-17T10:55:50Z",
  "author": "darren-allan",
  "summary": "First update of 2021 could arrive in May, going by the latest from the rumor mill",
  "article": [
    "Windows 10’s next feature update (21H1) could be released in May, or at least that’s the timeframe Microsoft intends to hit, according to a fresh rumor (which goes against what we previously heard about a possible later release in June).",
    "This comes from Zac Bowden, a well-known Microsoft rumor peddler at Windows Central, who claims to have seen an internal schedule for the 21H1 update, which indicates that it could be finished in April, and the rollout should start in May – assuming no serious snags are encountered, of course.",
    "Apparently the upgrade will be feature complete as soon as this week, which means that Windows Insiders should soon embark on testing this version and the process of finalizing things.",
    "As we’ve heard before, 21H1 is going to be a minor update with no big feature additions, mostly consisting of tweaking and work under the hood, laying the groundwork ahead of the major update which will roll out in the second half of 2021 (giving Windows 10 an entirely new look, by all accounts).",
    "A May rollout more or less fits what we heard from the grapevine before, although as mentioned, previous speculation did point to the possibility of a June launch for the first Windows 10 update of 2021. That would, however, be unusually late in terms of Microsoft’s normal deployment cadence, so May certainly seems more likely in that respect.",
    "As with previous minor feature updates for Windows 10, 21H1 is expected to be delivered as an enablement package, meaning it will be a small download, and effectively just a matter of flicking a switch for those on the May 2020 Update or October 2020 Update (the latter was a minor enablement upgrade itself, remember).",
    "Anyone on previous versions of Windows 10 will have to go through the usual large download for 21H1, though (as they won’t have the core files for the upgrade already in place).",
    "Via Wccftech"
  ],
  "headers": {
    "4": "May be right"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows Central": "https://www.windowscentral.com/windows-10-version-21h1-what-we-know",
    "21H1 is going to be a minor update": "https://www.techradar.com/news/windows-10-leak-shows-21h1-update-is-a-minor-one-and-could-arrive-sooner-than-expected",
    "Windows 10 an entirely new look": "https://www.techradar.com/news/this-is-when-windows-10s-brand-new-look-could-land",
    "possibility of a June launch": "https://www.techradar.com/news/windows-10s-next-major-update-could-arrive-much-later-than-hoped",
    "May 2020 Update": "https://www.techradar.com/how-to/windows-10-may-2020-update-problems-how-to-fix-them",
    "Wccftech": "https://wccftech.com/windows-10-21h1-wont-be-a-major-update/"
  }
}