{
  "source": "https://www.techradar.com/news/can-the-oppo-watch-2s-processor-upgrade-take-on-apple-and-samsung",
  "title": "Can the Oppo Watch 2’s processor upgrade take on Apple and Samsung?",
  "category": "wearables",
  "updated": "2021-07-28T10:52:40Z",
  "author": "hamish-hector",
  "summary": "Is the Oppo Watch 2 worth waiting for?",
  "article": [
    "Wear OS smartwatches have always been a little underwhelming compared to their Apple Watch and Galaxy Watch counterparts. Weaker processors and less impressive displays are part of the reason that the best Wear OS watches don’t do better than 7th on our best smartwatches list.",
    "The hardware inside the new Oppo Watch 2 though, such as its Snapdragon Wear 4100 processor, could finally help the Google operating system catch up a bit (if and when the device launches outside of China).",
    "This hardware announcement bodes well for the Oppo Watch 2 entering our best Wear OS smartwatches list too. The Snapdragon Wear 4100 is the same hardware used by our number two watch, the TicWatch Pro 3. This suggests the new Oppo Watch (at least on paper) has the hardware it needs to do very well, we’ll just have to wait and see how it does in our testing.",
    "An improved processor isn’t the only feature we can look forward to in the Oppo Watch 2. 10 minutes of fast charging will net you a full day’s battery life and can last for 16 days on a full charge thanks to Power Saver mode; you’ve also got the usual health and fitness features too such as a heart rate tracker and an SpO2 monitor.",
    "For now though, the Oppo Watch 2 isn’t available in the US or the UK, but it's launching in China on August 6. Given that the previous model released globally we suspect we’ll see it soon, but is it going to be worth the wait?",
    "It might be a while before we can get our hands on the Oppo Watch 2, but should we hold out on getting a different smartwatch? We can’t know for sure until we test the smartwatch out for ourselves, but we can compare its specs to what’s out there already.",
    "For Wear OS watches, we’ve already mentioned that we’re confident the Oppo Watch 2 can do well. It’ll have a powerful processor that many Wear OS devices don’t yet match, and a display that’s larger and has more pixels than the options currently at the top of our list. Its promised battery life is very strong too, all for an estimated price of around $200-$300 (£150-£225 / AU$275-AU$400) which is on par with the competition.",
    "If you’re weighing this up against the best Apple and Samsung smartwatches, the main draw will be the Oppo Watch 2’s price and battery. It will last longer and cost much less than the smartwatches offered by these brands, though we suspect its other features won’t be as powerful as a result. If you’re okay having less device storage and a slower processor, though, this could be the device for you.",
    "The Oppo Watch 2 takes a much more middle-of-the-road stance based on what we’ve seen in the announcement. It won’t be the best smartwatch out there, but it won’t cost you too much either. If it does launch in the UK and the US, this could be a great budget-friendly smartwatch that’ll offer you some great features, while missing out on only a few premium benefits."
  ],
  "headers": {
    "5": "Analysis: Should you wait for the Oppo Watch 2?"
  },
  "links": {
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "best Wear OS watches": "https://www.techradar.com/news/best-wear-os-watch",
    "best smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "TicWatch Pro 3": "https://www.techradar.com/reviews/ticwatch-pro-3"
  }
}