{
  "source": "https://www.techradar.com/news/the-irregulars-season-2-release-date-plot-cast-and-more",
  "title": "The Irregulars season 2: release date, plot, cast and what we know",
  "category": "entertainment",
  "updated": "2021-05-05T10:27:08Z",
  "author": "tom-power",
  "summary": "The Irregulars on Netflix is no more",
  "article": [
    "The Irregulars season 2 won't be happening on Netflix. As we reported on May 5, the streaming giant has cancelled its Sherlock Holmes spin-off series after a solitary season.",
    "That'll come as a big surprise and disappointment to fans of the TV show, who had helped The Irregulars to hit the number one spot in the US and UK top 10 most popular lists when it was released on March 26.",
    "The fantasy horror crime drama had received mixed to fairly good reviews from critics and some fans, if you take review aggregation websites like Rotten Tomatoes into account, but that won't be a comfort to The Irregulars' fanbase.",
    "Despite that less-than-positive news, we're retaining our hub for The Irregulars season 2 for a while yet. If you're interested in reading our speculative thoughts on when we might have seen season 2 arrive, what plot points needed to be resolved, which cast members were returning and more, you can check them out below.",
    "With no official confirmation of a follow-up season yet from Netflix, there's no release date for The Irregulars season 2 right now.",
    "However, we expect that Netflix will want to capitalize on The Irregulars' apparent success and get production on season 2 up and running as soon as it can. Of course, any movement on that front is dependent on showrunner Tom Bidwell and the availability of The Irregulars' main cast.",
    "As Newsweek indicates, Production Weekly cites a summer 2021 filming date for the follow-up series in Liverpool. Some of the cast and crew are currently working on other productions, so it remains to be seen if season 2 will arrive any time soon. If we had to guess, however, we predict that The Irregulars will return to the small screen sometime in 2022.",
    "It sounds obvious but, no, there isn't a season 2 trailer yet. Once one is released, though, you'll be the first to know about it.",
    "Major spoilers for The Irregulars season 1 follow.",
    "As for what the plot of The Irregulars may entail, we're unsure right now. Season 1 didn't end on a cliff-hanger, but there are plenty of loose threads that weren't resolved by the time that the end credits rolled.",
    "For one, we don't know if Sherlock is still alive. In the season 1 finale, Holmes crossed over into the spirit world to be with Bea and Jessie's mother Alice. From what we heard from Alice, those who reside in the spirit world are, for lack of a better term, dead. Providing that there's no way for spirits to be reborn or reincarnated, Sherlock is also likely to have died when he joined Alice. It would be strange to have a TV show based on Sherlock without the character being present, though, so it remains unclear whether he will find a way to return.",
    "One person who will be feeling Sherlock's loss more than most is John Watson. It'll be interesting to see how the great detective's companion deals with his friend being missing in action. Watson can mope about 221B Baker Street and mourn the death of Sherlock, or he can step up to the plate and begin to lead The Irregulars in his stead. It would be a neat touch to see Watson carry on Sherlock's legacy in season 2, particularly if new supernatural threats emerge (more on this below).",
    "Another big plot point that season 2 needs to pick up is Bea and Leo's on-off relationship. At the end of season 1, Leo told Bea that they couldn't be together. In order to save Billy from being hung for murdering his ex-taskmaster Vic, Leo made a deal with his family to marry Helena. This is the princess he was introduced to in episode 7, and who he must travel to Europe to see and get to know her better.",
    "Even though Leo is resigned to never being with Bea, this won't be the end of their saga. Season 2 will have to pick this thread back up in some capacity. Whether it's Billy finally revealing his feelings for Bea, or Leo somehow returning to the fold, The Irregulars season 2 must deliver on this in some way.",
    "Finally, we come to the series' supernatural aesthetic. The Rip clearly isn't the only supernatural element in this version of Sherlock's world, what with Jessie still possessing her Ipsissimus abilities. It'll be interesting to see where Bidwell takes the TV show next, in terms of antagonist and potential parallel dimensions.",
    "In an interview with The Radio Times, Bidwell did tease what a second season could entail but, as you'd expect, declined to delve into spoiler territory. \"We’ve got ideas,\" he said. \"The thing is with this show is that there’s a lot of story potential in lots of different areas with Leopold, with Sherlock and Watson with the gang with their love stories. There’s also a list of monsters we have that we’ve already got ideas for for years. it’s just an exciting series to write, it’s, it’s been a privilege to do it, it really has been.”",
    "There's more occult and mystical aspects that The Irregulars can explore from Sir Arthur Conan Doyle's source material, plus the original content that Bidwell has thought up, so it'll be intriguing to see where season 2 goes as a result.",
    "Right now, there's no confirmation on what the season 2 cast will be. However, it's almost certain that the main characters from season 1 will return. Well, those that we know are still alive by the end of the finale anyway.",
    "Here's who we expect to return, and we'll add any new casting announcements to the list below as and when they're made:",
    "As we mentioned earlier, it's unclear if Henry Lloyd-Hughes will be back as Sherlock. Other potential returnees could also be Jonjo O'Neill as Sherlock's brother Mycroft, Nell Hudson and Leo's older sister Louise, and Lisa Dwyer Hogg as Sister Anna.",
    "With other supporting cast members being killed off in season 1, such as Clarke Peters' antagonistic Linen Man, there are bound to be new characters joining the cast for season 2, if it goes ahead.",
    "One individual who could appear is the Linen Man's son. As a Refinery29 article suggests, the season 1 finale made mention to the show's antagonist having a son. According to the series' villain, his offspring is an Ipsissimus, too, just like the Linen Man and Jessie. The Linen Man wanted Jessie and his son to procreate and have children of their own, which would continue the Ipsissimus lineage and their dominion over the world.",
    "It's unclear if the Linen Man's son will be season 2's big bad, but it would be some form of continuity between both seasons if he was. The Irregulars will need a new major villain to face, particularly one who can go toe-to-toe with Jessie. For now, though, there are no concrete details on new cast members, antagonists or otherwise.",
    "Yes. Admittedly, we didn't think the first season was amazing by any stretch. Whilst the TV show's first instalment had its moments, we opined that it was a fairly average Sherlock adaptation that could have worked better as a series that wasn't steeped in Conan Doyle's legendary works.",
    "That isn't to say that The Irregulars can't rectify its errors though. There are bound to be teething problems in the first season of any TV production, and some original shows need to find their feet before coming to life in later seasons.",
    "The Irregulars suffered from some pacing problems, exposition drops, and run-of-the-mill soap opera elements, but it shone with its electric cast and supernatural slant on the Sherlock mythos. If the TV show leans more into the latter than the former, it could redeem itself in season 2 and even have the staying power for a third entry if necessary."
  ],
  "headers": {
    "4": "The Irregulars season 2 release date predictions: 2022?",
    "7": "The Irregulars season 2: is there a trailer?",
    "8": "The Irregulars season 2: what will the plot be?",
    "17": "The Irregulars season 2 cast: who will be returning?",
    "23": "The Irregulars season 2: does it deserve another outing?"
  },
  "links": {
    "has cancelled": "https://www.techradar.com/news/netflix-has-cancelled-the-irregulars-so-what-went-wrong",
    "Rotten Tomatoes": "https://www.rottentomatoes.com/tv/the_irregulars",
    "The Radio Times": "https://www.radiotimes.com/tv/sci-fi/the-irregulars-season-2-release-date-netflix/",
    "Refinery29 article": "https://www.refinery29.com/en-us/2021/03/10389488/linen-man-son-irregulars-netflix-finale-ending",
    "didn't think": "https://www.techradar.com/news/the-irregulars-on-netflix-is-far-from-the-best-take-on-sherlock-holmes"
  }
}