{
  "source": "https://www.techradar.com/news/leaseweb-global-expands-its-footprint-in-canada-with-cloud-hosting-acquisition",
  "title": "Leaseweb Global expands its footprint in Canada with cloud hosting acquisition",
  "category": "computing",
  "updated": "2021-08-05T12:40:00Z",
  "author": "abigail-opiah",
  "summary": "Montréal is the new hub for cloud and data center infrastructure",
  "article": [
    "Cloud services company Leaseweb Global is expanding its presence in the North American region by acquiring one of Canada's popular cloud hosting providers.",
    "Founded in 1996 and previously part of INAP, iWeb was purchased by Leaseweb this week for an undisclosed sum.",
    "The firm offers dedicated servers and cloud hosting from its three Montréal-based data centers.",
    "As a result of the acquisition, Leaseweb's Canadian footprint will become the third biggest international region by revenue, behind The Netherlands and U.S.",
    "Con Zwinkels, CEO at Leaseweb Global, said the company had been following the development of iWeb for a number of years.",
    "“As a business with very similar DNA to our own, we know they will bring a wide range of complementary services and skills to our presence in Canada,” he added.",
    "“They live and breathe hosting, have a deep understanding of the requirements of Canadian customers, and we’re delighted to welcome them to the Leaseweb team.”",
    "iWeb also provides global connectivity via ISP peering in Montréal and Tier 1 providers, offering users dedicated servers, private cloud, security services and colocation.",
    "“Today is a very exciting day for iWeb employees, customers and partners. We are joining a team that is focused on product, growth and customer experience,” said Roberto Montesi, CEO at iWeb.",
    "“We have long admired Leaseweb as a competitor. Now, as colleagues, we look forward to deploying new offerings quickly in our Montreal location to match the Leaseweb portfolio.",
    "\"This is an exciting state in our journey and ensures that Canada becomes a huge part of the future Leaseweb success story.”",
    "Organizations who require a market presence in North America, but need to host their data outside the U.S. are set to benefit from the move, according to the company.",
    "Powered by 99% renewable hydroelectricity, iWeb's solutions host thousands of servers for its clients across several industries and sectors."
  ],
  "headers": {
    "3": "Cloud hosting in Canada"
  },
  "links": {
    "Leaseweb Global": "https://www.techradar.com/reviews/leaseweb-hosting",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "iWeb": "https://www.techradar.com/reviews/iweb",
    "colocation": "https://www.techradar.com/news/best-colocation-hosting"
  }
}