{
  "source": "https://www.techradar.com/news/blade-runner-and-alien-tv-shows-are-in-the-works-according-to-ridley-scott",
  "title": "Blade Runner TV show confirmed, as Alien series also nears production",
  "category": "entertainment",
  "updated": "2021-11-24T10:12:30Z",
  "author": "rhys-wood",
  "summary": "Scott's sci-fi epics are set to be transformed for the small screen",
  "article": [
    "A Blade Runner TV series is coming to the small screen, director Ridley Scott has confirmed, in addition to the Alien TV series expected to release in 2023.",
    "\"We [have already] written the pilot for Blade Runner and the bible. So, we're already presenting Blade Runner as a TV show, the first 10 hours\", Scott told the BBC Radio 4's Today program on Monday.",
    "Fans of the beloved Blade Runner franchise – which now spans the original movie, Dune director Denis Villeneuve's recent sequel, and even a Blade Runner anime film – should be delighted by the news, though there's currently no date confirmed for the series.",
    "It's curious, though, that news of an Alien TV series emerged in mid-2021, but it appears that it isn't as far along, given that the show's bible (the general outline of a show's first stretch of episodes) is still in the process of being written.",
    "Mention of a TV show isn't the only piece of action the Blade Runner franchise has seen after the release of the Blade Runner 2049 movie five years ago. The first episode of the Blade Runner: Black Lotus anime premiered earlier in November as well; clearly the property will remain busy for a while.",
    "The Alien franchise has been a little more dormant, at least in the entertainment space, since 2017's Alien: Covenant, which received a lukewarm reception at the time of release. Scott made no mention about what kind of story the Alien TV show will tell, so it remains to be seen if it will provide a fresh shot in the arm many feel the franchise needs.",
    "The original Blade Runner and Alien movies are two of the most influential sci-fi movies of all time. Their impact on popular culture permeates to this day, and much of that credit has to go to their director, Ridley Scott.",
    "But Scott's recent efforts in the Alien franchise haven't been able to meet the earlier highs of the franchise. Both Prometheus (which he called \"easy to make in 3D\") and Alien Covenant failed to replicate the success of those first two epics.",
    "That's not to say either project is doomed to fail. The episodic format could greatly benefit both Blade Runner and Alien, especially in the case of the latter. In recent years, we've seen horror series like Netflix's Sweet Home and The Haunting of Hill House captivate audiences. There's no reason an Alien series couldn't achieve the same, especially if it features a mixture of Alien's classic aesthetic and modern horror sensibilities.",
    "More positively, our mind spins at the possibilities of what a big-budget Blade Runner TV show can offer. After Blade Runner 2049's neon-drenched cyberpunk aesthetic (not to mention its brilliant continuation of the original story) had us hypnotized, we're eager to revisit that world and hopefully some of its iconic characters, too."
  ],
  "headers": {
    "6": "Analysis: Is Scott the right man for the job?"
  },
  "links": {
    "Blade Runner": "https://www.techradar.com/news/best-netflix-sci-fi-movies-mind-bending-films-to-stream-in-australia-right-now",
    "expected to release in 2023": "https://www.techradar.com/news/alien-tv-show-from-fargo-creator-sounds-like-itll-kick-ass-but-expect-a-long-wait",
    "told the BBC Radio 4's Today program": "https://www.bbc.com/news/articles/ck77gn5pzdgo",
    "Blade Runner: Black Lotus": "https://www.techradar.com/news/the-blade-runner-anime-has-an-amazing-cast-and-sounds-true-to-the-movie",
    "easy to make in 3D": "https://www.techradar.com/news/home-cinema/ridley-scott-making-prometheus-in-3d-is-really-easy-1074215"
  }
}