{
  "source": "https://www.techradar.com/news/leaked-asus-chromebook-tablet-could-rival-lenovo-duet",
  "title": "Leaked Asus Chromebook tablet could rival Lenovo Duet",
  "category": "computing",
  "updated": "2021-02-01T17:02:06Z",
  "author": "axel-metz",
  "summary": "Finally, some competition",
  "article": [
    "Specs and images have leaked online detailing the Asus Chromebook Flip CM3000, a Chromebook tablet which looks set to rival the Lenovo IdeaPad Duet.",
    "According to information leaked by Chrome Unboxed, the so-called Asus CM3000 — allegedly in development under the codename Saturn — will use a MediaTek MT8183 processor and come with a 10.5-inch full HD display and detachable keyboard.",
    "The device looks to be shipping with the ‘Flip’ branding based on various listings found online (this German retailer seems the most comprehensive), but won’t be a foldable laptop like the others in the Flip range.",
    "Instead, the Asus Chromebook Flip CM3000 will be an ARM-powered tablet equipped with a keyboard, kickstand back (which pictures suggest may accommodate both portrait and landscape modes) and stowable USI pen.",
    "Other reported features include a 3.5mm audio jack and a keyboard cover with a soft-touch fabric surface to magnetically attach it to the tablet — much like those used on Microsoft's Surface convertibles (like the Surface Pro 7).",
    "News of a new Chrome OS-powered tablet is big given the few comparable devices on the market right now. The Lenovo IdeaPad Duet has been the front-runner since its introduction in 2020, though the new Asus Chromebook Flip looks set to be the first device to rival its success.",
    "It doesn’t look to be improving much upon the specs of the Duet — its MediaTek processor is pretty much a reheated version of the Lenovo’s Helio processor — but the Asus will come with a slightly larger screen (0.4-inch larger than the Duet) and some menial features, like the audio jack and magnetic cover, not seen on its competitor.",
    "Interestingly, the Chromebook Flip CM3000 doesn’t seem to improve on the Duet’s resolution specs despite its slightly larger screen, and its increased size makes it that little bit heavier, so the jury is out on whether it marks an improvement or simply a competitive rival. Given that the Duet has largely stood alone in the market as the only real Chromebook tablet option, we’ll safely assume the latter.",
    "Another part of the Lenovo Duet’s appeal was its exceptionally-reasonable price tag. At $299 (or £299.99 in the UK and around AU$399), we described it as “the best value you're going to find in a portable device of its kind, hands down.”",
    "Though details are still unconfirmed at this stage, listings suggest the Asus Chromebook Flip CM3000 will ship for over $500 (that’s around £350 or AU$399), making it significantly more expensive than its Lenovo counterpart despite not packing a whole load of improved features.",
    "It’s worth noting that the Lenovo Duet was reported to have cost less than it ended up costing upon release, so it’s wise to take any reported price tags with a pinch of salt. In any case, the Asus Chromebook Flip CM3000 looks set to finally offer some competition in the Chrome-powered tablet market.",
    "Via AndroidPolice"
  ],
  "headers": {
    "5": "An uncrowded market"
  },
  "links": {
    "Lenovo IdeaPad Duet": "https://www.techradar.com/reviews/lenovo-ideapad-duet-chromebook-review",
    "Chrome Unboxed": "https://chromeunboxed.com/asus-chromebook-flip-cm3000-tablet-detachable-mediatek",
    "German retailer": "https://www.saturn.de/de/product/_asus-chromebook-cm3000dva-ht0011-2706711.html",
    "others in the Flip range": "https://www.techradar.com/reviews/asus-chromebook-flip-c302",
    "Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "we described it": "https://www.techradar.com/reviews/lenovo-ideapad-duet-chromebook-review",
    "listings": "https://www.saturn.de/de/product/_asus-chromebook-cm3000dva-ht0011-2706711.html",
    "AndroidPolice": "https://www.androidpolice.com/2021/01/31/asus-chrome-os-tablet-leaks-looks-to-improve-upon-lenovos-duet/"
  }
}