{
  "source": "https://www.techradar.com/news/googles-grip-on-online-search-is-getting-even-stronger",
  "title": "Google's grip on online search is getting even stronger",
  "category": "computing",
  "updated": "2021-03-23T15:01:52Z",
  "author": "mayank-sharma",
  "summary": "Google continues to monopolize online search with \"zero-click\" searches",
  "article": [
    "A majority of Google users don’t click through to any of their search results, indicating that they find their answers on Google itself, and leading to a loss of traffic for other web properties, according to a new analysis.",
    "SimilarWeb’s analysis of over five trillion Google searches in the twelve months of 2020 reveals that 64.82% of them ended on Google’s search engine results page (SERP), known as zero-click searches.",
    "The figure is particularly alarming, when combined with the fact that Google can earn revenue from its SERP, which doesn’t display original information but rather just fetches it from other publishers, who are losing revenue since the visitors get everything they want to know from the SERP itself.",
    "Dubbed “click cannibalization” by Rand Fishkin, founder of research specialist SparkToro, over 77% of the zero-click searches come from mobile devices.",
    "According to Search Engine Land, the impact of zero-click searches isn’t evenly distributed. For instance, businesses that operate in the same spaces Google may be losing a greater share of traffic than other businesses.",
    "Combine these results with Google’s plans to kill off website cookies, which some fear might give it an unfair advantage over other advertisers, and you can see that search is no longer a level playing field.",
    "Then there’s Google’s plan to introduce the Federated Learning of Cohorts (FLoC) API, which it promotes as a means to enhance user privacy. Skeptics however argue that FLoC will only enable Google to further extend its monopoly over user data, driving other competing online advertisers out of the market.",
    "Via: Search Engine Land"
  ],
  "headers": {
    "3": "Market dominance"
  },
  "links": {
    "web properties": "https://www.techradar.com/news/the-best-website-builder",
    "kill off website cookies": "https://www.techradar.com/news/google-might-be-about-to-kill-off-website-cookies-for-good",
    "unfair advantage": "https://www.techradar.com/news/googles-plans-to-scrap-cookies-facing-major-scrutiny",
    "privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "Search Engine Land": "https://searchengineland.com/zero-click-google-searches-rose-to-nearly-65-in-2020-347115"
  }
}