{
  "source": "https://www.techradar.com/news/cryptominers-now-gobbling-up-amd-cpus-because-graphics-cards-are-too-expensive",
  "title": "Cryptominers now gobbling up AMD CPUs because graphics cards are too expensive",
  "category": "computing",
  "updated": "2021-11-26T12:55:00Z",
  "author": "john-loeffler",
  "summary": "Can't find an AMD Ryzen 9? Blame Raptoreum mining",
  "article": [
    "The ongoing shortage of the latest and best graphics cards like the RTX 3080 and RTX 3090 and PS5 consoles has pretty much been the number one tech story of 2021, but as we head into 2022, we might be able to add another new product to the mix: the latest AMD CPUs.",
    "Even as the best processors all got updates in 2020 and 2021, from Intel Alder Lake to AMD's Zen 3, they've largely been spared the kind of scarcity problems we've seen with other new tech products.",
    "Desktop PC building is too niche for scalpers to buy up processors in bulk to engage in dastardly profiteering – as with the PS5 and graphics cards – and consumer CPUs are too generalized for the kind of specific heavy-duty number crunching required for major cryptocurrency algorithms used by Bitcoin and Ethereum.",
    "In the case of cryptomining, scalping and mining feed into each other as Ethereum miners drive up demand for graphics cards that profiteers take advantage of. Miners also have an additional financial incentive to pay a higher price if they can still make a profit mining the speculative digital commodity.",
    "Bitcoin, meanwhile, is mined on specialized ASIC machines that cost thousands of dollars/pounds, so these are not really products the general public are even going to know about, much less purchase.",
    "Enter Raptoreum, a so-called altcoin that seeks to lower the bar to entry for mining by leveraging the GhostRider algorithm to produce the digital coins. This algorithm, according to Bitcoin Press, can be done efficiently on a consumer CPU with a sufficiently large L3 cache. In theory, this should allow everyone to become a cryptominer by lowering the barrier to entry to a simple CPU.",
    "The processors with the largest L3 cache sizes are AMD EPYC and Threadripper processors, but since those are server and workstation CPUs, respectively, they are very expensive.",
    "Enter the Ryzen 9 3900X and Ryzen 9 5900X. With 64MB L3 cache and relatively low cost, these chips can mine Raptoreum for profit. Predictably, this means that demand for the chips is already starting to climb, which is driving up the price for the processors.",
    "Will Raptoreum lead to AMD CPU shortages on the scale as we've seen with Nvidia graphics cards? That's highly unlikely, since it doesn't have the kind of enthusiast drive behind it the way Ethereum does and isn't likely to catch a pop culture wave like Dogecoin has.",
    "What it portends though isn't good if you would like to do something with technology other than mining a speculative digital commodity.",
    "The purpose behind Raptoreum sounds like a great idea, but it's also one as old as civilization itself. Take an asset, like land, and enable \"the people\" to buy into it at the lowest barrier to entry possible to combat the rapid consolidation of that asset into the hands of an elite who alone have the resources to make that asset productive.",
    "The ancient Romans tried it. So did Thomas Jefferson and the early Americans, with Jefferson waxing poetic about the United States becoming a nation of yeoman farmers with their own productive plot of land and each man (and he definitely meant just the men) the lord of his own little fiefdom.",
    "The problem is that all that land was itself taken from the indigenous people already living on it (costs are \"kept low\" by externalizing all of it onto someone else), or that in a market-based economic system, assets inevitably accumulate at the top because of the profit motive baked into the system.",
    "Just as Roman patricians bought out all the cheap plots of land to build gargantuan estates, large commercial cryptomining operators are just going to buy up all the currently \"cheap\" processors and leave \"the people\" out in the cold, as they always have and always will.",
    "Turning a CPU into a cryptomining asset doesn't get more people to mine cryptocurrency to \"speed up adoption.\" It just means that CPUs are now going to become another thing that the rest of us are going to have to go without as entities with far more resources and a profit motive simply outbid everyone else for them or buy up entire warehouses full of CPUs in bulk.",
    "Then, with all the CPUs now out of reach of \"the people\", we'll do this again with some other product. At this rate, how long until cryptominers find a way to get a PS5 to mine Nextcoin or whatever, and that stock crisis just becomes even more acute?",
    "This isn't even considering the devastating environmental cost of all those extra CPUs being impressed into the cryptomines along with the world's graphics card stock. CPUs are not a low-cost resource, the cost is just deferred in the form of Climate Change.",
    "Please stop, I'm begging you."
  ],
  "headers": {
    "10": "Opinion: please stop, yeoman cryptomining is never going to be a thing"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "best processors": "https://www.techradar.com/news/best-processors",
    "Raptoreum": "https://docs.raptoreum.com/#/howtomine",
    "GhostRider algorithm": "https://docs.raptoreum.com/_media/GhostRider_Whitepaper.pdf",
    "Bitcoin Press": "https://bitcoinpress.co.uk/raptoreum-crypto-cpu-miners-drive-amd-ryzen-shortage-large-level-3-cache-becomes-secret-sauce-own-snap/",
    "Ryzen 9 3900X": "https://www.techradar.com/reviews/amd-ryzen-9-3900x",
    "Ryzen 9 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "Nvidia graphics cards": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "devastating environmental cost": "https://www.theguardian.com/technology/2021/feb/27/bitcoin-mining-electricity-use-environmental-impact"
  }
}