{
  "source": "https://www.techradar.com/news/new-arlo-essential-indoor-camera-is-an-affordable-home-security-option",
  "title": "New Arlo Essential Indoor Camera is an affordable home security option",
  "category": "smart-home",
  "updated": "2021-03-10T14:46:44Z",
  "author": "carrie-ann-skinner",
  "summary": "The built-in privacy shutter can stop the camera recording, too",
  "article": [
    "Arlo makes some of the best home security cameras on the market, but they’re also some of the most expensive, which can put them out of reach for some. However, the brand hopes to change this with its Essential range of low-cost cameras, which now includes an indoor option.",
    "The Essential Indoor Camera is currently available to pre-order in the US, priced at $99.99. It’s available through Arlo’s website and will go on sale at the end of March. Arlo has yet to confirm whether the security camera will be made available in the UK and Australia.",
    "The mains-powered security camera will alert you when motion is detected, and will record 1080p footage of the activity. An automated privacy shutter, which covers the camera lens, can be activated if you want to stop motion and audio detection, as well as the camera recording, at any time. The privacy shutter can be activated from the Arlo app.",
    "Slightly smaller than the recently introduced Essential Spotlight Camera, which is battery-powered and can be used outdoors, the Indoor camera connects directly to your home Wi-Fi network, rather than using a smart hub like Arlo’s other home security cameras.",
    "The camera, which comes in black or white, has a 130-degree field of view and includes a built-in microphone and speaker that allow you to converse with anyone in your home, whether that’s pets, children or a potential intruder.",
    "The Arlo Essential Indoor camera has a built-in swivel mount so it can be placed at any angle you like, and can be used freestanding or mounted on a ceiling.",
    "The camera comes with a three-month trial of Arlo Smart, which sees video recorded by the camera stored in a secure area online for up to 30 days, and can identify whether the motion has been caused by a person, animal or vehicle. It also allows you to set ‘activity zones’ so you’re only alerted when motion is detected in these areas."
  ],
  "headers": {
    "3": "Small but still mighty",
    "5": "Smart alerts"
  },
  "links": {
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Essential range of low-cost cameras": "https://www.techradar.com/news/arlo-reveals-two-new-essential-home-security-cameras",
    "Arlo’s website and": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1990170312475409400/https://www.arlo.com/en-us/cameras/essential/VMC2040-100NAS.html"
  }
}