{
  "source": "https://www.techradar.com/news/microsoft-is-handing-out-azure-freebies-to-open-source-devs",
  "title": "Microsoft is handing out Azure freebies to open source devs",
  "category": "computing",
  "updated": "2021-09-29T11:33:02Z",
  "author": "joel-khalili",
  "summary": "Microsoft’s flirtation with the open source community continues",
  "article": [
    "Microsoft has announced it will give open source projects free Azure credits for a year, to relieve financial pressure on developers and encourage innovation in the space.",
    "According to a company blog post, any developer with an Open Source Initiative (OSI)-approved license is eligible to apply, and the free credits can be used for “testing, storage or other development”.",
    "The company says it will review all applications within three-four weeks, and developers will have to reapply at the end of the year if they would like to extend the grant.",
    "For a long time, Microsoft was among the fiercest opponents of open source, even referring to the movement as a “cancer” in 2001. Meanwhile, the company’s stranglehold on the office software market made it the antithesis of what the open source community hoped to achieve.",
    "However, the Redmond giant has had an almost total change of heart since then, becoming a huge contributor to the open source cause. The new Azure scheme is the latest development in the company’s new relationship with the community.",
    "“Open source software is an integral part of development at Microsoft, aligned with our goal to empower all developers to be successful building any application, using any language, on any platform,” wrote Microsoft.",
    "“We are committed to building open, flexible technology and working with the open source community to grow together as an industry.”",
    "Microsoft says the grant has already been awarded to a number of open source projects. For example, the developers of the Haskell programming language are using credits to support their continuous integration system, GitLab instances and other builds. Meanwhile, Unix OS FreeBSD is using credits to work on custom kernels.",
    "Qualifying developers can apply for the scheme here."
  ],
  "headers": {
    "3": "Microsoft and open source"
  },
  "links": {
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1062348916246412800&xs=1&url=https%3A%2F%2Fcloudblogs.microsoft.com%2Fopensource%2F2021%2F09%2F28%2Fannouncing-azure-credits-for-open-source-projects%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-handing-out-azure-freebies-to-open-source-devs",
    "here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1434444948123728000&xs=1&url=https%3A%2F%2Fopensource.microsoft.com%2Fazure-credits%23credits-apply&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-handing-out-azure-freebies-to-open-source-devs"
  }
}