{
  "source": "https://www.techradar.com/news/rackspace-takes-on-ml-web-browser-capabilities-with-brave-partnership",
  "title": "Rackspace takes on ML web browser capabilities with Brave partnership",
  "category": "computing",
  "updated": "2021-04-13T14:23:40Z",
  "author": "abigail-opiah",
  "summary": "Cloud computing meets web browser in ML push",
  "article": [
    "Rackspace Technology has expanded its relationship with open-source web browser Brave in a bid to speed up processes for training and deploying machine learning models.",
    "Brave worked with AWS Consulting Partner, Onica, a Rackspace Technology company, on the scalability of its web browser software.",
    "Once on AWS cloud, Rackspace Technology made improvements in automating Brave’s machine learning processes, employing MLOps Foundations to provide an architecture pattern for Brave.",
    "Brave says it now plans to work on establishing a more robust pipeline and fully automated processes, while delivering on the promise of a fast and private web experience.",
    "The company boasts of its ability to help advertisers achieve better conversions and increase publishers’ revenue share.",
    "“Working with Rackspace Technology and AWS was beneficial to the continued success and scaling of Brave,” said Jimmy Secretan, VP of Services and Operations, Brave Software.",
    "“It substantially improved the way we created and deployed new models, which has helped us to be much more responsive to advertisers’ needs.\"",
    "Brave's machine learning functionality is notable for its ability to match applicable advertisements in the Brave Ads content categories, while still looking to preserve user privacy.",
    "“Rackspace Technology is one of only a few providers to have achieved AWS Machine Learning Competency status,” said Jeff Deverter, CTO, Solutions at Rackspace Technology.",
    "“This unique combination of expertise in AWS services and machine learning made us an ideal partner for Brave.”",
    "According to Rackspace's most recent industry report, on average, companies are spending $1.06 million on AI and machine learning initiatives per year - with nearly a third (31%) of the 1,500 IT survey respondents identifying data quality as a primary challenge to getting actionable insights out of AI and machine learning projects."
  ],
  "headers": {
    "3": "Multicloud web browser combination"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "AWS": "https://www.techradar.com/news/aws",
    "Rackspace's most recent industry report": "https://www.rackspace.com/solve/succeeding-ai-ml"
  }
}