{
  "source": "https://www.techradar.com/news/these-wireless-earbuds-come-with-some-serious-audiophile-specs-but-theyll-cost-you",
  "title": "These wireless earbuds come with some serious audiophile specs – but they'll cost you",
  "category": "audio-visual",
  "updated": "2021-02-09T10:12:21Z",
  "author": "olivia-tambini",
  "summary": "The Audeze Euclid wireless earbuds are here",
  "article": [
    "Audeze has released its first closed-back in-ear headphones, offering an audiophile-friendly competitor to the likes of the Apple AirPods and the Sony WF-1000XM3.",
    "Like previous models (including the LCD-i3 in-ear headphones), the Audeze Euclid wireless earbuds come with 18mm planar magnetic drivers, as well as precision-milled aluminium casings for a lightweight build.",
    "Unlike the LCD-i3 however, you shouldn't experience any sound leakage with these earbuds, thanks to their closed-back design.",
    "The earbuds can even be used with a wired connection if you prefer, coming with a 3.5mm braided cable and gold-plated MMCX connections – handy if you prefer the security of a wire or the earphones run out of battery.",
    "According to Audeze, the earbuds boast \"the highest dynamic range\" in their class. If that claim came from any other audio company, we'd be highly skeptical, but Audeze's previous in-ear headphones have been extremely impressive.",
    "Audeze is still yet to offer any information about battery life and connectivity – in fact, the earbuds won't be getting Bluetooth support until March, according to What Hi-Fi?.",
    "Without knowing how the Euclid will perform as true wireless earbuds could be very off-putting to potential buyers – particularly when these buds cost a whopping $1,300 / £1,249 (about AU$1,680).",
    "That's far pricier than most true wireless earbuds on the market – for comparison, the best wireless earbuds of 2021, the Sony WF-1000XM3, which cost $230 / £220 / AU$399 at launch, and are often available at lower prices.",
    "High prices are nothing new for Audeze though; the LCD-i3 in-ear headphones are among the best-sounding buds we've ever tested, but cost an eye-watering $899 / £849 (about AU$1,200).",
    "If you like the idea of owning a pair of Audeze headphones, but can't justify those high prices, you should check out the Audeze LCD-1 open-back over-ear headphones.",
    "Costing $399 / £399 / AU$649, these audiophile headphones bring the company's typically uncompromising technology down to a real-world(ish) price.",
    "Is your heart set on the Audeze Euclid? You'd better start saving now and hope they come with a fantastic battery life and best-in-class connectivity."
  ],
  "headers": {
    "5": "Eye-watering prices"
  },
  "links": {
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "LCD-i3 in-ear headphones": "https://www.techradar.com/reviews/audeze-lcd-i3",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "What Hi-Fi?": "https://www.whathifi.com/news/audeze-announces-euclid-planar-magnetic-earbuds",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Audeze LCD-1": "https://www.techradar.com/reviews/audeze-lcd-1",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342"
  }
}