{
  "source": "https://www.techradar.com/news/the-walking-dead-season-11-episode-3-recap-more-death-as-the-reapers-move-in",
  "title": "The Walking Dead season 11 episode 3 recap: more death as the Reapers move in",
  "category": "entertainment",
  "updated": "2021-09-06T19:29:32Z",
  "author": "ross-kennedy",
  "summary": "Big spoilers follow",
  "article": [
    "Spoilers for The Walking Dead season 11 episode 3 follow.",
    "Continuing from the mask-wearing Reapers ambush in last week's episode, the group exacts a quick and cruel attack on Maggie’s group who are bloodied as they attempt to flee. The conflict is swift and brutal. Maggie is isolated in the melee, when things suddenly turn quiet.",
    "Everyone is gone. Things are eerie, disorientating, and we have many unknowns about the attack, including who is even alive at this point. Maggie escapes the area, but is pursued. The Reapers become classic horror movie villains, if they were cold-blooded commandos. At one point, Maggie turns on a light in the dark and a skull-face is leering behind her. When another is injured, they deploy grenades like they’re a downed player in Call of Duty. These theatrics are all to distract their enemies, but Maggie remains focused.",
    "The desperate duo of her and Negan are again the vehicle for the episode, as they meet and search for their split group. Alden is severely cut up, but he’s lucky. Two of Maggie’s old friends, Duncan and Cole, don’t come out at all. The psychological toll is clear on Maggie, as she puts Duncan down before he zombifies and promises to take care of Agatha. Within the span of the next encounter, Agatha is bitten and eventually overrun by Walkers, as Negan must drag Maggie away to save her while Agatha dies. Apart from her husband’s killer, everyone she cares for is dead or missing. Brutal.",
    "Gabriel is another survivor we follow in this episode. He hunts a dying Reaper alone. The Reaper asks for Gabriel to pray for him, but Gabriel can’t find the will to, and finishes off the downed man. Gabriel has always been challenged in his morality and faith in this new and harsh world – it’s defined his arc in The Walking Dead – and he's continued to become more cynical in the face of these events. It’s sad to see a good person turn cold-hearted, yet it makes perfect sense for his character.",
    "Back in Alexandria proper, we start to see more of the town and the repairs taking place after the Whisperers invaded. The walls are erected, debris is cleared, and patrols continue. There’s a sense of desperation as the recovery starts. Morale is very low.",
    "We see a few scenes with the kids of Alexandria, including Judith and Hershel, who are playing games and eating together. They talk about why the adults tell them what they do, act the way they do and bring up the strange food they have had to eat. It's the perspective of people who have only known the post-apocalypse, and it's a nice change of pace to see them questioning their elders and the world they’ve grown up in. It’s humbling to see a more mundane atmosphere in the middle of all this intensity.",
    "The greater focus, though, is the women of Alexandria. Carol goes out to hunt down their escaped horses, helped by Magna, Kelly, and Rosita. The whole vibe of their excursion is more like a western, with corralling and ranching of livestock as they open up to each other. The Western aesthetics have always been there in this show, but made more explicit here, and it’s emotionally poignant as they comfort and listen to each other. There’s real tenderness in these scenes, with the soft sun setting behind the galloping horses. The morale is, for now, lifted in Alexandria.",
    "Of course, this is The Walking Dead, so happiness comes with a sacrifice. As their food supply is decimated, Carol takes a horse away, lays it down, calms it and slits its throat as its life gradually fades. Through her tears, the allegory seems obvious. Letting one die to save the others is a decision that needs to be made sometimes – especially in this show.",
    "This leads neatly into the final scene, where Maggie is forced to leave Alden in an abandoned church while she and Negan continue to Arbor Hill’s supply cache. She says Negan is heartless, and the same person she left behind, even if he’s lying to himself about changing. It really drives home how she resists any sort of humanity or possible redemption in him. They wander off together, their relationship as tense as ever.",
    "Verdict:",
    "The Reapers are given the space to show us what they're made of, hinting at the terror and conflict to come. Even the ever-steely Carol is given the chance to be more emotional and vulnerable than usual in this episode, with a lot of great emotional, physical acting from Melissa McBride.",
    "We can even complement the oft-awful lighting for a change – it really shines in the episode's moody darks and bright sunsets. Maggie and Negan’s relationship is enjoyable enough, though focusing on it for a third episode in a row is starting to wane my interest, and there are plenty of other characters that we could explore."
  ],
  "headers": {
    "5": "Elsewhere, in Alexandria...",
    "13": "What else?"
  },
  "links": {}
}