{
  "source": "https://www.techradar.com/news/the-realme-8-a-new-budget-camera-phone-is-coming-soon",
  "title": "The Realme 8, a new budget camera phone, is coming soon",
  "category": "phones",
  "updated": "2021-03-15T13:40:18Z",
  "author": "srivatsa-ramesh",
  "summary": "With a focus on photography",
  "article": [
    "Realm has confirmed that two anticipated affordable phones, the Realme 8 and Realme 8 Pro, will launch on March 24. The company had already teased the devices, and we're expecting them to be accomplished camera phones, but we'll soon find out everything about them.",
    "In press materials promoting the upcoming phone launch, Realme highlights the 108MP camera coming to the Realme 8 Pro (which had already been confirmed), and also the names of the phones, clearing up any lingering ambiguity.",
    "While there's still no confirmation, the Pro variant is the only one that’s likely to feature the 108MP primary camera, which was showcased by Realme recently. The camera will use a 1/1.52-inch Samsung ISOCELL HM2 image sensor.",
    "There's a lot about the upcoming phones that we still don't know, but if you're a fan of affordable smartphones, as Realme's handsets mostly are, or impressive camera phones, you'll want to pay attention to this launch.",
    "The Realme 8 Pro is the first phone from the brand to have a 108MP camera, and this will be teamed with three other cameras which, based on previous Realme handsets, we think will be ultra-wide, macro, and depth, although this hasn't been confirmed.",
    "According to rumors, the Realme 8 Pro will have a Super AMOLED display, and will be the first budget phone in the Realme numbered series to sport an in-display fingerprint scanner. The device is likely to be powered by the Snapdragon 730G chipset, while there are also rumors of a 5G variant. A 120Hz high refresh rate and 65W fast charging are also expected.",
    "The Realme 8 is set to feature a 6.4-inch Super AMOLED display, based on leaked images, and is said to be powered by a Helio G95 chipset, the same processor that was in the Realme 7. This phone will have a 64MP main sensor, plus three other rear cameras.",
    "It will sport a 5,000mAh battery and 30W fast charging, the same as in the Realme 7. The phone is expected to run on Realme UI 2.0 based on Android 11 out of the box, and is likely to come with up to 8GB of RAM and 128GB of internal storage.",
    "We'll know these various specs for sure when the Realme 8 and 8 Pro launch – and when they do, we'll bring you all you need to know about the handsets."
  ],
  "headers": {
    "4": "Realme 8 and 8 Pro specs"
  },
  "links": {
    "camera phones": "https://www.techradar.com/news/best-cameraphone",
    "108MP camera": "https://www.techradar.com/news/realme-8-series-teaser-confirms-108mp-quad-camera-setup",
    "Realme 7": "https://www.techradar.com/reviews/realme-7-review"
  }
}