{
  "source": "https://www.techradar.com/news/kioxia-launches-new-line-of-tiny-ssds-but-theyre-not-for-you",
  "title": "Kioxia launches new line of tiny SSDs, but they're not for you",
  "category": "computing",
  "updated": "2021-11-16T03:00:33Z",
  "author": "anthony-spadafora",
  "summary": "Kioxia BG5 Series SSDs enable PCI 4.0 performance without sacrificing affordability",
  "article": [
    "Kioxia has announced the latest addition to its lineup of PCIe 4.0 SSDs with the launch of the new Xioxia BG5 Series.",
    "While the company says it designed its latest M.2 SSDs to bring a suitable balance of performance, cost and power to everyday gamers and PC users, keep in mind that its BG Series NVMe SSDs are aimed at businesses making ultra-thin PCs and IoT embedded devices though these drives can also be used for server boot in data centers.",
    "The Kioxia BG5 Series is built with a PCIe 64 GT/s interface (Gen4 x4 lanes) and are accelerated by the company's fifth generation BiCS FLASH 3D flash memory technology.",
    "Vice president of SSD marketing and product management at Kioxia America, Inc., Neville Ichaporia provided further insight on the company's new BG5 series in a press release, saying:",
    "“Market adoption of DRAM-less SSDs is increasing steadily, thanks to HMB’s ability to reduce the overall bill of materials without degrading the data read/write performance of the SSD. The fact that KIOXIA realized PCIe 4.0 performance with a DRAM-less architecture is a win for mainstream client applications.”",
    "As a virtual multi-LUN (VML)-enabled client SSD, the Kioxia BG5 series unlocks back-end flash performance while also maintaining affordability.",
    "At the same time, Kioxia BG5 SSDs ship in a compact M.2 2230 single-sided, thermally optimized form factor though M.2 2280 single-sided form factor versions are available as well.",
    "Available in 256, 512 and 1024GB capacities, the Kioxia BG5 series are capable of up to 3,500 MB/s sequential read and 2,900 MB/s sequential write speeds. These new drives can also reach up to 500k IOPS random read and 450k IOPS random write.",
    "The Koxia BG5 series is now sampling to key industry partners and customers though the company has yet to provide an official release date as well as pricing regarding its new SSDs.",
    "Considering upgrading your computer? Check out our roundup of the best business computers as well as the best business laptops, best workstations and best mobile workstations"
  ],
  "headers": {
    "5": "Kioxia BG5 Series"
  },
  "links": {
    "Kioxia": "https://www.techradar.com/news/western-digital-could-be-set-for-kioxia-meger",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "M.2 SSDs": "https://www.techradar.com/best/best-m2-ssd",
    "ultra-thin PCs": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "press release": "https://www.businesswire.com/news/home/20211115005084/en/KIOXIA-Delivers-PCIe-4.0-Performance-to-Everyday-PC-Users",
    "best business computers": "https://www.techradar.com/news/best-business-desktop-pcs",
    "best business laptops": "https://www.techradar.com/news/best-business-laptops",
    "best workstations": "https://www.techradar.com/best/best-workstations",
    "best mobile workstations": "https://www.techradar.com/news/best-mobile-workstations"
  }
}