{
  "source": "https://www.techradar.com/news/iphone-se-3-and-all-new-ipads-could-get-face-id",
  "title": "iPhone SE 3 and all new iPads could get Face ID",
  "category": "phones",
  "updated": "2021-07-26T09:53:42Z",
  "author": "james-rogerson",
  "summary": "The notch might be here to stay",
  "article": [
    "All of Apple’s current phones other than the iPhone SE (2020) have Face ID, but for the iPhone SE 3 the company might bring its cheapest range in line with the other iPhones by including Face ID for the first time.",
    "Mark Gurman (a journalist with a great track record for Apple information) claims in his PowerOn newsletter for Bloomberg that Apple plans to ultimately bring Face ID to all relevant devices, including the iPhone SE range, all iPads, and all Macs.",
    "This is because Face ID provides both security and augmented reality features, while the main alternative – a fingerprint sensor – only provides security, making it a less desirable option for Apple.",
    "This doesn’t necessarily mean that the iPhone SE 3 will get Face ID, and indeed some sources claim that it will have the same design as the iPhone SE (2020), suggesting that Face ID won’t be present.",
    "But they could be wrong, and if not the iPhone SE 3 in particular, then sooner or later there should be an SE model with Face ID if Gurman is right.",
    "It's worth noting that this doesn't mean no future iPhone will have a fingerprint scanner - Gurman and other sources have previously predicted that we might get an in-display scanner on a future model, but this would apparently be in addition to Face ID, not instead.",
    "If Apple plans to embrace Face ID on all its devices then that means it’s committed to the system, which in turn means we’ll probably have to endure notches for quite a while yet.",
    "Gurman has previously claimed that Apple is working on building the Face ID components into the screen, but apparently this would only be offered on premium models (likely the Pro range), leaving the standard numbered iPhones and the iPhone SE out.",
    "We also can’t see this happening anytime soon. Companies still haven’t mastered putting a camera under the display. A few phones, such as the ZTE Axon 20 5G, do offer this, but the camera is still slightly visible, and the photo quality isn’t great.",
    "We’d imagine hiding all the many Face ID components in a screen is even trickier, and Apple doesn’t tend to offer features until they’re perfected – sometimes meaning the brand is years behind rivals in offering them. All of which means that it could be a long time yet before the notch disappears.",
    "Via Phone Arena"
  ],
  "headers": {
    "6": "Analysis: the notch is likely to stick around for a while"
  },
  "links": {
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "PowerOn newsletter": "https://www.bloomberg.com/account/newsletters/power-on",
    "the same design as the iPhone SE (2020)": "https://www.techradar.com/news/iphone-se-3-could-be-as-powerful-as-the-iphone-13-but-it-might-look-dated",
    "other sources": "https://www.techradar.com/news/move-over-iphone-12-apples-iphone-13-may-feature-under-display-touch-id",
    "ZTE Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "Phone Arena": "https://www.phonearena.com/news/apple-face-id-macs-iphone-se-ipads_id133865"
  }
}