{
  "source": "https://www.techradar.com/news/halo-infinites-next-tech-preview-will-focus-on-pvp-modes-343-industries-confirms",
  "title": "Halo Infinite’s next tech preview will focus on PvP modes, 343 Industries confirms",
  "category": "gaming",
  "updated": "2021-08-21T09:26:51Z",
  "author": "emma-boyle",
  "summary": "But there's no date for it yet",
  "article": [
    "Halo Infinite developer, 343 Industries, has confirmed that another technical preview is coming and that this time around there’ll be a focus on PvP modes.",
    "The announcement was made during a recent development update video by Producer for Live Operations, Sam Hanshaw, who confirmed that the next preview will bring in even more players than the last and that the current target is for those taking part to be able to play 4v4 PvP and the larger scale 12v12 Big Team Battle.",
    "This upcoming technical preview follows on from Halo Infinite’s first preview which took place back in July and Hanshaw confirmed that the bot-focused modes from that first round of testing will also still be available for players in this next round.",
    "At the moment, the next technical preview doesn’t have a start date attached to it but we imagine it won’t be long until that’s confirmed. Hopefully that will also be the case for Halo Infinite’s release date which is still set for “Holiday 2021”, though when the game does launch 343 Industries confirmed in this same update that it won’t have campaign co-op or the Forge level editor. Instead, these modes will be added to the game in the months after release as season updates.",
    "We know, then, that Halo Infinite is a game that will continue to grow and expand after launch and Hanshaw said that the flighting system will continue after launch, too, in order to test new content and features that will be introduced . “Halo Infinite is a game that's going to go on, and when we have new features that we want to test, we're going to do it in the same fashion,” he said, “So we're setting up this program to be lasting through beyond launch.”",
    "Those hoping to take part in any of Halo Infinite’s test flights will need to be signed up to the Halo Insider program. Signing up for this is a matter of registering for the program with your gamertag and opting in for communications and flighting. Halo community manager John Junyszek has previously posted a Twitter thread, breaking down the steps to register in detail.",
    "At the moment, Halo Infinite has a release window of Holiday 2021 which means we should probably expect to see it sometime between November and December. As the holiday period draws closer, though, fans are increasingly looking for a more solid date than that. But when will we get one?",
    "Well, really, it feels like it’s only a matter of time. Though this recent development update didn’t bring a solid release date, 343 Industries did lay out features that players should and shouldn’t expect to see at launch and emphasised a post-launch content roadmap. This does suggest that 343 Industries and Microsoft don’t intend to let the timeframe for release slip.",
    "This next big technical preview on the horizon will bring the development team feedback on some pretty essential multiplayer modes and it seems plausible that in the aftermath of that 343 Industries might be in a place where it’ll be willing to offer a slightly more solid date. Only time will tell, though.",
    "When Halo Infinite does launch you'll be able to play it on Xbox Series X|S, Xbox One and PC, with Xbox Game Pass subscribers getting access on day one."
  ],
  "headers": {
    "6": "Analysis: Will we get a release date soon?"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "during a recent development update video": "https://youtu.be/Yct2QKgF5e4?t=461",
    "first preview": "https://www.techradar.com/news/halo-infinite-beta-is-finally-up-and-running-and-the-bots-are-hilarious",
    "confirmed in this same update": "https://www.techradar.com/news/halo-infinite-trims-features-to-launch-by-end-of-2021-but-still-lacks-a-release-date",
    "Halo Insider": "https://www.halowaypoint.com/en-us/community/halo-insider",
    "previously posted a Twitter thread": "https://twitter.com/Unyshek/status/1415315811233787906?s=20",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}