{
  "source": "https://www.techradar.com/news/this-apple-ar-patent-could-turn-any-surface-into-a-touchscreen",
  "title": "This Apple AR patent could turn any surface into a touchscreen",
  "category": "wearables",
  "updated": "2021-04-23T11:56:02Z",
  "author": "rhys-wood",
  "summary": "There’s a random household object for that",
  "article": [
    "An Apple patent has demonstrated how the tech giant could combine augmented reality with thermal technology to generate a virtual touchscreen on practically any surface, making use of thermal cameras built into a potential AR glasses device.",
    "Spotted by Patently Apple, the technology known as Thermal Touch was developed by tech company Metaio, which Apple acquired back in 2015. Put as simply as possible, the technology combines information drawn from infrared sensors with an AR display to generate a workable touchscreen.",
    "Thermal Touch recognizes the heat generated from touching a surface, and registers that as a command, making the virtual interface interactive. Projected applications could come in the form of virtual keyboards or potentially full touchscreen displays if Apple’s rumored AR glasses are powerful enough to handle the processing required.",
    "In the above video released in 2014, prior to Apple’s acquisition of the company, Metaio CEO Dr. Thomas Alt explains potential applications of Thermal Touch technology, and that “the world” can become a touchscreen as a result. A major – and impressive – example shown involves a user touching an image of a jacket in a magazine to produce shopping results.",
    "Other interesting examples shown in the video include a fully virtual chess game, with individual pieces recognizing – and being able to be moved by – Thermal Touch input. It was perhaps Metaio’s working prototype that caught Apple’s attention in the first place.",
    "We can assume that Apple and Metaio have been developing Thermal Touch technology for some time, then, and we’ve seen lots of eyebrow-raising rumors surrounding Apple’s AR smartglasses, from generating virtual objects to compatibility with haptic socks. Yes, you read that right.",
    "While this is all still largely based in conjecture, the steady trickle of rumors and patent reveals show that Apple’s development in augmented reality could be quite a leap forward for the nascent technology. Analysts suggest that the glasses could go to market as early as 2022."
  ],
  "headers": {
    "3": "The magic touch"
  },
  "links": {
    "Patently Apple": "https://www.patentlyapple.com/patently-apple/2021/04/apple-reveals-thermal-touch-technology-for-a-future-ar-interface-that-could-amazingly-transform-any-surface-into-a-touch-scre.html",
    "Apple’s rumored AR glasses": "https://www.techradar.com/news/apple-glasses",
    "generating virtual objects": "https://www.techradar.com/news/apple-glass-ar-could-create-holograms-of-virtual-objects",
    "haptic socks": "https://www.techradar.com/news/apple-ar-and-vr-might-use-haptic-socks",
    "as early as 2022": "https://www.techradar.com/news/apple-ar-glasses-could-arrive-in-2022-according-to-a-new-report"
  }
}