{
  "source": "https://www.techradar.com/news/xbox-cloud-gaming-will-eventually-feature-pc-games-says-xbox-head",
  "title": "Xbox Cloud Gaming will eventually feature PC games, says Xbox head",
  "category": "computing",
  "updated": "2021-04-20T12:01:20Z",
  "author": "rhys-wood",
  "summary": "More games coming to the cloud",
  "article": [
    "It looks like games exclusive to the PC version of Xbox Game Pass will eventually be available to play via the Xbox Cloud Gaming service, as confirmed by head of Xbox Phil Spencer when responding to the question on Twitter.",
    "When answering a question regarding if PC games will show up on the Xbox Cloud Gaming service in the future, Spencer responded: “...PC games will come, focused on console games now.”",
    "The question came about as a result of the official Xbox Wire Twitter account tweeted that invites will soon be rolling out to Xbox Game Pass Ultimate members for the Xbox Cloud Gaming limited beta for Windows 10 PCs and Apple smartphones and tablets.",
    "The official Xbox Wire news post for the Xbox Cloud Gaming limited beta will let invitees “play over 100 Xbox Game Pass titles through Edge, Google Chrome, or Safari” web browsers. Specifically, the available games will be console titles, with PC games coming at a later, as of yet unannounced date.",
    "The Xbox Cloud Gaming service launched for Xbox Game Pass Ultimate members back in September 2020. While the cloud service currently features Xbox Game Pass games available on console, Spencer’s comments on PC game availability could mean that more Xbox Cloud Gaming betas will take place in future.",
    "Xbox Cloud Gaming recently received updated functionality, providing touch controls that allow for play without a controller. When games featured on the PC version of Xbox Game Pass make their way to Xbox Cloud Gaming, we can see touch controls being a worthwhile alternative for popular strategy-heavy games like Age of Empires and Crusader Kings 3.",
    "There’s no word as to whether mouse and keyboard support will be factored into Xbox Cloud Gaming on Windows 10 - the Xbox Wire announcement post only mentions USB and Bluetooth controller support. That’s an accessibility feature we’d love to see, especially when first-person perspective games like Prey and The Elder Scrolls 5: Skyrim benefit greatly from a mouse and keyboard setup."
  ],
  "headers": {
    "4": "Cloud Nine"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Cloud Gaming": "https://www.techradar.com/how-to/how-to-stream-xbox-games-on-your-phone-or-tablet",
    "Xbox Wire Twitter account": "https://twitter.com/XboxWire/status/1384144649837707280",
    "official Xbox Wire news post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-2522968610969437000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F04%2F19%2Fxbox-cloud-gaming-windows-pc-and-apple-limited-beta%2F",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Age of Empires": "https://www.techradar.com/news/age-of-empires-4-release-date-trailers-and-features",
    "Prey": "https://www.techradar.com/news/prey-review"
  }
}