{
  "source": "https://www.techradar.com/news/you-can-now-order-ufc-260-to-watch-miocic-vs-ngannou-2-heres-how",
  "title": "You can now order UFC 260 to watch Miocic vs Ngannou 2 - here's how",
  "category": "entertainment",
  "updated": "2021-03-19T12:14:51Z",
  "author": "adam-marshall",
  "summary": "ESPN Plus is the place to be to catch the much anticipated rematch",
  "article": [
    "Can Francis Ngannou prise Stipe Miocic's heavyweight belt away from him at the second attempt? We'll get an answer on Saturday, March 27, with this title fight rematch - the much-anticipated headline bout for UFC 260.",
    "Widely considered to be the greatest heavyweight in UFC history, firefighter-paramedic Miocic defeated the then up-and-coming Ngannou back in 2018 in a gruelling battle that went all the way, settled by a unanimous points decision.",
    "Ngannou has responded well to that setback, with “The Predator” scoring four consecutive first-round knockouts in his last four bouts, proving that he is more than earned the right to face Cleveland’s finest once more.",
    "The fight tops a stacked UFC 260 bill which also sees UFC featherweight champion Alexander “The Great” Volkanovski follow his back-to-back victories over Max Holloway with a defence of his crown against Brian “T-City” Ortega.",
    "Read on to discover how to order ESPN Plus's UFC PPV now and get prepared to watch eagerly-awaited Miocic vs Ngannou rematch at UFC 260.",
    "As well as all the action from UFC APEX in Las Vegas, a subscription to ESPN+ opens up access to exclusive live UFC Fight Nights, alongside original content including Dana White’s Contender Series, UFC Destined, and Ariel & The Bad Guy, plus classic fights, replays, and there’s also the perk of fewer adverts.",
    "Outside of UFC live streams and coverage, ESPN Plus continues to pick up loads of other great live sport action. Alongside top rank boxing, it also shows loads of European soccer, and even gets the odd NHL and NFL game. Considering you get the whole year for less than an effective $30 with the above bundle, it's hard to ignore the value."
  ],
  "headers": {
    "5": "What does a UFC fan receive with their ESPN+ subscription?"
  },
  "links": {
    "ESPN Plus's UFC PPV": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7593946000163715000&xs=1&url=http%3A%2F%2Fgo.web.plus.espn.com%2Fc%2F221109%2F718846%2F9070%3Fsharedid%3Dsponsored%26subId1%3Dtrd&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyou-can-now-order-ufc-260-to-watch-miocic-vs-ngannou-2-heres-how",
    "subscription to ESPN+": "https://go.web.plus.espn.com/c/221109/718846/9070?subId1=trd-us-1149527841290774900&sharedId=trd-us&u=https%3A%2F%2Fplus.espn.com%2Fufc%2Fppv",
    "UFC live streams": "https://www.techradar.com/news/ufc-live-stream-watch-fight-night-events-ppv-online-anywhere"
  }
}