{
  "source": "https://www.techradar.com/news/star-wars-the-bad-batch-is-worth-a-watch-even-if-you-didnt-see-the-clone-wars",
  "title": "Star Wars: The Bad Batch is worth a watch even if you didn't see The Clone Wars",
  "category": "entertainment",
  "updated": "2021-06-28T14:54:53Z",
  "author": "samuel-roberts",
  "summary": "Spoiler-free impressions of the new Star Wars animated series",
  "article": [
    "Order 66 is one of the darkest events in the Star Wars timeline – and Revenge of the Sith only really exposed you to the main beats of it. If you played 2019's video game Jedi Fallen Order, for example, it successfully captures the horror of watching the Clone army turn on the Jedi, and the shock of that event to survivors. There was definitely more to say about this grim period of Star Wars history.",
    "In The Bad Batch, a successor series to Star Wars animated favorite The Clone Wars, you're watching a squad of Clones try to figure out why their brothers just turned on their former allies. It's a whole show about the aftermath of Order 66, essentially, and what happens to the galaxy right after that – friends become enemies, and entire worlds are reshaped around them. The Empire as we know it is quickly emerging from the collapse of the Republic.",
    "Introduced in The Clone Wars, the Bad Batch – known as Clone Force 99 – is a set of modified Clone troopers who have been specially altered to have specialties in battle. Hunter, the bandana-wearing leader, has heightened senses – he's essentially the show's protagonist. Tech is a clever, fast-talking computer specialist with shades of C-3PO. Echo is a partly cybernetic soldier who can interact with computers, first introduced earlier in The Clone Wars' run. Crosshair is a dangerous and incredibly accurate sniper. Wrecker, meanwhile, the beefiest of the group, is the group's tank. Dee Bradley Baker, long-time voice actor behind all the Clones in Star Wars' animated series, plays all of the main characters.",
    "Watching this crew try and figure out exactly what happened with the invocation of Order 66 is some of the most compelling stuff in this opening episode. While the other Clones turn on the Jedi, the Bad Batch does not. The show successfully sells this idea that the Star Wars universe has changed around the characters almost overnight, and that the Emperor essentially stole his rule out from under the galaxy.",
    "You might think this makes the show an incredibly dark proposition overall, as the Bad Batch's former allies, the Jedi, are now being exterminated as a matter of policy. Well, the show has a way around that.",
    "Enter Omega, a young girl who lives among the clones on Kamino, and who exists to give the show a more youthful energy – she offers a way in for younger viewers, much as Ezra Bridger did in Rebels or Ahsoka Tano did at the start of The Clone Wars. Omega gives the show a bit of contrast, so you're not just watching a bunch of gruff soldiers voiced by the same (extremely talented) man trying to survive life in the galaxy. We'll let you learn more about Omega by watching the series.",
    "Based on this opening episode, The Bad Batch maintains an adventure-of-the-week plot structure, and tonally it doesn't go that dark. There are strong suggestions that the relationships between members of the Bad Batch are going to change over time, which could make for some compelling characterization along the way, and its producers are hoping the show will land a second season.",
    "While being a fan of The Clone Wars is a definite advantage in terms of knowing the characters and the deeper history of the Prequel Trilogy era, you don't need any of that baggage to enjoy The Bad Batch.",
    "It's worth saying, though, that it definitely feels like a continuation of that show – if Lucasfilm's CG series haven't grabbed you before, and you're a curious floating viewer who loved The Mandalorian, this is unlikely to change your mind. It's gunning for a broader audience in terms of age than Mando was, which informs some of the creative choices in the series. It feels like it could air on a Saturday morning, despite the grim overtones of the subject matter.",
    "Still, it's nice that newcomers can check this out and see if it's their thing. It is welcome to have more original Star Wars stuff to watch right now – because assuming we'll see the likes of Andor, The Mandalorian season 3 and Obi-Wan Kenobi hitting Disney Plus next year, this may be the last time Star Wars has a slightly quieter period in our lifetimes.",
    "Star Wars: The Bad Batch's first episode is available now on Disney Plus, with new episodes rolling out each Friday."
  ],
  "headers": {
    "3": "What comes after Order 66"
  },
  "links": {
    "Jedi Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series"
  }
}