{
  "source": "https://www.techradar.com/news/leaked-google-pixel-5a-renders-show-a-suspiciously-familiar-design",
  "title": "Leaked Google Pixel 5a renders show a suspiciously familiar design",
  "category": "phones",
  "updated": "2021-02-23T15:46:47Z",
  "author": "tom-bedford",
  "summary": "Is this the Pixel 4a 5G?",
  "article": [
    "The upcoming Google Pixel 5a is likely to be a budget take on the Pixel 5, so odds are it'll look a lot like the late-2020 flagship, as well as that device's contemporary doppelganger the Pixel 4a 5G. However, a new render suggests the phones could look less 'similar' and more 'absolutely identical'.",
    "These images come from phone leaker Steve Hemmerstoffer, or @Onleaks, who posted on their Voice profile some renders based on information they'd heard. There are also some specs attached, which we'll analyze.",
    "The images show a phone that looks near-identical to the Pixel 4a 5G with a black plastic rear, white power button, rear-mounted fingerprint sensor, squircle camera bump with two lenses, 'punch-hole' camera cut out in the screen for selfie camera and a 3.5mm headphone jack on the top edge of the device.",
    "The phone also looks similar to the Pixel 5, but that device had two design differences to the Pixel 4a 5G - it was made of metal, and it didn't have a 3.5mm headphone jack. According to Hemmerstoffer, the Pixel 5a is plastic.",
    "While we'd expect the Pixel 5a to look similar to the Pixel 5, we didn't think it'd look totally identical to an older Pixel phone, and we imagine someone walking into a phone shop would have trouble discerning the newer handset, without the names to help them.",
    "This suggests the Pixel 5a isn't going to bring many changes to the previous handsets.",
    "It's time to dive into the information Hemmerstoffer provides alongside the images.",
    "Apparently, the Google Pixel 5a will have the exact same screen as the Pixel 4a 5G - that is, a 6.2-inch Full HD+ display. Hemmerstoffer doesn't mention a refresh rate, but the Pixel 4a 5G was 60Hz.",
    "The other spec mentioned relates to the cameras, and supposedly these are identical to the Pixel 4a 5G (and Pixel 5) too. That would make them a 12.2MP main and 16MP ultra-wide camera.",
    "If these specs are true, there aren't any clear differences between this phone and Google's 5G cheap phone from 2020. If Hemmerstoffer's specs and details are exactly right, the Pixel 5a will be identical to the Pixel 4a 5G.",
    "Of course, in practice, Google wouldn't put out the same two phones twice, so there are likely some changes or improvements in areas that haven't been detailed yet. Perhaps the phone will have an improved processor, new camera sensors or a bigger battery.",
    "We'll have to wait for Google to unveil the Pixel 5a to find out for sure, and we don't know when that's going to happen just yet. We hope it's soon, though, to calm those clanging alarm bells around the phone."
  ],
  "headers": {
    "6": "Google Pixel 5a specs"
  },
  "links": {
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "@Onleaks": "https://twitter.com/OnLeaks",
    "Voice": "https://www.voice.com/post/@onleaks/exclusive-first-look-at-the-google-pixel-5a-1614036211-183558310"
  }
}