{
  "source": "https://www.techradar.com/news/intels-powerful-8-core-laptop-cpu-could-arrive-in-june-to-fight-back-against-ryzen-5000",
  "title": "Intel’s powerful 8-core laptop CPU could arrive in June to fight back against Ryzen 5000",
  "category": "computing",
  "updated": "2021-01-28T10:27:35Z",
  "author": "darren-allan",
  "summary": "XMG spills rumors on much anticipated Tiger Lake H45",
  "article": [
    "Intel’s Tiger Lake processors for laptops could get considerably beefier at the close of Q2 this year, as the already confirmed 8-core CPUs might be added to the current range then, going by the rumor mill.",
    "Intel has already said that such 8-core chips are in the pipeline, and as spotted by VideoCardz, a Reddit post from laptop maker XMG indicates that Tiger Lake H45 (with a TDP of 45W) – which will have 6 and 8-cores – will be out before the first half of 2021 comes to an end.",
    "In a broad supply forecast focused on AMD and Nvidia, the XMG representative also touched on Intel chips, saying: “The currently known XMG laptops (except CORE 14) will only be available with Tiger Lake once there is Tiger Lake H45 with 6 to 8 cores. The launch of H45 is currently not announced but rumored to be at the end of Q2 this year. We have plans to transition various XMG product families from Comet Lake to TGL H45 when the time comes.",
    "“On some families, AMD Cezanne [Ryzen 5000 mobile chips] and Intel Tiger Lake might be offered in parallel. But the exact plan (which SKU gets what and when) is not set in stone yet and currently too early to discuss.”",
    "So, this is clearly speculation as is underlined in the post, although other sources have already pinned a Q2 launch on the more powerful Tiger Lake laptop chips, namely Anandtech which reported that production and shipping will begin in Q1, and therefore the products are likely to be in notebooks come Q2.",
    "Late Q2 as this current rumor contends should mean June in theory, so that’s the date to tentatively mark in your calendar, but given the current climate and continued disruption to supply chains thanks to the pandemic, any intended release schedule is likely on pretty flexible ground, shall we say.",
    "As we’ve observed before, Intel’s quad-core Tiger Lake chips are already impressive, so the 8-core effort is much awaited – but with AMD just beginning to push out the initial Ryzen 5000 mobile chips for laptops, which improve considerably on the already excellent Ryzen 4000 offerings, Intel certainly needs a response.",
    "Incidentally, in that Reddit supply forecast, XMG let us know that its first laptops with Nvidia RTX 30 series GPUs will be arriving from early March, with the RTX 3070 and 3080 mobile variants inside portables first – and RTX 3060 equipped models following at the end of March. The laptop maker doesn’t currently know when the initial laptops with AMD Ryzen 5000H processors will be available.",
    "XMG observed: “We have very little visibility into how many AMD 5000 series CPU we will be able to ship to customers in the next 3 months.”"
  ],
  "headers": {
    "4": "Other sources"
  },
  "links": {
    "Intel’s Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake-announced-to-power-the-next-generation-of-laptops",
    "VideoCardz": "https://videocardz.com/newz/xmg-expects-intel-tiger-lake-h-8-core-to-launch-in-late-q2",
    "saying": "https://www.reddit.com/r/XMG_gg/comments/l64dgp/rtx_3000_and_ryzen_5000h_supply_forecast_for_xmg/",
    "Anandtech": "https://www.anandtech.com/show/16384/intels-8-core-mobile-tiger-lake-h-at-45-w-to-ship-in-q1",
    "As we’ve observed before": "https://www.techradar.com/news/year-in-review-how-intel-did-in-2020",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "RTX 3070 and 3080 mobile variants": "https://www.techradar.com/news/the-new-nvidia-rtx-mobile-gpus-are-here-and-we-put-them-to-the-test"
  }
}