{
  "source": "https://www.techradar.com/news/netflix-is-making-a-pokemon-tv-show-but-is-it-an-anime",
  "title": "Netflix is making a Pokémon TV show – but fans are unsure about it",
  "category": "entertainment",
  "updated": "2021-07-27T08:56:05Z",
  "author": "tom-power",
  "summary": "Netflix is gonna catch 'em all",
  "article": [
    "An original Pokémon TV show is reportedly in early development at Netflix, according to industry insiders.",
    "The claim comes via Variety, whose sources have alleged that a Pokémon TV series is in the works at the streaming giant.",
    "However, given how early it is in its development cycle, there's very little information about its plot, characters or how it'll tie into the wider Pokémon universe.",
    "While much of the project remains a secret, there are a couple of things that we do know about Netflix's Pokémon series.",
    "According to Variety, Lucifer co-showrunner Joe Henderson is attached to write and executively produce the TV show. Lucifer is one of Netflix's more popular TV shows, so installing Henderson as its Pokémon TV writer-producer is a smart move.",
    "As for whether Netflix's Pokémon project will be an anime or not, it isn't expected to be. Instead, Variety claims that the series will be live-action in much the same vein as 2019 Pokémon movie Detective Pikachu, which starred Ryan Reynolds as the titular character.",
    "Netflix's desire to produce a live-action Pokémon TV show isn't that surprising.",
    "The streamer has become the home for multiple Pokémon animated productions (both 2D and CGI), so it appears that Netflix wants to nail down its place as the go-to platform for Pokémon TV shows and movies – in the Western world, anyway.",
    "The decision to make a live-action Pokémon show will also help to differentiate Netflix's original Pokémon projects from the animated films and TV series that it airs through its licensing deal with The Pokémon Company. Making a live-action series instead of an animated one, then, seems like the right move to make.",
    "However, despite the global box office success of Detective Pikachu – the only live-action Pokémon production to date – fan reception to the Netflix Pokémon news has been mixed.",
    "Users on the Pokémon, Television and Netflix Reddit pages have been left divided by Variety's report, with some expressing happiness over the news while others have deep reservations about it.",
    "Our view? Netflix has done a good job with its other video game adaptations, such as Castlevania and The Witcher, regardless of whether they've been animated or live-action, so there's every chance that the streamer can do a similarly decent job with its Pokémon TV show.",
    "It'll have to get the style, tone and aesthetic right, though, to win over fans. We've recently seen how making changes to hugely popular series can cause a massive fan backlash (we're looking at you, He-Man).",
    "If Netflix hopes that its Pokémon TV series will be received well (or better), it has to do right by the franchise – or Pokémon fans, just like He-Man's fanbase, won't be happy."
  ],
  "headers": {
    "6": "Analysis: Pokémon fans are split over a potential Netflix live-action series"
  },
  "links": {
    "Variety": "https://variety.com/2021/tv/news/pokemon-netflix-series-live-action-joe-henderson-1235026390/",
    "some": "https://www.reddit.com/r/television/comments/os3d85/pokemon_liveaction_series_in_early_development_at/h6lx9ip/?utm_source=reddit&utm_medium=web2x&context=3",
    "expressing": "https://www.reddit.com/r/netflix/comments/os3eiq/pokemon_liveaction_series_in_early_development_at/h6mbh43/?utm_source=reddit&utm_medium=web2x&context=3",
    "happiness": "https://www.reddit.com/r/pokemon/comments/os5938/netflix_is_making_a_pokemon_live_action_series/h6metjv/?utm_source=reddit&utm_medium=web2x&context=3",
    "have": "https://www.reddit.com/r/pokemon/comments/os5938/netflix_is_making_a_pokemon_live_action_series/h6mcdg6/?utm_source=reddit&utm_medium=web2x&context=3",
    "deep": "https://www.reddit.com/r/television/comments/os3d85/pokemon_liveaction_series_in_early_development_at/h6m04b8/?utm_source=reddit&utm_medium=web2x&context=3",
    "reservations": "https://www.reddit.com/r/netflix/comments/os3eiq/pokemon_liveaction_series_in_early_development_at/h6mo97c/?utm_source=reddit&utm_medium=web2x&context=3",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "He-Man": "https://www.techradar.com/news/netflixs-he-man-reboot-has-been-panned-by-fans-and-its-creator-isnt-happy"
  }
}