{
  "source": "https://www.techradar.com/news/stuck-in-cyberpunk-2077-because-of-a-new-bug-cd-projekt-red-might-have-a-fix-for-you",
  "title": "Stuck in Cyberpunk 2077 because of a new bug? CD Projekt Red might have a fix for you",
  "category": "gaming",
  "updated": "2021-01-25T22:52:28Z",
  "author": "nick-pino",
  "summary": "The latest patch broke the main quest line, but CD Projekt Red has a quick fix for it",
  "article": [
    "After this weekend’s Cyberpunk 2077 1.1 patch helped fix a number of stability issues, players have now begun to report that it’s broken the main plot line – specifically around the quest Down on the Street.",
    "According to those players on Reddit and later confirmed by the game’s developer, CD Projekt Red, the quest breaks when V receives a holocall from Takemura… who just stares at you and doesn’t say anything.",
    "If that’s happening to you, it might feel like you’re stuck, but according to CD Projekt Red there are a few quick fixes you can use to get around the bug while you wait for a proper hotfix.",
    "Here’s how to unbreak the game:",
    "Cyberpunk 2077's launch has been a mess. It was so bad, in fact, that it's led to a class-action lawsuit against the publisher and caused a slew of gamers to ask for a refund on every platform the game's available on.",
    "Today's new glitch is certainly annoying, but it's also pretty innocuous – and with the above fix, hopefully harmless.",
    "You can't fault the studio much for deploying a patch that it believed would improve stability only to find a new flaw in the game – ask any coder and they'll tell you that fixing one error usually causes two more to pop up in their place.",
    "The developer says it will be working on another patch, version 1.2, and says it will be squashing more bugs in the near future as they arise.",
    "Via Eurogamer"
  ],
  "headers": {
    "4": "Two steps forward, one step back"
  },
  "links": {
    "Cyberpunk 2077 1.1 patch": "https://www.techradar.com/news/cyberpunk-2077-gets-patch-v11-on-pc-and-consoles-but-some-gamers-arent-happy",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-01-25-cyberpunk-2077-players-report-1-1-patch-adds-game-breaking-bug"
  }
}