{
  "source": "https://www.techradar.com/news/netflix-sets-a-release-date-for-seinfeld-its-replacement-for-friends-and-the-office",
  "title": "Netflix sets a release date for Seinfeld, its replacement for Friends and The Office",
  "category": "entertainment",
  "updated": "2021-09-01T15:09:23Z",
  "author": "axel-metz",
  "summary": "180 episodes about nothing",
  "article": [
    "Sitcom fans, rejoice! Netflix has found its latest bumper-sized series to prop up your TV bingeing habits for the remainder of 2021.",
    "All 180 episodes of Seinfeld, the classic 1990s series created by Jerry Seinfeld and Larry David, are hitting the streamer on October 1.",
    "The show will seemingly be available on Netflix platforms globally, which will come as great news to subscribers in the US frustrated by the recent departures of popular sitcoms Friends and The Office (both are still available on Netflix UK, mind).",
    "First premiering in July 1989, Seinfeld ran for nine seasons on US network NBC before concluding in 1998. Netflix acquired the rights to the show back in 2019, though it was streaming on Hulu between 2015 and June 2021. Since then, the series hasn’t been available to watch on any streaming services.",
    "Seinfeld follows the fictional exploits of the titular Jerry Seinfeld, who stars alongside friends Elaine (Julia Louis-Dreyfus), Kramer (Michael Richards) and George (Jason Alexander) as they navigate life in New York City.",
    "If you've never seen it, the show’s premise bears obvious resemblance to Friends on paper, but it's a wildly different series in its darker tone and content. Seinfeld arrived first, and is often regarded as one of the greatest and most influential sitcoms of all time.",
    "It’s also famously known as “a show about nothing,” propped up by Seinfeld’s stand-up comedy and the awkward humor of co-creator Larry David.",
    "Like Friends, Seinfeld boasts hundreds of short-run episodes that can be binged en masse. By our count, getting through all 180 would take roughly 66 hours (each is around 22 minutes) – which works out to about three episodes per hour.",
    "The show is also known for influencing much newer sitcoms like It's Always Sunny in Philadelphia, Arrested Development and, more obviously, Curb Your Enthusiasm, which was also created by David.",
    "All episodes of Seinfeld will be available to stream on Netflix worldwide from October 1."
  ],
  "headers": {},
  "links": {
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare"
  }
}