{
  "source": "https://www.techradar.com/news/apple-tv-finally-comes-to-android-tv-and-nvidia-shield",
  "title": "Apple TV finally comes to Android TV and Nvidia Shield",
  "category": "televisions",
  "updated": "2021-06-02T10:09:57.278Z",
  "author": "axel-metz",
  "summary": "Apple and Android unite… sort of",
  "article": [
    "Google has confirmed that both the Apple TV app and Apple TV Plus service are now available on all Android TV devices.",
    "The announcement followed confirmation from Nvidia that the Apple TV app has also landed on Nvidia Shield, along with 4K, Dolby Vision and Dolby Atmos support.",
    "The app was initially restricted to Sony Bravia TVs and Chromecast with Google TV, but Google has confirmed that Apple TV and its streaming service are now available for the “entire Android TV OS ecosystem,” from Hisense to TCL.",
    "The app now appears in the Play Store and can be installed immediately on any Android TV device based on Android 8.0 Oreo or higher, Google clarified to 9to5Google.",
    "The news marks a big step for Apple TV, which began life as a service exclusive to Apple devices before steadily being expanded to other platforms like Amazon's Fire OS, LG's webOS and newer PlayStation and Xbox consoles.",
    "Many television manufacturers at various price points currently use Android TV for their smart TVs – including Sony, Xiaomi, Realme, TCL, Vu and OnePlus – so Google’s announcement is a welcome one, especially for customers in India, where Android TV is particularly popular.",
    "The likes of Netflix, Amazon Prime Video and Disney Plus are all already available on the Android TV platform, and so Apple’s willingness to embrace its long-time competitor in Google suggests an attempt to be considered a serious streaming service provider among its more established streaming rivals.",
    "Apple TV’s expansion to Android TV devices coincides with an impressive rollout of new content for its Apple TV Plus subscription service.",
    "Joining critically acclaimed original shows like The Morning Show in the coming weeks is the anticipated second season of Ted Lasso, alongside new episodes of Home Before Dark and Central Park.",
    "All-new series like Lisey’s Story and Physical, which star Julianne Moore and Rose Byrne, respectively, are also set to hit the streamer imminently, marking a clear statement of intent for Apple against the big-budget successes of Netflix and Amazon Prime Video of late.",
    "So, could Apple’s newfound ties to Android bear fruit for its streamer in the coming months? Only time will tell – but maybe it's best to keep your enemies close, after all.",
    "Via 9to5Google"
  ],
  "headers": {
    "7": "‘Tis the season"
  },
  "links": {
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "Nvidia Shield": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "confirmed": "https://9to5google.com/2021/06/01/apple-tv-android-tv-app/",
    "9to5Google": "https://9to5google.com/2021/06/01/apple-tv-android-tv-app/",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "second season of Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know"
  }
}