{
  "source": "https://www.techradar.com/news/the-morning-show-season-2-is-making-the-same-mistake-as-so-many-great-tv-shows",
  "title": "The Morning Show season 2 is making the same mistake as so many great TV shows",
  "category": "entertainment",
  "updated": "2021-09-29T17:00:52Z",
  "author": "henry-st-leger",
  "summary": "Opinion: Mourning the Morning Show",
  "article": [
    "There are spoilers for the second season of The Morning Show throughout this article. Read at your peril!",
    "The Morning Show season 2 is here – and even in its opening two episodes, it’s clear that the Apple TV Plus darling is tripping up in an all-too familiar way.",
    "Billed as the flagship show for Apple’s streaming platform when it first launched back in 2019, in what was until recently a very thin catalogue of programming, The Morning Show had a lot of responsibility to perform – but perform it did.",
    "The ensemble drama series took big-name stars like Jennifer Aniston (Friends), Reese Witherspoon (Legally Blonde), Steve Carell (The Office) and Mark Duplass (Safety Not Guaranteed) and put them in the midst of a morning news television show rocked by a sexual misconduct scandal. But with a firm handle on such a sensitive topic, and the complex lattice of personal and professional relationships that arises in large media organizations, this #MeToo inspired-show navigated the quagmire of consent and assault in a truly powerful way.",
    "Some accent work by Reese Witherspoon aside – alongside an ‘Irish’ bartender she encounters midway through the season – the acting is exceptional, with Jennifer Aniston particularly putting in a career-best performance as Morning Show co-host Alex Levy. Supporting performances from Néstor Carbonell (Lost) as an emotive weatherman, Bel Powley as a production assistant romantically involved with him, or Karen Pittman as the show’s weary producer, all help to elevate The Morning Show above the by-the-numbers ‘scandal’ drama it could have been.",
    "But it’s the success of the first season, and the incredible work done by its cast, that has backed The Morning Show into a corner – keen to keep its key cast members onscreen long after the denouement of its first season.",
    "The start of season 2 spends a lot of time moving cast members into their proper places, even if that means undoing or contradicting their character arcs so far. Aniston’s Alex Levy opens the season in isolation, writing a memoir of her career shortly after exploding it with a confessional broadcast on The Morning Show’s misconduct cover-ups.",
    "But instead of focusing on the experience of being ‘on the outside’ of the media machine, or the journey of writing this tell-all book, we catch up with Alex after all this is over – and as she’s speedily convinced to return to her old position at UBA.",
    "We immediately see the same character conflicts from the previous season return, overshadowing the more interesting narrative directions that a second season could have taken. Alex and her old co-host Bradley yell at each other with distrust, as scorned colleague Daniel firmly lays out the wrongs Alex did to him. Mark Duplass’ producer Charlie Black, seemingly so happy in his new job and relationship, is also promptly brought back into the UBA fold, dredging up season one’s best arcs and refusing to let them move on.",
    "It’s an all-too common problem for successful TV shows, which feel the pressure of consistency while moving the story forward – often with actor contracts to grapple with. (Oscar Isaac’s Poe Dameron was intended to die after Star Wars: The Force Awakens, but by his own admission it sounds like plans changed after he fought for his appearance in later films.)",
    "We saw the same issue in Halt and Catch Fire, a stunning character study that follows the intertwining lives of those at the heart of technological change, from portable computing to the world of online gaming. The core trio of Lee Pace, Mackenzie Davis and Scoot McNairy are electrifying to watch in the first season, but even as these characters split apart, so too are they forced back into proximity through unlikely connections in the next businesses they end up working at.",
    "The show’s writers want to move each person’s arc forward, but insist on keeping tried-and-tested character dynamics in play too.",
    "So too in the sitcom Scrubs, which went out with a whimper in season 9, having had the bold vision of a new generation of trainee doctors to follow, while cramming in almost every Scrubs regular from previous seasons – leaving no oxygen for new, interesting ideas.",
    "When it comes to The Morning Show season 2, this may feel like preemptive criticism – after all, there are another eight episodes where we could see a course-correct. The show following Steve Carell, as he attempts to lay low after being publicly outed as an abuser, is already the most fascinating thing in it – what can possibly come after that?",
    "The spectre of the Covid-19 pandemic, too, appears to be seeping into events, with word of a virus outbreak in China appearing early on in the season, and an ominous sneeze closing the second episode as 2020 comes into view. And the strong screenwriting that elevated the first season is still on show, with dialogue that’s by turns cutting and obtuse, as the sleek veneer of the media machine comes in and out of view, veiling and unveiling the emotions of those caught up in it.",
    "I'm keen to see how The Morning Show plays out – but after such an excellent first season, I'm already disappointed by the long shadow it casts over its successor."
  ],
  "headers": {
    "6": "Never let me go"
  },
  "links": {
    "after he fought for his appearance in later films": "https://www.cinemablend.com/news/1726099/why-poe-dameron-wasnt-killed-off-in-force-awakens-according-to-oscar-isaac"
  }
}