{
  "source": "https://www.techradar.com/news/the-cheapest-ssd-right-now-per-unit-storage-is-shockingly-an-m2-pcie-model",
  "title": "The cheapest SSD right now per unit storage is shockingly an M.2 PCIe model",
  "category": "computing",
  "updated": "2021-03-17T09:51:18Z",
  "author": "desire-athow",
  "summary": "Setting a new low in SSD price",
  "article": [
    "2021 will be remembered as a watershed year for storage technology as M.2 SSD takes over from SATA units, sending them into oblivion. Now, one such SSD has taken the crown of the cheapest solid state drive per unit storage.",
    "Timetec may not be a household brand but is in fact a Liteon OEM - the latter being a Kioxia brand, formerly known as Toshiba Memory. So far from being a no-name entity, it is actually far more reputable and reliable than many of the lesser-known brands.",
    "Data compiled by e-commerce monitoring platform Dealavo shows that Timetec has the cheapest Terabyte price at $82.28 ($78.99 for the 960GB model), followed by Teamgroup and Asenno.",
    "M.2 are physically very different from older SSDs which inherited their form factors from 2.5-inch hard disk drives - with this model just 110mm long.",
    "The drive is a 960GB M.2 2280 SSD that uses the Marvell controller, 3D NAND TLC components and is backed by a three-year warranty.",
    "What that means is that the endurance of this SSD is probably better than any QLC-based parts. Timetec quotes a staggering 1367TBW (Terabyte Written) which means that the drive can in theory be entirely rewritten more than 1,400 times.",
    "Other notable features include a three-year warranty, Static and Dynamic Wear leveling, Bad Block and low power management as well as TRIM support. Timetec quotes a sequential read speed of up to 1700MB/s and a sequential write speed of up to 750MB/S with random read/writes hitting 460,000 IOPS and 60,000 IOPS respectively",
    "As always, we recommend that you get a cloud storage solution to backup your files as well as a hard drive protection plan and a data recovery service for external hard drives. These may add up to the price of the drives but like insurance, it is better to be safe than sorry."
  ],
  "headers": {
    "4": "Endurance"
  },
  "links": {
    "Dealavo": "https://dealavo.com/en/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}