{
  "source": "https://www.techradar.com/news/fastly-ceo-says-some-websites-are-still-suffering-from-major-outage",
  "title": "Fastly counts costs of massive CDN failure as traffic drops bites hard",
  "category": "computing",
  "updated": "2021-08-11T17:20:41Z",
  "author": "abigail-opiah",
  "summary": "June 2021 outage negatively impacts Fastly Q2 2021 results",
  "article": [
    "Fastly CEO Joshua Bixby has revealed that the June 2021 outage that affected websites across the world had a long-lasting impact on some of its customers.",
    "Bixby added on the company's Q2 2021 earnings call that \"a couple\" of the CDN company's other customers had \"not yet returned traffic back to the platform post outage.\"",
    "However he added that company engineers were able to return \"95 per cent of our network to normal within 49 minutes.”",
    "Bixby added that the outage had, perhaps unsurprisingly, impacted the company's Q2 results significantly.",
    "\"Given the usage-based nature of our business model, this resulted in an impact to our Q2 results, and we expect to see some downstream impact on revenue from the outage in the near to medium term as we work with our customers to bring back their traffic to normal levels.\"",
    "\"That being said, our customers were negatively impacted. As a result, we saw traffic volumes decrease and subsequently issued credits to select customers following the incident,\" Bixby told attendees.",
    "During the call, he noted the company is expecting to see some downstream impact on revenue from the outage in the near to medium term as it works to bring back its customers' traffic to normal levels.",
    "When the outage occurred, some websites were able to restore services faster than others by switching to failover systems, but many were offline for long periods of time.",
    "The outage was caused by an undiscovered software bug that was triggered by a valid customer configuration change.",
    "The affected websites and services included top sites such as Amazon, eBay, PayPal, Reddit, Twitch - and even TechRadar.",
    "CORRECTION: This story has been amended to clarify a prior confusion about whether a top 10 customer had left Fastly or had simply reduced its usage of its CDN.",
    "Via The Register"
  ],
  "headers": {
    "3": "Fastly outage"
  },
  "links": {
    "Fastly": "https://www.techradar.com/reviews/fastly",
    "June 2021 outage": "https://www.techradar.com/news/mega-internet-outage-was-caused-by-a-simple-software-bug",
    "earnings call": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8889505591852110000&xs=1&url=https%3A%2F%2Fwww.fool.com%2Fearnings%2Fcall-transcripts%2F2021%2F08%2F05%2Ffastly-inc-fsly-q2-2021-earnings-call-transcript%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ffastly-ceo-says-some-websites-are-still-suffering-from-major-outage",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "The Register": "https://www.theregister.com/2021/08/05/fastly_ceo_outage/"
  }
}