{
  "source": "https://www.techradar.com/news/watchos-74-news",
  "title": "watchOS 7.4 release date, compatibility and every new feature on your Apple Watch",
  "category": "wearables",
  "updated": "2021-04-27T10:47:00Z",
  "author": "david-lumb",
  "summary": "The next update is here",
  "article": [
    "You can now download the watchOS 7.4 update onto your Apple Watch, as Apple is rolling out the new smartwatch software to all its compatible devices (check our list below to see if your device is included).",
    "We've detailed all the new watchOS 7.4 features below, along with those found in watchOS 7.3, 7.2, and 7.1, but it's the main watchOS 7 update that was the latest major one.",
    "WatchOS 7 was rolled out just after the launch of the Apple Watch 6 and Apple Watch SE, though you don't need these new smartwatches to use the software - loads of people with older devices can make the most of the new operating system and all its cool features.",
    "With watchOS 7 there are loads of new features like sleep tracking, automatic hand washing detection, and lots of new watch faces. And while watchOS 7.1, 7.2, 7.3, and 7.4 aren't quite as big, they also add significant new features - like the ability to unlock your iPhone while wearing a mask.",
    "We've got a full list of all the watchOS 7 through 7.4 features below that you can check out while the update downloads.",
    "WatchOS 7 itself landed on Wednesday, September 15, 2020. Even though the iPhone 12 range landed late, the software updates were right on time.",
    "Since then several smaller updates have landed, and at the time of writing we're up to watchOS 7.4, which is available now, but you'll need to get iOS 14 (and ideally iOS 14.5) first to be able to download it.",
    "WatchOS 7 (as well as all the 7.x updates including watchOS 7.4) is compatible with the Apple Watch 6, Apple Watch SE, Apple Watch 5, Apple Watch 4, and Apple Watch 3.",
    "Yes, sadly, that means the Apple Watch 2 and Apple Watch Series 1 owners are out of luck. Original Apple Watch owners missed out on the watchOS 6 update, and now we have a new threshold for devices that can upgrade to the latest watchOS.",
    "Further down you'll find a deep dive into the many features offered by watchOS 7, but there are some even newer things, courtesy of watchOS 7.4, watchOS 7.3, watchOS 7.2, and watchOS 7.1.",
    "With watchOS 7.4 the big change is the ability to unlock your iPhone while wearing a mask, without resorting to a passcode. That might sound like an iPhone feature, but it's powered by Apple Watch - so you need to be wearing your Apple Watch at the time, then just attempt to use Face ID with a mask on, and your iPhone should unlock.",
    "Other updates in watchOS 7.4 include the ability to stream audio and video content from Apple Fitness Plus to an AirPlay 2-enabled device, and for Apple Watch users in Australia and Vietnam to use the ECG app and get irregular heart rhythm notifications.",
    "With watchOS 7.3, Apple added Time to Walk to the Apple Watch. The feature lets you listen to a celebrity guest tell inspiring stories while you walk. Each episode has a different guest, and also includes three songs that inspire them. The feature is also available to wheelchair users as 'Time to Push'.",
    "This is only available to Apple Fitness Plus subscribers, and it contains a growing number of 25-40-minute episodes.",
    "WatchOS 7.3 also included a Unity watch face to celebrate Black history. There's also a watchOS 7.3.1, 7.3.2, and 7.3.3, but these mostly just include bug and security fixes.",
    "While Apple Fitness Plus was announced with watchOS 7, it wasn't actually launched until watchOS 7.2. So that's the biggest update here - you can find more in-depth details about it further down under the watchOS 7 features, or check out our full Apple Fitness Plus guide.",
    "WatchOS 7.2 also added the option to be notified when your cardio fitness is at a low level, more tools for reviewing your cardio fitness level in the Health app, an atrial fibrillation classification for heart rates above 100 BPM in the ECG app, and support for braille displays with VoiceOver.",
    "WatchOS 7.1 is an update that's primarily focused on bug fixes - for example, there's a fix for a bug that prevented some users from unlocking a Mac with an Apple Watch.",
    "However, watchOS 7.1 does also add a new feature in the form of notifications of when your headphone audio level could impact your hearing.",
    "And if you happen to be in South Korea or Russia, you'll also benefit from ECG support and irregular heart rhythm notifications - two things that much of the world already had.",
    "WatchOS 7 gets refined complications, allowing devs to enable multiple complications and watch faces. You can create your own custom selection, for example a 'surf watch' with beachside conditions, to make your ideal watch face.",
    "WatchOS 7 also makes it easier to share your watch faces via a new feature, Face Sharing. When you see a watch face you like, click the button prompt below it and the face will download – and you'll be prompted to download any missing complications.",
    "The Health app has finally added a long-requested sleep-tracking feature. This includes Wind Down, which allows you to create a personalized routine to get you to sleep, with options such as whether to wake up via audio tones or haptic vibration for a quieter and more personal alarm. WatchOS 7 tracks sleep with some informed help from on-device machine learning, and feeds that info into the updated Health app on a paired iPhone.",
    "Yes, just like in iOS 14, watchOS 7 includes cycling directions in the Maps app. This includes elevation changes and navigation prompts with large, easy-to-read complications, which are granular enough to tell you about upcoming elevation changes or other trip disruptions.",
    "The app can even suggest you alter a trip yourself – for instance, advising you to dismount and walk the bike or take a set of stairs to save time. You can customize your trip, too, to avoid elevation change or to take the most direct route, hills be darned.",
    "Apple Fitness Plus is a new service that works directly through Apple Watches. It's located in the Fitness app and didn't actually launch until watchOS 7.2, though it was announced with watchOS 7.",
    "Apple Fitness Plus is a collection of workouts that you can watch on your iPhone, iPad, or Apple TV – and while you're exercising, you can see all your fitness data collected by your Apple Watch up on the screen.",
    "New workouts come every week from a series of instructors that teach alongside a variety of workout music styles, like Hip Hop, Country and R&B.",
    "Workouts got an upgrade with watchOS 7 too, with Dance added as a total body workout. Dance will track four of the most popular (and broadly-defined) dance styles: Bollywood, cardio dance, hip hop, and Latin.",
    "How? The Watch combines data from heart rate sensor, accelerometer and gyroscope to measure exertion while moving arms and legs. That's not all: there are a few other new workout modes, including core training, functional strength training, and even cool-downs for winding down your exercise sessions. You can track all this in the redesigned Activity app – which will now be called Fitness – in iOS 14.",
    "Family Set Up allows users to route several Apple Watches through a single phone, letting parents set up their kids' smartwatches without needing a separate iPhone. Parents can also set up movement goals and track their kids' locations.",
    "Only cellular Apple Watch models can link up to Family Setup, and the feature doesn't work in all countries so far, but will likely be expanded to more regions going forward.",
    "Apparently some of you haven't been washing your hands enough! watchOS 7 comes with automatic handwashing detection, which uses machine learning and audio cues to measure whether you wash your hands for a full 20-second timer, with fun sounds to ensure you’re washing for long enough.",
    "Better still, your handwashing data is fed into the iPhone's Health app, which will show the frequency and duration of washing your hands. Not only are your Apple Watch + iPhone paying attention – the Health app will also provide information on the importance of handwashing. Those of you who haven't been, perhaps it's time to learn.",
    "While watchOS 6 introduced the Noise app to notify users when their surroundings were loud enough to endanger their hearing, watchOS 7 is expanding the app's functionality to notify users when they've exceeded safe levels of media listening through headphones.",
    "That's around 80 decibels for about 40 hours per week, according to the World Health Organization – exceed that, and your Apple Watch will warn you about it. The Health app on the iPhone will also track how long you've been exposed to high decibel levels over the week (that's also where users can control the maximum audio level for headphone volume). In accordance with Apple's privacy attitude, none of this audio data is saved or recorded by the Health app or your Apple Watch.",
    "With watchOS 7, Apple Watches can now use Siri to handle translation, dictation through the Apple Neural Engine, and even use the voice assistant to audibly speak messages via the Announce Messages feature."
  ],
  "headers": {
    "5": "watchOS 7.4 release date and availability",
    "7": "Can your Apple Watch get watchOS 7.4?",
    "9": "watchOS 7.4 features",
    "12": "watchOS 7.3 features",
    "15": "watchOS 7.2 features",
    "17": "watchOS 7.1 features",
    "20": "Streamlined complications",
    "22": "Sleep tracking at last",
    "23": "Maps: cycling options and more",
    "25": "Apple Fitness Plus",
    "28": "Workouts: dance and cooldowns",
    "30": "Family Set Up",
    "32": "Handwashing",
    "34": "Hearing",
    "36": "Siri on-device"
  },
  "links": {
    "watchOS 7.4": "https://www.techradar.com/news/watchos-74-update-brings-new-health-fitness-and-security-features",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "get iOS 14": "https://www.techradar.com/how-to/how-to-get-ios-14-iphone",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "Apple Watch 2": "https://www.techradar.com/reviews/wearables/apple-watch-2-1323213/review",
    "watchOS 6": "https://www.techradar.com/news/watchos-6-release-date",
    "courtesy of watchOS 7.4": "https://www.techradar.com/news/watchos-74-update-brings-new-health-fitness-and-security-features",
    "Time to Walk": "https://www.techradar.com/news/apple-time-to-walk-lets-you-take-a-stroll-with-a-new-celebrity-guest-every-week",
    "Apple Fitness Plus guide": "https://www.techradar.com/news/apple-fitness-plus",
    "WatchOS 7.1": "https://www.techradar.com/news/apple-watchos-71-has-landed-and-heres-what-it-brings-to-your-apple-watch"
  }
}