{
  "source": "https://www.techradar.com/news/nvidia-rtx-3070-ti-vs-rtx-3080",
  "title": "Nvidia RTX 3070 Ti vs RTX 3080",
  "category": "components",
  "updated": "2021-06-12T13:00:33Z",
  "author": "john-loeffler",
  "summary": "Bridging the gap or falling short?",
  "article": [
    "With the Nvidia GeForce RTX 3070 Ti now on sale, many gamers want to know whether to go for this new Nvidia Ampere card or to just bite the bullet and go for the RTX 3080. When comparing the RTX 3070, RTX 3070 Ti and RTX 3080 cards, the RTX 3070 Ti falls right in the middle in terms of price, so the issue is whether the RTX 3070 Ti's performance makes a commensurate increase in performance to make it worth buying.",
    "All of this, of course, assumes that everything in the graphics card market stabilizes, stock for both the RTX 3070 Ti and RTX 3080 becomes widely available, and the prices of both subsequently comes down. Until then, most of us are probably just looking for whatever graphics card we can get our hands on without paying the incredibly high markups charged by eBay and StockX profiteers.",
    "So, let's dig into the RTX 3070 Ti vs the RTX 3080 and see how the two cards stack up in terms of price and performance to find out which is the best graphics card to buy for your budget.",
    "Price wise, the RTX 3070 Ti falls right between the RTX 3070 and the RTX 3080, starting at $599 / £529 / AU$979 for the Founders Edition. Generally speaking, aftermarket cards from MSI, EVGA, Asus, and the rest are going to be more expensive.",
    "The RTX 3080 meanwhile starts at $699 / £649 (around AU$1,050). The RTX 3070, meanwhile, starts at $499 / £469 / AU$809 for the Founders Edition.",
    "Assuming you can get any of these cards at these prices, the RTX 3070 Ti is definitely less expensive and even with the inflated prices for graphics cards right now, it's still likely to be cheaper than a comparable RTX 3080 wherever you find it.",
    "The real key here is what you get for the money, and in this case, we still have to say that the RTX 3080 is the better value, even if it is $100 / £60 / about AU$200 more expensive.",
    "Here's what the RTX 3070 Ti is working with:",
    "The RTX 3080, meanwhile, has some very important upgrades over the RTX 3070 Ti:",
    "Between the two cards, the RTX 3080 has 2,560 more CUDA (Compute Unified Device Architecture) cores than the RTX 3070 Ti. This is easily the biggest advantage of the RTX 3080, since CUDA cores are what do all the graphics processing.",
    "CUDA cores break down the various tasks required to render a frame, like lighting, geometry, etc., and works on these tasks in parallel, stitching it all together in the end to draw a frame onto the video output for the card. The more CUDA cores the card has, the faster it can churn out frames which in turn gives a better frames per second while gaming or doing other, similar graphics intensive tasks.",
    "What's more, the RTX 3080 has an additional 2GB GDDR6X VRAM, which means it can load more textures, models, or other data needed to process graphics directly into memory, which in turn gives all those CUDA cores what they need to work with quicker.",
    "Speaking of quicker, the RTX 3080 also has a 320-bit memory bus compared to the RTX 3070 Ti's 256-bit memory bus, which means that the RTX 3080 is also going to transfer data more data per cycle to and from memory than the RTX 3070 Ti. This is going to keep things running much more smoothly for the CUDA cores as they're working, which boosts performance even further.",
    "Where the RTX 3070 Ti does have a bit of an advantage is that it's clock speeds are slightly higher, but it simply isn't fast enough to come close to competing with the extra 2,560 CUDA cores on the RTX 3080. The RTX 3080 just zergs the hell out of whatever you throw at it, so clock speed isn't nearly as much of a factor here.",
    "Now, the RTX 3070 Ti isn't supposed to be improving on the RTX 3080 (that would be the RTX 3080 Ti), but the RTX 3070 Ti is supposed to partially bridge the gap between the RTX 3070 and RTX 3080, so how well does it do that? Not very well, honestly. As we discuss in our RTX 3070 Ti vs RTX 3070 deep dive, the RTX 3070 Ti's performance isn't all that much better than the RTX 3070's, especially when it comes to high-performance graphics like 1440p and 4K gaming.",
    "Obviously, the RTX 3070 Ti gets you closer on paper to the RTX 3080 in terms of performance, but we're not talking about a huge bump in performance here. Most gamers likely won't notice the difference at 1440p - or even at 1080p on ultra settings with ray tracing turned on.",
    "The RTX 3070 is a good bit cheaper than the RTX 3080, so the lower performance of the RTX 3070 isn't as much of a loss when you consider what you save on price. That just isn't the case with the RTX 3070 Ti. The performance is slightly better, but it's also much more expensive, so you're not getting enough of a performance boost to justify the price you're paying over the RTX 3070.",
    "If you're willing to spend the extra $100 / £60 / $170 for an RTX 3070 Ti over what you'd pay for the RTX 3070, you might as well double that and go with a graphics card that where you will absolutely see a performance increase that justifies the price increase. It's the difference between getting great 1440p gaming and great 4K gaming.",
    "The only way we'd recommend against going for the RTX 3080 is if you really are on a very strict budget and $599 / £529 / AU$979 is the absolute max you're willing to pay for a new graphics card. If that is the case, we'd recommend just going with the RTX 3070 and use that extra money saved for a night out with friends or to upgrade an older gaming peripheral. Bottom line, the RTX 3070 Ti just doesn't make much sense at this price."
  ],
  "headers": {
    "3": "Nvidia RTX 3070 Ti vs RTX 3080: price",
    "7": "Nvidia RTX 3070 Ti vs RTX 3080: specs",
    "16": "Nvidia RTX 3070 Ti vs RTX 3080: which one should you buy?"
  },
  "links": {
    "Nvidia GeForce RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "best graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti"
  }
}