{
  "source": "https://www.techradar.com/news/hp-adds-latest-intel-hardware-to-its-new-chromebooks-for-business",
  "title": "HP adds latest Intel hardware to its new Chromebooks for business",
  "category": "computing",
  "updated": "2021-05-25T14:54:13Z",
  "author": "mayank-sharma",
  "summary": "The new Chromebooks lineup include enterprise variant",
  "article": [
    "HP has taken the wraps off its newest Chromebooks, powered by Intel’s 11th Gen Tiger Lake processors.",
    "The HP Pro c640 Chromebook G2 is available in two variants, one of which is meant for business users and includes the Chrome Enterprise Upgrade for enhanced security and simplified device management.",
    "In its release announcement, HP contends that pairing the newest Intel processors with their lightweight Chromebooks, helps users keep pace with the evolving, predominantly remote, work environment.",
    "“Our newest Chromebook is purpose-built to help people get work done, delivering productive and collaborative experiences for working around the home, in the office, or on-the-go,” said Maulik Pandya, Vice President and General Manager of Cloud Client Group, HP Inc.",
    "The c640 Chromebook G2 starts with a 14-inch HD or an optional FHD display that also comes in a touchscreen variant.",
    "HP hasn’t yet revealed the exact Tiger Lake processors that will be offered with the c640, but does mention that they’ll be available with up to 16GB RAM and 256GB SSD. For connectivity, the devices use WiFi 6.",
    "To highlight their portable nature, HP says the Chromebook measures less than 16.5 mm at the hinges and has been benchmarked by the company to deliver 12.5 hours of battery life. Furthermore, the laptops can leverage HP Fast Charge technology and can get up to 90% battery life in just 90 minutes.",
    "The c640 G2 Chromebook is available in two trims. The base variants start at $419, while the Enterprise variants have a starting price of $569."
  ],
  "headers": {
    "4": "Enterprise edition"
  },
  "links": {
    "HP": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710",
    "Chromebooks": "https://www.techradar.com/news/cheap-chromebook-deals"
  }
}