{
  "source": "https://www.techradar.com/news/new-apple-pencil-leak-shows-off-the-upcoming-ipad-pro-2021-accessory",
  "title": "iPad Pro 2021's Apple Pencil accessory leaked, and it's different to the last-gen stylus",
  "category": "tablets",
  "updated": "2021-12-04T04:09:21Z",
  "author": "james-peckham",
  "summary": "Some minor changes for the stylus",
  "article": [
    "The Apple Pencil is a must-have accessory for some iPad users, and it seems Apple may be redesigning the version of the stylus that you'll be able to buy alongside the rumored iPad Pro 2021.",
    "According to photos provided by Twitter leaker Mr White, the iPad Pro 2021 will have an option of the Apple Pencil pictured below. There are a few minor changes you can expect from this stylus, but you may not spot them when you first look at the photo.",
    "Unlike the last-gen Apple Pencil, the design seems to have a glossy finish. The latest version of Apple's stylus has a matte look, but it otherwise has a similar design with a slim look like what is spotted in the picture.",
    "Another minor tweak here is the fact the tip looks much larger than on previous products. It also seems to have a larger component to allow it to screw into the Apple Pencil itself when compared to previous tips.",
    "Why could Apple make this design change? That's unclear at the moment, but it may be that this is necessary for some additional features that we're currently unaware of.",
    "The Apple Pencil has always had removable tips - that's so you can replace them when they're worn down - but this is the first time we've seen the tips of the pencil extended to this size.",
    "Take this information with a pinch of salt for now as there isn't much context around Mr White's leak, but the source has previously correctly leaked images of the iPad mini 5 and some other Apple products including the iPhone 12 and iPhone 12 mini.",
    "Apple's iPad Pro 2021 may land in the next couple of months, if other leaks and rumors are to be believed. There's even chatter of Apple hosting a March event, but it's unclear if that will go ahead or not.",
    "Via Tom's Guide",
    "You might also want to check out the best Apple Pencil alternatives."
  ],
  "headers": {},
  "links": {
    "Apple Pencil": "https://www.techradar.com/how-to/apple-pencil-on-ipad-our-full-guide-on-how-to-use-it",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Mr White": "https://twitter.com/laobaiTD/status/1367102458124660745",
    "iPad mini 5": "https://www.techradar.com/reviews/ipad-mini-2019",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "Apple hosting a March event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "Tom's Guide": "https://www.tomsguide.com/news/ipad-pro-2021-leak-reveals-new-apple-pencil-design",
    "Apple Pencil alternatives": "https://www.techradar.com/best/best-apple-pencil-alternatives"
  }
}