{
  "source": "https://www.techradar.com/news/dropbox-cuts-hundreds-of-jobs-following-remote-working-push",
  "title": "Dropbox cuts hundreds of jobs following remote working push",
  "category": "computing",
  "updated": "2021-01-14T11:33:27Z",
  "author": "barclay-ballard",
  "summary": "Dropbox is getting rid of 11% of its workforce",
  "article": [
    "Cloud storage firm Dropbox has announced significant job cuts in order to protect the company’s long-term future. In total, its global workforce will be reduced by approximately 11%, equivalent to 315 members of staff.",
    "Dropbox confirmed that its decision to enable more remote working as a result of the COVID-19 pandemic has meant that fewer resources are required to support the company’s in-office environments.",
    "In order to prepare the business for a post-pandemic world, the firm stated that it needed to pull back from initiatives that do not align with its long-term strategic goals.",
    "“Over the past year, we’ve talked a lot about the importance of running a tight ship and getting the company ready for the next stage of growth,” Dropbox CEO Drew Houston explained in a company blog post.",
    "“This will require relentless focus on initiatives that align tightly with our strategic priorities, and having the discipline to pull back from those that don’t. Unfortunately, this means that we’re reducing the size of some of our teams. I realize this is incredibly hard on the Dropboxers and their families who are impacted, and I take full responsibility for this decision. This is one of the toughest decisions I’ve had to make in my 14 years as CEO.”",
    "Dropbox shares fell following the job cut announcement but the firm has had a decent 12 months in general.",
    "As a result of the coronavirus pandemic, it has seen an increase in users and posted a third quarter net income of $32.7 million, a 14% increase year-on-year. Nevertheless, many digital platforms face an uncertain future as they try to predict how the world of work will adapt once the effects of the pandemic subside.",
    "The Dropbox chief executive also revealed a list of measures to help employees affected by the job cuts, including severance and healthcare packages. In addition, it was also confirmed that the chief operating officer Olivia Nottebohm would be stepping down.",
    "Via TheStreet"
  ],
  "headers": {
    "3": "Looking long-term"
  },
  "links": {
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review#:~:text=Our%20Verdict,on%20a%20regular%20basis%20too.",
    "explained": "https://blog.dropbox.com/topics/company/-a-message-from-our-ceo",
    "TheStreet": "https://www.thestreet.com/investing/dropbox-slashes-jobs-as-work-from-home-reduces-office-needs"
  }
}