{
  "source": "https://www.techradar.com/news/you-can-upgrade-to-windows-11-for-free-from-windows-7-but-itll-be-a-bit-of-a-pain",
  "title": "You can upgrade to Windows 11 for free from Windows 7, but it’ll be a bit of a pain",
  "category": "computing",
  "updated": "2021-07-07T10:40:03Z",
  "author": "daryl-baxter",
  "summary": "A clean start is seemingly on the horizon",
  "article": [
    "Microsoft is ramping up the different ways for users to update their old machines to Windows 11, even before we’ve seen an official release date.",
    "There’s been plenty of discussion about what the latest update to Windows is bringing, such as new icons, a new start menu, widgets and lots more. However, as we approach the latter half of 2021, questions are growing about how users will be able to update their machine to Windows 11.",
    "Previously, those who were on Windows 7 or 8 were eligible for a free upgrade to Windows 10 for a certain period of time. But with Windows 11 moving to a yearly update cycle, users are unsure if this free upgrade method will see a return.",
    "However, a support document from Lenovo seems to have somewhat cleared some confusion about this.",
    "From what Lenovo has explained, you can update from Windows 7 and 8 to Windows 11 free of charge, but only with a clean install or a reinstall on your PC. This may frustrate some, but if you have more than one hard drive installed, with one solely for Windows, it may not be much of a frustration. However, if you store everything on a single storage device, it may be a long weekend ahead of installing Windows 11, and restoring your data.",
    "One other thing to note is Lenovo stating that while it will be a free upgrade, it may only last a year. “The free upgrade offer does not have a specific end date for eligible systems. However, Microsoft reserves the right to eventually end support for the free offer. This end date will be no sooner than one year from general availability.”",
    "With the Insider build being tested by many users, it’s only a matter of time before Microsoft details the release schedule for Windows 11 and what the upgrade eligibility will be. However, with Lenovo seemingly jumping the gun on this, it may alleviate some users’ worries if their PC is eligible, as long as they meet the minimum requirements.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "How can I update to Windows 11?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "free upgrade to Windows 10": "https://www.techradar.com/how-to/software/operating-systems/how-to-upgrade-to-windows-10-for-free-1325764",
    "Lenovo has explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5243121472210190000&xs=1&url=https%3A%2F%2Fwww.lenovo.com%2Fin%2Fen%2Ffaqs%2Foperating-systems%2Fmicrosoft-windows-11%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyou-can-upgrade-to-windows-11-for-free-from-windows-7-but-itll-be-a-bit-of-a-pain",
    "Windows Latest": "https://www.windowslatest.com/2021/07/07/microsoft-details-windows-11-upgrade-process/"
  }
}