{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s20-fe",
  "title": "Samsung Galaxy S21 vs Samsung Galaxy S20 FE: which phone is right for you?",
  "category": "phones",
  "updated": "2021-01-29T07:00:34Z",
  "author": "jennifer-allen",
  "summary": "Which is for the best choice for you?",
  "article": [
    "Fans of Samsung phones have more decisions to make than they used to with the Samsung Galaxy S21 and Samsung Galaxy S20 FE more evenly matched than one would expect.",
    "While you might assume that the Samsung Galaxy S21 is the best of the bunch given the naming convention, the Samsung Galaxy S20 FE is also a surprise winner when it comes to what to buy in this price range.",
    "Bigger than the S21, it's sure to appeal to those who like larger phones, although - on the other hand - the Samsung Galaxy S21 is easily the faster of the two devices.",
    "With plenty to compare between the two devices, we ask the big question -- is the Samsung Galaxy S21 the best option for most people, or should you give the Samsung Galaxy S20 FE your time and money instead?",
    "The Samsung Galaxy S20 FE hit the shops on October 2 2020, while the Samsung Galaxy S21 came later on January 29 2021.",
    "Prices for the Samsung Galaxy S20 FE start from $699/£699/AU$1,149 for a 5G model. Alternatively, there are 4G models available in the UK and Australia for £599 and AU$999 respectively, but we wouldn't recommend those for anyone looking to future proof their purchase.",
    "The Samsung Galaxy S21 is slightly more expensive at $799/£769/AU$1,249 for a device with 128GB of storage or a 256GB variant for $849/$819/AU$1,349.",
    "That means the Samsung Galaxy S20 FE is the more affordable option of the two, but there's not a huge amount between them when you consider you're likely to be investing in one of these phones for several years.",
    "You might think that the Samsung Galaxy S20 FE is the smaller of the two phones, but it's actually the opposite. It has dimensions of 159.8 x 74.5 x 8.4mm which makes it larger than the Samsung Galaxy S21's 151.7 x 71.2 x 7.9mm. Logically then, it's also a little heftier with an extra 19g of weight.",
    "None of that is likely to be a deal-breaker unless you're incredibly passionate about the smallest phone you can get away with, but it's something to consider. Expect the Samsung Galaxy S21 to be a little comfier to hold for extended periods than the alternative.",
    "There are no curved edges on the screen with both phones -- something that Samsung has saved for the far more premium Samsung Galaxy S21 Ultra. That's a shame as it makes both devices feel a little cheaper. That's reinforced by their use of Glasstic -- Samsung's name for its material, which is somewhere between plastic and glass. It's superior to a regular plastic back, but it's nowhere near as good as a glass rear.",
    "Where the Samsung Galaxy S21 stands out over the Samsung Galaxy S20 FE is its rearrangement of the camera array, which Samsung is calling its Contour Cut Camera feeling slimmer than the more conventional way that the Samsung Galaxy S20 FE has plumped for.",
    "Both phones use the same resolution -- 2400 x 1080 -- and the same 120Hz refresh rates. Where things differ most noticeably is when it comes to screen size. As you'd expect, the Samsung Galaxy S20 FE is bigger with a 6.5-inch display compared to the Samsung Galaxy S21's 6.2-inch display.",
    "They also both offer AMOLED display types with the Galaxy S21 providing a 'dynamic' panel. What does that mean? It has an adaptive refresh rate that switches between 48 to 120Hz as and when needed.",
    "Neither can compete with the Samsung Galaxy S21 Ultra's superior QHD screen, but you'll be hard-pressed to notice the difference if you placed a Samsung Galaxy S21 and Samsung Galaxy S20 FE next to each other.",
    "Bear in mind that the Samsung Galaxy S21 will be more comfortable to hold in one hand, but widescreen media content will look better on the Samsung Galaxy S20 FE's larger display.",
    "At first glance, the Samsung Galaxy S21 and Samsung Galaxy S20 FE's cameras seem very alike. They both have 12MP main and ultra-wide sensors, which is a good starting point for anyone keen to take some snaps.",
    "Where things differ is when it comes to the telephoto lens. The Samsung Galaxy S21 uses a 64MP sensor and a 1.1x optical zoom, while the Samsung Galaxy S20 FE has an 8MP sensor but 3x optical zoom. We found that the S20 FE did a better job with zoomed-in shots with the only real issue being that colors were slightly duller.",
    "Both phones offer extensive camera modes that are genuinely useful. This includes Single Take photography mode where you simply point your phone at a subject, record a short 5 to 15-second video, panning around the scene, and the phone figures out the best stills and video footage for you.",
    "Other modes include Panorama, Night, Live Focus, Live Focus Video, and two slow-mo modes. In both cases, Night mode works well at achieving decent shots in low-light settings without the need to keep the phone still for too long.",
    "The Samsung Galaxy S21 only sports a 10MP selfie camera while the Samsung Galaxy S20 FE has a 32MP selfie camera. You won't get a 32MP picture from it because it's paired with a wide-angle lens, but it does mean that if you regularly take group selfies, the results will look far better than the S21 can offer.",
    "When it comes to video recording, the Samsung Galaxy S21 is the best of the two. It can provide 8K at 24 frames per second even if the image is a little cropped at times. Both devices offer 4K at 30 and 60 frames per second along with Full HD at 30 and 60 frames per second. The Samsung Galaxy S21 keeps on going with Full HD at up to 240fps if you need it to.",
    "The Samsung Galaxy S21 utilizes the latest chipset compared to the Samsung Galaxy S20 FE. It uses a Snapdragon 888 chipset in the US and an Exynos 2100 everywhere else. That's compared to the Samsung Galaxy S20 Fe's Snapdragon 865 and Exynos 990 chipset.",
    "While the latter is still speedy enough, it can't compete with the performance of the Samsung Galaxy S21. If speed is everything, the Samsung Galaxy S21 will steal your heart easily.",
    "In either case, multitasking and gaming will work speedily here thanks to 8GB of RAM. It's just that the S21 has the edge when it comes to processor performance.",
    "Both the Samsung Galaxy S21 and Samsung Galaxy S20 FE offer 128GB or 256GB of storage, but notably, only the S20 FE has a microSD slot if you wish to expand it. The S21 series has dropped that option so if you like to store plenty of files, you may need to invest in the larger capacity right from the start.",
    "And, of course, both devices offer 5G connectivity (unless you go with the 4G version of the Samsung Galaxy S20 FE which we don't recommend) so you're good to go with faster connection speeds if you're in one of the growing areas that offer 5G speeds.",
    "In both the Samsung Galaxy S20 FE and Samsung Galaxy S21's cases, expect to keep an eye on their power levels throughout the day. Both will make it to the end of the day but you might need to make some concessions with settings and features if you use them a lot.",
    "Specs-wise, the Samsung Galaxy S20 FE has a 4,500mAh battery while the Samsung Galaxy S21 offers a 4,000mAh battery life. Both will just about make it to the end of the day but features like 5G and the 120Hz display take their toll. There are at least several different power-saving modes to make it a bit easier to achieve.",
    "Battery life will undoubtedly be impacted if you take advantage of both phones' reverse wireless charging. However, it's a useful feature if you want to top up your earphones or smartwatch during the day.",
    "Both devices are compatible with Qi wireless charging and offer fast-charging via 25W USB-C chargers but note that the Samsung Galaxy S21 doesn't come with a charger. That's supposedly due to Samsung's urge to cut down on e-waste with the thinking being that you probably already have a compatible USB-C charger available to use anyhow.",
    "Is the Samsung Galaxy S21 or the Samsung S20 FE better? Well, it mostly depends on what you need a phone for.",
    "In terms of performance, the Samsung Galaxy S21 is easily the best of the two. It's faster and will easily handle multiple tasks at once in split-screen view without any problem. However, it has restricted storage options and it offers a smaller screen than the Samsung Galaxy S20 FE.",
    "The latter, in particular, is only an issue if you want a bigger experience. If you have smaller hands, you'll find the S21 comfier to hold, but if you want a more widescreen type experience when streaming media content, the Samsung Galaxy S20 FE is the best option.",
    "There's also the matter of the camera with the S20 FE being superior on that front. Power users or avid gamers will need the extra oomph of the Samsung Galaxy S21 but if you simply want a great camera and a good screen then the Samsung Galaxy S20 FE is the best option for you, and it'll cost you less."
  ],
  "headers": {
    "4": "Samsung Galaxy S21 vs Samsung Galaxy S20 FE price and availability",
    "8": "Design",
    "12": "Display",
    "16": "Camera",
    "22": "Specs and performance",
    "27": "Battery life",
    "31": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888"
  }
}