{
  "source": "https://www.techradar.com/news/genesis-unveils-the-gv60-a-practical-ev-with-a-bentley-style-interior",
  "title": "Genesis unveils the GV60 – a practical EV with a Bentley-style interior",
  "category": "car-tech",
  "updated": "2021-10-14T09:58:05Z",
  "author": "axel-metz",
  "summary": "Premium practicality",
  "article": [
    "South Korean automaker Genesis has unveiled its newest electric crossover, the GV60, modelled on the same E-GMP platform as the Hyundai Ioniq 5 and forthcoming Kia EV6.",
    "It marks the first dedicated electric platform-based vehicle for the brand, which is the luxury vehicle division of the Hyundai Motor Group, and aims to combine practical performance with premium interior styling that rivals the likes of Bentley and Mercedes.",
    "As for the car's name, Genesis says the 'G' in GV60 (unsurprisingly) represents Genesis, while the 'V' refers to versatility. The number '60' denotes its position in the Genesis lineup, with the brand describing the GV60 as its most athletic vehicle to date.",
    "That sense of athleticism is evident in the car's exterior design. The brand's customary Two Lines Quad Lamps sit above a smartly-shaped 'Crest Grille', positioned to increase the cooling efficiency of the high-voltage batteries lining the GV60's underbody.",
    "The car boasts a new wing emblem applied to the grille, too, which Genesis says is 80% thinner than previous emblems and features the same unique Guilloché pattern often seen in luxury watches.",
    "It's hard to tell just how impressive an emblem appears from promotional images, but we'll take the brand's word for it.",
    "The GV60 will also be the first Genesis model to sport a clamshell hood – a single panel which combines both the hood and fenders – as well as digital side mirrors, the likes of which we're beginning to see more and more on premium EV models.",
    "It won't be the most eye-catching vehicle on the road, but the GV60 is admittedly athletic-looking, as Genesis claims, and certainly rocks an aerodynamic aesthetic that will complement the car's performance credentials.",
    "As for what those credentials are, we're still in the dark, but given the platform comparisons to the Hyundai Ioniq 5 and Kia EV6, we'd anticipate 58kWh and 77.8kWh battery offerings boasting ranges of around 300 miles.",
    "We also don't yet have a price for the GV60, but we don't expect a figure anywhere south of $60,000 / £45,000 / AU$80,000.",
    "As for where your money goes for that price, the GV60's interior makes up for a lackluster exterior design.",
    "The car's most prominent interior feature comes by way of a 'Crystal Sphere', a sphere-shaped electronic transmission control that intuitively informs the driver of oncoming driving conditions.",
    "Genesis says the Crystal Sphere features mood lights which illuminate when the vehicle is off, while a Mercedes-like twin-screen digital display dominates the dashboard.",
    "The GV60 has also embraced uniformity in its interior design by applying circular details to the Crystal Sphere, the horn cover, door handles and side mirror controllers, which give the car an inherently luxurious feel à la a Bentley or Rolls Royce.",
    "Now, don't expect quite that level of prestige, but the GV60 nonetheless proves the Koreans can design smart-looking interiors to rival their more comparable German competitors."
  ],
  "headers": {
    "10": "Winning interior"
  },
  "links": {
    "Hyundai Ioniq 5": "https://www.techradar.com/news/hyundai-ioniq-5-review"
  }
}