{
  "source": "https://www.techradar.com/news/captain-america-4-with-sam-wilson-is-great-news-but-he-needs-a-better-story-this-time",
  "title": "Captain America 4 with Sam Wilson is great news – but he needs a better story this time",
  "category": "entertainment",
  "updated": "2021-08-19T11:02:29Z",
  "author": "samuel-roberts",
  "summary": "Anthony Mackie is reportedly reprising his role as Cap",
  "article": [
    "Anthony Mackie has apparently completed a deal to star as Captain America in a fourth entry in that Marvel movies series, the existence of which was reported right after The Falcon and the Winter Soldier ended on Disney Plus back in May. This is according to Deadline, which also doubles down on a previous report that said the Disney Plus series' showrunner Malcolm Spellman is writing the movie, along with series writer Dalan Musson.",
    "Marvel has not officially announced Captain America 4 as it stands. Curiously, the report also mentions a top-secret Marvel film due to star former Cap Chris Evans, which the star had previously appeared to shoot down back in January.",
    "This is a good choice by Marvel, assuming this is all going ahead as planned. Mackie's Sam Wilson clearly emerged as one of the better supporting characters in the MCU – debuting in Captain America: The Winter Soldier and entering the mainline Avengers line-up as of the end of Age of Ultron in 2015. He played memorable parts in the last two Avengers movies, Infinity War and Endgame, which is why the news that he was getting his own spin-off with Sebastian Stan's Bucky seemed so exciting.",
    "The Falcon and the Winter Soldier didn't live up to its full potential, however – we ranked it last of the three Marvel Disney Plus shows released so far. It definitely had its moments, but lost focus of its two excellent leads too many times due to an overload of characters.",
    "Few would argue against the idea that Sam finally putting on the costume – with Vibranium wings, courtesy of Wakanda – was a highlight of the show, though. And the arrival of a new Captain America feels like a massive event, and something you actually want to see on the big screen. The end of the show flashed the title card 'Captain America and the Winter Soldier', which I interpreted as a suggestion that a second season might have a name change.",
    "Clearly, this wasn't to be the case, but a movie is the better scenario to me than more TV episodes. So what could a Captain America movie starring Anthony Mackie actually look like?",
    "A lot of classic Captain America villains have been covered off by the movies, now: Baron Zemo, Wolfgang von Strucker, Crossbones, Red Skull, Batroc and Arnim Zola have all made fairly extensive appearances in the MCU, with some reappearing in The Falcon and the Winter Soldier.",
    "Really, this new Captain America needs his own villains. A good starting point for the writers might be the All-New Captain America run by writer Rick Remender, which introduced Sam as Cap. That run dealt with the rise of a new Hydra led by Baron Zemo – who seems less likely to be the focus of the new Cap movie, since the MCU's Zemo is now safely incarcerated on the Raft. He could always break out again, we suppose, but that would be the second time he's done that.",
    "That book also introduced a villain called Baron Blood, and brought back Sinthea Schmidt, daughter of the Red Skull, as part of this new Hydra. Nick Spencer's later Captain America run featuring Sam also reintroduced the Sons of the Serpent, essentially a hate-mongering, anti-American group who make great punching bags in the pages of Marvel's books.",
    "Those all seem like remote possibilities to us. What would be more interesting is if Captain America 4 uses some of the pieces that are already on the table in the movies and TV shows.",
    "We'd like to see Sam Wilson's Cap wage war against the Power Broker – who we now know is Sharon Carter, an ally. The idea of Captain America trying to take out an unnamed, man behind the curtain-type figure with immense power would give this a little of the espionage style of Captain America: The Winter Soldier that made that movie so riveting. The reveal of Sharon as a villain could also be very effective in this movie, if that's where they decide to go.",
    "What's most likely is that Spellman and Musson will take an approach we see so often in the Marvel movies and TV shows – grab pieces of Marvel lore for inspiration, and build something new out of them. Hopefully we'll see the first Black Captain America, Isaiah Bradley (Carl Lumbly), make a reappearance as well.",
    "The line between Marvel's TV and movie projects is increasingly blurry, in the sense that massive, world-shifting events can now happen in either – Loki showed us that. If you compare the consequences of the final episode of Loki to those in big screen movie Black Widow, it's clear that unleashing the Multiverse in the former means more in the grand scheme of the MCU than anything that happened in the latter.",
    "That doesn't mean one is necessarily better than the other, of course, but Marvel is exploring new territory with all of this. Star Wars, for example, isn't telling an ongoing narrative using movies and TV shows at the same time – all its stories are told separately, but exist in the same single continuity.",
    "What this means, then, is what counts as a big 'event' in the MCU is now harder to pin down than ever. You basically just need to commit to watching all of it, whether it's in theaters or on TV. That's the point.",
    "With Captain America 4, we're seeing another example of how Marvel is going to connect the two. CCO Kevin Feige has previously said that some shows will get second seasons – Loki season 2 reportedly starts filming next year – while others will link back to the movies, like Wanda Maximoff's story continuing in Doctor Strange in the Multiverse of Madness in some form.",
    "Marvel isn't picking favorites between movies and TV, basically. But it feels like an event that Sam Wilson's Captain America is set to get his own movie – he's the first 'successor' character to do this in the MCU, and maybe the only one so far who actually deserves it."
  ],
  "headers": {
    "6": "A new Cap needs new villains",
    "12": "What makes sense on TV, and what makes sense on the big screen?"
  },
  "links": {
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "which the star had previously appeared to shoot down": "https://www.techradar.com/news/chris-evans-could-play-captain-america-again-but-in-which-marvel-movie",
    "ranked it last of the three Marvel Disney Plus shows released so far": "https://www.techradar.com/news/now-loki-has-ended-lets-rank-the-marvel-disney-plus-shows-so-far",
    "Power Broker": "https://www.techradar.com/news/who-is-the-power-broker-in-falcon-and-the-winter-soldier",
    "final episode of Loki": "https://www.techradar.com/news/loki-episode-6-recap-a-disappointing-season-finale",
    "Black Widow": "https://www.techradar.com/news/black-widow-post-credits-scene-explained",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Loki season 2": "https://www.techradar.com/news/loki-season-2"
  }
}