{
  "source": "https://www.techradar.com/news/the-mandalorians-microled-displays-could-kill-off-the-green-screen-for-good-heres-why",
  "title": "The Mandalorian's MicroLED displays could kill off the green screen for good – here's why",
  "category": "entertainment",
  "updated": "2021-01-18T12:12:27Z",
  "author": "axel-metz",
  "summary": "Say goodbye to the green screen",
  "article": [
    "Could the direction of filmmaking be about to change? According to a report from The Hollywood Reporter, Sony has announced a pair of new Crystal LED modular direct view displays that could make virtual movie production – of the kind used to create the digital sets in The Mandalorian – a far more widespread method of filmmaking.",
    "The displays, developed in collaboration with Sony Pictures Entertainment, comprise several modular panels that use MicroLEDs to produce enormous digital images, allowing actors to exist in virtual movie worlds without the need for traditional green screens.",
    "The technology – also used in George Clooney’s Midnight Sky – means directors can control set surroundings without moving between locations or constructing expensive building projects, which typically eat into large portions of a movie’s production budget.",
    "Sony announced that its B-series displays are geared towards professional applications – including virtual set production – given their anti-reflective coating and high degree of brightness.",
    "And boy, are they bright. Sony says the displays can operate at an average of 1,800 nits, which is in the upper range of brightness even for Samsung's ultra-bright QLED displays. For comparison, even Apple’s Pro Display XDR (referring to its “extended dynamic range”) reaches a peak of 1,600 nits.",
    "The point being, Sony’s new displays will allow greater visual fidelity to actors and filmmakers tasked with creating authentic, convincing worlds. It’s the reason why The Mandalorian sets seem so real – the actors are able to deliver their lines while the sands of Tatooine whirl around them, rather than working alongside giant green panels.",
    "Of course, the technology isn’t just a benefit to filmmakers, but audiences, too.",
    "If actors are convinced of their own existence in these virtual worlds, then so will viewers. Displays like these allow for more natural light emission, doing away with the false lighting required from traditional filmmaking methods.",
    "Reflections, too, are more realistic. Typically, post-production teams are forced to spend hours editing out pesky reflections caused by green screens, inserting false effects to create the illusion of natural light. With Sony’s virtual displays, reflections seen in movies will actually be those caused by the light of the actors’ surroundings, creating a more authentic, immersive visual experience.",
    "In 2020, Insider released a useful video explaining why the Disney show decided to opt for virtual sets over green screen, which sheds light on the benefits filmmakers and audiences can expect from more widespread use of this technology.",
    "Sony says the displays will be available between June and August 2021, and hasn’t yet revealed prices – though given that these are products geared towards professional production, they’re likely to require film studio-sized pockets.",
    "In any case, expect to enjoy a more authentic movie-going experience in the years to come – even if not from the TV in your own home."
  ],
  "headers": {
    "6": "More immersive movies"
  },
  "links": {
    "report": "https://www.hollywoodreporter.com/behind-screen/sony-unveils-crystal-led-displays-for-virtual-production",
    "MicroLED": "https://www.techradar.com/news/microled-vs-oled-the-battle-of-the-high-end-display-tech",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained"
  }
}