{
  "source": "https://www.techradar.com/news/server-chip-shortage-could-drag-on-through-the-rest-of-2021",
  "title": "Server chip shortage could drag on through the rest of 2021",
  "category": "computing",
  "updated": "2021-07-05T15:48:47.151Z",
  "author": "mayank-sharma",
  "summary": "Chip shortages could perhaps linger even longer",
  "article": [
    "Industry insiders are expecting the shortages of critical components in server chips fueled by a wider global shortage is unlikely to ease until Q4 2021 or Q1 2022, with some suggesting it to continue well into 2022.",
    "The ongoing chip crunch, the result of pandemic induced lockdowns, unexpected work-from-home fueled demand, and unprecedented drought in chip manufacturing hub Taiwan, is apparently wrecking havoc up and down the semiconductor supply chain.",
    "Quizzed by DigiTimes on reports of shortages of server ICs constraining server ODMs’ (Original Design Manufacturer) shipment growth in the third quarter of 2021, the general consensus is that the problem is worsening, with delivery lead times for some critical server chips ranging between 52 and 70 weeks.",
    "Citing anonymous industry sources, DigiTimes says that lack of supply of critical components is impacting ODMs like Inventec and Mitac Computing who have been unable to fulfill their orders on time, with the number of unfulfilled orders being as high as 20-30% for Mitac, reportedly.",
    "Commenting on the development, Tom’s Hardware notes that modern servers use more components than an average consumer's PC, and on average it takes over three months to build a complex chip, such as a CPU.",
    "That’s discounting the time it takes to then test the chip, package it, and ship it out.",
    "Reportedly, even after prioritizing production, chip manufacturers like Intel and AMD are unable to meet the demands for the components for use in data center machines, which is still massively outweighed by the supply.",
    "Outside of chips used in CPUs, DigiTimes also points to Wiwynn, which mostly produces rack servers and counts the likes of Facebook among its customers, as being unable to meet orders due to the lack of switches."
  ],
  "headers": {
    "4": "Domino effect"
  },
  "links": {
    "global shortage": "https://www.techradar.com/news/another-top-source-says-global-chip-shortage-could-drag-on",
    "work-from-home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "notes": "https://www.tomshardware.com/uk/news/report-server-chip-shortage-worsens-as-intel-amd-in-tight-supply",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019"
  }
}