{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-increasingly-looks-like-the-galaxy-note-22-in-all-but-name",
  "title": "Samsung Galaxy S22 Ultra increasingly looks like the Galaxy Note 22 in all but name",
  "category": "phones",
  "updated": "2021-11-12T09:57:58Z",
  "author": "james-rogerson",
  "summary": "Big and angular",
  "article": [
    "The Samsung Galaxy S22 Ultra has been extensively leaked at this point, and it looks more like a member of the Note range than the S range, with the latest leak only furthering that impression.",
    "Reliable leaker @UniverseIce has shared a photo on Twitter which appears to show either the screen glass or screen protectors for the Samsung Galaxy S22 range, so you get a comparison of their sizes and shapes.",
    "As you can see below, the Samsung Galaxy S22 and Galaxy S22 Plus look similar to each other, and to the Samsung Galaxy S21 range, with slightly curved corners, and the Plus model simply being the larger of the two.",
    "But the glass for the Samsung Galaxy S22 Ultra has corners that hardly curve at all, so it looks far more angular and rectangular (as well as being bigger).",
    "It’s a design that’s very familiar from the Samsung Galaxy Note range – and notably not something that we see from many other phones, as manufacturers tend to favor curvy designs.",
    "We would of course take this leak with a pinch of salt, but it’s in line with things that we’ve seen before and it comes from a solid source, so there’s a good chance it’s accurate.",
    "It’s not just the supposed shape of the screen that makes the Samsung Galaxy S22 Ultra look a lot like a Galaxy Note.",
    "The phone is also rumored to not just support the S Pen – which the Galaxy S21 Ultra does too – but to actually include it as standard and have a slot for it, which until now you’d only get with a Galaxy Note model.",
    "In fact, one source even suggested that the Samsung Galaxy S22 Ultra would actually be called the Samsung Galaxy Note 22 Ultra, so there’s a chance that this will fully be a new model in the Note range, just launched alongside new Galaxy S models.",
    "Either way, it seems the Galaxy Note range will probably live on at least in spirit if many of these rumors are right, which should please those disappointed by the lack of a Samsung Galaxy Note 21.",
    "Via SamMobile"
  ],
  "headers": {
    "6": "Analysis: like a Note in more ways than one"
  },
  "links": {
    "Samsung Galaxy S22 Ultra": "https://www.techradar.com/news/samsung-galaxy-s22",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1458977503926636548?t=7QxjJT-76VItDxQb5ok5kA&s=19",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "include it as standard and have a slot for it": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-photos-give-us-our-best-look-yet-at-the-phone",
    "be called the Samsung Galaxy Note 22 Ultra": "https://www.techradar.com/news/samsung-galaxy-s22-and-s22-renders-leak-out-hint-at-a-galaxy-note-22-ultra",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "SamMobile": "https://www.sammobile.com/news/new-leak-shows-galaxy-s22-ultra-is/"
  }
}