{
  "source": "https://www.techradar.com/news/your-new-iphone-13-pro-or-pro-max-could-take-over-a-month-to-arrive",
  "title": "Your new iPhone 13 Pro or Pro Max could take over a month to arrive",
  "category": "phones",
  "updated": "2021-09-24T18:00:38Z",
  "author": "alex-hughes",
  "summary": "Want Apple's latest and greatest? You might have to wait",
  "article": [
    "Apple's new iPhone 13 series has only just come out and yet, there is already a major backlog in delivery times with most retailers currently showing no stock at all or dates exceeding a month.",
    "While the issues aren't quite as dramatic for the iPhone 13 mini and regular 13, those after the two larger devices might have to wait a while. Some carriers like Verizon in the US or Fonehouse in the UK are quoting a few days to a week or two. Others like Mobiles.co.uk expect you won't get the device until late October or November.",
    "While there has been no announcement as to why there are delays, we saw stock issues hit the iPhone 12 series last year as well as more recently with the Samsung Galaxy S21 range.",
    "With similar issues affecting consoles like the PS5, Xbox Series X – and at one point, the Nintendo Switch – stock delays are looking like a more regular issue with the pandemic frequently halting supply chains.",
    "For those looking to buy the smaller iPhone 13 or iPhone 13 mini, there is still plenty of stock available with lots of retailers even offering next day delivery, for the iPhone 13 Pro and Pro Max, you might have to wait a while for your device to arrive.",
    "UK retailers:",
    "*delivery dates accurate at time of writing",
    "US retailers:",
    "*delivery dates accurate at time of writing"
  ],
  "headers": {
    "5": "The retailers with the fastest delivery:"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "Verizon": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1149462564264511200/https://www.verizon.com",
    "Fonehouse": "https://www.awin1.com/awclick.php?awinmid=6224&awinaffid=103504&clickref=trd-us-1160040861608486400&p=https%3A%2F%2Fwww.fonehouse.co.uk%2F",
    "Mobiles.co.uk": "https://www.awin1.com/awclick.php?awinmid=380&awinaffid=103504&clickref=trd-us-1171399980756766500&p=https%3A%2F%2Fwww.mobiles.co.uk%2F",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review"
  }
}