{
  "source": "https://www.techradar.com/news/microsoft-teams-is-set-for-a-fluid-makeover",
  "title": "Microsoft Teams is set for a rather fluid makeover",
  "category": "computing",
  "updated": "2021-07-19T11:46:05Z",
  "author": "sead-fadilpasic",
  "summary": "Fluid components hitting Microsoft Teams later next month.",
  "article": [
    "Fluid components are coming to Microsoft Teams “soon”, according to a report that says dynamic widgets that can be edited in real-time by multiple team members are expected to start rolling out in mid-August.",
    "Government users can expect the rollout to start early September, and wrap up by the end of the month.",
    "The Redmond software giant has been working on improving its communications and collaboration platform for some time, having revealed news of major changes earlier this year that included new functionality features to improve both synchronous and asynchronous working, turning Teams into a “canvas that creates and maintains context before, during and after meetings”.",
    "Part of that overhaul are the Fluid components, which allow users to create dynamic components, such as tables or tasks lists, within Microsoft Teams, which can be edited, in real-time, by all other participants. Users can also copy these widgets to other chats or Outlook’s calendar, without desyncing the data.",
    "Furthermore, users will be able to pin individual messages to the top of the chat, and quote different messages in replies, for easier communication. Team members will also be able to co-author meeting notes and actions lists created in a session, and once a meeting wraps up, all tasks and notes created, get automatically imported into OneNote.",
    "Team Rooms are also expected to receive a major facelift later this year, with a new front row layout that enlarges the video feeds of remote attendees.",
    "Ever since the Covid-19 pandemic forced many employees into a remote working environment, remote communication and collaboration have become essential for all businesses, small and medium-sized ones included.",
    "Being able to seamlessly collaborate, without the confusion of multiple file versions, stored on different storage devices, is one of the main challenges being addressed by the likes of Microsoft and Google.",
    "Via: MSPowerUser"
  ],
  "headers": {
    "5": "Remote collaboration as a key challenge"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "communications and collaboration platform": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "MSPowerUser": "https://mspoweruser.com/fluid-components-are-coming-to-microsoft-teams-soon/"
  }
}