{
  "source": "https://www.techradar.com/news/gopro-hero-10-black-leak-reveals-upgraded-camera-and-specs",
  "title": "GoPro Hero 10 Black leak reveals upgraded camera and specs",
  "category": "cameras",
  "updated": "2021-08-29T10:30:03Z",
  "author": "david-nield",
  "summary": "Resolution, frame rate boosts",
  "article": [
    "We haven't heard much about the GoPro Hero 10 Black to date, but a major new leak reveals some of the upgrades that could be in store when the next version of the iconic action camera gets an official launch.",
    "WinFuture has got hold of images and specs of the GoPro Hero 10 Black, showing a design that more or less sticks to what we saw with the GoPro Hero 9 Black – save for some blue highlights on the GoPro lettering – and naming the new GP2 processor that's going to be running inside the next model.",
    "That processor upgrade should lead to a boost in picture and video quality – expect higher resolutions and frame rates to be supported by the incoming action camera. In addition, the video stabilization technology will once again be improved.",
    "According to WinFuture's sources, the GoPro Hero 10 Black will be capable of recording 5.3K video at 60 frames per second, while the 4K resolution is going to support a maximum of 120 frames per second, and the 2.7K resolution goes up to 240 frames per second.",
    "The photo resolution is apparently going to get an upgrade from 20 megapixels to 23 megapixels, while it sounds like all of the other existing features are going to be retained too – including waterproofing up to 10 meters or 33 feet.",
    "What we don't know yet is how much the GoPro Hero 10 Black is going to cost, or when it might be made official. The GoPro Hero 9 was announced in September 2020, so its successor could well arrive in September as well.",
    "There's a reason that the brand GoPro has become synonymous with action cameras: its devices are powerful, compact, reliable and very well put together, which gives the GoPro design team a tough challenge when it comes to improving the camera each year.",
    "With LCD displays front and back now, and full waterproofing without a case, there doesn't seem to be much else that GoPro can do in terms of changing the looks of the camera – not unless it's going to start again from scratch and forget all the years of heritage that have been earned up to this point.",
    "On the inside, the changes are pretty much as we would expect, and what we tend to see each year: upgrades to both resolutions and frame rates, with faster image and video processing and an improved camera sensor as well. The GoPro Hero 10 Black will be the best GoPro ever, but it won't make the 2020 edition redundant.",
    "With future action cameras, GoPro may well follow the lead set by Google and its Pixel phones by improving the software processing and enhancements as well as the hardware. In the meantime, we're looking forward to seeing what the 2021 model has to offer."
  ],
  "headers": {
    "3": "Coming soon",
    "6": "Analysis: GoPro continues to refine a classic"
  },
  "links": {
    "GoPro Hero 10 Black": "https://www.techradar.com/reviews/gopro-hero-10-black",
    "WinFuture": "https://winfuture.de/news,124840.html",
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black"
  }
}