{
  "source": "https://www.techradar.com/news/first-look-at-lexus-lf-z-electrified-reveals-rapid-acceleration-and-major-display-shift",
  "title": "First look at Lexus LF-Z Electrified reveals rapid acceleration and major display shift",
  "category": "car-tech",
  "updated": "2021-03-30T10:00:09Z",
  "author": "john-mccann",
  "summary": "The latest concept from Lexus is a fully electric car",
  "article": [
    "Lexus has given us a glimpse of its fully electric car future with the introduction of its new concept, the Lexus LF-Z Electrified.",
    "The Japanese manufacturer currently offers just one fully electric vehicle in its range - the UX 300e - but the LF-Z Electrified Concept signals another step towards a wider EV selection.",
    "During a whistle-stop tour around the vehicle, there was a clear focus on the range of technology Lexus has built into the concept, from its new electric powertrain and steer-by-wire system to an overhaul of interior tech which includes multiple displays, a voice assistant and touch controls.",
    "The latter point is interesting, as to date Lexus has avoided touch displays in its vehicles, opting instead for a computer-like touchpad and buttons approach which we've found a little clumsy to use versus touch input.",
    "In the cabin of the Lexus LF-Z Electrified is the firm's new Tazuna (the Japanese term for using reins to control a horse) cockpit which sees three displays clustered around the steering wheel.",
    "Lexus says the layout is inspired by the black butterfly, with two 'wing' displays flanking a centrally positioned (behind the steering wheel) cluster screen.",
    "The largest of the three displays sits across the center console and appears to be the main touch input screen, providing access to various infotainment options.",
    "Lexus says you can expect to see more touch screens and voice assistants feature in future cars, as customer usage change over the years and these two inputs are what it feels are the appropriate solutions going forward.",
    "Lexus says the fully electric, four wheel drive setup of the LF-Z Electrified has allowed it to produce a car with improved acceleration and power delivery, and a lower center of gravity for better handling.",
    "It claims the LF-Z Electrified Concept will offer a range of 600km (around 370 miles) on a single charge, and will be able to accelerate from 0-100km/h (0-62mph) in just three seconds - putting in line with top supercars.",
    "There's support for 150kW charging, which Lexus says will can recharge the 90kWh battery in the LF-Z Electrified from 0-80% in roughly 30 minutes.",
    "Other futuristic details on the concept electric car include an electrochromic glass roof - allowing you to move it between transparent and opaque - a smart AI assistant which you can communicate with via voice and which will learn your habits over time to make better suggestions, and smartphone connectivity that allows you to use your handset as a key.",
    "The door handles sit flush to the body work, and pop-out when you unlock the car - the doors also have sensors to detect for oncoming traffic, and if the coast is clear the LF-Z Electrified Concept can gently open the door a couple of inches as well.",
    "Lexus has also confirmed it will have another two product launches in 2021. While no further information was provided on what these reveals may be, there's a chance we may see the first production-ready, fully electric cars from Lexus later this year.",
    "It's worth noting that as the LF-Z Electrified is a concept, it won't make it to market - however, we have seen previous concept cars from the brand, such as the LF-A, turn into production vehicles without much change to overall exterior design.",
    "Whether or not a future production vehicle will mirror the LF-Z concept quite so closely remains to be seen."
  ],
  "headers": {
    "8": "Supercar speed, smartphone smarts",
    "13": "More to come"
  },
  "links": {}
}