{
  "source": "https://www.techradar.com/news/nvidia-rtx-3080-in-stock-at-best-buy-on-august-26-should-you-even-bother",
  "title": "Nvidia RTX 3080 in stock at Best Buy on August 26. Should you even bother?",
  "category": "computing",
  "updated": "2021-08-25T17:39:57Z",
  "author": "john-loeffler",
  "summary": "Not queued up for Best Buy RTX cards already? We've got bad news for you",
  "article": [
    "Best Buy will have some of the best graphics cards on the market in stock on August 26, with its latest in-store GPU stock drop of Nvidia RTX 30-series cards, including the RTX 3080.",
    "As we've seen with past events like this, you're going to need to start camping out now if you plan on getting one of the limited number of cards the company has in stock, as people are likely already starting to line up as you read this.",
    "You can use the company's store locator to find out which store in your area is going to be receiving stock of these hard-to-find graphics cards.",
    "We're going to level with you. If you aren't already in line while you're reading this, it's probably not worth camping out overnight to get one of these cards.",
    "These Best Buy stock drops for RTX cards sell out just as fast as they do online, and the amount of stock usually on offer numbers around 50-60 in places like New York City.",
    "When we interviewed people earlier in June and July, there were already that many people already online within an hour of Best Buy making that announcement the day before. Hundreds of people lined up in Manhattan, some waiting for more than 20 hours, and they were all turned away.",
    "Worse still, most of those people who will be getting those cards aren't going to be gamers, but are likely buying up those cards to scalp them online. It's better you not have to see them do this in person if you can help it. You've suffered enough."
  ],
  "headers": {
    "3": "Analysis: It's probably already too late"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "we've seen with past events": "https://www.techradar.com/news/life-in-the-queue-meet-the-gamers-camping-out-for-an-rtx-3080-ti-across-the-us",
    "store locator": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-8760645963387683000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fclp-computers-tablets%2Fnvidia-geforce-rtx-graphics-cards%2Fpcmcat1619723841347.c%3Fid%3Dpcmcat1619723841347%26nrtv_cid%3D71c9386f613264d77815362fbf986e8aec5475a1ec085842b61cffd13030e39c%26subId2%3Dfuture%26subId3%3D1750104861744885082%26subId1%3D&article_name=Nvidia%20RTX%203080%20in%20stock%20at%20Best%20Buy%20on%20August%2026.%20Should%20you%20even%20bother%3F&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnvidia-rtx-3080-in-stock-at-best-buy-on-august-26-should-you-even-bother"
  }
}