{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s8-could-land-alongside-the-galaxy-s22-as-an-ipad-pro-rival",
  "title": "Samsung Galaxy Tab S8 could land alongside the Galaxy S22 as an iPad Pro rival",
  "category": "tablets",
  "updated": "2021-07-27T14:58:33Z",
  "author": "james-rogerson",
  "summary": "In early 2022",
  "article": [
    "This year has been fairly quiet as far as Android tablets go, with the iPad Pro (2021) gobbling up most of the top-end tablet attention, but an Android rival could land in early 2022, as a source claims that the Samsung Galaxy Tab S8 range will launch alongside the Samsung Galaxy S22.",
    "Tweeter @UniverseIce is the source in question, and technically they only say that the Samsung Galaxy Tab S8 Plus will land alongside S22 range, but presumably the standard Galaxy Tab S8 and the rumored Galaxy Tab S8 Ultra would as well.",
    "Of course, we don’t know exactly when the Samsung Galaxy S22 range itself will launch, but we’re expecting it around January of next year.",
    "Additionally, @UniverseIce says that the Galaxy Tab S8 Plus has a 10,090mAh battery (the same size as the Samsung Galaxy Tab S7 Plus’s), and that the Samsung Galaxy Tab S8 Ultra has an 11,500mAh one.",
    "We would of course take all of this with a pinch of salt, but this comes from a solid source, and the only other release date rumor also points to a launch in early 2022.",
    "The Samsung Galaxy Tab S range includes some of the most high-end and best slates you’ll find running Android. But they’re still arguably not a match for the iPad Pro range, and Apple has raised the bar ever higher this year, with the iPad Pro (2021) packing a seriously powerful M1 chipset, and the 12.9-inch model also having a Mini LED screen.",
    "So rumors of a Samsung Galaxy Tab S8 Ultra are promising – this would be the first Ultra slate from Samsung, and as it’s positioned even higher than the ‘Plus’ model it could give the iPad Pro range a real run for its money.",
    "Of course, that depends on what Samsung packs in to its Ultra slate and so far we don’t know much about it, but with this rumor of a big battery, and an earlier one pointing to a huge 14.6-inch screen (which dwarfs any iPad) it certainly sounds like the company could be on to a winner. Fingers crossed it all comes together in practice, and doesn’t have too astronomical a price.",
    "Via GSMArena"
  ],
  "headers": {
    "5": "Opinion: Samsung needs to pull out all the stops with the Samsung Galaxy Tab S8 Ultra"
  },
  "links": {
    "Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "iPad Pro (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1419891679851696145",
    "@UniverseIce says": "https://twitter.com/UniverseIce/status/1419941382873960453",
    "Samsung Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "release date rumor": "https://www.techradar.com/news/samsung-galaxy-tab-s8-might-not-land-until-next-year",
    "a huge 14.6-inch screen": "https://www.techradar.com/news/the-samsung-tab-s8-could-come-with-a-huge-screen-and-a-giant-battery",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_tab_s8_ultra_rumored_to_launch_alongside_galaxy_s22_series-news-50247.php"
  }
}