{
  "source": "https://www.techradar.com/news/nokia-sets-new-45gbps-5g-speed-record",
  "title": "Nokia clocks 4.5Gbps to set new 5G speed record",
  "category": "phones",
  "updated": "2021-03-23T13:23:36Z",
  "author": "steve-mccaskill",
  "summary": "Nokia and Turk Telecom set new benchmark on mmWave",
  "article": [
    "Nokia says it has broken the 5G speed record, reaching 4.5Gbps on Turk Telecom’s 26GHz mmWave spectrum in Turkey.",
    "Several mobile operators and network equipment providers claim to hold various records, basing their claims on different criteria.",
    "For example, Nokia itself has achieved speeds of 8Gbps with Finnish operator Elisa. However this feat was achieved in a closed setting at Elisa’s store in Helsinki and by combining two Qualcomm smartphone form factor devices that reached 4Gbps each.",
    "In contrast, this latest trial involved the exclusive use of 5G New Radio (5G NR) technology, with Nokia’s AirScale base station connecting with a single mobile device to transfer data across Turk Telekom’s network in Ankara.",
    "The two companies say the high speeds demonstrate the potential for enhanced mobile broadband, new consumer applications and business use cases such as Industry 4.0.",
    "“Despite the launch of commercial 5G networks in many countries, 5G trials still play an important role in the development of faster and better networks,” said Tommi Uitto, President of Mobile Networks at Nokia.",
    "“This record speed, achieved together with our long-term partner, shows that we are constantly refining and improving how we build and manage 5G networks, and this is in no small part thanks to the nearly 200 5G trials, live operator networks and private wireless deployments we have delivered globally.”",
    "“These technologies also act as a bridge to develop and pave the way for ‘Terahertz’ systems that provide ultra-high speed and capacity, which are planned to be used in 6G.”",
    "Nokia has also been selected to provide standalone 5G (SA 5G) in Singapore. Non-standalone 5G (NSA 5G), which uses new radio technologies but still relies on the same core layer of the network as 4G.",
    "SA 5G uses a new virtual, cloud-based core that allows data to be processed closer to the point of collection and enables features like network slicing. This allows for guaranteed speeds, enhanced reliability and ultra-low latency.",
    "These characteristics will be essential for some of the most revolutionary 5G applications – including the Industrial Internet of Things (IIoT)."
  ],
  "headers": {
    "3": "5G speed record"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}