{
  "source": "https://www.techradar.com/news/ios-15-beta-4-upgrades-shortcuts-safari-and-magsafe-battery-pack-interactions",
  "title": "iOS 15 beta 4 upgrades Shortcuts, Safari, and MagSafe Battery Pack interactions",
  "category": "phones",
  "updated": "2021-07-28T22:27:10Z",
  "author": "david-lumb",
  "summary": "Apple released public beta 4 for iPadOS 15, watchOS 8, macOS Monterey, and tvOS 15",
  "article": [
    "Apple has released iOS 15 beta 4, along with the fourth rounds of the public betas for iPadOS 15, watchOS 8, macOS Monterey, and tvOS 15. If you’ve installed previous versions of the beta software, you can download this latest update for free.",
    "Each new round of public beta versions brings new features that are expected to come in full release versions of each software slated to release later this year.",
    "For iOS 15 beta 4, expect a variety of minor tweaks as pointed out by 9to5Mac, like updated icons – like, say, with the new MagSafe Battery Pack, which has a novel new icon in the battery widget – along with a new ‘Return to Home Screen’ Shortcut, Memory sharing in the Photos app, and the ability to turn off notifications while ScreenShare is on. Safari also has a couple slight alterations, like a rearranged ‘reload’ button that permanently sits on the bottom (in a tiny bar or in the navigation bar when it’s visible).",
    "In other words, not too much has changed, and the alterations are likely too small to notice - but collectively, we’re inching toward the dynamic changes coming in the next big OS versions that will probably arrive in September or October.",
    "And while these updates are arriving slowly, they’re also possibly giving Apple a chance to get feedback on big changes – the iPadOS 15 beta 4 allows users to choose between the all-in-one Safari navigation bar that collapses URL navigation and tabs into one bar, or to split them for a permanently-visible address bar atop tabs.",
    "It’s a subtle tweak, but a nice one for traditionalists who weren’t fans of Apple’s most radical change to Safari in years.",
    "While we all can’t wait to get our hands on the full versions of iOS 15 and other OS updates, we’re pleased with what we’ve tested of the iOS 15 beta so far.",
    "Hours after the first iOS 15 public beta dropped in June (just weeks after it was announced at WWDC 2021), we found plenty of fun new iOS 15 features we didn’t expect to see until the final version arrived in full alongside the iPhone 13 in September or October. Live Text analysis in the camera mode, Safari upgrades, translations in Messages, and even mundane but helpful improvements to Notifications were the big improvements up front, but in the weeks that followed, we’ve seen even more about iOS 15 that we’ve liked.",
    "If you click a link from a text message with a Contact that opens up in Safari or another app, there’s now a discreet little bar at the top-left that reminds you who sent it - perfect for the scatterbrained among us (like this writer) who become enraptured with an article and forget who sent it to us. The ability to fine-tune which notifications keep bugging you directly from the lock screen is also extremely helpful so users don’t have to dig into Settings to change them.",
    "We expect to find even more to like about iOS 15 public beta 4 and the other software previews in the weeks to come while we wait for the full versions to launch later this year."
  ],
  "headers": {
    "6": "Analysis: iOS 15 isn’t big, but it is better"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "macOS Monterey": "https://www.techradar.com/news/macos-12",
    "tvOS 15": "https://www.techradar.com/news/tvos-15",
    "9to5Mac": "https://youtu.be/AKy8o-nvjQw",
    "MagSafe Battery Pack": "https://www.techradar.com/news/apple-magsafe-battery-pack-iphone-12-launch",
    "iOS 15 features": "https://www.techradar.com/news/weve-used-ios-15-public-beta-for-a-day-and-its-already-better-than-ios-14",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13"
  }
}