{
  "source": "https://www.techradar.com/news/new-tcl-20-phones-debut-with-displays-you-can-see-clearly-through-sunglasses",
  "title": "TCL's new cheap phone has a screen that could revolutionize your sunny summer",
  "category": "phones",
  "updated": "2021-04-14T15:00:12Z",
  "author": "david-lumb",
  "summary": "The TCL 20 Pro 5G, TCL 20L Plus, and TCL 20L are all arriving soon.",
  "article": [
    "TCL started the year revealing the first two of its TCL 20-series phones at CES 2021, and now it’s unveiled the remaining three: the affordable TCL 20L, TCL 20L Plus, and the flagship TCL 20 Pro 5G.",
    "The phones all improve on their TCL 10 predecessors, with more true-to-life color in their displays and new tricks for each. Perhaps most exciting is the new display tech in the TCL 20L and TCL 20L Plus, a new polarization display tech that allows you to see the screen in full color while wearing tinted-lens sunglasses, which is active by default, no special mode required.",
    "There are other new perks, too: the TCL 20 Pro 5G adds 5G connectivity, of course, and a larger 6.67-inch display AMOLED display with Full HD Plus (2400 x 1080) resolution that automatically converts SDR content to HDR and has HDR10 playback for streaming content.",
    "The TCL 20 Pro 5G inherits its predecessor’s quad rear camera suite headed by a 48MP main shooter with AF and OIS, as well as ultra-wide, macro, and depth cameras flanked by a dual LED flash, though the Sony IMX582 sensor is new. While there’s no telephoto lens, the absence of a bulky zoom system allows the TCL 20 Pro 5G to keep its cameras flush with the back cover, no camera bump necessary.",
    "The phone runs on a Snapdragon 750G chipset, with 6GB of RAM and 256GB of storage (expandable up to 1TB via microSD), with a 4,500mAh battery and up to 18W wired charging and 15W wireless charging.",
    "The TCL 20 Pro 5G will come in one configuration and will be available in two colors – Moondust Gray and Marine Blue – starting April 15 in select European countries for £499 / €549 (around $655 / AU$855).",
    "The TCL 20L and 20L Plus are the more affordable of the bunch, with a few improvements of their own.",
    "Both phones pack 6.67-inch Full HD (2,400 x 1,080) displays and Snapdragon 662 chipsets, though the 20L Plus features slightly higher specs (6GB RAM to start and 256GB storage) compared to the 20L (starting at 4GB RAM and 128GB storage), though both have expandable storage up to 1TB via microSD. They each have a 5,000mAh battery, which is expansive, though don’t expect much in the way of fast charging. Both will launch with Android 11 and support one major operating system upgrade.",
    "The pair also have similar quad rear cameras (main, ultra-wide, macro, and depth), though again, the TCL 20L Plus has a slightly better-on-paper 64MP main camera compared to the 48MP in the TCL 20L. Both have a 16MP front-facing camera.",
    "Both phones will be available starting April 15 in select European countries, with the TCL 20L coming in Luna Blue and Ellipse Black colors to be priced at £199 / €229 (around $275 / AU$359), while the TCL 20L Plus arrives in Milky Way Grey and North Star Blue hues to cost €269 (around $320 / £235 / AU$420), though the latter won't reach the UK.",
    "A quick note that the TCL 20 Pro 5G and TCL 20L will be coming to the US at some point, but the middle sibling will be replaced by the TCL 20S regional variant, which should have similar design and features as the TCL 20L Plus."
  ],
  "headers": {
    "6": "TCL 20L and 20L Plus...or in the US, TCL 20S"
  },
  "links": {
    "revealing": "https://www.techradar.com/news/tcls-ces-2021-lineup-includes-the-cheapest-5g-phone-yet",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "TCL 20 Pro 5G": "https://www.techradar.com/reviews/tcl-20-pro-5g"
  }
}