{
  "source": "https://www.techradar.com/news/your-existing-cpu-cooler-might-not-work-with-intel-12th-gen-processors",
  "title": "Your existing CPU cooler might not work with Intel 12th-gen processors",
  "category": "computing",
  "updated": "2021-05-24T18:38:04Z",
  "author": "carly-page",
  "summary": "Report suggests Intel is planning a major socket redesign",
  "article": [
    "Intel Alder Lake will require brand new coolers when it launches later this year, according to Igor’s Lab.",
    "Adding weight to earlier rumors that existing coolers will not be compatible due to the “vastly different” LGA 1700 socket, the report suggests that Intel will also introduce a new V0 socket design.",
    "This socket, which will supersede the current H5 socket currently in use with LGA 1200, will feature an all-new mounting system and “deliberate” changes to the hole patterns for the screw and backplate.",
    "Not only will the V0 socket introduce a new hole pattern, which means it will be impossible to use existing liquid cooler brackets and mounting systems, but it also introduces a lower Z-stack height, which means it will sit much lower than Intel’s current CPUs.",
    "While this makes Alder Lake better suited to thin and light laptops, it also makes using existing coolers even more difficult.",
    "While frustrating for those with existing hardware, it's hardly surprising that Intel is planning such a shake-up with Alder Lake.",
    "Unlike previous CPU designs, the 12th-generation series will employ a combination of normal and low-power cores – a system similar to ARM’s big.LITTLE tech. The low-power cores will be more efficient and able to run the show when the system is idling or under little stress, the idea being that battery life can be saved as a result.",
    "The CPUs are also expected to include support for DDR5 and PCIe 5.0, with Intel Xe integrated graphics also expected to make an appearance.",
    "News of Intel planning a major socket change comes as rumors suggest that AMD is also planning a major design shakeup. PC Gamer reports that the shift from a pin grid array (PGA) design to an all-new land grid array (LGA) design with its next-generation AM5 socket.",
    "However, the rumors suggest that the AM5 socket will share the same 40mm x 40mm size as AM4, suggesting that existing CPU coolers should be compatible with little fuss.",
    "Via: PC Gamer"
  ],
  "headers": {},
  "links": {
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "Igor’s Lab": "https://www.igorslab.de/en/intels-alder-lake-s-with-boxed-kuehler-and-cryo-kuehler-velvet-peltier-element-exclusive-details-and-preview/",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "thin and light laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "PC Gamer": "https://www.pcgamer.com/cpu-coolers-may-require-a-rework-to-fit-intels-alder-lake-chips-later-this-year/"
  }
}