{
  "source": "https://www.techradar.com/news/ps-plus-free-games-for-march-include-final-fantasy-7-remake-and-maquette",
  "title": "PS Plus free games for March include Final Fantasy 7 Remake and Maquette",
  "category": "gaming",
  "updated": "2021-02-26T14:32:25Z",
  "author": "vic-hood",
  "summary": "It's a stellar PS Plus free games line up",
  "article": [
    "]Update: Sony has now confirmed these are March's PS Plus free games.]",
    "Sony has been knocking it out of the park with its PS Plus free games this year, and March 2021's lineup is no different. Final Fantasy 7 Remake and upcoming Maquette are among the games on offer.",
    "While Sony hasn't officially revealed March's PS Plus selection, it looks like the company accidentally leaked its announcement ahead of time on Facebook - but not before being spotted by games news aggregator Nibel on Twitter.",
    "According to the marketing image, PS Plus's March offering includes the critically-acclaimed Final Fantasy 7 Remake (PS4), upcoming romantic puzzler Maquette (PS5), third-person shooter Remnant: From the Ashes (PS4) and VR FPS Farpoint (PS4/PSVR).",
    "This is an absolutely fantastic lineup, and one PS Plus members absolutely shouldn't miss.",
    "Final Fantasy 7 Remake is the absolute highlight, given that it's one of the best PS4 games around and Sony has just announced that a Final Fantasy 7 Remake PS5 upgrade (called Intergrade) will be released on June 10. It sounds like owners of the PS Plus version won't get the upgrade, though, which is the only downside.",
    "But don't sniff at the other titles on offer. Maquette is a first-person recursive puzzler from Annapurna Interactive (the publisher behind What Remains of Edith Finch) that will be available on PS Plus from its launch day, March 2. We've played Maquette, and thought it was a whimsical romance certain to please rom-com and puzzle fans. In addition, Remnants: From the Ashes is a solid third-person shooter while Farpoint is on our list of the best PSVR games.",
    "Remember, though, that you can also play any of these PS4 games on PS5 through backwards compatibility - the only exception is that PS4 players won't be able to play Maquette, which is a native PS5 title.",
    "You need to be an active PlayStation Plus subscriber to pick up these free PS Plus games – and they're yours to play whenever you want as long as you remain a subscriber.",
    "Being a PS Plus subscriber means you can play online with friends, but also lets you take advantage of discounts and free games each month. It's a great way to try PlayStation games you might not otherwise have played, whether they're indie titles that slipped under your radar, or titles that were too expensive to buy at launch. Each month we see Sony offering a mix of PS4 and PS5 games, so it's worth getting even if you haven't upgraded yet.",
    "All these games will be available from March 2 until April 5, 2021."
  ],
  "headers": {
    "4": "A stellar line-up"
  },
  "links": {
    "confirmed": "https://twitter.com/PlayStationUK/status/1365287323420737538",
    "PS Plus free games": "https://www.techradar.com/news/playstation-plus-free-games",
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "Maquette": "https://www.techradar.com/news/maquette-is-a-whimsical-romance-to-please-rom-com-and-puzzle-fans",
    "best PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "Final Fantasy 7 Remake PS5 upgrade": "https://www.techradar.com/news/final-fantasy-7-remake-ps5-upgrade-brings-new-story-content-and-visual-upgrades",
    "whimsical romance certain to please rom-com and puzzle fans": "https://www.techradar.com/news/maquette-is-a-whimsical-romance-to-please-rom-com-and-puzzle-fans",
    "best PSVR games": "https://www.techradar.com/best/best-playstation-vr-games"
  }
}