{
  "source": "https://www.techradar.com/news/spider-man-no-way-home-nearly-wasnt-a-multiverse-movie",
  "title": "Spider-Man: No Way Home nearly wasn't a multiverse movie",
  "category": "entertainment",
  "updated": "2021-12-09T10:19:27Z",
  "author": "tom-power",
  "summary": "Spider-Man: No Way That's Going to Happen",
  "article": [
    "Spider-Man: No Way Home nearly wasn't the multiversal Marvel movie that fans will actually see in theaters, according to the film's cast.",
    "Speaking to Collider ahead of the flick's release, stars Tom Holland and Zendaya revealed that the webhead's third MCU adventure was almost completely different to what we'll soon see.",
    "Revealing that she had, alongside Holland and co-star Jacob Batalon, known about Marvel's Phase 4 plans to introduce the multiverse for a \"couple of years\", Zendaya admitted that she didn't think such a movie could be pulled off.",
    "\"When I first heard about [the multiverse], I was like, 'okay cool, but that’s definitely not going to happen',\" the Euphoria and Dune actor explained.",
    "Thankfully, Marvel and Sony were able to accomplish their goal. But, as Holland later revealed, there were worries that Spider-Man: No Way Home's plot was too aspirational, even for two heavyweight film studios. As such, a back-up plan was created by director Jon Watts – and his 'plan B' would have included the live-action debut of another classic Spider-Man villain.",
    "\"For a long time, there was going to be a Kraven movie that was going to be the third movie,\" Holland admitted. \"Because things weren’t working out and all sorts of different stuff. Jon pitched me this Kraven movie, which actually was really cool. I don’t want to talk about it in case that movie ends up happening down the line, but it was fun.\"",
    "With Sony pressing ahead with a Kraven solo movie, one which will star Aaron Taylor-Johnson (Avengers: Age of Ultron, Godzilla), it seems that Spidey's potentially third MCU film has been repurposed by the studio. Here's hoping the webslinger and Kraven clash down the line, then.",
    "Potentially but, in the end, we think Sony and Marvel made the correct decision to leave Kraken out of proceedings.",
    "Yes, it would have been very cool to see a live-action incarnation of the Sinister Six take on Holland's Spider-Man. The Sinister Six were supposed to appear in Andrew Garfield's Spider-Man trilogy in the 2010s but, after Garfield's Spider-Verse was killed off, those plans were naturally shelved.",
    "There was, though, the possibility of introducing the Sinister Six in Spider-Man: No Way Home. There are already five villains set to show up in the film – Green Goblin, Doc Ock, Electro, Sandman and Lizard – so, from the point of view of many fans, adding one more into the equation wouldn't have been a huge stretch.",
    "In our view, however, No Way Home is already jam-packed with enough characters. Alongside Spider-Man, that quintet of villains, Zendaya's MJ and Batalon's Ned, there are nine other supporting characters – including Doctor Strange (Benedict Cumberbatch), Aunt May (Marisa Tomei) and J. Jonah Jameson (J.K. Simmons) – who have been squeezed into its rumored two hour and 30 minute runtime.",
    "Add in the prospect of three other potential inclusions in Charlie Cox's Matt Murdock, and former Spider-Man actors Tobey Maguire and Garfield, and No Way Home is stuffed to the rafters.",
    "Spider-Man 3, which launched in 2007, and 2014's Amazing Spider-Man 2 were guilty of cramming too many characters into their story, making for overstuffed films that were panned by fans and critics. And, while many film aficionados are excited for No Way Home's arrival, there is the odd murmuring that it could befall a similar fate.",
    "No Way Home's advantage over its predecessors, though, is that every one of its cast members are already established Spider-Man live-action characters. We don't need their origin stories or motives explained at length, which will help with the movie's pacing.",
    "Introducing a brand-new character in Kraven, however, would have changed that. Choosing not to include him in No Way Home, then, was actually the right call to make. Sure, we finally would have seen the Sinister Six appear in a Spider-Man live-action film. But, considering No Way Home has enough characters as it is, we can wait a bit longer for Kraven to team up with his fellow villains and tackle Spidey in a future film instead."
  ],
  "headers": {
    "7": "Analysis: should Spider-Man: No Way Home have included Kraven anyway?"
  },
  "links": {
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Marvel movie": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Collider": "https://collider.com/spider-man-no-way-home-kraven-the-hunter-tom-holland-comments/",
    "Marvel's Phase 4": "https://www.techradar.com/news/marvel-phase-4",
    "pressing ahead with a Kraven solo movie": "https://www.techradar.com/news/sonys-next-spider-man-spin-off-movie-has-found-its-lead-star",
    "Charlie Cox's Matt Murdock": "https://www.techradar.com/news/spider-man-no-way-home-fans-cant-agree-on-the-identity-of-a-new-mystery-character",
    "Spider-Man actors Tobey Maguire and Garfield": "https://www.techradar.com/news/spider-man-no-way-home-trailer-5-things-you-may-have-missed"
  }
}