{
  "source": "https://www.techradar.com/news/technology-and-the-future-of-work-bridging-the-digital-connect",
  "title": "Technology and the future of work: bridging the digital connect",
  "category": "computing",
  "updated": "2021-04-22T10:48:35Z",
  "author": "matt-smith",
  "summary": "Technology and the future of work",
  "article": [
    "Digital technology has done much to help life carry on as near to normal as possible under lockdown. Video conversations with customers and colleagues are now taken for granted, while cloud-based document-sharing apps allow ongoing co-operation and collaboration. But opinions differ on how technology will continue to affect the workforce once this has all - eventually - blown over.",
    "A recent report from Citrix looking at work in the year 2035, suggests a marked disconnect between how business leaders and employees view their roles in the future, and how advances in technology will impact their job security. Of course, for businesses to operate effectively, it’s vital that they address this digital disconnect, and bring the views of leadership and employees closer together to help ensure everyone is working towards a future they can all believe in.",
    "AI is an increasingly popular means of improving business efficiencies, automating and optimizing various aspects of an organization’s operations. Half of the respondents to a 2020 survey by McKinsey said their organization had adopted AI in at least one function. According to the report, though, workers don’t share the same level of enthusiasm for the technology as their employers.",
    "For example, the majority of business leaders (89%) anticipate that AI-powered digital workspaces - integrated technology frameworks that allow employees to access their apps and data in real-time, on any device, and from any location - will increase employee productivity over the next 15 years. Only just over half of employees share that sentiment, however. Similarly, while almost three quarters of business leaders (73%) believe AI will make workers at least twice as productive by 2035, only 39 percent of those workers agreed.",
    "Bridging this particular disconnect will require leaders to better communicate the advantages of AI to their employees - especially with regard to productivity.",
    "According to the report, more than two thirds of business leaders see wearable technology becoming a feature of the workplace by 2035. Surprisingly, perhaps, given that health and fitness trackers are already a large part of many people’s personal lives, fewer than half of the employees surveyed agree with this vision.",
    "This may be a case of business leaders putting their money where their mouths are. After all, employees appear to be willing to embrace technological augmentation as long as they understand the benefits and risks it represents. Leaders can help encourage this willingness by painting a positive portrait of a future in which such technologies will benefit employees.",
    "Employees like to believe that advances in technology will mean the evolution of their current jobs, and the emergence of new roles. At the same time, though, they fear being replaced. Business leaders tend to be more optimistic; 70 percent believe technology will lead to the creation of new roles like AI trainers, advanced data scientists, and privacy managers. Conversely, only a third of employees think this will be the case. The same is true when it comes to the creation of new functions such as cybercrime response units, and AI management departments. Over three quarters of leaders see this in their organization’s future, compared to less than half of employees.",
    "Leaders can tackle this disconnect proactively when reskilling and upskilling employees, doing what they can to assure them of the opportunities that lie ahead as a result of technological developments. Interestingly, more employees (33%) believe technology may partially or completely replace business leaders than do leaders themselves (7%). Most leaders (74%) instead predict only a partially augmented C-suite. But, while their ability to demonstrate empathy and vision - traits that AI simply can’t emulate - will ensure they remain relevant, leaders shouldn’t grow complacent. The pace at which the technology is evolving means that, by 2035, it will almost certainly be possible to offload some executive functions to AI.",
    "There’s concern, too, about the rising popularity of companies such as Uber, Airbnb, and Deliveroo. This has led to warnings by labor experts and governments that the growing gig economy may one day spell the end of full-time employment as we know it. Once again, the views of business leaders and employees on this topic couldn’t be further apart.",
    "Less than one in five leaders (19%) believe permanent employment will be a thing of the past by 2035, with only a fifth of their workforce made up of non-permanent employees such as contractors and on-demand workers. In contrast, three in five employees expressed concern that full-time positions will become a rarity; almost two-thirds (64%) believe that most high-value positions will be taken by freelancers. This is a belief shared by less than two in five (39%) business leaders, however.",
    "As with advanced technology, workers are clearly anxious that the gig economy labor model represents a threat to their future employment. Leaders should listen to these anxieties, and move forward with recruitment strategies that calm, rather than aggravate them.",
    "It’s clear from the examples above that a deep divide exists between how business leaders and employees see the impact technology will have on the future of work. While leaders anticipate a productive, complementary relationship with technology, and AI in particular, employees see it as a direct competitor. Leaders must, therefore, communicate a compelling vision of a future in which technology adds value to an employee’s work, rather than threatening their job security. They must redesign workplaces around technology that improves productivity, and they must address the reskilling, upskilling, and augmentation need to elevate their workforce.",
    "The Coronavirus pandemic has demonstrated the ability of organizations everywhere to adapt and innovate. Embracing new and different technologies has enabled many to survive in these trying time. But businesses - and the technologies they use - will continue to change. By addressing the concerns of their employees now, leaders can help ensure their company is prepared for the future and whatever it might hold."
  ],
  "headers": {
    "2": "AI and productivity",
    "5": "Augmented employees",
    "7": "Emerging roles",
    "9": "Threat to employment",
    "12": "Compelling vision"
  },
  "links": {
    "Video": "https://www.techradar.com/best/best-video-conferencing-software",
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "apps": "https://www.techradar.com/best/best-apps-to-share-files-securely",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "wearable technology": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074"
  }
}