{
  "source": "https://www.techradar.com/news/the-next-big-thing-in-networking-technology",
  "title": "The next ‘big thing’ in networking technology",
  "category": "computing",
  "updated": "2021-02-25T14:58:31Z",
  "author": "john-vladimir-slamecka",
  "summary": "The convergence of SD-WAN, security and cloud",
  "article": [
    "Technology shifts are happening more quickly now that any time in my 30+ year career in the connectivity business. Where people connect from, how they connect and what they connect make up one of the biggest challenges facing the world’s largest multi-national corporations in 2021.",
    "There’s an ever-growing need for greater bandwidth. Business leaders also want to drive down cost. And now we have an army of remote workers numbering in the millions around the world. The likelihood is that many will continue to have some form of flexibility about where they work in the future, which means there’s a permanent problem to solve: the sheer numbers of people sitting outside of the traditional corporate network using the internet to access resources via cloud computing, and how to optimize users’ experience and to help protect them and the data they use.",
    "In recent years companies have adopted SD-WAN technology to help them better manage their network traffic and applications. The businesses who were well down that road have arguably been able to respond better to the impact of a global pandemic. The additional smart network layer allows much more flexibility in managing enterprise IT infrastructure, as well as providing a good platform for remote workers to access corporate assets, but it doesn’t stop there. The need to approach holistically on how to wrap the distributed ecosystem in a security umbrella, is key in safeguarding these assets. And here’s why.",
    "The best user experience comes from accessing the cloud resource via the shortest path possible, which is rarely achieved by routing traffic through the data center. When the traffic doesn’t flow through the data center, it will not be protected by perimeter security devices hosted there, such as firewalls. Administrators need the ability to enforce consistent security policies wherever the user is: office, home or local coffee shop and regardless of being connected to the network via VPN.",
    "There is also a need for what we call zero trust network access. Zero Trust assumes that traditional access credentials are no longer sufficient to accurately establish trusted identities for user, device and application access. Rather, organizations should undertake continuous, risk-informed assessment of those component parts entities with granular security controls to manage, monitor, and enforce access. This solution grants access only to the specific applications users require to complete their job duties, which in turn reduces the number of users that have access to sensitive data.",
    "As we look ahead, the fully formed solution that comes from intertwining these elements in networking and cybersecurity technology is what’s being dubbed SASE (pronounced sassy). The term, which stands for Secure Access Service Edge, was coined by leading analyst firm Gartner in 2019. Essentially, it’s an architecture that combines wide area network (WAN) technology with comprehensive security functions. It encourages businesses to begin consolidating these functions through fewer vendors in order to centralize visibility, simplify management, and potentially reduce costs.",
    "Let’s rewind a few years to when SD-WAN technology began to emerge. Promises were made about savings and simplification. The reality proved to be something different in the early stages. AT&T has been at the center of many complex, global transformation projects and, as a result, we’ve learned some of the positives and pitfalls. With the level of complexity in a modern, digital network, many companies choose a managed SD-WAN service. SDWAN is a key component of the SASE architecture. AT&T provides subject matter experts to help navigate that difficult path of integrating the right solutions for the customer.",
    "Marry that with managed security and our relationships with the major cloud providers, and AT&T is well-placed to be a trusted advisor for a SASE implementation. Our ability to deliver large, multi-year and multi-continent design and deployment of new infrastructure is well proven.",
    "Many envision SASE as being a from a single vendor or possibly a single platform, but experience has taught that technology which may appear to deliver simplicity is often complex to implement and manage, especially when scaling up for a global organization.",
    "The full SASE suite is not yet known. Most of you will probably adopt more than one technology vendor and a hybrid model in the initial stages, where traditional networking and security systems can handle existing connectivity between data centers and existing sites, leaving SASE to take care of new connections, devices, users, and locations.",
    "Early in 2020, the convergence of SD-WAN, security and cloud was several years down the road. However, the global pandemic has raised the bar on business continuity, and the next stage of digital transformation is coming much sooner than many of us in this industry expected it.",
    "In data heavy sectors where security is critical, SASE will likely provide a better, safer, user-friendly experience. It will also allow companies to respond faster to crises, minimizing the impact the crisis has on the enterprise. And it will better position companies to take advantage of other technologies, such as 5G and edge computing. SD-WAN leadership, a strong cybersecurity managed service position, and strategic alliances with cloud providers are the necessary keys. The ability to integrate the right blend of solutions to deliver business value is also important. The technical know-how and the ability to stay ahead of technology trends to simplify the customer experience will carry the load.",
    "AT&T teams across the globe bring all of that and more, and stand ready to support you, our customers, with your digital transformation."
  ],
  "headers": {
    "3": "Zero trust network access",
    "6": "Sassy technology",
    "10": "Digital transformation is coming soon"
  },
  "links": {
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-migration-tools",
    "IT infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "firewalls": "https://www.techradar.com/best/firewall",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "business continuity": "https://www.techradar.com/best/best-disaster-recovery-service",
    "5G": "https://www.techradar.com/best/best-5g-phones"
  }
}