{
  "source": "https://www.techradar.com/news/iphone-13-range-could-be-thicker-but-with-all-sorts-of-upgrades",
  "title": "iPhone 13 range could be thicker, but with all sorts of upgrades",
  "category": "phones",
  "updated": "2021-06-03T09:07:34Z",
  "author": "james-rogerson",
  "summary": "Bigger batteries means fatter phones",
  "article": [
    "Not so long ago we heard that the iPhone 13 range might have bigger batteries than the iPhone 12 range, and now we’re hearing that – predictably – that’s made the phones thicker too.",
    "We’re not sure exactly how much thicker, but leaker Jon Prosser claimed that based on the latest, most up to date CAD (computer-aided design) files that he has for the iPhone 13 and iPhone 13 Pro, they’re “slightly” thicker. So hopefully this won’t be too noticeable a change, but even if it is, we’d take that for improved battery life.",
    "The reportedly thicker design backs up the claim of bigger batteries, since we can’t see why else Apple would fatten up the range. All of this also supports rumors of 120Hz refresh rate screens, since those are harsh on battery life, so Apple would likely look to make improvements there before offering them.",
    "And speaking of those CAD files, Prosser has made them available to download, so you can check them out for yourself. Links can be found in the description of his latest Front Page Tech YouTube video.",
    "Other visible details on the CAD files include the rumored smaller notch and a new diagonal camera layout for the iPhone 13 (which is also expected for the iPhone 13 mini), but these are things that we’ve heard plenty before.",
    "In other iPhone 13 news, MacRumors has seen an investor note from Wedbush analyst Daniel Ives, in which he claims that some iPhone 13 models (likely the iPhone 13 Pro and Pro Max) might have up to 1TB of storage, which would be double what you can get with the iPhone 12 range.",
    "This is a claim that both he and Prosser have made before, but he seemingly hasn’t changed his mind in the months since. Ives also claims here that all four iPhone 13 models will have LiDAR scanners. This is another detail that we’ve heard a bunch, but the more we hear it the more likely it is to be accurate.",
    "At this point all of these claims seem likely, but nothing is certain yet, and nor will it be until the iPhone 13 range lands, likely in September. In the meantime, TechRadar will be sure to bring you all the credible leaks and rumors about Apple's upcoming phones.",
    "Via Tom's Guide"
  ],
  "headers": {
    "5": "More storage for some and LiDAR for all"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "have bigger batteries": "https://www.techradar.com/news/iphone-13-battery-leak-shows-improvements-but-its-still-not-great",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "rumors of 120Hz refresh rate screens": "https://www.techradar.com/news/iphone-13-display-production-is-rumored-to-be-underway-with-120hz-support",
    "Front Page Tech YouTube video": "https://www.youtube.com/watch?v=0zNFkc01Pvw",
    "rumored smaller notch": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "diagonal camera layout": "https://www.techradar.com/news/iphone-13-colorized-renders-show-smaller-notch-and-rearranged-rear-cameras",
    "MacRumors": "https://www.macrumors.com/2021/06/03/iphone-13-1tb-storage-lidar-wedbush/",
    "we’ve heard a bunch": "https://www.techradar.com/news/every-iphone-13-model-might-have-a-lidar-scanner-for-improved-ar",
    "Tom's Guide": "https://www.tomsguide.com/uk/news/iphone-13-cad-files-leaked-get-yours-now"
  }
}