{
  "source": "https://www.techradar.com/news/canon-rumored-to-be-launching-the-cheapest-ever-full-frame-camera",
  "title": "Canon rumored to be launching the cheapest ever full-frame camera",
  "category": "cameras",
  "updated": "2021-07-15T10:17:57Z",
  "author": "mark-wilson",
  "summary": "Is a $799 successor to the Canon EOS RP in the works?",
  "article": [
    "If most full-frame cameras are a little too pricey for your liking, Canon might just have a solution in the works – it's rumored to be preparing a full-frame body that would cost just $799.",
    "According to what Canon Rumors describes as a \"pretty solid source with a decent track record\", Canon is \"aiming to release a full-frame RF mount camera for under $800 USD in 2022\". Using Canon's current pricing as a benchmark, that would likely work out at around £899 / AU$1,450.",
    "This would likely make the unnamed camera the spiritual successor to the Canon EOS RP, a full-frame camera that arrived in February 2019 for only $1,299/ £1,399 (including the EF-EOS R mount adaptor), or AU$2,099 (body-only). At the time, it was the cheapest ever full-frame body at launch, so this rumored camera could inherit that record, if it does indeed hit that new low price.",
    "The only downside to this rumor is how far away the camera is likely to be. There are no rumored specs yet, with Canon Rumors saying the camera is \"likely at least a year away\", so we could be looking at a mid-2022 launch. But the usually reliable site certainly seems pretty confident that it's at least in the works.",
    "The move would certainly make a lot of sense, in theory. So far, Canon's RF-mount system has largely focused on higher-end bodies and lenses, with the notable exception of the Canon EOS RP. That camera arrived for less than half the price of the Canon EOS R (Canon's debut mirrorless camera) and remains its smallest and lightest interchangeable-lens camera with a full-frame sensor.",
    "But the Canon EOS RP is starting to show its age, with slightly dated autofocus and slow 5fps burst shooting powers that mean it's not ideal for sports or wildlife shooting. Crucially, its video powers also feel a bit last-gen, with its 4K/24p mode involving a large crop that inhibits its utility as a vlogging companion.",
    "In order to hit that rumored $799 price tag, Canon would naturally have to do some serious corner-cutting. For example, the Canon EOS RP lacked in-body image stabilization (IBIS), an increasingly common feature that's useful for both handheld photography and video.",
    "The EOS RP also uses a modified version of the sensor seen in the Canon EOS 6D Mark II DSLR, which arrived way back in June 2017. So some repackaging of old components is to be expected, as is a lack of weather-proofing and caps to both autofocus performance and video shooting.",
    "But despite a lack of these bells-and-whistles, an entry-level Canon EOS R-series camera could be a compelling alternative to APS-C cameras like the Fujifilm X-series.",
    "Two of the main drawbacks of full-frame cameras, compared to crop-sensor alternatives, is their size and cost – and a Canon EOS RP successor with a sub-$1,000 price tag could go some way to resolving both of those.",
    "When the Canon EOS RP launched, another limitation was a lack of native RF lenses, particularly affordable ones that matched the camera's budget price tag. This was why it was bundled with the EF-EOS R adaptor, for using it with older DSLR lenses.",
    "But Canon has started to add more affordable glass to its RF lineup, including the recent Canon RF 600mm f/11 STM and 800mm f/11 STM, which could again boost the appeal of an affordable full-frame body.",
    "One thing this rumor does call into question, though, is the speculation that Canon might be preparing to launch one or more EOS R-series cameras with smaller APS-C sensors. Last month, rumors emerged about a Canon EOS R7 and Canon EOS R8, which were expected to replaced the existing Canon EOS-M series.",
    "But if a $799 full-frame mirrorless model did arrive, it seems unlikely that Canon would also bring out a range of APS-C siblings at similar price points. Right now, it seems the cheap full-frame EOS R camera rumors have come from a stronger source than earlier speculation about possible APS-C models, but we'll hopefully get a clearer indication of the way Canon is headed soon."
  ],
  "headers": {
    "6": "Is Canon sticking to full-frame?"
  },
  "links": {
    "full-frame cameras": "https://www.techradar.com/news/best-full-frame-camera",
    "Canon Rumors": "https://www.canonrumors.com/canon-aiming-for-a-799-full-frame-camera-cr2/",
    "Canon EOS RP": "https://www.techradar.com/reviews/canon-eos-rp-review",
    "Canon EOS R": "https://www.techradar.com/reviews/canon-eos-r-review",
    "Canon EOS 6D Mark II DSLR": "https://www.techradar.com/reviews/canon-eos-6d-mark-ii-review",
    "rumors emerged about a Canon EOS R7 and Canon EOS R8": "https://www.techradar.com/news/canon-eos-r7-and-eos-r8-rumors-hint-at-the-end-for-eos-m-mirrorless-cameras"
  }
}