{
  "source": "https://www.techradar.com/news/amds-rdna-3-flagship-gpu-could-be-one-step-closer-to-launch",
  "title": "AMD’s RDNA 3 flagship GPU could be one step closer to launch",
  "category": "computing",
  "updated": "2021-10-29T09:45:27Z",
  "author": "darren-allan",
  "summary": "Being taped out is an important milestone",
  "article": [
    "AMD is rumored to have reached an important milestone with its RDNA 3 graphics cards. Well-known leaker Greymon shared the info on Twitter, asserting that Team Red’s next-gen flagship GPU has apparently been taped out.",
    "That means the design of the GPU has been finalized and it’s all ready to go, with AMD’s next step being to actually manufacture the chip and begin the process of testing and revising.",
    "It’s an important step forward with the realization of RDNA 3, and one that seemingly has AMD pegged as on track for what should be a Q4 2022 debut for its next-gen graphics cards (which should be the RX 7000 series, logically).",
    "There’s a lot of excitement around what AMD might have in its GPU war chest for the next time around, and indeed we’ve previously heard on the grapevine that the RDNA 3 flagship could be stupidly powerful, with a purported 15,360 cores (and an all-new MCM or multi-chip module configuration, potentially). These are very early rumors, though, so heavy on the salt as ever.",
    "If this latest nugget of speculation is correct, then AMD has now finished the design for the flagship, and before too long, should have engineering samples ready to roll. Given all that, we can probably expect some more substantial leaks to emerge in the near future, giving us a better idea of whether those mentioned early rumors are on the money, or exaggerated.",
    "The same is true of some of the more worrying bits and pieces the rumor mill has spun out thus far on the topic of RDNA 3, namely its power consumption. That thread of rumors holds that the power demands of the GPU could be in excess of 400W, and maybe up to 450W, which will be a serious drain (and might even necessitate some gamers upgrading their PC with one of the best PSUs, a further expense on top of already very pricey cards).",
    "Bear in mind, though, that Nvidia’s next-gen graphics cards could end up being at least as – or even more – demanding power-wise, or that’s been the theory thus far. Let’s hope exaggeration is at play here, for sure.",
    "Via Wccftech"
  ],
  "headers": {
    "4": "Analysis: More leaks on the horizon soon, then?"
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "what should be a Q4 2022": "https://www.techradar.com/news/amds-still-on-target-to-release-zen-4-cpus-and-rdna-3-gpus-in-2022",
    "RX 7000 series": "https://www.techradar.com/news/nvidias-rtx-4000-gpus-promise-a-huge-performance-leap-but-amd-rdna-3-might-outdo-them",
    "RDNA 3 flagship could be stupidly powerful": "https://www.techradar.com/news/amds-rdna-3-flagship-gpu-could-be-ridiculously-powerful-but-at-what-cost",
    "MCM or multi-chip module configuration": "https://www.techradar.com/news/amd-patent-points-to-new-mcm-gpu-chiplet-technology",
    "thread of rumors": "https://www.techradar.com/news/amd-and-nvidia-next-gen-flagship-gpus-could-force-you-into-a-psu-upgrade",
    "best PSUs": "https://www.techradar.com/news/best-pc-power-supply",
    "Wccftech": "https://wccftech.com/amds-flagship-navi-31-gpu-based-on-next-gen-rdna-3-architecture-has-reportedly-been-taped-out/"
  }
}