{
  "source": "https://www.techradar.com/news/masters-of-the-universe-revelation-part-1-is-the-subversive-revival-that-he-man-deserves",
  "title": "Masters of the Universe: Revelation Part 1 is the subversive revival that He-Man deserves",
  "category": "entertainment",
  "updated": "2021-07-21T15:00:00Z",
  "author": "tom-power",
  "summary": "Netflix’s Masters of the Universe: Revelation Part 1 does justice to the original He-Man animated show",
  "article": [
    "Before Marvel and Warner Bros. dominated the global box office with their respective cinematic universes, fans of a certain age turned to animated TV shows to get their non-comic book superhero fix.",
    "Even a decade before X-Men and Batman’s hugely popular animated series arrived, though, kids (and some adults) tuned into 1980s animated shows, including ThunderCats and Transformers, to watch powerful beings duel in the eternal battle between good and evil.",
    "Such franchises, fuelled by the nostalgia of present-day industry veterans, have since been rebooted to varying degrees of success – including another 1980s property in He-Man. The popular animated series, based on toy company Mattel’s line of products, has been adapted on many occasions since the original series ended in 1985, but subsequent revivals have failed to live up to their predecessor.",
    "Now, it’s Netflix’s turn to try and breathe new life into He-Man. Created by Kevin Smith (Clerks, Jay and Silent Bob) for the streaming giant, Masters of the Universe: Revelation Part 1 looks to recapture what made the original animated show so popular while modernizing it for today’s audience.",
    "Both long-time fans and newcomers, then, will be pleased to read that Masters of the Universe: Revelation Part 1 is not only a superbly animated, action-packed and heartfelt revival of the series, but one that’s a surprisingly subversive reinvention of the original’s formula.",
    "A direct sequel to the 1980s show, Revelation Part 1 follows the adventures of He-Man (Chris Wood), Teela (Sarah Michelle Gellar) and other Castle Grayskull guardians as they attempt to fend off another attack from Skeletor (Mark Hamill) and his evil army from Snake Mountain.",
    "However, when a cataclysmic event – due to Skeletor’s latest skirmish – threatens to destroy Eternia and the planets that feed off its magical aura, heroes and villains reluctantly join forces to locate the missing Sword of Power and save the universe.",
    "What’s immediately apparent is Revelation isn’t your typical He-Man storyline.",
    "With characters including Teela and Orko (Griffin Newman) forced to team up with nemeses such as Evil Lyn (Lena Headey) and Beast Man (Kevin Michael Richardson), Revelation Part 1 immediately subverts viewers’ expectations.",
    "Gone are the days of good and evil duking it out to protect and destroy Castle Grayskull respectively and, in its place, an uneasy alliance is formed for the greater good. It’s not a particularly novel plot device for Revelation Part 1 to use but, given how the animated series has always pitted He-Man and Skeletor’s forces against each other, it makes for intriguing viewing to see them join together for a common cause.",
    "The subversion doesn’t end with the series plot, either. Unlike the 1980s animated show, He-Man fans may have noticed that the titular character’s name isn’t part of Revelation Part 1’s title – and with good reason.",
    "Taking a page out of Netflix’s He-Man animated spin-off series She-Ra and the Princesses of Power, Revelation Part 1 installs Teela, a female character, as its protagonist.",
    "Initially, it feels strange to watch Teela take center stage in a series that’s based on He-Man, but it works.",
    "Revelation Part 1’s focus on strong, badass female characters – Evil Lyn and Lieutenant Andra (Tiffany Smith) are also prominent throughout its story – updates He-Man for the modern age, and it doesn’t feel like a token gesture. Smith has crafted a story that puts He-Man’s female characters front and center, and it empowers these individuals in a way that the original series didn’t.",
    "Combine this with shades of the series’ 80s-style humor and action, and Revelation Part 1 feels like a TV show that newcomers can enjoy as much as longtime He-Man fans.",
    "Revelation Part 1’s plot and change in protagonist help to usher He-Man into the 21st century, but what of the voice cast?",
    "Some established fans may worry that those hired to voice the series' characters won’t be able to live up to those that came before but, thankfully, Revelation Part 1 is stacked with big names – and they do a stellar job of bringing He-Man’s various heroes and villains to life.",
    "Sarah Michelle Gellar (Buffy the Vampire Slayer) and Lena Headey (Game of Thrones) bring strength and emotional depth to Teela and Evil Lyn respectively, while the likes of Mark Hamill (Star Wars, Batman), Liam Cunningham (Game of Thrones) and Kevin Michael Richardson (Invincible, Like Family) bring their immediately recognizable voices to the table as Skeletor, Man-at-Arms and Beast Man.",
    "Throw in other notable names including Chris Wood (Supergirl) as He-Man/Prince Adam, Kevin Conroy (Batman) as Mer-Man and 1980s He-Man star Alan Oppenheimer as Moss Man, and the cast is as strong as they come.",
    "Big names are needed to do justice to each character’s story arc, too.",
    "Without spoiling anything, certain individuals take a back seat throughout the plot, providing the opportunity for the show’s supporting cast to undergo sizable character development that wasn’t always prevalent in the original series.",
    "It makes for interesting viewing, particularly when characters are paired together out of necessity and end up learning something from one another, whether that’s a life lesson or seeing things from another perspective.",
    "These occasional heart-to-hearts are also the backbone for Revelation Part 1’s most important themes.",
    "Revelation Part 1 is more mature than its predecessor – its 12 rating and violence warning are proof of this – and examines more adult topics including existentialism, death, trauma, the extent to which we can shape our own destiny, and nature versus technology.",
    "Exploring these subjects shows how far animated shows have come since the 1980s, and while Revelation Part 1 retains some of the campiness that made He-Man such a hit nearly 40 years ago, it’s indicative of the growth that animated series have undergone since then.",
    "Masters of the Universe: Revelation Part 1 is a terrifically subversive revival of He-Man’s animated series. It simultaneously gets the tone of the show right through its call backs (the iconic phrases and music are all here) while fleshing out the series’ world and characters in a way that wasn’t possible four decades previously.",
    "Some viewers may be a tad confused about who everyone is, or what is going on, particularly as Revelation Part 1 – Part 2 is due for release later this year – only consists of five 25-minute episodes. It isn’t necessary to watch the original’s two seasons beforehand, but it may help newcomers to immerse themselves in the He-Man universe before they stream this new instalment.",
    "That Revelation Part 1 packs so much into its near three-hour runtime, though, is testament to Kevin Smith and Netflix’s ability to reinvent He-Man as an animated show. It’s well paced, doesn’t feel rushed or too bogged down in its semantics, and its shocking ending will leave you immediately wanting more.",
    "Established fans and newcomers alike, then, will get a kick out of this simultaneously nostalgic and modern take on the He-Man legend. If you’re looking for your next animated binge watch, Masters of the Universe: Revelation Part 1 should be at the top of your list.",
    "Masters of the Universe: Revelation Part launches exclusively on Netflix on Friday, July 23."
  ],
  "headers": {
    "5": "By the power of Grayskull",
    "15": "I have the power",
    "25": "What we think"
  },
  "links": {}
}