{
  "source": "https://www.techradar.com/news/androids-airdrop-equivalent-is-about-to-get-a-lot-better",
  "title": "Android's AirDrop equivalent is about to get a lot better",
  "category": "phones",
  "updated": "2021-04-13T15:12:19.814Z",
  "author": "harry-domanski",
  "summary": "Google to introduce broader accessibility to Nearby Sharing",
  "article": [
    "Midway through 2020, Google started finally rolling out Nearby Share to Android phones – the tech giant's answer to Apple's AirDrop. Now, further details have surfaced about what's next for the local wireless file sharing feature.",
    "Currently, it's only possible to use this feature with one person at a time, and they must be a contact in order for the file sharing to work. However, as discovered by 9to5Google, Google will soon be adding the option to share to 'everyone'.",
    "At present, when turning on Nearby Sharing, users see the option to share with 'all contacts', 'some contacts', or to remain 'hidden' – the upcoming update will add the ability to share with 'everyone', in much the same way that Apple's AirDrop feature works.",
    "To prevent various shenanigans when opening up your phone to public sharing, Google will also be implementing a 'temporary mode' that only enables this 'everyone' setting for five minutes before reverting to the default.",
    "What's more, multiple people can be selected as recipients for the file sharing feature rather than having to do so one at a time. Despite this, the files will still be transferred sequentially, but without the added step of going through the same process for each included user.",
    "While it's generally the case that the Android platform is responsible for debuting many new features before Apple adopts and refines them, this is a situation where the open ecosystem of Google's mobile operating system has hindered it.",
    "While iOS is locked to Apple smartphones and tablets, Android operates on a huge variety of devices made by many different manufacturers, all with their own security protocols and other differences.",
    "It's clear to see how this could be problematic when trying to introduce a feature that requires tight security like this, but Nearby Share will utilise encryption to do just that.",
    "The feature was in the works for quite some time before it began to slowly roll out last year, and there aren't any concrete release plans for this new update, but we'll welcome it when it arrives."
  ],
  "headers": {
    "5": "Android catching up"
  },
  "links": {
    "Google started finally rolling out Nearby Share to Android phones": "https://www.techradar.com/news/androids-airdrop-competitor-gets-publicly-released-for-pixel-and-samsung-phones",
    "9to5Google": "https://9to5google.com/2021/03/15/google-nearby-share-everyone-group-sharing/"
  }
}