{
  "source": "https://www.techradar.com/news/fitbit-reveals-new-smartwatch-and-you-can-pre-order-it-today",
  "title": "You can pre-order the new Fitbit Ace 3 smartwatch today",
  "category": "fitness",
  "updated": "2021-03-09T22:29:01Z",
  "author": "cat-ellis",
  "summary": "The Fitbit Ace 3 is built to keep kids moving",
  "article": [
    "Fitbit has revealed its latest kids' fitness tracker – the Fitbit Ace 3. The watch is available to pre-order now for $79.95 / £69.99 / AU$99.95, and will begin shipping worldwide on March 15.",
    "The launch comes just days after German tech website WinFuture published what appeared to be leaked photos of the new device, along with possible specifications.",
    "At the time, we speculated that the product details may be placeholders, as they didn't seem to match the images, and it seems that was indeed the case. We don't know the screen's exact resolution, but it's certainly not the 240 x 240 pixels initially reported.",
    "Indeed, it seems the Ace 3 is an incremental upgrade on the Ace 2 rather than a complete overhaul, but there are some significant changes that should help hold kids' attention and get them motivated.",
    "There's no optical heart rate monitor, but that makes sense since children's typical heart rates vary depending on their age. Instead, there are new animated clock faces and interchangeable accessory bands to give the device a new look. Two Despicable Me Minions themed bands will launch soon, with more on the way later.",
    "Battery life has been improved too, and is now rated for around eight days rather than five, like the Fitbit Ace 2.",
    "It's a wise time to launch a kids' fitness tracker; the lack of organized sports and face-to-face activities during the pandemic means it's hard for kids to get as much exercise as they usually would. Research by Sport England has revealed that 60% of young people in the country failed to meet the recommended 60 minutes of daily activity during the 2019-2020 school year.",
    "The Ace 3 will remind kids to take at least 250 steps an hour (with optional customizable goals during school time), and parents can set their own personalized targets using the Ace 3's touchscreen. The Ace 3 also tracks sleep, provides bedtime reminders, and can provide silent alarms to wake kids without disturbing the rest of the household.",
    "We'll be putting all of these features to the test as soon as possible with a full review of the Fitbit Ace 3, so stick with TechRadar for more info."
  ],
  "headers": {
    "6": "Step by step"
  },
  "links": {
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "available to pre-order now": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5810381081041120000/https://www.fitbit.com/global/us/products/trackers/ace3",
    "WinFuture": "https://winfuture.de/news,121573.html",
    "we speculated": "https://www.techradar.com/news/new-fitbit-smartwatch-could-arrive-on-march-15",
    "vary depending on their age": "https://www.childrens.com/health-wellness/is-your-childs-heart-rate-healthy",
    "Fitbit Ace 2": "https://www.techradar.com/reviews/fitbit-ace-2",
    "Research by Sport England": "https://www.bbc.co.uk/sport/55664539"
  }
}