{
  "source": "https://www.techradar.com/news/battlefield-2042-breaks-after-major-update",
  "title": "Battlefield 2042 breaks after major update",
  "category": "gaming",
  "updated": "2021-12-02T12:23:34Z",
  "author": "jamel-smith",
  "summary": "Adding more failures to this fiasco",
  "article": [
    "Dice has confirmed it’s working to fix major issues that have appeared following Battlefield 2042’s third major update, which was released on Thursday, December 2.",
    "The Battlefield developer has said via Twitter: “We're aware that many of you are receiving an error message while attempting to load into a Server, and then being returned to the Main Menu.” It went on to say that the ‘unable to load persistence data’ error is a connection issue on its own side.",
    "This is not the only issue players are experiencing, as another issue has now emerged. Dice has noticed players on PC aren’t able to use horizontal mouse input after the latest update. In a separate tweet, the company has suggested players restore their default settings, “by removing “PROFSAVE” files in My documents > Battlefield 2042 > Setting to keep playing.” But be warned - this will reset all your in-game settings.",
    "Thankfully, Battlefield fans in the replies are saying you don’t have to remove all the files - follow their instructions in the tweet below:",
    "However, gamers are also reporting that the Battlefield 2042 menu on PS5 is now running at 30 fps and there seems to be an issue with input lag.",
    "The third update was supposed to bring a large number of fixes to Dice’s troubled game. Gameplay was promised to be much smoother by fixing erratic spawning issues, visual glitches and collision issues. There were fixes for weapons, vehicles and specialists - plus improvements for custom loadouts and the UI. But despite the fixes, Battlefield 2042 owners aren’t happy with this update, to say the least.",
    "We recommend to keep following the Battlefield Direct Communication page on Twitter for further updates on these problems.",
    "Battlefield 1 was probably one the best Battlefield games Dice has ever released, however with the botched launches of Battlefield V and now Battlefield 2042 - Dice’s reputation may be forever tainted.",
    "Battlefield 2042 was supposed to be its redemption game that’ll bring Battlefield back to its FPS glory, but instead, gamers were faced with a bugged and unpolished game. There were problems with hit registration, major balancing issues with vehicles and weapons, performance problems even for those on powerful PCs, and bugs galore. We can’t list all the issues Battlefield 2042 launched with, but do take a look at the video below giving you a more detailed rundown:",
    "To make matters worse, while EA and Dice were charging $70/£70 for an unpolished game, Microsoft released Halo Infinite multiplayer on Xbox GamePass, which has had a much more positive reception.",
    "Now, owners of Battlefield 2042 have to put up with patches that are supposed to fix the game instead adding further issues to it.",
    "Like the troubled launches of Cyberpunk 2077 and the recent GTA Trilogy - Definitive Edition, we don’t know when this game will actually be in a polished state. But it looks as if Dice are pumping out these updates at a fast pace, which is the only redeeming factor in this whole fiasco."
  ],
  "headers": {
    "7": "Analysis: How the mighty have fallen"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Twitter": "https://twitter.com/BattlefieldComm",
    "tweet": "https://twitter.com/BattlefieldComm/status/1466344798785265664?s=20",
    "third update": "https://www.ea.com/games/battlefield/battlefield-2042/news/battlefield-2042-update-notes-3?utm_campaign=bf2042_hd_ww_ic_socd_twt_core-update3web&utm_source=twitter&utm_medium=social&cid=71919&ts=1638379925115",
    "Battlefield 1": "https://www.techradar.com/news/battlefield-1-review",
    "Battlefield V": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "released Halo Infinite multiplayer": "https://www.techradar.com/how-to/how-to-download-the-halo-infinite-multiplayer-beta-on-xbox-and-pc",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "GTA Trilogy - Definitive Edition": "https://www.techradar.com/news/busted-dont-buy-gta-trilogy-definitive-edition-on-nintendo-switch"
  }
}