{
  "source": "https://www.techradar.com/news/latest-galaxy-z-fold-3-leak-hints-at-the-foldables-charging-speeds",
  "title": "Latest Galaxy Z Fold 3 leak hints at the foldable's charging speeds",
  "category": "phones",
  "updated": "2021-05-02T09:30:18Z",
  "author": "david-nield",
  "summary": "Not much change",
  "article": [
    "The upcoming Galaxy Z Fold 3 is on course to be Samsung's flagship foldable phone of 2021, and the latest bit of information to leak out about the phone suggests that we're not going to see much of an upgrade in terms of charging speeds.",
    "Documents passing through Chinese regulator 3C and spotted by GSMArena point to a 25W rated charger for the Samsung Galaxy Z Fold 3, so it looks as though top-tier, super-fast charging isn't going to be available on this particular refresh.",
    "The 25W bundled charger matches the one that was provided with the Samsung Galaxy Z Fold 2 that was unveiled in September 2020. That particular foldable offers 25W wired charging and 11W wireless charging, as well as reverse wireless charging (so you can juice up smaller gadgets on the back of the handset).",
    "It's not inconceivable that the Galaxy Z Fold 3 will support a faster charging speed, if you go out and buy a more powerful charger for it – phone makers have pulled that trick before – but at this stage it looks as though the battery charging specs are likely to match the phone's predecessor.",
    "Earlier leaks have suggested that the Samsung Galaxy Z Fold 3 is going to come with a smaller battery than the Z Fold 2, dropping to 4,380mAh from 4,500mAh. The main screen is apparently shrinking too, going from 7.6 inches to 7.5 inches as well.",
    "All of which makes us think that the successor to the Galaxy Z Fold 2 is likely to be more of an evolution than a revolution in the folding phone market. We're expecting Samsung to launch the clamshell Galaxy Z Flip 3 foldable at the same time.",
    "One upgrade that has been tipped for both these phones is some kind of IP water resistance rating – not a bad feat of engineering from Samsung, when you consider how many moving parts and open crevices there are in foldable devices like these.",
    "The top-tier Snapdragon 888 chipset is very likely to be powering the Z Fold 3 and the Z Flip 3, so there will be no problems in the performance department. It's not clear exactly when the phones will make an appearance, but it could be as early as June."
  ],
  "headers": {
    "4": "Upgrades and downgrades"
  },
  "links": {
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "GSMArena": "https://www.gsmarena.com/3c_reveals_samsung_galaxy_z_fold3_will_come_with_25w_charger-news-48928.php",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Earlier leaks": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-a-smaller-screen-and-battery",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "IP water resistance rating": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-spec-leaks-point-to-an-important-upgrade",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "as early as June": "https://www.techradar.com/news/samsung-galaxy-s21-and-fold-3-may-support-s-pen-while-the-note-might-be-dead"
  }
}