{
  "source": "https://www.techradar.com/news/taboola-announces-multi-billion-merger-and-plans-ipo",
  "title": "Taboola announces multi-billion merger and plans IPO",
  "category": "computing",
  "updated": "2021-01-25T22:07:08Z",
  "author": "anthony-spadafora",
  "summary": "Taboola will merge with the SPAC ION Acquisition Corp",
  "article": [
    "Taboola will soon trade on the NYSE under the new symbol “TBLA” as the advertising company has announced that it has entered into a definitive merger agreement with the SPAC company ION Acquisition Corp.",
    "Founded back in 2007 by CEO Adam Singolda, Taboola allows websites and apps to monetize their content through its AI-driven recommendations that show related stories at the bottom of news articles through its Taboola Feed. The company currently works with over 13,000 publishers to help them reach over 500m users per day.",
    "Taboola's recommendation platform natively renders editorial and paid recommendations for the open web to help consumers discover new things they may like online. The company estimates that the highly fragmented advertising market in the open web was worth approximately $64bn last year.",
    "In a press release, Signolda provided further details on what going public will mean for Taboola going forward, saying:",
    "\"Taboola is embarking on an exciting new journey as a public company, a milestone only made possible by years of trusted partnerships with tens of thousands of digital properties and advertisers who I want to personally thank for believing in Taboola and me for years. Today, we're proud of the Taboola team that has made us a ubiquitous presence on the open web and for helping to bring our category-defining technology to market. Aside from our technology and team, Taboola's success is built on a simple idea - deliver value to our partners in a way where we only grow if our partners grow, in a true win-win manner. This is in stark contrast to 'walled gardens' of closed ecosystems that don't always have their partners' best interests in mind.\"",
    "ION Acquisition is a special purpose acquisition company or SPAC. These organizations are used primarily to raise funds on behalf of an acquired firm in order to launch an initial public offering (IPO) without having to go through the traditional process.",
    "By using a SPAC, merged companies can get listed on the stock market faster while spending less to do so but they can also be a riskier prospect for investors.",
    "Taboola's merger includes $259m held in trust alongside an additional $285m raised from institutional investors that have agreed to purchase ordinary shares from the company. To help Taboola go public, Fidelity Management & Research Company LLC, Baron Capital Group, accounts managed by BlackRock and other investors have pledged private investment in public equity (PIPE) financing.",
    "Going public will also release some of Taboola's funds to help its growth with $100m earmarked for research into AI, e-commerce and device manufacturer programs.",
    "The merger has been approved by the board of directors of both Taboola and ION and the deal is expected to close during the second quarter of 2021 following regulatory approval.",
    "Via ZDNet"
  ],
  "headers": {
    "5": "ION Acquisition merger"
  },
  "links": {
    "Taboola": "https://www.techradar.com/news/taboola-and-outbrain-announce-major-ad-merger",
    "ress release": "https://www.prnewswire.com/news-releases/taboola-a-global-leader-in-powering-recommendations-for-the-open-web-to-become-nyse-listed-at-an-implied-2-6-billion-valuation-via-a-merger-with-ion-acquisition-corp-1-ltd-301213681.html",
    "IPO": "https://www.techradar.com/news/coinbase-files-for-historic-ipo-amid-bitcoin-surge",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "device manufacturer programs": "https://www.techradar.com/news/you-wont-believe-what-zte-is-going-to-add-to-its-phones",
    "ZDNet": "https://www.zdnet.com/article/taboola-merges-with-ion-acquisition-plots-nyse-listing/"
  }
}