{
  "source": "https://www.techradar.com/news/the-next-big-netflix-movie-to-add-to-your-watch-list-is-this-cool-western",
  "title": "The next big Netflix movie to add to your watch list is this cool Western",
  "category": "entertainment",
  "updated": "2021-06-25T10:11:00Z",
  "author": "samuel-roberts",
  "summary": "The Harder They Fall is coming later this year",
  "article": [
    "Netflix has revealed the first trailer for The Harder They Fall, a Western with an all-star cast. It makes an extremely cool first impression, and it's well worth having on your radar for the second half of this year.",
    "In The Harder They Fall, the fearsome Rufus Buck (Idris Elba) is liberated from prison by his allies 'Treacherous' Trudy Smith (Regina King) and Cherokee Bill (LaKeith Stanfield) – as you'll see play out in the trailer below. Learning that his enemy is free, Nat Love (Jonathan Majors, best known for HBO's Lovecraft Country) gathers his own allies (including characters played by Zazie Beetz, RJ Cyler and Edi Gathegi) to hunt Rufus down, and take revenge.",
    "Director Jeymes Samuel is behind the movie, which is described by Netflix as a 'righteously new school' Western, with a screenplay co-written with veteran Boaz Yakin (Remember the Titans). Jay-Z is among the film's producers. Other cast members include Delroy Lindo, who gave an Oscar-worthy performance in last year's Da 5 Bloods, and Damon Wayans Jr.",
    "Here's the trailer:",
    "The Harder They Fall is scheduled to release later in 2021 on Netflix – more specifically 'Fall', so some time between September and December. It'll also have a small theatrical release.",
    "Even though theaters are finally reopening around the world, Netflix's place in the movie landscape isn't going to change any time soon. If anything, this is its biggest year for movies ever, with at least one new original releasing every week.",
    "There are a few movies that stand above the rest. Tick...tick...BOOM! is a musical starring Andrew Garfield that's directed by Hamilton's Lin-Manuel Miranda, and it's about a composer trying to make it in New York City. Alongside that, Red Notice is an action movie starring Dwayne Johnson, Gal Gadot and Ryan Reynolds about art thievery, that looks like it cost a fortune to make.",
    "And then there's the big Oscar contender for the year: Don't Look Up, about two astronomers trying to convince the world that a comet is coming to destroy the planet. It stars Jennifer Lawrence and Leonardo DiCaprio, along with a big ensemble cast – Timothée Chalamet, Cate Blanchett, Meryl Streep, Jonah Hill and Chris Evans are among them. Vice and The Big Short director Adam McKay is behind that one.",
    "So, plenty to stream this year, even if you can finally go and watch some movies in an actual cinema."
  ],
  "headers": {
    "5": "Analysis: Netflix's big movies won't let up"
  },
  "links": {
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review"
  }
}