{
  "source": "https://www.techradar.com/news/5-ps5-features-i-wish-were-on-xbox-series-x",
  "title": "5 PS5 features I wish were on Xbox Series X",
  "category": "gaming",
  "updated": "2021-01-24T20:03:51Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Small changes can make a big difference",
  "article": [
    "The Xbox Series X is a terrific console, but there are some PS5 features that I really miss whenever I boot up Microsoft’s diminutive tower of power. Some are minor, I’ll admit, and would ultimately be nice to have. Others, though, feel almost essential – and would only serve to improve the Xbox Series X experience as a whole.",
    "I’d never want both boxes to be homogenous, of course – not only would this stifle innovation, but it would also make owning two consoles practically pointless – but when a competitor delivers a feature that works so well that you immediately notice it’s gone, that’s when a company should consider implementing it too.",
    "It may seem lazy to steal ideas from a rival, but this sort of practice happens all the time – either during a console generation or after. Microsoft quickly added a headphone jack to its Xbox One controller after the feature was so well received on the PS4’s DualShock 4 pad, and the Xbox Wireless Controller for Series X and Series S now includes a share button.",
    "The Xbox Series X has some excellent features of its own, of course, like Quick Resume for instance, and I’ll be turning the focus onto which Xbox Series X features I’d like to see on PS5 in a follow-up article. But for now, here are five PS5 features I wish were on Xbox Series X.",
    "Perhaps the most surprising success story about the PS5 is the DualSense controller’s adaptive triggers. I’m utterly enamored with them, to the point where I’ve found myself leaning towards buying third-party games on PS5 over Xbox Series X just to feel how they’ve been used.",
    "When Sony first announced how the DualSense triggers would change resistance to mimic the sensation of pulling back a drawstring on a bow, or replicate the kickback when firing a gun, I was initially skeptical. But once I experienced it for myself in game’s like Astro’s Playroom, still my personal next-gen highlight so far, it became clear that adaptive triggers were a revelation rather than a gimmick.",
    "Now, while I still prefer the Xbox Series X controller overall – partly due to the asymmetrical analog layout and superior trigger shape – the fact that Sony’s pad comes alive and helps add an extra dimension to gameplay really makes me long for it on Microsoft’s console.",
    "Microsoft is clearly aware of the positive feedback the DualSense controller is getting from gamers, too. A recent Xbox Series X survey asked owners whether they’d like to see similar features on the Xbox controller, to which I wholeheartedly answered yes. While I’d be surprised if Microsoft did make such a drastic revision to its gamepad anytime soon, stranger things have happened.",
    "Now this is a strange one, particularly as the Xbox 360 used to have basically the same feature. PS5 lets you select a number of default system settings that are applied, universally, to games. This includes defaulting to performance or resolution mode in games that support it; your preferred difficulty level; whether you want to invert the controls; and if you want subtitles to be turned on or off.",
    "The amount of time this potentially saves over the course of a console generation cannot be underestimated. I’d always choose performance mode over resolution, so knowing that all the PS5 games I play automatically default to my preferred setting just makes sense. I no longer need to delve into a menu to check, and for those who play inverted, this is a blessing.",
    "As I mentioned above, Xbox 360 used to have a similar setting, so why can’t it be brought back on Xbox Series X? Fingers crossed Microsoft remembers why it was so good in the first place.",
    "I cannot understate how much I miss this stupidly simple PS5 feature when playing on Xbox Series X. In fact, I’ve been pining for it ever since Sony introduced it on PS4.",
    "Whenever you plug a headset into the DualSense controller, the PS5 recognizes this and automatically mutes the TV. It even does it when you connect a wireless headset. This prevents you from ever playing a game with the TV audio still blaring out in the background, which honestly happens more than I’d like to admit.",
    "On Xbox Series X, when you plug a headset into the controller nothing happens. The TV isn’t automatically muted, which means you have to pick up your remote control and turn your TV volume down manually. It’s an extra, unnecessary step that I have to perform over and over again, and I can’t stress how happy I’d be if Xbox copied this seemingly basic feature from PS5. Make it happen, Microsoft.",
    "While I’m not as desperate to see haptic feedback as the adaptive triggers, it’s clear that haptics are the future. The subtle effects developers can create are far superior to the older spinning motors found in the Xbox Series X pad, and it’s hard to see Microsoft sticking with the traditional rumble moving forward.",
    "Even Nintendo opted for haptic feedback on Nintendo Switch, as both the Joy-Con and Nintendo Switch Pro Controller include it. The implementation is pretty underwhelming compared to how it’s implemented in the DualSense, however, but it’s still capable of providing some amazing moments, like how it can simulate the sensation of moving balls inside the controller when playing 1-2-Switch.",
    "Again, I’m doubtful that Microsoft will add haptic feedback anytime soon, but I’d be surprised if it wasn’t included in the next Xbox controller.",
    "Now that Xbox Series X supports dynamic backgrounds (finally!), it’s time that Microsoft brought a bit more life and personality to the user experience. Why not add some music when you’re on the dashboard, then? The PS4 used this to great effect during the last generation, as countless custom themes included classic tracks that really helped take things to the next level.",
    "I’m not a huge fan of the PS5’s sombre home screen music to be honest, but it’s negated by the fact that any game you hover over plays its own individual music track, which is a really nice touch. On Xbox Series X, meanwhile, you’ll only ever hear the dull sound that occurs when you move through the menus. As daft as it sounds, it makes the Xbox Series X UI feel rather soulless in comparison.",
    "Wouldn’t it be awesome if you could purchase a dynamic Halo theme that played “A Walk in the Woods” whenever you’re flicking through menus or tweaking your settings? I’d personally love it, and hope Microsoft considers adding the option for home screen music in the future."
  ],
  "headers": {
    "4": "1. Adaptive triggers",
    "8": "2. Universal system settings for games",
    "11": "3. Mute the TV when using a headset",
    "14": "4. Haptic feedback",
    "17": "5. Home menu music"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One controller": "https://www.techradar.com/news/xbox-one-controller-deals-cheap-xbox-wireless-gamepad-prices",
    "DualShock 4": "https://www.techradar.com/news/gaming/consoles/dualshock-4-deals-find-a-cheap-ps4-controller-today-1298590",
    "Xbox Wireless Controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Quick Resume": "https://www.techradar.com/news/xbox-series-x-quick-resume-is-as-seamless-as-you-hoped",
    "Xbox Series X features I’d like to see on PS5": "https://www.techradar.com/news/5-xbox-series-x-features-i-wish-were-on-ps5",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "buying third-party games on PS5": "https://www.techradar.com/news/fifa-21-on-ps5-sounds-way-more-fun-than-the-xbox-series-x-version",
    "skeptical": "https://www.techradar.com/news/the-dualsense-ps5-controller-is-packed-with-features-but-they-wont-get-used",
    "Astro’s Playroom": "https://www.techradar.com/news/astros-playroom-will-make-you-fall-in-love-with-the-ps5-dualsense-controller",
    "Xbox Series X controller": "https://www.techradar.com/news/stop-saying-the-xbox-series-x-controller-hasnt-changed",
    "Xbox Series X survey": "https://www.techradar.com/news/xbox-series-x-survey-asks-if-you-want-ps5-dualsense-features-on-its-controller",
    "Xbox 360": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-360-703247/review",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch Pro Controller": "https://www.techradar.com/deals/nintendo-switch-pro-controller-price-sales-cheap",
    "1-2-Switch": "https://www.techradar.com/news/nintendos-weird-1-2-switch-has-you-milking-cows-and-rocking-babies-to-sleep",
    "Xbox Series X supports dynamic backgrounds": "https://www.techradar.com/news/the-new-xbox-series-x-update-makes-things-feel-a-bit-more-next-gen",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Halo": "https://www.techradar.com/reviews/halo-infinite"
  }
}