{
  "source": "https://www.techradar.com/news/squarespace-dodges-ipo-in-replace-of-direct-listing",
  "title": "Squarespace dodges IPO in replace of direct listing",
  "category": "computing",
  "updated": "2021-04-16T11:47:15Z",
  "author": "abigail-opiah",
  "summary": "Sidestepping IPO could save money",
  "article": [
    "Top website builder and web hosting company Squarespace has revealed it will go after a direct listing this year rather than a traditional initial public offering (IPO), according to a Bloomberg report citing people familiar with the matter.",
    "This move by Squarespace follows technology companies such as Slack, Spotify, Roblox, Asana and Palantir, choosing to file with a direct listing in lieu of an IPO.",
    "Cryptocurrency exchange Coinbase also announced its plan to go after a proposed direct listing of its Class A common stock back in January this year.",
    "However reports suggest Squarespace's plans may not be set in stone as dates may be altered, the report notes.",
    "With the decision to choose a direct listing, Squarespace will be saving money on banking fees and saving time that would have otherwise been spent at investor roadshows, which is a common practise in a traditional IPO.",
    "TechRadar Pro has reached out to Squarespace for comment, but the company is yet to respond.",
    "Compared to an IPO, a direct listing will mean that Squarespace will have no new shares created and only existing, outstanding shares will be sold with no underwriters involved.",
    "The underwriter works closely with the company throughout the IPO process and decides on the initial offer price of the shares. Underwriters usually charge a fee per share, which may range anywhere from 3% to 7% - a fee that Squarespace will save with its direct listing choice.",
    "A month ago, Squarespace raised an additional $300m in its latest round of funding and the firm is now valued at $10bn.",
    "Founded in 2003 by CEO Anthony Casalena, the company also unveiled its plans to go public at the start of the year.",
    "Squarespace has expanded into the e-commerce market and has recently acquired Tock, a unified system serving the hospitality industry with online reservations, table management, takeout, and events.",
    "Via Bloomberg"
  ],
  "headers": {
    "3": "Website builder decides"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Roblox": "https://www.techradar.com/news/best-roblox-games",
    "Asana": "https://www.techradar.com/reviews/asana",
    "Squarespace raised an additional $300m": "https://www.techradar.com/news/squarespace-is-now-worth-dollar10bn",
    "recently acquired Tock": "https://www.techradar.com/news/squarespace-might-be-getting-into-the-restaurant-game",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-14/squarespace-is-said-to-opt-for-direct-listing-instead-of-ipo"
  }
}