{
  "source": "https://www.techradar.com/news/stardew-valley-board-game-and-five-more-tabletop-gaming-adaptations-you-need-to-play",
  "title": "Stardew Valley board game and five more tabletop gaming adaptations you need to play",
  "category": "gaming",
  "updated": "2021-02-27T15:00:40Z",
  "author": "rhys-wood",
  "summary": "Bring your favorite games into the physical world",
  "article": [
    "Video games and tabletop board games have gone hand-in-hand ever since the first RPG titles swapped pen and paper for D-Pads and buttons. But the direction of influence has flipped in recent years, with numerous tabletop gaming adaptations jumping away from our screens and into board game piles. Most recent of all is the Stardew Valley board game, which looks to emulate the laid-back vibes of the virtual farming experience.",
    "There’s many other video gaming tabletop adaptations that have been received excellently by fans of the original works, either attempting to recreate the essence of the games they’re based on, or provide a unique spin on concepts we’re familiar with.",
    "From Stardew Valley to Dark Souls, Portal to Pac-Man, here’s our guide to the tabletop video game adaptations you absolutely need to try - perfect for if you’re stuck at home with the family during these trying times.",
    "Let’s kick things off with the Stardew Valley board game. The farming sim released to critical acclaim on PC back in 2016, and it’s remained a popular “home away from home” style of game ever since. Frequent updates from developer ConcernedApe have kept the game fresh and fun all these years.",
    "The board game, developed in collaboration with ConcernedApe and designer Cole Medeiros, looks to sincerely emulate the co-operative experience of running a farm in the titular valley.",
    "Stardew Valley: The Board Game features a board depicting the familiar Pelican Town, which can be populated with cards of the game’s loveable characters and items. Players work together to explore the town, restore the Community Center and drive the corrupt Joja Corporation out of town.",
    "Much like the video game, the Stardew Valley board game is perfect for long sessions, so make sure you put aside enough time to hunker down and work with your friends and family to build the best farming town you possibly can. The Stardew Valley board game is currently only available in the US, and can be purchased from the Stardew Valley shop for $55.",
    "Doom couldn’t be further removed from a game like Stardew Valley if it tried, and the board game echoes that sentiment precisely. The original Doom, its sequels and expansions cemented first-person shooters as one of the most popular of video gaming genres. To this day, its “lone space marine versus the hordes of hell” set across sprawling and complex maps resonates with players to a degree that most other games in the genre simply can’t match.",
    "Doom: The Board Game, meanwhile, is a bit different. It’s an asymmetrical game that pits four against one. Pals team up to form a group of marines, attempting to restore power to a UAC facility. The one remaining player has full control over an army of demons. That player’s goal is to kill off the marines with their demon forces.",
    "Throughout the run of the game, players will move their respective miniature figures across the board, and engage in combat that’s largely based on dice rolls. Two large scale operations of six missions each fill out the game, making it perfect for groups who enjoy longer play sessions.",
    "Kickstarter success stories are rarely as sweet as this one. Street Fighter: The Miniatures famously achieved funding in just one day, and if you’re a fan of the iconic fighting series, it looks like you’ll get a ton of bang for your buck here.",
    "In Street Fighter: The Miniatures Game, players take control of lovingly crafted figures of iconic Street Fighter characters like Ryu, Chun-Li, Vega, Zangief and more. Through dice rolls and over 400 battle action cards, players can battle each other on recognizable stage boards, complete with breakable scenery!",
    "Street Fighter: The Miniatures Game is looks ideal for shorter play sessions, and supports both free-for-all and team-based modes for up to six players. Extra gameplay features like being able to strategically combo cards together emulate the feeling of playing Street Fighter incredibly well, so we're definitely keeping an eye on this one.",
    "Street Fighter: The Miniatures is available to pre-order over on the Jasco Games website.",
    "Few games of the last decade enjoyed a cultural resonation quite like Dark Souls did. As a spiritual follow-up to 2009’s Demon’s Souls (recently revived for the PS5), Dark Souls brought tough-as-nails action RPG goodness to the masses in a way that other games of its generation simply did not. Both Dark Souls and its developer FromSoftware became household names as a result of its success, and a very literal representation of its breakthrough hit lies in Dark Souls: The Board Game.",
    "In true Dark Souls fashion, the board game can be played either solo or with up to three friends. Players will need to overcome vicious enemies from all across the series (represented as immaculately crafted miniatures) by making effective use of resources, clever positioning and learning the attack patterns of each foe. If one player dies, so does everyone else, and you’ll all have to respawn at the nearest Bonfire checkpoint.",
    "Dark Souls: The Board Game even has a litany of expansions if your hunger for souls can’t be easily quenched, including the Darkroot and Phantoms expansions which add even more foes, cards and rules to the base experience, allowing for a board game that’s consistently difficult and refreshing to play.",
    "If you’re after something a bit less intense that the whole family can enjoy, then Pac-Man: The Board Game just might be the arcade-like option for you. This board game is bizarrely faithful to its arcade counterpart, and is complete with iconic sound effects from the Pac-Man video game.",
    "Pac-Man: The Board Game employs a round-robin approach to play. Players take it in turns to control Pac-Man, while everyone else controls one of the ghosts. As Pac-Man, the controlling player will need to gobble up as many pellets as possible, while avoiding other players’ ghosts as best as they can.",
    "Through dice rolls and effective board traversal, players can collect fruit and power pellets to make the ghosts edible, leading to extra points. The winner is the one who scores the most points while they’re in the hot seat as Pac-Man. It’s a fun and quick-to-play board game that can be as strangely addictive as the arcade game itself.",
    "Portal, the darkly humorous puzzle platformer series from Valve, works incredibly well as a fast-paced board game that employs test chambers, cards and (of course) portals to dictate the flow of the game.",
    "Players must hop between test chambers using their portals to collect as much cake as humanly possible. At the end of each turn, though, one of those test chambers has to be removed from play, along with whoever’s inside it at the time. Clever traversal and card usage are vital to surviving this game that will have you on edge at all times.",
    "Portal: The Uncooperative Cake Acquisition Game throws even more uncertainty into the mix with placeable turrets, and appearances from notorious AI GLaDOS and the weirdly adorable Weighted Companion Cube."
  ],
  "headers": {
    "3": "Stardew Valley: The Board Game",
    "7": "Doom: The Board Game",
    "10": "Street Fighter: The Miniatures",
    "14": "Dark Souls: The Board Game",
    "17": "Pac-Man: The Board Game",
    "20": "Portal: The Uncooperative Cake Acquisition Game"
  },
  "links": {
    "Stardew Valley": "https://www.techradar.com/news/stardew-valley-15-update-is-now-live-on-pc-with-buckets-of-new-content",
    "Stardew Valley shop": "https://shop.stardewvalley.net/products/stardew-valley-the-board-game",
    "Jasco Games website": "https://www.jascogames.net/product/street-fighter-the-miniatures-game/",
    "Pac-Man: The Board Game": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FBuffalo-Games-Pac-Man-Board-Game%2Fdp%2FB07RJTFRFK%2Fref%3Dasc_df_B07RJTFRFK%2F%3FlinkCode%3Ddf0%26hvadid%3D463108470184%26hvpos%3D%26hvnetw%3Dg%26hvrand%3D17314311353040899501%26hvpone%3D%26hvptwo%3D%26hvqmt%3D%26hvdev%3Dc%26hvdvcmdl%3D%26hvlocint%3D%26hvlocphy%3D9046632%26hvtargid%3Dpla-828942542799%26psc%3D1%26th%3D1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2157046199068111000-21"
  }
}