{
  "source": "https://www.techradar.com/news/the-next-amazon-echo-show-could-be-mounted-on-your-wall",
  "title": "The next Amazon Echo Show could be mounted on your wall",
  "category": "smart-home",
  "updated": "2021-02-09T22:23:26Z",
  "author": "nick-pino",
  "summary": "Amazon’s next Alexa enclosure is said to be a 10-inch wall-mounted tablet",
  "article": [
    "New details have emerged about a new wall-mounted Alexa tablet that serves as a smart home command center being developed by Amazon’s Lab126 hardware division, the same one that made the Amazon Kindle, Echo and Echo Dot.",
    "The mystery device is reportedly still very much in development at this point, but the general idea is that it’d work as a central hub to control your smart devices like the Amazon Echo Show. The device could potentially show upcoming calendar events and could also have a built-in camera for video calling.",
    "The reporting comes from Bloomberg, which spoke to people at the company privately who didn’t wish to be identified and say that the product lines up against the Control4 Home Automation System.",
    "Bloomberg’s source says the new home command center screen could be available in one or two sizes between 10 and 13 inches, and could launch by the end of 2022 for between $200 (around £140, AU$250) and $250 (around £180, AU$320).",
    "Amazon has been experimenting with new form factors for Alexa ever since the arrival of the original Amazon Echo in 2014. Since then, Amazon has built Alexa into additional smart speakers, smart displays, streaming video devices, phones, tablets, laptops and even some cars.",
    "The wall might just be the most logical next step for Alexa.",
    "The counterpoint to that line of reasoning is that Alexa didn’t need a fancy control center to function – in fact, one the best parts of Amazon's smart assistant is that it works just as well on an inexpensive Amazon Echo Dot as it does on the company’s priciest smart speakers and displays. The latter does add a visual component, obviously, but the core functionality remains exactly the same.",
    "Admittedly, why Amazon would want to build it into a glorified, relatively expensive and potentially difficult-to-mount wall tablet doesn't seem clear unless there’s some cutting-edge feature that Bloomberg’s sources didn’t divulge in their information.",
    "None of that should cast aspersions on Bloomberg’s reporting or on the existence of this device (likely one of many projects Lab126 has going on), but it could have an impact on when – or even if – Amazon will finally take the wraps off the device."
  ],
  "headers": {
    "4": "Do we really need an expensive wall-mounted Alexa tablet?"
  },
  "links": {
    "Amazon Kindle": "https://www.techradar.com/reviews/amazon-kindle-review",
    "Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Amazon Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-09/amazon-plans-wall-mounted-echo-as-smart-home-command-center"
  }
}