{
  "source": "https://www.techradar.com/news/moto-e7i-power-is-motos-cheapest-phone-in-a-while-and-it-comes-with-a-big-battery",
  "title": "Moto E7i Power is Moto's cheapest phone in a while, and it comes with a big battery",
  "category": "phones",
  "updated": "2021-02-23T12:11:12Z",
  "author": "james-rogerson",
  "summary": "Just £79",
  "article": [
    "Motorola is no stranger to packing big batteries into affordable phones, and the newly unveiled Moto E7i Power continues that trend, offering a 5,000mAh battery and costing just £79 (around $110 / AU$140).",
    "That makes it one of the cheapest smartphones you can buy, and Motorola claims that battery keeps it going for up to two days. More specifically, the Moto E7i Power can apparently manage up to 14 hours of streamed video, up to 12 hours of web browsing, or up to 76 hours of streamed music.",
    "Beyond that battery the Moto E7i Power sounds less impressive, but at least in line with what you’d expect for just a double-digit price.",
    "It has a 6.5-inch 720 x 1600 screen, a low-end octa-core Unisoc SC9863A chipset, just 2GB of RAM, 32GB of storage, a microSD card slot, a fingerprint scanner, and a dual-lens camera, with a 13MP main sensor and a 2MP macro snapper.",
    "There’s also a 5MP camera on the front, a dedicated Google Assistant button, and – as you’d expect – the Moto E7i Power has a plastic build. Finally, the phone runs the lightweight Android 10 Go Edition and comes in Tahiti Blue and Coral Red shades.",
    "While we’re yet to test the Moto E7i Power we wouldn’t expect much in the way of power or camera capabilities based on the specs list, but given its price, that big battery and reasonably sized screen might be enough.",
    "If you do like the sound of it you’ll be able to buy it from Amazon, Argos, JLP and Tesco 'in the coming weeks' according to Motorola, though at the time of writing it’s not clear whether the Moto E7i Power will be launching in other regions, like the US and Australia."
  ],
  "headers": {},
  "links": {
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}