{
  "source": "https://www.techradar.com/news/android-12-beta-hints-at-under-display-fingerprint-scanner-for-google-pixel-6",
  "title": "Google Pixel 6 may get under-display fingerprint scanner, suggests Android 12",
  "category": "phones",
  "updated": "2021-03-19T09:53:24.371Z",
  "author": "james-rogerson",
  "summary": "And a change to the dark theme",
  "article": [
    "Operating system betas can give us an early indication of software changes that are in the works, but the latest Android 12 beta might have just revealed a hardware change too, as it includes evidence that Google might be planning an under-display fingerprint scanner for the Pixel 6.",
    "Developer kdrag0n spotted mention of ‘UdfpsControllerGoogle’ in code from the second Android 12 developer preview. The ‘Udfps’ in that stands for under-display fingerprint scanner, and this mention was part of the com.google.android.systemui path, which as XDA Developers explains, suggests that the feature is being developed for a Pixel phone, rather than this just being official support for under-display scanners on Android in general.",
    "It’s worth noting that this doesn’t guarantee Google will launch a phone with an under-display fingerprint scanner, but it certainly increases the likelihood, and with support being added in Android 12, we might see it as soon as the Google Pixel 6, given that this phone is sure to launch with that software.",
    "This also isn’t the first hint we’ve seen of an under-display scanner coming to a Pixel phone, as in a previous Android 12 developer preview, evidence was found that the update would allow Pixel phones to use a combination of facial recognition and an in-screen fingerprint scanner to unlock the device.",
    "This is, so far, the highlight of the latest Android 12 developer preview, but it’s not the only thing that’s been dug up, as another notable feature is a change to the dark theme on Pixel handsets.",
    "Currently, Pixel phones have a black background on supported apps when using the dark theme, but with Android 12, 9to5Google has found that this might change to gray, as the image above shows.",
    "It seems an odd move, since one of the reasons for a black background is that it lessens battery use with an OLED screen, and a grey background would probably be less effective at this, but visually it’s a change that some users will probably like.",
    "Android 12 probably won’t land in finished form until September, so expect to see plenty more changes and updates emerge in betas before then, and if you want to take it for a test drive, we’d expect a public beta will land in May.",
    "Via PhoneArena"
  ],
  "headers": {},
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "kdrag0n": "https://twitter.com/kdrag0n",
    "XDA Developers": "https://www.xda-developers.com/google-pixel-phone-under-display-fingerprint-scanner/",
    "in a previous Android 12 developer preview": "https://www.techradar.com/news/google-pixel-6-could-revive-the-xl-sized-pixel-phone-and-bring-another-new-feature",
    "9to5Google": "https://9to5google.com/2021/03/17/android-12-dp2-dark-theme-on-pixel-gets-even-lighter/amp/",
    "PhoneArena": "https://www.phonearena.com/news/dark-theme-gets-lighter-on-pixels-running-android-12-developers-preview-2_id130857"
  }
}