{
  "source": "https://www.techradar.com/news/xbox-series-x-restock-issues-will-continue-to-be-a-challenge-for-quite-a-while",
  "title": "Xbox Series X stock issues will continue to be ‘a challenge’ for ‘quite a while’",
  "category": "gaming",
  "updated": "2021-09-30T12:52:42Z",
  "author": "adam-vjestica",
  "summary": "Head of Xbox Phil Spencer sets expectations",
  "article": [
    "Xbox Series X stock issues are set to continue into 2022, according to Head of Xbox Phil Spencer.",
    "Spencer told The Wrap (thanks, VGC), that the ongoing global chip shortages that are impacting the development of cars, phones, and televisions, aren’t the only hurdle that’s stopping Microsoft from getting more Xbox Series X and Xbox Series S consoles into the hands of retailers.",
    "“I think it’s probably too isolated to talk about it as just a chip problem,” said Spencer. “When I think about, what does it mean to get the parts necessary to build a console today, and then get it to the markets where the demand is, there are multiple kinds of pinch points in that process. And I think regretfully it’s going to be with us for months and months, definitely through the end of this calendar year and into the next calendar year.”",
    "Spencer’s admission will undoubtedly be met with disappointment from those who are still searching where to buy an Xbox Series X, particularly as the console is approaching its one-year anniversary on November 10, 2021, and it’s something Spencer is all too aware of.",
    "“The thing that’s most disappointing is just the fan disappointment,” Spencer admitted. “People really want this new generation of consoles – they’re good consoles, both from us and the other platform holders – and they want the new functionality. We’re working hard to bring them to market but it’s going to be a challenge that we’ll work through for quite a while.”",
    "As Spencer notes, Microsoft isn’t the only console manufacturer that has been plagued with supply issues. Sony’s PS5 continues to sell out almost instantly whenever stock does appear, and Nintendo reportedly canceled a Nintendo Switch Pro model due to supply issues, something which the company has now categorically denied.",
    "Earlier in September, Toshiba’s Takeshi Kamebuchi told Bloomberg: “The supply of chips will remain very tight until at least September next year. In some cases, we may find some customers not being fully served until 2023.”",
    "The situation is looking rather bleak, then, but if you’re still on the hunt for a PS5, Xbox Series X, or a Nintendo Switch OLED, we’re constantly on the lookout for the latest restocks to help you can snag your console of choice. If you’re in the US, we recommend following TechRadar's one-man stock tracking machine, @MattSwider, who has helped tens of thousands of people secure a next-gen console."
  ],
  "headers": {
    "5": "Analysis: demand continues to outstrip supply"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "The Wrap": "https://www.thewrap.com/gaming-leaders-strauss-zelnick-of-take-two-xboxs-phil-spencer-join-thegrill-2021/",
    "VGC": "https://www.videogameschronicle.com/news/xbox-boss-phil-spencer-says-console-supply-issues-will-continue-into-2022/",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "where to buy an Xbox Series X": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Nintendo reportedly canceled": "https://www.techradar.com/news/nintendo-makes-it-official-a-4k-switch-pro-definitely-isnt-happening",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-09-03/toshiba-warns-power-chip-supply-to-stay-tight-for-another-year",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "@MattSwider": "https://twitter.com/mattswider"
  }
}