{
  "source": "https://www.techradar.com/news/msi-might-release-an-nvidia-rtx-3060-ti-just-for-crypto-mining",
  "title": "MSI might release an Nvidia RTX 3060 Ti just for crypto mining",
  "category": "computing",
  "updated": "2021-01-20T14:06:42Z",
  "author": "john-loeffler",
  "summary": "So, maybe you can find one now?",
  "article": [
    "Hardware manufacturer MSI might be preparing to release new RTX 3060 Ti graphics cards specifically designed for cryptocurrency mining, which could possibly alleviate the ongoing shortage of the new Nvidia RTX 3000 series cards.",
    "The card SKU, first flagged by Twitter user harukaze5719, showed up in the Eurasian Economic Commission database this week under the names RTX 3060 Ti Miner 8G and RTX 3060 Ti Miner 8G OC.",
    "It's not known what changes to the specs were made to these specific cards, if any, but according to Wccftech, these cards will be based on the GA104-200-A1 GPU, which has 4864 CUDA cores, 8GB GDDR6 VRAM, with a transfer rate of 14.0Gbps on a 256-bit bus.",
    "What makes these \"miner\" variants of the 3060 Ti so special isn't clear, but considering that crypto miners are a fairly utilitarian bunch, MSI and other manufacturers will likely need to do something more than just slapping a different name on the same card if they want miners to stop soaking up all the existing RTX 3060 Ti stock in pursuit of riches.",
    "While not the most \"profitable\" graphics card for crypto mining (the RTX 3090 still rules that particular roost), the far more affordable - and available - RTX 3060 Ti is still in the top ten, making it an attractive option for miners who are looking to cash in on the recent spike in Bitcoin and Ethereum prices.",
    "While the price of the Bitcoin, Ethereum, and other cryptocurrencies can swing wildly, we've definitely seen a spike in prices recently - making crypto mining using high-powered GPUs a much more profitable venture.",
    "This is bad news for gamers hoping to get their hands on one of these new graphics cards. There is already pretty enormous demand from the PC enthusiast and gamer communities chasing an already fairly small supply of cards. Add an army of ruthless digital 49ers with the scent of a gold rush to the mix and getting yourself some midrange ray tracing in 2021 will be that much harder."
  ],
  "headers": {
    "4": "Cryptocurrency threat"
  },
  "links": {
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "flagged": "https://twitter.com/harukaze5719/status/1351759258715504641",
    "Eurasian Economic Commission database": "https://portal.eaeunion.org/sites/odata/_layouts/15/Portal.EEC.Registry.UI/DisplayForm.aspx?ItemId=73907&ListId=d84d16d7-2cc9-4cff-a13b-530f96889dbc",
    "Wccftech": "https://wccftech.com/msi-readies-crypto-mining-specific-geforce-rtx-30-series-graphics-cards/",
    "profitable": "https://2cryptocalc.com/most-profitable-gpu",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}