{
  "source": "https://www.techradar.com/news/reminiscence-is-a-westworld-style-sci-fi-movie-with-cautionary-tales-at-its-heart",
  "title": "Reminiscence is a thrilling Westworld-style sci-fi movie that needed a better ending",
  "category": "entertainment",
  "updated": "2021-08-18T16:00:00Z",
  "author": "tom-power",
  "summary": "In Reminiscence, which is coming to HBO Max and theaters, nothing is as addictive as the past",
  "article": [
    "It’s curious that in the midst of a global pandemic, post-apocalyptic movies and TV shows have never been more popular. From Netflix’s Sweet Tooth TV adaptation to the acclaimed sequel A Quiet Place: Part II, dystopian stories have surprisingly become our go-to form of entertainment. Maybe it's just weirdly reassuring to see the world go to hell in a way that's a little more stylish than it is in reality.",
    "The genre’s current popularity seemingly bodes well, then, for Reminiscence. Warner Bros’ upcoming sci-fi thriller certainly has the ingredients to be successful – an all-star cast, a mysterious plot with shades of Gone Girl and Memento, and a visually arresting post-apocalyptic setting that offers a glimpse into a potential future for our planet – but how does it fare as a spectacle?",
    "Despite retreading certain genre tropes in its plot, particularly as we get deeper into the film, Reminiscence is a tense, thrilling ride that’s both inventive and realistic enough to override these shortcomings.",
    "Set in a reality where an environmental disaster has left much of the Earth’s landmass underwater, Reminiscence follows Nick Bannister (Hugh Jackman), a private investigator who has repurposed a piece of army technology that allows him to solve mysteries by reliving paying customers’ memories.",
    "After one particular client – Mae (Rebecca Ferguson) – walks into his life and changes it for the better, she vanishes into thin air. This simple case turns into a nightmare for Nick, as his search for Mae leads to him inadvertently uncovering a massive conspiracy involving dangerous people.",
    "Reminiscence is a dystopian sci-fi story with a noir-style mystery at its core, then – all the parts are familiar, but what sets it apart is its rich world building, stellar performances and the elegant way it combines its two genres.",
    "Lisa Joy, the showrunner on acclaimed HBO series Westworld, is the film’s writer-director, so fans of the post-apocalyptic sci-fi show will immediately feel at home in a similarly bleak but visually appealing and detailed world.",
    "From its opening flythrough shot to its holographic-style sequences – the latter are used to portray individuals’ memories – Reminiscence is a beautiful-looking movie. The transitions between the simulated memories and real-world scenes are fluid and, at times, the disorienting nature of how they’re spliced together adds to the mysteriousness of the plot. You can’t tell whether Nick is in the present day or reliving one of his own memories, especially early on, which adds to Reminiscence’s distortive experience.",
    "The movie’s setting, too, feels futuristic without straying too far into total implausibility. The technological advancements, such as Nick’s memory-inducing machinery, seem advanced enough that they won’t happen in our lifetimes (if ever), but the world he lives in is still sufficiently modern that its architecture, modes of transport, society and culture aren’t dissimilar to our own. The latter grounds the movie in realism and makes it seem that, barring a bona fide climate-type disaster, this is a world we could conceivably live in.",
    "Of those survivors who do inhabit Reminiscence’s world, its major stars are all on top form. Jackman is outstanding as a man who appears to have his life together but, as he digs deeper into the mystery surrounding Mae, comes unstuck mentally as the movie’s twists and turns put him through hell.",
    "Rebecca Ferguson and Thandiwe Newton also thrive as Jackman's co-leads. Ferguson’s Mae is more layered than her femme fatale persona initially makes her seem, while Newton’s Emily ‘Watts’ Sanders (Nick’s longtime colleague) is a great foil to Jackman’s Nick. The trio ooze chemistry when they share screen time, so it’s a pity that such occasions are a rarity in the grand scheme of things.",
    "Reminiscence may be a sci-fi film at its heart, but it’s hard to overlook the influence that Western movies have had on it, too. From Ramin Djawadi’s guitar-heavy score to reimaginings of classic Western-style shootouts in one set piece, Reminiscence is as much an ode to these iconic films as it is a glimpse into a plausible future. Given Joy’s expertise at combining these two contrasting genres in Westworld, it’s unsurprising to see some of the same points of inspiration here.",
    "While there’s plenty to like about Reminiscence, it's still a flawed movie.",
    "The story has numerous twists and turns that’ll keep you guessing, but its finale ends up being standard thriller fare. Reminiscence’s story unravels in a slow and intelligent manner for much of its runtime, but it’s ultimately let down by an ending that feels both anticlimactic and like something we’ve seen before.",
    "Its exploration of its themes is also somewhat lacking. Corruption, trauma and the divide between rich and poor are examined provocatively in individual moments, but not with any detail throughout the movie.",
    "Florida’s seedy underbelly is waiting to be explored in-depth in Reminiscence but, while we get a little taste of it, we don’t get to investigate it more thoroughly through Nick’s eyes and, ultimately, that’s disappointing. Just a little more effort put into this world-building would've gone a long way.",
    "Reminiscence is an enjoyable sci-fi mystery wrapped in cautionary messages about climate change and being careful what you wish for – or, rather, being careful about what you go looking for.",
    "It deserves praise for its believable neo-futuristic world, wonderful cast and blending of genres that Joy has had previous success with. Still, its frequently riveting plot doesn't retain its momentum as its finale approaches, unfortunately – which only makes this a good film, rather than a great one.",
    "Still, whether you're watching it on the big screen or HBO Max, an original sci-fi movie with a proper budget and real stars is worth treasuring these days. If any of that sounds appealing to you, Reminiscence is worth a watch.",
    "Reminiscence launches in theaters and on HBO Max on Friday, August 20."
  ],
  "headers": {
    "16": "What we think"
  },
  "links": {
    "Sweet Tooth TV adaptation": "https://www.techradar.com/news/sweet-tooth-season-2"
  }
}