{
  "source": "https://www.techradar.com/news/twitter-might-be-taking-on-slack-by-introducing-business-dms",
  "title": "Twitter might be taking on Slack by introducing business DMs",
  "category": "computing",
  "updated": "2021-12-07T21:30:07Z",
  "author": "anthony-spadafora",
  "summary": "Twitter has acquired emerging Slack competitor Quill for an undisclosed sum",
  "article": [
    "Twitter has announced that it has acquired the business messaging service Quill in a move that could enable it to take on Slack.",
    "After raising around $16m in funding, Quill exited beta earlier this year as an alternative to Slack available on Windows, macOS, Linus, Android and iOS.",
    "In a new report, TechCrunch points out that the company was founded by the former creative director of Stripe, Ludwig Pettersson who is well known and admired by many in the startup community.",
    "While neither Twitter nor Quill disclosed the terms of the deal, Quill did put out an announcement in which it informed users of its business messaging service that they will have until December 11 to export their team message data. Surprisingly though, Quill has created a Python script that allows users to transform their data into the CSV format so it can be imported into Slack.",
    "As part of the acquisition, Quill's staff will be joining Twitter's Experience organization to help work on the social network's messaging tools and direct messages while Pettersson will become a product manager reporting to the Conversations team.",
    "Since its launch in 2006, Twitter's direct messages or DMs have grown in popularity as a way to communicate quickly with others online and as a result, many have wondered whether the company would try to turn them into a standalone product or even a paid service for businesses.",
    "Online collaboration tools have become essential for businesses during the pandemic as being able to communicate with co-workers is especially important when working from home. Now that Slack is part of Salesforce, organizations may be looking for an alternative business messaging service and by purchasing Quill, Twitter is in the perfect position to offer its own solution.",
    "We'll have to wait and see what happens as a result of Twitter's Quill acquisition but with a new CEO at the helm who is actively trying to diversify its business, business DMs could be a very real possibility.",
    "We've also featured the best hybrid working tech",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Business DMs"
  },
  "links": {
    "business messaging service": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "Slack": "https://www.techradar.com/reviews/slack",
    "new report": "https://techcrunch.com/2021/12/07/twitter-acquires-quill-a-would-be-slack-rival-team-will-work-on-dms-as-quill-shuts-down/",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "announcement": "https://quill.chat/updates/2021-12-07-quill-twitter/",
    "Python": "https://www.techradar.com/best/python-online-courses",
    "DMs": "https://www.techradar.com/news/twitter-now-lets-you-send-voice-dms-heres-how-to-use-them",
    "Online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Slack is part of Salesforce": "https://www.techradar.com/news/salesforce-wants-your-company-to-build-a-digital-hq-on-slack",
    "diversify its business": "https://www.techradar.com/news/twitter-could-soon-allow-payments-to-your-favorite-accounts",
    "best hybrid working tech": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "TechCrunch": "https://techcrunch.com/2021/12/07/twitter-acquires-quill-a-would-be-slack-rival-team-will-work-on-dms-as-quill-shuts-down/"
  }
}