{
  "source": "https://www.techradar.com/news/amd-ryzen-5000-mobile-processors-arrive-at-ces-2021-to-steal-the-laptop-crown-from-intel",
  "title": "AMD Ryzen 5000 mobile processors arrive at CES 2021 to steal the laptop crown from Intel",
  "category": "computing",
  "updated": "2021-01-12T17:00:50Z",
  "author": "matt-hanson",
  "summary": "7nm for the win",
  "article": [
    "AMD’s CEO, Dr Lisa Su, delivered a triumphant keynote at CES 2021, where she showed off the much-anticipated AMD Ryzen 5000 series of mobile processors.",
    "The new processors are based on the same Zen 3 architecture as the desktop Ryzen 5000 CPUs that launched at the end of 2020 (to much critical and commercial acclaim), and look like they could seriously trouble Intel, threatening its current market-leading position in laptops.",
    "AMD has promised incredible performance thanks to its 7nm processor, while also offering longer battery life, and “the only 8-core x86 CPU for ultrathin laptops”.",
    "AMD talked up a big game when it came to Ryzen 5000 mobile CPUs, which are aimed at gamers, creatives and general users. When it comes to productivity apps, AMD promises a decent advantage over the Intel Core i7-1165G7, and a big leap over previous Ryzen 4000 mobile processors.",
    "When it comes to battery life, AMD claims the Ryzen 7 5800U can last up to 17.5 hours in general usage, and up to 21 hours when playing back movies. We’ll need to verify these claims ourselves, but if they're even remotely accurate these new processors could be a real game-changer for laptops.",
    "AMD also highlighted its Ryzen 5000 HS series of mobile CPUs for gaming PCs, which promise excellent gaming performance, while keeping power consumption down to 35W TDP.",
    "The flagship processor is the AMD Ryzen 9 5980HS, with eight cores and 16 threads, plus a 3GHz base and 4.8GHz boost clock.",
    "If you want more power, and battery life isn’t so important, then the AMD HX processors could be for you. These are unlocked for overclocking with some OEM systems, and with a TDP of 45W+ they're designed to really push the boundaries of what a gaming laptop is capable of.",
    "The full lineup of AMD Ryzen 5000 mobile processors is below:",
    "Along with the new mobile Ryzen 5000 CPUs, AMD also announced new lower-TDP alternatives to the AMD Ryzen 9 5900X and AMD Ryzen 7 5800X – the AMD Ryzen 9 5900 and AMD Ryzen 7 5800 respectively.",
    "Running on the same Zen 3 architecture, but with a 65W TDP, these CPUs are designed to offer more efficient performance.",
    "AMD Ryzen Threadripper Pro processors are also now being made available to consumers, offering up to 64 cores, eight channels of memory and 128 PCIe Gen 4 lanes.",
    "As for the mobile processors, we should start seeing an influx of laptop makers announce devices running on Ryzen 5000 imminently, and we can’t wait to test them out."
  ],
  "headers": {
    "4": "For gamers",
    "9": "More CPUs"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "AMD Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000"
  }
}