{
  "source": "https://www.techradar.com/news/mario-kart-live-home-circuit-now-on-sale-in-amazons-latest-nintendo-switch-deals",
  "title": "Mario Kart Live: Home Circuit now on sale in Amazon's latest Nintendo Switch deals",
  "category": "gaming",
  "updated": "2021-02-23T11:57:07Z",
  "author": "tabitha-baker",
  "summary": "AR racing drops to all time price low",
  "article": [
    "Nintendo Switch deals have been offering some excellent discounts on games and accessories over the last few weeks, and now you can save on one of the latest peripherals to come out of the Nintendo fun factory.",
    "Mario Kart Live: Home Circuit is an AR experience that uses a real life RC car and your Nintendo Switch to create full Mario Kart courses in your own home. All that tech usually comes at a premium, with the full Mario or Luigi set coming in at $99.99. However, you'll find it at a $10 discount at Amazon right now, with a final $89 sales price.",
    "That's an excellent reduction not just because Nintendo Switch deals rarely offer discounts on premium accessories like this, but also considering demand was so high for this peripheral at launch last year. Mario Kart Live was out of stock for its first couple of weeks on the market, so a price drop just a couple of months later makes for a particularly enticing offer.",
    "Not in the US? Scroll down for more Mario Kart Live: Home Circuit prices in your region.",
    "You'll find plenty more Nintendo Switch deals available on cheap Joy-Con and Pro Controller sales, but we're also rounding up all the latest Nintendo Switch Lite bundles as well."
  ],
  "headers": {
    "4": "More Mario Kart Live: Home Circuit deals"
  },
  "links": {
    "with a final $89 sales price": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FMario-Kart-Live-Circuit-Nintendo-Switch%2Fdp%2FB08HF7PBLJ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9277758484086915000-20",
    "Mario Kart Live: Home Circuit prices": "https://www.techradar.com/deals/best-mario-kart-live-home-circuit-price-deals-sales",
    "Nintendo Switch deals": "https://www.techradar.com/news/nintendo-switch-deals",
    "cheap Joy-Con": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "Pro Controller sales": "https://www.techradar.com/deals/nintendo-switch-pro-controller-price-sales-cheap",
    "Nintendo Switch Lite bundles": "https://www.techradar.com/deals/cheap-nintendo-switch-lite-prices-bundle-deals"
  }
}