{
  "source": "https://www.techradar.com/news/most-companies-have-little-idea-how-to-recover-from-a-ransomware-attack",
  "title": "Most companies have little idea how to recover from a ransomware attack",
  "category": "computing",
  "updated": "2021-09-10T11:04:11Z",
  "author": "sead-fadilpasic",
  "summary": "Confidence in security solutions is low",
  "article": [
    "Despite ransomware threats making headlines on an almost daily basis, most organizations are still clueless about how to recover from such an attack, a report from Dell Technologies has found.",
    "Its 2021 Global Data Protection Index (GDPI), based on a global survey of 1,000 IT decision-makers, found that more than two-thirds (67%) aren’t confident their business-critical data could be recovered in case of a ransomware attack.",
    "What’s more, a similar proportion (62%) believe their current security solutions aren’t strong enough to protect data from malware and ransomware threats, adding that the rising number of remote workers only makes it more challenging.",
    "Emerging and growing technologies such as cloud-native applications, Kubernetes containers, Artificial Intelligence and Machine Learning are also perceived as a risk to data protection, mostly because security solutions for these tools have not yet matured.",
    "To make matters even worse, businesses are now managing more than 10 times the amount of data they did just half a decade ago (from 1.45 petabytes in 2016, to a staggering 14.6 petabytes this time around).",
    "And they seem to be right. More than a third of businesses worldwide experienced a ransomware attack, or a similar event in which access to crucial data was denied, in the past 12 months alone. Furthermore, almost a third (30%) reported data loss in the last year and nearly half (45%) experienced unplanned system downtime.",
    "In an effort to curb cybercriminals’ efforts, many firms would deploy multiple data protection vendors, but the only thing that achieved was a higher cost of data loss. Dell found that on average, the cost of data loss in the last 12 months was almost four times higher for those firms who used multiple data protection vendors, compared to those that had only one.",
    "Commenting on the findings of the report, Dell’s president and general manager, Infrastructure Solutions Group, Jeff Boudreau, said that, despite the current climate, businesses should not lay down on their backs with all fours in the air: “While ransomware attacks can be devastating for people and businesses, accepting defeat as a foregone conclusion is not the answer,” he concluded."
  ],
  "headers": {
    "5": "Accepting defeat"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "remote workers": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}