{
  "source": "https://www.techradar.com/news/bose-upgrades-its-popular-bluetooth-speakers-with-boost-to-battery-life",
  "title": "Bose upgrades its popular Bluetooth speakers with boost to battery life",
  "category": "audio-visual",
  "updated": "2021-01-25T10:07:34.524Z",
  "author": "olivia-tambini",
  "summary": "Bose's Soundlink Bluetooth speakers have been updated",
  "article": [
    "Audio giant Bose has unveiled two new Bluetooth speakers for 2021: the Bose Soundlink Revolve II and the Bose Soundlink Revolve+ II.",
    "The successors to the Soundlink Revolve and Revolve+ portable speakers, the new models are nearly identical to the brand's popular speakers, albeit with a few important upgrades.",
    "The new Revolve II now comes with a 13-hour battery life, a modest upgrade from its predecessor's 12-hour charge. Meanwhile, the battery life of the Revolve+ II has been increased from 16 to 17 hours.",
    "Both Bluetooth speakers have been given an IP55 rating, increasing their water-resistance, and adding protection from dust.",
    "Like their predecessors, the updated speakers deliver 360-degree audio, thanks to a wraparound grille that pumps sound out in all directions.",
    "However, the Bose Soundlink Revolve+ II delivers a higher volume and a more room-filling sound than the SoundLinkRevolve II, according to Bose, so may be more suited for use outdoors where there are fewer hard surfaces for sound to bounce off of. Bose hasn't tinkered with the audio output of its upgraded speakers – though, we were so impressed by the sound performance of the original Soundlink Revolve and Revolve+, that this doesn't come as a disappointment.",
    "In terms of design, the new speakers are nearly identical, though the Soundlink Revolve+ II is a little bigger and features a handy carrying handle, making it more easily portable.",
    "Both speakers are available to buy now, with the Bose Soundlink Revolve II priced at $199.95 / £179.95, and the larger Bose Soundlink Revolve+ II costing $299.95 / £279.95.",
    "There's no word yet on Australian pricing and availability, but that works out at around AU$260 / $380 respectively.",
    "While these upgrades may seem rather small, it's worth bearing in mind that the original Revolve speakers were already rather good – in fact, we awarded both speakers 4 out of 5 stars when we reviewed them a few years ago.",
    "Both models were due an upgrade in any case, with the Soundlink Revolve launching way back in 2017 and the Revolve+ following soon after in 2018.",
    "Neither the previous models nor the upgraded versions come with an onboard voice assistant, though we wouldn't have expected Bose to add smart capabilities when it has the Bose Portable Home Speaker.",
    "With a choice of Alexa or Google Assistant, Bose's portable smart speaker borrows the bucket-like design of the Soundlink Revolve+. It may not sound quite as powerful as its biggest competitor, the Sonos Move, but it’s still a solid choice if you don’t want to sacrifice audio fidelity for portability.",
    "In any case, it seems Bose now has a portable speaker suitable for pretty much any occasion or environment, if not every budget. If you are looking for a bargain, we'd recommend looking out for deals on the older models, which are likely to be discounted now that they've been upgraded."
  ],
  "headers": {
    "4": "360-degree audio",
    "9": "Small changes"
  },
  "links": {
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Soundlink Revolve": "https://www.techradar.com/reviews/bose-soundlink-revolve",
    "Revolve+": "https://www.techradar.com/reviews/bose-soundlink-revolve-plus",
    "Bose Portable Home Speaker": "https://www.techradar.com/reviews/bose-portable-home-speaker",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079"
  }
}