{
  "source": "https://www.techradar.com/news/rick-and-morty-season-6",
  "title": "Rick and Morty season 6: it's coming, and here's everything we know right now",
  "category": "entertainment",
  "updated": "2021-09-07T11:34:35Z",
  "author": "samuel-roberts",
  "summary": "What we know about Rick and Morty season 6",
  "article": [
    "Rick and Morty season 6 is on the way, even though season 5 of the Adult Swim animated sitcom has only just wrapped up (in spectacular fashion we might add). The future of Dan Harmon and Justin Roiland's popular series was secured a few years ago, when 70 more episodes of the show were ordered after season 3 ended – that means we have 50 episodes left to go of that order, with 20 ticked off between seasons 4 and 5.",
    "We're happy about that, because we think the series is still flying high – and Rick and Morty season 6 can't come soon enough. Season 5 showed the series at its peak on at least two occasions (particularly in the way the show explored Rick and Birdperson's relationship), and even the episodes that didn't totally land were still entertaining.",
    "The writers have kept the series evergreen by alternating between lore-heavy episodes, throwaway installments with gross jokes, and genuinely brilliant instances of sci-fi storytelling. No wonder people are still watching it in droves.",
    "Rick and Morty, then, isn't going anywhere. But what do we know about season 6? We'll lay out the specifics below, and any predictions we might have about what's to come.",
    "Release date: Rick and Morty season 6 doesn't have a release date yet, but based on how season 4 and 5 were spaced apart by roughly a year, we'd expect to see it around September 2022. At the very least, we'd be surprised if some new episodes didn't air next year.",
    "How many seasons will there be? Rick and Morty is 20 episodes into a 70-episode order right now, so we expect 10 seasons in total from that. It's possible, too, that the show could keep running.",
    "What do we know about production progress? The main bulk of the writing on season 6 appears to be wrapped up. In fact, the writers have finished season 7 as well. It's not exactly a linear process, however – parts of the show are tweaked much later after they've been partially animated.",
    "Rick and Morty season 6 doesn't have a release date, yet – but it doesn't actually matter. We're fairly certain we'll see new episodes before the end of 2022. Season 4 wrapped up back in May 2020, then season 5 followed in June 2021 and wrapped up in September – this time without the long break between halves of the season (though there was a short pause before the finale).",
    "Co-creator Dan Harmon has previously said the wait between seasons \"will never be this long again\", referring to the almost two-year wait between seasons 3 and 4.",
    "We think a Rick and Morty season 6 release date in the final four months of 2022 is quite likely, then, based on that track record. It's also important to note that work on season 6 began long ago – by July 2020, at Adult Swim's virtual comic con, Harmon was already talking about it. At that point, the writers had mostly finished their work writing season 5, and the process for writing season 6 had begun.",
    "\"But we've got all these writers out to script season 6, and we've spent the last couple of months with new writers talking about season 6,\" Harmon said. \"It's a crazy situation to be in because this show has notoriously kept everyone behind schedule. The artists have always been waiting for scripts. And now, finally, we're trying to change that game and have them always have something to draw, while we move ahead. And so we're there now.\"",
    "In addition, Rick and Morty season 7 writing had already begun by February 2021, suggesting that season 6 was mostly done by that point.",
    "That, then, sounds like a reassurance that Rick and Morty season 6 won't be two years away. We think you'll see at least some episodes next year.",
    "With Rick and Morty now 20 episodes into its 70-episode order from back in 2018, we think you've got a minimum of five seasons left of the show – each one tends to be around 10 episodes long, so that tracks. So, this show is likely to run until season 10 at the least.",
    "We wouldn't want to try and predict what the writers have planned for Rick and Morty season 6's story (especially after that dense, lore-heavy season finale), but there are a couple of other bits worth knowing about the next season.",
    "Writer Jeff Loveness, for example, has left the show as of season 5's finale – he wrote 'Mort Dinner Rick Andre' and the final episode of this current run, so he was a significant presence on the show. He's gone on to write Ant-Man and the Wasp: Quantumania.",
    "And while you still have a long wait for season 6, the writers really are ahead on this show. They've finished writing season 7, as of August 2021, according to story editor Cody Ziglar.",
    "Harmon really meant it when he promised there'd be no more season 4-style delays. We think this probably means that Rick and Morty's producers are aiming to get new episodes out every year now."
  ],
  "headers": {},
  "links": {}
}