{
  "source": "https://www.techradar.com/news/we-speak-to-whatsapp-about-the-new-features-coming-up-for-your-device",
  "title": "We speak to WhatsApp about the new features coming to your device",
  "category": "phones",
  "updated": "2021-07-28T15:09:24Z",
  "author": "daryl-baxter",
  "summary": "So many features, so little time",
  "article": [
    "We’ve seen a multitude of features be announced and released by the WhatsApp team as of late, with multi-device support in testing, to archived chats now staying archived.",
    "There’s been plenty that’s either been in testing or simply announced by the company, almost as a way of showing users that they are listening to feedback and are clearly working on features that matter to most.",
    "However, with this sudden uptick, we wondered whether it was a consequence of the pandemic that has made the company realize just which features need more priority, and whether they’re looking into other benefits for the app.",
    "With this in mind, we spoke to a spokesperson at WhatsApp to see just what they thought of multi-device and other features coming to users soon.",
    "With this feature being in the works for many years, we asked a WhatsApp spokesperson what this means for local backups, but said that “We have no news to share on this topic.”",
    "However, with many using WhatsApp Web on their PC and tablet to be a substitute for the app, we wondered whether this meant the end of this feature, with multi-device replacing it instead.",
    "“WhatsApp Web remains an important platform for our users. Until now, WhatsApp has only been available on one device at a time. Desktop and Web support only worked by mirroring off your phone - which meant your phone had to be on and have an active internet connection,” a WhatsApp spokesman told us.",
    "“Multi-device means that users will have the same functionality that is available on the current public versions of WhatsApp Web, Desktop and Portal, just without the need to have your phone connected. Our multi-device capability immediately makes the experience better for people who use Desktop/Web and Portal. And it also will make it possible to add support for more kinds of devices over time.”",
    "We’ve seen so many new features arrive on WhatsApp in the last year, so we asked whether the pandemic had pressed fast-forward on these features to be brought to users now.",
    "“We are always working to make private conversations on WhatsApp feel as close to in-person as possible, regardless of where you are in the world or the tech you’re using. With so many people still apart from their loved ones, adjusting to new ways of working and trying to keep their businesses running, we’ve focused on how we can provide more support in these areas,” a spokesperson told us.",
    "“Lately, we’ve launched desktop calling, new features to make business messaging faster and easier and continued to support the COVID response efforts with messaging chatbots to make finding information about vaccines easier.”",
    "With this in mind, there are markets that offer app stores that give the user even more choice to personalize their Line app. We asked WhatsApp whether this was also something It was considering, but had no comment to add.",
    "It’s difficult to imagine a time where our main app to converse with friends was either on AIM or MSN Messenger through our Windows XP computer. But now messaging apps are on almost every smart device, with new features appearing almost every month to help make it easier for users to communicate with their friends and family, especially in these times.",
    "WhatsApp took a hit earlier this year with its muddled privacy agreement, confusing many users and causing them to simply reject the policy. However, it looks as though WhatsApp has seen the error of Its ways, and are making it easier for users to access features that many have been long asking for.",
    "It will be an interesting time once multi-device support arrives for everyone to see just how WhatsApp will be used on devices that don’t have the local app available. With Windows 11 rapidly on its way and new rumored devices from Apple, Samsung and more to come, it looks as though this feature couldn’t have come at a better time, and could further increase the gap to its messaging competitors."
  ],
  "headers": {
    "4": "Multi-Device in progress",
    "8": "The timing of new features",
    "12": "Analysis: There’s definitely more to come"
  },
  "links": {
    "multi-device support": "https://www.techradar.com/news/whatsapp-update-shows-how-multi-device-linking-will-look",
    "WhatsApp": "https://www.whatsapp.com/",
    "desktop calling": "https://blog.whatsapp.com/introducing-private-and-secure-calling-from-the-desktop",
    ",": "https://blog.whatsapp.com/introducing-private-and-secure-calling-from-the-desktop",
    "messaging chatbots": "https://blog.whatsapp.com/cdc-spanish-language-vaccine-finder-on-whatsApp",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Apple": "https://www.techradar.com/reviews/iphone-13",
    "Samsung": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review"
  }
}