{
  "source": "https://www.techradar.com/news/ios-151-news",
  "title": "iOS 15.1 release date, news and all the new features coming to your iPhone",
  "category": "phones",
  "updated": "2021-10-25T17:25:34Z",
  "author": "james-rogerson",
  "summary": "From SharePlay to ProRes and beyond",
  "article": [
    "Your iPhone will have only recently got iOS 15, but already iOS 15.1 is out. Despite this just being a 0.1 update, it brings some significant features and improvements to the iOS experience.",
    "These include the headline SharePlay feature, plus multiple camera improvements and more besides.",
    "Below we’ll run you through exactly what we’re expecting from it – which we have a good idea of thanks to betas. You’ll also find information on the compatibility of iOS 15.1.",
    "iOS 15.1 released on October 25, bringing SharePlay and other improvements to compatible iPhones.",
    "As for compatibility, if your phone can get iOS 15 then it can also get iOS 15.1. In fact, any model from the iPhone 6S onwards can.",
    "Now that iOS 15.1 Is out, here’s the following features of what we’ve come across so far.",
    "SharePlay was supposed to land with iOS 15, but it got delayed and is now launching as the headline feature of iOS 15.1 instead.",
    "This allows users to stream films and shows or listen to music while on FaceTime calls and have the content in sync for everyone, and it also includes a screen sharing feature.",
    "This sort of thing would have been ideal during the peak of the pandemic when most interactions were distanced, but even now we can imagine it being a handy feature for a lot of people.",
    "There’s more than one big feature in iOS 15.1, with ProRes also making an appearance. This is exclusive to the iPhone 13 Pro and iPhone 13 Pro Max though, so less widely available.",
    "This is a video recording format, and while it’s not new, this is the first time a smartphone has been able to record in the format. It’s designed to be visually lossless (though it’s technically compressed), and it’s also less intensive on your computer’s CPU than formats like H.264 and H.265 when editing.",
    "However, ProRes files take up a lot of space, and for that reason you’re limited to recording in 1080p at 30fps if you have a phone with just 128GB of storage, but for other models ProRes tops out at 4K quality at 30fps.",
    "To enable ProRes once you have iOS 15.1, just head to the Camera section of the main Settings app, and select ProRes under the Formats option.",
    "A smaller camera feature being added is the option to disable the Auto Macro mode found on the iPhone 13 Pro and iPhone 13 Pro Max. Currently these phones will automatically switch to the ultra-wide lens when you get close to something, as this lens powers the macro mode and can focus from just 2cm away.",
    "So in most cases it’s the best lens for the job if you’re getting in close, but there may be occasions where you’d rather use a different lens, and if you disable Auto Macro then you’ll have the choice.",
    "When used in combination with HomePod 15.1, iOS 15.1 allows you to play lossless audio and Dolby Atmos with Spatial Audio support through the HomePod or HomePod mini. These features are already available on other Apple devices, so they’re overdue really.",
    "iOS 15.1 allows users to add their Covid-19 vaccination records into the Health app. Once done, you should also be able to add a vaccine card to the Wallet app, which will include a QR code that can be scanned by any business or organization that you want to prove your vaccination status to.",
    "That said, these features will only work if your healthcare provider has opted in and implemented them. It seems like at the moment it’s limited to providers that use Smart Health Cards, which are only currently used by select US states and vaccination centers.",
    "As well as new features, iOS 15.1 also includes bug fixes, with a big one being a fix for a bug that prevents some users from using the Unlock with Apple Watch feature, designed to let iPhone users who are wearing masks bypass Face ID.",
    "We’d expect there will be numerous other bug fixes in iOS 15.1 as well, though exactly what they are remains to be seen."
  ],
  "headers": {
    "3": "iOS 15.1 release date and compatibility",
    "5": "iOS 15.1 features",
    "6": "SharePlay",
    "9": "ProRes",
    "13": "Auto Macro toggle",
    "15": "Lossless audio and Dolby Atmos for HomePods",
    "16": "Covid-19 vaccination records in the Health and Wallet apps",
    "18": "A fix for Unlock with Apple Watch",
    "19": "Other bug fixes"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "it got delayed": "https://www.techradar.com/news/shareplay-is-delayed-for-ios-15-is-it-time-for-a-two-year-release-schedule",
    "ProRes": "https://www.techradar.com/news/what-is-apple-prores",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini"
  }
}