{
  "source": "https://www.techradar.com/news/google-wants-to-help-make-your-new-website-look-even-better",
  "title": "Google wants to help make your new website look even better",
  "category": "computing",
  "updated": "2021-02-18T11:11:00Z",
  "author": "barclay-ballard",
  "summary": "Material Design is now available as a WordPress plugin",
  "article": [
    "Google has launched a WordPress plugin version of its Material Design theme, giving website builders the opportunity of mirroring the design used by the tech firm on its first-party sites. The plugin is currently only available to individuals with a business-level WordPress plan.",
    "The plugin remains at an experimental stage but lets users customize site colors and icons in the style associated with Material Design, which is known for its realistic lighting, shadowing, and responsive animations. As the plugin has only just been launched, Google has asked for feedback from users on what is working well and what isn’t.",
    "“We want to use this time to learn more about what you want and need from a Material experience for WordPress,” Jonathan Bingham, the Material Design product manager, wrote. “Love it? Hate it? What features would you like to see? Your feedback can help us understand what people building content-oriented sites need from a design system, making Material for the web better for everyone.”",
    "By bringing Material Design to WordPress, Google gains access to a huge audience, with around 40% of the world’s websites using the CMS platform. Like other WordPress plugins, Material Design fits in with the WYSIWYG experience, using the WordPress block editor to allow users to create Material layouts for their web pages.",
    "Google currently offers three starter themes through the Material Design plugin, with each one coming accompanied by a number of customization options. These include typography from Google Font, colors, shapes, and icon styles.",
    "Although Material Design is currently used for Android apps and Google’s own sites, the launch of a WordPress plugin means that you might start seeing more webpages adopting its familiar look. Installing the plugin is straightforward, with it found in the admin panel of the WordPress dashboard.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "New themes"
  },
  "links": {
    "WordPress plugin": "https://www.techradar.com/best/best-wordpress-plugins",
    "design": "https://www.techradar.com/news/best-web-design-software",
    "wrote": "https://material.io/blog/material-design-wordpress-plugin",
    "CMS platform": "https://www.techradar.com/best/cms",
    "Android apps": "https://www.techradar.com/best/best-android-apps-2021",
    "9to5Google": "https://9to5google.com/2021/02/16/google-material-design-wordpress/"
  }
}