{
  "source": "https://www.techradar.com/news/samsung-galaxy-note-20-ultra-vs-samsung-galaxy-z-fold-2-to-fold-or-not-to-fold",
  "title": "Samsung Galaxy Note 20 Ultra vs Samsung Galaxy Z Fold 2: to fold or not to fold?",
  "category": "phones",
  "updated": "2021-07-03T12:00:19Z",
  "author": "jon-mundy",
  "summary": "The best of yesterday or a taste of tomorrow?",
  "article": [
    "Samsung releases so many phones these days that it can be hard to get a complete view of its range.",
    "For example, while the Samsung Galaxy S21 Ultra is widely considered to be the brand’s current top dog, both the Samsung Galaxy Note 20 Ultra and the Samsung Galaxy Z Fold 2 can also be considered current.",
    "These are two classy, pricey 2020 flagship phones with unique features that set them apart from the crowd.",
    "So which of these two aging heavyweights is the best buy in 2021? Let’s see if we can find out.",
    "The Samsung Galaxy Note 20 Ultra hit shops on August 21, 2020. At launch it cost $1,299 for the basic 128GB model over in the US, whereas in the UK and Australia you could buy a 256GB model for £1,179 / AU$1,849. Bumping the storage capacity up to 512GB would set you back $1,449 / £1,279 / AU$2,199.",
    "That was some time ago, of course, and you may well be able to find a discount if you shop around. Generally speaking, however, the phone has retained its value, which in itself demonstrates what a uniquely compelling handset it continues to be.",
    "The Samsung Galaxy Z Fold 2 was announced on August 5, 2020 before hitting shops on September 18 for $1,999 / £1,799 / AU$2,999.",
    "Unlike the Galaxy Note 20 Ultra, it’s possible to find a hefty discount on the Galaxy Z Fold 2. At the time of writing, for example, it's available for £1,349.99 on Amazon UK.",
    "Whether you manage to find a discount or not, however, the Galaxy Note 20 Ultra is the cheaper phone of the two.",
    "Both of these phones make a serious design statement, but in very different ways. Aside from offering the same striking Mystic Bronze and much-less-striking Mystic Black color options, they’re very different phones.",
    "The Samsung Galaxy Note 20 Ultra was arguably the most handsome smartphone of 2020, and it would give any of the 2021 brigade a good strut-off too. With its classy combination of tasteful matte back, shiny flat top and bottom edges, and almost non-existent side frame, it’s subtly different to anything else out there.",
    "Its pronounced camera module seemed extremely in-your-face at the time, but seems almost restrained by modern standards, thanks in large part to the Xiaomi Mi 11 Ultra. It only adds to that industrial-chic look.",
    "This is a big, but still just about manageable, phone at 164.8 x 77.2 x 8.1mm. At 208g, it’s heavy, but again far more easy to wield than other super-phones.",
    "The Samsung Galaxy Z Fold 2 makes an impression for a very different reason - namely its wild fold-out form factor. This is essentially a very thick smartphone that folds out into a very thin (6.9mm) tablet. Fully extended, it measures 159.2 x 128.2mm.",
    "It weighs a pretty massive 282g though, placing it well above and beyond any normal (i.e. non-foldable) phone. This device is a commitment in more ways than its price tag.",
    "Unorthodox premise aside, the Galaxy Z Fold 2 feels more like the future of phones than any other phone on the market, including the Galaxy Note 20 Ultra. What’s more, thanks to its ‘Hideaway Hinge’, which enables the phone to be propped open between 75 and 115 degrees, Samsung has found a way to refine the original Fold’s form factor whilst keeping lint out.",
    "Not entirely, though. There’s no IP rating here, unlike with the IP68-certified Galaxy Note 20 Ultra, and you’ll notice a slight crease halfway along the screen when fully opened out.",
    "As big as the Samsung Galaxy Note 20 Ultra’s screen is - and at 6.9-inches it’s as big as a traditional smartphone tends to get - the Galaxy Z Fold 2’s is bigger. Much bigger.",
    "Fully extended, the Fold 2’s screen measures a whopping 7.6-inches. Throw in a significantly squarer 5:4 aspect ratio, and you have a much more expansive canvas on which to enjoy media content.",
    "Both Super AMOLED displays are capable of a 120Hz variable refresh rate, but only the Galaxy Note 20 Ultra can manage a Quad HD (1440 x 3088) resolution for a super-sharp 496 ppi. The Galaxy Z Fold 2 can only hit 1768 x 2208 and 373 ppi.",
    "It’s worth noting, however, that the Galaxy Note 20 Ultra can’t do QHD and 120Hz simultaneously. If you want those silky-smooth refresh rates, you’re going to have to drop to FHD+.",
    "Both phones give you subtle visual distortions, in their own way. The Galaxy Note 20 Ultra has a pair of subtly curved edges, while the Galaxy Z Fold 2 has that crease right up the middle. The latter is much more distracting - or it can be, if you’re the sort of person who can’t help but notice such things.",
    "There’s also a secondary display with the Samsung Galaxy Z Fold 2. On the front of the phone, when the main display is folded away, you get to use a 6.23-inch Super AMOLED ‘Cover Display’. It’s only 816 x 1536 pixels and 60Hz, but it enables you to use the device as a ‘normal’ phone when you don’t need the full fold-out effect.",
    "There’s really no contest when it comes to the camera capabilities of these two phones. And the result pans out perhaps not in the direction you might be expecting.",
    "Despite being the cheaper phone, the Galaxy Note 20 Ultra has far better photographic chops than the Galaxy Z Fold 2. It’s led by a meaty a 1/1.33\" 108MP wide sensor with a fast f/1.8 aperture. This utilizes a 9-in–1 pixel binning technique to produce impressively sharp shots.",
    "The other two sensors are a 12MP f/2.2 ultrawide with laser-assisted phase detection autofocus, and a 12MP f/3.0 with 5x optical zoom.",
    "By contrast, the Samsung Galaxy Z Fold 2 packs a modest trio of 12MP sensors, led by a smaller 1/1.76\" wide. The 12MP telephoto, meanwhile, only reaches out to a more humble 2x optical zoom.",
    "All in all, the Galaxy Z Fold 2 shoots very well. But even in our original review we specifically noted that it wasn’t up to Galaxy Note 20 Ultra’s standards.",
    "One small thing the Fold 2 has going for it, though, is the potential for snapping a photo using the unfolded 7.6-inch display, and seeing a live preview on the Cover Display. Get someone to take a picture of you, and you can handle the framing yourself - with a little verbal direction.",
    "Also, the Samsung Galaxy Z Fold 2 features a pair of 10MP f/2.2 sensors for selfies - one for the open device, one when closed. The Galaxy Note 20 Ultra has the one 10MP selfie camera.",
    "On the video front, both phones can shoot 4K at 60fps, but only the Galaxy Note 20 Ultra can extend that to 8K at 24fps.",
    "These two phones belong to the same generation, so it’s no surprise that that they are roughly as capable as one another.",
    "Certainly if you were to buy one of each in the US, you’d be getting two Snapdragon 865 devices. That’s no longer the fastest chip on the market, but it’s plenty fast enough all the same. Geekbench 5 multi-core scores in excess of 3000 ensure it remains competitive, even as its GPU has fallen a little behind the newer Snapdragon 888.",
    "Both phones get 12GB of RAM, though, which is a generous allotment.",
    "We’d still give the Samsung Galaxy Z Fold 2 the performance edge however, and that comes down to Samsung’s decision to split its chip provision along regional lines. If you were to buy one of each phone anywhere in the world apart from the US and China, the Galaxy Note 20 Ultra would have a performance deficiency thanks to its use of Samsung’s own Exynos 990 chip.",
    "This home-brewed chip is roughly in the same performance ballpark as the Snapdragon 865, but Qualcomm’s chip is measurably faster and more efficient.",
    "If the Galaxy Z Fold 2 has a slight performance advantage, then the Galaxy Note 20 Ultra wins back some brownie points with its integrated S Pen. We’re a little mystified that this hasn’t been included with the Galaxy Z Fold 2, where its large tablet-like display would seem custom-made for Samsung’s brilliant stylus.",
    "As it is, the Galaxy Note 20 Ultra continues to remain relevant thanks to this exclusive inclusion. The housing mechanism is as elegant as they come, while the functionality is more powerful than ever.",
    "You can quickly use the S Pen to scribble something on the screen even without waking it, have your hand-written notes automatically transcribed into digital text, and even draw detailed pictures thanks to the S Pen’s on-point handling and impressively subtle pressure sensitivity.",
    "The Galaxy Z Fold 2 gives you 256GB of internal storage as standard, with the option of a 512GB variant. The Galaxy Note 20 Ultra offers the same provisions, but depending on your region there’s also a 128GB option. Only the Galaxy Note 20 Ultra has a microSD slot, however.",
    "Both phones runs Android 11 with Samsung’s own One UI 3.0 layered on top. It’s a fast, customizable UI, and a darned site better than it used to be on the bloatware front - even if it’s still not perfect.",
    "The Galaxy Z Fold 2 gains a dedicated Flex Mode, which lets you split compatible apps across both sides of the fold for leveled-up multitasking. Implementation isn’t quite as extensive as we’d like right now, though.",
    "On the other hand, the Galaxy Note 20 Ultra gets custom S Pen features and apps that really capitalize on Samsung’s powerful stylus. It’s arguably better integrated than the Fold 2’s unique split screen, though you’d expect that given how much more mature the S Pen technology is.",
    "Both the Galaxy Note 20 Ultra and the Galaxy Z Fold 2 have 4500 mAh batteries, which isn’t that big by modern standards. Especially not given the size of these displays.",
    "This is especially so with the Galaxy Z Fold 2, where it’s having to drive a uniquely large 7.6-inch display at 120Hz, in addition to a secondary 6.23-inch display. Our reviewer generally managed to get through a full day, but only when using the standard 60Hz refresh rate. Bumping things up to 120Hz made things far hairier.",
    "Over in the opposite corner, the Galaxy Note 20 Ultra has a 6.9-inch Super AMOLED display to drive, though the lack of a simultaneous QHD and 120Hz option helps mitigate the damage. Generally speaking, we were able to get through a whole day of FHD/120Hz with 20% left. We’re talking fairly intensive days too, filled with photos and videos, not to mention YouTube streaming.",
    "When it comes to recharging, both phones pack in a 25W chargers and support wireless charging. That’s table stakes for such expensive phones - especially when the likes of Oppo, OnePlus, and Xiaomi are now bundling in 60W+ chargers.",
    "Samsung’s two pricey flagship phones are contemporaries, so you might not think that it would be difficult to judge which is better. But despite their shared vintage, they really offer very different packages.",
    "While the Galaxy Z Fold 2 was and still is a compelling slice of the future, the Galaxy Note 20 Ultra was nothing less than the best phone of 2020. The former is flawed, but it gives you something genuinely unique. The latter simply gave you the best of everything, and was very hard to pick fault with.",
    "As time has moved on, the Galaxy Note 20 Ultra has been largely superseded by the Samsung Galaxy S21 Ultra - integrated S Pen aside. Meanwhile there’s been nothing to take the place of the Galaxy Z Fold 2 as yet.",
    "If you’re simply looking for a great phone right now, then the Galaxy Note 20 Ultra is the better bet. It’s more robust, has a better camera, and will last you through the day more reliably.",
    "But if you want a taste of tomorrow, it’s hard to resist the Galaxy Z Fold 2’s futuristic allure. Of course, in both cases, you might want to hold off a few months to see what Samsung has up its sleeve."
  ],
  "headers": {
    "4": "Samsung Galaxy Note 20 Ultra vs Samsung Galaxy Z Fold 2 price and availability",
    "9": "Design",
    "17": "Display",
    "23": "Cameras",
    "31": "Specs and performance",
    "43": "Battery life",
    "47": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review"
  }
}