{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-4-could-keep-the-z-fold-3s-worst-feature",
  "title": "Samsung Galaxy Z Fold 4 could keep the Z Fold 3's worst feature",
  "category": "phones",
  "updated": "2021-11-18T10:31:40Z",
  "author": "tom-bedford",
  "summary": "An under-display camera",
  "article": [
    "While the Samsung Galaxy Z Fold 3 was well-received, one issue we found in our testing was with the front-facing camera when the device was opened up - it was an under-display camera, which is pretty novel, but resulting pictures weren't very sharp.",
    "Well it sounds like Samsung isn't giving up on the feature, because apparently the Galaxy Z Fold 4 - and also Galaxy Z Flip 4 - could get the feature. This comes from a post on South Korean social media site Naver from a leaker we hear from now and then, who shared select details on the two upcoming phones.",
    "Apparently the Galaxy Z Fold 4 won't just have one under-display camera, like the Z Fold 3, but two - presumably that means the front display will have one too, not that the main screen will have two selfie cameras, though that's not clear.",
    "The leaker also says the Z Fold 4's cameras will be similar to the Galaxy S22's - current rumors suggest that'll have a 50MP main camera joined by 12MP telephoto and 12MP ultra-wide companions. It sounds like the Z Fold 4 won't get whatever top camera specs go to the Galaxy S22 Ultra.",
    "The Galaxy Z Flip 4 is being tested both with, and without, an under-display camera, according to the Naver post - it says prototypes with both forms of front-facing camera exist. The leaker adds that the screen dimensions, at least for the outer screen, remain unchanged from the Z Flip 3.",
    "Finally, the post says that both phones will have improved waterproofing and dustproofing, as well as redesigned hinges that are lighter than their predecessors.",
    "Some people might read the above news, roll their eyes, and think 'why are they doubling down on arguably the worst part of the Z Fold 4?' and that was our initial reaction too. But it might not be bad news.",
    "The Z Fold 3's front-facing camera felt like an early test of a concept that many companies, like Xiaomi and ZTE, have done a bit better. And Samsung itself can probably do better - tech always improves over time, with companies spending more time and money improving innovations, and under-display cameras will probably be the same.",
    "So if we see the Galaxy Z Fold 4 and maybe Z Flip 4 come with under-display snappers, the sensors will probably be higher-res, and paired with display tech that better covers the lenses when not in use.",
    "In other words, the Galaxy Z Fold 4 selfie cameras will almost certainly be much better than the Z Fold 3 ones. Will they be as good as standard punch-hole or notch rivals? Well, we wouldn't go that far just yet, but it likely won't be a disappointment unlike in the Z Fold 3.",
    "We're still likely about 9 months out from the Galaxy Z Fold 4 and Z Flip 4 launches, which will probably take place in August 2022, so Samsung has loads of time to refine its under-display tech."
  ],
  "headers": {
    "6": "Analysis: doubling down isn't a bad thing"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Fold 4": "https://www.techradar.com/news/samsung-galaxy-z-fold-4",
    "Naver": "https://m.blog.naver.com/yeux1122/222570805213",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review"
  }
}