{
  "source": "https://www.techradar.com/news/5-biggest-iphone-13-changes-we-expect-in-2021",
  "title": "5 biggest iPhone 13 changes we expect in 2021",
  "category": "phones",
  "updated": "2021-09-13T15:19:39Z",
  "author": "david-lumb",
  "summary": "Smaller notches and masked Face ID? iPhone 13 could have it",
  "article": [
    "We’re eagerly awaiting the iPhone 13 as the expected launch date nears – on September 17, if one rumor is to be believed – even if we aren’t completely sure what’s coming in the next Apple handset.",
    "Given the plethora of rumors, we have an idea of what to expect: an incremental upgrade that keeps the iPhone 12’s flat-edged design while introducing a few new perks. Even last year’s phone didn’t add too much beyond the visual makeover aside from 5G and MagSafe, so we’re curious how Apple will convince consumers to upgrade or switch over from Android.",
    "The steady iPhone 13 rumors have given us plenty to look forward to, however, and we’re intrigued by what we’ve heard. Here are the five biggest iPhone 13 changes we expect to come in 2021.",
    "Yes, the infamous notch will probably stick around, even after most Android phones have switched over to punch-holes (or even started hiding them under displays, including the Samsung Galaxy Z Fold 3 foldable). But multiple rumors have suggested the iPhone 13 will get a smaller notch, with some reports suggesting it will be 30% narrower than the cutout on the iPhone 12.",
    "At this point, we’re pretty used to the notch – and even more habituated to Apple’s lagging behind in phone industry trends. Given the cutout still holds several sensors necessary for Face ID and other authentication, moving to a single camera would be a big shift. Baby steps.",
    "There’s previously been a feature gap between the more affordable iPhone (and mini) and the Pro and Pro Max models, which is sort of understandable – gotta have a reason to upgrade, right? But rumors suggest some camera features in the iPhone 12 Pro and Pro Max will trickle down for the iPhone 13 models.",
    "No, the iPhone 13 won’t get the vaunted telephoto lenses of its pricier siblings, but rumors state that it (and presumably the iPhone 13 mini) could get the LiDAR depth-scanning tech to assist with AR.",
    "Other, more recent rumors have contradicted these predictions, suggesting Apple may have intended for the upgrade but ultimately not gone through with it. The rumor mill has also suggested the cheaper models and even iPhone 13 Pro will get sensor-shift optical image stabilization (OIS), previously found only in the iPhone 12 Pro Max, so we’re cautiously optimistic.",
    "That’s not all the camera upgrades we’re hearing about, but the others predict more incremental improvements or upgrades that won’t come to all the phones, like OIS added to the ultra-wide cameras in the pricier iPhone 13 Pro and Pro Max.",
    "This one’s a bit more technical, but rumors suggest the iPhone 13’s battery might take up less space in the phone. Analyst Ming-Chi Kuo predicts Apple will switch to soft board technology to keep capacity the same, while another rumor suggests the phone will use a flexible circuit board (rather than rigid-flex) to pack in more capacity.",
    "Longer battery life is always good, especially as the phone ages and later iOS versions drain the battery faster, but the real advantage may be getting more space within the phone, which could make room for upgrades like in-screen fingerprint sensors or coils for reverse wireless charging.",
    "The iPhone 13 may finally get another feature Android phones have had for years: an in-display fingerprint scanner. Multiple rumors have suggested and noted Apple analyst Ming-Chi Kuo has predicted that this upgrade is coming in the iPhone 13.",
    "The return of Touch ID doesn’t mean the end of Face ID, as rumors assert that the new biometric will supplement Apple’s current robust facial recognition authentication systems. Other rumors dispute whether the in-screen fingerprint scanner is coming to the iPhone 13, or any iPhone, so be cautiously optimistic.",
    "Okay, this one’s a bit more unlikely given we’ve only just heard about it, but a leaked photo purportedly shows a new front-facing camera layout that supposedly enables Face ID authentication even while subjects are wearing masks and/or foggy glasses.",
    "The photo, tweeted by leaker Jon Prosser with info on Front Page Tech, shows the cameras and sensors placed inside a case wrapped around an iPhone 12 unit. The leak suggests the iPhone can use those cameras instead of its own to test Face ID while users are wearing masks and/or glasses fogged up by breath, which happens often when both are worn, as any spectacles-wearer can now attest.",
    "But again, this rumor is fairly new for a phone that’s supposedly coming out in the next month or two. Perhaps this will make it into the iPhone 13, though we wouldn’t be surprised if it wasn’t making it into a production iPhone until next year. It shows Apple is thinking about a better solution to authentication in a time of mask-wearing than just enabling an Apple Watch workaround – which will be even more necessary if in-screen fingerprint sensors don't make the cut."
  ],
  "headers": {
    "3": "Smaller notch",
    "5": "LiDAR and image stabilization for all models",
    "9": "Batteries taking up less space",
    "11": "In-display fingerprint scanner",
    "13": "Face ID that works with masks and glasses"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "rumor": "https://www.techradar.com/news/iphone-13-range-could-get-a-much-needed-battery-boost-but-it-might-not-be-enough",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories",
    "hiding": "https://www.techradar.com/news/under-display-cameras-finally-return-as-zte-axon-30-launches-in-china",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "multiple": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "rumors": "https://www.techradar.com/news/another-iphone-13-leak-points-to-in-screen-touch-id-and-a-smaller-notch",
    "suggested": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "recent": "https://www.techradar.com/news/iphone-13-price-might-not-be-any-higher-than-the-iphone-12s",
    "incremental": "https://www.techradar.com/news/heres-the-iphone-13-camera-upgrade-rumored-for-2021",
    "improvements": "https://www.techradar.com/news/iphone-13-pro-max-could-be-better-at-portraits-and-night-shots",
    "added": "https://www.techradar.com/news/iphone-13-pro-cameras-may-take-even-sharper-ultra-wide-photos-than-iphone-12-pro",
    "switch": "https://www.techradar.com/news/iphone-13-battery-might-be-smaller-than-iphone-12-but-with-a-vital-charge-feature",
    "charging": "https://www.techradar.com/news/iphone-13-range-could-support-faster-charging-and-reverse-wireless-charging",
    "Multiple": "https://www.techradar.com/news/move-over-iphone-12-apples-iphone-13-may-feature-under-display-touch-id",
    "predicted": "https://www.techradar.com/news/iphone-13-may-not-get-in-screen-touch-id-after-all-but-the-iphone-14-might",
    "supplement": "https://www.techradar.com/news/iphone-13s-in-screen-touch-id-sensor-more-likely-thanks-to-new-report",
    "dispute": "https://www.techradar.com/news/apple-tested-under-display-touch-id-for-iphone-13-but-dont-expect-it-to-happen",
    "leaked": "https://www.techradar.com/news/iphone-13-leak-suggests-apples-developing-face-id-that-works-with-masks",
    "Front Page Tech": "https://t.co/i2CMAfBLTd?amp=1",
    "Apple Watch workaround": "https://www.techradar.com/how-to/how-to-unlock-your-iphone-while-wearing-a-mask-with-ios-145"
  }
}