{
  "source": "https://www.techradar.com/news/ee-is-offering-xbox-game-pass-ultimate-and-unlimited-gaming-for-just-pound10pm",
  "title": "EE is offering Xbox Game Pass Ultimate and unlimited gaming for just £10/pm",
  "category": "phones",
  "updated": "2021-05-11T09:35:13Z",
  "author": "alex-hughes",
  "summary": "A super affordable add-on with SIM only deals and phones",
  "article": [
    "A recent promotion shows EE dipping its toes into the ever-expanding world of mobile gaming, now partnering up with Xbox for a pretty interesting promotion on its SIM only deals and phone contracts.",
    "A recent add-on for both existing and new customers on the EE network allows you to get both Xbox Game Pass Ultimate, and unlimited gaming data for just £10 a month.",
    "All you have to do is text XBOX to 150 and you'll have a 30-day rolling contract. This means you can cancel the add-on at any time if you're not happy with it, or find a better Game Pass Ultimate deal out in the world.",
    "While the details are slightly hazy, it appears the unlimited gaming you get is the same as EE's Gamer data pass. The somewhat confusing factor here is that the Xbox Game Pass app isn't included there, like it is with this offer.",
    "That means it appears you'll get unlimited use of Twitch, Pokemon Go, Harry Potter: Wizards Unite, Star Wars: Galaxy of Heroes and Fifa Mobile. You can also add a controller for your phone as an additional £7 a month when buying a new phone or SIM plan from EE.",
    "EE does have an alternative way for you to get an Xbox Game Pass Ultimate subscription. If you sign up to a number of Samsung phone deals, you'll get a year of the gaming subscription for free.",
    "However, with this offer you don't get the unlimited gaming part of the promotion and you'll have to order before June 1 to get this deal. We've listed the devices you can do this with below."
  ],
  "headers": {},
  "links": {
    "SIM only deals": "https://www.techradar.com/sim-only/sim-only-deals",
    "phone contracts": "https://www.techradar.com/deals/mobile-phone-deals",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "for just £10 a month": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7142928900868707000&xs=1&url=https%3A%2F%2Fee.co.uk%2Fgaming&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fee-is-offering-xbox-game-pass-ultimate-and-unlimited-gaming-for-just-pound10pm",
    "Game Pass Ultimate deal": "https://www.techradar.com/deals/cheapest-xbox-game-pass-deals-prices",
    "Samsung phone deals": "https://www.techradar.com/deals/samsung-mobile-phone-deals"
  }
}