{
  "source": "https://www.techradar.com/news/outriders-cheaters-will-be-permanently-branded",
  "title": "Outriders cheaters will be permanently branded",
  "category": "gaming",
  "updated": "2021-03-26T11:21:17Z",
  "author": "hamish-hector",
  "summary": "Once a cheater, always a cheater",
  "article": [
    "Outriders is getting medieval with its punishments for cheaters, as the game will permanently brand players who don’t follow the rules. In a recent developer update, the People Can Fly studio behind the game explains that cheating will earn you a \"discreet but visible\" watermark on your screen.",
    "Cheaters will also be forced to matchmake with only other caught cheaters – similar to what we've seen in Call of Duty: Warzone – so their ill-gotten gains don’t impact the player base at large. While the branding isn’t likely to change everyone’s attitude, it will give streamers and content creators an extra incentive to play fair – otherwise, their gameplay will out them as a cheater.",
    "People who cheated in the Outriders demo will be branded when the main game releases; however, it can be removed. People Can Fly explained that to clear the literal mark against your name cheaters \"must DELETE ALL CHARACTERS AND ITEMS ON YOUR ENTIRE ACCOUNT in order to wipe the slate clean.\" The caps lock text should tell you how serious they are.",
    "If you want to avoid being branded as a cheater in Outriders, you’ll need to make sure you don’t break the rules. At the time of writing the following actions are what People Can Fly define as cheating:",
    "It’s great to see People Can Fly taking such a hard stance against cheating from the get go. If its strategies work, we could see them implemented in some of our other favorite multiplayer titles.",
    "Via PCGamer"
  ],
  "headers": {
    "3": "What counts as cheating in Outriders?"
  },
  "links": {
    "similar to what we've seen": "https://www.techradar.com/news/call-of-duty-warzone-cheaters-will-be-forced-to-play-together-from-now-on",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "PCGamer": "https://www.pcgamer.com/outriders-brand-cheaters-watermark/"
  }
}