{
  "source": "https://www.techradar.com/news/these-smart-swimming-goggles-are-like-peloton-for-the-pool",
  "title": "These smart swimming goggles are like Peloton for the pool",
  "category": "fitness",
  "updated": "2021-08-30T12:01:47Z",
  "author": "axel-metz",
  "summary": "Just keep swimming",
  "article": [
    "Everyone knows it’s easier to stay motivated when working out alongside a friend or trainer. Running, for instance, is more challenging when a pacemaker leads the pack, while for the cyclists, an eternally-enthusiastic Peloton instructor might encourage you to put that little bit of extra effort into a spin class.",
    "In a swimming pool, though, it can be tricky to stay focused on clocking in the laps at the intensity you’re capable of – especially when stopping and checking the fitness tracker on your wrist is the only way to monitor progress.",
    "In 2019, Canadian tech company FORM developed the Smart Swim goggles, a pair of AR-enhanced goggles that provide swimmers with real-time performance information in the glass of the goggles themselves. We tested them way back when, and were impressed with their sleek design and genuinely useful, hands-free performance metrics which did away with the need to stop and check a watch mid-swim.",
    "Now FORM has updated its goggles to put a virtual personal trainer in the corner of your eye – and they really have become like Peloton for the pool.",
    "With the introduction of its subscription-based Workouts feature, FORM’s Smart Swim Goggles can now provide swimmers with challenging exercise sessions – from endurance sets to interval training – delivered using their intuitive heads-up-display (HUD).",
    "Through the FORM mobile app, subscribers can choose from hundreds of workouts to be uploaded straight to their goggles, and once a session is completed, progress is saved and synced automatically, allowing swimmers to track their progress and identify areas of improvement.",
    "We gave the new feature a spin (or swim?) ahead of its global launch on August 24, and were impressed with the goggles’ ability to push us further than they did when equipped only with tracking metrics.",
    "For starters, the selection of workouts on offer is overwhelming. Available sessions are split into short, medium and long distances, categories like speed and technique, and the desired level of intensity: low, moderate or high.",
    "There’s plenty of choice on offer here, and it helps that each workout is given a little more personality than simple number-based titles. For instance, there are welcoming sets like Swim Yoga or Growth Mindset, not-so-welcoming ones like Rise and Grind or Non-Stop, then downright scary workouts like The Boss or Freestyle Monster.",
    "Each workout has a thorough explanation of the sets, drills (with tutorials), stroke types and intensities, too, along with a list of any equipment needed for each session. We tried a mixture of endurance and speed workouts, and found the variety to be a welcome addition to our weekly swim routines.",
    "Workouts are also a great showcase for FORM’s neat in-goggle display. Rather than simply providing length, speed and calorie metrics, as before, the Smart Swim goggles are now able to tell you how far to swim, how hard to go, how long to rest, and when to put on and take off equipment (if the workout requires equipment). A handy progress bar also appears, too, which updates throughout the workout and proves an easy motivator when you’re tiring towards the end of a session.",
    "Our only qualms with the goggles remain the same as those we had when first trying them out back in 2019.",
    "The size of the display attachment, for instance – though not obtrusive or unusual-looking – leads to a limited field of vision when swimming. That’s OK when lane swimming alone or with others of similar ability, but it can be tricky to look up and around you to avoid collisions if you’re stuck in a lane with slower swimmers. We didn’t get a chance to try the goggles in open water, but we’d imagine the issue is less apparent with so much more space to roam.",
    "As for other niggling hiccups, sometimes the system can be tricked into registering a lap if you take off the goggles to empty excess water or re-adjust their fit, though this is true of any gyroscope-based fitness tracker. In fairness, the goggles are designed to be worn for the entirety of a workout, but it’s worth being careful about moving them around too much should you find yourself needing to give your eyes a break.",
    "It’s also worth noting that swim progress won’t be saved and synced until after you’ve completed your workout. This might seem obvious, but we tried checking whether the goggles were paired and recording data mid-swim, which they weren’t, but found that workouts are registered after completion, appearing in the app once you’ve saved and exited a particular session.",
    "All in all, then, FORM’s Workouts upgrade makes its Smart Swim goggles a different beast.",
    "The tracking metrics provided by the goggles in their basic, off-the-shelf mode already offered a useful and convenient way to measure pool performance without the need to stop and check a wrist-based tracker, but the addition of workouts adds a whole new level of usability.",
    "It’s amazing to see just how much further you can swim when a line of digital text is telling you to keep going (the use of exclamation points is particularly helpful in this regard), making FORM’s Workouts package a great option for those looking to push themselves even harder in the water.",
    "Monthly and annual subscriptions are available to purchase now, costing $19.99 / £17.99 (around AU$27) and $179.99 / £154.99 (around AU$250), respectively."
  ],
  "headers": {
    "7": "Spoilt for choice",
    "11": "Stay in your lane",
    "15": "A worthy upgrade"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "tested them": "https://www.techradar.com/news/want-a-way-to-track-swimming-these-ar-goggles-provide-your-stats-in-real-time"
  }
}