{
  "source": "https://www.techradar.com/news/embracing-cloud-could-net-your-company-billions",
  "title": "Embracing cloud could net your company billions",
  "category": "computing",
  "updated": "2021-05-26T15:47:40Z",
  "author": "abigail-opiah",
  "summary": "At least 60% of systems need to be in the cloud, research suggests",
  "article": [
    "A study from digital consulting company Infosys has found that enterprises could add up to $414 billion per year in net profits through effective cloud adoption.",
    "The firm’s research arm surveyed over 2,500 companies across six regions: the US, the UK, France, Germany, Australia, and New Zealand.",
    "With the findings, the company launched the Infosys Cloud Radar 2021 report, which highlights the links between enterprise cloud usage and business growth.",
    "A strong profit link was identified when using cloud to bring new solutions and services to market, with Infosys stating that these investments provide a foundation to leverage artificial intelligence (AI) and automation and build new cloud-based sources of revenue.",
    "The study also found specific links between business profit growth and the use of cloud to develop and launch new solutions and bring new functionality to market with great speed.",
    "Cloud’s ability to generate new value from data and discover new revenue sources also contributes to business growth, according to the consulting firm.",
    "Speaking on the findings, Ravi Kumar S., President at Infosys, said, “Effectively leveraging cloud is a transformational pillar in digital journeys. Where early cloud was a tool for allowing companies to rapidly scale, modern cloud allows companies to rapidly innovate.\"",
    "\"Today’s cloud creates a network effect across processes, data, content, experience and more. This network effect keeps enterprises relevant in a rapidly changing new digital age. The findings from the Infosys Cloud Radar 2021 comprehensively show that growth and profitability can be correlated to superior enterprise cloud adoption and orchestration.”",
    "The data also suggests that cloud-fueled profit boosts attained by companies only kicked in when businesses had at least 60% of their systems in the cloud.",
    "To benefit from AI on cloud, the bar is even higher as businesses have been advised to have at least 80% of their business functions in the cloud for AI to boost profit growth."
  ],
  "headers": {
    "3": "Business growth through cloud"
  },
  "links": {
    "cloud adoption": "https://www.techradar.com/news/cloud-adoption-has-soared-during-to-the-pandemic-but-theres-a-catch",
    "With the findings": "https://www.infosys.com/newsroom/press-releases/2021/cloud-business-growth-research.html"
  }
}