{
  "source": "https://www.techradar.com/news/citrix-is-launching-a-windows-365-rival-on-google-cloud",
  "title": "Citrix is launching a Windows 365 rival on Google Cloud",
  "category": "computing",
  "updated": "2021-10-13T19:30:37Z",
  "author": "anthony-spadafora",
  "summary": "New DaaS aims to simplify remote and hybrid work",
  "article": [
    "Citrix and Google Cloud have announced that they have expanded their strategic partnership to provide enterprise organizations with the tools needed to support hybrid work.",
    "As part of their collaboration, Citrix will launch a new Desktop-as-Service (DaaS) offering on Google Cloud which will leverage its management plan and HDX protocol to enable the seamless delivery of virtualized applications and desktops on the search giant's cloud computing service.",
    "This expanded partnership will provide distributed workforces and hybrid workers with a secure way to access the tools and information they need to be productive from anywhere.",
    "EVP of business strategy at Citrix, Tim Minahan explained in a press release how this new offering will enable organizations to implement hybrid work models successfully, saying:",
    "“Enterprises are no longer struggling with whether they should embrace remote work, but how quickly and efficiently they can do it. Through this partnership with Google Cloud, we will help customers accelerate and embrace hybrid work models with new virtual desktop services on Google Cloud’s global and secure network.”",
    "With Citrix's new DaaS solution on Google Cloud, organizations will be able to scale and secure their remote workforce without the IT responsibility.",
    "With just a few clicks, they'll be able to provision and deploy virtual apps and desktops to employees on Google Cloud without having to separately obtain their own Google Cloud subscription or additional IT resources. At the same time, the two companies also plan to co-develop a new, integrated control plane that will make it easier to monitor and provision these desktops to users.",
    "The expanded partnership will leverage Google Cloud's cloud-native services and backbone network using advanced software-defined networking and edge caching services to deliver a fast and consistent experience when using Citrix's new DaaS.",
    "By using the Citrix Workspace app and Citrix Secure Internet Access with Chrome OS, organizations can ensure their hybrid and remote workers are protected against internet threats both inside and outside of Citrix Workspace."
  ],
  "headers": {
    "5": "Simplifying DaaS"
  },
  "links": {
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "DaaS": "https://www.techradar.com/news/what-is-daas-everything-you-need-to-know-about-desktop-as-a-service",
    "HDX protocol": "https://www.techradar.com/news/this-company-wants-to-kill-vpns-forever",
    "cloud computing": "https://www.techradar.com/news/what-is-cloud-computing",
    "press release": "https://www.citrix.com/news/announcements/oct-2021/citrix-google-cloud-team-deliver-future-hybrid-work.html",
    "Google Cloud": "https://www.techradar.com/news/google-cloud-wants-to-boost-your-cloud-computing-skills",
    "Chrome OS": "https://www.techradar.com/news/chrome-os-update-adds-a-host-of-small-but-important-features"
  }
}