{
  "source": "https://www.techradar.com/news/e3-2021s-lack-of-aaa-reveals-let-indie-games-take-the-spotlight",
  "title": "E3 2021’s lack of AAA reveals let indie games take the spotlight",
  "category": "gaming",
  "updated": "2021-06-16T15:05:29Z",
  "author": "vic-hood",
  "summary": "Opinion: indie games finally got the spotlight at E3 2021",
  "article": [
    "Let’s not beat around the bush: E3 2021 was a bit of a disappointment. At least, compared to previous years. While we’re typically used to the annual gaming convention being stuffed to the brim with big announcements and reveals, this year’s E3 arguably wasn’t quite that.",
    "Sure, we got a few big reveals, like a 2022 release window for Breath of the Wild 2, the announcement of Forza Horizon 5 and a release date for Starfield, but the number of truly mind-blowing unveilings didn’t quite stack up to what we hoped. Though, let’s be honest, given the state of the world this past year, we were probably being a bit naive.",
    "This year’s E3 undoubtedly felt and looked different to previous years, but that’s not necessarily a bad thing. With less AAA reveals to contend with, weird and wonderful indie games that would typically be overshadowed by these announcements were able to take center stage at E3 2021 - and it was a very welcome change.",
    "Frankly, to complain about E3 2021 being a bit rubbish is a kick in the face to the developers who have worked tirelessly throughout a pandemic to be able to present something, anything, at this year’s event. Developers have battled against remote working, impatient fans and company targets to still bring us the games we love - even if they end up arriving a bit later than we hoped.",
    "So, while it’s disappointing that we didn’t get a look at big hitters like Hellblade 2, The Elder Scrolls 6, Dragon Age 4 and BioShock 4, it’s also understandable. And the few big announcements we did get packed more of a punch, as they weren’t contending with similar announcements from other publishers.",
    "What’s more, just because some of these games didn’t make an appearance at E3 2021, doesn’t mean we won’t see them in the near future. In recent years, we’ve seen publishers and developers opting to host their own conferences outside of the E3 sphere - with some falling under the Summer Game Fest umbrella.",
    "We already know that EA is planning an EA Play event for July 22, where we’ll get an update on Battlefield 2042’s third multiplayer experience and will likely see the announcement of FIFA 22 and Madden 22, as well as an update on Dragon Age 4.",
    "Likewise, we’re expecting Sony to host its own independent showcase in the coming months, to give us an update on Horizon Forbidden West, God of War: Ragnarok and Deathloop, as well as potentially announcing the PSVR 2 release date and a bunch of new PS5 games.",
    "So, E3 2021 isn’t the be-all-and-end-all of game announcements for the year.",
    "But there was one major benefit to E3 2021’s most-anticipated big hitters taking a bit of a back seat this year: it gave indie games the chance to steal the spotlight.",
    "Typically at E3, there’s a major focus on AAA offerings and this can often overshadow the indie games which are showcased. Instead, at E3 2021, with fewer big reveals stealing our attention, we were able to pay more mind to the indie games on show.",
    "Microsoft arguably did the best job of this, which isn’t particularly surprising how integral the company’s ID@Xbox program is to Xbox Game Pass, with the service stuffed to the gills with independent titles. The Xbox and Bethesda games showcase highlighted a plethora of wonderful-looking indies, such as the wiggly adventure Slime Rancher 2, sci-fi platformer Replaced and Inside-esque Somerville.",
    "In other years, these titles were susceptible to falling between the cracks, overshadowed by Microsoft’s AAA reveals but revered by indie fanatics. But with Microsoft putting such an emphasis on these titles, and even offering 40 free Xbox indie game demos as part of Summer Game Fest, it’s allowed these indie gems to shine more than they may have in previous years. What likely makes these titles even more enticing is that we know that most will be available on Xbox Game Pass from day one, so even if a game tickles your fancy just a little bit, you know that you can try it out for free as part of your Game Pass subscription - with nothing to lose.",
    "But it’s not just Microsoft that put on a brilliant indie showing, as we also saw a plethora of exciting surprises showcased at both the PC Gaming Show and Future Game Show - which we’ve come to expect from our friends at PCGamer and GamesRadar respectively. PC Gaming Show gave us a closer look at post-apocalyptic RPG Death Trash, time-bending FPS Lemnis Gate and the visually striking Silt. Future Game Show showcased world-building sandbox Grow: Song of the Evertree and stop-motion adventure Harold Halibut. These are all unique and beautiful titles in their own right, offering something different to the mainstream.",
    "Personally, Lake - which made a few appearances at E3 2021 - stood out to me the most. Set in 1986, the charming adventure sees you playing as Meredith, a software developer who travels back to her hometown after 22 years to cover her father’s mailman shifts while he’s away. I’ve had the opportunity to try out Lake thanks to the Xbox game demo event and it’s about as laid back as you would imagine. You wake up, you deliver mail to the quirky local residents - who are dotted around a stunning Oregan lake - and get to reconnect with some old friends that you’ve lost touch with. You might even be inclined to flirt with some? There’s no dark twist here, it’s simply just a wholesome indie game.",
    "If this had been any other year, we could have missed these stunning titles among the noise of the AAA reveal machine. Which would have been a huge mistake. After all, indie developers quietly showcase some of the event’s best games - not just this year but every year.",
    "I’m hoping that publishers keep this same energy next year, giving indie games and developers the attention they so rightly deserve."
  ],
  "headers": {
    "3": "Not the be-all-and-end-all",
    "9": "Shining indie gems"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Hellblade 2": "https://www.techradar.com/news/senuas-saga-hellblade-2-release-date-trailers-news-and-rumors",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Dragon Age 4": "https://www.techradar.com/news/dragon-age-4-release-date-news-and-rumors",
    "BioShock 4": "https://www.techradar.com/news/bioshock-4-everything-we-know-about-the-new-bioshock",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "Madden 22": "https://www.techradar.com/reviews/madden-nfl-22-review",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox and Bethesda games showcase": "https://www.techradar.com/news/xbox-and-bethesda-at-e3-2021-five-huge-announcements-you-need-to-see"
  }
}