{
  "source": "https://www.techradar.com/news/alice-camera-could-turn-your-phone-into-one-of-the-best-mirrorless-cameras",
  "title": "Alice Camera could turn your phone into one of the best mirrorless cameras",
  "category": "cameras",
  "updated": "2021-02-10T16:19:03Z",
  "author": "mark-wilson",
  "summary": "But is it really the best of both photographic worlds?",
  "article": [
    "In an ideal world, smartphones would have the sensors and interchangeable lenses of the best mirrorless cameras, while cameras would pack the connectivity and computational smarts of the best camera phones. Sound like a nice combo for one device? Well, that's the promise of a new accessory called the Alice Camera.",
    "Alice Camera, which is made by the British startup Photogram AI, isn't actually a brand new concept – it was first teased back in September 2020. But today is the first time you've been able to pre-order this \"AI camera for content creators\" on Indiegogo. And at the time of writing, it's already reached 218% of its funding goal.",
    "So what do you get for the 'super early bird' price of £550 (around $760 / AU$980)? The Alice Camera, which mounts to the back of \"most smartphones\" and can also work on its own unattached, is basically a Micro Four Thirds mirrorless camera that can use your phone as its screen and viewfinder.",
    "The benefit of using that mount along with an 11MP Four Thirds sensor (apparently the same as the one in the Panasonic Lumix GH5S) is that you get instant compatibility with the dozens of lenses that have already been made for dedicated cameras like that Lumix and the Olympus OM-D E-M10 Mark IV. That gives you quite a lot more choice than the two or three cameras you'll find on most phones.",
    "But aside from the benefits of this dedicated hardware, Photogram AI also says the Alice Camera will deliver computational photography effects using the combination of Google's Tensor Processing Unit (TPU), which has been designed to accelerate machine learning, and the company's own deep learning pipeline.",
    "This will apparently power computational photography tricks that we're now used to seeing from smartphones, like multi-shot composites, lifting shadows and electronic video stabilization. In theory, then, you'll get some of the intelligence of a Google Pixel 5 combined with the hardware of a Panasonic Lumix GH5S. Or at least that's the idea – we'll have to wait for a full production version to see if the reality matches up.",
    "The Alice Camera itself is made from a machined aluminum body and has a shutter button, control wheel, cold-shoe adaptor and 5GHz Wi-Fi, which it uses to connect wirelessly to your phone (via an Android and iOS app). There's also a 3.5mm microphone input for adding external mics and the ability to shoot 4K/30p or 1080/60p video.",
    "On paper, the Alice Camera is a very interesting new concept indeed. Its maker Photogram AI says it's aimed at \"content creators\", including photographers, YouTubers, Instagrammers, TikTokkers and Twitch streamers. And the camera aims to fill the gap that undoubtedly exists between smartphones and traditional cameras, which have reluctantly embraced touchscreens and still lack user-friendly connectivity.",
    "But aside from the usual caution that should be exercised with crowd-funded projects (the Alice Camera is still only at its prototype stage), there are photographic warnings from the past that loom large in the background. From the Sony QX1 to the DxO One, we've already seen several attempts at bolting powerful camera hardware onto phones – and most have produced a user experience that's less than some of its parts.",
    "The Alice Camera also faces the danger of falling into that potentially narrow gap between smartphone users and camera fans, without managing to satisfy either camp in terms of convenience or the level of manual control.",
    "But it's also fair to say that the photography and videography landscape has changed a lot since the days of those earlier phone-camera experiments – or even more recent ones like the Yongnuo YN450M, which was a camera that ran on Google Android. The explosion in the sheer variety of social media sites and the numbers of people uploading videos, in particular, means that there could yet be a niche for an accessory like the Alice Camera, even one from a completely unknown startup.",
    "The other benefit of the Alice Camera concept is that, unlike the Yongnuo, upgrading your phone would enable you to upgrade the brain of your Micro Four Thirds camera (assuming the app is still being supported by that point). And with the camera's software being open-source, there should hopefully be a large community building customized adds-on and custom software. In theory, at least.",
    "We'll certainly be looking at the Alice Camera project with interest and will bring you our hands-on impressions of a production version as soon as we can before its estimated first shipping date of October 2021."
  ],
  "headers": {
    "7": "Best of both worlds?"
  },
  "links": {
    "best mirrorless cameras": "https://www.techradar.com/news/best-mirrorless-camera",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone",
    "Indiegogo": "https://www.indiegogo.com/projects/alice-camera-an-ai-camera-for-content-creators--2#/",
    "Panasonic Lumix GH5S": "https://www.techradar.com/reviews/panasonic-lumix-gh5s",
    "Olympus OM-D E-M10 Mark IV": "https://www.techradar.com/reviews/olympus-om-d-e-m10-mark-iv",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Sony QX1": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/sony-qx1-1263347/review",
    "DxO One": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/compact-cameras/dxo-one-1297172/review",
    "Yongnuo YN450M": "https://www.techradar.com/news/a-full-featured-android-powered-mirrorless-camera-is-coming"
  }
}