{
  "source": "https://www.techradar.com/news/first-pcie-50-ssds-could-top-10gbps-thanks-to-this-chipset",
  "title": "First PCIe 5.0 SSDs could top 10Gbps thanks to this chipset",
  "category": "computing",
  "updated": "2021-05-27T14:32:08Z",
  "author": "mayank-sharma",
  "summary": "Marvell’s new PCIe 5.0 controllers currently only available to select customers",
  "article": [
    "Marvell Technology has launched the industry’s first PCIe 5.0 SSD controllers that are designed specifically to address the data processing needs of cloud computing service providers and data centers.",
    "The new Bravera SC5 SSD controllers also support NVMe 1.4b, which Marvell claims enables them to offer double the performance as compared to PCIe 4.0 SSDs.",
    "The new SSD controller family leverages Marvell’s system-on-chip (SoC) architecture to deliver up to 14 GB/s of throughput and two million random read input/output operations per second (IOPS).",
    "Marvell adds that the controllers offer security features such as FIPS-compliant root of trust (RoT), AES 256-bit encryption and multi-key revocation to meet the stringent regulations for cloud service providers’ in order to protect their users’ data.",
    "“Bravera SC5 SSD controllers are first to market with innovative data center features that extend Marvell’s flash storage technology leadership,” said Thad Omura, vice president of marketing, Flash Business Unit at Marvell.",
    "The new controllers are powered by Marvell’s 5th generation NANDEdge LDPC error correction technology, which works with 3D NAND QLC, TLC and SLC technologies.",
    "Marvell adds that it worked with hyperscale cloud providers such as Microsoft Azure to ensure the Bravera SSD controllers are fleet compatible and can work across the open hardware landscape.",
    "Furthermore, in order to offer the flexibility to seamlessly repurpose the same underlying hardware when migrating to next-generation workloads, the Bravera SSD controllers enable multiple usage models such as SEF, ZNS, Open Channel, and more without hardware changes.",
    "“Marvell’s Bravera SC5 SSD controller family supports technology that enables next generation hyperscale SSD use cases,” said Facebook’s Hardware System Engineer for Storage, Ross Stenfort.",
    "The Bravera SSD controllers are currently only available to select customers, and Marvell hasn’t shared dates about their general availability and pricing."
  ],
  "headers": {
    "5": "Designed for the cloud"
  },
  "links": {
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}