{
  "source": "https://www.techradar.com/news/far-cry-6-devs-making-sure-last-gen-consoles-arent-abandoned-in-any-way",
  "title": "Far Cry 6 devs making sure last-gen consoles aren't 'abandoned in any way'",
  "category": "gaming",
  "updated": "2021-05-29T17:21:14Z",
  "author": "emma-boyle",
  "summary": "No console left behind",
  "article": [
    "Far Cry 6 developer, Ubisoft, has assured fans that it's targeting “maximum quality” for the game on last-gen consoles as well as on the newer and more powerful PS5 and Xbox Series X.",
    "In a recent interview with VGC, lead gameplay designer, David Grivel, was clear that while the latest consoles offer exciting advancements like 4K and 60FPS, the Far Cry 6 development team has been “really, really cautious” about making sure the previous console generation isn’t “abandoned in any way.”",
    "According to Grivel, the team is aiming “to target maximum quality on all of these platforms”, offering the assurance that “we’ll care about all the platforms, both old gen, new gen and even PC, Stadia, Luna and all of that.”",
    "Though he was unable to give any particularly specific details, Grivel said that “both on the previous generation and the new Xbox Series and PS5 generation, the game is running fine”, adding that Ubisoft will “definitely start showing more on different platforms” in the coming weeks and months.",
    "Grivel’s promise comes after a recent Far Cry 6 stream hosted by Ubisoft, during which gameplay footage was shown for the first time and the game’s release date was confirmed to be October 7 2021, after a previous delay.",
    "It’s not surprising that Grivel would want to make this assurance—following Cyberpunk 2077’s less-than-stellar launch on last-gen consoles back in December 2020, developers are undoubtedly very keen on avoiding making any similar mistakes. Capcom, for instance, showed footage of Resident Evil Village running on PS4 Pro prior to the game's release. With the latest console generation still in its early days and consoles themselves still proving hard to find, there are undoubtedly still plenty of Far Cry fans who will be picking up the game on PS4 and Xbox One.",
    "Grivel didn’t reveal any specific dates when we can expect to see Far Cry 6 running on other platforms but the most likely time is next month, during E3 2021.",
    "Ubisoft has already confirmed that its conference, Ubisoft Forward, will be streaming on June 12 and we’re hoping we might get a glimpse of some other highly-anticipated Ubisoft titles during the show, such as Beyond Good and Evil 2 and Skull and Bones.",
    "Far Cry 6 is currently available for preorder on PS5, PS4, PC, Xbox Series X, Xbox Series S and Xbox One."
  ],
  "headers": {
    "6": "More to see"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "interview with VGC": "https://www.videogameschronicle.com/features/interviews/far-cry-6/",
    "Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Luna": "https://www.techradar.com/news/amazon-luna",
    "Far Cry 6 stream": "https://www.techradar.com/news/far-cry-6-release-date-set-for-october",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "less-than-stellar launch": "https://www.techradar.com/news/the-cyberpunk-2077-console-launch-mess-is-somehow-even-worse-now",
    "footage of Resident Evil Village running on PS4 Pro": "https://www.techradar.com/news/new-resident-evil-village-trailer-shows-the-game-running-on-ps4-pro",
    "consoles themselves still proving hard to find": "https://www.techradar.com/news/ps5-and-xbox-series-x-shortages-could-last-until-the-end-of-2021-says-new-report",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "confirmed": "https://www.techradar.com/news/ubisoft-confirms-e3-2021-conference-details",
    "Beyond Good and Evil 2": "https://www.techradar.com/news/beyond-good-and-evil-2",
    "Skull and Bones": "https://www.techradar.com/news/skull-and-bones-release-date-news-and-trailers",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review"
  }
}