{
  "source": "https://www.techradar.com/news/how-to-watch-reminiscence-online-stream-the-new-hbo-max-movie-today",
  "title": "How to watch Reminiscence online: stream the new HBO Max movie today",
  "category": "entertainment",
  "updated": "2021-08-20T05:01:47Z",
  "author": "daniel-pateman",
  "summary": "Jackman takes refuge in the past in this dystopian sci-fi thriller",
  "article": [
    "From the co-creator of HBO’s Westworld comes an edge-of-your-seat science fiction movie set in the very near future. Starring Hugh Jackman and Thandiwe Newton, it’s a visually stunning film driven by a gripping central mystery. Here we explain how to watch Reminiscence online with a HBO Max subscription, available to stream for 31 days from its theatrical debut.",
    "Written and directed by Lisa Joy, Reminiscence takes place in a Miami permanently submerged by flood-waters and where civil disorder is a regular occurrence.",
    "Nick Bannister (Hugh Jackman) is a rugged ex-veteran who, along with his business partner Watts (Newton), provides individuals with the opportunity to re-live any memory they desire. In a chaotic present, there’s solace to be found in the certainty of the past.",
    "The film introduces a noir-inspired mystery when Mae (played by Rebecca Ferguson) arrives to procure Nick’s services. They embark on a brief yet passionate love affair. But, when she suddenly vanishes, an infatuated Nick is determined to discover her whereabouts: especially after another client’s memories implicate her in a series of violent crimes.",
    "While recalling iconic sci-fi dystopias like Blade Runner (1982), Reminiscence is grounded in a more plausible reality: offering a spectacular vision of a world in which climate change is an omnipresent feature of daily life. It’s also action packed, full of incredible set pieces, and tethered to a provocative story.",
    "Read our guide below for how to watch Reminiscence online from anywhere. We’re betting it’ll be a movie worth remembering.",
    "Across much of the globe cinemas are open again, and so movies like Reminiscence are getting an international theatrical release. If you feel like venturing out, the film lands on Thursday, August 19 in Australia, while it's available the same day as the US in both the UK and Canada on August 20.",
    "Currently, there’s no confirmation whether Reminiscence will be procured by any of the major VOD platforms in these territories. However, many of the 2021 Warner Brothers films released on HBO Max – like The Conjuring: The Devil Made Me Do It – have been made available internationally to rent as PVOD (premium video on demand) titles, on services like Amazon Prime Video, Apple iTunes, and Google Play Store. While we don’t know for certain yet, it’ll be worth checking these websites to see if that holds true for Reminiscence.",
    "As well as instant access to new Warner Bros. blockbusters – James Wan’s horror thriller Malignant is next up on September 10 – you get over 10,000 hours of prime content: choice picks from the Warner Bros. archive and subsidiary companies like New Line Cinema, Studio Ghibli’s animated masterpieces, DC Entertainment blockbusters like Wonder Woman: 1984.",
    "Plus – the clue's in the name – you can watch every iconic HBO series ever made. Enjoy The Sopranos, Euphoria, Curb Your Enthusiasm and Westworld, plus all 10 seasons of iconic sitcom Friends, addictive HBO Max Originals like Gossip Girl, and so much more."
  ],
  "headers": {
    "6": "How to watch Reminiscence across the rest of the world",
    "8": "What else can I watch on HBO Max?"
  },
  "links": {
    "HBO Max subscription": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-4721781810713706000&url=https%3A%2F%2Fwww.hbomax.com%2Freminiscence%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-watch-reminiscence-online-stream-the-new-hbo-max-movie-today",
    "The Conjuring: The Devil Made Me Do It": "https://www.techradar.com/news/how-to-watch-the-conjuring-the-devil-made-me-do-it-online-stream-the-conjuring-3-where-you-are",
    "Wonder Woman: 1984": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-1243704589597070800&url=https%3A%2F%2Fwww.hbomax.com%2Ffeature%2Furn%3Ahbo%3Afeature%3AGX9KHPw1OIMPCJgEAAAAD%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-watch-reminiscence-online-stream-the-new-hbo-max-movie-today",
    "Gossip Girl": "https://www.techradar.com/news/how-to-watch-gossip-girl-2021-online-stream-the-new-hbo-max-original-now"
  }
}