{
  "source": "https://www.techradar.com/news/hybrid-working-closing-the-digital-divide",
  "title": "Hybrid working: closing the digital divide",
  "category": "computing",
  "updated": "2021-07-24T06:42:44Z",
  "author": "tim-minahan",
  "summary": "More than 90 percent of employees prefer flexible work",
  "article": [
    "The global pandemic has made clear that remote work can increase productivity, boost engagement and lower costs. And employees want to continue to do it – at least some of the time – going forward. Research shows that more than 90 percent of employees prefer flexible work over punching a clock in a traditional office.",
    "Employers see the economic and cultural benefits of remote working as well, with 82 percent of companies saying they plan to embrace hybrid models to keep employees engaged, recruit new talent, and hold down operating costs. But the transition to hybrid work not without risk.",
    "While appealing on the surface, hybrid work models have the potential to create a new digital divide that, if left unchecked, will quickly establish two classes of workers and infuse the workplace with inequity and bias. To successfully make the leap, companies will need to implement technologies and new work policies that create an equitable environment, empowering both remote and in-office employees to equally engage collaboration in a transparent and efficient way and make meaningful contributions that fuel innovation and business growth.",
    "The fully remote work model forced by the pandemic has in many ways levelled the playing field. In a remote work world, everyone appears in equal boxes on the screen and has the same access to information and opportunities to contribute to a project. As companies move toward hybrid models, they must maintain this consistent, inclusive and equal experience to ensure that no employee is at a disadvantage because of their work location and reap the improvements in effectiveness and productivity that more flexible work models can drive.",
    "To effectively narrow the digital divide that hybrid work threatens to open, companies must establish a shared digital workspace that provides a common and transparent environment in which teams have consistent access to applications and information and can efficiently collaborate on projects to get work done, wherever it needs to get done. Supported by policies that encourage collaborative and equitable working methods, such workspaces can foster efficient work execution from anywhere through:",
    "Using tools within the workspace, companies can build and maintain effective work-from-anywhere environments and establish norms to ensure employees succeed in them. They might, for instance, build an app that allows teams to create agreements as to how they will operate in distributed environments, considering things like:",
    "Or an app that allows employees to secure the space they need, when and where they need it, to be their most effective and productive by executing tasks such as:",
    "Organizations can also leverage collaborative work management capabilities to ensure that whether employees are in an office sitting next to a co-worker or working with teams across multiple geographies, they have the same access to information and project status and equal ability to contribute and execute work.",
    "Hybrid work is the way of the future, and companies that understand the risks inherent in the model and carefully plan their transitions can avoid the pitfalls and foster inclusive environments where their employees have equal opportunities to innovate and create from any location and help themselves and their companies succeed."
  ],
  "headers": {
    "3": "Keeping the field level",
    "4": "A shared digital workspace",
    "5": "Making hybrid work work"
  },
  "links": {
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "employees": "https://www.techradar.com/best/best-hr-software",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "employee": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "applications": "https://www.techradar.com/best/best-apps-for-small-business"
  }
}