{
  "source": "https://www.techradar.com/news/microsoft-excel-has-finally-solved-one-of-its-most-annoying-issues",
  "title": "Microsoft Excel has finally solved one of its most annoying issues",
  "category": "computing",
  "updated": "2021-10-08T11:10:23Z",
  "author": "mike-moore",
  "summary": "Smoother scrolling in Excel at last",
  "article": [
    "One of the most frustrating parts of using Microsoft Excel could finally be over thanks to a new update to the software.",
    "Microsoft has revealed it will be bringing support for smoother scrolling to its Excel Desktop app, hopefully resulting in a much better user experience.",
    "The spreadsheet software update should mean an end to accidentally snapping to random unwanted cells, or losing track of all your vital data in the middle of an important work task.",
    "At the moment, Excel struggles with smooth scrolling, as the software looks to automatically highlight the cell in the top-left of your spreadsheet - an issue Microsoft admits is frustrating, and not particularly easy to fix.",
    "\"Though you might think this is an easy fix, simply requiring the alteration of a few lines of code, there’s actually a lot more to it,\" noted Microsoft engineer Steve Kraynak in a blog post outlining the change.",
    "\"In fact, we learned that this change affects many different aspects of Excel, including freezing panes, resizing rows, cutting and pasting, filtering, cell styles, comments, dragging and filling, and more.\"",
    "The new smoother scrolling update has two parts - firstly, making scrolling smoother when using either the mouse wheel or the scrollbars (with Microsoft noting that touch screen and touch pad already scrolled smoothly).",
    "Secondly (and more excitingly) you can now stop scrolling partway through a row or column, with Excel no longer making you go any further than you want.",
    "Microsoft notes that users can try out a number of new features thanks to the update, including dragging the scroll bar to see how they can scroll with precision and stop anywhere they like.",
    "The feature is available now to Insiders on Windows with Beta Channel or Current Channel Preview with Version 2109 (Build 14430.20000) or later, and be available to all Microsoft 365 Subscribers within the next few months."
  ],
  "headers": {
    "3": "Smooth scrolling"
  },
  "links": {
    "Microsoft Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1194071358683159300&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fexcel-blog%2Fsmooth-scrolling-comes-to-excel-for-windows%2Fba-p%2F2823555&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-excel-has-finally-solved-one-of-its-most-annoying-issues"
  }
}