{
  "source": "https://www.techradar.com/news/how-to-watch-south-park-vaccination-special-online-stream-new-episode-anywhere",
  "title": "How to watch South Park Vaccination Special online: stream new episode anywhere now",
  "category": "computing",
  "updated": "2021-03-11T08:26:53Z",
  "author": "aatif-sulleyman",
  "summary": "Hit yourself with a fresh dose of cartoon comedy today",
  "article": [
    "Everyone's favorite foul-mouthed cartoon kids are back with a new episode, the South Park Vaccination Special gifting us a fresh dose of 2021 comedy even though it's all still so close to home it hurts. Officially dubbed the South ParQ Vaccination Special, it follows on from the show's first pandemic-related instalment last year. Read on for how to watch the South Park Vaccination Special online and stream the new episode from anywhere now.",
    "An obvious nod to a well-known group of conspiracy theorists, the show's creators satirize the lunatic real-life outfit as Lil' Qties, with the new South Park special seeing the militant faction of anti-vaxxers try and establish themselves in the community. Their ultimate aim? To prevent the gang's unhinged teacher, Mr Mackey, from procuring the Covid vaccines he so desperately craves.",
    "Under instruction from the crazed South Park Elementary School counselor, the potty-mouthed pupils try frantically to get their hands on as many 'rona vacination doses as possible - setting up a war with the Lil' Qties that sees the morals of lil' Eric Cartman tested to the max...Because if you'd been probed by aliens in a decidedly non-intelligent way, you'd probably compromise a few values for a $2,000 bounty as well?",
    "Elsewhere in the quaint Colorado town of South Park, Stephen Stotch continues his well-meaning but irritating attempts to enforce social distancing and proper mask-wearing from behind his living room window. It's falling on deaf ears when it comes to his son, Butters, who's determination to believe in anything that's a convenient reason to get out of the house means he's fallen in with a bad crowd.",
    "The new South Park special is the hotly anticipated follow-up to September's pandemic episode, which delivered the Comedy Central-hosted show's top TV ratings since way back in the early-Noughties.",
    "With expectations among fans of the no-holds-barred cartoon classic higher than a Tegridy Farms bake sale, follow our guide below for how to watch South Park Vaccination Special online wherever you are and stream the new 2021 episode wherever you are today.",
    "For those abroad when the new South Park Vaccination Special airs, you’ll be unable to watch the show like you normally would due to annoying regional restrictions. Luckily, there’s an easy solution.",
    "Downloading a VPN will allow you to stream the the new series online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch South Park Vaccination Special from anywhere"
  ],
  "headers": {
    "6": "How to watch South Park Vaccination Special online from outside your country",
    "9": "How to watch South Park special in UK: stream new Vaccination Special episode online"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}