{
  "source": "https://www.techradar.com/news/queer-indie-games-deserve-more-recognition",
  "title": "Queer indie games deserve more recognition",
  "category": "gaming",
  "updated": "2021-01-21T23:11:31Z",
  "author": "chloe-spencer",
  "summary": "Opinion: mainstream games receive a lot of credit, but is it deserved?",
  "article": [
    "In 2019, I released my first game. Initially, I didn’t anticipate the game getting much attention, and I was profoundly surprised when it won an award at a games festival.",
    "When I came across the submissions process for the GLAAD Awards – an awards ceremony founded by an organization dedicated to celebrating positive representation of LGBTQ+ people in media – I thought maybe my game had a shot, so I applied for a fee waiver and submitted my application.",
    "When the nominees for Most Outstanding Video Game were announced in January 2020, I wasn’t surprised that my game didn’t make the list. I was surprised that other games didn’t. Where was Arcade Spirits, the hugely popular visual novel in which your character ran their own arcade? Where was Newfound Courage, the award-winning fantasy RPG? Where was the gorgeously dark Knife Sisters?",
    "GLAAD’s tweet announcing the Outstanding Video Game nominees was met with outrage from the queer gaming community, with many criticizing the absence of indie devs on this list. While these nominations featured some LGBTQ+ representation – even wonderfully written representation – the games certainly weren’t outstanding LGBT representation by any means. At least, not in comparison to the other indie games that had been released that same year, of which there were a plethora to choose from. In 2019 alone, over 500 LGBT-tagged games were released on itch.io,a massive online marketplace for indie video game developers.",
    "This wasn’t the first time that it felt like GLAAD had dropped the ball when it comes to indie LGBTQ+ games. In the previous year, Elder Scrolls Online won the Outstanding Video Game award on the basis of having a single quest that featured a trans woman – the same year that the episodic visual novel LongStory and critically acclaimed mecha narrative Extreme Meatpunks Forever released. This was baffling: how could GLAAD, an organization that champions queer representation, miss the mark for the second year in a row?",
    "In the months following the nominations, I thought about the hype surrounding Ellie from The Last of Us II, and how she is one of the first lesbian characters to headline a AAA game. But Ellie isn’t the only example of a lesbian protagonist in an action-adventure game, and when taking indie games into account, she’s not even remotely close to being the first. While Ellie is certainly a noteworthy character, the way in which TLOU II addressed queer representation received mixed responses from several critics and fans. Some of the fans expressed excitement over a lesbian being at the forefront of her story; others criticized the game for how much its narrative relies on torturing queer characters.",
    "Similar controversy surrounded the 2020 release of Dontnod’s Tell Me Why, which was touted as the first game by a major studio to feature a transgender lead character. While Tyler’s inclusion in the gaming world is important, it’s interesting to note how he was lauded by some media outlets as the first major transgender protagonist in video games, or even as the ‘gold standard’ of trans representation in some headlines. One article in The Guardian straight up said that Tell Me Why was the first game with a trans main character. But Tyler is nowhere close to being the first main or ‘major’ transgender character in any video game, having been preceded by several others. Madeleine from Celeste, Haru from the Springs series, and several characters from 2064: Read Only Memories are just a few of the countless indie-studio examples.",
    "While major studios are commended for taking strides to address the issue of inclusivity in LGBTQ+ storytelling, it feels like queer indie devs are largely ignored. Instead, mainstream games are favored for their often bare-minimum attempts at queer inclusivity and arguably receive much more praise than they deserve, given the resources they have, and the fact that they ignored or even villainized queerness in general for so long",
    "What exactly defines ‘good’ LGBTQ+ representation? That’s a question that many writers and gamers find difficult to answer. The short answer is not having characters play into stereotypes or pander to an audience, but rather to create queer characters that are multidimensional. Building on that, it’s also important to reflect a diverse array of queer experiences, and for having queer characters whose story arcs aren’t relegated to homophobia-related trauma, coming out, or finding love.",
    "Good queer representation doesn’t just come from having one or two queer characters or romance options. It comes from having queer people write their own stories, and incorporating queerness in a multidimensional way. The biggest reason why indies tend to have better, more well-written representation is that not only are they unabashed about including queer characters in their stories, they’re also exploring various other themes outside of coming out and finding romance.",
    "Because so many queer indie games are made by queer people themselves, they’re able to take common experiences and analyze how queerness impacts that experience. When you play a game such as One Night, Hot Springs, you’re exploring the anxieties of forming new friendships and getting outside of your comfort zone, only from the perspective of a Japanese trans woman. With subsequent installments in the Springs series, you continue to learn about Haru’s character. Her arc focuses not on her coming to terms with her transness, but rather, how she grows to be a more confident person overall. The wildly popular visual novel Yearning: A Gay Story, known among fans as YAGS, tackles queer topics such as coming out and romance alongside the challenges that come with navigating university and learning how to be a supportive friend, all set against the backdrop of the ever-changing early 2000s. These stories possess an intimacy that mainstream games struggle to incorporate into their own narratives.",
    "When major studio games commit to including queer characters in a narrative and exploring their journeys, a lot of the time those stories are plagued by themes of queer pain; this was a major criticism of TLOU II. Queer pain itself is not the problem; but again, the question is who is telling the story, and for what purpose? Indie games that explore homophobia and queer pain – YAGS and the widely praised Gone Home (2013) included – do it in ways that don’t feel cartoonish or heavy-handed, exploring the realities of queer people with far more nuance.",
    "While mainstream games can absolutely have well-written LGBTQ+ characters, the issue is that they sometimes lack nuance, or, worse, come across as tokenistic and inauthentic. Many games – such as the ones who have received GLAAD awards and nominations in years past – are commended for having queer representation which is solely limited to romantic choices. This is what’s known as playersexuality. Playersexual characters are characters who only have in-game sexuality as it relates to the player. Often, it means that the protagonist has the option to romance a cisgender man or woman, and that’s it; outside of romantic choices, there are no references to a character’s sexuality. We see playersexuality in games such as Stardew Valley, Dragon Age 2, and Skyrim.",
    "Playersexuality is often falsely equated with bisexuality or pansexuality, and is frequently used as a weak attempt at integrating diversity into a game’s narrative. The issue with playersexuality is that it can communicate to an audience that queerness is a choice, and in some of these narratives it fails to explore how queerness informs a person’s experiences. Defining your in-game sexuality is approached as simplistically as choosing the color of one’s hair, and rarely impacts the player character’s narrative on a deeper level.",
    "This isn’t to say choices aren’t important, as they can create some interesting opportunities for storytelling or character exploration if you choose to pursue them. But romantic choices shouldn’t be the only way in which queer representation is included in a game. There are games that feature playersexuality, but which still have unavoidable queer representation. The fantasy visual novel When the Night Comes by Lunaris Games is a fabulous example of this. Regardless of who you are as the protagonist, the surrounding characters are queer – for example, August is a nonbinary character serving as one of the town’s leading authority figures, and potential romantic interest. Additionally, the romantic histories of other characters, such as the vampire leader Finn and kind witch Ezra, are explored in the player’s conversations with them.",
    "Why is this so important? Because in many of the mainstream examples, the queer identities of the romantic interests are entirely dependent on the gender and sexuality of the protagonist. But in When the Night Comes, no matter how your character identifies, there are still fully fleshed-out queer characters in the story. Even in choice-centric narratives, indies do better in presenting sexuality as a reality of one’s identity and experience, rather than just a surface-level customizable choice for your character. If a game’s queer representation could be avoided by making different choices or avoiding certain areas, is that truly ‘outstanding’ representation?",
    "Mainstream gaming needs to do more when it comes to LGBTQ+ representation, but that doesn’t necessarily mean that adding more queer characters into the story will fix the issue. Nor is the solution to flood the market with coming out or coming-of-age stories. It’s about not tokenizing queer characters and stories, but including them holistically within the story. In terms of hiring it means not just having queer writers as consultants, but actively employing and supporting them in an environment that has historically been toxic for them. It means critiquing the ways in which queer stories are being told, who is telling them, and for what reasons.",
    "It also means that the industry, including companies, publications, and awards ceremonies, must dramatically broaden their horizons, and look at games being made by queer independent developers to inform their own approach to improving queer representation. It means to not cherrypick a few successful queer devs, but to examine the multitude of diverse voices within the queer gaming community and uplift them. It also means the industry must approach queer indie games with a far more open and welcoming mindset, and in turn, being far more self-critical when it comes to AAA or mainstream games. Oftentimes, indies face more backlash for how they write LGBTQ+ characters – the developer behind Celeste notably faced criticism for how Madeleine’s character was written. Whether or not this criticism is justified, it’s something that mainstream devs are largely spared, or face to a far lesser extent.",
    "As gamers, we can support the work of queer developers through simple means. We can write reviews, talk about the issues on social media platforms, or contribute to a dev’s Patreon or Ko-fi. We can also support organizations that help or promote the work of queer developers, such as Queerly Represent Me, Qweerty Gamers, and GaymerX.",
    "The queer indie dev community is immensely talented, and is producing some of the most compelling stories of our time. By promoting their work and allowing them to shine, we can not only encourage them to continue creating, but also ensure the positive inclusion of well-written LGBT+ characters in games for decades to come."
  ],
  "headers": {
    "8": "What makes good LGBTQ+ representation?",
    "16": "Setting the bar higher"
  },
  "links": {
    "GLAAD’s tweet announcing the Outstanding Video Game nominees was met with outrage from the queer gaming community": "https://twitter.com/glaad/status/1214950598015107082",
    "In 2019 alone, over 500 LGBT-tagged games were released on itch.io,": "https://itch.io/games/tag-lgbt/year-2019",
    "Elder Scrolls Online won the Outstanding Video Game award": "https://www.glaad.org/blog/glaad-celebrates-first-nominees-outstanding-video-game-glaad-media-awards",
    "The Last of Us II": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "received mixed responses from several critics and fans": "https://www.independent.co.uk/arts-entertainment/games/feature/last-us-2-tlou2-lgbt-queer-ellie-lev-representation-a9571186.html",
    "how much its narrative relies on torturing queer characters.": "https://stevivor.com/reviews/the-last-of-us-part-2-review-bury-your-gays-emotionally/",
    "touted as the first game by a major studio to feature a transgender lead character.": "https://mashable.com/article/tell-me-why-game-transgender/",
    "first major transgender protagonist in video games": "https://gaymingmag.com/2020/08/creating-tyler-ronan-how-dontnod-created-the-first-major-transgender-protagonist-in-video-games/",
    "‘gold standard’ of trans representation": "https://www.gamesradar.com/tyler-ronan-in-tell-me-is-the-new-gold-standard-for-trans-characters-in-video-games/",
    "One article in The Guardian straight up said that Tell Me Why was the first game with a trans main character.": "https://www.theguardian.com/games/2020/jun/27/the-last-of-us-part-ii-the-blockbuster-game-breaking-lgbtq-barriers",
    "this was a major criticism of TLOU II.": "https://www.independent.co.uk/arts-entertainment/games/feature/last-us-2-tlou2-lgbt-queer-ellie-lev-representation-a9571186.html",
    "come across as tokenistic and inauthentic.": "https://www.gamesradar.com/lgbt-representation-in-an-ultraviolent-dystopia-the-last-of-us-and-budding-identity/",
    "This is what’s known as playersexuality.": "https://www.thegamer.com/playersexual-romance-bad/",
    "Stardew Valley": "https://www.techradar.com/news/games-of-the-generation-stardew-valley-is-a-welcome-break-from-the-chaos-of-the-world",
    "Playersexuality is often falsely equated with bisexuality or pansexuality,": "http://playwrite.com.au/playing-it-safe-bisexual-representation-in-games/",
    "criticism for how Madeleine’s character was written.": "https://maddythorson.medium.com/is-madeline-canonically-trans-4277ece02e40",
    "Queerly Represent Me": "https://queerlyrepresent.me/",
    "Qweerty Gamers,": "https://www.qweertygamers.org/",
    "GaymerX": "https://gaymerx.org/about-us"
  }
}