{
  "source": "https://www.techradar.com/news/honor-v40-5g-confirmed-to-be-launching-on-january-18-likely-with-a-120hz-screen",
  "title": "Honor V40 5G confirmed to be launching on January 18, likely with a 120Hz screen",
  "category": "phones",
  "updated": "2021-01-08T11:11:30Z",
  "author": "james-rogerson",
  "summary": "But only in China for now",
  "article": [
    "If you want a premium phone without an overly premium price then you might soon have a brand new option, as the Honor V40 5G is being announced on January 18.",
    "The launch – which was confirmed by the company on Weibo (a Chinese social network) – is initially only for China, and it’s not clear if or when the phone will land in the likes of the UK or Australia. The US meanwhile almost certainly won’t get it, since Honor falls under the Huawei ban, though that might not apply to the brand for much longer.",
    "Hopefully it will get a wide launch though, because beyond offering 5G, the Honor V40 5G is rumored to have a 120Hz screen, incredibly fast 66W fast charging, and a quad-lens camera, and while pricing is yet to be confirmed, we’d expect it will significantly undercut flagship phones.",
    "While the specs are also yet to be confirmed, Honor has posted a teaser image of the phone, providing a clear view of the front of the handset. You can see that it has a curved screen, a pill-shaped dual-lens camera cut-out in the top left corner, and an overall quite high-end appearance.",
    "If and when the Honor V40 5G does go global, it might well do so as the 'Honor View 40 5G', given that the Honor V30 launched outside China as the Honor View 30. But be aware that as it’s affected by the Huawei ban it won’t include Google apps or access to the Google Play Store.",
    "And while the Honor V40 5G is the only device that Honor has teased for its January 18 announcement, there’s a high chance we’ll see other things too, as MyFixGuide has found evidence of five new products coming to Honor’s online store.",
    "It doesn’t have any details of them, but we wouldn’t be surprised if there’s an Honor V40 5G Pro, and there may well also be a tablet or a smartwatch on the way, so if you’re an Honor fan there could be a lot to look forward to.",
    "Via MySmartPrice"
  ],
  "headers": {},
  "links": {
    "Weibo": "https://m.weibo.cn/detail/4591035928286566",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "that might not apply to the brand for much longer": "https://www.techradar.com/news/huawei-to-sell-the-honor-brand-heres-what-that-could-mean-for-your-next-phone",
    "Honor View 30": "https://www.techradar.com/news/honor-view-30",
    "MyFixGuide": "https://www.myfixguide.com/four-products-launched-honor-v40/",
    "MySmartPrice": "https://www.mysmartprice.com/gear/honor-v40-5g-officially-confirmed-launch-january-18-china/"
  }
}