{
  "source": "https://www.techradar.com/news/its-not-metroid-prime-4-but-metroid-dread-is-the-first-new-2d-entry-in-20-years",
  "title": "It’s not Metroid Prime 4, but Metroid Dread is the first new 2D entry in 20 years",
  "category": "gaming",
  "updated": "2021-06-15T16:27:50Z",
  "author": "nick-pino",
  "summary": "There’s a new 2D Metroid game coming in October",
  "article": [
    "At its Nintendo Direct E3 2021 event, Nintendo announced its first new 2D Metroid entry in the franchise in close to 20 years called Metroid Dread.",
    "The game will be available on Nintendo Switch on October 8, 2021 and looks similar to Metroid: Samus Returns on the Nintendo 3DS that came out in 2017.",
    "Based on the trailer Nintendo unveiled at its Nintendo Direct event, Metroid Dread retains many of the staples of the series - 2D exploration that unlocks as you gain new power ups and tense combat with alien lifeforms - though it does appear to be slightly more intense than a traditional entry in the franchise in terms of gameplay speed and tone.",
    "Alongside Metroid Dread Nintendo will release two new amiibo figures of Samus and E.M.M.I. (the mechanoid alien) appearing in the trailer.",
    "According to Shinya Takahashi, General Manager of the Entertainment Planning & Development Division at Nintendo, Nintendo is hard at work on the next entry in the Metroid Prime series, Metroid Prime 4, but wasn't ready to show off more gameplay at today's Nintendo Direct event.",
    "Nintendo has been relatively tight-lipped about the game since the teaser at E3 two years ago - though, we're hoping that might change by the next Nintendo Direct event that will inevitably happen later this year.",
    "Until then, Metroid Dread looks like an interesting return to form for the franchise and a nice stopgap while we wait for the next 3D Samus game."
  ],
  "headers": {
    "4": "Where's Metroid Prime 4?"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Metroid Prime 4": "https://www.techradar.com/news/metroid-prime-4"
  }
}