{
  "source": "https://www.techradar.com/news/pre-order-an-apple-watch-7-tomorrow-or-risk-waiting-until-next-year-analyst-says",
  "title": "Pre-order an Apple Watch 7 tomorrow or risk waiting until next year, analyst says",
  "category": "wearables",
  "updated": "2021-10-07T14:10:02Z",
  "author": "james-peckham",
  "summary": "Pre-orders open on Friday, October 8",
  "article": [
    "The Apple Watch 7 is set to go on sale on October 15 with pre-orders for the new smartwatch opening on October 8. If you want to get one on October 15, you may want to ensure you pre-order later this week.",
    "Some are predicting that supply will be limited for the new smartwatch, so if you want to get one in the coming weeks you may want to ensure your order rather than waiting to buy it on the release date itself.",
    "Leo Gebbie, Principal Analyst of Connected Devices at CCS Insight, told TechRadar, \"The iPhone 13 has proven phenomenally popular since launch and we’ve observed that it’s been out of stock in many places including Apple’s own website, meaning that customers who didn’t pre-order missed out.",
    "\"I predict that supply for the Watch may be even tighter.\"",
    "The iPhone 13 sold out in a couple of days with some territories showing the device as out of stock as soon as three days after pre-orders went live. For example, ordering an iPhone 13 Pro now in the UK from Apple's official website will result in a wait of over a month.",
    "Gebbie continues, \"Apple didn’t announce a launch date when it revealed the Apple Watch Series 7, and the gap between the iPhone and Watch release could hint at extra time needed to manage supply.",
    "\"For that reason, I think Watch aficionados might want to place pre-orders to be on the safe side, especially as demand grows running up to the holiday season.\"",
    "The company has suffered from supply chain problems over the last two years, including with the iPhone 12 series that was released in two waves back in 2020 to ensure Apple could produce enough handsets.",
    "Gebbie says, \"While the company is better positioned than most to manage supply, it has still struggled at times and has spoken on its earnings calls about constraints on a number of products due to component availability.\"",
    "Back in July 2021, Tim Cook told an investors call, \"The majority of constraints we’re seeing are of the variety that I think others are seeing, that I would classify as industry shortage.\"",
    "Cook was specifically referring to the iPhone, iPad and Mac lines of products, but it's thought that the company may be experiencing similar supply chain issues for the Apple Watch family too.",
    "Before the Apple Watch 7 was revealed, a report from Bloomberg cited a person familiar with the matter that said the products development had hit some \"production snags\".",
    "This is thought to be due to the new size of display, rather than anything specifically to do with the company's supply chain. This may mean the company has more stock than Gebbie and others have predicted, but there's still no gurantee that will be the case.",
    "It may be these production snags combined with supply chain issues are why Apple delayed its smartwatch launch until October 15, rather than releasing it alongside the iPhone 13.",
    "Only time will tell, but if you're desperate to get a new Apple Watch 7 as soon as possible you'll want to keep an eye out for deals on Friday, October 8 and get yours confirmed as quickly as possible.",
    "If you wait until October 15, you may lose out and you may not receive your Apple Watch until at least a few months time."
  ],
  "headers": {
    "7": "The story so far",
    "11": "Could it be something else?"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-31/apple-s-new-watch-will-likely-be-delayed-over-production-snags"
  }
}