{
  "source": "https://www.techradar.com/news/asus-tuf-dash-f15-shows-that-thin-and-light-gaming-laptops-dont-have-to-be-super-expensive",
  "title": "Asus TUF Dash F15 shows that thin and light gaming laptops don’t have to be super expensive",
  "category": "computing",
  "updated": "2021-01-13T18:00:50Z",
  "author": "matt-hanson",
  "summary": "Asus reveals the thin, light and affordable TUF Dash F15",
  "article": [
    "Asus has revealed yet more laptops at CES 2021, including the new Asus TUF Dash F15 (FX516), which looks set to bring premium components and a thin and light design to Asus’ more affordable TUF lineup of gaming laptops.",
    "So, you’re getting Intel Tiger Lake processors and Nvidia’s newly-announced RTX 3000 mobile graphics cards, which means it should be a great performer with modern games. You also get a choice of a 1080p screen with adaptive sync and 144Hz refresh rates, or one with even higher 240Hz refresh, so games should look and feel incredibly smooth.",
    "As is usual with Asus’ TUF products, the Dash F15 features military-grade durability (MIL-STD-810H), so this should be a gaming laptop you’ll feel comfortable carrying around with you.",
    "Impressively, Asus has slimmed down the device, and it’s now just 19.9mm thin and weighs just 2kg, which is quite a bit leaner and lighter than previous 15-inch TUF gaming laptops. For anyone who doesn’t want a big and bulky gaming laptop, the Asus TUF Dash F15 could offer an affordable alternative to the thin and light devices from Asus’ premium ROG Zepheryus lineup.",
    "We don’t have price and availability information just yet, but hopefully Asus will share more information soon.",
    "Asus also announced two new ZenBook Duo models, which both once again come with a second screen nestled above the keyboard. The ScreenPad Plus now comes with a Control Panel app, offering users the ability to configure the second touchscreen, and integrates well with creative apps such as Adobe Premiere and Photoshop.",
    "Primarily aimed at creatives, the ZenBook Duo 14 UX482 and ZenBook Pro Duo UX582 come with 11th generation Intel Core i5 or 17 processors and optional Nvidia GeForce MX450 graphics, and Asus Intelligent Performance Technology (AIPT), which boosts the CPU power setting from 15W to 28W watts for improved performance without overheating.",
    "The ZenBook Duo 14 UX482 can also come with up to 32GB of RAM and Asus is promising a huge 17-hour battery life as well.",
    "If you like the sound of the second screen, but are more of a gamer than a digital creative, then Asus has also announced the Asus ROG Zephyrus Duo 15 earlier on in CES 2021.",
    "Again, we don’t have specific prices or release dates just yet, but hopefully we’ll be getting our hands on these new laptops soon."
  ],
  "headers": {
    "5": "Dual-screen ambitions"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "newly-announced RTX 3000 mobile graphics cards": "https://www.techradar.com/news/nvidia-rtx-3000-graphics-cards-are-finally-coming-to-laptops",
    "Asus ROG Zephyrus Duo 15 earlier on in CES 2021": "https://www.techradar.com/news/asus-rog-zephyrus-duo-15-wants-to-prove-that-dual-screen-gaming-laptops-arent-just-a-gimmick"
  }
}