{
  "source": "https://www.techradar.com/news/microsoft-is-reopening-its-global-hq-next-week",
  "title": "Microsoft is reopening its global HQ next week",
  "category": "computing",
  "updated": "2021-03-22T17:30:53Z",
  "author": "anthony-spadafora",
  "summary": "Employees will begin returning to Microsoft's Redmond headquarters at the end of March",
  "article": [
    "After allowing its employees to work from home at the beginning of the pandemic, Microsoft has announced its plans to begin reopening its headquarters in Redmond and Seattle, Washington later this month.",
    "The software giant's headquarters have remained closed for over a year now but it recently began reopening some of its global work sites after they reached a stage that meets or exceeds government requirements to accommodate more workers.",
    "So far, Microsoft work sites in 21 countries have been able to accommodate additional workers in its facilities and according to a new blog post from the company's head of corporate strategy, Kurt DelBene, these workers represent 20 percent of its global employee population.",
    "Beginning on March 29 though, Microsoft will also start making this shift at its Redmond, Washington headquarters and nearby campuses.",
    "Although Microsoft initially tried to provide guidance to its employees anchored to specific timelines and phases of the pandemic, the company soon realized that it was too difficult to predict when each of these phases would occur. This led the company to develop a return-to-work site strategy which could account for constantly changing public health conditions and government guidance to help keep its employees safe.",
    "For this reason, Microsoft developed a Hybrid Workplace Dial that is anchored to six defined states as opposed to specific timelines. The dial itself has six stages and on-site occupancy changes as the dial is turned. Stage 1 is closed, Stage 2 is mandatory work from home, in Stage 3 work from home is strongly encouraged, Stage 4 is a soft open, Stage 5 is open with restrictions and finally, Stage 6 is open without restrictions.",
    "Going forward, Microsoft is committed to embracing a hybrid work model and strategy which encompasses a flexible work policy, inclusive space design and innovative technology solutions. The company has released its new 2021 Work Trend Index to share some of the workplace insights its observed in the past year but also what can be expected in the future as the era of hybrid work unfolds.",
    "DelBene provided further insight on how the company is prototyping hybrid meeting spaces and using Microsoft Teams to become a hybrid workplace, saying:",
    "“Additionally, we’ve pulled together a group of Microsoft researchers, engineers and real estate and facilities experts to prototype hybrid meeting spaces at our Redmond, Washington, and U.K. campuses. The group is investigating different meeting configurations and technologies like multiple screens, cameras and mixed reality scenarios to understand the most effective, inclusive set-up for hybrid work. It’s still early days, but we’ve explored solutions that range from simply reconfiguring existing technologies to designing exciting new Microsoft Teams innovations for hybrid work.”"
  ],
  "headers": {
    "4": "Becoming a hybrid workplace"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Microsoft": "https://www.techradar.com/news/panos-panay-teases-is-pumped-about-the-next-generation-of-windows",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1210683531899739400&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fblog%2F2021%2F03%2F22%2Fthe-philosophy-and-practice-of-our-hybrid-workplace%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-reopening-its-global-hq-next-week",
    "hybrid work model": "https://www.techradar.com/news/google-staff-will-work-from-home-for-the-majority-of-2021",
    "2021 Work Trend Index": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1808111237468518700&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fworklab%2Fwork-trend-index%2Fhybrid-work",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "hybrid workplace": "https://www.techradar.com/news/how-businesses-can-use-technology-to-return-to-work"
  }
}