{
  "source": "https://www.techradar.com/news/google-pixel-3-and-3-xls-randomly-bricking-as-hundreds-report-dead-phones",
  "title": "Google Pixel 3 and 3 XLs randomly bricking, as hundreds report dead phones",
  "category": "phones",
  "updated": "2021-09-13T06:36:33Z",
  "author": "stephen-lambrechts",
  "summary": "First instances date as far back as December 2020",
  "article": [
    "UPDATE: Since first publishing this article, TechRadar has received multiple additional reports from readers who've experienced the bricking issue, including the specific user whose repair center story was referenced below. Based on that feedback, we've updated some aspects of this story to provide further clarification. We've yet to receive an official comment from Google on the matter.",
    "An increasing number of Google Pixel 3 and Pixel 3 XL owners are waking up to find their handsets suddenly dead, according to a torrent of user complaints in the search giant's own IssueTracker site, which was picked up by Ars Technica.",
    "The complaints, some dating back several months (one user reached out to us to say that his Pixel 3 has been dead since December 2020), all describe a sudden bricking of their Google Pixel 3 or 3 XL devices, with the handsets reportedly becoming trapped in a Qualcomm EDL (emergency download) mode that won't allow users to recover or install new firmware, especially since the problem prevents users from reaching the bootloader.",
    "Although many of the complaints report waking up to dead phones, there are also numerous accounts of the issue occurring suddenly while in users' pockets or while performing other tasks like listening to music. It's currently unknown if an automatic update is causing the issue, but it seems like the most likely culprit.",
    "So what can you do if your Google Pixel 3 phone suddenly enters a non-responsive state? Not much, it would seem – according to some affected users in the IssueTracker thread, Google Support is unwilling to replace the devices due to their being outside of the warranty period.",
    "One Japan-based user was reportedly told by an authorized repair center that their device would need to have its motherboard replaced, and that this would cost the equivalent of around $500 (about £360 / AU$670), which seems ludicrously high for a 3-year-old phone and is significantly more than it costs to buy a new Pixel 3 in 2021.",
    "Unfortunately, Google has not responded to our requests for official comment on the matter, but we will continue to keep you posted on any updates."
  ],
  "headers": {
    "4": "What can you do if your Pixel 3 is bricked?"
  },
  "links": {
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "IssueTracker": "https://issuetracker.google.com/issues/192008282?pli=1",
    "Ars Technica": "https://arstechnica.com/gadgets/2021/09/reports-of-pixel-3s-bricking-with-edl-message-are-growing/",
    "some affected users in the IssueTracker thread": "https://issuetracker.google.com/issues/192008282#comment296",
    "One Japan-based user": "https://issuetracker.google.com/issues/192008282#comment308"
  }
}