{
  "source": "https://www.techradar.com/news/mtg-arena-mobile-app-fully-launches-for-ios-and-android-march-25",
  "title": "MTG Arena mobile app fully launches for iOS and Android March 25",
  "category": "gaming",
  "updated": "2021-03-24T20:21:24.224Z",
  "author": "david-lumb",
  "summary": "MTG Arena mobile release date is...tomorrow",
  "article": [
    "The digital version of the popular card game Magic: The Gathering, MTG Arena, is finally launching its mobile app on March 25 across the world – but folks in Europe can start downloading it now on iOS and Android.",
    "While the MTG Arena mobile app launched in beta on Android devices in late January, it will fully release out of beta for both Android and iOS devices on March 25, parent company Wizards of the Coast announced in a blog post. But the app has started rolling out in some regions – namely, Europe – for users to download from the iOS App Store and Android Google Play store.",
    "Players who have built up an MTG Arena card collection on the PC version needn’t worry – they can sign into the mobile version and use their same cards and decks. Conversely, players just getting started in the mobile app can carry their collection over to the desktop game.",
    "Magic: The Gathering debuted its first set of physical cards in 1993, and after various efforts to port the game to digital platforms, Magic: The Gathering Arena launched in September 2019 (after a two-year beta) as an adapted version that streamlines the original’s turn-based gameplay for modern players.",
    "MTG Arena mobile is the same game, just shrunk down for smartphone screens, as players have discovered in the Android beta. While you can’t play every mode that’s been established by IRL Magic players, and can’t port your physical collection to MTG Arena, the game gives new players a smattering of starter decks to get used to while they build up a digital collection.",
    "Via AppleInsider"
  ],
  "headers": {
    "3": "Magic on mobile"
  },
  "links": {
    "beta": "https://magic.wizards.com/en/articles/archive/magic-digital/announcing-mtg-arena-mobile-android-early-access-2021-01-07",
    "Wizards of the Coast": "https://magic.wizards.com/en/articles/archive/magic-digital/mtg-arena-announcements-march-24-2021",
    "AppleInsider": "https://appleinsider.com/articles/21/03/24/magic-the-gathering-arena-for-iphone-ipad-launching-march-25"
  }
}