{
  "source": "https://www.techradar.com/news/this-amazon-echo-deal-comes-with-a-free-philips-hue-smart-bulb",
  "title": "This Amazon Echo deal comes with a free Philips Hue smart bulb",
  "category": "smart-home",
  "updated": "2021-02-15T11:06:04Z",
  "author": "carrie-ann-skinner",
  "summary": "Start your smart home adventure with this great value bundle",
  "article": [
    "Amazon’s Echo (4th generation) smart speaker is being bundled with two free Philips Hue smart bulbs for a limited time in the US right now. The bundle is priced at $99.99, which is a saving of $29.99, making it a great deal if you want to dip your toe in the water when it comes to smart lighting.",
    "The Amazon Echo (4th generation) doubles as a hub for the bulbs, so there’s no need for you to purchase Hue’s own hub if you want to control the light bulbs even when you’re not at home. The Amazon Echo (4th generation) has been as low as $69.99, so if you’re not interested in putting smart light bulbs in your home, you may want to wait to see if the price of the smart speaker falls later in the year.",
    "Unfortunately, the same smart speaker and bulb bundle aren’t available in the UK. Instead, Brits can pick up an Amazon Echo (4th generation) for £69.99, which is a £20 saving on the list price, and it comes with one free Philips Hue bulb, in either bayonet or screw fitting, included at no extra cost.",
    "(Not in the US or UK? Scroll down for the best Amazon Echo deals in your region.)",
    "With a spherical design that's a departure from previous models of Amazon's original smart speaker, the Amazon Echo (4th generation) certainly looks different, but it still offers a room-filling sound and all the smarts you'd expect from an Alexa-enabled speaker. It also has a light ring on the bottom that glows different colors to indicate when Alexa is listening, when the microphone is muted or you have a shipping notification or message waiting.",
    "Meanwhile, Philips Hue smart bulbs let you tweak the shade of white the bulb glows and can easily be controlled from your smartphone or by Alexa, letting you bring some simple automation to your home."
  ],
  "headers": {
    "4": "Today's best Amazon Echo deal in the UK"
  },
  "links": {
    "Amazon’s Echo (4th generation)": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Philips Hue smart bulbs": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "$99.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08KVFM2XM%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1377245091188047000-20",
    "smart lighting": "https://www.techradar.com/news/how-do-smart-light-bulbs-work-and-should-i-buy-one",
    "smart light bulbs": "https://www.techradar.com/news/best-smart-lighting",
    "£69.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAll-new-generation-Charcoal-Philips-White%2Fdp%2FB08HB1TWCN%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-9540932132426127000-21",
    "best Amazon Echo deals": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals"
  }
}