{
  "source": "https://www.techradar.com/news/affordable-samsung-galaxy-tab-a8-tablet-shown-off-in-unofficial-renders",
  "title": "Affordable Samsung Galaxy Tab A8 tablet shown off in unofficial renders",
  "category": "tablets",
  "updated": "2021-09-19T13:30:52Z",
  "author": "david-nield",
  "summary": "Take a look",
  "article": [
    "We've heard plenty in the way of rumors and speculation when it comes to the Samsung Galaxy Tab S8, but a new leak points us towards a more affordable alternative that's also in the pipeline, it would seem: the Samsung Galaxy Tab A8.",
    "Well-known tipster @OnLeaks and 91mobiles have teamed up to produce some unofficial renders based on what they believe to be the specs, dimensions and design of the tablet, which is apparently launching \"soon\".",
    "This will be the successor to the Samsung Galaxy Tab A7, which made its debut in September 2020 – so if Samsung sticks to its usual annual refresh schedule, the Tab A8 could be out any day now. It looks as though a lot of the design choices will be the same, with a flat-edged, simple aesthetic on show in these pictures.",
    "According to this new leak, the Galaxy Tab A8 is going to come with a 10.4-inch screen (just like the Tab A7) and at least an FHD+ resolution – so there might be an upgrade on the 2000 x 1200 pixel resolution we saw last time.",
    "There's apparently going to be a single-lens 8MP camera on the back of the new tablet, and a 3.5mm headphone jack is set to be included too. The dimensions are said to be 246.7 mm x 161.8 mm x 6.9 mm (9.7 inches x 6.4 inches x 0.27 inches), which is again very similar to the 2020 model.",
    "As for processor and RAM specs, we'll have to wait and see. We do know from all the Galaxy A series tablets that Samsung has put out before that this will be a device that prioritizes affordability over performance, so adjust your expectations accordingly.",
    "Earlier this week we saw yet another iPad appear, and Android device makers continue to struggle to reach the high bar that Apple has set when it comes to tablets: it most respects the iPads are better options if you're in the market for a new tablet.",
    "That's partly down to the quality of the hardware, but software also plays a role too. Apple has spun iPadOS out from the software that runs on its phones, and the strategy has worked well. There's no such distinction when it comes to Android.",
    "We're glad that Samsung is continuing to put out top-quality, reliable, well-made tablets like the Samsung Galaxy Tab S7. The Tab S series has shown that Android manufacturers can compete with Apple in the tablet market, if they focus their efforts.",
    "We'd very much welcome other device makers following Samsung's lead, to give the iPad models more competition across different price points and sizes. How about having another try at the Nexus 7, Google?"
  ],
  "headers": {
    "3": "Specs appeal",
    "6": "Opinion: more tablets please"
  },
  "links": {
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "@OnLeaks": "https://twitter.com/OnLeaks/status/1438770472313835523",
    "91mobiles": "https://www.91mobiles.com/hub/samsung-galaxy-tab-a8-2021-design-renders-exclusive/",
    "yet another iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Samsung Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review"
  }
}