{
  "source": "https://www.techradar.com/news/nord-security-finally-adds-mfa-to-its-products",
  "title": "Nord Security finally adds MFA to its products",
  "category": "computing",
  "updated": "2021-03-17T16:21:51Z",
  "author": "mayank-sharma",
  "summary": "Nord intends to flesh out its security platform with MFA mechanisms",
  "article": [
    "Nord Security, the company behind the popular NordVPN VPN service, has announced a new feature to streamline user authentication for its various services.",
    "Nord Security has a portfolio of a handful of cybersecurity products, as alongside its VPN, there’s the NordPass password manager, and NordLocker for end-to-end file encryption.",
    "Now added to that list is the newly announced Nord Account, a multi-factor authentication (MFA) tool that will help users log into all the services using the same credentials.",
    "“Since the Nord suite of cybersecurity services is expanding, the time has come to introduce a new centralized solution that will help our users manage their accounts in a hassle-free way from a single place,” said Vykintas Maknickas, Product Strategist at NordVPN.",
    "In addition to unified credentials, Nord Account also gives users a single-pane of view to all their active Nord subscriptions. Users will be able to use the new service to manage their existing subscriptions by extending or cancelling them, and can also access their billing history.",
    "The new tool will also enable users to read the latest security reports from the service provider as well as download apps for any of its services, while also giving them a unified interface to change their account preferences.",
    "Existing users can use their credentials to log into Nord Account without going through the rigmarole of creating a new account and registering with the service.",
    "Maknickas adds that the new service will soon add support for security keys, such as YubiKey, adding that they’ll eventually extend the service to support additional multi-factor authentication mechanisms including biometrics."
  ],
  "headers": {
    "3": "Standard practice"
  },
  "links": {
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "password manager": "https://www.techradar.com/best/password-manager",
    "file encryption": "https://www.techradar.com/best/best-encryption-software",
    "security keys": "https://www.techradar.com/best/best-security-key"
  }
}