{
  "source": "https://www.techradar.com/news/dying-light-2s-latest-trailer-is-definite-nightmare-fuel",
  "title": "Dying Light 2’s latest trailer is definite nightmare fuel",
  "category": "gaming",
  "updated": "2021-07-01T20:34:52Z",
  "author": "nick-pino",
  "summary": "The latest Dying Light 2 trailer shows off new stealth and horrifying new special enemies",
  "article": [
    "Move over Resident Evil Village, there’s a new survival horror game in town and – after catching Dying Light 2’s second gameplay trailer – we can safely say it’s downright frightening.",
    "The trailer, which made its debut in the middle of TechLand’s Dying 2 Know YouTube livestream, showed off a new hospital environment that was packed to the brim with turned civilians.",
    "According to the game’s director, these nests are nearly impossible to fight through, but they can be navigated carefully if you’re stealthy enough.",
    "Of course, as things always do in these sorts of situations, things go awry and before long the casual stroll through a creepy decrepit hospital turns into a heart-pumping nightmare roller-coaster as we have to watch the game’s protagonist, Aiden Caldwell, escape from the hospital before he’s either eviscerated by zombies or turned into one by the virus.",
    "Besides the awfully uninviting environment, the trailer is also a showcase for a few of the new zombie sub-types you’ll encounter along the way – including the Revenant, a brand-new infected species that’s smarter than the regular infected.",
    "While livestreams are rarely a good indicator of what a final game will look like, the latest trailer does show us what the PS5 and Xbox Series X can really do.",
    "Namely, that’s the ability to include a number of high-resolution enemies on screen at once in an ultra detailed environment. That’s easier to do when the setting is somewhere inside as then the game’s engine only renders a small area at a time, but Dying Light 2’s environments seem both complex and incredibly detailed.",
    "Watching the trailer you can see some interesting options presented to the player – when exactly to use the flashlight that could attract the infected and when to take chances by stumbling around in the dark by crawling underneath tables.",
    "We'll be excited to see if we can complete some of the game's missions in multiple ways like, say, Far Cry or a Bethesda title might allow, but so far the game's white-knuckle parkour gameplay and frenetic combat look pretty darn enticing.",
    "Dying Light 2 will be available on December 7, 2021 for PS4, Xbox One, Xbox Series X/S and PS5."
  ],
  "headers": {
    "5": "A real showcase of what the PS5 and Xbox Series X can do"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Dying 2 Know YouTube livestream": "https://www.youtube.com/watch?v=KFWDDv6Exek",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors"
  }
}