{
  "source": "https://www.techradar.com/news/gta-6-rumored-to-be-set-in-rio-following-map-leaks",
  "title": "GTA 6 rumored to be set in Rio, following map 'leaks'",
  "category": "gaming",
  "updated": "2021-05-28T10:34:44Z",
  "author": "vic-hood",
  "summary": "Could this be where GTA 6 is set?",
  "article": [
    "GTA 6 rumors are rampant once again, this time as a result of a series of 'leaks' that allegedly reveal sections of the overall GTA 6 map.",
    "These supposed map leaks have been going on for some time, since early 2020, with the most recent landing earlier this week. So far there have been four map leaks in total, each appearing to show a different section of the overall map.",
    "Following the most recent leak, fans on the GTA 6 subreddit have been speculating about whether GTA 6 will - at least partly - be set in Rio De Janeiro. Pointing to the third apparent leaked map image, the original poster of the speculation thread compared this map image to a real-life map of Rio.",
    "There's likely some major grasping at straws going on here, but this theory does correlate with previous rumors and speculation from fans that GTA 6 could be set partly in South America.",
    "Given the number of GTA 6 floating around, and the fact these alleged map leaks originally appear on 4Chan, it's worth taking these rumors and 'leaks' with a huge grain of salt.",
    "So far, GTA 6 rumors have suggested the setting could include everywhere from Virginia to London. The most prominent rumor has suggested that GTA 6 is codenamed developed under the code name 'Project Americas' and will span the both the USA and South America including locations inspired by real-life locations.",
    "While this is an exciting prospect, it's worth noting that there are a lot of rumors out there, with many purposely making fake 'leaks' to mislead fans.",
    "While Take-Two Interactive is attending E3 2021 this year, we don't expect any firm news on GTA 6 as Rockstar will likely focus on sharing details about GTA 5 on PS5 and Xbox Series X, which is landing this November."
  ],
  "headers": {
    "4": "A whole salt mine"
  },
  "links": {
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "most recent": "https://imgur.com/j5MQzSB",
    "GTA 6 subreddit": "https://www.reddit.com/r/GTA6/comments/nl6m76/the_bottom_city_is_rio_de_janeiro_in_the_leaked/",
    "third apparent leaked map image": "https://imgur.com/HObAjJB"
  }
}