{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-range-will-probably-get-android-12-by-december",
  "title": "Samsung Galaxy S21 range will probably get Android 12 by December",
  "category": "phones",
  "updated": "2021-10-14T09:09:18Z",
  "author": "james-rogerson",
  "summary": "Or even earlier",
  "article": [
    "There was a time when Samsung was slow at rolling out new versions of Android, but recently it’s been doing better, and that looks set to continue with Android 12, as reportedly the company will start rolling it out by December at the latest.",
    "That’s according to a South Korean Samsung community moderator, who in response to a query said that Android 12 is likely to come to the Samsung Galaxy S21 range by December at the latest.",
    "This post – spotted by TizenHelp – only refers to South Korean models of the Galaxy S21 range, so it’s possible that other regions will have to wait longer. But if so we wouldn’t expect the wait to be much longer, and in fact Samsung brought Android 11 to the Galaxy S20 range in the US at around the same time as in South Korea.",
    "It’s worth emphasizing also that this post says December at the latest, so we may in fact see Android 12 on these phones before then. Other Samsung phones will probably have longer to wait, as we’d expect the Galaxy S21 range will get the update first, but other high-profile and high-end handsets hopefully won’t be waiting too long.",
    "We would still take this claim with a pinch of salt even though it appears to come from a Samsung employee, especially as they sound a bit uncertain, but it seems likely at least that the wait for Android 12 on Samsung’s main 2021 flagships is almost over.",
    "It’s worth noting that the version of Android 12 that the Samsung Galaxy S21 range will get won’t be the same as the version Google has unveiled.",
    "For one thing, Samsung will put its own twist on it, with the company working on its One UI 4 overlay. These tweaks are the main reason that we’ll be waiting longer to see Android 12 on Samsung phones than on Pixel handsets like the upcoming Google Pixel 6, which is sure to ship with Android 12.",
    "But beyond that, arguably the biggest feature of Android 12 won’t initially be present. We’re talking about Material You, a feature that lets you drill down and completely personalize the look of Android 12.",
    "It sounds really promising, but it’s also not present on the Android Open Source Project (AOSP). That’s the version of Android that Samsung and other companies use (and typically build upon with their own ‘forks’).",
    "While Google hasn’t directly commented on this, some of its own blog posts suggest that Material You will be accessible to phone-makers, and in a comment to TechRadar, Oppo has suggested that it expects to get access to it eventually.",
    "But right now, seemingly no companies other than Google have access, which means if Android 12 really does come to Samsung phones in December it will probably do so without this key feature, with a subsequent update next year potentially rolling it out. It’s just the latest failing in what has so far been a really poor Android 12 launch.",
    "Via Softpedia"
  ],
  "headers": {
    "5": "Analysis: Android 12, but not as you might expect"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "TizenHelp": "https://www.tizenhelp.com/stable-one-ui-4-version-to-start-rolling-out-in-december/",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "in a comment to TechRadar": "https://www.techradar.com/news/android-12s-biggest-feature-might-not-be-on-many-phones-at-launch",
    "a really poor Android 12 launch": "https://www.techradar.com/news/android-12-is-here-but-it-shouldnt-be",
    "Softpedia": "https://news.softpedia.com/news/samsung-to-start-android-12-rollout-in-december-at-the-latest-534213.shtml"
  }
}