{
  "source": "https://www.techradar.com/news/the-5-best-ever-super-bowl-halftime-shows",
  "title": "The 5 best ever Super Bowl halftime shows",
  "category": "audio-visual",
  "updated": "2021-01-29T20:03:42Z",
  "author": "tabitha-baker",
  "summary": "The legendary halftime moments we can't stop watching",
  "article": [
    "The Weeknd is set to take on this 2021's Super Bowl halftime show, and he's got some mighty shoes to fill. With the likes of Prince, Diana Ross and Beyonce taking centre field in the past, the Super Bowl halftime show is certainly a prestigious gig.",
    "Forgetting the actual football for a moment, we've been taking a look at the best halftime shows in history to get us ready for the main event. In the past we've had spectacle, we've had controversy, we've had surprise guests and even more surprising fashion slips. We've had the world's biggest stars taking to the field to put on a show once the second quarter's all washed up and we want more.",
    "The Weeknd has certainly proven himself over the last year, with After Hours' stunning success - but to see exactly who he's up against when it comes to the biggest gig of the year we're counting down our top shows over the last 54 Championship games.",
    "That means we're running through all the silhouette guitar solos, surprise guests, helicopter exits, and genre-mashing dance offs to find the craziest, most awe-inspiring performances yet. Each year is exciting, but there are some special years when magic is made on the field and it all happens between the second and third quarters. The Super Bowl halftime show is one of the most bombastic blasts of entertainment of the year, and we're bringing you the very best of the best for some pre-game study.",
    "It's not just recency bias, last year's performance from JLo and Shakira was one of the best Super Bowl halftime shows we've seen in a few years. The explosive love letter to Latino identity saw a laundry list of hits from two of the biggest names in the business. Building from a sultry She Wolf opener, Shakira opened the night with a mind melting medley of some of her greatest hits, with a dash of Cardi B in there for good measure. Then, it was Jenny From the Block that had the room bouncing and a children's choir led by JLo's own daughter that had it weeping.",
    "Culminating in Lopez's double-sided Versace feathered flag (we've all got one in the back of the closet somewhere), a final message of shared unity brought 2020's Super Bowl halftime show to a dramatic close, with emotions at an all time high.",
    "A Diana Ross Super Bowl halftime show was never going to be a low-key affair. But 14 costume changes, sparkling airlifts, a field-covering golden cape, and a helicopter exit set to I Will Survive and Take Me Higher took the short entertainment slot to new heights.",
    "If you can try and ignore the theatrics for a second, you'll also realize that this 1996 show was filled to the brim with the medleys and mashups of Diana Ross's hottest tracks. We kick off with Stop In The Name of Love and flit through some of Ross's top tracks before reaching costume change number six at Chain Reaction, then it's a whistle stop tour past Reach Out And Touch before a sublime Ain't No Mountain High Enough is belted from the heights of an airlift.",
    "Aerosmith. NSYNC. Britney Spears. Mary J. Blige. Nelly. You could have ripped the Super Bowl XXXV lineup straight off a 2001 USB MP3 player. It was a never ending roster of fireworks (coming out of JT's hands no less), boyband power poses and dance offs. And then Walk This Way happened.",
    "Suddenly you have Britney taking the stage to duet a verse with Justin, and then Mary J. Blige joins the party. Who next? Nelly jumps out to complete this Who's Who of everyone's bedroom poster collection and the world seems to stop spinning for just a moment. The 2001 Super Bowl halftime show was stuff of legend, bringing together the biggest artists of the day to perform in new and spectacular ways - plus, it was the first show to allow the audience onto the field so no wonder the entire show feels different.",
    "Oh yeah, and the whole thing starts with a Ben Stiller Dodgeball cameo.",
    "We were happy with a Beyoncé halftime show, if a little shocked she had never held the show solo before. We were happy with a slew of hits infused with the kind of raw power you only find in a Knowles performance. We were even happy with a solo artist taking on the entire Super Bowl halftime show by herself... until she wasn't.",
    "Dreams came true when Kelly Rowland and Michelle Williams joined their former Destiny's Child frontwoman on stage just before a legendary Charlie's Angels pose. Bootylicious and Independent Women ensued, before a rendition of Single Ladies and Halo melted the nation. Not only was Beyoncé's Super Bowl halftime show an explosive success in its own right, but it served to somewhat alleviate the reputation of the singer herself after controversy over lip syncing earlier in the year.",
    "There's something about performing in the pouring rain that makes everything so much more intense. To be honest, Prince never needed the added flair to raise the stakes of his shows, but the Super Bowl XLI halftime show was on another level of showmanship. Take big budget spectacle and combine it with an artist as extravagant as the man who made himself a symbol and you've got yourself a show.",
    "Every second, from the opening thunder of a We Will Rock You cover to the finale of a particularly fitting Purple Rain was dripping in finesse. A simple silhouette and a shredding guitar solo made for one of the most powerful moments in halftime history.",
    "Following in the glittered footsteps of JLo and Shakira, The Weeknd will be stepping onto centre field for the Super Bowl halftime show in 2021. The Canadian singer songwriter has had an incredible year, with After Hours sitting atop the Billboard 100 for four weeks, and in the UK charts for a full eight weeks.",
    "If you haven't heard his latest album (and it's been pretty difficult not to have) you can bet there'll be plenty of classic hits in there as well. Starboy, Can't Feel My Face and I Feel It Coming are staple in The Weeknd's catalogue and we can't wait to see who else will join him on stage.",
    "Of course, things will look a little different this year. Raymond James Stadium is limited to around 22,000 fans in attendance this year, and having that crowd on the field looks incredibly unlikely. Nevertheless, we're sure The Weeknd is more than capable of bringing that electric energy we're so used to between the second and third quarters.",
    "To make sure you don't miss a minute of the spectacle, we've put together a handy guide to watch the Super Bowl halftime show online from anywhere.",
    "Read more:"
  ],
  "headers": {
    "4": "5. Super Bowl LIV halftime show: crowd surfing and feather flags from Shakira and JLo",
    "6": "4. Super Bowl XXX halftime show: Diana Ross has lift off",
    "8": "3. Super Bowl XXXV halftime show: the best of 2001 come to party",
    "11": "2. Super Bowl XLVII halftime show: Beyonce brings out the single ladies",
    "13": "1. Super Bowl XLI halftime show: Prince's Purple Rain",
    "15": "Who is performing at the Super Bowl 2021 halftime show?"
  },
  "links": {
    "Super Bowl": "https://www.techradar.com/news/watch-super-bowl-live-stream-2021-free-online",
    "Super Bowl halftime": "https://www.techradar.com/news/how-to-watch-2021-halftime-show-live-stream",
    "watch the Super Bowl halftime show online": "https://www.techradar.com/news/how-to-watch-2021-halftime-show-live-stream"
  }
}