{
  "source": "https://www.techradar.com/news/new-samsung-galaxy-book-pro-laptops-may-include-oled-screens-and-s-pen-support",
  "title": "New Samsung Galaxy Book Pro laptops may include some exciting features",
  "category": "computing",
  "updated": "2021-12-03T08:17:13Z",
  "author": "axel-metz",
  "summary": "Including 5G connectivity",
  "article": [
    "Samsung is working on two Galaxy Book Pro laptops – the Galaxy Book Pro and Galaxy Book Pro 360 – which will both feature OLED displays and be compatible with the company’s S Pen stylus, rumours suggest.",
    "The news comes from a SamMobile report which hints that Samsung has received certification from Bluetooth SIG for two new high-end laptops, in addition to those already announced in its 2021 laptop lineup a few weeks ago.",
    "The report also suggests the upcoming Galaxy Book Pro will be available in a 4G LTE variant, and the Galaxy Book Pro 360 will come available with 5G connectivity – much like the Samsung Galaxy Book Flex, released in 2020 as the company’s first 5G laptop.",
    "Few details have surfaced regarding the specs of the new laptops, but the names suggest the former will adopt a traditional laptop form while the latter could be a 2-in-1 laptop with a 360-degree hinge to allow its screen to be flipped around and used like a tablet.",
    "Given the devices will reportedly be available with 13.3-inch and 15.6-inch screens, it seems unlikely that they’ll use the 14-inch 90Hz OLED displays that Samsung Display said it would be mass manufacturing in 2021 – unless, of course, the company is keeping other size variations under wraps. In any case, expect them to arrive with high resolution displays and a speedy refresh rate.",
    "It’s worth noting that the Galaxy Book Pro and Galaxy Book Pro 360 wouldn’t be the first Samsung laptops to support the S Pen.",
    "The Samsung Galaxy Book Flex came equipped with a stylus included in its design, but with the announcement of a new S Pen alongside the Galaxy S21 Ultra (as well as the S Pen Pro, which adds Bluetooth and air gesture support to the stylus) we can expect these new laptops to be the first to be equipped with the latest and greatest stylus technology.",
    "Under the hood, the Galaxy Book Pro and Galaxy Book Pro 360 are rumoured to be powered by Intel Core i5 and i7 CPUs – putting them on a par with others in the Galaxy Book series.",
    "Via The Verge"
  ],
  "headers": {
    "5": "The pen is mightier..."
  },
  "links": {
    "SamMobile report": "https://www.sammobile.com/news/samsung-working-galaxy-book-pro-360-leak/",
    "Samsung Galaxy Book Flex": "https://www.techradar.com/reviews/samsung-galaxy-book-flex-2020",
    "14-inch 90Hz OLED displays": "https://www.techradar.com/news/new-samsung-90hz-oled-laptops-might-be-the-next-blow-in-its-fight-against-the-macbook",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "The Verge": "https://www.theverge.com/2021/2/16/22285268/samsung-galaxy-book-pro-360-oled-screen-s-pen-support-windows-intel"
  }
}