{
  "source": "https://www.techradar.com/news/hold-up-the-app-that-lets-you-run-windows-31-on-your-ipad-is-being-removed",
  "title": "Hold up - the app that lets you run Windows 3.1 on your iPad is being removed",
  "category": "computing",
  "updated": "2021-07-23T10:24:55Z",
  "author": "daryl-baxter",
  "summary": "Catch it quick before it disappears",
  "article": [
    "In a blogpost, iDOS 2 developer Litchie has revealed it has received an email from Apple, recommending changes that restrict the app from running environments such as Windows 3.1. Instead of acquiescing to Apple’s demands, Litchie will be removing the app from the store soon.",
    "In our feature detailing how it felt to use Windows on an iPad Pro, we noticed just how well the operating system ran on the tablet, but if you want to try it out, you’re now going to have to move fast before iDOS 2 disappears forever for new users.",
    "We’ve been here before with iDOS; a version existed for years previously where you could install MS-DOS games and even Windows 95 freely before Apple got wind and sent a cease and desist request.",
    "However, as the app has been available for more than two years, it raises the question as to why now? Did it take recent media coverage for Apple to notice what the app could do, when it wasn’t even hiding the fact of its feature-set?",
    "The team received an email this week from Apple, stating that, “Upon re-evaluation, we found that your app is not in compliance with the App Store Review Guidelines. Specifically, we found your app is in violation of the following:",
    "Guideline 2.5.2 - Performance - Software Requirements",
    "During review, your app installed or launched executable code, which is not permitted on the App Store.”",
    "Since September 2020, the app was updated to enable file sharing, but it’s only now that Apple is recommending the feature be removed, which would render the app almost useless.",
    "Instead, iDOS 2 will be removed very soon, but the team notes that you should still be able to download it from your ‘Purchased’ list if you delete it in the future.",
    "We have reached out to Apple for further comment and will update this article when we hear back.",
    "As Litchie rightly notes, the file-sharing feature has been available on iDOS 2 since September, so it’s notable that it’s taken this amount of time for Apple to notice what the app is capable of.",
    "Adding to this, Litchie also stated that it sent an email in September, explicitly stating that the file-sharing feature was present.",
    "Whether the team on the App Store simply pressed ‘approved’ and didn’t attempt to run Windows 3.1 on their iPads, or they were aware, it’s still a shame that this feature is being removed, and in turn, the app.",
    "Having used Windows 3.1 on my iPad, it’s another app that’s fallen victim to the rules of emulation for the App Store. I would be surprised if there were any malicious means from using an operating system from 1993, but yet again it shows that perhaps the 2.5.2 guideline needs another look.",
    "Applications like this showcases preservation of retro software - of how the general public used computers from thirty years ago alongside the programs from that era, which are now mostly non-existent on our modern machines.",
    "It helps educate younger users about what once was, and how certain features and even user interfaces could be applied to the software of the present day. However, as it’s becoming harder and harder to use these legacy operating systems, it feels as though Apple and others are missing out on something great that can educate the programmers and designers of tomorrow.",
    "Via Litchie"
  ],
  "headers": {
    "4": "Why is it being removed?",
    "10": "Analysis: Preservation of old software is a problem"
  },
  "links": {
    "iDOS 2": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1151118105832337800&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fid918131840",
    "our feature": "https://www.techradar.com/news/yes-you-can-finally-run-windows-31-on-your-ipad-heres-how",
    "was updated": "https://litchie.com/2020/09/idos2-update",
    "Litchie": "https://litchie.com/2021/07/idos2-will-be-gone"
  }
}