{
  "source": "https://www.techradar.com/news/iphone-13-production-will-outpace-iphone-12-by-20-heres-why",
  "title": "iPhone 13 production will outpace iPhone 12 by 20% - here's why",
  "category": "phones",
  "updated": "2021-07-14T08:27:01Z",
  "author": "balakumar-k",
  "summary": "Apple plans to manufacture 90 million units",
  "article": [
    "Apple is said to be ramping up production of its new iPhone 13 ahead of an announcement in the next few months, and it seems the company is planning to have more stock than it did for the iPhone 12 series.",
    "Apple has reportedly asked its suppliers to build as many as 90 million iPhones, which is roughly a 20% increase from the 75 million units produced of the iPhone 12 models last year.",
    "While the technology iterations in this year's new iPhone are only likely to be incremental, Apple is hoping to ride the 5G phone demand wave and also the general relaxation in lockdown norms across the globe that will likely help increase sales.",
    "A report from Bloomberg said the the boost in production numbers is an effort from Apple to make the most out the sanctions imposed on Chinese smartphone maker Huawei, which is also hamstrung by supply-chain shortages.",
    "Apple has had to shift much of the assembling of the new iPhones back to China as its contract companies in India were hit hard by the Covid-19 second wave in the country.",
    "Foxconn is said to have walked away with the lion's share of the assembling contract. It is reportedly responsible for assembling all of Apple's premium model, the 6.7-inch iPhone 13 Pro Max.",
    "It is also contracted to assemble 60% of the smaller premium iPhone, the 6.1- inch iPhone 13 Pro and 68% of the 6.1-inch iPhone 13. Two other assemblers, Pegatron and Luxshare, are also in the mix when it comes to the contract supply of iPhone 13.",
    "The iPhone 13 devices are likely to come with faster 5G, improved optical zoom, new video recording capabilities and a bigger battery.",
    "At least one new version of the iPhone 13 series is likely to come fitted with low temperature polycrystalline oxide (LTPO) display screen. This can change the refresh rate according to the displayed content and it's similar to what we've seen in the Apple Watch 6.",
    "Smartphone brands like Samsung, OnePlus and Oppo already have LTPO screens on their flagship models. Reports have it that the iPhone 13 Pro will have a 120Hz display for the first time, just like the iPad Pro.",
    "The new iPhones with LTPO screen will use indium gallium zinc oxide (IGZO) technology to improve power efficiency and response speed. An upgraded system-on-chip, built around the same six cores as the current A14 chip, is also expected to be part of the new iPhones."
  ],
  "headers": {
    "7": "New iPhones: What are being rumoured?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-07-14/apple-seeks-up-to-20-increase-in-new-iphone-production-for-2021",
    "assembling of the new iPhones back to China": "https://www.techradar.com/news/apple-units-in-china-back-in-limelight-foxconn-handling-bulk-of-iphone-13-manufacture",
    "low temperature polycrystalline oxide (LTPO) display screen": "https://www.techradar.com/news/two-iphone-13-models-rumored-to-be-getting-ltpo-120hz-display-upgrades",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review"
  }
}