{
  "source": "https://www.techradar.com/news/lg-c1-series-hits-lowest-price-yet-in-amazons-latest-oled-tv-deals",
  "title": "LG C1 series hits lowest price yet in Amazon's latest OLED TV deals",
  "category": "televisions",
  "updated": "2021-08-16T11:39:26Z",
  "author": "alex-whitelock",
  "summary": "Great prices on our favorite OLED TV of 2021",
  "article": [
    "TechRadar's favorite 4K TV of 2021 is back down to its lowest ever price in this week's OLED TV deals at Amazon. Starting with the 48-inch model, you can pick up the excellent LG C1 series for as little as $1,296.99 (was $1,499) today.",
    "The 48-inch model in particular is being offered for a new record-low price, having generally hovered around the $1,390 mark previously. Similar discounts can also be found on the 55-inch ($1,496.99, was $1,799) and 65-inch models ($2,096.99, was $2499), although we've seen these prices crop up before on two separate occasions over the past few months.",
    "If you're really looking for something impressive, then you could also opt for the humungous 77-inch ($3,296.99) or even the 85-inch model ($5,499.99). Both these sizes have discounts reaching an astronomical $500 off the original MSRP and are record-lows respectively.",
    "While not exactly cheap TV deals by any stretch of the imagination, the LG C1 series is still a great choice if you're looking to balance top-end specs and features with a (relatively) reasonable price point. Don't get us wrong, these are serious TVs for discerning buyers, but the LG C1 OLED TV manages to come in at a fraction of the cost of some of the new 8K displays and is generally cheaper than similarly specced-out Sony displays.",
    "Outside the US or looking for something cheaper? See a roundup of the best TV deals in your region just below.",
    "Sitting at the very top of our guide to the best TV of 2021, the latest LG C1-series OLED TVs are essentially a tweaked version of last year's excellent LG CX series.",
    "While the overall design of the TV is similar (not a bad thing, trust us), there are several excellent upgrades that make it even better for 2021. A combination of the new Alpha a9 Gen 4K processor and four HDMI 2.1 ports makes these TVs much more suited to the latest generation of games consoles - a fact backed up by the inclusion of a new Game Optimiser menu too.",
    "Of course, these iterative improvements just refine an already excellent OLED TV. LG's excellent WebOS platform, Alexa and Google Assistant support, and support for nearly every top streaming platform make the LG C1 series great out the box, and as you'd expect, you're getting an incredible picture with full support for Dolby Vision and HDR at 4K/120Hz.",
    "Want to see what else is available this week? Check out our main OLED TV deals page for more."
  ],
  "headers": {
    "5": "Why you should consider the LG C1 OLED TV"
  },
  "links": {
    "as $1,296.99 (was $1,499)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLG-OLED55C1PUB-Alexa-Built-Smart%2Fdp%2FB08WFK81RH%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1871975863333564400-20",
    "$1,496.99, was $1,799": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLG-OLED55C1PUB-Alexa-Built-Smart%2Fdp%2FB08WFV7L3N%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1020141626634026500-20",
    "$2,096.99, was $2499": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLG-OLED55C1PUB-Alexa-Built-Smart%2Fdp%2FB08WG4HKKY%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9715746260943493000-20",
    "$3,296.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLG-OLED55C1PUB-Alexa-Built-Smart%2Fdp%2FB08WGFKSMW%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1962241007192381400-20",
    "$5,499.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLG-OLED55C1PUB-Alexa-Built-Smart%2Fdp%2FB08WG3243Z%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8762486978248667000-20",
    "cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales",
    "LG C1 OLED TV": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "best TV": "https://www.techradar.com/news/best-tv",
    "OLED TV deals": "https://www.techradar.com/deals/best-oled-tv-prices-deals"
  }
}