{
  "source": "https://www.techradar.com/news/theres-been-another-major-quantum-computing-breakthrough",
  "title": "There's been another huge quantum computing breakthrough",
  "category": "computing",
  "updated": "2021-09-09T16:08:13Z",
  "author": "mayank-sharma",
  "summary": "Researchers hope to create a large-scale quantum computers within a decade",
  "article": [
    "Researchers at Japan’s Riken Center for Emergent Matter Science have achieved a major step forward in increasing the scalability of quantum computers.",
    "Instead of simply incrementing the total qubits in a system, the researchers have demonstrated a triple-qubit, silicon-based quantum computing mechanism.",
    "Qubits, the quantum equivalent of the traditional computing bits, were previously only shown to work in entangled pairs. The new researcher however demonstrates that entanglement can actually be done with three qubits.",
    "“Two-qubit operation is good enough to perform fundamental logical calculations. But a three-qubit system is the minimum unit for scaling up and implementing error correction,” notes Seigo Tarucha, who led the team of Riken researchers.",
    "Reporting on the development, Tom’s Hardware explains that entanglement is the state in which qubits mirror each other perfectly, so much so that any change to one qubit is instantly replicated in the other.",
    "As of now, quantum computers work by entangling two distinct qubits, which reportedly is the secret sauce that helps them tackle complex workloads.",
    "To help comprehend the significance of the latest achievement, Tom’s Hardware equivate a qubit to a single core. This means that thanks to Riken’s researchers the maximum number of cores in a quantum computer has now been bumped from two cores to three, which theoretically paves way for building multiple triple-core quantum computing subdivisions, instead of dual-core ones.",
    "Of course, the work is still in its early stages, but Tarucha has plans to extend the research to pave the way for “a large-scale quantum computer within a decade.”",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "4": "Large-scale quantum computers"
  },
  "links": {
    "quantum computers": "https://www.techradar.com/news/ibm-becomes-first-to-demonstrate-advantage-of-quantum-computers-in-real-life-scenario",
    "incrementing the total qubits": "https://www.techradar.com/news/new-quantum-computing-breakthrough-may-be-key-to-large-scale-quantum-chips",
    "notes": "https://scitechdaily.com/quantum-computing-breakthrough-entanglement-of-three-spin-qubits-achieved-in-silicon/",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/quantum-computing-triple-qubit-entanglement-achieved"
  }
}