{
  "source": "https://www.techradar.com/news/windows-10-update-to-deliver-micro-tweaks-that-power-users-will-applaud",
  "title": "Windows 10 update to deliver micro-tweaks that power users will applaud",
  "category": "computing",
  "updated": "2021-03-18T11:15:47Z",
  "author": "joel-khalili",
  "summary": "Windows 10 will soon give you much more freedom with virtual desktops",
  "article": [
    "Microsoft is testing a handful of new features that will allow users to better optimize their virtual desktops on Windows 10.",
    "The virtual desktops option allows users to split their Windows 10 set-up into multiple distinct desktops, which is particularly useful if a single device is used for a number of different tasks. However, beyond the ability to rename each new desktop, there is currently little opportunity for customization.",
    "To remedy this issue, Microsoft will soon roll out a Windows 10 update that lets users select unique backgrounds for each desktop, as well organize them more easily using a drag-and-drop mechanism.",
    "These new options are already available to members of the early-access Insider program and, assuming no serious technical glitches are discovered, should arrive for the rest of us as part of a future Windows 10 update.",
    "While many Windows 10 users will never need to utilize the virtual desktops feature, the utility can be extremely handy for anyone that keeps many applications open at once or uses their machine for multiple distinct purposes (e.g. for personal use, work and gaming).",
    "In these scenarios, the ability to effectively segregate the different use cases limits clutter and helps the user identify specific resources more quickly.",
    "With a large number of people using a single device for work and personal use as a result of the pandemic, virtual desktops also provide a way of establishing clear boundaries, which has been a challenge for many over the past year.",
    "Although Windows 10 virtual desktops bring plenty to the table, the current version of the feature has a few foibles. Currently, it can be difficult to distinguish between each virtual desktop, which are separated only by the different applications open in each, and some users complain that the keyboard shortcuts are clunky and limiting.",
    "However, the ability to reorder and customize each desktop should at least address some of these concerns. The changes might appear insignificant, but aggregate time savings over the span of months and years could be considerable.",
    "Anyone desperate to get their hands on the new virtual desktop features in advance can sign up to the Windows Insider program. The Dev Channel, designed for the most technical users, offers access to all the most experimental features, but also suffers from some instability as a result.",
    "Via Bleeping Computer"
  ],
  "headers": {
    "4": "Windows 10 virtual desktops"
  },
  "links": {
    "virtual desktops": "https://www.techradar.com/best/virtual-desktop-services",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/microsoft/windows-10-to-let-you-further-customize-your-virtual-desktops/"
  }
}