{
  "source": "https://www.techradar.com/news/5g-phones-will-account-for-half-of-all-smartphone-revenue-by-2025",
  "title": "5G phones will account for half of all smartphone revenue by 2025",
  "category": "phones",
  "updated": "2021-08-16T13:09:22Z",
  "author": "steve-mccaskill",
  "summary": "5G demand will have financial benefit for manufacturers",
  "article": [
    "5G-compatible smartphones will account for more than half of all handset revenue by 2025, according to a report from Juniper Research that outlines the opportunities for manufacturers able to capitalize on demand.",
    "After an inevitable impact from the pandemic, smartphone sales are set to increase due to a combination of 5G and pent-up demand.",
    "Analysts say 5G handset revenue will increase from $108 billion this year to $337 billion over the next four years.",
    "Part of the reason behind the drive will be the greater availability of devices at lower price points, especially in emerging markets. It is thought that by 2025, Android smartphone prices will be 6% lower than their iOS counterparts, helping Android to dominate regions such as Latin America.",
    "The reverse is true in North America and Europe, where Apple will generate as much as 40% of all revenues, despite commanding a lower overall share of the market.",
    "In both these regions, however, the issue of smartphone saturation is a challenge that could be exacerbated by right to repair legislation. Analysts suggest that some users will be more eager to fix their old smartphone rather than purchase a new one, a trend that will impact shipments.",
    "Analysts suggest vendors should use the capabilities of 5G networks to make their devices more attractive to consumers. The speed, capacity and latency of 5G will be a boost to mobile cloud computing services that will enable smartphones to offload certain tasks and use resources for other processes.",
    "“The effect of these [right to repair] laws will not be felt initially, as consumers adopt 5G smartphones to leverage the high speeds and reduced latency of 5G networks,” said Adam Wears, research author. “Hardware vendors must use this opportunity to build out new device capabilities to encourage consumers to continue regularly upgrading and avoid churn to competitors.”"
  ],
  "headers": {
    "3": "5G smartphone sales"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}