{
  "source": "https://www.techradar.com/news/tips-for-improving-cybersecurity-in-the-cloud",
  "title": "Tips for improving cybersecurity in the cloud",
  "category": "computing",
  "updated": "2021-10-08T14:06:05Z",
  "author": "tristan-morgan",
  "summary": "5 tips to overcome risk for rewards in the cloud",
  "article": [
    "It’s clear to see that COVID-19 has been the driving force for enterprises to adopt the cloud in recent times. Although many enterprises were already well on their way to adopting cloud in early 2020, cloud adoption has accelerated at a much faster pace than previous years.",
    "What’s become clear now is that there is no going back. Despite the initial perception that Software-as-a-Service (SaaS) and collaboration applications were meant to be temporary stopgap measures during lockdowns, they have quickly become the norm for employees and customers. In fact, according to a recent ONS survey, 85 per cent of UK workers want to maintain a hybrid working approach.",
    "In the future, remote and hybrid work will only be done via the cloud because it alone offers the scalability, flexibility, simplified costs, and improved user experiences needed to deliver a secure, agile working environment For many, migrating to the cloud is an opportunity to reimagine business operations, innovate and even open new revenue streams, but these new approaches call for a cybersecurity rethink. The question is, how can organizations enhance the effectiveness of their risk management capabilities as they implement cloud strategies and begin to fully realize the potential benefits of this technology?",
    "Cloud security is different from securing the on-premises infrastructure. The combination of SaaS and Infrastructure as a Service (IaaS) as well as many hyperscalers being software defined, traditional enterprise security controls may not always translate. Organizations cannot simply replicate what they had before in the cloud.",
    "Whenever a business decides to make the move to the cloud, it is crucial for them to understand where the data will reside and how it will be managed. Over the past year, cloud computing has evolved into a complex ecosystem of employees, customers, partners, and providers, making visibility of this data more challenging. As a result, basic hygiene has unintentionally worsened for many businesses over the last year. By concentrating on the basics of cyber hygiene, via asset and inventory management, vulnerability management, and configuration management, businesses can better understand where their most valuable information is stored, who has access to it, and where vulnerabilities exist so that they can safeguard it properly.",
    "Working in the cloud can simplify some aspects of security, reducing and even essentially outsourcing some of the overall risk burden of an organization. However, vulnerabilities will always remain an unfortunate part of cybersecurity, so it's critical that an organization's security team has the necessary skills and expertise to understand how to create and maintain a secure cloud architecture.",
    "In the rapidly advancing technology sector, cloud providers tend to make changes or updates to their products on a regular basis. If a team lacks the right skills, this level of fluctuation, combined with the sheer number of security products and services, can be overwhelming to manage. While it is important for teams to be equipped with the correct skills and knowledge from the get-go, it's also imperative for businesses to offer ongoing education and training to the team so that any data issues may be avoided in the future.",
    "Putting workloads in the cloud isn't a one-click process. It has become increasingly important for businesses to be aware of potential risks once they've migrated. In this case, the challenge is to connect fragmented APIs, systems, and applications, and to see what's happening in real time.",
    "An important aspect of choosing a cloud provider is understanding what native monitoring capabilities they can provide. Cloud native controls provide a detailed view of activity and are useful for detecting suspicious activities. However, business owners should also conduct their own assessments, with the end user to the cloud, in order to identify any other potential vulnerabilities.",
    "Security services and capabilities on cloud platforms are continually improving. However, as technology continues to evolve, so do threats. It is essential that organizations adopt an ongoing risk-led improvement cycle, which translates into continuous updating and patching. Automation is the future of cloud security, however, there is still much work to be done to get there. For businesses to protect themselves in the meantime, they should consider a zero-trust strategy to guard against threats, assuming that every application is potentially malicious before verifying and trusting.",
    "A business can gain many benefits from moving to the cloud, but there can also be some pretty serious consequences if it's not done properly. Clearly, maintaining security isn't a job that can be dealt with by one organization alone given the volumes and rates of threats present daily. Businesses should seek support from external partners to bolster in-house capabilities - making sure that everything is done right the first time around. In order to navigate the constantly changing threat landscape and to avoid mistakes others have made, partnerships are the way forward as they are a tried and tested way to access knowledge about hyperscale services.",
    "A great benefit of cloud services is that the focus is less on the technology and more on the outcomes. Moving to the cloud may also pose some new risks - but businesses that make the move to the cloud today, and which place security at the foundation of the cloud strategy, will reap the greatest benefits in the digital age."
  ],
  "headers": {
    "3": "Why cyber hygiene matter, and how it differs",
    "5": "Starting with the right skills means ongoing education",
    "7": "Monitor and detect threats more effectively",
    "9": "Keep your guard up by adopting a zero-trust strategy",
    "10": "Don’t go at it alone"
  },
  "links": {
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "IaaS": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}