{
  "source": "https://www.techradar.com/news/whatsapp-business-users-will-soon-be-able-to-hide-from-needy-customers",
  "title": "WhatsApp Business users will soon be able to hide from needy customers",
  "category": "computing",
  "updated": "2021-06-28T10:25:12Z",
  "author": "sofia-wycislik-wilson",
  "summary": "WhatsApp beta lets businesses conceal their online status and 'last seen' information",
  "article": [
    "The ability to see someone's online status is an important element of any messaging app or service. It helps chat participants know whether someone is available to chat or not, and also helps to indicate if a message is likely to receive an immediate response.",
    "In the latest beta version of the WhatsApp Android app, companies are being given different treatment to the average user, with business users' online status hidden from view.",
    "In addition to not revealing whether a business account is online or not, the WhatsApp beta also hides \"last seen\" information. But this does not mean a business can hide its online status completely – at least not at the moment.",
    "The hiding of online statuses and \"last seen\" data is currently limited to the beta version of WhatsApp for Android. This information is still visible in both the iOS app and the web version of WhatsApp.",
    "It's hard to say whether WhatsApp is simply using Android as a testing ground for the feature before a wider rollout, but it is hard to imagine different information being available through different platforms in the long term.",
    "It's easy to understand why WhatsApp is playing around with this option for business accounts. Many companies use WhatsApp as a main source of contact for customers. This could be for customer support, enquiries and many other things, but it generates a huge number of messages. The problem with displaying a company's online status to people is that an immediate response may well be expected.",
    "While customer support staff may technically be online, it is entirely possible they are dealing with another customer, answering other queries, and are therefore not able to respond to everyone straight away. By removing the online status, WhatsApp has turned business account into more of a halfway house between email and instant messaging.",
    "A customer has no idea whether a company representative is online or not, and can therefore send a message without the hope or expectation of a reply within seconds. It helps to take the burden off companies and lowers customer expectations to a more realistic level.",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "Cloak of invisibility"
  },
  "links": {
    "messaging app": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "email": "https://www.techradar.com/news/best-email-provider",
    "WABetaInfo": "https://wabetainfo.com/the-online-status-is-hidden-for-whatsapp-business-accounts/"
  }
}