{
  "source": "https://www.techradar.com/news/disneys-upcoming-movie-release-strategy-is-confusing-heres-why",
  "title": "Disney’s upcoming movie release strategy is confusing",
  "category": "entertainment",
  "updated": "2021-05-14T15:13:18Z",
  "author": "tom-power",
  "summary": "Will Disney movies be released in theaters, on Disney Plus or both?",
  "article": [
    "Disney, like every other major studio, has been hit hard by the Covid-19 pandemic. With theater doors closed for over a year due to the virus, Disney has had to reshuffle its upcoming movie release schedule and, in some instances, launch films such as Raya and the Last Dragon on its Disney Plus streaming platform.",
    "As nations begin, or continue, to roll out their Covid vaccine programs, though, Disney is eyeing a return to theaters for many of its tentpole 2021 movies. Black Widow and Jungle Cruise will lead efforts to entice film fans back to theaters, while future releases like Shang-Chi and Free Guy should build on those potentially big box-office hitters.",
    "It seems strange, then, that Disney’s upcoming movie strategy doesn’t appear to be a coherent one.",
    "As reported by outlets including Variety, Disney plans to release Marvel Studios’ Shang-Chi and the Legend of the Ten Rings, plus the Ryan Reynolds-led video game movie Free Guy, exclusively in theaters.",
    "Both films will receive 45-day exclusivity windows when they arrive – Free Guy on August 13, and Shang-Chi on September 3 – before they’re made available on Video on Demand (VOD) services and Disney Plus.",
    "Jungle Cruise and Black Widow’s releases, however, differ from their counterparts. We already knew that Black Widow is getting a simultaneous release in theaters and on Disney Plus Premier Access on July 9, and Jungle Cruise is now following suit. As revealed by star Dwayne Johnson on Instagram, Jungle Cruise will also come to Disney Plus via Premier Access, as well as cinemas, when it arrives on July 30.",
    "Why are two Disney properties receiving simultaneous releases but the others aren’t? In Disney’s recent Q2 earnings call, CEO Bob Chapek explained that the studio would be watching “the evolution of the recovery of the theatrical marketplace” before deciding what movies would receive dual releases on Disney Plus and in theaters.",
    "Per The Direct, Chapek said: “One of the things that [Premier Access] gives us right now, and we're grateful for, [is] the ability to go ahead and try to release things into the market. But, at the same time, [we] know that for those consumers that are a little leery still about going into a packed theater, they can go ahead and watch it in the safety and convenience of their home.”",
    "Disney’s desire to give Free Guy and Shang-Chi exclusive theatrical ones is understandable. Both films will be released in three and four months respectively, and the studio is clearly hoping that movie fans will be confident enough to return to cinemas by that point.",
    "Still, it’s strange that Disney is being selective about which of its movies it’ll release solely in theaters, and those that’ll come to Disney Plus, Premier Access or otherwise.",
    "Free Guy, for example, arrives one month after Black Widow and just a fortnight after Jungle Cruise. Some moviegoers, who may be hesitant to step foot in a cinema now, might not consider a two-week window between Jungle Cruise and Free Guy to be enough time for them to feel confident about taking in a film on the big screen.",
    "Shang-Chi is slightly different in that it’ll launch two months after Black Widow. However, there’s no telling what the situation will be with the Covid pandemic in four months time. If more countries return to lockdown, theaters might have to close their doors again, which will prevent fans from watching Shang-Chi in cinemas. As a result, box office hauls for Disney’s upcoming slate would be hit hard.",
    "Chapek also told investors that “in terms of going beyond this fiscal year, we’ve not announced exactly what our strategy is going to be in terms of which titles will be theatrical plus Disney Premier Access, which will be direct to Disney Plus, or which ones will go to theaters.”",
    "While Disney needs to look ahead to plan for movie releases post-2021, it has to keep this year’s films in mind, too. Aside from the four movies mentioned above, Disney has big movies including The Last Duel, Eternals, West Side Story and Spider-Man: No Way Home coming before the year is out.",
    "Some of those may need simultaneous releases, so it stands to reason that any of its upcoming movies, up to October at the very least, should come to Disney Plus as well as theaters, even if viewers have to pay extra if they arrive via Premier Access.",
    "Sure, Chapek’s comments give Disney enough flexibility to alter its 2021 movie release calendar if the Covid pandemic’s situation changes significantly between now and August. As it stands now, though, Disney’s current strategy is a strange one. If it truly wants to help to keep film fans safe, simultaneous Disney Plus and theatrical releases should be its one and only blueprint for the foreseeable future."
  ],
  "headers": {
    "3": "Free Guy and Marvel’s Shang-Chi are getting exclusive theatrical releases",
    "8": "Analysis: Disney needs to change tack with its upcoming releases"
  },
  "links": {
    "Raya and the Last Dragon": "https://www.techradar.com/reviews/raya-and-the-last-dragon",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Shang-Chi": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "Variety": "https://variety.com/2021/film/news/disney-shang-chi-free-guy-45-day-window-1234972782/",
    "The Direct": "https://thedirect.com/article/disney-black-widow-disney-plus-franchise-releases"
  }
}