{
  "source": "https://www.techradar.com/news/a-colossal-comet-once-mistaken-for-a-dwarf-planet-is-headed-to-our-solar-system",
  "title": "A colossal comet once mistaken for a dwarf planet is headed to our solar system",
  "category": "appliances",
  "updated": "2021-10-01T20:54:09Z",
  "author": "john-loeffler",
  "summary": "Comet Bernardinelli-Bernstein is clipping past Saturn in 2031",
  "article": [
    "Scientists are getting a better look at Bernardinelli-Bernstein, the largest comet ever discovered, as it slowly makes its way back into the solar system after 3.5 million years.",
    "The comet, officially designated C/2014 UN271 and discovered in 2021 by Pedro Bernardinelli and Gary Bernstein, might be as big as 100 miles (160km) across, making it much larger any other comet we've discovered. In fact, when it was first discovered, the astronomers mistook it for a small dwarf planet or similar trans-Neptunian object.",
    "And even though some more recent observations suggest it might not be that large, it has already sprouted a tail, even as it is about as far away from the sun as Neptune, making it the farthest a comet has ever been seen to do so.",
    "As our colleagues over at LiveScience point out, the comet poses no threat to Earth, and its perihelion – its closest approach to the sun – will be at about 11 AU, or 11 times the distance of the Earth from our star. This will put it just outside Saturn's orbit when it makes its nearest approach in 2031.",
    "The comet is believed to have entered the inner solar system only once before, making it an especially \"young\" comet in that regard, since it still has so much of its icy material. \"It's very rare to see big comets basically because unless you're catching it in its first or second passage, most of its material would already be gone,\" Bernardinelli told Space.com.",
    "While there is literally no chance of this comet coming anywhere close to hitting Earth, we here at TechRadar like to play with calculators and who doesn't like a little doomsday scenario to start off month of October?",
    "We did a quick work up on the consequences of a Bernardinelli-Bernstein impact event with the Earth, and while these calculations should in no way be considered authoritative, here's what we found. Assuming a density of 0.6g per cubic centimeter (roughly that of the comet Hale-Bopp), a speed of about 53 km/s (typical for a comet), and an impact angle of about 75 degrees from horizontal (the comet's orbit is nearly perpendicular to the ecliptic), well, let's just say we would really be in for it here on planet Earth.",
    "The impact would release an energy equivalent to about 440 times the energy released during the K-T Impact Event that wiped out the dinosaurs 65 million years ago, which itself released about a 100-million-megaton blast that created firestorms across the entire planet.",
    "The impactor itself would leave behind a crater about 540 miles / 874 km across and just over 135 miles / 218 km deep, which is about 10 times deeper than the Earth's crust is thick.",
    "In every sense of the word, this comet would be an absolute planet killer if it hit Earth. Fortunately, it's not coming anywhere near us, so if you have a powerful amateur telescope at home (or can get one in the next decade), enjoy the show as Bernardinelli-Bernstein makes its comeback tour in 2031."
  ],
  "headers": {
    "5": "Analysis: What the heck, here's what would happen if it hit Earth!"
  },
  "links": {
    "LiveScience": "https://www.livescience.com/Bernardinelli-Bernstein-close-approach-2031",
    "Space.com": "https://www.space.com/giant-comet-bernardinelli-bernstein-discovery-size-activity",
    "play with calculators": "http://www.convertalot.com/asteroid_impact_calculator.html",
    "firestorms across the entire planet": "https://www.nbcnews.com/news/all/dinosaur-killing-asteroid-sparked-global-firestorm-flna1c9292606"
  }
}