{
  "source": "https://www.techradar.com/news/pubg-mobile-new-state-release-date-price-trailer-and-everything-we-know-so-far",
  "title": "PUBG New State release date, how to download and what you need to know",
  "category": "phones",
  "updated": "2021-11-11T16:27:21Z",
  "author": "axel-metz",
  "summary": "PUBG: New State has arrived",
  "article": [
    "PUBG: New State has finally arrived, ready to breathe new life into the battle royale frenzy of recent times – which has seen likes of Fortnite, Apex Legends and Warzone continue the gaming world's obsession with the last-man-standing mode.",
    "A mobile exclusive, PUBG: New State was revealed in February 2021 alongside a cryptic announcement trailer which, naturally, left fans eager to learn more about the survival shooter.",
    "How eager? Well, the game's developer, Krafton, revealed that over 50 million pre-registrations were processed on the Google Play Store in anticipation of its arrival on November 11, 2021.",
    "Now, though, it's finally here, and below, you'll find all you need to know about PUBG: New State, including information on its new maps, modes and features.",
    "Following Krafton's confirmation that PUBG: New State would launch on Android and iOS devices in late 2021, the game was subsequently released on November 11.",
    "One Android Police reporter was able to capture a whole hour of gameplay ahead of time, though (which you'll find here), so we already had a pretty good idea of how PUBG: New State would play.",
    "In terms of price, the game is be free-to-play. Like its predecessor, though, PUBG: New State is littered with purchasable in-game content like skins, weapons and future expansions.",
    "Here's how you can download for Android, and you can also down it on iPhone and iPad here.",
    "First off, it’s worth clarifying that PUBG: New State is not PUBG 2 (hence why we’re hesitant to call it a sequel). Rather, it’s a new battle royale game exclusive to Android and iOS, following the release of PUBG Mobile in 2018 and PUBG Mobile Lite in 2020, the latter of which has since been discontinued.",
    "The main difference to the original mobile-only game (and, for that matter, the console equivalent) is its futuristic setting: the game takes place in 2051 on a new map called Troi, and has appropriately advanced weapons and perks.",
    "PUBG: New State has added several new features to the existing battle royale formula that helped put the original game on the map, which we’ll detail below, but it still looks very much like the traditional PUBG experience we’ve come to know and love.",
    "Interestingly, the game was developed by PUBG Studios (the makers of the original PC hit) rather than Tencent, the team behind PUBG Mobile. In many ways, the mobile version of PUBG has eclipsed its bigger brother, particularly in terms of revenue (it was the highest grossing mobile game in May 2020), so it makes sense that the original creators of the game are placing more emphasis on its clearly-profitable mobile player-base.",
    "The first obvious departure from current PUBG titles, which are all set in the present day, is the new futuristic setting in PUBG: New State. Taking place in 2051 on a new map – an area called Troi – players can expect to navigate a sprawling town with a mix of suburban living and more natural areas.",
    "The map is 8 x 8, a similar size to Erangel and Miramar from the mainline PUBG game, and features plenty of locations for gamers to explore including a town hall, restaurants and a shopping mall. Here, you'll find details of the new map in full. You can also see a complete top-down view of the new environment here.",
    "Interestingly, the game also launched with three other maps, including the aforementioned fan-favorite Erangel, which has been “updated with futuristic twists” for New State, specifically.",
    "With this new futuristic setting comes a suitably-futuristic array of new gadgets, too. In both the trailer and gameplay reveal, we spotted drones that deliver loot, deployable combat shields – similar to those we've seen in Call of Duty: Mobile Season 3 – and shiny new weapons, alongside new vehicles including TRON-like bikes. You can also now customize weapons in-game, in a manner similar to Apex Legends’ dynamic modification mechanic.",
    "The developer also promised \"ultra-realistic graphics that push the limits of mobile gaming,\" and that claim holds up from gameplay we've seen and played so far.",
    "New State uses a state-of-the-art rendering technology to bring its mobile gaming experience on a level with the PC version of PUBG, employing features like global illumination, auto instancing and auto-exposure. The gunplay system, too, has been completely redesigned thanks to these new graphical enhancements – you can check it out in action via the tweet below.",
    "New State’s impressive graphics aren't limited to users of the latest mobile hardware, either. During a media showcase ahead of its November launch, Krafton confirmed that the game has been optimized to be enjoyed by the majority of players, hence its forgiving system requirements: iOS 13 or later on at least an iPhone 6S, and Android OS 6 on any Android device with at least 2GB RAM.",
    "Expect to see a buttery-smooth framerate, then, and a marked visual improvement over its mobile-based predecessor, which is particularly badly-optimized considering it’s designed for handheld devices.",
    "Suffice to say, if you're lucky enough to have a modern phone like the Samsung Galaxy S21 or iPhone 13, you'll be able to enjoy PUBG: New State with optimal settings.",
    "Even with all those superficial visual changes, though, the game still plays in much the same way as its popular battle royale siblings.",
    "Parachute. Scavenge. Survive. We'll see you on the battlefield."
  ],
  "headers": {
    "4": "PUBG Mobile New State release date and price",
    "8": "What is it?",
    "12": "What's new with New State?"
  },
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Warzone": "https://www.techradar.com/news/call-of-duty-warzone-season-3",
    "Android Police": "https://www.androidpolice.com/2021/06/12/pubg-new-state-enters-closed-alpha-testing-as-a-fresh-entry-in-the-series-heres-a-full-hour-of-gameplay/",
    "here": "https://twitter.com/PUBGNEWSTATE/status/1403520600996462599?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1403520600996462599%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.techradar.com%2F",
    "download for Android": "https://play.google.com/store/apps/details?id=com.pubg.newstate&hl=en_GB&gl=US",
    "iPhone and iPad here": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5509659825052221000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fpubg-new-state%2Fid1542727626",
    "PUBG Mobile": "https://www.techradar.com/news/pubg-mobile-season-18",
    "PUBG Mobile Lite": "https://www.techradar.com/news/pubg-mobile-lite",
    "of the new map in full": "https://www.youtube.com/watch?v=TDMtIEqDeDI",
    "drones": "https://www.techradar.com/news/best-drones",
    "Call of Duty: Mobile Season 3": "https://www.techradar.com/news/call-of-duty-mobile-season-5",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13"
  }
}