{
  "source": "https://www.techradar.com/news/intel-to-attack-amd-with-a-trio-of-8-core-tiger-lake-laptop-cpus-leak-suggests",
  "title": "Intel to attack AMD with a trio of 8-core Tiger Lake laptop CPUs, leak suggests",
  "category": "computing",
  "updated": "2021-02-15T10:59:49Z",
  "author": "darren-allan",
  "summary": "Going all-in with 8-core mobile chips",
  "article": [
    "Intel is apparently set to go big with 8-core processors with its next introductions for Tiger Lake mobile chips, with a rumor suggesting that there will be three 8-core CPUs delivered, and one fresh 6-core effort.",
    "The list of upcoming CPUs shared on Twitter by prolific hardware leaker @momomo_us shows that there’s a Core i9-11980HK (unlocked processor that can be overclocked), plus a Core i9-11900H and Core i7-11800H, all of which are loaded up with 8-cores.",
    "As you can see, the purported Core i5-11400H is also coming as a 6-core chip.",
    "When Intel first introduced its Tiger Lake processors for laptops, they topped out at quad-core products, but we know for sure that 8-core CPUs are in the pipeline, as Intel has already clarified this. Rumor has it that they will be here by the end of Q2, so by June in other words – with a possible Computex launch making sense (that show kicks off at the very start of June).",
    "Of course, as we pointed out when the launch date rumor surfaced, given the current situation around component supply chain disruption and coronavirus, even if Q2 is Intel’s intended schedule, that could change. In other words, treat yourself to an extra helping of salt with this particular bit of speculation.",
    "Further adding to the excitement around Intel’s next Tiger Lake mobile chips is that they’re expected to hit 5GHz, and that’s over multiple cores, not just a single-core boost. And with the flagship 11980HK facilitating overclocking too – laptop thermals and cooling allowing, of course – there are plenty of folks out there keenly anticipating what Intel may be bringing to the gaming notebook table here.",
    "Via VideoCardz"
  ],
  "headers": {
    "4": "Clocking up"
  },
  "links": {
    "Tiger Lake mobile chips": "https://www.techradar.com/news/intel-tiger-lake-announced-to-power-the-next-generation-of-laptops",
    "Intel has already clarified this": "https://www.techradar.com/news/intel-tiger-lake-laptops-will-get-8-core-cpus-to-take-on-amd-ryzen-4000",
    "when the launch date rumor surfaced": "https://www.techradar.com/news/intels-powerful-8-core-laptop-cpu-could-arrive-in-june-to-fight-back-against-ryzen-5000",
    "gaming notebook": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "VideoCardz": "https://videocardz.com/newz/intel-to-launch-three-8-core-11th-gen-core-tiger-lake-h-series-cpus"
  }
}