{
  "source": "https://www.techradar.com/news/want-to-play-amazons-new-world-be-prepared-to-wait-up-to-469-hours",
  "title": "Want to play Amazon's New World? Be prepared to wait up to 469 hours",
  "category": "gaming",
  "updated": "2021-09-28T15:44:28Z",
  "author": "rhys-wood",
  "summary": "Amazon's ambitious MMO faces insurmountable queue times",
  "article": [
    "Amazon Games' ambitious New World MMORPG (massively multiplayer online role-playing game) hasn't had the best launch day. The online-only title has now released worldwide after a troubled beta period and a delay. But even though New World is finally out, its troubles look to be far from over.",
    "As reported by Windows Central, New World has been plagued with much the same server queue issues that were present during the game's testing period, created by a mixture of low server capacities and a high count of players. As such, there simply isn't enough room on the servers to accommodate the influx of players wishing to play New World on day one.",
    "Players have registered their grievances across both Steam and Reddit, with many users reporting days-long wait times due to the current server cap of 2,000 players each.",
    "Looking at server stats from the image above, you can see that some users are waiting tens - if not hundreds - of hours just to get into New World. The Asia-Pacific region has been hit the hardest, with wait times pushing an absurdly high 469 hours on one server. That's 19 and a half days. European players could be facing similarly excruciating wait times, with one server registering an average wait time of 318 hours.",
    "While these numbers are truly astronomical for even an MMORPG, we don't expect wait times to literally be that high, and we imagine accessibility will smoothen as the weeks go by. However, in the meantime, such massive queues mean that most players wishing to access New World simply won't be able to.",
    "If you've taken one look at the queue times for New World on launch day, you might be wondering if there are better ways to spend your time. So what else can you do in roughly the same timeframe?",
    "You could take a vacation, for one, like this 19 day round-trip from San Francisco to New Zealand and the Cook Islands, which are supposed to be lovely around this time of year. You might even have managed to login to New World by the time you get back.",
    "But in all seriousness, we think it's fair to say that Amazon Games should have expected such a huge influx of players on the day of release, especially if the beta testing period for New World was anything to go by, which was similarly difficult to access for many players.",
    "While it's true that even the largest of server platforms can struggle under the pressure of tens of thousands of players, the developer could've done itself a favor by increasing the player cap per server. While this could have meant game performance would've taken a knock, at least more players would've been able to access the game they paid for.",
    "It's quite sad to say that New World may unfortunately go down as one of the most botched launches in gaming history, alongside the like of Diablo 3 and Anthem. You do remember Anthem, right?"
  ],
  "headers": {
    "5": "Analysis: what else can I do in 469 hours?"
  },
  "links": {
    "New World": "https://www.techradar.com/reviews/new-world",
    "Windows Central": "https://www.windowscentral.com/amazons-new-world-faces-long-launch-day-queue-times-heres-how-play",
    "days-long wait times": "https://www.reddit.com/r/newworldgame/comments/px13jc/2k_player_cap_is_absurd/",
    "19 day round-trip": "https://www.travelnation.co.uk/tours/tailor-made-holidays/san-francisco-nz-the-cook-islands-holiday",
    "Anthem": "https://www.techradar.com/reviews/anthem"
  }
}