{
  "source": "https://www.techradar.com/news/pelotons-woes-are-a-reminder-that-buying-a-treadmill-is-a-serious-commitment",
  "title": "Peloton is fixing its faulty treadmills, but can't say when they'll be back on sale",
  "category": "fitness",
  "updated": "2021-08-18T13:46:34Z",
  "author": "cat-ellis",
  "summary": "Treadmills are a serious purchase, and must be taken seriously",
  "article": [
    "Peloton has finally announced a fix for some of its treadmills, which were recalled earlier this year after reports of accidents and injuries to users, though they're not yet back on sale. It's news that will come as a huge relief to worried owners, but also a reminder that exercise equipment is a serious purchase, and not something that should be rushed into.",
    "As The Verge reports, owners of Peloton Tread machines (the company's lower-end model) can now request a visit from an engineer, who will visit their home to make an adjustment to the treadmill's touchscreen, which should prevent it loosening or falling off while you run.",
    "The company told TechRadar: \"Peloton has a repair for the Peloton Tread that has been validated by an independent third party and approved by the US Consumer Safety Commission. At this stage, we do not have additional information about when the Peloton Tread will be back on sale in the UK.\"",
    "If you own a Peloton Tread, you should receive an email explaining how to book a free visit to fix your machine. Alternatively, you can contact the company through its support site – or request a full refund and arrange for your treadmill to be returned.",
    "The company has yet to announce how it's going to tackle its Tread+ machines, which have a much more serious design problem: a slatted belt with no guard rail, which can to pull clothing and objects underneath. In one case, this resulted in the death of a six-year-old child. It was a tragic accident, and a reminder that treadmills aren't just a big cash investment; they're powerful machines that have the potential to be dangerous.",
    "As gyms closed their doors during the height of the coronavirus pandemic, there was a huge surge in demand for home gym equipment, including exercise bikes, treadmills, cross trainers, and rowing machines. For example, sales of exercise bikes in the UK grew by over 2,000% between March and July 2020 according to market research company Statistica.",
    "These aren't purchases that anyone should rush into, though. Not only are these machines expensive, they're also heavy (usually requiring two people to move safely), with powerful motors, and need to be chosen wisely and treated with great care.",
    "Owners of Peloton's treadmills couldn't have foreseen the accidents that resulted from their design, but the product recall serves as a reminder of just how seriously home gym equipment should be taken.",
    "It's possible to grab a treadmill very cheaply on Amazon, or snap one up second-hand, but that could be a false economy. A cheap treadmill may be made using low-quality parts, and the components in a used treadmill may be worn out.",
    "It's important to make sure your home gym equipment comes with good after-sales service too, with good communication, knowledgeable engineers and replacement parts on hand. That can be tricky if you're buying a machine from an obscure company.",
    "If you're picking a machine up second-hand, bear in mind that the warranty may have expired, and the original documentation might have been lost. That goes for the manual, as well. Always read this before you use a treadmill, exercise bike, or other machine for the first time – and if you can't find it, check the manufacturer's site for a PDF, or drop them an email to request one.",
    "As Runner's World explains, it's important to minimize distractions when using home gym equipment, and make sure pets and children are well away. Good machines usually come with a safety key that has to be inserted before they will start, but it's also wise to keep the machine in a room that can be locked to make sure youngsters aren't able to turn it on.",
    "Maintenance is important, too. The treadmills, exercise bikes and cross-trainers at your local gym will be regularly checked and serviced to ensure they're safe to use, and you should do the same for your home machine. Again, the manufacturer will be able to advise you on the specifics, but typical tasks include tightening the pedals of an exercise bike, lubricating the underside of a treadmill belt, and checking any machine for signs of wear.",
    "You should also keep your equipment clean. Peloton recommends cleaning your machine after each workout by wiping the touchscreen with a microfiber cloth and approved electronic cleaner, and wiping all sweat off the frame with a damp cloth or gentle cleaners.",
    "It all adds up to a big commitment, but when you're dealing with a machine weighing over 200lb that's capable of generating up to four horsepower, you really can't be too careful."
  ],
  "headers": {
    "5": "Staying safe"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-recalls-all-treadmills-in-the-us-what-you-should-do",
    "recalled earlier this year": "https://www.techradar.com/news/peloton-recalls-all-treadmills-in-the-us-what-you-should-do",
    "The Verge": "https://www.theverge.com/2021/8/16/22627383/peloton-tread-recall-update-repair-fix-screen",
    "Peloton Tread": "https://www.techradar.com/reviews/peloton-tread",
    "through its support site": "https://support.onepeloton.com/",
    "resulted in the death of a six-year-old child": "https://www.bbc.co.uk/news/business-56451430",
    "Statistica": "https://www.statista.com/statistics/1190633/home-gym-equipment-sales/",
    "Runner's World": "https://www.runnersworld.com/gear/a20802637/stay-safe-on-the-treadmill/",
    "cleaning your machine after each workout": "https://support.onepeloton.com/hc/en-gb/articles/203326435-Caring-for-your-Bike"
  }
}