{
  "source": "https://www.techradar.com/news/iphone-14-pro-could-finally-ditch-the-notch",
  "title": "iPhone 14 Pro could finally ditch the notch",
  "category": "phones",
  "updated": "2021-09-08T16:05:20Z",
  "author": "james-rogerson",
  "summary": "A whole new look",
  "article": [
    "It’s been a long time coming, but Apple might finally remove the divisive notch with the iPhone 14 Pro and Pro Max, replacing it with a punch-hole camera – the same solution almost every Android phone has used for years now.",
    "That’s according to Jon Prosser, who shared some unofficial renders of what the iPhone 14 Pro Max will supposedly look like. It’s a surprising design, given that Face ID requires more than the one small lens shown here, but Prosser reckons the other components are hidden under the display.",
    "And it’s not just the lack of a notch that’s different here, the camera bump is also mostly gone, with the lenses sitting almost flush with the rear. This has apparently been achieved simply by making the iPhone 14 Pro Max thicker. Prosser doesn’t say exactly how thick, but he suggests it’s far thicker than the 7.4mm thick iPhone 12 Pro Max.",
    "You can also see a triple-lens camera along with a LiDAR scanner, much like the iPhone 12 Pro Max, a semi-glossy glass back (with the Apple logo sitting under the glass), round volume buttons (like the iPhone 4), and an apparently titanium chassis, in place of stainless steel.",
    "Finally, there’s still a Lightning port on the bottom. What you shouldn’t read into is the colors, as Prosser claims of those shown, the only one they’ve specifically heard could be coming is a rose gold one, and even that might not be final.",
    "It’s also worth noting that Prosser suspects only the Pro models will lack a notch, with the standard iPhone 14 still having one. However, he’s speculating there, as he doesn’t have any information on the standard models. We’d further suspect though that they probably won’t use titanium, since that’s a pricey material.",
    "We would however take all of this with a pinch of salt, as while Prosser is often right, he has also been wrong a number of times before. Besides which it’s very, very early for iPhone 14 rumors, and even if this is accurate, it could be subject to change.",
    "Apple hasn’t overhauled the iPhone range this significantly in many years, and it’s long overdue. Not only it the current design starting to feel boring, it also arguably looks a bit dated thanks to the large notch.",
    "Apple is rumored to be shrinking the notch for the iPhone 13 range, but that seems like a small step when most rival handsets have an all-screen design.",
    "So removing it for the iPhone 14 range (even if only the Pro models) will finally bring Apple’s phones in step with the competition.",
    "Beyond that, the other changes here also largely look positive – not everyone will want a thicker phone of course, but there’s a good chance that could also allow for a larger battery, which is something else we’ve been wanting for ages. So we really hope Prosser is right about this one."
  ],
  "headers": {
    "7": "Opinion: this is exactly what the iPhone needs"
  },
  "links": {
    "iPhone 14 Pro": "https://www.techradar.com/news/four-iphone-14-leaks-you-need-to-know-even-though-it-isnt-coming-until-2022",
    "Jon Prosser": "https://www.youtube.com/watch?v=42Ot6Y0gBzs",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13"
  }
}