{
  "source": "https://www.techradar.com/news/dandds-biggest-expansion-yet-is-coming-but-its-not-a-sourcebook",
  "title": "D&D's biggest expansion yet is coming – but it's not a new sourcebook",
  "category": "gaming",
  "updated": "2021-06-10T16:00:30Z",
  "author": "hamish-hector",
  "summary": "New Dungeons & Dragons translations are coming",
  "article": [
    "Dungeons & Dragons 5th Edition is getting a huge new expansion, but it’s not your typical sourcebook release. Today Wizards of the Coast announced that it will soon be localizing more of its content for players who speak French, Italian, German and Spanish in Europe and Latin America.",
    "Players whose first language is French, Italian, German, or Spanish have previously been able to buy versions of the Player’s Handbook, Dungeon Master’s Guide, and Monster Manual. From September 24th you’ll be able to purchase revised and updated versions of this core set and roughly every quarter newly localized books from the Dungeons & Dragons 5E back catalog will be made available. The pricing of the standard hardcover books is typically £40 / $50.",
    "Dungeons & Dragons had its biggest year yet in 2020, with more players than ever trying the game out. This new more global approach from Wizards of the Coast with localized content will hopefully give new people a chance to try out the hit tabletop RPG.",
    "Wizards of the Coast may be starting with its core Dungeons & Dragons 5E rule books, but it has promised it’ll be translating many of its others over the next few years. We don’t know exactly which books will come out right now nor when they’ll release, but we have some recommendations for ones you’ll want to be on the lookout for if they are localized to your region.",
    "These are more general suggestions to spice up any campaign, but you can also find specific sourcebooks to meet your desired adventure setting.",
    "The Core Rule Books If you don’t already have them, the Player’s Handbook, Dungeon Master’s Guide, and Monster Manual are essential for running and playing Dungeons & Dragons 5th Edition. They give players and Dungeon Masters (people who control the NPCs and run the adventures) everything they’ll need to play the game.",
    "Even if you’ve been able to find resources online, these books contain countless tips and suggestions that seriously help to enhance your campaigns.",
    "Xanther’s Guide to Everything Xanther’s Guide to Everything is a fantastic option for both players and Dungeon Masters to expand upon the core D&D ruleset. For players, it adds 25 new subclasses for you to play including the Circle of Dreams for the Druid and College of Glamour for Bards. There are also new spells and feats to choose from when you level up your character.",
    "Dungeon Masters will be able to take advantage of plenty of new tricks too including ideas for traps that your players might face and downtime activities to keep characters busy between main adventures. They're also helpful guides for understanding the place of magic items in your campaign and random encounter tables if you need to set up a fight on the fly.",
    "Tasha’s Cauldron of Everything It turns out Xanther didn’t quite know everything, as Tasha’s Cauldron has a few more secrets to spill. The main draw for players here is the custom race builds; if you’ve ever felt like an option from the classic game doesn’t quite fit your needs there are new rules for modifying race features or making your own from scratch. Want to be a halfling bodybuilder or an orc librarian? Now you can be.",
    "There aren’t as many tools specifically for dungeon masters as in Xanther’s Guide but if you’re wanting to improve your puzzles or to bring strange environments to life then there are some really helpful tools in here to help you out.",
    "Mythic Odysseys Of Theros The gods in Dungeons & Dragons can often feel pretty distant and abstract in the worlds that player’s characters will go on adventures. Mythic Odysseys Of Theros does a great job of demystifying pantheons, giving you suggestions on how to make your own gods and ways that worshipping a specific patron can grant benefits to players that aren’t playing Clerics or Paladins.",
    "This module takes inspiration from classic Greek legends and myths, but the ideas within can slot just as easily into any fantasy setting where the gods play a part.",
    "Hopefully, it won't take too long for Wizards of the Coast to localize its back catalog of content for French, German, Italian, and Spanish-speaking players. If you want to keep up to date on all the latest information about upcoming D&D releases in your region the company is expanding its Facebook and Twitter social media presence to keep you in the know."
  ],
  "headers": {
    "3": "Which D&D sourcebooks do we recommend?"
  },
  "links": {}
}