{
  "source": "https://www.techradar.com/news/lamborghini-has-a-special-800bhp-car-in-the-works-and-its-almost-certainly-a-hybrid",
  "title": "Lamborghini has a special, 800bhp car in the works... and it's almost certainly a hybrid",
  "category": "car-tech",
  "updated": "2021-08-10T15:59:03Z",
  "author": "chris-teague",
  "summary": "The return of the Countach",
  "article": [
    "Millions of today's most fervent car enthusiasts grew up starting at posters of unobtainable exotic cars on their bedroom walls. No other car embodies this phenomenon more than the Lamborghini Countach, a wedge-shaped, angular supercar produced from the early 1970s until 1990.",
    "Realizing this, the Italian automaker broke with its strong tradition of giving each new model a brand-new name by announcing that a new Countach is on its way.",
    "Adding even more suspense, the limited teaser images, videos, and social media posts appear to indicate the car will have a hybrid powertrain.",
    "Lamborghini released an official image of the car, though the entire body is covered with a sheet but shared no other details of the car's configuration. The hauntingly angular and wedge-like Countach shape is easily discernable, though.",
    "The teaser video is a little more revealing, but don't get your hopes up. There's hardly more here than flashing images of the original Countach and a boy hanging a poster on his wall. However, what is clear from the film is that the mystery car will carry the Countach name and that it's coming soon.",
    "Meanwhile, a leaked image spotted on Instagram (below) by Roadshow shows the new Countach won't carry the same naming convention as its legendary predecessor.",
    "It will instead feature a name more familiar to people who've followed Lambo's previous hybrid models. The upcoming Countach will wear the LPI name, which was seen before on Lamborghini's hybrid Asterion concept car.",
    "Short for Longitudinale Posteriore Ibrido, LPI means that the Countach will have a longitudinally oriented powerplant mounted in the middle of the vehicle with a hybrid system on board.",
    "The apparent full name, LPI 800-4, also indicates that the car will have 800 PS, or just shy of 800 horsepower, and four-wheel drive.",
    "If the Lamborghini name doesn't already make it clear, this won't be an everyday hybrid car. The automaker is expected to build the car in extremely limited quantities and to sell it at what will surely be a nearly unobtainable price.",
    "The good news is that we won't have to wait long to see the car, as Lamborghini will take the wraps off at the Monterey Car Week, which runs until August 15, 2021."
  ],
  "headers": {
    "5": "A hybrid with 800bhp?"
  },
  "links": {
    "spotted on Instagram": "https://www.instagram.com/p/CSWGtuUKGNv/",
    "Roadshow": "https://www.cnet.com/roadshow/news/lamborghini-countach-lpi-800-4-hybrid-hypercar-pebble-beach-teasers/"
  }
}