{
  "source": "https://www.techradar.com/news/oppo-find-x3-release-date-leaked-and-its-very-soon",
  "title": "Oppo Find X3 release date leaked, and it’s very soon",
  "category": "phones",
  "updated": "2021-02-23T09:55:57Z",
  "author": "james-rogerson",
  "summary": "March 11 might be the date",
  "article": [
    "The Oppo Find X3 range could feature some of the most exciting high-end phones of the year, and it’s almost here. We know that for sure as Oppo has already said the range is being unveiled in March, but we now also have a good idea of exactly what date.",
    "According to Jon Prosser (a leaker with a mixed but reasonable track record) the Oppo Find X3 Pro, Oppo Find X3 Lite, and Oppo Find X3 Neo are all being unveiled on March 11, which at the time of writing is only just over two weeks away.",
    "Following that you’ll apparently be able to pre-order them on March 31, and they’ll supposedly go on sale April 14. As ever with leaks, we’d take these dates with a pinch of salt, but there aren’t any conflicting rumors, so there’s a good chance these are accurate.",
    "You’ll notice that no phone just called the 'Oppo Find X3' was mentioned, and rumors suggest no such phone exists – though we’re not certain of that yet.",
    "In any case, the range should be worth looking forward to. Based on leaks, the flagship Oppo Find X3 Pro may have a quad-lens camera, with 50MP main, 50MP ultra-wide, and 13MP telephoto lenses, along with a 3MP macro one, which apparently offers 25x zoom so it can function almost like a microscope.",
    "The Find X3 Pro is also said to have a 6.7-inch curved 1440 x 3216 screen with a 120Hz refresh rate, a 4,500mAh battery, 65W charging, and a top-end Snapdragon 888 chipset. In other words, it sounds like it could give the Samsung Galaxy S21 range and the Xiaomi Mi 11 a run for their money.",
    "March could be a busy time for high-end phones though, with the Asus ROG Phone 5 set to be announced on March 10, and the Huawei P50 range probably landing later in the month.",
    "Via PocketLint"
  ],
  "headers": {},
  "links": {
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "being unveiled in March": "https://www.techradar.com/news/oppo-find-x3-launch-confirmed-for-march-ages-after-its-samsung-galaxy-s21-rival",
    "Jon Prosser": "https://twitter.com/jon_prosser/status/1363837056930041860",
    "no such phone exists": "https://www.techradar.com/news/oppo-find-x3-might-not-be-a-real-phone-at-least-not-with-that-name",
    "Based on leaks": "https://www.techradar.com/news/oppo-find-x3-pro-specs-leaked-in-full-revealing-a-microscope-camera",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Asus ROG Phone 5": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "PocketLint": "https://www.pocket-lint.com/phones/news/oppo/155820-oppo-find-x3-series-launch-date-and-pre-order-info-leak-out"
  }
}