{
  "source": "https://www.techradar.com/news/where-to-watch-tell-me-your-secrets",
  "title": "Where to watch Tell Me Your Secrets: stream every episode online",
  "category": "entertainment",
  "updated": "2021-03-22T10:53:09Z",
  "author": "nikshep-myle",
  "summary": "Get ready to immerse yourself in a dark thriller",
  "article": [
    "If tangled multi-layer thrillers are your thing, then you’ll want to watch Tell Me Your Secrets. The show was originally filmed for TNT in 2018, but in 2020, the channel chose not to air it. Amazon Prime then picked it up and aired it in 2021.",
    "This series sees the lives of three characters, each with a disturbed past, as they intertwine. You have Karen, whose serial killer boyfriend was arrested for the murder of nine women, but she claims to know nothing about it. Then there’s Mary, a distressed mother searching for her daughter, who was last seen with the serial killer before disappearing. The third character is a reformed rapist, John, whom Mary hires to search for her daughter. Sounds complicated enough?",
    "Filled with storylines and plot twists that’ll keep you on the edge, this show is likely to take you to dark places. Let’s take a look at where you can watch Tell Me Your Secrets.",
    "Tell Me Your Secrets is an Amazon Original, so it’s available exclusively on Amazon Prime Video. However, the show isn’t available across all regions. Amazon Prime users in the US, Canada, and Australia can access the show, but not users in the UK.",
    "If you find yourself abroad in a country but want to watch Amazon Prime as if you were at home, that's probably down to geo-blocking restrictions.",
    "Thankfully, help is at hand. Downloading a VPN will allow you to watch your favorite show no matter where you are, simply by changing your IP address to one that's back in your country of residence. Here's how to get started with this essential bit of streaming software.",
    "More from Amazon Prime Video:"
  ],
  "headers": {
    "3": "Where else can I watch I watch Tell Me Your Secrets online",
    "4": "How to watch Tell Me Your Secret online outside of your country"
  },
  "links": {
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FTell-Me-Your-Secrets-Season%2Fdp%2FB08TSW2P1Z%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1649875488437304600-20",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}