{
  "source": "https://www.techradar.com/news/heres-an-even-better-look-at-samsungs-leaked-bug-eyed-vr-headset",
  "title": "Here's an even better look at Samsung's leaked bug-eyed VR headset",
  "category": "gaming",
  "updated": "2021-01-11T16:16:42Z",
  "author": "axel-metz",
  "summary": "Is this what the future looks like?",
  "article": [
    "In 2020, plans for a new Samsung Odyssey VR headset – complete with giant orange bug-eyes – were leaked online (courtesy of LetsGoDigital). Now, the tech giant has been awarded patents for the device in Europe, which reveal further details about the way it looks, as well as giving a first look at a new controller to go along with it.",
    "The Samsung Odyssey HMD (head mounted display) was released back in 2017 as the first stand-alone mixed reality headset from the Korean manufacturer, and was followed swiftly by the Samsung Odyssey+ in 2018 – but neither device quite took off in the way Samsung had hoped.",
    "While rival products have gained popularity in the years since – the PlayStation VR and Oculus Quest 2 among them – the Odyssey hasn’t yet earned a new update, suggesting Samsung had canned the line or, as now seems more likely, decided to spend time developing a different design.",
    "The company had remained tight-lipped about a possible successor to the Odyssey+, before leaked documents from the Chinese patent office in 2020 pointed to a new Odyssey model on the horizon. The plans included two full-color product photos showing a new model with several updates on the Odyssey+, including a more robust headband with a top strap, two mounting points for the display and a sleeker design for the integrated headphones.",
    "But it was the front of the device that earned the biggest reaction. Seemingly drawing inspiration from insectoids’ faceted eyes, the bright orange frontal features mark a stark departure from the straighter, more boxy designs of other VR headsets (last-gen Odyssey included), and suggest wider viewing angles and a generally more comfortable experience for the user (VR headsets are notoriously unwieldy bits of kit).",
    "Now, new plans (also uncovered by LetsGoDigital) show the concept headset from more angles, revealing a stylish rear design and a genuinely ergonomic all-round look. The images also reveal smaller, more joystick-like controllers compared to the original accessories, with glossy silver toggles and a wider base. Put simply, it all looks a lot more Oculus than Odyssey – less the giant bug eyes – which can only be a good thing.",
    "Beyond these images, it’s still unclear what the device will be called or indeed when we can expect Samsung to announce something more official. Interestingly, the company registered a trademark for the name ‘Galaxy Space’ in October 2020 – could this be the name of their VR project? It’s all a little unclear at this stage. In any case, even if Samsung’s new VR tech falls victim to the issues of its predecessors, at least you’ll get to look like The Fly."
  ],
  "headers": {
    "4": "The Fly"
  },
  "links": {
    "Samsung Odyssey VR": "https://www.techradar.com/reviews/samsung-hmd-odyssey",
    "LetsGoDigital": "https://nl.letsgodigital.org/headsets/samsung-vr-ar-headset-controllers/",
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "look like The Fly": "https://www.youtube.com/watch?v=o1hJknuPW-M&ab_channel=CraigSteves"
  }
}