{
  "source": "https://www.techradar.com/news/channel-your-inner-beast-mode-with-the-rocks-sweat-proof-workout-headphones",
  "title": "Channel your inner beast mode with The Rock’s sweat-proof workout headphones",
  "category": "audio-visual",
  "updated": "2021-10-28T16:01:17Z",
  "author": "axel-metz",
  "summary": "Disclaimer: muscles not guaranteed",
  "article": [
    "Gym goers, listen up: The Rock has added to his fitness fashion line with a pair of workout-ready JBL headphones.",
    "Hollywood's highest paid actor has once again teamed up with Under Armor for the Project Rock Over-Ear Training cans, designed to be used in a busy gym environment and, obviously, to make you feel as powerful as the 270-pound former wrestler himself.",
    "But as well as simply being branded with the star’s Brahma Bull insignia, the headphones – which are essentially an updated version of a similar JBL model released back in 2018 – actually boast some pretty impressive audio features, too.",
    "For starters, they pack active noise-cancelling (ANC) tech and a 45-hour battery life. Most of the best noise-cancelling headphones in our buying guide don’t rock anywhere near that level of endurance, with most over-ear models – including our top pick, the Sony WH-1000XM4 – packing around 30 hours on a full charge.",
    "What’s more, Under Armour claims The Rock’s latest cans also sport a speed charging feature that allows users to get two hours of playback time in just five minutes. Again, that’s a faster charge time than most of the best headphones out there right now.",
    "Evidently, though, the Project Rock Over-Ear Training headphones are designed with fitness fanatics in mind, hence their IPX4 sweat-resistance rating, extra headband grip and washable supervent materials on their fast-drying ear cushions.",
    "Google Assistant and Amazon Alexa are also on hand should you find yourself needing to answer a call, change music track or double check how to safely perform a deadlift mid-workout.",
    "They’re not cheap, mind. At $299.95 / £232.00 (around AU$410), these running headphones are in a similar price category to those at the top of our buying guides – but at least you’ll feel like a beast, right?",
    "As if The Rock needed to line his pockets any further, the Hollywood A-lister’s latest headphones arrive in tandem with his Under Armour-branded running shoes and sweat-activated graphic T-shirts.",
    "The former are pretty self-explanatory – they’re foam-based workout trainers, basically – but the latter are blank vests and T-shirts that reveal motivational messages when exposed to moisture.",
    "Now, we’re no personal trainers, but we’re pretty sure we’d keep that novelty quiet if we were having a slow day in the gym.",
    "The entirety of The Rock’s new workout collection is available now at Under Armour’s official website."
  ],
  "headers": {
    "8": "Building his brand"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "running headphones": "https://www.techradar.com/best/best-running-headphones",
    "running shoes": "https://www.techradar.com/best/best-running-shoes",
    "Under Armour’s official website": "https://www.awin1.com/awclick.php?awinmid=15431&awinaffid=103504&clickref=trd-us-1372251002546790000&p=https%3A%2F%2Fwww.underarmour.com%2Fen-us%2Fc%2Fproject-rock%2F"
  }
}