{
  "source": "https://www.techradar.com/news/windows-11-has-a-clever-way-to-help-your-pc-run-faster",
  "title": "Windows 11 has a clever way to help your PC run faster",
  "category": "computing",
  "updated": "2021-09-09T10:22:10Z",
  "author": "darren-allan",
  "summary": "Opening commonly used apps will happen a lot more quickly",
  "article": [
    "Windows 11 is going to offer some serious performance improvements when it comes to opening commonly used apps.",
    "In a freshly made video promoting a few of the performance optimizations that Windows 11 benefits from, Microsoft’s Steve Dispensa, VP of Enterprise Management, concentrated on talking about how prioritized apps can fire up very quickly under the OS – even if the PC’s processor is bogged down with its workload.",
    "Dispensa explains that a lot of work has been done with under-the-hood memory management in Windows 11 to allow giving apps running in the foreground priority when it comes to calling on processor (and indeed all system) resources.",
    "So these prioritized apps will always (at least theoretically) launch very swiftly, and Dispensa demonstrates this with Excel and Word, opening both Office apps pretty much instantly even though the testbed system he’s using is running pretty stressed with 90% CPU usage.",
    "As he explains, normally with that kind of workload, opening anything under Windows would mean a bit of lag and a wait for the app to actually appear. With these foreground apps firing up at a very smart pace, even when the PC is under pressure, that saves you a few precious seconds here and there, which all adds up.",
    "Dispensa covers a few other ways in which Microsoft is promising better performance with Windows 11, including those who use Microsoft Edge getting the benefit of inactive browser tabs being slept so they don’t consume resources. This is a default setting, and one that makes sense given the considerable savings that can be made – Microsoft reckons a sleeping browser tab consumes 37% less in terms of CPU resources, and for laptops, that’ll add up to a battery life bonus as well.",
    "Further performance improvements include tweaks to make resuming from sleep around 25% more efficient, Dispensa claims, and speedier wake times should make things feel ‘almost instantaneous’ for ‘most’ users.",
    "This is clearly Microsoft making more of a case that Windows 11 isn’t just about looks and layout with the big redesign, but also that it offers genuine improvements to the likes of performance that’ll make a difference to users who make the switch.",
    "We’ve already heard about under-the-hood tweaks to get more mileage and performance from Intel’s incoming Alder Lake processors (which offer an innovative combination of performance and efficiency CPU cores), and this fresh demo from Microsoft is another example of a solid step forward.",
    "Having the system open apps almost instantly even when the processor is stressed is a definite boon, taking down the frustration level of having an overly taxed CPU by a notch or two. It’s also a pet hate of ours, and doubtless many folks, to have to wait for an app to load for longer than a second or two at most – so anything that minimizes this kind of behavior obviously can’t be a bad thing.",
    "In short, this move should help to solidify the overall perception of Windows 11 being a snappy and responsive OS in general – well, assuming it all pans out as per Microsoft’s brief demo here. Quicker resume from sleep times will perform the exact same trick, too.",
    "Via Windows Latest"
  ],
  "headers": {
    "7": "Analysis: Perception of Windows 11 as a snappy OS"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "looks": "https://www.techradar.com/news/lets-talk-about-the-great-wallpapers-in-windows-11",
    "big redesign": "https://www.techradar.com/news/its-official-the-gold-medal-winning-windows-11-feature-is",
    "under-the-hood tweaks to get more mileage": "https://www.techradar.com/news/windows-11-may-finally-be-worth-upgrading-to-thanks-to-intel",
    "Alder Lake": "https://www.techradar.com/news/intels-alder-lake-cpus-could-be-gaming-powerhouses-eventually",
    "Windows Latest": "https://www.windowslatest.com/2021/09/09/windows-11-could-make-your-pc-faster-thanks-to-these-clever-new-tricks/"
  }
}