{
  "source": "https://www.techradar.com/news/the-best-defensive-playbooks-in-madden-nfl-22",
  "title": "The best defensive playbooks in Madden NFL 22",
  "category": "gaming",
  "updated": "2021-08-20T16:50:52Z",
  "author": "justin-koreis",
  "summary": "The best options to help you shutdown opposing offenses",
  "article": [
    "Defense wins championships. That mantra has existed since the beginning of football, and it is just as applicable on the virtual field of Madden NFL 22 as it is in any football stadium. Scoring points does you no good if the other team has more. A great defensive scheme can lock down receivers, frustrate running backs, and set you up for game changing turnovers.",
    "Certain defensive playbooks in Madden NFL 22 have key advantages. Some possess unusual formations that confuse opponents. Others are extremely versatile, allowing you to take away what the other team does best. These five playbooks represent the best of each, and will put your players in the best position to succeed.",
    "The 46 defense is a generic playbook, but that doesn’t make it any less capable. This is the scheme that made the 1985 Bears the greatest NFL defense of all time. The 46 itself has three variations, with myriad blitz options that can be difficult to run against, and force rushed passes.",
    "Even better, the nickel options, which add an extra defensive back, feature Big Nickel. This brings in an extra safety, rather than cornerback. This extra player can cover passes like a running back, and stop the run like a linebacker. The 46 defense has a huge play selection out of big nickel. This is the perfect defense if you want to play primarily from one formation.",
    "Another callback to a bygone era of defense is the Pittsburgh Steel curtain. The modern version is built to be versatile. The 3-4 base defense is one of the best options as an every-down formation, allowing 3 defensive linemen to clog the middle of the field while linebackers fill gaps to stop the run, or break into coverage.",
    "Pittsburgh is also the only team in the league that has the 1-5-5 Double-A-Gap formation. This formation replaces two defensive linemen with linebackers. The added speed and coverage ability is great for confusing opponents, as it is never clear when one or more of the defenders on the line is going to rush the passer, or drop into coverage.",
    "No surprise that the defending champion Buccaneers, with their dominant defense, are one of the best in Madden as well. This scheme has both 3-4 and 4-4 base formations, as it is built around strong linebacker play. On obvious passing downs you can make the adjustment to \"spread\" your defense.",
    "Combine that with outside linebacker blitzes like OLB Strike 2 from the 3-4 even formation and opposing quarterbacks will be left with almost no time to get rid of the football. The Nickel 2-4-5 odd formation removes a lineman in favor of a linebacker, and can be another passing game wrecker.",
    "The Giants have been a mediocre team overall as of late, but that’s not the fault of their scheme. Their Even 6-1 formation is the ultimate \"stop the run at all costs\", with 6 bodies right on the line of scrimmage.",
    "They also feature nearly every nickel defensive option you could want, from Big Nickel, to 2-4-5 Double A Gap, to 3-3-5 odd. That last option features 3 linemen, 3 linebackers, and 5 defensive backs. It is perfect for players who like to control the middle of the field as a middle linebacker.",
    "This unassociated playbook is exactly what the name suggests, versatile and flexible. In particular, the 3-4 odd formation has Cover 4 drop Show 2. This looks like cover 2, which would have the back half of the field divided into two coverage zones, but is in fact cover 4, which instead has four deep coverage zones.",
    "That confusion is great for setting up deep interceptions. Meanwhile, the three linemen rushing the quarterback overwhelm the middle of the offensive line."
  ],
  "headers": {
    "2": "46 defense",
    "4": "Steelers",
    "6": "Tampa Bay",
    "8": "New York Giants",
    "10": "Multiple D Playbook"
  },
  "links": {}
}