{
  "source": "https://www.techradar.com/news/these-wired-earbuds-are-an-audiophiles-dream-but-theyll-cost-you",
  "title": "These wired earbuds are an audiophile's dream – but they'll cost you",
  "category": "audio-visual",
  "updated": "2021-06-29T01:18:42Z",
  "author": "olivia-tambini",
  "summary": "Astell & Kern has launched its latest in-ear headphones",
  "article": [
    "Astell & Kern has teamed up with Campfire Audio for its latest in-ear headphones – and with a host of audiophile specs, they should sound very good indeed.",
    "The AK Solaris X in-ear monitors feature custom-made balanced armature drivers and a dynamic driver hybrid system, which the company says will deliver music \"as the artist intended\".",
    "Those drivers work alongside Campfire Audio's proprietary Tuned Acoustic Expansion Chamber technology, which adjusts the volume of space in front of the driver to deliver \"unsurpassed clarity and a smooth, extended top end\".",
    "While the 10mm drivers are smaller than those seen in previous Astell & Kern earbuds, 'Polarity Tuned Chambers' are designed to use cavities around the drivers to draw out as much sound as possible, for deeper and more refined mid frequencies.",
    "As you might expect from an audiophile brand, a lot of attention has been given to the cables that come with these wired in-ear headphones.",
    "In the box, you get a balanced 2.5mm silver cable (along with a 3.5mm adapter), which is designed to provide \"the most transparent and extended sounds possible\". Meanwhile, a handmade cork carry case will help you keep your buds in excellent condition.",
    "So, how much will you need to fork out for the AK Solaris X in-ear monitors? Brace yourself: they'll be available from mid-July for $1,500 / £1,499 / AU$2,199.",
    "That high price isn't entirely surprising. After all, Astell & Kern is best known for its high-end MP3 players and portable DACs, which often come with high price tags themselves.",
    "In fact, one of the best portable music players you can buy is the Astell & Kern A&norma SR25, which comes with excellent support for hi-res audio files and Bluetooth LDAC wireless connectivity. This particular model will set you back $699 / £649 / AU$999.",
    "Saying that, there is a cheaper option available to audiophiles on a budget. The Astell & Kern AK USB-C DUAL DAC Cable allows you to connect your wired headphones to phones or devices without a 3.5mm audio port (like most modern smartphones, for example), as well as hopefully improving the sound of your music, and it costs $149 / £109 / AU$169."
  ],
  "headers": {
    "4": "Start saving"
  },
  "links": {
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "MP3 players": "https://www.techradar.com/news/best-mp3-players-techradars-guide-to-the-best-portable-music-players",
    "portable DACs": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "best portable music players": "https://www.techradar.com/news/best-mp3-players-techradars-guide-to-the-best-portable-music-players",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340"
  }
}