{
  "source": "https://www.techradar.com/news/the-kia-ev6-has-been-given-a-range-boost-before-its-even-left-the-factory",
  "title": "The Kia EV6 has been given a range boost before it's even left the factory",
  "category": "car-tech",
  "updated": "2021-10-13T13:52:43Z",
  "author": "john-mccann",
  "summary": "An extra 28km is better than nothing",
  "article": [
    "The Kia EV6 was first announced back in March 2021, and since the initial image reveal we've learned more about the firm's latest fully electric car - including its touted 510km (around 317 miles) of WLTP range. However, the EV6 will actually offer even more range when it rolls off the production line later this year.",
    "Kia has now confirmed that the EV6 will offer up to 528km (around 328 miles) of range - although realistically you won't get that much when it comes to day-to-day driving.",
    "It's also not a particularly big increase on the previously quoted range, but a boost is a boost. Plus, the additional 18km (roughly 11 miles) will certainly be welcomed - that's an extra trip or two to the shops before you need to plug in, for example.",
    "The improved range relates to the 77.4kWh battery in the RWD (rear-wheel drive) EV6 model, while the AWD (all-wheel drive) model with the same size power pack will offer up to 506km (around 314 miles).",
    "The Kia EV6 is already available to pre-order in a number of countries around the world with pricing starting at £40,895 (around $55,000 / AU$75,000). That's for the entry-level model however, than the EV6 price rises to £43,895 (around $59,000 / AU$80,000) for the GT-Line model.",
    "There will also be a pricier GT model (with 576bhp and a 3.5 second 0-60mph time), but the price for this range-topping option is yet to be announced, and it won't be available until October 2022.",
    "There's less of a wait for the Kia EV6 and EV6 GT-Line though, with the first cars expected to arrive with customers from October 2021 in European, with those in North America receiving the first shipment in January 2022."
  ],
  "headers": {
    "4": "How much, and when?"
  },
  "links": {
    "Kia EV6": "https://www.techradar.com/news/kia-ev6-first-drive",
    "first announced": "https://www.techradar.com/news/first-look-at-kias-new-electric-car-reveals-an-interior-built-for-the-future",
    "we've learned more": "https://www.techradar.com/news/kia-ev6-electric-car-beats-porsche-ferrari-and-lamborghini-in-drag-race"
  }
}