{
  "source": "https://www.techradar.com/news/zoom-clarifies-cloud-stance-as-it-pushes-for-billions-more-in-funding",
  "title": "Zoom clarifies cloud stance as it pushes for billions more in funding",
  "category": "computing",
  "updated": "2021-01-13T13:25:39Z",
  "author": "barclay-ballard",
  "summary": "Zoom is hoping to raise $1.75 billion in funding",
  "article": [
    "Digital collaboration tool Zoom has clarified who its favorite cloud provider really is as the firm looks to instigate a huge funding push. In a new preliminary prospectus, the company revealed that it hopes to raise $1.75 billion through a new stock offering and that it loves Oracle and AWS equally.",
    "Last year, Oracle initially asserted that it was Zoom’s cloud partner of choice, only for AWS to make a conflicting claim a few months later. In its prospectus, Zoom has sought to clear up any confusion by revealing that neither, or both if you’re of a positive disposition, is its preferred cloud partner.",
    "“We currently serve our users from various co-located data centers located throughout the world,” the prospectus reads. “We also utilize Amazon Web Services and Oracle Cloud for the hosting of certain critical aspects of our business, as well as Microsoft Azure for limited customer-specified managed services. As part of our distributed meeting architecture, we establish private links between data centers that automatically transfer data between various data centers in order to optimize performance on our platform.”",
    "Perhaps of more importance than the cloud one-upmanship, Zoom confirmed that it is looking to raise a significant sum of money in 2021. The fundraising push is being driven by the fact that a return to normality is on the horizon after the COVID-19 pandemic resulted in a huge increase in remote working and, as a consequence, the use of digital collaboration tools.",
    "Whether Zoom will be able to continue its expansion as employees start returning to the office is difficult to say at this point but the company is already warning that revenue growth is unlikely to be as impressive in 2021 as it was last year.",
    "All video collaboration tools, from Zoom to Microsoft Teams, are looking at an uncertain future. Zoom has also been hit by the fact that it didn’t make as much profit as might initially be expected due to the fact that it removed its free session limit for many users.",
    "Via The Register"
  ],
  "headers": {
    "3": "A funding push"
  },
  "links": {
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "a few months later": "https://www.techradar.com/news/zoom-dumps-oracle-cloud-services-in-favor-of-aws",
    "prospectus": "https://investors.zoom.us/static-files/1ec152be-c333-4431-a2e9-c79a6f6455a7",
    "The Register": "https://www.theregister.com/2021/01/13/zoom_prospectus_reveals_colo_infrastructure/"
  }
}