{
  "source": "https://www.techradar.com/news/philips-hue-vs-lifx-which-smart-lights-are-right-for-your-home",
  "title": "Philips Hue vs Lifx: which smart lights are right for your home?",
  "category": "smart-home",
  "updated": "2021-07-26T06:37:00.066Z",
  "author": "carrie-ann-skinner",
  "summary": "Is Philips Hue a better choice than LIFX for your smart lighting?",
  "article": [
    "The best smart lights are one of the easiest ways to automate your home - they can be controlled by your smartphone, even when you’re miles away, and allow you to pick from millions of different colors or tones of white light.",
    "So, it’s no surprise they’ve rocketed in popularity - according to market research firm Statista, the smart lighting market is projected to be worth $105.2bn by 2023 - up from ‘just’ $8.68 billion in 2018.",
    "Philips Hue and LIFX are two of the biggest names dominating the smart lighting market right now, and if you’re considering kitting your home out with smart light bulbs, it makes sense to plump for one of these brands.",
    "However, it can be hard to decide which is best suited to you - not only do the bulbs connect to the internet in different ways, some of the features they offer differ too. It really depends on the type of lighting effect you want to create in your home - do you need simplicity or are you thinking about a long-term project to really build smart lighting throughout your life?, as to which one of these smart lighting systems you choose.",
    "Read on to discover how these two smart lighting systems compare – or, if you’ve already decided which of the two you wish to buy, check out the best prices right now for these smart lights:",
    "Before we begin, let’s talk about light - specifically in terms of how much comes out.",
    "The brightness of LED bulbs is measured in lumens, unlike incandescent bulbs which are measured in watts. The higher the wattage, the brighter the light but the more energy an incandescent bulb used.",
    "However as LED bulbs are more power efficient, more wattage doesn’t necessarily equate to a brighter light. As a guide an 800 lumen LED bulb gives off the same amount of light as a 60w incandescent bulb, while to replace a 40w bulb with light of a similar brightness, look for an LED option that offers 450 lumens.",
    "Both Philips Hue and LIFX offer plenty of choice for your smart lighting needs, so there’s sure to be a type of bulb or creative lighting option for all rooms in your home.",
    "Let’s start with Philips Hue: the brand offers a range of smart LED light bulbs designed to replace your existing bulbs, along with LED table and floor lamps, wall lights both for inside and outdoors, ceiling pendants, lightstrips and light bars, along with accessories such as motion sensors, dimmer switches and even a smart plug. In terms of brightness, Philips Hue bulbs and lights range from 500 to 1,600 lumens depending upon the particular model chosen.",
    "Initially, Philips Hue lighting needed the Philips Hue Bridge for everything smart. This hub relayed commands from your smartphone to the cloud and back to the bulbs so they could be controlled even when you weren’t at home, as the bulbs didn’t have Wi-Fi built into them.",
    "Now Philips has added Bluetooth to it’s smart light bulbs so if you’re in the same room as your Hue bulbs, you don’t need a Hue Bridge and can use the built-in Bluetooth instead, making the setup cost cheaper.",
    "However, you’ll still need a Bridge if you want to control lights in more than one room at a time, use accessories such as motion sensors to trigger the lights automatically or activate voice control, which might irritate when rivals like the LIFX don’t need that extra step.",
    "That said, the Philips Bridge creates a mesh network to connect the bulbs to the inter, which means they should suffer from less connectivity problems than bulbs like LIFX that connect directly to the Wi-Fi network - as those that are far away from the router may struggle to stay connected, and can’t be controlled when they have no internet access.",
    "Philips Hue smart light bulbs come in both Edison screw fitting (E27) and Bayonet fitting (B22) and are available in three color options. White is a static 2,700K (a unit of color temperature called Kelvins), fairly-warm light that can’t be tweaked, while White Ambiance allows you to adjust the shade of white the bulb illuminates, from 2200 K (a warm, bright white) to 6500 K (a cool clinical type glow).",
    "Alternatively, Philips Hue lighting also comes in the Color and White Ambiance option, which as well as the different hues of white, also offers 16 million different colors to choose from too.",
    "LIFX also offers smart lights designed to replace your existing bulbs but lacks the range of side and table lamps, as well as wall and ceiling lights offered by Hue. LIFX’s smart lighting uses Wi-Fi so there’s no need for a bridge or Hub to control it when you’re not at home, as it connects directly to your home network. But, as we’ve already mentioned, this can mean that bulbs positioned further away from the router struggle to remain connected.",
    "There are also three different options when it comes to the colors offered; White is a warm hue of 2,700K that can’t be tweaked, White to Warm can be tuned from 1,500K (a really warm amber hue) to 9,000K (a shade so cool, it’s almost blue). There’s also Color, which offers 550 billion shades. While this is more than Philips Hue, it’s worth noting that it's not a larger spectrum, there’s just a clearer difference between each of the shades - and means LIFX bulbs offer greater versatility when it comes to selecting a specific shade.",
    "What about the top sellers? Well, LIFX A19, which is known as A60 in the UK and Australia, comes in both E27 and B22 fittings and offers 1100 lumens.",
    "These bulbs are 4.5 inches / 11.5 cm tall compared to non-smart light bulbs which are around 3.9 inches / 10 cm - meaning LIFX bulbs may protrude from lamp shades or side lamps.",
    "There’s also a Nightvision version of the A19/A60 that enhances the night vision of the best home security cameras through infrared light and LIFX Clean, which can disinfect surfaces and items through High Energy Visible (HEV) light that isn’t harmful to humans and pets, unlike UV light, as well as acting as a stand smart light bulb.",
    "For side lamps, LIFX also offers more compact light bulbs at 2.4 inches/ 6cm high that are 800 lumens, in both E27 or B22 fittings, known as Color, White to Warm, and White.",
    "There’s also LIFX Candle, which are candle-shaped bulbs in Color and White to Warm, along with lightsrips in 1m and 2m lengths, as well as a 1m extension pack. Finally, LIFX Beam is the brand's own take on smart light wall art.",
    "In our eyes, the Philip Hue range makes it easy to install smart lighting in all rooms in your home, no matter what your decor is like. If you have lamp shades and side lights that you love, you can simply replace your existing bulbs with smart versions, while Hue also has a range of stylish wall, ceiling, and side lamps that are already smart. This makes it easy to redecorate without worrying that you’ll need to purchase new bulbs if the lights you choose use a different fitting to the smart bulbs you currently own.",
    "However, if you’re looking to dip your toe in the smart lighting water, the LIFX bulbs are the simplest to set-up, as there’s no fiddling with your router involved.",
    "So just how much will you have to spend if you want to automate the lighting in your home? Philips Hue is slightly more expensive than LIFX when it comes to the price of the smart light bulbs, but the bulbs are more reliable and they offer some features that LIFX doesn’t, which in our eyes makes them worth the extra investment.",
    "Philips Hue White bulbs are priced $14.99 / £14.99 / AU$34.95, while the White Ambiance single bulbs will set you back $24.99 / £24.99 / AU$54.95. The colored versions are priced at $49.99 / £49.99 / AU$99.95. Starter kits, which come with two bulbs and a bridge, cost $69.99 / £119.99 / AU$159.99 for the white version and $119.99 / £129.99 / AU$179.99 for the color options.",
    "Side lamps are priced from $69.99 / £69.99 / AU$164.95 while wall lamps will set you back from $64.99 / £64.99 / AU$164.95. Lightstrips cost from $69.99 / £69.99 / AU$134.95.",
    "Whereas LIFX bulbs start from $9.99 / £14.99 / AU$29.99 for a non-tuneable white option and rise to $34.99 / £34.99 / AU$59.99 for the color version. The A19/A60 smart light bulbs are priced at $49.99 / £54.99 / AU$69.99, while lightstrips cost from $69.99 / £64.99 / AU$99.99 and LIFX Beam is priced at $149.99 / £179.99 / AU$249.99",
    "When it comes to what you can do with these smart lighting systems; both Philips Hue and LIFX are evenly matched on the most basic functions. Both the Philips Hue bulls and the LIFX smart lights we tested responded instantly when we switched them on and off from the relevant smartphone app, as well as when adjusted the brightness or changed the color they illuminated.",
    "You can also create groups of lights that can be controlled at the same time; in the case of Philips Hue that’s 10 lights or 50 lights if you’re using a Philips Hue Bridge. LIFX also allows up to 50 lights to be grouped together in one go.",
    "On test, we found both apps easy to use and integration with Amazon Alexa, Google Assistant and HomeKit means no matter which voice assistant you’re using in your smart home, the smart lights will integrate easily allowing you to use your voice or the smartphone app to control them.",
    "However, each has some features the other doesn’t offer - Philips Hue lights can be synced with the image playing on your TV, although this does require an additional sync box, which is priced at $229 / £229 / AU$499 There’s also a multi-user geofencing, so the app will check to see if others are home first before activating location-based automations. This is joined by stacks of customizable scheduling options - for example you can set outdoor lights to come on at sunset but go off at 2am, rather than waiting for sunrise. Finally Hue Labs provides access to features created by third-parties for the Hue lighting system.",
    "LIFX also offers some third-party apps that can expand what you can do with the smart lights, but the volume can’t match what Philips Hue offers. However, there are some effects in the apps that can be applied to your lights to make them pulse in time to music, or flicker like a real candle would.",
    "Both Philips Hue and LIFX are effective and easy to use smart lighting systems. Philips Hue has a more rounded offering when it comes to the type of smart lights available, and offers a more stable internet connection, as well as far more customizability when it comes to home automations. For those looking at really making the most of smart lighting, these are the bulbs to opt for.",
    "Meanwhile, LIFX is the slightly more affordable option, and is more simplistic to set-up as it doesn’t require a bridge, and offers more choice when it comes to tweaking the color or shade of white the bulb illuminates, which is all many new smart-light lovers will be after."
  ],
  "headers": {
    "4": "Best Philips Hue and LIFX deals",
    "5": "Range",
    "25": "Price",
    "29": "Features",
    "34": "Verdict"
  },
  "links": {
    "best smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "Statista": "https://www.statista.com/statistics/813066/world-smart-lighting-market-revenue/",
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "LIFX": "https://www.techradar.com/reviews/lifx-smart-light-a19a60",
    "lightstrips": "https://www.techradar.com/reviews/philips-hue-lightstrip-plus",
    "smart plug": "https://www.techradar.com/news/best-smart-plugs-and-switches",
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "LIFX Beam": "https://www.techradar.com/reviews/lifx-beam-review"
  }
}