{
  "source": "https://www.techradar.com/news/biden-administration-appoints-its-white-house-ciso",
  "title": "Biden administration appoints its White House CISO",
  "category": "computing",
  "updated": "2021-01-27T14:30:42Z",
  "author": "barclay-ballard",
  "summary": "The new US President has appointed a familiar face",
  "article": [
    "US President Joe Biden has appointed a new federal CISO, selecting a former White House cybersecurity official that served in the Obama administration. Biden has turned to Chris DeRusha, who also worked as the top cybersecurity official during his presidential election campaign.",
    "In his new role, DeRusha will be tasked with coordinating federal cybersecurity policy and prompting government agencies to improve their digital safeguards. He will be able to draw from a wealth of experience, having previously worked as a security executive at Ford, in addition to his many years of service at the White House.",
    "Biden will have been pleased to avoid any election meddling of the kind that blighted Hilary Clinton’s unsuccessful presidential campaign in 2016. Although Biden’s campaign did encounter attempted interference from Chinese hackers, this was reportedly unsuccessful. The fact the Democratic campaign did not experience any public security incidents would certainly have counted in DeRusha’s favor when Biden was looking for a new federal CISO.",
    "One of the most pressing issues that DeRusha will be faced with is the ongoing fallout from the SolarWinds hack, which affected several government agencies. DeRusha will undoubtedly want to investigate how the breach occurred but may also be considering retaliatory attacks against Russian government entities.",
    "DeRusha will likely work closely alongside the newly created national cyber director position, which remains unfilled. That role is likely to be broader in scope and will look at coordinating the safeguards against cyberattacks in place at both public and private sector organizations.",
    "Biden will certainly be busy as he starts his presidency, and appointing new members of his White House team will be high on the list. Similarly, strengthening the country’s cybersecurity defenses must also be a priority.",
    "Via CyberScoop"
  ],
  "headers": {
    "3": "New team"
  },
  "links": {
    "retaliatory attacks": "https://www.techradar.com/news/russia-is-expecting-payback-cyberattacks-following-solarwinds-hack",
    "CyberScoop": "https://www.cyberscoop.com/chris-derusha-federal-ciso-biden/"
  }
}