{
  "source": "https://www.techradar.com/news/where-is-the-pride-in-gaming",
  "title": "Where is the Pride in gaming?",
  "category": "gaming",
  "updated": "2021-01-21T10:00:45Z",
  "author": "hamish-hector",
  "summary": "Opinion: with Pride canceled, games should have stepped up",
  "article": [
    "It was easier than ever to feel alone in 2020. When Covid-19 restrictions first began sweeping through nations, a widespread sense of isolation began to creep in too. Online interaction, especially through gaming, stepped up to fill in this void for many of us, but long-existing failures in representation left efforts lacking in areas. For the LGBTQ+ community, it was another year without widespread virtual Pride celebrations – and this time there were no real-life parades to soften the blow.",
    "Pride is about more than just filling streets with color and noise. It’s about spreading awareness that LGBTQ+ identities exist and are valid; that people do not deserve to be treated like they’re lesser for being who they are. Pride also offers an opportunity for people to share their stories and experiences so that newer members can feel like they’re part of a larger community, one that accepts them where others might not. Pride is awesome, so why is it missing from video games – especially at this time, when coming together is more important than ever?",
    "Games already feature LGBTQ+ themes and characters. The Last of Us: Part II, which won the 2020 Game Award for Game of The Year, has a lesbian lead character in Ellie, and Tell Me Why has been highly praised for its transgender representation through its protagonist Tyler. While these stories and others will do their part to raise awareness of LGBTQ+ identities, and the struggles people in the community can face, unfortunately they will never capture the full effect of Pride.",
    "Pride is inherently a social occasion. It’s a gathering or a march that sees people come together, whereas single-player games like those above are by definition solitary experiences.",
    "Other video games, which do include a multiplayer aspect, have faltered by keeping their LGBTQ+ characters effectively in the closet. Overwatch’s Tracer and Soldier 76 may be canonically queer, but unless you’ve read the Overwatch comics you’d never have known. Pride is an in-your-face blast of “We are here, notice us!” It’s about giving under-acknowledged voices a megaphone to let their struggles be heard. While Pride is also an opportunity to openly acknowledge and highlight the history of LGBTQ+ discrimination, it’s a chance to celebrate!",
    "Pride was born from protest. On June 28 1969, police raided the Stonewall Inn at 51-53 Christopher Street in New York’s Greenwich Village. At the time this was a regular occurrence for the city’s gay bars, but the events that followed broke from tradition.",
    "The raid itself was instantly unusual. It occurred at 1:20am, much later in the night than normal, and the Stonewall staff were not forewarned, as they often were at the time. This meant that the party was in full swing for the roughly 200 LGBTQ+ patrons when police announced their presence. Fear at the prospect of arrest or of being outed to their families, and anger following years of oppression, bubbled over, and violent clashes broke out between patrons and police. They would continue over the coming days, with roughly 1,000 LGBTQ+ people showing up to protest on June 29.",
    "The Stonewall Uprising wasn’t the first instance of LGBTQ+ activism, nor its last, but it did mark a major shift in how the queer community responded to intolerance. As Sylvia Rivera, a self-identified street queen from the time, put it: “You've been treating us like sh*t all these years? Uh-uh. Now it's our turn!”",
    "Exactly a year later, fuelled by the fire that Stonewall sparked, the first Pride marches occurred. In November 1969, a resolution had been passed at the Eastern Regional Conference of Homophile Organizations for an annual Christopher Street Liberation Day demonstration to be held. So, on June 28 1970, the LGBTQ+ community once again took to Christopher Street and marched to Central Park, carrying banners and signs to make their presence known. At the same time, marches were also held in Los Angeles and Chicago, becoming what some would call the first Pride marches in US history.",
    "Over the coming years the marches would continue, and more cities across America and the world began to host their own events. As the movement grew, the Stonewall Uprising commemoration marches evolved to appeal to a wider audience. The Gay Liberation Parades and Gay Freedom Parades changed their names to Gay Pride Parades, and the single-day events expanded to cover the whole month. Now, many countries have months dedicated to teaching the history of the LGBTQ+ movement.",
    "From this, we can start to see why Pride and video games won’t mix well. Gaming has a wide, mass-market appeal, which looks to serve and appease the largest group possible. Politics, unfortunately, doesn’t gel well with that business model.",
    "Sure, as purely a celebration, a Pride-inspired event would be nothing new for video games. It’s hard to imagine an online game like Overwatch or Animal Crossing that doesn’t feature in-game festivals to commemorate real-life occasions. In October players will see game worlds turn spooky as Halloween rolls around, and in December Christmas cheer takes root. Though we’ll also see more generic celebrations, with virtual barbecues and beach parties taking our attention in the summer months, these holidays and other occasions arrive with a slew of content drops, such as limited-time game modes and rewards to earn or buy.",
    "But Pride would need to go beyond a few flag-clad characters and rainbow color-filled limited-time game modes. A Pride event in a video game would have to be an open and radical show of support for LGBTQ+ people. It would have to offer the community genuine support, through integrated messaging on what different identities are and what they’ve faced through history, and find ways to support them now, for example through charitable donations.",
    "This is where the problem lies. Same-sex relationships are illegal in 72 countries and can be punishable by death in 11. Some countries also have laws prohibiting and criminalizing transgender identities, while others have laws against open celebrations and recognition of LGBTQ+ people. While it has never been officially confirmed, many fans believe anti-LGBTQ+ sentiment is why The Sims: Freeplay has been banned in seven countries (China, Saudi Arabia, the United Arab Emirates, Oman, Kuwait, Qatar, and Egypt).",
    "Due to the risk that they might suffer the same fate as EA with The Sims, video game companies that release their games on a global scale are likely deterred from including obvious elements referencing Pride, and LGBTQ+ themes and characters. This may be why such references and characters are not overt, or are hidden away in other media – Overwatch’s Tracer is only seen with her girlfriend in a comic book, which is banned in Russia, among other countries, but Overwatch as a game is still playable there.",
    "In this, there are some benefits. At the expense of characters remaining ‘in the closet’, so to speak, they can still be part of a player’s experience. Perhaps a gamer in a country that does not support LGBTQ+ groups could take comfort in playing as a character who identifies in a similar way to them, using the character as a safe way to express who they are. But this does nothing to fight discrimination at its core. Many would argue that big corporations should stay away from Pride, as they only care about making a quick buck by appearing ‘woke’ and not about making the world a better place.",
    "Any criticisms in that regard would be valid. It isn’t right that companies affect to care about LGBTQ+ issues for one month in the year, just to boost profits, and Pride festivals, such as London Pride in 2019, have been heavily criticized for aiding and abetting this practice of ‘pink capitalism’. But, while the idea of games producers slapping ‘PRIDE on a loot box and calling it a day is all too easy to imagine, gaming has so much more to give by hosting Pride events.",
    "Gaming is the world’s biggest entertainment industry, and its influence could be a force to be reckoned with if wielded correctly. For many years, even in the decades leading up to Stonewall, more peaceful protests failed to galvanize the LGBTQ+ community to the same degree as the Uprising did. Sure, they allowed the early community to grow, as gaming’s LGBTQ+ representation is growing now, but a loud explosive expression is needed to push beyond the current confines. As Frank Kameny, a long-time LGBTQ+ activist noted, \"by the time of Stonewall, we had 50 to 60 gay groups in the country. A year later there were at least 1,500. By two years later, to the extent that a count could be made, it was 2,500.”",
    "In this larger, louder sense, we could see a game like Fortnite host free-to-attend Pride parades for players on all servers across the world. Most likely this would cause the game to be banned in certain countries, but companies like Epic Games have the financial muscle to take a stand against such threats – a company that’s willing to call out Apple’s “restrictive” App Store policies could do the same for a country’s restrictive LGBTQ+ laws, highlighting the injustice to a global audience, as it’s attempted to do with its #freefortnite campaign. So why don’t we get #freetobeme competitions in-game? Advertising could highlight the discrimination that LGBTQ+ people face in parts of the world, and money made during the events could be donated to charities that fight for LGBTQ+ causes.",
    "At a more personal level, this additional representation could allow some players to finally celebrate and understand who they are. Studies have shown that representation in the media can help LGBTQ+ people come to understand themselves better and be a positive influence on their identity. On top of this, for a person who has a family that may not accept their sexuality or gender identity, let alone take them to a Pride parade, virtual festivities could offer an alternative that would provide them with an anonymous and less dangerous space in which to be proud of who they are.",
    "And this isn’t all just a pipe dream – we’ve already seen the potential for games to host Pride events. Last year We Are Social hosted Animal Crossing: New Horizon Pride parades, and gave out free codes to LGBTQ+ inspired apparel for player’s in-game avatars to wear. The event garnered plenty of media attention and offered gaymers a viable alternative when real-life Pride events were canceled, yet without official support from Nintendo the festivities felt confined. Pride is about showing the wider world that LGBTQ+ people exist, but unofficial events, even if amazing, can become confined inside their own bubble.",
    "2020 was a missed opportunity to finally burst this bubble. Covid restrictions across the globe offered an opportunity for the biggest players in gaming to step up, but they didn’t. All is not quite yet lost, though. As the pandemic persists into 2021, this year’s Pride season offers another chance for games to join us in the 21st century and show the world what Pride really means. Maybe then we can be proud of gaming again."
  ],
  "headers": {
    "2": "The current state of gayming",
    "5": "Where Pride began",
    "10": "Games companies are self-censoring",
    "15": "Live life in a state of inclusion"
  },
  "links": {
    "The Last of Us: Part II": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Overwatch": "https://www.techradar.com/news/gaming/overwatch-review-1322640",
    "illegal in 72 countries": "https://www.humandignitytrust.org/lgbt-the-law/map-of-criminalisation/",
    "transgender identities": "https://www.humandignitytrust.org/lgbt-the-law/map-of-criminalisation/?type_filter=crim_gender_exp",
    "banned in seven countries": "https://www.pinknews.co.uk/2018/06/26/the-sims-gaming-ban-same-sex-relationships-lgbt/",
    "London Pride in 2019": "https://www.theguardian.com/world/2019/jul/06/pride-in-london-organisers-fend-off-pinkwashing-claims",
    "biggest entertainment industry": "https://www.statista.com/chart/22392/global-revenue-of-selected-entertainment-industry-sectors/",
    "“restrictive”": "https://www.epicgames.com/site/en-US/free-fortnite-faq",
    "understand themselves better": "https://www.tandfonline.com/doi/full/10.1080/00918369.2011.546729",
    "We Are Social hosted Animal Crossing: New Horizon Pride parades": "https://wearesocial.com/uk/blog/2020/06/globalpridecrossing-pride-meets-animal-crossing"
  }
}