{
  "source": "https://www.techradar.com/news/panasonic-launches-bargain-50mm-prime-lens-for-full-frame-lumix-cameras",
  "title": "Panasonic launches bargain 50mm prime lens for full-frame Lumix cameras",
  "category": "cameras",
  "updated": "2021-06-02T13:25:12Z",
  "author": "mark-wilson",
  "summary": "A 'nifty fifty' for hobbyist shooters",
  "article": [
    "Panasonic has launched a new 'nifty fifty' prime lens for full-frame cameras like the Panasonic Lumix S5 – and it has what could prove to be a bargain price tag.",
    "The Lumix S 50mm f/1.8 is a useful all-rounder for everything from portraits to video shooting, and is significantly smaller than the pro-friendly Lumix S Pro 50mm f1.4. While the latter weighs 995g, the new 50mm f/1.8 is only 300g.",
    "The new prime looks like the ideal match for cameras like the Panasonic Lumix S5, and is the second in a series of four f/1.8 aperture lenses for Panasonic's full-frame cameras. It joins the Lumix S 85mm f/1.8, with 24mm and 35mm versions still \"under development\".",
    "On paper, the Lumix S 50mm f/1.8 certainly looks good value for its $449 / £429 / $699 price tag. It has nine lens elements in eight groups, with three aspherical lenses to help produce what should be some dreamy bokeh.",
    "It also promises to be a useful tool for video shooters, with Panasonic claiming that the 50mm f/1.8 contains a mechanism that suppresses focus breathing (an issue that can result in a slight change of focal length when you adjust focus while recording).",
    "Just like the Panasonic Lumix S5, the lens is also apparently resistant to both dust and splashes, and will apparently also work at temperatures of -10C if you get caught in a snow blizzard.",
    "One of the most useful aspects of the Lumix S 85mm f/1.8, particularly for filmmakers, might be the fact that it's designed to be part of a four-lens team of prime lenses.",
    "Like the existing Lumix S 85mm f/1.8, and the incoming 24mm and 35mm versions, it features a common 67mm filter thread, which will make it easy to swap things like ND filters between the different focal lengths.",
    "Given that all four lenses feature similar dimensions, they could also be easily swapped on a gimbal-mounted camera, without having to adjust gears or re-balance the gimbal.",
    "For hobbyist photographers, though, the charm of the Lumix S 85mm f/1.8 is likely to be its relatively affordable price tag and versatility. Most of the full-frame L-mount mirrorless lenses we've seen so far have been pretty weighty and expensive, as they've been geared towards pros.",
    "But with Panasonic starting to flesh out the non-professional parts of its lens line-up with these primes, to sit alongside more far-reaching options like the 70-300m f/4.5-5.6, its full-frame cameras are starting to look more attractive to hybrid shooters. You'll be able to buy the $449 / £429 / $699 Lumix S 85mm f/1.8 by the end of June in the UK, and from July in the US and Australia."
  ],
  "headers": {
    "6": "Prime team"
  },
  "links": {
    "Panasonic Lumix S5": "https://www.techradar.com/reviews/panasonic-lumix-s5"
  }
}