{
  "source": "https://www.techradar.com/news/most-hpc-data-centers-will-deploy-quantum-computing-within-the-next-few-years",
  "title": "Most HPC data centers will deploy quantum computing within the next few years",
  "category": "computing",
  "updated": "2021-11-19T11:54:25Z",
  "author": "sead-fadilpasic",
  "summary": "Two-thirds plan on using quantum computing by 2023",
  "article": [
    "Most high-performance computing (HPC) data center operators expect to deploy quantum computing solutions within the next couple of years, a new report from Atos and IQM has found.",
    "The firms polled 110 key decision-makers from HPC centers worldwide and found that getting optimal performance out of HPC, while ensuring security and resilience, is getting more challenging for users.",
    "To tackle the problem, 76% plan on using quantum computing by 2023. Furthermore, 71% plan to move to on-premises quantum computing by 2026.",
    "In fact, quantum computing is the number one technology in Europe and the top three worldwide. Three-quarters (76%) of HPC centers are already using quantum computers for their servers, or have plans to do so within the next two years. They expect quantum computers to solve supply chain logistics challenges, as well as those related to climate change. They also expect it to solve existing problems faster, and reduce overall computing costs.",
    "Furthermore, the top use cases for HPC centers are database searching, investment risk analysis, molecular modeling, and asset management.",
    "Being able to mix standard elements with custom-developed infrastructure components is what makes cloud an essential part of the HPC architecture, the report further found. Hybrid and cloud deployments are of high priority all over the world, but very little is known about how quantum will work side-by-side with classical HPC infrastructure.",
    "This will result, the report concludes, in the growth of outsourcing operations and maintenance in quantum computing.",
    "Unlike classic computers, whose bits (basic unit of information) can only have two states (either 0 or 1), quantum computers’ qubits can take advantage of the collective properties of quantum states (superposition, interference, entanglement) when performing calculations. That should make them infinitely faster than traditional computers, but at the moment, they are only capable of solving specific computational problems.",
    "Make sure to check out our list of the best dedicated server hosting providers right now"
  ],
  "headers": {
    "5": "A place for cloud"
  },
  "links": {
    "data center": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "cloud": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "best dedicated server hosting providers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers"
  }
}