{
  "source": "https://www.techradar.com/news/welcome-to-techradars-photography-week-2021",
  "title": "Welcome to TechRadar's Photography Week 2021: a celebration of snapping",
  "category": "cameras",
  "updated": "2021-08-22T09:42:17Z",
  "author": "mark-wilson",
  "summary": "All the highlights from our festival of photography",
  "article": [
    "Welcome to TechRadar's Photography Week 2021. We hosted this week-long celebration of snapping to mark World Photography Day, but also because it was a great excuse to dive deep into what is a fascinating time for image-making.",
    "It's not hyperbole to say that we're in the midst of a photographic revolution. Smartphones have reinvented the pocket camera, but tech is pushing image-making into unexplored terrain – as you can discover in our series on the future of photography below.",
    "Machine learning and artificial intelligence are automatically turning our old family snaps into video, while giving us powerful new editing tools that question what a photo actually is. You can read about both of these fascinating trends in our in-depth features on 'Deep Nostalgia' and Photoshop's 'Neural filters' below.",
    "They're joined in our 'future of photography' series by a look at the rise of analogue photography in video games, an explainer on the huge promise of liquid lenses, and an eye-opening look at the three-dimensional possibilities of LiDAR on the iPhone 13 Pro.",
    "But Photography Week hasn't just been gazing ahead at the future. We've also produced a series of guides from pro photographers on helping you to improve your snapping skills today, particularly on smartphones – whether you're looking to shoot landscapes, portraits, food or pets, you'll find some invaluable tips in our 'improve your photography' section.",
    "As fun as it is taking your own photos, sometimes you just want to gawk at the inspiring work of others. So we also celebrated the finest work in recent times with our round-up of the best photos of the year so far, as well as a fascinating look at the strangest cameras in photographer Tony Kemplen's huge collection.",
    "Whether you're a casual smartphone snapper or film camera veteran, we hope there's something for you in TechRadar's Photography Week 2021. And even if you're allergic to pressing cameras shutters, there'll be some lovely photos to look at – and who doesn't like doing that?",
    "Photography is entering one of the most fascinating periods in its history. From AI-powered editing to powerful in-game photo modes, tech is twisting the art form into brilliant (and sometimes frightening) new forms.",
    "In this series of features, we dive into how cameras and photography are evolving and where it's all headed.",
    "One of the biggest photography stories of the year has been the viral smash 'Deep Nostalgia', which turned our old family photos into moving, animated versions that were equal parts beguiling and unnerving.",
    "We spoke to the makers of the tech, an Israeli company called D-ID, about how it works and where this is all headed. Hint: 'synthetic media' is only just getting started.",
    "Traditional camera giants like Nikon are under attack from smartphones and computational photography. How do they fight back? One of their biggest weapons is heritage – which Nikon has deployed with stunning effect on the new Nikon Zfc.",
    "In an exclusive chat with Nikon's designers, we discover how they designed the Zfc, their favorite design features, and why they decided to make a retro mirrorless camera in 2021.",
    "Smartphone cameras are surely hitting a photographic ceiling? Far from it – in this deep-dive on the possibilities of the iPhone 13 Pro's LiDAR scanner, we look at how it could power everything from a video Portrait mode to a brand new form of capturing memories.",
    "Three-dimensional photography has been growing in popularity on the iPhone 12 Pro and we talk to developers about what its successor needs to make it a mainstream form of recording our lives.",
    "The Alice Camera in a fascinating Indiegogo project that's aiming to combine mirrorless camera hardware with the slick menus and connectivity of smartphones. Slot your phone into the back of the camera, and get the best of both worlds – or that's the idea, at least.",
    "The project is progressing towards its goal of launching in October 2021 – in this revealing chat with the Alice Camera's makers, the Photogram AI, we found out why the UK computational photography startup thinks it has the special glue needed to marry these seemingly incompatible concepts together.",
    "If you thought that smartphone cameras had finally hit a ceiling in their incredible evolution, you underestimated tech's ability to make seemingly unworkable ideas real. A case in point? Liquid lenses.",
    "On the face of it, using a small pocket of fluid to direct and focus light onto a camera sensor shouldn't work. And yet, it does – and it could be another huge deal for smartphone photography. In this excellent explainer, we reveal how liquid lenses work and why they're particularly well-suited to camera phones.",
    "AI photo editing is on the rise, so what does that mean for human photo editors? On one hand, tools like Photoshop's neural filters are super-convenient aids. But on the other, they've sparked big debates about what constitutes a 'real' photograph.",
    "After attacking his own face Photoshop and Luminar's AI tools, pro photographer Dave Stevenson gives us his verdict on whether or not the robots are ready to pry the adjustment brushes from our cold, dead hands.",
    "In-game photography has never been bigger, with huge games like Cyberpunk 2077 and Spider-Man – not to mention innovative indie titles like Pupperazi – featuring increasingly sophisticated photo modes.",
    "One of the most exciting snapping-themed games, though, is the forthcoming Season on PS5, which combines camera-based exploration with Studio Ghibli-style visuals. In this exclusive chat with Season's developer Scavengers Studio, we find out what inspired the game and how it's planning to take the photo mode to immersive new heights.",
    "Mirrorless cameras have come a long way in the last decade, but their interfaces and connectivity still feel they're from a bygone age era. So why has no-one made a killer Android camera yet?",
    "In this constructive rant, a frustrated TechRadar photographer vents about their experiences with the near misses of almost-modern cameras, and their undying hopes for something that genuinely moulds smartphone usability with powerful camera hardware.",
    "Smartphones are the best point-and-shoot cameras ever made. But they're also powerful creative tools, if you're prepared to wander away from the well-trodden path of your phone's default camera app and settings.",
    "In this series, we badger pro photographers for their best smartphone photography tips, whether you're shooting portraits or pets. Got a DSLR or mirrorless camera? We'll also be publishing separate guides with more advanced tips on improving your landscape and portrait snapping.",
    "Landscape photography is synonymous with heavy-duty tripods, week-long exposures and baffling phrases like hyperfocal distance, but it doesn't have to be so intimidating.",
    "Your smartphone is capable of taking some stunning, creative landscapes – for this guide we asked two professional photographers for their best landscape photography tips for smartphone snappers.",
    "Portrait photos, they're easy right? Smartphones have certainly made them a lot simpler, thanks to their ever-more-powerful Portrait modes. But a pro-level face shot demands more than just a beaming face and some lovely bokeh.",
    "In this guide to smartphone portrait photography, two professional snappers give us their best tips for taking people shots with your phone. With their insider knowhow, you'll get people asking which DSLR you've just bought.",
    "Looking to shoot photos that are just as mouth-watering as the dish you've just made? Just like any culinary creation, a few seemingly innocuous ingredients can go a long way in food photography.",
    "In this handy guide from two professional food snappers, we reveal the little tricks that can take your photos from unappetizing to rosette-worthy.",
    "It's easy to get stuck in a rut with landscape photography, particularly if you feel like you've exhausted all your local beauty spots.",
    "If you're going through the landscape motions, this inspiring range of tips from professional photographer James Abbott will get you back out there with renewed vigor.",
    "The Lightroom app is one of the best photo editing apps around, particularly if you're already familiar with its desktop sibling – but how should you go about adding its tricks to your muscle memory?",
    "Our in-depth guide to the Lightroom app takes you through the workflow of editing a photo, whether you're on iOS or Android. We also fill you in on how to create your own Lightroom presets.",
    "What better way to celebrate World Photography Day on August 19 than with a gallery of the best photos of the year so far?",
    "In this epic piece of photographic eye candy, we've rounded up all the winners from this year's most prestigious photography competitions – and talked to the photographers about how they shot them.",
    "As you can see in the feature above, we now have a huge range of photography competitions on all kinds of topics – but not many of them focus on the issue of mental health.",
    "Out From the Mist is aiming to change that and in this feature we look at why it's an important competition, how phototherapy can help, and why photography in particular is a hobby that can bring lifelong benefits.",
    "The golden age of film produced some gloriously varied and eccentric cameras – and no-one has a bigger collection of curios than collector Tony Kemplen, who has used a different camera every single week for the last decade.",
    "In this trip to the outer edges of camera design, Tony Kemplen picks out the 12 weirdest cameras from his huge collection, from the sniper rifle-shaped Zenit Fotosniper to the James Bond's bino-cam from 'For Your Eyes Only'."
  ],
  "headers": {
    "7": "The future of photography",
    "9": "How AI animates your old family photos – and where deepfakes are going next",
    "11": "How Nikon built the Nikon Zfc – and why it thinks the future of cameras is retro",
    "13": "Why the iPhone 13 Pro's LiDAR scanner could be its secret photographic weapon",
    "15": "Inside the Alice Camera: why its maker thinks it's the future of mirrorless cameras",
    "17": "What is a liquid lens? The tech that could revolutionize phone cameras explained",
    "19": "Why Photoshop and Luminar's AI tools aren't quite ready to kill real photography",
    "21": "How Season on PS5 is taking gaming photo modes back to the future",
    "23": "My dream mirrorless camera runs on Android, so why has no-one built a good one yet?",
    "27": "How to take epic landscape photos on iPhone or Android (according to the pros)",
    "29": "How to take professional portrait photos with your iPhone or Android phone",
    "31": "How to take super-tasty food photos (according to the pros)",
    "33": "Land grabs: 26 essential landscape photography tips you need to know",
    "35": "How to master the Lightroom app for next-level smartphone photos",
    "37": "The best photos of the year so far – and how to take them",
    "39": "This competition points photography's compassionate lens at mental health",
    "41": "Long shots: the 12 strangest cameras I own (as a camera collector)"
  },
  "links": {
    "'Deep Nostalgia'": "https://www.techradar.com/news/how-ai-animates-your-old-family-photos-and-where-its-going-next",
    "Photoshop's 'Neural filters'": "https://www.techradar.com/news/why-photoshop-and-luminars-ai-tools-arent-quite-ready-to-kill-real-photography",
    "rise of analogue photography in video games": "https://www.techradar.com/news/how-season-on-ps5-is-taking-in-game-photography-back-to-the-future",
    "huge promise of liquid lenses": "https://www.techradar.com/news/what-is-a-liquid-lens",
    "three-dimensional possibilities of LiDAR on the iPhone 13 Pro": "https://www.techradar.com/news/why-the-iphone-13-pros-lidar-scanner-could-be-its-secret-photographic-weapon",
    "landscapes": "https://www.techradar.com/news/how-to-shoot-professional-landscape-photos-on-iphone-or-android",
    "portraits": "https://www.techradar.com/news/how-to-take-professional-portrait-photos-with-your-iphone-or-android-phone",
    "food": "https://www.techradar.com/news/how-to-take-professional-food-photos-with-your-iphone-or-android-phone",
    "best photos of the year so far": "https://www.techradar.com/news/world-photography-day-2021-celebrate-with-the-best-photos-of-the-year-so-far",
    "strangest cameras in photographer Tony Kemplen's huge collection": "https://www.techradar.com/news/the-worlds-strangest-cameras",
    "We spoke to the makers of the tech, an Israeli company called D-ID": "https://www.techradar.com/news/how-ai-animates-your-old-family-photos-and-where-its-going-next",
    "exclusive chat with Nikon's designers": "https://www.techradar.com/news/exclusive-how-nikon-designed-the-nikon-zfc-and-why-it-thinks-the-future-is-retro",
    "this deep-dive on the possibilities of the iPhone 13 Pro's LiDAR scanner": "https://www.techradar.com/news/why-the-iphone-13-pros-lidar-scanner-could-be-its-secret-photographic-weapon",
    "revealing chat with the Alice Camera's makers, the Photogram AI": "https://www.techradar.com/news/inside-the-alice-camera-why-its-maker-thinks-its-the-future-of-mirrorless-cameras",
    "this excellent explainer, we reveal how liquid lenses work and why they're particularly well-suited to camera phones": "https://www.techradar.com/news/what-is-a-liquid-lens",
    "pro photographer Dave Stevenson gives us his verdict": "https://www.techradar.com/news/why-photoshop-and-luminars-ai-tools-arent-quite-ready-to-kill-real-photography",
    "Season": "https://www.youtube.com/watch?v=ZCMHnKpt4IM",
    "In this exclusive chat with Season's developer Scavengers Studio": "https://www.techradar.com/news/how-season-on-ps5-is-taking-in-game-photography-back-to-the-future",
    "this constructive rant, a frustrated TechRadar photographer vents about their experiences with the near misses of almost-modern cameras": "https://www.techradar.com/news/my-dream-mirrorless-camera-runs-on-android-so-why-isnt-there-a-good-one-yet",
    "we asked two professional photographers for their best landscape photography tips for smartphone snappers": "https://www.techradar.com/news/how-to-shoot-professional-landscape-photos-on-iphone-or-android",
    "this guide to smartphone portrait photography": "https://www.techradar.com/news/how-to-take-professional-portrait-photos-with-your-iphone-or-android-phone",
    "this handy guide from two professional food snappers": "https://www.techradar.com/news/how-to-take-professional-food-photos-with-your-iphone-or-android-phone",
    "inspiring range of tips from professional photographer James Abbott": "https://www.techradar.com/news/land-grabs-26-essential-landscape-photography-tips-you-need-to-know",
    "Our in-depth guide to the Lightroom app": "https://www.techradar.com/news/how-to-master-the-lightroom-app-for-next-level-photos-on-iphone-and-android",
    "this epic piece of photographic eye candy, we've rounded up all the winners from this year's most prestigious photography competitions": "https://www.techradar.com/news/world-photography-day-2021-celebrate-with-the-best-photos-of-the-year-so-far",
    "this trip to the outer edges of camera design, Tony Kemplen picks out the 12 weirdest cameras": "https://www.techradar.com/news/the-worlds-strangest-cameras"
  }
}