{
  "source": "https://www.techradar.com/news/this-dell-xps-13-is-over-dollar250-off-in-an-early-black-friday-deal-and-selling-out-fast",
  "title": "This Dell XPS 13 is over $250 off in an early Black Friday deal and selling out fast",
  "category": "computing",
  "updated": "2021-10-29T16:34:58Z",
  "author": "james-pickard",
  "summary": "Get it now and save $264",
  "article": [
    "Dell is running a number of limited-time Cyber sales in the run-up to this year's Black Friday deals – and right now you can save a huge $264 off the price of this top XPS 13 laptop and get it for $685.99 (was $949.99). You'll need to move fast, though, as over 70% have sold already!",
    "Quite simply, the XPS 13 is one the best laptops you can buy. It regularly features at the top of our list of favourites thanks to its stunning design, gorgeous InfinityEdge display and impressive battery life. This marks one of the biggest discounts we've seen on an XPS 13 ahead of the Black Friday sales. And you shouldn't worry about buying so early, too, as Dell promises this XPS 13 deal is at Black Friday pricing.",
    "The version reduced today in the early Dell Black Friday deals sports the latest generation Intel i5 processor, 8GB RAM and 256 GB SSD storage. All together, these components make for an excellent all-around machine that'll handle work, browsing, streaming or multitasking between all three with ease.",
    "As well as the XPS 13 deal, there are a number of other laptops, monitors and more that feature in the current Cyber sale at Dell. If your budget is a little lower, you could instead consider this Inspiron 15 3000 laptop for $342.99 (was $529.99). It's definitely a more basic machine, but the 8GB RAM and i3 processor will hold their own with general use and less demanding tasks."
  ],
  "headers": {
    "3": "Dell XPS 13 deal",
    "4": "More Dell laptop deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "get it for $685.99 (was $949.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2170638257602379000/https://deals.dell.com/en-us/member/productdetail/b0gm",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Black Friday sales": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Dell Black Friday deals": "https://www.techradar.com/black-friday/dell-black-friday-deals",
    "$342.99 (was $529.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1348457443957903400/https://deals.dell.com/en-us/member/productdetail/b0gu"
  }
}