{
  "source": "https://www.techradar.com/news/apple-musics-lossless-and-spatial-audio-has-landed-on-android-phones",
  "title": "Apple Music's Lossless and Spatial Audio has landed on Android phones",
  "category": "audio-visual",
  "updated": "2021-07-23T09:03:28Z",
  "author": "olivia-tambini",
  "summary": "Hi-res music streaming for all",
  "article": [
    "Android users can now enjoy Lossless and Spatial Audio with Apple Music, following an update to the app.",
    "It began rolling out to iOS devices in early June, with Apple offering the new formats at no extra cost to subscribers to its music streaming service.",
    "The Lossless tier bring hi-res audio to the streaming service. Starting at CD quality (16 bit / 44.1kHz), it goes up to 24 but / 48 kHz, and can be played natively on Apple devices. And, for audiophiles, there's Hi-Resolution Lossless, which increases all the way up to 24 bit / 192kHz. If you have a decent pair of headphones, you should find your music sounds clearer and more detailed.",
    "Spatial Audio takes 5.1, 7.1, and Dolby Atmos content and applies directional audio filters, placing sound in a 3D sphere – making it feel as though your music is coming at you from every angle for an immersive listening experience.",
    "First of all, you'll need to download the Apple Music app. If you don't already have an Apple Music subscription, you can try out Lossless and Spatial Audio before committing. Apple is currently offering a three-month free trial of Apple Music for new subscribers to the individual plans – perfect if you just want to dabble in the new formats. You won’t be charged until the plan renews and you’re able to cancel up to two days before your trial is set to end without any penalty.",
    "You can use any headphones to experience Spatial Audio, though Apple headphones like the AirPods Pro and AirPods Max, as well as Beats headphones will play Spatial Audio automatically. Otherwise, you'll need to enable Dolby Atmos in your device's music settings.",
    "Experiencing Lossless Audio isn't so easy, unfortunately. None of Apple's own headphones are capable of playing hi-res audio, and you won't get the benefit unless you use a wired connection to an external receiver, speaker or pair of headphones – any wireless headphones you use will compress the audio.",
    "Via Engadget"
  ],
  "headers": {
    "4": "How can I get Lossless and Spatial Audio?"
  },
  "links": {
    "Lossless and Spatial Audio with Apple Music": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "three-month free trial": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6342360325711261000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fuk%2Fapple-music%2F",
    "Apple headphones": "https://www.techradar.com/news/airpods-beats-and-the-best-apple-headphones-you-can-buy-in-2020",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Beats headphones": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Engadget": "https://www.engadget.com/apple-music-lossless-spatial-audio-streaming-android-034510410.html"
  }
}