{
  "source": "https://www.techradar.com/news/we-might-have-just-seen-our-first-exoplanet-in-another-galaxy",
  "title": "Extra-Galactic Planet? We might have just seen our first exoplanet in another galaxy",
  "category": "appliances",
  "updated": "2021-10-25T19:47:30Z",
  "author": "john-loeffler",
  "summary": "The possible exoplanet might even be orbiting a black hole",
  "article": [
    "Astronomers at the Chandra X-ray Observatory just announced that they might have identified an exoplanet in another galaxy for the first time ever.",
    "The possible exoplanet candidate was spotted in the spiral galaxy Messier 51 (M51), according to a statement by the observatory. The observatory was monitoring X-rays coming from a binary star system in M51 when they saw dimming in the X-ray source, a strong indication of a planetary transit.",
    "\"We are trying to open up a whole new arena for finding other worlds by searching for planet candidates at X-ray wavelengths, a strategy that makes it possible to discover them in other galaxies,\" said Rosanne Di Stefano, from Harvard University and the Smithsonian Institute's Center for Astrophysics and the lead author of the study published today in Nature Astronomy.",
    "The system itself isn't any old star system, though. Astronomers suspect that the X-rays are the product of either a neutron star or even a black hole that is feeding off its partner star, making this planet even more intriguing.",
    "Thousands of possible exoplanets have been spotted in our own galaxy, and over 150 have been confirmed. The most common method for identifying exoplanet candidates is the transit method, which is when you look at the amount of light being radiated by a star and watch for dips in the star's brightness.",
    "This would indicate that something passed in front of the light source, and if there is a regular period to the dips in the light seen from the star and the dip is of the same magnitude, then you can confirm that there is a planet in orbit around that star.",
    "The exoplanet candidate spotted in M51 was seen in the same way, only instead of using visible light as with our current transit method for stars nearer to us, this method used X-ray emissions instead.",
    "The X-ray emissions are coming from either a neutron star or a black hole orbiting a larger star in a binary system. The companion star is estimated to have about 20 times the mass of the sun and is feeding the accretion disk around its partner, which is emitting the X-rays that the astronomers were able to observe.",
    "During their observation, they saw the X-ray emissions stop entirely for about 3 hours, which – along with other data – could indicate a Saturn-sized planet transiting in front of the X-ray source at a distance of about twice Saturn's distance from the sun.",
    "This was only the first diminution of X-rays spotted though, so it's too soon to say whether this is a planet or not – and confirmation could take decades. The researchers calculated that the planet's orbital period would be about 70 years, based on its size and distance.",
    "\"Unfortunately to confirm that we're seeing a planet we would likely have to wait decades to see another transit,\" said Nia Imara, of the University of California at Santa Cruz and co-author of the study. \"And because of the uncertainties about how long it takes to orbit, we wouldn't know exactly when to look.\"",
    "While exciting in itself, this new method of detecting planetary transits in binary systems offers another method for spotting exoplanets here in our own galaxy.",
    "Since the X-ray emitting region of an accretion disk in these systems is small, a planet could completely block the X-ray source entirely, which is a much clearer indicator of a transit than measuring often subtle changes in the luminosity of a star.",
    "It should also be said that the planets spotted using this method would also have suffered through some pretty turbulent times. The collapse of a star into a neutron star or black hole isn't the most peaceful of transitions, and the supernova that created them would have blasted the planet with some extreme radiation levels that would almost certainly strip it of any life that might have been living on it.",
    "Then there's also the matter of the other star in the system. It hasn't gone supernova yet, but the steady loss of its material to its companion means that its demise is accelerating, so it would only be a matter of time before it too went supernova, blasting the planet again.",
    "Life in these systems is highly unlikely, to say the least. Still, the X-ray transit method could prove useful in growing our catalog of planets outside our solar system."
  ],
  "headers": {
    "11": "Analysis: this method could accelerate exoplanet discovery"
  },
  "links": {
    "statement by the observatory": "https://chandra.si.edu/press/21_releases/press_102521.html"
  }
}