{
  "source": "https://www.techradar.com/news/qualcomm-snapdragon-8cx-gen-3-is-official-and-it-wants-to-tempt-you-away-from-apples-m1-chip",
  "title": "Qualcomm Snapdragon 8cx Gen 3 is official, and it wants to tempt you away from Apple’s M1 chip",
  "category": "computing",
  "updated": "2021-12-01T23:00:50Z",
  "author": "james-peckham",
  "summary": "The third generation compute platform is now here",
  "article": [
    "Your next laptop could be powered by the new Qualcomm Snapdragon 8cx Gen 3 that has just been revealed, and we’re expecting to see it in a variety of laptops in 2022 and beyond.",
    "Revealed at Tech Summit 2021 alongside the new mobile chipset, the Snapdragon 8 Gen 1, this is Qualcomm’s flagship computing platform that means to compete with the best from AMD, Intel and even Apple’s M1 processor.",
    "Qualcomm’s new CPU platform is the world’s first 5nm Windows PC platform. That ‘5nm’ is about the manufacturing process, which means Qualcomm can include more power and better power efficiency without increasing the size of its chip by including more transistors in the same amount of space as before.",
    "So what can you expect from Gen 3? Qualcomm is claiming the Snapdragon 8cx Gen 3 will deliver up to 85% faster CPU performance when compared to “competitive x86 platforms”.",
    "This also includes 60% faster GPU performance compared to 2020’s Snapdragon 8cx Gen 2. It supports gaming at Full HD resolutions up to 120 frames per second, while Qualcomm also claims battery life up to 50% longer than competitors.",
    "We’ve yet to test the Snapdragon 8cx Gen 3 for ourselves, but these are some big claims from Qualcomm that it’ll be interesting to see if the company can meet those in real life scenarios.",
    "We’re also keen to get those results to see truly how the Snapdragon 8cx Gen 3 can compete with some of the best mobile computing products on the planet such as the M1 or U-series chips from AMD and Intel.",
    "With video conferencing becoming the norm throughout the Covid-19 pandemic, Qualcomm has also focused some of its upgrades on those features. For example, this claims to start up video conferencing applications up to 15% faster than the Gen 2 platform.",
    "Auto focus, auto white balance and auto exposure on your laptop’s webcam are all handled by the artificial intelligence elements of the Gen 3 platform when you’re on Microsoft Teams or Zoom calls so it can adapt to your lighting and offer you better picture quality than before.",
    "Expect it to automatically be able to change settings if you’re in bright or dark locations to try and clean up picture quality without you having to fiddle with the settings yourself.",
    "Plus, audio is improved with some upgrades to Qualcomm Voice Suite. The aim here is to cut out background noises using artificial intelligence. For example, it’ll send your voice on the video call rather than the noise of sirens or general background noise in a busy setting.",
    "We’ve seen a demo of this technology, and in that specific setting with a reference device it worked really well cutting out the noise of typing on a keyboard or someone eating. We’re excited to see how this works in the real world, and on third-party products.",
    "The new Snapdragon 8cx Gen 3 also offers up to 10Gbps 5G connectivity, which is up from 7.5Gbps on the previous generation. It also includes Wi-Fi 6/6E support, which is a standard that was introduced on the Gen 2.",
    "Artificial intelligence features are a key element of Qualcomm’s products, and this new generation includes 29+ TOPS of AI acceleration. The company claims that is 3x what “the leading competitive platform” offers.",
    "Perhaps obviously, but the new Snapdragon also supports Microsoft’s latest Windows 11 software.",
    "Finally, security is another focus of the Snapdragon 8cx Gen 3. A new security feature uses Windows Hello login and its dedicated Computer Vision processor to ensure that your laptop will lock when you leave the machine.",
    "Why would you want this? Think about scenarios where you may have to get up and away from your machine when in a coffee shop. This would ensure no-one could quickly jump in and look at your data while you’re away from the machine.",
    "Want a device with the Snapdragon 8cx Gen 3? Qualcomm claims its partners will be revealing devices that include this technology in the first half of 2022. No manufacturers have confirmed devices yet, but we expect to see it become commonplace in the next 12 months.",
    "Both Microsoft and Lenovo are quoted in Qualcomm’s press materials on the new platform, so it’s highly likely we’ll see devices from each of those companies that use the new Snapdragon. From Microsoft, it’ll likely just be a followup to the Surface Pro X.",
    "This isn’t Qualcomm’s only computing platform today with the company also revealing its new Snapdragon 7c+ for entry-tier devices. This is built for Windows PCs and Chromebooks alike, and it offers 60% faster CPU speeds than the previous generation.",
    "It also includes 70% faster GPU performance uplift, according to Qualcomm.",
    "The biggest upgrade here is the introduction of 5G connectivity, which previously hasn’t been available on the equivalent platforms. That likely means you’ll see cheaper 5G computing devices in 2022 and beyond.",
    "Devices with the Snapdragon 7c+ Gen 3 are expected to launch during the first half of next year, so keep an eye out for the new platform in upcoming devices."
  ],
  "headers": {},
  "links": {
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Tech Summit 2021": "https://www.techradar.com/news/live/qualcomm-snapdragon-summit-2021-live-blog",
    "Surface Pro X": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
    "Windows PC": "https://www.techradar.com/news/best-windows-laptop/news/best-windows-laptop",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook"
  }
}