{
  "source": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
  "title": "PS5 and Xbox Series X restock for Cyber Monday at Walmart kicks off at noon",
  "category": "gaming",
  "updated": "2021-11-29T17:07:07Z",
  "author": "james-pickard",
  "summary": "Here's everything you need to know about the next console restock",
  "article": [
    "Get ready to walk in the doors or hit refresh on those browsers: Walmart is holding a PS5 and Xbox Series X restock on Cyber Monday beginning at noon ET - but you'll need to be a Walmart+ member to get access.",
    "This latest console restock went live today (that's November 29, of course!) at 12 pm ET for anyone who is signed up. There will likely be a general sale that goes live after this members-only window, but the PS5 and Xbox Series X will almost certainly sell out before this even begins. That's been the case with practically every retailer we've been tracking in our where to buy the PS5 and where to buy the Xbox Series X guides.",
    "If you're not already a Walmart+ member, you can sign up for $12.95 per month. It might sound like a hefty price to pay when you aren't guaranteed to get a console, but this is sadly the point we've reached now in order to give yourself the best chance to get a PS5 or Xbox Series X.",
    "All signed up? Excellent. Now, you can follow the links below to the consoles, since the PS5 and Xbox Series X restock has just kicked off for Cyber Monday.",
    "Hopefully, you've been preparing for this moment, since diving into the event and scrambling to sign up isn't best practices for this type of restock. It's definitely wise to bookmark them and get yourself set up to go at least 15 minutes or more before 12pm ET. You'll want to make sure you're signed in and have given yourself enough extra time in case the site starts to struggle due to the incredible demand. Stay strong, though, and you could come away with a brand new console.",
    "This latest drop is part of the Walmart Cyber Monday sale that kicked off at 7pm ET on November 28. We've been filling our hub with all the latest offers when they go live so you don't miss out on one of the last opportunities to get a bargain before Christmas.",
    "If this latest restock comes and goes and you aren't successful this time, do stick with us as we'll be following all the latest restock news in our hubs dedicated to all the PS5 Cyber Monday deals and Xbox Series X Cyber Monday deals."
  ],
  "headers": {
    "5": "Cyber Monday PS5 and Xbox Series X restock"
  },
  "links": {
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "where to buy the PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "where to buy the Xbox Series X": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Walmart Cyber Monday sale": "https://www.techradar.com/cyber-monday/walmart-cyber-monday-deals-2020",
    "PS5 Cyber Monday deals": "https://www.techradar.com/cyber-monday/ps5-cyber-monday-deals",
    "Xbox Series X Cyber Monday deals": "https://www.techradar.com/cyber-monday/xbox-series-x-cyber-monday-deals-sales"
  }
}