{
  "source": "https://www.techradar.com/news/nfts-are-seriously-hot-right-now-but-were-falling-into-a-familiar-trap",
  "title": "NFTs are seriously hot right now, but we’re falling into a familiar trap",
  "category": "computing",
  "updated": "2021-06-16T08:12:57Z",
  "author": "joel-khalili",
  "summary": "Suddenly, everyone is talking about NFTs",
  "article": [
    "An eccentric new trend has swept the web over the last couple of weeks and it's all about traceable digital collectibles, also known as non-fungible tokens (NFTs).",
    "These tokens are unique representations of either digital properties - such as art, music, video, trading cards etc. - or physical items, stored primarily on the Ethereum blockchain.",
    "What makes them different from any other digital collectible (say, a Fornite skin) is that each NFT has a distinct signature that allows for ownership to be traced and verified with total confidence.",
    "NFTs have been around for years, but used only by a small tech-savvy minority. As a result of the Bitcoin bull run, however, these digital collectibles have begun to capture the attention of the public and gain traction with artists, who see them as an innovative way to monetize their works.",
    "By minting a limited supply of NFTs, creators can simulate a scarcity that is driving prices through the roof. Within the last month, for example, synth-pop artist Grimes has generated $6 million in NFT sales, while musician 3LAU sold an album of NFTs for $11 million.",
    "As per data from DappRadar, transaction volume across NFT marketplaces stands at $500 million for the last 30 days, compared to just $200 million for the entirety of 2020.",
    "While hype has brought visibility and custom to the space, which long-term NFT fanatics will celebrate, there are also dangers attached to the current level of hysteria.",
    "According to Oliver Carding, founder of CryptoKaiju, a company that sells NFT-backed vinyl toys, the cyclical nature of crypto trends means a bust will almost certainly follow the boom. And the parties that will suffer are not the celebrities minting the NFTs, but the people buying them up.",
    "“The crypto space has always been about empowering the underdog by removing the middleman, not about making Lindsay Lohan richer,” he told TechRadar Pro. “I’m not necessarily saying this is a bubble, because NFTs have been growing organically, but I think we’ll see the space follow a crypto boom cycle.”",
    "NFTs differ from other digital collectibles in that they act as an irrefutable proof of ownership and are not controlled by any single entity (i.e. they cannot be destroyed by switching off a server somewhere). They differ from other cryptocurrency assets, meanwhile, in that they are neither interchangeable nor divisible.",
    "If an asset is fungible, it can be freely exchanged with another identical version without any loss of value and can also typically be divided into smaller parts. For example, if two people were to swap a unit of Bitcoin with each other, no meaningful change has occurred, and each coin can also be broken down into smaller units called Satoshis.",
    "Non-fungible tokens, on the other hand, demonstrate ownership of a unique property and therefore have a unique value, and nor can they be sold off in parts.",
    "Many believe the first ever NFTs were attached to an Ethereum-based game called CryptoKitties, launched in late 2017. The goal of the game is to collect, trade and breed digital cats, each of which is tied to a unique token.",
    "While the concept of NFTs was technically applied by other projects first (e.g . CryptoPunks), CryptoKitties is credited with putting NFTs on the map, proving so popular at launch that it choked up the Ethereum network.",
    "“CryptoKitties really woke people up to the idea of collecting and trading digital assets. In terms of the first project to take NFTs outside the realms of niche, it’s 100% CryptoKitties,” explained Carding. “But while the NFT community has grown slowly since, it’s only in the last few months it has really taken off.”",
    "In the case of CryptoKaiju, which Carding started in 2018 as a hobby project, each NFT is attached to a real-world collectible. Here, the NFT is used to verify the authenticity of the physical vinyl toy (stamped with a tamper proof tag), preserving its potential value in secondary markets.",
    "CryptoKaiju NFTs can also be used in a similar way to Nintendo amiibos, transporting the vinyl toy character into compatible Ethereum-based games.",
    "While the concept of an NFT is relatively simple to understand, the harder question to answer is precisely why people are buying them, given the content attached to NFTs can be found elsewhere online.",
    "The common riposte is that this same question could be asked of physical art, images of which are also available on the web, but the obvious difference is that viewing art in-person is an entirely different experience than looking at a .jpg file online.",
    "According to Carding, however, the reason NFTs are proving so popular has little to do with the idea of purchasing something that the owner exclusively gets to enjoy. Instead, people are drawn to NFTs because they operate at the intersection of two distinct desires: to own and to collect.",
    "“People want to buy really scarce items from artists they like. This stuff isn’t being pumped out in the tens of thousands, it’s still quite small-scale,” Carding told us. “Owning something by your favorite artists is attractive to people; they see it as a way to connect.”",
    "While the image or video attached to the NFT might not be scarce, the NFT itself definitely is, and so the effect for the owner is the same.",
    "For veteran collectors, the ability to store valuable collectibles on a blockchain as opposed to in the garage is an undeniable benefit and so is the opportunity to bypass logistical hassles of trading real-world items.",
    "To illustrate his point, Carding gestured to Pokemon trading cards, which also recently enjoyed a surge in popularity. To sell a set of physical trading cards, he told us, the owner has to get them graded, list them on eBay and incur selling fees, as well as communicate with the buyer.",
    "“With digital collectibles, this whole process is pretty seamless,” he said. “You don’t have to store them a particular way [in order for them to retain value] and you don’t have to keep them in your house.”",
    "As the noise and excitement shows, NFTs have the potential to solve genuine problems for creators struggling to monetize their work, and so too for committed collectors. However, there are also plenty of reasons to be wary.",
    "“There is some absolutely brilliant stuff [in the NFT space] and I’m so pleased to see mainstream adoption, but there is an element of it being a little like the ICO boom of a few years back,” Carding warned.",
    "During this boom, investors pumped billions of dollars into new crypto projects in the hope the associated coins (akin to shares) would appreciate in value. Many of these projects were rotten, however, and a large number of people lost much if not all of their investment.",
    "In the same vein, Carding suggests, those spending thousands of dollars (or more) on NFTs in the hope of making a handsome return may find the value of the tokens falls through the floor when public attention turns elsewhere.",
    "As with the ICO boom, there are also plenty of poor-quality NFTs on the market. Many high-profile figures have rushed to mint tokens as a way to generate easy money, but much of the associated artwork is either slapdash or produced by another artist entirely.",
    "NFT owners also have to trust that the creator won’t generate another run of tokens for near-identical artwork, thereby devaluing the NFT they originally purchased.",
    "“It’s a bit exploitative,” said Carding. “You look through these marketplaces and you see younger artists struggling to monetize their work, and you can buy ten of their pieces for the cost of a very average piece by a celebrity. I think that’s toxic; it’s a case of jumping the shark.”",
    "In some instances, fraudsters have also created a run of NFTs in someone else’s name. When it emerges that the artist isn’t who they claim to be, the value of the NFT falls to nothing. And the problem is made worse by the anonymous nature of crypto transactions, which afford the buyer almost no recourse, unless they gain compensation from the marketplace.",
    "Finally, there’s the environmental factor. By virtue of the way the Ethereum blockchain currently operates (using a Proof-of-Work consensus mechanism), minting NFTs uses a huge amount of energy, equivalent to multiple weeks’ worth of an average individual’s usage.",
    "And as pointed out by artist Everest Pipkin, although a greater number of mining operations are turning to renewable energy sources, there remains the carbon cost attached to building renewable infrastructure in the first place.",
    "While it’s difficult to understand why someone might spend so much on a digital asset that can be easily replicated, NFTs appear to offer a solution to a genuine problem for creators and could yet become a permanent fixture in the world of digital art.",
    "They have also created a use case for blockchain that appeals to a demographic beyond just technologists, economists and investors.",
    "“The old quote is that blockchain will only really succeed until people don’t realize they are using it,” Carding noted. “And this is exactly what the best NFT marketplaces have achieved; it’s seamless.”",
    "As is common in the crypto ecosystem, however, there is a darker underbelly to the world of NFTs. The market will mature in time, but the potential for abuse and volatility of prices will likely see people burned in the process."
  ],
  "headers": {
    "9": "What makes NFTs special?",
    "17": "What's all the fuss about?",
    "25": "The problem with NFTs",
    "35": "A balancing act"
  },
  "links": {
    "NFTs": "https://www.techradar.com/news/what-is-an-nft-non-fungible-tokens-explained-and-why-you-shouldnt-dismiss-this-fad",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "data from DappRadar": "https://dappradar.com/blog/dapp-industry-report-february-2021",
    "CryptoKaiju": "https://cryptokaiju.io/",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "Proof-of-Work consensus": "https://www.techradar.com/news/ethereum-20-goes-live-next-month-heres-why-thats-a-huge-deal",
    "Everest Pipkin": "https://everestpipkin.medium.com/but-the-environmental-issues-with-cryptoart-1128ef72e6a3"
  }
}