{
  "source": "https://www.techradar.com/news/discord-threads-are-coming-tomorrow-to-make-sense-of-your-online-group-chats",
  "title": "Discord Threads are here to make sense of your online group chats",
  "category": "computing",
  "updated": "2021-07-28T02:06:23Z",
  "author": "john-loeffler",
  "summary": "About time",
  "article": [
    "*Update: Discord Threads is now live!",
    "Also, Discord reached out to us to update us on its active user base. It is now 150 million, not 140 million as originally stated. The original article is below.*",
    "Discord, the popular online chat app, announced on Twitter this afternoon that its highly anticipated conversation threading feature will launch tomorrow, way sooner than expected.",
    "Last week, we reported that the Discord Threads feature had been rolled out to Discord bot developers to help them integrate the new feature into their bot plug-ins. We thought that this meant the feature would be in an early testing phase of development and that it would be some time yet before it was rolled out to the rest of us.",
    "Turns out, we were wrong.",
    "The announcement, made on Twitter in a cheeky demonstration of Discord Threads in action, would be the biggest improvement to the app since November 2020, when Discord added the ability to replay to specific text in a conversation. Threads looks very much like an extension of that functionality.",
    "Discord exploded in popularity over the course of 2020 as tens of millions of people forced inside by the coronavirus pandemic turned to online communities to stay social.",
    "Originally the province of the online gaming community, Discord counted 56 million active monthly users in 2019. Today, that figure has soared to around 140 million, according to Venture Beat with 19 million active Discord servers on the platform.",
    "There have been some growing pains though, as the chatroom-like interface made conversations somewhat hard to follow at times, with parts of a conversation easily missed as text scrolled by.",
    "Discord sought to address to a degree with the Reply function, which ties comments to previous comments made earlier in a conversation stream , but replies are still very much a part of that stream. With Threads, these interactions will occupy their own space in the app's interface, making it much easier to have side conversations separate from the larger conversation taking place in the main room.",
    "It's a small feature, in the grand scheme of things, but it makes one of our favorite apps even better, starting tomorrow."
  ],
  "headers": {
    "6": "Discord Threads is finally here"
  },
  "links": {
    "we reported": "https://www.techradar.com/news/threads-are-finally-coming-to-discord",
    "Discord counted 56 million active monthly users in 2019": "https://www.businessofapps.com/data/discord-statistics/",
    "Venture Beat": "https://venturebeat.com/2020/12/17/discord-raises-100-million-as-its-social-hub-hits-140-million-users/"
  }
}