{
  "source": "https://www.techradar.com/news/will-your-apple-watch-get-the-watchos-8-update",
  "title": "Will your Apple Watch get the watchOS 8 update?",
  "category": "wearables",
  "updated": "2021-06-07T19:08:24Z",
  "author": "james-rogerson",
  "summary": "An upgrade for (almost) everyone",
  "article": [
    "Apple’s big annual software show – WWDC 2021 – is under way, and the keynote speech was packed full of big announcements, including watchOS 8, which is set to come with all sorts of updates. These include a new Mindfulness app (which replaces the Breathe app), new activity types in the Workout app, and a whole lot more.",
    "So if you’ve got an Apple Watch strapped to your wrist you might understandably be wondering whether you’ll be eligible for the update.",
    "The short answer is probably, as Apple is making watchOS 8 available to every device that can run watchOS 7 – meaning the Apple Watch 3 and above.",
    "Specifically then if you have an Apple Watch 3, Apple Watch 4, Apple Watch 5, Apple Watch 6, or Apple Watch SE, then you’ll be able to get watchOS 8 when it lands.",
    "That’s good news, and would usually be slightly surprising, as support for the oldest models often drops off with a new annual software release.",
    "That said, this year it’s not so surprising, since Apple still sells the Apple Watch 3, so it would be odd for the company not to support it for a while longer, and would probably also upset anyone who bought the device recently. Still, the Apple Watch 3’s days are surely numbered, and we’d be surprised if it gets watchOS 9 next year.",
    "As for when you’ll be able to get watchOS 8, you’ve likely got a while to wait, as although it has been announced, based on past form it probably won’t be released in finished form until September, probably alongside the Apple Watch 7, which is sure to run watchOS 8 out of the box.",
    "In the meantime there's a developer beta from today (June 7), and that will be followed by a public beta in July. But both of those could prove buggy and unstable, so in general we’d recommend waiting."
  ],
  "headers": {
    "4": "An expected update"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "watchOS 7": "https://www.techradar.com/news/watchos-74-news",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news"
  }
}