{
  "source": "https://www.techradar.com/news/who-needs-black-friday-smart-home-deals-when-these-amazon-switches-are-so-cheap",
  "title": "Who needs Black Friday smart home deals when these Amazon switches are so cheap?",
  "category": "smart-home",
  "updated": "2021-11-16T10:19:54Z",
  "author": "hamish-hector",
  "summary": "Make smart lighting basic",
  "article": [
    "Amazon’s new line of smart switches brings more affordable smart lighting to those using Alexa devices.",
    "The switches are part of the Amazon Basics range which aims to bring cheap yet reliable products to consumers. These Amazon smart switches come in four varieties: a single-pole switch ($17.99) and single-pole dimmer ($19.99) for controlling a light circuit from one panel, or a three-way switch ($18.99) and three-way dimmer ($20.99) for controlling a circuit from two panels.",
    "Rather than shelling out for lots of expensive smart bulbs, you can instead replace the light switch panel with one of Amazon’s new devices to achieve most of the same effects, giving you control of the bulbs with an app or voice commands. If you have your eye on this year’s Black Friday Alexa deals, then these new smart switches could be the perfect choice for giving your new assistant a bit more utility on the cheap.",
    "Unfortunately, if you’re a fan of Google Assistant or the Apple Homepod, you’re out of luck. The store page explains these switches work exclusively with Amazon Alexa devices, going against Amazon’s recent statement that it would be committing to the open smart home platform Matter as part of its “philosophy of flexibility, privacy, collaboration, and interoperability.”",
    "Right now the Amazon Basics smart switches are only available in the US, in keeping with the company’s US-first release strategy. We’ve reached out to Amazon to find out details of when the latest smart devices will be heading to other regions like the UK.",
    "Smart bulbs and smart switches are some of the earliest examples of smart home tech and have become a staple amongst those that want to modernize their home.",
    "However smart bulbs can be twice the price of regular bulbs (if not more) even with Black Friday deals and replacing your entire home in one go can be an expensive slog. Meanwhile, these smart switches offer most of the same functionality but at a much lower cost.",
    "If you aren’t interested in color-changing lighting – such as for use in a home office or kitchen – then smart switches are what we recommend. However, if you want a setup that offers multiple different lighting color options then you’ll need to go for smart bulbs that have this built-in.",
    "Even if you aren’t part of Amazon’s ecosystem (or aren’t a US resident) you can find smart switches that work with other brands of smart home assistants. However, we’d recommend checking out the customer reviews on the device before buying it if it's not a brand you recognize."
  ],
  "headers": {
    "5": "Analysis: The best Black Friday smart home purchase?"
  },
  "links": {
    "Alexa devices": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Amazon smart switches": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAmazon-Basics-Single-Neutral-Required%2Fdp%2FB095X911T8%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1241630657518667000-20",
    "Black Friday Alexa deals": "https://www.techradar.com/news/black-friday-amazon-echo-deals-new-releases-hit-lowest-prices-yet",
    "Google Assistant": "https://www.techradar.com/news/9-things-google-assistant-can-do-that-you-may-not-know-about",
    "Apple Homepod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Amazon’s recent statement": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1231657058819836400&xs=1&url=https%3A%2F%2Fdeveloper.amazon.com%2Fen-US%2Fblogs%2Falexa%2Fdevice-makers%2F2021%2F11%2Fsupport-for-matter-over-thread-coming-to-echo-and-eero-devices&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwho-needs-black-friday-smart-home-deals-when-these-amazon-switches-are-so-cheap",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}