{
  "source": "https://www.techradar.com/news/the-samsung-tab-s8-could-come-with-a-huge-screen-and-a-giant-battery",
  "title": "The Samsung Tab S8 could come with a huge screen and a giant battery",
  "category": "tablets",
  "updated": "2021-05-30T09:30:25Z",
  "author": "david-nield",
  "summary": "A plus plus model appears",
  "article": [
    "Going off the usual pattern of Samsung product launches, we should be seeing the Galaxy Tab S8 at some point this year – and a survey sent to Samsung users in South Korea has offered up some hints about what the 2021 Android tablet might have in store.",
    "As spotted by @FrontTron, posts on the South Korean social media Naver may have revealed some of the specs of three Galaxy Tab S8 models. Though a user survey is mentioned, it's still not completely clear where these specs come from, so treat them as speculative for the time being.",
    "If the leaked information can be relied upon, the Samsung Galaxy Tab S8 will be available with an 11-inch, a 12.4-inch, or a giant 14.6-inch display (LCD for the base model and OLED for the other two). The Galaxy Tab S7 has shown up with an 11-inch screen and a 12.4-inch screen, but the biggest size is new.",
    "There's a hefty battery capacity to go along with that massive display: 12,000mAh according to this latest leak. Battery capacity is said to be 8,000mAh on the smallest 11-inch model of the tablet, and 10,090mAh on the 12.4-inch version, which may well be called the Galaxy Tab S8 Plus.",
    "Digging deeper into the predicted specs, the two smaller versions of the Tab S8 are tipped to be coming with 8GB of RAM and either 128GB or 256GB of storage. Your options on the 14.6-inch model are said to be 8GB of RAM and 128GB or storage, or 12GB of RAM and 512GB of storage – high end specs indeed.",
    "This move to add a more premium model to the line-up is perhaps prompted by the recent launch of the M1-powered iPad Pro. The most expensive 12.9-inch version of Apple's tablet comes with as much as 16GB of RAM and a maximum storage capacity of 2TB.",
    "It looks as though Wi-Fi, 4G and 5G versions of the Samsung Galaxy Tab S8 are going to be available, all with 13MP+5MP rear cameras. The standard models are apparently coming with an 8MP selfie camera, while the biggest edition has an 8MP+5MP selfie camera for capturing wider shots.",
    "We've heard very little in the way of Tab S8 leaks up to this point, but the device could launch as soon as August if Samsung sticks to its usual release schedule. August could be a bumper month for Samsung, as we're also expecting the Galaxy Z Fold 3, the Galaxy Z Flip 3 and the Galaxy S21 FE to make an appearance.",
    "Via Notebookcheck"
  ],
  "headers": {
    "4": "iPad Pro rival"
  },
  "links": {
    "Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "@FrontTron": "https://twitter.com/FrontTron/status/1398303799748427780",
    "is mentioned": "https://twitter.com/ishanagarwal24/status/1398308338509631489",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Tab S8 leaks": "https://www.techradar.com/news/samsung-galaxy-tab-s8-gets-a-very-early-leak-from-samsungs-own-website",
    "Notebookcheck": "https://www.notebookcheck.net/Samsung-Galaxy-Tab-S8-Galaxy-Tab-S8-and-Galaxy-Tab-S8-Ultra-prices-and-specifications-revealed-by-a-new-leak.541574.0.html"
  }
}