{
  "source": "https://www.techradar.com/news/wandavision-episode-9-finally-revealed-the-scarlet-witch-costume-in-full",
  "title": "WandaVision episode 9 finally revealed the Scarlet Witch costume in full",
  "category": "entertainment",
  "updated": "2021-03-06T13:48:38Z",
  "author": "tom-power",
  "summary": "The Scarlet Witch has arrived",
  "article": [
    "The WandaVision season finale on Disney Plus pulled out all of the stops to wrap up this part of Wanda's story. Not only were most of the show's loose ends tied up, and mid-credits and post-credits stingers shown that set up future MCU projects, but we also saw Wanda finally assume the mantle of the Scarlet Witch.",
    "Of course, becoming this superpowered being wouldn't be complete without a new costume. We already saw a tease of the Scarlet Witch's outfit in WandaVision episode 8 during Wanda's encounter with the Mind Stone as part of Hydra's experiments. Now, though, her new look has been revealed.",
    "Below, we'll talk about the significance of that, and how Wanda's new persona relates to the comics that inspired her on-screen explots. Be aware that plot spoilers for WandaVision episode 9 follow from this point on. If you don't want this reveal ruined, you should turn back now.",
    "Wanda obtained her new costume mid-battle with Agatha Harkness, her nemesis in the series. As we saw during the showdown, Wanda began throwing her chaos magic at the Hex's perimeter and Agatha, claiming that she didn't want the Scarlet Witch's power. Agatha then consumed the energy that Wanda threw at her, which drained Wanda in the same way that Agatha absorbed the magic powers of her witches' coven over 400 years earlier.",
    "Believing that she had won, Agatha then turned her magic on Wanda – but she found she was unable to use her powers. It was then revealed that the rest of Wanda's chaos magic, which she had thrown at the Hex, was used to create runes. As Wanda states, only the witch that casts these runes can use her magic – a tactic that references Agatha's hold on Wanda in her witch's lair back in episode 8.",
    "Wanda tells Agatha that she doesn't need to be told who she is. As she utters these words, the Scarlet Witch's headpiece – akin to Wanda's Halloween costume from earlier in the season – begins to form. As her eyes glow red, Wanda starts absorbing her magic back from Agatha, draining her of her abilities, and becoming more powerful. Doing so confirms her mantle as the Scarlet Witch, and reveals her superhero costume for the first time.",
    "For one, it means that she's finally accepted who she was meant to be. As the Scarlet Witch, Wanda is now the most powerful sorceress in the universe. Doctor Strange might have something to say about that, but we did say 'sorceress', not 'sorcerer'.",
    "There is much we can speculate about where Wanda goes from here. We know that she'll appear alongside Doctor Strange in his Multiverse of Madness movie, and there is the potential for a second season of WandaVision down the line, if Marvel and Disney Plus choose to make it.",
    "Additionally, the finale's post-credits scene shows that Wanda is already learning about her new, more powerful abilities, so we can expect her to be even more daunting for friend and foe alike from now on.",
    "Agatha's \"You don't know what you've done\" line as Wanda becomes the Scarlet Witch hints at a potentially darker path for her, but we won't know which direction Wanda will go in until she turns up in Doctor Strange 2."
  ],
  "headers": {
    "3": "WandaVision's Scarlet Witch costume explained",
    "6": "What does the Scarlet Witch mantle mean for Wanda?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "mid-credits": "https://www.techradar.com/news/wandavision-episode-9-mid-credits-scene-explained",
    "tease": "https://www.techradar.com/news/wandavision-episode-8-just-changed-a-major-part-of-wandas-origin-story",
    "second season": "https://www.techradar.com/news/wandavision-season-2-what-we-know-after-the-finale"
  }
}