{
  "source": "https://www.techradar.com/news/google-sheets-is-about-to-become-much-easier-to-use",
  "title": "Google Sheets is about to become much easier to use",
  "category": "computing",
  "updated": "2021-10-27T14:11:13Z",
  "author": "sead-fadilpasic",
  "summary": "Functionality and cosmetic changes coming to Google Sheets",
  "article": [
    "To make its spreadsheet software easier to use, particularly on devices with smaller screen real estate, Google has decided to make a couple of functional, as well as cosmetic changes to Google Sheets.",
    "For starters, the menu bar, as well as the right-click menu, have both been shortened to better fit on a smaller screen, and to prevent menu items from being hidden off-screen.",
    "Some features were reorganized and moved to “more intuitive” locations, Google said. For example, freezing a row or a column can now be done directly from the right-click menu.",
    "Menu items have gotten new icons, while the descriptions of some items in the menu are shorter. Both of these changes have been made to help users locate features more easily.",
    "Changes are across all menus, including File, Edit, View, Insert, Format, Date, Tools, Extensions, Help, and Accessibility.",
    "“The new design improves findability of key features, making it quicker and easier to use Sheets, especially on devices with smaller screens,” Google explained in the blog post. “Some of your favorite menu items may have moved a little, but all existing functionality is still available. We hope that their new home will be more intuitive and make it easier and faster to navigate the product.”",
    "Google has been keeping a steady pace with updates for Sheets, Docs, and other tools in its Workplace productivity suite. In June 2021, it enabled users to review comments and conversation threads in a sidebar, apply filters to find the most relevant comments and page through comment threads in a spreadsheet in the comment overlay.",
    "It later introduced intelligent formula suggestions for its office software, based on the data in question and the user’s initial input, making deploying formulas and functions simpler for less advanced users.",
    "Effective immediately, but rolled out gradually over the next two weeks, the changes will be turned on by default for all users, without the possibility for a rollback.",
    "You can also check out our list of the best collaboration software out there"
  ],
  "headers": {
    "3": "Google Sheets new features"
  },
  "links": {
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "Google Sheets": "https://www.techradar.com/reviews/google-sheets",
    "productivity suite": "https://www.techradar.com/best/best-productivity-apps",
    "office software": "https://www.techradar.com/best/free-office-software",
    "best collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}