{
  "source": "https://www.techradar.com/news/lowes-4th-of-july-sale-deals-2020-still-available-today",
  "title": "Lowe's 4th of July sale 2021: the best deals still available today",
  "category": "smart-home",
  "updated": "2021-07-05T09:49:39Z",
  "author": "alex-whitelock",
  "summary": "The Lowe's 4th of July sale is still ongoing for a few more days",
  "article": [
    "Even though we've passed the calendar date itself, the Lowe's 4th of July sale is still ongoing for a few more days. So, if you missed the chance to get some new appliances, house supplies, or items for the yard on the day, you've still got some time to browse the thousands of products that are still on sale today. Just below you can see a quick roundup of every category we've found that's still featured in the Lowe's 4th of July sale. Further down the page, you'll also find a few highlights that we've picked out as particularly good buys today.",
    "As we've already mentioned, this year's Lowe's 4th of July sale is looking really great for larger appliances, power tools, and bigger items like patio furniture sets and grills. Most of these items are also covered under Lowe's free delivery options too, which makes them particularly good items to shop for online.",
    "Of course, it's not just big bulky expensive items that you'll find discounted in today's Lowe's 4th of July sale - there are also thousands of smaller items on sale. In particular, we'd recommend checking out the smart home section for big price cuts on Google Nest and Ring devices, or the Microwave section for similarly excellent discounts on top brands like GE and Whirlpool.",
    "Just below you'll find a full roundup of each section featured in the Lowe's 4th of July sale this year - with links and quick summaries. Further down the page, you'll also find a few highlights that we've picked out as especially good bargains right now.",
    "Note, most of these Lowe's 4th of July sales will be ongoing until the 7th of July, although some may be ending well before that date. Each day new items go on sale too - especially over at the Lowe's deal of the day page, so we'd definitely recommend bookmarking this page and revisiting to see what's new.",
    "If you don't find what you're looking for, we recommend heading over to our main 4th of July sales roundup, where you'll find huge savings across a whole range of categories and retailers."
  ],
  "headers": {
    "4": "Lowe's 4th of July sale 2021",
    "6": "Lowe's 4th of July sale 2021: highlights"
  },
  "links": {
    "smart home section": "https://lowes.sjv.io/c/221109/897039/12374?subId1=trd-us-1646082937514067000&sharedId=trd-us&u=https%3A%2F%2Fwww.lowes.com%2Fpl%2FSave-On-Smart-Home-Deals%2F3486106886",
    "Microwave section": "https://lowes.sjv.io/c/221109/897039/12374?subId1=trd-us-1029465123301793000&sharedId=trd-us&u=https%3A%2F%2Fwww.lowes.com%2Fpl%2FSave-now%2F4294594589%3Fcatalog%3D4294715798",
    "deal of the day page": "https://lowes.sjv.io/c/221109/897039/12374?subId1=trd-us-1398046383435703000&sharedId=trd-us&u=https%3A%2F%2Fwww.lowes.com%2Fl%2Fdaily-deals.html%3Fint_cmp%3DHome%3AA2%3ANoDivision%3AOther%3AFW22_21_DOTD_Teaser",
    "4th of July sales": "https://www.techradar.com/deals/the-best-4th-of-july-sales-and-deals"
  }
}