{
  "source": "https://www.techradar.com/news/the-latest-panasonic-toughbook-is-more-rugged-and-powerful-than-ever",
  "title": "The latest Panasonic Toughbook is more rugged and powerful than ever",
  "category": "computing",
  "updated": "2021-09-09T18:35:18Z",
  "author": "anthony-spadafora",
  "summary": "Next gen Toughbook 55 offers improved performance, connectivity and security",
  "article": [
    "Panasonic has updated one of its most powerful rugged laptops and the latest version of the company's Toughbook 55 now features improved performance, connectivity and security.",
    "First launched back in 2019, the Toughbook 55 set a new benchmark for mobile computing by giving users the ability to customize their device for different tasks while in the field through its modular design. The next iteration of the device maintains Panasonic's modular approach though it has been updated with the latest technologies to better suit users in field services as well as the automotive, emergency and security industries.",
    "The second gen Toughbook 55 now includes enhanced connectivity with eSIM as well as the option for 4G to deliver dual SIM capabilities. Panasonic has also tried to future-proof the device by adding support for Thunderbolt 4 along with Wi-Fi 6 and Bluetooth 5.1 connectivity thanks to the inclusion of Intel's AX201 wireless chip.",
    "The addition of an 11th Gen Intel Core i5-1145G7 Processor (with Intel vPro Technology) has led to a significant performance boost for the Toughbook 55 and it is now 19 percent faster than its predecessor. Storage has also been improved as a result of the inclusion of an NVMe OPAL SSD which self-encrypts in real time while Microsoft Secured-core PC technology makes the device even more secure.",
    "Support for Intel Iris Xe Graphics allows Toughbook 55 users to boost graphics capabilities but they can also configure the device on the move as Panasonic has retained the device's modular approach.",
    "A smartcard reader, additional storage or a DVD or Blu-Ray drive can be added with a simple switch, fit and click into the Toughbook Universal Bay while a front expansion area can be used to quickly integrate a fingerprint reader, HF-RFID or regular smartcard reader as well as a second battery. Thankfully, all of the peripherals used with the first generation Toughbook 55 remain compatible with Panasonic's upgraded device.",
    "The Toughbook 55 weighs 2.08kg and the device has a thickness of 32.8mm while its handle makes it easy to take with you in the field. Additionally, it has an enhanced Ingress Protection Rating (IP53) against dust and water splash and is protected against drops up to 91cm. The Toughbook 55 can also comfortably operate in temperatures ranging from -29°C to +60°C*.",
    "Senior product marketing manager at Panasonic Mobile Solutions Business, Dirk Weigelt provided further insight on the new version of the Toughbook 55 in a press release, saying:",
    "“The TOUGHBOOK 55 notebook was a game-changer, taking mobile computing to new levels of flexibility, productivity and sustainability and the updated generation will further enhance its reputation. Users can customise their device on the move to suit the needs of their job role at the time. While buyers can invest in the device knowing that it has the flexibility to adapt to the changing needs of the business and the workforce over the long-term.”",
    "The latest Toughbook 55 is available in three options: HD, Full-HD and Full HD with Touchscreen. Prices start from €1,988 / £1,799 + VAT and the new device is now available to purchase through Panasonic's authorized reseller partners."
  ],
  "headers": {
    "4": "Next gen Toughbook 55"
  },
  "links": {
    "rugged laptops": "https://www.techradar.com/news/best-rugged-laptops",
    "Toughbook 55": "https://www.techradar.com/reviews/panasonic-toughbook-55",
    "eSIM": "https://www.techradar.com/how-to/what-is-an-esim-and-why-would-you-need-one",
    "Thunderbolt 4": "https://www.techradar.com/news/thunderbolt-4-what-you-need-to-know-about-next-generation-connectivity",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019",
    "Microsoft Secured-core PC": "https://www.techradar.com/news/microsofts-secured-core-pcs-will-defend-against-firmware-level-threats",
    "Intel Iris Xe Graphics": "https://www.techradar.com/news/intel-xe-graphics-cards",
    "press release": "https://www.realwire.com/releases/Smarter-Faster-More-Secure-The-Latest-TOUGHBOOK-55-Upgrade"
  }
}