{
  "source": "https://www.techradar.com/news/the-legend-of-zelda-game-and-watch-what-it-is-and-where-to-buy-it",
  "title": "The Legend of Zelda Game & Watch: what it is and where to buy it",
  "category": "gaming",
  "updated": "2021-06-16T15:34:59Z",
  "author": "samuel-tolbert",
  "summary": "Launching in November",
  "article": [
    "During the E3 2021 Nintendo Direct presentation, Nintendo showed off a curious retro device for Zelda fans to pick up later this year – modelled after the Game & Watch systems of old – in celebration of the 35th anniversary of The Legend of Zelda franchise.",
    "It's a Game & Watch system themed after The Legend of Zelda, in a similar vein to the previous Game & Watch done for the 35th anniversary of the Mario franchise in 2020.",
    "Here's everything you need to know about The Legend of Zelda Game & Watch system.",
    "A Game & Watch system is exactly what it sounds like. It's a small device that has a couple of games loaded on it but also functions like a clock, with the numbers stylized to fit whatever is happening in-game on screen.",
    "The first Game & Watch systems were developed by Nintendo and released back in 1980, selling over 43 million units through 1991. Titles included on these systems were quite simple, including games like Vermin, Lion, Egg and the controversial Fire Attack.",
    "You can check the device out in the Nintendo Direct below, around the 34:45 mark.",
    "The Legend of Zelda Game & Watch is currently slated to be available on November 12, 2021.",
    "The system will cost $49.99 / £44.99 / $79.95 and it's currently available to pre-order in the US (BestBuy, GameStop) as well as the Nintendo UK and Nintendo Australia stores.",
    "The Legend of Zelda Game & Watch includes three classic games from The Legend of Zelda franchise, which makes sense since it's been designed as a celebration of the series and is being release for the series' 35th anniversary.",
    "The three games included are:",
    "Both the English and Japanese versions of all three games have been included, so you can choose the one you'd like to experience.",
    "The Legend of Zelda first launched in 1987. Zelda II: The Adventure of Link released in 1988, while the original GameBoy version The Legend of Zelda: Link's Awakening was released in 1993.",
    "This device isn't the only way that Nintendo is celebrating the 35th anniversary of The Legend of Zelda. An HD re-release of The Legend of Zelda: Skyward Sword for Nintendo Switch is currently scheduled to arrive on July 12, 2021. This update features 60fps gameplay, as well as alternate control schemes that accommodate the Nintendo Switch instead of the original Wii controls.",
    "Rumors and reports indicate that re-releases of The Legend of Zelda: Twilight Princess and The Legend of Zelda: Wind Waker are in development as well, though Nintendo stated during E3 2021 that no further games will be announced for this year.",
    "Further out is the widely-anticipated sequel to The Legend of Zelda: Breath of the Wild. While it still doesn't have an official title, the game is being \"aimed\" for a 2022 release date, so we'll keep you updated if anything changes there."
  ],
  "headers": {},
  "links": {
    "E3 2021 Nintendo Direct": "https://www.techradar.com/news/nintendo-direct-e3-2021-the-key-announcements-you-need-to-see",
    "35th anniversary of The Legend of Zelda franchise": "https://www.techradar.com/news/from-breath-of-the-wild-2-to-remakes-10-predictions-for-the-legend-of-zeldas-35th-anniversary",
    "BestBuy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1116209109090814700&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fnintendo-game-watch-the-legend-of-zelda%2F6469083.p%3FskuId%3D6469083&article_name=The%20Legend%20of%20Zelda%20Game%20%26%20Watch%3A%20what%20it%20is%20and%20where%20to%20buy%20it&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-legend-of-zelda-game-and-watch-what-it-is-and-where-to-buy-it",
    "GameStop": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24348&u1=trd-us-4376587777754843600&murl=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Farcade%2Fproducts%2Fgame-and-watch-legend-of-zelda%2F11149361.html",
    "Nintendo UK": "https://www.awin1.com/awclick.php?awinmid=12777&awinaffid=103504&clickref=trd-us-5626739554561454000&p=https%3A%2F%2Fstore.nintendo.co.uk%2Fen_gb%2Fgame-and-watch-the-legend-of-zelda-000000000010007326.html",
    "Nintendo Australia": "https://www.google.com/search?q=nintendo+au+game+and+watch+zelda&sxsrf=ALeKk03nbK2y0etRI0Tb9UUAKyTrexG83Q%3A1623857848304&ei=uBrKYNP7EaL_7_UPzq6m6A8&oq=nintendo+au+game+and+watch+zelda&gs_lcp=Cgdnd3Mtd2l6EAMyCAghEBYQHRAeMggIIRAWEB0QHjIICCEQFhAdEB4yCAghEBYQHRAeOgcIIxCwAxAnOgcIABBHELADOgYIABAWEB5QnQlY1RBgmRFoAXACeACAAVuIAYoEkgEBNpgBAKABAaoBB2d3cy13aXrIAQnAAQE&sclient=gws-wiz&ved=0ahUKEwjTt9rxvZzxAhWi_7sIHU6XCf0Q4dUDCA4&uact=5",
    "he Legend of Zelda: Skyward Sword for Nintendo Switch": "https://www.techradar.com/news/the-legend-of-zelda-skyward-sword-hd-for-nintendo-switch-everything-you-need-to-know",
    "sequel to The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/breath-of-the-wild-2"
  }
}