{
  "source": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-lands-a-big-name-composer",
  "title": "Doctor Strange in the Multiverse of Madness lands a big-name composer",
  "category": "entertainment",
  "updated": "2021-02-18T17:42:57Z",
  "author": "rhys-wood",
  "summary": "Raimi and Elfman are at it again",
  "article": [
    "Marvel fans excited for the upcoming Doctor Strange in the Multiverse of Madness movie can be rest assured that the soundtrack is in safe hands with composer Danny Elfman.",
    "The Doctor Strange sequel is highly anticipated among Marvel Cinematic Universe fans, not least because it’s being directed by Sam Raimi, who previously directed arguably two of the best Spider-Man movies (Spider-Man and Spider-Man 2) as well as the original Evil Dead trilogy.",
    "This isn’t the first time Raimi and Elfman have collaborated on a project. Elfman also composed the music for the aforementioned Spider-Man movies. Elsewhere, Elfman provided the score for Tim Burton’s Batman and Batman Returns. The composer, then, is no stranger to making music for superhero movies.",
    "In an interview with Inverse, Danny Elfman touched on the music he was working on for Doctor Strange in the Multiverse of Madness, saying: “I am starting to do bits of pre-work for Doctor Strange 2 that Sam Raimi's directing [...] Even though I don't start it for some months, there's bits of recorded music they need for the sets.\"",
    "Doctor Strange in the Multiverse of Madness seems to be in good stead, then, with this promising director and composer combo. The plot of the movie will perhaps address occurrences from other Phase 4 projects like WandaVision and the upcoming third Tom Holland-led Spider-Man movie.",
    "Doctor Strange in the Multiverse of Madness is currently scheduled for a March 25 2022 release."
  ],
  "headers": {
    "3": "Stranger things can happen"
  },
  "links": {
    "Inverse": "https://www.inverse.com/entertainment/danny-elfman-doctor-strange-2-multiverse-of-madness-score-music"
  }
}