{
  "source": "https://www.techradar.com/news/the-worlds-most-powerful-13-inch-gaming-laptop-is-now-on-sale-for-the-first-time",
  "title": "The world's most powerful 13-inch gaming laptop is now on sale for the first time",
  "category": "computing",
  "updated": "2021-10-11T12:31:52Z",
  "author": "alex-whitelock",
  "summary": "The Asus ROG Flow punches far above its weight",
  "article": [
    "The Asus ROG Flow X13 is, quite possibly, the most powerful 13-inch gaming laptop on the market right now - and it's on sale for $1,349.99 (was $1,499.99) at Best Buy.",
    "[Update 10/11] This deal has now expired - sorry folks! Be sure to check in at our main cheap gaming laptop deals page to see what else is on sale this week.",
    "This is the first time we've seen this extremely popular (and unique) gaming laptop go on sale and needless to say the lowest price yet.",
    "Featuring an absurdly powerful line-up of specs including an RTX 3050 Ti graphics card, 1TB SSD, 16GB of RAM, and AMD Ryzen 9 5900HS processor, the Asus ROG Flow X13 is a fantastic choice if you're looking for a lightweight machine that doesn't skimp on power.",
    "It's also featuring a 120Hz display and 2-in-1 form factor - something that you literally won't find on any other gaming laptop (literally anywhere). Is it a gimmick? Well, we can't see many triple AAA titles making use of the touchscreen, but it's great if you want to kick back and play with a controller - simply turn that keyboard on its face and use it as a handy stand.",
    "Of course, being a 13.4-inch laptop means you won't get quite the same gaming performance as the usual 15.6-inch machines - it is, after all, running on way less power. That said, as a lightweight machine for video editing, music production, and other intensive tasks (with a bit of gaming on the side), it's an incredibly compelling option.",
    "13-inch gaming laptops are a real rarity, with the longstanding Razer Blade Stealth 13 being the only serious competitor to the Asus ROG Flow X13. Both are superb choices if you're looking for that premium ultrabook that'll handle a bit of gaming on the side, but when it comes to overall power (and value), Asus has Razer beat in our books.",
    "Not only does the Flow X13 have a more powerful CPU (Ryzen 8 vs Core i7), graphics card (RTX 3050 Ti vs GTX 1650), but it's also cheaper (the Blade 13 is $1,799). Plus, it also features that versatile 2-in-1 form factor. In short, it's absolutely awesome value for what you're getting.",
    "Outside the US? See the best gaming laptop deals in your region just below."
  ],
  "headers": {
    "6": "Gaming laptop deals: Asus ROG Flow"
  },
  "links": {
    "for $1,349.99 (was $1,499.99)": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1064483652958978600&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fasus-rog-13-4-touchscreen-gaming-laptop-amd-ryzen-9-16gb-memory-nvidia-rtx3050-ti-v4g-graphics-1tb-ssd-off-black-off-black%2F6452915.p%3FskuId%3D6452915&article_name=The%20world's%20most%20powerful%2013-inch%20gaming%20laptop%20is%20now%20on%20sale%20for%20the%20first%20time&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-worlds-most-powerful-13-inch-gaming-laptop-is-now-on-sale-for-the-first-time",
    "cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "Razer Blade Stealth 13": "https://www.techradar.com/reviews/razer-blade-stealth-13-late-2020-review",
    "is $1,799": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-1022563029118386600&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fgaming-laptops%2FRazer-Blade-Stealth-13%2FRZ09-03272E12-R3U1"
  }
}