{
  "source": "https://www.techradar.com/news/next-wordpress-release-delayed-after-large-red-flags-identified",
  "title": "Next WordPress release delayed after 'large red flags' identified",
  "category": "pro",
  "updated": "2021-11-26T16:56:22Z",
  "author": "mayank-sharma",
  "summary": "The release of WordPress 5.9 has been pushed back from mid-December to late January",
  "article": [
    "The WordPress developers have decided to push back the release of the next major version of the popular content management system (CMS) to January, 2022, after some developers expressed concern about the pace of development.",
    "“I think there are some large red flags here that some things are not ready for 5.9….Overall, it seems like right now we are rushing things in a dangerous way,” wrote Addison Stavlo, a contributor to WordPress’ Gutenberg editor.",
    "The original plan was to release WordPress 5.9 in mid December, 2021. However, things weren’t smooth during the alpha release cycle, forcing core developers to make several changes.",
    "Not impressed by the changes to “so many things at the last minute,” Stavlo wondered why delaying the release wouldn’t be a better idea than making “regrettable decisions.”",
    "As she announced the revised schedule Tonya Mork, Core Tech Lead for the 5.9 release, shared that the team had two options; either move the major features that had unresolved issues to the WordPress 6.0 release, or delay the release of WordPress 5.9.",
    "After careful deliberation, the core developers decided that the issues would be best handled now than later.",
    "“The 6.0 release isn’t due until April 2022—too long for the community to wait for them [the features]. After processing this list of issues, Core Editor team saw the features could ship in 5.9 with the revised schedule. This decision, to delay the 5.9 release, was not made lightly,” explains Mork.",
    "5.9 is still in feature freeze, and Mork stresses that the developers will use the elongated development period to iron out the issues and help 5.9 get to a Stable state.",
    "Build your websites with the help of these best Wordpress website builders and use these best WordPress hosting providers to host them"
  ],
  "headers": {
    "3": "Better late than sorry"
  },
  "links": {
    "WordPress": "https://www.techradar.com/reviews/wordpresscom",
    "CMS": "https://www.techradar.com/best/cms",
    "wrote": "https://github.com/WordPress/gutenberg/issues/36556#issuecomment-971715273",
    "original plan": "https://make.wordpress.org/core/2021/09/03/wordpress-5-9-planning-roundup/",
    "careful deliberation": "https://wordpress.slack.com/archives/C02JUSF02TT/p1637077431164600",
    "list of issues": "http://github.com/WordPress/gutenberg/issues/36556",
    "explains": "https://make.wordpress.org/core/2021/11/22/wordpress-5-9-revised-release-schedule/",
    "best Wordpress website builders": "https://www.techradar.com/best/wordpress-website-builder",
    "best WordPress hosting providers": "https://www.techradar.com/news/best-wordpress-hosting-providers"
  }
}