{
  "source": "https://www.techradar.com/news/the-latest-google-pixel-6-leaks-include-images-promos-and-specs",
  "title": "The latest Google Pixel 6 leaks include images, promos and specs",
  "category": "phones",
  "updated": "2021-10-19T10:25:53Z",
  "author": "david-nield",
  "summary": "Another day, another bunch of Pixel 6 leaks",
  "article": [
    "We're going to miss these Google Pixel 6 leaks when the phone gets unveiled on October 19 – there have been an awful lot of them, and today we've got yet more leaks to tell you about, revealing more about the phone's specs and revealing some of Google's official marketing materials.",
    "First up is well-known tipster @_snoopytech on Twitter, with a datasheet for the standard Pixel 6 model: it reveals a display size of 6.4 inches, a resolution of 2340 x 1800 pixels, 8GB of RAM, 128GB of internal storage, and dimensions of 160.4 mm x 75.1 mm x 8.2 mm (6.31 inches x 2.96 inches x 0.32 inches) as well as various other details.",
    "If you're wondering how a phone with those dimensions looks in the hand, we've got you covered there too: courtesy of @evleaks, we've got a host of new pictures of both the Pixel 6 and the Pixel 6 Pro. The images cover all the colors that the phones are expected to come in, plus lifestyle shots of them being used.",
    "The pictures follow the usual template for promotional material: we've got images of people using the phones to make calls, taking photos with the phones, getting important business done with the phones, and gazing off into the middle distance while holding one of the latest Pixels.",
    "That still isn't the end of the current batch of leaks. Back with @_snoopytech_ again, we have what looks like a 30-second trailer for the Google Pixel 6 Pro. It shows off two of the expected features: Live Translate, for translating foreign languages with or without an internet connection, and Magic Eraser, for removing objects from photos with a tap.",
    "This all means that there's not much for Google left to reveal when Tuesday rolls around, but we will of course bring you all the announcements and details as they are made official. In the meantime, check out everything you can expect at the Google Pixel 6 event.",
    "It's very early to be making judgments about the Google Pixel 6 and the Pixel 6 Pro: all we have to go off are information and images, both from Google and from the multitude of leaks around the phones. We're yet to hold the phone or put it through its paces.",
    "However, the early signs are good. While the Google Pixel 5 was by no means a bad phone, there was a sense last year that Google was treading water to some extent – and the limited launch of the Google Pixel 5a backs up that idea (though to be fair to Google, there is a global pandemic happening).",
    "With the Pixel 6 and the Pixel 6 Pro, it would seem that Google is about to make a much bigger splash. If the leaks are correct, these phones are going to come with some top-tier specs and a slew of useful, AI-powered features on board.",
    "What's more, Google looks to have got the design of the handsets right as well. That thick camera visor won't be to everyone's taste, but it is at least something different in a market that has got rather stale in terms of aesthetics. We're looking forward to giving the Pixel 6 and the Pixel 6 Pro full tests when the time comes."
  ],
  "headers": {
    "3": "Promo materials",
    "6": "Opinion: the Pixel is back?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "@_snoopytech": "https://twitter.com/_snoopytech_/status/1448701408467951616",
    "@evleaks": "https://twitter.com/evleaks/status/1449129636814856194",
    "@_snoopytech_": "https://twitter.com/_snoopytech_/status/1449174510326923265",
    "everything you can expect at the Google Pixel 6 event": "https://www.techradar.com/news/google-pixel-6-event"
  }
}