{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-isnt-even-out-yet-and-were-hearing-our-first-xperia-1-iv-rumors",
  "title": "Sony Xperia 1 III isn't even out yet and we're hearing our first Xperia 1 IV rumors",
  "category": "phones",
  "updated": "2021-05-27T09:26:31Z",
  "author": "tom-bedford",
  "summary": "Selfie camera news",
  "article": [
    "Want to know how good the Sony Xperia 1 III is? Us too, because we're still waiting to test it out - but it sounds like Sony has some thoughts on the front-facing camera, judging by our first Sony Xperia 1 IV leak.",
    "Yep, the company's 2021 flagship isn't even out and we're hearing about the 2022 one. According to a leaker on Chinese social media platform Weibo, Sony is planning to replace the Xperia 1 III's front-facing camera sensor for the next model for something it made itself.",
    "You see, while Sony is a big smartphone camera sensor maker, its own phones often use Samsung sensors too. The Xperia 1 has three Samsung sensors and one Sony one, the Xperia 1 II has two from each company, the Xperia 1 III has three Sony sensors and a Samsung one only for the front camera, and by the sounds of it the Xperia 1 IV will complete Sony's takeover of its own phone with a clean flush of all the sensors.",
    "Take this leak with an unhealthy pinch of salt, as the leaker is unfamiliar to us, but judging by the patterns it makes sense.",
    "It would be hard to say a Sony sensor is better than a Samsung one for selfies - both have benefits and negatives, and only an expert would really notice a difference anyway.",
    "In fact, it's likely Sony is using its own sensors instead of Samsung ones just so it doesn't have to pay loads of money to a rival company.",
    "There might be some photo differences though - a marriage of hardware and software can result in great things, so we could see better selfies or a smarter portrait mode.",
    "The Sony Xperia 1 IV is likely at least a year out - as we've said, the Xperia 1 III isn't even out yet - so if this news has you wishing for the fourth-gen phone, you're going to be waiting a while. We'll bring you more leaks if and when they pop up."
  ],
  "headers": {
    "4": "Will this make any difference?"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Weibo": "https://weibo.com/1862207527/Khb23zb3Y?type=comment",
    "Xperia 1": "https://www.techradar.com/reviews/sony-xperia-1-review",
    "Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review"
  }
}