{
  "source": "https://www.techradar.com/news/now-loki-has-ended-lets-rank-the-marvel-disney-plus-shows-so-far",
  "title": "Now Loki has ended, let's rank the Marvel Disney Plus shows so far",
  "category": "entertainment",
  "updated": "2021-07-19T00:04:44Z",
  "author": "tom-power",
  "summary": "Did Loki beat WandaVision, or is Falcon and the Winter Soldier our favorite MCU show so far?",
  "article": [
    "We're only halfway through 2021, and already we've seen three TV series set in the Marvel Cinematic Universe – and what a treat they've been. Even in their lowest moments, these series have offered the sort of all-consuming cultural obsession that we sorely needed after TV production shut down last year. At their best, they suggest the MCU could be at its most exciting on the small screen, as writers and directors let loose with bigger and more experimental concepts than we've been seeing in Marvel Studios' two-hour movies.",
    "Marvel is far from done with TV in 2021, too. It's already been confirmed that What If...?, Ms Marvel and Hawkeye are intended to release this year, so we've still got a lot to look forward to. With this first wave of shows cleared, though, we decided to rank WandaVision, Falcon and the Winter Soldier and Loki – TechRadar's Entertainment Writer Tom Power and Senior Entertainment Editor Samuel Roberts agreed on the order below, and talked through why some shows worked better than others.",
    "Tom Power: This is the most grounded of Marvel’s three TV shows to date – I think Hawkeye will be in stylized in a similar way, too – and, while it had some good moments, it didn’t have many big moments that really made me think “wow, this is a big deal.”",
    "Sure, there was that shocking moment in episode 4, where John Walker’s Captain America murders one of the Flag Smashers, and we did get an unexpected cameo from Veep’s Julia Louis-Dreyfus, which was a welcome surprise. Outside of some humorous moments between Sam (Anthony Mackie) and Bucky (Sebastian Stan), and the series’ hard hitting-but-necessary exploration of racism in modern day America, though, I felt there was something lacking from The Falcon and the Winter Soldier compared to Marvel’s other TV offerings. You had similar thoughts, particularly regarding the show’s antagonists, right, Sam?",
    "Samuel Roberts: Yes, this series had a real problem when it came to focusing on one villain. Having Helmut Zemo, John Walker and the Flag Smashers made the series too busy, and frequently pushed the show's leads aside – generally speaking, The Falcon and the Winter Soldier felt like a weaker version of one of the Russo brothers' Captain America movies to me. I honestly hoped it would be the best one of the lot, since it was originally scheduled to go first, but it's not even close to being Marvel's strongest work.",
    "The Flag Smashers were some of the worst villains in the MCU's history – they blew innocent people up in a supply depot, then acted shocked when one of their own people got killed by Walker. Then the series showed us that Sam was unwilling to fight their leader, Karli Morgenthau, due to...what? Some kind of sympathy? If someone kills a load of civilians with a bomb, they're probably not a person who deserves a second chance. The show's portrayal of good and bad was incredibly muddled. I found that frustrating as a viewer.",
    "What I really wanted from this show was something I only got little glimpses of: Sam and Bucky being pals and hanging out, which we finally got to see more of towards the end of this series as they spruced up a boat together down in Louisiana. I love those two characters, and think this series could've trimmed the Flag Smashers entirely and dedicated more screen time to Walker as the primary antagonist. Instead, it ended up being wildly inconsistent, despite its attempts to tap into deeper themes.",
    "Tom: Sure, I agree with most of that. Your point about the good and bad being muddled is something that needed a bit more work, and I think it’s an element that Loki did a better job of tackling (more on that below). I do think Zemo helped to try and tackle the notion of ‘good vs evil’ during his time with Sam and Bucky, and the show was more successful when the trio were debating this on screen. I liked the back and forth between them all, and you could see that each was sympathetic to the others' viewers, particularly when Sam rebuffs Zemo’s “nobody is 100% good” line with “Well, Steve Rogers was”.",
    "Sam and Bucky’s frosty relationship, which we’ve seen in other Marvel productions, is something I’d have liked the show to have explored more, too. Yes, they end up becoming buddies by the end, but we don’t really see that transition executed well enough.",
    "I will stress that Falcon and the Winter Soldier isn’t a bad show – there’s a fair degree of character development, and the cameos (including the Wakandans) were well-received surprises. For me, though, it wasn’t as strong as WandaVision or Loki with its plot, pacing or its ability to make us care enough about its supporting cast.",
    "I wanted to sympathize with John Walker over his pressurized adoption of Cap’s mantle, I wished to empathize with the Flag Smashers’ cause and I should have felt more about Sharon Carter’s plight post-Civil War. Outside of Sam and Bucky, though, I really struggled to connect to these characters.",
    "Given how far Marvel has come with its villains – Thanos and Killmonger being the standouts – it was a shame that this show’s antagonists felt closer to the quality of the enemies we got in Phase 1 of the MCU.",
    "Samuel: I would personally have put WandaVision above Loki in this list, just because I think it committed to a single concept better than the other shows, and executed it almost perfectly. It really did look and sound like a sitcom for its opening episodes – something that proved contentious for some fans who were waiting for the writers to push ahead with the overarching story – but I loved the mystery aspect they built around Wanda and Vision's new life in Westview.",
    "Widely praised for its depiction of grief, I was actually more enchanted by the idea of getting to spend more time with Wanda and Vision, and to see Elizabeth Olsen and Paul Bettany bring more dimensions out of their great Avengers characters. I also loved how the Easter eggs in this show turned Reddit into a big conspiracy theory board for weeks and weeks. How come this didn't top Loki for you, Tom?",
    "Tom: Firstly, I agree with everything you said. Dropping Wanda and Vision into a new sitcom every week kept the show fresh, and it was funnier than I anticipated it to be, at least in earlier episodes. The online speculation, too, was a big part of what drove WandaVision forward – seeing people pour over every piece of information, Easter eggs or other teases was arguably my highlight of the show.",
    "But I think that’s also where WandaVision’s main issue lies with me. As riveting as it was to watch, it ultimately felt like a bit of a letdown when you factor in the rumors that surrounded the show during its nine-week run. The Ralph Boener reveal, the final battle between Wanda and Agatha (Kathryn Hahn stole the show overall, in my opinion) and the relegation of Monica Rambeau to the sidelines disappointed me in the end. It felt a bit anticlimactic, but I suppose WandaVision acted as a primer for this “don’t read into every little detail” line that Marvel have had to start saying to ease fans’ expectations moving forward.",
    "I will also say, though, that Marvel took a big gamble with WandaVision’s sitcom premise, and it’s certainly something I’d like to see the studio’s TV shows do more often. I think they can take more risks with their Disney Plus series, especially with the safety net they have with their movie slate. Is this something you’d like Marvel to do more, too, Samuel?",
    "Samuel: Definitely. There's nothing on the schedule right now that sounds as experimental as WandaVision, but I would hope they see its creative success – including its 23 Emmy nominations – as a sign that people are prepared to follow Marvel down this sort of path.",
    "I feel like the fan speculation/disappointment cycle is something that existed outside of the show to some extent, but the reveal that Evan Peters wasn't playing Quicksilver was definitely on Marvel. That was a cruel choice. In some ways, I think it's funny that Loki went ahead and brought Kang the Conqueror into the MCU in the same way people thought this show would introduce the MCU villain Mephisto. Sometimes, those Easter eggs really do add up. Other times, you're projecting too much onto what you're watching.",
    "Tom: Yes, and those bait and switches could become a fun thing for Marvel to try on occasion, just to throw audiences off the scent. If they make it a regular feature, though, I can see it becoming stale very quickly.",
    "You make an interesting point about its Emmy nominations, too. I wonder if Marvel will see more success in the TV awards sphere than it will at, say, the Oscars or the Golden Globes. We’ve seen MCU movies nominated for big awards at those ceremonies, such as Black Panther’s Best Picture nod, but I think Marvel may have a better shot at winning prizes with its TV shows. Apple has certainly seen success with series like Ted Lasso, so maybe Marvel will do likewise with its offerings.",
    "Samuel: I think you're right. Disney Plus is doing well on the awards circuit for WandaVision and The Mandalorian – and I definitely consider them two of the best shows of the past year. It's another incentive to make these series as stylistically distinctive as possible.",
    "Tom: As much as Sam tried to twist my arm and rank this in second place – I’m joking about the arm twisting! – I felt that Loki had that something extra that WandaVision, well, didn’t. Loki is one of the MCU’s most beloved characters, so it was high time that Tom Hiddleston’s god of mischief received his own movie or show. And, honestly, I felt like he knocked his performance out of the park.",
    "We’ve seen Hiddleston portray Loki in many different ways since 2011’s Thor, but he brought a new dimension to Loki in this series that I don’t think we’ve seen before, particularly through his humanity (even though he’s a god) and reckoning with his individual morality. That was aided perfectly by the show’s superb supporting cast, too, and I know that you, Samuel, have a certain soft spot for Owen Wilson’s Mobius.",
    "Samuel: Yeah, I loved Owen Wilson in this show. I ultimately let Tom convince me to put this at number one, because I've already complained about Loki ditching the detective format of its first two episodes in favor of a Doctor Who-esque sci-fi adventure elsewhere on this website – I made one guy so angry with that piece last weekend that he told me to \"stick to flipping burgers\". Maybe it was you under a pseudonym, Tom? Just joking.",
    "Loki really was something different. You can't pin down when it takes place in the MCU timeline, and it essentially all happened outside the concept of time itself – I will certainly praise its visual imagination, and I didn't mind spending more time with Tom Hiddleston's god of mischief one bit. I did fall in love with the idea of Loki and Mobius as time-traveling detectives, admittedly, but this proved to only be the setup of the series' real story.",
    "So, yes, it was the Sylvie stuff that didn't work for me. I liked the actress, Sophia Di Martino, a lot – and the concept of Loki being so narcissistic that he can only fall for another universe's version of himself is great on paper. In reality, I found their relationship corny and uninteresting, with a shade of weirdness I found more off-putting than brave. It was flirty in an annoying way, and turned me off of the later episodes. What did you make of the series' romance being the hook of its second half, Tom?",
    "Tom: What can I say, I like burgers (it wasn’t actually me, honest)! But yeah, the romance angle was off-putting. Like you, I can see why it was introduced from a narcissistic perspective, but Mobius poking fun at the notion of Loki and Sylvie getting together should have been the end of that.",
    "I agree Di Martino played the role of Sylvie really well, and it was fun to imagine if her arc is one that Hiddleston’s Loki would have followed if things had turned out differently. Although, he might have become Classic Loki instead, who Richard E. Grant did a stellar job of portraying, or even Alligator Loki – another breakout star for me, much like Hahn’s Agatha Harkness in WandaVision.",
    "It’ll be intriguing to see where Loki season 2 goes story-wise. You would imagine we’ll see a subversion of roles between Loki and Mobius, with the former becoming the teacher and the latter the student as they potentially try to halt Kang from conquering all of time and space.",
    "As you hinted at above, though, I think it would be really interesting to see a buddy cop or The X-Files style approach to season 2, where Loki and Mobius team up in a ‘monster of the week’ format. They can still use the Kang plot device as an overarching narrative, but maybe lengthening season 2’s episodic run from six to eight (or more) episodes would allow Marvel to follow such an approach. What are your thoughts on that?",
    "Samuel: I have no idea where it's going next based on that finale – but I do think a reset of the status quo allows them to potentially tap into that episodic format, like you say. The question is, how likely are they to actually do that when the TVA ended up forming such a small part of what the show ended up being? I do wonder if they ended up getting a little too lucky with casting Owen Wilson, in terms of how much of a quiet scene-stealer he is.",
    "If nothing else, I'm intrigued to see what a second season of one of these shows looks like – all of this feels like something I've never seen on TV before, and so far they've all felt like event-style miniseries. I'm definitely up for Loki's adventure continuing, even if I personally thought WandaVision was the better series.",
    "WandaVision, The Falcon and the Winter Soldier, and Loki are all available to stream in their entirety on Disney Plus now."
  ],
  "headers": {
    "2": "3. The Falcon and the Winter Soldier",
    "12": "2. WandaVision",
    "22": "1. Loki"
  },
  "links": {
    "What If...?": "https://www.techradar.com/news/marvels-what-if-show-finally-gets-a-release-date-and-a-star-studded-trailer",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki": "https://www.techradar.com/news/loki-episode-6-ending-explained",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2s-humor-and-heart-will-cure-your-soccer-blues",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "elsewhere on this website": "https://www.techradar.com/news/loki-promised-one-type-of-tv-show-then-delivered-a-worse-one"
  }
}