{
  "source": "https://www.techradar.com/news/the-witcher-monster-slayer-ar-game-launching-soon-heres-how-to-sign-up",
  "title": "The Witcher: Monster Slayer AR game launching soon – here's how to sign up",
  "category": "gaming",
  "updated": "2021-04-26T11:46:46Z",
  "author": "hamish-hector",
  "summary": "Toss a phone to your Witcher",
  "article": [
    "If Pokémon Go wasn’t violent enough for you, The Witcher: Monster Slayer might be the next AR game you need. We don’t have an official release date for the full game yet, but early access on Android is about to begin, with registration open now if you’re after an invite.",
    "Registering for The Witcher: Monster Slayer can be done really easily on the game’s official website. Click through and you’ll be asked to give the email address for your Google account, your phone’s brand, and its model. Unfortunately, if you’re under 16 or are on iPhone you won’t be able to take part, though we expect an iOS beta to come at some point.",
    "At the end of April, the first batch of players will be selected and given an invite, allowing them to roam the world, picking up quests and hunting iconic monsters from the Witcher series.",
    "Details have been a little scarce for this AR mobile game, but if you’ve played the likes of Pokémon Go, Minecraft Earth, or Harry Potter Wizards Unite, you’ll have a vague idea of what to expect. Loading up The Witcher: Monster Slayer will show you a real-world map marked with digital monsters and quest-givers that you can tap on to interact with.",
    "Based on the gameplay video, you’ll have to fight monsters using a sword, Witcher signs (spell-like attacks), and bombs. Quests look a bit more involved, requiring you to not just fight a monster but hunt it down by investigating different scenes.",
    "The gameplay trailer is seven months old, so it’s possible some design changes have been made – though we’ll know more when The Witcher: Monster Slayer begins its early access launch in the near future. If we’re lucky enough to get an invite we’ll be sure to share what we think of the game with you."
  ],
  "headers": {
    "3": "What can The Witcher: Monster Slayer players expect?"
  },
  "links": {
    "Pokémon Go": "https://www.techradar.com/how-to/gaming/pokemon-go-a-complete-beginner-s-guide-1324775",
    "The Witcher: Monster Slayer": "https://www.techradar.com/news/this-new-game-is-like-pokemon-go-only-with-the-witcher",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "official website": "https://thewitcher.com/pl/pl/monster-slayer#preregister",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Minecraft Earth": "https://www.techradar.com/news/minecraft-earth-takes-the-original-game-and-blends-it-with-pokemon-go",
    "Harry Potter Wizards Unite": "https://www.techradar.com/news/harry-potter-wizards-unite"
  }
}