{
  "source": "https://www.techradar.com/news/get-ready-for-nintendo-switch-game-announcements-at-this-weeks-indie-world-showcase",
  "title": "Get ready for Nintendo Switch game announcements at this week's Indie World Showcase",
  "category": "gaming",
  "updated": "2021-08-10T15:05:57Z",
  "author": "hamish-hector",
  "summary": "Tune in for all the latest Nintendo Switch updates",
  "article": [
    "Nintendo has announced that its next Indie World Showcase is headed our way tomorrow (August 11). The 20-minute video reel will likely announce several new Nintendo Switch games, as well as give updates to independent titles that you might be excited for.",
    "The April Indie World Showcase from earlier this year revealed a slew of new and unexpected titles, from Oxenfree 2: Lost Signals to Teenage Mutant Ninja Turtles: Shredder’s Revenge. We can expect much the same this time around, so you’ll want to tune in.",
    "If you’re excited to find out what the event has to offer us, we’re here to explain how you can watch the Indie World Showcase and find out about all the games coming to your Nintendo Switch.",
    "The Indie World event will be live-streamed on Nintendo’s official YouTube channel at 12 PM ET (5 PM BST / 2 AM AEST) on August 11. You can also tune into the event here (thanks to the embedded video above) or you could head over to Nintendo’s website. Whatever option you pick, just make sure you set a reminder so you don't miss the event.",
    "Given that it’s only going to last for around 20 minutes, don't expect too many announcements from the event – there’s only so much Nintendo can cram into it. Also, you shouldn’t go in hoping to learn about any of Nintendo’s upcoming AAA games, these indie dedicated shows have always stuck to the script and never tease larger projects.",
    "But enough of what you won’t see, what could be there? After its reveal at the end of the April showcase, we might learn more about Oxenfree 2 (which is due to release sometime this year). Fans of Hollow Knight will likely be desperate for Team Cherry to finally unveil more about the highly anticipated Silksong at the event too – a follow-up game that it has been developing for a few years.",
    "Beyond that we can expect several updates for other announced projects, and reveals for games we’ll have never heard of before. If you’re looking for something a bit different to get excited for, these short Indie World Showcases are the perfect place to spot a gem coming soon to the Nintendo Switch."
  ],
  "headers": {
    "3": "How to watch the Indie World Showcase (August 2021)",
    "4": "What could we see at the Indie World Showcase?"
  },
  "links": {
    "Indie World Showcase": "https://www.nintendo.com/indie-world/",
    "April Indie World Showcase": "https://www.techradar.com/news/nintendo-reveals-a-host-of-new-switch-games-including-oxenfree-2",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "official YouTube channel": "https://www.youtube.com/watch?v=QDclD1QMmYM",
    "Nintendo’s website": "https://www.nintendo.com/indie-world/"
  }
}