{
  "source": "https://www.techradar.com/news/sony-xperia-pro-is-a-5g-uploading-second-screen-for-professional-content-streamers",
  "title": "Sony Xperia Pro is a 5G-uploading second screen for professional content streamers",
  "category": "phones",
  "updated": "2021-01-26T15:39:14Z",
  "author": "david-lumb",
  "summary": "The Xperia Pro remixes the Xperia 1 Mark II as a mobile modem and external monitor",
  "article": [
    "The Sony Xperia Pro is a sort of custom version of the Sony Xperia 1 Mark II built for content creators and videographers who need to shoot and upload media on the go. Essentially, it works as an external monitor for a proper camera that can also livestream data over the phone’s 5G connection.",
    "That means the Sony Xperia Pro can sub in for both portable modems and external monitors, which combined are often as costly or even costlier than the phone’s $2500 (around £1,830 / AU$3,245) pricetag. It’s on sale now (January 26) in a single black color and unlocked at online US retailers (B&H, Amazon, Focus, Adorama and Sony Direct) and is compatible with most carriers. Its 5G use is currently restricted to US carrier Verizon, though that will likely change, and it’s compatible with mmWave and sub-6 5G.",
    "The Xperia Pro is a phone, too, operating with nearly all the features of the Xperia 1 Mark II. What’s left out? The Xperia Pro cannot record video. But the phone is just as capable of shooting photos, using apps, and anything else modern phones can do in day-to-day use with the specs it’s inherited from the Xperia 1 Mark II: a Snapdragon 865 chipset, 12GB of RAM and 512GB of storage, 6.5-inch OLED 4K display, 4,000mAh battery, and a triple rear camera with depth sensor.",
    "The Xperia Pro even has some things the Xperia 1 Mark II does not. Most notably, the new model has a mini HDMI port in the bottom center (the USB-C 3.2 port has been moved to the bottom-left), which is how it hooks up to cameras and other gear – a feature that didn't appear in previous Pro versions of older Xperia phones, and sets this new Pro model apart. There’s also an extra shortcut button, located next to the shutter button on the right side of the phone, to quickly summon your favorite apps.",
    "Some of the Xperia Pro’s other advantages happen to benefit both normal phone use and its role as an external modem-and-router: its four 5G antennas have been carefully placed around the phone to avoid signal dead spots and ensure connectivity no matter how it’s held or mounted. And its external chassis looks a bit more robust than the Xperia 1 Mark II’s glass back and metal sides – the Xperia Pro has a metallic back that wraps around the sides, though Sony didn’t comment on the material.",
    "All those specs and features are impressive...for a phone a third the price of the Xperia Pro. But it’s not meant to be a consumer device – it’s meant to replace several other products and be a decent phone besides.",
    "You can buy a portable modem like an LU Solo and an external monitor like the Atomos Shogun 7, or you can pick up the Xperia Pro and do both better, Sony claims – and the phone will be the cheaper option.",
    "The Xperia Pro transfers footage over HDMI at up to 4K 60fps 10bit HDR (QFHD), while its 5G capabilities allow it to livestream camera footage up to YouTube at 720p resolution. In data terms, the Pro can upload a maximum of 131Mbps / average 115Mbps with mmWave 5G, or a maximum of 37Mbps / 30Mbps. The phone also has a Network Visualizer app that shows a bandwidth histogram over footage, while also allowing picture-in-picture to navigate around the operating system while displaying camera footage.",
    "The phone itself has advantages over traditional external monitors, displaying footage piped in over HDMI at 2922 x 1644 resolution, which users can pinch-to-zoom in or out. Preinstalled software also allows users to fiddle with screen lock, brightness, flipping the screen upside down, and more controls on the right side.",
    "While Sony touted the phone’s interactivity with its Alpha line of cameras, its basic features should be compatible with other cameras that can hook up to it via HDMI. The phone isn’t being advertised to consumers, though it’s compatible with most carriers."
  ],
  "headers": {
    "5": "The Xperia Pro: a videographer's phone"
  },
  "links": {
    "Xperia 1 Mark II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review"
  }
}