{
  "source": "https://www.techradar.com/news/thousands-more-american-were-monitored-through-their-devices-last-year",
  "title": "Thousands more American were monitored through their devices last year",
  "category": "computing",
  "updated": "2021-02-03T20:26:05Z",
  "author": "anthony-spadafora",
  "summary": "Monitoring and stalkerware apps continue to pose a threat to users' online privacy",
  "article": [
    "Smartphones have changed the way in which we live and work but they have also made it easier for others to track our activities online.",
    "According to a new study from NordVPN, applications used to monitor device activity were installed on 549k devices across the US last year. While alarming, this number is actually one percent lower when compared to the previous year.",
    "Monitoring apps also saw increased usage on a global scale and last year, five percent more of these apps were installed on users' devices, affecting approximately 1,132.262 people across the world.",
    "Digital privacy expert at NordVPN, Daniel Markuson explained in a press release how parental control apps built for parents to keep tabs on their children online can be abused to track others, saying:",
    "“Applications like KidsGuard, mSpy, Spy Phone, and Highster are primarily built for parents to monitor activity on their kids’ phones. It allows parents to keep an eye on the communications their minors are having online. Sadly, installed without the owner’s consent, such tools can turn into very powerful spyware to read messages, record screen activity, track GPS locations, and use cameras to see what an individual is doing.”",
    "Users concerned that they are being monitored online can easily check if they have monitoring apps installed on their devices by using stalkerware detectors such as AntiSpy & Spyware Scanner and Anti Spy.",
    "NordVPN's research found that 37 percent of Americans downloaded apps to help detect spyware on their mobile devices when compared to the previous year. This reaction was shared by users worldwide as 16 percent more spyware detection tools were downloaded in 2020.",
    "“The use of stalkerware steals the victim’s physical and online freedom. Once the perpetrator knows what it is you were interested in and what secrets you shared with the people you trust, they can gain full control of your life and turn it against you”, Markuson added.",
    "To protect against stalkerware and unwanted online tracking, Markuson recommends that users secure their devices with a password or biometrics and use a VPN service at all times. Additionally, users should go through the apps on their devices and ensure location tracking is turned off."
  ],
  "headers": {
    "5": "Growing suspicious"
  },
  "links": {
    "new study": "https://go.nordvpn.net/aff_c?offer_id=564&aff_id=3013&source=trd&aff_click_id=trd-us-1073642396349902800&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthousands-more-american-were-monitored-through-their-devices-last-year&url=https%3A%2F%2Fnordvpn.com%2Fblog%2Frise-of-parental-monitoring-tools%2F",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Monitoring apps": "https://www.techradar.com/best/best-employee-monitoring-software",
    "parental control apps": "https://www.techradar.com/best/parental-control",
    "stalkerware": "https://www.techradar.com/news/stalkerware-poses-higher-privacy-risk-than-ever-heres-what-you-need-to-know",
    "spyware": "https://www.techradar.com/news/how-to-get-rid-of-spyware-forever",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "location tracking": "https://www.techradar.com/news/latest-ios-1331-beta-lets-you-fully-disable-location-tracking-on-the-iphone-11"
  }
}