{
  "source": "https://www.techradar.com/news/ribbles-new-off-road-e-bike-is-built-for-mud-and-wont-break-the-bank",
  "title": "Ribble's new off-road e-bike is built for mud – and won't break the bank",
  "category": "fitness",
  "updated": "2021-03-31T09:05:29Z",
  "author": "cat-ellis",
  "summary": "Take some of the sweat out of technical riding",
  "article": [
    "Ribble has launched a new off-road electric bike, the Ribble Gravel AL e, which is designed for riding over loose, technical terrain.",
    "Most electric bikes are built for commuters and city riding, but e-bikes are also well suited to off-road riding, taking the sweat out of steep climbs so you're free to enjoy the downhills. You can apply as much or as little power assistance as you like, so you can still push your limits should you choose to.",
    "The WTB Sendero tires have plenty of tread, and the frame allows lots of clearance to allow for mud build-up. Meanwhile the chain has a stabilizer with on/off switch to keep it in place on tough terrain.",
    "The Gravel AL e isn't just for hitting tough trails though; it should also be a practical choice for bikepacking when equipped with a luggage rack and panniers.",
    "The Ribble Gravel AL e sits alongside the multi-terrain CGR AL e and the road-focused Hybrid AL e, the latter of which currently is currently at the top of our guide to the best electric bikes.",
    "Like the CGR and Hybrid, the new Gravel AL e uses the Mahle Ebikemotion drive system, together with a Panasonic 250Wh batter, which is small enough to be tucked discreetly into a conventional looking frame. It's particularly light too - the whole bike tips the scales at just 14kg.",
    "All cables are routed internally, which not only helps maintain the traditional look, but also protects them from damage. An oversized headtube, short stem and flared bars help keep the bike feeling stable and nimble on tricky trails.",
    "It's reasonably priced too, starting at £2,699 (about $3,700 / AU$4,900) direct from Ribble. For comparison, the similarly specced Ridgeback X3 electric mountain bike retails at £3,199.99 (about $4,400 / AU$5,800).",
    "We'll be putting the Gravel AL e to the test and bringing you a full review soon, so stick with TechRadar to find out how it handles the mud (and our expectations are high)."
  ],
  "headers": {
    "4": "Glorious mud"
  },
  "links": {
    "Ribble Gravel AL e": "https://www.awin1.com/awclick.php?awinmid=7930&awinaffid=103504&clickref=trd-us-7701964116822580000&p=https%3A%2F%2Fwww.ribblecycles.co.uk%2Fribble-gravel-al-e%2F",
    "CGR AL e": "https://www.techradar.com/reviews/ribble-cgr-al-e",
    "Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "direct from Ribble": "https://www.awin1.com/awclick.php?awinmid=7930&awinaffid=103504&clickref=trd-us-5431871302482353000&p=https%3A%2F%2Fwww.ribblecycles.co.uk%2Fribble-gravel-al-e%2F",
    "Ridgeback X3": "https://www.techradar.com/reviews/ridgeback-x3"
  }
}