{
  "source": "https://www.techradar.com/news/new-sonos-beam-adds-dolby-atmos-audio-to-its-tiny-design",
  "title": "New Sonos Beam brings Sonos Arc's best parts without the high price tag",
  "category": "audio-visual",
  "updated": "2021-09-14T14:35:53Z",
  "author": "olivia-tambini",
  "summary": "We can’t wait to test the Sonos Beam (2nd Gen)",
  "article": [
    "Heads up AV enthusiasts – there’s a new Sonos soundbar on the block.",
    "The Sonos Beam has been one of the best soundbars you can buy since it launched in 2018, thanks to its compact design, excellent audio performance, and unrivalled integration with the company’s wider wireless speaker ecosystem.",
    "Now the company has announced a new version of the pint-sized soundbar: the Sonos Beam (2nd Gen) shares the same compact build as its predecessor, but adds Dolby Atmos immersive sound, HDMI eARC compatibility, an improved speaker array, and a polycarbonate grille.",
    "The second-gen Beam will be available to buy from October 5 for $449 / £449 / $699, which is more expensive than the original; at launch, the first-gen Sonos Beam cost $399 / £339 / AU$599, though it’s often discounted these days. (In fact, we could be in for some fantastic Sonos Beam deals during Black Friday 2021 now that there’s a new model.)",
    "Saying that, Sonos has just announced a surprising price hike for many of its speakers, so who knows how long that price will last?",
    "The biggest change to come to the Sonos Beam is support for Dolby Atmos, a cinematic sound technology that places elements of film soundtracks (and compatible music files) in a 3D sphere. When the audio is played through Dolby Atmos speakers or soundbars, it feels as though the action is happening all around you, with sound coming from every angle.",
    "For ‘true’ Dolby Atmos, you need upfiring speakers that can bounce sound off of the ceiling and back down to your ears (or, even better, ceiling-mounted speakers). However, the new Sonos Beam shares the same acoustic architecture as its predecessor, which doesn’t include any upfiring drivers whatsoever – for that you’ll need the pricier Sonos Arc.",
    "According to Sonos, the new Beam uses “pyschoacoustic techniques” to mimic the effect of upfiring speakers – something you might hear referred to as virtual Dolby Atmos. Sonos says the speaker arrays – or the software that coordinates the playback and interaction across the soundbar’s transducers – has been “radically improved”, with five arrays as opposed to the three found in the original Beam.",
    "The two new arrays are dedicated to surround and height information, applying time and frequency-based techniques to the sound to separate what you hear at ear level, and what you hear above your head.",
    "Many virtual Atmos soundbars are very effective, although we wouldn’t expect the sense of height to be as convincing as a soundbar with upfiring drivers, like the Sonos Arc. That’s probably why the Beam (2nd Gen) is $400 / £400 / AU$800 cheaper than the company’s flagship soundbar.",
    "Another new feature for the Sonos Beam is HDMI eARC compatibility, which the company says will bring a “richer, more immersive, and higher definition sound experience”. Compared to the HDMI ARC connectivity found on the original Beam, eARC can handle more advanced audio formats and deliver superior audio quality.",
    "It’s a shame there’s no HDMI 2.1 support, which would allow for 4K at 120Hz and even 8K at 60Hz passthrough – which in turn, would make it ideal for 8K-supporting consoles like the PS5 and the Xbox Series X.",
    "Still, the new Beam will be able to cope with 32 channels of audio, and even eight-channel 24-bit/192kHz uncompressed 38Mbps data streams. In other words, as well as supporting Atmos, it can play hi-res audio files of your favorite songs.",
    "Incidentally, Sonos has also announced that devices supported by its S2 app will get Amazon Music Ultra HD compatibility, bringing lossless audio and Dolby Atmos Music to the ecosystem. Supported devices include the Roam, Arc, Beam, Five, Sub (Gen 3), Move, One, One SL, Port, Amp, SYMFONISK Bookshelf, SYMFONISK Table Lamp, Play:5 (Gen 2), Connect (Gen 2), and Connect:Amp (Gen 2).",
    "Otherwise, the actual inside bits of the Sonos Beam are the same as before. You’ve got five Class-D amplifiers, one center tweeter, four elliptical midwoofers, and three passive radiators working together for a powerful and balanced sound.",
    "The second-gen Sonos Beam looks much the same as its predecessor, with a compact design that will fit under most TVs (you can also wall-mount it if you wish), though it’s swapped the old fabric grille for one that’s made of plastic.",
    "This design choice is more in keeping with the Sonos Arc, and as the company points out, it’s far easier to clean than dust-attracting fabric. We asked Sonos whether the new grille brings any acoustic benefits, but the company told us it’s purely an aesthetic choice.",
    "It certainly brings the soundbar into line with the rest of the Sonos ecosystem, as none of the other current-gen Sonos speakers have fabric grilles.",
    "As you’d expect, the Sonos Beam again comes with support for Alexa and Google Assistant, AirPlay 2, Wi-Fi connectivity, and sound modes such as Speech Enhancement and Night Sound.",
    "So, with all the best parts of the original Sonos Beam, plus some of the best features from the Sonos Arc, the new Sonos Beam is definitely worth getting excited about, particularly for those who want the immersive sound of Dolby Atmos without the cost and heft of the Sonos Arc."
  ],
  "headers": {
    "5": "Analysis: what’s new with the Sonos Beam (Gen 2)?"
  },
  "links": {
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "best soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Sonos has just announced a surprising price hike": "https://www.techradar.com/news/sonos-speakers-are-getting-more-expensive-for-no-real-reason",
    "Dolby Atmos speakers": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/news/xbox-series-x-restock-september-2021/reviews/xbox-series-x",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Amazon Music Ultra HD": "https://www.techradar.com/reviews/amazon-music-hd",
    "Roam": "https://www.techradar.com/reviews/sonos-roam",
    "Move": "https://www.techradar.com/reviews/sonos-move-review",
    "One": "https://www.techradar.com/reviews/sonos-one-review",
    "One SL": "https://www.techradar.com/reviews/sonos-one-sl-review",
    "Amp": "https://www.techradar.com/reviews/sonos-amp",
    "SYMFONISK Bookshelf": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-bookshelf-speaker",
    "SYMFONISK Table Lamp": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-lamp-speaker",
    "Play:5 (Gen 2)": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/sonos-play5-657133/review"
  }
}