{
  "source": "https://www.techradar.com/news/the-first-nintendo-direct-in-over-a-year-kicks-off-tomorrow-heres-what-to-expect",
  "title": "The first Nintendo Direct in over a year kicks off tomorrow – here's what to expect",
  "category": "gaming",
  "updated": "2021-02-17T17:12:31Z",
  "author": "rhys-wood",
  "summary": "Kept you waiting, huh?",
  "article": [
    "In a very characteristic move, Nintendo just dropped the announcement of a new, fully fledged Nintendo Direct, scheduled for February 17 at 2pm PT, 5pm ET and 10pm GMT.",
    "In a tweet sent out by Nintendo’s main accounts worldwide, the upcoming Direct will focus on both currently released games like Super Smash Bros. Ultimate and games due to be released on the Nintendo Switch in the first half of 2021.",
    "The Direct will be roughly 50 minutes in length and will be livestreamed on Nintendo’s regional YouTube channels.",
    "It’s been something of a slow news period for Nintendo since the pandemic started, without many updates for hot releases from both first and third-party developers.",
    "What exactly will be revealed during the Direct is something of a mystery. Given that it will be largely focused on games releasing in the first half of the year, that casts doubt on the likes of Metroid Prime 4 and Bayonetta 3. Perhaps we'll see more in the way of remasters taking precedent, here.",
    "Things might look more likely for The Legend of Zelda: Breath of the Wild 2, as little to no updates have been shared on the title since its initial announcement trailer back in 2019. A release date for the project is unlikely, but we're at least hoping for a development update.",
    "It’s the first Nintendo Direct for a long time, and 50 minutes should make for a few substantial reveals – but it's worth keeping your expectations in check. There will hopefully be more Nintendo Directs down the line as we approach the latter half of the year."
  ],
  "headers": {
    "3": "Better late than never"
  },
  "links": {
    "Nintendo’s regional YouTube channels": "https://www.youtube.com/watch?v=pQ-dE_5el5Q"
  }
}