{
  "source": "https://www.techradar.com/news/microsoft-word-and-outlook-are-getting-a-major-dictation-improvement",
  "title": "Microsoft Word and Outlook are getting a major dictation improvement",
  "category": "computing",
  "updated": "2021-02-01T16:01:55Z",
  "author": "barclay-ballard",
  "summary": "Microsoft promises not to store your audio recordings",
  "article": [
    "Microsoft is improving the dictation function for both Word and Outlook, which is sure to be welcomed by anyone that wants to quickly make a note of their thoughts or individuals that have large amounts of audio content to transcribe. The dictation improvements are currently in development and are expected to begin rolling out in March.",
    "“Dictation has [a] new UI and settings to control a profanity filter and automatic punctuation,” the Microsoft 365 roadmap explains. “Voice commands make editing and formatting your dictated text easier than ever.”",
    "A significant change accompanying the dictation update is the addition of a new dictation toolbar. In order to access the toolbar, users can click the ‘Dictate’ button on the Home tab or press Alt+`. Through the toolbar, users will gain access to all the standard dictation features, as well as the ability to change settings like language and automatic punctuation.",
    "The auto punctuation feature does not require any additional input from the user, with no need to say “comma” or “period.” Simply by speaking and pausing naturally, the dictation function in Word and Outlook will add in punctuation marks where appropriate. Of course, this won’t be 100% successful, so users are free to disable auto punctuation if they’d prefer.",
    "Microsoft already boasts an impressive list of supported languages for its dictation feature, including Chinese, English, French, German, Italian, and Spanish. Preview languages also include Danish, Dutch, Hindi, Korean, Russian, and a number of others.",
    "Microsoft also confirmed that its dictation service, which is powered by its Azure Speech Services, would not store any recorded speech data. Once a transcription is complete, audio and transcription results will not be retained."
  ],
  "headers": {
    "3": "Privacy pledge"
  },
  "links": {
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "explains": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-7090690292364097000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D70596"
  }
}