{
  "source": "https://www.techradar.com/news/the-future-office-must-focus-on-culture-and-connections",
  "title": "The future office must focus on culture and connections",
  "category": "computing",
  "updated": "2021-08-26T14:09:41Z",
  "author": "simon-dudley",
  "summary": "Logitech & CBRE discuss the future of the office",
  "article": [
    "The future of the office, and the experience it will offer, has been a hot topic for the past year. Just this month studies have revealed that a massive 3 in 4 professionals prefer the flexibility of working from home with over half saying they are anxious about the restrictions easing. Over the past year, we’ve seen speculation that there may not be such thing as an office, and that we will all work remotely. Others are looking to put a hybrid model in place, but no matter your opinion, the easing of lockdown means that we will likely know what the office of the future will look like in the coming months.",
    "Many companies have put new policies in place to begin in the next few months. Nokia has adopted a hybrid working model with three days remote, and the Bank of England is asking staff to come into the office for a minimum of one day a week from September, for example.",
    "Mike and I met each other on a Zoom call recently to talk about our perspectives on the re-invention of the office. I (Simon), got into the video collaboration industry after finding video calls as a way of keeping in touch when away from home, and became passionate about making the technology easier to use and ‘adoptable’. Mike has experienced 15 years in real estate, and is driving strategy with some of the biggest enterprises out there as to what their premises could become post-Covid.",
    "I’m an introvert and will remain mostly home-based as I have done for years, while Mike is more extroverted, and will follow a hybrid balance. That being said, we’re aligned in believing that the office won’t become a relic of the past, but it will evolve into a destination to collaborate, not just a place to work. Below, we share our thoughts on the office of the future.",
    "Mike: The biggest companies in the world manifest their brand in their physical environments, and their culture is defined by more than just a strap line. A team’s willingness to help others collaborate on projects, or being able to have a spontaneous drink at the pub are both drives of culture – and these activities are more physical than virtual.",
    "Some of this can be done with a remote catch-up, but corporate purpose and a sense of community comes from physical interaction. There will be hybrid working in most companies, but it must become more of a balance than the model we’re working in now, where many employees work mostly or entirely at home.",
    "When the pandemic hit, we tried to move office life as we knew it online. We lost the energy and creativity of real-life meets, and we still haven’t quite pinpointed how we can bring it back effectively. A truly hybrid working world will need this, as the home and office involve different ways of working and communicating.",
    "Simon: Logitech is a video-first organization and our CEO gives regular video updates to employees which helps set the tone of our company culture. It’s an example that make virtual communication an everyday and productive experience for all employees.",
    "However, we also know the value of places for colleagues to meet, and have 80 offices around the world. These spaces were transforming even pre-pandemic, as a video-first mindset ensured 20, 30, even 50% of the people joining meetings didn’t have to be in the same building. It’s important for distributed teams – whether across the country, the world or different job functions – to have this capability.",
    "Logitech creates products that are useful to people’s everyday lives, both digitally and physically, so teams can meet and work in both environments in order to innovate. Other companies will have different requirements – sales teams may need office space to meet customers in person, and financial groups will want the excitement brought back to the trading floor.",
    "Mike: The office used to be built prioritizing the physical space first, followed by the needs of the humans inside it. Digital technologies were considered last. Advances in technology and design is now changing that. We are seeing a model where considering the people in the office, and how they will be using it, comes first. This includes having a better awareness of employees’ personas, functions and the preferences.",
    "A good example is juniors and new starters, who are trying to find their feet in the world of work. My son spent the first year as a graduate in 2020, and it was all on Zoom. While this was good for short, focused meetings, he’s missed out on ad-hoc on-the-fly chats with peers or seniors, and socializing with colleagues.",
    "For many at this career stage, work lunches and socials, and workplace friendships are very valuable – and can’t be replicated online. Therefore, I believe working from home has more benefits for senior members of the team. People like Simon and I are established in our roles, can draw on global networks with ease and make connections day-to-day.",
    "Simon: Working from home has shown me how fortunate I am too with my network. However, I think that we will need to make extra effort to stay connected with colleagues we don’t directly work with. Unless we meet in person and catch up, even just from time to time, how long can these vast networks stay truly connected?",
    "Networking has its benefits offline and online, and many of us will need to go back into the office at some point to freshen relationships that could be better grown in person. When this isn’t possible, we need to think about the digital technologies that can equip us to do business remotely.",
    "Mike: Prior to the pandemic, people often regarded those in the office as the most important members of the team. In the worst case, remote workers would join a call but participants in the meeting room would forget their attendance.",
    "We will not be going back to this. Firstly, spaces have been equipped with video and personal workplace technologies that mean remote workers have quality tools the same as in-office workers. Beyond that, no matter an employee’s job role, function or age, most people will choose to work from home for at least part of the week. So, while there’ll be a change of physical office design so meeting rooms can manage half of participants joining virtually, there will be a bigger focus on company culture and how it can be nourished going forwards.",
    "This will require an industrial transformation of office space. This time last year, most of the corporate world got up at 6am, and commuted to an office to access the internet at their desks by 8.30am. But now people have a home office, the city version has to offer something better – far more than just a fast broadband connection. I think it’ll be the human physical interaction that gets us there – a cultural injection that cannot be experienced from home."
  ],
  "headers": {
    "4": "The office is the home of company culture",
    "10": "Consider employee needs first",
    "15": "The office is alive, but different"
  },
  "links": {
    "working from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "office": "https://www.techradar.com/best/best-office-desks",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "video": "https://www.techradar.com/best/best-video-conferencing-software",
    "work from home": "https://www.techradar.com/best/wfh-apps"
  }
}