{
  "source": "https://www.techradar.com/news/this-rtx-3080-gaming-pc-deal-is-probably-the-best-youre-going-to-get-on-prime-day",
  "title": "This RTX 3080 gaming PC deal is probably the best you're going to get on Prime Day",
  "category": "computing",
  "updated": "2021-06-22T22:50:23Z",
  "author": "bill-thomas",
  "summary": "Might be time to just get yourself an Alienware",
  "article": [
    "If this Prime Day was like any other year, our advice to anyone looking to get a new gaming PC would be to scoop up deals on components like CPUs and RAM to be able to put more cash towards your graphics card. But because this isn't like normal years, the Alienware Aurora R12, equipped with an Nvidia GeForce RTX 3080 might be your best best if you want a high-end gaming rig right now.",
    "You can pick up the R12 over at Dell's website for \"just\" $2,199, down from $2,489. That's a $290 savings, which is nothing to shake a stick at, but it isn't as steep as what we'd see in previous years.",
    "That $2,199 will get you the Alienware Aurora R12, with an Intel Core i7-11700F, 16GB of RAM, an RTX 3080 and a 512GB SSD. For most people that want to play the best PC games at 4K, this is an awesome configuration, and you shouldn't need to ever really dial down the quality settings.",
    "You also get a pretty attractive and unique chassis. We're big fans of Alienware's legend design that it brought to market starting in 2019, and this is no different. It is a prebuilt PC, but it's still something that's going to look amazing on your desk, if that's at all important to you.",
    "And given that an RTX 3080 on StockX is still going for a ridiculous $1,627 at the time of writing, just buying this PC just makes sense, especially if you were going to be building a new PC for Prime Day anyways.",
    "If you're not in the US, we've included our price comparison tool down below, so you can still find an excellent deal no matter where you are."
  ],
  "headers": {
    "5": "More Alienware Aurora R12 deals",
    "6": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Alienware Aurora R12": "https://www.techradar.com/reviews/alienware-aurora-r11",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}