{
  "source": "https://www.techradar.com/news/microsoft-wants-to-try-and-kill-off-deepfakes-for-good",
  "title": "Microsoft wants to try and kill off deepfakes for good",
  "category": "computing",
  "updated": "2021-09-15T11:39:11Z",
  "author": "mike-moore",
  "summary": "Truepic investment should help give your photos and videos extra security",
  "article": [
    "Microsoft could be set to boost its security protection for photos and videos uploaded by customers following news of a major new investment.",
    "The computing giant's M12 venture capital arm has announced it is investing in Truepic, which offers photo and video verification services.",
    "Microsoft says such systems could be a significant step in helping to identify and cut down on the rising threat of deepfakes - computer-generated or manipulated images that can be used for a range of nefarious purposes.",
    "Truepic, which Microsoft's James Wu called, \"the pioneer of provenance-based media authentication\", looks to authenticate images using its Vision digital inspection platform, which promises to quickly verify trusted images.",
    "It claims to have already verified millions of photos and videos captured from over 150 countries globally using its Controlled Capture camera technology.",
    "This platform brings together several high-integrity data fields for every file, which are then analyzed for any traces of manipulation, before being protected with cryptographic hashing. The system then seals all the data, along with auxiliary metadata to maintain what Wu called a \"chain of custody\" that passes the files along a verification pipeline stress testing the file to ensure it stays safe before, during and after capture.",
    "When it comes to deepfakes, this means that any manipulation, whether of the image itself or the metadata associated with the image, should be instantly flagged to the user.",
    "The rise of deepfakes and democratization of sophisticated image editing software have put both news outlets and technology companies under pressure to address the spread of disinformation and visual deception,\" Wu noted.",
    "\"A gamut of technologies, ranging from cheapfakes to synthetic media, have lowered the barrier to create believable content to the naked eye.\"",
    "The company also offers Truepic Vision, an online library of \"trusted visual documentation\" for businesses, with the likes of Equifax, Ford, and Transunion already signed up as customers.",
    "As part of M12's investment, which led Truepic's Series B funding round, Wu will join Truepic's board.",
    "Truepic and Microsoft have already worked together in 2021, forming part of a new alliance that aims to cut down on online content fraud.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Extra safety"
  },
  "links": {
    "deepfakes": "https://www.techradar.com/news/deepfakes-could-be-the-next-big-security-threat-to-businesses",
    "called": "https://m12.vc/news/welcoming-truepic-to-the-m12-portfolio",
    "a new alliance": "https://www.techradar.com/news/microsoft-and-other-tech-giants-are-teaming-up-to-cut-down-on-fake-images-online",
    "MSPowerUser": "https://mspoweruser.com/microsoft-m12-truepic-photo-verification-platform/"
  }
}