{
  "source": "https://www.techradar.com/news/huawei-gives-free-50gb-cloud-storage-to-its-customers-but-theres-a-catch",
  "title": "Huawei gives free 50GB cloud storage to its customers but there's a catch",
  "category": "computing",
  "updated": "2021-05-25T10:32:06Z",
  "author": "anthony-spadafora",
  "summary": "Huawei's 'A Little Extra Care' promotion will run until June 30",
  "article": [
    "Chinese smartphone maker Huawei has launched a new promotional campaign that rewards both new and existing customers with a range of discounts and benefits including 50GB of cloud storage.",
    "The \"A Little Extra Care\" promotion will run from now until June 30 and customers will receive an extended device warranty, additional Huawei Mobile Cloud storage space and VIP access to its entertainment streaming services Huawei Music and Huawei Video.",
    "In order to be eligible, existing Huawei customers will need to make sure that their devices are still under warranty. If so, they'll get an additional six months on their smartphone's current warranty while all newly purchased Huawei phones will also get an additional six months added to their warranties.",
    "UK customers can also visit the Huawei Westfield Stratford store or the Webley Service Centre to claim 20 percent off repair prices, a free screen protector and a cleaning service.",
    "For the next three months, Huawei is offering customers 50GB of cloud storage space for free so that they can back up their photos, files and other data to the cloud to free up space on their smartphones.",
    "To claim your 50GB free access to Huawei Mobile Cloud storage as well as your three-month VIP subscription to Huawei Music and Huawei Video, you'll need to open the Huawei App Gallery on your Huawei smartphone or purchase a new device before June 30.",
    "Managing director of Huawei's UK Consumer Business Group explained why the company decided to launch its “A Little Extra Care” campaign in a press release, saying:",
    "“At Huawei, our customers are our number one priority, so this April, we’d like to say thank you to our loyal users and welcome new customers with an upgraded smartphone experience. Our new promotional campaign offers a range of discounts and handy benefits including 6-months extended warranty and free VIP access to HUAWEI Music and HUAWEI Video for six months.”"
  ],
  "headers": {
    "4": "A Little Extra Care"
  },
  "links": {
    "Huawei": "https://www.techradar.com/news/huawei-puts-software-and-intelligent-vehicles-at-heart-of-new-strategy",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Huawei phones": "https://www.techradar.com/news/best-huawei-phones",
    "Huawei App Gallery": "https://www.techradar.com/news/huawei-thinks-its-app-gallery-can-truly-rival-googles-play-store-but-thats-some-ask/in/news/huawei-pitches-its-alternative-to-google-play-store",
    "press release": "https://tracker.tradedoubler.com/click?p=304855&a=2384882&g=32244&epi=trd-us-8370221912727075000&url=https%3A%2F%2Fconsumer.huawei.com%2Fuk%2Fcommunity%2Fdetails%2FA-Little-Extra-Care---for-your-new-and-existing-smartphone%2FtopicId_45974%2F"
  }
}