{
  "source": "https://www.techradar.com/news/microsoft-surface-pro-7-has-swappable-ssds-but-microsoft-doesnt-want-you-to-upgrade",
  "title": "Microsoft Surface Pro 7+ has swappable SSDs - but Microsoft doesn't want you to upgrade",
  "category": "computing",
  "updated": "2021-02-25T12:06:49Z",
  "author": "jess-weatherbed",
  "summary": "No storage upgrades permitted",
  "article": [
    "Microsoft may have included swappable SSDs for the Surface Pro 7+, but this doesn't mean you're getting an upgrade any time soon – at least not with approval anyway.",
    "Despite including the removable SSD, Microsoft admitted that upgrading a larger storage device is \"technically possible\", but it strongly discourages users from doing so, cautioning \"Installing a non-Microsoft or a Microsoft SSD of different volume than the one provided originally may lead to reduced performance and unsupported configurations.\"",
    "This might add some salt to the wounds of anyone who purchased the cheaper 128GB versions of the device with the hope of adding expanded storage at a later date. You can buy the Surface Pro 7+ in 128GB, 256GB and 512GB configurations, with official storage spares being made available via official Microsoft US reseller channels. This doesn't mean that you can't upgrade the storage of course, only that you'd be going against Microsofts wishes by doing so and presumably breaking any existing warranty agreements in the process.",
    "The team over at iFixit have provided a demonstration on how easy the process actually is to switch out the existing SSD device, as well as providing warnings that regular M.2 2230 drives might not be compatible due to some shielding on the provided SSD.",
    "The inclusion of swappable SSDs was presumably for efficiency as the device can be swiftly repaired by IT professions with little fuss, as well as allowing data to be transferred or destroyed securely when a device needs to be moved over between employees.",
    "The Surface Pro 7+ is specifically targeting business and education users, featuring optional LTE Advanced to facilitate more flexible working and support for the latest Wi-Fi 6 standard on top of the removable SSD. You're also getting an upgrade to Intel's new 11th-gen processors up to the Core i70116G57, which also equips the 2-in-1 with Intel Xe graphics, and boasts up to 15-hours of battery life from a single charge. We don't know if any official repercussions will come should you choose to go against Microsoft's warning, so proceed with caution if you ignore the official advice given. If you have yet to buy a Surface Pro 7+ then we would suggest opting for a larger storage model to avoid the need to expand down the line.",
    "Via The Register"
  ],
  "headers": {
    "3": "Don't be naughty"
  },
  "links": {
    "Surface Pro 7+": "https://www.techradar.com/news/microsoft-surface-pro-7-boasts-superior-security-at-a-hardware-level",
    "iFixit have provided a demonstration": "https://www.ifixit.com/Guide/Microsoft+Surface+Pro+X+SSD+Replacement/127830",
    "Wi-Fi 6": "https://www.techradar.com/news/the-real-benefits-of-wifi-6",
    "Intel's new 11th-gen processors": "https://www.techradar.com/news/intel-11th-generation-processors-launch-window-may-have-just-leaked-from-msi",
    "The Register": "https://www.theregister.com/2021/02/24/surface_pro_7_plus_ssd/"
  }
}