{
  "source": "https://www.techradar.com/news/iphone-13-range-could-have-improved-camera-stabilization-for-sharper-shots",
  "title": "iPhone 13 may get a camera upgrade previously seen on iPhone 12 Pro Max",
  "category": "phones",
  "updated": "2021-05-28T11:51:23Z",
  "author": "james-rogerson",
  "summary": "Shifting the sensor, not the lens",
  "article": [
    "The iPhone 12 range has excellent cameras, but we’re expecting various improvements for the iPhone 13 range, including possibly the use of sensor-shift OIS (optical image stabilization) on all models.",
    "That’s according to industry sources speaking to DigiTimes, and it’s a move that should improve the camera stabilization on the phones, helping the device counteract shaky hands and deliver shots that are in focus. Sensor-shift OIS works by moving the sensor in response to the inevitable tiny camera movements that happen when you’re not shooting on a tripod.",
    "Most phones (including most of the iPhone 12 range) use a form of OIS that moves the lens instead, but that’s generally less effective. So this would be a generational upgrade for all models except the iPhone 13 Pro Max, as the iPhone 12 Pro Max already uses sensor-shift OIS. This isn’t the first time we’ve heard this claim either, so it could well be true.",
    "DigiTimes claims that voice coil motor shipments for iPhones will likely pick up in late June, and exceed shipments for Android phones in July, as voice coil motors are needed for this form of OIS. Apparently, makers of these components have been told to raise capacity by 30-40% to meet all the iPhone demand.",
    "This could be one of a number of camera upgrades we see on the iPhone 13 range, with previous rumors pointing to a change in aperture on the ultra-wide cameras, a slight boost in the telephoto range of the iPhone 13 Pro (from 2x to 2.5x), and the addition of a LiDAR scanner on the basic iPhone 13 models, which is currently only found on the Pro range.",
    "Looking further ahead, the cameras could get a real overhaul on the iPhone 14, with talk of a periscope lens and a 48MP sensor.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "Big demand"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "DigiTimes": "https://www.digitimes.com/news/a20210526PD204.html",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "isn’t the first time we’ve heard this claim": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "a change in aperture": "https://www.techradar.com/news/iphone-13-tipped-to-feature-a-major-camera-upgrade",
    "boost in the telephoto range": "https://www.techradar.com/news/heres-the-iphone-13-camera-upgrade-rumored-for-2021",
    "addition of a LiDAR scanner": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-even-more-camera-sensors",
    "periscope lens": "https://www.techradar.com/news/apple-preps-a-10x-zoom-camera-but-the-iphone-13-wont-get-it",
    "48MP sensor": "https://www.techradar.com/news/iphone-14-could-have-a-massive-camera-upgrade",
    "Phone Arena": "https://www.phonearena.com/news/all-iphone-13-5g-models-said-to-sport-sensor-shift-stabilization_id132412"
  }
}