{
  "source": "https://www.techradar.com/news/the-sims-4-will-finally-let-you-cook-as-a-family",
  "title": "The Sims 4 will finally let you cook as a family",
  "category": "gaming",
  "updated": "2021-07-01T10:22:54Z",
  "author": "vic-hood",
  "summary": "With children's gardening abilities on the way too",
  "article": [
    "July's The Sims 4 update will see group cooking and children's gardening abilities finally introduced in the base game.",
    "EA Maxis announced the news during a recent Inside Maxis stream, revealing that this month's update will allow Sims to cook with up to five other Sims (as long as they're on your lot). That means your Sims family can finally cook together, with children able to get involved if invited by an adult.",
    "Cooking as a group builds Sim relationships and results in better quality cooking and more servings - Sims that cook together also get a new sentiment. Maxis also revealed that while adults will gain Cooking Skill through group cooking, children will gain Mental Skill.",
    "In addition to group cooking, July's update will introduce children's gardening abilities. While children won't be able to use the Vertical Garden from The Sims 4 Eco Lifestyle Expansion Pack, they will be able to water, weed, plant, and harvest crops - if they have a high enough Mental Skill level.",
    "All children will be able to water crops, however weeding, planting and harvesting are only unlocked at certain Mental Skill levels (which haven't been confirmed just yet).",
    "Some children may prefer to get less down and dirty with the plants. Fortunately, children and toddlers will also be able to talk to plants - with toddlers potentially babbling depending on their Communication Skill.",
    "Teens, Young Adults, and Elder Sims with enough Gardening Skill will also be able to teach children about plants, increasing children's Mental and Social skills.",
    "Last but not least, The Sims 4 is also getting a brand new hairstyle, which Sim Gurus described as a \"modernized\" take on the big afro that's already available in the base game",
    "These additions are definitely welcome as they'll allow Sims to spend more family/friend time and reduces the restrictions on what activities children can take part in. Plus a new, more inclusive hairstyle is definitely a bonus.",
    "It's unclear when this update will roll out but we're expecting it will land as a pre-patch ahead of the release of The Sims 4 Cottage Living expansion pack on July 22."
  ],
  "headers": {
    "8": "Welcome additions"
  },
  "links": {
    "Inside Maxis": "https://www.youtube.com/watch?v=nVwtqZN3JTM"
  }
}