{
  "source": "https://www.techradar.com/news/halo-on-pc-has-revitalized-the-franchise",
  "title": "Halo on PC has revitalized the franchise",
  "category": "computing",
  "updated": "2021-08-30T12:00:56Z",
  "author": "dani-cross",
  "summary": "Lets get back to work Spartan",
  "article": [
    "Since Bungie’s departure from the series, Halo has struggled to maintain its footing at the top of the first-person shooter market. The Xbox One received just one new Halo shooter, and it didn’t exactly reach the heights of popularity the series is used to. Now, six years on from Halo 5: Guardians, 343 Industries is looking to put the franchise back on that pedestal with Halo Infinite.",
    "But the gaming landscape has changed, and Halo needed to change with it. An Xbox-exclusive Halo in the post-Xbox 360 era simply won’t have as much impact, as Halo 5: Guardians proved. Name almost any popular shooter right now and chances are they’ll be available on a variety of platforms. After all, the more players you can reach, the better.",
    "Thankfully, Microsoft knows this well. Halo Infinite is the first Halo game to launch on PC and Xbox simultaneously, and the multiplayer is free for everyone, opening the door for a wider player base and community. Multiple platforms can play together through cross-play, and progression carries over between these platforms too. This makes it easy for players who might’ve lost interest in the series to dip their toes back in and test the waters. And due to this approach, Halo Infinite is primed to have a significantly bigger launch than Halo 5 as a result.",
    "Not to mention, the player-first approach 343 has talked about is the ideal way to regain the goodwill they’ve arguably lost over the years. With a bigger focus on accessibility and connectivity, Halo can hopefully regain the status it once held as one of gaming’s most beloved FPS franchises. Players can dive in with their friends on different systems without having to worry about cost, rather than being forced to own an Xbox console themselves – making Infinite more appealing for those newer PC players who want to relive the old days of playing Halo with their buddies every night.",
    "However, it’s still a little too early to say whether Infinite is the resurgence the series needs. There’s still a lot we don’t know, but after the launch of the Master Chief Collection on PC it’s safe to say the series is back in the spotlight. The reaction to that reveal was huge, and rightly so. The MCC gave a whole generation of PC gamers the chance to play almost every Halo game, and this breathed new life into an arguably stagnating franchise. Gamers who have moved from Xbox to PC can re-join the Halo player base, and players who’ve never been acquainted with the Master Chief before can finally experience the games for themselves.",
    "After waiting for so long it felt strange to see the announcement that the series is coming to PC, but now that it’s here, it feels like it’s been a part of the platform for years. Playing with friends across multiple systems just feels right, and there’s real potential for the game’s community to grow even more. No one misses out here – classic fans can play the old Halo games they know and love, and others can get stuck into new titles like Infinite without having to change platforms.",
    "Halo has always been community-driven, with user-created maps and modes being added to official matchmaking playlists. Expanding to PC could lead to even more content, and even more people will be able to experience it. Furthermore, it allows for easier ways to share content and even potential for modding support – something the series has never been known for before. We’ve already seen wacky mods being made for the Master Chief Collection, and the possibilities for future mods are pretty much limitless as long as the developers choose to support it.",
    "And Halo on PC doesn’t just benefit PC players. After the Master Chief Collection launched on PC, enhancements were made for the game on Xbox too. Greater care was given to the game (which originally came out in 2014 for the Xbox One) and new content was added, giving it a second chance at success on Xbox. Halo 3, a game that came out in 2007, received new maps for the first time in over a decade.",
    "Regular seasonal content has been added in the form of new armor, weapon skins or nameplates – all unlockable in-game. The game’s Xbox player base was given a shot in the arm, and the developers are more committed than ever to ensure it stays alive. It seems like 343 are treating the collection with the respect it deserves, and PC and Xbox players get to experience the best version of it together",
    "It’s important to note that none of this would have happened without Microsoft’s focus on expanding its games to PC. Halo used to be their system seller, and while there are certainly people who bought an Xbox Series X to play Infinite, it’s not a requirement. In fact, PC and Xbox players are one and the same to Microsoft. They took a risk by voluntarily making their consoles less appealing to PC players, but ultimately this is a much better situation for everyone.",
    "Microsoft has struggled to push Halo to the forefront of gaming again, but now they’ve committed to PC gaming the franchise is finally vying to reclaim its spot as one of the top shooters on the market. Quite simply, without PC support this would have been a much tougher sell. Halo is not the genre-defining titan it used to be. The future of the series lies not as an Xbox system seller, but as a game that can reach across to PC and Xbox players alike and rebuild a community. Microsoft’s flagship title has to be one that all of their players can enjoy together, and Halo Infinite is shaping up to be exactly that."
  ],
  "headers": {},
  "links": {
    "The Xbox One": "https://www.techradar.com/reviews/xbox-one-x/reviews/original-2013-xbox-one",
    "Halo 5: Guardians": "https://www.techradar.com/news/gaming/consoles/halo-5-multiplayer-is-anything-but-spartan-1305236",
    "Xbox 360": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-360-703247/review",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "FPS franchises": "https://www.techradar.com/news/best-fps-games",
    "Master Chief Collection on PC": "https://www.techradar.com/news/halo-the-master-chief-collection-is-officially-coming-to-pc",
    "Playing with friends across multiple systems": "https://www.techradar.com/news/10-cross-play-games-to-play-across-ps4-xbox-one-pc-and-nintendo-switch",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}