{
  "source": "https://www.techradar.com/news/next-oculus-quest-and-apple-vr-headsets-could-be-more-realistic-than-ever-with-oled",
  "title": "Oculus Quest 3 and Apple VR headset could both get an OLED upgrade",
  "category": "vr",
  "updated": "2021-09-15T09:19:03Z",
  "author": "hamish-hector",
  "summary": "Move over LCD, it's OLED's time to shine",
  "article": [
    "Apple may have neglected to mention its VR headset plans at yesterday’s California Streaming event, but the latest reports suggest Apple wants to use micro-OLED panels in its VR and AR devices, and it might not be the only company headed that way.",
    "The Apple information was discovered by The Elec who has said that it received reports Apple is currently requesting a sample of fine metal mask (FMM) from APS Holdings for use in virtual reality. Specifically, Apple requested a resolution of 3,000ppi (pixels per inch) which is much denser than traditional OLEDs.",
    "FMM is used in creating OLED panels – it’s responsible for depositing the red, green, and blue organic materials during production – and is frequently used to make OLED panels for smartphones. APS is currently divulging FMM processes that can create micro-OLED panels up to 4,000ppi; Apple is likely looking to see how well APS is progressing before committing to use its tech in its own VR headset.",
    "Apple might not be the only VR headset maker headed into the world of OLED, though, as industry stalwart Facebook is reportedly looking into the tech for its next Oculus device.",
    "Job postings discovered by SE Daily in South Korea suggest Facebook has hired several OLED experts to work in its Reality Lab division. While it doesn’t look like Facebook will start manufacturing its own panels, it likely wants to rely on these OLED experts to help develop new technologies for use in its upcoming Oculus devices.",
    "Most VR headsets have previously relied on LCD panels for their displays, given their relatively cheap costs to manufacture, but they certainly have their downsides.",
    "LCD panels are considerably heavier than OLEDs, especially if you want the best possible LCD experience with an LED backlight. OLED panels can instead emit their own light, achieving what LCDs can and more with few layers and materials.",
    "OLED displays are able to create a better-looking picture, as each pixel can work independently; this results in better dynamic range (colors are brighter and dark scenes are more nuanced) and can have better energy efficiency. You’ll also find OLED screens can achieve faster refresh rates, allowing for a more smooth experience.",
    "Using OLED panels in VR headsets would mean the next generation of devices from Facebook and Apple are not only more comfortable to wear but provide a considerably better and more immersive experience - especially if the companies use micro-OLEDs that offer even better HDR than regular OLEDs.",
    "While OLED panels are cheaper than they have ever been, they are unfortunately still more pricey than LCD. That means that you might want to start saving now if you're interested in trying out the VR headsets Facebook and Apple come out with next."
  ],
  "headers": {
    "5": "Analysis: why move over to OLED?"
  },
  "links": {
    "VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "California Streaming": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=3359",
    "SE Daily": "https://www.sedaily.com/NewsVIew/22RG7XS2HE"
  }
}