{
  "source": "https://www.techradar.com/news/android-12l-is-a-new-version-for-big-screens-on-tablets-and-foldables",
  "title": "Android 12L is a new version for big screens on tablets and foldables",
  "category": "tablets",
  "updated": "2021-10-28T00:47:30Z",
  "author": "david-lumb",
  "summary": "Finally, an iPadOS for Android tablets",
  "article": [
    "While Android 12 was just fully released alongside the Google Pixel 6 and Google Pixel 6 Pro, another version of the operating system has just been revealed – but not for phones. Instead, Android 12L will better harness the big screens of tablets and foldables.",
    "Android 12L looks to be an aesthetic restructuring that rearranges the UI to better use large screens, per the Android Developer Blog post introducing the new operating system version – so don’t expect any new exclusive features, at least not yet. Android 12L is available for developers, and will come to users starting early next year with a full release in Q2 2022.",
    "The big switch is to a two-column layout, which allows users to pull down less screen-intensive tasks like notification shades and Quick Settings down to one side, while Settings and other system apps are likewise optimized. Tired of inputting your PIN or lock pattern in the middle of the screen? Android 12L moves it to one side (which you can bring to the other by tapping the empty screen area). There are also refined animations for foldables making for smoother app transitions when shifting from outer to full-size inner displays.",
    "Split screen has also been improved with a new taskbar to hold your most-used apps, and by default, all apps can be used in split-screen mode even if they aren’t resizable. New intuitive gestures let users drag-and-drop apps from the taskbar to either side of the screen – a motion that iPadOS users will be familiar with. And like iPadOS 15, Android 12L has manual controls in overview to start split-screen mode by tapping a button (the new ‘split’ action).",
    "Google is also improving compatibility modes to make sure apps look better when upsized for bigger screens, but the Google Play Store will also warn users if an app isn’t optimized for large screens – though that’s not coming until 2022.",
    "We’ve got a few months for developers to implement Android 12L compatibility for their apps, and even then, it seems like we’ll have to wait until Q2 2022 for the full version of Android 12L to land with consumers, per Gizmodo.",
    "That will be “in time for the next wave of Android 12 tablets, Chromebooks, and foldables,” the Android Developers wrote in their blog. That will likely include the Samsung Galaxy Tab S8, which we’re expecting in early 2022.",
    "we haven't heard of many more Android tablets coming in that time frame, but Android 12L could improve tablets that’ll be out by then like the Nokia T20, Surface Go 3, and TCL TAB Pro 5G – all cheaper tablets that could use improvements in UI promised by the new version of Android."
  ],
  "headers": {
    "5": "Android tablets: what’s coming alongside Android 12L?"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "post": "https://developer.android.com/about/versions/12/12L/summary#system-ui",
    "Gizmodo": "https://gizmodo.com/android-12l-might-just-make-android-tablets-good-1847948558?utm_source=twitter&utm_medium=SocialMarketing&utm_campaign=dlvrit&utm_content=gizmodo",
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "Nokia T20": "https://www.techradar.com/news/hmd-globals-debut-android-tablet-is-a-cheap-amazon-fire-hd-10-rival",
    "Surface Go 3": "https://www.techradar.com/reviews/microsoft-surface-go-3",
    "TCL TAB Pro 5G": "https://www.techradar.com/news/the-tcl-tab-pro-5g-is-one-of-the-cheapest-5g-tablets-you-can-buy"
  }
}