{
  "source": "https://www.techradar.com/news/new-ipados-15",
  "title": "iPadOS 15 release date, new features and what will change on your iPad",
  "category": "tablets",
  "updated": "2021-09-22T09:15:01Z",
  "author": "tom-bedford",
  "summary": "iPadOS 15 is now available",
  "article": [
    "iPadOS 15 is now available to iPad users, the 2021 operating system update, and since Apple's WWDC 2021 keynote speech we've been discovering what the upcoming update contains.",
    "A sister update to iOS 15, the new iPadOS has lots of the features of that iPhone operating system, but with a few extras that make the most of the tablet form factor.",
    "iPadOS 15 improves upon iPadOS 14 features (and adding some that were curiously absent from 2020's update despite already being on iPhone), but some people might like one or two of the changes.",
    "While a developer beta went live shortly after WWDC 2021, the public beta came out a few weeks later at the end of June – any user with an iPadOS 15-compatible device can download the public beta now and install it for free. Just keep in mind that, while more stable than developer betas, public betas can be a little finicky.",
    "Apple announced an event for September 14, which, announced updates to its iPad line, alongside a release date for iPadOS 15. If you're unsure in how to update your iPad, we've created a short guide for you to take advantage of what the new update offers.",
    "Alongside announcing the iPad (2021), iPad mini (2021) at the September 14 event, Apple also announced that iPadOS 15 would launch on September 20, which it did.",
    "A developer beta was released shortly after WWDC 2021, and an iPadOS 15 public beta went live at the end of June – if your device is compatible with iPadOS 15 (see below), it can run the public beta.",
    "There's most likely going to be an iOS 15.1 soon that brings SharePlay back, so a beta for this may be appearing soon, alongside another public beta.",
    "To get a public beta running, here's a summary of what you need to do: visit the Apple Beta Software Program site on the device you want to update, sign in with your account, download a beta profile to your device, head to the Settings app and install it, restart your device, and head to Settings > General > Software Update like it was any other software.",
    "A developer beta was released shortly after WWDC 2021, and an iPadOS 15 public beta went live at the end of June – if your device is compatible with iPadOS 15 (see below), it can run the public beta.",
    "Apple confirmed iPadOS 15 will come to 'iPad mini 4 and later, iPad Air 2 and later, iPad 5th generation and later, and all iPad Pro models'. So what does that mean? Well, all the iPads listed below:",
    "Lots of the new iPadOS 15 features are actually features of iOS 14 that have received a rejig. Below we've highlighted the key changes coming to your iPad.",
    "Widgets were added in iOS 14, but they were locked to the home screen in a panel on the left... for some reason. That wasn't the case for iPhones, and it made the iPad widgets hard to use.",
    "That's changed in iPadOS 15, so you can put widgets wherever you want. There are also widgets for more apps than before, including new widgets for the App Store, Find My, Game Center, Mail, and Contacts, and widgets now come in different sizes than they did before.",
    "Two examples shown were a Photos app that shows you snippets of the pictures you've taken, and a Files widget that's pretty big, so you can see lots of files at once.",
    "An iOS 14 feature that we're finally getting on iPadOS is the App Library, which is a menu where you can list all your apps on a separate screen, much like the app drawer on Android.",
    "It also sorts your apps into categories, so this is a good way to keep all your tools organized if you're a disorganized person, and file your apps by their function or frequency of use.",
    "On iPhones you have to swipe to the end of your home screens to get to the app library, but on iPads you can also bring the thing up easily from any page via the dock.",
    "Another 'new' feature that isn't actually new is multitasking, so you can dual-screen apps and keep them off to the side if you're not using them.",
    "It's not clear how this is different from the current split-screening feature, as the 'shelf' or list of apps to swap between when you're multitasking already exists in prior iPadOS builds.",
    "The way to enable split-screen is different though, as instead of dragging or dropping apps around, a separate menu at the top of the screen lets you enable Split View or Slide Over with a tap.",
    "There's also now quick access to the home screen from Split View, and the ability to use keyboard shortcuts to set up and switch between Split View and Slide Over.",
    "The iOS Notes app has turned into Google Docs, by the sounds of it. You can tag people into documents, see a revision history and more.",
    "One other new improvement is the ability to easily bring up a Quick Note by swiping up on the screen with the Apple Pencil, giving you a way to easily sketch a note or write down an idea.",
    "You can use this while another app is on the main screen, and then copy some data from the app that's open, like the URL of a website.",
    "There are also new ways to tag notes, which means you can categorize your notes and find them through a new feature called the Tag Browser.",
    "Want to use your iPad along with your Mac for a seamless expensive? Universal Control may be the feature for you, which allows you to drag and drop between devices.",
    "For example, if you're working on a document on your iPad you will be able to drag it to the side of the screen and pull it up onto your Mac's screen and work from it there. Exactly how you set this up hasn't been made clear yet, but it looks exciting nevertheless.",
    "iPhones have access to Apple's Translate app, which is basically like Google Translate but made by Apple.",
    "This app is now coming to iPadOS, so you can convert text and spoken words between languages. You can also translate things in other apps, like emails in foreign languages for example. And with Auto Translate the app will detect when someone is speaking and in which language, and translate it without having to hit a microphone button.",
    "FaceTime has a variety of improvements, and the biggest of them is a feature called SharePlay that allows you to listen to songs together over Apple Music or watch TV shows in sync, with shared playback controls.",
    "It's sort of like Netflix Party, a feature many used during the Covid-19 lockdowns in 2020, but specifically for Apple devices and through the company's services like streaming platforms.",
    "There's a new Live Text feature too, which recognizes text in a photo and allows you to take a relevant action, such as calling a phone number in a picture, or translate the text. This pairs with Visual Look Up, which can identify objects in a photo.",
    "Updates to Safari meanwhile include a new tab design, and a Tab Groups feature for saving and managing tabs.",
    "There's also a new Focus tool, which is designed to filter out notifications when you want to concentrate on particular tasks. For example, you may want to make sure you don't have Facebook pinging you while you're working. This can be customized so that it only filters out the types of notifications that you don't want to be distracted by.",
    "Plus, like iOS 15, notifications summary will gather together particular notifications at the time of day you choose them to. Find you get lots of notifications during work that you don't want to see until you finish? You can set this up with iPadOS 15.",
    "You can also develop your own apps straight from the tablet with Swift Playgrounds 4. Pus you can move seamlessly between an iPad and a Mac with a single mouse and keyboard, Memories in Photos has a new look and personalized song suggestions, Maps includes new and enhanced details, and there are new privacy and accessibility tools."
  ],
  "headers": {
    "5": "iPadOS 15 release date",
    "10": "iPadOS supported devices",
    "11": "iPadOS 15 features",
    "12": "iPadOS 15 widgets",
    "15": "iPadOS 15 App Library",
    "18": "iPadOS 15 multitasking",
    "22": "iPadOS 15 Notes app",
    "26": "iPadOS 15 Universal Control",
    "28": "iPadOS 15 new apps and other features"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPadOS 14": "https://www.techradar.com/news/ipados-145",
    "came out": "https://www.techradar.com/news/ios-15-public-beta-is-here-along-with-ipados-15-and-watchos-8-early-looks",
    "an event for September 14": "https://www.techradar.com/news/iphone-13-launch-date-confirmed-for-september-14-heres-all-we-know",
    "created a short guide for you": "https://www.techradar.com/how-to/how-to-get-ios-15-developer-beta-on-your-iphone",
    "iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad mini (2021)": "https://www.techradar.com/reviews/ipad-mini-2021",
    "September 14 event": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "it did": "https://www.techradar.com/how-to/how-to-get-ios-15-developer-beta-on-your-iphone",
    "public beta went live": "https://www.techradar.com/news/ios-15-public-beta-is-here-along-with-ipados-15-and-watchos-8-early-looks",
    "Apple Beta Software Program site": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1196955803223903000&sharedId=trd-us&u=https%3A%2F%2Fbeta.apple.com%2Fsp%2Fbetaprogram%2F"
  }
}