{
  "source": "https://www.techradar.com/news/bringing-lokis-worlds-to-life-was-like-making-a-weekly-marvel-movie",
  "title": "Bringing Loki's worlds to life was like making a weekly Marvel movie",
  "category": "entertainment",
  "updated": "2021-07-13T17:22:20Z",
  "author": "samuel-roberts",
  "summary": "We speak to the show's production designer, Kasra Farahani",
  "article": [
    "Spoilers for Loki episodes 1-5 follow.",
    "From Wakanda to Xandar in Guardians of the Galaxy, the MCU is increasingly defined by the extraordinary fictional places it shows us on-screen. It'll be no surprise to learn that bringing these locations to life is a massive collaboration between lots of very talented people – and for Loki on Disney Plus, which releases its final episode this week, pretty much everywhere we've seen across the past five episodes is a location that doesn't actually exist.",
    "From the Time Variance Authority's gorgeous offices to the cyberpunk-infused planet of Lamentis-1 in 2077, it's taken us on an extraordinary tour across different times and places in the Marvel universe – and the level of work it took to make all that happen has been enormous.",
    "\"What might be helpful for you to hear is that this project is truly unprecedented and that each episode basically represents, in my opinion, the amount of world building that you typically do on one Marvel movie, for the most part,\" the show's production designer Kasra Farahani tells TechRadar. \"So it's a huge amount of work, which is [why] we were on the project for so long.\"",
    "Farahani has been helping to shape the look of the MCU for over a decade, with credits on Thor, Guardians of the Galaxy Vol. 2, Black Panther and Captain Marvel under his belt. So when he says that each episode of Loki took as much effort as a whole MCU movie, he knows what he's talking about.",
    "We ask Farahani to define what a production designer does on a project like Loki. \"So as a production designer, you're kind of responsible – in the initial phase – for distilling the words on the page into a series of general conceptual imagery that the entire collaborative team can respond to and comment on. And through an iterative process like this, you arrive at what the conceptual kind of roadmap is for the look of this story in the different worlds you have to build.\"",
    "At first, it's laying the visual groundwork for everything we're going to see on screen.",
    "\"And then the second phase of that becomes the process of taking those conceptual designs, and translating them into a series of plans – either literal plans to build sets or plans on how to integrate with visual effects to create things virtually.\"",
    "This leads to everything the last five episodes of Loki have shown you.",
    "When we think of Loki's production design, it's those lovely TVA hallways that come to mind. As the location where Loki is detained at the start of the series, it feels like a real place and out-of-time simultaneously – like it's eternally a 1960s office there, even though everyone who works in this location is policing the concept of time itself.",
    "Creating the TVA is the first thing we wanted to ask Farahani about. \"It was a dream job. The original brief, in a very concise way, described the look of the TVA as Blade Runner meets Mad Men, which was a very evocative description. And then in discussions with Kate [Herron], our director, in my initial meeting with her before we'd even met, we had so many of the same references – a lot of which included Terry Gilliam's Brazil because it had, I think, a very important missing element, which was the anachronism and the heavy presence of a bureaucracy; a kind of monolithic, uncompromising bureaucracy.\"",
    "Pop culture influences were one thing, but personal experiences from both Farahani and British director Kate Herron also shaped how the TVA headquarters would look on-screen. \"So, the brutalist architecture near the urban areas where Kate grew up, the mid-century modern institutional architecture that populates the entire West Coast of the United States where I grew up – these sort of mid-century, institutional influences were a big part of [the TVA]. And it became about contrasting that in places, almost paradoxically, with the warm and whimsical palettes of some of the more light versions of mid-century modernism.\" That last part is where the Mad Men influence comes in.",
    "Loki episode 3 memorably sees the destruction of Sharoo, a city on Lamentis-1 – one of the many end-of-the-world scenarios where Sylvie is hiding out from the TVA's grasp. Farahani highlights this as one of the more challenging locations to bring to life, and an example of how intense collaboration makes the magic happen.",
    "\"Episode 3 – which takes place on Lamentis-1 – had lots to figure out in terms of interacting with virtual environments and our physical environments, maybe more than any other episode, because our show was so overwhelmingly [made with] built sets and done in-camera,\" Farahani says.",
    "\"Like for instance, Sharoo at the end of episode 3, we built that set completely to facilitate this 360-degree oner that they did,\" he says. In case it isn't obvious from the context, 'oner' means a single long shot that appears to have no cuts to the viewer.",
    "\"So everything above 16 feet is a set extension, but everything below that was in-camera. That sequence, specifically because it had to appear to be a virtual oner, there was a lot of choreography and planning going into working with Autumn [Durald], our cinematographer, Richard Graves, our assistant director, Monique Ganderton, our stunt coordinator, and of course Kate, to figure out the exact locations of the stitches, to tailor the scenery, and the special effects – explosions and things like that – to facilitate the editorial needs of concealing this oner.\"",
    "The end result is a long and impressive effects-heavy shot of actors Tom Hiddleston and Sophia Di Martino watching a city get destroyed around them – which is far beyond what we've come to expect from regular TV shows in terms of scale and detail. Clearly, this is what Farahani means by each episode feeling like a movie.",
    "Not everything on the series is described in full on paper by the writers – Farahani describes episode 5's bowling alley location in the Void, the Loki Palace, as one area where the production design could fill in the blanks. \"In episode 5, the Loki Palace from a design standpoint, that was something that was so fun, but was one of the few things that took a little while and a few iterations of the script to arrive at what it was. And in the end, the art department had quite a lot of license to arrive at that design.",
    "\"The script called for a temple, but didn't say too much more, so we arrived at this idea of a bowling alley that was among the many, many things in the Void – these aberrant things that have been deleted from time because, if they had been allowed to exist, they would have created some rifts in the timeline.\"",
    "This dilapidated bowling alley, then, features alien plants growing through it, among many notable props – and all of this was carefully considered.",
    "\"The way things work in the Void is they get dumped in there – Alioth devours them,\" Farahani says. \"And then time passes – more things dump on them. So you create this sense of strata and the topography. And so the idea was that they'd found this cavity of this still-habitable, but very precarious bowling alley from the mid-century underground, and they'd occupied it. We collided it with lots of different things you can see: there are alien vines from a different reality that were deleted that happened to fall adjacently, growing through this bowling alley. There are layers and layers of detail. And sometimes they come through in the photography, and sometimes they don't.\"",
    "Farahani mentions one detail of the Loki Palace that's in there, but not necessarily easy to spot in the episode – there's a display of photos of the wall featuring star players at the bowling alley, and they're not quite human. This demonstrates how much thought goes into these minute details that only appear briefly on-screen, which matter a lot to the Marvel fans that devour these shows and movies.",
    "Finally, we can't resist asking Farahani for one teaser about this week's final episode – one location we know is coming in Loki episode 6 is some kind of mansion castle, which is where we saw Loki and Sylvie heading at the end of episode 5. \"All I can say is stay tuned,\" Farahani says. \"And I think I think fans are gonna really love what's coming next.\"",
    "Loki is available now on Disney Plus, and the final episode releases on July 14."
  ],
  "headers": {
    "9": "Creating the TVA",
    "12": "Destroying a sci-fi city",
    "17": "The Loki bowl"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Loki episode 6": "https://www.techradar.com/news/loki-episode-6-ending-explained"
  }
}