{
  "source": "https://www.techradar.com/news/top-gun-maverick-release-date-nosedives-into-2022-amid-ongoing-covid-19-concerns",
  "title": "Top Gun: Maverick release date nosedives into 2022 amid ongoing Covid-19 concerns",
  "category": "entertainment",
  "updated": "2021-09-02T09:26:48Z",
  "author": "axel-metz",
  "summary": "Could others follow?",
  "article": [
    "Among the list of big-budget movies headed their way to theatres in 2021, Top Gun: Maverick was one of the most eagerly-awaited. Not only would it reignite the airborne rivalry of Maverick and Iceman after 25 years, but the movie itself has also endured an incredibly turbulent journey to the screen.",
    "Originally slated for release on July 12, 2019, production was postponed to film more complex flight sequences. Then, in 2020, the movie was delayed again (and again…) due to the ongoing Covid-19 pandemic.",
    "Well, Paramount has now pulled the plug on Top Gun: Maverick for the umpteenth time (per Deadline), pushing back it’s November 19, 2021 release date until May 27, 2022 – which has consequences for the studio’s entire annual release slate, too.",
    "Another Tom Cruise-fronted tentpole, Mission: Impossible 7, has been shifted to September 30, 2022, since Top Gun: Maverick is now scheduled to arrive on its previously-planned May release date. Jackass Forever has also been delayed into next year, moving from October 22, 2021 to February 4, 2022.",
    "Paramounts decision to shift its release slate comes amid rising concerns over the impact of the Covid-19 delta variant on theater attendance. Unlike other studios, including Warner Bros. and Disney, Paramount has kept many of its biggest 2021 releases – A Quiet Place Part II, for instance – theatrical-only, rather than experimenting with day-and-date releases on streaming services.",
    "Tom Cruise himself is also known as a proponent of the theatrical experience, so it figures that the Hollywood A-lister – who, as well as acting, is on the production teams of both Top Gun and Mission 7 – would sanction a move to delay both of his big-budget projects.",
    "The next few weeks will mark a telling period for the outlook of theatres as 2021 draws to a close.",
    "Although hopes for an end-of-year box office recovery are being pinned on confirmed arrivals No Time to Die (30 September) and Dune (October 22), Paramount’s decision to push its biggest 2021 release into next year may encourage other theater-focused studios to follow suit.",
    "The likes of The French Dispatch, Last Night in Soho and The Matrix Resurrections are also scheduled to arrive before the year is out, though given that nearly every movie left on 2021’s call sheet has already experienced some form of delay, there’s a chance that many of them could again be kicked further down the road in the hope of a Covid-free 2022.",
    "We’re optimistic, though. The aforementioned releases of No Time to Die and Dune will surely provide a shot in the arm for the theatres across the world, and though those movies will almost certainly make less money than they would have in the absence of the pandemic, the interest they garner may be enough to keep the rest of 2021 in check.",
    "Interestingly, the studio behind Ghostbusters: Afterlife quickly shifted its upcoming movie into Top Gun: Maverick’s vacant November 19, 2021 release slot – so the fight for theatrical real estate is still very much on as the year draws to a close."
  ],
  "headers": {
    "6": "Analysis: The first domino to fall?"
  },
  "links": {
    "movies headed their way to theatres in 2021": "https://www.techradar.com/news/new-movies-2021",
    "Deadline": "https://deadline.com/2021/09/top-gun-maverick-flies-from-thanksgiving-to-memorial-day-weekend-mission-impossible-7-ignites-in-fall-2022-1234825624/",
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare"
  }
}