{
  "source": "https://www.techradar.com/news/buy-microsoft-office-prices",
  "title": "Buy Microsoft Office and Microsoft 365 deals at the cheapest prices",
  "category": "computing",
  "updated": "2021-12-06T00:19:38Z",
  "author": "james-pickard",
  "summary": "Our guide to the best Microsoft Office offers online",
  "article": [
    "Office 365 is no longer what Microsoft calls the subscription version of its popular Office suite; instead, it has been renamed as Microsoft 365. We’re here to help you find the best deals and offers on new and old versions of Microsoft Office, guiding you through the differences between Personal and Family, Business, Enterprise and Education versions.",
    "You could buy an Office subscription from Microsoft directly, but it's often possible to get a better deal from a reliable third party retailer. If you're looking to treat yourself to a new Office suite, you might also be in the market for a new laptop. Be sure to check out one of our guides so you can get the best price on the latest cheap laptop deals.",
    "If you're looking to buy Microsoft 365, you should know that this is a subscription-based service. The prices below are for your first year for one user to use on one PC, along with a tablet or mobile too (for the Personal one) or up to six users (on the Family bundle).",
    "The advantages of using Microsoft 365 include having access to all the latest versions of programs in the Microsoft Office suite and having 1TB of OneDrive cloud storage.",
    "The latter is particularly useful for editing documents on the go. So you could go from writing on the laptop/desktop to making a few changes or crucial last minute updates on your mobile or tablet.",
    "If the online cloud storage and device switching won't be useful, we'd recommend scrolling further down this page and consider buying Microsoft Office Home and Student 2019 instead for a one-off fee but you won't get any updates.",
    "There are four different Microsoft 365 business plans as of September 2021. Microsoft says that it changed the name to \"to be more reflective of the range of features and benefits in the subscription. Microsoft 365 includes everything you know in Office 365, including best-in-class Office apps, intelligent cloud services, and advanced security.\"",
    "Microsoft certainly took its time to give us a new standalone Office package as it's moved its focus to the Microsost 365 subscription service nowadays. But if you want a modern version of Office with just a simple one-time fee, this is the way to go.",
    "You don't get the fancier cloud-based features and multi-device support that you do with Microsoft 365, but this can work out much cheaper in the long run.",
    "As is usually the case, the cheapest option for Office 2019 is the \"Home & Student\" Edition, which comes with a single user license, allowing you to install the Office suite of apps on one device. It still comes with all the essential Office apps that are suitable for most user's needs: Word, Excel, PowerPoint, Outlook, Access, Publisher, and OneNote.",
    "You might also want to check out how to download and use Microsoft Word for free."
  ],
  "headers": {
    "2": "Best Microsoft 365 and Office deals"
  },
  "links": {
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "PowerPoint": "https://www.techradar.com/reviews/microsoft-powerpoint",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "Access": "https://www.techradar.com/reviews/microsoft-access",
    "Publisher": "https://www.techradar.com/reviews/microsoft-publisher",
    "how to download and use Microsoft Word for free": "https://www.techradar.com/how-to/how-to-download-and-use-microsoft-word-for-free"
  }
}