{
  "source": "https://www.techradar.com/news/oneplus-9-vs-google-pixel-5",
  "title": "OnePlus 9 vs Google Pixel 5: competing with top smartphones in very different ways",
  "category": "phones",
  "updated": "2021-05-01T08:00:03Z",
  "author": "jon-mundy",
  "summary": "Two of the top Android phone choices",
  "article": [
    "If you like your smartphones to be solidly built, with super-clean software and strong cameras for around the $700 / £600 mark, then only two phones come to mind.",
    "The Google Pixel 5 and the OnePlus 9 are two of the finest upper-mid-range phones out there, with each packing impressive specifications for a good deal less money than the true flagship brigade.",
    "But which of the two is best? A glance at our respective reviews would suggest the OnePlus has the advantage, having scored 9 out of 10 to the Pixel 5’s 8 out of 10. But it isn’t quite as simple as that.",
    "Both of these phones are available to buy right now, with the Pixel 5 having launched on October 15, 2020, and the OnePlus 9 hitting shops on March 26, 2021.",
    "Prices for the OnePlus 9 start from $729/£629 for 8GB of RAM and 128GB of storage, while a move up to $829/£729 will get you 12GB of RAM and 256GB of storage.",
    "The Google Pixel 5 continues to sell at its launch price of $699 / £599 / AU$999 from the official Google Store, but you may be able to find a deal given its relative age.",
    "We love both of these phones, but neither is what we’d call a looker. Indeed, there’s an argument to be made that both the OnePlus 9 and the Google Pixel 5 represent regressions in terms of design. The OnePlus 8 and the Pixel 4 before them packed in elements that could be considered more premium.",
    "Still, we’d probably give the Google Pixel 5 the edge for its brave normcore-chic approach. Its all-metal body stands out among the usual glass sandwich brigade, while a curious matte material finish (in Sorta Sage and Just Black) adds to a general feeling of grip and ruggedness.",
    "A completely flat display and a rear-mounted fingerprint sensor (which isn’t particularly fast or responsive) completes this workmanlike air. But, despite all this, you wouldn’t confuse the Pixel 5 for any other (non-Google) phone.",
    "You can’t say the same for the OnePlus 9. It’s similarly undemonstrative – or “burdenless”, to use the OnePlus parlance – with the same kind of flat display and hole punch selfie camera. But it’s also rather more generic in its emulation of more expensive phones, and it even feels a little cheap.",
    "Unlike Google, OnePlus has run away from any use of metal, opting instead for a fiberglass-reinforced polymer frame. Or shiny plastic, if you want to simplify things. The back is glass, however, and you get one more color option with the OnePlus 9: Winter Mist, Arctic Sky, and Astral Black.",
    "Another point in favor of the Pixel 5 – at least for some – will be its compact dimensions. At 160 x 74.2 x 8.7mm and 192g, the OnePlus 9 dwarfs the Pixel 5 at a mere 144.7 x 70.4 x 8mm and 151g.",
    "We do like the OnePlus 9’s trademark alert slider though, which provides effortless access to silent and vibrate modes. Google could do worse than adopt something similar.",
    "If Google takes a narrow lead with the design of its Pixel 5, then the OnePlus 9 draws even with a slightly superior display.",
    "While both phones use FHD+ OLED screens, the OnePlus 9’s panel is bigger and brighter. At 6.55 inches, it offers a fair amount of extra real estate over the 6-inch Pixel, and a 1,100 peak brightness goes well beyond the 700-odd at which the Pixel 5 has been recorded.",
    "The OnePlus 9’s screen is also more fluid, with a maximum refresh rate of 120Hz. Google’s phone can only manage 90Hz. That’s far from a disgrace – Apple is still stuck at 60Hz – but the advantage is quite clear.",
    "Still, neither display uses LTPO technology for a truly variable refresh rate, so the Pixel 5 display is likely to be the more energy efficient of the two. All in all, though, the OnePlus 9 display wins quite clearly.",
    "Both of these phones make a play to offer you a flagship-level camera experience, and both do a good job while pulling up short of the very best.",
    "The OnePlus 9 leads with the same 48-megapixel Sony IMX689 main sensor that prompted praise for the OnePlus 8 Pro, albeit with the notable exclusion of OIS. Over on the Pixel 5, you have the exact same modest 12.2-megapixel Sony Exmor IMX363 sensor that Google has been using for several years now.",
    "You might think that this hands a major advantage to Google on the basic image-quality front, but that would be to misunderstand Google’s unique focus. By keeping a consistent hardware environment (which includes OIS), and iterating on its overwhelming image processing advantage, its Pixel phones continue to capture punchy, well-exposed shots.",
    "The OnePlus 9 is no slouch in this department, either. This is courtesy of that bigger image sensor and color tuning from camera king Hassleblad, which yields slightly more naturalistic tones than the Pixel.",
    "When it comes to Night shots, the Pixel 5 takes the win. The OnePlus 9’s lack of OIS and its less-honed algorithms cost it when the lights go out. Google, meanwhile, continues to get miraculous low-light results from such humble camera hardware.",
    "Both phones do good things with their ultra-wide units. With the OnePlus 9, that’s through a cutting-edge 50-megapixel Sony IMX766 ultra-wide sensor, complete with an innovative freeform lens. The result is ultra-wide shots that are roughly as bright and detailed as those taken with the wide sensor, and with far less in the way of fisheye distortion.",
    "However, Google also manages to achieve impressive results with a new dedicated 16-megapixel ultra-wide sensor. Again, you can thank Google’s algorithmic excellence for the lack of distortion, rather than any amazing hardware. The main drawback here is a narrower 107-degree field of view.",
    "Neither phone packs a dedicated telephoto lens, which is a shame. The OnePlus adds a 2-megapixel monochrome sensor, but that’s pretty much pointless, so we’ll discard that from our considerations.",
    "On the selfie camera front, the Pixel 5 packs an 8-megapixel f/2.0 setup, while the OnePlus 9 goes with a 16-megapixel f/2.4 equivalent. Google’s selfie camera packs fewer but bigger pixels – and, of course, it has that masterful Google software magic to enhance its selfies.",
    "On the video front, the OnePlus 9 can manage 8K video at 30fps, in addition to 4K video at 60fps. The Pixel 5 can only hit 4K video at 60fps, but we’re still a little dubious over the merits of 8K footage in mid–2021.",
    "So far it’s all been similar, but if there’s one area in which one phone absolutely dominates the other it’s performance. And it’s the OnePlus 9 that gets the resounding win.",
    "With a Snapdragon 888 SoC on board, the OnePlus 9 is every bit as fast as phones such as the Samsung Galaxy S21 Ultra and the Oppo Find X3 Pro, both of which cost more than $1,000/£1,000. This is helped by a healthy 8 or 12GB of LPDDR5 RAM.",
    "The Google Pixel 5 just can’t compete with that. Google took a bit of a gamble with its latest flagship, essentially rolling back the processor from the Pixel 4 to a mid-range Snapdragon 765. This is backed by 8GB of slower LPDDR4x RAM.",
    "This combination of components doesn’t make the Pixel 5 a poor performer by any means. It enables the Pixel 5 to handle very well in general navigation, and it has no problem handling that 90Hz display when flitting between home screens, web pages and the like.",
    "But the Snapdragon 888 is both a level and a generation beyond, and our Geekbench 5 benchmark tests for both phones are telling. The OnePlus 9 achieves a multicore score of 3,587, while the Pixel 5 can manage only 1,617.",
    "Sure enough, when the going gets a little tougher, with heavy multitasking and high-end gaming, the OnePlus 9’s extra headroom shows. You can play PUBG Mobile on maxed-out settings with the OnePlus, and with remarkably fluid performance. Suffice to say, this isn’t possible on the Pixel 5.",
    "While we’re talking about the media experience on these two devices, both offer stereo speakers, but only the OnePlus 9 features Dolby Atmos support. And when it comes to storing that media, OnePlus provides a choice of either 128 or 256GB of storage, while there’s just a single 128GB storage option for the Pixel 5. Neither phone features a microSD slot.",
    "Both phones have their merits when it comes to software, and indeed these are two of the strongest mobile UIs in the business.",
    "Of course, with the Pixel 5 you get stock Android 11 precisely as Google intended it. It’s cleaner and crisper than literally any other Android UI, with absolutely no bloatware and a full suite of Google’s apps. If no-nonsense is what you’re after, the Pixel 5 is the phone for you – and it will also get an Android 12 update before any other device.",
    "In the other corner, OnePlus’s OxygenOS offers more customization options and more UI bling, but without completely smothering Google’s solid underpinnings. True, it isn’t as close to stock as it used to be, but OxygenOS displays far more taste and restraint than custom efforts from Samsung, Xiaomi, Oppo and the like.",
    "The OnePlus 9 has a 4,500mAh battery, which is quite a bit bigger than the Google Pixel 5’s 4080mAh cell. Balancing that out, the Pixel 5 has a smaller, dimmer, less fluid display and a less powerful processor for a lower level of power draw.",
    "In both cases, you’ll be able to get through a full day of moderate to heavy use just fine. It’s tough to call an absolute winner.",
    "Where there is a clear winner is when it’s time to recharge. The OnePlus 9 packs an incredibly fast 65W charger in the box, which can charge from 1 to 100% in just 28 minutes.",
    "By contrast, the Google Pixel 5 provides an 18W wired charger in the box. You also get support for 15W wireless charging with the OnePlus 9, versus the Pixel 5’s 12W.",
    "While these two phones might be similarly priced, they offer starkly contrasting packages, to the point where we’re reluctant to call an absolute winner. Both will be excellent picks, depending on your needs.",
    "The Google Pixel 5 is the more compact phone with a more confident, distinctive (if hardly stunning) design. It’s perfect for those who want their phone to do the simple things quietly and elegantly, then stay out of the way the rest of the time.",
    "It includes a fine camera, too – one that excels in night-time conditions. Meanwhile, if you’re a fan of Google’s stock Android OS and speedy updates, you won’t find a better phone.",
    "On the other hand, the OnePlus 9 provides far superior processing power for the money, with a genuinely flagship level of performance. It also sports a bigger, brighter, more fluid display. Those two factors alone make it a much better pick for those who consume a lot of video media or play a lot of games on-the-go.",
    "It also has a good but not great camera, packed with advanced hardware yet missing OIS. If software customization and tinkering is your thing, meanwhile, then OxygenOS has more to offer than stock Android."
  ],
  "headers": {
    "3": "OnePlus 9 vs Google Pixel 5 price and availability",
    "6": "Design",
    "13": "Display",
    "17": "Camera",
    "27": "Specs and performance",
    "37": "Battery",
    "41": "Takeaway"
  },
  "links": {
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro"
  }
}