{
  "source": "https://www.techradar.com/news/fujitsu-and-trend-micro-look-to-secure-private-5g-networks",
  "title": "Fujitsu and Trend Micro look to secure private 5G networks",
  "category": "computing",
  "updated": "2021-04-09T16:05:57Z",
  "author": "steve-mccaskill",
  "summary": "Private 5G market is set for significant growth",
  "article": [
    "Fujitsu and Trend Micro are conducting trials in Japan to see how private 5G networks can be secured against potential threats.",
    "A private 5G network provides dedicated access to a specific customer, using either licensed, unlicensed or shared spectrum, with no resources shared by any third party.",
    "By pursuing this route, customers can define the scale, pace of rollout, and technology used, while guaranteeing a certain level of performance for their applications.",
    "These characteristics make it an attractive option for smart factories that will rely on reliable connectivity to power mission critical applications and to connect massive numbers of devices.",
    "Although 5G offers many security advances over previous iterations of mobile technology, smart factories will be a prime target for hackers because of the importance of the systems that are connected to the network and the sensitive data that they generate. Meanwhile the greater volume of devices means more surfaces to attack.",
    "Trend Micro’s Mobile Network Security Solution will be trialled at Fujitsu’s plant in Oyama to see how smart factories can be protected from both internal threats, such as infected devices, and external attacks by hackers.",
    "The technology has been built into a private 5G system that simulates a smart factory environment equipped with high-definition monitoring cameras and automatic guided vehicles (AGV). The two companies can than manage the status and security of the connected systems by detecting threats, authenticating devices, and blocking unauthorised communications.",
    "“Fujitsu aims to realize a society in which people, goods, and services are connected in real time through 5G technology and to solve problems facing the world.\" said Tomonori Goto, Head of 5G Vertical Service Office at Fujitsu. “To this end, we believe that this security solution, created together with Trend Micro, represents a key technology for applying private 5G to mission-critical areas.”",
    "“We’re delighted to be joining forces with Fujitsu to tackle the immense challenge of cybersecurity for private 5G,” added Akihiko Omikawa, executive vice president for Trend Micro. “Together, we are making smart manufacturing more secure to ensure production isn’t stopped due to a cyberattack.”",
    "If the tests are successful, then the partners will consider commercialising the technology for wider use, hoping to capitalise on a growing market.",
    "Demand for private cellular networking equipment (both 4G and 5G) to support mission critical applications will see the market reach $5.7 billion by 2024, according to a new study by IDC."
  ],
  "headers": {
    "3": "5G business"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}