{
  "source": "https://www.techradar.com/news/this-huge-home-security-bundle-is-the-best-ring-doorbell-deal-of-black-friday",
  "title": "This huge home security bundle is the best Ring doorbell deal of Black Friday",
  "category": "smart-home",
  "updated": "2021-11-25T14:56:21Z",
  "author": "cat-ellis",
  "summary": "Everything you need to secure your home, with $195 off",
  "article": [
    "Right now, you can secure your home with a complete eight-piece ring alarm security set for just $229.98 at Amazon. That's a huge saving of $195 off the regular price, and the best Ring deal we've seen this Black Friday.",
    "We're rounding up all this year's best Ring doorbell Black Friday deals, and this one is truly impressive. It includes the latest 2020 Ring video doorbell, an Amazon Echo Show smart speaker, a keypad, four contact sensors, a motion sensor, a range extender, and a base station to link it all together. It's a great Black Friday deal for securing a small home or apartment, and can be extended with cheap additional sensors to cover a bigger house.",
    "(Not in the US? Scroll down for deals in your region.)",
    "It's an exceptional bundle that gives you a whole lot of security for your money. It's not the only great Ring deal available though; if you only want a doorbell, or don't need the sensors and motion sensor, there are lots of huge savings on smaller bundles as well. Here's our pick of the very best Black Friday offers.",
    "No matter where you live, you'll find all the lowest prices for the [Product Name] from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Ring doorbell Black Friday deal",
    "4": "More Ring doorbell deals",
    "5": "More Black Friday deals"
  },
  "links": {
    "eight-piece ring alarm security set for just $229.98 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FRing-Alarm-8-Piece-Doorbell-Release%2Fdp%2FB08YT3FBBW%2Fref%3Dsr_1_15%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7500125404980160000-20",
    "Ring doorbell Black Friday deals": "https://www.techradar.com/black-friday/the-best-black-friday-deals-on-amazons-ring-doorbell",
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}