{
  "source": "https://www.techradar.com/news/gamestop-fever-rwallstreetbets-and-the-stock-trading-frenzy-explained",
  "title": "GameStop, r/WallStreetBets and the stock trading frenzy, explained",
  "category": "computing",
  "updated": "2021-11-26T07:40:56Z",
  "author": "joel-khalili",
  "summary": "Amateur investors have driven up the price of a number of neglected stocks - here's all you need to know",
  "article": [
    "Update: February 18 The man credited with architecting the recent GameStop short squeeze and stock trading frenzy has been hit with a class action lawsuit.",
    "Better known by pseudonyms Roaring Kitty and DeepF***ingValue, redditor Keith Gill stands accused of tricking investors into purchasing overpriced stocks and violating securities law that protects against market manipulation. He is also said to have concealed his background in institutional finance.",
    "The lawsuit was filed by US resident Christian Iovin, who purchased GameStop stock options during the recent market frenzy, and names Massachusetts Mutual Life Insurance Co and subsidiary MML Investors Services LLC as co-defendants.",
    "Separately, Gill is also set to speak before Congress later today, along with representatives from Reddit, hedge fund Melvin Capital and trading platform Robinhood. The virtual hearing will investigate how the value of GameStop stock was allowed to soar in such a dramatic fashion.",
    "Update: February 1 Vlad Tenev, chief executive of stock trading platform Robinhood, has denied claims the decision to place limits on the trading of GameStop and other stocks was influenced by institutional investors.",
    "Asked by Elon Musk in an interview whether large financial institutions, such as Citadel Securities, had conspired with regulators to squash the coordinated short squeeze, Tenev was quick to dismiss the idea.",
    "“You’re getting into conspiracy theories a little bit,” he said. “From our perspective, Citadel and other market makers weren’t involved in that.”",
    "Robinhood has since relaxed restrictions on 42 different stocks, with limits remaining in place temporarily on GameStop, BlackBerry, Nokia and a handful of others.",
    "Tenev said he expects to be able to dilute the remaining restrictions imminently, sparking speculation of a further buying frenzy.",
    "Update: January 29 US Senator Elizabeth Warren has asked the Securities and Exchange Commission (SEC) to prepare a strategy to prevent \"casino-like swings\" in the GameStop share price.",
    "Warren claims there is a \"troubling lack of clarity regarding who the major market participants are in this case and the degree to which their activities may be coordinated.\"",
    "The senator set a deadline of February 5 for the SEC to establish a clear plan.",
    "Original: US-based video games retailer GameStop has found itself at the center of a trading frenzy, causing its share price to rise from $18 at the start of the month to a peak of more than $450.",
    "The market mania has been fuelled by a community of amateur traders on Reddit, whose goal is to drive up the share price and apply pressure on short sellers, who had bet against the company.",
    "Redditors have also turned their attention to other stocks that institutional investors believed would perform poorly this year, such as BlackBerry, Nokia and AMC.",
    "As a result of squeeze on short sellers, some hedge funds have incurred massive losses, in the billions of dollars. However, day traders themselves are also at risk, with the inevitable market correction set to leave many people out of pocket.",
    "If you’re not a stock market aficionado, some of the jargon flying around will have been difficult to follow. So we’re here to explain what happened, how and why.",
    "Anyone familiar with social content platform Reddit will know the website is broken up into a large number of different communities, known as subreddits. Each subreddit caters to a different hobby or interest.",
    "r/WallStreetBets is a subreddit that describes itself as “a community for making money and being amused while doing it. Or, realistically, a place to come and upvote memes when your portfolio is down”.",
    "The content feed is a unique cocktail of serious investment theses, brokerage recommendations, memes and rocket emojis. The community even has its own language to describe different types of investor or stock market event.",
    "For example, an investor on r/WallStreetBets is described as having “diamond hands” if they are known never to sell, and “toilet paper hands” if they are prone to closing out their investment position at the slightest indication of a downturn.",
    "The drive to push up the price of GameStop stock originated with this community, but has since captured the imagination of a much wider pool of amateur investors (also referred to as retail investors).",
    "Short selling is a practice that allows an investor to profit from the decline in price of a specific stock. Traditionally, these kinds of plays are made by institutional investors only, although there are avenues through which an individual investor can short a stock as well.",
    "Most famously, hedge fund manager Michael Burry (played by Christian Bale in The Big Short) made a killing by shorting the housing market before the financial crash of 2007.",
    "Predicting a company or market will stumble or fail entirely, a short seller borrows a set number of shares from an existing holder, which they promise to return by a specific date. Having borrowed the shares, the short seller sells them off immediately at the current market rate.",
    "If the price of a stock that was worth $10 per share were to fall to a value of $3 per share, the short seller would pocket $7 per share when purchasing them back to return to the original owner. If the company were to go under, the short seller would pocket the full $10 per share.",
    "However, if the price of the share were to rise, the risk for the short seller is theoretically limitless. And this is the dilemma facing a number of hedge funds today, which have taken short positions against GameStop, BlackBerry, AMC and the like.",
    "One such hedge fund, Melvin Capital, closed out its position against GameStop earlier this week, crystallizing billions of dollars in losses. The hedge fund has had to seek an emergency cash injection of $2.75 billion to compensate, which will be considered a major victory by the r/WallStreetBets community.",
    "With the sudden spike in interest, stock trading services geared towards retail investors have been subjected to a tsunami of traffic. As the most accessible avenues through which amateurs can invest in stocks, many investors are wholly reliant on these services to participate in the short squeeze, but some platforms have crumbled under the strain.",
    "Popular trading platform Robinhood, which has previously been criticized for gamifying investment in an irresponsible manner, suffered a service blackout earlier this week, while Trading 212 was forced to postpone customer onboarding amid the surge.",
    "Robinhood later took the decision to suspend the trading of the stocks targeted by r/WallStreetBets, after clearing firms demanded an injection of capital to offset the surge in transactions. Users were able to sell existing holdings, but could not purchase any further shares.",
    "The decision to halt trading robbed the attack on short sellers of its momentum, causing GameStop stock to retreat more than 40%.",
    "The move sparked outrage among day traders and politicians alike, who flocked to social media to air their grievances and share theories about the involvement of institutional finance in the decision.",
    "Alternative platforms such as Interactive Brokers, Webull and TD Ameritrade took similar steps, but have so far avoided the level of ire aimed at Robinhood, which is now also the subject of a class action lawsuit. The company stands accused of attempting to “manipulate the market for the benefit of people and financial institutions who were not Robinhood customers.”",
    "Robinhood was forced to raise an emergency $1bn funding round from existing investors to stabilize operations and has since promised to restore the restricted stocks, albeit with limitations in place.",
    "Whether the war between individual and institutional investors will rage on in the coming weeks remains to be seen.",
    "What is almost guaranteed, however, is that the lack of underlying fundamentals (e.g. solid performance metrics) will mean stocks such as GameStop will return to more sensible levels. When this happens, a large number of retail investors that piled into the stock will likely incur significant losses.",
    "For this reason, anyone looking to dabble in the stock market for the first time should exercise caution. It’s also important for individuals never to invest more than they can afford to lose.",
    "The incident is likely to have long-term effects as well, having raised a number of important questions that will be difficult to put back in their box. The ease with which social media was used to manipulate markets and the power of finance platforms over their users will both demand further investigation.",
    "TechRadar Pro will update this article with any further developments."
  ],
  "headers": {
    "17": "What is r/WallStreetBets?",
    "22": "What is short selling?",
    "28": "What's all the fuss about Robinhood?",
    "35": "What happens next?"
  },
  "links": {
    "hit with a class action lawsuit": "https://www.techradar.com/news/the-king-of-rwallstreetbets-has-been-slapped-with-a-class-action-lawsuit",
    "Robinhood": "https://www.techradar.com/reviews/robinhood",
    "trading platform": "https://www.techradar.com/reviews/freetrade",
    "class action lawsuit": "https://www.courtlistener.com/recap/gov.uscourts.nysd.553175/gov.uscourts.nysd.553175.1.0.pdf"
  }
}