{
  "source": "https://www.techradar.com/news/samsung-cloud-deadline-migrate-your-files-by-end-of-day",
  "title": "Samsung Cloud deadline: Migrate your files now",
  "category": "computing",
  "updated": "2021-07-31T05:00:45Z",
  "author": "joel-khalili",
  "summary": "Samsung Cloud will no longer allow you to store photos and files",
  "article": [
    "The deadline for many Samsung customers to migrate their files away from the company's own-brand cloud storage service is fast approaching.",
    "Previously, Samsung Cloud allowed users to store a range of data off-device, freeing up local storage for apps. But the company is now cutting back the service, withdrawing the ability to store anything but lightweight items, such as contacts, calendar items and notes.",
    "The phased termination process has been divided into two streams, based on users' geographical location. Members of Group 1, which covers the UK, US, Australia and much of Europe, have until the end of the day to make use of an automated OneDrive migration tool that will do much of the heavy lifting.",
    "Originally, Samsung had set a deadline of March 31 for members of Group 1 to shift their data away from Samsung Cloud, but decided to offer users an extra three months to make the necessary arrangements. However, there is no indication the company will offer another extension.",
    "Members of Group 1 should already have received a notification prompting them to activate the automated OneDrive migration process. Doing so will not only transfer all Samsung Cloud files into OneDrive, but also expand the capacity of their account from 5GB to 20GB.",
    "However, the expanded OneDrive storage offer will expire after one year. After that, users will either have to pay to increase their cloud storage capacity or transfer their data to an external hard drive, portable SSD or another cloud backup service.",
    "If tonight's deadline is missed, Group 1 will have until September 30 to download their Samsung Cloud data to their device or computer manually and will not be able to claim additional OneDrive capacity. After this date has passed, all photos and files held in Samsung Cloud will be deleted outright and will no longer be recoverable.",
    "Samsung customers that fall into Group 2, which covers much of Asia, Africa and the Middle East, have been given a little more time to play with. These users have until September 30 to shift their date to OneDrive and until November 29 to perform a manual download."
  ],
  "headers": {
    "3": "Samsung Cloud shutdown"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "external hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "portable SSD": "https://www.techradar.com/news/best-portable-ssd",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "computer": "https://www.techradar.com/news/best-business-desktop-pcs"
  }
}