{
  "source": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
  "title": "Apple M1 Pro and M1 Max - everything we know about the new Apple chips",
  "category": "computing",
  "updated": "2021-10-19T10:23:48Z",
  "author": "jackie-thomas",
  "summary": "Apple's next generation of in-house silicon",
  "article": [
    "Apple has finally announced the new Apple M1 Pro, which we thought would be the Apple M1X, and Apple claims it's the first time anyone has created an SoC design for a pro-level laptop (otherwise known as mobile workstations).",
    "It delivers up to 32GB of unified RAM and incredibly fast memory bandwidth, which should make it extremely powerful, especially when combined with the 10-core design.",
    "These new chips should be available soon, though we're still not sure which laptops will be supported right now. Although, Apple is claiming that the Apple M1 Pro, along with the more powerful Apple M1 Max will be the most powerful chips for pro laptops. We'll have to put that to the test, but it's looking promising.",
    "We'll keep updating this article as we learn more about the two new processors, along with our expert analysis.",
    "We used to think Apple would launch just one pro-level M1 processor, called the M1X, but today Apple announced both the Apple M1 Pro and Apple M1 Max at its October hardware event.",
    "Apple has announced two new laptops with these new processors, the 14-inch and 16-inch Macbook Pro. Both of which are available to order today, and will start shipping between November 5 and November 10, according to the Apple Store.",
    "You won't be able to just buy the Apple M1 Pro or M1 Max, as they're just the chips behind the next MacBook Pro devices. However, we do know how much the new MacBook Pro devices will cost. The new 14-inch Macbook Pro will start at $1,999 (£1,899, AU$2,999) and the new 16-inch MacBook Pro will start at $2,499 (£2,399, AU$3,749).",
    "You can order both of these devices with either the M1 Pro or the M1 Max, which means both the $1,999 (£1,899, AU$2,999) 14-inch MacBook Pro and the $2,499 (£2,399, AU$3,749) 16-inch MacBook Pro will feature the M1 Pro with its 16-core GPU.",
    "If you want the M1 Max, it will cost at least $2,899 (£2,799, AU$4,349) for the 14-inch MacBook Pro, and at least $3,099 (£2,999, AU$4,649) for the 16-inch model. But that is just for the 24-core GPU version. If you want the full-fat 32-core GPU, that price is going to go up to $3,099 for the 14-inch MacBook Pro and $3,299 (£3,099, AU$4,949) for the 16-inch, making it one of the most expensive laptops around. But, we wouldn't expect anything less from Apple.",
    "The Apple M1 was such an incredible processor because it was able to do some high performance computing without consuming too much power, which meant it led to some incredible battery life, and it looks like Apple is trying to bring that same design idea to the 16-inch MacBook Pro.",
    "This time, the Apple M1 Pro is a 10-core chip, but while that's just two more cores than the original Apple M1, it's double the amount of high-performance cores. The M1 Pro has 8 high-performance cores, and 2 efficiency cores, compared to the 4 high-performance cores and 4 efficiency cores in the original chip. That means that the M1 Pro is going to be way faster than the M1, but we might start to see battery life start to take a loss, but we'd expect that with a larger chip either way.",
    "But that lower efficiency will probably be worth it for creative users, as Apple is claiming 70% better CPU performance.",
    "The GPU is also getting a huge bump. In the Apple M1 Pro, you're getting 2,048 Execution Units (EUs), which is a massive increase over the 128 EUs found in the original M1. But because Apple is putting so much focus into power efficiency, Apple found a way to put this in a GPU that apparently only peaks at around 30W, but is exponentially faster than what's found in the integrated GPUs you'd find in an Intel processor.",
    "The only thing Apple didn't release about the M1 Pro GPU is the clock speed, but we were able to do a bit of math to figure out that the GPU will likely be clocked at 1.26GHz - which is impressive for a low-power 30W GPU, especially with so many cores.",
    "On the other hand, the Apple M1 Max will have a much more powerful GPU. It will include 32 Cores, which means you get up to 4,096 EUs. However, it's a bit harder to figure out exactly what the specs would look like. We're sure it's going to be clocked much higher, because Apple's own graphs indicate that it will use up to 50W of power, but while reaching nearly the same level of performance as a top-end laptop graphic card in a MSI GE76 Raider.",
    "We're not sure exactly what GPU Apple is comparing here, but it it's the Nvidia GeForce RTX 3080 - and it might be considering that the GPU Apple is referencing apparently uses up to 180W of power - the Apple M1 Max might be the chip of choice for traveling creative professionals using Adobe Photoshop or Apple's own Final Cut Pro.",
    "There's also space for more memory than with the Apple M1, which is good - right now you can only get up to 16GB of RAM on the M1. That's fine for most casual users, but creative professionals need way more memory. Luckily the M1 Pro will support up to 32GB of unified memory, and the M1 Max will support up to 64GB. That does mean we're unlikely to see the M1 Max in the Mac Pro, but it's going to be more than enough for most professionals using apps like Final Cut and Blender to get their work done.",
    "More memory is only half of the story though - Apple has also boosted memory bandwidth, and by a lot. The Apple M1 Pro boasts up to 200GB/s of memory bandwidth, another important spec for creative users.",
    "With the M1 Max, though, Apple is using the extra real estate to add a second memory controller, which apparently doubles the memory bandwidth, making that processor able to offer up to 400GB/s of bandwidth. It seems like a minor improvement to go after, but when you're editing high-resolution video or large projects in Blender, that added memory bandwidth will help your GPU load information faster, and will drastically reduce project times.",
    "That's a lot of information, and there's sure to be more that arises, especially once benchmarks from independent testers starts to become available. Apple makes a lot of claims here, like that the MacBook Pro will be just as fast as the Razer Blade 15 advanced while consuming half the power. That's an impressive claim, to be sure, but we're going to have to wait until we get our hands on it to make any conclusive claims."
  ],
  "headers": {
    "4": "Apple M1 Pro release date",
    "6": "Apple M1 Pro price",
    "9": "Apple M1 Pro specs and performance"
  },
  "links": {
    "mobile workstations": "https://www.techradar.com/news/best-mobile-workstations",
    "16-inch Macbook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "14-inch Macbook Pro": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "MSI GE76 Raider": "https://www.techradar.com/reviews/msi-ge76-raider",
    "Adobe Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021",
    "Final Cut Pro": "https://www.techradar.com/reviews/apple-final-cut-pro-x"
  }
}