{
  "source": "https://www.techradar.com/news/these-luxurious-anc-headphones-come-with-an-airpods-max-beating-battery-life",
  "title": "These luxurious ANC headphones come with an AirPods Max-beating battery life",
  "category": "audio-visual",
  "updated": "2021-03-26T11:21:12Z",
  "author": "olivia-tambini",
  "summary": "The Bang & Olufsen Beoplay HX are here",
  "article": [
    "Bang & Olufsen has announced its latest wireless noise-cancelling headphones, the Beoplay HX – and they come with a 35-hour battery life that beats the Apple AirPods Max, despite being $50 / £100 cheaper.",
    "Utilizing the Danish company's typically luxurious design, the Beoplay HX are made from leather and a mixture of polished and brushed aluminum, giving them a stylish finish.",
    "Right now, you can only get the Beoplay HX in black, but 'sand' and 'timber' color schemes will be available \"at a later date\", according to Bang & Olufsen.",
    "The ear cushions are made from soft lambskin and memory foam that should adapt to the shape of your ear, while the headband is made from a combination of cow hide and a knitted fabric.",
    "So, while these headphones won't be suitable for those who avoid using animal products, they should be comfortable during long listening sessions.",
    "Inside the Beoplay HX are 40mm speaker drivers with neodymium magnets and bass ports to boost the lower frequencies of your music. If they sound anything like their predecessors, the Beoplay H9, you can expect a wide soundstage – though we're hoping the company has reigned in the bass, as we found it to be a little overpowering in our tests.",
    "Calls should sound clear thanks to four beamforming microphones, while their adaptive active noise cancellation technology should ensure environmental sounds don't ruin your music.",
    "If you want to tweak your music playback and ANC settings, you can use the Bang & Olufsen app to change sound profiles and toggle through ANC presets.",
    "A 35-hour battery life should easily get you through a week's worth of listening, which beats the AirPods Max by 15 hours.",
    "As we mentioned, the new Bang & Olufsen cans are cheaper than Apple's over-ear headphones, coming in at $499 / £449 (about AU$650) – and unlike the AirPods Max, they come with a 3.5mm audio port for wired listening, as well as Bluetooth 5.1 and multipoint pairing.",
    "Of course, that's not cheap by any standard, and the best headphones of 2021, the Sony WH-1000XM4, are far more budget-friendly at $349.99 / £349 / AU$549. Still, if you crave that luxurious design and you want your headphones to last all week, the Beoplay HX could be an excellent purchase."
  ],
  "headers": {
    "5": "Luxury comes at a price"
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Apple AirPods Max": "https://www.techradar.com/news/how-the-first-sonos-headphones-could-beat-the-apple-airpods-max/reviews/airpods-max",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones"
  }
}