{
  "source": "https://www.techradar.com/news/hurry-this-dell-g15-with-an-rtx-3050-ti-for-just-dollar73499-is-almost-sold-out",
  "title": "Hurry - this Dell G15 with an RTX 3050 Ti for just $734.99 is almost sold out",
  "category": "computing",
  "updated": "2021-09-03T16:00:34Z",
  "author": "alex-whitelock",
  "summary": "This is one powerful machine indeed for the money",
  "article": [
    "We've just spotted what's easily one of the best gaming laptop deals we've seen for a while courtesy of the Dell Labor Day sale - this 15.6-inch G15 for $734.99 (was $1,179.99).",
    "Yes, that's a whopping $400+ saving on a machine with an RTX 3050 Ti graphics card, 8GB of RAM, a 256GB SSD, and an Intel Core i5-10500H processor - very respectable specs indeed for 1080p gaming. You may have to hurry to snag this one, however, as according to Dell itself 99% of stock has already sold out...",
    "At least, that's what they say. Is that really the case? It's hard to say, sometimes these sales do stick around for a suspiciously long time. If you're interested, we wouldn't risk it, however - this is one of the better gaming laptop deals we've seen for a while at this sub $800 price bracket and the best one so far in this year's Labor Day sales.",
    "The combination of an RTX 3050 Ti and Intel Core i5-10500H is particularly potent here as it'll gain you access to those coveted DLSS and Ray-tracing settings in-game. Some may turn their nose up at a 10th gen Intel Core i5 in 2021, but this 500 variant is a fairly new addition to the Intel roster and one that's almost as powerful as some recent Core i7's. In short, you'll get really good bang for the buck here if you're looking for performance on a budget.",
    "Outside the US? See the best gaming laptop deals in your region just below.",
    "We're tracking all of this week's best gaming laptop deals right here at TechRadar. If you'd like to see what else is available as part of this sales event, head on over to our Labor Day laptop sales roundup."
  ],
  "headers": {
    "5": "Gaming laptop deals at Dell"
  },
  "links": {
    "for $734.99 (was $1,179.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8375714788661933000/https://deals.dell.com/en-us/member/productdetail/adct",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020",
    "best gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "Labor Day laptop sales": "https://www.techradar.com/news/the-10-best-labor-day-laptop-sales-2020"
  }
}