{
  "source": "https://www.techradar.com/news/oppo-find-x3-prices-and-colors-leaked-for-the-whole-range",
  "title": "Oppo Find X3 prices and colors leaked for the whole range",
  "category": "phones",
  "updated": "2021-02-25T09:53:34Z",
  "author": "james-rogerson",
  "summary": "Plus RAM and storage",
  "article": [
    "We’re expecting three Oppo Find X3 models to be announced soon – possibly on March 11 – and it looks like the top model could cost over twice as much as the bottom model.",
    "That’s according to 91Mobiles and leaker Sudhanshu Ambhore, who leaked approximate prices for the Oppo Find X3 Lite, the Oppo Find X3 Neo, and the Oppo Find X3 Pro.",
    "Starting with the Oppo Find X3 Pro, that'll apparently cost between €1,000 - €1,200. If you split the difference, that converts to roughly $1,345 / £950 / AU$1,680. That’s for a model with 12GB of RAM and 256GB of storage, though it’s not clear at this stage whether other versions will be available. The leak also states that the Find X3 Pro will come in blue, white, orange and black shades.",
    "Next up there’s the Oppo Find X3 Neo, which is said to cost between €700 - €800. Taking the middle value again that’s around $915 / £645 / AU$1,145, and that’s again for a model with 12GB of RAM and 256GB of storage, but this one apparently just comes in silver or black.",
    "Then we have the Oppo Find X3 Lite, which this source claims costs €400 - €500 (roughly $550 / £390 / AU$685). That’s with 8GB of RAM and 128GB of storage, and this model will apparently be available in black and blue shades.",
    "We would of course take these prices with a pinch of salt. Beyond being leaks rather than official, they also cover a range, and we’ve then converted them into other currencies, which rarely gives a totally accurate price. That said, this sounds like a believable ballpark.",
    "All of these phones also apparently support 5G, as you’d expect, and the source additionally detailed two other upcoming Oppo phones – the Oppo A94 and the Oppo A54.",
    "These are both listed as 5G too, with the Oppo A94 apparently costing €300 - €400 (approximately $430 / £300 / AU$535) and coming in black or blue, while the Oppo A54 is said to cost €200 - €300 (around $305 / £215 / AU$380) and come in black or purple.",
    "Again, we’d take these prices with a pinch of salt, and it’s less clear when these two models will launch, but the Oppo Find X3 range at least is probably landing very soon, and we’ll bring you all the official prices and details as soon as it does.",
    "Via GizChina"
  ],
  "headers": {
    "6": "From X to A"
  },
  "links": {
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "possibly on March 11": "https://www.techradar.com/news/oppo-find-x3-release-date-leaked-and-its-very-soon",
    "91Mobiles": "https://www.91mobiles.com/hub/oppo-find-x3-pro-neo-lite-a94-a54-prices-leak-exclusive/",
    "GizChina": "https://www.gizchina.com/2021/02/24/oppo-find-x3-trio-pricing-tipped-ahead-of-the-official-launch/"
  }
}