{
  "source": "https://www.techradar.com/news/battlefield-6-reveal-date-set-but-what-will-we-see",
  "title": "Battlefield 6 reveal date set – but what will we see?",
  "category": "gaming",
  "updated": "2021-06-11T16:57:14Z",
  "author": "samuel-tolbert",
  "summary": "Get ready",
  "article": [
    "Battlefield 6 (now confirmed to be Battlefield 2042) is being revealed. After a long period of teasing, with the Battlefield community going over leaked screenshots and even leaked footage from an internally-used trailer, the official Battlefield Twitter account has confirmed that the game is being revealed on June 9 at 3pm BST / 7am PT / 10am ET (or June 10 at 12am AEST).",
    "It is important to note that, technically, the game isn't officially called Battlefield 6. In fact, from the logo and leaks we've had so far, it's quite possible it's simply called Battlefield.",
    "Whatever the official title, the game is a near-future setting, abandoning World War 1 and World War 2 as seen in the prior games, Battlefield 1 and Battlefield 5. It seems safe to expect a release date during this reveal event, though anything remains possible in a year that has seen so many games delayed. In addition to the main team at DICE in Sweden, this Battlefield has been developed with the support of Criterion, DICE LA, EA Gotheburg and Industrial Toys.",
    "The game will be coming to Xbox Series X, Xbox Series S, Xbox One, PC, PS5 and PS4, with a release window of sometime in the second half of 2021.",
    "Following this incoming reveal, publisher Electronic Arts is holding EA Play Live 2021 on July 22. It's quite likely that we'll see more of this Battlefield game then, perhaps a more in-depth look at classes or even alternate gameplay modes. In the unlikely event we don't get a release date during the June reveal event, this would also be the place for EA and DICE to confirm just when players will get their hands on the game.",
    "While EA is not officially taking part in E3 2021, these events are all coinciding around the same seasonal summer showcases."
  ],
  "headers": {
    "4": "More to come in July"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "leaked screenshots": "https://www.techradar.com/news/battlefield-6-trailer-might-have-been-revealed-using-leaked-screenshots",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "EA Play Live 2021": "https://www.techradar.com/news/ea-play-2021-confirmed-for-july-following-rumored-battlefield-june-reveal",
    "E3 2021": "https://www.techradar.com/news/e3-2021"
  }
}