{
  "source": "https://www.techradar.com/news/the-google-pixel-fold-could-be-real-and-coming-this-year",
  "title": "The Google Pixel ‘Fold’ could be real, and coming this year",
  "category": "phones",
  "updated": "2021-02-26T05:54:53Z",
  "author": "david-lumb",
  "summary": "A leaked report suggests the Pixel Fold could come by the end of 2021",
  "article": [
    "The Google Pixel ‘Fold’ may indeed be real after all, if a leaker’s tweet is to be believed.",
    "Noted leaker Jon Prosser didn’t include much information in his tweet – just that the Google Pixel Fold exists, and that it’s coming either late this year or early in 2022, per a follow-up message.",
    "In a reply to that tweet, DSCC founder and display analyst Ross Young concurred – and noted that he’d first tweeted this information in December 2020 in a foldables forecast, noting that the second half of 2021 would see “at least 3 models from Samsung, 4 models from Oppo, Vivo and Xiaomi and 1 model from Google.”",
    "While that doesn’t add any more information about the Pixel Fold – like, for starters, if that is what it will be called – at least it’s more corroboration that Google, which had released a lower-spec flagship phone at the end of 2020 with the Pixel 5, is working on a decidedly higher-tier device in a foldable.",
    "We first heard Google was working on a foldable phone in March 2019, when patents for potential designs were discovered. They described a possible clamshell foldable like the Motorola Razr 2020 and Samsung Galaxy Z Flip, and another that had three folding panels with three screens.",
    "The rumors thereafter have been few and far between, though a recent report alleged that Google is joining Xiaomi and Oppo in ordering displays from Samsung for its potential foldable device. Reportedly, Google is ordering 7.6-inch displays."
  ],
  "headers": {
    "4": "Google Pixel Fold: what we know"
  },
  "links": {
    "message": "https://twitter.com/jon_prosser/status/1365060898554077194",
    "tweeted": "https://twitter.com/DSCCRoss/status/1337038203279339520",
    "foldable": "https://www.techradar.com/news/google-could-be-working-on-a-foldable-phone-too",
    "report": "https://www.techradar.com/news/google-pixel-foldable-phone-may-come-in-2021-but-dont-expect-it-to-replace-pixel-6"
  }
}