{
  "source": "https://www.techradar.com/news/one-of-whatsapps-best-features-is-getting-a-big-upgrade",
  "title": "One of WhatsApp's best features is getting a big upgrade",
  "category": "phones",
  "updated": "2021-04-27T11:52:56Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Send messages that vanish after a week or 24 hours",
  "article": [
    "WhatsApp's disappearing messages option will soon let you choose whether messages are deleted after a week or just 24 hours.",
    "In the latest beta versions of WhatsApp for Android and iOS, there are signs of an updated self-destructing message feature that will eventually make its way to all users when testing is over.",
    "It's already possible to send messages that are deleted after a week, and earlier this week, references to a 24-hour option were also spotted by the sleuths at WABetaInfo.",
    "Initially, it was thought that the option to have messages vanish after a day would replace the option to have them stick around for a week, but now it seems that you'll be given a choice between the two.",
    "While the option is currently visible in the iOS and Android beta apps, the same feature should also be available in the desktop and web version of WhatsApp. As these are likely to be enabled using a server-side update, there is no sign of this right now, however.",
    "It doesn't look like WhatsApp will allow you to choose a custom time window for your messages to remain live, which may come as a disappointment, but the added flexibility of a 24-hour option gives a welcome extra level of security.",
    "For the moment, the new feature can only be seen in the latest WhatsApp beta, but even then it's not functioning for testers to try out properly. It's impossible to say when the new option will be available worldwide, but WhatsApp will be making sure that all of the kinks are ironed out before it gets a wider rollout.",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "See it while you can"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-beta-for-android-2-21-9-6-whats-new/"
  }
}