{
  "source": "https://www.techradar.com/news/nintendo-teams-up-with-microsoft-to-create-a-new-nintendo-switch-service",
  "title": "Nintendo and Microsoft team up to solve Switch users' woes",
  "category": "gaming",
  "updated": "2021-02-11T12:45:40Z",
  "author": "adam-vjestica",
  "summary": "Nintendo will see you now",
  "article": [
    "Nintendo and Microsoft have teamed up to create a new Nintendo Switch service, but it’s not what you might expect.",
    "The Nintendo Switch Concierge service, as it’s called, is a free program that lets Switch users schedule one-on-one meetings with a Nintendo representative. It’s designed to help customers who have recently purchased the company’s system with any pressing questions they might have, like how to set up their console. Some of the topics include ‘Nintendo Switch 101’ and ‘Games (Getting Started)’.",
    "Customers can schedule a session via the Nintendo Switch Concierge website, and video calls are facilitated via Microsoft Teams. Of course, you’ll need to narrow down what you want to discuss (you won’t be able to beg Nintendo for Switch ports here), and arrange a suitable time.",
    "Your appointment will then be put into a chart, which you can see on the Nintendo Switch Concierge website, and attendees will receive an email with more details at a later date. It appears that the service is only available in the US, for now.",
    "There are some things to note: session availability is limited to a first come, first served basis, and only those who have recently purchased a Nintendo Switch are eligible. By participating, you also agree that Nintendo “may collect video images of you, your voice and your surroundings in order to interact with you with the requested service”, which may worry those who value their privacy.",
    "Nintendo and Microsoft have grown rather friendly in recent years, with Minecraft one of the first games to support cross-play between Xbox One and Nintendo Switch players, and the previously Xbox exclusive Ori and the Blind Forest and Ori and the Will of the Wisps made their way to Nintendo’s platform. Microsoft owned characters like Banjo Kazooie have also been included in Nintendo's Super Smash Bros. Ultimate.",
    "While this collaboration isn’t quite as exciting for gamers, it shows how important Microsoft’s suite of technology can be outside of Xbox. Microsoft’s Azure servers, which power XCloud and the company’s other online services, were adopted by Sony. The two companies announced a “strategic partnership” in May 2019, which involves PlayStation using Microsoft Azure data centers for cloud gaming and content streaming services."
  ],
  "headers": {
    "5": "Fusion frenzy"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch Concierge": "https://www.nintendo.com/nintendo-switch-concierge/",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Nintendo for Switch ports": "https://www.techradar.com/best/best-retro-games-and-ports-on-nintendo-switch",
    "cross-play": "https://www.techradar.com/news/10-cross-play-games-to-play-across-ps4-xbox-one-pc-and-nintendo-switch",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review",
    "cloud gaming": "https://www.techradar.com/news/choosing-the-right-cloud-gaming-service-for-you"
  }
}