{
  "source": "https://www.techradar.com/news/apple-says-no-you-cant-swap-the-default-music-player-in-ios-145-after-all",
  "title": "iOS 14.5 update won't let you change your iPhone's default music player after all",
  "category": "phones",
  "updated": "2021-03-05T09:09:28Z",
  "author": "harry-domanski",
  "summary": "But Siri can learn your listening habits instead",
  "article": [
    "Almost a month ago, we reported that the upcoming iOS 14.5 update would let iPhone users change their default music app, permanently picking an alternative to Apple Music, but the tech giant has now confirmed that won't be the case.",
    "Users trialing the beta version of the new operating system noticed that Siri would ask you which service you'd like to use when asking the assistant to play music. Speaking with TechCrunch, Apple has clarified that it doesn't consider this to be 'setting a default'.",
    "Apple's iOS 14 brought about the ability to change your default web browser and email apps, so that any new links will be opened in your browser of choice, and likewise when composing new emails, but the same isn't true for music playing apps.",
    "There isn't any option in the 'settings' menu that would allow you to select your default music player of choice, like there is with email and web browsers. The feature is more to do with Siri and its learning behaviors.",
    "When asking the virtual assistant to play you a song, it will provide you with a list of installed apps to choose from and will learn from your choice. The same is true if you ask for a podcast or audiobook – Siri will ideally learn which apps you use for each purpose and integrate them more readily when you make requests of the assistant.",
    "With that said, choosing your preference once won't be enough to change Siri's habits forever. Apple notes that the assistant may ask you the same question at some point in the future.",
    "As per usual, users can still specify the app of their choice in the initial voice command – \"Play Brian Eno on Spotify\", for instance – but there’s currently no sign that we’re getting a true default option.",
    "While the nuances of this feature may seem trivial, they represent a broader aversion to competing third-party companies that Apple holds.",
    "Historically, Spotify and Apple have been duking it out over whether the Cupertino firm's exclusive behavior is, in fact, anti-competitive. Users signing up to Spotify via the App Store are inadvertently sending a portion of that subscription to Apple due to the tax the tech giant collects on services on its marketplace.",
    "Spotify has claimed that this is an unfair use of the company's dominance in the tech field, considering the number of iPhone users that will opt to use the App Store for this.",
    "With this in mind, it's likely that Apple's hesitance in allowing true 'default' settings for services that compete with Apple Music is at least somewhat to do with this ongoing feud."
  ],
  "headers": {
    "7": "Major/minor"
  },
  "links": {
    "iOS 14.5 update would let iPhone users change their default music app": "https://www.techradar.com/news/ios-145-lets-you-ditch-apple-music-on-your-iphone-and-default-to-spotify",
    "TechCrunch": "https://techcrunch.com/2021/03/04/apple-clarifies-you-cant-actually-set-a-default-music-service-in-ios-14-5/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Techcrunch+%28TechCrunch%29&guccounter=1",
    "iOS 14 brought about the ability to change your default web browser and email apps": "https://www.techradar.com/news/ios-14-will-finally-allow-users-to-change-their-default-email-and-web-browser-apps"
  }
}