{
  "source": "https://www.techradar.com/news/battlefield-6-trailer-leak-shows-modern-setting-androbots",
  "title": "Battlefield 6 trailer leak shows modern setting and... robots?",
  "category": "gaming",
  "updated": "2021-06-11T16:57:50Z",
  "author": "rhys-wood",
  "summary": "Modern warfare looks set to return to Battlefield 6",
  "article": [
    "The official Battlefield 6 (now confirmed to be Battlefield 2042) reveal trailer is due to be released sometime soon, but fans may have gotten themselves a sneak peek after some screenshots surfaced on the Discord server of Tom Henderson, a prominent Battlefield and Call of Duty leaker.",
    "Reported by VideoCardz, the screenshots aren’t attributed to Henderson, rather a member of his Discord community named “hi93048234.” The screenshots shown look suspiciously blurry – ostensibly due to them being reconstructed by a machine learning algorithm – the sourced images feature black bars covering up substantial portions.",
    "The screenshots allude to a modern setting for Battlefield 6, featuring rockets as well as a high-tech cockpit and a Boston Dynamics-esque walking robot. If the screenshots are accurate, this would certainly represent a grand departure from Battlefield 1 and Battlefield 5, both of which featured World War settings.",
    "We’ve heard rumors that Battlefield 6 will return to a modern setting for a while, and these leaked screenshots certainly fall in line with that. This near-future aesthetic shown in the images shifts Battlefield’s tone to something akin to Call of Duty’s Advanced Warfare setting, or potentially even that of Black Ops 2’s futuristic trappings.",
    "We also know that Battlefield 6 will release on PS5, Xbox Series X/S and PC, as well as last generation consoles on PS4 and Xbox One.",
    "DICE’s Oskar Gabrielson has been one of the few official sources of Battlefield 6 news, stating in a blog post on EA’s website: \"We’re in daily playtesting mode right now: polishing, balancing, and making the best possible Battlefield game we can. I can tell you it is a bold step. It has everything we love about Battlefield – and takes all of it to the next level. Epic scale. All-out military warfare.\"",
    "While few official Battlefield 6 details have been revealed by EA and DICE, the full reveal is expected to take place in June, which might coincide with E3. The gaming expo is set to return in a digital format between June 12 and June 15."
  ],
  "headers": {
    "3": "Modern warfare?"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "VideoCardz": "https://videocardz.com/newz/leaked-screenshots-from-battlefield-6-reveal-trailer-reveal-exploding-rockets-and-robots",
    "Boston Dynamics": "https://www.techradar.com/news/boston-dynamics-robot-has-learned-how-to-open-doors",
    "Battlefield 1": "https://www.techradar.com/news/battlefield-1-review",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "EA’s website": "https://www.ea.com/en-gb/games/battlefield/news/battlefield-franchise-update-oskar-gabrielson",
    "E3": "https://www.techradar.com/news/e3-2021"
  }
}