{
  "source": "https://www.techradar.com/news/xiaomi-mi-note-11",
  "title": "Xiaomi Mi Note 11 release date, price, news and leaks",
  "category": "phones",
  "updated": "2021-07-12T09:40:30Z",
  "author": "tom-bedford",
  "summary": "It may Note be coming...",
  "article": [
    "Is the Xiaomi Mi Note 11 ever going to be released? After the Mi Note 10 launched in late 2019, it quickly became ranked high on our list of the best smartphones, but a year and a half has passed and we've got no word on a follow-up.",
    "The Mi Note 10 was a fantastic mid-range phone and, for the Note 11, Xiaomi could have added features from its subsequent phones like the Mi 10, Mi 10T, Poco F2 Pro and more. But given it didn't come out when we expected, does that mean it's been cancelled?",
    "Well no, not necessarily. The Redmi Note 8T came out with the Mi Note 10 but its successor, the Note 9T, saw a January 2021 release, so it's possible the Mi Note 11 was delayed too. The Xiaomi Mi 11 was launched way earlier than we expected, in December 2020, so it's likely the company's release line-up is going through some changes.",
    "Saying that, the further time marches on, the lower our chances of seeing the Mi Note 11 become.",
    "We'd like to see a Xiaomi Mi Note 11, because as we said the Mi Note 10 is one of the best phones you can buy right now, with a fantastic array of cameras, premium-feeling body and screen and, most importantly, a surprisingly low price.",
    "We haven't heard many leaks about the Xiaomi Mi Note 11 yet - there are a few rumors and leaks that weren't attributed to any particular phone, which we'll list below - but while we wait for more rumors, we've come up with a wish list of what we want to see in the Mi Note 11.",
    "The Xiaomi Mi Note 10 was launched in November 2019 - November 2020 came and went without a Mi Note 11. There's no indication of when it'll come out, or even if it will at all.",
    "Regarding price, the Mi Note 10 cost £459 / AU$888 (about $590) for its most affordable variant, so it's possible the Mi Note 11 will cost that much or perhaps a small amount more.",
    "Saying that, the Xiaomi Mi 10 was quite a bit pricier than the Mi 9. It's possible the company will replicate this leap in the Mi Note line, but we'd hope not as the low price was the Mi Note 10's real strength.",
    "We've heard one big rumor about the Xiaomi Mi CC11, which will probably come out as the Mi Note 11 outside China. Apparently it will have a 90Hz screen, 64MP main camera, 67W charging and Snapdragon 778 or 780 chipset.",
    "In addition, there's said to be a Pro model, with the Snapdragon 870 chipset and a 5x zoom periscope sensor.",
    "Other than that we haven't heard a single rumor or leak surrounding the Xiaomi Mi Note 11 right now. However we have heard about various new Xiaomi tech that wasn't attached to a named smartphone, so it could debut in the Mi Note 11 - this is just speculation, though.",
    "For example, Xiaomi has patented an under-display camera for the front-facing snapper, tech that would allow a phone to have an all-screen front without any moving parts or novelty gimmicks to ensure there was still a front-facing camera. Gimmicks like, for example, this other Xiaomi patent which shows a phone which twists in half to take selfies.",
    "We'd expect a mid-range chipset in the Xiaomi Mi Note 11, and the company is said to be working on a smartphone with a Dimensity 1000 Plus processor from MediaTek. This would make the phone 5G-compatible, and would also allow for a 144Hz refresh rate display. Saying that, Xiaomi has also seemingly considered using Samsung's Exynos chipsets in its phones too.",
    "In terms of camera capabilities, it seems Xiaomi is working on a phone with a 108MP camera and a whopping 120x digital zoom, presumably through a separate telephoto lens, which would blow all competitors out of the water in terms of numbers.",
    "We've heard Xiaomi is working on a new cheap phone with 108MP main sensor, which could be a Redmi phone (maybe the Redmi Note 10) but also could be the Mi Note 11.",
    "Since this super-powerful camera phone is said to be a Mi CC phone, it could be the Mi Note 11 too (as the Mi Note 10 was known as the Mi CC 9 Pro in China).",
    "Finally, we've heard Xiaomi is working on a 120W charger which would power up a phone to full in minutes. The Xiaomi Mi Note 11 might not be the phone this debuts in, since this phone is set to be a mid-ranger and that's a decidedly premium feature, but the Mi Note 10 was the first Xiaomi phone with a 108MP camera so it's possible.",
    "These are all the features and specs we want the Xiaomi Mi Note 11 to come with.",
    "The Xiaomi Mi Note 10 had five rear cameras, but only three were really impressive or useful. One in the bad pile was the 8MP telephoto snapper. In theory it was useful, with 5x optical zoom, but because of the low-res sensor, pictures looked a little fuzzy, and you could get better pictures by taking 108MP snaps and cropping down manually.",
    "We'd like to see the Mi Note 11 pack a better sensor with its telephoto or periscope lens for zoomed shots, so there was a reason to close the distance with the camera.",
    "Xiaomi Mi phones typically have fine battery lives, but we're rarely as impressed by how long they last as we are handsets from another Xiaomi brand, Redmi. Mi phones will last a day, fine, but you'll be hard pressed to get them to run for a second day - or even one full day if you're pushing the camera to its limits.",
    "We'd like the Xiaomi Mi Note 11 to last longer without needing a charge, either with a better battery or - possibly a better option - with some software optimizations that means it drains power slower.",
    "The Xiaomi Mi Note 10 didn't have a top-end processor - instead, it used a mid-range Snapdragon 730. This was a decision we initially found rather curious, but after using the phone we didn't notice the lack of processing power too much.",
    "The Mi Note 11 needs an improved processor though in one key regard - the 730 had quite a bit of trouble taking and processing 108MP pictures, and if the newer phone is set to keep or improve on this snapper, it needs to handle pictures better.",
    "Qualcomm (which makes Snapdragon chipsets) has since launched the 765G, which is a great processor for gaming and long battery life, and is also 5G-enabled, so that would be an obvious choice, but there are others which would work too.",
    "The Xiaomi Mi Note 10 had impressive specs, but it also had one thing handsets with similar features didn't have - a low price.",
    "Xiaomi is known for putting out affordable phones, and the Mi Note 10 certainly was one, but the Mi 10 series that launched afterwards arguably wasn't, as the Xiaomi Mi 10 Pro cost twice what the Mi Note 10 did. Evidently Xiaomi realized it could put out pricey phones as well.",
    "We'd like to see the Mi Note 11 stay affordable though, not have an inflated price like the Mi 10, as that would keep it hugely competitive against plenty of rivals and give more people the chance to check out what's likely to be an impressive phone.",
    "Xiaomi phones typically have fast charging speeds, some of the best available perhaps, but each year the top available charging tech gets quicker and quicker. We'd like to see the Xiaomi Mi Note 11 stay ahead of the curve.",
    "While the Mi Note 10 had 30W charging, which is faster than lots of the competition already, possibly Xiaomi could bump the Note 11 up to 50W or even 65W to really trump its rivals. Xiaomi has shown off 100W fast charging tech before, so it's not that unreasonable either."
  ],
  "headers": {
    "6": "Xiaomi Mi Note 11 release date and price",
    "9": "Xiaomi Mi Note 11 leaks and rumors",
    "18": "Xiaomi Mi Note 11: what we want to see",
    "19": "1. An improved 'main' telephoto camera",
    "21": "2. A longer-lasting battery",
    "23": "3. An improved chipset",
    "26": "4. A low price",
    "29": "5. Faster charging capabilities"
  },
  "links": {
    "Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Mi 10T": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review",
    "Poco F2 Pro": "https://www.techradar.com/reviews/xiaomi-poco-f2-pro-review",
    "Redmi Note 8T": "https://www.techradar.com/reviews/xiaomi-redmi-note-8t-review",
    "Note 9T": "https://www.techradar.com/reviews/xiaomi-redmi-note-9t-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "one big rumor about the Xiaomi Mi CC11": "https://www.techradar.com/news/xiaomi-mi-note-11-a-long-awaited-android-phone-might-finally-be-coming",
    "patented an under-display camera": "https://www.techradar.com/news/xiaomi-patents-an-under-display-camera-smartphone",
    "other Xiaomi patent": "https://www.techradar.com/news/xiaomi-just-patented-a-phone-with-a-very-weird-way-to-avoid-a-notch",
    "smartphone with a Dimensity 1000 Plus processor": "https://www.techradar.com/news/xiaomi-is-working-on-a-dimensity-1000-smartphone",
    "considered using Samsung's Exynos chipsets": "https://www.techradar.com/news/a-new-xiaomi-mi-10-variant-with-the-exynos-990-might-be-coming",
    "Xiaomi is working on a phone with a 108MP camera and a whopping 120x digital zoom": "https://www.techradar.com/news/future-xiaomi-phones-zoom-range-might-dwarf-the-samsung-galaxy-s20-ultras",
    "Xiaomi is working on a new cheap phone with 108MP main sensor": "https://www.techradar.com/news/the-next-cheap-xiaomi-phone-might-have-a-whopping-108mp-main-camera",
    "Xiaomi is working on a 120W charger": "https://www.techradar.com/news/xiaomi-might-be-working-on-a-charger-thats-nearly-7x-faster-than-the-iphone-11s"
  }
}