{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-range-could-have-the-biggest-camera-upgrades-in-years",
  "title": "Samsung Galaxy S22 range could have the biggest camera upgrades in years",
  "category": "phones",
  "updated": "2021-06-24T08:39:28Z",
  "author": "james-rogerson",
  "summary": "More megapixels on main, fewer for telephoto",
  "article": [
    "The Samsung Galaxy S20 and Samsung Galaxy S21 had the same assortment of cameras, but there could be big changes coming for the Samsung Galaxy S22’s camera configuration, according to the latest leak.",
    "@FrontTron (a leaker with a reasonable track record) has claimed that the Samsung Galaxy S22 and Samsung Galaxy S22 Plus may have a 50MP main camera, a 12MP ultra-wide, and a 12MP telephoto (offering 3x zoom).",
    "For comparison, the Galaxy S21, S21 Plus, S20 and S20 Plus all have a 12MP main snapper, a 12MP ultra-wide, and a 64MP telephoto (offering 3x hybrid optical zoom). So if this leak is right then both the main and telephoto cameras are changing for the new phones. It’s possible that the ultra-wide is as well, but the number of megapixels seemingly isn’t.",
    "There are no additional details on these cameras, but Samsung unveiled a new 50MP smartphone camera sensor earlier this year, so it’s possible that will be used. It's a large sensor, with fairly large pixels, and should be capable of performing well in low light.",
    "We would however take this leak with a pinch of salt, as it’s very early for Samsung Galaxy S22 rumors, with the phone likely not landing until early 2022, and even the source says to take it with some salt.",
    "There’s also no news on the Samsung Galaxy S22 Ultra’s cameras here, but we’ve previously heard that this might get some major upgrades too, with leaks suggesting it could have a 200MP sensor and continuous optical zoom.",
    "Whether these leaks pan out or not, we’re sure the Samsung Galaxy S22 range will have some excellent photography options, as Samsung’s flagships almost always do. And given how many of the company’s phones have now had the same camera setup we’d think big changes are likely.",
    "Via PocketNow"
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "@FrontTron": "https://twitter.com/FrontTron/status/1407562839502442498",
    "S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "unveiled a new 50MP smartphone camera sensor": "https://www.techradar.com/news/samsung-unveils-isocell-gn2-a-new-50mp-sensor-for-high-end-smartphones",
    "a 200MP sensor": "https://www.techradar.com/news/galaxy-s22-ultra-could-have-samsungs-best-camera-yet",
    "continuous optical zoom": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-may-have-a-major-zoom-upgrade-and-an-in-screen-camera",
    "PocketNow": "https://pocketnow.com/samsung-galaxy-s22-and-s22-could-feature-a-major-camera-upgrade?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+pocketnow+%28pocketnow.com%29"
  }
}