{
  "source": "https://www.techradar.com/news/streaming-will-revolutionize-mobile-gaming-in-2021",
  "title": "Streaming will revolutionize mobile gaming in 2021",
  "category": "phones",
  "updated": "2021-01-03T06:00:15Z",
  "author": "david-lumb",
  "summary": "Stadia and xCloud and GeForce, oh my",
  "article": [
    "Every year seems to be the year of Mobile Gaming, when some hot new game or phone tech will usher in a new era legitimizing playing games on smartphones. And yet, the biggest innovation of the year that could forever change Mobile Gaming is...an innovation for regular gaming: game streaming services.",
    "The promise of streaming is simple: instead of playing locally, your game runs on a machine some distance away with footage streamed to you in real-time (with control inputs relayed back and forth). The device you stream it to doesn’t need to be powerful - heck, it doesn’t need much more than a display – and hence, it’s perfect for mobile streaming.",
    "At E3 2019, we got hands-on time with Microsoft xCloud, streaming Xbox games directly to a smartphone. It was impressive – we were able to play Halo 5, Sea of Thieves, and Gears 5 with an Xbox One controller clipped to a phone running the game – but didn’t have a release date or details about how players would access it. In late 2020, we learned it would simply be folded into Xbox Game Pass as part of the Ultimate subscription tier... and just like that, xCloud was just a small upgrade away from the 15 million Game Pass subscribers.",
    "Microsoft pledged over 150 Xbox One games would be playable on xCloud at launch (it came out in the US in beta on September 15 and is slowly rolling out to more countries), with more coming when EA Play is fully integrated in 2021, and Xbox Series X titles will be added, too – all playable on smartphones.",
    "Google Stadia has let subscribers stream games on mobile for awhile now – on Android since it launched on WiFi then on the go since July 2020, and recently on iOS through a slight workaround (more on that later). Amazon Luna was announced and quietly launched this year in a closed beta, while Nvidia GeForce Now had a surprise launch late in the year.",
    "Which is all to say that 2020 laid a lot of groundwork for streaming games on mobile, which has serious potential to change how we play games on phones in 2021. There’s just a few things to clear up first...and the issues are less about tech than business.",
    "Streaming games on mobile isn’t just feasible, it’s got its advantages, as we saw when we played Cyberpunk 2077 on Google Stadia. But there are a few obstacles that make the experience inconvenient or even impossible.",
    "The obvious roadblock is connectivity: Stadia recommends a reliable connection of 10Mbps down for basic playability and resolution, while you’ll need 35Mbps to play in 4K HDR. That might be doable for folks in cities, but not in farther-flung areas. The onset of 5G has big potential for streaming games to mobile, with sub-6 speeds reaching 200Mbps to 300Mbps down on carriers (up to over 1Gbps with mmWave), but 5G network coverage is far from widespread.",
    "There’s also the question of data. Carriers have not adapted their pricing models much to a new era of streaming massive volumes of data, aside from implementing caps in their unlimited plans after users pass a download threshold, which are pretty low considering casual streamers are using 3-4GB a month, while Netflix and HD video addicts are consuming 6-8GB. We only expect this to grow as folks stream games.",
    "There’s the mobile playing experience, too. Streaming games to your smartphone isn’t always the best way to play – plenty of games are less fun when shrunk down to a small screen, especially text-heavy genres like RPGs that require a lot of reading. In that sense, games designed explicitly for mobile will likely be more enjoyable to play over those that run unaltered on phones, at least until streaming services encourage developers to tweak their games for a better mobile experience.",
    "And then there’s Apple.",
    "In August 2020, Apple clarified that, yes, it would only allow streaming services on its devices if they abided by App Store guidelines – i.e., if they submitted each game in their service’s catalog for individual review. Microsoft and Google seemingly balked at this restriction, and understandably so, as it would likely require them to seriously rework how their services and games catalogs work.",
    "In response, streaming services planned workarounds: Google Stadia announced it would run streaming through a web app, the same tactic that Nvidia’s GeForce Now used when it launched in beta and Amazon Luna stated it would deploy while it slowly expands its closed beta. Microsoft is allegedly planning to do the same as a way to get on iPhones and iPads in 2021.",
    "Playing through a web app is cumbersome, yet doable. It would obviously be a lot easier if these services ran through discrete apps, with clean, bespoke interfaces instead of awkward browser errata like search bars and navigation buttons.",
    "It’s entirely possible that Apple reaches agreements with each individual service provider by cutting deals, as it’s done with Amazon to allow in-app purchases through its shopping and Prime Video apps (including reportedly bending App Store rules to give Apple a lower cut, per Verge).",
    "But Apple could get externally pressured into granting streaming gaming on its platforms – the company finally lowered its 30% cut for in-app purchases down to 15% for apps that don’t pull in lots of cash every year. But that very belated shift in App Store policy seems to have happened as a result of Apple’s ongoing legal clash with Epic Games; the suits filed by the latter suggest that Epic wants to get its own store on Apple devices.",
    "Either way, Apple needs to change its App Store policies to open the doors to streaming gaming services that are already gearing up for a big year in 2021. While streaming through web apps is better than being blocked from the platform, lacking a native app experience holds everyone back – and gives mobile gamers another reason to go with Android."
  ],
  "headers": {
    "6": "But are there tech issues?",
    "11": "Streaming games to mobile: overcoming Apple’s hurdles"
  },
  "links": {
    "Microsoft xCloud": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "folded": "https://www.techradar.com/news/project-xcloud-has-a-release-date-and-itll-be-free-with-xbox-game-pass-ultimate",
    "subscribers": "https://www.techradar.com/news/xbox-series-x-launch-gets-even-bigger-with-arrival-of-ea-play-on-game-pass-ultimate",
    "games": "https://www.techradar.com/news/xbox-game-pass-ultimate-cloud-gaming-will-launch-with-these-150-games",
    "2021": "https://www.techradar.com/news/ea-play-on-xbox-game-pass-for-pc-is-delayed-to-2021",
    "since": "https://www.techradar.com/news/google-stadia-breaks-free-of-wifi-heres-how-to-stream-games-on-4g-and-5g",
    "played": "https://www.techradar.com/news/cyberpunk-2077-on-mobile-could-bring-about-google-stadias-renaissance",
    "35Mbps": "https://www.techradar.com/news/cyberpunk-2077-will-be-available-at-launch-for-stadia",
    "using": "https://www.techradar.com/deals/how-much-data-do-i-need",
    "clarified": "https://www.techradar.com/news/iphones-and-ipads-probably-wont-support-xcloud-xbox-game-streaming",
    "announced": "https://imgur.com/gallery/I8d79Nu",
    "launched": "https://api.narrativ.com/api/v0/redirect/?url=https%3A%2F%2Fblogs.nvidia.com%2Fblog%2F2020%2F11%2F19%2Fgeforce-now-on-ios-safari%2F&a=1724208621081707099&uuid=3b4f3e90-3633-405e-9761-a5d69dda75f9&uid_bam=1723233677259840306&ar=1724224363625201805",
    "planning": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-4456794606199646700&murl=https%3A%2F%2Fwww.newegg.com%2Fsamsung-galaxy-note20-ultra-5g-6-9-mystic-white%2Fp%2FN82E16875169965",
    "Prime Video": "https://www.techradar.com/news/amazons-prime-video-ios-app-finally-lets-you-purchase-tv-shows-and-movies",
    "Verge": "https://www.theverge.com/2020/7/30/21348108/apple-amazon-prime-video-app-store-special-treatment-fee-subscriptions",
    "lowered": "https://www.techradar.com/news/apple-is-halving-its-app-store-cut-for-the-vast-majority-of-developers",
    "suggest": "https://www.techradar.com/news/fortnites-endgame-why-an-epic-fight-with-apple-and-google-could-lead-to-major-changes"
  }
}