{
  "source": "https://www.techradar.com/news/microsoft-admits-windows-10-taskbar-bug-and-is-working-on-a-fix",
  "title": "Microsoft admits Windows 10 taskbar bug, and is working on a fix",
  "category": "computing",
  "updated": "2021-06-16T08:50:01Z",
  "author": "darren-allan",
  "summary": "There are already several unofficial workarounds",
  "article": [
    "Windows 10 has an issue with the taskbar, Microsoft has admitted, while letting affected users know that a solution is in the works.",
    "If you’ve been following the news on Windows 10 problems of late, you’ll recall this one popping up with the latest June cumulative update (and the preview version of that batch of patches in late May). It affects those using the May 2021 Update, October 2020 Update and May 2020 Update, plus the November 2019 Update.",
    "Microsoft pinpoints this bug as actually creeping in with KB5001391, the preview update of May’s patching, back in late April, and observes that: “After installing KB5001391 or later updates, the news and interests button in the Windows taskbar might have blurry text on certain display configurations.”",
    "The software giant adds: “We are working on a resolution and will provide an update in an upcoming release.”",
    "Meantime, the obvious workaround as we’ve discussed before is simply to turn off News and interests on the taskbar (right click the icon for the app – or an empty bit of the taskbar – then left click ‘News and interests’, and select ‘Turn off’).",
    "What’s interesting here is that while Microsoft has acknowledged the visual corruption of the News and interests icon in some cases, there’s no mention of the other problems which have been reported elsewhere.",
    "That includes the taskbar system tray icons becoming corrupted, or vanishing entirely, seriously impacting the usability of Windows 10. Microsoft hasn’t commented on these other gremlins, but again, if you’re suffering these, simply dumping the ‘News and interests’ icon is a possible simple cure.",
    "If that doesn’t work for you, other options are to uninstall the cumulative update which caused the problem – not ideal, obviously – or you could try moving the taskbar to the top of the screen, as Wccftech (which spotted Microsoft’s announcement) suggests.",
    "Other potential remedies include heading to Settings > System > Display to make sure the option for changing the size of text, apps and other items (under ‘Scale and layout’) is on ‘recommended’."
  ],
  "headers": {
    "4": "Workarounds aplenty"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "latest June cumulative update": "https://www.techradar.com/news/windows-10-update-is-reportedly-breaking-the-taskbar-for-some-users-but-theres-a-fix",
    "preview": "https://www.techradar.com/news/windows-10-update-is-messing-with-the-taskbar-but-theres-an-easy-fix",
    "May 2020 Update": "https://www.techradar.com/how-to/windows-10-may-2020-update-problems-how-to-fix-them",
    "that": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6459517372685718000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fwindows%2Frelease-health%2Fstatus-windows-10-21h1%231629msgdesc",
    "News and interests icon": "https://www.techradar.com/news/windows-10-taskbar-could-soon-get-more-useful-or-annoying-depending-on-your-viewpoint",
    "Wccftech": "https://wccftech.com/microsoft-confirms-windows-10-bug-taskbar-introduced-by-kb5001391/",
    "Other potential remedies": "https://www.techradar.com/news/windows-10-update-is-reportedly-breaking-the-taskbar-for-some-users-but-theres-a-fix"
  }
}