{
  "source": "https://www.techradar.com/news/nvidia-rtx-3090-ti-could-arrive-with-faster-vram-but-will-anyone-be-able-to-buy-it",
  "title": "Nvidia RTX 3090 Ti could arrive with faster VRAM – but will anyone be able to buy it?",
  "category": "computing",
  "updated": "2021-11-29T12:46:28Z",
  "author": "darren-allan",
  "summary": "Expect questionable availability and eye-watering pricing",
  "article": [
    "Nvidia’s purported RTX 3090 Ti graphics card, the juiced-up flagship expected to arrive in January 2022, could come bristling with 21Gbps GDDR6X memory from Micron.",
    "This comes from Taiwanese outlet Uniko’s Hardware on Twitter, which has been the source of a number of previous hardware leaks, as spotted by VideoCardz.",
    "Currently, the RTX 3090 has 24GB of VRAM running at 19.5Gbps, so the memory being pushed a bit faster on the 3090 Ti would represent a nice little speed hike, while remaining at 24GB – but populated with 12 x 2GB modules with the Ti variant, as opposed to 24 x 1GB on the 3090.",
    "Theoretically, the faster Micron RAM would mean that memory bandwidth would be pushed to just over 1TB/s – breaking that symbolic barrier – compared to 936GB/s with Nvidia’s current flagship.",
    "VideoCardz further observes that the RTX 3090 Ti is rumored to have the full GA102 GPU with 10,752 CUDA cores (as opposed to 10,496 cores on the 3090), and it’ll feature a new board design with a different memory layout – and those 2GB modules – also with a new power connector (PCIe Gen5, perhaps).",
    "The extra performance supposedly comes at an unsurprising price in terms of the power budget, with the TDP of the card expected to hit 450W rather than the base 350W of the existing RTX 3090. Ouch.",
    "If this rumor is correct, coupled with the boost in CUDA core count, the RTX 3090 Ti will be a nice step up in performance for those who want the absolute best of Nvidia’s Ampere range. However, the weighty 100W increase in the power is worryingly steep – and more than the rumor mill originally suggested, which was 400W or a 50W step up. That said, it’s always expensive to live at the cutting-edge of PC hardware, of course.",
    "Indeed, if the power requirements are eye-opening, then the price is likely to be even more so – likely eye-popping, let’s be honest. Nvidia will charge a premium for this thing, for sure, and it’s uncertain what availability will be like to begin with, given the ongoing situation around stock woes, which isn’t expected to be remedied until 2023. And scarce inventory will only push prices upwards and encourage scalping.",
    "The RTX 3090 Ti, if it does arrive in January, is expected to be accompanied by new variants of RTX 3070 Ti and RTX 3080 graphics cards, though when the latter rumor was recently aired, there was no mention of the 3090 Ti. With this fresh speculation, though, it seems the Ti version of the flagship is still very much in the cards, so to speak.",
    "The only question top-end buyers might be asking themselves early next year could be whether the 3090 Ti is worth grabbing at all, or is it better to wait for the purported RTX 4090 which is due to turn up in Q3 of next year, and could be a massive step forward in performance terms (and power usage, too).",
    "Given that the gap between the 3090 Ti and 4090 might not be much more than six months, those hunting for a stupidly powerful GPU could well be better off waiting for the next-gen range – when maybe we might begin to see glimmers of hope for a better picture with stock levels, too (but as mentioned, Nvidia is predicting that this isn’t something which will be fully resolved until 2023)."
  ],
  "headers": {
    "6": "Analysis: Power, availability and pricing worries – and is it best to wait for the next-gen flagship?"
  },
  "links": {
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "flagship expected to arrive in January 2022": "https://www.techradar.com/news/nvidia-may-be-launching-an-rtx-3090-ti-after-all",
    "VideoCardz": "https://videocardz.com/newz/nvidia-geforce-rtx-3090-ti-confirmed-to-feature-microns-21-gbps-gddr6x-memory",
    "Nvidia’s Ampere range": "https://www.techradar.com/news/nvidia-ampere",
    "rumor mill originally suggested": "https://www.techradar.com/news/nvidia-rtx-3090-super-gpu-rumors-just-wont-die-but-how-likely-is-it",
    "expected to be accompanied by new variants": "https://www.techradar.com/news/nvidia-rtx-3080-and-3070-ti-gpus-with-more-vram-could-arrive-january-2022",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "could be a massive step forward": "https://www.techradar.com/news/nvidia-rtx-4090-gpu-could-be-almost-three-times-faster-than-the-rtx-3090",
    "Nvidia is predicting": "https://www.techradar.com/news/nvidia-ceo-says-theres-no-magic-cure-for-gpu-shortage-thatll-last-until-2023"
  }
}