{
  "source": "https://www.techradar.com/news/watching-wrestlemania-37-is-a-stone-cold-bargain-thanks-to-this-peacock-deal",
  "title": "Peacock TV deal: rock bottom WrestleMania 37 bargain ends Friday",
  "category": "entertainment",
  "updated": "2021-04-08T17:24:10Z",
  "author": "adam-marshall",
  "summary": "Exclusive US WrestleMania broadcaster has 50% off now",
  "article": [
    "Are you ready to bow to your new WWE streaming masters for WrestleMania 37? If you're planning to grab a Steveweiser and settle in to watch the big show this weekend, then you better recognise that there's a new big dog in the yard - Peacock TV.",
    "NBC's very own streaming service is now the exclusive place to watch all of WWE's biggest events stateside - starting with the weekend-long WrestleMania show on April 10 and 11.",
    "And to celebrate the WWE's new home, you can now grab a Rock Bottom bargain 50% off with new subscriptions. Usually setting you back $4.99 a month for its Peacock Premium package, you'll pay four months upfront ($9.99) with this offer, working out at 50% off and just $2.50 a month.",
    "But we'd suggest that you don't hang around - this promotion ends on April 9. If you look to grab it when WrestleMania 37 is actually on at the weekend, you'll end up paying full price. A body slam to be avoided.",
    "Regardless of whether you're a wrestling fan or not, this is exceptional value for money and brings with it a host of fantastic entertainment. Find out more about this Peacock TV deal and what else the streaming service offers below.",
    "Lock in four months of Peacock TV at a rate of just $2.50 a month and benefit from a whole host of fantastic online content with the Peacock Premium plan. From the people that bring you NBC, you can enjoy live streams of the Today Show through your subscription, as well as sporting events across the shores with Premier League coverage for US spectators right here.",
    "Peacock also hosts a ton of fantastic boxsets, including classics like The Office - you can watch Saved by the Bell, the reboot, too. You'll also be able to watch 30 Rock, Modern Family, Downton Abbey and much more.",
    "More of a movie watcher? You'll find John Wick, Trolls: World Tour, Fast and Furious 6, and more to marathon your way through. Better still, Peacock TV is available to stream across a ton of devices, including Roku, Apple TV, iOS and Android devices, as well as gaming consoles PlayStation and Xbox.",
    "- Head to the Peacock website to find out more and sign up",
    "Read more:"
  ],
  "headers": {
    "5": "What can I watch with this Peacock TV deal?"
  },
  "links": {
    "Peacock TV": "https://www.techradar.com/news/peacock-tv-how-to-watch-for-free-cost-devices-shows-movies-and-more",
    "50% off and just $2.50 a month": "https://imp.i305175.net/c/221109/828265/11640?subId1=trd-us-8427966939123140000&sharedId=trd-us&u=https%3A%2F%2Fwww.peacocktv.com%2Fsports%2Fwwe",
    "watch Saved by the Bell": "https://www.techradar.com/news/how-to-watch-saved-by-the-bell-reboot-2020-stream-the-new-peacock-show-from-anywhere",
    "Head to the Peacock website to find out more and sign up": "https://imp.i305175.net/c/221109/828265/11640?subId1=trd-us-8654192428897480000&sharedId=trd-us&u=https%3A%2F%2Fwww.peacocktv.com%2F"
  }
}