{
  "source": "https://www.techradar.com/news/intel-rocket-lake-cpu-pre-orders-could-go-live-early-to-make-the-most-of-amd-ryzen-stock-woes",
  "title": "Intel Rocket Lake CPU pre-orders could go live early to make the most of AMD Ryzen stock woes",
  "category": "computing",
  "updated": "2021-02-25T10:42:21Z",
  "author": "darren-allan",
  "summary": "Pre-orders might open on March 16 – ahead of on-sale date of March 30",
  "article": [
    "Intel’s Rocket Lake processors could be revealed on March 16, in just a few weeks’ time, with pre-orders going live on that date, ahead of the chips being available to buy at the end of March.",
    "The 11th-gen CPUs will actually be available to buy on March 30 at 8am PT, which is also when reviews of the processors will be published, according to sources who spoke to Wccftech. The details given are quite precise, but as ever, we must be very cautious about any rumor like this.",
    "Still, the March 16 reveal date almost exactly matches what we’ve heard from the rumor mill before, which is that Intel will launch these next-gen chips on March 15.",
    "One thing that seems a little odd is pre-orders being live after the initial launch, but reviews only coming out two weeks later when the Rocket Lake CPUs are actually on sale.",
    "In other words, those who are pre-ordering will be taking something of a leap in the dark, with no knowledge of how the performance of these 11th-gen chips pans out aside from leaks (as proper reviews won’t be around until a fortnight later).",
    "Wccftech explains that apparently Intel is delaying the on-sale date of Rocket Lake silicon due to a new microcode update which will need to be applied by motherboard manufacturers, and to ensure this is in place (presumably it’s a key update, then). It still remains unclear as to why pre-orders might open so early, though.",
    "If this is the case – and remember, this is just speculation – it essentially envisages a situation where Intel is seemingly believing that folks will be happy to commit to Rocket Lake without seeing performance benchmarks (aside from a couple of small clues Intel has already provided).",
    "Whether that will actually happen remains to be seen – in fact, what will happen full-stop is still up in the air of course – but if this situation does arise, there may well be folks willing to go ahead and grab a pre-order simply because they might be worried about Intel’s 11th-gen stocks and availability come the end of March.",
    "Of course, all we’re hearing about of late is stock shortages – certainly on the AMD front – and how broader supply and demand issues in terms of PC components aren’t going to be resolved any time soon.",
    "Indeed, another theory could be that maybe Intel wants to get pre-orders live early, ahead of the full launch, to capitalize to the maximum on those aforementioned AMD Ryzen stock problems (before shortages on some Ryzen 5000 chips begin to ease at least somewhat, which is a possibility we’ve heard on the grapevine).",
    "Rocket Lake will run with an 8-core flagship CPU (rather than the 10-core product which spearheads Comet Lake), and there have also been rumors that the top-end Core i9-11900K could even attack AMD on the pricing front."
  ],
  "headers": {
    "5": "Microcode delay"
  },
  "links": {
    "Intel’s Rocket Lake processors": "https://www.techradar.com/news/intel-rocket-lake",
    "Wccftech": "https://wccftech.com/intel-11th-gen-rocket-lake-cpu-pre-order-16th-march-review-sales-30th-march/",
    "Intel will launch these next-gen chips on March 15": "https://www.techradar.com/news/intel-rocket-lake-could-land-on-march-15-with-potentially-record-breaking-flagship-cpu",
    "certainly on the AMD front": "https://www.techradar.com/news/amd-ryzen-cpus-help-drive-record-breaking-revenue-but-the-news-isnt-all-good",
    "broader supply and demand issues": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "possibility we’ve heard on the grapevine": "https://www.techradar.com/news/amd-cpu-stock-rumor-is-bad-news-for-would-be-ryzen-5950x-and-5900x-buyers",
    "8-core flagship CPU": "https://www.techradar.com/news/rocket-lake-leak-reveals-final-specs-of-flagship-intel-core-i9-11900k-desktop-cpu",
    "could even attack AMD on the pricing front": "could%20even%20attack%20AMD%20on%20the%20pricing%20front"
  }
}