{
  "source": "https://www.techradar.com/news/starfield-could-feature-mission-impossible-star-tom-cruise",
  "title": "Starfield could feature Mission Impossible star, Tom Cruise",
  "category": "gaming",
  "updated": "2021-05-18T12:26:14Z",
  "author": "adam-vjestica",
  "summary": "He was in Oblivion and Fallout... the films at least",
  "article": [
    "While the debate as to whether Starfield will come to PS5 rages on – the latest prediction from an industry insider strongly suggests Starfield will be an Xbox and PC exclusive – the latest rumor points to a possible starring role from an unlikely Hollywood star.",
    "We’ve seen cameos from notable actors in the past, from Sir Patrick Stewart in The Elder Scrolls: Oblivion to Keanu Reeves in Cyberpunk 2077, but could we see Mission Impossible star Tom Cruise in Bethesda’s next game? Possibly.",
    "On the Gaming Leaks and Rumors subreddit (thanks, GamesRadar+), there’s a fairly vague claim that Tom Cruise will star in the upcoming space-faring RPG. The leak comes from a self-proclaimed “insider”, who points to a tweet from 2018 by Bethesda Game Studios, which implies the company may have signed Cruise up to star in its new game.",
    "At this stage, there’s more rumors about what Starfield might include rather than what the game actually is. Bethesda hasn’t shared any meaningful information since its reveal back at E3 2018, which means speculation about Starfield continues to swirl.",
    "Securing a high-profile name like Tom Cruise would give Starfield an instant shot in the arm, though, particularly when it comes to marketing. Cruise is still considered a big Hollywood star, and having him provide voice work or even a likeness in the game would help give the game some wider publicity outside of gaming circles.",
    "It paid dividends for Cyberpunk 2077, too, with Keanu Reeves not only becoming the face of the game, but he helped create a marketing buzz that probably wouldn’t have occurred without the Matrix star’s likeness and support.",
    "After Microsoft’s acquisition of Bethesda for $7.5 billion, Starfield is tipped to be an Xbox Series X/S console exclusive, with the game also releasing on PC. The game is likely to launch on Xbox Game Pass on day one, and would be an enviable exclusive for PS5 owners.",
    "That is, if the game lives up to expectations. Again, details on Starfield are frustratingly thin on the ground, but a Bethesda-developed new IP was always bound to generate some excitement. We’re expecting to find out more about Starfield at E3 2021 where both Xbox and Bethesda will be in attendance. Sony, unfortunately, will not be present."
  ],
  "headers": {
    "6": "Cruise control"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Starfield will be an Xbox and PC exclusive": "https://www.techradar.com/news/starfield-will-be-an-xbox-series-x-exclusive-new-rumors-suggest",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Gaming Leaks and Rumors subreddit": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/neynjj/tom_cruise_in_starfield_and_other_starfield_leaks/",
    "GamesRadar+": "https://www.gamesradar.com/starfield-rumor-claims-tom-cruise-is-starring-in-bethesdas-new-game/",
    "Bethesda for $7.5 billion": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "E3 2021": "https://www.techradar.com/news/e3-2021"
  }
}