{
  "source": "https://www.techradar.com/news/netflixs-top-10-most-watched-movies-ever-are-a-weird-bunch",
  "title": "Netflix's top 10 most-watched movies ever are a weird bunch",
  "category": "entertainment",
  "updated": "2021-06-02T08:12:11Z",
  "author": "samuel-roberts",
  "summary": "And now Army of the Dead is one of them",
  "article": [
    "Netflix has updated its list of the top 10 most-watched movies on its platform. The list, which is topped by Extraction starring Chris Hemsworth, is joined by five other movies that were rated positive on critical aggregation site Rotten Tomatoes. Four others (Spenser Confidential, Murder Mystery, The Midnight Sky and 6 Underground) are rated rotten – meaning that critics were more mixed on the films.",
    "The list, which is based on how many households watched each movie within the first four weeks they're available, has clearly been skewed by pandemic viewing. Seven of the ten movies were released in March 2020 or later – and the newest addition is Zack Snyder's Army of the Dead, which ties for tenth place with George Clooney's The Midnight Sky.",
    "Here's the list, from Deadline, with the number of households tuning in during the first four weeks per movie for two minutes or more:",
    "Note that Army of the Dead is a projected number, since the movie is only a few weeks old.",
    "Murder Mystery, in case you forgot, was a 2019 comedy film starring Adam Sandler and Jennifer Aniston, while 2018's Bird Box was a post-apocalyptic thriller starring Sandra Bullock. 6 Underground was Michael Bay's first action movie for Netflix, and that landed in December 2019.",
    "Every other movie in the top 10, then, released after February 2020.",
    "We all needed something to watch in 2020 and the first half of 2021, and Netflix was there for us. Not all of these movies were great, but they felt enough like 'real' films you'd see on the big screen that they filled the gap – and viewers clearly lapped them up.",
    "The Old Guard and Extraction gave us meaty action sequences while the MCU went on hiatus. The Midnight Sky scratched our itch for a ponderous sci-fi movie, even if it was no Ad Astra. Enola Holmes offered up a critically well-received family film while there was no real competition.",
    "Netflix always stood to gain from a pandemic that had us stuck indoors for most of a year – but in fairness, a lot of these movies were pretty good, or at least, good enough. It'll be interesting to see which Netflix original, if any, will crack the top 10 next as theaters reopen around the world."
  ],
  "headers": {
    "6": "What does the list tell us about our Netflix viewing habits?"
  },
  "links": {
    "Army of the Dead": "https://www.techradar.com/news/army-of-the-dead-on-netflix-is-zack-snyders-best-movie-yet",
    "Deadline": "https://deadline.com/2021/05/zack-snyder-army-of-the-dead-netflix-viewership-figures-1234766042/"
  }
}