{
  "source": "https://www.techradar.com/news/great-fitbit-deal-get-the-slick-fitbit-inspire-2-for-under-dollar70",
  "title": "Great Fitbit deal: get the slick Fitbit Inspire 2 for under $70",
  "category": "fitness",
  "updated": "2021-04-20T09:00:02Z",
  "author": "cat-ellis",
  "summary": "Get a gentle nudge to healthier habits with the Fitbit Inspire 2",
  "article": [
    "Right now, you can pick up the slim Fitbit Inspire 2 for just $68.95 at Amazon, Walmart and direct from Fitbit. That's a saving of $31 off the regular price.",
    "It's unusual for so many retailers to knock the price of a device so low outside of Black Friday, but in this case it's easy to explain. Fitbit has just launched a new device, the Fitbit Luxe, that looks very similar to the Inspire 2 on the surface, so stores have opted to drop its price to make both fitness trackers equally tempting.",
    "Not in the US? Scroll down for the best Fitbit deals near you",
    "The Fitbit Inspire 2 is an entry-level fitness tracker, and is a great tool if you're looking for some encouragement to get more active. It offers all-day heart rate monitoring, step tracking, and 'active zone minutes', helping you meet recommended daily goals to improve your health. There's sleep tracking, too so you can see how well you're resting at night.",
    "You also get a trial subscription to Fitbit Premium thrown in for free, giving you access to nutrition plans, instructor-led workouts, and meditation sessions led by Deepak Chopra.",
    "Its display is black and white (much like that of the Fitbit Charge 4), which means it looks a little less flashy than the new Luxe, but that's the only real downside here.",
    "If you live outside the US, we've also rounded up the best Fitbit deals near you."
  ],
  "headers": {},
  "links": {
    "pick up the slim Fitbit Inspire 2 for just $68.95 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08DFDP1TR%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1275099022586342000-20",
    "Walmart": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-2642664481463474700&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FFitbit-Inspire-2-Black%2F782866746",
    "direct from Fitbit": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1062490430206922900/https://www.fitbit.com/global/us/products/trackers/inspire2",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Fitbit Luxe": "https://www.techradar.com/reviews/fitbit-luxe",
    "Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-is-now-free-for-90-days-including-all-premium-features",
    "Deepak Chopra": "https://www.techradar.com/news/fitbit-launches-new-stress-busting-meditation-tools"
  }
}