{
  "source": "https://www.techradar.com/news/google-had-to-block-hundreds-of-thousands-of-malicious-android-apps-last-year",
  "title": "Google had to block hundreds of thousands of malicious Android apps last year",
  "category": "computing",
  "updated": "2021-04-22T14:05:40Z",
  "author": "mayank-sharma",
  "summary": "Despite Google's efforts, the Play Store isn’t completely void of malicious apps",
  "article": [
    "Google recently provided an overview of its efforts to weed dangerous applications from Play Store, the native marketplace for Android.",
    "In a blog post, Google Play’s Director of Product Management Trust & Safety, Krish Vitaldevara, shared that Google threw out no less than 119,000 app developer accounts last year, while its machine learning solutions prevented over 962,000 apps from getting listed on the store.",
    "“Our core efforts around identifying and mitigating bad apps and developers continued to evolve to address new adversarial behaviors and forms of abuse,” wrote Vitaldevara, highlighting the challenges the platform had to wrestle with in 2020.",
    "To tackle the challenges, Google enacted a series of new Play Store policies to help reduce the spread of fake news and misinformation.",
    "One of the priorities of the platform was to reign in malicious apps that rode on the user’s need for information related to the Covid-19 pandemic.",
    "Apps that deal with such sensitive use-cases were required to maintain a high-level of user data privacy standards, in addition to being endorsed by government or healthcare authorities.",
    "Similarly, it also enacted new guidelines for apps that advertise themselves as news sources in a bid to improve user transparency while holding the developers accountable for any misuse.",
    "It also put in place teams and processes that focused on the US elections in an effort to address election threats and abuse.",
    "While this all sounds rosy, Play Store isn’t completely bereft of malicious apps.",
    "Not only are its Play Protect mechanisms far from perfect, a new report suggests that it also carries a solid number of malware-infected apps.",
    "According to data from mobile app security specialists Upstream, one in six mobile devices in emerging markets such as Brazil, Indonesia, and Thailand, carry at least one infected app. More interestingly, it notes that 29% of the malicious apps still went through Google Play.",
    "However, the report also notes that Google’s protection mechanisms are forcing threat actors to move away from the platform and instead list their wares on third-party stores."
  ],
  "headers": {
    "3": "New policies",
    "8": "Far from perfect"
  },
  "links": {
    "overview of its efforts": "https://security.googleblog.com/2021/04/how-we-fought-bad-apps-and-developers.html",
    "Play Store": "https://www.techradar.com/best/best-android-apps-2021",
    "app developer": "https://www.techradar.com/best/best-mobile-app-development-software",
    "far from perfect": "https://www.techradar.com/news/google-play-protect-performs-miserably-in-android-protection-tests",
    "malware-infected": "https://www.techradar.com/best/best-malware-removal",
    "mobile devices": "https://www.techradar.com/best/best-android-phones"
  }
}