{
  "source": "https://www.techradar.com/news/facebooks-rumored-smartwatch-leaks-revealing-one-big-feature-rivals-lack",
  "title": "Facebook smartwatch leaks, and it's got one big feature its rivals lack",
  "category": "wearables",
  "updated": "2021-10-29T09:19:21Z",
  "author": "jasmine-gearie",
  "summary": "This could be your first look at the Meta Watch",
  "article": [
    "Rumors of a Facebook smartwatch have been swirling for months, and thanks to a new leak we now have our first glimpse of the device. According to the image obtained by Bloomberg, we can see the smartwatch has one big feature its competitors don't – a front-facing camera.",
    "There's a camera notch that eats into the screen, located in the center of the bottom edge of the display. Other than its peculiar placement, it looks much like the front-facing camera you find on a smartphone.",
    "Aside from the camera, the design of the smartwatch looks reminiscent of the Fitbit Sense, with a wide square face and softly rounded edges. There does appear to be some button on the right-hand side of the smartwatch, but the photo isn't clear enough to be sure.",
    "Earlier rumors surrounding this smartwatch suggested it would have a detachable display, functioning more like a video-calling device (or action camera) than a fitness or health-tracking wearable.",
    "The image of Facebook Inc's – now officially known as Meta – in-development smartwatch was first spotted by Steve Moser. He found the image inside its Facebook View app, which is used to edit photos and videos taken using Facebook’s smart glasses, the Ray-Ban Stories.",
    "According to Moser, code in the Facebook View app suggests the smartwatch has the codename 'Milan'. As Bloomberg reports, code discovered in the app indicates the camera will be able to take photos and videos, and share them with a smartphone.",
    "The smartwatch market has a large number of entrenched players, with Apple and Google both having significant investment in the space, and there’s a constant stream of new products coming to market.",
    "Most recently, we’ve seen the launch of the Apple Watch 7, the Samsung Galaxy Watch 4 and a slew of devices from Garmin and Fitbit (which was acquired by Google early this year).",
    "In such a competitive space, it’s perhaps sensible that Facebook appears to be taking a different route, with a distinct focus on the social potential of the smartwatch centered around its video capabilities.",
    "While it makes sense for the social media giant to want to tap into this potential, the question remains around how much more convenience do we actually need (and want) when it comes to devices with the ability to video chat.",
    "From one perspective, this new watch could be seen as a rehash of the same \"throw a camera in it\" strategy that we saw with the recent launch of the Ray-Ban Stories sunglasses.",
    "The camera in the Ray-Ban glasses arguably makes more sense, however, in that it quickly and easily allows the wearer to capture and share what they’re seeing.",
    "But when most of us have a smartphone in our pocket, is there a market for a smartwatch with a built-in camera that’s facing towards the user, rather than outwards? The ability to video chat hands-free could be a draw factor for some users, but it has to be asked, will the angle be all that flattering?",
    "The earliest rumors surrounding the Facebook smartwatch do suggest that some level of health tracking will be available on the device, so there’s a chance it will be matching its competitors in this way.",
    "However, given Facebook’s track record with handling sensitive information of its users, it should also be asked whether users can trust Facebook with the privacy of their health data."
  ],
  "headers": {
    "6": "Analysis: is there room for a more \"social\" smartwatch?"
  },
  "links": {
    "Facebook smartwatch": "https://www.techradar.com/news/facebook-smartwatch",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-10-28/leaked-photo-shows-meta-s-planned-competitor-to-apple-watch",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "detachable display": "https://www.techradar.com/news/the-rumored-facebook-smartwatch-looks-set-to-take-on-gopro",
    "now officially known as Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "Ray-Ban Stories": "https://www.techradar.com/reviews/ray-ban-stories-facebook-smart-glasses",
    "Apple Watch 7": "https://www.techradar.com/reviews/apple-watch-7",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "earliest rumors": "https://www.techradar.com/news/facebook-rumored-to-be-working-on-its-own-health-tracking-smartwatch",
    "sensitive information of its users": "https://www.techradar.com/news/facebook-data-breach-how-to-check-if-your-details-were-leaked"
  }
}