{
  "source": "https://www.techradar.com/news/apple-macbook-pro-m1-deals-at-amazon-feature-lowest-price-yet-on-the-512gb-model",
  "title": "Apple MacBook Pro M1 deals at Amazon feature lowest price yet on the 512GB model",
  "category": "computing",
  "updated": "2021-03-13T18:18:05Z",
  "author": "alex-whitelock",
  "summary": "Don't miss this hard-to-spot coupon code",
  "article": [
    "This weekend we're seeing some fantastic M1 MacBook deals land at Amazon, including the lowest price yet on the 512GB model, which can be picked up for $1,349.99 (was $1,499) right now.",
    "If you don't see that price immediately don't worry - you haven't missed it, Amazon in fact has an additional $50 coupon that it's applying at checkout automatically. Curiously, it's not obvious at first glance, but it's there and pushes the overall price to the cheapest we've seen yet on the 512GB model.",
    "Much has been written about the new M1 Apple MacBook Pro's, and, while there is always a degree of hype and fanboyism around Apple devices, the new processor is indeed pretty special. It's the first propriety chip in a long time to challenge those offered by Intel and AMD, and in some cases, such as power efficiency, actually surpass them by quite a margin.",
    "For power users, the 512GB version is a great buy and an easy recommendation. If you're on a budget, however, MacBook deals at Amazon can also be found on the slightly cheaper 256GB version - which is retailing for $1,199.99 (was $1,299) currently. This is again the cheapest price so far on this device, although it's a sale we've seen a few times already, unlike the discount on the 512GB model.",
    "Outside the US? See the best MacBook deals in your region just down below.",
    "For further reading, we recommend checking out our main MacBook deals article, where we're covering the entire range in much more detail. We've also got this week's best cheap laptop deals to check out too, in case you'd like something a little cheaper."
  ],
  "headers": {
    "5": "Apple MacBook deals at Amazon"
  },
  "links": {
    "for $1,349.99 (was $1,499)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08N5LH3F7%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1408839999010481400-20",
    "for $1,199.99 (was $1,299)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08N5LLDSG%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4096181062151732700-20",
    "MacBook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699",
    "cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals"
  }
}