{
  "source": "https://www.techradar.com/news/save-dollar150-on-the-stunning-macbook-air-m1-with-amazons-lowest-ever-price",
  "title": "Save $150 on the stunning MacBook Air M1 with Amazon's lowest ever price",
  "category": "computing",
  "updated": "2021-10-11T11:37:11Z",
  "author": "alex-whitelock",
  "summary": "Our best rated laptop of 2021 is now just $849",
  "article": [
    "The excellent Apple MacBook Air M1 has returned to its lowest ever price in today's deals at Amazon - just $849.99 (was $999).",
    "We've seen this $150 discount before (on three brief occasions) but it remains one of the best MacBook deals on the market and a perfect opportunity to bag a bargain on the reigning champ in our best laptops buyer's guide.",
    "As always, the Apple MacBook Air M1 is a great buy if you're looking for a quality ultrabook that will last a few good years. The much-lauded M1 processor gives it plenty of power for both work and casual applications, as well as a battery life that's capable of running a full day of work on a single charge - something simply out of reach of most Windows-based machines.",
    "Being incredibly power efficient also means that the Apple MacBook Air M1 can do away with those noisy fans for cooling. Like a phone or tablet, it runs completely silently; despite being a very powerful laptop in its own right. As with any Apple MacBook, the Air M1 features a slick uni-body aluminium chassis and a gorgeous liquid retina display that's both vibrant and bright.",
    "Outside the US? See the best MacBook deals in your region just below.",
    "Amazon (and other retailers, for that matter) tend to play it fairly safe when it comes to MacBook deals and promotions on other popular Apple items over Black Friday.",
    "In short, we wouldn't expect any sales to massively exceed those being offered today. MacBooks, iPads, and other hot tech products also tend to sell out at Amazon over the holiday period so it could be wise to pick them up sooner rather than later.",
    "That said, if you do want to wait and see how things pan out, then that's also a good option as we expect some great Amazon Black Friday deals - especially if you're not desperate for an upgrade.",
    "Want to check out the other models in the range? Head on over to our main MacBook deals page for more."
  ],
  "headers": {
    "5": "Should I wait until Black Friday for MacBook deals?"
  },
  "links": {
    "just $849.99 (was $999)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB08N5M7S6K%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4743480512450118000-20",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
    "MacBook deals": "https://www.techradar.com/news/computing/apple/cheap-macbook-deals-1295699"
  }
}