{
  "source": "https://www.techradar.com/news/dc-fandome-2021-how-to-watch-date-time-star-guests-and-more",
  "title": "DC FanDome 2021: how to watch, date, time, star guests and more",
  "category": "entertainment",
  "updated": "2021-10-16T16:08:12Z",
  "author": "richard-edwards",
  "summary": "Everything you need to know about DC's virtual comic-con",
  "article": [
    "Wondering how to watch DC's FanDome 2021 event? The online event features the biggest and best of DC Comics across movies, TV shows and games – and it kicks off today, Saturday October 16, at 10am PT (or 1pm ET and 6pm UK).",
    "DC FanDome 2021 promises to be just as big a deal, with the stars of The Batman, Aquaman and the Lost Kingdom, Shazam! Fury of the Gods, The Suicide Squad spin-off Peacemaker and many more logging on to tease what’s heading our way over the coming months. The Batman trailer has been confirmed, with much more expected from the digital comic con-style event besides.",
    "So, to get you ready for the exciting October 16 event, here’s everything you need to know about DC FanDome 2021, from details of how to stream the panels, to details of who’ll be appearing on your screen.",
    "You can watch DC FanDome 2021 using the embed link above.",
    "The event will also be available to viewers around the world at DCFanDome.com, where you can watch the live stream via your web browser – whether that’s on desktop, smartphone or tablet. You’ll also be able to watch the action on DC Comics’ other official social media channels on Twitch, Facebook and Twitter.",
    "While DC say the event will be “free of excessive violence, drugs, sex etc”, younger fans can watch a kid-friendly version of the livestream at DCKidsFanDome.com.",
    "The live stream will also feature subtitles in 12 languages: Arabic, English, French, German, Italian, Japanese, Korean, Polish, Portuguese, Russian, Spanish and traditional Chinese.",
    "DC FanDome kicks off at 10am PT (that’s 1pm ET and 6pm UK) on Saturday October 16. The event is slated to run for approximately four hours.",
    "And don’t worry if you can’t watch the event live, because DC say that “select portions” will be available on the DCFanDome site until October 31. The big trailers are also likely to be available on YouTube long after that.",
    "This is DC’s free, online showcase for its upcoming slate of movies, TV shows, comics and games based on its extensive catalogue of comic-book characters. In keeping with the first two FanDome events – Hall of Heroes and Explore the Multiverse, which took place in August and September 2020, respectively – DC FanDome 2021 will feature trailers, big reveals, appearances from DC’s stars and creators, and lots more…",
    "On October 7, DC released a trailer hinting what to expect at their 2021 event, featuring teaser footage and brief sightings of loads of big-name guests.",
    "Black Adam leading man Dwayne Johnson says that “the DC Universe is about to change”, while The Suicide Squad/Peacemaker star (and fellow WWE veteran) John Cena teases “one day where everything DC comes alive”.",
    "“The epic global event…” continues The Batman’s Robert Pattinson, “that will take you on a journey…” adds co-star Zoë Kravitz, before Johnson returns to finish the thought with “…beyond your wildest expectations.” “Nothing compares to this,” chips in Pierce Brosnan, who’ll be on bad guy duties as Doctor Fate in Black Adam.",
    "The DC FanDome 2021 trailer also teases a first look at the eagerly anticipated new trailer for The Batman…",
    "While the exact timings of the DC FanDome 2021 schedule are yet to be confirmed, DC’s line-up announcement from October 4 did confirm the talent making an appearance at the event.",
    "Based on the trailer and the talent announcements, it looks like you’ll be seeing presentations and/or footage from the following projects and guests... (Some speculation ahead.)",
    "JJ Abrams The Star Wars and Star Trek director has signed a mega-bucks deal with Warner Bros, which will include a producer role on a Superman reboot. Hopefully Abrams will reveal his plans – though, given his secretive nature, we don’t expect to learn much.",
    "Aquaman and the Lost Kingdom Stars Jason Momoa (Arthur Curry/Aquaman) and Yahya Abdul-Mateen II (David Kane/Aquaman) will be logging on to talk Aquaman 2. Even if we don’t get a full trailer, expect to see some behind-the-scenes footage.",
    "Batgirl Star Leslie Grace, screenwriter Christina Hodson and directors Adil El Arbi and Bilall Fallah will hopefully shed some light on the HBO Max movie.",
    "The Batman We know we’re getting a trailer, but what else will stars Robert Pattinson (Bruce Wayne/Batman) and Zoë Kravitz (Selina Kyle/Batwoman), and director Matt Reeves, have to say for themselves?",
    "Black Adam Dwayne Johnson’s making a high-profile move to the DCEU as the eponymous villain/antihero, and he’ll be joined at DC Fandome 2021 by co-stars Pierce Brosnan (Doctor Fate), Noah Centineo (Atom Smasher), Aldis Hodge (Hawkman) and Quintessa Swindell (Cyclone).",
    "Blue Beetle Fingers crossed we’ll be getting a first-look at this HBO Max movie with director Angel Manuel Soto, writer Gareth Dunnet-Alcocer and star Xolo Maridueña (Jaime Reyes/Blue Beetle).",
    "The Flash The big-screen incarnation of The Flash who appeared in Justice League gets his own movie. With any luck, star Ezra Miller and writer Christina Hodson will be showing off a trailer.",
    "Shazam! Fury of the Gods This sequel isn’t out until 2023, but surely star Zachary Levi will want to show off some footage from the movie?",
    "Static Shock Black Panther and Creed star Michael B Jordan is producing this movie adaptation of the Static Shock comic. Producer Reggie Hudlin is on the DC FanDome 2021 guest list.",
    "Wonder Woman We’re not necessarily expecting any big Wonder Woman 3 announcements, but with the Amazon celebrating her 80th birthday – and her impending induction to the Comic-Con Character Hall of Fame – director Patty Jenkins and ’70s TV star Lynda Carter will surely be celebrating an icon.",
    "Batwoman An audience with stars Javicia Leslie (Ryan Wilder/Batwoman), Camrus Johnson (Luke Fox) and Rachel Skarsten (Elizabeth Kane) as Batwoman’s third season gets underway.",
    "Doom Patrol Matt Bomer (Larry Trainor) is the representative of the very weird HBO Max show.",
    "DMZ Executive producers Ava DuVernay and Robert Patino discuss their dystopian HBO Max miniseries, spun off from Brian Wood/Riccardo Burchielli comic book.",
    "The Flash The smart money would be on stars Grant Gustin (Barry Allen) and Candice Patton (Iris West-Allen) giving us a tease for the upcoming season 8.",
    "Harley Quinn Kaley Cuoco is on the schedule, and we’re guessing she’s around to talk about her acclaimed animated series. Ron Funches (King Shark) is also on the roster.",
    "Naomi Another possible appearance from Selma director Ava DuVernay, a CW adaptation of the Brian Michael Bendis/David F Walker/Jamal Campbell comic book coming in 2022. Looks like she’ll be joined by star Kaci Walfall and executive producer Jill Blankenship.",
    "Peacemaker James Gunn transfers The Suicide Squad’s Peacemaker to his very own Peacemaker HBO Max show. Gunn is on the DC FanDome 2021 guestlist, along with leading man John Cena and co-stars Steve Agee (John Economos), Flula Borg (possibly reprising his Suicide Squad role as Javelin), Danielle Brooks (Leota Adebayo), Jennifer Holland (Emilia Harcourt), Chukwudi Iwuji (Clemson Murn) and Freddie Stroma (Adrian Chase). If we don’t see Peacemaker in action, we’ll be very disappointed.",
    "Supergirl As the sixth and final season of the show flies towards its conclusion, DC FanDome 2021 assembles a hefty selection of stars: Melissa Benoist (Kara Danvers/Supergirl), Mehcad Brooks (James Olsen/Guardian), Julie Gonzalo (Andrea Rojas/Acrata), David Harewood (J’onn J’onzz/Martian Manhunter), Jeremy Jordan (Winn Schott/Toyman), Chyler Leigh (Alex Danvers/Sentinel), Nicole Maines (Nia Nal/Dreamer), Katie McGrath (Lena Luthor), Staz Nair (William Dey), Jesse Rath (Brainiac 5), Peta Sergeant (Nyxlygsptlnz), Azie Tesfai (Kellie Olsen/Guardian) and Chris Wood (Mike Matthews/Mon-El) will all be in virtual attendance.",
    "Superman & Lois Supergirl’s cousin should be getting his own showcase, with the eponymous Superman (Tyler and Hoechlin) and Lois (Bitsie Tulloch) joined by their super-sprog Jordan (Alex Garfin).",
    "Sweet Tooth This year’s surprise Netflix hit (until Squid Game came along), Sweet Tooth is represented at DC FanDome 2021 by star Christian Convery (Gus).",
    "DC’s numerous cartoon shows/movies will be represented by Elizabeth Gillies (Catwoman: Haunted), Justin Hartley (Injustice), Scott Menville (Teen Titans Go! See Space Jam), Anson Mount (Injustice), Tara Strong (Teen Titans Go! See Space Jam), Bruce Timm (writer/producer), James Tucker (writer/producer) and Hynden Walch (Teen Titans Go! See Space Jam).",
    "DC FanDome 2021’s roster of comic book creators include Jeffrey Brown, Denys Cowan, Jim Lee, Todd McFarlane, John Ridley and Scott Snyder.",
    "Talent from the world of videogames includes Sefton Hill (Suicide Squad: Kill the Justice League), Donald Mustard (Epic Games), and Ann Lemay and Patrick Redding (Gotham Knights).",
    "And the DC FanDome 2021 list of other guests and panel hosts is rounded out by Érico Borgo, Nancy Bushell, Gaby Cam, Aline Diniz, Echo Kellum, Terry Ltam, Cam Newton, Gino Quillamor, Jayden Rodrigues and Tiffany Smith."
  ],
  "headers": {
    "3": "How to watch DC FanDome 2021",
    "7": "What time is DC FanDome 2021? 10am PT, Saturday October 16",
    "9": "What is DC FanDome 2021?",
    "10": "DC FanDome 2021 trailer",
    "14": "DC FanDome 2021 schedule",
    "16": "Movies",
    "26": "TV",
    "36": "Animated TV shows",
    "37": "Comics",
    "38": "Videogames",
    "39": "Other guests"
  },
  "links": {
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer",
    "The Suicide Squad spin-off Peacemaker": "https://www.techradar.com/news/hbo-maxs-suicide-squad-spin-off-series-peacemaker-will-star-john-cena",
    "DCFanDome.com": "https://www.dcfandome.com/",
    "Twitch": "https://www.twitch.tv/dccomics",
    "Facebook": "https://www.facebook.com/DCUnitedKingdom",
    "Twitter": "https://twitter.com/DCComics",
    "DCKidsFanDome.com": "https://www.dckidsfandome.com/",
    "Aquaman 2": "https://www.techradar.com/news/aquaman-2-release-date-cast-and-what-else-we-know-about-dcs-return-to-atlantis",
    "The Flash": "https://www.techradar.com/news/the-flash-movie-release-date-cast-multiple-batman-actors-and-more-explained",
    "Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Wonder Woman 3": "https://www.techradar.com/news/wonder-woman-3-is-coming-after-ww84-hbo-max-stream-proves-a-big-success",
    "Comic-Con Character Hall of Fame": "https://www.dccomics.com/blog/2021/09/28/celebrate-wonder-woman-80-with-dc",
    "Sweet Tooth": "https://www.techradar.com/news/sweet-tooth-season-2"
  }
}