{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-accidentally-confirmed-by-samsung-itself",
  "title": "Samsung Galaxy S21 FE accidentally confirmed by Samsung itself",
  "category": "phones",
  "updated": "2021-08-26T09:04:52Z",
  "author": "james-rogerson",
  "summary": "Looks like it's coming very soon",
  "article": [
    "Hot on the heels of Google seemingly leaking many of the Samsung Galaxy S21 FE’s specs, Samsung itself appears to have confirmed that the phone exists.",
    "A page on Samsung France’s website spotted by SamMobile mentions the Galaxy S21 FE by name, essentially confirming both that it exists and that it will be called the Samsung Galaxy S21 FE – not that either of those things are surprising at this point.",
    "The only other thing the page reveals is that buyers of the S21 FE will be eligible for a free four-month subscription to YouTube Premium, though that might only apply in France.",
    "You can see a screenshot of the page above, though note that the phone shown at the top of that image isn’t the Samsung Galaxy S21 FE – in fact it’s the Samsung Galaxy S20 Ultra, despite that seemingly not being one of the models that’s eligible for the main four-month promotion.",
    "Based on previous leaks we’re expecting the Samsung Galaxy S21 FE to have a high-end Snapdragon 888 chipset, 6GB of RAM, a 6.4-inch FHD+ screen, a triple-lens camera, and a 4,000mAh battery, so expect this to be a fairly high-end phone, though one that’s likely to cost slightly less than the rest of the Samsung Galaxy S21 range. That said, the price is one thing we haven’t heard much about yet.",
    "While just a name doesn’t in itself tell us much about the Samsung Galaxy S21 FE, the fact that Samsung has mentioned it on a website as part of a current promotion suggests that the phone will launch very soon.",
    "We haven’t heard many rumored release dates yet, but one places the phone in October, and that’s believable given this slip up from Samsung. If anything, we’d think the Galaxy S21 FE could land even earlier than that.",
    "Then again, Samsung probably won’t want it to get buried in September’s iPhone 13 hype, so October would be our best guess – it’s soon, but long enough for the initial iPhone enthusiasm to die down slightly. It also gives the recently unveiled Samsung Galaxy Z Flip 3 and Samsung Galaxy Z Fold 3 slightly more breathing room than a September launch would."
  ],
  "headers": {
    "5": "Analysis: a mention like this suggests an imminent launch"
  },
  "links": {
    "Google seemingly leaking": "https://www.techradar.com/news/key-samsung-galaxy-s21-fe-specs-may-have-been-revealed-by-google",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "SamMobile": "https://www.sammobile.com/news/samsung-galaxy-s21-fe-existence-confirmed-again/",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "places the phone in October": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review"
  }
}