{
  "source": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
  "title": "Black Widow: release date, Disney Plus launch, plot, and more",
  "category": "audio-visual",
  "updated": "2021-07-07T09:47:14Z",
  "author": "richard-edwards",
  "summary": "Natasha Romanoff's solo flick has a new launch date",
  "article": [
    "Black Widow's solo film has been a long time coming. The 24th MCU movie is ready to go but, due to the Covid-19 pandemic continuing to affect film releases across the globe, the film has suffered from its fair share of delays.",
    "Now, Black Widow has a new launch window. We also have confirmation on whether it will be released simultaneously in theaters and on Disney Plus, as well as some other new snippets of information. Realistically, the film can't afford any more setbacks, otherwise Marvel's whole Phase 4 plan will be thrown out of whack, so Black Widow needs to arrive sooner rather than later.",
    "If you need any updates on this MCU flick, look no further. Read on for everything there is to know about Black Widow's standalone adventure.",
    "The Black Widow movie is now slated for a July 9, 2021 release. The film had already seen its launch date pushed back to May 7, 2021 after its initial May 2020 arrival was postponed due to the Covid-19 pandemic. This made 2020 the first year without a single new Marvel movie since 2009, but Disney and Marvel aren't looking to make it two years on the run without an MCU film instalment.",
    "In February, Disney CEO Bob Chapek stated the company's intent for Black Widow's May 7 release to remain in place, as reported by Deadline. Those plans have shifted since, however, despite cinema chains beginning to open in the US. UK theaters are expected to open their doors to the public again from late April, but those two nations' movie earnings wouldn't be enough to cover Black Widow's development and marketing costs.",
    "Realistically, Marvel Studios and Disney need film fans across the world to see Black Widow in theaters to make a profit. With the pandemic still in full force in large areas, cinema chains in mainland Europe and South America aren't likely to open soon.",
    "All of this means that calls to release Black Widow on Disney Plus have increased in the past few weeks, so will it arrive on the streamer too? Read on to find out if that's the case.",
    "Yes. As we've already covered, Black Widow will receive a simultaneous launch on Disney Plus and in theaters. Like we said, some world regions won't have their theaters up and running between now and July 9, so it makes sense for Disney to finally relent and greenlight Black Widow for its streaming platform.",
    "There is a catch with this release though. Like Raya and the Last Dragon, as well as Mulan before it, Black Widow will only arrive on Disney Plus Premier Access on July 9. That means that anyone wanting to watch Black Widow will need to stump up an extra payment on top on their subscription fee.",
    "Right now, there's no word on how much it'll cost. Given that Raya and Mulan both landed on Premier Access for USD $29.99 / GBP £19.99 / AUD $34.99 / EUR €21.99 per movie, we'd expect Black Widow to follow suit. Anything more than those prices and consumers won't be happy, regardless of the fact that they'd like to see it within a week or two from launch.",
    "There's also no timeline on when Black Widow will be free to watch on Disney Plus. Mulan was made available to all subscribers three months after its release, so Black Widow might follow a similar format. Shang-Chi and the Legend of the Ten Rings is the next MCU movie to arrive - currently slated for a September 2021 release - but, as Black Widow's movie is a prequel of sorts, it isn't necessary to view it before Shang-Chi arrives. As such, don't be surprised if Black Widow isn't freely available to all on Disney Plus until at least October. That's what we think anyway, but we'll update this if Disney makes an official announcement pre-release.",
    "You can watch the final Black Widow trailer above, which follows a series of reveals that rolled out back at the 2020 Super Bowl and earlier.",
    "When it comes to what the teaser footage tells us so far, the final trailer shows us more of the Taskmaster's plan: he's using the Red Room where Natasha was trained to control agents.",
    "The first trailer opens with a montage of Romanoff staring into a mirror and scenes from previous MCU movies to highlight the film's key theme: family. “I used to have nothing. But then I got this job. This family. But nothing lasts forever,” she says.",
    "We also see Romanoff meeting a returning William Hurt as Thaddeus 'Thunderbolt' Ross, which is where the Russian agent may be persuaded to defect to the United States. We also Florence Pugh’s Yelena Belova - an operative with similar skills to Black Widow, who Romanoff describes as “sis”. Biological sisters, or spiritual? We’ll have to wait and see.",
    "In the special look trailer, we can see that Black Widow must face up to her past by tackling a new breed of assassin, or a \"new world of Widows\" as she puts it. In the original trailer, Natasha hints at the \"mistakes\" she made before joining S.H.I.E.L.D and this army of assassins appears to be those made manifest, which seems to be her major arc in the story.",
    "Here's a full list of every character set to appear in Black Widow so far:",
    "Alongside Johansson, Oscar-winner Rachel Weisz plays Melina, a Russian spy who goes under the alias Iron Maiden, who is a villain in the comics. Florence Pugh is Yelena, who assumed the Black Widow mantle after Natasha Romanoff in print.",
    "Stranger Things and Hellboy star David Harbour plays Alexie Shostakov, otherwise known as Red Guardian. He is Russia’s super-soldier answer to Captain America though, in the movie, he appears to be a little out of shape.",
    "The principal cast is rounded out by the aforementioned Hurt as Ross, and Ray Winstone as General Dreykov. This character, according to a Disinsider report, is the Head of the Red Room, so it'll be interesting to see interactions between Romanoff and Dreykov if they cross paths.",
    "O-T Fagbenle plays a character called Mason, but there’s speculation that Fagbenle is playing the aforementioned Taskmaster, who is a masked, bow-wielding vigilante. Marvel is playing that particular card close to its chest, and some fans have also speculated that Weisz's character may also end up being Taskmaster. We don't know who will end up being the movie's main antagonist, and we'll have to wait until July to find out for sure.",
    "Robert Downey Jr’s Tony Stark - aka Iron Man - will also make an appearance, according to a 2019 report from Deadline. He may have been killed in Avengers: Endgame, but as with Romanoff, the Black Widow movie’s position in the timeline makes a comeback feasible. Finally, Gangs of London's Olivier Richters has been cast in an undisclosed role.",
    "Spoilers follow for Avengers: Endgame. Turn back now or have it ruined for you (that is, if you're one of the few MCU fans who hasn't seen it yet).",
    "Eagle-eyed viewers will have noticed the inconvenient fact that Black Widow was one of the high-profile casualties of Endgame. The new film isn’t messing around with continuity, however, because it’s set some time in the aftermath of Captain America: Civil War, when Natasha is living as a fugitive after helping Cap and Bucky Barnes (the Winter Soldier) escape the authorities.",
    "\"There are ways to do prequels that are less informative or answer questions you didn’t necessarily have, and then there are ways to do prequels where you learn all sorts of things you never knew before,” MCU overlord Kevin Feige teased io9 back in June 2019. “I look at Better Call Saul as a wonderful example of a prequel that almost completely stands on its own apart from Breaking Bad because it informs you about so many things you didn’t know about before.\"",
    "It also seems likely that the movie will feature plenty of flashbacks – the scene with Ross in the trailer features a significantly de-aged William Hurt, suggesting the meeting takes place much earlier in Romanoff’s history. We also see hints of the brutal Red Room facility seen in Avengers: Age of Ultron, where Black Widow was trained. In other words, expect this to be the MCU movie from the other side of the Iron Curtain.",
    "Not a lot. This is Marvel, after all, a studio well known for not giving away unnecessary plot details. However, with Black Widow being such a popular character – along with the fact MCU movies tend to get sequels – we can’t help wondering if this will be an excuse to bring the deceased Natasha Romanoff back into the wider Marvel continuity, much like Endgame provided a way back for Tom Hiddleston’s Loki.",
    "In an interview with Total Film, Johansson made clear that \"One of the themes of the film is family. What is family? How does it define us? How does our past define us? How does our family – however we define it – make up who we are, for better or worse?” It looks like revelations from Widow's past will change plenty about how we perceive the character in her previous MCU outings. It also suggest the film will lurch from typically action-packed superhero fare to family drama, which sounds promising.",
    "We've also seen one report suggest Florence Pugh will appear in Disney Plus' Hawkeye series, suggesting this movie could set Belova up for further MCU appearances. That rumor came from Variety in December 2020, but there's been no on-set leaks of Pugh during that production's filming thus far.",
    "A Black Widow movie is the right move for Marvel after Avengers: Endgame. The stakes of the MCU need to be dialled back a bit before they can escalate to that level again, even though they've been ramped up in the meantime by Spider-Man: Far From Home's and WandaVision's respective endings.",
    "A movie that explores Natasha's origins at last, though, feels like a dead cert. As we said, Black Widow is a popular MCU character, and many fans have wanted a solo flick for the character for years now. The quality of the ensemble cast, too, speaks to how well Marvel Studios is regarded right now – everyone wants to be part of it - and we can't wait to see what this movie has in store for them all.",
    "We'll have to wait a little while longer to find out what exactly. July can't come soon enough but, with the movie now arriving on Disney Plus as well as theaters, every MCU fan will be able to catch Johansson's potentially final outing as Black Widow."
  ],
  "headers": {
    "3": "Black Widow release date: July 2021",
    "7": "Will Black Widow come to Disney Plus?",
    "11": "Black Widow trailer: meeting the family",
    "16": "Black Widow cast: who is who in the movie?",
    "22": "How does Black Widow fit into the MCU?",
    "26": "Black Widow story: what else do we know?",
    "29": "Can Black Widow continue the MCU's form?"
  },
  "links": {
    "24th MCU movie": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-2362852566909462000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Deadline": "https://deadline.com/2019/09/saturn-awards-2019-winners-list-jon-favreau-kevin-feige-stan-lee-1202734450/",
    "already covered": "https://www.techradar.com/news/black-widow-is-officially-coming-to-disney-plus-but-itll-cost-extra",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "watch Black Widow": "https://www.techradar.com/news/how-to-watch-black-widow-online-on-disney-plus-today-from-anywhere",
    "Disinsider report": "https://thedisinsider.com/2020/03/25/ray-winstone-to-play-dreykov-the-head-of-the-red-room-in-black-widow/",
    "io9": "https://io9.gizmodo.com/1835679463",
    "Total Film": "https://myfavouritemagazines.pxf.io/c/221109/583111/9620?subId1=trd-us-4759900093419564000&sharedId=trd-us&u=https%3A%2F%2Fwww.myfavouritemagazines.co.uk%2Ffilm%2Ftotal-film-magazine-subscription%2F%3Futm_source%3Dmfm%26utm_medium%3Daffiliates%26utm_campaign%3D221109%26clickid%3D2BcWfKwzFxyORj5wUx0Mo3ERUkixUa2hGSfDQI0%26irgwc%3D1",
    "Variety": "https://variety.com/2020/tv/news/hawkeye-disney-plus-florence-pugh-vera-farmiga-cast-1234845371/",
    "WandaVision's": "https://www.techradar.com/news/wandavision-explained"
  }
}