{
  "source": "https://www.techradar.com/news/no-amd-isnt-launching-a-surprise-new-ryzen-cpu-next-week",
  "title": "No, AMD isn’t launching a surprise new Ryzen CPU next week",
  "category": "computing",
  "updated": "2021-02-12T14:56:39Z",
  "author": "darren-allan",
  "summary": "Ryzen 5950X will remain top dog, unsurprisingly",
  "article": [
    "A rumor just popped up based on a tweet which seemed to suggest that AMD could be readying a surprise processor launch for February 15, in just a few days’ time; but this proved to be as far-fetched as it sounded.",
    "The tweet in question was published by Yuri Bubliy (creator of DRAM Calculator and ClockTuner for Ryzen), and was flagged up as an interesting nugget from the rumor mill by Wccftech.",
    "The short snippet was admittedly phrased very much like it was a leak, but in actual fact, the announcement referred to isn’t from AMD, as a further tweet shortly after from Bubliy clarified.",
    "So presumably it’s some kind of feat achieved with ClockTuner in ramping up an existing AMD processor.",
    "Predictably enough, the tweet sparked plenty of speculation about whether AMD might have a special edition (or ’XT’ version) of its Ryzen 5950X processor, or indeed an entirely new chip waiting in the wings, however unlikely that may have seemed.",
    "Although not only did this seem highly unlikely in general, and in terms of the launch day being next Monday – Presidents Day in the US – it doubtless had folks scratching their heads about how AMD could push out another CPU when it’s already struggling badly to supply existing Ryzen 5000 models (especially the 5950X and 5900X).",
    "Anyway, now we know – there most definitely isn’t a surprise Ryzen variant coming, as you could probably have guessed anyway."
  ],
  "headers": {
    "4": "Speculation city"
  },
  "links": {
    "DRAM Calculator and ClockTuner for Ryzen": "https://www.techradar.com/news/amd-ryzen-3000-processors-should-run-faster-and-cooler-with-this-free-app",
    "Wccftech": "https://wccftech.com/amd-ryzen-5000-zen-3-desktop-cpu-with-5-ghz-clocks-announcement-next-week-rumor/",
    "struggling badly": "https://www.techradar.com/news/amd-ryzen-cpus-help-drive-record-breaking-revenue-but-the-news-isnt-all-good",
    "especially the 5950X and 5900X": "https://www.techradar.com/news/amd-cpu-stock-rumor-is-bad-news-for-would-be-ryzen-5950x-and-5900x-buyers"
  }
}