{
  "source": "https://www.techradar.com/news/godaddy-integrates-new-pos-with-woocommerce-for-easier-in-person-payments",
  "title": "GoDaddy integrates new POS with WooCommerce for easier in-person payments",
  "category": "computing",
  "updated": "2021-10-13T16:00:07Z",
  "author": "anthony-spadafora",
  "summary": "Accepting in-person payments has never been easier for WooCommerce store owners",
  "article": [
    "After launching its own POS system back in September, GoDaddy is now making it easier for merchants with a WooCommerce online store to accept in-person payments.",
    "WooCommerce is one of the world's most popular ecommerce platforms and it is used to process billions of dollars in transactions. However, up until now, integrating and managing in-person sales with a WooCommerce online store has been a time consuming and complicated process.",
    "When designing its new POS system, GoDaddy ensured it was fully integrated with WooCommerce to allow online stores to incorporate in-person selling with their existing sites faster so they could start selling right away.",
    "At the same time, this integration eliminates the need for multiple logins across platforms, reduces training time and allows stores to launch and begin accepting in-person payments quickly.",
    "Through GoDaddy Payment's POS expansion, both in-person and online transactions can be managed from the Payments Hub which serves as one convenient WooCommerce dashboard.",
    "As GoDaddy Payments doesn't require a plug-in for either online or in-store payments, once in-person selling is up and running within the Payments Hub, businesses can securely accept payments wherever their customers are whether that is at their storefront or at on-the-go events such as farmer's markets or food trucks.",
    "The dashboard also provides business owners with a clear view of the state of their business in one snapshot and serves as a single product catalog so developers or business owners can easily list products, manage returns and refunds as well as their online and in-person inventory.",
    "Businesses that do decide to go with GoDaddy Payments will even be able to keep more of what they sell as the company offers low transaction fees of 2.3 percent per in-person transactions and 2.3 percent plus 30 cents per online transaction.",
    "If you already have a WooCommerce store and want to expand your business to accept in-person payments, GoDaddy's new integration will make getting started doing so much easier."
  ],
  "headers": {
    "4": "Payments Hub"
  },
  "links": {
    "POS system": "https://www.techradar.com/news/the-best-pos-system",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "WooCommerce": "https://www.techradar.com/reviews/woocommerce",
    "ecommerce platforms": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "online stores": "https://www.techradar.com/how-to/start-an-online-store-from-scratch-and-drive-sales",
    "accept payments": "https://www.techradar.com/best/best-payment-gateways",
    "food trucks": "https://www.techradar.com/news/best-pos-system-for-food-trucks",
    "GoDaddy Payments": "https://www.techradar.com/news/godaddy-launches-payment-processing-services-for-smbs",
    "WooCommerce store": "https://www.techradar.com/best/woocommerce-hosting"
  }
}