{
  "source": "https://www.techradar.com/news/totally-rated-did-you-catch-the-halo-infinite-flight",
  "title": "Totally Rated: did you catch the Halo Infinite flight?",
  "category": "gaming",
  "updated": "2021-07-30T16:26:02Z",
  "author": "rhys-wood",
  "summary": "Halo Infinite, OnePlus Nord 2 and Unreal Engine 5 feature on this week's Totally Rated.",
  "article": [
    "On this episode of Totally Rated, Halo Infinite launched its first technical preview, but did you manage to get invited? In the realm of smartphones, we review the OnePlus Nord 2, and back over in gaming, we get a sneak peek at Epic's Unreal Engine 5.",
    "343 Industries launched its first Halo Infinite technical preview, where lucky Halo Insiders got to try out the game for the first time against teams of AI Spartan bots.",
    "In phone news, the budget-oriented OnePlus Nord 2 launched, and we were overall pretty impressed with the new smartphone in our review. Finally, in gaming, Gears of War developer The Coalition demonstrated its graphical prowess with some new Unreal Engine 5 footage.",
    "The first Halo Infinite technical preview flight has gone out to some gamers who've signed up to the Halo Insider program, available to play for gamers on PC and Xbox Series X/S consoles.",
    "Invites have started to go out to some lucky few, who will get to test a vertical slice of Halo Infinite's multiplayer suite, including Slayer matches against Bots (a first for the Halo series), and a truncated Battle Pass featuring a condensed amount of cosmetics to customize one's Spartan with.",
    "Previews will run from July 29 - August 1, 2021, and those who are able to join in this weekend will get to test Halo Infinite early, and get a feel for the gameplay that 343 Industries is so keen to impress on.",
    "343 Industries has confirmed that the testing \"will focus on Bots and a slice of the new Academy experience” as these are new elements implemented in the upcoming game.",
    "However, the post also promises that future technical previews will also focus on traditional stalwarts like Big Team Battle. Halo Infinite still doesn't have a firm release date outside of the usually vague 'Holiday 2021,' so fear not if you missed out on the technical preview, as the game is relatively close to release. Barring any last-minute delays, of course.",
    "The latest handset from OnePlus, the OnePlus Nord 2, launched. And while the phone didn't release worldwide, it's created quite a bit of buzz on the internet regardless.",
    "TechRadar’s James Peckham was impressed with the budget phone, and wrote: \"Historically, OnePlus has been about making high-end phones for a lower price than the competition. The same can’t be said for the latest OnePlus 9 series, but the OnePlus Nord 2 is taking on that mantle.",
    "\"The mid-range phone market is an extremely competitive space, with great options from the Google Pixel 4a to the Samsung Galaxy A52 5G, but the OnePlus Nord 2 features specs that allow it to hold its own in that space.",
    "\"In fact, the OnePlus Nord 2 is one of the very best phones in this segment of the market. It features some impressive specs including a 50MP main rear camera, 65W fast-charging and a 6.43-inch 1080 x 2400 display with a 90Hz refresh rate.",
    "\"That screen offers a good experience, although some will be disappointed that the company hasn’t stretched to a 120Hz refresh rate here. That said, it offers good picture quality at a suitable size for many people.",
    "\"One odd quirk is that the company has moved to a MediaTek chipset for the very first time, but it was seemingly the right decision, as we’ve found it offered improved performance when compared to the original OnePlus Nord.",
    "\"The other highlight of the OnePlus Nord 2 is strong battery life, as we found it would always last a full day of usage even when we were pushing the phone to its limits. If you find it doesn’t, there’s also 65W fast charging that sees your phone go from 0% to full in just 30 minutes.",
    "\"The OnePlus Nord 2 doesn’t have any game-changing features, but as a total package it offers a top experience that many will enjoy considering its lower price than a lot of other phones right now.",
    "\"So if you’re looking for a cheaper alternative to a flagship, you should consider the OnePlus Nord 2 alongside the tough competition (such as those phones mentioned above) and note that it has a great camera experience, strong battery life and more going for it.\"",
    "New Unreal Engine 5 footage was released courtesy of The Coalition, the Microsoft Game Studios developer responsible for the recent Gears of War titles. The sneak peek at Unreal Engine 5 tech showcases characters in unprecedented detail, and we're keen to see just how much of that detail makes its way into future titles by The Coalition.",
    "We were treated to not just Unreal Engine 5 character renders, though, as the Xbox YouTube channel also released the \"Alpha Point Technical Demo\" showcasing a stunningly detailed environment complete with enhanced lighting and shadow techniques.",
    "When Gears 5 launched in 2019, it was arguably one of the best looking games ever created, and was a real showcase for Unreal Engine 4, particularly if you play the game on PC or on Xbox Series X/S via the enhanced edition of the game.",
    "Whatever The Coalition has up its sleeve next, then, be that Gears 6 or otherwise, we're sure it's going to look graphically marvelous if it's running on Unreal Engine 5.",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every week."
  ],
  "headers": {
    "3": "Halo Infinite's technical preview flights are taking off",
    "8": "OnePlus Nord 2 - a budget phone that leaves a grand impression",
    "17": "Unreal Engine 5 + Gears of War: a match made in heaven?"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "343 Industries has confirmed": "https://www.techradar.com/news/halo-infinite-multiplayer-beta-kicks-off-july-29-heres-what-you-need-to-know",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Unreal Engine 5": "https://www.techradar.com/news/an-early-look-at-unreal-engine-5",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review"
  }
}