{
  "source": "https://www.techradar.com/news/why-your-next-co-worker-could-be-a-bot",
  "title": "Why your next co-worker could be a bot",
  "category": "computing",
  "updated": "2021-09-27T10:26:31Z",
  "author": "harold-de-neef",
  "summary": "Why it is time for public services to embrace bots",
  "article": [
    "Throughout history, technology has continued to augment what people can do. We’re perfectly capable of travelling from one place to another, or calculating in our heads, but cars and spreadsheets make us undeniably better at it. Technologies take care of the tasks that humans find boring, difficult or even impossible to do. They can free us to spend time where we bring the most value: creativity, problem-solving, compassion, and personal interaction.",
    "However, there’s often resistance to disruptive technologies when they’re first introduced. People initially fear the impact on their lives and livelihoods, but soon these new technologies become part of everyday life, just like cars or computers.",
    "Today’s latest disruptive technologies, such as chatbots and artificial intelligence (AI), are proving valuable for public services - complementing what people can do at a time when demand is increasing and budget pressures are particularly acute. From FAQ bots answering basic questions, digital assistants helping self-service, and digital humans creating human-like interactions, here’s just three areas where chatbots can augment what we do.",
    "In many instances, talking to a bot can feel more comfortable than engaging with a human when addressing sensitive topics. For example, discussing private issues like health or money, or topics that can have a social stigma (e.g. mental wellbeing, homelessness, addiction), the anonymity chatbots provide encourages people to be more honest and open up more freely.",
    "The current pandemic has brought lasting change to the way we live and work, meaning public services need to continually adapt to changing demand. With an ‘always on’ service, chatbots help citizens engage at a time most convenient to them. After all, our needs as citizens or customers aren’t confined to a 9-5 weekday, which is less than 25% of the time in a week. This constant availability enables citizens to self-serve when they want, whether that’s booking a doctor’s appointment, requesting a housing repair, or paying a bill. In turn, this frees up humans to deal with the more complex or sensitive issues.",
    "The most advanced bots have the ability to detect things that may be difficult for a human to perceive. For example, spotting nuances in tone of voice, or the use of words that could indicate a particular mental health issue such as dementia. And, of course, chatbots can handle a high-volume of certain tasks, with much greater speed and accuracy than any human ever could. They can also provide rapid and tailored information to both citizens and employees. And if they have the ability to self-learn through AI, they can continually improve accuracy, and ultimately, help organizations deliver a better service.",
    "Rather than our future being a question of choice between a bot or a human, we should be thinking about how we can bring the best of humans and bots together to deliver better outcomes. In our latest Perspectives report, we outlined how a close partnership focusing on what needs to be done can help play to everyone’s strengths to drive a positive difference.",
    "With public services experiencing increased demand during the pandemic, chatbots can prevent skilled professionals from being overwhelmed with enquiries. In Health and Care, for example, they can deliver “triage as a service” to assess medical conditions and provide basic advice, or direct patients to the right provider. Chatbots also allow public bodies to make far better use of the valuable data they already hold, ensuring that services are smarter, better integrated and more responsive to the ever-evolving needs of citizens and communities. Through continuous training and improvement, we can help our new team members, chatbots, stay relevant, and help citizens to access information in any format or language.",
    "However, to ensure long-term value creation, and justify the investment, you need to think about how chatbots integrate in your long-term strategy. The way to get the best value for your organization, is to firstly be clear on what you want to achieve with the bots: the problem you are trying to solve. From there, you can choose the right tool for the job, and often times a simpler bot can achieve your objectives. And finally, and just as importantly, you need to consider the bot as a member of the team – a team member who needs the same on-boarding, supervision and ongoing training as their human counterparts. That’s how you can deliver long term value with chatbots.",
    "With a growing number of increasingly sophisticated use cases, it’s clear that chatbots can become effective team members, working alongside humans to provide better public services overall. In short, our view is that chatbots are a valuable technology for public services: they are easy to implement, save money, free up time, and can even save lives. When budgets are under more pressure than ever, public services can’t afford not to embrace this now essential technology."
  ],
  "headers": {
    "3": "1. Anonymity",
    "4": "2. 24/7 availability",
    "5": "3. Improved outcomes",
    "6": "The best of bots and humans"
  },
  "links": {
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-recovery-software"
  }
}