{
  "source": "https://www.techradar.com/news/samsung-q60a-qled-tv-price-release-date-and-specs",
  "title": "Is Samsung's cheapest 4K QLED TV worth buying?",
  "category": "televisions",
  "updated": "2021-04-26T14:13:28Z",
  "author": "henry-st-leger",
  "summary": "Is Samsung's Q60A 4K QLED a good buy?",
  "article": [
    "The Samsung Q60A QLED TV occupies a curious place in the TV maker's 2021 range, as the cheapest television to feature its QLED (or 'quantum dot') moniker. But given the low price point, the Q60A is the most cost-effective way to get a QLED in your home – as well as the most compromised option.",
    "Why compromised? Well, to drop the price Samsung needs to cut some corners, and the question with the Q60A – as with last year's Q60T – is whether a budget QLED is good enough to warrant the name.",
    "With 4K resolution and HDR / HDR10+ support, the Q60A appears to get the basics right, though a lot of other technologies will have been sacrificed to keep costs down for the set. And if you're trying to size up a cheap QLED TV ahead of official reviews coming out, we've brought together everything we know about the Samsung Q60A, as well as what we'd expect given the quality of its predecessor (the Q60T).",
    "It's worth keeping in mind, too, that Samsung is also releasing Neo QLED TVs these days, which pair the company's established QLED tech with Mini LED backlighting – and often throw in 8K resolution to boot – so the QLED name alone no longer signifies the same top-of-the-range quality as it might have done in previous years.",
    "The Samsung Q60A QLED benefits from a wide range of sizes you won't find on more expensive models. It starts at a breezy $599 / £749 for a 43-inch size, going up to $699 / £899 for the 50-inch, $849 / £999 for the 55-inch, $1,099 / £1,299 for the 65-inch, $1,499 / £1,999 for the 75-inch, and $2,799 / £2,999 for the 85-inch.",
    "In the US, shoppers will also get to choose between 60-inch ($999) and 70-inch ($1,349) models.",
    "In Australia, you get the option of four sizes: 55-inch (AU$1,599), 65-inch (AU$1,999), 75-inch (AU$2,599), and 85-inch (AU$4,199).",
    "We expect the Q60A to appear in this year's best 40-inch TV list too.",
    "The Samsung Q60A is this year's entry-level 4K QLED, meaning you'll get something of a saving, though alongside some drops in specification compared to more premium models.",
    "To tick off the most important boxes, the Q60A features 4K resolution and HDR support – alongside the dynamic HDR10+ standard favored by Samsung, which uses additional metadata to make premium movies and TV shows look closer to as intended by their creators. You won't get Dolby Vision HDR here, then, though HDR10+ will prove a boon for those who prefer Amazon Prime Video (which supports it) over Netflix (which doesn't). The HLG broadcast standard is supported too.",
    "The QLED panel includes a quantum dot filter to enhance contrast. It's not a total game-changer by itself, and the 'QLED' moniker usually covers a host of different picture technologies – though at the bottom of the QLED range you're not getting all of them.",
    "There's no Dolby Atmos audio here, with Samsung opting for a stripped-down version of its Object Tracking Sound technology, here referred to as 'OTS Lite'. You won't get the spread of ten dedicated speakers around the screen (as with OTS+) and, given the price point, we wouldn't expect much more than average built-in speakers. If you have an existing soundbar, of course, it may be worth plugging that in – while eARC support means that you'll be able to control external audio through your regular TV remote.",
    "Other features include Multi-View (up to two simultaneous video feeds) and an Ambient Mode for calming screensavers or photography. You even get Filmmaker Mode, which turns off most of your picture processing – ostensibly to cleave closer to 'what the creator intended' – but for a screen at this price point we couldn't recommend leaving the picture to fend for itself.",
    "As a Samsung smart TV, you'll get the Tizen operating system, which is one of the best out there, with a well-organized home screen and broad app support, from Netflix and Disney Plus to Hulu (for those in the US) and Freeview Play (for those in the UK). The Tizen platform works with Alexa and Google Assistant too, though the built-in Bixby is present if you ever feel sorry for the maligned (and unspectacular) voice assistant.",
    "There's also a new solar-powered remote that comes with all 2021 Samsung TVs, and will mean you're not cycling through batteries every few months.",
    "What's worth noting, though, is what you don't get with the Q60A. 8K resolution is off the table, as are the wide viewing angles of more premium sets. This is also an edge-lit set, which helps to keep it slim but will mean the brightness isn't consistent across the screen, and could negatively impact HDR performance.",
    "There's no HDMI 2.1 support either across the three HDMI ports, and 4K resolution will top out at 60fps on the set's 60Hz panel.",
    "The Samsung Q60A QLED is already on sale, along with the rest of the new Samsung TV range. If you're set on a cheap QLED TV, you can pick it up now."
  ],
  "headers": {
    "4": "Samsung Q60A QLED pricing and sizes",
    "8": "Samsung Q60A QLED specs and features",
    "17": "Samsung Q60A QLED release date"
  },
  "links": {
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Q60T": "https://www.techradar.com/reviews/samsung-q60t-qled-tv",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Neo QLED TVs": "https://www.techradar.com/news/qled-vs-neo-qled",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "best 40-inch TV": "https://www.techradar.com/news/best-40-inch-tv",
    "Dolby Vision HDR": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Object Tracking Sound": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Hulu": "https://www.techradar.com/reviews/hulu",
    "Freeview Play": "https://www.techradar.com/news/freeview-play",
    "Bixby": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant",
    "solar-powered remote": "https://www.techradar.com/news/samsungs-new-solar-powered-smart-remote-doesnt-need-batteries",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021"
  }
}