{
  "source": "https://www.techradar.com/news/your-samsung-phone-may-get-at-least-four-years-of-security-updates",
  "title": "Your Samsung phone may get at least four years of security updates",
  "category": "phones",
  "updated": "2021-02-23T10:57:21Z",
  "author": "balakumar-k",
  "summary": "More than 130 models released after 2019 are eligible",
  "article": [
    "Samsung has announced it will provide security updates for its Galaxy mobile phones for a minimum of four years after launch. This commitment dates back to phones released in 2019, so it may be relevant to a Samsung phone you already own.",
    "Samsung said more than 130 models released after 2019 are subject to its regular security updates. They include the Galaxy S10, Galaxy S20 and Galaxy S21 series, as well as Samsung’s foldable smartphones.",
    "Note that this is for security updates though, so this doesn't gurantee you'll get fully fledged software upgrades to the likes of Android 11 or Android 12. You may still get a few years of those updates, but Samsung is only committing to four years of security upgrades in this specific statement.",
    "Samsung has previously said that it promises to give its smartphones three years of upgrades, and the company confirmed a list of compatible devices with this scheme as the Note 20 launch in August 2020.",
    "Those devices aren't the exact same list as these security upgrades though, so you may be in a situation where you see future security updates but you don't get the latest Android features.",
    "The complete list of Samsung smartphones eligible for regular security updates follows below, but we'd also expect this to follow for future upcoming phones such as the Samsung Galaxy Note 21, Galaxy Z Fold 3, Galaxy Z Flip 3 and Galaxy S22.",
    "As for existing devices, you'll need one of the below to have this commitment. Galaxy Foldable devices: Fold, Fold 5G, Z Fold 2, Z Fold 2 5G, Z Flip and the Z Flip 5G.",
    "Galaxy S series: S10, S10 Plus, S10e, S10 5G, S10 Lite, S20, S20 5G, S20 Plus, S20 Plus 5G, S20 Ultra, S20 Ultra 5G, S20 FE, S20 FE 5G, S21 5G, S21 Plus 5G and the S21 Ultra 5G.",
    "Galaxy Note series: Note 10, Note 10 5G, Note 10 Plus, Note 10 Plus 5G, Note 10 Lite, Note 20, Note 20 5G, Note 20 Ultra and the Note 20 Ultra 5G.",
    "Galaxy A series: A10, A10e, A10s, A20, A20s, A30, A30s, A40, A50, A50s, A60, A70, A70s, A80, A90 5G, A11, A21, A21s, A31, A41, A51, A51 5G, A71, A71 5G, A02s, A12, A32 5G and the A42 5G.",
    "Galaxy M series: M10s, M20, M30, M30s, M40, M11, M12, M21, M31, M31s and the M51. Galaxy XCover series: XCover4s, XCover FieldPro and the XCover Pro.",
    "Galaxy Tab series: Tab Active Pro, Tab Active3, Tab A 8 (2019), Tab A with S Pen, Tab A 8.4 (2020), Tab A7, Tab S5e, Tab S6, Tab S6 5G, Tab S6 Lite, Tab S7, Tab S7+.",
    "It added that it has been working with more than 1,000 partners to establish security standards for all Android-based devices.",
    "\"for a minimum of four years after the initial phone release\"",
    "Samsung offers along with Samsung Knox, its defense-grade security platform, the embedded Secure Element (eSE) a Secure Processor to protect against physical attacks; and the recently introduced Knox Vault, which adds another layer of security."
  ],
  "headers": {
    "5": "Samsung Galaxy devices eligible for these upgrades"
  },
  "links": {
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "foldable smartphones": "https://www.techradar.com/best/best-foldable-phones",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "three years of upgrades": "https://www.techradar.com/news/samsung-note-20-and-galaxy-s20-have-three-more-years-of-android-updates-coming",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22"
  }
}