{
  "source": "https://www.techradar.com/news/zack-snyders-new-netflix-project-finally-has-a-title-and-a-stacked-cast",
  "title": "Zack Snyder's new Netflix project finally has a title – and a stacked cast",
  "category": "entertainment",
  "updated": "2021-06-15T11:40:57Z",
  "author": "tom-power",
  "summary": "Twilight of the Gods is coming to Netflix in the future",
  "article": [
    "Zack Snyder has been a busy guy of late. The writer-director has just come off the back of popular zombie-heist movie Army of the Dead and, while that universe is being fleshed out with two more projects, Snyder is also hard at work making other content for the streaming giant.",
    "Now, the Justice League director has revealed what his next Netflix production will be. It's called Twilight of the Gods, and it's an animated TV show coming from Snyder, wife Deborah Snyder, and Trese creator Jay Oliva.",
    "Speaking on day 4 of Netflix Geeked Week, Snyder revealed that his next Netflix project would be a TV series based on Norse mythology – and it has a stacked cast to go with it.",
    "\"I wanted to tell about my next Netflix project, which is completely outside of [Army of the Dead's] world,\" Snyder said. \"It's called Twilight of the Gods, and it's my take on Norse mythology.\"",
    "Twilight of the Gods will be made by animation studio Digital Dimension, with Snyder saying that making an animated TV series will allow the creative team to \"do whatever we want\".",
    "As for that all-star cast, the likes of Corey Stoll (Ant-Man), Lauren Cohan (The Walking Dead) and Kristopher Hivju (Game of Thrones) are just three of Twilight of the Gods' big names.",
    "Check out the full cast list in the tweet below:",
    "After the success of Army of the Dead on Netflix – which became one of its most-viewed original movies ever when it launched – it makes sense that the streamer wants to stay in business with the director. He attracts a massive audience of passionate followers, and he definitely has an approach as a creator that suits somewhere like Netflix.",
    "The flexibility in running time alone fits him quite well, as a director who's prone to long movies – and he seems to have the freedom to make the types of projects he wants to make. While Zack Snyder's Justice League suggested a world of superhero projects we'll never see come to fruition, having a break from comic books is probably no bad thing for the director."
  ],
  "headers": {
    "7": "Analysis: Netflix doubles down on Snyder"
  },
  "links": {
    "Army of the Dead": "https://www.techradar.com/news/army-of-the-dead-on-netflix-is-zack-snyders-best-movie-yet"
  }
}