{
  "source": "https://www.techradar.com/news/ea-confirms-it-isnt-done-with-making-star-wars-games",
  "title": "EA confirms it isn’t done with making Star Wars games",
  "category": "gaming",
  "updated": "2021-06-28T14:52:34Z",
  "author": "emma-boyle",
  "summary": "\"You should expect us to continue to invest in our Star Wars relationship.\"",
  "article": [
    "EA Games' exclusive license to make Star Wars games may be set to end, but that doesn’t mean it’s going to stop making them.",
    "In January 2021, Ubisoft and LucasFilm Games announced that they’re working on a new open world Star Wars game, effectively confirming the approaching end of EA’s long-running exclusive license to develop games based on the Star Wars franchise.",
    "In a recent earnings call (via Eurogamer), EA’s CEO Andrew Wilson reiterated the company’s position that the end of this exclusive license won't mean the end of Star Wars games from EA.",
    "“…I don’t think you should imagine that the fact that some other people will build some Star Wars games is going to change our commitment to that IP or our ability to build the appropriate number of games,” Wilson said, adding “You should expect us to continue to invest in our Star Wars relationship. It’s been very profitable… and we’re excited by what we’ll be able to do in the future. But you shouldn’t read this as necessarily us building the less titles.”",
    "Wilson added that EA will “continue to invest” in the franchises its created “as well as some new experiences across platforms for the future.”",
    "Given it was also revealed in the call that the publisher’s portfolio of Star Wars titles have sold in the millions and made it “over $3bn in net bookings”, it’s not entirely surprising that EA would want to continue making Star Wars games.",
    "Wilson’s words serve as a reiteration and elaboration on EA’s previous statement that it’s planning to produce more Star Wars games, in which it said “We are proud of our long-standing collaboration with Lucasfilm Games, which will continue for years to come\", adding \"We love Star Wars, and we look forward to creating more exciting experiences for players to enjoy.”",
    "It seems, then, that the future holds a lot more Star Wars games which can only be a good thing, right? Right?"
  ],
  "headers": {
    "4": "Not slowing down"
  },
  "links": {
    "announced": "https://www.techradar.com/news/ubisoft-is-making-a-star-wars-open-world-game-ending-eas-exclusivity",
    "earnings call": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1087657766936124200&xs=1&url=https%3A%2F%2Fwww.fool.com%2Fearnings%2Fcall-transcripts%2F2021%2F02%2F02%2Felectronic-arts-ea-q3-2021-earnings-call-transcrip%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fea-confirms-it-isnt-done-with-making-star-wars-games",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-02-03-ea-is-forging-ahead-with-star-wars-titles-despite-end-of-exclusivity-deal",
    "previous": "https://www.techradar.com/news/ubisoft-is-making-a-star-wars-open-world-game-ending-eas-exclusivity"
  }
}