{
  "source": "https://www.techradar.com/news/the-boys-is-getting-another-spin-off-and-it-lands-next-year",
  "title": "The Boys is getting another spin-off – and it lands next year",
  "category": "entertainment",
  "updated": "2021-12-06T09:50:23Z",
  "author": "tom-power",
  "summary": "The Boys: Diabolical is coming to Amazon Prime Video soon",
  "article": [
    "The Boys is getting another spin-off TV show on Amazon Prime Video – and it'll be released on the streamer in early 2022.",
    "Announced by The Boys star Karl Urban at CCXP Worlds 2021 on December 5, The Boys: Diabolical will be an animated anthology series that tells unique, standalone stories within the universe of the R-rated TV show.",
    "The series, which will debut sometime in the first half of 2022, will comprise eight episodes. And, to excite fans of The Boys even further, each entry has been written by big name actors and writers including Awkwafina (Shang-Chi), Justin Roiland (Rick & Morty) and The Boys' original co-creator Garth Ennis.",
    "Check out the official reveal below:",
    "The Boys: Diabolical is the second spin-off series that will expand on the world of Amazon's huge hit show. Back in September, we reported that Amazon Studios had greenlit an unnamed, young adult oriented series that is set to follow a group of young Supes as they attempt to graduate from the US' only exclusive college for superpowered beings.",
    "It's unclear if The Boys: Diabolical's eight stories will be set around the same time as the mainline show, or if they'll take place earlier in the show's timeline. Regardless, we do know that we'll be getting two entries in The Boys universe next year, with The Boys season 3 also expected to land on Amazon Prime in 2022.",
    "The Boys: Diabolical will be executively produced by The Boys showrunner Eric Kripke alongside Evan Goldberg and Seth Rogen, who also produce the live-action series. And, for fans of R-rated animated fare, Diabolical's showrunner is Simon Racioppa, who wrote and produced Amazon's animated Invincible TV series.",
    "There are plenty of tales that The Boys: Diabolical could cover.",
    "For one, there are a multitude of Supes and supervillains, from the comics and TV show, that Diabolical could focus on. Two that spring to mind immediately are Cindy and Love Sausage, who were part of The Boys season 2's supporting cast. Kripke has teased their involvement in season 3 but, if neither show up or have a large role in proceedings, we could see what happened to them between seasons. Or we could learn more about their backstories and how they acquired their powers.",
    "Speaking of backstories, Diabolical could also venture back to the past to see how Vought International was formed, or how Jensen Ackles' Soldier Boy became the first ever Supe. Again, we may get more details on both of these in season 3. But, if there's not much room to expand on either within the mainline series, an offshoot show would be the perfect place to explore them further.",
    "We might learn more about the history of The Boys themselves, such as how Billy, Mother's Milk and Frenchie came to know each other. Or, if Diabolical wants to play in this universe without following the show's main characters, it could introduce new heroes, villains and other people in standalone stories that have a fixed beginning, middle and end. Think of something like Disney Plus' Star Wars: Visions animated series, and you'll get the idea.",
    "Suffice to say, then, from a storytelling perspective, the possibilities are endless for The Boys: Diabolical. There are 72 comic book issues that it could draw inspiration from, as well as the potential to tell original tales with brand new characters that have been specifically created for the animated show.",
    "As long as it retains the satirical, gory and twisted aspects that have made The Boys such a big hit – and Diabolical is sure to do that – it's likely that we'll have another entry for our best Amazon Prime TV shows list very soon."
  ],
  "headers": {
    "7": "Analysis: what stories will Diabolical tell?"
  },
  "links": {
    "The Boys": "https://www.techradar.com/news/the-boys-season-3",
    "Amazon Prime Video": "https://www.techradar.com/reviews/amazon-prime-review",
    "Shang-Chi": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
    "Rick & Morty": "https://www.techradar.com/news/rick-and-morty-season-6",
    "we reported": "https://www.techradar.com/news/the-boys-is-getting-a-hunger-games-style-spin-off-show",
    "The Boys season 3": "https://www.techradar.com/news/the-boys-season-3",
    "Invincible": "https://www.techradar.com/news/invincible-season-2",
    "Star Wars: Visions": "https://www.techradar.com/news/star-wars-visions-looks-totally-different-and-thats-why-you-should-watch-it",
    "best Amazon Prime TV shows": "https://www.techradar.com/best/best-amazon-prime-shows"
  }
}