{
  "source": "https://www.techradar.com/news/qualcomm-latest-to-object-to-nvidia-arm-deal",
  "title": "Qualcomm latest to object to Nvidia-Arm deal",
  "category": "components",
  "updated": "2021-02-13T01:54:25Z",
  "author": "anthony-spadafora",
  "summary": "Acquisition could make it difficult for chipmakers to access Arm's IP",
  "article": [
    "Nvidia's $40bn proposed acquisition of the UK-based chip designer Arm has already come under scrutiny from regulators and now US chipmaker Qualcomm has weighed in on the deal.",
    "The company is against the acquisition and it recently voiced its concerns to the US Federal Trade Commission, the European Commission, the UK's Competition and Markets Authority and China's State Administration for Market Regulation. However, the Competition and Markets Authority as well as the European Commission have both already launched investigations into the matter.",
    "Meanwhile, the FTC's investigation has moved to a “second phase” and the regulator has asked SoftBank, Arm and Nvidia to provide more information on the deal, according to two sources that spoke with CNBC.",
    "Providing the information needed by the FTC will likely take some time as several large documents will need to be produced and the regulator will also ask other companies about the deal before making its decision.",
    "Qualcomm decided to contact regulators around the world regarding the Nvidia-Arm deal because it believes they will end up playing a significant role in whether or not it gets approved.",
    "However, in a statement to CNBC, Nvidia explained that it is confident regulators will come to see the benefits of the acquisition once their investigations are complete.",
    "Arm's chip designs are currently used in 95 percent of the world's smartphones and Qualcomm and other chipmakers worry that it will be much more difficult using the company's intellectual property if the acquisition ends up getting approved.",
    "Qualcomm isn't the only chipmaker objecting to the deal though as the AI chip startup Graphcore has also raised concerns with the UK's Competition and Markets Authority.",
    "We won't know if Nvidia will be able to acquire Arm until regulators finish their investigations and this process could certainly take some time due to the implications of allowing the GPU maker to acquire the chip designer.",
    "Via CNBC"
  ],
  "headers": {
    "4": "Qualcomm's objection"
  },
  "links": {
    "Arm": "https://www.techradar.com/news/new-arm-chip-could-give-your-ssd-superpowers",
    "Qualcomm": "https://www.techradar.com/news/qualcomm-appoints-cristiano-amon-as-ceo",
    "Competition and Markets Authority": "https://www.techradar.com/news/nvidia-arm-deal-under-investigaton-by-uk-watchdog",
    "European Commission": "https://www.techradar.com/news/eu-will-investigate-nvidia-takeover-of-arm",
    "Nvidia-Arm deal": "https://www.techradar.com/news/nvidia-buys-arm-in-dollar40-billion-deal",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "Graphcore": "https://www.techradar.com/news/this-tiny-uk-startup-chipmaker-targets-intel-and-nvidia-with-monster-ai-cpu",
    "GPU": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "CNBC": "https://www.cnbc.com/2021/02/12/qualcomm-objects-to-nvidias-40-billion-arm-acquisition.html"
  }
}