{
  "source": "https://www.techradar.com/news/running-zoom-on-chromebooks-is-about-to-get-a-whole-lot-smoother",
  "title": "Running Zoom on Chromebooks is about to get a whole lot smoother",
  "category": "computing",
  "updated": "2021-06-29T18:16:25Z",
  "author": "anthony-spadafora",
  "summary": "Zoom is now available as a PWA from Google Play",
  "article": [
    "Using video conferencing software on a Chromebook can be quite demanding which is why Zoom has announced that its launching a new progressive web app (PWA) designed specifically for Chrome OS.",
    "While Chromebook users have been able to run Zoom from their web browsers while working from home, the experience just doesn't match using the company's software on desktop as breakout rooms, audio in screen sharing and other features were missing.",
    "For this reason, Zoom has partnered with Google to create the best possible experience on Chrome OS through a new PWA client that adds even more features while also improving performance. Unlike traditional applications, PWAs are web apps that use the same technology found in your browser to deliver a faster experience though they also take up significantly less storage.",
    "As Zoom updates its web client, the company's new PWA will also receive updates automatically so that Chrome OS users will have access to all of the latest and greatest features.",
    "Zoom's new PWA will be available for download directly from the Google Play Store and will appear as an application on your Chromebook once installed. Users will also be able to install the new app directly from the navigation bar in their browser as well as via central admin management.",
    "The new PWA offers the same functionality as Zoom's Windows or Mac desktop apps including a customizable Gallery View on supported machines, breakout rooms, live transcription, live translation with assigned interpreters, a new background masking feature for enhanced privacy as well as hand raising and meeting reactions.",
    "Zoom plans to continually update its new PWA over the next three to six months to further accelerate what its video conferencing software can do on Chrome and the web.",
    "With the new school year just around the corner, the company's reimagined Chrome OS app will likely be welcomed by both teachers and students that rely on Chromebooks each day for both distance and in-person learning."
  ],
  "headers": {
    "4": "Zoom PWA"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "PWA": "https://www.techradar.com/news/google-starts-ditching-android-apps-in-favor-of-web-apps-on-chrome-os",
    "browser": "https://www.techradar.com/best/browser",
    "Gallery View": "https://www.techradar.com/news/zoom-is-bringing-a-whole-new-look-to-your-video-calls"
  }
}