{
  "source": "https://www.techradar.com/news/facebook-rumored-to-be-working-on-its-own-health-tracking-smartwatch",
  "title": "Facebook rumored to be working on its own health-tracking smartwatch",
  "category": "wearables",
  "updated": "2021-02-13T11:30:08Z",
  "author": "david-nield",
  "summary": "Another player in the smartwatch game",
  "article": [
    "Facebook has already dabbled in the world of hardware, releasing the Portal and buying up Oculus, and it looks as though another gadget is on the way: a new report claims that Facebook is busy working on a smartwatch ready to launch in 2022.",
    "The Information has some details on the planned device, though as yet there's been no official confirmation from Facebook that this is happening. The wearable will apparently focus on messaging and health, two of the most useful smartwatch features, and be available at close to cost price.",
    "The smartwatch is reportedly going to be powered with \"an open-source version\" of Android, much like the latest Oculus VR headsets – so Facebook would take the Android code that Google makes public and apply its own twist to it.",
    "Another detail revealed by The Information is that the smartwatch is going to have its own cellular connection, so you'll be able to make and receive calls without connecting to a smartphone. The watch should be compatible with both Android and iOS devices.",
    "As well as this smartwatch being scheduled to launch at some point in 2022, a follow-up is already said to be in the pipeline for 2023, so it seems Facebook is keen to commit to this new area of hardware development with a regular product release schedule.",
    "When it comes to those health and messaging features, the watch will of course connect to all of Facebook's various social products and messaging apps, and is reportedly going to support connections to health and fitness equipment like Peloton bikes too.",
    "Facebook has no doubt seen the success of the Apple Watch and decided that this is a market that it needs to be in as well. The two companies might also soon be competing against each other with their own smart glasses, if the rumors are to be believed.",
    "Considering that Facebook was interested in acquiring Fitbit before Google snapped it up, this isn't such a surprising move for the company as it looks to diversify beyond social networking. Watch this space for more details of the device in the coming months."
  ],
  "headers": {
    "4": "Ready to wearable"
  },
  "links": {
    "releasing the Portal": "https://www.techradar.com/reviews/facebook-portal-tv",
    "buying up Oculus": "https://www.techradar.com/news/oculus-may-soon-be-no-more-as-facebook-rebrands-its-vr-division",
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5927528178732894000&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Ffacebook-plans-smartwatch-with-focus-on-messaging-health&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ffacebook-rumored-to-be-working-on-its-own-health-tracking-smartwatch",
    "like Peloton bikes": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-6-review",
    "their own smart glasses": "https://www.techradar.com/news/this-facebook-smart-glasses-patent-shows-a-future-potential-apple-glass-rival",
    "Google snapped it up": "https://www.techradar.com/news/google-finalizes-fitbit-acquisition-despite-continuing-antitrust-investigations"
  }
}