{
  "source": "https://www.techradar.com/news/is-amazon-prime-day-the-right-time-to-buy-a-new-ipad-or-android-tablet",
  "title": "Is Amazon Prime Day the right time to buy a new iPad or Android tablet?",
  "category": "tablets",
  "updated": "2021-07-07T15:39:33Z",
  "author": "tom-bedford",
  "summary": "Or buy now, or wait longer?",
  "article": [
    "Amazon's annual Prime Day 2021 is almost upon us, kicking off on June 21 and lasting until June 22 (it's two days, despite the name). If you're considering buying a new iPad or Android tablet, you've probably saved the date in your calendar already.",
    "The Amazon Prime Day deals will likely bring moderate price cuts - think 10% to 25%, with some good deals exceeding that - to a big range of items. That includes tablets, but other pieces of kit you might buy too, like cases, styli or apps.",
    "If you've browsed our round-up of the best tablets, you likely have a certain slate in mind that you'd be interested in buying. But should you?",
    "Since there's very little time until Prime Day starts, if you're waiting to buy a new tablet or kit for one (or both), it's almost definitely astute to wait for the deals to begin. But there could be reasons to buy now, of course, or even reasons to wait longer to pick up your new kit.",
    "Below, we've shared a few choice deals from Amazon Prime Day 2020 in the US and UK.",
    "On a typical year, we'd predict Amazon's Prime Day deals by looking at previous years, but it's a little funny in this case. Prime Day 2020 didn't occur in its usual summer spot, thanks to Covid-19, and was instead a late-year affair.",
    "As a result, some tablets had been announced that wouldn't have been out in the summer of the year, and whose successors haven't been unveiled yet.",
    "So perhaps instead of seeing price cuts on newer versions of the devices below, we'll instead see further price cuts on those same tablets."
  ],
  "headers": {
    "4": "What iPad and Android tablet deals could we see?",
    "8": "Prime Day UK deals"
  },
  "links": {
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best tablets": "https://www.techradar.com/news/best-tablet"
  }
}