{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-leak-suggests-battery-life-wont-be-better-than-watch-3",
  "title": "Samsung Galaxy Watch 4 leak suggests battery life won’t be better than Watch 3",
  "category": "wearables",
  "updated": "2021-06-07T11:17:14Z",
  "author": "james-rogerson",
  "summary": "No change to the capacity",
  "article": [
    "One of the things we were hoping for from the Samsung Galaxy Watch 4 was better battery life, but it looks like we probably won’t get this, as a leak suggests there’s no change to the battery size.",
    "This comes from SGS Fimko (a Finnish certification agency) in a listing spotted by 91mobiles, which includes Samsung smartwatch model numbers SM-R865F and SM-R860 – both of which have previously been linked to the Samsung Galaxy Watch 4.",
    "According to the listing, the wearable has a 247mAh battery, which is exactly the same capacity as the 41mm Samsung Galaxy Watch 3. That suggests that we’re looking at the smaller model here, which could be 41mm again or 42mm. It also suggests that the larger model (probably either 45mm or 46mm) will have a 340mAh battery like the 45mm Galaxy Watch 3.",
    "So battery life may not be any better on these new models. In fact, it might even be slightly worse, given that rumors suggest the wearables will have marginally larger cases, and therefore probably larger screens.",
    "There is some hope though, as they might also have a powerful and efficient new chipset, which could reduce the battery drain. It’s also likely that the Samsung Galaxy Watch 4 will run an overhauled version of Wear OS rather than Tizen, which is sure to affect battery life for better or worse.",
    "Aside from the battery size, this certification listing also mentions 5W charging, which might sound slow, but considering how small smartwatch batteries are it should be enough to charge them reasonably quickly.",
    "While we’d take these details with a pinch of salt, certifications tend to be accurate, and right now there are no conflicting rumors. We’ll find out for sure how big the Samsung Galaxy Watch 4’s battery is – and how long-lasting the watch is – when the wearable launches, which it might do before the end of June."
  ],
  "headers": {
    "3": "Battery life could be better or worse"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "91mobiles": "https://www.91mobiles.com/hub/samsung-galaxy-watch-4-battery-fimko-certification/",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "or 42mm": "https://www.techradar.com/news/samsung-galaxy-watch-4-and-active-4-likely-to-land-soon",
    "a powerful and efficient new chipset": "https://www.techradar.com/news/samsung-galaxy-watch-active-4-could-be-a-very-powerful-smartwatch",
    "overhauled version of Wear OS": "https://www.techradar.com/news/samsung-galaxy-watch-4-wear-os-rumors-get-huge-new-hint-from-google-itself",
    "before the end of June": "https://www.techradar.com/news/expect-the-galaxy-watch-4-and-the-galaxy-watch-active-4-in-the-next-few-months"
  }
}