{
  "source": "https://www.techradar.com/news/microsofts-surface-duo-2-leaks-in-regulatory-documents-suggesting-an-imminent-launch",
  "title": "Microsoft’s Surface Duo 2 leaks in regulatory documents, suggesting an imminent launch",
  "category": "computing",
  "updated": "2021-09-20T18:22:49Z",
  "author": "allisa-james",
  "summary": "Microsoft’s unique phone could be getting a sequel",
  "article": [
    "Microsoft’s Surface September 22 event is right around the corner, and we might just see the Surface Duo 2, the sequel to Microsoft’s first Android phone, at the event, if a recently-released document from the US regulatory agency, the FCC, is anything to go by.",
    "The FCC document was spotted by Windows Central, pointing to recently published certification documents for the Android-based device. These documents were filed by Microsoft then approved and then released by the FCC on September 17. While we mostly expect to see laptops like the Surface Pro 8 at the event, the FCC filing describes a \"portable handset\", along with various mentions of \"flip and flat” features, and that the device has been tested for hearing aid use (required for digital wireless phones). Plus, the firmware number is in the same format as the original Surface Duo.",
    "These documents not only seem to confirm the Surface Duo 2’s existence, but that several features – including 5G, NFC, ultra-wideband (UWB) support, Wi-Fi 6, and “Wireless Power Transfer” support – have been approved already. In regards to wireless support, it could possibly indicate Qi wireless charging compatibility, though Windows Central suggests it could instead refer to inductive charging for the Surface Pen.",
    "The reason being is the Surface Duo 2 may be too thin to include the Qi coil or deal with all the heat generated from it. Windows Central instead proposes that the documents could be implying a pen charging mechanism similar to the Apple iPad’s inductive charging of its own Apple Pencil.",
    "Though expected through a leak earlier this year, this document doesn’t show the Surface Duo 2 featuring a triple rear camera. However, we won’t know what the device will actually look like until Microsoft actually comes out and reveals it – which may not even happen."
  ],
  "headers": {},
  "links": {
    "Microsoft’s Surface September 22 event": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6447243404188714000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fevent",
    "Surface Duo": "https://www.techradar.com/reviews/microsoft-surface-duo",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Windows Central": "https://www.windowscentral.com/surface-duo-2-fcc",
    "certification documents": "https://apps.fcc.gov/oetcf/eas/reports/ViewExhibitReport.cfm?mode=Exhibits&RequestTimeout=500&calledFromFrame=N&application_id=ZBCqX0Z47t7zHHJi40AiWQ%3D%3D&fcc_id=C3K1995",
    "Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "through a leak earlier this year": "https://www.techradar.com/news/microsoft-surface-duo-2-leak-reveals-much-required-camera-upgrade"
  }
}