{
  "source": "https://www.techradar.com/news/amazon-might-also-ditch-visa-credit-cards-in-the-us",
  "title": "Amazon might also ditch Visa credit cards in the US",
  "category": "computing",
  "updated": "2021-11-18T20:30:39Z",
  "author": "anthony-spadafora",
  "summary": "Ecommerce giant is considering dropping Visa as a partner on its co-branded credit card",
  "article": [
    "After announcing that it would stop accepting Visa-issued credit cards in the UK, Amazon is now considering ending its partnership with the company on its co-branded credit card in the US.",
    "According to a new report from Reuters, the ecommerce giant is currently in talks with Visa, Mastercard and American Express to review its co-branded credit card agreements.",
    "If you shop on Amazon's ecommerce platform frequently, you've likely seen promotions for its Amazon Prime Rewards Visa Signature Card at checkout with the offer of a $200 Amazon Gift Card upon approval. In addition to its co-branded card with Visa, the company also has a partnership with American Express for its Amazon Business Prime American Express Card which offers a $125 Amazon Gift Card upon approval instead.",
    "An Amazon spokesperson described these talks with the three big credit card companies to Reuters as part of its standard process for reviewing its co-branded credit card agreements.",
    "Credit card processing fees typically range between 1.5 to 3.5 percent of each transaction and these surcharges can make it difficult for Amazon and other online retailers as well as small businesses to offer their goods and services at a cheaper price to consumers.",
    "In response to increasingly high fees from Visa, Amazon recently introduced surcharges on customers using Visa credit cards in both Singapore and Australia. Meanwhile in the UK, Visa began charging 1.5 percent of the transaction value for credit card payments made online or over the phone between the UK and EU. This is because an EU-enforced cap on fees charged by credit card issuers is no longer in place in the UK following Brexit.",
    "While retailers have previously had to deal with processing charges from credit card firms to gain access to their huge networks of users, this could be changing as shown by Amazon's current negotiations with Visa, American Express and Mastercard. Although the ecommerce giant could be planning to launch its own payments system, it also might be using the massive size of its customer base to get a better deal from credit card companies when it comes to transaction fees.",
    "We'll have to wait and see how negotiations between Amazon and Visa play out but for the time being, you'll still be able to use your Visa credit card when shopping for Black Friday and Cyber Monday deals on its platform.",
    "We've also featured the best payment gateways, best credit card processing services and best ecommerce hosting",
    "Via Reuters"
  ],
  "headers": {
    "4": "Rising credit card surcharges"
  },
  "links": {
    "credit cards": "https://www.techradar.com/best/best-credit-card-processing-service",
    "Amazon": "https://www.techradar.com/news/amazon-will-soon-stop-accepting-uk-visa-credit-cards",
    "new report": "https://www.reuters.com/world/uk/amazon-stop-accepting-visa-credit-cards-britain-2021-11-17/",
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Visa credit cards": "https://www.techradar.com/news/some-visa-credit-cards-will-soon-support-cryptocurrency-transactions",
    "Brexit": "https://www.techradar.com/news/uk-hatches-plan-to-retain-fintech-crown-following-brexit",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best payment gateways": "https://www.techradar.com/best/best-payment-gateways",
    "best credit card processing services": "https://www.techradar.com/best/best-credit-card-processing-service",
    "best ecommerce hosting": "https://www.techradar.com/news/best-ecommerce-hosting",
    "Reuters": "https://www.reuters.com/world/uk/amazon-stop-accepting-visa-credit-cards-britain-2021-11-17/"
  }
}