{
  "source": "https://www.techradar.com/news/check-out-chromes-upgraded-picture-in-picture-mode",
  "title": "Check out Chrome's upgraded picture-in-picture mode",
  "category": "computing",
  "updated": "2021-05-04T11:54:55Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Google gives picture-in-picture a video call-friendly update",
  "article": [
    "Google is making an important change to Chrome picture-in-picture mode that will make life easier for anyone who spends time making video calls from the browser.",
    "Think of picture-in-picture and you're likely to think of watching a YouTube video in a small floating window while you continue to browse the web, but with a future update, Google is bringing a number of options to the feature that are specific to the video calls and online meetings that we've all come so familiar with during lockdown.",
    "If you're a user of Chrome's existing picture-in-picture function, you'll be aware that the controls available are very limited. In fact, all you are able to do it pause and unpause the current video, or switch back to the originating tab. In an upcoming change, however, it will be possible to control your microphone and webcam during video calls.",
    "The controls that Google is adding are a little limited, but they're a big improvement on what's currently available. Specifically, there are controls to mute and unmute the microphone, toggle your webcam on and off, and to hang up from the current video call.",
    "You can sit back and wait for the feature to arrive in your browser if you are the patient type, or you can be proactive and gain access to it right now. If this second option sounds more appealing, just make sure that you have at least Chrome 91 installed and use the following steps:",
    "You can then pay a visit to this Video Conferencing / Media Session Sample page to try things out. Click the Open camera button and then enable picture-in-picture mode, and you should see the new microphone toggle, camera toggle and hang up buttons.",
    "Unfortunately, the feature does not yet appear to available to everyone, even using this method of force-enabling it. So even if you are super impatient, you may have no choice but to wait a little longer to try out this great feature for yourself.",
    "Via Techdows"
  ],
  "headers": {
    "4": "Sneaky peek"
  },
  "links": {
    "video calls": "https://www.techradar.com/how-to/book-some-face-time-how-to-use-your-phone-to-stay-in-touch-with-family",
    "microphone": "https://www.techradar.com/best/the-best-usb-microphones-2020-the-best-standalone-mics-you-can-buy-today",
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "this Video Conferencing / Media Session Sample page": "https://googlechrome.github.io/samples/media-session/video-conferencing.html",
    "Techdows": "https://techdows.com/2021/05/sneak-peek-at-video-calls-support-in-chrome-picture-in-picture-mode.html"
  }
}