{
  "source": "https://www.techradar.com/news/how-to-watch-ted-lasso-season-2-online-stream-the-apple-tv-plus-series-now",
  "title": "How to watch Ted Lasso season 2 online: stream the Apple TV Plus series now",
  "category": "computing",
  "updated": "2021-07-23T05:01:38Z",
  "author": "daniel-pateman",
  "summary": "The award-winning comedy returns for its second season",
  "article": [
    "The acclaimed Ted Lasso is back for its second season. Spearheaded by a multi-award-winning turn from Jason Sudeikis, get ready for another charm offensive as we detail how to watch Ted Lasso season 2 online now with a subscription to Apple TV Plus.",
    "Developed from a character created for NBC to promote Premier League coverage, Ted Lasso is an American coach initially inexperienced in association football, but hired in the hope he’ll ruin AFC Richmond’s chances of success. His excellent interpersonal skills and emphasis on teamwork, however, end up winning him both matches and admirers – eventually anyway.",
    "*Potential season 1 spoilers below*",
    "Season 1 ended on a rather bittersweet note. AFC Richmond were relegated and Ted experienced panic attacks brought on by the collapse of his marriage. But strong bonds and new friendships were formed in the process. Club owner Rebecca Walton (Hannah Waddingham) is now emotionally invested in Ted and the team’s promotion to the Premier League, while “Nate the Great” (Nick Mohammed, Intelligence) is gaining in confidence after being promoted from kit-man (and team punching bag) to assistant coach.",
    "Joining the main cast this season is Sarah Niles as Dr Sharon Fieldstone, a sports psychologist drafted in to address the team’s anxiety after a seven-game drawing streak, and we’ll get a glimpse of Ted’s trash-talking alter-ego “Led Tasso” too. Plus, there’ll be a greater focus on supporting characters like exuberant star player Dani Rojas (Cristo Fernández) and Nigerian right back Sam Obisanya (Toheeb Jimoh).",
    "Ted Lasso’s sophomore season lands deftly in the back of the net. So, get ready to cheer as we break down how to watch Ted Lasso season 2 online from anywhere now.",
    "While Apple's answer to Netflix has a comparatively tiny library of films and shows to get stuck into – 60 and counting – what's available is top-notch, well-produced fare with little in the way of filler.",
    "The service's launch calling card was The Morning Show, a drama starring Jennifer Aniston, Reese Witherspoon, and Steve Carell, which was complemented by See - an epic sci-fi drama starring Jason Momoa and Alfre Woodard, as well as M. Night Shyamalan’s horror series, Servant.",
    "The service's surprise big breakout show has been, of course, the Jason Sudeikis comedy Ted Lasso, following the titular American football coach hired to manage a Premier League football team. It's earned an army of fans and a impressive amount of awards attention, netting 20 Primetime Emmy nominations this year – a record for a freshman series.",
    "The small but great library is set to grow at a steady pace - alongside new seasons of Ted Lasso and The Morning Show, Apple TV Plus looks to have a pretty strong-looking upcoming schedule of new exclusive content.",
    "The Martin Scorsese-directed Killers of the Flower Moon, promises a 'large-scale Western' that stars big guns Leonardo DiCaprio and Robert De Niro.",
    "The Shrink Next Door, meanwhile, is a new comedy series based on the 2019 podcast of the same name, that is set to bring together Will Ferrell and Paul Rudd, while Foundation is a much-anticipated sci-fi series based on the books by Isaac Asimov, and starring Chernobyl's Jared Harris and Lee Pace.",
    "Read more:"
  ],
  "headers": {
    "6": "What else should I know about Apple TV Plus?"
  },
  "links": {
    "Apple TV Plus": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9712215433903999000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fapple-tv-plus%2F",
    "The Morning Show": "https://www.techradar.com/news/season-2-of-apple-tv-plus-flagship-show-finally-has-a-release-date",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know"
  }
}