{
  "source": "https://www.techradar.com/news/ios-15-beta-may-take-the-green-flare-effects-off-your-iphone-12-photos",
  "title": "iOS 15 beta may take the green flare effects off your iPhone 12 photos",
  "category": "phones",
  "updated": "2021-08-05T06:25:10Z",
  "author": "david-lumb",
  "summary": "Green dots showing up in your iPhone photos? iOS 15 beta may fix that",
  "article": [
    "Notice those green lens flares in your iPhone 12 photos? The recently-released iOS 15 beta 4 might fix that with some post-processing magic, according to a report by 9to5Mac.",
    "Reddit user u/Doubleluckstur posted a comparison shot between an initial raw image with a small green lens flare on the left side (hidden by a button when viewed in a web browser, so open it in a new tab), and the final, processed one.",
    "Or just look at the side-by-side as tweeted by camera app Halide, which helpfully reversed the order such that the unprocessed (with green flare) photo comes first, and the processed photo is second.",
    "But don’t take the Reddit thread discussion’s word for it. The Verge also confirmed that the iOS 15 beta 4 does indeed seem to wipe the green flare dots from existence. You’ll still see them in the viewfinder, of course, but after taking a photo, the green dots should disappear.",
    "Note that the initial Reddit photo and The Verge’s investigation are finding these flare effects while shooting photos of the sun, but other examples have seen the green dots persist when moving over certain surfaces like trees or mesh, as Redditor -DementedAvenger- posted in a reply to the initial photo.",
    "Moreover, that Redditor also posted a photo demonstrating their iPhone didn’t eliminate green flares from indoor images – a result TechRadar also found repeatedly when performing own own tests. Sun flares seem to be easier to wipe away than those produced by interior lighting.",
    "But not all iPhones running the iOS 15 beta 4 may see the benefit: Redditors noticed that the iPhone XS and newer phones were the only ones to see the green dots disappear – perhaps due to the A12 Bionic and newer chipsets processing the flares away.",
    "From the moment the iOS 15 public beta was released, it was easy to see the new features that debuted in the first version of the operating system preview. Like the developer betas, the public betas arrive in numbered updates, adding a few more perks and features with each one.",
    "So it’s not surprising that the current one – iOS 15 public beta 4 – is introducing new features, even quiet ones like removing green flares. What is surprising is that we didn’t know it was coming. Apple teased plenty of improvements and new perks coming in the iPhone’s next big operating system update at WWDC 2021 in June, but mentioned no specific camera improvements.",
    "Which means we can expect more of these little tweaks in the iOS 15 public beta versions to come – though we’ll certainly benefit from eagle-eyed Redditors and other enthusiasts to point out the more subtle improvements coming in each new update."
  ],
  "headers": {
    "7": "Analysis: Unforeseen features of iOS 15 beta 4"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "9to5Mac": "https://9to5mac.com/2021/08/04/ios-15-can-auto-remove-lens-flares-in-photos/#disqus_thread",
    "posted": "https://www.reddit.com/r/iOSBeta/comments/oxc3a6/ios_15_beta_4_the_camera_app_now_autoremoves_lens/h7lopz8/?utm_source=share&utm_medium=web2x&context=3",
    "tweeted": "https://twitter.com/halidecamera/status/1422866812304334851",
    "The Verge": "https://www.theverge.com/2021/8/4/22610190/ios-15-beta-4-green-lens-flare-photos-processing-computation",
    "photo": "https://www.reddit.com/r/iOSBeta/comments/oxc3a6/ios_15_beta_4_the_camera_app_now_autoremoves_lens/h7lopz8/?utm_source=share&utm_medium=web2x&context=3",
    "easy to see": "https://www.techradar.com/news/weve-used-ios-15-public-beta-for-a-day-and-its-already-better-than-ios-14"
  }
}