{
  "source": "https://www.techradar.com/news/cant-wait-for-diablo-4-get-your-fix-with-this-tabletop-dandd-tristram-map",
  "title": "Can't wait for Diablo 4? Get your fix with this tabletop D&D Tristram map",
  "category": "gaming",
  "updated": "2021-06-09T10:05:10Z",
  "author": "gerald-lynch",
  "summary": "Bring the hack-and-slash locale to your gaming nights",
  "article": [
    "You’ve delved deep into the dungeons of Tristram before, but if the wait for Diablo 4 and Diablo 2: Resurrected is proving too hellish, why not bring the hack-and-slash action to your tabletop?",
    "The CozyMaps Patreon page is offering up a lovingly-crafted map from the original Diablo game, ready to be rolled into your Dungeons and Dragons role-playing campaigns. Less-click-to-kill and more roll-to-thrill.",
    "It’s an atmospherically drawn top-down take on one of Diablo’s most famous locations, the embattled town of Tristram – and the first location many Diablo players will encounter in the video games.",
    "You can grab it for free here (the map was originally made as a commission), but if you subscribe to the CozyFans Patreon, you can also unlock the following “important” add-ons:",
    "With BlizzCon 2021 canceled, and developer Blizzard not traditionally having much of a presence at the E3 (let alone this year’s weird online E3 2021 showcase), it could be some time until we find out more about Diablo 4. So any fresh way to tap into that rich, hellish game world is appreciated.",
    "Not to say that Diablo fans won’t have things to look forward to this year. Diablo 2: Resurrected, the flashy remake of the series’ highpoint, is due out before the end of 2021, and looked like a faithful and fun re-imagining of the game by our early access play time. It’s due to feature cross-platform progression on PS4, PS5, Xbox One, Xbox Series X/S, PC and Nintendo Switch, too.",
    "And Diablo will be landing on an all-new platform in the shape of Diablo Immortal for mobile phones too, ready to take on the many Diablo clones littering the Android and iPhone app stores. It got a rocky reception when first revealed, but is now looking rather good indeed. It too is expected before the end of the year."
  ],
  "headers": {
    "4": "Getting a Diablo fix any way you can"
  },
  "links": {
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "Diablo 2: Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "CozyMaps Patreon page": "https://www.patreon.com/CozyMaps",
    "grab it for free here": "https://i.redd.it/v4rarydz2z371.jpg",
    "BlizzCon 2021 canceled": "https://www.techradar.com/news/blizzcon-canceled-gaming-convention-joins-list-of-tech-conferences-dropped-due-to-pandemic",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "a faithful and fun re-imagining": "https://www.techradar.com/news/playing-diablo-2-resurrected-makes-me-want-diablo-4-more-than-ever",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series X/S": "https://www.techradar.com/news/xbox-series-x-vs-xbox-series-s-which-xbox-will-be-right-for-you",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Diablo Immortal": "https://www.techradar.com/news/diablo-immortal-release-date-news-trailers-phones",
    "looking rather good indeed": "https://www.techradar.com/news/ive-played-diablo-immortal-how-blizzards-dark-action-rpg-plays-on-smartphones"
  }
}