{
  "source": "https://www.techradar.com/news/a-new-red-and-blue-mario-nintendo-switch-console-is-coming-very-soon",
  "title": "The new Nintendo Switch Mario Red and Blue console is now available to pre-order",
  "category": "gaming",
  "updated": "2021-01-20T11:11:02Z",
  "author": "adam-vjestica",
  "summary": "That's one spicy-looking console",
  "article": [
    "Nintendo has unveiled a new Nintendo Switch Mario Red and Blue Edition console, and it’s as fetching as you might expect.",
    "The special edition hardware will be available at select retailers on February 12, and will be sold for a suggested retail price of $299.99 (£279.99/AU$399). While no games are included, you do get a snazzy carrying case to protect your console while you’re on the move.",
    "Strangely, the console itself is actually exclusively red, with black face buttons. The Nintendo Switch dock is also red, with the blue element only being found on one side of the carrying case, on the Joy-Con controller straps, and when using the Joy-Con Grip.",
    "Still, this is another attractive special edition Nintendo Switch console, and it joins the likes of the Animal Crossing: New Horizons console and Fortnite Switch bundle, both of which were in high demand during Black Friday 2020.",
    "It's available to pre-order from the Nintendo Store for £279.99 in the UK, with various bundles available.",
    "The new console ties in with Nintendo’s ongoing Super Mario Bros. 35th anniversary celebrations, which have seen the company release Super Mario 3D All-Stars. That collection includes Super Mario 64, Super Mario Sunshine and Super Mario Galaxy, but it's only available until March 31st.",
    "Super Mario 3D World + Bowser’s Fury, a re-release of the Wii U game with additional content, continues the plumbing hero’s anniversary shindig, and you can check out a new trailer below. The game arrives on Nintendo Switch on February 12, the same day as the new Nintendo Switch Mario Red and Blue console.",
    "Nintendo Switch continues to be one of the most popular devices, and with games such as Breath of the Wild 2 and Metroid Prime 4 still to come, there's plenty of life left in Nintendo's hybrid console.",
    "But will we see a Nintendo Switch 2 now that the PS5 and Xbox Series X are here? Nintendo is pretty good at keeping things under wraps, but we'll be on the look out for any new details."
  ],
  "headers": {
    "5": "It's-a him again"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Animal Crossing: New Horizons": "https://www.techradar.com/news/this-animal-crossing-switch-console-is-probably-the-cutest-yet",
    "Fortnite Switch": "https://www.techradar.com/news/sorry-parents-nintendo-and-epic-are-making-a-fortnite-themed-nintendo-switch",
    "Black Friday 2020": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "for £279.99": "https://www.awin1.com/awclick.php?awinmid=12777&awinaffid=103504&clickref=trd-us-1139480495869569800&p=https%3A%2F%2Fstore.nintendo.co.uk%2Fnintendo-switch%2Fconsoles.list",
    "Super Mario 3D All-Stars": "https://www.techradar.com/reviews/super-mario-3d-all-stars",
    "Super Mario 3D World + Bowser’s Fury": "https://www.techradar.com/news/nintendo-switch-is-getting-super-mario-64-sunshine-and-galaxy-as-well-as-a-mario-battle-royale",
    "Wii U": "https://www.techradar.com/news/nintendo-switch-continues-to-be-a-slap-in-the-face-to-all-wii-u-owners",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Metroid Prime 4": "https://www.techradar.com/news/metroid-prime-4",
    "Nintendo Switch 2": "https://www.techradar.com/news/nintendo-switch-2",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}