{
  "source": "https://www.techradar.com/news/three-new-xiaomi-phones-are-here-with-super-fast-charging-and-low-prices",
  "title": "Three new Xiaomi phones are here with super-fast charging and low prices",
  "category": "phones",
  "updated": "2021-09-15T13:00:09Z",
  "author": "tom-bedford",
  "summary": "Companions to the Xiaomi Mi 11",
  "article": [
    "Just one day after the iPhone 13 launch, Xiaomi has shown the world its new collection of smartphones, with the debut of the Xiaomi 11T series - though that's not all that showed up at the unveiling event.",
    "The Xiaomi 11T and 11T Pro are two new members of the Xiaomi Mi 11 line - note the lack of the 'Mi' in the newer phones, as the company opted to drop this label - which sit below the Mi 11 but above the Xiaomi Mi 11 Lite 5G. There's also another take on that budget phone in the form of the Xiaomi 11 Lite 5G NE (New Edition), which has barely any changes from the original.",
    "Alongside those phones there's the Xiaomi Pad 5, an Android tablet that rivals the new iPad (2021) which you can read more about here, an NFC and Amazon Alexa-toting version of the Xiaomi Mi Band 6, and a new smart projector.",
    "The Xiaomi 11T series are the star devices of this launch though, and the two mid-range Android phones could end up on quite a few Christmas lists or Black Friday phone deal baskets.",
    "Just so you know, we've actually already tested the top-end phone of the new line, and you can check out our Xiaomi 11T Pro review to see how it fares.",
    "The two new phones both have 6.67-inch FHD+ screens with 120Hz refresh rates. Unlike the one on the Mi 11, these displays are flat. The phone bodies are fairly standard for a smartphone, with a volume rocker, USB-C port and slim camera bump, but we found the side-mounted fingerprint sensor on the Pro was wonderfully responsive.",
    "Both phones have a 108MP main camera joined by an 8MP ultra-wide snapper and a 5MP telemacro shooter. The last of those is the same as the Mi 11's, and we found that one of the best macro phone cameras on the market, as it was fantastic for taking close-up snaps of small subjects. We also found on the 11T Pro that selfies looked great.",
    "The Xiaomi 11T has a MediaTek Dimensity 1200 chipset, which is pretty powerful - though the Snapdragon 888 on the Pro provides more processing power, an overheating issue means it might actually be worse in some use cases.",
    "That's the first of three differences between the phones. The second is in charging speed, as while both devices have 5,000mAh batteries, the Pro gets a whopping 120W fast charging. That powers the device to full in under 17 minutes, and is a really useful feature, even though the standard phone's 67W powering still beats most of the competition.",
    "Finally, the phones are priced slightly differently. The standard model starts at £499 (about $690, AU$940) while the Pro starts at £599 (roughly $830, AU$1,130), both for 8GB of RAM and 128GB of storage, and we're waiting on pricing for other regions.",
    "We're waiting to test the Xiaomi 11T before we decide on which phone is better, or where either sits in the company's hierarchy, but judging by our time with the Pro, both will be solid Android devices with prices to rival the Samsung Galaxy S21 FE and OnePlus 9T if they show up in your region."
  ],
  "headers": {
    "4": "What you need to know about the Xiaomi 11T"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 11 Lite 5G": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "Xiaomi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "new iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "read more about here": "https://www.techradar.com/news/forget-the-new-ipad-the-xiaomi-pad-5-tablet-could-be-way-better-for-students-on-a-budget",
    "Xiaomi Mi Band 6": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-6",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Black Friday phone deal": "https://www.techradar.com/black-friday/black-friday-phone-deals-2021",
    "Xiaomi 11T Pro review": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled"
  }
}