{
  "source": "https://www.techradar.com/news/intel-looks-to-supercharge-facial-recognition-with-new-realsense-id-platform",
  "title": "Intel looks to supercharge facial recognition with new RealSense ID platform",
  "category": "computing",
  "updated": "2021-01-07T10:54:57Z",
  "author": "barclay-ballard",
  "summary": "Anti-spoofing technology prevents false entry attempts",
  "article": [
    "Intel has unveiled a new on-device facial recognition solution that could improve security for a host of applications, including smart locks, point-of-sale systems, and more. RealSense ID is the latest addition to the company’s RealSense range, products that are designed to give depth perception capabilities to other devices.",
    "RealSense ID combines an active depth sensor with a specialized neural network to deliver secure, accurate facial authentication. The technology also promises to be easy to use, with no network setup required.",
    "The platform even promises to adapt as users change over time, continuing to work effectively even as individuals adjust their appearance, changing their facial hair or glasses, for example.",
    "“Intel RealSense ID combines purpose-built hardware and software with a dedicated neural network designed to deliver a secure facial authentication platform that users can trust,” Sagi Ben Moshe, Intel corporate vice president and general manager of Emerging Growth and Incubation, commented.",
    "Intel claims that its new facial authentication technology is an important release given that businesses and individuals are moving away from traditional authentication methods that may be more vulnerable to identity theft and security breaches.",
    "Intel RealSense ID comes equipped with anti-spoofing technology to safeguard against false entry attempts and boasts an impressive one-in-a-million false acceptance rate.",
    "What’s more, Intel has carried out extensive data collection on all ethnicities, investing time and money to help eliminate the kind of racial and gender biases that often plague facial recognition technologies.",
    "Intel’s RealSense ID is scheduled for launch in the first quarter of 2021 and will retail at $99.",
    "Via VentureBeat"
  ],
  "headers": {
    "4": "Anti-spoofing tech"
  },
  "links": {
    "commented": "https://newsroom.intel.com/news/introducing-intel-realsense-id-facial-authentication/#gs.pyzjoo",
    "VentureBeat": "https://venturebeat.com/2021/01/06/intel-launches-realsense-id-for-on-device-facial-recognition/"
  }
}