{
  "source": "https://www.techradar.com/news/some-chrome-and-edge-users-will-be-blocked-from-seeing-their-browser-source-code",
  "title": "Some Chrome and Edge users will be blocked from seeing their browser source code",
  "category": "computing",
  "updated": "2021-11-12T12:26:02Z",
  "author": "mike-moore",
  "summary": "Only a small number of Chrome and Edge users will be affected",
  "article": [
    "IT administrators will soon have the power to block access to a web page's source code for some users of the world's top browsers.",
    "Both Google Chrome and Microsoft Edge will be introducing the feature, which looks to fix a longstanding bug in the Chromium source code that could let users view restricted URLs.",
    "However the change won't affect all users, but instead mainly devices bought and owned by education enterprises such as schools, colleges and universities.",
    "The change, reported by 9to5Google, will also affect users of Chrome Enterprise, and looks to fix a long-standing issue troubling educational users and admins alike.",
    "Users have long been able to view the source code of a webpage by tapping CTRL+U, or right-clicking anywhere on a page and selecting \"View page source\". Although this can be useful for developers, code-heads or just the curious, reports have claimed that doing so on some educational exam sites can sometimes reveal test answers, especially when using Google Forms.",
    "Now, Microsoft says it has come up with a fix that it says can stop the option to view a page's source code if a particular website is on an organization’s blocklist.",
    "The fix can also block the ability to view source code entirely if desired, and when paired with a separate existing policy, can also stop the use of Chrome DevTools entirely.",
    "The change probably won't be seen publicly for some time, as it has only just been added to the Chromium source code, but future versions of Edge and Chrome could well introduce source code-blocking features within the next few product release windows.",
    "However it's likely that the feature will only be present in highly-controlled use cases, such as education, for now.",
    "The news could boost Microsoft Edge's user base in educational establishments, increasing its rising market share. Recent data has shown that Edge is beginning to establish a lead over great rival Firefox, holding 3.99% of the market - meaning the browser’s share has increased by roughly a third since this time last year.",
    "These are the best student laptops around today"
  ],
  "headers": {
    "3": "Code block"
  },
  "links": {
    "browsers": "https://www.techradar.com/best/browser",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "9to5Google": "https://9to5google.com/2021/11/11/chrome-edge-admin-policy-block-page-source-code-edu/",
    "rising market share": "https://www.techradar.com/news/browser-wars-microsoft-edge-is-steaming-away-from-an-established-rival",
    "best student laptops": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385"
  }
}