{
  "source": "https://www.techradar.com/news/renaults-super-cute-retro-inspired-electric-vehicle-gets-a-release-date-and-a-price-tag",
  "title": "Renault's super cute, retro-inspired electric vehicle gets a release date – and a price tag",
  "category": "car-tech",
  "updated": "2021-06-30T14:46:09Z",
  "author": "axel-metz",
  "summary": "Talk about bold",
  "article": [
    "Renault has confirmed that its striking electric concept vehicle, the Renault 5 EV, will enter production as part of the brand's push to bring 10 new battery-powered cars to market by 2025.",
    "The French automaker officially announced the electric vehicle (EV) earlier this year, but only recently confirmed – at the company's online ElectroPop event – that it will be manufactured with a view to hitting the road in 2024.",
    "The Renault 5 EV will use the company's new powertrain technology, which is made up of nickel, manganese and cobalt-based batteries that Renault boss Luca de Meo says will allow the car to retail for around 33% less than the Renault Zoe.",
    "With a starting price of £27,505 (around €30,000), the Renault Zoe is currently the most popular electric passenger vehicle in Europe, so knocking a third off that figure could see the Renault 5 retail for around £18,500 (around €21,000).",
    "Renault's new EV will also boast a range of approximately 248 miles (400km), which could see it become the affordable electric run-around to rival – or succeed – the Zoe.",
    "The car will arrive alongside a redesigned version of the Renault 4 supermini, called the 4ever, with both EVs forming a key part of the company's push for 30% of its sales to be of electric vehicles by 2025.",
    "Perhaps the most exciting aspect of the Renault 5, though, is its unconventional appearance.",
    "Remember that Flash game, with the little yellow car you drive around an exceptionally poorly-rendered urban sprawl? Well, the Renault 5 looks a lot like that (we've stuck a picture of the sim below for those old enough to have no idea what we’re talking about).",
    "Renault says the 5 takes styling and design inspiration from the brand's classic R5 model, which preceded the Clio and was produced from 1972 to 1996.",
    "The car apparently \"embodies modernity\" and will be a \"vehicle relevant to its time: urban, electric, attractive,\" according to Renault's new design director, Gilles Vidal.",
    "Urban? Definitely. Electric? Obviously. Attractive? We'll let you be the judge. It's certainly unique, which is a breath of fresh air from the ultra-futuristic minimalism we've seen from other big-name EVs like the Polestar 2 or Volvo C40 Recharge.",
    "In any case, for a fraction of the price of the mega-popular Renault Zoe, we've no doubt the company's latest electric gambit will win over plenty of drivers come its 2024 release."
  ],
  "headers": {
    "6": "Old school futurism"
  },
  "links": {
    "ElectroPop event": "https://www.press.renault.co.uk/en-gb/releases/2879",
    "Renault Zoe": "https://www.techradar.com/news/renault-zoe",
    "most popular electric passenger vehicle": "https://en.media.renaultgroup.com/news/renault-leader-of-ev-sales-in-europe-9c0d-989c5.html",
    "Polestar 2": "https://www.techradar.com/news/polestar-2-review",
    "Volvo C40 Recharge": "https://www.techradar.com/news/the-new-volvo-c40-electric-car-has-a-260-mile-range-that-will-increase-with-updates"
  }
}