{
  "source": "https://www.techradar.com/news/rtx-3080-might-get-even-harder-to-find-in-stock-heres-what-to-buy-instead",
  "title": "RTX 3080 might get even harder to find in stock – here's what to buy instead",
  "category": "computing",
  "updated": "2021-09-03T19:48:21Z",
  "author": "john-loeffler",
  "summary": "New rumors claims new Nvidia GPU supply might drop 30%",
  "article": [
    "It might be about to get even harder than it already is to find a new Nvidia RTX 30-series graphics card in stock, if recent rumors out of Asia are any indication. Should we even care at this point?",
    "A recent report by our colleagues over at PC Gamer says that a post to the semi-reliable Bo Bantang message board that the September supply of the latest Nvidia GPUs is going to be about 30% lower than expected.",
    "This is pretty much in line with what we've seen lately as it relates to the rise in prices for the best graphics cards from AMD and Nvidia. Prices are a reflection of both supply and demand, and recent price increases point to a possible tightening of supply.",
    "As PCGamer rightfully asks, does it even matter at this point since no one can get a graphics card anyway?",
    "Finding the latest graphics cards from Nvidia is about to become even harder than before if these new rumors are right. Even the best cheap graphics cards are scarce thanks to the recent boom in cryptomining.",
    "So let's assume for a second that you are most likely upgrading from a Nvidia GTX-era graphics card, since a lot of people were priced out of the Turing-era RTX cards when they launched and the pressure to make the jump from an RTX 2060 to an RTX 3060 isn't as strong as making the jump from a GTX 1660 Super.",
    "Chances are you're going to need a new power supply as well. Given the increasing markups on third party graphics cards we're seeing, you might end up spending over $1,000/£1,000/AU$1,500 on just these components alone.",
    "Look, we're PC gamers, too – we're even running PC Gaming Week 2021 right now to celebrate that fact – so we definitely get it. But you know what also costs about that same amount of money? Some of the best gaming laptops on the market right now.",
    "And sure, a Razer Blade 14 is going to be way more expensive than just upgrading to an RTX 3080 (if you can find one), but an MSI Pulse GL66 or a Lenovo Legion 5 Pro are in the same ballpark or just a little bit higher, and come with some extra perks as well like higher refresh screens and a degree of portability that your underperforming gaming rig can't match.",
    "Heck, you can even a free up some desk space and just plug your new gaming laptop into your monitor and you can still enjoy your gaming space like you've always done, just now with a good deal more power than you had before. Best of all, you can actually buy a gaming laptop right now.",
    "At this point, by the time graphics card supply and pricing normalizes, we'll probably be into the Nvidia Lovelace-era, so rather than stress out about whether you can get an RTX 3080, you can just get back to enjoying the best PC games out there right now, which should be the whole point anyway."
  ],
  "headers": {
    "4": "Analysis: just buy a new gaming laptop instead"
  },
  "links": {
    "PC Gamer": "https://www.pcgamer.com/nvidia-gpu-supply-drop-rumour/",
    "rise in prices": "https://www.techradar.com/news/gpu-prices-back-on-the-upswing-indicating-stock-issues-not-going-anywhere",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "AMD and Nvidia": "https://www.techradar.com/news/computing-components/graphics-cards/amd-vs-nvidia-who-makes-the-best-graphics-cards-699480",
    "best cheap graphics cards": "https://www.techradar.com/news/best-cheap-graphics-cards-2020-the-top-graphics-cards-on-a-budget",
    "GTX 1660 Super": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super",
    "power supply": "https://www.techradar.com/news/computing-components/upgrades/how-to-install-a-power-supply-906753",
    "PC Gaming Week 2021": "https://www.techradar.com/news/welcome-to-techradars-pc-gaming-week-2021",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Razer Blade 14": "https://www.techradar.com/reviews/razer-blade-14",
    "MSI Pulse GL66": "https://www.techradar.com/reviews/msi-pulse-gl66",
    "Lenovo Legion 5 Pro": "https://www.techradar.com/reviews/lenovo-legion-5-pro",
    "Nvidia Lovelace": "https://www.techradar.com/news/nvidias-ampere-successor-lovelace-could-arrive-soon"
  }
}