{
  "source": "https://www.techradar.com/news/apple-watch-7-clones-show-off-this-years-major-redesign",
  "title": "Apple Watch 7 clones show off this year's major redesign",
  "category": "wearables",
  "updated": "2021-08-28T11:00:29Z",
  "author": "david-nield",
  "summary": "They're cheap copies, but they're worth a look",
  "article": [
    "If you're keen to get a sneak preview of the Apple Watch 7 redesign before its expected launch in September, then the cheap clones now being pushed out by Chinese manufacturers are worth a look.",
    "As shared by well-known leaker @MajinBuOfficial, the copies show off the bigger, flatter form factor that has been widely tipped for Apple's flagship wearable in 2021 – even if they're nowhere near as good as the real thing.",
    "While these cut-price clones don't confirm the design of the next Apple Watch, they've presumably been put together using information from Apple's supply chain – and they do match up with the leaked renders we've seen up to this point.",
    "In a significant shift, Apple seems to be changing the aesthetic of its smartwatch to more closely match the look of the iPhone 12 and the most recent iPad Pro models: flatter edges and corners that make the front of the device more distinct from the sides.",
    "It's a design we've seen several times now, which makes us more confident that it is actually in the pipeline – even if Apple itself hasn't confirmed what the successor to the Apple Watch 6 is going to look like, or when it will come out.",
    "From what we've heard so far, the Apple Watch 7 will be available in two case sizes, but they'll both be a millimeter larger than previously – so 41mm and 45mm respectively. We should find out for sure in the next month or two.",
    "The stylish design of the Apple Watch is one of the reasons it's such a popular device – the compact size, the elegant curves, and the usual excellent Apple build quality mean it looks and feels like a superior product.",
    "However, the wearable hasn't really changed much in terms of its appearance since it made its appearance in 2015, which means a revamp is now due. From what we've seen up to this point, it would seem Apple has managed to pull it off quite nicely.",
    "When you're weighing up the renders that have leaked so far, bear in mind that these aren't put together by Apple – and so the genuine articles will look more impressive and have that special sheen that Apple manages to work into its hardware.",
    "Changing the look of an iconic gadget like the Apple Watch is a risk – but it's one Apple had to take to keep the smartwatch fresh and interesting. It makes a lot of sense to have the device fall into line with the phones and tablets that Apple makes.",
    "Via AppleInsider"
  ],
  "headers": {
    "3": "Seeing is believing",
    "6": "Opinion: the Apple Watch is due a redesign"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "@MajinBuOfficial": "https://twitter.com/MajinBuOfficial/status/1431237012154195970",
    "leaked renders": "https://www.techradar.com/news/apple-watch-7-renders-show-that-it-might-be-inspired-by-the-iphone-12",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "several times": "https://www.techradar.com/news/see-this-apple-watch-7-leak-with-a-wild-looking-flat-edged-design",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "heard so far": "https://www.techradar.com/news/apple-watch-7-is-likely-to-be-big-but-that-might-not-be-a-good-thing",
    "leaked so far": "https://www.techradar.com/news/apple-watch-7-could-be-the-biggest-apple-watch-yet",
    "AppleInsider": "https://appleinsider.com/articles/21/08/27/apple-watch-series-7-clones-surface-in-china"
  }
}