{
  "source": "https://www.techradar.com/news/rokus-youtube-tv-ban-may-have-a-workaround-heres-how-to-use-it",
  "title": "Roku's YouTube TV ban may have a workaround – here's how to use it",
  "category": "televisions",
  "updated": "2021-05-10T09:04:21Z",
  "author": "henry-st-leger",
  "summary": "You won't get rid of YouTube TV that easily",
  "article": [
    "If you own a Roku TV or Roku streaming stick, you may have noticed that the YouTube TV app is no longer available on the Roku platform for new users – though Google appears to be rolling out a solution.",
    "In an official YouTube blog post on May 7, Google announced that the regular YouTube app would now contain a shortcut to the YouTube TV service, allowing it to still be accessible on the Roku OS:",
    "\"Today, we’re introducing a new feature that gives you access to YouTube TV from within the YouTube app, making it easier to enjoy all the content you love. Existing members can easily access YouTube TV by clicking on 'Go to YouTube TV' in the main YouTube app. This update will be available to all YouTube TV members on Roku over the next few days, and we will expand to as many devices as we can over time.\"",
    "The paid-for YouTube TV service is distinct from the free-to-use YouTube streaming platform, essentially offering an online-only cable TV alternative with over 70 channels. It's found on a host of 4K TVs these days, meaning any non-Roku TV owners won't be affected, and it's worth noting that existing YouTube TV subscribers won't have any trouble continuing to use the app. Newcomers to YouTube TV, though, will need to use this loophole through Google TV.",
    "The blog post also states that Google is \"still working to come to an agreement with Roku to ensure continued access to YouTube TV for our mutual customers,\" and that the \"certification process\" that Roku took issue with \"exists to ensure a consistent and high-quality YouTube experience across different devices, including Google’s own – so you know how to navigate the app and what to expect. We'll continue our conversations with Roku on certification, in good faith, with the goal of advocating for our mutual customers.\"",
    "The tussle between the two companies became public in late April, with Roku announcing the possible removal of the YouTube TV app from its operating system in the US, after taking issue with Google's demands for continued hosting for the app (Google acquired YouTube back in 2006).",
    "Roku argues that \"Google is attempting to use its YouTube monopoly position to force Roku into accepting predatory, anti-competitive and discriminatory terms that will directly harm Roku and our users\" (via Axios). These terms reportedly included favorable weighting towards YouTube-hosted music in results for voice search, more prominent placement of YouTube search results, and even the removal of competing search results while the YouTube app is open on a Roku device.",
    "The Roku platform is found on huge swathes of streaming devices today, from the Roku Express and Roku Streaming Stick+ to Hisense Roku TVs and the TCL 6-Series smart TV – meaning that any disagreement affect a huge number of devices and their users. Google's latest announcement appears to mitigate that impact, but it's clear that its tussle with Roku is not yet over."
  ],
  "headers": {
    "5": "Out in the open"
  },
  "links": {
    "streaming stick": "https://www.techradar.com/best/streaming-device",
    "YouTube TV": "https://www.techradar.com/news/youtube-tv-everything-you-need-to-know-about-the-new-tv-streaming-service",
    "YouTube blog post": "https://blog.youtube/news-and-events/next-steps-youtube-tv-members-roku/",
    "feature": "https://support.google.com/youtubetv/answer/7452153#open_yttv_inside_yt_app",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Axios": "https://www.axios.com/roku-google-youtube-tv-dispute-525316c1-4d66-44e3-a96a-40db7b10e05b.html?utm_campaign=organic&utm_medium=socialshare",
    "Roku Express": "https://www.techradar.com/reviews/roku-express",
    "Roku Streaming Stick+": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Hisense Roku TV": "https://www.techradar.com/reviews/hisense-roku-tv-r50b7120uk",
    "TCL 6-Series": "https://www.techradar.com/reviews/tcl-6-series-r615-r617",
    "smart TV": "https://www.techradar.com/news/best-tv"
  }
}