{
  "source": "https://www.techradar.com/news/canons-new-concept-camera-could-be-beneficial-to-your-health",
  "title": "Canon's new concept camera could be beneficial to your health",
  "category": "cameras",
  "updated": "2021-02-26T11:09:33Z",
  "author": "rhys-wood",
  "summary": "It knows when you are slouching",
  "article": [
    "Canon has revealed a rather curious concept for a camera that just might perk you up, literally. The Posture Fit, as it's being called in concept, would help users maintain a healthy seated position while sitting at their desk.",
    "The Canon Posture Fit detects if you're sitting down at the desk it's placed on, where it will perk up and keep an eye on your seating habits. After sixty minutes, the device will remind you to stand up and take a quick break should you need it.",
    "The device also warns you if you're slumping into a bad posture for too long, sending a reminder to correct your seating position to avoid causing stiffness or pain. At the end of the day, users can check their posture stats via an app that can be connected to the Canon Posture Fit.",
    "It's a rare day that we can call a camera 'cute', but that seems accurate when describing the Canon Posture Fit. The little device's rotund shape and small monitor makes it look like an egg-shaped Among Us character.",
    "The long-term side effects of bad posture are well-documented, and for people working from home, such effects are at risk of being expedited. As a result, the Canon Posture Fit, if developed, could help to alleviate bad posture habits for many.",
    "In the concept video, the designer emphasized Canon's use of what it calls \"empathic design\", a family-friendly approach to designing hardware that softens the feeling of the user being watched. A more traditional camera design might give that impression, giving a valid reason for the Canon Posture Fit's toy-like look.",
    "It's important to note that the Canon Posture Fit is only a concept, and there's no guarantee the device will ever go to market. However, it's easy to see the benefits of having one on your desk. Maintaining a healthy posture is vital for those who work full-time desk jobs, especially now that many of us are working from home."
  ],
  "headers": {
    "3": "Imposture"
  },
  "links": {
    "Canon": "https://www.techradar.com/news/best-canon-camera",
    "Among Us": "https://www.techradar.com/news/among-us-mobile-game",
    "well-documented": "https://health.usnews.com/wellness/slideshows/10-ways-poor-posture-can-harm-your-health"
  }
}