{
  "source": "https://www.techradar.com/news/amd-and-nvidia-gpu-stock-is-reportedly-recovering-and-prices-could-come-down-fast",
  "title": "AMD and Nvidia GPU stock is reportedly recovering – and prices could come down fast",
  "category": "computing",
  "updated": "2021-06-22T09:33:53Z",
  "author": "darren-allan",
  "summary": "German graphics card market offers up some very positive signs",
  "article": [
    "Graphics card stock levels are improving, and exorbitant prices, sparked by huge demand and scalpers, are starting to drop fast – particularly in the case of Nvidia’s GPUs, according to a new report.",
    "German tech site 3DCenter has taken another snapshot of the graphics card market in its home country, and it’s an excitingly optimistic overview – well, relative to how the situation has been so far this year in terms of GPU availability.",
    "3DCenter observes that the price of Nvidia’s current-gen Ampere graphics cards has dropped a long way at German retailers, off the back of much better availability for these GPUs.",
    "The site observes much better stock levels across the whole RTX 3000 series in Germany with one exception, namely the RTX 3060 Ti which is apparently still suffering.",
    "Pricing for these Nvidia cards was treble (yes, three times) the recommended asking price in May, the report observes, and that has sunk to a 91% increase in June, or nearly double. So yes, in relative terms pricing is still massively inflated, but it’s dropping very fast – and obviously if this continues, the overall picture could come much closer to normal levels before too long.",
    "Fingers crossed, of course, and with all the usual caveats about this being based around a single set of figures in one territory, and there being only so much we can read into that.",
    "AMD, on the other hand, hasn’t been faring so well, with Team Red’s graphics cards struggling to make the same kind of headway, although some models have moved in a positive direction. The good news is that the average of all this is still a drop in pricing for AMD though, as RX 6000 series GPUs peaked at 114% over the recommended list price in May, and that has now receded to 81% up in June (though it did drop to 77% right at the end of May, so technically, June has witnessed a small uptick since then).",
    "3DCenter’s figures show AMD is apparently struggling to ship enough RX 6800 and 6800 XT models, and therefore the RX 6700 XT pricing isn’t getting the same downward pressure that Nvidia’s higher-end Ampere models being more available and coming down in price exerts on Team Green’s lesser GPUs.",
    "That said, the RX 6700 XT is still one of the better performing of AMD’s RDNA 2-powered cards with prices pegged at 67% or more above the recommended price, but the biggest relative pricing drop has occurred with the flagship RX 6900 XT GPU which stands at 59% or more.",
    "As 3DCenter points out, at the moment there appears to be a pretty heated race between German retailers, undercutting each other with pricing to ensure that the greater amounts of inventory of current-gen graphics cards now coming through are sold before prices fall even further. That said, the steep falls currently being seen will slow down at some point, naturally, but we can only hope that price normalization continues at a decent pace.",
    "While this is obviously a snapshot of the German market, it should reflect more broadly on the overall availability of GPUs in other regions – and the prospect of increasing stock levels of graphics cards on a global level is backed up by recent moves in China.",
    "As you may have seen, GPU demand on the crypto front has been seriously affected thanks to crashing cryptocurrency prices of late, as well as by China’s crackdown on miners, which has now extended to the Sichuan region. The latter development is reportedly already having an effect on graphics card prices in China – which have fallen a long way – but also in Australia, where stock levels are purportedly starting to get back to pre-pandemic levels (and prices have come down a bit too).",
    "There are an increasing number of reasons to be optimistic around these massively inflated GPU prices correcting, then, but for the time being, more ‘reasonable’ pricing is sadly just a relative term, and price tags remain well above the recommended levels (which aren’t particularly affordable in themselves, at least for mid or higher-tier models).",
    "Via Wccftech"
  ],
  "headers": {
    "9": "Heated race"
  },
  "links": {
    "Graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Nvidia’s GPUs": "https://www.techradar.com/news/nvidia-geforce",
    "3DCenter": "https://www.3dcenter.org/news/hardware-und-nachrichten-links-des-1920-juni-2021",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "AMD’s RDNA 2-powered cards": "https://www.techradar.com/news/amd-big-navi",
    "GPU demand on the crypto front": "https://www.techradar.com/news/cant-buy-a-new-gpu-blame-cryptominers-who-bought-25-of-them",
    "but also in Australia": "https://www.techradar.com/news/china-crypto-mining-crackdown-could-give-you-a-better-chance-of-getting-a-new-rtx-3080",
    "Wccftech": "https://wccftech.com/amd-nvidia-graphics-card-prices-returning-to-normal-as-gpu-supply-availability-continues-to-improve/"
  }
}