{
  "source": "https://www.techradar.com/news/google-chrome-finally-gives-users-a-free-pdf-editor",
  "title": "Google Chrome finally gives users a free PDF editor",
  "category": "computing",
  "updated": "2021-12-01T21:02:05Z",
  "author": "mike-moore",
  "summary": "New Chrome PDF extension is available now",
  "article": [
    "After years of waiting and frustration, a free PDF editor is finally coming to Google Chrome thanks to Adobe.",
    "The software giant has announced a new Adobe Chrome extension that gives users what it calls \"the most comprehensive set of PDF tools right in the browser.\"",
    "The release means users will no longer need to download a standalone version of Acrobat or other tool to access PDF files online.",
    "Also available on Microsoft Edge, the new Adobe Acrobat PDF tools solve a major headache for users everywhere, allowing a much smoother way to view and edit PDF documents directly in the browser.",
    "This includes being able to download and share a PDF with others for group review and feedback without needing to send an attachment.",
    "Users will now be able to quickly add comments, highlights or drawings to PDF files in their browser window using a dropdown pane. The update also means users can e-sign documents without needing to download extra tools, and quickly fill out forms manually or using pre-fill information.",
    "The extension will also allow users to rotate, delete, or reorder PDF pages to optimise viewing and printing, transform a PDF to a Microsoft Word document and retain formatting",
    "You'll also be able to convert web pages into PDF, preserving layout, formatting, and links - saving major headaches for users everywhere.",
    "Accessing and using PDF files on Microsoft Edge has been a work in progress for some time as the browser looks to solve long-standing user issues.",
    "However the browser recently announced a new feature that will allow users to pick off from where they left off with a PDF file, whether that's reading, editing or collaborating.",
    "The new continuity feature means that you'll be able to quit a PDF file or browser tab completely, but when re-visiting the file, Edge will take you right back to where you were - with no fiddly endless scrolling required.",
    "Microsoft Edge is also set to trial a new one-click \"save as PDF\" feature in its Context Menu, allowing faster and hopefully more accurate PDF saving with just one action.",
    "And the browsers is also looking to make editing PDFs easier with another new feature that will allow you to add text to the document without using a third-party application."
  ],
  "headers": {
    "3": "Chrome PDF"
  },
  "links": {
    "free PDF editor": "https://www.techradar.combest/free-pdf-editor",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "browser": "https://www.techradar.com/best/browser",
    "PDF files": "https://www.techradar.com/best/best-pdf-reader-for-mac",
    "pick off from where they left off with a PDF file": "https://www.techradar.com/news/microsoft-edge-is-fixing-one-of-the-most-annoying-parts-of-pdfs",
    "one-click \"save as PDF\"": "https://www.techradar.com/news/microsoft-edge-will-now-make-it-easier-to-save-pages-as-a-pdf"
  }
}