{
  "source": "https://www.techradar.com/news/the-playstation-showcase-was-a-feast-for-marvel-fans-but-what-about-everyone-else",
  "title": "The PlayStation Showcase was a feast for Marvel fans, but what about everyone else?",
  "category": "gaming",
  "updated": "2021-09-10T18:31:47Z",
  "author": "vic-hood",
  "summary": "Opinion: GTA fans may have been left disappointed",
  "article": [
    "The PlayStation Showcase was a surprise treat for Marvel fans like myself. Between the reveal of Marvel’s Spider-Man 2 and the surprise announcement of Marvel’s Wolverine, it’s clear that the future looks bright for Marvel on PS5 - and busy for Insomniac Games.",
    "It wasn’t just Insomniac’s upcoming offerings that stole the show. We finally got our first proper look at God of War: Ragnarok, a teaser trailer for the long-rumored Star Wars: Knights of the Old Republic Remake and a release window for both action RPG Forspoken and Gran Turismo 7. So while 2021 may have been light when it comes to standout PS5 games, Sony seems to have plenty up its sleeve to keep PS5 players happy.",
    "But while there were plenty of standout games shown at the showcase, there were plenty that seemed to simply take up air time - and some which were just downright disappointing.",
    "Insomniac Games has picked up the Marvel games torch and is running with it full pelt. Following the release of the critically acclaimed Marvel’s Spider-Man and Spider-Man: Miles Morales, it’s no surprise that we’re seeing a Spider-Man sequel - or that Marvel has now trusted the developer to create a standalone game on another of its most popular characters.",
    "Marvel’s Spider-Man 2 was rumored to be in the pipeline, but I didn’t expect it to see it at the PlayStation Showcase - or to be so excited about it. The next Spider-Man game sees Peter Parker and Miles Morales teaming up, though it’s unclear right now if you’ll play as both or just one of the Spider-Men. But perhaps the most exciting aspect of the sequel, at least for me, is that it will see infamous villain Venom (voiced by none other than Candyman’s Tony Todd) serving as an adversary. The trailer also seems to tease that Kraven the Hunter will make an appearance in the sequel too.",
    "While details on Spider-Man 2 remain thin on the ground for now, and we won’t get our hands on it until 2023 - barring delays - I have full faith that Insomniac will pull off a hat trick. Insomniac Games has paced its rolling out of its own Spider-Man universe, introducing both Peter and Miles in their own stories before bringing them together to battle one of the most recognizable superhero villains of all time.",
    "And both Marvel and Sony seem to have that same level of faith as perhaps the biggest surprise of the night was the announcement of Marvel’s Wolverine game, also being developed by Insomniac Games. We don’t know a whole lot about the Wolverine game at this point but the teaser trailer suggests it will be somewhat darker than we’ve seen from Insomniac before - and I can’t wait.",
    "While Marvel's Spider-Man and Miles Morales are critically acclaimed, there's no denying they're pretty family-friendly - after all, Spider-Man himself is your \"friendly neighborhood Spidey\". But Wolverine isn't all sunshine and rainbows, his backstory and character are actually pretty dark. I’m hoping that Insomniac explores that side of James “Logan” Howlett in the Wolverine game, offering a more mature experience than Spider-Man did.",
    "With Insomniac Games now working on more than one Marvel title for PS5, I’m hoping that we could see a Marvel Game Universe in the future. In my opinion, it could work pretty well. Like with the MCU, Insomniac has created standalone products allowing us to get to know individual superheroes within its universe, if we continue to see more Marvel heroes getting their own games, could we potentially see crossovers in the future? We're hoping so as Crystal Dynamic's Marvel's Avengers certainly left a lot to be desired.",
    "Speaking of leaving a lot to be desired, the PlayStation Showcase also gave us another trailer for Marvel’s Guardians of the Galaxy, which is releasing on October 26. While the previous marketing for Guardians of the Galaxy hasn’t exactly grabbed my attention - Square Enix’s Avengers has already burnt me - it almost felt unfair to feature it in a showcase along with Insomniac’s Marvel games.",
    "Sony certainly crammed a lot into its 40-minute event but Insomniac Games wasn’t the only one holding the wildcard at the PlayStation Showcase. As expected, Sony Santa Monica finally revealed God of War: Ragnarok, the sequel to the God of War (2018) reboot, and the first look certainly didn’t disappoint.",
    "Ragnarok looks to be set several years after the events of its predecessor. Both Kratos and his son Atreus are older (with Atreus seemingly going through that angsty teen phase we all did), but tensions are high between the father and son as Ragnarok closes in. The three-minute trailer gave us a look at the sequel’s new environments, combat abilities and characters, including the huge Tyr (aka the Norse God of War). But we’ll also see the return of beloved characters such as Mimir, Brok, Freya and Sindri.",
    "It was certainly enough to get me - and the internet - hyped, especially as images of further characters have rolled out since the event - including Thor (played by Ryan Hearst, aka Opie from Sons of Anarchy) that’s set to give Chris Hemsworth a run for his money.",
    "But while Spider-Man 2, God of War: Ragnarok and Wolverine all garnered (arguably) the biggest buzz online, there was still plenty for those unphased by heroes and Gods. We got our best look yet at Gran Turismo 7, which we now know is releasing in March 2022, another gameplay trailer for the enchanting Forspoken, which looks like it could be a dark horse when it releases in \"Spring 2022\", and confirmation that the Uncharted: Legacy of Thieves collection (combining Uncharted 4 and Lost Legacy) is coming to both PS5 and PC. There was even something for lovers of wholesome indies, with a trailer for adorable tropical adventure Tchica.",
    "While there were plenty of standouts from the PlayStation Showcase, there were also plenty of duds. In addition to the several minutes taken up by an advert for PlayStation itself at the start of the 40-minute showcase, I also couldn't help but feel that other precious minutes of the showcase were wasted on games that didn't really need another trailer: I'm looking at you Deathloop, Guardians of the Galaxy and Rainbow Six Extraction.",
    "But the most disappointing game featured during the showcase was GTA 5 on PS5. Not only was it revealed that GTA 5 and GTA Online for PS5 and Xbox Series X have been delayed from November until March 2022, but the trailer was a waste of a few minutes. It didn't tell us about the new features or enhancements, nor did it let us see them in action. Really it just felt like a trailer to announce the delay, which could have been done in an online post.",
    "Despite the disappointment of GTA 5, the PlayStation Showcase was a roaring success by TechRadar's standard - delivering some real surprises and plenty to look forward to in the coming years."
  ],
  "headers": {
    "3": "A super showcase",
    "10": "A different kind of hero",
    "14": "Not all winners"
  },
  "links": {
    "PlayStation Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "Marvel’s Spider-Man 2": "https://www.techradar.com/news/marvels-spider-man-2",
    "Marvel’s Wolverine": "https://www.techradar.com/news/marvels-wolverine",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Star Wars: Knights of the Old Republic Remake": "https://www.techradar.com/news/knights-of-the-old-republic-remake",
    "Forspoken": "https://www.techradar.com/news/forspoken-release-date-trailers-news-and-rumors",
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
    "Marvel’s Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Marvel’s Guardians of the Galaxy": "https://www.techradar.com/reviews/marvels-guardians-of-the-galaxy",
    "God of War (2018) reboot": "https://www.techradar.com/news/god-of-war-review",
    "images": "https://www.gamesradar.com/god-of-war-ragnarok-character-designs-show-off-ryan-hursts-beefy-thor/",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "Rainbow Six Extraction": "https://www.techradar.com/news/rainbow-six-extraction",
    "GTA 5 on PS5": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x"
  }
}