{
  "source": "https://www.techradar.com/news/henry-cavill-teases-possible-mass-effect-related-project-on-instagram",
  "title": "Henry Cavill teases possible Mass Effect-related project on Instagram",
  "category": "gaming",
  "updated": "2021-02-25T01:06:16.690Z",
  "author": "stephen-lambrechts",
  "summary": "Or maybe he's just trolling us",
  "article": [
    "As the star of Netflix's The Witcher, and a well-known PC gaming enthusiast in his own right, actor Henry Cavill has a tendency of sending fans' hearts aflutter at the mere hint of his involvement in a gaming-related project.",
    "That's exactly what has happened with Cavill's latest Instagram post, in which the Superman actor teases his involvement with yet another beloved video game franchise: EA and BioWare's Mass Effect series.",
    "Cavill's Instagram post shows an image of the actor holding pages with text printed on them, which is accompanied by a mysterious message: \"Secret project? Or just a handful of paper with random words on it.... Guess you'll have to wait and see.\"",
    "While the text itself is out of focus, the fine people at Gamepressure managed to clear some of the text up by running it through Focus Magic, which is able to recover detail in blurred images.",
    "By doing this, they were able to extract several words which are very specific to the Mass Effect universe, including \"Cerberus,\" \"Tali'Zorah,\" and \"geth\".",
    "Upon closer inspection, the site was able to determine that the printed text on Cavill's pages came from the plot section of Mass Effect 3's Wikipedia page:",
    "\"Following the events on Tuchanka and a failed coup by Cerberus to take over the Citadel, the quarians offer their support to the Alliance if Shepard helps them reclaim their homeworld, Rannoch, from the geth. Assisted by a quarian, either Tali'Zorah or Admiral Daro'Xen, Shepard boards a geth dreadnought and rescues a captive geth unit, either Legion or a facsimile occupied by a geth virtual intelligence (VI), then disables the Reaper control signal over the geth. Shepard then locates and destroys a Reaper base on Rannoch, which gives the quarians an opportunity to attack the vulnerable geth. However, the allied geth unit reveals that it intends to sacrifice itself in order to upgrade the geth using Reaper technology, which will enable the geth to achieve true sentience and free will, making them capable of defeating the quarians. Either Shepard negotiates a ceasefire to gain support from both sides, or is forced to support one side, which results in the other being completely annihilated.\"",
    "At present, there's no way of knowing whether Mr. Cavill is indeed working on something Mass Effect-related or if he's just having fun with fans.",
    "That said, the timing of the post may suggest that the actor is involved with the upcoming release of Mass Effect Legendary Edition, perhaps in a promotional or voiceover capacity.",
    "Of course, there's also the possibility that Cavill might be boning up on the series' lore for another reason – could the actor be up for a role in the upcoming Mass Effect sequel that was announced late last year?",
    "Wild speculation, sure, but isn't that exactly the kind of thing Cavill was after with his cryptic Instagram post? Like the actor said in his post, we'll just have to wait and see."
  ],
  "headers": {
    "7": "Oh Henry"
  },
  "links": {
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "PC gaming enthusiast": "https://www.techradar.com/news/henry-cavill-flexes-his-pc-building-muscles-in-sexy-instagram-vid",
    "Gamepressure": "https://www.gamepressure.com/newsroom/henry-cavill-reads-mass-effect-suggests-a-secret-project/z02e09",
    "Focus Magic": "https://www.focusmagic.com/",
    "Mass Effect 3's Wikipedia page": "https://en.wikipedia.org/wiki/Mass_Effect_3#Plot",
    "upcoming Mass Effect sequel": "https://www.techradar.com/news/the-new-mass-effect-trailer-could-be-the-first-sign-of-a-true-mass-effect-4"
  }
}