{
  "source": "https://www.techradar.com/news/ikea-email-systems-bombarded-by-phishing-attacks",
  "title": "Ikea email systems bombarded by phishing attacks",
  "category": "computing",
  "updated": "2021-11-29T15:05:30Z",
  "author": "mayank-sharma",
  "summary": "Ikea issues guidance to staff on how to spot malicious email",
  "article": [
    "Ikea is reportedly reeling under an ongoing cyberattack perpetrated through phishing emails sent via compromised Microsoft Exchange servers.",
    "According to BleepingComputer, the homeware giany is alerting its employees of the campaign conducted through the classic reply-all email chain attack.",
    "\"There is an ongoing cyber-attack that is targeting Inter Ikea mailboxes. Other Ikea organizations, suppliers, and business partners are compromised by the same attack and are further spreading malicious emails to persons in Inter Ikea,\" reads the internal email sent to Ikea employees as seen by BleepingComputer.",
    "The email goes on to explain the modalities of the reply-all email attack, noting that phishing emails can come from co-workers, or from a third-party, in the form of a reply to an already ongoing conversation.",
    "A recent investigation into the recent SquirrelWaffle malware campaign by cybersecurity experts revealed that attackers have begun using compromised internal email servers that were attacked using a chain of both ProxyLogon and ProxyShell exploits to add legitimacy to the reply-chain email attack.",
    "Researchers at TrendMicro discovered that after compromising the unpatched servers, the attackers hijack internal email chains to add malicious links in legitimate messages.",
    "This makes the attacks difficult to detect, which is something Ikea has also shared with its employees.",
    "Furthermore, while sharing an example of a fraudulent message, Ikea tells its employees that the malicious emails contain links with seven digits at the end. Once spotted the recipients are asked to report the email to Ikea’s IT department immediately.",
    "Shield yourself online with these best identity theft protection services, and ensure your computers are protected with these best endpoint protection tools"
  ],
  "headers": {
    "4": "Hijacking internal servers"
  },
  "links": {
    "Ikea": "https://www.techradar.com/reviews/ikea-tradfri-wireless-control-outlet",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "compromised Microsoft Exchange servers": "https://www.techradar.com/news/microsoft-urges-exchange-admins-to-patch-their-on-prem-servers-now",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/ikea-email-systems-hit-by-ongoing-cyberattack/",
    "reply-all email chain attack": "https://www.techradar.com/news/microsoft-wants-to-end-reply-all-email-chains",
    "A recent investigation": "https://www.techradar.com/news/compromised-microsoft-exchange-servers-lend-legitimacy-to-malicious-reply-all-chain",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "email servers": "https://www.techradar.com/news/best-email-hosting-providers",
    "ProxyLogon": "https://www.techradar.com/news/chinese-hackers-target-microsoft-exchange-email-servers-to-launch-attacks",
    "ProxyShell": "https://www.techradar.com/news/nasty-new-malware-targets-microsoft-exchange-servers",
    "TrendMicro": "https://www.techradar.com/reviews/trend-micro-2020-antivirus-solutions",
    "best identity theft protection services": "https://www.techradar.com/best/best-identity-theft-protection",
    "best endpoint protection tools": "https://www.techradar.com/news/best-endpoint-security-software"
  }
}