{
  "source": "https://www.techradar.com/news/newegg-introduces-new-lottery-system-for-scarce-ps5s-rtx-3080s-and-more",
  "title": "Newegg introduces new lottery system for scarce PS5s, RTX 3080s, and more",
  "category": "computing",
  "updated": "2021-01-21T20:48:37Z",
  "author": "john-loeffler",
  "summary": "All hail the RNG",
  "article": [
    "Online retailer Newegg, a popular destination for computing component and system buyers, debuted a new system to get the latest CPUs, GPUs, and consoles into the hands of their customers: the Newegg Shuffle, a lottery-based checkout system for scarce, in-demand products.",
    "The link to the Newegg Shuffle, flagged by PCMag, brings you to a page where a current \"Shuffle\" of products like the AMD Ryzen 5900X, Nvidia GeForce RTX 3080 graphics cards, or consoles like the PS5.",
    "You can select the product you want while the event is active and when the three-hour-long event ends, Newegg draws participants names at random, giving them the opportunity to purchase their item within two hours of being notified by email (or through a Newegg app notification).",
    "Originally, it looked as if products like GPUs would have to be purchased as a bundle along with a compatible motherboard, but Newegg is selling both bundles and individual products, depending on the Shuffle.",
    "The pandemic has caused an almost perfect storm of scarcity for some of the latest computer components and game consoles. Extended lockdowns forcing people inside have led to soaring interest in gaming and gaming systems.",
    "Meanwhile, the pandemic has also stressed supply lines and manufacturers, making it harder for supply to keep up with demand.",
    "Finally, whether its the economy or just plain evil, profiteers have unleashed an army of bots that can complete dozens of purchases before a human consumer can even get through one, gobbling up the available supply in order to turn around and resell on third-party sites like eBay for twice the retail price – or more.",
    "Retailers are trying to find ways to outsmart these bad actors, and Newegg's Shuffle is one way of going about it. How it stops that same army of bots from simply using spoofed or burner email addresses and overwhelming the lottery system remains to be seen, but it's something at least."
  ],
  "headers": {
    "4": "Well, it's ONE solution to the problem of bots and profiteers"
  },
  "links": {
    "PCMag": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-6485411020261316000&murl=https%3A%2F%2Fwww.newegg.com%2Fproduct-shuffle%3Fcm_sp%3Dshuffle_entrance-_-PDP_button",
    "AMD Ryzen 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}