{
  "source": "https://www.techradar.com/news/bioshock-4-everything-we-know-about-the-new-bioshock",
  "title": "BioShock 4: everything we know about the new BioShock",
  "category": "gaming",
  "updated": "2021-12-06T17:03:16Z",
  "author": "vic-hood",
  "summary": "What can we expect from BioShock 4?",
  "article": [
    "BioShock 4 is the unofficial title for the new BioShock game that's been officially confirmed by games publisher 2K Games and its new studio Cloud Chamber Studios as being in development.",
    "We first heard about BioShock 4 back in 2019. The official announcement followed months of rumors that the game was in development and had been for some time. But 2K games has made it clear that the next BioShock will be “in development for the next several years,” so even if it’s well on its way, we’ll have to wait a little longer before its launch.",
    "Although official details are scarce, we’re hoping we'll soon learn more about when the game might arrive and what we can expect from the next instalment in the BioShock franchise. In the meantime, we’ve collected together all the news and rumors about BioShock 4 in the guide below, as well as what we’d like to see from the next game.",
    "[Update: A recent report has suggested that BioShock 4 could take us to a familiar time period. Read on to find out more.]",
    "While we're certainly excited for the next BioShock game, we don't actually know when we'll get our hands on it.",
    "In a tweet officially announcing a new BioShock is in the works in 2019, publisher 2K Games stated that work has begun on the next iteration of the BioShock franchise but that the game \"will be in development for the next several years\".",
    "That may not be the most welcome news, but this does give us an idea about what platforms BioShock 4 will release on. With the PS5 and Xbox Series X now available, we'll almost certainly be seeing a new BioShock releasing on these platforms (and probably on PC too). Whether the title will also release on last-generation consoles is less certain; it kind of depends on when the sequel releases.",
    "There was a suggestion in a recent report from journalist Colin Moriarty that the game is targeting a 2022 release which, interestingly, lines up with a slightly dubious NVIDIA GeForce Now leak from September 2021. However, we don't have an official confirmation just yet.",
    "Below, we're rounded up all the biggest rumors and news surround BioShock 4.",
    "Setting leak?",
    "A recent leak might have just revealed the planned setting for BioShock 4. In a Sacred Symbols video (via VGC), journalist Colin Moriarty. According to Moriarty, BioShock 4 will take players to a fictional city in the Antarctic in the 1960s. This is a setting which both VGC and Eurogamer have corroborated, citing anonymous sources. Setting the game in the 1960s would bring it in line with the timeline of BioShock 1 and 2, which take place in the underwater city of Rapture. Moriarty went on to say that the new city setting could be called Borealis and that the game will narratively connect to previous entries in the series.",
    "“It takes place in a 1960s Antarctic city called Borealis,” Moriarty said. “[The game is] codenamed ‘Parkside’… I’ve been told that the development team has incredible latitude to get it right. That seems and sounds right to me.” Moriarty went on to say, \"Internally the game is very secret and apparently, totally locked up. Apparently the inclination there is that they understand full well that this game will be compared to what [original BioShock creator] Ken Levine does. And by the way, [Take-Two] is also publishing Levine’s next game.\"",
    "Moriarty said that the game is apparently targeting a 2022 release but, of course, this report remains a rumor until anything is confirmed by the game’s publisher or developer. If the game really is targeting a 2022 release, however, it shouldn’t be too much longer until we start hearing some more official details.",
    "Nvidia GeForce Now leak",
    "There was a major leak from the Nvidia GeForce Now (game streaming service) database in September 2021 and it included a listing for “BioShock 2022”, which could be related to the BioShock game announced in 2019, known for now as BioShock 4.",
    "Addressing the leak, Nvidia issued a statement to confirm that while the leak was real, the inclusion of any game on it doesn’t mean anything. Nvidia told Wccftech: “Nvidia is aware of an unauthorized published game list, with both released and/or speculative titles, used only for internal tracking and testing. Inclusion on the list is neither confirmation nor an announcement of any game.",
    "“Nvidia took immediate action to remove access to the list. No confidential game builds or personal information were exposed.”",
    "Since the leak took place, 343 Industries has stepped forward to say that a listing for Halo 5 on PC was incorrect and that the game will not come to the platform which is as good a sign as any that many of the games that appeared on the list (or any release dates tied to them) should be taken with a pinch of salt.",
    "The last we heard was in a Take-Two financial report in early 2020 which said the next BioShock “will be in development for the next several years“. Based on that, a 2022 release does seem slightly too soon, especially given the coronavirus pandemic has caused delays for more than a few studios. However, we can’t be sure until something official is announced.",
    "Unreal Engine 5 A recent job listing at Cloud Chamber games, developers of BioShock 4, suggests the team could be developing the game using Epic’s Unreal Engine 5. In the ad for a Senior Gameplay Programmer it states that the candidate will “work within Unreal Engine 5 adapting existing systems and building new technology in order to fulfil the project’s technical needs and creative goals.”",
    "If BioShock 4 is being developed using Epic’s latest, next-gen engine it bodes well for how the game will look as Epic’s recent demo footage of the engine in use on PS5 and Xbox Series X was very impressive.",
    "A possible PS5 exclusive? There’s a rumor going around (via ComicBook) that Sony could be pursuing BioShock 4 as a PS5 exclusive in some capacity, whether outright or timed.",
    "On an episode of the Xbox Era podcast, host Nick “Shpeshal_Ed” Baker said that he has heard from unnamed sources that Sony is going after BioShock 4 as a PlayStation exclusive. According to Baker, he wasn't given many details about the current situation and couldn’t say for certain whether any deal being made would make the game an outright exclusive or a timed exclusive, though he did say he would assume the latter.",
    "Of course, this remains nothing more than a rumor at the moment and, even if Sony is in talks for exclusivity, there’s no certainty that any deal would be made.",
    "More job listings suggest the next BioShock will be open-world In yet another piece of juicy gossip supplied by a new round of job listings, it appears that Cloud Chamber will be taking BioShock in a different direction this time out, with the developer actively searching for someone \"who can weave impactful, character-driven stories in an open world setting.\"",
    "Another job listing also points to the upcoming BioShock implementing an \"urban crowd system\" with a \"systemic tribal ecology\" backed by a \"sometimes hostile AI\". It's said the person who ultimately gets the job will need to \"push the envelope of what is possible with interactive crowd systems\".",
    "Clues given by more job listings point to a new setting When you’re short of formal announcements about a game, sometimes there are things to be gleaned from its job listings. That’s proven to be the case with BioShock 4, as some Cloud Chamber Games job listings spotted by Twitter user MauroNL (via IGN) suggest that the game won’t be set in Rapture or Columbia, the settings for previous games in the series.",
    "As pointed out by MauroNL “Several job listings ask: ‘we want you to help us breathe life into a new and fantastical world.’, which suggests the game having a new setting and not a return to Rapture or Columbia. ‘Together, we will set the stage for a stunning narrative and systems-driven experience’.”",
    "While this clearly isn’t a confirmation on where the game is – or isn’t – set, it certainly does suggest that BioShock 4 will take us somewhere new, which wouldn’t be an unwelcome change and would allow Cloud Chamber Games to really make its mark on the BioShock universe.",
    "Take-Two financial report Take-Two Interactive recently published a financial report which makes a mention of BioShock 4. A very small mention but a mention nonetheless. According to this report, it'll be quite a while before we see BioShock 4 as it \"will be in development for the next several years\". This is pretty much as expected—although it was reported that the game has been in the works for years, it was also noted that its development has been rebooted in that time so it's unsurprising that it's going to be a few more years before we get to play it. Nonetheless, it's always good to manage expectations.",
    "Job listings Cloud Chamber Studios is working on the next BioShock title and some job listings (via GamesRadar) the studio has posted can give us small insights into BioShock 4, or at least what the development team is working to bring to the game.",
    "One listing for a Senior AI Engineer mentions \"high ambitions\" for tying AI and storytelling together in this \"strongly narrative and systemic game\". The game will have \"several AI systems\" for this person to work on including an \"urban crowd system and the systemic tribal ecology of a sometimes hostile AI\".",
    "Another listing for a Lead Combat/AI Designer tells prospective applicants they'll be working on developing \"an FPS combat paradigm that is accessible, satisfying, and allows for a high degree of player expression and experimentation within a highly reactive world\" and that they will have to think \"beyond direct conflict, accommodate various play-styles and design encounters that can be resolved through player ingenuity.\"",
    "It's not a huge amount to go on but it does suggest an ambitious approach is being taken with BioShock 4 and that the game will continue, and potentially even enhance, the flexible approach taken by previous installments.",
    "In the works for years According to a report by Kotaku, a new BioShock has quietly been in the works for years.",
    "\"What 2K didn’t say is that this project has already been in the works since at least 2015, although it’s been rebooted since then,\" writes Kotaku's Jason Schreier.",
    "Official announcement Publisher 2K Games took to Twitter in late 2019 to announce a new installment in the bestselling videogame franchise.",
    "While there's no indication of where the game might be set, and its connection to the existing characters and environments established in previous titles, we do know that 2K is setting up a whole new development studio – \"Cloud Chamber, purveyors of fine videogames\" – to work on the unnamed BioShock title, which will be \"in development for the next several years\".",
    "Initial rumors - confirmed The first substantial rumors about a new BioShock game emerged in April, 2019. In an article about the current goings-on at Mafia 3 development studio, Hangar 13, Kotaku reported that there’s a studio located right next door and the team within is working on the early stages of the next BioShock game, codenamed Parkside. We now know a new BioShock is definitely in the works.",
    "Return to Rapture While it was nice to venture out of the underwater city of Rapture in BioShock: Infinite, it didn't quite feel the same. Sure there were some nostalgic scenes and the Burial at Sea DLC let us pop in once again, but we want to return properly this time.",
    "Perhaps BioShock 4 could see us returning to a new Rapture, one that society has tried to reclaim and spruce up following the events of the previous games. If not, then we would love another wonderfully atmospheric city in a similar vein.",
    "Big Daddies and Little Sisters Sure, they're a bit creepy but we love them. More importantly, they're a big part of why many of us love BioShock but weren't really big players in BioShock: Infinite. We hope to see them return in the next one.",
    "Explore the lore more While it can sometimes be confusing, BioShock's lore and narrative is intriguing and we love the webs that have been weaved across the previous games. We're hoping 2K strive to build more on it, perhaps throwing in some more twists.",
    "New Vigors A big part of what makes BioShock so much fun are the Vigors you can play around with. While it would be great to see the return of our favorites, we want some new Vigors to try out and combine."
  ],
  "headers": {
    "4": "BioShock 4: cut to the chase"
  },
  "links": {
    "2K Games": "https://www.techradar.com/news/new-bioshock-game-confirmed-as-2k-sets-up-new-development-studio",
    "tweet": "https://twitter.com/2K_UK/status/1204024058163204097?s=20",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "recent report": "https://www.techradar.com/news/bioshock-4-will-take-us-back-to-a-familiar-time-period-according-to-reports",
    "Sacred Symbols": "https://www.patreon.com/posts/sacred-symbols-59475841",
    "VGC": "https://www.videogameschronicle.com/news/bioshock-4s-setting-and-time-period-have-reportedly-leaked/",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-12-03-next-bioshocks-setting-and-time-period-detailed-in-new-report",
    "major leak": "https://www.techradar.com/news/nvidia-geforce-now-leak-suggests-god-of-war-and-demons-souls-inbound-for-pc",
    "Wccftech": "https://wccftech.com/nvidia-responds-to-geforce-now-database-leak-says-list-included-speculative-titles/",
    "stepped forward to say": "https://www.techradar.com/news/there-are-no-plans-to-bring-halo-5-to-pc-says-343-after-nvidia-geforce-now-leak",
    "ad for a Senior Gameplay Programmer": "https://boards.greenhouse.io/cloudchamberen/jobs/4498640003",
    "recent demo": "https://www.techradar.com/news/an-early-look-at-unreal-engine-5",
    "ComicBook": "https://comicbook.com/gaming/news/bioshock-4-ps5-exclusive-rumor/",
    "Xbox Era podcast": "https://www.youtube.com/watch?v=ZHeqUrZwPgg",
    "new round of job listings": "https://www.techradar.com/news/the-next-bioshock-is-going-open-world",
    "MauroNL": "https://twitter.com/MauroNL3/status/1293138723073392641",
    "IGN": "https://www.ign.com/articles/bioshock-4-setting-rapture-columbia-job-listings",
    "financial report": "https://ir.take2games.com/news-releases/news-release-details/take-two-interactive-software-inc-reports-results-fiscal-third-0?field_nir_news_date_value%5Bmin%5D=",
    "GamesRadar": "https://www.gamesradar.com/bioshock-4-job-listings-point-to-a-highly-reactive-world-that-supports-multiple-play-styles/",
    "Senior AI Engineer": "https://chp.tbe.taleo.net/chp04/ats/careers/v2/viewRequisition?org=GAMES2K&cws=74&rid=3672",
    "Lead Combat/AI Designer": "https://chp.tbe.taleo.net/chp04/ats/careers/v2/viewRequisition?org=GAMES2K&cws=74&rid=3651",
    "Kotaku": "https://kotaku.com/how-the-makers-of-mafia-iii-lost-their-way-1825242177",
    "Twitter": "https://twitter.com/2K_UK/status/1204024058163204097"
  }
}