{
  "source": "https://www.techradar.com/news/amazon-set-to-launch-its-own-bitcoin-rival",
  "title": "Amazon set to launch its own digital currency",
  "category": "computing",
  "updated": "2021-02-12T14:35:36.949Z",
  "author": "joel-khalili",
  "summary": "Job listings reveal Amazon is working in stealth on an own-brand digital currency",
  "article": [
    "Amazon is laying the groundwork for a new digital currency for use on its own platforms and marketplaces, new job listings suggests.",
    "The e-commerce and cloud computing giant put out a call for talent to join its Digital and Emerging Payments (DEP) division, which is in the process of developing a system whereby customers in emerging markets can “convert their cash into digital currency”.",
    "“[Using the currency], customers can enjoy online services including shopping for goods and/or services like Prime Video,” wrote the firm.",
    "As per the job listings, which have since been removed, the project will launch first in Mexico, but could later expand into other nearby territories if successful.",
    "It is unclear whether the digital currency under development will tie in with the existing Amazon Coins project, which allows customers to make savings on purchases made via Kindle and Fire devices.",
    "The move to launch an Amazon-exclusive digital currency comes as a number of high profile organizations and institutional investors begin to pay closer attention to the cryptocurrency ecosystem.",
    "Electric car company Tesla, for example, recently announced it has invested $1.5 billion in Bitcoin, and payments giant Visa has unveiled a suite of APIs that effectively turns traditional banks into crypto exchanges.",
    "As far back as mid-2019, Facebook announced the launch of the Diem Association (formerly Libra Association), which seeks to create a digital currency system whereby anyone with a smartphone can make cross-border payments and purchases without incurring significant transaction fees.",
    "Although details on the new project remain scant and Amazon is yet to make a public statement on the topic, early signs suggest the company's plans are less grand. It appears its digital currency will operate exclusively within the bounds of the Amazon ecosystem and initially only in a small selection of markets.",
    "The benefit of using Amazon’s own digital coin to make purchases over regional fiat currency is currently unclear. Amazon did not return our request for clarification.",
    "Via CoinDesk"
  ],
  "headers": {
    "5": "Amazon digital currency"
  },
  "links": {
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "invested $1.5 billion": "https://www.techradar.com/news/bitcoin-price-hits-new-record-high-after-tesla-confirms-dollar15bn-purchase",
    "payments": "https://www.techradar.com/best/best-payment-gateways",
    "suite of APIs": "https://www.techradar.com/news/new-visa-services-turn-traditional-banks-into-bitcoin-exchanges",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "CoinDesk": "https://www.coindesk.com/amazon-digital-currency-mexico"
  }
}