{
  "source": "https://www.techradar.com/news/nvidia-really-needs-to-refresh-its-entire-ampere-graphics-card-lineup",
  "title": "Nvidia really needs to refresh its entire Ampere graphics card lineup",
  "category": "computing",
  "updated": "2021-02-20T15:31:04Z",
  "author": "bill-thomas",
  "summary": "Opinion: Whether it's Super cards or not, we need new Nvidia GPUs",
  "article": [
    "Earlier this week, Nvidia announced that it's going to be limiting the cryptocurrency mining performance of the RTX 3060 in a bid to diminish miners' demand for the upcoming graphics card. It remains to be seen just how effective this is going to be, but it's a step in the right direction, and Nvidia really needs to take it further.",
    "A pre-embargo Nvidia GeForce RTX 3060 has reportedly emerged, as spotted by Tom's Hardware, that suggests that Nvidia's limits perhaps didn't go far enough, but I can't say how well the graphics card will perform in any workload until I can get my hands on it for testing.",
    "But even if Nvidia's limits aren't quite as restrictive on crypto mining performance as they should be, anything that can help people get their hands on a new graphics card without having to pay extortionate aftermarket mark-ups is a good decision in my eyes. I just want to see Nvidia take it even further.",
    "The Nvidia GeForce RTX 2070 Super, RTX 2060 Super and RTX 2080 Super all appeared in July 2019, about 10 months after the September 2018 launch of the initial Nvidia Turing lineup.",
    "It definitely doesn't feel like it, but the Nvidia GeForce RTX 3080 launched five months ago on September 17, 2020. So, it's about time to start speculating on what Nvidia is going to do to refresh the lineup halfway through its lifespan, like it did with Turing.",
    "Rumors about refreshed versions of Ampere graphics cards started showing up, like, right when Nvidia launched the initial lineup. Word of a 20GB version of the RTX 3080 and a 16GB RTX 3070 has been spreading like wildfire for months now, even though there have been countless reports those cards have been cancelled – if they ever existed in the first place.",
    "Here's the thing, though: that's exactly what we need.",
    "I've gone on in the past about how Nvidia's announcement of an Nvidia GeForce RTX 3060 with 12GB of VRAM is going to potentially confuse a lot of potential buyers. For instance, if someone sees the RTX 3060 and RTX 3060 Ti sitting on a shelf next to each other, and don't know much about graphics cards, it's not unrealistic to think some may get the former thinking it's the more powerful product.",
    "That highlights the importance of reading reviews, but when we're talking about a product that's feasibly going to be bought on the shelf at a local retail store, there's a real chance that customers are going to have a worse experience than they should when making an impulse purchase.",
    "It's no secret that cryptocurrency miners have started buying up Nvidia Ampere graphics cards in droves, driving up prices to astronomical prices. In fact, for PC gamers, it's at the point where we can't recommend an Nvidia – or AMD, for that matter – graphics card at the current going rate. Nvidia needs to step in, and not just for the Nvidia GeForce RTX 3060.",
    "Since Nvidia came out and announced that the RTX 3060 would have a driver-level handbrake to limit mining performance, Nvidia Director of Global PR for GeForce Bryan Del Rizzo came out on Twitter to clarify what's going on.",
    "So, because the limitations Nvidia worked into the Nvidia RTX 3060 seem to go down to the silicon level in order to prevent miners from just flashing the BIOS to get around it, Nvidia will have to release new versions of its existing graphics cards in order to protect those from being bought up by miners.",
    "Spotted by Wccftech, known Nvidia leaker @kopite7kimi has been speculating since Nvidia's news about the RTX 3060 limit suggesting that Nvidia might be planning on releasing a new version of every GPU in the lineup. Given that it's still a bit early to actually see an RTX 3080 Super emerge, this is exactly what Nvidia should do.",
    "Nvidia should absolutely use this mining brake as an opportunity to refresh its product line with new Super cards. And, Team Green can take it as a chance to also improve memory capacity on the older Ampere cards. I've reached out to Nvidia for comment on this, and I'll update this article the moment I hear more about it.",
    "I would love to see an RTX 3080 Super and an RTX 3070 Super hit the streets later this year, that use this brake to get the GPUs into the hands of gamers that have been stressing themselves out mashing the F5 key on Newegg, only to see all the stock disappear within seconds.",
    "Cryptocurrency miners definitely aren't the the only reason RTX 3000 graphics cards are sold out everywhere. Demand is genuinely high for what are some of the best graphics cards we've ever seen. And, given the stock shortage that game consoles are experiencing, with similar – though less extreme – aftermarket price increases, it's unlikely that any one solution is going to make it easy to buy a new graphics card.",
    "But, when you look at a site like StockX, which resellers can use to sell off high demand items, the Nvidia GeForce RTX 3080 Founders Edition is selling for nearly three times the MSRP. The PS5 is just $250 more than retail on the same site.",
    "I'm not saying that making the Nvidia Ampere lineup unappealing for miners is going to be the magic bullet that cures the current stock situation. But if it can get the Nvidia GeForce RTX 3080 down to a more reasonable price, Nvidia's best graphics card in years might actually be worth buying again."
  ],
  "headers": {
    "3": "It's almost time for the Super cards",
    "9": "What we need"
  },
  "links": {
    "limiting the cryptocurrency mining performance of the RTX 3060": "https://www.techradar.com/news/nvidia-deliberately-halves-rtx-3060-hash-rate-to-put-off-crypto-miners",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Tom's Hardware": "https://www.tomshardware.com/news/rtx-3060-still-profitable-mining",
    "Nvidia GeForce RTX 2070 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
    "RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super",
    "Nvidia Turing": "https://www.techradar.com/news/nvidia-turing",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "I've gone on in the past about how Nvidia's announcement": "https://www.techradar.com/news/nvidias-graphics-card-lineup-just-got-a-whole-lot-more-confusing-at-ces-2021",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Wccftech": "https://wccftech.com/nvidia-says-its-hard-to-crack-geforce-gpu-mining-hash-rate-limiter-current-ampere-turing-gpus-remain-unaffected/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Wccftechcom+%28WCCFtech.com%29",
    "Nvidia GeForce RTX 3080 Founders Edition is selling for nearly three times the MSRP": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-9252908622249554000&url=https%3A%2F%2Fstockx.com%2Fnvidia-nvidia-geforce-rtx-3080-graphics-card-founders-edition&article_name=Nvidia%20really%20needs%20to%20refresh%20its%20entire%20Ampere%20graphics%20card%20lineup&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnvidia-really-needs-to-refresh-its-entire-ampere-graphics-card-lineup",
    "PS5 is just $250 more": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-3477453767436085000&url=https%3A%2F%2Fstockx.com%2Fsony-ps5-playstation-5-blu-ray-edition-console-white&article_name=Nvidia%20really%20needs%20to%20refresh%20its%20entire%20Ampere%20graphics%20card%20lineup&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnvidia-really-needs-to-refresh-its-entire-ampere-graphics-card-lineup"
  }
}