{
  "source": "https://www.techradar.com/news/intel-core-i5-12400-leak-could-be-amds-worst-nightmare",
  "title": "Intel Core i5-12400 leak could be AMD’s worst nightmare",
  "category": "computing",
  "updated": "2021-10-12T11:44:57Z",
  "author": "darren-allan",
  "summary": "Alder Lake leak suggests AMD could be outgunned by a killer midrange CPU",
  "article": [
    "Intel’s incoming Core i5-12400 could be a midrange beast of a chip, at least if the latest leak about this Alder Lake processor is on the money.",
    "The spilled benchmark comes from Bilibili as spotted by HXL on Twitter, a common source of hardware leaks, with this one showing the 12400 put through its paces on Cinebench R20 and CPU-Z, with seriously impressive results.",
    "First of all, we should note the spec details revealed here, showing what’s apparently the retail version of the Core i5-12400. It has 6 performance cores, with no power-efficient cores, so in other words, it’s just a normal CPU with no ‘small’ cores as per Alder Lake’s hybrid scheme of things (not every 12th-gen chip will employ the hybrid tech).",
    "As for clock speeds, the Intel CPU is capable of boost to 4.4GHz on a single-core, with 4GHz across all-cores.",
    "In Cinebench R20, the Core i5-12400 flexes its performance core-only muscles to hit 659 in single-threaded, and 4,784 in multi-threaded. As PC Gamer points out, that’s faster than the Ryzen 5 5600X which has 6-cores and managed 597 and 4,438 respectively when our sister site benchmarked the AMD processor. So Intel is 10% and 8% faster in single and multi-threaded here.",
    "Obviously we need to take this with a good deal of caution, though, but it’s quite a startling result if genuine.",
    "As for CPU-Z, the 12400 scored 681 in single-threaded and 4,983 in multi-threaded. In testing on AIDA64, which was also shown here, the Alder Lake CPU didn’t get any hotter than 60C (with a peak power draw of 78W), so that’s good to see, as well.",
    "As ever with pre-release leakage, we should underline again that hefty doses of salt are required, and we’d be foolish to try and draw any firm conclusions comparing to other chips on the market – that’s what full reviews are for when products are launched. But still, it’s hard not to get excited about the promising level of performance which this leak suggests for what should be a wallet-friendly Alder Lake processor.",
    "We say wallet-friendly, but of course what we don’t know is a key piece of the puzzle, and that’s how Intel will pitch pricing. In this case, it should be in line with current midrange pricing, you would hope – perhaps a bit more (or maybe not if Intel really wants to take the fight to AMD and go for the CPU jugular, to try to reclaim some of that desktop territory lost to Ryzen in recent years).",
    "For reference, the current Core i5-11400 (Rocket Lake CPU) retails for $182 (around £135, AU$245), and remember, the Ryzen 5 5600X sells for $299 (around £220, AU$400) – but as we said already, let’s not jump to any conclusions just yet on how much of a potent weapon the 12400 might be in Intel’s armory."
  ],
  "headers": {
    "7": "Analysis: Going for the CPU jugular? Let’s hope so for competitivity’s sake"
  },
  "links": {
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "Bilibili": "https://t.bilibili.com/580273446317440804?tab=2",
    "PC Gamer": "https://www.pcgamer.com/uk/intels-next-gen-i5-may-lack-alder-lakes-boldest-feature-but-is-still-more-than-a-match-for-amd/",
    "AMD processor": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "processor": "https://www.techradar.com/news/best-processors",
    "perhaps a bit more": "https://www.techradar.com/news/intel-alder-lake-cpu-leak-hints-at-some-wallet-worrying-prices",
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "Ryzen 5 5600X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-5-5600x-find-stock-here"
  }
}