{
  "source": "https://www.techradar.com/news/10-new-netflix-original-shows-and-movies-to-look-forward-to-in-2021",
  "title": "10 new Netflix original shows and movies to look forward to in 2021",
  "category": "entertainment",
  "updated": "2021-01-31T11:00:08Z",
  "author": "jon-o-brien",
  "summary": "What's coming up on the world's biggest streamer",
  "article": [
    "The recent success of Bridgerton, Night Stalker and Outside the Wire proves that Netflix can more than compete with the likes of Apple TV Plus, Amazon Prime Video and Disney Plus when it comes to original content. Clearly, Netflix's 200 million subscribers worldwide seem to agree.",
    "And there’s plenty more where those came from over the next 12 months. From raucous comedies to reimagined fairytales, here’s a look at 10 of our most eagerly-awaited new shows and films confirmed to be hitting the streaming giant in 2021, including both movies and TV shows.",
    "Release date: February 19",
    "Two of Netflix’s finest European originals, Dark and The Rain, have been firmly rooted in dystopia, so hopes are high for this German sci-fi series set in a post-apocalyptic 2074.",
    "Sharing a production company with Dark, Tribes of Europa sees three peace-loving siblings become embroiled in a deadly war after discovering a mysterious and much-coveted cube. From desolate snow-capped landscapes to villains sporting Mad Max chic, the six-episode series certainly looks the part, while a bilingual script and familiar faces including Game of Thrones’ James Faulkner may well convince a wider audience to get on-board.",
    "Release date: April 23",
    "It’s hard enough compacting one series of young adult novels into a TV drama, let alone two. But that’s the task ambitious showrunner Eric Heisserer faces with this epic tale of a newly-discovered superhero’s quest to save her permanently dark world.",
    "In a move that will undoubtedly upset some purists, Shadow and Bone transports the sharp-shooters, spies and soldiers of Leigh Bardugo’s duology Six of Crows into the timeline of her equally successful Grisha trilogy. No stranger to the fantastical, Westworld’s Ben Barnes plays mysterious commander The Darkling, while relative unknown Jessie Mei Li takes top billing as the orphaned teen with the power to summon light.",
    "Release date: TBA",
    "Clickbait is an ever-timely cautionary tale about how our social media personas can impact our real lives. Shot and based in Melbourne, the eight-part thriller revolves around a family torn apart by a mysterious disappearance which appears to stem from the online world. The Big Sick’s Zoe Kazan leads the impressive cast as the sister determined to find out the truth, with Entourage’s Adrian Grenier, Get Out’s Betty Gabriel and Aussie native Phoenix Raei all caught up in the intriguing web of lies. You won't believe what happens next!",
    "Release date: TBA",
    "Four years after buying the rights, Netflix should finally enter the Millarworld in 2021 with this adaptation of Frank Quitely and Mark Millar’s acclaimed comic book. Jupiter’s Legacy stars Josh Duhamel and Leslie Bibb as two powerful superhero parents whose children are more interested in cashing in on their fame than changing the world. And their problems continue to pile up when old friend-turned-foe George returns to enact his revenge on their aging gang. Netflix will no doubt be hoping to win back some of the Marvel crowd with this big-budget series, the first two episodes of which Millar claims made him weep with joy.",
    "Release date: TBA",
    "Netflix sure has brought out the big guns for this intriguing tale of two astronomers embarking on the most depressing media tour of all time: to tell the world it’s about to be destroyed by a giant comet. Leonardo Di Caprio and Jennifer Lawrence play the bearers of bad news, while Meryl Streep, Cate Blanchett, Jonah Hill and Chris Evans are just a few of the A-listers providing support. Of course, Ryan Murphy’s The Prom proves that star power doesn’t necessarily equate to greatness. However, we expect director Adam McKay (The Big Short) to make better use of his ridiculously stacked cast.",
    "Release date: TBA",
    "Stuck in development hell for nearly a decade, Guillermo del Toro’s attempt to bring Pinocchio back to life finally kicked into gear following The Shape of Water’s Oscar-winning success. Unsurprisingly, the monster maestro’s take on the famous fibber is destined to be much more macabre than Walt Disney’s. Co-directed by Mark Gustafson, the stop-motion animated musical is set in the fascist Italy of the 1930s and draws just as much from Frankenstein as it does Carlo Collodi’s classic fairytale. Not one for the kids, then. Yet this labor of love, which sees Ewan McGregor voice The Talking Cricket and Tilda Swinton The Fairy with Turquoise Hair, will no doubt still enchant.",
    "Release date: TBA",
    "Originally due to hit cinemas and then Amazon Prime, Bad Trip will finally make its screen debut on Netflix later this year. Like Bad Grandpa and Sacha Baron Cohen’s mockumentaries, this long-delayed comedy interweaves a loose scripted narrative – in this case, two Floridian friends head to the Big Apple to track down an old crush – around several real-life pranks played on an unsuspecting general public. Who knows whether anything can top that Rudy Giuliani moment in the latest Borat? But with the host of the brilliantly anarchic The Eric Andre Show in tow, this will undoubtedly provide the absurdist escapism we all need.",
    "Release date: TBA",
    "After four years away from the spotlight, Zack Snyder appears to be making up for lost time in 2021. Firstly, there’s that entirely unnecessary four-hour director’s cut of Justice League. But more promisingly, there’s also a revisit to the genre where he first displayed his polarizing visual style.",
    "No relation to his 2004 debut Dawn of the Dead, this heist horror sees Dave Bautista front a mercenary gang who decide that a zombie pandemic is the perfect time to rob a Vegas casino. The fact that Netflix have already greenlit a prequel suggests that Snyder may have rediscovered his earlier flesh-eating form.",
    "Release date: TBA",
    "Chris Hemsworth’s first Netflix vehicle, Extraction, remains one of the streaming giant’s most-watched originals. And his second, the near-future sci-fi Escape from Spiderhead, has the potential to rack up similarly impressive viewing figures. In this adaptation of a trippy short story by Man Booker Prize winner George Saunders, the middle Hemsworth and Miles Teller play prisoners who agree to be clinical trial guinea pigs in exchange for shorter terms. But as their emotions become altered and their minds controlled, the convicts soon end up wishing they’d simply played out their sentences instead.",
    "Release date: TBA",
    "After the relatively conventional Where D’You Go, Bernadette?, Richard Linklater returns to more familiar idiosyncratic territory with an animated coming-of-age film inspired by his Houston childhood. Featuring the voices of Jack Black, Glen Powell and Zachary Levi, Apollo 10 ½ sees the visionary director adopt the same rotoscoping techniques he helped pioneer in the adult-oriented Waking Life and A Scanner Darkly. However, the story – a young suburban boy dreams of training as an astronaut during the excitement of the 1969 moon landing – suggests this will be a much sweeter, if still very singular, sci-fi tale.",
    "This one isn't confirmed for release in 2021, yet, but the live-action part finished filming last year."
  ],
  "headers": {
    "2": "Tribes of Europa",
    "5": "Shadow and Bone",
    "8": "Clickbait",
    "10": "Jupiter's Legacy",
    "12": "Don’t Look Up",
    "14": "Pinocchio",
    "16": "Bad Trip",
    "18": "Army of the Dead",
    "21": "Escape from Spiderhead",
    "23": "Apollo 10 ½"
  },
  "links": {}
}