{
  "source": "https://www.techradar.com/news/chrome-for-android-can-now-stop-you-getting-rickrolled",
  "title": "Chrome for Android can now stop you getting Rickrolled",
  "category": "phones",
  "updated": "2021-03-12T11:18:21Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Check links before you visit a site",
  "article": [
    "Google has started to roll out a great new feature for users of the Android version of Chrome. The latest addition to the browser makes it possible to preview links before you visit a site.",
    "There are many benefits to the ability to take a peek at a site before you decide whether to visit it or not. In addition to being a wonderful way to bolster security, the feature also helps you to avoid wasting time as it lets you quickly check that a site is what a link claims it to be – no more getting Rickrolled.",
    "At the moment, you're probably used to opening links in a new tab so you don't navigate away from the original article you were reading. Chrome for Android's new Preview Page option offers another solution to this problem in addition to helping you to avoid malicious sites or any others you just don’t want to visit.",
    "If you tap and hold a link on a site, you should see a new Preview Page option in the menu. Tap this and you'll see a preview of the linked page in a floating tab. You can use this to see if the page is something you would like to read further, in which case you can tap to open the link properly, or if it is something you'd rather ignore, in which case you can simply close it with a tap or a swipe.",
    "In order to enjoy the benefits from page previews in Chrome, you need to be running at least version 89 of the mobile browser. But this alone is not enough. The new page preview functionality is being added as a server-side change so not everyone has access to it immediately.",
    "As is often the case with server-side changes, this is a staged rollout out and there is nothing you can do to speed up the arrival of this handy new feature in your browser; there are no settings to change or hidden flags to enable that will unlock it. If you don't see the Preview Page option in the menu when you long-press a link, it just means you'll have to wait a little longer.",
    "Via AndroidCentral"
  ],
  "headers": {
    "4": "Sneaky peek"
  },
  "links": {
    "AndroidCentral": "https://www.androidcentral.com/chrome-androids-new-preview-option-apes-apples-peek-and-pop"
  }
}