{
  "source": "https://www.techradar.com/news/internet-archive-forget-the-wayback-machine-theres-now-a-wayforward-machine-too",
  "title": "Internet Archive: Forget the Wayback Machine, there's now a Wayforward Machine too",
  "category": "computing",
  "updated": "2021-10-05T08:16:40Z",
  "author": "abigail-opiah",
  "summary": "Freedom of information online could cease to exist",
  "article": [
    "To mark its 25th anniversary, the Internet Archive digital library has upped the stakes by launching a new Wayforward Machine.",
    "Unlike its Wayback Machine, which is able to teleport users back in time to see how websites looked in the past, the Wayforward Machine predicts what sites will look like in 2046.",
    "Providing a glimpse into the possible future of the World Wide Web, Internet Archive says its new initiative highlights several issues that could arise in the future, particularly concerning censorship, regulation and governmental interference.",
    "Looking to answer questions such as “What will the internet be like in the future?” or “Will we have access to knowledge and information?” - the Wayforward Machine explores whether the world will have access to trustworthy information online and whether knowledge be free and open.",
    "Testing out the initiative using the TechRadar URL, a pop up requesting users to insert their biometric details before accessing the website covers the screen.",
    "Elsewhere, using popular ecommerce website Amazon.com on the Wayforward Machine, a pop up asking users to pay $29 for access to the site appears on the screen - and Internet Archive predicts that social media platforms like Twitter will no longer exist.",
    "In a bid to raise awareness of internet freedom, Internet Archive created a timeline from 2022 to 2046 alongside the Wayforward Machine, with several predictions.",
    "Internet Archive believes that by 2026, there will be tighter regulations that will force significant closures in the technology sector.",
    "By 2031, Internet Archive also predicts that the US will follow other countries in adopting harsh digital regulations.",
    "TechRadar Pro reached out to Internet Archive to find out how long this initiative will be up for and what changes it hopes to see soon.",
    "Wendy Hanamura, Director of Partnerships at the Internet Archive said the Wayforward Machine will remain up and running through the end of the year - perhaps longer.",
    "\"Think of the Wayforward Machine as a wake up call. If you value access to knowledge, you need to protect it,\" she added.",
    "\"We'd love to see people get involved defending their privacy, advocating for open access to knowledge, and supporting libraries such as the Internet Archive, which is facing a lawsuit right now by four of the world's largest publishers who want to deny libraries the right to own, digitize, loan and preserve books online.\""
  ],
  "headers": {
    "3": "Future of websites"
  },
  "links": {
    "websites": "https://www.techradar.com/news/the-best-website-builder",
    "ecommerce website": "https://www.techradar.com/news/best-ecommerce-website-builder-of-2021-build-the-best-online-store-for-your-business"
  }
}