{
  "source": "https://www.techradar.com/news/honor-magic-3-is-basically-a-huawei-phone-but-with-google-apps",
  "title": "Honor Magic 3 is basically a Huawei phone but with Google apps",
  "category": "phones",
  "updated": "2021-08-12T12:58:37Z",
  "author": "tom-bedford",
  "summary": "Honor is officially back",
  "article": [
    "While Huawei has kept pumping out premium smartphones since the big Huawei ban of '19, the lack of Google apps has made them questionable purchases. However Honor - once Huawei's sub-brand, now under different owners - has finally stepped up to fill that void.",
    "The new Honor Magic 3 series is the company's first big global launch since the Honor 20 in early 2019, reviving its premium brand which last saw an entry in 2018 for limited markets. This new device is super flashy, with top specs in many departments.",
    "In fact, if the handset didn't have the Honor logo slapped on it, we'd think it was a Huawei phone. It has the same design language with a super-curved-edge display, large circular camera bump and absolutely top-spec rear cameras. That makes sense, because lots of the Honor team previously worked on Huawei devices.",
    "The main differentiator here is that, since Honor is no longer owned by Huawei, it once again gets access to Google apps including the Play Store, making this arguably much more useful as a phone.",
    "Honor's move here is the equivalent of someone breaking up with their partner, then immediately dating someone who's basically a better version of them: it sends the clear message \"I won this breakup\". And, metaphor aside, it gives people who like Huawei phones but don't like their app problems, a better alternative.",
    "At the moment, we've got Euro prices for the phone, and will share conversions too, but the cost could be different in other regions.",
    "There are actually three new phones: the Honor Magic 3, the Magic 3 Pro and the Magic 3 Pro Plus. We've been told the range is launching globally, though we don't have specifics on where that actually means or how much it'll cost in various regions.",
    "All three devices share the same screen - it's a 6.67-inch OLED panel with a 2772 x 1344 resolution, 120Hz refresh rate and HDR 10+ support. It curves at the edges in a dramatic fashion, a design statement Huawei also makes in its Mate phones.",
    "The handset comes in four colors - there's white and black as well as Blue Hour, which is blue, and Golden Hour which is pink - the latter two are apparently inspired by the 'magic hour' in photography, which is the hour either side of sunset when colors look nice.",
    "Another weirdly specific design detail is the circular camera bump, which Honor calls the 'Eye of the Muse' and is designed with mathematical ratios to... look nice? Some have suggested it looks like a film reel, which would work as a reference to the camera's videography specs, but we think that's reading into it a bit too far.",
    "Oh, if you're often getting your phone wet, you should know that while the Honor Magic 3 Pro and Pro Plus have IP68 protection, the standard model only gets IP54.",
    "The Magic 3 Pro Plus has extra protection though with a Nano Crystal Shield, whatever that means, which apparently gives the device 3x anti-drop resistance - presumably that means you can drop the thing three times as often as you would normally, and it would be fine.",
    "Specs-wise, the Honor Magic 3 has the Snapdragon 888 chipset, while the Pro and Pro Plus get the 888 Plus, which is the top processor available to Android phones as of launch. There's also Flash Memory, which lets the device leverage spare storage power to temporarily bump up the RAM, and Honor estimates you can add 2GB of RAM if you toggle this on.",
    "The devices all have 66W wired charging, as well as 50W wireless powering, so they'll charge up in less than an hour regardless of how you power them.",
    "The Magic 3 has three rear cameras: there's a 50MP main, 64MP monochrome and 13MP ultra-wide snapper, as well as a laser autofocus. The Pro model keeps those specs but throws a 64MP extra sensor into the mix, paired with a periscope lens for 3.5x optical, 10x hybrid or 100x digital zoom - it also swaps the laser focuser for a digital Time-of-Flight sensor.",
    "The Pro Plus is the same as the Pro but turns the ultra-wide snapper up to 64MP and also has a 'multi-spectrum color temperature sensor', which is a feature ripped straight from rugged phones.",
    "Honor has introduced a new feature for its phones to aid in videography, by creating its own file format for videos. While lots of cameras (including phone ones) save in RAW, which is a file format for photos that retains lots of information to aid in editing, LOG is the equivalent for video, and Honor has created 'Magic-Log', a version that contains loads of data but doesn't take as much space as standard Log. This should be useful for people who want to record professional videos on a phone, but keep lots of information for editing later.",
    "All the phones also have two front-facing cameras, consisting of an ultra-wide selfie camera paired with a 3D depth sensor for improved bokeh background blur.",
    "All-in-all, these phones sound like three impressive premium devices. We'll have to test them out to be sure though - hopefully they'll land globally soon so we can give them a spin."
  ],
  "headers": {
    "6": "Honor Magic 3 specs"
  },
  "links": {
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review",
    "rugged phones": "https://www.techradar.com/best/best-rugged-smartphones"
  }
}