{
  "source": "https://www.techradar.com/news/foundation-on-apple-tv-plus-release-date-plot-cast-and-what-we-know-so-far",
  "title": "Foundation on Apple TV Plus: release date, plot, cast, trailer and what we know",
  "category": "entertainment",
  "updated": "2021-09-24T08:12:13Z",
  "author": "tom-power",
  "summary": "Foundation has arrived on Apple TV Plus",
  "article": [
    "Foundation has finally arrived on Apple TV Plus. The epic sci-fi TV show's first two episodes landed on the streamer on Friday, September 24, so it's time to immerse yourself in this new space opera tale.",
    "Based on a series of novels by Isaac Asmiov (whose works have inspired the likes of Star Wars and Hitchhiker's Guide to the Galaxy), Foundation tells an centuries-spanning story that may be the most ambitious show that we've seen for some time. It's been developed by David S. Goyer, whose previous credits include Christopher Nolan's Batman trilogy and Zack Snyder's Man of Steel.",
    "If Foundation sounds like it's the type of show that you'd enjoy, but you'd like more information on it before you decide to jump in and check it out, we're here to help.",
    "Below, you'll find out more about the show, including its stacked cast, trailers that tease what Foundation entails, what its plot is about, why Asimov's works haven't been adapted before and more. Are you ready? Let's dive in.",
    "Foundation is available to watch now on Apple TV Plus. The first two episodes are available to view on the streamer, with new entries releasing weekly on Apple's streaming platform.",
    "The official Apple TV webpage for the series had confirmed that it was coming this year and, after we tentatively predicted it would arrive around September, that ended up being the case.",
    "Foundation took 19 months to film due to the ongoing Covid-19 pandemic. Principal photography ended in April 2021, with some of the show's cast – Leah Harvey and Lou Llobell, who will portray Salvor Hardin and Gaal Dornick respectively – confirming as much via Instagram soon after.",
    "With episodes available to the press ahead of release, we know who is directing every entry in episode 1.",
    "Rupert Sanders, in his first major directorial role, helmed Foundation's pilot episodes. Andrew Bernstein (Ozark, The Nevers) directs episode 2. Alex Graves, whose credits include The Boys and Game of Thrones, helms episodes three, four and five.",
    "The Expanse director Jennifer Phang led filming on episodes six and seven, while Agents of S.H.I.E.L.D's Roxann Dawson directs episodes eight and nine. Lastly, showrunner David S. Goyer helms season 1's finale.",
    "Apple released a final trailer for Foundation season 1 on August 19. The latest footage gives longtime fans and intrigued newcomers a much clearer idea of how it'll look, as well as what the plot will entail.",
    "There's plenty of action and thrilling drama within the near three-minute long trailer, too, which stands us in good stead for another potentially excellent sci-fi offering in the near future.",
    "Check out the new trailer below:",
    "Alongside Foundation's launch date reveal, Apple released a two-minute long trailer that also whetted our appetite. You can check out this batch of footage below:",
    "Finally, in August 2020, a two-minute long first-look trailer was released on Apple TV’s social media channels, which gave us our first glimpse at the series.",
    "The video begins with a brief overview from Goyer about how Foundation has shaped other cultural phenomena including Star Wars, before moving into a 90-second teaser composed of shot footage and CGI moments:",
    "Foundation is a compendium of sci-fi novels written by Isaac Asimov. The US author’s series is made up of seven books, with the core trilogy – Foundation, Foundation and Empire, and Second Foundation – comprising eight short stories that, after being released individually, were published as three collections in the early 1950s.",
    "According to Apple TV’s synopsis, Foundation “chronicles a band of exiles on their monumental journey to save humanity and rebuild civilization amid the fall of the Galactic Empire”.",
    "The series initially follows Hari Seldon, a mathematical genius who explains that, unless humanity changes course, the Galactic Empire will fall and be followed by a 30,000-year period of turmoil before a second Empire rises. Seldon, though, reveals that he has foreseen an alternate path that allows the intervening period to be reduced to 1,000 years if certain criteria are met.",
    "At the behest of the Empire’s reluctant rulers, Seldon creates the Foundation – a group of the greatest living scientists, engineers, and historians – which travels to a remote planet known as Terminus. There, the assembled humans are tasked with preserving an anthology of humanity’s knowledge – the Encyclopedia Galactica – so that, at the end of the millennium, a second Empire may begin.",
    "Traveling to a new world in Terminus may present problems for Seldon's contingent, however and that includes something known as the Vault. This mysterious floating object is mentioned in Asimov's novels (and greets Seldon's party on Terminus in Apple's adaptation) and, as Goyer revealed to Entertainment Weekly, it might hold the key to some of the show's biggest secrets.",
    "\"We'll definitely find out what's in the Vault in the season, although there are other mysteries to reveal about the Vault in later seasons,\" Goyer teased. \"All we know is that Salvor Hardin [Leah Harvey] has a very special relationship to the Vault.\"",
    "Unbeknownst to the Empire's overlords, however, Seldon secretly creates a second Foundation at the opposite end of the galaxy for mysterious purposes. What unfolds is a complex, interweaving saga and, due to its convoluted plot, Goyer has already hinted that it will take multiple seasons to tell Foundation’s vast story.",
    "“The audience is changing the way that we’re consuming stories,” Goyer told LovinMalta. “Game of Thrones was one of the first to do a giant novelistic show and now, with Foundation, we can hopefully [tell] the story over 80 episodes, or 80 hours, as opposed to trying to condense it down into a two or three-hour film.”",
    "It’s unclear if season 1 will deal with Prelude to Foundation, the book series’ first prequel novel, which explores the backstory of key Foundation players including Seldon. Given that the footage so far, however, we suspect that the prequel book may not be utilized at all.",
    "A number of established stars and newcomers have been cast for Foundation:",
    "Jared Harris (Sherlock Holmes, The Mortal Instruments) will star as Seldon, the mathematician who the Galactic Empire sees as a threat to the status quo. Speaking to Entertainment Weekly, Goyer explained why Seldon was such a danger to those in power.",
    "\"No one understands his mathematics,\" he said. \"They know he's really smart, but they don't know whether he's lying or not [about the Empire's destruction]. And that's what makes the Empire really nervous.\"",
    "Meanwhile, Lee Pace (Lord of the Rings, Guardians of the Galaxy) has been installed as Brother Day, the current Emperor of the Galactic Empire. Goyer revealed that Pace and his brothers (more on those below) are all clones of the same man – Emperor Cleon – who have ruled the Galactic Empire for four centuries.",
    "\"They call each other brothers, but they're not exactly brothers,\" Goyer explained. \"They relate to one another as father and grandfather, but they're not exactly that. When they see an older version of themselves, they literally know what they're going to look like when they get to that age. There's reassurance in that, but they also hate each other because of it.\"",
    "While Apple TV’s adaptation may closely follow the source material, there are changes to certain characters. Dr. Gaal Dornick and Eto Demerzel – both male in the novels – are female in the show. Lou Llobell (Voyagers) will star as Seldon’s biographer Dornick, while Finnish actress Laura Birn (The Innocents) will play Demerzel. Additionally, Leah Harvey (Fighting With My Family) will portray Salvor Hardin, the first Mayor of Terminus, whose gender has also been altered for the TV series.",
    "Cassian Bilton (Shoal) has been cast as Brother Dawn, the youngest living member of the Galactic Empire’s royal family, and Terrence Mann (Sense8, Critters) will play the royal family’s oldest member called Brother Dusk. Finally, Alicia Gerrard (Ripper Street) will portray Yate Fulham, a Member of the Board of Trustees of the Encyclopedia Committee.",
    "Alfred Enoch had confirmed that he is part of Foundation's cast, and now we know that he'll be playing Raych Seldon, Hari's adopted son.",
    "According to the TV show's IMDB page, there are also characters in Apple's adaptation who don't appear to be present in the novels. Unless Apple has altered their names for its adaptation, the below characters are brand new additions to the franchise.",
    "Daniel MacPherson (Neighbours), T'Nia Miller (The Haunting of Bly Manor), Pravessh Rana (The Serpent), Kubrra Sait (Sacred Games), Buddy Skelton (Responsible Child), Amy Tyger (Doctors), Nikhil Parmar (Traitors) and Video Hamada (Veronica Mars) will portray Hugo, Halima, Rowan, Phara, Keir, Azura, Freestone and Obrecht respectively. Clarke Peters (The Irregulars) is also set to play a new character called Abbas, but we're unsure how often he'll feature yet.",
    "There are plenty of other supporting characters in Foundation (per its IMDB page), but the rest of the show's cast are only thought to be present in one to four episodes. The individuals we've named are expected to appear in at least five episodes (Gerrard aside), so they'll have bigger roles to play in Foundation's events.",
    "It’s not been for a want of trying, even though multiple studios have found it tough to adapt Asmiov's novels in the past.",
    "New Line Cinema spent $1.5 million developing a movie adaptation of the trilogy in 1998 but subsequently failed. A decade later, New Line’s co-founders Bob Shaye and Michael Lynne attempted to produce a Foundation film series for Warner Bros. through their Unique Pictures production company, but were beaten to the screen rights by Columbia Pictures. Roland Emmerich (Independence Day, White House Down) was brought on to direct alongside sci-fi screenwriter Dante Harper, but the project failed to get off the ground.",
    "Things went quiet until HBO acquired the rights in 2014. Signing up Jonathan Nolan (The Dark Knight, Interstellar) as showrunner and producer, the US network spent three years trying to adapt Asimov’s works into a TV series. However, in June 2017, it was reported that Skydance Media was developing a Foundation TV series instead.",
    "Jump ahead to August 2018, and it was confirmed that Apple had ordered a 10-episode straight-to-series order in collaboration with Skydance’s Television division. Goyer and Josh Friedman were installed as co-writers and co-showrunners until April 2019, when Friedman departed the project in an apparently planned move. Goyer, David Ellison, Dana Goldberg, Marcy Ross, and Robyn Asimov – daughter of Isaac – are executive producers on the series.",
    "Curiously, Goyer has revealed that Apple's executives were on board with his live-action adaptation after a single sentence pitch.",
    "Speaking to The Hollywood Reporter about the show, the Man of Steel and Terminator: Dark Fate helmer explained that, after he was asked to pitch Asimov's convoluted story in the simplest of terms, his reply convinced Apple to press on with the series.",
    "\"They sort of asked it laughingly,\" Goyer said. \"I said: ‘It’s a 1,000-year chess game between Hari Seldon and the Empire, and all the characters in between are the pawns, but some of the pawns over the course of this saga end up becoming kings and queens.'\"",
    "Goyer also mentioned teased the grandness of Foundation season 1, saying: \"No one knows if it will work, but I can say there’s definitely never been a show like it on TV before.\"",
    "Hopefully, after such a long wait for a Foundation live-action series, it'll be worthy of Asimov's influential literary works."
  ],
  "headers": {
    "4": "Foundation release date: September 2021",
    "10": "Foundation trailer: check out the final trailer",
    "16": "Foundation plot: what is the sci-fi series about?",
    "25": "Foundation cast: who stars in Apple's adaptation?",
    "36": "Foundation adaptations: why hasn’t Asimov’s book series been adapted before now?"
  },
  "links": {
    "Apple TV webpage": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1323771412185665800&sharedId=trd-us&u=https%3A%2F%2Ftv.apple.com%2Fgb%2Fshow%2Ffoundation%2Fumc.cmc.5983fipzqbicvrve6jdfep4x3%3Fitscg%3DMC_20000%26itsct%3Datvp_brand_omd%26mttn3pid%3Da_google_adwords%26mttnagencyid%3D1625%26mttncc%3DUK%26mttnsiteid%3D143238%26mttnsubad%3DOUK2019859_1-443832511416-c%26mttnsubkw%3D103401956339_kwd-983265398157_SrAX6dR1_%26mttnsubplmnt%3D",
    "Entertainment Weekly": "https://ew.com/tv/the-foundation-trailer-breakdown-david-s-goyer/",
    "confirmed": "https://www.instagram.com/p/CJphnbrJaP7/",
    "IMDB page": "https://www.imdb.com/title/tt0804484/fullcredits/?ref_=tt_ov_st_sm",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-news/apple-tv-david-s-goyer-foundation-1234985520/"
  }
}