{
  "source": "https://www.techradar.com/news/netflix-is-filming-a-sequel-to-one-of-its-biggest-movies-this-year",
  "title": "Netflix is filming a sequel to one of its biggest ever movies this year",
  "category": "entertainment",
  "updated": "2021-01-19T10:26:07Z",
  "author": "samuel-roberts",
  "summary": "Pandemic permitting, anyway",
  "article": [
    "Netflix is looking to film Extraction 2 this year, according to director Sam Hargrave. The sequel to 2020's Netflix smash hit – which released in late April 2020, just as theaters around the world closed en masse and people were hungry for a solid action movie – is expected to see actor Chris Hemsworth reprise his role as tough guy merc Tyler Rake.",
    "Story details are thin on the ground. Extraction ended pretty conclusively, without spoiling how the finale went down – but Netflix was quick to put a follow-up in place, making a deal with Joe Russo (one of the Avengers: Infinity War/Endgame directors) to write a sequel back in May 2020.",
    "Collider recently asked Hargrave if the plan was indeed to film later this year – and the director confirmed that was the case, with the production targeting a Fall 2021 start. \"[That's] still the case, COVID-pending. That's kind of everyone's little caveat right now, but we're moving forward on it as if we're shooting in the fall. Joe [Russo] is still finalizing the script. We're all excited to read it. I've read different iterations, but I'm excited to read what he turns in. We're all looking forward to getting back in the saddle and hopefully bringing another action-packed adventure in the 'Extraction' universe.\"",
    "Hargrave wouldn't be drawn on many details about the sequel in terms of story, but says that pushing the envelope when it comes to action sequences is something he's focused on. Hargrave was a stunt co-ordinator and second unit director on both Avengers: Infinity War and Avengers: Endgame, and the first movie's greatest strength is how brutal and exciting the action is. It was sort of like Man on Fire meets John Wick.",
    "As far as Netflix's original action movies go – and they're a variable bunch – Extraction was up there as one of the best. Expect to see Extraction 2 hit Netflix in 2022 at the earliest.",
    "Extraction was the type of movie that you don't see released in theaters as frequently these days – mid-budget action movies with one or two big stars. Netflix, though, has made a slew of these types of films (see also Spenser Confidential and The Old Guard for recent examples), suggesting they're popular on the platform.",
    "It's hard to envision a world where we'd have paid full-price for a theater ticket to see Extraction – but then that's why it's a great fit for Netflix. The media matches the way it's being distributed. And with the future of theatrical movies still looking uncertain, we'd happily invest two more hours in watching Chris Hemsworth beat up a load of dudes."
  ],
  "headers": {
    "5": "Return of the mid-budget action movie"
  },
  "links": {
    "Collider": "https://collider.com/extraction-2-filming-details-director-sam-hargrave-interview/"
  }
}