{
  "source": "https://www.techradar.com/news/after-loki-episode-4s-surprise-sif-cameo-will-she-appear-again-in-the-mcu",
  "title": "After Loki episode 4's surprise cameo, will [SPOILER] appear again in the MCU?",
  "category": "entertainment",
  "updated": "2021-07-01T09:54:11Z",
  "author": "samuel-roberts",
  "summary": "It was among the many surprises in Loki this week",
  "article": [
    "Spoilers for Loki episode 4 follow.",
    "While Loki episode 4's post-credits scene stole the show with its multiple on-screen Lokis, it wasn't the only guest appearance to get fans talking this week. Jaimie Alexander, best known from the MCU's early days as Lady Sif, made an uncredited appearance as the character this week. It's the first time she's portrayed the character since appearing in season 1 of Agents of SHIELD back in 2014.",
    "The cameo was fleeting, as she basically functioned as punishment in a 'bad memory prison' – punching Loki for cutting her hair without her permission. It was a fun callback to a character that many thought had been forgotten, though Marvel Studios seems to be doing more and more of that lately.",
    "Still, this might not be Sif's last appearance in the MCU. Below, we'll tell you everything you need to know about Sif's past in the movies, and how she's reportedly going to turn up again in the upcoming Thor: Love and Thunder.",
    "Lady Sif is a warrior from Asgard who fought alongside Thor and the Warriors Three – Volstagg, Fandral and Hogun – in both Thor and Thor: The Dark World. She was positioned as a friend of Thor's, though there was a little bit of chemistry that suggested something more could've been on the cards.",
    "Sif later appeared in two episodes of Agents of SHIELD, the canonical status of which is a total mystery at this point, but is largely not considered part of the main MCU timeline.",
    "While the Warriors Three were unceremoniously killed off in 2018's Thor: Ragnarok, Lady Sif didn't appear in that movie, meaning she was technically still alive after the destruction of Asgard.",
    "According to the Russo brothers, Sif was one of those snapped out by Thanos in the events of Infinity War, meaning she would've returned after the events of Avengers: Endgame.",
    "Obviously, her appearance in Loki wasn't really canonical, since she was an illusion or flashback designed to torment the god of mischief. But her appearance in this episode might not be a one off.",
    "According to a report from Deadline released back in December, Jaimie Alexander will indeed reprise her role as Lady Sif in Thor: Love and Thunder. Marvel itself has not officially confirmed her appearance in the movie – though there's an extra reason to believe this report is the real deal. It correctly called that Alexander would make a cameo in the Loki series months before it aired.",
    "Directed by Taika Waititi, Thor: Love and Thunder is set to release on May 6, 2022. The director had previously called Sif \"awesome\" back in 2016, but in 2017, Alexander said she couldn't appear in Ragnarok despite being asked due to her commitments to the NBC series Blindspot.",
    "That series ended in 2020 – which no doubt helps open the door to future MCU appearances.",
    "What she'll be doing in Thor: Love and Thunder is more of a mystery. On paper, that movie looks very busy: it features the Guardians of the Galaxy, uber villain Gorr the god butcher (played by Christian Bale), and Natalie Portman becoming Thor.",
    "Still, New Asgard could always use the extra back-up."
  ],
  "headers": {
    "4": "Who is Sif in the MCU?",
    "9": "Will Sif appear again in Thor: Love and Thunder?"
  },
  "links": {
    "Loki episode 4": "https://www.techradar.com/news/loki-episode-4-recap-takes-the-show-in-a-whole-new-direction",
    "Loki episode 4's post-credits scene": "https://www.techradar.com/news/loki-episode-4-post-credits-scene-explained",
    "Marvel Studios seems to be doing more and more of that": "https://www.techradar.com/news/kevin-feige-confirms-abomination-is-in-shang-chi-what-does-it-mean-for-the-mcu",
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Deadline": "https://deadline.com/2020/12/sif-mcu-jaimie-alexander-thor-love-and-thunder-and-loki-1234655160/",
    "awesome": "https://twitter.com/TaikaWaititi/status/730838535800938496"
  }
}