{
  "source": "https://www.techradar.com/news/knives-out-2-has-just-added-this-mcu-star-to-its-cast",
  "title": "Knives Out 2 on Netflix just cast a big MCU star",
  "category": "entertainment",
  "updated": "2021-05-11T13:57:47Z",
  "author": "tom-power",
  "summary": "Dave Bautista joins Netflix's Knives Out 2 cast",
  "article": [
    "Knives Out 2 won't be coming to Netflix any time soon, but the recent announcement of two more instalments in Rian Johnson's murder mystery movie series has excited fans nonetheless.",
    "Little is known about the sequel so far other than it'll see the return of Daniel Craig's Benoit Blanc – but it's all but confirmed that he'll be joined by an MCU star when the film eventually begins production.",
    "Dave Bautista, who plays Drax in Marvel's Guardians of the Galaxy movies, has joined the film's ranks in an undisclosed role. Baustista's involvement was initially reported by Deadline, with other reports – including Variety – following suit, with the latter reporting that Netflix had declined to comment on his apparent casting.",
    "Despite Netflix staying quiet on those reports, Bautista himself confirmed his involvement on his personal Twitter account. Retweeting Deadline's article on the casting news, Bautista tweeted \"Booyah!\" alongside the hashtag #dreamchaser.",
    "Check out Bautista's tweet below:",
    "Spoilers for Knives Out follow.",
    "Knives Out 2 won't be the first time that Craig and Bautista have shared screen time together. The duo battled it out in 2015 James Bond flick Spectre, with Bautista playing the role of the Spectre organization's top assassin called Mr. Hinx.",
    "It's not known if Bautista will end up being the primary antagonist in Knives Out 2, but he could be one of the story's chief suspects if the film follows a similar plot to its predecessor. In 2019's Knives Out, everyone was treated as a suspect as Blanc tried to find out who was responsible for author Harlan Thrombey's death. Knives Out 2 will almost certainly incorporate similar 'Whodunnit?' elements into its plot, so we reckon Bautista will be one of those questioned by Blanc at some point during the film.",
    "The next few years are set to be a busy time for Bautista. The Blade Runner 2049 and Stuber actor will be the lead star in Zack Snyder's Army of the Dead, which arrives on Netflix on May 21, and you'll be able to read our review ahead of release next week.",
    "Bautista will also play a supporting role in Warner Bros.' upcoming reboot of the sci-fi epic Dune, before lending his vocal talents to his Army of the Dead character - Scott Ward – for Netflix's animated prequel series Army of the Dead: Lost Vegas.",
    "As for Drax's Marvel future, Bautista will have a bit-part role in Thor: Love and Thunder, which arrives in May 2022. The actor will reprise his role two more times for the Guardians of the Galaxy Holiday Special (for Disney Plus), before filming Guardians Volume 3. Those two outings may be the final time that we see Bautista as Drax, though, if his recent comments on the subject are anything to go by."
  ],
  "headers": {
    "5": "Knives Out 2 is a James Bond reunion"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/05/dave-bautista-daniel-craig-rian-johnsons-knives-out-2-netflix-1234752608/",
    "Variety": "https://variety.com/2021/film/news/dave-bautista-knives-out-sequel-1234970064/",
    "Army of the Dead": "https://www.techradar.com/news/zack-snyders-army-of-the-dead-trailer-is-here-and-it-features-a-zombie-tiger",
    "Dune": "https://www.techradar.com/news/dune-cast-release-date-trailer",
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "recent": "https://www.techradar.com/news/guardians-of-the-galaxy-may-have-a-post-james-gunn-mcu-future-heres-how",
    "comments": "https://www.techradar.com/news/guardians-3-could-be-dave-bautistas-final-drax-outing-heres-why"
  }
}