{
  "source": "https://www.techradar.com/news/microsoft-is-treating-windows-11-as-a-work-in-progress-and-that-sucks",
  "title": "Microsoft is treating Windows 11 as a work in progress, and that sucks",
  "category": "computing",
  "updated": "2021-10-11T11:32:50Z",
  "author": "matt-hanson",
  "summary": "Opinion: Is the future of Windows 11 a good one?",
  "article": [
    "Windows 11 launched last week, but if you’ve already downloaded and installed it, you’re still not getting the final product, as Microsoft is continuing to add new features.",
    "At the risk of sounding like an old man, back in the day when an operating system launched, you pretty much got the final product, bar a few updates to address any issues. Major changes or new features were usually reserved for ‘Service Packs’ and other big releases.",
    "With high-speed broadband now being more commonplace in people’s homes, operating system makers such as Microsoft have been putting out ever larger updates to their operating systems, and Windows 10 largely paved the way for operating systems to get several large updates throughout their lifetime that bring some major new changes.",
    "In many ways, this is for the best. The Windows 10 that many of us use today is quite different from the Windows 10 that launched five years ago, and in that time Microsoft has added some genuinely useful new features (while also breaking quite a few things as well).",
    "So, it was always inevitable that with Windows 11, Microsoft would continue to update and improve it as time went on. However, the downside of that is that – for the moment at least – it makes Windows 11 feel unfinished.",
    "While we’ve seen Microsoft do this before, why does Windows 11 feel like a work in progress, when even Windows 10 didn’t? There’s a few factors at play here.",
    "For a start, when Windows 10 came out, it represented a big change from its unloved predecessor, Windows 8.1. That meant a whole new look and feel for the operating system. Microsoft was keen to distance itself from the Windows 8 era as much as possible – and even the name was a statement of intent, skipping ‘9’ to show that Windows 10 was a big update.",
    "Microsoft also made it clear early on that it would be updating Windows 10 regularly, even going as far as to say that it would be the last version of Windows. So, when those big updates started arriving, it felt like part of a plan.",
    "Given that promise, though – of a final Windows version – many people were surprised when Windows 11 was announced. And as we point out in our Windows 11 review, the operating system doesn’t feel like a major leap from Windows 10 so far.",
    "What’s worse is that we’re seeing hints of new apps and features already being on the way, including a new and improved Notepad app, one of Windows’ most iconic tools.",
    "As Neowin reports, a new design for Notepad appears to have been accidentally leaked by a Microsoft employee. While it’s not a major design change, it brings it more in line with other built-in apps in Windows 11.",
    "Of course, this raises the question of why the new design wasn’t included in Windows 11 for launch. Instead, the operating system launched with some new-look apps, while others remain the same, giving the launch a bit of a rushed feel.",
    "WinCentral also reports that the popular Your Phone app, which lets you interact with your smartphone (such as viewing and replying to text messages) is due to get a redesign soon.",
    "While this is welcome news, it again leads to the feeling that Windows 11 launched too early. It’s unfortunate, as Windows 11 is a decent operating system, but Microsoft’s work-in-progress approach is beginning to undermine the hard work that’s gone into making the OS.",
    "With some of Windows 11’s biggest changes, such as the introduction of Android apps into the Microsoft Store, not coming until later, there will be an increasing number of people who’ll start to feel like the operating system was only half finished. That’s not something Microsoft will want."
  ],
  "headers": {
    "5": "Updates already?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 8.1": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-8-1-1161745/review",
    "would be the last version of Windows": "https://www.techradar.com/news/software/operating-systems/microsoft-confirms-there-will-be-no-windows-11-1293309",
    "Windows 11 review": "https://www.techradar.com/reviews/windows-11",
    "As Neowin reports": "https://www.neowin.net/news/microsoft-is-working-on-a-redesigned-notepad-app-for-windows-11/",
    "WinCentral also reports": "https://thewincentral.com/coming-soon-redesigned-your-phone-app-windows-voice-pack-downloads-in-microsoft-store%ef%bf%bc/"
  }
}