{
  "source": "https://www.techradar.com/news/yelp-will-let-your-business-tell-customers-about-your-mask-and-vaccination-policies",
  "title": "Yelp will let your business tell customers about your mask and vaccination policies",
  "category": "computing",
  "updated": "2021-08-05T22:32:21Z",
  "author": "anthony-spadafora",
  "summary": "Yelp has added new attributes and review bombing protection to its online review service",
  "article": [
    "As businesses implement new safety measures to protect their employees and patrons, the crowd-sourced review site Yelp is making it easier for them to inform potential customers regarding their mask and vaccination policies.",
    "Organizations with a Yelp for Business account will now be able to use both the “Proof of vaccination required” and the “All staff fully vaccinated” attributes on their company profiles.",
    "Yelp users can then filter by these attributes when searching for local businesses on the service to see which restaurants, bars, stores and venues require that customers provide proof of vaccination to enter. This can make things easier for both the businesses themselves as well as for customers who may be more at risk of contracting Covid-19.",
    "As more US states, counties and cities are encouraging people to once again wear masks, businesses that require their customers and staff to do so can let others know about their mask policies by using the “Masks required” and “Staff wears masks” attributes.",
    "According to a new blog post from Yelp, only businesses are able to add the “Proof of vaccination required” and “All staff fully vaccinated” attributes to their pages on the company's site.",
    "In order to add these attributes, organizations will first need to log into their Yelp for Business account. From there, they'll need to go to the Business Information section and click on \"Add\" next to “Amenities and more”. This will bring up the attribute list where businesses can click “Yes” next to any attributes they want to turn on.",
    "As restaurants, bars and other businesses have begun requiring their customers to be vaccinated, online backlash has led to their Yelp pages being “review bombed” with negative reviews over their policies. For organizations that add these new vaccination attributes, Yelp will put protective measures in place to proactively safeguard their pages from review bombing attempts.",
    "Now that Yelp has added new vaccination and mask attributes to its service, Google Maps and other similar services will likely follow suit."
  ],
  "headers": {
    "4": "Enabling vaccination and mask attributes"
  },
  "links": {
    "Yelp": "https://www.techradar.com/news/gaming/yelp-adds-a-pok-stop-filter-to-help-you-triumph-at-pok-mon-go-1324979",
    "Yelp for Business": "https://business.yelp.com/",
    "contracting Covid-19": "https://www.techradar.com/news/your-smartwatch-could-detect-covid-19-before-you-do",
    "blog post": "https://www.theverge.com/2021/8/5/22610865/yelp-vaccination-policies-businesses-staff-customers",
    "review bombed": "https://www.techradar.com/news/netflixs-he-man-reboot-has-been-panned-by-fans-and-its-creator-isnt-happy",
    "Google Maps": "https://www.techradar.com/news/major-google-maps-update-includes-useful-pandemic-feature"
  }
}