{
  "source": "https://www.techradar.com/news/we-may-have-our-first-glimpse-at-the-next-oneplus-nord-phone",
  "title": "We may have our first glimpse at the next OnePlus Nord phone",
  "category": "phones",
  "updated": "2021-03-21T14:30:48Z",
  "author": "david-nield",
  "summary": "But what will it be called?",
  "article": [
    "Last year saw OnePlus make a major push for some mid-range market share with the launch of the OnePlus Nord, which was swiftly followed up by the Nord N10 and the Nord N100. Now it looks as though a new Nord is on the horizon.",
    "Prolific leaker @OnLeaks has posted images of what is apparently the successor to the OnePlus Nord N10 5G, so it looks as though this is going to be towards the more affordable end of the mid-range spectrum.",
    "The device is apparently codenamed Ebba, but it's not clear what it will be sold as. The N11? The N20? Previous rumors suggest that OnePlus may actually go backwards in terms of numbering and call this phone the OnePlus Nord N1.",
    "Whatever it ends up being called, don't expect many changes from last year's N10. One of the biggest modifications would seem to be the repositioning of the fingerprint sensor from the back of the phone to the power button on the side.",
    "Otherwise it looks as though we're in for more of the same: a glossy plastic rear panel with a metal frame around the sides, a 6.49-inch display, and a single punch hole on the front of the phone to house the selfie camera.",
    "The dimensions of the new phone are said to be similar to the OnePlus Nord N10 5G, though the successor is apparently very slightly shorter and thinner. The headphone jack is sticking around, but it looks as though one rear camera lens might get dropped.",
    "As you can see from the images above, it doesn't seem that much is going to change in terms of the device aesthetics, though presumably there are going to be internal upgrades to update the phone for 2021.",
    "The N10 phone made its debut in October 2020, so it might be a while before we get to see this year's version. In the meantime, a OnePlus Nord 2 should also be in the pipeline, and we know that we're going to see the OnePlus 9 series on March 23."
  ],
  "headers": {},
  "links": {
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "@OnLeaks has posted": "https://www.voice.com/post/@onleaks/exclusive-first-look-at-the-oneplus-nord-n10-successor-1616242580-887550781",
    "OnePlus Nord N10 5G": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "Previous rumors": "https://www.techradar.com/news/the-next-oneplus-nord-might-continue-the-series-confusing-naming-scheme",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review"
  }
}