{
  "source": "https://www.techradar.com/news/a-birds-of-prey-spin-off-is-heading-to-hbo-max-despite-the-films-box-office-returns",
  "title": "A Birds of Prey spin-off is heading to HBO Max, despite the film's box office returns",
  "category": "entertainment",
  "updated": "2021-08-24T08:26:13Z",
  "author": "axel-metz",
  "summary": "It’ll focus on Black Canary",
  "article": [
    "A Birds of Prey spin-off project featuring heroine Black Canary is in early development at HBO Max, insiders have confirmed.",
    "The standalone movie will see Jurnee Smollett reprise her role as the DC comics character, while Misha Green – best known as the showrunner of the now-cancelled Lovecraft Country – will pen the script.",
    "Smollett herself confirmed the news on Twitter, saying that she is “so excited to finally embark on this adventure with my creative soul sis,” in reference to Green, whom she worked with on the canned HBO show.",
    "The pair are developing the project alongside DC Films president Walter Hamada and Birds of Prey producers Galen Vaisman and Sue Kroll, though no details surrounding the movie’s plot have been shared as yet.",
    "Black Canary (aka Dinah Lance) is one of DC’s oldest characters, having first appeared in early Flash comics during the late 1940s. In subsequent DC adventures, she has been more closely associated with Green Arrow, as both a partner and love interest, as well as with best friend Barbara Gordon.",
    "As for her supernatural abilities, Black Canary is known for her ear-splitting canary cry.",
    "The upcoming movie joins a growing roster of DC projects heading to HBO Max in the coming years, including movies focused on Batgirl and Blue Beetle, respectively, as well as a TV series centered on a Black Superman character, Val-Zod.",
    "Given Birds of Prey’s less-than-impressive box office performance, HBO’s sanctioning of a Black Canary spin-off seems at odds with the studio’s usual approach to show renewals and movie sequels.",
    "The Harley Quinn-led ensemble flick grossed $201 million worldwide when it released back in 2020, falling short of its reported break-even figure of $250 million (in pre-pandemic times, no less).",
    "But perhaps news of a spin-off indicates that Warner Bros. was creatively pleased with Birds of Prey, even if the film didn't generate the returns of the inferior Suicide Squad in 2016 – which topped out at $1 billion.",
    "According to Rotten Tomatoes, Birds of Prey is the fourth best-reviewed of the DCEU movies, just behind Shazam, Wonder Woman and James Gunn’s The Suicide Squad.",
    "Smollett's Black Canary – who initially works for Ewan McGregor's petulant, misogynistic Roman Sionis before turning on him in the movie – is one of its highlights. If Birds of Prey wasn't successful enough to get a proper sequel, it's nice that something good has been salvaged from it.",
    "In any case, fans seemed to welcome the announcement.",
    "There’s no word yet on when the film will arrive, but given that its early development has only just been confirmed, we wouldn’t anticipate a release earlier than 2023.",
    "Via THR"
  ],
  "headers": {
    "7": "Analysis: Building on box office disappointment"
  },
  "links": {
    "Birds of Prey": "https://www.techradar.com/reviews/birds-of-prey",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Twitter": "https://twitter.com/jurneesmollett/status/1428867045261721611",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "THR": "https://www.hollywoodreporter.com/movies/movie-news/birds-of-prey-spinoff-in-the-works-with-misha-green-jurnee-smollett-1235000948/"
  }
}