{
  "source": "https://www.techradar.com/news/verizon-and-amazon-are-teaming-up-to-boost-rural-broadband",
  "title": "Verizon and Amazon are teaming up to boost rural broadband",
  "category": "computing",
  "updated": "2021-10-26T17:30:16Z",
  "author": "anthony-spadafora",
  "summary": "New strategic collaboration will pair Verizon's mobile network with Project Kuiper satellites",
  "article": [
    "Verizon and Amazon have announced a new strategic collaboration which will see the US telecom leverage the ecommerce giant's Project Kuiper to deliver improved connectivity to rural and remote communities in the US.",
    "Just like Space X's Starlink, Project Kuiper is an initiative to increase broadband access on a global scale by using a constellation of 3,326 satellites in low Earth orbit (LEO) around the planet. Once complete, the system will service individual households, schools, hospitals, businesses and other organizations that operate in places where internet access is either limited or unavailable.",
    "Amazon has already committed an initial $10bn to fund Project Kuiper which will deliver fast, affordable broadband to customers and communities around the world.",
    "Chairman and CEO of Verizon, Hans Vestberg explained how this new strategic collaboration will build on the company's existing partnership with Amazon in a press release, saying:",
    "“Project Kuiper offers flexibility and unique capabilities for a LEO satellite system, and we’re excited about the prospect of adding a complementary connectivity layer to our existing partnership with Amazon. We know the future will be built on our leading 5G network, designed for mobility, fixed wireless access and real-time cloud compute. More importantly, we believe that the power of this technology must be accessible for all. Today’s announcement will help us explore ways to bridge that divide and accelerate the benefits and innovation of wireless connectivity, helping benefit our customers on both a global and local scale.”",
    "As part of their new strategic collaboration, Project Kuiper and Verizon have already begun to develop technical specifications and define preliminary commercial models for a range of connectivity services aimed at consumers in the US and global enterprise customers operating in rural and remote locations around the world.",
    "The two companies will begin by focusing on expanding Verizon data networks using cellular backhaul solutions from Project Kuiper. This integration will use antenna development which is already in progress from the Project Kuiper team and engineering teams from both Verizon and Amazon are now working together to define technical requirements to help extend fixed wireless coverage to rural and remote communities across the US.",
    "Amazon CEO Andy Jassy explained that boosting rural broadband will require multiple companies to work together if they want to close the digital divide, saying:",
    "“There are billions of people without reliable broadband access, and no single company will close the digital divide on its own. Verizon is a leader in wireless technology and infrastructure, and we’re proud to be working together to explore bringing fast, reliable broadband to the customers and communities who need it most. We look forward to partnering with companies and organizations around the world who share this commitment.”",
    "Businesses interested in partnering with Amazon and the Project Kuiper team can send an email to kuiper-partners@amazon.com to learn more about its upcoming low Earth orbit satellite system."
  ],
  "headers": {
    "5": "Boosting rural broadband"
  },
  "links": {
    "Project Kuiper": "https://www.techradar.com/news/amazon-snaps-up-facebooks-mobile-internet-arm",
    "Starlink": "https://www.techradar.com/news/everything-you-need-to-know-about-spacexs-starlink-plans-for-space-internet",
    "broadband": "https://www.techradar.com/broadband/broadband-deals",
    "initial $10bn": "https://www.techradar.com/news/amazon-to-launch-3000-internet-satellites-into-orbit",
    "press release": "https://www.globenewswire.com/news-release/2021/10/26/2320586/0/en/5G-LEO-Verizon-and-Project-Kuiper-team-up-to-develop-consumer-and-enterprise-connectivity-solutions.html",
    "Verizon": "https://www.techradar.com/deals/the-best-verizon-deals-sales-discounts",
    "digital divide": "https://www.techradar.com/news/the-digital-divide-is-worse-than-we-thoughtful"
  }
}