{
  "source": "https://www.techradar.com/news/these-budget-wireless-earbuds-are-even-cheaper-for-cyber-monday",
  "title": "These budget wireless earbuds are even cheaper for Cyber Monday",
  "category": "audio-visual",
  "updated": "2021-11-29T08:56:17Z",
  "author": "olivia-tambini",
  "summary": "Don't want to spend a lot on your wireless earbuds? You don't have to...",
  "article": [
    "Wireless earbuds can be very expensive, but this Cyber Monday deal proves that you don't have to break the bank if you need a new pair of in-ear headphones.",
    "Usually $29.99, Amazon has slashed the price of the 1MORE Piston Fit Wireless Earbuds to $19.99 - a neat saving of over $13 on these already budget-friendly buds. (Not in the US? Scroll down for the best deals in your region.)",
    "That's not all - you can save even more on these 1MORE buds if you check the box that says 'Save an extra 35% when you apply this coupon'.",
    "Full disclosure: we haven't tested the 1MORE Piston Fit Wireless Earbuds ourselves, but 1MORE is a trusted brand we are confident in recommending - in fact, the 1MORE Triple Driver In-ear Headphones are our pick for the best earbuds you can buy in 2021.",
    "The specs on offer here are very promising. For a mere $20, you're getting Bluetooth 5 connectivity, an eight-hour battery life, and an IPX4 water-resistance rating, which means you should be able to use these in-ear headphones while working out.",
    "Inside the buds are 10mm dynamic drivers, which 1MORE says will deliver \"crystal clear sound\", while angled eartips mean they should feel comfortable during long listening sessions.",
    "The earbuds themselves are also magnetic - so when you're not listening to music, you can snap them together to create a secure, necklace-like shape.",
    "No matter where you live, you'll find all the lowest prices for 1MORE in-ear headphones from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best cheap Cyber Monday earbuds deal",
    "7": "More 1MORE in-ear headphones deals",
    "8": "More Cyber Monday deals"
  },
  "links": {
    "Cyber Monday deal": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "1MORE Piston Fit Wireless Earbuds to $19.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2F1MORE-Bluetooth-Headphones-Waterproof-Ergonomic%2Fdp%2FB07VRLB1L1%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1446437533977647000-20",
    "1MORE Triple Driver In-ear Headphones": "https://www.techradar.com/reviews/1more-triple-driver-in-ear-headphone"
  }
}