{
  "source": "https://www.techradar.com/news/plans-for-google-pay-banking-service-pulled",
  "title": "Plans for Google Pay banking service pulled",
  "category": "computing",
  "updated": "2021-10-04T11:21:37Z",
  "author": "sead-fadilpasic",
  "summary": "Google Plex was announced back in 2020, but never took off",
  "article": [
    "Google appears to have pulled the plug on Plex, a banking and personal finance service it had been developing for almost a year.",
    "As reported by The Wall Street Journal, the company confirmed it has canceled the project after missing multiple deadlines and seeing key workers leave the company.",
    "But Google says it won’t give up on the idea of having an app to simplify paying for things and managing their finance. Speaking to The Verge, Google said it still believes there is demand for such an app, and that it will now focus on “delivering digital enablement for banks and other financial services providers rather than us serving as the provider of these services.”",
    "This could mean different Plex features showing up in Google Pay at some point in the future.",
    "Google announced in late 2020 that it would be transforming its Google Pay app into a personal finance hub, with the revamp focused on both consumers and businesses. The goal of the transformation was to create a place that would simplify sending funds to friends and family, much like Venmo.",
    "The company also wanted users to use Google Pay, which has around 150 million monthly active users, when paying bills at commonly used outlets, restaurants and gas stations, as well as to redeem money off discounts and other promotional offers.",
    "But the idea was not to compete with the banks, but rather to partner with them. Banks and financial institutions would have provided the accounts without monthly or overdraft fees and without minimum balances.",
    "Among the banks Google initally planned to partner with were Citi and SEFCU, with a total of 11 banks were planned in the initial rollout.",
    "Via: The Wall Street Journal"
  ],
  "headers": {
    "4": "Partnering with banks"
  },
  "links": {
    "personal finance": "https://www.techradar.com/best/best-personal-finance-software",
    "The Verge": "https://www.theverge.com/2021/10/1/22704500/google-pay-plex-canceled-checking-savings-accounts",
    "The Wall Street Journal": "https://www.wsj.com/articles/google-is-scrapping-its-plan-to-offer-bank-accounts-to-users-11633104001"
  }
}