{
  "source": "https://www.techradar.com/news/nothing-ear-1-launch-date-confirmed-for-latest-true-wireless-earbuds-challenger",
  "title": "Nothing Ear 1 launch date confirmed for latest true wireless earbuds challenger",
  "category": "audio-visual",
  "updated": "2021-06-29T13:40:23Z",
  "author": "john-mccann",
  "summary": "The date is set for the next Apple AirPods competitor",
  "article": [
    "We now know when we'll get our first proper look at the latest true wireless earbuds entrant to the market – the Nothing Ear 1 launch date is set for July 27.",
    "We still don't know a great deal about the new company, founded by former OnePus co-founder Carl Pei, and while some small nuggets have slipped out its first product – the Ear 1 – information is thin on the ground here too.",
    "The good news for those closely following Nothing is more will be revealed in the coming weeks.",
    "The Nothing Ear 1 launch will take place on July 27, with the event kicking off at 4am PDT / 9am EDT / 2pm BST / 11pm AEST.",
    "We expect the Ear 1 launch event will be an online-only affair with a live stream available to watch – but we're awaiting confirmation from Nothing on this. For now, you can sign up for notifications via the Nothing website.",
    "As for what to expect from its first product, Nothing claims the Ear 1 buds will have a \"stripped-down aesthetic\", which could see them borrow design elements from both the Sony WF-1000XM3 and the Apple AirPods' ear stems if a previous teaser image is anything to go by.",
    "The Ear 1 earbuds will be the first in an ecosystem of products from Nothing, with the firm previously mentioning that it plans to launch a number of devices across various verticals – including smart home devices.",
    "There's no set timing or further details for any other products just yet, but we may learn more about the company's vision during the Ear 1 launch on July 27."
  ],
  "headers": {
    "5": "Just the start"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "some": "https://www.techradar.com/news/nothing-admits-its-earbuds-fall-short-of-vision-as-name-and-launch-date-revealed",
    "small": "https://www.techradar.com/news/carl-peis-nothing-oneplus-co-founder-teases-wireless-earbuds-and-smart-home-devices",
    "nuggets": "https://www.techradar.com/news/nothing-unveils-its-product-design-principles-ahead-of-launch",
    "via the Nothing website": "https://nothing.tech/",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "a previous teaser image": "https://www.techradar.com/news/nothing-admits-its-earbuds-fall-short-of-vision-as-name-and-launch-date-revealed"
  }
}