{
  "source": "https://www.techradar.com/news/ipad-mini-6-ditches-the-home-button-switches-to-usb-c-in-unofficial-renders",
  "title": "iPad Mini 6 ditches the home button, switches to USB-C in unofficial renders",
  "category": "tablets",
  "updated": "2021-06-12T10:30:05Z",
  "author": "david-nield",
  "summary": "Like a miniature iPad Pro",
  "article": [
    "Fresh from revamping the iPad Pro, Apple could be turning its attention to the iPad Mini next – unofficial renders purporting to show the 6th-generation iPad Mini show a distinctly iPad Pro-like design, with thinner bezels and a USB-C port for connectivity.",
    "The pictures come courtesy of well known tipster Jon Prosser over at FrontPageTech: the renders are apparently based on device schematics, CAD files and real hands-on images of the new iPad Mini, though Apple's own renders will look slightly different.",
    "This would be quite a dramatic design shift from the 2019 iPad Mini, though not a surprising one, as Apple shifts all of its tablets over to the more modern look. The iPad Air 4 was given the same treatment last year.",
    "The dimensions of the new tablet are said to be almost identical to the existing one, coming in at 206.3mm x 137.8mm x 6.1mm (that's 8.12 inches x 5.43 inches x 0.24 inches). The home button is gone, but Touch ID isn't – it has apparently been moved to the power button, as it was on the iPad Air.",
    "The speakers are rumored to have been given a serious upgrade, according to Prosser's sources, and silver, black and gold will be the color options. The Lightning port is set to be replaced with USB-C to bring it into line with the iPad Pro and iPad Air.",
    "As for Apple Pencil support, Prosser says that a brand new, smaller Apple Pencil will be unveiled alongside the new compact tablet. This might be specifically for the iPad Mini (which already supports the original Apple Pencil), or could be a new stylus for all of the tablets in Apple's current range.",
    "With the last iPad Mini refresh a minor one in 2019, perhaps the biggest surprise is that there's a new device on the way at all. If there is an incoming iPad Mini 6, then all the indications are that it's going to get an official unveiling at some point in 2021.",
    "There's also been talk of an 8.7-inch iPad Mini Pro version to go alongside the standard 7.9-inch model, but there's no mention of that in the latest leak. Previous rumors have pointed to the repositioning of the Touch ID button on the iPad Mini 6, and when it does arrive we would expect it to be ready for iPadOS 15."
  ],
  "headers": {},
  "links": {
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPad Mini": "https://www.techradar.com/reviews/ipad-mini-2019",
    "6th-generation iPad Mini": "https://www.techradar.com/reviews/ipad-mini-2021",
    "FrontPageTech": "https://www.frontpagetech.com/2021/06/11/exclusive-first-look-at-newly-redesigned-ipad-mini-6/",
    "2019 iPad Mini": "https://www.techradar.com/reviews/ipad-mini-2019",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "at some point in 2021": "https://www.techradar.com/news/ipad-mini-6-could-still-land-this-year",
    "been talk": "https://www.techradar.com/news/ipad-mini-pro-could-launch-this-year-as-well-as-the-ipad-mini-6",
    "ready for iPadOS 15": "https://www.techradar.com/news/new-ipados-15"
  }
}