{
  "source": "https://www.techradar.com/news/8-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend",
  "title": "8 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-07-23T14:00:00Z",
  "author": "axel-metz",
  "summary": "Here’s what’s dropping on streamers this weekend",
  "article": [
    "In light of last weekend’s underwhelming roster of new streaming additions (we’re looking at you, Space Jam: A New Legacy), the next few days sees a decidedly stronger mix of movies and TV shows arriving on the likes of Netflix, Amazon Prime and HBO Max.",
    "This week, we’re treated to everything from original crime thrillers and weepy rom-coms to music documentaries and animated superhero series. Hell, even the humble sports drama gets a look in with the return of the excellent Ted Lasso on Apple TV Plus.",
    "Below, we round up eight of the best new movies and TV shows to sink your teeth into this weekend – not forgetting the customary Disney Plus arrivals, Marvel fans.",
    "Arguably Apple’s most successful streaming property to date, Ted Lasso season 2 arrives on Apple TV Plus this weekend to alleviate those Euro 2020 withdrawal symptoms (depending on where you’re reading this, of course).",
    "The soccer-based, Jason Sudekis-led series hit all the right notes with its debut season back in 2020, and its second installment is expected to deliver more of the same drama, humor and heartwarming moments that made the first so popular with critics and audiences alike. Judging by the first episode, the introduction of new characters and subplots will make season 2 feel entirely fresh, too.",
    "Episode one (of 12) is available to stream now, with new episodes dropping every Friday until October 8.",
    "Now available to stream on Apple TV Plus",
    "Remember He-Man? Of course you do. Picking up where the 1980s animated series He-Man and the Masters of the Universe left off, this Netflix original traces the subsequent adventures of the famed superhero.",
    "It’s supposedly aimed at adult audiences, with more dialogue and narrative complexity than you’d otherwise expect from a swords-and-sorcery series, but the show’s classic visual style remains intact. What’s more, the likes of Mark Hamill, Kevin Conroy, Sarah Michelle Gellar, Chris Wood, Lena Heady and Alicia Silverstone should ensure this won’t be a shallow affair.",
    "Masters of the Universe: Revelation will air in two parts, so only five episodes are available to stream today, with the remainder set to follow later in the year.",
    "Now available to stream on Netflix",
    "Kate Beckinsale returns to the screen this week as a woman with a rare neurological disorder who uses electricity to limit her violent outbursts. After waking up to find the man she loves murdered, she sets out on a rage-filled quest for answers.",
    "This doesn’t seem like the most original premise in the world – it’s a revenge thriller with a twist – but a cast which includes Stanley Tucci, Bobby Cannavale, Jai Courtney, Laverne Cox and Susan Sarandon make Jolt at least worth a look in.",
    "There’s been no critical reaction as yet, so we’re all going in blind.",
    "Now available to stream on Amazon Prime Video",
    "We all like a good cry, don’t we? The Last Letter From Your Lover is the latest theatrical adaptation of a Jojo Moyes' romance novel (after 2016’s Me Before You), and sees a journalist set out to solve the mystery of a secret affair after finding a trove of love letters from the 1960s.",
    "Shailene Woodley, Felicity Jones, Joe Alwyn and Callum Turner all star in a story that bears more than a few hallmarks of other weepy rom-coms, not least The Longest Ride. Again, there’s been no critical reaction to this one just yet, but the near-universal praise bestowed upon Moyes’ 2008 novel looks set to ensure The Last Letter From Your Lover isn’t all style and no substance.",
    "It’s available to stream on Netflix in the US today, with UK audiences having to wait until August 6. It’s also in theatres, mind, so Britons can still watch it right now by heading to the nearest cinema.",
    "Now available to stream on Netflix in the US",
    "A series adaptation of the 1989 film starring Tom Hanks, Turner & Hooch sees U.S. Marshal Josh Peck unwillingly forced into caring for a destructive canine companion.",
    "Kick Ass’ Lyndsy Fonseca also stars alongside Carra Patterson, with Burn Notice creator Matt Nix on hand as executive producer on the 12-episode show. We don’t expect big things from this one, but Turner & Hooch might be the mindless break we all need from the complexity of recent Disney adventures (read: Loki).",
    "Now available to stream on Disney Plus",
    "Continuing Marvel’s behind-the-scenes Assembled series this week – after equivalent episodes for WandaVision and The Falcon and the Winter Soldier before it – is the Making of Loki, which, as you’ll have guessed, shines a light on the sets and special effects used to bring Disney’s latest MCU adventure to life.",
    "In this one-off special, we hear from the actors, writers, directors, and costume and set designers involved in producing the show, which has already been commissioned for a second season.",
    "Expect to see as much mischief unfold behind the camera as in front of it.",
    "Now available to stream on Disney Plus",
    "You’ve heard of the disastrous Fyre Festival, but what about Woodstock ‘99? The first film in Bill Simmons' Music Box HBO series, Woodstock 99: Peace, Love, and Rage charts the collapse of the 1999 Woodstock festival, which saw attendees subject to extreme heat, crowd violence and primal behaviour.",
    "Future films in Simmons’ series, which are set to arrive later this year, will look at the likes of Alanis Morissette, DMX, Kenny G and more – but Woodstok 99 is a pretty chaotic place to start.",
    "If anything, it might make you grateful for being tucked up in front of the TV.",
    "Now available to stream on HBO Max in the US",
    "Ladies and gentlemen, welcome to television in 2021. Netflix’s Sexy Beasts is, at its core, a well-intentioned blind-dating series – but there’s a catch. Quite a big one, actually. In this show, singletons will date three different suitors, all of whom have been turned – wait for it – into animals via prosthetics. Yes, animals.",
    "You won’t be surprised to learn that the Hollywood FX veterans behind these furry monstrosities are the same as those responsible for The Masked Singer. You also won’t be surprised to learn that Sexy Beasts has taken the internet by storm.",
    "We’ll let you decide for yourself if this one is worth your time.",
    "Now available to stream on Netflix"
  ],
  "headers": {
    "3": "Ted Lasso season 2 (Apple TV Plus)",
    "7": "Masters of the Universe: Revelation (Netflix)",
    "11": "Jolt (Amazon Prime Video)",
    "15": "The Last Letter From Your Lover (Netflix)",
    "19": "Turner & Hooch (Disney Plus)",
    "22": "Marvel Studios Assembled: Making of Loki (Disney Plus)",
    "26": "Woodstock 99: Peace, Love, and Rage (HBO Max)",
    "30": "Sexy Beasts (Netflix)"
  },
  "links": {
    "Space Jam: A New Legacy": "https://www.techradar.com/news/space-jam-a-new-legacy-isnt-the-sequel-that-the-original-deserved",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2s-humor-and-heart-will-cure-your-soccer-blues",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Ted Lasso season 2": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know",
    "the first episode": "https://www.techradar.com/news/ted-lasso-season-2s-humor-and-heart-will-cure-your-soccer-blues",
    "Masters of the Universe: Revelation": "https://www.techradar.com/news/masters-of-the-universe-revelation-part-1-is-the-subversive-revival-that-he-man-deserves",
    "Loki": "https://www.techradar.com/news/loki-episode-6-ending-explained",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "second season": "https://www.techradar.com/news/loki-season-2"
  }
}