{
  "source": "https://www.techradar.com/news/why-prime-day-is-the-perfect-time-to-finally-invest-in-a-home-security-camera",
  "title": "Why Prime Day is the perfect time to finally invest in a home security camera",
  "category": "smart-home",
  "updated": "2021-06-19T07:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Grab big savings and secure your home at the same time",
  "article": [
    "The best home security cameras let you keep an eye on your home from the comfort of your phone even when you’re out and about.",
    "If you’re planning to finally upgrade your home security system with cameras, then hold out until this year's Prime Day deals as we’re sure to see some bigger bargains.",
    "Amazon Prime Day, which is taking place on June 21 and 22 this year, is a mid-year sale that sees some significant savings from the online retailer across a range of products from laptops and smartphones to small appliances and even some of the best smart home devices.",
    "A single home security camera can set you back anywhere from $35 / £35 / AU$U$100 to $400 / £449 / AU$600 at any other time of the year - and chances are you’ll want two or three cameras to ensure the front and rear of your home is fully covered.",
    "This can make it a pricey purchase, but Prime Day is the ideal time to improve your home’s security without breaking the bank - so here’s how to plan to win during Prime Day and secure your home in the way you’ve been meaning to for ages.",
    "As we’ve already mentioned, home security cameras range in price greatly, but you can save anywhere from 30% to 45 % on Prime Day, based on our analysis of previous drops on Prime Day in years gone by.",
    "For example, on Prime Day 2020, Amazon knocked 30% of the Blink Mini home security cameras. This is one of the most affordable wired security cameras on the market and usually retails for $35 / £35 but it was discounted down to $24.99 / £24.99 - its lowest price ever, and has already been subject to decent discounts in the lead up to Prime Day.",
    "If you prefer the idea of battery-powered home security cameras, you can also find some hefty discounts on these too.",
    "The Arlo Pro 3 security camera system, which has a rechargeable battery but Arlo claims will last between three and six months before it needs recharging was also discounted by 30% on Prime Day last year.",
    "The security camera, which comes in kits with two, three or four cameras along with a hub, was relatively new, having been launched in mid-2019.",
    "It’s also worth checking other retailers on Prime Day too, as while the sale is an Amazon event, many high-street retailers will match the prices found online, and in some cases even try to beat them.",
    "For many homes traditional CCTV systems that require wires running through every room are not practical and, as they should be professionally installed, are just too expensive for many budgets.",
    "However, Wi-Fi security cameras store footage recorded by the cameras either in a secure area online or locally to a micro SD card rather than on a small PC in the home, making them far more appalling to the average consumer.",
    "As they can also be self-installed with a few screws, and there’s a choice when it comes to the way they’re powered; mains-powered home security camera need to be positioned near an outlet so you may need to call an engineer but battery-operated cameras that last between three and six months before the battery needs changing mean there’s no need to get a professional in. They’re also more affordable than a CCTV system too.",
    "Wi-Fi home security cameras send an alert to your smartphone when motion is detected in the camera’s field of view, in a similar way to the best video doorbells.",
    "You can either log in live and view the real-time feed from the camera, because the camera also stores the footage of motion, you can choose to ignore the notification and review the video at a later date.",
    "It’s worth noting that while some home security cameras offer free video storage, many including Arlo, Ring and Google Nest require a monthly subscription that will set you back around $2.99 / £2.49 / AU$4.49 per month.",
    "Some cheaper home security cameras are designed to be used indoors only (as they’re easily damaged by the elements) and should be placed close to an entrance in your property, while others are weather-proof and can be used outdoors, although these often require some DIY to be mounted to a wall or outbuilding, so if you’re not with a drill and a screw driver these might be best avoided.",
    "Can’t wait until Prime Day? Then check out these great home security camera deals now",
    "You can choose from home security cameras that connect directly to your Wi-Fi network, and those that use a hub (sometimes called a base station) - this can be handy if you have poor Wi-Fi in your home, but often also provides local storage for the videos recorded by the camera too."
  ],
  "headers": {
    "5": "How much can I save on Prime Day?",
    "11": "What you need to know about home security cameras"
  },
  "links": {
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Blink Mini": "https://www.techradar.com/reviews/blink-mini",
    "already been subject to decent discounts": "https://www.techradar.com/deals/ring-video-doorbell-deal-get-the-latest-model-for-its-lowest-price-ever",
    "Arlo Pro 3": "https://www.techradar.com/reviews/arlo-pro-3",
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells"
  }
}