{
  "source": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
  "title": "Intel is set to spend billions on two new chip factories",
  "category": "computing",
  "updated": "2021-03-24T13:10:51Z",
  "author": "mayank-sharma",
  "summary": "Chip giant will also start making silicon for external clients",
  "article": [
    "New Intel CEO Pat Gelsinger has revealed plans to invest $20 billion in two new chipmaking factories as he looks to kick-start the company's fortunes.",
    "Gelsinger shared the plans for the new fabrication units in Arizona during an annual webcast announcing what he called his IDM 2.0 vision, an overhauled take on Intel’s integrated device manufacturing (IDM) model.",
    "“Intel is the only company with the depth and breadth of software, silicon and platforms, packaging, and process with at-scale manufacturing customers can depend on for their next-generation innovations,” Gelsinger said.",
    "Gelsinger shared screen-time with Arizona Gov. Doug Ducey and U.S. Secretary of Commerce Gina Raimondo as he announced plans to create the new fabrication units that will create several thousand jobs.",
    "Even as Gelsinger re-affirmed that Intel will continue to manufacture the majority of its products internally, he also stressed on the importance of extending their collaboration with third-party foundries, for both client and data center segments.",
    "The major announcement however is the setting up of a new Intel Foundry Services division, which will drive Intel’s efforts to manufacture chips for other commercial customers.",
    "Gelsinger noted that the new division will develop x86, Arm, and RISC-V core chips for external clients. The new foundries will be located in the US and Europe, with Intel already reportedly partnered with the likes of IBM, Qualcomm, Microsoft, Google and others.",
    "The inclusion of Google is interesting as the search giant recently announced its own Systems-on-a-Chip (SoC)-based strategy to ramp up its cloud computing infrastructure.",
    "Gelsinger’s IDM 2.0 strategy comes at what’s perhaps an inflection point for the semiconductor industry. With Arm and AMD both making in-roads into the server segment once dominated by Intel, the new strategy is perhaps the shot in the arm the company needs to turn things around.",
    "Via: The Verge"
  ],
  "headers": {
    "4": "Three-pronged approach"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "data center": "https://www.techradar.com/news/best-colocation-hosting",
    "Systems-on-a-Chip (SoC)-based strategy": "https://www.techradar.com/news/google-cloud-is-pushing-ahead-with-building-its-own-chips",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "The Verge": "https://www.theverge.com/2021/3/23/22347250/intel-new-factories-arizona-20-billion-chips-outsourcing-foundry-services-manufacturing"
  }
}