{
  "source": "https://www.techradar.com/news/james-webb-space-telescope-finally-gets-a-launch-date",
  "title": "James Webb Space Telescope finally gets a launch date",
  "category": "appliances",
  "updated": "2021-09-09T11:57:59Z",
  "author": "john-loeffler",
  "summary": "The next-gen space telescope is set for an end-of-year launch",
  "article": [
    "The long-delayed James Webb Space Telescope has a new end-of-year launch date, NASA confirmed on Wednesday.",
    "In conjunction with the European Space Agency and Canadian Space Agency, NASA will launch the new telescope from a South American launch site in Kourou, French Guiana, on December 18, 2021, in what is going to be one of the most highly anticipated space launches ever.",
    "The new space telescope has passed its final testing and now with the successful July launch of the Ariane 5 rocket that will carry it into orbit, the road is clear for the next-gen space telescope to lift off this year.",
    "Originally slated for an August 2020 launch, the James Webb Space Telescope is set to become the single most powerful telescope humanity has ever put into service; it's expected to be a major step up from the already incredibly powerful Hubble Space Telescope.",
    "\"Webb is an exemplary mission that signifies the epitome of perseverance,” Gregory L. Robinson, Webb’s program director at NASA, said. “I am inspired by our dedicated team and our global partnerships that have made this incredible endeavor possible. Together, we’ve overcome technical obstacles along the way as well as challenges during the coronavirus pandemic.\"",
    "\"Now that we have an observatory and a rocket ready for launch, I am looking forward to the big day and the amazing science to come.”",
    "The new telescope is expected to see much farther than even Hubble is capable, capturing the furthest – and thus, oldest – galaxies in our universe as well as providing a fresh look at objects in our own solar system.",
    "A lot of the most exciting parts of the James Webb Space Telescope are also what makes everything around it so anxiety inducing.",
    "The extremely delicate deployment of this next-gen telescope will take weeks as it is lifted into space, where it will then be carried 1.5 million kilometers to the so-called second Lagrange point, or L2, where its massive mirrors will unfurl.",
    "This puts it far beyond the orbit of the moon; the choreography of getting the telescope into position alone is tricky. Then we have to hope that nothing got damaged along the way - since if it did, good luck repairing it.",
    "That said, if everything goes according to plan, we'll be able to see almost as far back into the early universe as physically possible, from today all the way back to the earliest structures that formed after the Big Bang and just about everything in between. High stakes, but high rewards, for sure."
  ],
  "headers": {
    "7": "Analysis: about as exciting – and tense – a space launch as it gets"
  },
  "links": {
    "confirmed": "https://www.nasa.gov/press-release/nasa-readies-james-webb-space-telescope-for-december-launch",
    "James Webb Space Telescope": "https://www.nasa.gov/mission_pages/webb/about/index.html"
  }
}