{
  "source": "https://www.techradar.com/news/oneplus-confirms-a-major-nord-2-and-oneplus-9-problem-will-finally-get-fixed",
  "title": "OnePlus confirms a major Nord 2 and OnePlus 9 problem will finally get fixed",
  "category": "phones",
  "updated": "2021-07-26T08:52:52Z",
  "author": "tom-bedford",
  "summary": "The debacle ends",
  "article": [
    "With such a dedicated fan base, OnePlus phones rarely get into hot water for any issues or problems, with a major exception being the ongoing performance throttling debacle surrounding the OnePlus 9 series (more on that below). It seems, though, that's finally over.",
    "In a comment to Android Police, OnePlus confirmed that this performance problem was also in place on the new Nord 2 and the OnePlus 9R - but an impending fix would be issued to address it.",
    "Soon, instead of throttling performance on certain apps, you'll be able to opt out of these optimizations to ensure more processing power for all functions. Apparently, this update will come with OxygenOS 12, the next version of OnePlus' phone software, whenever that comes out.",
    "That sounds like an important fix for the performance issue - one that OnePlus phone users will likely gladly take - though the company's reputation among its hard-core fans might take longer to bounce back.",
    "Like many tech publications, TechRadar gave the OnePlus 9 and 9 Pro high scores in our reviews when they launched in April. However, in early July, Anandtech published an in-depth analysis of the handsets which proved something dodgy was happening in the performance area.",
    "According to Anandtech, while the OnePlus 9 series use top chipsets, you might not get the most of them, as the software throttles different apps to reduce the amount of performance power they can use. This means you won't be getting the top processing power from the majority of the apps you try.",
    "Some of the few apps still allowed access to the full limits of the chipset were benchmarking tools (used for testing the power of phones), which could be seen as benchmark manipulation, as these tools were getting more performance power than your average app.",
    "The biggest name for these apps, Geekbench, pulled the OnePlus 9 series' listings in its records as a result.",
    "The likely cause of this performance fiddling was to improve the phones' battery life, though it's not clear how much power could be saved through this throttling.",
    "OnePlus issued a series of statements to various websites as the debacle broke, but some of them contradicted Anandtech's findings - OnePlus' most recent comment to Android Police is the first that seemingly admits that the throttling is something the fans don't like.",
    "OxygenOS 12 is slated to bring a performance toggle, so you can use the 'Optimizations', as OnePlus calls them, or turn off throttling for improved app performance. By this, it seems likely the OnePlus 9T or OnePlus 10 will still have the performance tweaking, but that the ability to turn it off will be available via OxygenOS.",
    "It's very likely that OnePlus has learned a lot from this recent debacle. While the brand coasted on a cult-like following from its dedicated fans, comments on the OnePlus forum and various message boards show a more wary group of devotees.",
    "Some of the brand's big supporters might have been dissuaded from pre-ordering OnePlus handsets in the future though, and they might wait until reviews are in to judge the phone.",
    "General phone fans, who only follow the smartphone news when they need a new handset, will likely have missed the entire throttling story though, and this kind of audience will still be as likely to buy a OnePlus phone as they were before."
  ],
  "headers": {
    "4": "Analysis: what actually happened?",
    "10": "Will the OnePlus 9T or 10 be the same?"
  },
  "links": {
    "OnePlus phones": "https://www.techradar.com/news/best-oneplus-phones",
    "OnePlus 9": "https://twitter.com/geekbench/status/1412433598200823810",
    "Android Police": "https://www.androidpolice.com/2021/07/22/oneplus-plans-to-add-an-option-in-oxygenos-12-to-disable-throttling/",
    "Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "OnePlus 9R": "https://www.techradar.com/reviews/oneplus-9r",
    "9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Anandtech": "https://www.anandtech.com/show/16794/oneplus-9-performance-examination",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled"
  }
}