{
  "source": "https://www.techradar.com/news/spatial-audio-ios-15-will-bring-head-tracking-sound-to-non-dolby-atmos-content",
  "title": "Spatial Audio: iOS 15 will bring head tracking sound to non-Dolby Atmos content",
  "category": "audio-visual",
  "updated": "2021-06-11T10:44:21Z",
  "author": "olivia-tambini",
  "summary": "The feature is called Spatialize Stereo",
  "article": [
    "A new way for AirPods Pro and AirPods Max users to experience Spatial Audio has been discovered within the iOS 15 beta – without the need for Dolby Atmos content.",
    "Called 'Spatialize Stereo' the new feature will also work with macOS Monterey. According to 9to5Mac, that means devices running these operating systems will be able to simulate Spatial Audio for non-Dolby content, detecting the movement of your head when you're wearing AirPods to change the direction of the sound.",
    "That means you should be able to play any song from Spotify, for example, and experience it in Spatial Audio, despite the streaming service not supporting the format.",
    "The same goes for non-Dolby Atmos movie soundtracks, which means you'll just need a pair of AirPods Pro / AirPods Max and a compatible device to create an immersive home cinema setup.",
    "While you won't get a true Dolby Atmos 3D audio experience, Spatialize Stereo should at least give the impression of sound coming at you from different angles, making your movies, shows, and music feel more engaging.",
    "Previously, Spatial Audio support was limited to Dolby Atmos movies, so while you could use it with some titles from Apple TV Plus, Disney Plus, HBO Max, and more, many were incompatible.",
    "You'll need the beta version of iOS 15 or iPadOS 15 to try Spatialize Stereo, which is currently available for developers, with a public beta expected to launch in July.",
    "If you do have a compatible device running these operating systems, you can connect your AirPods Pro or Max and begin playing any content. Then, head to the Control Center and hold down the volume slider – according to 9to5Mac, this will bring up the option to enable Spatialize Stereo.",
    "Apple's Spatial Audio takes 5.1, 7.1, and Dolby Atmos content and applies directional audio filters, placing sound in a 3D sphere.",
    "What’s unique to Spatial Audio though, is that it uses the built-in accelerometers and gyroscopes inside Apple’s earbuds and headphones to track the position of your head, as well as the position of your iPhone or iPad.",
    "Why Spatialize Stereo wasn't announced at WWDC 2021 is a bit of a mystery – after all, it's a feature that could bring Apple's immersive audio technology to a wider audience.",
    "It's not as though Apple didn't showcase Spatial Audio at the annual developer's conference, announcing that it will extend Spatial Audio support to tvOS and MacOS for AirPods Max and AirPods Pro owners.",
    "Previously, Apple announced that it would be bringing Spatial and Lossless Audio to Apple Music subscribers at no extra cost, in a move that has shaken up the music streaming industry, with most competitors offering hi-res audio and 3D audio formats at a premium.",
    "It may be that the feature never makes it to the public – it's not unheard of for Apple to ditch aspects of the developer beta versions of its operating systems before they're officially launched.",
    "We're hoping that's not the case, though, as Spatialize Stereo could be a game changer for cinephiles and audiophiles alike."
  ],
  "headers": {
    "8": "Analysis: Where was the announcement?"
  },
  "links": {
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "iOS 15 beta": "https://www.techradar.com/how-to/how-to-get-ios-15-developer-beta-on-your-iphone",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "macOS Monterey": "https://www.techradar.com/news/macos-12",
    "9to5Mac": "https://9to5mac.com/2021/06/08/ios-15-and-macos-monterey-simulate-spatial-audio-for-non-dolby-content-with-new-spatialize-stereo-option/",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15",
    "WWDC 2021": "https://www.techradar.com/news/wwdc-2021-highlights",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "at no extra cost": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}