{
  "source": "https://www.techradar.com/news/oneplus-9-pro-screen-specs-unveiled-in-shock-pre-launch-reveal",
  "title": "OnePlus 9 Pro screen specs unveiled in shock pre-launch reveal",
  "category": "phones",
  "updated": "2021-03-16T15:27:57Z",
  "author": "tom-bedford",
  "summary": "What's the point of the launch event",
  "article": [
    "OnePlus has this peculiar habit of incessantly teasing its upcoming phones before launching them, and the OnePlus 9 pre-season shenanigans are currently in full swing. Case in point: we now know everything about the Pro phone's screen.",
    "On Twitter, OnePlus founder Pete Lau posted a long specs list for the OnePlus 9 Pro's screen - the actual phone wasn't named, but it's almost definitely not the 'standard' version of the phone, as most the pre-launch teasing has been around the Pro model.",
    "According to Lau, the OnePlus 9 Pro will have an LTPO display which is a type of screen tech which, basically, means the phone will likely have a variable refresh rate.",
    "Lau's message also confirms a QHD+ resolution (or 2560 x1440 pixels), a 120Hz refresh rate (so the display image will update 120 times per second), 10-bit color (so a bigger range of colors will be displayed), a 1300 nits max brightness (that's pretty high for a smartphone, though not the highest), MEMC (artificial motion smoothing), and HDR 10+ (basically videos will look brighter).",
    "So that's a fair mix of impressive specs and marketing buzzwords. The screen sounds pretty good, but we'll have to test it out to be sure.",
    "Or will we? Those specs sound identical to those of the Oppo Find X3 Pro, co-incidentally made by OnePlus' sister-brand. Will both phones use the exact same panels? We can't say for sure, but the Find X2 Pro and OnePlus 8 Pro did.",
    "In our Oppo Find X3 Pro review we said the display 'looked great, with punchy colors and top contrast'.",
    "The OnePlus 9 launch event is on March 23, and we're looking forward to hear OnePlus re-announce everything they've already told us."
  ],
  "headers": {},
  "links": {
    "OnePlus 9": "https://www.techradar.com/news/halo-infinite-gameplay-trailer-release-date-xbox-game-pass-and-what-we-know/news/oneplus-9",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro"
  }
}