{
  "source": "https://www.techradar.com/news/how-to-watch-the-september-nintendo-direct-and-see-whats-being-unveiled",
  "title": "Missed the September Nintendo Direct stream? Here's how to watch it",
  "category": "gaming",
  "updated": "2021-09-24T13:03:11Z",
  "author": "henry-st-leger",
  "summary": "Here's how to rewatch Nintendo's latest Direct",
  "article": [
    "A surprise Nintendo Direct kicked off on September 23, 2021, and spotlighted a number of Nintendo Switch games that are due to arrive before Christmas and throughout the new year.",
    "We saw a new Kirby title, the reappearance of Bayonetta 3 after a three-year hiatus, and some more Splatoon 3 gameplay footage. It was a solid showing by all accounts.",
    "However, if you missed the Direct, we're rounded up all the Nintendo Direct September 2021 announcements that you need to know. Alternatively, if you'd like to watch the Nintendo Direct in full, you can do so below.",
    "The Nintendo Direct took place at 3pm PT / 6pm ET / 11pm BST on September 23, 2021. You can rewatch the presentation in full via Nintendo’s YouTube Channel, which we've embedded below.",
    "Back in 2019, Nintendo announced the arrival of SNES games on Nintendo Switch Online a day before the titles landed on the service. We now know that N64 and Sega Genesis games are coming to the service in October as part of a higher-tier subscription to Nintendo Switch Online.",
    "We also saw a slew of titles that will arrive before Christmas and throughout 2022, such as a brand-new 3D Kirby game, Kirby and the Forgotten Land. It's the first time the pink puffball has ditched the two-dimensional plane for a more open-ended adventure similar to Super Mario Odyssey, and it looks great.",
    "Unfortunately for fans of The Legend of Zelda, Nintendo didn't share any more information on Breath of the Wild 2, which is still scheduled to release sometime in 2022. Nevertheless, it was a jammed-pack show full of some great-looking games and exciting announcements."
  ],
  "headers": {
    "3": "How to watch the Nintendo Direct",
    "4": "What did we see?"
  },
  "links": {
    "Nintendo Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Nintendo Direct September 2021 announcements that you need to know": "https://www.techradar.com/news/nintendo-direct-september-2021-all-the-biggest-announcements-you-need-to-know",
    "Nintendo’s YouTube Channel": "https://www.youtube.com/c/nintendo",
    "Kirby and the Forgotten Land": "https://www.techradar.com/news/kirby-and-the-forgotten-land",
    "Super Mario Odyssey": "https://www.techradar.com/news/super-mario-odyssey-review",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2"
  }
}