{
  "source": "https://www.techradar.com/news/how-to-cut-out-the-noise-when-working-from-home",
  "title": "How to cut out the noise when working from home",
  "category": "computing",
  "updated": "2021-05-26T10:54:17Z",
  "author": "andy-wilson",
  "summary": "Focus is important to the future of work",
  "article": [
    "Time was different in 2020. For so many of us, it feels like a lifetime’s worth of news, stress, and chaos has been packed into the last calendar year. Even when we have been isolated from the outside world and working from home it’s been impossible to escape the distraction of global news events, to say nothing of the relentless pings from colleagues working all hours.",
    "You can log out, or put your phone away, but your messages will always be waiting for you. Continuous partial attention – where we are constantly scanning for new tasks, even when we are working on something that requires our full concentration - is now the default state of mind for many people.",
    "Nothing has become more synonymous with remote work than the chime of a chat app. Although we’ve relied on chat and team communication tools to make life easier, that hasn’t always been the outcome. Our brains just aren’t wired to keep up with the endless notifications that have appeared with the swift move to work from home.",
    "So many of the day-to-day tasks that we now handle are “shallow work” — low-effort, low-concentration activities like checking and replying to emails or scanning for new threads and DMs. These can be easy or relatively quick to take care of, but they’re everywhere, and unlike many other activities in our lives, we can’t compartmentalize them.",
    "These unplanned distractions are the bane of deep work — those tasks that require our full concentration and the kind of creativity that comes only with sufficient headspace to dedicate to the task.",
    "I believe the best way to overcome this to make time for everything but to be specific about it. Make time just for deep work, time for shallow work, and even time for aimless social media scrolling. The likelihood is that all three of those categories already occupy your schedule, all wrestling for control. So, the first thing you need to do is break them up.",
    "Throw yourself in at the deep end and treat those tasks that require your full attention span as if they were vital recurring meetings that you have with yourself and make plans that reflect that. Book out time in your calendar, turn on do not disturb, and commit to a block of deep work time every day.",
    "If you can’t remember the last time you really had time to focus, you might struggle to even commit to an hour of dedicated deep work. But as in all things in life, it’s about direction, not perfection.",
    "The next step is simple – try to build the rest of your day in the same fashion; schedule time for shallow work and answer all your emails and DMs in one go. Arguably the most important part of being productive is finding ways to simplify or streamline existing processes or tasks in my day to give me more room to breathe.",
    "I was recently contemplating fax machines. I know how that sounds. But I was thinking about office technology changes in my lifetime. Fax reached their peak in the late 90’s just as the web was exploding. With 35% of businesses still using them in 2017 (IDC report). Why? because people still needed to have signatures on contracts.",
    "We could film, edit, post and go viral on our mobile phones, but we couldn’t sign a contract without a fax. Today, just like our meetings, our contracts have gone virtual - and the key - eSignatures.",
    "eSignatures make the process of managing documents easier, faster and (in the current climate) safer. As we creep ever closer to restrictions lifting in the UK, organizations will have no choice but to invest in digital tools that serve our new modes of work - ones that help staff work when and where best suits them.",
    "As you define your schedule and work in your time for deep and shallow work, be sure to set expectations with your lead and co-workers. A simple, “I’ll be available during these hours, and offline during these hours” is all you need. You can also adjust your calendar and chat settings, and even set an out-of-office reminder to decline new meetings during your work blocks. It can help to also make your calendar private if you need more control or if people keep scheduling over your work blocks.",
    "The more you communicate your routine, the easier it will be for colleagues to help keep it undisturbed. Make no mistake: your ability to prove you can get things done even while your Instagram is blowing up and that new comedy special just dropped on your favorite streaming service, is the greatest skill you could possess right now.",
    "These steps might seem small, but the reality is if you can make your ability to concentrate the strongest tool in your toolbox, you’ll be miles ahead of anyone else struggling to marry their old-world office skills to a new reality of Zoom calls and days that seem to pass in the blink of an eye."
  ],
  "headers": {
    "2": "A years’ worth of distractions",
    "5": "Making time for your work not just your inbox",
    "12": "Communicating your plan"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "remote work": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "work from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "emails": "https://www.techradar.com/news/best-email-provider",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "eSignatures": "https://www.techradar.com/best/best-esign-software-solutions"
  }
}