{
  "source": "https://www.techradar.com/news/iphone-14-pro-could-ditch-the-lightning-port-for-usb-c",
  "title": "iPhone 14 Pro could ditch the Lightning port for USB-C",
  "category": "phones",
  "updated": "2021-11-19T10:14:19Z",
  "author": "james-rogerson",
  "summary": "New modems might also be on the way",
  "article": [
    "One of our ongoing complaints about the iPhone range is that it uses Apple’s proprietary Lightning cable, rather than USB-C, but there’s now a suggestion that Apple could switch to this more widespread format.",
    "According to “several sources familiar with the matter” speaking to iDropNews, the iPhone 14 Pro and iPhone 14 Pro Max may have a USB-C port instead of a Lightning port.",
    "Apparently this hasn’t been decided for sure yet, with Apple simply considering the switch, but if Apple does change the port then it will apparently be for three main reasons.",
    "These include data transfer speeds, which would be vastly improved with USB-C, and which Apple might now care more about thanks to the large file sizes generated by its ProRes video feature – files that people are likely to want to transfer from their iPhone to their computer.",
    "Another reason Apple is said to be considering this is that it could be better for the environment. Since USB-C cables are used for most other portable devices including just about every other smartphone, it seems like most people have thousands of them already. So Apple could potentially justify not including one in the box with its phones – thereby producing less e-waste and saving money in the process.",
    "The final reason Apple is said to be considering the switch is the EU’s push for USB-C to become the smartphone standard, which might force Apple’s hand eventually.",
    "They’re all good arguments for a port that Apple really should switch to, but we’d still take this with a huge helping of salt, as the sources are anonymous, iDropNews itself isn’t particularly known for leaks, and this would be a big shift for Apple.",
    "In more likely if less interesting iPhone news, Apple will reportedly use its own 5G modem designs in iPhones from 2023. According to DigiTimes, Qualcomm (which currently supplies all of the 5G modem chips for iPhones) will only supply 20% in 2023, with Apple itself picking up the slack.",
    "We’ve known for a while that Apple is interested in designing its own modems so it can be less reliant on Qualcomm, so this isn’t surprising. It’s really a case of when and not if, and 2023 seems believable.",
    "This probably won’t have much impact on the phones themselves though, especially as some models will still apparently be using Qualcomm ones.",
    "While we’re skeptical of reports that Apple will switch to USB-C for the iPhone 14 Pro and iPhone 14 Pro Max, the company really should make the move.",
    "Lightning is inferior compared to USB-C in just about every appreciable way, and the only arguments we can see for keeping it are firstly that many people have already invested in Lightning accessories, though that shouldn’t hold back progress, and secondly that Lightning is probably a big money-maker for Apple – but that’s hardly consumer-friendly.",
    "Many of the reasons Apple should switch have been laid out above, but in the long run it could even be a financially wise choice for the company, since the move to a sensible port would give Android users one less reason to stay on the Google side.",
    "And now that many iPads even have USB-C ports it really just seems like it’s stubbornness on the part of Apple not the make the move on iPhones. So we want to see it – and not just for the Pro models. Either that or Apple needs to hurry up and launch its long-rumored portless iPhone.",
    "Via PhoneArena"
  ],
  "headers": {
    "7": "A modem move",
    "10": "Opinion: it’s long past time Apple switched to USB-C"
  },
  "links": {
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "iDropNews": "https://www.idropnews.com/rumors/exclusive-new-iphone-14-pro-details/173982/?utm_content=notifications&utm_campaign=notifications&utm_source=notifications&utm_medium=notifications&utm_term=notifications",
    "iPhone 14 Pro": "https://www.techradar.com/news/iphone-14",
    "the EU’s push for USB-C to become the smartphone standard": "https://www.techradar.com/news/your-next-iphone-may-finally-ditch-lightning-for-usb-c-because-of-this-new-law",
    "DigiTimes": "https://www.digitimes.com/news/a20211118PD204.html",
    "portless iPhone": "https://www.techradar.com/news/portless-iphone-13-rumors",
    "PhoneArena": "https://www.phonearena.com/news/usb-c-port-coming-with-5g-iphone-14-pro_id136539"
  }
}