{
  "source": "https://www.techradar.com/news/loads-of-playstation-exclusives-are-coming-to-pc-but-not-the-one-we-want",
  "title": "Loads of PlayStation exclusives are coming to PC – but not the one we want",
  "category": "computing",
  "updated": "2021-07-15T11:19:11Z",
  "author": "darren-allan",
  "summary": "Bloodborne sadly not one of these ports, apparently",
  "article": [
    "A good number of PlayStation games which were previously exclusive to Sony’s console could be in the works to be ported across to the PC, according to the latest on the gaming grapevine – which, of course, Sony has more or less said itself in the past – but it doesn’t seem like Bloodborne is one of them.",
    "That’s the conclusion drawn by a renown dataminer, Lance McDonald, who shared his thoughts on the forthcoming ports on Twitter, as Wccftech spotted.",
    "McDonald notes that he is “aware of multiple upcoming PC ports of PlayStation exclusive games”, but that none of these are Bloodborne. He’s also a modder and hacker who produced an unofficial patch for Bloodborne to get the game running at 60 frames per second on PS4 Pro, hence the connection and specific mention of the game.",
    "Essentially, given that the rumor mill is persistently floating the idea that a Bloodborne remaster is in the cards and coming to PC (and indeed PS5) on a regular basis, McDonald felt the need to clarify that he doesn’t think this is happening going by what he’s heard – ie nothing – with his ear to the ground.",
    "That said, McDonald still lives in hope that “it’ll just come out of nowhere”.",
    "Bloodborne is widely looked upon as one of the best games for the PS4, so it’s unsurprising that there’s a whole lot of clamor to see the game ported to PC – and potential temptation for rumor peddlers to capitalize on that, of course, by fabricating their own whispers.",
    "Folks in general are losing faith at the number of such pieces of Bloodborne speculation, and the cynicism is running so high these days it’s at a point where we’ve seen a ‘Bloodborne Remastered Rumor Generator’ appear on Twitter, which allows you to generate your very own Bloodborne rumor (via Game Rant).",
    "That comes from the superbly tongue-in-cheek ‘Is Bloodborne on PC’ Twitter account, the mission statement of which is that it: “Lets you know if Bloodborne is available for the PC platform. Daily.” See today’s post below.",
    "As to what the multiple PlayStation ports which are in the pipeline might be, no specific games are mentioned by McDonald, but we’ve already heard that Uncharted 4 is likely to be one of them, and maybe also God of War. Mind you, God of War can already kind of be played on PC, at least via PlayStation Now streaming."
  ],
  "headers": {
    "5": "Faith, no more?"
  },
  "links": {
    "PlayStation games": "https://www.techradar.com/best/best-ps4-games",
    "Sony has more or less said itself in the past": "https://www.techradar.com/news/ps4-hit-uncharted-4-could-be-headed-to-pc",
    "Bloodborne": "https://www.techradar.com/news/games-of-the-generation-bloodborne-is-a-lovecraftian-nightmare-that-will-keep-you-coming-back-for-more",
    "Wccftech": "https://wccftech.com/multiple-playstation-exclusive-pc-ports/",
    "rumor mill is persistently": "https://www.techradar.com/news/rumors-suggest-bloodborne-is-heading-to-pc-and-ps5-but-were-not-convinced-yet",
    "idea that a Bloodborne remaster": "https://www.techradar.com/news/bloodborne-rumored-to-hit-ps5-and-pc-this-year",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "best games for the PS4": "https://www.techradar.com/best/best-ps4-games",
    "Twitter": "https://twitter.com/isbbonpc/status/1414584362373423104",
    "Game Rant": "https://gamerant.com/bloodborne-leak-generator/",
    "Uncharted 4 is likely to be one of them": "https://www.techradar.com/news/ps4-hit-uncharted-4-could-be-headed-to-pc",
    "maybe also God of War": "https://www.techradar.com/news/god-of-war-pc",
    "via PlayStation Now streaming": "https://www.techradar.com/news/pc-players-can-finally-play-god-of-war-thanks-to-playstation-now"
  }
}