{
  "source": "https://www.techradar.com/news/broadcom-reportedly-set-to-buy-software-giant-sas",
  "title": "Broadcom reportedly set to buy software giant SAS",
  "category": "computing",
  "updated": "2021-07-13T12:04:38Z",
  "author": "sead-fadilpasic",
  "summary": "Deal could be finalized in the coming weeks",
  "article": [
    "Semiconductor giant Broadcom is in talks with analytics experts SAS Institute over a possible acquisition.",
    "Citing “people familiar with the matter”, the Wall Street Journal claims the deal, if completed, could be finalized “in the coming weeks”. SAS’ enterprise value is estimated in the $15 - $20 billion range, although this includes assumed debt and is adjusted for cash on its balance sheet.",
    "Broadcom, on the other hand, is valued at approximately $200 billion, half of which the company saw last year after its shares rose by 50%. Last month, the company reported solid results, exceeding analyst expectations, with tis semiconductor revenue rising by 20% and its software revenue up by 4%.",
    "The WSJ claims Broadcom has around $9.5 billion in cash reserves available, and is looking to make an acquisition after a two-year drought.",
    "The company famously expressed interest in acquiring rivals Qualcomm in 2018, but the deal was stopped by former President Donald Trump, citing security risks. The same year, Broadcom bought CA Technologies for $19 billion, and also added Symantec’s enterprise business under its belt a year later for $10.7bn.",
    "Following that acquisition, it rebranded Symantec to NortonLifeLock, even though Broadcom had said the previous name would live on.",
    "Broadcom was either tight-lipped about the deal, or it decided to move with the acquisition relatively recently. In early June 2021, CFO Kirsten Spears was asked about potential M&A deals, to which she replied that “there isn’t anything yet on the M&A front that I can talk about.”",
    "She did say that the company planned on allocating 50% of its free cash flow to “shareholders, M&A, buybacks and debt repayment.”",
    "The deal could see SAS customers enjoy more hardware-integrated offerings, with Broadcom's chips currently found in products from data centers to routers across the world.",
    "Via: Wall Street Journal"
  ],
  "headers": {
    "6": "Broadcom keeping quiet"
  },
  "links": {
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "rebranded Symantec": "https://www.techradar.com/news/broadcom-completes-symantec-deal-rebrands-as-nortonlifelock",
    "Wall Street Journal": "https://www.wsj.com/articles/broadcom-in-talks-to-buy-software-firm-sas-11626103731?mod=djemalertNEWS"
  }
}