{
  "source": "https://www.techradar.com/news/new-macbook-rumor-suggests-m1x-could-match-rtx-3070-laptop-gpu",
  "title": "New MacBook rumor suggests M1X could match RTX 3070 laptop GPU",
  "category": "computing",
  "updated": "2021-06-22T15:05:26Z",
  "author": "darren-allan",
  "summary": "32-core integrated GPU could theoretically be a stormer",
  "article": [
    "Apple is reportedly on the cusp of revealing new MacBooks at WWDC 2021 which might carry the sequel to the current M1 silicon – perhaps an M1X chip, or even M2 – and the integrated graphics could be seriously powerful. In fact, a new rumor suggests the beefiest chip could come close to matching the power of Nvidia’s laptop RTX 3070 GPU.",
    "Obviously, we need the usual upfront warnings of treating this speculation – which comes from YouTuber Dave2D – with a great deal of caution, but the theory (as previously advanced by Mark Gurman) is that there will be flavors of Apple’s M1 sequel which could offer 16-core and 32-core integrated GPUs (way more than the M1 which tops out at 8-cores currently).",
    "Dave2D speculates that it’s the larger MacBook Pro 16-inch which might run with the 32-core GPU (with the 14-inch version of Apple’s laptop maxing out at 16-cores), and that these would require an estimated 40W and 20W of power respectively (as well as demanding a larger die size).",
    "The really interesting bit is when it comes to the performance which Dave2D theorizes about based on this, suggesting how these rumored new chips might perform in GFXBench 5.0 Aztec – with the supposed 32-core Apple GPU predicted to hit almost the same number of frames per second (around 170) as the RTX 3070 laptop incarnation.",
    "That’s obviously an eye-opening possibility. Remember that the YouTuber is comparing a theoretical 40W part with an Nvidia GPU that pulls around 90W, so that matched performance would come at half the power draw.",
    "These are simply estimations and bits of guesswork based on churnings from the rumor mill – and predictions delivered via a mobile benchmark suite, too – so keep an absolute bucketful of salt at the ready. But if Apple does have an M1X chip – or equivalent – and it does push forward on the GPU front to anything like this extent, that would obviously be mightily impressive.",
    "Of course, when it comes to gaming, pure performance isn’t the only story here, as the M1-powered Macs are limited in terms of support. Meaning that while the new MacBook models might theoretically boast some seriously impressive fps chops, the games you can enjoy natively (with GPU pedal fully to the metal, so to speak) on Apple silicon-powered Macs are very few indeed.",
    "There’s World of Warcraft, of course, and a handful of other titles (some old GTA games, Among Us), although granted, Rosetta 2 (Apple’s fancy translation tech) allows for a fair few other games to be played on M1 machines, if not at full pelt (ditto for options like CrossOver, the Mac take on Linux’s Wine).",
    "Overall, though, M1 gaming options are limited, but that situation will slowly change as time progresses (and let’s not forget, Final Cut Pro users will certainly enjoy much more powerful integrated GPUs).",
    "On the downside, Dave2D is also predicting that these potentially seriously pepped-up Apple laptops could also be considerably jacked up on the pricing front, which wouldn’t be surprising if these performance estimates are anywhere near the mark.",
    "The purported new MacBooks are expected to be unveiled by Apple at WWDC 2021 today, with multiple rumors claiming this – although even if they are revealed later on, these portables may not go on sale until much later in the year.",
    "Via Notebookcheck.net"
  ],
  "headers": {
    "6": "Gaming support"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "even M2": "https://www.techradar.com/news/new-macbook-pro-could-appear-at-wwdc-2021-sporting-m2-chip",
    "Dave2D": "https://www.youtube.com/watch?v=OY2jMXKVhIw",
    "as previously advanced by Mark Gurman": "https://www.techradar.com/news/apples-next-m1-macbook-pro-may-boast-a-huge-upgrade",
    "MacBook Pro 16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "options like CrossOver": "https://www.techradar.com/news/macbook-air-m1-2020-can-run-the-witcher-3-and-more-thanks-to-crossover",
    "multiple": "https://www.techradar.com/news/yet-another-rumor-suggests-new-m1-macbooks-are-coming-at-wwdc-2021",
    "claiming": "https://www.techradar.com/news/is-apple-set-to-reveal-new-macbook-pro-at-wwdc-2021",
    "may not go on sale until much later in the year": "https://www.techradar.com/news/new-macbook-pro-could-appear-at-wwdc-2021-sporting-m2-chip",
    "Notebookcheck.net": "https://www.notebookcheck.net/Apple-M1X-with-32-core-GPU-could-match-GeForce-RTX-3070-Laptop-graphics-performance-at-43-of-the-power-cost-according-to-astonishing-estimates.543612.0.html"
  }
}