{
  "source": "https://www.techradar.com/news/android-12-officially-has-a-dessert-name-and-we-now-know-what-it-is",
  "title": "Android 12 officially has a dessert name, and we now know what it is",
  "category": "phones",
  "updated": "2021-10-06T09:15:48Z",
  "author": "james-peckham",
  "summary": "Google brings back the sweet stuff",
  "article": [
    "Android 12 has arrived, and while you can't yet download the official software to your smartphone we now know what its dessert name is: Android Snow Cone.",
    "We've previously heard rumors of Google returning to dessert names for its Android updates, and XDA Developers reported the name Snow Cone in February of this. year, but now it's been confirmed.",
    "Dave Burke, VP of Engineering at Google, confirmed the name in a tweet showing off a background theme for the new software.",
    "While Android 12 update is now official, it's unlikely to land on your phone for a while yet. If you own a Pixel handset, Google says the update is expected to land in the \"next few weeks\", and other Android handsets will have to wait longer for the update.",
    "The Google Pixel 6 is set to debut on October 19, so it may be that we see the company push an update to its existing phones alongside that launch.",
    "We're expecting to hear everything about the Google Pixel 6 and Pixel 6 Pro then, including pricing, and when you'll be able to buy the phones.",
    "We've had two years of new Android versions releasing with a dessert name, and I'm happy to see the trend return.",
    "It's unlikely that we'll ever see these names return as the official marketing names for Android updates, but I appreciate that Google is making these dessert names public knowledge in different ways.",
    "Android Pie was the last version of the OS to be officially titled after its sweet name, and we've seen Android 10 and Android 11 since Google dropped the convention.",
    "A return to sweet names is exciting though, and I'm already curious to know what the second moniker for Android 13 will be."
  ],
  "headers": {
    "6": "Opinion: I appreciate a return to sweet names"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "XDA Developers": "https://www.xda-developers.com/android-12-snow-cone-dessert/",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6"
  }
}