{
  "source": "https://www.techradar.com/news/no-one-can-really-say-when-the-chip-shortage-will-end-heres-why",
  "title": "No one can really say when the chip shortage will end - here's why",
  "category": "computing",
  "updated": "2021-09-20T19:01:27Z",
  "author": "joel-khalili",
  "summary": "We’re not all talking about the same chip shortage",
  "article": [
    "Since the global chip shortage began, many industry executives and commentators have ventured to estimate when it might come to an end.",
    "It is universally accepted that the shortage came about as a result of an unfortunate confluence of factors, from pandemic-related manufacturing shutdowns and increased demand for electronics, to bottlenecks in the freight sector and freak weather events.",
    "But although there is agreement on causation, there is little consensus when it comes to assessing the extent of the problem and defining a timeline for recovery. Some say the shortage will ease up next year, others say problems will persist until 2023 and beyond.",
    "That’s because asking when the global chip shortage will end is a little like asking: “How long is a piece of string?”",
    "The first part of the problem has to do with the language used to describe the situation; “the global chip shortage” is an oversimplification, leaving no room to describe the complexity of the semiconductor supply chain, nor the variance in type of chip.",
    "As a result, different people mean different things when they refer to the chip shortage. The experience of the shortage in the automotive industry, for example, differs from the impact on the consumer electronics sector, despite a shared set of causations. And while some types of chip are in short supply, others are more readily available.",
    "“[The term] ‘chips’ covers a wide range of different chip types,” Alan Priestley, VP Analyst at Gartner, told TechRadar Pro. “While some chips may be available, they often require other chips in order to be usable.”",
    "“For example, CPUs require power management chips, and while CPUs are not in short supply, power management chips are.”",
    "According to Priestley, one of the most significant bottlenecks is a shortage of production capacity at 200mm fabs (the number corresponds with the diameter of silicon wafers used in production). Unlike 300mm plants, built to produce bleeding edge chips, 200mm facilities churn out chips based on older process technologies, typically ranging from 350nm to 65nm.",
    "Although much less advanced than the semiconductors produced on 7nm, 5nm and soon even 3nm nodes at 300mm fabs, these commodity chips play an indispensable role in millions of products.",
    "“Prior to the pandemic, 200mm production was already at maximum capacity,” noted Priestley. “Increasing demand for PCs and consumer products has led to increased demand for chips made on 200mm: power management, voltage regulators, display drivers etc.”",
    "All this is to say that the duration and severity of the shortage will, in large part, depend on each industry's dependence on different types of chip, made in different types of fabrication plants.",
    "Another explanation for the discrepancy in projections is that the chip shortage has largely been analyzed through the lens of the automotive industry, which has been particularly badly affected.",
    "The drastic downturn in business at the start of the pandemic saw automotive companies cut back production and withdraw orders placed with foundries. But by the time the market began to boom again, chip production capacity conceded by carmakers had been snapped up by other players.",
    "To avoid the immense losses associated with shutting down factories, major manufacturers like Ford and General Motors are filling up their lots with half-built vehicles, with the intention of adding in all-important chips later on, when they become available.",
    "Other players have worked around the problem by dropping features that require chips to function. For example, Tesla has removed the passenger seat lumbar support from a couple of its ranges, to cut down on its chip consumption.",
    "The catastrophic impact of the pandemic and chip shortage on the automotive sector has also highlighted the underlying politics in the semiconductor industry, says Glenn O’Donnell, Research Director at Forrester.",
    "Asked which sectors are likely to recover from the shortage soonest, O’Donnell told us that the speed with which industries recover will likely depend on their perceived importance and the clout of their constituent companies. The auto industry is among the first in the queue for relief, he says.",
    "“[The automotive] industry has been the squeaky wheel, but others will suffer. The general public doesn’t care if Cisco can’t get chips, but when you can’t get your Ford F-150, that is a problem!” O’Donnell quipped.",
    "“And large buyers (like AWS, Microsoft and Apple) get priority over smaller manufacturers. If Apple wants 100 million chips and the little guy only wants 5,000, Apple gets priority and the little guy struggles. Everyone is now feeling the pinch from a market that is esoteric and (until now) largely hidden from view.”",
    "In a bid to meet the rise in demand, the world’s largest foundries TSMC, Intel and Samsung are all building new fabs and pulling every lever and dial possible to optimize the capacity of their current facilities.",
    "Meanwhile, uncomfortable with the dominance of Asian foundries - especially in light of China’s aggressive stance on Taiwan (home to TSMC, the world’s leading chip manufacturer) - the US and EU have both announced multi-billion-dollar stimulus packages designed to localize the semiconductor supply chain.",
    "However, there’s only so much optimization that can take place, and building a fab from scratch takes multiple years and billions of dollars. No matter how much cash is poured into solving the shortage, there is no way of accelerating that timeline.",
    "Given these limiting factors, says O’Donnell, it should be possible to make a sensible projection; not to assign a date for the end of the shortage (which is subjective), but to estimate when overall supply will begin to rise.",
    "“Different people see this problem from different angles, but the timeframe is actually pretty easy to determine when you have all the facts,” he explained, before showing us his workings.",
    "Simply put, given production capacity is maxed out and there are no signs the demand for semiconductors will lessen, the situation will remain unresolved until new fabs are built. And because it takes at least two years to spin up a plant, O’Donnell says it will be 2023 before supply begins to rise. Until then, any supply directed towards the recovery of one industry (or company) will come at a cost to another.",
    "When the chip shortage will end is a matter of perspective, but when supply will begin to increase is not - and we have years to wait."
  ],
  "headers": {
    "4": "A language problem",
    "12": "A matter of perspective",
    "20": "Ramping up capacity"
  },
  "links": {}
}