{
  "source": "https://www.techradar.com/news/ransomware-attacks-in-2021-have-already-surpassed-last-year",
  "title": "Ransomware attacks in 2021 have already surpassed last year",
  "category": "computing",
  "updated": "2021-07-30T10:21:08Z",
  "author": "mayank-sharma",
  "summary": "Millions of ransomware attacks conducted every day, report claims",
  "article": [
    "Ransomware attacks have skyrocketed, and have already eclipsed the entire volume for 2020 in the first six months of 2021, according to new research.",
    "In its mid-year 2021 Cyber Threat Report update, SonicWall pegged the global ransomware volume at 304.7 million in the first half of 2021, surpassing 2020’s full-year total of 304.6 million, translating to a 151% year-to-date increase.",
    "SonicWall President and CEO Bill Conner attributes the increase to threat actors taking advantage of the unplugged holes in the cybersecurity plans of businesses around the world thanks to the hurried, unplanned shift to remote working.",
    "“In a year driven by anxiety and uncertainty, cybercriminals have continued to accelerate attacks against innocent people and vulnerable institutions. This latest data shows that sophisticated threat actors are tirelessly adapting their tactics and embracing ransomware to reap financial gain and sow discord,” observes Conner.",
    "Ransomware volume showed massive year-to-date spikes in both the US (185%) and the UK (144%), which together with Germany, South Africa and Brazil make up the top five regions impacted by ransomware.",
    "SonicWall researchers also recorded alarming ransomware spikes across key verticals, including government (917%), education (615%), healthcare (594%) and retail (264%) organizations.",
    "The trend is continuing to increase with SonicWall recording an unprecedented number of ransomware attacks in a single month at the end of their six month tracking period, with June 2021 registering 78.4 million ransomware attacks.",
    "Notably, the top three ransomware families that accounted for 64% of all recorded ransomware attacks were Ryuk, Cerber and SamSam.",
    "In addition to ransomware, SonicWall also observed a spike in Internet of Things (IoT) malware attacks, which rose 59% year-to-date globally. Interestingly, while the US only recorded a 15% year-to-date increase in IoT malware, Europe with 113% and Asia with 190% saw alarming increases in IoT malware volume."
  ],
  "headers": {
    "4": "Rampant ransomware"
  },
  "links": {
    "Ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "SonicWall": "https://www.techradar.com/news/sonicwall-customers-urged-to-patch-up-immediately-amid-new-ransomware-attacks",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "malware": "https://www.techradar.com/best/best-malware-removal"
  }
}