{
  "source": "https://www.techradar.com/news/is-the-oneplus-9s-hasselblad-camera-a-big-deal-heres-what-history-tells-us",
  "title": "Is the OnePlus 9's Hasselblad camera a big deal? Here's what history tells us",
  "category": "cameras",
  "updated": "2021-03-24T15:40:40Z",
  "author": "andrew-williams",
  "summary": "A genuine milestone or just marketing?",
  "article": [
    "The OnePlus 9 and OnePlus 9 Pro both come with an alluring sell – their cameras were made in co-operation with Hasselblad, the creator of some amazing medium format cameras.",
    "Of course, this isn't the first time a phone manufacturer has teamed-up with a brand that's better-known in camera circles. In fact, it isn't even the first time we've seen the Hasselblad logo on a phone, with Motorola teaming up with the brand to make an ill-fated 'Moto Mod' for its Motorola Moto Z phone.",
    "The big question it raises, then, is how big a deal is this OnePlus and Hasselblad collaboration? And how exactly does it compare to the ones we've seen in the past from the likes of Nokia and Zeiss or, more recently, Huawei and Leica?",
    "To give you the answer, we've teleported back through the history of camera phones to look at how these partnerships have worked before, and what exactly they've brought to the photographic table. In short, are these collaborations more marketing than true milestones?",
    "If you want to skip to our early verdict on Hasselblad's contribution to the OnePlus 9 and OnePlus 9 Pro, just use the jump links on the right – but right now, we're heading back to the earliest days of the camera phone in 2005 with the Nokia N90 and N95...",
    "The original and greatest collaboration between a phone company and a photography brand started in 2004. It was between Nokia and Zeiss. At that time, Nokia was the biggest phone-maker in the world. We were just two years on from the first camera phone to arrive in Europe, the Nokia 7650.",
    "The Nokia N90 was the first phone to get the Carl Zeiss treatment. It had an f/2.9 lens with a 5.5mm focal length and a design that seems clever even now. It was a clamshell phone, but the screen could also be rotated by 90 degrees in each direction, to let you compose images – selfies or normal ones – with the display set at a landscape orientation. The camera lived in the rotating barrel of the hinge.",
    "Nokia likely deserves most of the credit for this clever design. But the partnership would go on to do some truly interesting things. The Nokia N93 from 2006 had a 3x optical zoom, something still only implemented in a handful of phones since smartphones became a thing.",
    "Still, it’s the Nokia N95 we remember most fondly. This slider phone had a 5-megapixel sensor and f/2.8 lens, and was the first Nokia to offer such high resolution. Its camera sat on the back, for easy and quick composition. And it had a physical slider over the Zeiss lens cover to avoid dust and grime pick-up.",
    "The Nokia/Zeiss relationship continued as a pillar of several other Nokia phones that set new standards even as the brand’s wider influence diminished. Nokia’s superb 808 PureView (above) was a Zeiss-branded camera. But the real tech evolution here was down to Toshiba. It made the phone’s 41MP sensor, which at 1/1.2in is large by the standards of 2021, let alone 2012.",
    "However, there was probably also a lot of work for the Nokia/Zeiss imaging team to do here, working out a lens design that would do the job for such a large sensor. Such sensors may be relatively common today, but they were not a decade ago.",
    "Given the longevity of this partnership, relatively little has been written about how it actually worked. The best insight is found on the Microsoft Devices Blog . It dispels the useful myth that, back then, Zeiss lenses were somehow fundamentally different to 'normal' ones, that the average phone had basic plastic camera lens elements and Nokia Zeiss phones had, who knows, maybe amazing glass ones like the lenses for DSLRs?",
    "They didn’t, of course. The Nokia Zeiss lenses still had plastic elements, because using glass was not (and is not) feasible. Zeiss also uses manufacturing partners who actually made the lenses.",
    "We asked Neil Shah, Vice President at Counterpoint Research and a specialist in mobile phone supply chains, who these companies are. He told us Largan Precision, Sunny Optical and Kantatsu are some of the big names. Even if you know your way around phone manufacturers, you probably haven’t heard of them.",
    "A Zeiss lens probably isn’t as “Zeiss” in the same way that a Sony sensor is 'Sony'. But the team did have real influence over what the lens actually was, according to the Microsoft Devices blog interview with Oliver Schindelbeck anyway. He was Research and Development Project Manager for Mobile Phones at Zeiss.",
    "\"We work together with Nokia from the first idea; we look at optical design, calculating the lens system, discussing the limits of lens itself and the specifications for quality. Then we qualify the suppliers to make sure they meet our necessary standards. We test the quality robustness and image processing of the first prototype – and then we test the final prototype and do any fine tuning.”",
    "Microsoft bought Nokia in 2013, and the Zeiss tie-ins continued. But 2004-2012 were the golden years of the collaboration.",
    "The great 1-inch experiment...",
    "Here is a strange one. You may have completely forgotten Panasonic made phones. Barely anyone bought them, but there was a particularly interesting one, the Panasonic CM1.",
    "It had a Leica lens, no doubt as part of the arrangement Panasonic established with Leica in 2001. Panasonic slaps the Leica name on its cameras. Some of Leica’s cameras are rebranded (and slightly tweaked) Panasonic models with higher prices.",
    "The Panasonic CM1 phone had a 1-inch sensor and a 28mm equivalent lens. It could compete with the once-great Sony RX100 compact in some situations, but the general conclusion was it wasn’t worth $1,000.",
    "The phone disappeared pretty swiftly and we barely heard anything about the Panasonic CM10 follow-up after its launch. That was a similar camera, minus the phone part.",
    "This tie-in arguably doesn’t deserve a place on the list, as Panasonic was already more of a name in cameras than phones. But it’s an opportunity to remind you the Panasonic CM1 exists in a second-hand electronics shop, somewhere.",
    "Hasselblad's first phone collaboration wasn't a roaring success...",
    "Hasselblad leant it name to Motorola for a Moto Z 10x zoom 'Moto Mod back in 2016. This was a camera accessory that clung onto the back of the phone using magnets.",
    "Given how widely distributed Motorola’s Moto system accessories were, we doubt too many people ended up with one. There was little in the Mod to justify the use of the Hasselblad name. It had an f/3.5-5.6 maximum aperture through its 25-250mm zoom range, and used a 1/2.3-inch sensor.",
    "This gave it roughly the imaging capability of a low-end compact camera. The lens was soft at the corners zoomed-out, and not all that sharp zoomed all the way in. Motorola used the Hasselblad name to distract from the predictable reality that you are not going to get amazing image quality from a $300 phone add-on, particularly one where the price is probably already offsetting the significant R&D involved in a new style of product.",
    "We wouldn’t be surprised if some Hasselblad employees were a little embarrassed after seeing the photos the 10x Moto Mod spat out. Of course, that’s not to say the Mod was useless. Adding a 10x optical zoom to a phone with a single wide-angle 13MP camera adds to the fun you can have with it immeasurably.",
    "The big collaboration of the 2010s...",
    "Huawei teamed up with Leica in 2016, at which point it was rapidly accelerating as a real force in mobile phone camera performance. Just two years later it would make what was, in several ways, the best phone camera of 2018: the Huawei P20 Pro.",
    "However, it all started with the Huawei P9, the first Huawei-Leica phone. The big talk was about its dual 12MP cameras; one monochrome, the other color.",
    "The credulous viewer of Huawei’s launch presentation could have believed this was all down to the Leica partnership, but these were both Sony IMX286 sensors. And even for 2016 the lenses were not particularly impressive. They had apertures of f/2.2. That year’s top Samsung, the Galaxy S7, already had an f/1.7 lens.",
    "Huawei continues to use Leica as a branding partner to this day. But since 2018 we have barely even considered it a draw, as other advancements in sensor tech and processing have overshadowed lens quality. That continues in the Huawei P50, as it reportedly has a 1-inch sensor.",
    "The slightly less golden HMD years...",
    "HMD Global licensed the Nokia name to bring back Nokia phones in 2016. And it renewed the brand’s arrangement with Zeiss in 2017.",
    "However, it is not as potent a combination as it was back in the old days. The relationship is no longer exclusive. You’ll see the Zeiss name on middling cameras like the Nokia 7.2’s array, and nowadays in other brands’ phones too.",
    "Nokia hasn’t made a particularly interesting camera since 2019’s Nokia 9 PureView. This was an experiment in computational photography, using five 12MP cameras that all capture scene information to produce one image.",
    "However, this was really a PureView project, not one that relies specifically on optical quality. The lenses are all have a familiar f/1.8 aperture, and the processing matters more. And that came from another photography/imaging company called Light. You’ll learn more about that company in the next section about its stalled partnership with Sony.",
    "The Nokia 9 PureView was a classic stab at something new, but still had issues with dodgy object layering in background blur pictures. And while the color tone was great, JPEGs were noticeably sharpened.",
    "The one that never happened...",
    "Sony and Light announced a partnership in 2019, and it had the potential to be one of the most interesting to date. But this isn’t quite like a branding arrangement with Leica, Zeiss or Hasselblad. Most people have never heard of Light.",
    "The company made the Light L16, a computational photography camera we were once shown in prototype form in a dingy London pub, years before the L16 came out. It had 16 lenses and sensors, split into three groups at 28mm, 70mm and 150mm focal lengths. This allowed for merging of exposures, for better dynamic range, and depth mapping at the three fields view.",
    "However, by the time the Light L16 was released, normal phone cameras had progressed enough to dilute its appeal. It was a flop, and Light has since shifted its focus to applications in autonomous vehicles (which it was likely working on the whole time).",
    "Two years after the announcement we haven’t heard much more about the Sony team-up, which would presumably have resulted in phones not dissimilar to the Nokia 9 PureView. And after Light’s 2020 announcement it was leaving the consumer camera scene altogether, we have to consider this collaboration dead.",
    "Get your coat on...",
    "Zeiss really does get about a bit. When its partnership with Nokia lost its exclusivity, other manufacturers were free to hop into the company’s DMs.",
    "It made perfect sense for Sony to do so. Its own Sonnar T* range of lenses for mirrorless cameras are made in partnership with Zeiss, with impressive results.",
    "Sony announced that Zeiss would be involved with the Sony Xperia 1 II in early 2020. There was the usual liberal sprinkling of “Zeiss optics” fairy dust, the meaning of which is never 100% explained, so you can go on believing the lenses are made of some exotic material other manufacturers don’t have access to (they aren’t).",
    "But there is also a very specific factor too: a Zeiss T* lens coating. We don’t blame Sony for not putting this at the top of its Xperia 1 II spec lists, but it is evidence of legit substance to this hook-up.",
    "The T* lens coating is used in high-end DSLR/mirrorless lenses from Zeiss and Sony, and all-but kills lens flare and other “ghosting” that causes light smearing and loss of image contrast. If you want to know more, there’s an interesting piece on the Zeiss website about how T* works.",
    "Other high-end phones have lens coatings too, of course, but unwanted flare is still an issue in many phones. We review enough of the things to know first-hand.",
    "More of the same...",
    "The Vivo X60 Pro+ gets the same Zeiss treatment as the Sony Xperia flagships. This partnership was announced in early 2021.",
    "You can expect some degree of collaboration in the lens design, as well as the glare-busting Zeiss T* coating.",
    "This seems a fairly transparent way to Vivo to improve how its cameras are seen by the rest of us. However, it probably deserves some more attention, as Vivo has incorporated some quite dynamic hardware for a while now.",
    "For example, the Vivo X50 Pro has a 'gimbal' stabilizer system, which lets the camera compensate for a motion to a much greater degree than normal optical image stabilization.",
    "However, with Nokia, Sony and Vivo now on-board with Zeiss, there’s a certain production line quality to the endorsement. The real danger, for Zeiss in particular, is the branding is used in cheaper Sony and Vivo phones whose cameras are not at all notable.",
    "Aiming for the big time...",
    "OnePlus partnered with Hasselblad for its OnePlus 9 series phones. We don’t get any specific claims about hardware, unlike the Zeiss lens coating collabs. But OnePlus has at least not tried to cloak this partnership in so much mystery you could believe the entire camera module has been lifted from Hasselblad itself and dropped into the phone.",
    "The OnePlus 9 and OnePlus 9 Pro have an orange shutter button, a Hasselblad shutter sound and a Pro mode made to look like that of a Hasselblad camera.",
    "This is window dressing, but OnePlus also says the teams worked on the phones’ color tuning. We’ve had a chance to use both phones, and found the OnePlus 9’s images look pretty similar to those of the OnePlus 8 Pro. The OnePlus 9 Pro is a different case, with superior mid-tone clarity and contrast in scenes that need a lot of HDR help, slightly different color tone and better low-light performance.",
    "However, we can’t tell how much of this is down to Hasselblad, and how much is thanks to the new Sony IMX789 sensor.",
    "The cynic in us would remind you OnePlus has its own imaging engineers, that the Hasselblad team’s core experience is in medium format camera that have different restrictions and compromises to a phone sensor. We actually prefer the story to be one of OnePlus’s own team taking the progress it made with the OnePlus 8 Pro and pushing it that bit further with the OnePlus 9 Pro, rather than letting Hasselblad take most of the credit.",
    "However, Hasselblad does have more experience in small sensor tech than it did in 2016, when that initial Motorola x Hasselblad collaboration happened. Drone and action camera maker DJI acquired a majority stake in Hasselblad in 2017.",
    "If there’s a dedicated imaging DJI/Hasselblad team dedicated to drone sensor performance, it would arguably be more useful to OnePlus than those who work on Hasselblad’s primary camera lines.",
    "At first glance, the OnePlus and Hasselblad partnership does not have a huge amount of substance to it. There's certainly a large element of marketing the collaboration, which is backed up by OnePlus's decision to put clear Hasselblad visual and audio cues on the phone, and in the phone camera.",
    "Claims of 'color science' tweaking are also easy to make. That said, we certainly did notice a genuine boost in color accuracy over previous OnePlus phones in our OnePlus 9 Pro review. As our review states, it takes \"fantastic images, with great-looking colors and masses of detail\".",
    "Exactly how much of this is down to the Hasselblad influence is hard to say and, right now, the partnership doesn't quite deliver the \"breakthrough\" in mobile photography that OnePlus claimed in its announcement of the partnership.",
    "However, this is the first part of a multi-year deal, and it's likely that we'll see more of a Hasselblad influence in future OnePlus phones. The partnership is a three-year collaboration, and the software improvements are apparently just the beginning, OnePlus hinting at jointly-produced hardware in the future. Right now, it's mostly marketing, but with the promise of it evolving into something more exciting in the future."
  ],
  "headers": {
    "5": "1. Nokia and Zeiss: Nokia N90 and Nokia N95 (2005)",
    "9": "2. Nokia and Zeiss: Nokia 808 Pureview (2012)",
    "17": "3. Panasonic and Leica: Panasonic CM1 (2015)",
    "23": "4. Motorola and Hasselblad: Moto Mod (2016)",
    "28": "5. Huawei and Leica: Huawei P9 (2016)",
    "33": "6. Nokia, Zeiss and Light: Nokia 9 Pureview (2017)",
    "39": "7. Sony and Light: Official partnership (2019)",
    "44": "8. Sony and Zeiss: Sony Xperia X1 II (2020)",
    "51": "9. Vivo and Zeiss: Vivo X60 Pro+ (2021)",
    "57": "OnePlus and Hasselblad: OnePlus 9 Pro (2021)",
    "65": "OnePlus 9 and Hasselblad: milestone or marketing?"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Motorola Moto Z": "https://www.techradar.com/reviews/phones/mobile-phones/moto-z-1323027/review",
    "Nokia 7650": "https://www.techradar.com/news/phone-and-communications/mobile-phones/flashback-the-past-present-and-future-of-the-camera-phone-1209860",
    "Nokia N93": "https://www.techradar.com/reviews/phones/mobile-phones/nokia-n93-84285/review",
    "Microsoft Devices Blog": "https://blogs.windows.com/devices/2012/02/24/how-carl-zeiss-lens-changed-the-world/",
    "Microsoft Devices blog interview": "https://blogs.windows.com/devices/2012/03/05/nokia-808-pureview-carl-zeiss-science-of-making-the-perfect-lens/",
    "Moto Z": "https://www.techradar.com/reviews/phones/mobile-phones/moto-z-1323027/review",
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Huawei P9": "https://www.techradar.com/reviews/phones/mobile-phones/huawei-p9-1318442/review",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "Nokia 7.2": "https://www.techradar.com/reviews/nokia-72",
    "Nokia 9 PureView": "https://www.techradar.com/reviews/nokia-9-pureview",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Zeiss website": "https://lenspire.zeiss.com/photo/en/article/technical-article-on-t-coating-and-reduction-of-reflections-in-lenses/",
    "OnePlus 9 Pro review": "https://www.techradar.com/reviews/oneplus-9-pro-review#camera",
    "announcement": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-3473933485918375400&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Fuk%2Fnews%2Fpress-release%2Foneplus-and-hasselblad-partnership"
  }
}