{
  "source": "https://www.techradar.com/news/xiaomi-mi-12-already-sounds-like-a-front-runner-for-the-best-camera-phone-award",
  "title": "Xiaomi Mi 12 already sounds like a front-runner for the 'best camera phone' award",
  "category": "phones",
  "updated": "2021-06-29T13:48:45Z",
  "author": "tom-bedford",
  "summary": "And it could have a top-end chipset",
  "article": [
    "Xiaomi tends to be at the forefront of new smartphone camera innovations, and we've heard the Xiaomi Mi 12 might bring a big step up - it could introduce a 192MP or even 200MP main camera, in the first resolution-jump for phone cameras since the Mi Note 10 used the first 108MP snapper in 2019.",
    "This news comes from popular leaker Digital Chat Station, posting on Chinese social media platform Weibo, who has provided some early details about what we believe to be the Mi 12.",
    "They've said an unnamed upcoming phone will use the newest version of Qualcomm's top-end chipset line - presumably, then, the Snapdragon 895, as people think it'll be called - along with a high-resolution display with a punch-hole for the selfie camera and a 200MP main camera.",
    "In the introduction to this article, we mentioned a 192MP main camera - we say this because in a separate post, Digital Chat Station mentioned a phone using a 192MP with 16-in-1 pixel binning for great-looking pictures.",
    "It's possible that in the first post, the leaker just rounded the figure up, but it's also plausible that two different phones are being discussed, because Samsung (whose camera sensors Xiaomi typically uses in its phones) has previously unveiled both 192MP and 200MP smartphone camera sensors.",
    "Either way, a 200MP main camera would also likely use 16-in-1 pixel binning or similar, which would result in 12.5MP photos with loads of light and color information.",
    "Digital Chat Station made sure to mention that they don't know which phone this information refers to, but the Mi 12 seems most likely - it's expected towards the end of the year, so it makes sense that details haven't been finalized just yet.",
    "This camera probably won't come to a Redmi phone because they don't have top-end Snapdragon chipsets, or a Poco one, as they wouldn't use a super-high-res main camera, so in terms of Xiaomi phones, the Mi line seems most likely. We'll have to wait and see, though.",
    "Xiaomi's frantic scramble to become a major smartphone player means it introduces loads of innovations on the camera front - sometimes these can be hits, like the Xiaomi Mi 11, or misses, like the Mi 11 Ultra.",
    "It would make sense for Xiaomi to debut Samsung's 192MP or 200MP main camera - its photography strategy seems to be 'higher-res is better', though some might disagree that that's necessarily true. Just look at the Xiaomi Mi Note 10's use of a 108MP main camera, despite that being a mid-range phone, to show the company is fond of lots of pixels.",
    "Some have speculated that the Samsung Galaxy S22 will get the 192MP or 200MP main camera, but that's unlikely. Samsung phones don't always use Samsung camera sensors, opting for Sony parts some of the time, and Samsung's highest-res camera sensors often don't get used by the company at all, with other brands using them instead. That was the case for the ISOCELL HMX, the first 108MP sensor, which was only used by Xiaomi and Motorola.",
    "It's far more likely that Samsung will keep the Galaxy S22 in line with the S21 range, perhaps with bigger, but same-res, sensors.",
    "If Xiaomi does opt for super-high-resolution cameras in its Mi 12 line, the move will take it far towards the 'best camera phone' award, but not all the way - as the saying goes, it's not how big your sensor is, but what you do with it.",
    "Software and AI smarts will need to progress too, with quick and accurate scene optimization and correct handling of the different components of a picture. Smartphone photography judging isn't just about the main camera, as a device needs a well-rounded complement of snappers, so a useful ultra-wide, telephoto and even macro camera are important too.",
    "We'll have to see what happens with the Xiaomi Mi 12 when it launches towards the end of the year, and what leaks and rumors tell us before that. For all the information as it breaks, including on the Mi 11T which is expected first, stay tuned to TechRadar."
  ],
  "headers": {
    "8": "Could this be the best camera phone?"
  },
  "links": {
    "Xiaomi Mi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "Weibo": "https://m.weibo.cn/detail/4653360990914370",
    "post": "https://m.weibo.cn/detail/4653004463278952",
    "pixel binning": "https://www.techradar.com/how-to/what-is-pixel-binning-and-how-can-it-help-my-smartphone-photography",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "Mi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro"
  }
}