{
  "source": "https://www.techradar.com/news/exclusive-glass-wants-to-make-an-instagram-just-for-enthusiasts-at-a-cost",
  "title": "Exclusive: Glass wants to make an Instagram just for enthusiasts, but at a cost",
  "category": "computing",
  "updated": "2021-09-08T15:15:49Z",
  "author": "daryl-baxter",
  "summary": "Through the looking glass",
  "article": [
    "Creating a new social network nowadays is seen as a poisoned chalice, especially with juggernauts like Facebook, Twitter and now TikTok firmly entrenched in the public consciousness.",
    "However, photography is still seen as one of the last great big opportunities in social media, especially with enthusiasts. While Instagram offers a great place for this, it’s pivoted more towards influencers and memes in recent times.",
    "With the September 14 event confirmed recently by Apple, there's a good chance that we'll be seeing new iPhones arrive soon, which means improved cameras to showcase on our chosen social networks.",
    "This is where Glass comes in, which is available only on Apple's App Store for the moment. Thought up by co-founders Tom Watson and Stefan Borsje, the company has recently removed its invite-only access, so we spoke to them about how things are going, alongside plans for the near-future, especially with the iPhone 13 and Pixel 6 expected to be announced soon.",
    "Having used the app since its debut, its elegant design and focus on photography users does set it apart from other social networks, but it's too early to tell if Glass can truly eclipse its more established competitors.",
    "With a crowded social media network market, we wanted to know what sets Glass apart from other websites that focus on photography.",
    "“We have two [features], and I don’t think they’re what most people would suspect. Yes, we have higher quality photos with minimal compression. Color profile support? Yup. But right now, the things that make Glass great aren’t product-based,” Watson and Borsje explain.",
    "“They’re foundational pieces of our community. One: our commitment to our Community’s safety with blocking, reporting, and a code of conduct built-in to the product from day one. Our community has no place for hate or harassment. Two: our lack of venture capital or outside investment. By self-funding Glass to this point, and to now be funded by members, we’re able to align our decisions with our community. High growth startups use tracking, ads, and algorithms to hook their users. They’re endless engagement machines, fighting for your attention. We’re able to forego all of that and we think that’s what makes Glass special.”",
    "With the inevitability of a new iPhone 13 model being announced at Apple's September 14 event, alongside Google’s Pixel 6 and Pixel 6 Pro, we wondered whether the recent launch of Glass played a factor into this, especially with many users wanting to showcase the new cameras in these new models.",
    "“We’re as thrilled about the new iPhones coming from Apple as the next photographer, but that didn’t play into our launch. While Glass is an iOS-app, it’s not exclusively an iPhone photography community,\" Watson explains. “We launched when we did because we couldn’t keep building in private. It was time to start building a community and working with them towards the features we collectively want.”",
    "Privacy is a topic that many users want to be aware of when they sign up to a service - how its information is used and stored. We asked the Glass team how this factors into its design intentions.",
    "“We think we have a significantly clearer Terms of Service than most apps. It makes it very clear that we don’t own a member’s photos,” Watson and Borsje explain. “When we launched, we made it clear that any user can download all of their data and account deletion. Because we don’t have investors or advertisers, we don’t need to keep your data around. When you delete your account, your data is gone for good.”",
    "As Glass has only recently launched, there’s plenty of feedback that the company is receiving from its users, namely public profiles, so you can easily discover the type of device they commonly use, alongside some background into them. We wondered whether this was something that Glass was considering.",
    "“Public profiles are definitely a planned feature for us, but we’re currently focused on continuing to improve our iOS app,” Watson and Borsje tell us. “Our first big feature update, adding Categories to Discovery, is coming in the next couple weeks and we couldn’t be more excited to get it into the hands of users.”",
    "While it’s possible to view Instagram through a web browser on Apple’s tablet, there’s no dedicated app for it, baffling a few of its users. We asked if this was in the midst to appear for Glass instead, before Instagram took notice.",
    "“We’ve been dreaming of an iPad version of Glass since we started work on it nearly two years ago, but it’s still a ways off,” Watson and Borsje explain. “Developing for iPad is a significant time and resources investment. Apple’s marketing does a great job of selling development for iPad, but it’s essentially a second app.",
    "\"Part of the trade-offs with not taking VC money is that things take us longer - we have limited resources and we move slower than other VC-backed competitors. We think that is a long term competitive advantage, but it’s a friction we feel every day. If you have other people’s money, it’s easy to solve problems quickly, but it’s hard to solve them well.”",
    "While the majority of social networks rely on ads to keep the lights on, Glass is behind a monthly $4.99 / £4.49 or yearly £24.99 / $29.99 subscription, with a two-week free trial to start off with. We wanted to know if this was another way of keeping the platform exclusive to photography enthusiasts while avoiding ads to be shown.",
    "“When we decided to forego venture capital to build Glass, we knew we’d have to fund it with membership fees,” Watson and Borsje explain. “We think that a thriving indie business exists in a membership community and that photographers are happy to pay a minimal membership fee for a product instead of their data being the product.”",
    "Having photography as a hobby or as a career should be accessible to everyone, which is why we asked Glass if this is also seen as a factor for the app.",
    "“We built Glass for photographers, amateur and professional alike. We hope Glass is a home for photographers to share their knowledge,” Watson and Borsje added. “Or a place for them to acquire more knowledge. We’ve already seen members levelling up their photography skills in the first two weeks of Glass launching, and we’ve seen iPhone photographers be inspired to buy their first DSLR. We’ve seen some of our favorite photographers share details on how they nailed a photo.\"",
    "With Glass now foregoing invites as the only method that someone could sign up to the service, we asked if the reaction to the new social network has surprised them.",
    "“We’ve been blown away by the response from our launch, and now in the last week we removed our invite-only system,\" Watson and Borsje explain. “It’s an important step to open up our community to anyone who would like to sign up and we’re excited to see where it takes us.”"
  ],
  "headers": {
    "4": "A touch of Glass enthusiasts",
    "8": "The new iPhone and Pixels on the horizon",
    "10": "A Glass ceiling of privacy",
    "12": "Public profiles to come?",
    "14": "An iPad version incoming?",
    "17": "A Glass paywall",
    "19": "Accessible for everyone",
    "21": "Looking back on the launch"
  },
  "links": {
    "September 14 event confirmed": "https://www.techradar.com/news/iphone-13-launch-date-confirmed-for-september-14-heres-all-we-know",
    "Glass": "https://glass.photo/",
    "Apple's App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9879914761503156000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fglass-photography-community%2Fid1528446339",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "new iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "September 14 event": "https://www.techradar.com/news/iphone-13-launch-date-confirmed-for-september-14-heres-all-we-know",
    "Pixel 6 and Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6",
    "coming in the next couple weeks": "https://glass.photo/updates/glimpse-into-glass"
  }
}