{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-s21-officially-launches-its-powerful-lineup-after-ces-2021",
  "title": "Samsung Galaxy S21, S21 Plus and S21 Ultra announced with surprising prices",
  "category": "phones",
  "updated": "2021-01-15T03:49:25Z",
  "author": "david-lumb",
  "summary": "The Samsung Galaxy S21, S21 Plus, and S21 Ultra are finally here",
  "article": [
    "The Samsung Galaxy S21 phones have finally been launched, and they set the standard for 2021: a trio of powerful phones, with great displays, 5G connectivity, and in the most powerful model, S Pen support.",
    "The three-phone Samsung Galaxy S21 range follows last year’s lineup: a standard S21 phone, a larger S21 Plus, and the top-spec'd (and pricier) S21 Ultra. The phones were accompanied by two other new products at launch: the AirPods Pro-rivaling Samsung Galaxy Buds Pro and the Tile-like Samsung Galaxy SmartTag trackers.",
    "Perhaps the biggest news is that each of the phones is cheaper than last year’s Samsung Galaxy S20 models, though their specs have been pared back a bit in exchange.",
    "The Samsung Galaxy S21 price starts at $799 / £769 / AU$1,249, while the Samsung Galaxy S21 Plus cost begins at $999 / £949 / AU$1,549 and the S21 Ultra starts at $1,199 / £1,149 / AU$1,849 – saving $200 (and varying amounts in the UK and Australia) compared to the prices of the Samsung Galaxy S20, Galaxy S20 Plus, and Galaxy S20 Ultra from last year.",
    "To reach those prices, the Samsung S21 and S21 Plus have flat 1080 x 2400 AMOLED displays (6.2-inch and 6.7-inch screens, respectively) instead of the 1440 x 3200 resolution found in the S20 phones, though both have refresh rates maxing out at 120Hz.",
    "But perhaps most frustrating of all: none of the S21 phones (Ultra included) have a Micro SD slot, so it's impossible to expand their storage. Buyers will have to pay extra for more space or rely on cloud storage for overflow.",
    "They also start at 8GB of RAM, unlike the 12GB base specs of their predecessors. But otherwise, both have a powerful Snapdragon 888 or Exynos 2100 chipset (depending on where you are in the world) and baseline 128GB of storage, with a 4,000mAh battery in the S21 and a 4,800mAh battery in the S21 Plus.",
    "The Samsung S21 and S21 Plus sport roughly the same camera suite from last year, with 12MP main, 64MP telephoto and 12MP ultra-wide cameras (the S21 Plus loses its time-of-flight sensor, though).",
    "But there are a few refinements to the camera software that folks should pay attention to – Zoom Lock, for instance, attains ‘tripod-like stability’ when you zoom in all the way to 30x, which is still called Space Zoom. Single Take (which collects a bunch of photos and footage) is back, and now analyzes more frames per second for more still frames to choose from.",
    "Video is even more powerful, with a Director’s View that allows you to see live thumbnails and switch between lenses while recording. A new mode, Vlogger View, allows you to shoot video with the front and back cameras simultaneously (a feature that previously appeared in the LG Wing 5G, among others), and record with multiple mics.",
    "Finally, you can now record 8K video and pluck out individual high-res frames to use as still images.",
    "The Samsung Galaxy S21 Ultra gets all that – and a whole lot more.",
    "The Samsung S21 Ultra has even more to offer over its lower-priced siblings this year, with its Snapdragon 888 or Exynos 2100 chipset, 12GB of RAM and 128GB of storage to start, a 5,000mAh battery, and most importantly, S Pen support. Samsung’s stylus will be sold separately and can be housed in optional cases (there’s no internal slot, as in the Galaxy Note 20 series).",
    "Otherwise, the 6.8-inch AMOLED display is the only one of the line to reach a 1440 x 3200 resolution... which it can activate simultaneously with 120Hz refresh rate. That’s a first for Samsung’s phones, which previously had to choose between the highest resolution or refresh rate.",
    "But the top phone also gets another edge on its siblings: it packs two telephoto cameras on the back, one 3x optical and one 10x optical, which combine for far steadier shots while zoomed in. The other rear cameras include 108MP main and 12MP ultra-wide cameras, while the selfie camera is 40MP – and every camera on the phone can shoot 4K footage at 60fps.",
    "The Samsung Galaxy S21 series launched over a month earlier than usual, as Samsung’s flagships typically come out around Mobile World Congress in late February. But given MWC 2021 is being postponed until the end of June (if not later), Samsung had free reign to launch its flagships early – and set the course for 2021.",
    "The Samsung S21 range may set the standard for the year, especially in price: any phone priced higher is going to be graded a bit harsher by comparison. It’s not the first handset to drop in price from the previous year’s; the Google Pixel 5 was notably cheaper than the Pixel 4, and despite trimming some intriguing features, we were fans of that move.",
    "We’ll have to see how the year’s other flagships pivot their strategies to match (or refute) the more affordable Samsung Galaxy S21 handsets."
  ],
  "headers": {
    "12": "The Samsung S21 Ultra: the new king of smartphones",
    "15": "Samsung S21: setting the course for 2021"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Samsung Galaxy SmartTag": "https://www.techradar.com/news/samsung-galaxy-smarttag-release-date-price-design-and-features",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "LG Wing 5G": "https://www.techradar.com/reviews/lg-wing-5g-review",
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "set the standard": "https://www.techradar.com/news/why-the-samsung-galaxy-s21-may-set-the-price-for-2021s-flagship-phones",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review"
  }
}