{
  "source": "https://www.techradar.com/news/iphone-12-versus-iphone-11",
  "title": "iPhone 12 vs iPhone 11: which Apple smartphone is the right choice for you?",
  "category": "phones",
  "updated": "2021-07-20T14:39:51Z",
  "author": "jon-mundy",
  "summary": "Is 2020’s iPhone better than 2019’s model?",
  "article": [
    "The iPhone 12 range was heralded as the start of a new era for Apple’s famed smartphone family. But is it really such a leap forward?",
    "5G is a big addition, but won't matter to everyone yet, while the power upgrades from its predecessor - the iPhone 11 - are both expected and likely to go unnoticed in general use. But its OLED screen is a major upgrade, and there are other improvements too, such as MagSafe, so there's a lot to consider.",
    "Comparing the iPhone 12 to the iPhone 11 in a straight face-off is perhaps the best way to assess just how much of a leap forward the newer phone really is.",
    "Not only does one directly follow the other, but they’re thought to be one of the best selling Apple phones from their respective years, so it's a reasonable comparison - especially as some iPhone 11 buyers will likely be wondering whether it's worth upgrading.",
    "Add in the fact that Apple still sells the iPhone 11 as new, and this comparison becomes all the more pertinent. Below we'll talk you through everything we've learned about these two phones during our reviews process so you can make a decision of which is for you.",
    "The iPhone 12 became available for purchase on October 23, 2020. Prices start from $799 / £799 / AU$1,349 for the 64GB model, moving up to $849 / £849 / AU$1,429 for 128GB, and $949 / £949 / AU$1,599 for the 256GB model.",
    "Its predecessor, the iPhone 11, landed on September 20, 2019. At launch, prices started at $699 / £729 / AU$1,199 for 64GB, increasing to $749 / £779 / AU$1,279 for 12GB and $849 / £879 / AU$1,449 for 256GB.",
    "However, we’re almost two years on at the time of writing. As mentioned above, the iPhone 11 is still available to buy brand new in all three storage capacities, but prices are much lower than before.",
    "You can currently pick up the 64GB model for $599 / £599 / AU$999, the 128GB model for $649 / £649 / AU$1,079, and the 256GB model for $749 / £749 / AU$1,249 direct from Apple, and other stores sometimes hit even lower prices.",
    "The iPhone 12 meanwhile hasn't yet had an official price drop (though likely will when the iPhone 13 arrives, probably in September). It too can be found slightly cheaper from some third-party stores, but the price remains much higher than the iPhone 11's.",
    "This gives the iPhone 12 quite a task. Can it justify the additional expenditure of $150 / £150 / AU$270 over its still-relevant predecessor?",
    "We weren’t hugely enamored with the iPhone 11 design when it arrived on the scene. There was a sense that we’d seen it all before – which we had (or most of it, at any rate) with the previous year’s iPhone XR.",
    "The iPhone 11 essentially followed the same blueprint, albeit with a few differences. It’s available in fetching new colors of mint green, lilac and lighter yellow shades, which join the Product (RED), black, and white variants. The back of the phone is slightly cleaner than before, but with a rather obtrusive new camera array that also appears on the iPhone 12.",
    "The iPhone 11 is a premium-feeling phone, featuring the same balance of glass surfaces and aluminum body as its newer sibling. But it’s a chunky bit of kit at 150.9 x 75.7 x 8.3mm and 194g – certainly compared to the iPhone 12, which measures just 146.7 x 71.5 x 7.4mm and weighs 164g.",
    "Lest you get blinded by figures, the iPhone 12 is smaller than the iPhone 11 in every way. It’s 4mm shorter, 4mm narrower, almost a millimetre thinner, and a whopping 30g lighter.",
    "This comes down to Apple’s crisp new design for the iPhone 12. It’s rather reminiscent of the iPhone 4 and 5, with its flat-edged industrial approach. However, the tolerances are even tighter, and the screen extends closer to the edges.",
    "It loses the attractive dark green shade from the iPhone 11 lineup, as well as the less appealing yellow and purple shades, but in their place is an appealingly deep shade of blue and a slightly less attractive light green tone. It’s also available in the usual Black, White, and Product (RED) variants.",
    "Going back to the subject of build quality, the iPhone 12 gains a new nano-crystalline Ceramic Shield screen, which is four times tougher than before. And while both phones are IP68 certified, the iPhone 12 can be immersed in 6 meters of water for 30 minutes, while the iPhone 11 can only withstand 2 meters.",
    "From a certain perspective the iPhone 11 is more comfortable to hold, courtesy of those rounded edges. But we prefer the look and compact nature of the iPhone 12 overall.",
    "If the iPhone 12’s fresh design makes the release gap between it and the iPhone 11 seem longer than 13 months, just wait until you consider the screens.",
    "While both measure 6.1 inches and get to around 600 nits of brightness in typical conditions, that’s where the similarities end.",
    "There are significant differences in screen technology. While the iPhone 11 employs IPS LCD technology, the iPhone 12 makes the leap to OLED. This results in more vibrant colors, deeper blacks, and far more contrast for the newer phone. There’s really no comparison.",
    "The iPhone 12 presses home its display advantage with a much sharper resolution. While the iPhone 11 can manage only 828 x 1,792 for a meager 326 pixels per inch (ppi), the iPhone 12 comes in at 1,170 x 2,532 for 460ppi.",
    "Both models do share a 60Hz refresh rate. But that’s far more disappointing on the iPhone 12, which has been released at a time when 90Hz and 120Hz screens are the norm in the Android world.",
    "In terms of hardware, the camera offering in both devices is similar. And not just from a visual standpoint.",
    "Both the iPhone 12 and the iPhone 11 pack a pair of 12MP cameras – one wide and one ultra-wide – with the same-sized image sensors. The only major difference here, in fact, is that the iPhone 12’s wide sensor has a faster f/1.6 aperture, which naturally helps with low-light photography.",
    "That’s not to say that the iPhone 12 camera doesn’t achieve superior results. It does – but the difference isn’t seismic, and those improvements are largely a result of Apple’s improved image processing and the more capable A14 Bionic chip.",
    "This brings about new features such as Smart HDR 3, which handles dynamic range better than before. Scenes with bright skies will look better balanced with the iPhone 12.",
    "In other daytime shots, you’ll struggle to see much of a difference. But like we’ve already said, the key improvements can be seen with low-light and night-time shooting. We noticed that the iPhone 12 captures brighter shots with more detail in more challenging conditions.",
    "Night mode in general is more flexible on the iPhone 12, as you can employ it across all three cameras (including the 12MP selfie camera).",
    "Video has also been improved in the iPhone 12, with Dolby Vision now rendering scenes with much better balance and dynamic range. Although on the iPhone 12, it’s limited to 4K/30fps.",
    "Apple improves its smartphone performance by a decent margin every year, so it’s no surprise that the iPhone 12’s A14 Bionic chipset comfortably beats the iPhone 11’s A13 Bionic. Going by benchmarks and Apple’s own estimates, the CPU is around 20% faster, while the GPU is around 10% faster.",
    "The A14 also contains a 16-core Neural Engine for an 80% boost to AI performance compared to the A13.",
    "In general use, however, we defy you to notice the difference. Both phones feel extremely fast, and no modern 3D game or multitasking session will highlight a clear advantage for the newer phone – minus the odd lighting effect or optimized 60fps frame rate.",
    "The true advantage of this performance boost is increased future-proofing. You might be able to buy both phones brand new today, but the iPhone 12 will enjoy an extra year of feeling fast, not to mention ongoing software support from Apple.",
    "It’s also the more capable A14 that enables many of the camera advances outlined in the previous section. These days, such photographic improvements are more a result of processing power and machine-learning than they are lens and sensor upgrades.",
    "For what it’s worth, both phones run on 4GB of RAM. We say ‘for what it’s worth’ because iOS is famously frugal with its memory usage, so such an amount is ample for everything you could want to do with these devices. Yes, the Pro models pack 6GB of RAM, but we remain unconvinced that they enable anything meaningful.",
    "The iPhone 12 and the iPhone 11 come with identical storage options, too: 64GB, 128GB, and 256GB. We would have liked to see the iPhone 12 join the iPhone 12 Pro in adopting 128GB as the new entry-level option.",
    "Another spec advantage for the iPhone 12 is 5G connectivity. If you live in an area with next-gen network coverage (admittedly, still a big ‘if’), then only the newer phone will be able to capitalize on it.",
    "So far the iPhone 12 has secured a win in every category, aside from price. But there’s one area that the older iPhone 11 would appear to hit back: battery life.",
    "With a 3,110mAh battery, the iPhone 11 certainly has more power on tap than the iPhone 12 with its 2,815mAh unit. But you need to factor in the added optimization based on the more efficient A14 Bionic chip.",
    "Apple quotes identical battery life figures across video (17 hours) and music (65 hours). Sure enough, we experienced similar stamina from both phones.",
    "However, we’d say that the iPhone 11’s battery life is slightly better. With its lower-res display and lack of power-sapping 5G, we found that we could perhaps eke a tad more life out of the older phone.",
    "Moving around between 4G and 5G networks certainly seemed to drain the iPhone 12’s juice quite heavily in our experience, leading to an empty battery after 16 to 18 hours. Hopefully that will improve in future models, when the 5G modem is better integrated.",
    "While both phones pack wireless charging, only the iPhone 12 supports Apple’s new MagSafe method. Imagine if your Qi charging pad was smaller and clipped onto the back of your phone magnetically. Then add an ecosystem of compatible cases and wallets – this is MagSafe in a nutshell. It requires extra expenditure for the accessories, and it’s too early to say whether it will become a neglected gimmick in the vein of 3D Touch.",
    "Another piece of additional expenditure will be a regular wall charger. If you were to buy a new iPhone 12 or iPhone 11 direct from Apple today, you wouldn’t get a brick in the box – just a USB-C to Lightning cable. Find a new iPhone 11 from before the iPhone 12 rollout, however, and you’ll score that classic charger.",
    "The iPhone 12 is a better phone than the iPhone 11 in every way bar battery life.",
    "It’s faster, more compact, more attractive, and it packs a vastly superior display. Its camera represents only a modest improvement, but those advances make themselves known in tricky low-lighting conditions.",
    "As mentioned, the iPhone 11 might just pip its sibling to the post in the battery life stakes, which is disappointing. But part of that comes down to the provision of 5G connectivity in the iPhone 12, which will hopefully come into its own throughout the rest of 2021 and beyond.",
    "Are these improvements combined worth the $150 / £150 / AU$270 premium? That’s something each reader will have to answer for themselves – but one thing’s for certain: after a couple of years treading water, the iPhone 12 feels like a clear step forward from Apple."
  ],
  "headers": {
    "5": "iPhone 12 vs iPhone 11 price and availability",
    "11": "Design",
    "19": "Display",
    "24": "Camera",
    "31": "Specs and performance",
    "39": "Battery life",
    "46": "Takeaway"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories"
  }
}