{
  "source": "https://www.techradar.com/news/huge-cyberpunk-2077-patch-12-is-imminent-finally-adds-ray-tracing-for-amd-gpus",
  "title": "Huge Cyberpunk 2077 patch 1.2 is now out, finally adds ray tracing for AMD GPUs",
  "category": "gaming",
  "updated": "2021-03-30T08:22:30Z",
  "author": "darren-allan",
  "summary": "Version 1.2 has now arrived with tons of changes",
  "article": [
    "Cyberpunk 2077’s much-awaited version 1.2 patch is now out on PCs and consoles alike as a 28GB download, complete with a full – and extensive – list of changes coming with v1.2.",
    "On PC, that includes the introduction of ray tracing support for AMD graphics cards. Of course, Nvidia support has been in from the get-go, so this is something that many Big Navi GPU owners have doubtless been looking forward to.",
    "However, how ray tracing will actually run on an AMD GPU is another question, particularly in this initial implementation.",
    "We’ve seen how ray tracing in Cyberpunk 2077 is very demanding for even Nvidia GPUs, which is where DLSS comes in – but AMD’s equivalent to help combat serious frame rate dips, FidelityFX Super Resolution, isn’t here yet (but it is expected at some point in 2021). Note that you’ll need the latest graphics driver from AMD to enable ray tracing in the game.",
    "Other PC tweaks include the ability to change more key bindings, and to get rid of double-tap to dodge on the movement keys (which has ruined our attempts at stealthing way too often).",
    "Console-specific fixes include improvements for screen space reflections (perhaps to tackle graininess issues), and “various memory handling optimizations on Xbox”, as well as solutions for “multiple issues with random game freezes”, all of which are very welcome.",
    "There are a ton of general fixes for the interface, problems with quests, and a whole lot of optimization work in terms of memory management and increasing the stability of the game engine, all of which should help to cut down on the amount of crashing overall.",
    "Gameplay tweaks have been applied, too, with a new steering sensitivity slider to make driving vehicles a smoother experience (particularly for those on PC using a keyboard). Furthermore, the promised police tweak has been made whereby the NCPD spawn radius has been increased when the player commits a crime (so you’re less likely to be immediately nailed).",
    "The version 1.2 patch for Cyberpunk 2077 was previously expected to debut in February, but was delayed following the hack of CD Projekt Red.",
    "Via VideoCardz"
  ],
  "headers": {
    "5": "Time for reflections"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "list of changes": "https://www.cyberpunk.net/en/news/37801/patch-1-2-list-of-changes",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Big Navi GPU": "https://www.techradar.com/news/amd-big-navi",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "expected at some point in 2021": "https://www.techradar.com/news/amds-fidelityfx-super-resolution-wont-require-machine-learning-unlike-nvidia-dlss",
    "delayed following the hack of CD Projekt Red": "https://www.techradar.com/news/cyberpunk-2077-patch-12-delayed-with-cd-projekt-red-cyber-attack-to-blame",
    "VideoCardz": "https://videocardz.com/newz/cyberpunk-2077-releases-patch-1-2-changelog-update-is-coming-soon"
  }
}