{
  "source": "https://www.techradar.com/news/ovh-says-it-will-now-back-up-all-customer-data-for-free-following-fire",
  "title": "OVH says it will now back up all customer data for free following fire",
  "category": "computing",
  "updated": "2021-03-17T10:28:03.909Z",
  "author": "mayank-sharma",
  "summary": "Some parts of the data center will be back online soon",
  "article": [
    "As it continues to restore normalcy following the fire that hit its data center in Strasbourg, web hosting provider OVH has announced a new comprehensive backup strategy.",
    "The move follows OVH’s announcement last week that it can’t recover data from the backups of some of its customers, who hadn’t contracted the company for keeping them in the first place. OVH CEO Octave Klaba has now shared the company’s plans to extend a comprehensive free backup cover to all customers.",
    "“This incident will change our way of delivering the services, but I believe it will also change the standards of the industry,” said Klaba in a video message.",
    "A major fire broke out at Europe’s largest hosting provider earlier this month, which is also the third-largest in the world, completely destroying one of its four data centers in France, while crippling the other three.",
    "Klaba has been constantly giving updates on the team’s efforts to restart the beleaguered French facility, even as they work with investigators to narrow down on the actual cause of the fire.",
    "After analyzing the damage to the servers, OVH put up a page listing the status of each of the services along with the state of their backups. In addition to the backup services that OVH offers as a paid add-on, it also keeps copies even for users who haven’t paid for the additional service.",
    "Unlike the paid add-ons which are also duplicated off-site to other data centers, the free ones are usually kept in the same facility, and many of them have been impacted by the fire as well.",
    "In his latest update, Klaba shared that as a fallout of the incident, OVH will now offer a comprehensive backup policy to all its users, by default, without any additional cost.",
    "While this might be a welcome move, and as Klaba mentions it could help elevate the offerings across the cloud hosting domain, it’ll be of little comfort to customers who have lost data due to them being confused about OVHs backup policy.",
    "Via: The Register"
  ],
  "headers": {
    "3": "Confused customers"
  },
  "links": {
    "fire that hit": "https://www.techradar.com/news/europes-large-web-hosting-provider-knocked-offline-following-fire",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "backup": "https://www.techradar.com/best/best-backup-software",
    "can’t recover data": "https://www.techradar.com/news/ovh-says-it-doesnt-hold-backups-for-some-systems-affected-by-data-center-fire",
    "OVH": "https://www.techradar.com/reviews/ovh",
    "free backup": "https://www.techradar.com/best/best-free-backup-software",
    "hosting provider": "https://www.techradar.com/web-hosting/best-small-business-web-hosting",
    "cause of the fire": "https://www.techradar.com/news/ovh-has-a-hunch-about-what-caused-the-fire-that-destroyed-its-data-center",
    "The Register": "https://www.theregister.com/2021/03/17/ovh_restoration_update/"
  }
}