{
  "source": "https://www.techradar.com/news/an-xbox-streaming-box-render-is-doing-the-rounds-but-its-almost-certainly-fake",
  "title": "An Xbox streaming box render is doing the rounds - but it's almost certainly fake",
  "category": "gaming",
  "updated": "2021-08-02T13:15:58Z",
  "author": "vic-hood",
  "summary": "All that glitters ain't gold",
  "article": [
    "Images of what are allegedly 'leaked' renders of an Xbox streaming device are doing the rounds, but we're not convinced.",
    "The images were shared by a Twitter user, who posted the renders along with an image of a now-deleted anonymous post from what appears to be 4Chan. The images show a small, almost Xbox Series S-like device which is apparently \"a little thicker and wider than a deck of playing cards\".",
    "The anonymous post, posted on May 25, claims that this design render is from early 2021 and that the device looks \"a little different now\". The post claims that the device plugs straight into your TV, allowing Xbox players to stream from their home console or play via xCloud (AKA Xbox Cloud Streaming).",
    "The post also claims the button seen beside the USB is an IR receiver, allowing any Xbox controller to pair with it - with mouse and keyboard support planned. In addition, this device will apparently have Wi-Fi and ethernet support, will support party chat and allow players to download compatible Xbox apps such as Disney Plus and HBO.",
    "It's a shame that it's likely a fake.",
    "We're not convinced by this 'leak' for a multitude of reasons. Firstly, let's look at the source. The now-deleted post was originally published on 4Chan, where we have often seen fake leaks and information shared. The post is also from May 25 and has since been deleted (though it's unclear why), before being shared on July 31 by a Twitter user with just over 3000 followers - who has encouraged Twitter users to follow them for \"more info like this\". There's no evidence this user has insider information on Microsoft nor that the original 4Chan poster does.",
    "Secondly, the renders themselves could have easily been mocked up by the original poster. We've seen this happen before, with 'leakers' creating their own fake mockups and information for clout. There's nothing in this image that would suggest it is from Microsoft in-house (where we would potentially expect to see a watermark or similar to prevent leaks such as this).",
    "It's very likely these renders are fake but Microsoft does seem to be working on Xbox streaming devices. In a press release from Microsoft ahead of E3 2021, Liz Hamren, CVP of Gaming Experiences & Platforms, revealed that Xbox is developing standalone streaming devices that you can plug into a TV or monitor, so if you have a strong internet connection, you can stream your Xbox experience.",
    "In addition, in an interview with Stratechery (via The Verge), Xbox head Phil Spencer discussed the potential of a new Xbox Game Pass tier, which would see a streaming stick bundled in with Xbox Game Pass to allow players to access xCloud streaming on their TV.",
    "\"I think you’re going to see lower-priced hardware as part of our ecosystem when you think about streaming sticks and other things that somebody might want to just go plug into their TV and go play via xCloud,\" Spencer told the publication. \"You could imagine us even having something that we just included in the Game Pass subscription that gave you an ability to stream xCloud games to your television and buying the controller.\"",
    "An Xbox streaming stick would theoretically allow Xbox players who own one to access Xbox Cloud Gaming (which is currently in beta for Xbox Game Pass Ultimate) from any TV, by simply plugging the device into the television. Unlike Xbox remote gaming, which allows players to access their own console from their mobile device, cloud gaming sees players streaming set Xbox Cloud gaming titles from any device that supports the feature - without you needing an Xbox console.",
    "While currently, those with Xbox Game Pass Ultimate can test the beta Xbox Cloud Gaming on a range of compatible devices including iPad, iPhones and Windows devices, a streaming stick would potentially allow any television to also become a compatible device rather than individual television manufacturers having to create their own app - although the same press release claimed that \"Xbox is working with global TV manufacturers to embed the Xbox experience directly into internet-connected televisions with no extra hardware required except a controller.\"",
    "Overall, an Xbox streaming device would open up the platform to even more players, removing the barrier of console expense and allowing Xbox players to actually play their games pretty much anywhere. It looks like it's something Microsoft is definitely working on - but these rendered images almost certainly aren't it.",
    "TechRadar has contacted Xbox for comment."
  ],
  "headers": {
    "5": "Analysis: Microsoft is working on a streaming device, but it's probably not this"
  },
  "links": {
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Stratechery": "https://stratechery.com/2020/an-interview-microsoft-executive-vice-president-of-gaming-phil-spencer/",
    "The Verge": "https://www.theverge.com/2020/10/23/21529925/xbox-tv-streaming-stick-xcloud-cloud-gaming-phil-spencer-interview",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}