{
  "source": "https://www.techradar.com/news/new-apple-tv-could-be-a-set-top-box-speaker-and-smart-display-combo",
  "title": "New Apple TV could be a set-top box, speaker and smart display combo",
  "category": "televisions",
  "updated": "2021-04-12T13:42:02Z",
  "author": "henry-st-leger",
  "summary": "An Apple TV set-top box with a built-in speaker could be on its way",
  "article": [
    "An Apple TV set-top box with a built-in speaker and camera could be on its way, according to a new report by Bloomberg.",
    "Apparently, sources close to the matter have confirmed that new Apple TV hardware is incoming, and that it'll combine the functionality of several distinct devices in its quest for smart home dominance.",
    "While existing Apple TV models are effectively set-top boxes with access to smart TV apps, this rumored device would be combined with an Apple HomePod speaker to emit its own audio directly and be used as a smart speaker through the Siri voice assistant.",
    "It sounds very similar to the Amazon Fire TV Cube, which combines a Fire TV streaming stick with the capabilities of an Amazon Echo smart speaker – but with some additional feathers to its bow.",
    "The report also claims that this Apple TV will \"include a camera for video conferencing through a connected TV and other smart-home functions\" – seemingly taking a lesson from the Portal TV webcam, which is able to turn a television screen into an oversized smart display for Messenger or Whatsapp video calls.",
    "With Apple's huge user base, a TV peripheral that's able to let you easily FaceTime through the screen could gain a lot of traction, putting Apple back on the map for home streaming hardware, which is an area where it's largely considered to have fallen behind in recent years.",
    "This latest report builds on a host of rumors that have accumulated around Apple's inevitable Apple TV refresh, including a new Apple TV remote with improved Siri functionality.",
    "There's even the possibility of 4K gameplay at 120Hz, which would be a major boon for games on the Apple Arcade subscription service, and likely increase the number of AAA franchises on the platform.",
    "We are, however, used to being disappointed on this front. Near enough every big Apple announcement event will face rumors of new Apple TV hardware, which over the past few years has repeatedly failed to materialise. Apple TV iterations usually have a lead time of two-to-four years between them, and the latest Apple TV 4K was released in late 2017 – meaning a new model is very much due.",
    "It's very possible that Apple has been biding its time until it was able to release a meaningful update, though, and the rising awareness of high refresh rates and 4K gaming (amid new consoles like the PS5 and Xbox Series X) may well be the catalyst the tech giant was looking for.",
    "The Apple TV 4K currently retails at $179 / £179 / AU$249 for the 32GB model, while the beefier 64GB version will run you $199 / £199 / AU$279. Expect a model with all of the features reported above, though, to be even pricer than these."
  ],
  "headers": {
    "6": "Will it finally happen?"
  },
  "links": {
    "set-top box": "https://www.techradar.com/news/best-set-top-box",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-12/apple-working-on-combined-tv-box-speaker-to-revive-home-efforts",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Amazon Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Fire TV streaming stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Portal TV": "https://www.techradar.com/reviews/facebook-portal-tv",
    "smart display": "https://www.techradar.com/best/best-smart-displays",
    "new Apple TV remote with improved Siri functionality": "https://www.techradar.com/news/new-apple-tv-remote-could-hint-at-hardware-refresh-later-this-year",
    "the possibility of 4K gameplay at 120Hz": "https://www.techradar.com/news/next-apple-tv-could-have-4k-120hz-gaming-support",
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}