{
  "source": "https://www.techradar.com/news/google-announces-it-might-have-created-physics-breaking-time-crystals",
  "title": "Google announces it might have created physics-breaking 'Time Crystals'",
  "category": "computing",
  "updated": "2021-08-05T23:53:30Z",
  "author": "john-loeffler",
  "summary": "We can't even say how big a deal this might be",
  "article": [
    "Researchers with Google's quantum computing division just published a study to the pre-print server ArXiv claiming to have created physics-defying \"Time Crystals\" using the company's Sycamore quantum computer, and it's honestly impossible to say how big of a deal this might turn out to be.",
    "As Quanta Magazine explains, a time crystal is both stable and constantly in flux, with definable states repeating at predictable intervals without ever dissolving into a state of total randomness.",
    "Without getting too bogged down in up-spins and down-spins of the qubits (the sub-atomic particles that can represent both 1 and 0 and which are the foundation of quantum computing), what Google claims to have done is essentially taken a checkers board with all the red pieces on one side and all the black pieces on the other and metaphorically struck the table in such a way as to perfectly switch the two sides without expending any energy.",
    "The second law of thermodynamics says that this simply can't happen, but time crystals don't seem to give a hoot about entropy and now Google is saying that it's not only seen one in action, but that the process which produced it is scalable – and the implications of that could be huge.",
    "We need to reiterate that Google's results haven't been peer-reviewed, so we can't say for certain that what Google researchers have done will hold up under scrutiny.",
    "That said, if what Google's quantum computer accomplished can be replicated, then time crystals aren't just real, but they might actually be put to some actual real world use. The implications of such a technology for computer memory alone are hard to fathom, much less for computer processing itself.",
    "Ultimately though, it's very hard to say what would come from a system that defies entropy, since nature as we know it doesn't work that way – and the assumption of entropy is built into every system we've ever produced or observed. We've never seen something like this before, assuming these results hold up, so predicting what we can do with it is a genuinely difficult but incredibly exciting mystery."
  ],
  "headers": {},
  "links": {
    "published a study": "https://arxiv.org/abs/2107.13571",
    "Quanta Magazine": "https://www.quantamagazine.org/first-time-crystal-built-using-googles-quantum-computer-20210730/"
  }
}