{
  "source": "https://www.techradar.com/news/halo-infinite-campaign-missions-arent-replayable-but-its-being-worked-on",
  "title": "Halo Infinite campaign missions aren't replayable but it's being 'worked on'",
  "category": "gaming",
  "updated": "2021-12-07T11:18:54Z",
  "author": "vic-hood",
  "summary": "Collectible fans rejoice!",
  "article": [
    "Halo Infinite's campaign missions aren't replayable, but the issue is being 'worked on' according to developer 343 Industries.",
    "Halo Infinite has plenty of collectibles to vacuum up but the inability to replay some missions means that, if you miss collectibles in certain areas the first time around, you won't be able to go back and pick them up later. That's because Halo Infinite doesn't allow you to replay missions within the same save file. To replay missions you need to start a new save file and begin the campaign over again.",
    "However, it looks like a fix could be on the way - though it may not be available for Halo Infinite's launch on December 8. Speaking to The Verge, 343 Industries associate creative director Paul Crocker confirmed that the issue is being \"worked on\", though there's no confirmed date for when this fix will arrive.",
    "\"We want to have replay that works well, and when you have a more open game, it gets a lot trickier,” Crocker told the Verge. \"So we made a decision to improve the quality of the single-player campaign to ensure that, as a foundation, that it’s as strong as it possibly could be so that we could then add the other features back in.\"",
    "Halo Infinite is the first Halo game to not allow players to easily replay missions - and frankly, it's perhaps the one that needs it the most.",
    "Halo Infinite has plenty of collectibles to vacuum up but a couple of story missions take place off Zeta Halo, the open-world environment where you'll spend much of your time. For someone like myself, who loves collecting everything, being unable to revisit these missions to collect the collectibles I missed the first time around is frustrating. It's worth noting that upon completing the game, you can mop up everything you may have missed in the open-world areas.",
    "Until this fix is implemented, we would advise picking up all the collectibles in each mission before you move on - to save you missing out."
  ],
  "headers": {
    "4": "Analysis: a frustrating omission"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "The Verge": "https://www.theverge.com/2021/12/6/22821522/halo-infinite-campaign-levels-replay-mission-select-343-industries-microsoft"
  }
}