{
  "source": "https://www.techradar.com/news/amazon-astro-robot-could-be-a-dangerous-smart-home-device-says-leak",
  "title": "Amazon says claims its Astro robot could be dangerous are 'inaccurate'",
  "category": "smart-home",
  "updated": "2021-09-29T16:41:23Z",
  "author": "hamish-hector",
  "summary": "A devil in disguise? Not according to Amazon",
  "article": [
    "Amazon’s new robot Astro – unveiled at the recent Amazon 2021 event – has been presented as a helpful AI assistant who you can’t help but find a little cute. However, a new report suggests that Astro's presence in your home could be more sinister than its outer shell would have you believe.",
    "Information published by Vice’s Motherboard – which it claims has been sourced from leaked internal development documents and video recordings of meetings about Astro – indicates that the new robot assistant may have more than a few flaws. Amazon denies the claims, and says Astro has been rigorously tested to ensure its safety.",
    "In the report, one developer is quoted as saying: “Astro is terrible and will almost certainly throw itself down a flight of stairs if presented the opportunity”. They went on to say that the robot’s person-detection is unreliable (which would impact its usefulness as a home security device) and its parts seem too fragile for their intended purposes.",
    "This fragility would be a particular issue for the mast camera that allows Astro – which costs $999 (around £750 / AU$1,400) – to scan its surroundings from higher up; this has apparently been known to lock up while extended, which would make it difficult to ship Astro back to Amazon for repair.",
    "Given these issues, the developer quoted by Motherboard added that pushing Astro as an accessibility device is at best “nonsense” and at worst “potentially dangerous for anyone who'd actually rely on it”. According to Motherboard, other Astro developers shared similar concerns.",
    "We reached out to an Amazon, and a spokesperson told us: “These characterizations of Astro’s performance, mast, and safety systems are simply inaccurate.",
    "\"Astro went through rigorous testing on both quality and safety, including tens of thousands of hours of testing with beta participants. This includes comprehensive testing on Astro’s advanced safety system, which is designed to avoid objects, detect stairs, and stop the device where and when necessary.”",
    "Whether the concerns of developers shared by Motherboard are valid or not, some consumers may have already has issues with Amazon Astro from a privacy perspective. It’s one thing to have an Amazon Echo that you might have concerns about regarding privacy in your living room, but it's quite another to have such a device roaming around your home.",
    "Astro will be tracking you quite a bit more than static devices and will have to store a lot of data to work effectively. As other leaked Amazon documents explain, Astro needs to create an accurate map of your home and mark out “choke points” where it's likely to bump into a human, wall or pet.",
    "This means the robot will learn where family members congregate and how they move around, and will be scanning those areas with its cameras to look out for dangers. It’ll also learn to interact with you and will store visual ID information to recognize you.",
    "For some people, this will be too much personal data to have stored on an Amazon device – and if it turns out that Astro works as poorly as these leaks suggest, for many people the risks would outweigh the rewards.",
    "For its part, Amazon has explained that Astro includes multiple features to improve privacy. By defining out-of-bounds zones you can let the robot know which areas of your home are off limits, and you can use Do Not Disturb features to tell Astro you need some alone time.",
    "On top of that, much like Echo devices, Astro's microphone and camera have an off button. When this is pressed Astro’s microphones, bezel, periscope cameras, and depth sensors are disconnected, meaning they can't capture video or audio, nor move about your home.",
    "Any data that is collected is stored securely, and any data that is sent to Amazon's servers is encrypted in transit. You can find more details about Amazon Astro's privacy on the official Amazon webpage."
  ],
  "headers": {
    "7": "Analysis: is Astro worth trading your privacy for?"
  },
  "links": {
    "robot Astro": "https://www.techradar.com/news/amazons-astro-robot-is-a-24-hour-security-guard-and-smart-assistant-all-rolled-into-one",
    "Amazon 2021 event": "https://www.techradar.com/news/live/amazon-event-2021-live-blog",
    "Vice’s Motherboard": "https://www.vice.com/en/article/93ypp8/leaked-documents-amazon-astro-surveillance-robot-tracking",
    "official Amazon webpage": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fhelp%2Fcustomer%2Fdisplay.html%3FnodeId%3DG2HDFAZG923JG4W7%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8848470250782600000-20"
  }
}