{
  "source": "https://www.techradar.com/news/knights-of-the-old-republic-remake",
  "title": "Star Wars: Knights of the Old Republic Remake: everything we know so far",
  "category": "gaming",
  "updated": "2021-09-10T10:18:11Z",
  "author": "vic-hood",
  "summary": "A KOTOR remake is officially in the works",
  "article": [
    "It’s long been considered the greatest Star Wars game of all time, and now a new generation of players will get to experience it as a Star Wars: Knights of the Old Republic remake has been announced.",
    "Long rumored and first shown off during the September PlayStation Showcase event, it’s a full-blown remake rather than a remastered version of the 2003 original.",
    "There’s only one trailer to go by so far, and even that was merely a teaser clip. But with the original a stone-cold classic, and the rumor mill grinding on this one for a while, there’s still plenty to share on what to expect from Star Wars: Knights of the Old Republic Remake.",
    "A Star Wars: Knights of the Old Republic Remake release date hasn’t been confirmed yet, but we don’t expect to see the Star Wars RPG to return until at least late 2022 as developer Aspyr has confirmed the game is still in early development.",
    "We know that the KOTOR Remake will launch on PC and as a timed console exclusive on PS5, meaning it will likely come to Xbox Series X/S once this exclusive period comes to an end (though an Xbox release hasn’t been confirmed yet).",
    "PlayStation Showcase 2021 Star Wars: Knights of the Old Republic Remake was officially announced at the PlayStation Showcase 2021, with a brief teaser trailer. The trailer, seen below, has the voice of Bastilla Shan who was one of the recruitable characters in the Bioware epic and shows off the key character, Darth Revan.",
    "Set over 4,000 years before the events of the original Star Wars trilogy, It’s hard to overestimate just how big of a deal Knights of the Old Republic was upon its original release. An RPG by the masters of the genre at the time, BioWare, it was the first Star Wars game that really made you feel as if you were living in George Lucas’s universe. It offered unparalleled choice when it came to directing your characters’ story and personality, and felt like a cool expansion of the Star Wars universe at a time when the franchise still felt like there were mysterious uncharted corners of lore to explore.",
    "The Knights of the Old Republic Remake is not, however, being handled by its original developers at BioWare. Instead, that honor goes to the team at Aspyr.",
    "Those worried about the changing hands of development should be able to rest easy though: if any team knows KOTOR as well as BioWare, it’s Aspyr, which has been responsible for the multiple platform ports and re-releases the original game has received over the intervening years since its first release.",
    "It’s worth noting that it’s quite the coup for Sony here, too. The original KOTOR, and its sequel, never made it to PlayStation consoles, and was an exclusive of the original Xbox console lineup. The only trailer the game has received so far has pointed to the KOTOR remake being a PS5 exclusive, with no other platform announced.",
    "Built from the ground up with new features In a PlayStation Blog post, Aspyr’s Lead Producer, Ryan Treadwell, revealed that the KOTOR Remake will see the original game rebuilt “from the ground up”.",
    "“We’re rebuilding one of the greatest RPGs of all time for a new generation with modern tech, features, visuals and more, while maintaining the integrity of the story and characters that we’ve come to cherish,” Treadwell wrote in the post.",
    "It’s still in early development Don’t expect to get your hands on the Knights of the Old Republic Remake anytime soon. In its PlayStation Blog post, Aspyr described the remake as a “tremendous undertaking, encompassing almost every aspect of the original game” and has stated that it is still in early development. So we imagine we won’t see the game until at least 2022.",
    "It’s being worked on by industry veterans In its PlayStation Blog post, Aspyr revealed that the remake is being worked on by a mix of industry veterans and those who worked on the original Knights of the Old Republic game - giving us hope that the remake is in safe hands.",
    "\"Aspyr has assembled the very best talent from across the industry to create Star Wars: Knights of the Old Republic Remake - industry veterans who have worked on great RPGs, as well as some members of the original Knights of the Old Republic development team,\" Aspyr wrote. \"Their knowledge and passion for these characters, this story, and this world is unmatched.\""
  ],
  "headers": {
    "3": "Cut to the chase"
  },
  "links": {
    "PlayStation Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PlayStation Blog post": "https://blog.playstation.com/2021/09/09/star-wars-knights-of-the-old-republic-remake-is-the-legendary-tale-remade-on-playstation-5/"
  }
}