{
  "source": "https://www.techradar.com/news/huawei-p50-might-have-a-surprise-spec-in-common-with-the-xiaomi-mi-11",
  "title": "Huawei P50 might have a surprise spec in common with the Xiaomi Mi 11",
  "category": "phones",
  "updated": "2021-07-15T08:42:56Z",
  "author": "tom-bedford",
  "summary": "A Qualcomm chipset",
  "article": [
    "While Huawei phones have typically used chipsets the company made itself, called Kirin processors, that tradition is apparently the latest thing to be affected by the global silicon shortage. According to a new report, the company's next phone, the Huawei P50, might use something different.",
    "As reported by GizChina, a leaker on Chinese social media platform Weibo has suggested Huawei straight-up ran out of Kirin chipsets for its upcoming phones, and as a result, will resort to using processors from chipset giant Qualcomm instead for the standard phone in the range.",
    "Apparently, the standard Huawei P50 will use the Snapdragon 888 chipset, the most powerful piece of Qualcomm kit which we also saw in the Xiaomi Mi 11, OnePlus 9, and versions of the Samsung Galaxy S21 in the US and Asia.",
    "However, while that chipset has a 5G modem included, apparently Huawei will use a special version of it without this modem - so the P50 will apparently only be a 4G phone. This is actually something we've heard before.",
    "Qualcomm reportedly won't run the show though, as it sounds like Huawei could rustle up enough processors for its middle phone - the Huawei P50 Pro is said to use the Kirin 9000 chipset. There's no word on the P50 Pro Plus though.",
    "Huawei has typically used its own processors for its phones, so it's quite a surprise that it'd resort to using tech from one of its big rivals.",
    "The chipset shortage has had wide-reaching effects, though - the Samsung Galaxy Note 21 has reportedly been canceled because of it, reports suggest it delayed the Google Pixel 5a launch, and it's starting to seem like it's caused the Galaxy S21 FE to be delayed or canceled too. And that's all just in the smartphone world.",
    "The Huawei P50 is already months late, compared to the P-series' usual launch time, and Huawei is likely using Qualcomm to ensure it can release a phone at all. And hey, looking at past Snapdragon and Kirin performance, the phone will likely be much more powerful than it could have been."
  ],
  "headers": {
    "5": "More powerful Huawei P50"
  },
  "links": {
    "Huawei phones": "https://www.techradar.com/news/best-huawei-phones",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "GizChina": "https://www.gizchina.com/2021/07/15/huawei-to-run-out-of-kirin-chips-this-year-huawei-p50-pro-will-switch-to-snapdragon-chips/",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "This is actually something we've heard before": "https://www.techradar.com/news/huawei-p50-might-not-be-a-5g-phone-according-to-head-scratching-leak",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "reportedly been canceled": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition"
  }
}