{
  "source": "https://www.techradar.com/news/the-latest-dell-xps-13-deals-feature-a-4k-display-and-core-i7-for-just-dollar830",
  "title": "The latest Dell XPS 13 deals feature a 4K display and Core i7 for just $830",
  "category": "computing",
  "updated": "2021-03-30T11:38:38Z",
  "author": "alex-whitelock",
  "summary": "A huge amount of ultrabook for the money",
  "article": [
    "Dell XPS 13 deals aren't too rare - it's one of the more sales-friendly ultrabooks out there. However, what is rare is this $617 discount on a Dell XPS 13 Touchscreen with a 4K display for just $832.99 (was $1,449.99).",
    "Just a quick glance at this machine's specs sheets yields some rather impressive stats. Most XPS 13 deals at this price range tend to rock an i5 processor, but this one manages to pack in an Intel Core i7-10510U processor, 8GB of RAM, and 256GB SSD - and that's not even considering this machine also has a 4K Touchscreen display.",
    "This combo of an i7 processor and 4K display definitely makes this Dell XPS 13 deal noteworthy, and one of the cheapest we've seen yet with this spec for sure. This is the kind of display you simply don't see on ultrabooks in this price range, so you're definitely getting a very high-end component here for a relatively paltry sum.",
    "While heavy gaming is still out of the reach of this particular machine, watching 4K videos and movies is definitely not and the 13-inch display means you're really packing in a ton of pixel density. Images will look particularly sharp and that touchscreen is a really nice little bonus as well.",
    "Outside the US? See the best Dell XPS 13 deals in your region just down below.",
    "For more information on these excellent ultrabooks, check out our main Dell XPS 13 deals page. If you're looking for something a little cheaper, we recommend checking out this week's best cheap laptop deals."
  ],
  "headers": {
    "5": "Dell XPS 13 deals this week"
  },
  "links": {
    "for just $832.99 (was $1,449.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9788094058369135000/https://deals.dell.com/en-us/mpp/productdetail/82bm",
    "Dell XPS 13 deals": "https://www.techradar.com/news/dell-xps-13-deals",
    "best cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals"
  }
}