{
  "source": "https://www.techradar.com/news/halo-infinite-beta-rumors-sign-up-for-a-chance-to-play-early",
  "title": "Halo Infinite beta rumors: sign up for a chance to play early",
  "category": "gaming",
  "updated": "2021-07-05T14:23:11Z",
  "author": "hamish-hector",
  "summary": "No guarantee, but we might see a Halo Infinite beta soon",
  "article": [
    "Is a Halo Infinite beta on the way? A few rumors suggest we might see one ahead of the game’s release later this year, and we really hope they’re true.",
    "If you’re like us and are also keen to get in on the Halo action, we’re here to explain one of the ways that might get you access to the Halo Infinite beta (if there is one). There’s no guarantee, but 343 Industries – the developers of Halo – have used this method for choosing testers before and it might just use it again.",
    "Keep reading to find out how you can sign up to Halo Waypoint’s Insider program for free to be in with a chance to test Halo features early such as Halo Master Chief Collection maps and (hopefully) Halo Infinite.",
    "If the Halo Infinite beta rumor is true you’ll probably want to sign up to Halo Insider to take part. You can do this at Halo Waypoint – follow the link and near the top of the page you should see the option to ‘Signup’ to the program.",
    "Click the button and then fill in the form you see onscreen. You’ll need to have an Xbox account and either a PC or an Xbox to sign up for testing sessions. We’d also recommend you double-check the agreements that you have to sign. The whole process should take less than five minutes.",
    "With that done it’s a waiting game. Halo Developer 343 Industries representatives have said that it never plans to release a Halo game ever again without a beta first (all thanks to The Master Chief Collection’s launch issues) so we can reasonably expect one for Halo Infinite. For now though, there’s no official information on when it might open nor who could be invited.",
    "With E3 2021 coming up soon it’s reasonable for us to expect some kind of announcement at the Xbox and Bethesda conference taking place on June 13. As we learn more we’ll be sure to keep you updated."
  ],
  "headers": {
    "3": "How to sign up to Halo Waypoint and Halo Insider"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Halo Waypoint": "https://www.halowaypoint.com/en-us/community/halo-insider",
    "The Master Chief Collection’s": "https://www.techradar.com/news/halo-the-master-chief-collection-is-getting-a-serious-xbox-series-x-upgrade",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox and Bethesda conference": "https://www.techradar.com/news/e3-2021-microsoft-and-bethesda-confirmed-to-hold-a-joint-conference"
  }
}