{
  "source": "https://www.techradar.com/news/target-ps5-restock-today-heres-when-to-get-the-sony-console-this-morning",
  "title": "Target PS5 restock time was 8am EDT – how to get the next PS5 in stock alert",
  "category": "gaming",
  "updated": "2021-10-27T13:55:13Z",
  "author": "matt-swider",
  "summary": "The PS5 restock at Target won't be the last this week. Here's how to buy the Sony console the next time it's in stock.",
  "article": [
    "Update: The Target PS5 restock time today was 8am EDT, with PS5 Disc coming back in stock for about four minutes throughout the United States.",
    "When is the next PS5 restock? If you follow our PS5 restock Twitter tracker Matt Swider – follow and turn on notifications – you'll get an alert when PS5 is in stock. We knew today from our local Target stores that there would be very few PS5 Disc consoles on hand, but enough people got it from our tweets.",
    "Here's how to know when the PS5 restock happens:",
    "When the Target PS5 restock happens, you'll want to change around the zip code as there may only be a few larger Super Target stores with the Sony console available to purchase, according to our tracking data.",
    "But if your local Target says there's only one console left in stock, there are probably zero consoles. Why? Because we saw PS5 Disc restock a week-and-a-half ago at Target and we expect limited quantities today,",
    "What to do today: Click on this PS5 restock alert from Twitter tracker Matt Swider and turn on notifications (that little bell icon in the profile) for instant alerts. This is what you'll see when there's the PS5 is in stock.",
    "While the Target PS5 restock date always shifts around (last time it was a Friday), we have a better idea of what time it'll happen: around 7:38am EDT.",
    "Between 7am EDT and 8am EDT, we almost always see PS5 in stock at Target. It fits right into the pattern that Target uses when opening up online orders for its consoles that are always for picking up the PS5 in stores (Target never ships).",
    "Target stores had been getting in a fresh batch of PS5 consoles during the last week, according to our sources who contacted Matt Swider on Twitter, but with this minor restock, the table is now reset. This was far from the 22 PS5 consoles per store we usually see during a medium-sized Target PS5 restock.",
    "Instead of Target, we recommend focusing on Sony Direct tonight, the official store of the PlayStation brand. Sony has confirmed that a 2pm EDT exclusive restock will happen today, but only people with a special email invite to a private virtual queue.",
    "The thing is, Sony sometimes opens up a second virtual queue to all PSN users, so you could be able to claim the console at 5pm EDT or 6pm EDT if that happens.",
    "The Target PS5 restock time is consistent in 2021, even if the date is unpredictable. It's always been within a one-hour range between 7am EDT and 8am EDT, with the most popular time being 7:40am EDT.",
    "Why does Target do such early morning restocks when that's 4:45am PDT? It's due to the fact that stores aren't open yet open on the East coast of the United States, so people are unlikely (well, less likely) to come to the Target store location trying to buy the console that's sitting in their online cart.",
    "The good news about such an early start time on the West coast of the US is that you are competing for PS5 console inventory with your local neighbors. While we can't stress enough that you're required to order it online (please stop showing up to Target stores trying to secure a walk-in purchase), you have to select a store to pick it up at. Target hasn't had a ship-to-home option in months. Because it's so early, you have a better chance to buy the PS5 at Target during those early morning hours.",
    "There have been a few PS5 restock opportunities this week besides having to rely on Target, with GameStop being the most reliable. GameStop had PS5 bundles in stock for above MSRP, but everything included was at face value. That makes it easier to get.",
    "We also saw a very brief Amazon Treasure Truck restock of the PS5 Disc console on Tuesday. On Friday there's a GameStop PS5 restock in-store event in the US – at least at six cities in the United States.",
    "We're also keen to check Antonline, a smaller retailer with reliable shipping, that has promised one next-gen console restock per week. A PS5 restock could happen there today, October 27."
  ],
  "headers": {
    "6": "Target PS5 restock time",
    "8": "Next massive PS5 restock date?",
    "14": "Target PS5 restock alternatives"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider"
  }
}