{
  "source": "https://www.techradar.com/news/bethesdas-indiana-jones-game-wont-affect-elder-scrolls-6-and-starfield-development",
  "title": "New Indiana Jones game won't affect The Elder Scrolls 6 and Starfield development",
  "category": "gaming",
  "updated": "2021-01-14T17:26:01Z",
  "author": "adam-vjestica",
  "summary": "Bethesda’s Vice President explains why",
  "article": [
    "The new Indiana Jones game won't impact the development of The Elder Scrolls 6 or Starfield, Bethesda has confirmed.",
    "Todd Howard, director and executive producer at Bethesda Game Studios, will head the new project, and the announcement of Howard’s involvement led many to speculate that The Elder Scrolls 6 and Starfield could be affected adversely. Howard is directing both titles, and also executive producing the upcoming Fallout TV show.",
    "Thankfully that won’t be the case, according to Bethesda Vice President Pete Hines, at least. Hines confirmed on Twitter that although Todd Howard certainly has his hands full, his “main focus remains on directing the upcoming TES6 games”.",
    "All three games aren’t expected until at least 2022, with Indiana Jones in particular likely to be a 2023 title at best.",
    "Ever since Microsoft’s acquisition of Bethesda, speculation has continued over which titles will be exclusive to Xbox Series X, including The Elder Scrolls 6 and Starfield. The publisher's library of games have slowly made their way to Xbox Game Pass, with The Elder Scrolls V: Skyrim, Fallout 4 and Doom Eternal all available to subscribers.",
    "While Microsoft is playing it coy over any exclusivity deals, having all three titles only on Xbox (and PC no doubt) would be a huge boon for the company, particularly when trying to compete against Sony's wave of compelling PlayStation exclusives.",
    "Xbox head Phil Spencer has previously said that Bethesda's games will likely get preferential treatment, and are going to be \"either first or better or best\" on Xbox Series X and PC, but Spencer refused to announce that they'd be \"pulling content from platforms one way or the other\".",
    "Via DualShockers"
  ],
  "headers": {
    "5": "'Better or best' on Xbox"
  },
  "links": {
    "Indiana Jones game": "https://www.techradar.com/news/bethesda-is-making-a-new-indiana-jones-game-yes-really",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Fallout TV show": "https://www.techradar.com/news/fallout-tv-show-on-amazon-prime-trailer-release-date-predictions-and-what-we-know",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Bethesda's games will likely get preferential treatment": "https://www.techradar.com/news/bethesda-games-will-get-preferential-treatment-on-xbox-series-x",
    "DualShockers": "https://www.dualshockers.com/the-elder-scrolls-starfield-development-indiana-jones/"
  }
}