{
  "source": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
  "title": "Splatoon 3 release date, news, trailers and what we'd like to see",
  "category": "gaming",
  "updated": "2021-09-26T13:49:33Z",
  "author": "rhys-wood",
  "summary": "Back into the ink for Splatoon 3",
  "article": [
    "Splatoon 3, the third instalment in Nintendo's quirky and colorful multiplayer shooter series, is in development for Nintendo Switch and it's currently expected to launch sometime in 2022.",
    "The game was first revealed to the world in early 2021, with a trailer giving fans a glimpse at the new setting, the Splatlands, which presents a very different kind of locale from the bustling cities and trippy, otherworldly landscapes associated with previous games. We got a fresh look at the game in September 2021, in a second trailer which teases some of the game's new weapons, enemies, locations and its single-player campaign.",
    "There's still a lot we have to learn about Splatoon 3 but here’s the breakdown of everything we know so far, as well as the things we’d like to see.",
    "[Update: The latest Nintendo Direct brought us a fresh look at Splatoon 3. Keep scrolling to watch it for yourself.]",
    "Splatoon 3 will be the latest instalment in the series, dating back to its first entry on the Wii U in 2015 and followed up with Splatoon 2 for Nintendo Switch in 2017. The series focuses largely on multiplayer battles between Inklings - adorable humanoid characters that have the ability to transform into squids to swim through colored ink.",
    "This feature ties heavily into Splatoon’s gameplay. Its flagship multiplayer mode, Turf War, tasks two teams of four players to cover as much of the map as possible with their team’s ink. This is achieved via the player’s loadout of weapons. Keeping with Nintendo’s family-friendly vibe, weapons in Splatoon fire colored ink as opposed to bullets, and can be used to cover the map as per the objective, or to temporarily incapacitate your opponents.",
    "Splatoon’s got quite a fun assortment of weapons, as well. From the rapid-firing Splattershots to a literal giant paint roller, each weapon comes with its own build of sub-weapons and powerful special weapons. Splatoon 3, judging by the trailer, looks like it will be adding a few more to the pile, with a huge bow taking center stage that looks like a ton of fun to mess around with.",
    "Turf War is great, fast-paced fun as each team battles to claim as much of the map as possible while also keeping opponents at bay. Players can freely swim through their own team’s ink for faster traversal and surprise attacks. On the other hand, your opponent’s ink will slow you down drastically as well as damage you over time. Rounds typically last for three minutes, making each match a frantic scramble as the music intensifies towards the end.",
    "4v4 multiplayer isn’t the only card up Splatoon’s sleeve, however. Each game boasts other substantive single and multiplayer modes. There’s a story that familiarizes players with various weapon types while providing obstacle courses to traverse (and unique enemies to fight).",
    "Splatoon 2 bolstered the series' available modes even further with Salmon Run, a co-operative horde mode where players work together to fight AI-controlled waves of enemies. This was later joined by the Octo Expansion DLC, a massive and challenging single-player mode loaded with extra missions and boss fights.",
    "We expect Splatoon 3 to include the same kind of feature set in regards to its modes, and it may have a few new tricks of its own to show off as well.",
    "Splatoon 3 is slated for release in 2022, but a more concrete date hasn’t been given as of yet.",
    "Splatoon and Splatoon 2 had worldwide release dates of May 2015 and July 2017 respectively. So it’s possible we could also see a late Spring to early Summer release date for Splatoon 3 in 2022.",
    "Nintendo said after the game's announcement that it wanted to release more info about Splatoon 3 before the end of 2021 and, indeed, it made a second appearance during the September 23 Nintendo Direct, where some new info was detailed. However, we still didn't get a concrete release date. Hopefully, this second appearance means that the ball is now rolling on regular information drops and we'll see increasing amounts of the game as we go into the next year.",
    "September 23 Nintendo Direct trailer",
    "Splatoon 3 made a welcome return during the September 23, 2021 Nintendo Direct presentation. Here, we got a look at more Turf War gameplay, featuring all-new superpowered special attacks. More interestingly, though, we were treated to a sneak peek at Splatoon 3's single player campaign, titled Return of the Mammalians.",
    "Announcement trailer",
    "The Splatoon 3 announcement trailer gave us our first look at the upcoming game. It opened with what looks to be the initial customization phase of your playable Inkling and their “buddy,” which appears to be a Salmonid - prominently featured as enemies in Splatoon 2’s Salmon Run mode.",
    "Interestingly, previously gendered options (players could choose to be a boy or girl Inkling) appear to be gone. Familiar options of hairstyles, eye color and legwear remain, but it looks like Nintendo is doing away with making players choose one of two genders. This is a definite plus in terms of inclusivity, and allows players to access hairstyles that were previously gender-locked.",
    "From there, the trailer leads into what looks to be a brief glimpse at a single-player mode. Our Inkling makes their way through a post-apocalyptic, arid landscape, and it looks like someone suplexed the Eiffel Tower, as the ruined structure is half-buried upside down in the earth. The Inkling then boards a train before they find themselves in Splatoon 3’s new hub city of Splatsville.",
    "The trailer closes out with a look at Splatoon’s familiar competitive multiplayer, which looks largely unchanged barring some new weapon types and a new way to enter an arena at the start of the match.",
    "New weapons",
    "There'll be some new weapons in Splatoon 3, some of which we caught a glimpse of in the game's September 2021 trailer. Nintendo has detailed some of the weapons in a recent post and you can see them for yourself below.",
    "Crab Tank",
    "Below is the Crab Tank and according to Nintendo \"when piloting this multilegged vehicle, you can attack with a powerful rapid-fire gun and a cannon with a wide blast area. You can also turn into a ball to move around faster than crab walking.\"",
    "Big Bubbler",
    "Then, there's Big Bubbler, \"a modified version of a special weapon popular in Inkopolis. By making it fixed, the size has been greatly increased! It seems Inklings in the Splatlands think bigger is better. Well, this certainly does look useful for protecting one's allies!\"",
    "Trizooka",
    "The Trizooka is another modified weapon from Inkopolis and \"It has a powerful shot that fires three blasts at once and can be fired three times in total each use!\"",
    "Killer Wail 5.1",
    "Finall, there's the Killer Wail 5.1. According to Nintendo, \"The six floating megaphones move autonomously and attack with lasers that chase enemies. For such a dusty place, it seems the Splatlands are brimming with shiny tech!\"",
    "A glimpse of the single-player campaign",
    "A trailer for Splatoon 3 shown during a September 2021 Nintendo Direct gave us a look at the game’s single-player campaign: Return of the Mammalians. Details are still kind of lacking on the mode but the official description from Nintendo reads: “Take control of Agent 3 and fight against the evil Octarian army alongside the New Squidbeak Splatoon in Splatoon 3's story mode. Discover the secrets of Alterna, the Fuzzy Ooze and how it connects to the mode's theme, ‘Return of the Mammalians’.”",
    "A further deep dive into the game’s trailer on Nintendo’s site points out that “as far as we know, mammals have disappeared from the surface of the planet (minus a couple cool cats, of course)” so it looks like the campaign will take players to a new location, Alterna, to investigate why some Octarian soldiers are growing fur and what it might have to do with a mysterious substance called “Fuzzy Ink”.",
    "No Tokyo Game Show for Nintendo",
    "It looks unlikely that we'll get an update on Splatoon 3 during the Tokyo Game Show as Nintendo has confirmed in a Tweet from the official company account that it won’t be in attendance this year. The company has said that its only involvement will be co-operating to exhibit indie games from other companies.",
    "New art",
    "After Splatoon 3 didn't make an appearance at E3 2021 as many hoped it would, Nintendo has broken its long silence around the game to reveal some new art. Posting through the official Nintendo of America Twitter account, the Splatoon team wished players a happy summer with the image which, while not revealing much, is a nice reminder that work on the game is still ongoing. Given it wasn’t an announcement of a delay, it could be taken as a sign that Splatoon 3 is still on track to hit that 2022 release window.",
    "Splatoon 3 hiring a level designer to integrate 'existing' stages Nintendo linked a job opening for a Splatoon 3 level designer via their Japanese Twitter account. Spotted and translated by Twitter user OatmealDome, the job description looks to have some interesting responsibilities.",
    "The job of the Splatoon 3 level designer calls for mostly typical fare, including placing stage objects and balancing attributes for weapons. However, more interesting is another responsibility that calls for renovating ‘existing’ stages.",
    "This could be taken a number of ways. It’s possible that Splatoon 3 could be bringing back stages featured in the first two games, albeit with various twists and changes thrown in. When you think about it, this would make a degree of sense. Following Splatoon 3’s theme of chaos, we might witness stages reimagined in this image, potentially looking dilapidated or at least significantly altered.",
    "However, this could just mean that the new level designer will be looking over new stages developed for Splatoon 3, and just polishing them up for release.",
    "If the former is true, though, we don’t yet know if these stages will be variants on single-player or multiplayer maps. Remixed, harder versions of story missions we’re familiar with sounds appealing, but would Nintendo get a pass for recycling old content?",
    "More likely is that the stages in question are from Splatoon’s multiplayer suite. We can think of a number of fan favorite stages that would look great with a more chaotic makeover. Reusing stages in this way isn’t unprecedented, either. Splatoon 2’s story mode carried some maps over from its multiplayer for certain missions, giving them a slight visual overhaul in the process.",
    "There’s many things Splatoon 3 can do to improve on its predecessors. While Splatoon 2 was a solid follow-up to the original with fun new modes to offer, it felt iterative, almost like it was made to keep up appearances on the Nintendo Switch. Not necessarily a bad thing, considering Splatoon 2 is the 9th best-selling Switch game to date, but we feel like Splatoon 3 could do so much more.",
    "Matchmaking Firstly, there’s genuine improvements that Splatoon’s matchmaking absolutely needs. Chief among them is being able to more reliably play with friends. If you can believe it, both Splatoon and Splatoon 2 did not allow players to queue into multiplayer matches with their friends in online lobbies.",
    "Splatoon 2 introduced League Battle which did let players enter with premade groups, but confusingly, the mode was only available at certain times. In both standard and ranked play, it was impossible to play with friends outside of randomly running into them online.",
    "The only way for friends to play with each other was via local play, or in private lobbies against one another. Splatoon 3 absolutely needs to address this. When every other multiplayer shooter on the market lets us team up with our friends, Splatoon has no excuse.",
    "Axe time-limited modes Speaking to the limited time aspect of certain modes, we’d love it if Splatoon 3 shied away from this practice. This was present for League Battle and Salmon Run in Splatoon 2, the latter being one of the best modes the series ever introduced. It was only available on certain days for a few hours at a time.",
    "Nintendo should be incentivizing players to access modes like this whenever they want - it keeps us playing longer and ultimately get more enjoyment out of the experience. Splatoon is an incredibly fun series - Nintendo shouldn’t be looking for ways to make it less so.",
    "A better single-player mode Splatoon 3 could use more substantial single player offerings. What’s present in Splatoon and Splatoon 2 is nice, but the base game story modes are very short, with little reason to revisit them bar some extra collectibles here and there.",
    "Splatoon 3’s trailer has us craving a more open-ended single player experience. Fun fact: the story’s direction seems to be taking cues from Splatoon 2’s final Splatfest results. The featured team choices there were Order vs Chaos, with Chaos handily winning.",
    "As a result, the world beyond Splatoon’s hub cities looks to be in dire straits. The series has already established that it takes place in a post-humanity world, so Splatoon 3 has every opportunity to explore the mess us humans left behind."
  ],
  "headers": {
    "4": "What is Splatoon 3?",
    "11": "Splatoon 3 release date",
    "14": "Splatoon 3 trailer",
    "21": "Splatoon 3 news and rumors",
    "44": "Splatoon 3 - what we'd like to see"
  },
  "links": {
    "post": "https://www.nintendo.com/whatsnew/detail/2021/new-splatoon-3-details-from-the-squid-research-lab/",
    "reads": "https://www.nintendo.co.uk/Games/Nintendo-Switch/Splatoon-3-1924751.html?utm_medium=social&utm_source=youtube&utm_campaign=NintendoDirect%7CSplatoon3%7CNewTrailer%7Co2VV%7Cm_id_U5ZzDsRRH4%7C1924751%7Cw39#Overview",
    "site": "https://www.nintendo.com/whatsnew/detail/2021/new-splatoon-3-details-from-the-squid-research-lab/",
    "Tweet": "https://twitter.com/Nintendo/status/1433717983579230209?s=20"
  }
}