{
  "source": "https://www.techradar.com/news/gartner-top-trends-in-retail-for-2021",
  "title": "Gartner: Top trends in retail for 2021",
  "category": "computing",
  "updated": "2021-03-19T14:58:33Z",
  "author": "kelsie-marian",
  "summary": "Summary of 3 out of 7 retail trends",
  "article": [
    "The ongoing COVID-19 pandemic is driving global retailers to fundamentally reassess how they do business. Due in part to its many challenges and threats, 2020 has accelerated digital transformation across the retail industry.",
    "According to Gartner’s 2021 CIO survey, nearly two-thirds of retail CIOs said their relationships with their CEOs strengthened in 2020, as CIOs have helped guide their businesses through significant disruption.",
    "To accurately advise the business on technology investments, Gartner has identified seven key trends that retail CIOs must recognize and understand. Highlighted here are three of the seven trends making biggest impacts for retail CIOs in 2021.",
    "“Touchless” experiences are “safe,” physical-contact-free interactions across the customer’s entire shopping process. As government social distancing and hygiene requirements continue across several markets, customers are expecting retailers to offer safe, touchless shopping experiences. Customers should be provided with multiple ways to research, purchase and consume goods, in convenient, contact-free interactions in a hygienic physical environment.",
    "Touchless interactions across major customer processes include the following four stages:",
    "Actions:",
    "Fulfilment execution enables excellence in fulfilment operations across the retailer’s physical and digital assets through real-time analysis and reconfiguration of inventory, labor and processes. This in turn results in optimization of inventory, enablement of unified commerce experiences and increased customer satisfaction, as well as improved profitability for the business.",
    "As e-commerce has seen significant increases over the past year, excellence in fulfilment execution has become a top priority for retailers, with consumer demand for unified commerce experiences increasing. As a result, retailers can expect lasting post-pandemic demand for greater online purchasing with timely acquisition.",
    "According to Gartner’s Final Mile survey, 18% of organizations currently report fulfilment accuracy rates of 95% or better. As shopping limitations continue, customers want and need to be able to search, transact, acquire and consume products and services safely and easily across a retailer’s entire ecosystem. This means that retailers need strong store teams and robust technology in place to create a fluid experience for customers while simultaneously managing costs.",
    "Actions:",
    "Algorithmic merchandising optimization enables retailers to more precisely determine items that need to be displayed and stocked. It also helps how items should be priced and promoted, to maximize sales, margin, inventory and customer satisfaction across touchpoints.",
    "Optimization models use customer behavior insights and predictive analytics to evaluate the relative performance of items across touchpoints and customer segments, helping merchandisers to make more intelligent decisions.",
    "As operational costs are driven up in response to shifting customer expectations, a renewed focus is being placed on merchandise assortment and pricing accuracy. Retailers can no longer afford to spread inventory across all store locations. As a result, retailers must leverage algorithmic approaches to increase precision when planning assortments, pricing and promotions, and the resulting inventory investments across all touchpoints. Every existing assumption and strategy must be tested against consumer behavior trends.",
    "Actions:"
  ],
  "headers": {
    "3": "Trend 1: touchless interactions",
    "6": "Trend 2: fulfilment execution",
    "10": "Trend 3: algorithmic merchandising optimization"
  },
  "links": {
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}