{
  "source": "https://www.techradar.com/news/airpods-3-photo-leak-shows-dramatic-new-design",
  "title": "AirPods 3 photo leak shows dramatic new design",
  "category": "audio-visual",
  "updated": "2021-03-11T14:23:30Z",
  "author": "olivia-tambini",
  "summary": "Are these the next Apple AirPods?",
  "article": [
    "More leaked photos that supposedly show off the Apple AirPods 3 have revealed a big design shift for the wireless earbuds.",
    "The images were posted to Twitter by LeaksApplePro, and show off what looks like a pair of AirPods with shorter stems, backing up previous rumors that the next AirPods would take some style cues from the noise-cancelling AirPods Pro.",
    "Not only that, but renders of the new AirPods were posted by GizmoChina, with the site claiming that the images came from suppliers of the rumored earbuds.",
    "These renders look very similar to the photos posted by LeaksApplePro, as well as previous images leaked by 52Audio in late February.",
    "Based on the images, it doesn't look as though the AirPods 3 will come with silicone eartips like the AirPods Pro, though it is rumored that they'll come with replaceable eartips of some description. How these will attach to the new 'Pods remains a mystery.",
    "With nearly two years having passed since the last iteration of Apple's true wireless earbuds, the AirPods (2019), there are naturally already murmurs of another updated model coming our way.",
    "While there were rumors of the Apple AirPods 3 crashing into the market before 2020 was out, they never materialized – and now everything is pointing to a 2021 release date.",
    "They could launch very soon, too. Apple’s first big event of the year could take place on March 23, as posited by prominent leaker DuanRui who stated as much in a tweet. Interestingly, this coincides with the OnePlus 9 reveal that’s also scheduled for March 23.",
    "Another Apple tipster, Jon Prosser, added fuel to the speculation fire in a tweet that only featured the number “23.” Prosser elaborated in a follow-up tweet that “AirTags, iPad Pro, AirPods, Apple TV” are all “products that are ready.”",
    "Of course the next AirPods could be a follow-up to the AirPods Pro, rather than an upgraded version of Apple's non-ANC earbuds.",
    "A report from Bloomberg (among others) claimed the AirPods Pro 2 would launch this year, and could be subject to a pretty dramatic design overhaul, getting rid of the protruding ear stems that made the original AirPods so instantly recognizable.",
    "Since then, Japanese blog MacOtakara, which is often right in its Apple predictions, alleged that the AirPods Pro 2 will arrive in April 2021 alongside the iPhone SE 3 – making a March 23 announcement even more credible.",
    "Whatever form the next AirPods take, we'll be keeping our eyes peeled for any further leaks in the run up to March 23."
  ],
  "headers": {
    "5": "When will the AirPods 3 be launched?"
  },
  "links": {
    "Apple AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "LeaksApplePro": "https://twitter.com/LeaksApplePro/status/1369642089387024386",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "GizmoChina": "https://www.gizmochina.com/2021/03/10/apple-airpods-3-renders-leak-showcases-its-design-expected-to-launch-later-this-month/",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "previous images leaked by 52Audio": "https://www.techradar.com/news/new-apple-airpods-image-leak-reveals-third-gen-wireless-earbuds-but-is-it-genuine",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "before 2020 was out": "https://twitter.com/jon_prosser/status/1258004593784623106",
    "in a tweet": "https://twitter.com/duanrui1205/status/1368857262823936000",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2020-10-26/apple-developing-smaller-airpods-pro-revamped-entry-level-model",
    "MacOtakara": "http://www.macotakara.jp/blog/rumor/entry-40813.html"
  }
}