{
  "source": "https://www.techradar.com/news/google-is-building-a-premium-fitbit-smartwatch-running-wear-os",
  "title": "Google is building a premium Fitbit smartwatch running Wear OS",
  "category": "fitness",
  "updated": "2021-05-18T19:01:52Z",
  "author": "cat-ellis",
  "summary": "A true Fitbit smartwatch is coming soon",
  "article": [
    "Google is building a Fitbit smartwatch running Wear OS. Google finalized its acquisition of Fitbit earlier this year, and at this year's Google IO event, the two companies announced that they are combining forces to create a new premium wearable.",
    "Until now, all Fitbit devices have run the company's own proprietary operating system, which (as you might expect) is focused entirely on health, and has limited scope for other smartwatch functions.",
    "Third-party apps are available to download through the Fitbit mobile app, but the selection is very small.",
    "A Fitbit that runs Wear OS would allow you to access your emails, receive smartphone notifications, use maps, and download a huge range of third-party apps – while keeping your heart rate, activity, stress levels, workouts, menstrual cycle and other health stats at the fore.",
    "Such a watch could help bridge the gap between devices like the Fitbit Versa and Fitbit Sense, and fully-fledged smartwatches like the Apple Watch and Samsung Galaxy Watch.",
    "We don't yet know when the first Wear OS-powered Fitbit will be released, or what its exact features will be, but we'll bring you more information as soon as we have it.",
    "Google is also planning to bring some key Fitbit features to all devices running Wear OS, including celebrations when you achieve certain goals (like hitting your steps target), and activity monitoring on your wrist.",
    "Wear OS already includes its own Google Fit app, so it will be interesting to see how this works together with the new Fitbit tools without duplicating features."
  ],
  "headers": {
    "6": "Fitbit on Wear OS"
  },
  "links": {
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "Google IO event": "https://www.techradar.com/news/android-12-news",
    "Fitbit Versa": "https://www.techradar.com/reviews/fitbit-versa-review",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review"
  }
}