{
  "source": "https://www.techradar.com/news/buy-a-ticwatch-e3-and-get-a-full-refund-if-you-get-off-your-butt-and-exercise",
  "title": "Get a free TicWatch E3 if you get off your butt and exercise",
  "category": "fitness",
  "updated": "2021-07-14T09:43:55Z",
  "author": "cat-ellis",
  "summary": "Complete 21 HIIT sessions and post the proof on Twitter",
  "article": [
    "If you buy a TicWatch E3 direct from Mobvoi, the company will give you a full refund if you wear it while completing a 20-minute workout every day. It sounds like a great deal – the TicWatch E3 is a solid Wear OS smartwatch with a good set of fitness tracking features – but the challenge isn't quite as straightforward as it first sounds, and you'll need to jump through some hoops for it.",
    "First, you'll need to buy your TicWatch E3 by July 18 at the latest, for $199.99 / £179.99 / AU$259.99. The challenge is open to people in the US, UK, Australia, Canada, Japan, Singapore, and EU countries, which Mobvoi explains is for logistical reasons.",
    "Once you've received your watch, Mobvoi wants you to play the part of influencer by posting an unboxing video or photos on Twitter with the hashtag #hiitchallengewithTicWatchE3. You need to tag three friends in the tweet, plus the @Mobvoi_Official account. With us so far?",
    "Your challenge period begins once you've posted your announcement. Mobvoi hasn't provided a set workout to follow, so it's up to you to decide exactly how to get your sweat on. Just make sure you open the TicExercise app on your watch and select the HIIT mode before you start, as shown in the video below.",
    "Spinning would be a good option if you have access to a suitable bike, as you can find a class that lasts the required time, and easily check your heart rate on your wrist without stopping.",
    "You need to keep going for at least 20 minutes, and maintain an average heart rate of at least 130bpm, which is pretty tough, but should be achievable for most people of moderate fitness.",
    "At the end of the session, sync your TicWatch E3 with the Mobvoi app on your phone, and share the exercise record watermark or chart, tagging @Mobvoi_Official again. Mobvoi will check out your average heart rate, plus heart rate changes and calories burned to make sure you're playing by the rules.",
    "Once the challenge period is up, send a DM to @Mobvoi_Official to verify all of your efforts, and you should receive your money back within a month. You can still get a partial refund if you don't quite manage it every day. Working out for 15 days will earn you 50% cashback, and doing it for 10 days will get you 25%.",
    "When we reviewed the TicWatch E3, we were impressed by its large, clear display, which allows you to see plenty of workout data and detailed smartphone notifications. We also appreciated its array of pre-installed health and fitness apps, which include tools for tracking stress and blood oxygen saturation.",
    "The TicWatch E3's design is fairly generic, with a particularly larger bezel, and its plastic case lacks the premium feel of higher-end smartwatches, but it's light and comfortable to wear during exercise.",
    "The TicWatch E3 runs Google's Wear OS, and has a Qualcomm Snapdragon Wear 4100 chipset, which means it could be one of the watches that receives an upgrade to Wear OS 3.0 when it launches."
  ],
  "headers": {
    "8": "What you're getting"
  },
  "links": {
    "TicWatch E3": "https://www.techradar.com/reviews/ticwatch-e3",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "buy your TicWatch E3": "https://mobvoi.m4ibck.net/c/221109/733475/10848?subId1=trd-us-1391655762583423700&sharedId=trd-us&u=https%3A%2F%2Fwww.mobvoi.com%2Fpages%2Fticwatche3",
    "@Mobvoi_Official": "https://twitter.com/Mobvoi_Official",
    "When we reviewed the TicWatch E3": "https://www.techradar.com/reviews/ticwatch-e3",
    "Wear OS 3.0": "https://www.techradar.com/news/next-wear-os-version-will-only-work-on-smartwatches-with-these-chipsets"
  }
}