{
  "source": "https://www.techradar.com/news/realmes-new-device-takes-one-of-the-best-android-phones-and-makes-it-even-cheaper",
  "title": "Realme's new device takes one of the best Android phones and makes it even cheaper",
  "category": "phones",
  "updated": "2021-08-18T13:00:30Z",
  "author": "tom-bedford",
  "summary": "The Realme GT gets a Master Edition",
  "article": [
    "With the Realme GT sitting comfortably on our list of the best Android phones, we've obviously got our eye on the brand-new phone line, and now the GT has been joined by two new siblings.",
    "The Realme GT Master Edition and Explorer Master Edition are new entries in the line, that seem to straddle the original device and act as a 'Lite' and 'Pro' version respectively. The latter is getting a limited rollout, but Realme has confirmed the former is coming to the UK, so people there at least will be able to pick it up soon.",
    "This new Realme GT Master Edition is set to start at $399 (about £290, AU$550) but it's worth pointing out Realme doesn't sell its tech in the US - this is probably just a reference price. Either way, it sounds more affordable than the €449 (about $550, £390 or AU$710) original GT.",
    "The phone comes with a Snapdragon 778G processor, 8GB of RAM, a 64MP main camera, a 6.4-inch 120Hz screen and a 32MP selfie camera. It's largely the same as the GT, but without that phone's distinctive faux-leather design and with a weaker chipset too.",
    "With Realme recently confirming it's replacing its X series with this new GT line, it's good to see the line expanded with two new phones (even if you'll only be able to buy one of them).",
    "As we mentioned, the Realme GT is on our list of the best Android phones, wowing us with its top processor, premium design, great hand-feel and yet low price. It's become our go-to recommendation when someone wants a low-cost smartphone.",
    "We've got the Realme GT Master Edition in for review, so we'll have a full analysis of it soon, but it's going to have to prove itself. It lacks the fast processing of the GT, as well as its premium faux-leather design and distinctive color, and those were some of the things we liked about the phone most.",
    "Sure, the price is also lower, but perhaps not enough to justify losing the GT's best bits. That's not to say it looks like a bad phone at all, but if you can afford it, we'd still recommend stretching to the GT.",
    "This advice may have been different if the Explorer Master Edition had launched in more regions: it has a curved-edge display, a Snapdragon 870 processor, 12GB of RAM, a 50MP main camera and a slightly higher price. Oh well, it's not worth dwelling on what could have been.",
    "We might be blown away by the phone when we get to use it; likewise, the converted price in various regions might be surprisingly low, meaning the Master Edition could prove great value for money. We'll have to find out.",
    "We're not totally sure when the Realme GT Master Edition goes on sale, but it'll probably follow the original GT in being exclusive to AliExpress (an import retailer) in most countries."
  ],
  "headers": {
    "5": "Analysis: is the Master Edition worth buying?"
  },
  "links": {
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "it's replacing its X series with this new GT line": "https://www.techradar.com/news/exclusive-realme-is-ending-one-of-its-phone-lines-and-for-an-exciting-reason"
  }
}