{
  "source": "https://www.techradar.com/news/6-things-we-want-in-a-sky-q-smart-tv",
  "title": "6 things we want in a Sky Q smart TV",
  "category": "televisions",
  "updated": "2021-10-11T14:50:10Z",
  "author": "gerald-lynch",
  "summary": "From Dolby Vision to HDMI 2.1, here's what we want from the Sky smart TV",
  "article": [
    "Update: So, it looks like the rumours were true – Sky is officially launching its own TV with no dish, QLED technology and Dolby Atmos built in – read everything you need to know about Sky Glass.",
    "Original story continues below.",
    "Broadcaster Sky already makes the best set top box and TV interface on the market, and sources now point to the company being on the verge of unveiling its own Sky smart TV too.",
    "Having dominated the paid-for satellite TV market in the UK and Europe for three decades, if the rumors are true it’ll be the first time the company has put together not just the set top boxes and content that lives on your television, but the display hardware to show it off in your living room too.",
    "Sky has always offered a premium, luxurious service when it comes to its subscription packages, and while they don’t come cheaply, they’re worth every penny for those that want access to the latest blockbuster Hollywood releases, live sports coverage from across the globe, prestige TV box sets and an ever-growing list of catch up and app-based TV content from the likes of Netflix, Amazon and Disney.",
    "So what would make a Sky smart TV special? It’s almost a given that the company will include its subscription TV packages as part of any sale, making for a TV set that is sold more like a contract mobile phone than a traditional television. But there’s lots to speculate over – and lots to look forward to – if Sky decides to work on these six things we want to see on a Sky Q smart TV.",
    "If it ain’t broke, don’t fix it. The Sky Q interface is the best set top box software out there. Through a combination of great search tools (including smart voice recognition capabilities) and algorithmic recommendations, you’re easily able to find exactly what you want to watch at any time of day. Sky’s glass-like interface panes can be better at knowing what you’re into than you are, always capable of determining your tastes – and even what you’re more likely going to want to watch at different hours of the day. With detailed editorial descriptions of content, an easy-to-explore guide, side-by-side apps, sensibly laid out menu options and an intuitive recording library, Sky would be foolish to equip its TV with anything other than the Sky Q interface.",
    "One thing that Sky Q interface is missing though is user profiles. If you’re in a household of several family members, those aforementioned recommendations can get a bit muddled as multiple people feed data into Sky’s algorithm. A Sky Q smart TV would benefit from the option of individual user profiles, letting high-level users separate out recordings, favourite channels and recommendations between family members, while the casual user can just stick with a single global profile.",
    "One of Sky Q’s top selling points is its huge catalogue of 4K Ultra HD content. While Sky may want to keep costs low by putting together a mid-range smart TV set, I think it’d be doing its library of excellent films and TV shows a disservice to not put them out on a television with some top-drawer home cinema tech. Sky already offers up content in HDR with Dolby Atmos sound – I’d like to see the set step up to the plate with Dolby Vision support in tow too, a looking glass into the very best that cinema has to offer. If it pushes the price up, I think it’s still a smart idea – after all, you have to have a fair bit of disposable income to afford a Sky TV package in the first place. At the very least, I’d like to see a range of TVs offered up by Sky, with one model offering a top-tier checklist of cutting-edge TV technologies built in.",
    "If we’re talking about high-end TV features, here’s hoping the Sky Q smart TV offers HDMI 2.1 ports. These are increasingly vital to gamers with the latest PS5 and Xbox Series X consoles, as they’re required to hit 120Hz refresh rates on a display with variable refresh rate tech activated, keeping gameplay buttery smooth. Oh, and don’t scrimp on the amount of HDMI ports either – four feels like the bare minimum these days.",
    "Though a Sky smart TV might be the first time the company has dabbled in television set tech, it’s previously partnered on Sky TV audio accessories to great effect with premium audio manufacturer Devialet. The Sky Soundbox was an impressive accompaniment to the company's set top boxes, and we’d love to see Sky partner with Devialet again here on the audio front for the smart TV. And if Sky’s already supporting Dolby Atmos in its TV library, let's get those speakers doing some virtualized overhead surround sound, too.",
    "Sky Q still has one achilles heel – its live TV is reliant on a consistent satellite signal that can be negatively affected by adverse weather and poor dish placement. However, for years the company has been working on offering the complete Sky Q service entirely over the internet, making for a more flexible (and in some cases, reliable) package. It’d be great if the Sky smart TV could offer a mixture of both satellite and over-the-internet delivery systems for its live broadcasts, with perhaps the broadband connection acting as built-in redundancy for any satellite issues that from time to time occur."
  ],
  "headers": {
    "6": "The Sky Q interface",
    "7": "User profiles",
    "8": "The complete 4K / HDR Dolby suite",
    "9": "HDMI 2.1",
    "10": "Devialet speaker smarts",
    "11": "Live TV over-the-internet back up"
  },
  "links": {
    "Sky Glass": "https://www.techradar.com/news/sky-glass-is-a-qled-tv-with-sky-q-built-in-and-its-coming-soon",
    "own Sky smart TV": "https://www.techradar.com/news/a-sky-q-smart-tv-is-in-the-works-so-should-you-buy-one",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Amazon": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Disney": "https://www.techradar.com/reviews/disney-plus-review",
    "Sky Q": "https://www.techradar.com/reviews/audio-visual/digital-tv-recorders/sky-q-1309215/review",
    "Dolby Atmos": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Sky Soundbox": "https://www.techradar.com/reviews/sky-soundbox"
  }
}