{
  "source": "https://www.techradar.com/news/you-can-now-use-your-iphone-or-apple-watch-to-unlock-your-hotel-room",
  "title": "You can now use your iPhone or Apple Watch to unlock your Hyatt hotel room",
  "category": "phones",
  "updated": "2021-12-09T10:47:53Z",
  "author": "james-rogerson",
  "summary": "First Hyatt, soon the world",
  "article": [
    "One of the features that was planned for iOS 15 and watchOS 8 was the ability to digitally store hotel keycards on your iPhone, and while the feature was late, it’s now arrived – though only in a handful of locations.",
    "Six Hyatt locations now let you store your keycard on your iPhone or Apple Watch. Specifically, you can do this at Andaz Maui at Wailea Resort, Hyatt Centric Key West Resort and Spa, Hyatt House Chicago/West Loop-Fulton Market, Hyatt House Dallas/Richardson, Hyatt Place Fremont/Silicon Valley, and Hyatt Regency Long Beach.",
    "In every case, you’ll be able to add the keycard to Apple Wallet at any point after you’ve made a reservation, but you’ll still need to check in at the front desk before the digital keycard will be activated.",
    "Once it is, you can use it with Express mode in Apple Wallet, meaning that you won’t have to verify your identity using Face ID or Touch ID every time you want to get into your room.",
    "If you change rooms or extend your visit then your digital keycard can also be updated without you needing to go to the front desk, and if your device enters Power Reserve mode (because the battery is nearly dead) then you should still be able to make use of the digital keycard for up to five hours.",
    "So it sounds like a useful feature, and while it’s not usefully widespread yet, that should soon change, with Hyatt reportedly planning to bring this feature to all of its locations globally, and other hotel chains likely to jump on board before long too.",
    "Apple has more planned for its Wallet app than just hotel keycards, as the company is also planning to allow users to add their driver's license and state ID to the app. Users would then be able to show digital documents at TSA security checkpoints in US airports, and eventually also at retailers and venues.",
    "This feature isn’t available yet, but Apple is currently targeting early 2022 for a US launch, and we’d expect it would go global sooner or later.",
    "So the days of having to carry physical keys or identity documents could be numbered. Now we just need a similar feature on Android.",
    "Via Yahoo Finance"
  ],
  "headers": {
    "6": "Analysis: keycards are just the beginning"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "add their driver's license and state ID": "https://www.techradar.com/news/your-iphone-cant-be-your-drivers-license-until-2022",
    "Yahoo Finance": "https://finance.yahoo.com/news/apple-wallet-hotel-keycards-hyatt-launch-190013202.html"
  }
}