{
  "source": "https://www.techradar.com/news/razers-project-brooklyn-gaming-cockpit-makes-us-wish-ces-2021-was-in-person",
  "title": "Razer's Project Brooklyn gaming cockpit makes us wish CES 2021 was in-person",
  "category": "computing",
  "updated": "2021-03-25T11:03:35Z",
  "author": "john-loeffler",
  "summary": "Cruel, cruel world",
  "article": [
    "Razer announced their new Project Brooklyn concept gaming chair at CES 2021 and if ever there was a product meant for an in-person event, it's a spectacularly unnecessary gaming cockpit.",
    "“Project Brooklyn is an exciting concept developed on the true essence of a fully immersive gaming station,” said Min-Liang Tan, CEO of Razer, in a statement. “The haptic feedback, visuals and overall functional design with attention to ergonomics will deliver a one-of-a-kind gameplay experience.”",
    "Considering that Razer is a prestige brand in the PC gaming scene, you'd think we'd have seen more of this kind of thing from Razer in years past but it only released its first gaming chair – the Razer Iskur – a few months ago. If this is its second, we'd be perfectly okay with that.",
    "Building off of the design for the Iskur, Project Brooklyn pretty much throws everything at the drawing board, including carbon fiber construction, RGB lighting (obviously), audio-driven haptic feedback, and 4D armrests that roll out into a desktop surface for peripherals.",
    "Oh, and there's the 60-inch OLED rollout display mounted to the seatback providing the immersive, panoramic visuals – which is deployable at the push of a button. If ever there was a reason to turn up at the Las Vegas Convention Center in early January, this chair would be it. Sadly, we might have to wait a bit before we can try it out for ourselves – if ever.",
    "Since it's a concept build, the odds of seeing a Project Brooklyn chair available for sale are slim, but elements of it could be implemented in other products. And, given the amount of interest something like this will understandably garner, sometimes the concept builds themselves do eventually make it to market.",
    "Razer said that it plans on continuing development of the concept and plans on testing it out with top eSports players and influencers to assess the project's feasibility with an eye towards taking that feedback and integrating it into Razer's future gaming chair lineup.",
    "Given the prevalence of the technologies Razer is incorporating into this concept – rollout screens are going to be big this year, for instance – it's almost certain that we will eventually see something like Project Brooklyn sooner rather than later. That's what we keep telling ourselves, anyway."
  ],
  "headers": {
    "5": "Will we ever see Project Brooklyn make it to market?"
  },
  "links": {
    "Project Brooklyn concept gaming chair": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-1292089088514984000&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fconcepts%2Frazer-project-brooklyn",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Razer Iskur": "https://www.techradar.com/reviews/razer-iskur-gaming-chair-review"
  }
}