{
  "source": "https://www.techradar.com/news/nhs-completes-worlds-largest-email-migration",
  "title": "NHS completes 'world's largest' email migration",
  "category": "computing",
  "updated": "2021-02-02T10:25:04Z",
  "author": "mike-moore",
  "summary": "NHS says move is a major step forward in creating \"truly digital\" organisation",
  "article": [
    "The NHS has announced it has migrated its entire email service system in what is thought to have been one of the largest such moves ever seen.",
    "The nation's largest employer has moved its email services to Microsoft’s Exchange Online platform through its NHS Digital arm, alongside Microsoft and Accenture, as part of the long-term modernisation and digital transformation project that has been in place for several years.",
    "It says the move is crucial in helping the NHS become a truly \"joined-up\" organisation as it helps fight the coronavirus pandemic.",
    "The email migration began in August 2020, with around 22,000 NHSmail accounts moved over to the cloud every evening and 83,000 accounts across each weekend - with the vast majority of users experiencing no interruption in service.",
    "Microsoft noted that the new email service will take advantage of Online Archiving, which will let NHS staff store and manage older or legacy emails outside of their primary mailbox. Users will also automatically update to the latest version of Microsoft 365 when upgrades are released, hopefully keeping them safe from any possible security attacks.",
    "Alongside the move, NHS Digitial has also deployed a Microsoft Hybrid implementation of Office 365 to the NHSmail platform, which it says is allowing NHS organisations to provision O365 services much faster, integrate with the existing NHSmail identity, and collaborate more easily.",
    "The organisation also deployed Microsoft Teams at the start of the pandemic to allow more effective collaboration, with almost one million messages sent using the service across the NHS every day.",
    "“Whilst the NHS has had to function under incredibly challenging circumstances this past year, Microsoft has been proud to support its vital work in any way we can,\" Microsoft UK’s Chief Executive Clare Barclay said.",
    "“The rapid rollout of Microsoft 365 has ensured that clinicians and support staff across England have access to the very latest productivity tools, enabling a truly joined up approach in the fight against COVID-19 and the effective delivery of essential care services.”"
  ],
  "headers": {
    "3": "NHS migration"
  },
  "links": {
    "email service": "https://www.techradar.com/news/best-email-provider",
    "the latest version of Microsoft 365": "https://www.techradar.com/news/nationwide-microsoft-365-deal-could-save-the-nhs-millions"
  }
}