{
  "source": "https://www.techradar.com/news/how-youtubes-new-audio-feature-is-helping-ubisoft-make-its-trailers-more-accessible",
  "title": "How YouTube's new audio feature is helping Ubisoft make its trailers more accessible",
  "category": "gaming",
  "updated": "2021-03-09T10:51:17Z",
  "author": "ben-bayliss",
  "summary": "'We're focused on including more players in our big moments'",
  "article": [
    "In 2020, YouTube released a new audio track feature into beta, and shared it with a small number of creators. One of those creators was game publisher and developer Ubisoft, which saw audio tracks as presenting an opportunity to improve the accessibility features of its game trailers.",
    "Audio description is a feature you’re likely familiar with across various mediums. It’s an additional audio track that includes original audio with an added voiceover, which narrates visuals to help blind and visually impaired audiences understand what’s being shown.",
    "It’s widely used across movies, television, and some streaming services, but the visually intensive world of video game marketing has lagged behind in this area, causing accessibility issues for many users and potential users. However, efforts are underway to address these shortcomings.",
    "The gaming industry has been working to improve accessibility in general in the last few years, with studios of all sizes exploring new ways of ensuring that games themselves are accessible to the widest possible range of players; however, when it comes to marketing materials, things still have a way to go. Trailers and promotional videos are among the most important tools game companies have for showcasing upcoming releases, and YouTube is the main platform for distributing these.",
    "More often than not, however, these videos will be uploaded without accessibility being taken into account, despite accessibility features being readily available on YouTube itself. The platform's built-in captions are a good example – users are able to choose how the captions are presented, to make the video more accessible to deaf and hard-of-hearing users.",
    "But videos are only accessible if companies put in the effort to ensure that the captions are created properly in the first place. It’s all well and good enabling the notoriously unreliable auto-generated captions, but then viewers are subjected to incorrectly transcribed words, profanities being blanked out, and a blood-curdling scream being described as '[Music]'.",
    "The responsibility to provide a reliable and accessible caption experience lies with the game companies. They can either have the captions produced in-house, or utilize a specialist captioning service.",
    "YouTube’s new audio track feature offers companies a new option for making their videos more accessible to the visually impaired. The feature is still in beta, and only available to a small number of channels, but it allows for multiple audio tracks to be added to a video.",
    "In the past, the likes of Microsoft and The Game Awards have had to upload separate videos that offer alternative audio tracks. An example of this is the Xbox Series X/S Power Your Dreams launch trailer; while this was as widely available as any other trailer, an unlisted audio-described version was available only through the public video's description, making it harder to find.",
    "Last year, Ubisoft’s North America division became one of the first game companies to use YouTube’s new audio track feature, and teamed up with audio description company Descriptive Video Works. The collaboration saw the story trailer for Assassin’s Creed Valhalla, which you can see below, include an audio-described track that was made available directly within the video using this new feature.",
    "“We [Ubisoft] had been in talks with YouTube around potential solutions to our goal of maximizing viewership of our assets where we have localized versions with language variations.” Brittney Reignier, Associate Director of Content Marketing at Ubisoft, tells TechRadar. The company had been aware of YouTube’s audio track feature, which has been in development since 2019, and Ubisoft was ready to make use of it when it entered beta testing.",
    "The timing of the beta launch worked perfectly for the studio. In 2020, Ubisoft detailed how it was making accessibility “a part of the company’s DNA”, starting with initiatives to improve access for visually impaired gamers.",
    "“We had worked with Descriptive Video Works on several audio description trailers, starting with Assassin’s Creed Valhalla’s cinematic premiere in April 2020,” Reignier tells us – you can see the video below. However, the company wasn’t able to make use of the new audio track feature until it entered beta in September, when it was used for the Assassin’s Creed Valhalla’s story trailer.",
    "Explaining the benefits of being able to use the feature, Reignier says: “We always want to find a way to bring accessibility to the forefront of our consumer experience, so the addition of YouTube’s audio track feature provided a more seamless opportunity to do so.",
    "“Instead of posting the original trailer separate from an audio-described version, we can now post one trailer, and the user can select which version best suits their needs.”",
    "She adds that “having one trailer allows us to maximize performance and also ensure better discoverability for all players”. And the response from players has been encouraging, with Ubisoft seeing “positive feedback from our users that they appreciate the use of the audio track”.",
    "With both the audio track feature and Ubisoft’s collaboration with Descriptive Video Works being so fresh, the feature is only available on major trailers right now, with Reignier saying Ubisoft is “focused on including more players in our big moments”.",
    "“While I can’t speak to our future trailers, improving accessibility is a commitment for Ubisoft and we’d like to help make audio description an industry standard moving forward,” she adds.",
    "Having spoken to Descriptive Video Works for a separate TechRadar interview, it appears that Descriptive Video Works may be experimenting with in-game features with other studios, although details haven’t been shared.",
    "Many companies are similar to Ubisoft in that they have different YouTube channels for different regions. But in this case, Ubisoft North America seems to be the only Ubisoft channel offering more captions and audio description, while the company’s other channels continue to have accessibility issues. While it’s understandable that Ubisoft can only offer audio description for a handful of videos right now, it should still be aiming to be consistent across its other channels.",
    "Hopefully, the audio track feature will become more widely available and not abandoned. After speaking to a representative at Google, we were told that the company is experimenting with enabling multi-track audio by only allowing a small group of creators access. Google will then decide whether it’s going to roll the feature out more widely, depending on user and creator feedback. If it does get a wider rollout, it will allow more channels the option to offer not just audio description for accessibility, but also localized audio tracks.",
    "Additionally, the extra time and resources needed to produce audio description tracks might deter many channels from using the feature extensively, and we’d like to see YouTube take into account the demands on developers before making a decision on whether to fully roll out the feature – so far it feels as if YouTube and Google have done little in the way of marketing to bring the audio track feature to the attention of potential users.",
    "And currently, while all videos that have full captions uploaded have a ‘Subtitles’ tag under the thumbnail, videos with audio tracks aren’t specified. If and when the feature is rolled out more widely, hopefully we’ll see an audio track icon, showing the AD logo and offering the option to toggle an audio description track on.",
    "For now, it’s a fantastic feature that will potentially bring huge benefits for blind and visually impaired users – and Ubisoft North America has demonstrated that it can be made to work. But it relies heavily on the creator to provide the track, as audio description can’t be auto-generated. And that’s what gives us cause for concern – the prospect that studios won’t take the time to create that accessible experience.",
    "But it’s a step in the right direction, and we hope to see more gaming and technology companies increasing their efforts to make games accessible to a wider audience.",
    "This article has been updated for clarity."
  ],
  "headers": {
    "7": "A new audio option",
    "10": "Ubisoft was ready for the new feature",
    "19": "A future rollout"
  },
  "links": {
    "Power Your Dreams launch trailer": "https://www.youtube.com/watch?v=DIMAujZpry0&t=2s",
    "audio-described version": "https://youtu.be/VuXMDwPkpWs",
    "Ubisoft’s North America": "https://www.youtube.com/channel/UCBMvc6jvuTxH6TNo9ThpYjg",
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Ubisoft detailed": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-9316621718140461000&sharedId=trd-us&u=https%3A%2F%2Fnews.ubisoft.com%2Fen-us%2Farticle%2F4hE1D1MBWWssYuY7LaMmaS%2Flearning-to-design-games-for-blind-players",
    "Assassin’s Creed Valhalla’s cinematic premiere": "https://www.youtube.com/watch?v=WWDxCQwqMao",
    "Assassin’s Creed Valhalla’s story trailer": "https://www.youtube.com/watch?v=WaOKSUlf4TM"
  }
}