{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-vs-samsung-galaxy-s21-ultra",
  "title": "Samsung Galaxy Z Fold 3 vs Samsung Galaxy S21 Ultra: stick or fold?",
  "category": "phones",
  "updated": "2021-12-05T23:58:45Z",
  "author": "jon-mundy",
  "summary": "The smartphone perfected meets the smartphone evolved",
  "article": [
    "Samsung currently has two premium flagship phones on its roster, both offering cutting-edge features for a four-figure price. So which is better – the Samsung Galaxy Z Fold 3 or the Samsung Galaxy S21 Ultra?",
    "For arguably the first time, Samsung is offering genuine differentiation between its two flagship options. That’s quite exciting.",
    "Really, this is a clash of approaches. The Samsung Galaxy S21 Ultra represents the pinnacle of established smartphone design, while the Samsung Galaxy Z Fold 3 is an impressive glimpse at where the smartphone might go next.",
    "So, which is the better buy?",
    "The Samsung Galaxy Z Fold 3 landed on August 27, 2021 in the US and UK, while Australia will see it appear on September 10. Prices start at $1,799 / £1,599 / AU$2,499 for the 256GB model, while $1,899 / £1,699 / AU$2,649 gets you 512GB of storage.",
    "The Samsung Galaxy S21 Ultra hit shops on January 29, 2021. Prices start at $1,199 / £1,149 / AU$1,849 for the 128GB model. The 256GB model costs $200 / £200 / AU$300 more, and the 512GB model bumps that price up by the same amount.",
    "This is one of the very rare comparison cases where the Galaxy S21 Ultra comes in cheaper of the two – and by several hundred dollars / pounds at that.",
    "Samsung’s Galaxy S21 Ultra is a decidedly traditional smartphone, albeit a particularly handsome one, with a stealthy matte finish and a distinctive swooping camera module. The Galaxy Z Fold 3, on the other hand, is a third-generation device, yet it still looks and handles like few other phones on the market.",
    "The Galaxy S21 Ultra is a large smartphone at 165.1 x 75.6 x 8.9mm, and heavy too at 229g for the mmWave model and 227g for the Sub6 model. Neither is as heavy as the Galaxy Z Fold 3, mind, which weighs in at a formidable 271g.",
    "The Galaxy Z Fold 3 is a much squarer 158.2 x 128.1mm device, and it’s also more slender at 6.4mm. Those proportions speak to the Galaxy Z Fold 3’s core feature – the ability to fold out from a more normally proportioned (albeit thicker) smartphone into a mini-tablet form factor.",
    "This is a much tougher, tighter design than previous Fold devices, offering a solid hinge mechanism and an IPX8 rating. The latter provides the first case of water-resistance in a foldable, although you still don’t get proper dust-resistance.",
    "The Galaxy S21 Ultra doesn’t have any such problems with moving parts, boasting a full IP68 rating. It’s an altogether tougher, more road-tested design.",
    "Both phones use premium materials, with Gorilla Glass Victus on the front and back and aluminum frames. The Galaxy Z Fold 3 spoils the premium feel ever so slightly with a plastic display cover, however.",
    "Hand in hand with those contrasting designs come contrasting displays.",
    "The Samsung Galaxy S21 Ultra screen is just about the best in the business. It’s one of the biggest at 6.8 inches, one of the brightest at 1500 nits, it has one of the sharpest 1440 x 3200 (aka QHD) resolutions, and it can refresh at 120Hz.",
    "But the Samsung Galaxy Z Fold 3 is a different kettle of fish altogether. For one thing, it packs two displays – and the main one is something special.",
    "Once unfurled, you get a 7.6-inch Foldable Dynamic AMOLED 2X display with a 1768 x 2208 resolution. That’s much less pixel-packed than the Galaxy S21 Ultra equivalent, but it’s also way bigger. You get the same 120Hz refresh rate, too.",
    "Together with a 24.5:9 aspect ratio, the Galaxy Z Fold 3 has become our go-to device for reading ebooks and surfing the web on a phone, while it also makes spreadsheet work feasible. It presents a far better experience for gaming, too, as your fingers don’t cover so much of the screen.",
    "The only downside is the crease down its middle, although an in-display selfie camera means that it doesn’t have the invasive hole-punch notch of the Galaxy S21 Ultra.",
    "When the Fold 3 is closed, you have a 6.2-inch AMOLED Cover Display to call upon. It’s a fine display in its own right, with a 832 x 2268 resolution and a 120Hz refresh rate of its own.",
    "The Galaxy Z Fold 3 and the Galaxy S21 Ultra are generally either closely matched or sufficiently different to make a comparison tricky.",
    "However, when it comes to the cameras, there’s a very clear winner. The Galaxy S21 Ultra blows its foldable sibling out of the water.",
    "It isn’t that the Galaxy Z Fold 3’s triple 12-megapixel camera system is poor. It just doesn’t belong in the top tier, which you might well expect given the device’s price.",
    "Its 1/1.76in 12-megapixel-wide sensor looks especially puny next to the Samsung Galaxy S21 Ultra’s huge 1/1.33in 108-megapixel equivalent. We undertook a direct comparison as part of our review – and, sure enough, the S21 Ultra main camera captured greater detail.",
    "Another unflattering comparison point is the two telephoto provisions. With the Galaxy Z Fold 3, you get a 12-megapixel f/2.4 sensor capable of a 2X zoom. The Galaxy S21 Ultra offers two 10-megapixel telephoto sensors covering 3X and 10X optical zoom ranges.",
    "The Fold 3’s camera system does at least tip its hat at progress with that under-display selfie camera. But while it looks cool, the image quality from this humble 4-megapixel sensor simply isn’t up to scratch. The 10-megapixel selfie camera on the Cover Display (yes, there are two) is much better, but the Galaxy S21 Ultra’s single 40-megapixel selfie camera trumps both.",
    "Both phones come packing Snapdragon 888 SoCs with 12GB of RAM. Or, at least, they do if you buy both in the US or China.",
    "While the Galaxy Z Fold 3 comes with Qualcomm’s flagship chip wherever in the world you buy it, the global Galaxy S21 Ultra ships with Samsung’s Exynos 2100 equivalent.",
    "We say ‘equivalent’, but the Exynos is inferior to the Snapdragon 888 in most ways. It isn’t a massive difference, and in practice both chips are plenty speedy. But it rather sticks in the craw that Samsung is still offering a vast chunk of its global audience a slightly lesser experience to the rest.",
    "In both instances you get a healthy 256GB of internal storage as standard, with 512GB options for both. There’s no microSD card support with either phone.",
    "Both phones feature S Pen compatibility of sorts, although the Galaxy S21 Ultra’s implementation is much more wide-ranging. While any S Pen will work with the more traditional phone, you have to buy one of two specific styluses for the Galaxy Z Fold 3, owing to its softer display.",
    "With that said, both the S Pen Fold Edition and the larger S Pen Pro work beautifully here with the larger canvas. Indeed, these S Pens are larger themselves, which makes them more artist- and note-taker-friendly.",
    "The Galaxy Z Fold 3’s battery is pretty small for the size of the phone at 4400mAh. That’s especially noticeable when you consider that the Galaxy S21 Ultra’s is 5000mAh.",
    "True, the Galaxy S21 Ultra has to drive a sharper, brighter display; but the Galaxy Z Fold 3 has to drive that huge 7.6-inch screen.",
    "This drop in battery size takes its toll. If we made use of 5G , plus the camera liberally, we’d generally find ourselves unable to get through a full day of use with the Galaxy Z Fold 3.",
    "The Galaxy S21 Ultra doesn’t have the best stamina we’ve ever seen, but it’s solid. We find that we can generally get through a full day of moderate mixed use.",
    "Neither phone is especially impressive in the recharging department. Both support only up to 25W wired charging, which doesn’t compare well to flagship rivals from Xiaomi, OnePlus and Oppo.",
    "The Galaxy S21 Ultra supports 15W wireless to the Fold 3’s 11W, but neither is what you’d call lightning-fast in this department.",
    "Samsung has come up with a pleasingly diverse dual-flagship offering in 2021, where its Galaxy Note series always used to overlap with, and cannibalize, its Galaxy S21 Ultra.",
    "In terms of choosing one to buy, it really comes down to your priorities and your budget. On the latter point, while both are expensive phones, the Galaxy Z Fold 3 is far more expensive.",
    "If you’re happy with the traditional smartphone form factor, then the Galaxy S21 Ultra beats pretty much any other handset on the market. It’s still the one to surpass, even this far into its life.",
    "It has a flat-out superior camera system to the Galaxy Z Fold 3, as well as superior battery life.",
    "But if you want something fresh, or a display that offers a fresh angle on web and media content, the Galaxy Z Fold 3 is a better bet. Its 7.6-inch screen is genuinely revelatory for a lot of everyday tasks, and its S Pen implementation takes the Note concept to the next level.",
    "You might also want to check out the Samsung Galaxy S21 vs Samsung Galaxy S20 comparison."
  ],
  "headers": {
    "4": "Samsung Galaxy Z Fold 3 vs Samsung Galaxy S21 Ultra price and availability",
    "7": "Design",
    "13": "Display",
    "20": "Camera",
    "26": "Specs and performance",
    "32": "Battery life",
    "38": "Takeaway"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S21 vs Samsung Galaxy S20": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s20"
  }
}