{
  "source": "https://www.techradar.com/news/google-tv-could-join-samsung-tv-plus-and-roku-in-one-important-way",
  "title": "Want more free TV? Google TV could join Roku and Samsung with ad-supported channels",
  "category": "televisions",
  "updated": "2021-09-17T09:01:44Z",
  "author": "henry-st-leger",
  "summary": "Free TV for all!",
  "article": [
    "A medley of free TV channels could be coming to the Google TV operating system, with Google reportedly planning to push free, ad-supported content on its recently-launched platform – in a move that could seriously step up its offering.",
    "The information comes via Protocol – which also first covered the soft launch of Samsung TV Plus on web browsers. Samsung's free TV service has been around for a few years now, ensuring that anyone with a new Samsung TV can watch a selection of online content for free, without having to subscribe to the likes of Netflix or Disney Plus.",
    "It could soon be the same with Google TV. \"Multiple industry insiders\" have confirmed to Protocol that free streaming channels are set to land imminently on Google TV devices like the Google Chromecast, or TVs made by TCL and Sony. The launch could be \"as early as this fall\", though it may be pushed to early 2022 to coincide with the announcement of new TV ranges from Google's partners.",
    "The Roku Channel similarly launched last year, bringing around 10,000 TV episodes and films available to stream on demand. They include home renovation shows, cooking shows, kids TV shows, family programming, true crime, and plenty more besides.",
    "That's the kind of genre content you'll likely to get – no prestige programming here, really, given the licensing costs that would accrue – and free services aren't really a competitor for paid platforms like Netflix. But they do give you something to watch at no cost, other than the minutes spent watching ads between episodes, and we expect it to be a very welcome addition to Google TV.",
    "It's a smart move in a time when people are overloaded with paid subscription services, with the streaming market increasingly splintered in multiple competitors – the likes of Peacock, Paramount Plus and Disney Plus ensuring that the Netflix / Amazon duopoly isn't quite as strong as it used to be.",
    "Free TV isn't a new idea, of course – but it's gained a new significance in an age of internet-connected TVs that assume individual paid subscriptions by default. Many Hisense TVs push the Netflix app as the first icon you see, while the likes of Amazon Prime Video and Disney Plus are usually 'suggested' in other smart TV platforms.",
    "Offering TV buyers a way to immediately start watching, without having to pick and choose a streaming service right away – especially if they've just spent their leftover cash on a pricey television – can only be a good thing.",
    "Some players are still yet to get on board fully with the free TV train. In the UK, Hisense's Vidaa U platform comes with a 'Vidaa Free' section for – you guessed it – free videos, though it's limited to pulling content straight from YouTube. We assume there's a long-term play here, but it means looking for free TV on the platform is a pretty dispiriting experience for now.",
    "We'd expect Google to do something better for its entry into free TV, which could also help to differentiate it further from the Android TV platform it stems from, and make it even more tantalising to TV makers as a third-party platform to use in their screens."
  ],
  "headers": {
    "5": "Get on board"
  },
  "links": {
    "Protocol": "https://www.protocol.com/chromecast-google-tv-fast-channels#toggle-gdpr",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Netflix or Disney Plus": "https://www.techradar.com/news/disney-plus-vs-netflix-who-will-win",
    "kids TV shows": "https://www.techradar.com/best/kids-shows-on-tv",
    "Hisense TVs": "https://www.techradar.com/news/should-i-buy-a-hisense-television",
    "though it's limited to pulling content straight from YouTub": "https://www.techradar.com/news/hisenses-free-tv-streaming-service-is-just-youtube-in-a-trench-coat",
    "Android TV": "https://www.techradar.com/news/android-tv"
  }
}