{
  "source": "https://www.techradar.com/news/windows-11s-new-look-will-evolve-over-time",
  "title": "Windows 11's new look will evolve over time",
  "category": "computing",
  "updated": "2021-09-30T10:49:39Z",
  "author": "matt-hanson",
  "summary": "New volume controls coming soon...",
  "article": [
    "It looks like Windows 11 is getting a new-look volume control menu, with an initial leak seemingly being confirmed as accurate by a Microsoft employee.",
    "As MSPoweruser reports, earlier this year, a developer found code that pointed to a new volume slider that was buried within an early version of the operating system that’s been sent out to people to test out before Windows 11’s launch on October 5.",
    "Known as ‘Insider builds’, these early versions of Windows 11 can be downloaded and installed by people who want to try them out, helping Microsoft to find bugs or problems before the operating system launches.",
    "So far, those new volume controls haven’t appeared in any insider builds, outside of the code references that were found. In a tweet at the time, the developer compiled the code, and with a bit of tweaking showed off what the new controls could look like.",
    "However, it does seem like the new volume controls will be coming to Windows 11, with Microsoft program manager Brandon LeBlanc seemingly confirming that Microsoft is working on it.",
    "But, when can we expect them? Because they haven’t appeared in any Insider builds, we wouldn’t expect to see them any time soon.",
    "While changing the appearance of volume controls might not seem like a big task, there may be complexities behind the scenes which has meant the new look controls haven’t appeared in early versions of Windows 11 so far.",
    "Another option is that it’s simply not a priority, and there are more important features and changes to implement.",
    "Because of this, however, don’t expect to see the new volume controls in Windows 11 when it launches in a few days.",
    "Instead, they’ll likely arrive in an update later on.",
    "While a new look for volume controls doesn’t sound like a huge change, it goes to show that Microsoft is serious about radically overhauling the entire look of its operating system for Windows 11.",
    "The current volume controls in Windows have been knocking around since Windows 8, so a new look is definitely overdue.",
    "Combine that with new rounded edges, a new taskbar and Start menu, and updates to some of its most iconic apps, and Windows 11 is shaping up to be a release with a distinct look compared to its predecessor, Windows 10.",
    "A new look is only part of what we want from a new operating system however, so hopefully Windows 11 ends up being as revolutionary on the inside as it is on the outside. With its October 5 launch date quickly approaching, we won’t have long to find out."
  ],
  "headers": {
    "4": "When will it be coming?",
    "10": "Analysis: Small changes add up to something more revolutionary"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "MSPoweruser reports": "https://mspoweruser.com/microsoft-confirms-that-they-are-working-on-new-volume-sliders-for-windows-11/",
    "Windows 11’s launch on October 5": "https://www.techradar.com/news/windows-11-finally-has-a-release-date-and-you-can-upgrade-for-free",
    "Windows 8": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-8-1093002/review",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}