{
  "source": "https://www.techradar.com/news/apple-watch-7-release-date-could-be-later-than-youd-expect",
  "title": "Apple Watch 7 release date could be later than you'd expect",
  "category": "wearables",
  "updated": "2021-09-01T08:51:42Z",
  "author": "tom-bedford",
  "summary": "Production problems, apparently",
  "article": [
    "We've been hearing rumors that the Apple Watch 7, as well as the iPhone 13, new iPad (2021) and maybe other gadgets too, could get shown off at a big Apple event on September 14. Even if that turns out to be the case, it might be pretty hard to pick up the smartwatch soon after the event.",
    "According to a report by Bloomberg, Apple is facing difficulties in producing the Watch 7, seemingly due to the differences between it and the Watch 6. As a result, apparently the device release date will either be delayed, or the watch will only go on sale in limited amounts to begin with.",
    "Knowing Apple, the former is more likely: in 2020, it staggered the iPhone 12 series launch which ensured it was easier to buy one of the new devices as soon as they went on sale.",
    "Bloomberg's report adds that the Apple Watch 7 will come in 41mm and 45mm sizes, each 1mm up on the options for older watches. Apparently, while this change is partly to blame for the production woes, it also allows Apple to design some new watch faces with more complications.",
    "Apple hasn't officially confirmed the September 14 event yet - it usually announces these things about a week before they're due to happen - and we only cite it as multiple leakers seem to think it's happening.",
    "Apple could simply hold off announcing the Apple Watch 7 until it's ready. Judging by last year, the format will likely be a pre-recorded live stream event, which doesn't need to be recorded at any set time.",
    "So if Apple is having trouble rustling up enough Apple Watch 7 units to sell after the event - bear in mind, the company usually releases its device on the Friday after the event - there's an easy solution.",
    "Apple could easily delay the event without even needing to tell the public - perhaps it could push it back a week or two, and that'd give it more time to make sure it had the iPhones, iPads and Apple Watches ready in stock.",
    "In 2020 the Apple iPhone event was in October, with the company pushing it back from its expected September date to the spooky month, so there's precedent for it delaying device launches when necessary.",
    "Whenever the Apple event takes place, whether it's September 14 or later down the road, it's sure to be one of the biggest tech events of the year, so keep checking TechRadar on the day for everything you need to know."
  ],
  "headers": {
    "4": "Analysis: is a September 14 launch likely?"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "new iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-31/apple-s-new-watch-will-likely-be-delayed-over-production-snags?sref=51oIW18F",
    "Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "some new watch faces": "https://www.techradar.com/news/apple-watch-7-tipped-to-have-new-watch-faces-to-fit-its-larger-display"
  }
}