{
  "source": "https://www.techradar.com/news/you-can-now-rent-a-pair-of-customizable-true-wireless-earbuds-for-dollar5pound5-per-month",
  "title": "You can now rent a pair of customizable true wireless earbuds for $5/£5 per month",
  "category": "audio-visual",
  "updated": "2021-08-18T19:32:47Z",
  "author": "nick-pino",
  "summary": "Nura will let you rent its earbuds instead of paying $199 / £199 / AU$299",
  "article": [
    "Nura, the makers of the NuraTrue, NuraPhone and NuraLoop wireless earbuds, has a new pair of true wireless earbuds – simply called the NuraBuds – that it’s renting out to folks for a low monthly fee.",
    "In the pricing plan shared with TechRadar, Nura says the NuraBuds are available exclusively with a Nuranow subscription that costs $5 / £5 / AU$7 per month, plus a one-time fee of $19 / £19 / AU$25.",
    "The new NuraBuds are compatible with the company’s proprietary custom audio profiles that alter the earbuds’ sound to match your preferences and come with active noise cancellation. The Buds last for four hours by themselves or 10 hours with the charging case, and are IPX4 water-resistant. Last but not least the Buds support aptX and Bluetooth 5.2.",
    "It’s a pretty solid deal considering that the new NuraTrue earbuds we just reviewed last month come in at $199 / £199 / AU$299 – but there is a catch: According to Nura, you will have to give the earbuds back within 30 days should you decide to cancel the membership.",
    "Like renting an apartment or leasing a car, there are always benefits and drawbacks to renting something short-term instead of buying it outright.",
    "The pros of renting are that you’ll get to try these semi-expensive earbuds for a very reasonable cost – which is great if you’re not sure if you want them.",
    "The drawback here is that, should you decide to keep them for a while – say for two years – you’ll have paid a significant portion of their retail price and still not own them.",
    "To that end, it’s probably better to buy these if you’re absolutely certain that you’ll like them based on our glowing five-star review of the similarly specced NuraTrue earbuds, and maybe better off renting if you’d feel more comfortable just dipping your toes in the water first."
  ],
  "headers": {
    "4": "Analysis: Are you better off buying or renting?"
  },
  "links": {
    "NuraTrue": "https://www.techradar.com/reviews/nuratrue",
    "NuraPhone": "https://www.techradar.com/reviews/nuraphone-headphones",
    "NuraLoop": "https://www.techradar.com/reviews/nuraloop-headphones",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}