{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-3-update-brings-digital-workout-classes-and-more",
  "title": "Samsung Galaxy Watch 3 update brings digital workout classes and more",
  "category": "wearables",
  "updated": "2021-03-30T08:47:26Z",
  "author": "tom-bedford",
  "summary": "Rolling out already",
  "article": [
    "If you own a Samsung Galaxy Watch 3, you're soon going to find a few new features on your smartwatch, because Samsung is rolling out an update that brings a few useful new tools.",
    "It's not quite clear what the rollout plan is with this new smartwatch update, but some carriers are reportedly already pushing out the update, so you'll likely be able to try out these features very soon.",
    "Arguably the biggest feature, that we alluded to in the headline of this article, are new home workout videos. When you boot up the Samsung Health app you can find lots of workout routines in the Fitness section, and as you work out and watch the video, the next piece of the routine will be shown on your smartwatch.",
    "The watch also tracks your exercise, so you can know how useful the home workout was - this feature seems perfect for people who used to do exercise classes in gyms, but currently can't (or don't want to).",
    "Another big feature is improved sleep tracking. The Galaxy Watch 3 already has this feature, but now you'll also get an easy-to-understand 'Sleep Score' figure after every night, so you can see how restful your night was at a glance, and easily compare it to other nights.",
    "How this 'Sleep Score' is calculated isn't exactly clear, but most fitness trackers and smartwatches use such a feature already to make the sleep data accessible, so the feature's presence here is a good thing.",
    "Sleep Score isn't all though - using the Samsung Health app, you can now use the Together function which lets you do joint walks with up to nine other people, presumably so you can remotely hike with your friends. The smartwatch tells you your progress in comparison to the other people.",
    "The Galaxy Watch app store also offers a new hand-washing app as well, so you can make sure you're cleaning your digits for the right amount of time, and also to provide broad overviews of your hand-washing habits.",
    "Finally, there are two mini-updates: the auto-recognition time for workouts has been changed from 10 minutes, to three minutes, and the always-on display no longer shows the second hand, which will likely save battery life.",
    "Via DroidLife"
  ],
  "headers": {
    "4": "Other key features"
  },
  "links": {
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "DroidLife": "https://www.droid-life.com/2021/03/29/galaxy-watch-3-gets-sleep-score-feature-more-samsung-health-changes/"
  }
}