{
  "source": "https://www.techradar.com/news/can-firefoxs-new-look-save-the-web-browser",
  "title": "Can Firefox’s new look save the web browser?",
  "category": "computing",
  "updated": "2021-06-06T16:10:53Z",
  "author": "daryl-baxter",
  "summary": "Enter the Gecko",
  "article": [
    "Firefox released version 89 recently with a new look named Proton. It brings a major change to the user interface in its colors and looks, giving the web browser a more modern feel.",
    "Web browsers look incredibly similar these days, with the tabs on top, a menu accessible to the right, and a bookmarks bar if you so choose. However, Mozilla has been unique in these browser wars, working on improving its own Gecko engine instead of moving to WebKit or Google’s Chromium variant, as Microsoft Edge has.",
    "With the new look now out on all platforms, we spoke to Mozilla about the new release, and if it has any particular hopes for WWDC next week.",
    "Using the new UI it prompted us to ask, why the drive to redesign it now?",
    "“Late 2020, we had a vision of what we wanted Firefox to be. Currently, we're living in a frenetic time where people are dealing with really tough challenges every day. It's hard to solve problems that are popping up everywhere on the Web,” a Mozilla spokesperson tells us over email.",
    "“We believe that the browser should be a piece of software that you can rely on to have your back, whether that's privacy, performance or security, and that it looks amazing and works seamlessly with the Web.”",
    "While the UI is clearly an improvement on what came before, it also prompted the team to work on optimizing the browser overall.",
    "“On June 1, our Firefox release had ground-breaking design work, challenging engineering work and a really great end product,” they tell us. “With this release, we took on a mission to save everyone time. On Firefox, it means making pages load faster, using less memory or simply streamlining the everyday use of the browser.",
    "We believe we have a fresh take on the Internet and the tools we use to harness the Web.”",
    "In every project one makes, there’s always an aspect that you’re proud of, however minor it is. Mozilla agreed.",
    "“The team is most proud of the Streamlined Clutter-Free Menus. We prioritized the content based on what people clicked on when they visited the menu,” we were told.",
    "“We made the labels less cryptic and more cohesive. Also, we removed some elements and refreshed the icons so that it was easier for people to see at a glance where they wanted to go. We worked to deliver an inviting, high quality experience so that people felt calm, no matter where they use Firefox — on a computer, phone or tablet. That meant paring down and streamlining over adding and expanding.”",
    "A new user interface also has to cater for those with accessibility needs, so we asked whether the new Proton appearance made sure to factor this in.",
    "“For this release, we looked at the use of dark themes and colors and overall minimizing visual noise,” Mozilla explained. “This year, we will continue to work with the accessibility community to address their specific needs and incorporate them in future releases.”",
    "It seems as though the company isn't done yet in improving accessibility for Firefox and Proton as a whole.",
    "However, one aspect of the user interface that is already sticking out to many users are the tabs. They look as though they're more suited to touch displays, so we asked Mozilla whether this was deliberate.",
    "“For the tabs, our primary aim was to redesign these tabs so that they floated neatly, and we added the visual indicators, like blocking autoplay videos until you’re ready to visit that tab,” Mozilla says. “More than 50% of people have four tabs or more open. We detached the tab from the browser to make it more inviting for people to move, rearrange and pull out tabs into a new window to suit your flow, and organize them so they’re easier for them to find.”",
    "Of course, we’re on the eve of Apple's WWDC where iOS 15, macOS 12 and many more updates are expected to be announced. I asked Mozilla whether they had any wishes themselves, or even if it’s just being allowed to use the Gecko engine instead of WebKit, which is a requirement for browsers in Apple’s App Store.",
    "“Yes, the most obvious is to be able to leverage GeckoView in our Firefox iOS app. Overall, Apple is a partner and we were very excited to see the new privacy features put in place with iOS 14 and the default browser option. We're hoping for more great news for this upcoming WWDC.”"
  ],
  "headers": {
    "3": "A New Look",
    "12": "Accessibility in Proton",
    "17": "Gecko Engine on iOS 15?"
  },
  "links": {
    "released": "https://www.techradar.com/news/firefox-updates-privacy-protections-in-all-new-browser",
    "web browser": "https://www.techradar.com/best/browser",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "macOS 12": "https://www.techradar.com/news/macos-12"
  }
}