{
  "source": "https://www.techradar.com/news/this-trio-of-fun-schwinn-e-bikes-are-built-for-the-roads-and-the-trails",
  "title": "This trio of fun Schwinn e-bikes are built for the roads and the trails",
  "category": "fitness",
  "updated": "2021-11-25T11:03:24Z",
  "author": "cat-ellis",
  "summary": "Impressive specs for the price, and a great choice of frames",
  "article": [
    "Schwinn, one of the longest-running bike builders in the US, has released a trio of new e-bikes for tackling roads and trails – and they're more affordable than you might expect too. This isn't Schwinn's first foray into battery power, but the new Marshall, Coston CE, and Coston DX sound like an interesting set.",
    "The Schwinn Coston DX is particularly intriguing, and sounds like the best value of the bunch. As the e-bike experts at Electrek explain, it's a practical machine built for city riding, with a weather-resistant design (complete with fenders to keep your clothes dry), a suspension seat post, and a storage saddle for stashing essentials like your keys and wallet.",
    "It has a maximum range of 45 miles under ideal conditions, which is very respectable for a bike priced at $1,999 (about £1,500 / AU$2,800). For comparison, the standard edition WAU Bike (which ranks highly in our guide to the best electric bikes) has a range of 40 miles and will set you back £1,677 (about $2,200 / AU$3,020).",
    "The Schwinn Coston CE is also aimed at commuters, but is a more pared-back affair with a regular saddle and a smaller battery for a maximum range of 35 miles. It does, however, have a front suspension fork, which may make it a better choice if your normal route to work involves its share of potholes. It costs $1,699 (about £1,300 / AU$2,400).",
    "For weekend adventures on the trails, the Schwinn Marshall has fatter tires, integrated lights, and no fenders (to avoid clots of mud getting wedged underneath), It has the same range as the Coston CE, and is the same price as well.",
    "Whichever sounds more appealing, all three come with a choice or step-over or step-through frames, and come in two sizes. Most e-bikes (including our current top-rated model, the Cowboy 4) only come in one size, limiting their accessibility to riders of a certain height, so this inclusivity is good to see.",
    "The new Schwinn bikes all have a top speed of 20mph, and can run with pedal assistance, or entirely from the battery. This makes them road-legal for riding in the US, where they're currently available, but if Schwinn decides to bring them to the EU and UK it'll need to tone down the top speed and remove the throttle so the battery only engages while the pedals are being turned.",
    "There aren't any Black Friday deals on this trio, but you can save 25% off a helmet when you order a bike from Schwinn by entering the code NOGGIN25 at the checkout."
  ],
  "headers": {
    "4": "Off the beaten path"
  },
  "links": {
    "Schwinn Coston DX": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSchwinn-Coston-Electric-Hybrid-Step-Thru%2Fdp%2FB09GPSWXFC%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3396471402659135500-20",
    "Electrek": "https://electrek.co/2021/11/24/schwinn-launches-new-electric-bikes-for-the-city-and-trails-that-rock-cool-frame-lights/",
    "WAU Bike": "https://www.techradar.com/reviews/wau-x",
    "best electric bikes": "https://www.techradar.com/best/electric-bike",
    "Schwinn Coston CE": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSchwinn-Coston-Electric-Hybrid-Step-Thru%2Fdp%2FB09GPTJFY3%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5503515283856759000-20",
    "Schwinn Marshall": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSchwinn-Marshall-Electric-Step-Thru-27-5-Inch%2Fdp%2FB09GPTVRQD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8609959060866639000-20",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "order a bike from Schwinn": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7170591574931899000&xs=1&url=https%3A%2F%2Fwww.schwinnbikes.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-trio-of-fun-schwinn-e-bikes-are-built-for-the-roads-and-the-trails"
  }
}