{
  "source": "https://www.techradar.com/news/the-oneplus-9-is-just-dollar649-at-amazon-with-its-first-ever-price-cut",
  "title": "The OnePlus 9 is just $649 at Amazon with its first-ever price cut",
  "category": "phones",
  "updated": "2021-07-08T15:00:30Z",
  "author": "alex-whitelock",
  "summary": "A fantastic choice for a 5G Android flagship",
  "article": [
    "If you've been holding out on OnePlus 9 deals since the devices launch back in April then we've got news - it's now on sale for just $649.99 unlocked at Amazon.",
    "That's a whole $80 off the launch price and the first price cut we've seen so far on this great 5G Android flagship. Previously, OnePlus 9 deals have only offered free complimentary earbuds and trade-in rebates so this is the first good opportunity to save some cash upfront on this device.",
    "This latest price cut also makes the OnePlus 9 cheaper than its main rival - Galaxy S21 (also on sale at Amazon for $699). Out of the two, the OnePlus 9 is the newer device but both are similar sizes (6.55\" on the 9, 6.2\" on the S21), feature a Snapdragon 888 processor, 8GB of RAM, and 128GB of internal storage. Put simply, they're both great choices for a 5G Android flagship, although the OnePlus 9 does have a slight edge in regards to battery capacity and charge speed if that's important to you. Both have outstanding cameras too, with the OnePlus 9's Hasselblad co-designed lens' being a marked improvement over the brand's previous offerings.",
    "So, this is definitely a great deal for those out there for those Android fans looking for score a cheap(er) unlocked device for pairing with any number of prepaid phone plans. Visiting from outside the US? We've got the best deals on unlocked cell phones in your region just below.",
    "Looking for something a little different? See this week's best cell phone deals for a run-down of the cheapest Android and iPhone devices on the market. Alternatively, see what other retailers are offering with this week's best OnePlus 9 deals."
  ],
  "headers": {
    "4": "OnePlus 9 deals at Amazon"
  },
  "links": {
    "for just $649.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FOnePlus-Unlocked-Smartphone-Hasselblad-Wireless%2Fdp%2FB08Y73NTXY%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1123047947084870800-20",
    "for $699": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSamsung-Electronics-Smartphone-Pro-Grade-SM-G991UZAAXAA%2Fdp%2FB08N2FRMPN%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1217151286322232300-20",
    "prepaid phone plans": "https://www.techradar.com/deals/best-prepaid-plans",
    "best cell phone deals": "https://www.techradar.com/deals/mobile-phone-deals",
    "best OnePlus 9 deals": "https://www.techradar.com/deals/best-oneplus-9-deals"
  }
}