{
  "source": "https://www.techradar.com/news/apple-vr-headset-report-offers-a-potential-release-date-and-pricing",
  "title": "Apple VR headset report offers a potential release date and pricing",
  "category": "wearables",
  "updated": "2021-03-08T10:38:39Z",
  "author": "gerald-lynch",
  "summary": "Apple's virtual reality specs come into focus",
  "article": [
    "It's long been rumored, but could we finally be seeing the Apple VR headset sooner rather than later? That's what's being suggested by noted Apple analyst Ming-Chi Kuo.",
    "The supply chain expert states in a research note that Apple is looking at launch for the wearable in the middle of 2022, with the complexity of the product pointing to a price tag upwards of $1,000 – that's around £720 or AU$1,300, although as that dollar price is only a rumor those conversions could be way off.",
    "According to Kuo, the headset will offer augmented reality experiences along with VR option, with the \"video see-through AR experience\" and virtual reality content will be provided by a micro LED display. In fact, AR and mixed reality content is now being thought to be the focus of the product.",
    "Much like the Oculus Quest 2, Apple's headset is said to be a standalone device that doesn't need to be tethered to a computer or mobile in order to work.",
    "Apple looks to be pushing comfort to the fore here. According to the report, existing prototypes are already lightweight at a mere 200-300 grams, but the company is looking to reduce that further to between 100 and 200 grams for the commercial release.",
    "Kuo states that the Apple VR headset will offer a \"very smooth display\" that will \"significantly surpass existing VR products\" – a bold claim, given the fast-rising quality of standalone VR headsets today. Entertainment won't be overlooked either, with Apple TV+ and Apple Arcade content said to feature strongly.",
    "This won't be the only head-mounted wearable Apple has waiting in the wings. The company is said to be eventually planning a pair of AR/VR glasses for 2025 and truly sci-fi sounding contact lenses with similar functionality in the next decade."
  ],
  "headers": {
    "3": "Pushing things forward"
  },
  "links": {
    "Apple VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "in a research note": "https://www.macrumors.com/2021/03/07/kuo-apple-mixed-reality-headset-2022/",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Apple TV+": "https://www.techradar.com/reviews/apple-tv-plus",
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it"
  }
}