{
  "source": "https://www.techradar.com/news/how-to-watch-impeachment-american-crime-story-online-where-you-are",
  "title": "How to watch Impeachment: American Crime Story online where you are",
  "category": "computing",
  "updated": "2021-10-14T10:51:34Z",
  "author": "alice-marshall",
  "summary": "True crime miniseries follows Clinton-Lewinsky affair",
  "article": [
    "Adapting the Clinton-Lewinsky scandal for the small screen, Impeachment: American Crime Story is the third season of the true crime anthology series to dramatize a historical event of modern times. Taking place across the 80s to the late 90s, the miniseries follows the timeline that lead the 42nd President of the United States to face possible impeachment. This follows his affair with White House intern, Monica Lewinsky. Promising a gripping drama that follows in the footsteps of its award-winning predecessors, here's how to watch Impeachment: American Crime Story online.",
    "Monica Lewinsky (portrayed by Beanie Feldstein) was an intern at the White House during Bill Clinton's presidency. In 1995 she entered into an affair with the President, with news breaking of the scandal in January 1998.",
    "Starring Clive Owens as Bill Clinton, Impeachment: American Crime Story chronicles the fallout as Lewinsky confides in Linda Tripp (Sarah Poulson) about her relationship with the President, and the perjury charges and impeachment of December 1998 which ensued.",
    "Lewinsky herself co-produced Impeachment: American Crime Story, setting out to give a voice to the intern who found herself wrapped up in a love affair with Clinton, and her subsequent vilification in the press.",
    "On having Lewinsky aboard, executive producer Sarah Burges said, \"The understanding that a real human arrived in Washington [...] all of that was always very important to me to bring forward, and I think to Monica as well.\"",
    "Following in the footsteps of prior season's success, this promises captivating viewing. Make sure you know how to watch Impeachment: American Crime Story online from anywhere.",
    "If you’re abroad when Impeachment: American Crime Story airs, you’ll be unable to watch the show on your usual streaming platform, thanks to annoying regional restrictions.",
    "Luckily, there’s an easy solution. Downloading a VPN will allow you to stream the new season online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch American Crime Story from anywhere"
  ],
  "headers": {
    "6": "How to watch Impeachment: American Crime Story online from outside your country",
    "9": "How to watch Impeachment: American Crime Story online in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}