{
  "source": "https://www.techradar.com/news/well-im-bored-of-pubg-new-state-already",
  "title": "Well, I'm bored of PUBG: New State already",
  "category": "phones",
  "updated": "2021-11-11T14:07:20Z",
  "author": "tom-bedford",
  "summary": "Opinion: It's just PUBG Mobile reskinned",
  "article": [
    "I've just played three matches of PUBG: New State, and I've decided that's all I'll really ever need to play from the game.",
    "PUBG: New State is the newest game from Krafton, the publishers of PUBG, and it's a mobile-only game that's just been released on Android and iOS. It's basically a successor to PUBG Mobile.",
    "And that's really the problem. PUBG: New State isn't a different game from PUBG Mobile; it feels like a reskinned clone, and I can't motivate myself to jump into game four.",
    "I've probably played PUBG Mobile too much. It's not my favorite game of all time, even on mobile, but it's a great game for testing smartphones - since my job is to review mobiles, it's a pretty handy tool.",
    "PUBG Mobile has loads of graphics and framerate settings, and therefore it's a handy way of differentiating between top-end gaming mobiles and the hordes of mid-range devices.",
    "If I play two or so hours of the game for every smartphone I test - and sometimes I do more - that's a long time in the game in total. So it's fair to say I'm well versed in PUBG Mobile.",
    "I played a few more hours of PUBG Mobile earlier today; except instead of using the PUBG Mobile app, I was using one called 'PUBG: New State'.",
    "That is to say, PUBG: New State feels far too similar to Mobile to justify itself as a new game. The mechanics are identical, the weapons are mostly the same, controls work similarly, the list goes on. Playing New State doesn't feel any different to Mobile.",
    "Sure, there's a 'futurist' style aesthetic that influences the architecture of buildings in the game, and a few other aspects like the use of drones and a bus, but that doesn't make the game feel 'new'. After all, PUBG: Mobile often rolled out alternative designs and map tweaks - in fact, New State's bus was added to Mobile a while back - so the new game feels like it literally could just be a new season of Mobile.",
    "My enjoyment of the game isn't exactly improved by the janky experience I had playing the thing.",
    "Motion feels a little swifter than in mobile, but oftentimes that makes you feel like you're dashing over an ice rink instead of running on real ground. Looking around was similar, and I had to tweak the sensitivity quite a bit through a match to get to grips with it.",
    "Talking of controls, the heads-up display (HUD) was absolutely littered with different icons, and most of them were tiny too. In the settings menu you can change the size, but you have to adjust every single icon individually, which was such a time-consuming process that I gave up.",
    "The graphics don't look amazing, even with the settings turned up to max when playing on a top-end phone - but PUBG Mobile wasn't exactly a looker either, so I can forgive this.",
    "I also found a few bugs, like when I shot at someone for a while without doing any damage to them - they didn't seem to notice me so I just kept firing, making the lack of damage noticeable. I then got bored, ran away and a different person killed me by firing through a wall. Fun.",
    "So it's fair to say the game isn't in a fantastic state - hopefully things like this can be fixed over time though.",
    "I think Call of Duty: Mobile has ruined me. Its control system, of the same button letting you aim and fire if you hold it, is such a great system for mobile first-person shooters that it makes every other system feel redundant.",
    "The game's battle royale mode also has much better ways of navigating the map, and is littered with equipment, so the 'explore' and 'battle' parts of the gameplay loop aren't so drawn out, as they are in PUBG Mobile.",
    "Participating in a firefight in New State feels more like a battle against the controls than the other players - particularly if they're shooting me through walls and I'm struggling to press the 'fire' button without accidentally clicking 5 other icons.",
    "PUBG Mobile came out in 2018, so New State is using a three-year-old control scheme that's far inferior to what's being used by CoD:M. And it tells. It's just not fun.",
    "If I'm in the mood for battling online strangers in a first- or third-person shooter game then, I'm going to stick with Call of Duty, as I'm tiring of PUBG Mobile, and New State is more of the same."
  ],
  "headers": {
    "3": "Winner winner, chicken... loser?",
    "9": "New State, bad state",
    "15": "More games on the market"
  },
  "links": {
    "PUBG: New State": "https://www.techradar.com/news/pubg-mobile-new-state-release-date-price-trailer-and-everything-we-know-so-far"
  }
}