{
  "source": "https://www.techradar.com/news/gamescom-2021-is-going-ahead-as-a-hybrid-event-heres-how",
  "title": "Gamescom 2021 is going ahead as a 'hybrid' event – here's how",
  "category": "gaming",
  "updated": "2021-03-18T15:00:20Z",
  "author": "vic-hood",
  "summary": "Gamescom will take place as both a physical and virtual event",
  "article": [
    "Gamescom 2021 is going ahead and is set to be a \"hybrid\" event, taking place both \"on-site in Cologne and online around the world\" from August 25 to August 29, 2021.",
    "According to a press release sent to TechRadar by organizer Verband der deutschen Games-Branche, this year's Gamescom will offer \"a combination of business platform for the industry, a unique hands-on experience for fans, and a comprehensive safety concept\".",
    "The press release doesn't go into huge detail about which exact elements of the show will be on-site and which will be online, but it does look like the show will run over both – potentially offering the same experiences for attendees whether its online or in-person – similarly to how the show took place last year.",
    "According to the release, which includes a \"hybrid concept of Gamescom 2021\", there are plans in place for the show to take place as a physical event while adhering to Covid-19 restrictions. Some of these plans include an entertainment area specifically designed for a reduced amount of visitors on-site. This entertainment area will focus \"on the testing of new games live on-site\" and will also include a digital queue-management system. There are also plans for an \"event arena\" that will offer space for eSport and cosplay competitions.",
    "The concept also confirms there are plans for announcement shows like Opening Night Live, a showcase presented by Geoff Keighley, and Gamescom Studio to return this year.",
    "In addition, the conference's business area is due to be expanded to allow for \"optimal networking conditions\", while a \"first ever online B2B platform\" called Gamescom biz is due to roll out to allow for online networking.",
    "\"With our #B-SAFE4business safety concept and the optimized visitor numbers we ensure the required safety on the fair grounds, even in times of COVID-19,\" the press release states.",
    "Gamescom is one of the only gaming conferences going ahead in any sort of physical capacity this year, with the likes of E3 being canceled for another year.",
    "According to the press release, tickets for Gamescom 2021 will go on sale in \"Early Summer 2021\", so we're expecting them to go on sale between May and June. While prices are TBC, you will be able to buy these tickets from the Gamescom Ticket Shop, though it seems (somehow) that super fans will be prioritized.",
    "\"In late summer, we are striving to make an on-site Gamescom event possible for the gaming fans again at last,\" Felix Falk, Managing Director of game – the Association of the German Games Industry and co-organiser of Gamescom stated. \"We will hereby be placing a focus on the superfans and the on-site testing of the latest games this year.",
    "\"At the same time, Gamescom 2021 will once again reach millions of people worldwide as a result of the further developed digital offers. The results of the community surveys confirm this concept, which we have developed in close cooperation with many of the most important exhibitors. Without doubt, the preparations for all people involved will be much more demanding than usual in the light of this special situation. But the enthusiasm of the gaming community definitely makes these efforts worthwhile.\""
  ],
  "headers": {
    "7": "How to get tickets"
  },
  "links": {
    "press release": "https://static-koelnmesse.s3.eu-central-1.amazonaws.com/cloudfront/gamescom/redaktionell/gamescom/downloads/pdf/press/pm_hybrid-gamescom-2021.pdf",
    "#B-SAFE4business": "https://newsletter.koelnmesse.com/-link2/3681/2524/38/230/56940/Mw80tbjS/jMTTQrdf3x/0",
    "E3 being canceled": "https://www.techradar.com/news/e3-2020-has-been-cancelled"
  }
}