{
  "source": "https://www.techradar.com/news/loki-on-disney-plus-will-tie-into-multiple-mcu-projects-after-all",
  "title": "Loki on Disney Plus will tie into multiple MCU projects after all",
  "category": "entertainment",
  "updated": "2021-06-04T09:11:07Z",
  "author": "tom-power",
  "summary": "Marvel's Loki may even affect Disney Plus series like Ms. Marvel",
  "article": [
    "Loki's Disney Plus series is less than a week away from being released – and it appears that the upcoming Marvel show will impact other MCU projects after all.",
    "That's according to Ant-Man 3 writer Jeff Loveness, who recently told Vanity Fair that Loki's TV series will impact events in Doctor Strange 2, the third Ant-Man movie and maybe another Disney Plus Marvel show in Ms. Marvel.",
    "Loveness was interviewed as part of a Vanity Fair profile piece on Loki head writer Michael Waldron (who also rewrote the script for Doctor Strange 2). Asked whether some of Marvel's Phase 4 projects would be linked by a common thread, Loveness confirmed as much – even if his response was slightly tongue-in-cheek by its end.",
    "“It’s like swimming in the ocean over there [at Marvel],\" he says. \"There’s always going to be 10 movies that yours ties into. They’re going to change Doctor Strange so that it will affect Ant-Man and that’ll affect season eight of The Mandalorian.”",
    "Waldron backed up Loveness' comments when he was asked a similar question, revealing that he and Loveness had held talks about how they would tie their various MCU productions together.",
    "“Jeff’s dealing with the Quantum Realm and I was dealing with time travel and the multiverse,\" Waldron states. \"Our conversations are probably illegal to have, digitally. We have to meet on a bridge somewhere.”",
    "Waldron's and Loveness' comments come a few weeks after Marvel Studios President Kevin Feige seemed to pour cold water on the prospect of Loki tying into other MCU productions.",
    "In a 2019 Bloomberg interview, Feige confirmed that events in Loki's series would directly impact Doctor Strange in the Multiverse of Madness. However, in a May 2021 EW profile piece on Loki star Tom Hiddleston, Feige declined to comment on whether they tied together at all.",
    "Since Feige's Bloomberg interview, though, Doctor Strange 2's creative team has changed. Original director and co-writer Scott Derrickson departed the project over creative differences, and was replaced by Waldron and Sam Raimi.",
    "Given those events, Doctor Strange 2's plot will have changed in the meantime, so the Marvel movie may not be as intrinsically linked to Loki as Feige initially said it would.",
    "That said, Feige didn't deny that the two projects aren't tied together. With Waldron and Loveness reaffirming Feige's 2019 comments, though, it seems that they will – and that other Phase 4 movies and TV shows will be impacted, too.",
    "For one, Ms. Marvel head writer Bisha Ali is also a writer on Loki, so it's possible that Kamal Khan's Disney Plus show will heavily tie into the events of Loki as well.",
    "One final, interesting point to note is that Waldron and Loveness have dealt with time travel and multiverse storylines before.",
    "Both have writing credits on Rick and Morty, the popular Adult Swim animated series, so the duo are well versed in producing convoluted-but-funny sci-fi plots. That experience will certainly help with Loki and Doctor Strange 2's scripts and overarching storylines. As a result, it'll be fascinating to see how these two productions, in particular, tie together.",
    "Loki arrives exclusively on Disney Plus on Wednesday, June 9."
  ],
  "headers": {
    "6": "Analysis: Loki sounds like it'll be the jumping off point for Marvel's Phase 4 plans"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Vanity Fair": "https://www.vanityfair.com/hollywood/2021/06/loki-michael-waldron-doctor-strange-star-wars-rick-and-morty",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "2019 Bloomberg interview": "https://www.bloomberg.com/news/features/2019-11-07/inside-disney-bob-iger-on-star-wars-pixar-and-more",
    "May 2021 EW profile piece": "https://ew.com/tv/tom-hiddleston-loki-digital-cover/"
  }
}