{
  "source": "https://www.techradar.com/news/5-things-stadia-got-wrong-and-5-ways-to-fix-it",
  "title": "5 things Stadia got wrong, and 5 ways to fix it",
  "category": "gaming",
  "updated": "2021-02-04T16:57:21Z",
  "author": "hamish-hector",
  "summary": "Make the crowd go wild",
  "article": [
    "This week, Google announced the closure of its internal games studios, leading to job losses and the cancellation of any in-house development of exclusive titles for Stadia.",
    "The writing seems to be on the wall for the game streaming service that looks set to go the way of Google Glass and Project Ara. Google is currently trying to convince fans that this is not the case, saying they’re “committed to the future of cloud gaming.”",
    "But such a major strategy shift suggests all is not well for Google's original vision of the service. If it really is intending to keep the Google Stadia flame burning brightly, here are the top 5 issues Stadia needs to address if Google is to keep its latest promises.",
    "We certainly aren’t the first people to point this out and we won’t be the last, but Stadia Pro just isn't up to scratch. The Pro tier drags the whole platform down with it; locking the best graphical options behind a paywall was a huge blunder and if you compare Stadia Pro to similar offerings like Xbox Game Pass Ultimate it’s easy to feel like you're being short-changed.",
    "If Stadia wants to be more positively received, it should scrap the quality paywall altogether, make 4K gaming free for every user with a sufficient internet connection and, while reducing the Pro fee and giving away a free game per month, in the same way Xbox Live Gold and PS Plus does. Google must make sure some big hits are included every so often. A free copy of Assassin’s Creed Valhalla or Cyberpunk 2077 would have been a massive incentive to try out the platform, and perhaps grab another game while you’re there.",
    "Sure, this might be an expensive move, but Google needs some big pushes if they want Stadia to feel attractive.",
    "Talking of games, Stadia’s library was abysmal at launch and frankly, it still is not great. At first, Stadia’s Digital Store felt like a time capsule containing a hodgepodge collection of games from the last decade, few of which felt relevant to gamers in the current year. Since then, some improvements have been made (it's still one of the best ways to play Cyberpunk 2077) but once you strip away the different editions of titles, the store can begin to feel bare.",
    "Rather than investing money into their own studios only to collapse them less than two years later, Google instead should have funnelled their funds into popular Indie titles for a port and have them available for launch. The platform would see some of these kinds of titles appear eventually, like the critically acclaimed Celeste, but it felt too little too late. Stadia needs to double down on efforts to grow its library with third-party hits, and give its users something to play if it wants them to stay.",
    "The next obvious conclusion is that Stadia should have been delayed. A lack of games was for sure a problem, but a lack of over-promised features doubled down on the half-baked impression Google Stadia gave off to fans at launch. The service felt like a Beta, with promised features taking months to be added post launch, yet fans were expected to drop considerable cash to play when it released.",
    "To win back goodwill, Google Stadia needs to find a way to reimburse its early adopters and make them proud to have helped the service start out. And I don’t just mean some nifty badge icon – give them a worthwhile prize. Be this a free game, hefty money off voucher, or something else equally grand. It just has to be something to reduce the regret that some early adopters will likely be feeling after getting burned by a service they wanted to support.",
    "Thankfully this problem has since been fixed thanks to Stadia now offering support outside of just Pixel phones, but that early decision was another problem at launch. Pixel phones weren't popular enough, nor Stadia exceptional enough, for either one to provide a sufficient sales boost to the other. All Google succeeded in doing was unnecessarily delaying the service to fans and confusing the message about which platforms you could enjoy their service on.",
    "If Stadia advertising picks up again, Google will have to clearly illustrate how Samsung, Google, and Apple's devices can running its cloud games. If it doesn't , Stadia is once again likely to alienate fans who may already believe that Stadia is a Google or Android only service when it can be played on any mobile device through some method, either via app or in-browser, as well as on computers or via a Chromecast dongle.",
    "This may seem like the absolute worst idea for a service dedicated to online-only functionality but people aren’t always able to connect to the internet or have enough data to stream massive games from the cloud. Right now this isn’t the biggest concern, as people aren’t typically commuting to work or going out thanks to the pandemic, but eventually, we will again. Google would be smart to take another leaf out of Microsoft's book and start bundling Play Pass to Google Stadia Pro, if they decide to keep it, as one package.",
    "This would mean that even in the dark depths of a subway, or on a bus in the middle of nowhere players can enjoy gaming on their phones. And at its core, that’s what Google promised with Stadia – quality gaming, on the go, wherever you may be. If the service intends to survive, that promise will finally have to be delivered."
  ],
  "headers": {
    "3": "1. The subscription model",
    "6": "2. The library of games",
    "8": "3. The loss of early adopter’s goodwill",
    "10": "4. Should have launched with support beyond Pixel",
    "12": "5. Nothing to do offline"
  },
  "links": {
    "internal games studios": "https://www.techradar.com/news/google-closes-game-development-studios-but-promises-stadia-will-go-on",
    "Google Glass": "https://www.techradar.com/reviews/gadgets/google-glass-1152283/review",
    "Project Ara": "https://www.techradar.com/news/phone-and-communications/mobile-phones/an-in-depth-look-at-project-ara-at-mwc-2015-1287614",
    "saying": "https://blog.google/products/stadia/focusing-on-stadias-future-as-a-platform-and-winding-down-sge/",
    "Cyberpunk 2077": "https://www.techradar.com/news/cyberpunk-2077-on-mobile-could-bring-about-google-stadias-renaissance"
  }
}