{
  "source": "https://www.techradar.com/news/could-valve-be-working-on-an-amd-powered-gaming-chromebook",
  "title": "Could Valve be working on an AMD-powered gaming Chromebook?",
  "category": "computing",
  "updated": "2021-07-14T10:13:38Z",
  "author": "matt-hanson",
  "summary": "It may not be as far-fetched as we thought",
  "article": [
    "More evidence has emerged suggesting a powerful Chromebook is coming with dedicated graphics by AMD – which would be a first – but that begs the question: why?",
    "Luke Short of Chromeunboxed has found references in the build configuration of the rumored device, codenamed Mushu, which suggests the Chromebook will come with an AMD Radeon Vega 12 dedicated GPU.",
    "Short did some more digging and found a development board that emerged on eBay a while back that could be an indicator of what this Vega 12 GPU would be like, with 4GB of high-speed memory, 1024 compute cores and, crucially, driver support in Linux.",
    "Chrome OS is based on Linux, and now supports running native Linux apps – more on that in a moment.",
    "While those specs, if accurate and applicable to the GPU coming with the Mushu Chromebook, are rather tame when it comes to the best gaming laptops, it would be by far the most powerful Chromebook ever launched when it comes to graphical performance. This is because Chromebooks previously only came with integrated graphics, which are no match for dedicated graphics.",
    "If true, then, this would make Mushu – or whatever it ends up being called – the first Chromebook that could do a decent job of playing games. This is where that whole ‘why?’ question comes in.",
    "There’s a good reason why Chromebooks aren’t considered gaming devices. Their main appeal is that they are affordable laptop alternatives, and prices are kept low because they use less powerful components.",
    "They are able to use less powerful components because Chrome OS, the operating system Chromebooks run on (and which is based on Google’s Chrome web browser), is less resource-hungry than Windows 10 or macOS, so it can run quickly and smoothly on low powered hardware.",
    "Modern games, of course, don’t run well on low-powered hardware, combined with the fact that very few – if any – games will run on Chrome OS natively, as they are primarily made for Windows, which most PC gamers use.",
    "So, what would be the point of a gaming Chromebook if there’s nothing to play?",
    "Well, Short comes up with some interesting theories. For a start, there have been rumors swirling that Valve and Google could be working on bringing Steam to Chrome OS. Steam is a hugely popular store for buying PC games on, and it also enables people to stream games from other gaming PCs.",
    "According to Short, the same hardware used by Mushu, codenamed ‘Hatch’, is being used to test Steam on Chrome OS. With Steam running natively, Chromebooks could potentially have access to a large library of games.",
    "There’s still the issue with games being made for Windows 10, not Chrome OS, however. But, Valve has been working on its ‘Proton’ solution, which is a compatibility layer that allows Windows 10 games to run natively in Linux.",
    "If Valve is working on bringing Proton to Chrome OS (which as we mentioned earlier, can now run Linux apps, so it’s not too much of a stretch), then suddenly Chrome OS has access to a huge range of PC games, and a Chromebook with a dedicated GPU will suddenly be a very attractive proposition, especially if it costs significantly less than a Windows 10 gaming laptop.",
    "This is all based on a lot of conjecture and rumor at the moment, but the idea of a gaming Chromebook suddenly makes more sense. Valve co-founder and Managing Director Gabe Newell, when recently asked about bringing Steam to games consoles, gave a cryptic reply: “You will get a better idea of that by the end of this year... and it won't be the answer you expect.”",
    "Rather than bringing Steam to the PS5 and Xbox Series X, could he have been hinting at Steam coming to Chromebooks instead? Who knows, we might even see Steam-branded Chromebooks in the future."
  ],
  "headers": {
    "6": "Why?"
  },
  "links": {
    "has found references": "https://chromeunboxed.com/an-amd-dgpu-chromebook-is-coming/",
    "that emerged on eBay a while back": "https://wccftech.com/amd-radeon-rx-vega-and-polaris-gpu-engineering-boards-spotted/",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "there have been rumors swirling": "https://boilingsteam.com/steam-on-chromeos-not-a-rumor-anymore/",
    "when recently asked about bringing Steam to games consoles": "https://arstechnica.com/gaming/2021/05/valves-gabe-newell-hints-at-vague-console-plans-coming-this-year/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}