{
  "source": "https://www.techradar.com/news/buying-a-laptop-for-school-heres-what-to-look-for-and-what-to-avoid",
  "title": "Buying a laptop for school? Here's what to look for and what to avoid",
  "category": "computing",
  "updated": "2021-08-10T11:31:15.026Z",
  "author": "tabitha-baker",
  "summary": "Find a laptop for school without breaking the bank",
  "article": [
    "Buying a laptop for school can get expensive quickly if you don't know which features you should be prioritizing, especially when back to school sales are offering a range of different configurations at wildly different price points. It may seem like you'll need the latest processor or terabytes worth of storage, but in reality there are other areas that may need your attention instead.",
    "While you'll certainly need enough horsepower to multi-task through everyday programs, or even more if you're running more demanding software like Adobe, picking up a laptop for school doesn't need to mean breaking the bank on the latest ultrabook.",
    "In fact, going with an older but more feature rich model is generally the best way forward. You'll find plenty of laptop deals in the $300 - $500 / £300 - £500 price range that offer big storage options and a nice CPU to go with them. While they won't hold up against the Dell XPS or a heavy gaming laptop, these machines can stretch a lot further than you might think.",
    "A baseline spec for students at high school should sit at at least 128GB of SSD storage space (expandable via an external hard drive), 8GB RAM and an i5 or Ryzen 5 processor.",
    "Those moving onto college or who need a little more power for heavy software should look at upgrading that storage up to 256GB (or 512GB for more computing-heavy courses) and potentially even moving up to 16GB RAM as well. The best laptops for students are the ones that combine just the right components while sacrificing features that might not necessarily be used year round.",
    "Whether you're checking out cheap Chromebooks or something a little more powerful, you'll find everything you need to know about how to buy a laptop for school right here.",
    "Once you know what you're looking for, it's a lot easier to find the perfect laptop for school. There's often a massive range of specs listed alongside each model, but filtering down to the features that will help you get through the school year best can help you pick the right model.",
    "The baseline spec that we recommend for a Windows machine is an i5 / Ryzen 5 processor, 8GB RAM, and 128GB of SSD storage (though many users may need more), though you can get away with cheaper components inside a Chromebook. However, you should also check the size and weight of your prospective machine, as well as the battery life, keyboard, and storage options available to you.",
    "We're going through everything you need to know about picking out the perfect laptop for school right here, with all the latest laptop deals on machines that fit the bill.",
    "If you're going to be carrying your laptop with you all day, you won't want to splash out on a massive 17.3-inch unit. For college and university students, a slimline 14-inch or, if you're going to be using multiple tabs side by side, 15.6-inch device will be perfectly proportioned. In fact, if you can, we'd recommend dropping down to 13-inch where possible, though we find this size to generally be available on more expensive laptops.",
    "11.6-inches is typically too small for everyday work use. However, if you're buying a younger child a Chromebook or cheap laptop for school, a smaller display may be worthwhile especially considering the price tends to drop even further on these models.",
    "Your laptop is likely going to be by your side all day, which means you'll need enough juice to see you through your workload without having to rely on plug points around you. We'd recommend finding a laptop with at least 10 hours of battery life, and if you spot a particularly good price, one with fast charging capabilities as well. That means you'll be able to hold out all day long and can quickly recharge if you do use more power than expected.",
    "The latest MacBook Air with its M1 chip is well known for its excellent battery life, and while it's a little pricier than many of the laptops we'd recommend for school, the resale value here is high enough to consider it an investment as well. However, you can find laptops with durable battery life for under $600 / £600 as well.",
    "In fact, if you value a long lasting battery life over a Windows operating system. Chromebooks offer some of the best value prices around while still maxing out at over 10 hours of juice. The Acer Chromebook 314, for example, lasted for over 12 hours in our testing and offered an excellent experience while doing so. That said, springing a little more for a Windows machine like the 2020 Acer Swift 3 or Acer Aspire 5 will bring you the best of both worlds as well.",
    "If you're buying a laptop for school, chances are you're going to be using that keyboard a lot. It pays to make sure you're getting a decent set of backlit buttons under your fingers, with comfortable keycaps, a tactile feel, and fast bounce. Investing in your keyboard is going to make a world of difference, so avoid spongey keys that don't quite snap back under your fingertips.",
    "However, it's worth making sure you can see all the keys you need laid out on the deck. Smaller and cheaper laptops often drop certain keys from the full board, with number pad keys being the first to go on 14-inch machines.",
    "If you need the extra functionality here, it's worth finding a lightweight 15.6-inch machine that will be able to accommodate a full sized set of buttons. The Asus Vivobook S15 is a lightweight but larger device that still offers a full keyboard with a comfortable 1.4mm of travel.",
    "Make sure you're getting the full six rows of keys, with a dedicated function row along the top. While this was standard for a long time, smaller machines are now foregoing the typical F-row, instead doubling up the functionality of your number keys. These shortcuts become invaluable once you're using them regularly, so double check everything is in its rightful place.",
    "The 2020 Acer Swift 3 comes out particularly well under this microscope as well (it's also strong in the battery department). With around 1.3mm of travel it's a little on the lighter side but still offers a responsive and tactile feel.",
    "However, if you're after Chrome OS, the Google Pixelbook has one of the best laptop keyboards we've ever used. Things can get a little pricey there, though, so we can also recommend the Asus Flip C302 or Acer Chromebook 314 for a tactile response as well.",
    "If you're going to be getting creative with your new laptop, it's worth making sure you're picking up enough storage for all those Adobe programs, larger file sizes, and your piling downloads folder.",
    "Those studying creative college courses, for example, should invest far more in their storage than those who will be spending more time on written projects, aiming for around 512GB of SSD space. However, if you fall into the latter camp you can save some serious cash by picking up a smaller machine and relying a little more on cloud storage instead.",
    "That's the goal behind many of the cheapest Chromebooks, with some only offering 32GB of internal space. Of course, you'll be supplementing this with a microSD card and online servers, so if you don't need fast data transfers (e.g. for video or audio files) it might be worth investing less here and more in your keyboard and battery life.",
    "In general, everyday note-taking and streaming on a Windows PC requires between 128GB and 256GB of SSD storage space. However, if you're concerned you're picking up too little based on your prospective workload it's better to future proof yourself and go for the larger option.",
    "If storage is your biggest concern, you can find some excellent prices on Dell's Inspiron 15 3000, starting at $299 at Dell. While it doesn't offer the best keyboard in the business and comes out a little larger than more portable designs, you can find configurations that will offer up far more storage for your cash in this cheaper model than if you splashed out on a more premium device.",
    "For more budget options, we're rounding up all the best Chromebooks and the best laptops under $500 right here."
  ],
  "headers": {
    "6": "How to find the best laptop for school",
    "9": "Size",
    "11": "Battery life",
    "14": "Keyboard",
    "20": "Storage"
  },
  "links": {
    "back to school sales": "https://www.techradar.com/news/best-back-to-school-sales-2020",
    "best laptops for students": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385",
    "cheap Chromebooks": "https://www.techradar.com/news/cheap-chromebook-deals",
    "laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Acer Chromebook 314": "https://www.techradar.com/reviews/acer-chromebook-314",
    "2020 Acer Swift 3": "https://www.techradar.com/reviews/acer-swift-3-2020",
    "Acer Aspire 5": "https://www.techradar.com/reviews/acer-aspire-5",
    "Asus Vivobook S15": "https://www.techradar.com/reviews/asus-vivobook-s15-s532f",
    "Google Pixelbook": "https://www.techradar.com/reviews/google-pixelbook",
    "Asus Flip C302": "https://www.techradar.com/reviews/asus-chromebook-flip-c302",
    "starting at $299 at Dell": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2711793221544659500/https://deals.dell.com/en-us/category/laptops",
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "best laptops under $500": "https://www.techradar.com/news/best-laptops-under-dollar500"
  }
}