{
  "source": "https://www.techradar.com/news/alien-tv-show-from-fargo-creator-sounds-like-itll-kick-ass-but-expect-a-long-wait",
  "title": "Alien TV show from Fargo creator sounds like it'll kick ass – but expect a long wait",
  "category": "entertainment",
  "updated": "2021-08-16T09:55:55Z",
  "author": "samuel-roberts",
  "summary": "It's likely coming in 2023",
  "article": [
    "The Aliens TV show coming to FX and Hulu in the US is likely to release in 2023, it's been revealed, and it's been described as both \"a beast\" and \"very grounded\".",
    "Those comments come from FX Chairman John Landgraf, who discussed Fargo creator Noah Hawley's approach to basing a TV show in that universe. Landgraf noted that while Hawley – who also made the visually and tonally distinctive Marvel series, Legion, for FX – will apply some of his own original touches to the show, it's set to feel like part of the movies' universe.",
    "\"I think Noah’s very conscious of the fact that there’s a cinematic universe, if you will, and that while it has some flexibility that the aesthetic that was established by Ridley Scott and I think continued by James Cameron is a part of that universe,\" Landgraf noted at the Television Critics Association press tour last week (via Rotten Tomatoes), explaining that Ridley Scott and his production company, Scott Free, are heavily involved in the show.",
    "What's exciting about this series is that FX is behind it. The cable network has been responsible for many of our favorite shows over the past decade, like Devs, What We Do in the Shadows, It's Always Sunny in Philadelphia and Better Things. It's not making any other shows based on a Disney-owned property – just this one, which makes the project more intriguing.",
    "\"We’re well into it. We’re actually moving apace. I have optimism, for example, that that show may well roll out in 2023; probably will roll out in 2023,\" Landgraf said. \"But we want to get it right…you’re being given access to a really precious resource when you’re granted access to such an important piece of IP. And it’s not something FX does a lot of. So…there’s not another really key piece of Fox or Disney IP that we’re working on right now.\"",
    "Back in July, Hawley revealed he'd written two scripts for the show, with the intention of filming them in Spring 2022 – which is around March-May. The series is set on Earth, and will explore the social inequality in this fictional universe, which usually has rich corporations sending blue collar workers off to find these deadly creatures.",
    "Outside the US, we'd expect to see Alien land on Disney Plus via Star – as will be the case with upcoming FX sci-fi show Y: The Last Man.",
    "There hasn't been an essential Alien movie since 1986 – just a lot of bad or contentious films, with some (like Alien 3) gathering their own cult audience over time. Alien: Covenant, Ridley Scott's third movie, was messy, and while critics mostly liked it, the movie made around $150 million less than Prometheus did in 2012.",
    "Alien has a lot of potential for a small-screen story, though. It has quite a lot of lore and moving parts – like the evil corporation Weyland-Yutani, or the fact that the xenomorph looks different depending on its host, and indeed the roots of the creature as depicted by Prometheus. The movies' industrial production design and analog-like technology has dated incredibly well, and TV shows now actually have the budget to put that on the small screen.",
    "Hawley is a big-name creator who sounds like he has a firm creative angle on how to tell an Alien story on Earth. Like how we've seen Star Wars or Marvel make the successful transition to TV, Alien is likely to be the show everyone is talking about when it finally gets here – you're just going to have to wait a little while."
  ],
  "headers": {
    "7": "Analysis: Alien desperately needs a revamp"
  },
  "links": {
    "Rotten Tomatoes": "https://editorial.rottentomatoes.com/article/noah-hawley-alien-series-is-a-beast-more-tv-and-streaming-news/",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Y: The Last Man": "https://www.techradar.com/news/y-the-last-man-tv-show-is-finally-happening-and-looks-insanely-good-in-first-trailer"
  }
}