{
  "source": "https://www.techradar.com/news/this-new-toshiba-4k-tv-is-the-first-amazon-fire-tv-to-feature-local-dimming",
  "title": "This new Toshiba 4K TV is the first Amazon Fire TV to feature local dimming",
  "category": "televisions",
  "updated": "2021-12-06T14:00:23Z",
  "author": "rhys-wood",
  "summary": "Time to curl up by the Fire",
  "article": [
    "Toshiba has announced its latest 4K flagship, the M550KU Fire TV, which the company says will the first Amazon Fire TV to feature local dimming, with up to 48 dimmable zones to enhance color adjustment and brightness control.",
    "The Toshiba M550KU Fire TV will be made available through Amazon and Best Buy in early December, and will be purchasable in three sizes. The base 55-inch TV will cost $799.99, while a larger 65-inch variant will run you a little more at $999.99. Finally, a mammoth 75-inch TV is available to buy for $1,199.99.",
    "The TV sounds like it's packing some fancy features, too. Dolby Atmos and Dolby Vision are both featured, as well as the ever-reliable Fire TV OS. The TV itself has opted for an eye-catching, bezel-free design, which could look especially nice if you opt for one of the TV's larger sizes.",
    "If you're wondering what the local dimming feature entails, it essentially helps to correct color balance for darker on-screen environments. This is a boon for LCD screens where the overall brightness can unrealistically illuminate what should be darker blacks.",
    "Basically, local dimming is a great feature to have if you plan to make use of Fire TV's wealth of streaming apps like Netflix and Prime Video, as it will be able to more realistically add depth to any given scene, as opposed to the blanket brightness settings offered by more traditional LCD panels.",
    "The Toshiba M550KU Fire TV sounds like a promising TV for watching a wide variety of movies and shows, then, but what about gaming? With features like Dolby Vision HDR and local dimming, we have a TV that might provide a worthwhile alternative to the more expensive, best-in-class LG C1.",
    "As the M550KU Fire TV also supports a 120Hz refresh rate as well as an auto low latency mode, it could prove a fantastic companion to the PS5 and Xbox Series X/S consoles, especially for playing high-intensity multiplayer games where minimal input lag is essential to an enjoyable experience.",
    "Ultimately, the M550KU Fire TV sounds at least like a decent step up from the Toshiba C350, a budget 4K TV with a great price point, but which unfortunately lacked in a few key areas, particularly sound. We're hoping Toshiba's latest flagship can address the shortcomings of its previous efforts, and by the sounds of it, the M550KU has every chance of achieving just that."
  ],
  "headers": {
    "5": "Analysis: A great gaming TV on the cheap?"
  },
  "links": {
    "55-inch TV": "https://www.techradar.com/best/55-inch-4k-tv",
    "75-inch TV": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "Dolby Vision HDR": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Toshiba C350": "https://www.techradar.com/reviews/toshiba-c350-fire-tv-50c350ku",
    "budget 4K TV": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales"
  }
}