{
  "source": "https://www.techradar.com/news/why-samsungs-galaxy-s21-doesnt-come-with-a-charger",
  "title": "Why Samsung’s Galaxy S21 doesn't come with a charger",
  "category": "phones",
  "updated": "2021-12-05T13:37:47Z",
  "author": "james-peckham",
  "summary": "Annoying for some, but Samsung believes it’s the right choice",
  "article": [
    "The removal of the charger from smartphone boxes has been one of the most contentious topics in phones over the last year, and now Samsung has confirmed it won’t include many accessories you may expect in its packaging when you buy a new phone.",
    "Following Apple’s move to ditch the charger and in-box headphones with the iPhone 12, the Samsung Galaxy S21, Galaxy S21 Plus and Galaxy S21 Ultra will also come without some key accessories in the box.",
    "Why has Samsung dropped these? Officially, it’s to cut down on e-waste by supplying you with a charger that the company believes it’s unlikely you’ll need. There’s very little in the box alongside the phone – just a USB-C to USB-C cable, the phone’s Quick Start guide and an ejector pin so you can insert your SIM.",
    "There’s also a pre-applied screen protector, but that’s it. That’s a lot less than you’d currently expect from a smartphone box. It means you’ll have to use a pre-purchased phone charger and another pair of headphones with your device rather than rely on the ones included.",
    "TechRadar spoke to Paul Scott, Samsung Mobile’s Head of Product Management in the UK, who said, “It's a really bold but really important step at the same time. Listening to our consumers they’re making far more, as we are, sustainable choices in their daily lives, and what we need to do is make sure that we support that.",
    "“We do not want to be sending a consumer yet another charger when they’ve possibly got a charger from, say, 2018 or going all the way back to 2017. It's a USB Type-C charger, so we're not changing it.”",
    "All top-end Samsung phones, and the vast majority of other Android phones, have supported USB-C charging since 2017. The Samsung Galaxy S8 was the first phone from the company to make the switch from microUSB to USB-C. If you own an Android phone, it’s very likely that you currently recharge it with a USB-C charger that will be compatible with the new Galaxy S21 series.",
    "Samsung is also encouraging users to use its wireless charging tech too, which means you don’t need a cable to be able to recharge your phone. That isn’t technology that everyone has, though, and good wireless chargers are still a more expensive investment than opting for a plug and cable.",
    "Patrick Chomet, Samsung’s Head of Customer Experience Office, said, “We believe that the gradual removal of charger plugs and earphones from our in-box device packaging can help address sustainable consumption issues and remove any pressure that consumers may feel towards continually receiving unnecessary charger accessories with new phones.",
    "Samsung isn’t just cutting back on the e-waste by dropping chargers – it’s also trying its best to improve its packaging overall.",
    "Scott told TechRadar, “Over the past five years, we've reduced that plastic weight within the S series packaging by 92%. And the plastic that we use is up to 3% of the packaging with the latest Samsung flagship, so there's very minimal plastic usage.",
    "“We used to have plastic within the box – a plastic holder tray – and we've replaced those trays with pulp molds so the wrapping and accessories are far more eco-conscious.\"",
    "That means the box your Samsung Galaxy S21 phone will come in is set to be far smaller and generally more eco-friendly than previous phones you’ve bought from the company, and likely more than the boxes you’ve bought from other manufacturers.",
    "While many will be upset by the lack of a charger in the box with the Galaxy S21 series, the company has made this notably easier to transition over than Apple did with its iPhone 12 series. Many needed to buy a new charger to use on the iPhone 12, but Samsung’s new tech can just be used with a traditional USB-C charger.",
    "If you want the latest and greatest charging tech from Samsung and you’re using an older charger, you’ll likely want to purchase a new one. The company has said it's reducing the price of its chargers from $34.99 / £29 / AU$50 before the S21 launch to $19 (about £15, AU$25) in the near future.",
    "That price doesn't seem to have taken place on Samsung's website, but the company said during its launch the price will be dropping. We've yet to hear the new price for those in the UK or Australia.",
    "Plus, you've got the choice of a third-party alternative to go alongside your new smartphone. But given the path Apple and Samsung are paving, you won’t be burdened with more charging cables packed in all phones to come."
  ],
  "headers": {},
  "links": {
    "accessories": "https://www.techradar.com/news/samsung-s21-accessories",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Samsung Galaxy S21": "https://www.techradar.com/news/samsung-galaxy-s21/reviews/samsung-galaxy-s21",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Samsung's website": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-4950542001167620000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fweb%2Fexpress%2Fcart%2F&article_name=Why%20Samsung%E2%80%99s%20Galaxy%20S21%20doesn't%20come%20with%20a%20charger&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhy-samsungs-galaxy-s21-doesnt-come-with-a-charger"
  }
}