{
  "source": "https://www.techradar.com/news/nvidia-rtx-3080-ti-and-3070-ti-gpus-could-have-12gb-and-8gb-of-vram-respectively",
  "title": "Nvidia RTX 3080 Ti and 3070 Ti GPUs could have 12GB and 8GB of VRAM respectively",
  "category": "computing",
  "updated": "2021-05-15T16:57:02Z",
  "author": "darren-allan",
  "summary": "Fresh leak from MSI spills the memory details",
  "article": [
    "A fresh leak from a graphics card manufacturer reinforces previous speculation that Nvidia is about to unleash RTX 3080 Ti and RTX 3070 Ti models on the world, and lets us know the purported memory configuration for both of these inbound Ampere products.",
    "According to leaked presentation materials from MSI, as highlighted by VideoCardz, the RTX 3080 Ti will run with 12GB of video RAM, whereas its lesser sibling the RTX 3070 Ti will have 8GB of VRAM.",
    "The marketing materials from the card manufacturer show that both Ti variants of MSI’s Suprim models will use the same PCB (printed circuit board) design, and that the 3070 Ti will use the same GPU (GA104) as the vanilla RTX 3070, specifically the GA104-400 version (as opposed to the GA104-300 on the 3070), as previously rumored. The 3070 Ti is expected to be loaded up with 6,144 CUDA cores rather than the 5,888 cores on the plain 3070.",
    "Of course, as with any leak and the previous spinning from the rumor mill, we should be careful about how much stock we put into these spec details.",
    "Note that the leak only mentions the quantities of VRAM present with these MSI cards, and not the type of video RAM, so it remains unclear whether or not the lesser 3070 Ti will run with GDDR6X or just plain GDDR6. The rumor mill has previously contended that it will be the former faster type of memory, though.",
    "Indeed, past speculation has pointed to the RTX 3070 Ti having two versions with 8GB and 16GB of VRAM respectively, but seeing as the Suprim is MSI’s flagship brand, it would seem that if 16GB was an option on the table, it would’ve been taken with these models.",
    "Ultimately, we won’t know for sure until the rumored 3070 Ti and 3080 Ti actually turn up, with the expectation being that these cards will be officially revealed at the end of May, going on sale early in June. The RTX 3080 Ti is supposedly due on June 2, and the RTX 3070 Ti is to follow a week later (and immediately sell out in both cases, no doubt)."
  ],
  "headers": {
    "5": "Suprim and proper"
  },
  "links": {
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "reinforces previous speculation": "https://www.techradar.com/news/nvidia-could-be-about-to-hit-amd-hard-with-launch-of-rtx-3080-ti-and-3070-ti-gpus",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "VideoCardz": "https://videocardz.com/newz/msi-confirms-geforce-rtx-3080-ti-12gb-and-rtx-3070-ti-8gb-suprim-series",
    "RTX 3070": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3070-find-stock-here",
    "rumor mill has previously contended": "https://www.techradar.com/news/nvidia-rtx-3070-ti-might-come-in-both-8gb-and-16gb-variants",
    "RTX 3070 Ti having two versions": "https://www.techradar.com/news/nvidia-rtx-3070-ti-might-come-in-both-8gb-and-16gb-variants",
    "RTX 3080 Ti is supposedly due on June 2, and the RTX 3070 Ti is to follow": "https://www.techradar.com/news/nvidia-rtx-3080-ti-and-rtx-3070-ti-cards-may-launch-in-early-june",
    "sell out": "https://www.techradar.com/news/nvidia-rtx-3080-shortage-could-continue-until-q3"
  }
}