{
  "source": "https://www.techradar.com/news/sony-camera-fans-get-impressive-new-fe-35mm-f14-gm-lens-read-our-full-review",
  "title": "Sony camera fans get impressive new FE 35mm f/1.4 GM lens – read our full review",
  "category": "cameras",
  "updated": "2021-01-13T22:08:37Z",
  "author": "mark-wilson",
  "summary": "An exciting prime lens for well-heeled Alpha snappers",
  "article": [
    "Sony has announced the much-anticipated FE 35mm f/1.4 GM lens for owners of full-frame cameras like the Sony A7 III and Sony A7R IV – and you can read all about it in our in-depth Sony FE 35mm f/1.4 GM review.",
    "Yes, we've been out for some extensive shooting with the versatile prime lens, which is a new premium option that sits above the current Sony Distagon T FE 35mm f/1.4. It's here to give well-heeled snappers a new option for environmental portraits, wedding and street photography – and according to our review, it does that pretty successfully.",
    "Because it's a G Master lens, the FE 35mm f/1.4 GM is dust- and weather-resistant, with seals that make you feel confident of using it in most weather conditions. And further supporting its premium billing are two XD linear motors for fast and quiet AF, which our review found to be \"incredibly fast and near-silent\".",
    "The FE 35mm f/1.4 GM is also suitable for both stills and video shooters, thanks to the inclusion of a manual aperture ring that can be both stepped for photographers (at third stop increments) or stepless for filmmakers who want to make smoother adjustments.",
    "Elsewhere, you get a Nano AR Coating II to reduce internal reflections and help stop ghosting and flare when shooting towards light sources. The lens is also finished with a fluorine coating that helps prevent fingerprints, dust, water and oil from ruining your razor-sharp shots.",
    "So does the FE 35mm f/1.4 GM live up to its G Master billing? Overall, it certainly does, with excellent image quality overall and that near-silent autofocus making it an excellent choice for a wide variety of settings.",
    "Prime lenses still edge out their zoom alternatives and that's again the case here. In our tests, the FE 35mm f/1.4 showed no sign of chromatic aberration or fringing, even in high contrast areas, which is very impressive.",
    "Our only main gripe was some slight vignetting, which is strong when shooting wide open and increases again from f/8 and beyond. It's easily fixed during processing, so is now deal-breaker, but it's an unusual issue that you don't often see.",
    "Aside from that vignetting and some expected loss of sharpness beyond f/11, the FE 35mm f/1.4 impressed us with both its image quality and versatility. In our verdict we said called it an \"incredibly versatile lens that could arguably be used for more photographic genres than any other focal length\", and said that it's the \"high-quality fast prime that you didn’t know you needed\".",
    "The only potential downside is the price tag, which is £1,500 with availability from the end of January in the UK and $1,400 / AU$2,449 with shipping from mid-February in the US and Australia."
  ],
  "headers": {
    "5": "Prime cut"
  },
  "links": {
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony FE 35mm f/1.4 GM review": "https://www.techradar.com/reviews/sony-fe-35mm-f14-gm"
  }
}