{
  "source": "https://www.techradar.com/news/heres-why-macos-13-could-be-a-mammoth-upgrade",
  "title": "Here's why macOS 13 could be a Mammoth upgrade",
  "category": "computing",
  "updated": "2021-08-14T10:52:43Z",
  "author": "daryl-baxter",
  "summary": "Opinion: M2 Mammoth upgrades could be due",
  "article": [
    "Every few years we see a significant redesign in Apple’s operating system for its Macs, and while macOS 11 Big Sur brought a user interface that matched it with iOS and iPadOS, it seems like it's only half the story of what’s really coming up.",
    "Mammoth was a name trademarked by Apple back in 2013 alongside Monterey, which gave credence to what this year’s update would be called, something that we guessed correctly back in June.",
    "While macOS 12 Monterey is a significant update, it’s not a substantial one compared to Big Sur, and with rumors of new MacBook Pro laptops with M1X chips coming, it’s all hinting towards a big update next year that could draw a line in the sand for Intel Macs, and begin a new era for the ARM Macs.",
    "An interesting concept appeared recently showcasing what macOS 13 Mammoth could bring, and it made us wonder just what next year could bring to the Mac.",
    "Looking at the first concept from Parker Ortolani at 9to5Mac, there’s plenty to like here, with the stoplight buttons able to be expanded to better control full-screen apps, while App Library replaces Launchpad and widgets are finally freed from a hidden sidebar, able to be placed across the desktop.",
    "macOS has had a habit in the last few years of playing catchup to iOS. While the iPhone and iPad have had the useful shortcut menu called Control Center since 2013, it only appeared on the Mac in Big Sur last year.",
    "While macOS 12 Monterey brings shortcuts to the Mac, other new features this year aren’t exclusive to the platform - they’re seen on iOS and iPadOS as well, so many users are seeing this as a minor upgrade. One can argue that it’s similar to past releases on the Mac, such as Snow Leopard and Mountain Lion, releases that respectively gave few new features, but offered more refinements instead.",
    "In this concept for Mammoth, new features such as widgets and App Library are lifted from both iOS and iPadOS, making it even easier for users to access their favorite apps and widgets at a moment’s notice.",
    "It makes a lot of sense to see these features come to the Mac. If you use Launchpad, it’s as if you’re selecting apps from within a folder on iOS, but depending on whether you’re using an iMac or a MacBook, the size of this could be enormous. With the App Library, it’s reduced to a folder, and can be expanded into different sets of folders, just like in iPadOS 15.",
    "But the one aspect we can’t see is the menu bar. Apple likes symmetry across all its products, and a menu bar that changes in length simply doesn’t look right. Other than that, it’s a concept that makes sense, and it could be the finishing touch to the reboot of macOS that we began to see in macOS 11 Big Sur.",
    "In the second part of the concept, Ortolani goes further into the apps for Mammoth, with Front Row, Apple’s app for viewing movies that have long since been discontinued, to the redesigned Weather app from iOS 15 available to use on macOS 13.",
    "It’s a fascinating look into how Apple could make these features work in macOS, but also make them look as though they’re a great fit for the operating system as well. While iOS and macOS are very similar, a desktop operating system needs the flexibility to match the many different monitors and Macs and users have, and these concepts help make the next version of macOS a tempting upgrade already, even before macOS 12 Monterey is released to the public.",
    "When Apple decided to change from PowerPC chips to Intel for the Mac back in 2005, it was declared that the transition would take two years - it was done in one. But in 2007, Mac OS X 10.6 Snow Leopard dropped support for PowerPC chips, only running on Intel Macs.",
    "While the pandemic has most likely slowed down the next transition of Intel chips to Apple Silicon, I don’t think next year’s release will drop support for Intel chips. Rather, more features will be kept exclusive to Apple Silicon Macs, tempting users to upgrade and take advantage of what the new Macs offer.",
    "There are many rumors of a new MacBook Pro that’s powered by an M1X chip, said to contain more cores for graphics, higher speeds and be able to manage more ports, so HDMI and SD Card slots can return to the Macs. But this could also lay down the groundwork for other Macs that are on the way that have an M2 chip as well.",
    "These can build upon the great battery life that the M1 MacBook Air brings, while also cutting the weight of Intel, bringing in more new features that are exclusive to the Mac.",
    "While we’re just a few short months away from macOS 12 Monterey arriving, the upcoming M1X and M2 Macs can give us plenty of hints as to what macOS 13 will bring once it’s announced at next year’s WWDC if history repeats."
  ],
  "headers": {
    "4": "A Mammoth feature set",
    "12": "An M2 Mammoth future"
  },
  "links": {
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "guessed correctly": "https://www.techradar.com/news/mammoth-or-monterey-apple-registers-both-names-for-a-future-macos-release",
    "macOS 12 Monterey": "https://www.techradar.com/news/macos-12",
    "MacBook Pro laptops with M1X": "https://www.techradar.com/news/m1x-macbook-pro-may-still-be-on-track-for-2021-as-new-clues-emerge",
    "concept": "https://9to5mac.com/2021/08/09/concept-macos-mammoth-should-redefine-the-mac-experience-with-major-changes-to-the-desktop-menu-bar-widgets-search-and-the-dock/",
    "second part of the concept": "https://9to5mac.com/2021/08/12/concept-how-macos-mammoth-could-improve-productivity-entertainment-and-safety-with-new-apps-part-2/",
    "dropped support": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9828016922061451000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fkb%2FSP575%3Flocale%3Den_GB"
  }
}