{
  "source": "https://www.techradar.com/news/this-dell-g15-with-a-cheap-rtx-3050-ti-is-one-of-this-weeks-best-gaming-laptop-deals",
  "title": "This Dell G15 with a cheap RTX 3050 Ti is one of this week's best gaming laptop deals",
  "category": "computing",
  "updated": "2021-07-05T14:28:55Z",
  "author": "alex-whitelock",
  "summary": "It's also packing a seriously powerful Ryzen-7 CPU too",
  "article": [
    "Gaming laptop deals with the new RTX 3050 Ti graphics card have been hitting the shelves for quite some time now, but we think this new Dell G15 Ryzen Edition for $849.99 (was $1,178) might just feature the biggest price cut we've seen so far.",
    "At full price, the specs line-up of an RTX 3050 Ti, AMD Ryzen 7 5800H processor, 8GB of RAM, and 256GB SSD wouldn't be worth shouting about, but, with a cool $329 off, this Dell G15 suddenly looks like a great bang for the buck proposition.",
    "For context, we normally see RTX 3050 Ti gaming laptop deals go for around $1,000 since that graphics card is still a pretty new component. Take this Lenovo Legion 5 for $999 at Amazon, or this Asus TUF Dash 15 for $949.99 also at Amazon for example. Both are slightly more premium gaming laptop deals all around with larger SSDs, but, only the Legion 5 is more capable on paper with more RAM and a better screen. Of course, it's also $150 more expensive.",
    "So, it's looking like this RTX 3050 Ti Dell G15 is a pretty great buy right now if you're looking for a mid-range gaming laptop that's packing in some of the latest specs. It's worth noting that the RTX 3050 Ti is still a fairly budget-focused graphics card with its 4GB of Vram, but it's still great for 1080p resolutions and it'll still allow you to enable Ray-Tracing and DLSS in games. DLSS in particular is a handy feature to have on a fairly budget machine as it'll allow you to squeeze out as many frames as possible, regardless of your specs.",
    "Outside the US? See the best gaming laptop deals in your region just below.",
    "Looking to spend a little less? Why not visit our main cheap gaming laptop deals page for plenty more options. Also, fill up your library with this week's best cheap game deals."
  ],
  "headers": {
    "5": "Gaming laptop deals: RTX 3050 Ti Dell G15"
  },
  "links": {
    "for $849.99 (was $1,178)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9740068728519408000/https://deals.dell.com/en-us/productdetail/9dbn",
    "for $999 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB08YKG5K7F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1436286011176698400-20",
    "for $949.99 also at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FASUS-GeForce-i7-11370H-Windows-TUF516PE-AB73%2Fdp%2FB08XPC3WFQ%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5410494875295457000-20",
    "cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "best cheap game deals": "https://www.techradar.com/news/cheap-game-deals-sales-xbox-one-ps4-pc"
  }
}