{
  "source": "https://www.techradar.com/news/fortnite-could-remain-banned-on-iphones-and-ios-devices-for-years",
  "title": "Fortnite could remain banned on iPhones and iOS devices for years",
  "category": "phones",
  "updated": "2021-09-22T18:01:37Z",
  "author": "david-lumb",
  "summary": "Tim Sweeney messed around and found out.",
  "article": [
    "If you hoped the ruling on the Apple v. Epic trial earlier in September meant Fortnite would soon be back on iPhones, there’s bad news: the game will continue to be banned from Apple devices until appeals to the court decision are exhausted, which could take as long as five years.",
    "That’s according to Epic CEO Tim Sweeney, who tweeted that Apple officially informed Epic it will keep blacklisting Fortnite on iPhones and iOS devices.",
    "In a tweet thread, Sweeney, included Epic’s message to Apple requesting its developer account (which allows individuals and companies to submit apps to the App Store) be reinstated, which is part capitulation and part insistence that Apple adhere to the court’s ruling in allowing any developer to point users to third-party payment options.",
    "Apple’s response also referenced the court decision, echoing Judge Yvonne Gonzalez Rogers’ ruling that Apple had cause to pull Fortnite off iPhones and ban Epic for breach of contract. Because Epic had slyly introduced code to intentionally break the App Store rules, which Apple called ‘duplicitous,’ the latter chose to keep the ban in place and asserts it will refuse to consider any further requests until “the district court’s judgment becomes final and nonappealable.”",
    "In other words, the tech giants are still squabbling, and you probably won’t get to play Fortnite on your iPhone or Mac anytime soon.",
    "Judge Gonzalez’s ruling (uploaded as a 185-page PDF here by The Verge) did hand Epic a partial victory: Apple can no longer prevent developers from including references and links to payment systems other than in-app payments (which Apple takes up to a 30% cut of). In practice, this means apps can have buttons and links that navigate users outside the app to set up and pay for things, thus granting more revenue to the developers. Given the ruling was handed down relatively recently, we haven’t seen any apps do this yet.",
    "But the decision didn’t vindicate any of Epic’s other claims of mistreatment and disadvantage; crucially, Judge Gonzalez rejected the notion that the App Store is a monopoly, essentially pointing to the comparable Google Play Store as an alternative. This closed the door on Epic’s plans to open its own Epic Games Store on iOS and other Apple platforms, let alone avoid Apple’s revenue cuts.",
    "As previously mentioned, the ruling also validated Apple’s decision to boot Epic off its platform, allowing that action and future moves the company might make to treat similar App Store policy-breaking stunts as cause for a ban. That keeps the ball in Apple’s court, so to speak, and prevents Epic or other companies from seeking judicial assistance in getting back on software platforms against the wishes of the platform owners. This is one of many reasons Epic immediately appealed the ruling after it was handed down.",
    "So while Sweeney is right in tweeting that “Epic agreed with Apple that we would play by the same rules as everyone else,” just because the company is capitulating to a set of previously-set conditions doesn’t mean Apple has to let them back into the App Store. It’s unclear what Epic would have to do to please Apple enough to get Fortnite back on iPhones, but one thing is certain: Apple isn’t making it easy. Tim Sweeney messed around and found out."
  ],
  "headers": {
    "5": "Analysis: Epic might have won a court victory, but Apple still holds the App Store keys"
  },
  "links": {
    "ruling": "https://www.techradar.com/news/developers-can-now-evade-apples-in-app-payment-scheme-to-directly-sell-to-users",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "tweeted": "https://twitter.com/TimSweeneyEpic/status/1440711772483186690",
    "included": "https://twitter.com/TimSweeneyEpic/status/1440711578819567622?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1440711772483186690%7Ctwgr%5E%7Ctwcon%5Es2_&ref_url=https%3A%2F%2Fpublish.twitter.com%2F%3Fquery%3Dhttps3A2F2Ftwitter.com2FTimSweeneyEpic2Fstatus2F1440711772483186690widget%3DTweet",
    "here": "https://www.documentcloud.org/documents/21060631-apple-epic-judgement",
    "The Verge": "https://www.theverge.com/2021/9/10/22662320/epic-apple-ruling-injunction-judge-court-app-store",
    "tweeting": "https://twitter.com/TimSweeneyEpic/status/1440711578819567622"
  }
}