{
  "source": "https://www.techradar.com/news/biktrix-moto-is-an-e-bike-with-a-range-of-over-100-miles",
  "title": "Biktrix Moto is an e-bike with a range of over 100 miles",
  "category": "fitness",
  "updated": "2021-04-15T13:00:00Z",
  "author": "rob-clymo",
  "summary": "Power, range and a choice of frame sizes too",
  "article": [
    "Biktrix has taken the covers off a new e-bike, the Biktrix Moto, which blends moped-style range with a tantalising battery-powered design. The Canadian bike builder already has over 15 bikes in its portfolio, but the latest model delivers a neat twist on the regular e-bike, with a dual battery option allowing you to travel over 100 miles on one charge.",
    "For comparison, the Ribble Hybrid AL e, which currently sits at the top of our guide to the best electric bikes, has a maximum range of 60 miles, and the slick Specialized Turbo Creo SL Expert maxes out at 80 miles.",
    "Equipped with a 750W Bafang hub motor and a fuss-free, single-speed drivetrain that features a chain tensioner, the bike promises plenty of performance but should be a breeze to ride. Central to the long-range capability is the dual 48V 21Ah battery combination that sits on top of the downtube, although the base model comes with just a single Hailong 48V 21.5Ah unit.",
    "Riders can tap into the power from the bike’s battery that boasts a total maximum capacity of 48V 42Ah using the handlebar-mounted thumb throttle and control pad. Stopping the bike is done using one or both of the Tektro dual piston hydraulic disc brakes. Meanwhile, spring suspension forks and the bulbous tyres should help deliver a comfortable ride.",
    "The Biktrix Moto design features a distinctive aluminum frame style, which is available in either a 20in or a 24in edition and several color combinations. The smaller frame is suitable for riders between 4’ 8” and 5’ 5”, and features those chunky 20in tyres while the larger model is aimed at 5’ 3” to 6’ 2” riders and comes with 24in rubber. The Biktrix Moto also features front and rear fenders plus a chainguard, helping keep dirt and oil off your clothes.",
    "There’s a built-in LED headlight and integrated tail light, which can also be switched on and off via the handlebar control pad. Meanwhile, the Biktrix Moto offers practicality too thanks to a compact rear rack that’s fitted directly behind a funky-looking seat. Biktrix bills it as a motocross-style seat rather than a saddle, and it adds a slightly unconventional look to the bike that you’ll either love or hate.",
    "Biktrix sells bikes direct through its website, and you can customize them to suit your needs. The Biktrix Moto, for example, can be ordered in a range of colours, including the likes of Charcoal, Electric Blue, Lava Orange, Sandstone or White. You can also order the Moto with the standard single-battery option if you don't need that 100-mile plus range.",
    "The Biktrix Moto is available now for $2,299 (about £1,670 / AU$2,976) from Biktrix.com for the single battery edition, while the dual battery model adds $599 to the asking price and costs $2,898 (about £2,103 / AU$3,751).",
    "Before you open your wallet though, make sure to check that the specs make it road-legal in your country. For example, the throttle design means it would be classed as a moped in the UK, where an electric bicycle is classed as a vehicle that's pedal-assisted and can't be powered by the motor alone."
  ],
  "headers": {
    "4": "Cargo space",
    "6": "Finishing touches"
  },
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Ribble Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "best electric bikes": "https://www.techradar.com/best/electric-bike",
    "Specialized Turbo Creo SL Expert": "https://www.techradar.com/reviews/specialized-turbo-creo-sl-expert",
    "Biktrix.com": "https://www.biktrix.com/pages/moto"
  }
}