{
  "source": "https://www.techradar.com/news/army-of-the-dead-see-how-tig-notaro-was-digitally-inserted-into-the-movie",
  "title": "Army of the Dead: see how Tig Notaro was digitally inserted into the movie",
  "category": "entertainment",
  "updated": "2021-06-07T08:09:15Z",
  "author": "stephen-lambrechts",
  "summary": "And witness the creation of a zombie tiger",
  "article": [
    "Of all the mind-blowing visual effects present in Zack Snyder's epic Netflix film Army of the Dead, perhaps the most impressive is the one that's seemingly invisible.",
    "We are, of course, talking about the decision to replace* one of the film's original actors (Chris D'Elia) with stand-up comedian Tig Notaro, who was added to the film well after principal photography had finished.",
    "That not only meant the digital erasure of D'Elia from the movie, but also the digital insertion of Notaro, who had to film most of her part alone in front of a green screen.",
    "During a recent interview with Stephen Colbert, Notaro noted that she has never met Army of the Dead's lead actor, Dave Bautista, despite sharing the majority of her scenes with him in the finished film.",
    "In an effort to show the world just how much of an undertaking this decision was, Netflix has released an Army of the Dead VFX reel which gives us a look at how Notaro was inserted into the film and what went into making her inclusion so seamless.",
    "The image above shows one such example, in which VFX artists were tasked with tweaking the lighting and glare surrounding Notaro in post in order to match the rest of the scene.",
    "You can check out the full video below, which also showcases Army of the Dead's many digital environments and gore gags, along with the creation of the film's zombie tiger.",
    "If the above video proves one thing, it's that Hollywood has made remarkable strides in the last few years when it comes to minimizing the impact of an actor being replaced following production.",
    "In 2017, director Ridley Scott made the decision to erase Kevin Spacey from his film, All the Money in the World, following sexual misconduct accusations levelled at the actor at the height of the #MeToo movement.",
    "Spacey was eventually replaced by Christopher Plummer, who would go on to receive an Academy Award nomination for Best Actor in a Supporting Role for his work in the film.",
    "Speaking to The Hollywood Reporter, Scott discussed the effort that went into replacing the actor. “I jumped into it immediately saying, ‘I can fix this. We’re going to have to recast, make sure everyone was available and the locations were available so I could go back as soon as possible and pick up every shot that [Spacey] was in.”",
    "By comparison, Snyder was able to film all of Notaro's scenes in Army of the Dead without having access to his previous locations or even the rest of his cast. It just goes to show how invaluable VFX tools have become, and will continue to be, in the filmmaking process.",
    "* D'Elia was accused in June 2020 of predatory behavior and inappropriate interactions with underage fans, charges which he denies."
  ],
  "headers": {
    "4": "Visual effects magic",
    "7": "A new watermark"
  },
  "links": {
    "recent interview": "https://www.youtube.com/watch?v=v9DkhGfa3iI",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/movies/movie-news/ridley-scott-reveals-how-kevin-spacey-was-erased-all-money-world-1068755/",
    "in June 2020 of predatory behavior and inappropriate interactions with underage fans": "https://en.wikipedia.org/wiki/Chris_D%27Elia#Sexual_misconduct_allegations"
  }
}