{
  "source": "https://www.techradar.com/news/goodbye-oculus-rift-s-we-wont-miss-you",
  "title": "Goodbye Oculus Rift S, we won’t miss you",
  "category": "computing",
  "updated": "2021-04-06T10:12:29Z",
  "author": "hamish-hector",
  "summary": "Long live Oculus Quest",
  "article": [
    "The end of the Oculus Rift S has finally arrived. Facebook has confirmed that it will no longer restock Oculus Rift S devices, so the only way to get one soon will be on the resale market.",
    "Back in September last year, Facebook announced its plans to discontinue the Oculus Rift S to focus on VR headsets that don’t require a PC. The Oculus Quest 2 is already showing Facebook’s plan is a good one, as in just over five months on sale the Quest 2 has sold better than all other Oculus headsets combined.",
    "If you already own an Oculus Rift S, there’s no need to replace it yet though. Facebook has previously promised to continue support for the VR headset after it is discontinued; there’s no reason to believe that promise will be broken anytime soon.",
    "The Oculus Rift S was a successor to the Oculus Rift, though in our review we saw it more of a half-step forward than a meaningful sequel. However the main draw of the Rift S wasn’t technical brilliance, it was price. Launching at $399, the Rift S was one of the cheapest mainstream options for people wanting to try VR, but even after dropping its price to $299 / £299 / AU$499 the Rift S didn’t see the same mainstream success as the Quest 2.",
    "We’d be willing to bet that it was because the Rift S still required a fairly beefy PC, one that’s likely to set you back another $1,000 / (around £720 / AU£1,312). At those kinds of prices, you can’t really call the Oculus Rift S ‘budget’.",
    "Facebook’s Oculus Quest 2 was able to live up to that label though, the $299 you pay for that system is all you need to pay to play VR. On top of that, you have a system that you can use wherever you want and can still plug into a PC if you want a different experience.",
    "It’s a shame to see the Oculus Rift S fade away, but its time has come. So long Rift S, now where’s that Oculus Quest 3?",
    "Via UploadVR"
  ],
  "headers": {
    "3": "Where did it all go wrong?"
  },
  "links": {
    "Oculus Rift S": "https://www.techradar.com/reviews/oculus-rift-s-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "sold better than all other Oculus headsets combined": "https://www.techradar.com/news/oculus-quest-2-sales-figures-prove-vr-has-finally-gone-mainstream",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "UploadVR": "https://uploadvr.com/rift-s-dead/"
  }
}