{
  "source": "https://www.techradar.com/news/this-new-jailbreak-threat-could-put-all-iphones-at-risk",
  "title": "This new jailbreak threat could put nearly all iPhones at risk",
  "category": "computing",
  "updated": "2021-03-01T16:03:00Z",
  "author": "mayank-sharma",
  "summary": "Jailbreak tool exploits a vulnerability that’s already been fixed",
  "article": [
    "Hackers have released a new jailbreaking tool for virtually all models of the iPhone by exploiting a now-fixed vulnerability.",
    "As with all jailbreaking tools, this new version, published by the serial jailbreaking hacking syndicate Unc0ver, allows users to break through Apple’s security controls usually in order to install apps that haven't been approved by the company.",
    "Interestingly, the latest tool makes use of the kernel vulnerability (tracked as CVE-2021-1782), which Apple fixed last month with the release of iOS 14.4.",
    "According to Unc0ver, the new jailbreak tool works on any iPhone that run iOS 11 to iOS 14.3, which was released in December last year. In other words, unless your mobile phone is running the latest version of iOS, the tool will work on all models from the iPhone 5S up.",
    "Apple is usually pretty quick to fix the vulnerabilities that allows hackers to bypass its security mechanisms and tap into the underlying software on its devices. In fact, the previous iOS jailbreak tool from the same group that worked on devices running iOS 11 to iOS 13.3, was rendered ineffective very quickly by the Cupertino-based technology company.",
    "In this latest instance, Apple has been one step ahead and has already fixed the vulnerability that’s used by the new jailbreak tool.",
    "There is a constant debate between jailbreakers and security researchers, each arguing about the merits and harms of breaking Apple’s security checks. While Apple’s controls might sound limiting, overruling them makes your device more prone to attacks and other kinds of exploits.",
    "Via: TechCrunch"
  ],
  "headers": {
    "3": "Already neutered"
  },
  "links": {
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "release of iOS 14.4": "https://www.techradar.com/news/ios-144-update-immediately-to-shield-against-security-threats-users-advised",
    "previous iOS jailbreak tool": "https://www.techradar.com/news/this-new-ios-jailbreak-tool-can-unlock-even-the-newest-iphones",
    "TechCrunch": "https://techcrunch.com/2021/03/01/hackers-unc0ver-jailbreak-iphone/"
  }
}