{
  "source": "https://www.techradar.com/news/1password-unveils-faster-sleeker-windows-password-manager",
  "title": "1Password unveils faster, sleeker Windows password manager",
  "category": "computing",
  "updated": "2021-11-16T17:30:10Z",
  "author": "anthony-spadafora",
  "summary": "New Knox design language gives 1Password 8 for Windows a fresh, modern design",
  "article": [
    "1Password has announced that the latest version of its password manager, which features a new design and enhanced security and privacy features, is now generally available for Windows.",
    "1Password 8 for Windows sports an all-new modern design and increased productivity capabilities to help users manage, store and protect their sensitive information more easily and securely than ever before.",
    "Over the past year, the company rolled out its first full-featured desktop version of 1Password for Linux followed by the early access releases for 1Password 8 for Windows and Mac. While 1Password's latest version of its password manager is now generally available for Windows, new updates to Mac, Linux and other operating systems are expected to arrive next year.",
    "Co-founder of 1Password Dave Teare provided further details on the company's latest release in a press release, saying:",
    "\"We've created an incredible foundation that powers our best version of 1Password for Windows yet, while setting us up for an exciting future. Our customers deserve the best, most polished experience when it comes to securing their personal information – our latest iteration of 1Password 8 for Windows delivers exactly that.\"",
    "1Password 8 for Windows features a modern design thanks to the company's new Knox design language which delivers a consistent, powerful and user-friendly experience with new item icons, detailed views for items and vaults and more across desktop, mobile and the web.",
    "The company's updated password manager is built using Rust and as a result, it offers improved speed and performance across all devices when searching, unlocking or managing items and vaults. At the same time, the new Item Catalog feature makes it more intuitive to search for, view or add items by guiding users through the creation process.",
    "1Password users can also immediately find and directly log into saved credentials and websites using Quick Access even when the 1Password app isn't open. The company has improved its browser extension as well with new capabilities including saving logins, creating strong and unique passwords with a password generator, an inline menu and a shared lock state between its app and browser extension.",
    "In terms of security, the Watchtower Dashboard helps users optimize the security of their sensitive information by identifying weak or compromised passwords inactive 2FA and more. 1Password 8 for Windows also includes a new item sharing feature called Psst! that allows users to clearly identify, manage and control sharing access even with non-1Password users.",
    "1Password 8 for Windows is available now and interested users can check out this blog post for even more information on the latest features included in this release.",
    "Looking to improve your security posture? Check out the best password managers, best identity theft protection and best malware removal software"
  ],
  "headers": {
    "5": "1Password 8 for Windows"
  },
  "links": {
    "1Password": "https://www.techradar.com/reviews/1password",
    "password manager": "https://www.techradar.com/best/password-manager",
    "1Password for Linux": "https://www.techradar.com/news/1password-expands-protection-to-linux-devices",
    "press release": "https://www.prnewswire.com/news-releases/1password-launches-1password-8--powering-the-best-of-windows-11-301425347.html",
    "Rust": "https://www.techradar.com/news/rust-for-windows-gets-major-update",
    "password generator": "https://www.techradar.com/best/password-generator",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "Psst!": "https://www.techradar.com/news/1password-now-lets-you-share-login-details-safely-with-a-link",
    "blog post": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6572253398698480000/https://blog.1password.com/1password-8-for-windows-is-here/",
    "best password managers": "https://www.techradar.com/best/password-manager",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "best malware removal software": "https://www.techradar.com/best/best-malware-removal"
  }
}