{
  "source": "https://www.techradar.com/news/disney-plus-devices",
  "title": "Disney Plus devices: what platforms can I watch Disney Plus on?",
  "category": "entertainment",
  "updated": "2021-11-29T07:43:26Z",
  "author": "daniel-pateman",
  "summary": "You're not just stuck with using a laptop or Smart TV, you know",
  "article": [
    "While it's still very much one of the newest streaming services on the market, Disney Plus is already a veritable giant, having racked up over 100 million subscribers in its first 18 months alone.",
    "It may or may not come as a surprise to you, then, than you can stream from Disney Plus on a huge range of devices – but if you're not sure if you're covered, we've got a comprehensive list of compatible tech below.",
    "There are myriad ways to watch Disney Plus, which makes it a seriously versatile VOD platform with widespread appeal, and with a library ranging from classics like The Simpsons to fascinating documentaries produced by National Geographic, there's a lot to like.",
    "If you have the Disney Plus app you could enjoy Disney Originals like The Mandalorian in 4K UHD quality on your smart TV, turn your PlayStation 5 into a multi-purpose entertainment console, or watch The Bad Batch on your iPhone or Android device on the commute to work.",
    "It’s incredibly easy to get your fix of Disney Plus. Just read on as we detail which devices are compatible with Disney Plus and how many you can stream to at any one time.",
    "Lots and lots! We lay out below which devices are compatible with Disney Plus and – space permitting – the particular models too.",
    "Web Browsers:",
    "Stream via your PC, laptop or Mac using the following:",
    "Check here for the specific browser version required to stream Disney Plus. If in doubt, update your browser to the most recent version.",
    "Mobile Devices and Tablets:",
    "Note that you have to install the application for Disney Plus first:",
    "If the Disney Plus app doesn’t come pre-installed, it will need to be downloaded from the relevant app store.",
    "Smart TVs:",
    "For Android TVs, this includes the Sharp AQUOS and Sony Bravia smart TVs, and TV set-top boxes like the NVIDIA SHIELD TV and Mi Box. The Disney Plus app is available from the Google Play Store.",
    "Any LG Smart TV from 2016 or later with WebOS 3.0 and up. Download app from LG content store is compatible.",
    "In terms of Roku TV, this includes support on the Element, Hisense, Hitachi, JVC, Philips, Sanyo, Sharp are among the many models, with the ability to add Disney Plus via the Roku Channel Store.",
    "If you own a Samsung Smart TV, Disney Plus will work on models 2016 and later, with HD video support, that use the Tizen OS. For Panasonic TVs, it's models 2017 and later, as long as they come with the My Home Screen OS.",
    "Connected TVs, Game Consoles, and Streaming Devices:",
    "Disney Plus supports all Fire TV devices and all Fire TV Edition Smart TVs (read here for how to set up the Amazon Fire TV Stick), while watching via Apple AirPlay requires Apple TV to be running tvOS 11.0 or higher. You'll need a 3rd or 4th generation Apple TV, or any TV compatible with AirPlay 2.",
    "For watching on Apple TV itself, a 4th generation model or later is required. For further guidance, read our Disney Plus on Apple TV guide.",
    "Those using Chromecast as a media streaming device will be able to cast from iOS, Android, and Google Chrome Web Browser devices. In turn, you'll be able to cast to devices including Google Chromecast V1 or later, Google Nest Hub, Google Nest Hub Max, Android TV devices, and Vizio Smart TVs with built-in Chromecast. Read here for more info on Disney Plus on Chromecast.",
    "Far fewer than there are compatible Disney Plus devices! But certain bits of tech haven’t yet been integrated with the Disney Plus app. And, as illustrated below, the older your device or OS, the less chance there is that it will be supported.",
    "You can download the streaming service's app to as many of your devices as you want. But! A single membership will only let you stream from four devices simultaneously.",
    "As our Disney Plus price comparison guide shows, that’s actually pretty brilliant considering the modest monthly fee ($7.99, or £7.99 in the UK, $11.99 in Canada, €8.99 in eurozone countries, and $11.99 in Australia). It's more than either Netflix, Amazon Prime Video, Hulu or HBO Max allow, yet less costly than all but Hulu. Plus, the monthly fee could potentially be split four ways...",
    "You can also download content to up to 10 mobile devices and watch offline, so you could squeeze even more value from the platform. As long as each device has sufficient storage space, there’s the potential for large households to have 10 members watching Disney Plus films or shows offline, downloaded over a Wi-Fi connection beforehand."
  ],
  "headers": {
    "5": "What devices can I watch Disney Plus on?",
    "21": "What devices can't I watch Disney Plus on?",
    "22": "How many devices can you have Disney Plus on?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Disney Plus app": "https://www.techradar.com/news/disney-plus-app",
    "The Mandalorian": "https://www.techradar.com/how-to/how-to-watch-the-mandalorian-online",
    "The Bad Batch": "https://www.techradar.com/news/how-to-watch-the-bad-batch-and-stream-new-star-wars-animated-series-online",
    "here": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1010781214279404500&sharedId=trd-us&u=https%3A%2F%2Fhelp.disneyplus.com%2Fcsp%3Fid%3Dcsp_article_content%26sys_kb_id%3Dd5ea605d1b030cd4b8651f861a4bcb7c",
    "how to set up the Amazon Fire TV Stick": "https://www.techradar.com/how-to/how-to-set-up-the-amazon-fire-tv-stick",
    "Disney Plus on Apple TV": "https://www.techradar.com/news/disney-plus-apple-tv",
    "Disney Plus on Chromecast": "https://www.techradar.com/news/disney-plus-chromecast",
    "Disney Plus price": "https://www.techradar.com/deals/disney-plus-price"
  }
}