{
  "source": "https://www.techradar.com/news/amd-ryzen-cpus-are-quickly-becoming-more-popular-with-gamers-on-steam",
  "title": "AMD Ryzen CPUs are quickly becoming more popular with gamers on Steam",
  "category": "computing",
  "updated": "2021-05-11T09:27:11Z",
  "author": "darren-allan",
  "summary": "Impressive growth for AMD since the start of 2021",
  "article": [
    "AMD is forging onwards and stealing yet more CPU turf from Intel according to the latest Steam hardware survey, with Team Red almost hitting a 30% market share.",
    "A figure of 29.54% CPU share as of April 2021 might not sound all that impressive on the face of it, but you have to put that in historical perspective, as AMD has made large gains over the past year – and even more impressive growth spurts since the start of 2021.",
    "Recall that in the May 2020 hardware survey from just under a year ago, AMD had a 22.46% market share, meaning that it has put on 7% since then (meaning that almost a third more folks now run with an AMD processor on Steam).",
    "Interestingly, adoption has spiked in a more pronounced manner recently, because it took until December 2020 for AMD to hit a 25% share of CPUs. This means that in the seven months through to December last year, AMD adoption picked up by just over 2.5%, but in the last four months from December to April, Intel’s rival has packed on a 4.5% gain – a considerable acceleration at the start of 2021.",
    "Aside from AMD’s increasing momentum in the desktop CPU sphere, the fresh stats for April 2021 also point to a gain in overall popularity for multi-core processors. 8-core CPUs now represent 12.77% of all processors used by Steam gamers, and 6-core processors are now at 30.5%.",
    "Add those two figures together, and not that far off half of all Steam denizens have a 6-core CPU or better, although there’s only a very small amount with processors above the 8-core level (just under 2%).",
    "The majority still own a quad-core CPU, or 40.98% of gamers to be precise. This increasing use of multi-core processors is something we’ve already highlighted recently, and it’s only likely to become more pronounced given the CPUs now used in contemporary consoles, which mean that game developers will be looking to make greater use of 8-core chips.",
    "Via Wccftech"
  ],
  "headers": {
    "4": "Cores and effect"
  },
  "links": {
    "CPU": "https://www.techradar.com/news/best-processors",
    "April 2021": "https://store.steampowered.com/hwsurvey/processormfg/",
    "AMD had a 22.46% market share": "https://www.techradar.com/news/amd-continues-to-steal-market-share-from-intel-according-to-latest-steam-survey",
    "something we’ve already highlighted recently": "https://www.techradar.com/news/6-core-and-8-core-cpus-are-surging-in-popularity-going-by-steam-data",
    "Wccftech": "https://wccftech.com/amd-ryzen-desktop-cpus-hit-30-share-steam-vs-intel-8-core-6-core-chips-gaining-popularity/"
  }
}