{
  "source": "https://www.techradar.com/news/apple-is-already-working-on-6g-tech-but-dont-expect-it-on-an-iphone-anytime-soon",
  "title": "Apple is already working on 6G tech – but don't expect it on an iPhone anytime soon",
  "category": "phones",
  "updated": "2021-02-19T10:39:50Z",
  "author": "axel-metz",
  "summary": "Because 5G is so last year",
  "article": [
    "With 5G speeds a winning feature of the iPhone 12 series, it seems as though Apple is already turning its attention to the future – by developing 6G connectivity.",
    "According to a job listing spotted by Bloomberg, the tech giant is looking to hire a slew of engineers to start working on burgeoning 6G wireless networking technology.",
    "The listing suggests Apple is seeking hires in its Silicon Valley and San Diego offices, and it reads, \"You will have the unique and rewarding opportunity to craft next generation wireless technology that will have a deep impact on future Apple products [...] In this role you will be at the center of a cutting-edge research group responsible for creating next generation disruptive radio access technologies over the next decade.\"",
    "The news follows Apple’s recent commitment to developing its own cellular modems for iPhone, iPad and other devices in-house, a move designed to reduce the company’s reliance on supply partners like Qualcomm.",
    "It seems a logical step, then, that Apple would now pursue the development of 6G technology given its increased independent research capabilities.",
    "It’s also worth noting that the company recently joined a 6G industry group called the Alliance for Telecommunications Industry Solutions (ATIS), suggesting a commitment to working with others to bring the technology to market.",
    "Of course, with 5G only made widely available as recently as 2019, 6G connectivity is still a long, long way off.",
    "Industry experts don’t expect to see the technology roll out for another decade, and it’s a fact Apple acknowledges in the job listing, but it’s clear that the tech behemoth wants to be ahead of the pack when it comes to developing 6G.",
    "In 2020, China successfully launched what it described as \"the world's first 6G satellite\" into space to test the technology, which gives you an idea of the development stage 6G is at right now.",
    "Notably, Apple’s approach to cracking the next generation of cellular technology somewhat bucks the trend of history. Typically, it’s not among the first smartphone companies to adopt new communication standards – it was relatively late to the 3G, 4G/LTE and 5G parties – so it’ll be interesting to watch the next few years with a close eye to see which other mobile giants join the race.",
    "If you’re interested to learn more about what 6G connectivity might entail, we’ve put together a handy round-up of everything we expect to see from the network speed of the future.",
    "Via Apple Insider"
  ],
  "headers": {
    "6": "Apple pie in the sky?"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "6G": "https://www.techradar.com/news/6g",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-02-18/apple-hiring-engineers-to-develop-6g-wireless",
    "\"the world's first 6G satellite\"": "https://www.bbc.co.uk/news/av/world-asia-china-54852131",
    "a handy round-up": "https://www.techradar.com/news/6g",
    "Apple Insider": "https://appleinsider.com/articles/21/02/18/apple-jumpstarting-6g-development-with-new-hires"
  }
}