{
  "source": "https://www.techradar.com/news/it-looks-like-macos-monterey-will-launch-with-its-best-feature-after-all",
  "title": "It looks like macOS Monterey will launch with its best feature after all",
  "category": "computing",
  "updated": "2021-10-14T11:37:48Z",
  "author": "matt-hanson",
  "summary": "Universal Control could make it after all",
  "article": [
    "When Apple revealed macOS 12 Monterey at its WWDC 2021 event back in June, Universal Control was easily one of the most impressive features shown off, allowing Mac users to seamlessly use an iPad as a second screen. Any keyboards, mice or touchpads connected to the Mac could also be used to control the iPad, and the demo they showed at the event showed an easy to set up the process that worked really well.",
    "So, when macOS 12 Monterey was released as an early preview, many people were keen to see how the feature worked. The problem was, Universal Control wasn’t included in the early version of Monterey, and even after several months and beta releases, it’s still not appeared.",
    "This has led many people to doubt that Universal Control will appear when macOS Monterey is officially launched, which could be as soon as next week, with Apple hosting an event on October 18.",
    "However, as 9to5Mac reports, Universal Control has appeared in macOS Monterey beta 10. While that’s a promising start, people still can’t use it. However, it can be enabled by going into System Preferences, where a new entry for Universal Control appears. However, the feature is also labeled ‘Beta’, indicating that the feature is unfinished and may not work correctly.",
    "The fact that Universal Control has finally appeared in an early version of macOS Monterey makes it slightly more likely that it’ll be there when the operating system launches. Until recently, there was no sign of Universal Control, which didn’t bode well for the feature.",
    "It appears that Apple may have had more problems getting Universal Control to work, which is why it was not made available to people testing out early versions of macOS 12.",
    "However, it’s likely that macOS Monterey will launch in a few days, so the fact that the feature has only just arrived, and is being labeled as ‘Beta’, means that if it launches with macOS 12, the feature may not be entirely finished.",
    "If that’s the case, then Apple may be better off leaving it out until it can fix whatever issues it’s encountering, then including it in a future macOS Monterey update.",
    "While we can’t wait to try out the feature, we’d rather wait a little bit longer than have to put up with a potentially bug-filled early version of Universal Control. First impressions are essential, so if users try out Universal Control in this unfinished state and get frustrated by any bugs or issues, it could put them off using the feature for good, even if it gets updated later on. That would be a real shame.",
    "So, while we hope to see Universal Control included with macOS Monterey next week, Apple may still be better off leaving the feature until later. Initial disappointment at it not being included will be less damaging in the long run than continued frustration and disappointment at an unfinished product."
  ],
  "headers": {
    "4": "Analysis: Will Universal Control launch with macOS 12 Monterey?"
  },
  "links": {
    "macOS 12 Monterey": "https://www.techradar.com/news/macos-12",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Apple hosting an event on October 18": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "9to5Mac reports": "https://9to5mac.com/2021/10/13/universal-control-now-labeled-as-beta-ahead-of-macos-monterey-official-release/#more-760917"
  }
}