{
  "source": "https://www.techradar.com/news/galaxy-z-fold-3-and-galaxy-z-flip-2-colors-features-and-more-leaked",
  "title": "Galaxy Z Fold 3 and Galaxy Z Flip 2 colors, features and more leaked",
  "category": "phones",
  "updated": "2021-03-17T11:18:58Z",
  "author": "axel-metz",
  "summary": "Including splash resistance",
  "article": [
    "Fresh leaks have shed new light on what to expect from Samsung’s upcoming foldable phones, including their colors, features and more.",
    "We’ve already heard rumors that the Galaxy Z Flip 2 – likely to be the company’s next clamshell foldable – will be available in 128GB and 256GB storage options and come running Android 11, while the Galaxy Z Fold 3 – expected to be Samsung’s new tablet-sized foldable – will come equipped with the same OS and a higher storage capacity.",
    "But now we’ve got a better idea of the colors both devices will arrive in, too. A recent SamMobile report suggests the Galaxy Z Flip 2 will be launched in a handful of new colors, including light violet, green, black and beige, while the Galaxy Z Fold 3 will arrive in a choice of black or green.",
    "There’s likely to be additional color options available when the phones officially launch, but these are the first color-based rumors we’ve heard regarding Samsung’s upcoming foldables.",
    "It’s worth noting that we don’t know for sure what the Galaxy Z Flip 2 will be called. We’ve heard conflicting reports that the device might in fact be called the Galaxy Z Flip 3 (since a 5G version of the Galaxy Z Flip followed the original and is considered by some to be the Z Flip 2 in all but name), but we do expect it to be officially labeled as either the second or third model in the Z Flip range.",
    "In terms of new features coming to the devices, we’ve also learnt that the Galaxy Z Fold 3 will likely become the first of Samsung’s foldable phones to offer some degree of water resistance.",
    "According to fresh rumors from leaker @chunvn8888, the Z Fold 3 won’t have an IP rating – the international standard for how well sealed a device's electrical parts are from the elements like dirt, dust and moisture – but it will be splash resistant.",
    "Of course, that doesn’t mean you’ll be able to submerge the phone in the bath like you could with, say, an iPhone 12, but this nonetheless represents an improvement over its predecessor, which was particularly prone to spill-related damage given its exposed hinge.",
    "We’ll know more about both the Galaxy Z Fold 3 and Galaxy Z Flip 2 (or 3?) when the devices officially launch – likely sometime in 2021 – but in the meantime we'll keep you updated with all the leaks and rumors as they emerge."
  ],
  "headers": {
    "5": "Foldable and durable"
  },
  "links": {
    "Galaxy Z Flip 2": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "SamMobile": "https://www.sammobile.com/news/exclusive-new-galaxy-z-flip-galaxy-z-fold-colors/",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "rumors": "https://twitter.com/chunvn8888/status/1371836296881131531?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1371836296881131531%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.sammobile.com%2Fnews%2Fwater-splash-proofing-foldables-could-debut-with-galaxy-z-fold-3%2F",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12"
  }
}