{
  "source": "https://www.techradar.com/news/how-to-watch-mare-of-easttown-online-stream-the-new-series-where-you-are",
  "title": "How to watch Mare of Easttown: stream the final episode of Kate Winslet's new series online",
  "category": "entertainment",
  "updated": "2021-05-28T15:34:43Z",
  "author": "daniel-pateman",
  "summary": "Kate Winslet plays a troubled detective in new mystery thriller",
  "article": [
    "Making her return to TV after nearly a decade, Kate Winslet stars in Mare of Easttown. An American crime drama about a slow-paced town in dreary Pennsylvania, something is triggered when the body of a teenage girl is found.",
    "Originally released on HBO Max, the 7-part limited series is drawing to an end in both the US and UK. Make sure you know how to watch Mare of Easttown online where you are, and catch the climax of Mare Sheehan as her investigation comes to a close.",
    "Starring Guy Pearce and Evan Peters alongside Winslet, Mare Sheehan attempts to eclipse her former glory of helping to win a high school basketball championship as the lead police investigator in the murder case.",
    "Written by Brad Ingelsby (Run All Night) and directed by Craig Zobel (The Hunt), Mare of Easttown sees Mare Sheehan thrust back into the limelight when a body washes up in Creedham Creek. She’s determined to find the killer. However, she’s haunted by her past, the high expectations of the community, and an unsolved missing person’s case from years ago.",
    "But, with the help of Colin Zabel (Evan Peters), a county detective jointly assigned to the case, long-buried secrets begin to come to light. Also featuring John Douglas Thompson as Chief Carter, Jean Smart as Mare’s mother Helen, Julianne Nicholson (The Outsider), and David Denman as ex-husband Frank Sheehan, Mare of Easttown is an expertly written drama, brilliantly acted and brimming with danger.",
    "So if you loved crime thrillers The Undoing and Big Sky, you’ll want to know how to watch Mare of Easttown online, which we explain in the guide below."
  ],
  "headers": {
    "6": "How to watch Mare of Easttown online in Australia for free"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "The Undoing": "https://www.techradar.com/news/how-to-watch-the-undoing-online-stream-the-new-hbo-series-from-anywhere",
    "Big Sky": "https://www.techradar.com/news/how-to-watch-big-sky-online-stream-the-all-new-abc-tv-show-from-anywhere-today"
  }
}