{
  "source": "https://www.techradar.com/news/how-to-watch-movies-free-the-best-free-streaming-sites-for-movies-and-tv-today",
  "title": "How to watch movies free: the best free streaming sites for movies and TV today",
  "category": "computing",
  "updated": "2021-04-08T11:35:10Z",
  "author": "mo-harber-lamond",
  "summary": "No subscription? No problem",
  "article": [
    "It used to be so easy – just switch on your TV and pick a channel. Now, although we've got a far wider range of movies and TV to pick from, it seems like you've got to pick between dozens of expensive services just to watch a single show.",
    "It's not all bad, though – there are actually tons of 100% legal free streaming sites for movies and TV out there if you know where to find them. It is worth noting, however, that not all of these free streaming sites are available worldwide, so if you're outside of your home country and want to access the free movies you're used to, you may have to use a VPN.",
    "But, no matter where you are, there are plenty of totally free options. So, if you're wondering how to watch movies free online, all you need to do is take your pick from the following choices.",
    "Which free streaming site you choose to use is likely to be decided by where you live – for example, Americans will be more likely to head over to Peacock than BBC iPlayer.",
    "However, if you're outside your home country and want to watch movies free on the sites you're used to, you'll likely notice that the website is blocked. There's a quick and easy way to get around that, though.",
    "Using a streaming VPN is the simplest way of getting access to your favorite sites when you're abroad. All you need to do is select a server in a country of your choice, connect, and start watching.",
    "We recommend ExpressVPN thanks to its unparalleled streaming performance and wide range of locations, and it's great for accessing the free streaming sites below.",
    "So if, for example, you wanted to watch Peacock and you're currently outside the US, all you need to do is connect to a US VPN server and head over to the site. It's as simple as that.",
    "When it comes to a free streaming services, BBC iPlayer is arguably the very best available. With a huge repository of BBC content and an ever-changing catalogue of both modern and classic movies, whatever your mood there's bound to be something that will take your fancy.",
    "Series currently on offer are the excellent I May Destroy You, the Ridley Scott-produced The Terror, and the only motoring show worth watching, Top Gear. Plus, there's also a wide range of kids TV, and even live streams of the terrestrial BBC channels.",
    "Movies on offer are also strong – we've seen the likes of Apocalypse Now, The Godfather, Citizen Kane, Dunkirk and loads more out-and-out classics on there in recent times. The best ones tend to leave after 30 days, but there's usually something pretty great ready to replace them.",
    "There's often a bit of a Brit slant to the content, but if you want to watch movies free online, it's a great place to start. Do note, though, that viewers should be licence fee payers to watch.",
    "It probably comes as no surprise, but NBC's Peacock is one of the best free streaming sites around. Launched in 2020, Peacock gained huge popularity for having a comprehensive ad-supported free library, and it's now one of the most-watched streaming services in the US.",
    "An obvious draw is the most-streamed series of all time, The Office, but Peacock also delivers with a huge range of feature-length classics.",
    "In Bruges, Drag Me To Hell, Eternal Sunshine of the Spotless Mind, The Deer Hunter, the first three Harry Potter movies... All of these and more are available for absolutely free, and while there's an even greater selection if you sign up to the premium plan, there's plenty to go around.",
    "Again, though, if you're currently outside the US you won't be able to watch Peacock. But if you use one of our best Peacock VPN choices, you'll be able to change your location back home and watch free movies anywhere.",
    "While Sling might be best known for its great-value paid plans, it also offers a free tier that's competitive with the very best.",
    "Unlike many of the US services on this list, Sling offers free streams of live news (something those in the UK will take for granted), so if you want to stay up to date on what's happening in the world, you might want to head over to Sling.",
    "What's more, there's absolutely no sign up required – all you need to do is head over to the site and start watching. You'll get over 5000 episodes of favorites such as Hell's Kitchen, the original Johnny Depp-starring 21 Jump Street, select episodes of Rick and Morty, and all 11 seasons of the original UK Shameless.",
    "Of course, you can upgrade and fully cut the cord for just $25 a month – but if you're just a casual watcher, you may well get away with going for the free plan.",
    "Again, though, if you're outside the US, you'll need to use a VPN to get access to all this great free content.",
    "Second only to BBC iPlayer when it comes to British streaming, All4 is Channel 4's online streaming service. Known for being a little 'edgier' than the BBC, Channel 4 produces some of the most compelling TV in the UK – and it's all free.",
    "Plus, thanks to its close links with Film4, All4 has a huge range of both blockbuster and more arthouse feature-length content.",
    "Much like iPlayer, the films available come and go. But at the time of writing movies to check out included Irvine Welsh adaptations Trainspotting and The Acid House; Nico, 1998, which details the later years of the singer's life (well after her time with the Velvet Underground); entertaining Danny Dyer flick The Business; and historical drama Peterloo.",
    "Like iPlayer, All4 is only available to those in the UK, so if you're out of the country, a VPN will be necessary to watch.",
    "With a crisp, clean interface and absolutely no sign-up required, Tubi is a great place to watch movies free online.",
    "With some surprisingly big features like World War Z, Madagascar, Interstellar, Battle Royale, and Ghost in the Shell to name a few, there might be more on offer here than you bargained for.",
    "The full Tubi catalogue is only available to those in the US, so if you fancy exploring what's on offer, you need to change your location to the states with a VPN.",
    "Previously part of Sony and now owned by Chicken Soup for the Soul, Crackle is a slightly less-known free streaming service that boasts a host of excellent free movies and TV shows.",
    "With A-list movies like The Hurt Locker and The Grudge, and some somewhat lower-brow offerings like Big Ass Spider!, the selection is somewhat hit and miss, but it's definitely worth a browse to see what's on offer.",
    "Available in the US, Canada, and a variety of Latin American countries, Crackle has good coverage. However, if you're out of the Americas in Europe or elsewhere, you'll need to fire up your VPN."
  ],
  "headers": {
    "3": "How to watch movies free anywhere",
    "8": "1. BBC iPlayer",
    "12": "2. Peacock",
    "16": "3. Sling TV Free",
    "21": "4. All4",
    "25": "5. Tubi",
    "28": "6. Crackle"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "streaming VPN": "https://www.techradar.com/vpn/the-best-vpn-for-streaming",
    "US VPN": "https://www.techradar.com/vpn/us-vpn-usa",
    "Peacock": "https://www.techradar.com/reviews/peacock-tv",
    "sign up to the premium plan": "https://imp.i305175.net/c/221109/828265/11640?subId1=trd-us-1038619803467506000&sharedId=trd-us&u=https%3A%2F%2Fwww.peacocktv.com%2F",
    "best Peacock VPN": "https://www.techradar.com/vpn/best-peacock-vpn",
    "free tier that's competitive with the very best": "https://sling-tv.pxf.io/c/221109/1132376/14334?subId1=trd-us-7181039797327977000&sharedId=trd-us&u=https%3A%2F%2Fwww.sling.com%2Fdeals%2Fsling-free",
    "just $25 a month": "https://sling-tv.pxf.io/c/221109/1132376/14334?subId1=trd-us-3476365916688636000&sharedId=trd-us&u=https%3A%2F%2Fwww.sling.com%2F",
    "a VPN will be necessary to watch": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-3626545951272173000"
  }
}