{
  "source": "https://www.techradar.com/news/google-stadia-is-getting-more-than-100-games-this-year-including-fifa-21",
  "title": "Google Stadia is getting more than 100 games this year, including FIFA 21",
  "category": "gaming",
  "updated": "2021-02-17T17:16:34Z",
  "author": "axel-metz",
  "summary": "Finally, a proper library",
  "article": [
    "More than 100 games are coming to Google Stadia in 2021, the company has confirmed.",
    "The cloud streaming service has been hampered by a lack of titles in recent months, despite being lauded for its surprisingly good performance as an on-the-go gaming platform.",
    "Now, Google has confirmed the likes of FIFA 21 (March 17), Judgment (April 23) and Shantae: Half-Genie Hero Ultimate Edition (February 23) will all arrive at different points throughout the year.",
    "Street Power Football, Killer Queen Black and Hellpoint are also on the way with unspecified release dates, along with “more than 100” other games in 2021. Google says players can expect to see “everything from action-filled RPGs to competitive co-op titles and nimble platformers” in the coming months.",
    "The announcement will come as a major shot in the arm for a platform that has endured a rocky road since its release in November 2020.",
    "We recently reported that Google plans to shut down its internal development studio and divert all resources to enticing third-party developers to launch games on the platform. “Creating best-in-class games from the ground up takes many years and significant investment, and the cost is going up exponentially,” Google said in a blog post explaining the decision.",
    "Now, after little detail on when or what games would arrive on the Stadia platform, we’ve got a better idea of the sort of titles expected to arrive in 2021.",
    "Google has also confirmed that its cloud gaming service will arrive pre-installed on all new Chromebook laptops, suggesting a hope that this will translate into a big increase in the Stadia player-base over the next few years.",
    "Could this mean a new lease in the (very short) life of Google Stadia? With easy accessibility to the platform and a host of new games to look forward to, it’s certainly looking that way.",
    "Via Gamespot"
  ],
  "headers": {
    "4": "Shot in the arm"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "has confirmed": "https://community.stadia.com/t5/Stadia-Community-Blog/Next-up-on-Stadia-Adventure-explore-and-compete-in-9-games/ba-p/53677",
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "recently reported": "https://www.techradar.com/news/google-closes-game-development-studios-but-promises-stadia-will-go-on",
    "blog post": "https://blog.google/products/stadia/focusing-on-stadias-future-as-a-platform-and-winding-down-sge/",
    "arrive pre-installed": "https://www.techradar.com/news/google-stadia-will-now-come-pre-installed-on-all-new-chromebooks",
    "Gamespot": "https://www.gamespot.com/articles/google-stadia-getting-more-than-100-games-in-2021/1100-6487545/?ftag=CAD-01-10abi2f"
  }
}