{
  "source": "https://www.techradar.com/news/the-first-sonos-headphones-could-arrive-soon-with-new-product-confirmed-for-march",
  "title": "The first Sonos headphones could arrive soon with new product confirmed for March",
  "category": "audio-visual",
  "updated": "2021-02-11T12:47:32Z",
  "author": "olivia-tambini",
  "summary": "Or perhaps a new version of the Sonos Move?",
  "article": [
    "Sonos is set to launch a new product in March, according to a conference call between CEO Patrick Spence and investors.",
    "In the call, which was transcribed by Seeking Alpha, Spence said that the company remains committed to launching \"at least two new products per year\", and that \"we are excited to introduce our newest product next month\".",
    "What that new product will be remains to be seen, but with rumors of the first pair of Sonos headphones and a cheaper, smaller version of the Sonos Move being bandied about, we can't wait to find out.",
    "We've reached out to Sonos to see if we can find any more information on the new products – but in the meantime, let's take a deep dive into the rumored headphones and wireless speaker.",
    "Rumors about a pair of Sonos headphones have been circling for a while now, first emerging in early 2019.",
    "According to a report from Bloomberg, the headphones will likely have multiple virtual assistants that would function similarly to the company's Sonos Arc and Sonos One speakers, and would focus on competing with Sony, Apple, Bose and Sennheiser by offering high-end audio performance.",
    "Bloomberg’s sources also suggested that Sonos could target a price point of around $300 (£200 / AU$400) – cheaper than the Sony WH-1000XM4, but not by much – and would launch in 2020.",
    "Of course they never materialized, so a March 2021 release is feasible, especially if Sonos wants to compete with the recently launched Apple AirPods Max over-ear headphones.",
    "Compounding these rumors is the fact that Sonos was awarded a patent fairly recently for a pair of over-ear headphones, giving us an intriguing glimpse at the long-rumored cans.",
    "As well as showing off two possible designs, the patent describes features like active noise cancellation, wireless connectivity, and built-in microphones for voice-controlled music playback.",
    "Most interestingly, the patent also describes how the first Sonos headphones would interact with other Sonos products, allowing them to seamlessly integrate with existing multi-room audio setups – something that the likes of Sony, Sennheiser, and Bose can’t offer.",
    "Another possibility is that Sonos will launch a new wireless speaker, with rumors that the company is due to launch a companion to its portable Sonos Move smart speaker.",
    "The Sonos Move is currently the only product in the company's lineup that sports a Bluetooth connection and built-in battery, giving you the cleverness of a built-in voice assistant with the convenience of a portable speaker.",
    "An FCC filing spotted by The Verge describes a device that uses a wireless charging base but requires less power than the company's Move speaker, suggesting a similar portable smart speaker that's even more compact.",
    "The Sonos Move currently costs $399 / £399 /AU$649 – a price that puts it firmly at the top end of the Bluetooth speaker market – but it earns this price tag with its array of Sonos smarts and its powerful audio.",
    "As such, there's certainly room in the market for a more compact version of this speaker that still offers the same smarts but packs them into a smaller, more affordable, and more lightweight package (the Move weighs about 3kg).",
    "Once again, this would put Sonos in direct competition with Apple, which released the HomePod mini in 2020, though this smaller, cheaper version of the Apple HomePod smart speaker isn't portable.",
    "Its release, as well as the refreshed Echo Dot and Google Nest Audio, does suggest that there's a demand for more compact wireless speakers in the home – and Sonos could meet that demand in a matter of weeks. Watch this space."
  ],
  "headers": {
    "4": "Multi-room headphones"
  },
  "links": {
    "Seeking Alpha": "https://seekingalpha.com/article/4405088-sonos-inc-s-sono-ceo-patrick-spence-on-q1-2021-results-earnings-call-transcript",
    "Sonos headphones": "https://www.techradar.com/news/sonos-wireless-headphones-what-we-know-about-the-rumored-sony-wh-1000xm4-rivals",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "early 2019": "https://www.techradar.com/news/sonos-first-headphones-are-rumored-to-be-wireless-and-high-end",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2019-01-24/sonos-is-said-to-plan-headphones-in-move-outside-the-home",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "FCC filing": "https://fccid.io/SBVRM027",
    "The Verge": "https://www.theverge.com/2021/2/5/22269050/sonos-fcc-filing-mini-move-portable-bluetooth-speaker",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Google Nest Audio": "https://www.techradar.com/reviews/google-nest-audio"
  }
}