{
  "source": "https://www.techradar.com/news/stalkerware-cases-are-seeing-a-huge-rise",
  "title": "Stalkerware cases are seeing a huge rise",
  "category": "computing",
  "updated": "2021-06-24T21:41:27Z",
  "author": "anthony-spadafora",
  "summary": "More and more smartphones are being infected with stalkerware apps",
  "article": [
    "As our daily lives have become increasingly connected through smartphones and social media, more than half of young people in the US and UK have stalked an ex or current partner online according to a new study from NortonLifeLock.",
    "These new findings have been published as a special addendum to the antivirus maker's 2021 Norton Cyber Safety Insights Report (PDF). To compile its report designed to assess online habits and determine whether they cross the line into cyber stalking, NortonLifeLock partnered with The Harris Poll to survey over 10,000 adults over 18 across 10 countries including 1,000 adults from both the US and UK.",
    "According to the report's findings, three in five Gen Z and Millennial adults that have been in a relationship admit to 'stalking' an ex or current partner online by checking in on them without their consent. Even more alarming though is the fact that two in five of these younger Americans and (42%) believe their significant other is at least somewhat likely to download and install stalkerware apps on their devices. Findings were similar in the UK where 38 percent of those surveyed believe their partner may install stalkerware or creepware on their smartphone.",
    "Stalkerware apps have been out of control since the pandemic began according to a recent report from Avast and these invasive apps are downloaded on an unsuspecting user's device and then used to monitor online activity including text messages, phone calls, direct messages, emails and photos.",
    "NortonLifeLock's study sows that more than one-third (35%) of Americans and Britons ages 18-39 believe stalking a current or former partner online is harmless while just one in ten Americans and Britons over the age of 40 agree.",
    "While many couples spent an increased amount of time together while in lockdown during the pandemic, the most common online stalking behaviors remain the same and include checking a current or former partner's phone (19%) and reviewing their search history on one of their devices without their knowledge (16%). While not as dangerous as stalkerware due to how those apps can track a user's location, this type of behavior can have serious implications on a couple's relationship and the safety of the partner or ex being stalked.",
    "Technical director and stalkerware specialist at NortonLifeLock's research division Kevin Roundy provided further insight on the recent rise in stalkerware and cyber stalking in a press release, saying:",
    "“We issue warnings to customers alerting them of potential stalkerware apps on their devices, and our latest threat telemetry shows that use of this invasive technology is steadily climbing. Between September 2020 and May 2021, our research team found a 63% uptick in the number of devices infected with stalkerware; amounting to more than 250,000 compromised devices.”",
    "If you're concerned that someone may have installed stalkerware on your smartphone or other devices, Roundy recommends that you check your settings and permissions to see if any unknown apps have access to your location or microphone."
  ],
  "headers": {
    "4": "Rise in stalkerware"
  },
  "links": {
    "NortonLifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "2021 Norton Cyber Safety Insights Report": "https://now.symassets.com/content/dam/norton/campaign/NortonReport/2021/2021_NortonLifeLock_Cyber_Safety_Insights_Report_Global_Results.pdf",
    "The Harris Poll": "https://www.techradar.com/news/americans-overestimate-their-understanding-of-internet-security",
    "stalkerware apps": "https://www.techradar.com/news/android-stalkerware-may-be-even-more-dangerous-than-thought",
    "creepware": "https://www.techradar.com/news/google-removed-a-whole-host-of-creepware-from-the-play-store",
    "out of control since the pandemic began": "https://www.techradar.com/news/stalkerware-has-been-out-of-control-since-the-pandemic-began",
    "Avast": "https://www.techradar.com/reviews/avast-2020-antivirus-solutions",
    "press release": "https://investor.nortonlifelock.com/About/Investors/press-releases/press-release-details/2021/Norton-Special-Report-Finds-Young-Americans-Are-Twice-as-Likely-to-Cyber-Stalk/default.aspx"
  }
}