{
  "source": "https://www.techradar.com/news/windows-powertoys-edges-closer-to-solving-the-most-common-video-conferencing-problem",
  "title": "Windows PowerToys edges closer to solving the most common video conferencing problem",
  "category": "computing",
  "updated": "2021-10-20T12:27:28Z",
  "author": "joel-khalili",
  "summary": "PowerToys will give Windows users an easy way to cut their video and microphone feeds",
  "article": [
    "Microsoft has launched the latest experimental version of its PowerToys utility suite for Windows 10 and 11, which lays the foundation for a new video conferencing tool.",
    "As with previous experimental releases, PowerToys v.0.48.1 previews the much-anticipated Video Conference Mute facility, which gives users the ability to quickly cut their microphone and webcam with “Win+N” (the universal mute button in Windows 11 deals only with the mic).",
    "It also delivers a fix for an issue with the new utility, which was causing keyboard shortcuts to be reassigned without cause.",
    "Being an unstable release, however, Microsoft says there are a number of problems users should be aware of before diving in.",
    "For example, the Video Conference Mute tool is currently incompatible with some webcams when running Microsoft Teams, and the PowerToys app needs to be restarted for any settings changes to take effect.",
    "PowerToys is an open source suite of tools for advanced Windows users, designed to help bypass certain settings and perform actions that are unavailable by default. It also gives people a wider range of customization options.",
    "The utility library includes tools such as Color Picker, which copies color data from any running application to the clipboard, and Fancy Zones, which lets users create complex window layouts specifically suited to their applications.",
    "Others, like Image Resizer and PowerRename, help Windows users perform common actions with greater ease and speed, maximizing productivity.",
    "Although the latest stable PowerToys releases (the most recent of which is v0.47.1) have been designed solely to rectify bugs and performance issues, the forecast looks promising for those awaiting new utilities. According to a recent tweet from Clint Rutkas, who heads up the project at Microsoft, the team is “quickly approaching stability” and new toys (like Video Conference Mute) are on the way.",
    "In a second tweet, meanwhile, Rutkas offered an early glimpse of another new utility under development, one that is not currently recorded on the public list of upcoming toys.",
    "“Insane resolution? Multi-mon? Keep losing the cursor? We got you,” he wrote, before appending the hashtag “#comingsoon”."
  ],
  "headers": {
    "5": "New PowerToys tools"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "webcams": "https://www.techradar.com/best/best-business-webcams",
    "tweet": "https://twitter.com/ClintRutkas/status/1450684236977950727"
  }
}