{
  "source": "https://www.techradar.com/news/data-protection-watchdog-claims-zoom-is-incompatible-with-gdpr",
  "title": "Data protection watchdog claims Zoom is incompatible with GDPR",
  "category": "computing",
  "updated": "2021-08-18T20:31:35Z",
  "author": "anthony-spadafora",
  "summary": "Sending data to non-EU countries has become increasingly complicated following last year's Schrems II decision",
  "article": [
    "A data protection watchdog in Germany has warned the Senate Chancellery of Hamburg to avoid using Zoom as its video conferencing software is now incompatible with the EU's GDPR.",
    "In a new press release from Ulrich Kühn, the acting Hamburg Commissioner for Data Protection and Freedom of Information has warned members of the German government not to use the on-demand version of Zoom as reported by The Register.",
    "In his plea to government officials, Kühn refers to the European Court of Justice Schrems II decision which prevents businesses in the EU from carrying out data transfers to non-EU businesses. He goes on to claim that using Zoom violates GDPR as the software transmits personal data to the US.",
    "Back in July of last year, the EU Court of Justice struck down the Privacy Shield data protection arrangement between the EU and US which has led to a great deal of legal confusion for EU businesses working with companies in the US.",
    "In a paper about data transfers from the EU to the US, Zoom explains that it will sign Standard Contractual Clauses (SCCs) with customers in Europe as well as take additional safeguards to protect their data in such a way that it lives up the the standards laid out under GDPR.",
    "While this will likely work for most EU businesses, Kühn made the point that government organizations in Germany already have access to video conferencing systems from Dataport which are fully in compliance with the EU's data protection laws, saying:",
    "“In the FHH, all employees have access to a tried and tested video conference tool that is unproblematic with regard to third-country transmission. As the central service provider, Dataport also provides additional video conference systems in its own data centers. These are used successfully in other countries such as Schleswig-Holstein. It is therefore incomprehensible why the Senate Chancellery insists on an additional and legally highly problematic system.\"",
    "The fact that Zoom is easy to use and quick to launch could be one of the reasons members of the Senate Chancellery of Hamburg have made it their preferred video conferencing solution despite already have access to Dataport's video conferencing systems.",
    "TechRadar Pro reached out to Zoom regarding the matter and a company spokesperson provided the following statement:",
    "“Zoom is proud to work with the City of Hamburg and many other leading German organizations, businesses and education institutions. The privacy and security of our users are top priorities for Zoom, and we take seriously the trust our users place in us. Zoom is committed to complying with all applicable privacy laws, rules, and regulations in the jurisdictions within which it operates, including the GDPR.”",
    "Via The Register"
  ],
  "headers": {
    "4": "Zoom and GDPR"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "press release": "https://translate.google.com/translate?sl=auto&tl=en&u=https://datenschutz-hamburg.de/pressemitteilungen/2021/08/2021-08-16-senatskanzlei-zoom",
    "reported": "https://www.theregister.com/2021/08/17/zoom_incompatible_with_gdpr_hamburg_warning/",
    "Schrems II": "https://www.techradar.com/news/the-compliance-conundrum-facing-regulation-in-the-covid-era",
    "Privacy Shield": "https://www.techradar.com/news/eu-rejects-us-data-sharing-agreement-over-privacy-concerns",
    "paper": "https://zoom.us/docs/doc/EEA_Transfer_of_Data.pdf",
    "SCCs": "https://www.techradar.com/news/data-protection-tasks-you-need-to-complete-post-brexit",
    "The Register": "https://www.theregister.com/2021/08/17/zoom_incompatible_with_gdpr_hamburg_warning/"
  }
}