{
  "source": "https://www.techradar.com/news/samsung-galaxy-book-pro-360-2-in-1-laptop-is-a-steal-with-dollar550-off-for-black-friday",
  "title": "Samsung Galaxy Book Pro 360 2-in-1 laptop is a steal with $550 off for Black Friday",
  "category": "computing",
  "updated": "2021-11-19T12:14:07Z",
  "author": "darren-allan",
  "summary": "Premium convertible at a not so premium price",
  "article": [
    "Samsung’s Galaxy Book Pro 360 is a stylish premium laptop with a huge discount from the manufacturer as an early Black Friday deal.",
    "Normally, higher-end models of this 2-in-1 notebook can get pretty pricey, and the 15-inch Core i7 version here normally weighs in at $1,499.99, but Samsung has slashed that by $550, meaning this Pro 360 now costs $949.99.",
    "To be precise, this is the ‘mystic navy’ color 15.6-inch model with an Intel Core i7-1165G7 quad-core (8-thread) processor and Iris Xe integrated graphics. It has 16GB of system RAM and a 1TB SSD.",
    "The 15.6-inch AMOLED screen has a Full HD resolution and is nicely bright, offering great color reproduction and contrast levels (we enthused about the display in our review, as well as the expansive and high-quality keyboard, among other positive points).",
    "This is a 360-degree hybrid, meaning the keyboard deck can fold right around to be flat against the display so the Samsung Galaxy Book Pro 360 can be used as a thick tablet, and it’s a lightweight device as you might imagine.",
    "Despite the portability (and flexibility) of this device, that 11th-gen Core i7 CPU is going to give you plenty of power for everyday computing tasks – and a spot of light gaming – plus you also get a claimed battery life of 21 hours. (In our testing, we didn’t achieve that, but any longevity figure is based on workload, of course, and we certainly found this 2-in-1 would last a whole workday, and more).",
    "For the money, you’re getting a lot of laptop here, that much is for sure.",
    "(Not in the US? Scroll down for deals in your region).",
    "No matter where you live, you'll find all the lowest prices for the Samsung Galaxy Book Pro 360 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "8": "More Samsung Galaxy Book Pro 360 2-in-1 laptop deals",
    "9": "More Black Friday deals"
  },
  "links": {
    "early Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "meaning this Pro 360 now costs $949.99": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-7525759853067394000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fcomputing%2Fgalaxy-books%2Fgalaxy-book-pro-360%2Fgalaxy-book-pro-360--15---1tb--mystic-navy-np950qdb-kb1us%2F&article_name=Samsung%20Galaxy%20Book%20Pro%20360%202-in-1%20laptop%20is%20a%20steal%20with%20%24550%20off%20for%20Black%20Friday&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-book-pro-360-2-in-1-laptop-is-a-steal-with-dollar550-off-for-black-friday",
    "review": "https://www.techradar.com/reviews/samsung-galaxy-book-pro-360"
  }
}