{
  "source": "https://www.techradar.com/news/google-is-changing-the-way-you-search",
  "title": "Google search results now act more like your social media feed",
  "category": "computing",
  "updated": "2021-10-15T12:30:04Z",
  "author": "joel-khalili",
  "summary": "Continuous scrolling comes to Google Search",
  "article": [
    "Google has announced it is trialling a fundamental change to the way people navigate through search results.",
    "In a blog post, the company explains it is doing away with traditional pagination on iOS and Android, in favor of social media-style continuous scrolling.",
    "The continuous scrolling feature is currently rolling out on a trial basis to mobile users in the US and will apply to most English language searches, Google says. TechRadar Pro has asked for clarification as to when the feature might be made available elsewhere and whether it will be extended to desktop.",
    "Although most people rarely stray beyond the first page of Google search results, the company says the new scrolling mechanism will create scope for its search engine to be used in slightly different ways.",
    "“While you can often find what you’re looking for in the first few results, sometimes you want to keep looking. In fact most people who want additional information tend to browse up to four pages of search results,” wrote Google.",
    "“With this update, people can now seamlessly do this, browsing through many different results before needing to click the ‘See more’ button.”",
    "According to Google, the new feature will be most useful in scenarios where the user is asking broader, open-ended questions. In the example provided by the company, the query “what can I do with pumpkins” benefits from the ability to scroll through a larger volume of search results, each of which approaches the question from a slightly different angle.",
    "The ability to hold the attention of users for longer with a social media-style scrolling mechanism will also benefit Google itself, unlocking new opportunities for the distribution and placements of ads (which account for roughly 80% of the company’s revenue).",
    "Google told TechCrunch it will change the way text ads are distributed throughout search results, perhaps reducing clustering at the top of the page. The way shopping and local ads are displayed is not expected to change.",
    "Finally, although the feature won’t have an effect on search rankings, it could result in more traffic flowing to websites that have historically struggled to break into the first page of the rankings."
  ],
  "headers": {
    "3": "Google Search scrolling"
  },
  "links": {
    "blog post": "https://blog.google/products/search/continuous-scrolling-mobile/",
    "roughly 80%": "https://abc.xyz/investor/static/pdf/2021Q2_alphabet_earnings_release.pdf?cache=4db52a1",
    "TechCrunch": "https://techcrunch.com/2021/10/14/google-modernizes-u-s-mobile-search-results-with-continuous-scrolling/"
  }
}