{
  "source": "https://www.techradar.com/news/fire-tv-stick-vs-fire-tv-stick-4k-vs-fire-tv-cube-amazons-streamers-head-to-head",
  "title": "Fire TV Stick vs Fire TV Stick 4K vs Fire TV Cube: Amazon’s streamers, head to head",
  "category": "audio-visual",
  "updated": "2021-11-18T22:08:35Z",
  "author": "henry-st-leger",
  "summary": "Which Fire TV device is right for you?",
  "article": [
    "If you’re on the lookout for an Amazon Fire TV streaming device to plug into your television, there are a ton to choose from: there's the regular Fire TV Stick, the Fire TV Stick 4K, new Amazon Fire TV Stick 4K Max and the Amazon Fire TV Cube.",
    "The sheer amount of choices here, while nice, can be a bit confusing - especially if you're not well-versed on the differences between the streaming sticks.",
    "What you'll find below is a complete breakdown of the prices, performance and specs of Amazon's entire Fire TV device lineup that should help light your way as you pick out the best streaming device for your home.",
    "The original Fire TV (2017) is sadly no more, after the smaller and more compact Fire TV Stick supplanted it. And there's now a host of devices to choose from with different resolutions, form factors and features to consider.",
    "The cheapest HD streamer is the Fire TV Stick Lite, which is one of the models released in 2020. It's much like the Fire TV Stick (2020), but it lacks volume / TV controls on its Alexa remote or support for Dolby Atmos audio. Above that, you have the Fire TV Stick 4K, which (as you'd expect) adds 4K resolution to the mix.",
    "One step up from that is the new Amazon Fire TV Stick 4K Max that adds some extra memory for a more responsive UI as well as support for Wi-Fi 6, the latest standard in wireless connectivity.",
    "At the top end, you have the Amazon Fire TV Cube: basically a Fire TV streaming box, which is built into an Amazon Echo speaker.",
    "How much is each Fire TV streaming device? The regular Fire TV Stick retails at $39.99 / £39.99, while the Fire TV Stick 4K is a smidge higher at $49.99 / £49.99. By comparison, the Fire TV Stick Lite costs just $29.99 / £24.99 / AU$59.99 – and is the only model available in Australia.",
    "The new Amazon Fire TV Stick 4K Max is a bit more expensive at $55 / £55 / AU$99, but you're paying for Wi-Fi 6 and the extra memory.",
    "The Fire TV Cube – bundling as it does the functionality of a streaming stick and Amazon Echo together – comes with a somewhat higher $119 / £109 price tag.",
    "On the surface, you won’t really be able to tell the Fire TV Stick and Fire TV Stick 4K apart. Both come in the form of a small HDMI dongle that plugs into the back of your television, with a power cable to keep it turned on. Both models also ship with the second-generation Alexa remote, meaning the navigation and voice control of the Fire TV app is identical between them.",
    "The Alexa remote comes with a hold-to-speak voice functionality, meaning you can push a button and have Alexa come up on your television. If you link up the streaming stick to an Amazon Echo, too, you can command your television to awaken and jump to specific shows or categories with voice commands, though Alexa isn’t quite as smart on Fire TV as she is with other daily needs.",
    "The Fire TV Stick Lite ships with a voice remote without TV / volume controls, meaning you'll have to use a regular TV remote to increase or decrease sound. But the form factor of the streaming stick itself is the same.",
    "The Fire TV Cube, though, is a whole other affair.",
    "It has the look of a boxy Amazon Echo speaker, and is designed as a hands-free interface you can control entirely through your voice – though it also comes with the 2nd-gen Alexa remote for those who don’t want to struggle with Alexa’s poor app navigation. The Fire TV Cube can act as a control center for changing channels on your set top box, altering volume, swapping inputs to your soundbar, and the like.",
    "The Cube’s eight far-field microphones will be able to pick up your words clearly from across the room, though the noise from a nearby TV or soundbar can make this difficult mid-watch.",
    "Probably the most important question here: what can you actually watch on the Fire TV, and how does the image quality vary between each device?",
    "Each of these devices shares the same Fire TV platform, so you’re able to watch content from the same apps across all the devices – though the resolution and video format will vary.",
    "In the US, you’ll find Netflix, HBO, Starz, Hulu, PlayStation Vue and Crackle – with plenty of other varied apps alongside – with equivalent services like BBC iPlayer and Freeview Play replacing US-only apps in the UK. While YouTube isn’t yet on the platform, Amazon and Google are working at amending this for users.",
    "Remember that a lot of these services require separate subscriptions: you won't be able to watch Netflix shows or Amazon Prime movies for free on a streaming stick.",
    "The basic Fire TV Stick and Fire TV Stick Lite can stream content up to Full HD quality (1080p), but the Fire TV Stick 4K – as the name suggests – can reach 4K UHD resolution, around four times the number of pixels. The Fire TV Cube also supports 4K streaming.",
    "To stream in 4K, it’s worth remembering that you’ll need a 4K-capable television. Even if you have a 4K streaming stick, all those lovely pixels are going to be compressed to HD if that’s all your TV can display. That’s the same for HDR: every new Fire TV model now supports HDR10 for an expanded color gamut and enhanced contrast, but not if your TV can’t back them up.",
    "The 4K Stick, 4K Max and Cube models are also the only ones to pack in support for HDR10+ and Dolby Vision. These are both ‘dynamic metadata’ formats, which is a fancy way of saying they vary the color, contrast, and brightness of the pictures onscreen in real-time, instead of blanket picture settings. Again, not every television supports these, so it’s worth checking what your TV can display before you make your choice.",
    "There are other competing streaming devices out there, all with their own interfaces and selection of apps, like the range of Roku streaming devices or Apple TV 4K. Your best bet is probably whatever ecosystem you’re already in: iOS devices play best with Apple TV and Amazon Echo speakers were designed to work in tandem with Fire TV.",
    "The Google Chromecast is a similarly-priced competitor, but doesn’t pack in the Amazon Prime Video app – and can also be frustrating to navigate. There’s an in-depth comparison of all the leading models in our Apple TV vs Amazon Fire TV Stick vs Roku vs Chromecast guide.",
    "Just want to skip to the verdict? If you want to keep your expenses down, it’s a pretty simple equation: get the Fire TV Stick for an HD television, and the Fire TV Stick 4K for an Ultra HD television. You’re paying a very small premium for the uplift in picture quality, and you get all sorts of HDR improvements and HDR10+ / Dolby Vision support alongside.",
    "The premium alternatives are the Fire TV Stick 4K Max and Fire TV Cube. The 4K Max adds a few nice features if you hate loading times and don't mind spending a bit extra, while the Fire TV Cube combines an Amazon Echo smart speaker with a Fire TV streaming device, which may make it worthwhile purchase for you.",
    "Alexa also struggles with navigating the Fire TV app by itself, and we expect you’ll end up using the remote most of the time – meaning the hands-free functionality of the Cube isn’t particularly useful. If you fancy being an early adopter of Amazon’s experimental streaming box, though, or want a streamer that can act as an AV control center, the Fire TV Cube may be the one for you."
  ],
  "headers": {
    "3": "Fire TV range: overview",
    "7": "Fire TV range: pricing",
    "10": "Fire TV range: design and features",
    "16": "Fire TV range: content and resolution",
    "23": "Other streaming devices to consider",
    "25": "Fire TV range: takeaway"
  },
  "links": {
    "Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Amazon Fire TV Stick 4K Max": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k-max",
    "Amazon Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Fire TV (2017)": "https://www.techradar.com/reviews/amazon-fire-tv-2017-review",
    "Fire TV Stick Lite": "https://www.techradar.com/reviews/amazon-fire-tv-stick-lite",
    "Fire TV Stick (2020),": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "PlayStation Vue": "https://www.techradar.com/reviews/gaming/playstation-vue-1292722/review",
    "Amazon and Google are working at amending this for users": "https://www.techradar.com/news/youtube-will-return-to-fire-tv-after-amazon-and-google-make-amends",
    "Netflix shows": "https://www.techradar.com/best/best-netflix-shows#netflix-uk-faq:-quick-questions-answered",
    "Amazon Prime movies": "https://www.techradar.com/best/best-amazon-prime-movies",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple TV vs Amazon Fire TV Stick vs Roku vs Chromecast": "https://www.techradar.com/news/television/apple-tv-vs-amazon-fire-tv-vs-roku-vs-chromecast"
  }
}