{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-apple-tv-plus-and-amazon-prime-this-weekend",
  "title": "7 new movies and TV shows on Netflix, Apple TV Plus and Amazon Prime this weekend",
  "category": "entertainment",
  "updated": "2021-01-29T16:26:05Z",
  "author": "samuel-roberts",
  "summary": "What to stream over the next few days",
  "article": [
    "Looking for something new to stream this weekend? First of all, make sure you watch WandaVision episode 4 on Disney Plus – it's the best episode yet, and finally sheds a little light on what's actually going on in the MCU TV show. If superheroes aren't your thing, though, you'll still find plenty of new movies and TV shows to stream this weekend.",
    "Below, we've rounded up seven highlights of new releases to check out, including a movie featuring Justin Timberlake as an ex-con (!) on Apple TV Plus, as well as three new Netflix original movies that all seem relatively inoffensive. We'll explain how to stream each one in the UK and US, too.",
    "Happy streaming.",
    "Netflix's big original movie this week stars Carey Mulligan, Ralph Fiennes and Lily James. Set shortly before World War II, it's about a widow living in the British countryside who commissions an archaeologist to uncover some strange patterns on her land – which leads to a big discovery.",
    "Side note: Ralph Fiennes somehow always looks like a man who's wandered out of World War II-era Britain.",
    "Critics like this movie, particularly the performances of its leads. It's got 85% positive reviews on Rotten Tomatoes, at the time of writing, so it's probably worth a watch if the subject matter sounds like your sort of thing.",
    "Now streaming on Netflix",
    "Warner Bros' decision to release its 2021 slate of movies on HBO Max at the same time they release in theaters (whichever are open, anyway) starts to pay dividends this week. It's about a hunt for a serial killer – with Jared Leto playing the prime suspect – and the clashes between an LAPD cop (Rami Malek) and a deputy in the sheriff's office (Denzel Washington).",
    "The Little Things looks like it fits firmly into a sub-genre of movie that's affectionately been dubbed 'garbage crime' by The Ringer's excellent movie podcast, The Big Picture: slightly trashy but entertaining crime thrillers. Critics don't love it, though – the film has 46% positive reviews on Rotten Tomatoes at the time of writing.",
    "Like most of HBO Max's releases this year, we're sadly unclear on how the film is being released in the UK.",
    "Now streaming on HBO Max in the US",
    "Resident Alien is about an alien living undercover as a doctor in a small town. It sounds goofy, but it looks like a detective show with a fun twist, a little like iZombie – and with Firefly and Rogue One's forever-underrated Alan Tudyk as the lead, it's worth a look. Long-time Family Guy writer Chris Sheridan is behind the series.",
    "Episode 1 is streaming free on Syfy's website and app for US subscribers, and UK viewers can stream it via Sky or Now TV.",
    "Now streaming on Syfy in the US and Sky/Now TV in the UK",
    "If you can't wait for the undated next episode of The Grand Tour Presents, which takes the trio of hosts to Scotland on a road trip mid-pandemic, consider checking out this series over the weekend.",
    "Richard Hammond and Mythbusters' Tory Belleci team up to survive while 'stranded' on a desert island, using their collective knowledge of science to pull through. It's six episodes long. Spoiler alert: both its hosts are still alive, so they must've pulled through okay.",
    "Now streaming on Amazon Prime Video",
    "Justin Timberlake stars in this new movie for Apple TV Plus, which is about a former football star who returns to his hometown after serving 12 years in prison. Soon, he forms a bond with a kid who doesn't fit in with the rest – and begins a new relationship as he tries to get his life back on track.",
    "It looks like pretty familiar, schmaltzy stuff, though critics like it, and the film has the unusual distinction of being directed by Short Circuit and Succession actor Fisher Stevens.",
    "Now streaming on Apple TV Plus",
    "This kid-friendly film is about two Brooklyn siblings who head to O'ahu for the summer with their family. In doing so, they click over uncovering more about their Hawaiian lineage, and end up on the trail for some legendary treasure.",
    "If you need something for the family to watch this weekend, this looks like perfectly pleasant entertainment with an interesting subject for an adventure film.",
    "Now streaming on Netflix",
    "Naomi Watts and Andrew Lincoln star in this movie about a mother whose life is changed by a horrific accident. She learns to slowly recover, however, with the aid of a nice magpie called penguin.",
    "It sounds heartwarming enough. Note, however, that Netflix has confirmed that no actual penguins feature in Penguin Bloom.",
    "Now streaming on Netflix"
  ],
  "headers": {
    "3": "The Dig (Netflix)",
    "7": "The Little Things (HBO Max)",
    "11": "Resident Alien (Syfy/Sky)",
    "14": "The Great Escapists (Amazon Prime Video)",
    "17": "Palmer",
    "20": "Finding 'Ohana (Netflix)",
    "23": "Penguin Bloom (Netflix)"
  },
  "links": {
    "WandaVision episode 4": "https://www.techradar.com/news/wandavision-episode-4-recap-review",
    "garbage crime": "https://letterboxd.com/seanfennessey/list/garbage-crime/",
    "The Big Picture": "https://open.spotify.com/show/6mTel3azvnK8isLs4VujvF?si=KF_ivuXjTwSrbuxansNb3A",
    "Syfy's website": "https://www.syfy.com/resident-alien/videos/101-pilot",
    "next episode of The Grand Tour Presents": "https://www.techradar.com/news/the-grand-tour-season-4-episode-3-release-date-and-upcoming-episodes-explained"
  }
}