{
  "source": "https://www.techradar.com/news/these-are-the-spectacular-winners-of-the-sony-world-photography-awards",
  "title": "These are the spectacular winners of the Sony World Photography Awards 2021",
  "category": "cameras",
  "updated": "2021-04-16T14:15:54Z",
  "author": "axel-metz",
  "summary": "Traveling without moving",
  "article": [
    "Not many of us have been able to get out and about with our cameras in the past year, but the Sony World Photography Award 2021 winners have just arrived to give us a stunning taste of global (and in some cases, celestial) travel.",
    "The competition, which welcomes entries from around the world and this year had 330,000 submissions, is one of the most prestigious in the photographic calendar and usually hosts an exhibition of its winners at London's Somerset House.",
    "This year's competition is naturally a more virtual affair, but we've gathered the winners of the World Photography Awards' ten categories below – and as usual, they're a spectacularly diverse and inspiring bunch of snaps from all corners of the globe.",
    "We start with the overall Photographer of the Year title, which this year was awarded to British documentarian Craig Easton for his series 'Bank Top'. The project examines the representation (and misrepresentation) of communities in Northern England and is a classic example how to create portrait studies that collectively tell a powerful story.",
    "Over the course of a year, Easton and writer Abdul Aziz Hafiz worked closely with local residents to explore their stories and experiences through a series of black-and-white portraits. And as we'll discover, Easton's choice of camera was somewhat more vintage than your iPhone's Portrait mode.",
    "Read on to discover how he made his winning series – along with all of the other professional category winners in this year's Sony World Photography Awards 2021.",
    "The overall winner in this year's Sony World Photography Awards 2021 is Craig Easton for his series of portraits called 'Bank Top'. Made in response to media reports that called Blackburn, a town in north-west England, 'the most segregated in Britain', it invited writers and artists to collaborate with residents to make an authentic snapshot of its communities.",
    "Sony itself may be better known for super-cameras like the Sony A1, but Easton took a distinctly more vintage approach to taking his photos. \"I work on a big old plate camera,\" Easton said, \"a wooden 10x8 Field Camera. So I'm not invisible in any way. I'm there in the street with this great big wooden camera on a tripod. And I think that's an important part of the process.\"",
    "\"I feel like this isn't reportage in any way. It’s very much a sort of collaborative thing, where I'm speaking to people, and it takes 20 minutes to set up the camera and focus it and we decide where we're going to make the photograph,\" he added. As you can see, the results are a set of timeless intimate portraits.",
    "Follow Craig Easton on Instagram",
    "The Sony World Photography Awards also saw winners announced in several other photography categories. We’ve rounded them up below, with a gallery and brief description of the winning work.",
    "Winner: Tomáš Vocelka (Czech Republic), 'Eternal Hunting Grounds' (above)",
    "Tomáš Vocelka’s series explores the fascinating transformation of a former Drnov military complex – left abandoned for 17 years – into a final resting place for pets, known as the Eternal Hunting Grounds. Yes, you read that right.",
    "The space comprises a mourning hall, crematorium and approximately 40 hectares of surrounding land where wildlife can thrive.",
    "Follow Tomáš Vocelka on Instagram",
    "Winner: Mark Hamilton Gruchy (United Kingdom), 'The Moon Revisited' (above)",
    "'The Moon Revisited' comprises previously unprocessed images from NASA and the Jet Propulsion Laboratory that have been repurposed, processed and composited to create a conversation about the nature of change – and also how to cook burgers in space.",
    "Mark Hamilton Gruchy adapted copyright-free materials to create the series, so there's hope for all of us who don't know our flash from our shutter. In one shot, the coronavirus even makes a guest appearance – well, it had to weasel its way into this year's awards somehow.",
    "Follow Mark Hamilton Gruchy on Instagram",
    "2nd place: Luigi Bussolati (Italy), 'Ampelio and I' (above)",
    "Equally arresting, but in a very different way, are Luigi Bussolati's shots above, which are projections of his distant uncle's old photographs onto the landscapes of Parma.",
    "Bussolati had the idea at the beginning of lockdown in Italy in Spring 2020 and used the Po river, in northern Italy, as a kind of darkroom for the shots taken at the end of the 19th Century.",
    "Follow Luigi Bussolati on Instagram",
    "Winner: Vito Fusco (Italy), 'The Killing Daisy' (above)",
    "Vito Fusco’s series examines the industry surrounding the pyrethrum plant, also known as the ‘flower of death’ – a nickname that neatly describes a delicate daisy imbued with murderous power. Not something you'd find in your grandmother's garden, we'd imagine.",
    "Following the pyrethrum crisis of the 1980s, the natural insecticide is now being grown once again on the clay hills of Nakuru, at an altitude of over 1,500m.",
    "Follow Vito Fusco on Instagram",
    "Winner: Simone Tramonte (Italy), 'Net Zero Transmission' (above)",
    "Simon Tramonte's series explores the world-leading shift towards sustainable living in Iceland, presenting the many ways in which the global climate crisis can be tackled in the pursuit of a net-zero sustainable future.",
    "If a sustainable future means daily trips to the hot springs, count us in.",
    "Follow Simone Tramonte on Instagram",
    "Winner: Majid Hojjati (Islamic Republic of Iran), 'Silent Neighborhoods' (above)",
    "Majid Hojjati's winning series explores the silent neighbourhoods of the world – the places totally free of humanity. Yes, apparently they do exist.",
    "From rolling deserts to abandoned towns, Silent Neighborhoods also captures the beautiful natural diversity of our planet. And the creepy benches, too.",
    "Follow Majid Hojjati on Instagram",
    "Winner: Laura Pannack (United Kingdom), 'Portfolio Overview' (above)",
    "Human vulnerability and honesty are at the forefront of Laura Pannack's winning portfolio of images, which are taken from a variety of personal projects.",
    "Those qualities are perhaps best summed up by a young boy holding a lollipop in one hand, and a cigarette in another – now that's living.",
    "As Laura says, each photo has as much drama and intrigue going on outside the frame as within it, which is a good lesson for photographers of all stripes.",
    "Follow Laura Pannack on Instagram",
    "Second place: Brais Lorenzo (Spain), 'My Work in the Year 2020' (above)",
    "As if to highlight what a dramatic (but also photogenic) year 2020 was, this series of snaps from Spanish photojournalist Brais Lorenzo are simply ones he took in and around his hometown of Ourense in the region of Galicia during the year.",
    "In a quiet year for humanity, that of course included everything from the pandemic to forest fires and, slightly more positively, carnival season.",
    "Follow Brais Lorenzo on Instagram",
    "Winner: Anas Alkharboutli (Syrian Arab Republic), Sport and Fun Instead of War and Fear (above)",
    "Anas Alkharboutli's series explores a karate school for children in the Syrian village of Aljiina, near Aleppo.",
    "The children involved are between six and 15 years old – and they look like they're having a grand old time. How do we sign up?",
    "Peter Eleveld (Netherlands), 'Still Life Composition, Shot on Wet Plate' (above)",
    "In this series, Peter Eleveld used ordinary objects, like glassware, fruits and flowers, and applied the wet plate collodion technique – a super-early photographic technique developed in the mid-1850s – to turn them into things that look like they belong in an art gallery.",
    "Eleveld said the process required the careful planning of composition, lighting and exposure times – and lots of patience. In many ways, it's the polar opposite to taking a smartphone snap, with Eleveld describing the \"magical moment as you watch the photograph slowly develop in front of your eyes\".",
    "Follow Peter Elevald on Instagram",
    "Second place: Alessandro Pollio (Italy), 'Volatile Interests' (above)",
    "A classic lockdown photography project from Milan, this series of stills life shots turns everyday objects into charming little pieces of modern art.",
    "Tied together by a bare kitchen countertop and a sense of playfulness, they're proof that there's always something interesting to photograph if you're prepared to look for it (or at least, if you can resist immediately eating some lovely strawberries).",
    "Follow Alessandro Pollio on Instagram",
    "Third place: Paloma Rincon (Spain), 'Mexican Feast' (above)",
    "Picking up our award for tastiest entry to this year's Sony World Photography Awards (and third place in the still life category) is this intriguing juxtaposition of Mexican food platters with traditional handcrafts and everyday local props.",
    "Mexican photographer Paloma Rincon, who shot the series in a Madrid studio, says that \"the influences of color, textures, bright lights and handmade goods form an important part of my style\". And what a spectacularly vibrant, uplifting style it is.",
    "Follow Paloma Rincon on Instagram",
    "Luis Tato (Spain), 'Invasion in East Africa'",
    "Desert locusts are the most destructive migratory pests in the world. Thriving in moist conditions in semi-arid to arid environments, billions of locusts have been feeding throughout East Africa, devouring everything in their path and posing a huge threat to the food supply and livelihoods of millions of people.",
    "If you don't believe us, just take a look at Luis Tato's photography series. It's both beautiful and terrifying at the same time.",
    "Follow Luis Tato on Instagram",
    "Second place: Graeme Purdy (UK), 'Raw Nature' Taken using wide-angle lenses and wireless triggers (well, do you fancy standing in front of that lion with an iPhone?), these stunning shots from Northern Irish photographer Graeme Purdy capture the majesty of wild animals including lions, hippos and elephants.",
    "As impressive as the quality of the shots is their variety, from an aerial drone image of a hippo pod to an underwater shot that's just inches away from wild crocodiles. Only slightly more adventurous than that snap of our first post-lockdown pint.",
    "Follow Graeme Purdy on Instagram"
  ],
  "headers": {
    "6": "Photographer of the year: Craig Easton",
    "11": "Architecture & Design category",
    "15": "Creative category",
    "23": "Documentary Projects",
    "27": "Environment category",
    "31": "Landscape category",
    "35": "Portfolio category",
    "44": "Sport category",
    "47": "Still Life category",
    "59": "Wildlife & Nature category"
  },
  "links": {
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Follow Craig Easton on Instagram": "https://www.instagram.com/mrcraigeaston/",
    "Follow Tomáš Vocelka on Instagram": "https://www.instagram.com/tomvocelka/?hl=en",
    "Follow Mark Hamilton Gruchy on Instagram": "https://www.instagram.com/mark_hamilton_gruchy/",
    "Follow Luigi Bussolati on Instagram": "https://www.instagram.com/luigibussolati/",
    "Follow Vito Fusco on Instagram": "https://www.instagram.com/vitofusco/?hl=en",
    "Follow Simone Tramonte on Instagram": "https://www.instagram.com/simonetramonte/",
    "Follow Majid Hojjati on Instagram": "https://www.instagram.com/majidhojatiphotographer/?hl=en",
    "Follow Laura Pannack on Instagram": "https://www.instagram.com/laurapannack/?hl=en",
    "Follow Brais Lorenzo on Instagram": "https://www.instagram.com/braislorenzo/",
    "Follow Peter Elevald on Instagram": "https://www.instagram.com/petereleveld/",
    "photography project": "https://www.techradar.com/how-to/52-photography-projects-a-great-technique-to-try-every-week-of-the-year",
    "Follow Alessandro Pollio on Instagram": "https://www.instagram.com/alessandropollio_/?hl=en",
    "Follow Paloma Rincon on Instagram": "https://www.instagram.com/paloma_rincon_/",
    "Follow Luis Tato on Instagram": "https://www.instagram.com/luistatophoto/",
    "Follow Graeme Purdy on Instagram": "https://www.instagram.com/graemepurdy/"
  }
}