{
  "source": "https://www.techradar.com/news/google-chrome-update-user-profiles",
  "title": "See how Google Chrome's user profiles are getting a much-needed overhaul",
  "category": "computing",
  "updated": "2021-03-02T17:35:40Z",
  "author": "rhys-wood",
  "summary": "Users will be able to distinguish profiles much easier now",
  "article": [
    "If Google Chrome is your browser of choice, then you might have had a hard time remembering to switch profiles, especially if multiple people in your household make use of the same device.",
    "It seems that Google knows this, and has today rolled out an update that makes user profiles much easier to distinguish, allowing users to customize their profiles to a much greater degree than before, as explained in a post on Google's blog.",
    "Currently, the new user profiles are only available on PC, with no word as of yet if they’ll make their way to Android and iOS devices.",
    "Users can now set their own backgrounds, color schemes and profile images, making it much easier to distinguish which belongs to whom, while simultaneously making it much harder to stumble upon someone’s, well, let’s say potentially questionable search history.",
    "These new user profile features should be ideal for multiple people who all use the same device, but also if you’re working from home, you can more easily opt to keep your work and personal profiles separate – if you use the same PC for both, that is.",
    "Touching on an aforementioned point, we’d like to see Google bring the improved user profile experience to Android and iOS devices. Tablets, especially, are commonly shared among families, so being able to access these user profiles more easily could act as an extra layer of security while the kids browse online.",
    "This is the kind of quality of life feature we love to see from Google. Bringing user profiles to the forefront should go a ways to help organize everyone’s bookmarks, passwords and preferences much more efficiently."
  ],
  "headers": {
    "4": "Stand out from the crowd"
  },
  "links": {
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "browser": "https://www.techradar.com/best/browser",
    "Google's blog": "https://blog.google/products/chrome/create-space-yourself-chrome/",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "iOS": "https://www.techradar.com/news/ios-15-update"
  }
}