{
  "source": "https://www.techradar.com/news/waiting-a-year-for-your-steam-deck-not-anymore-thankfully",
  "title": "Waiting a year for your Steam Deck? Not anymore, thankfully",
  "category": "gaming",
  "updated": "2021-07-23T09:45:59Z",
  "author": "darren-allan",
  "summary": "Steam Deck 512GB, the model which had the longest wait time, will be out sooner than thought",
  "article": [
    "Steam Deck pre-orders came thick and fast when the portable PC was made available last week, and lead times on the devices seriously lengthened very quickly – but fortunately, the situation seems to have reversed slightly, at least in the case of the top-end model.",
    "That Steam Deck with 512GB of storage was the worst casualty of the lengthened wait times, and as we reported the day after launch, this is the configuration that wouldn’t ship until Q3 of 2022. In other words, leaving gamers with a potential year-long-plus wait, given that the first month of Q3 is July, of course.",
    "However, as PC Gamer spotted, Valve has updated the Steam Deck page to show that orders for the 512GB version are now going to ship in Q2 of 2022; so, three months earlier. In theory, then, you could get your Steam Deck 512GB in April, a more palatable – if still not ideal – situation.",
    "All versions of the Steam Deck are now showing as shipping in Q2 2022 in both the US and UK, although note that this is still the current ‘expected’ order availability, so it could change. The earlier you make your pre-order, the further you are up the queue, so those who snagged a Steam Deck first will be served first.",
    "As well as 512GB of storage, the fully decked-out (ahem) Steam Deck comes with anti-glare etched glass for the display, which could be a useful benefit if you’re gaming outside (or in a bright room) with the device.",
    "When pre-orders launched for the Steam Deck, there was a good deal of controversy as some folks couldn’t get their reservation in due to the website crashing (and being overloaded), or errantly being told they weren’t eligible to order (remember, Valve had a system to block new accounts of scalpers from pre-ordering, but it seems this may have gone awry in some instances).",
    "Those who failed to get their pre-order in as quickly as it should have gone through due to no fault of their own were obviously unimpressed, no doubt doubly so if they didn’t manage to grab a unit before ship dates were seriously extended – and to Q3, as mentioned, for the 512GB device which became the worst-case scenario.",
    "Valve’s move here will be a welcome relief to those who placed an order for the flagship Steam Deck, although it’s not clear how the company has rejigged things so quickly to address stock issues. It could be a case of reprioritizing existing manufacturing plans to focus more on the 512GB model, at the cost of others, or perhaps a matter of having secured more components to build more Decks. The latter, of course, would be something of a feat given the ongoing pandemic-related hardware shortages we keep hearing about.",
    "However, those who ordered a smaller capacity Steam Deck, either due to cost considerations, or being put off by the longer wait for the 512GB model – or perhaps both of the above – can at least be consoled by the fact that it seems games play just fine off the SD card (even if the SSD will obviously be a better performance proposition)."
  ],
  "headers": {
    "3": "Q2 across the board",
    "5": "Analysis"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "as we reported the day after launch": "https://www.techradar.com/news/steam-deck-pre-orders-flood-in-and-512gb-model-now-isnt-shipping-for-a-year",
    "PC Gamer": "https://www.pcgamer.com/uk/steam-deck-availability-sooner-than-expected/",
    "Steam Deck page": "https://store.steampowered.com/steamdeck",
    "system to block new accounts of scalpers": "https://www.techradar.com/news/valve-aims-to-kill-off-scalping-with-steam-deck-pre-orders",
    "that it seems games play just fine off the SD card": "https://www.techradar.com/news/valve-has-addressed-one-of-our-biggest-concerns-about-the-steam-deck"
  }
}