{
  "source": "https://www.techradar.com/news/visible-wireless-is-just-dollar5-a-month-with-this-hidden-feature",
  "title": "Visible Wireless is just $5 a month with this hidden feature",
  "category": "phones",
  "updated": "2021-03-29T15:48:02Z",
  "author": "alex-whitelock",
  "summary": "Refer-a-friend and pay significantly less",
  "article": [
    "The Visible wireless plan is one of our favorite prepaid plans here at TechRadar and the choice of many looking for a cheap unlimited data plan. It's already great value, however we've just spotted a great little feature for existing users that's mostly hidden from keen eyes.",
    "Off to the side of the main site is the Visible referral program - which might just be one of the best Visible deals going right now. If you weren't already aware, this feature allows you to give a code to a new user to use at checkout for a month of wireless data for just $5 a month. All you have to do is log into your account and find your referral link to get a code that you can share out.",
    "This is completely stackable for up to 12 maximum referral credits at a time - which you can save or use accordingly for a monthly discount per credit. Your new friend will also get their first month of Visible for just $25 a month - and you could even link your accounts together using the Visible Party Pay scheme for more savings in the future.",
    "It's curious why the Visible referral page is so hidden on the site - it's almost like they don't want people to know about this excellent feature. Anyway, speculation aside - if you're already a Visible member or are interested and know someone who is, this is a great little money-saving tip right here. Bundle it up with the Visible Party Pay especially and you've got a very, very competitively priced unlimited data plan here.",
    "Looking for more options? We recommend heading on over to our main best cell phone plans article for a top-down look of the market as a whole. You could also check out our guides to this month's best Visible wireless plans for more information on this carrier specifically."
  ],
  "headers": {
    "4": "Visible Wireless plans for $5 a month"
  },
  "links": {
    "prepaid plans": "https://www.techradar.com/deals/best-prepaid-plans",
    "Visible referral program": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-7476209263728427000&sharedId=trd-us&u=https%3A%2F%2Fnewsroom.visible.com%2Fnews%2Freferral-program",
    "Visible deals": "https://www.techradar.com/deals/best-visible-deals-coupon-codes",
    "referral link": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-1009398327590370400&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Freferral",
    "Party Pay": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-1053474674348237400&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Fplan%2Fparty-pay",
    "best cell phone plans": "https://www.techradar.com/deals/best-cell-phone-plans",
    "Visible wireless plans": "https://www.techradar.com/deals/best-visible-wireless-plans"
  }
}