{
  "source": "https://www.techradar.com/news/fbi-held-onto-revil-decryptor-for-weeks-before-sharing-with-victims",
  "title": "FBI held onto REvil decryptor for weeks before sharing with victims",
  "category": "computing",
  "updated": "2021-09-22T12:08:04Z",
  "author": "mayank-sharma",
  "summary": "The needs of many outweigh the needs of the few, reason agency sources",
  "article": [
    "In a strange turn of event, it has emerged that the FBI had managed to get hold of REvil’s universal ransomware decryptor key three weeks before sharing it with victims.",
    "Although the agency has not officially confirmed the claims, an anonymous source told the Washington Post (WP) that the FBI withheld the keys so as to not tip off REvil.",
    "“The questions we ask each time are: What would be the value of a key if disclosed? How many victims are there? Who could be helped? And on the flip side, what would be the value of a potential longer-term operation in disrupting an ecosystem? Those are the questions we will continue to have to balance,” reasoned the unnamed source.",
    "It appears the FBI was gearing to launch a campaign to take down the notorious ransomware. However, before the agency could make a move, REvil pulled the plug on its operations on its own accord.",
    "The reports come after cybersecurity firm Bitdefender recently released a universal decryptor for REvil victims, claiming to have made it together with a “trusted law enforcement partner” that it failed to identify.",
    "Interestingly, the existence of a universal decryptor was first shared by a REvil representative, after the gang suddenly decided to get back into action after staying offline for nearly two months.",
    "“One of our coders misclicked and generated a universal key, and issued the universal decryptor key along with a bunch of keys for one machine,” wrote REvil’s new representative in the Russian-post translated by security researchers at Flashpoint.",
    "Flashpoint researchers have observed REvil trying to rebuild its reputation with former collaborators, who weren’t pleased with their sudden disappearance, prompting security researchers to urge clients to brace for a new round of REvil attacks.",
    "VIa Washington Post"
  ],
  "headers": {
    "4": "My precious"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "REvil pulled the plug": "https://www.techradar.com/news/revil-websites-disappear-from-the-web",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Bitdefender": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "universal decryptor": "https://www.techradar.com/news/bitdefender-releases-revil-master-decryptor",
    "get back into action": "https://www.techradar.com/news/revil-is-back-and-wants-to-rebuild-its-reputation",
    "Russian-post translated": "https://www.flashpoint-intel.com/blog/revil-is-back-on-exploit-and-trying-to-restore-its-reputation/",
    "urge clients to brace": "https://www.techradar.com/news/is-the-revil-ransomware-set-for-a-return",
    "Washington Post": "https://www.washingtonpost.com/national-security/ransomware-fbi-revil-decryption-key/2021/09/21/4a9417d0-f15f-11eb-a452-4da5fe48582d_story.html"
  }
}