{
  "source": "https://www.techradar.com/news/microsoft-announces-surface-go-3-surface-laptop-studio-surface-pro-8-and-more-ahead-of-windows-11-launch",
  "title": "Microsoft announces Surface Go 3, Surface Laptop Studio, Surface Pro 8 and more ahead of Windows 11 launch",
  "category": "computing",
  "updated": "2021-10-27T13:34:39Z",
  "author": "matt-hanson",
  "summary": "New devices galore!",
  "article": [
    "Microsoft has officially announced a huge range of new Surface products, bringing long-awaited updates to its existing products (such as the Surface Pro 8), along with a few genuine surprises as well.",
    "The most eye-catching launch was the Surface Laptop Studio, which is a laptop aimed at creatives with a 14.4-inch touchscreen that can be pulled out and angled to turn it into a digital canvas. The screen comes with a ‘PixelSense’ resolution of 2,400 x 1,600 and up to 120Hz refresh rate.",
    "Hardware-wise it sounds pretty awesome with 11th gen Intel processors and the option to come with an Nvidia RTX 3050 Ti GPU with 4GB of GGDR6 memory. There is also a commercial model available with Nvidia’s professional-grade RTX A2000 laptop GPU.",
    "The Surface Laptop Studio's pre-orders are now live in the US, starting at $1,599 (around £1,200, AU$2,200).",
    "Dolby Atmos speakers, a 1080p webcam, 16GB or 32GB RAM and up to 2TB SSD round out the features.",
    "The design itself is reminiscent of a tablet, such as the iPad Pro or Surface Pro 7 with a connected keyboard. Unlike those tablets, though, this keyboard can’t be removed. We love seeing companies play with the traditional laptop form factor, so we’ll be keeping our eye on the Surface Laptop Studio. It’ll be interesting to see how digital creatives, its primary target audience, react to this.",
    "The Surface Pro 8 also made an appearance at Microsoft’s Surface event. This was less of a surprise, but still welcome, as the Surface Pro 7 released almost two years ago, so it was well overdue an upgrade.",
    "Going by Microsoft’s announcement, it thankfully seems like the wait will be worth it, with the company claiming that it is the ‘most powerful Pro ever, offering twice the performance of the Surface Pro 7 with ‘40% higher sustained CPU performance’ and ‘74% faster graphics sustained performance’.",
    "This is thanks to the Surface Pro 8 coming with 11th gen Intel processors (which feature Intel Xe integrated graphics) and 8GB, 16GB or 32GB of RAM.",
    "The Surface Pro 8 also comes with a 13-inch 2,880 x 1,920 screen, which is 11% larger, with a 10.8% higher resolution, than previous screens, and can also come with an optional 120Hz refresh rate.",
    "Microsoft also promises up to 16 hours of battery life, with the Surface Pro 8 charging to 80% in just over an hour. There’s also a 5MP front-facing camera with 1080p video, and a 10MP rear-facing camera with 1080p and 4K video support, which should make this a great device for making video calls on.",
    "As with previous Surface Pro devices, the Surface Pro 8 can be used with a keyboard to turn it into a laptop-like device, but that’s still sold separately.",
    "The Surface Pro 8 starts at $1,099 / AU$1,649 (around £810). That will get you an Intel Core i5-1135G7 processor, 8GB of RAM and a 128GB SSD.",
    "It's a pretty big bump from the Surface Pro 7, which launched at just $749/£799/AU$1,249. However, that was for a configuration with just a Core i3 processor and 4GB of RAM. But the Pro 7 configuration with a Core i5, 8GB of RAM and a 128GB SSD launched for just $899/£899/AU$1,499, which is a full $200 cheaper in the US (AU$150 in Australia). It's a pretty massive price difference.",
    "The Surface Go 3 is another affordable tablet from Microsoft, again offering a stylish design but for a price that’ll be more realistic for many people. It comes with a 10.5-inch 1920 x 1280 resolution display, 4GB or 8GB RAM, and either a dual-core Intel Pentium Gold 6500Y processor, or quad-core 10th generation Intel Core i3-10100Y.",
    "Previous Surface Go products have been great devices for students, as their lower prices and excellent build quality makes them well suited for schools and colleges, and, hopefully, the Surface Go 3 will continue that trend. Pricing will be key here – but so far Microsoft hasn’t confirmed the price of the Surface Go 3, but we'll update this story as soon as we hear more.",
    "In Australia, the Surface Go 3 will set you back AU$629 for the 64GB / 4GB RAM version, while the 8GB RAM / 128GB storage option will be AU$849.",
    "Microsoft has also surprised us with a new Surface Pro X. The original was an interesting attempt by Microsoft to create a Surface Pro tablet powered by a bespoke ARM processor co-designed by Microsoft (rather than relying on Intel to provide the processing power).",
    "The original Surface Pro X didn’t really blow us away, however, due to its high price and lackluster performance – a common complaint about ARM-based Windows 10 devices back when it launched in 2019.",
    "So, we’re pleased that Microsoft is having another attempt, and it looks like it could improve on its predecessor in a number of ways. For a start, there’s a new entry level price point of $899 / AU$1,699 (around £650), which is a lot more affordable.",
    "The original Surface Pro X only offered a version with both Wi-Fi and Gigabit LTE mobile internet, but the new model comes with a Wi-Fi only option, which helps lower the price and should be a good option for people who don’t want to pay extra for an LTE mobile data connection they’ll never use.",
    "Windows 11 on ARM will also support x86 and x64 emulation, so this new version should have access to a much wider selection of apps. The lack of apps for the original was a big issue.",
    "It also features a 13-inch display with a 2,880 x 1,920 resolution, a Microsoft SQ 1 or SQ 2 custom CPU and GPU SoC, 8GB or 16GB RAM and up to 15 hours of battery life.",
    "Microsoft also announced the new Surface Duo 2, its updated dual-screen smartphone, and it’s still trying to avoid calling it a phone. But, it makes phone calls, so we’re going to call it a phone, anyway.",
    "The Surface Duo 2 will start at $1,499 (around £1,100, AU$2,000) in \"select markets\".",
    "Because of this, our phones team has dug into the Surface Duo 2 launch news some more. Sorry, Microsoft.",
    "While we had a feeling that Microsoft was going to release several Surface devices, the sheer amount of new hardware it launched took us by surprise. We’re pleased to see the Surface Pro 8 appear, as the Surface Pro 7 was a bit of a disappointment, and it’s been hanging around without a successor for almost two years now.",
    "The Surface Laptop Studio could also be a big winner with creatives. It’s great to see Microsoft innovating again, though it could prove to be a niche product.",
    "We’re even glad that it’s trying out the Surface Pro X again, with some key tweaks that could make this new version more popular than the previous model – though time will tell.",
    "These new launches give Microsoft’s hardware lineup a needed shot in the arm ahead of Windows 11’s launch. Every device announced at the event, except for the Surface Duo 2, will come with Windows 11 pre-installed, and that will give Microsoft a range of flagship devices that can showcase its new operating system.",
    "All these devices are now available for pre-order, with them arriving throughout October 2021. However, the Surface Pro X has only been given a \"coming 2022\" release date."
  ],
  "headers": {
    "6": "Surface Pro 8 gets announced",
    "14": "Budget Surface Go 3 is also coming",
    "17": "A new Surface Pro X",
    "23": "Oh, and there was a phone as well",
    "26": "Analysis: New hardware is just what Microsoft needed"
  },
  "links": {
    "Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "Surface Laptop Studio": "https://www.techradar.com/reviews/microsoft-surface-laptop-studio",
    "Dolby Atmos speakers": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "Surface Go 3": "https://www.techradar.com/reviews/microsoft-surface-go-3",
    "Surface Go": "https://www.techradar.com/reviews/microsoft-surface-go",
    "Surface Pro X": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
    "Surface Duo 2": "https://www.techradar.com/reviews/surface-duo-2",
    "dug into the Surface Duo 2 launch news": "https://www.techradar.com/news/microsofts-second-gen-foldable-phone-has-a-bigger-battery-more-cameras-and-5g",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}