{
  "source": "https://www.techradar.com/news/godaddy-adds-vimeo-video-creation-for-smbs",
  "title": "GoDaddy adds Vimeo video creation for SMBs",
  "category": "computing",
  "updated": "2021-10-08T09:09:33Z",
  "author": "abigail-opiah",
  "summary": "Share high quality videos in minutes",
  "article": [
    "Top domain registrar and web hosting company GoDaddy has expanded its partnership with video hosting provider Vimeo, allowing customers to create and share high quality videos in minutes.",
    "With the new platform integration targeted at small business owners, the pair have launched 700 free video templates with customizable fonts, colors and music for its customers.",
    "The video templates have been designed for SMBs to swap in their own images, logos and videos with ease.",
    "A 2021 survey by Wyzowl found that 84% of consumers were convinced to buy a product or service after watching a video, and 86% of video marketers said that videos increase traffic to their websites.",
    "“However, for many small businesses, the biggest barrier to video content is often the amount of time and technical savvy required to make professional-quality videos,” GoDaddy said.",
    "“With the new platform integration, customers can create and share brilliant, professional quality videos, in less time than it takes your morning coffee to brew, to attract customers and increase engagement.”",
    "The feature will be accessible through GoDaddy’s Websites + Marketing tool, within its dashboard where SMBs will be able to manage all videos in one central location.",
    "The new videos are stored directly in their GoDaddy media library, and the web hosting company has added a feature that lets business owners click a button to add those videos directly onto their website or share across social channels.",
    "GoDaddy and Vimeo first announced their partnership in October 2020, bringing the power of the latter's platform to GoDaddy's website builder and marketing tools.",
    "GoDaddy says the expanded Vimeo partnership will continue to empower small and mid-sized business owners to reach customers and grow their business."
  ],
  "headers": {
    "3": "Video marketing"
  },
  "links": {
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "Wyzowl": "https://www.wyzowl.com/video-marketing-statistics/",
    "said": "https://aboutus.godaddy.net/newsroom/press-releases/press-release-details/2021/GoDaddy-Makes-Video-Creation-Easy-and-Accessible-To-Small-Business-Owners-With-Expanded-Vimeo-Partnership/",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "marketing tools": "https://www.techradar.com/best/best-content-marketing-tools"
  }
}