{
  "source": "https://www.techradar.com/news/are-the-memorial-day-sales-worth-it-this-year",
  "title": "Are the Memorial Day sales worth it? We analyze today's best deals",
  "category": "news",
  "updated": "2021-05-31T16:50:19Z",
  "author": "tabitha-baker",
  "summary": "We look at whether today's discounts are up to scratch",
  "article": [
    "Memorial Day sales are offering some enticing discounts on everything from patio furniture to MacBooks today, but how can you make sure the offers you're browsing are worth it? We're running through all the biggest Memorial Day sales right here, and running them against last year's savings and what we've seen during other sales events as well. Here's what we've found...",
    "We've been tracking the Memorial Day sales for years now, which means we've seen plenty of sitewide sales and coupon codes in our time. With so many deals on the table, we're using those years of experience to make sure you're only browsing the offers that are worth your cash.",
    "While discounts on tech items aren't traditionally the focus of the Memorial Day sales, there are some record low prices that beat previous Black Friday and Prime Day savings (more on that below). However, it's those in the market for larger appliances, patio furniture, and mattresses who will be getting the most value today.",
    "The Memorial Day sales typically focus on homeware and outdoor furniture, and last year's discounts served the latter category particularly well. With the pandemic keeping everyone at home, grills and patio sets received the biggest discounts in 2020.",
    "This year's outdoor furniture offers, by comparison, are coming in slightly lower (60% off at Wayfair today, compared to 65% off last year). However, the fact that there are so few discounts in this category for the rest of the year means it's still worth grabbing a deal in the Memorial Day sales if you see a product on sale within your budget.",
    "That's largely the story for many of today's Memorial Day sales, though some product categories have better-value deals than others. Here's our breakdown of the most popular items on sale, plus insight into the retailers offering the best deals today.",
    "Wayfair offers some excellent furniture deals year round, but patio furniture is a specialty come Memorial Day sales. Last year the retailer offered discounts of up to 65% off items including patio chairs, tables and parasols (however its biggest discounts were reserved for home, furniture and bedding, which saw up to70% off).",
    "This year the pattern is much the same, with many popular deals from previous sales returning to the shelves. However outdoor furniture has taken a slight hit, with savings of up to 60% off today - that's 5% lower than the previous year.",
    "It's easy to see why last year's offers were fractionally better than those available right now, with the pandemic driving demand for patio accessories and outdoor play products. However, that doesn't mean today's Memorial Day sales aren't worth it; these items are rarely discounted this much during the summer months, or in later sales, and many offers are still offering excellent prices if you're in need of a particular item.",
    "Last year's Black Friday sales, for example, saw discounts of between 45% and 65% on outdoor furniture across Wayfair, Home Depot and Lowes. The reductions mostly centred on more expensive furniture sets that were still carrying fairly high price tags after the savings had been applied.",
    "When it comes to today's deals, Wayfair is still out in the lead for good-value deals on patio furniture in the Memorial Day sales, but Lowe's grill discounts are looking particularly worthwhile as well.",
    "Furniture deals are where Memorial Day sales often shine brightest, and this year looks particularly good. While Target is running the same 25% discount on furniture as it did last year, today you can also save an extra 15% on some furniture items and bag 50% off home decor.",
    "We only saw this extra 15% offer on larger home items at Target last year, and there was only 25% off decor then too. Plus, although larger furniture items are fairly regularly discounted at Target, big discounts like the current sitewide sale are incredibly rare - and when larger sales do appear they rarely touch smaller items.",
    "Wayfair has a good range of living room discounts to browse through too. You can save up to 60% on larger items like couches and ottomans - though, again, there was up to 65% off last year. Nevertheless, there are plenty more low-budget options on the menu this year - comparing percentage discounts is only half the story.",
    "Discounts on bedroom furniture at Wayfair, however, are the same year-on-year, with larger items starting from $99 and 70% off bedding. That's a discount that only rolls around during big savings events (most notably last seen over Black Friday), so if you're looking for bedding or some bigger pieces it's worth heading to Wayfair over Memorial Day as well.",
    "If you've been waiting for a full kitchen refit, Best Buy is your go-to for appliance deals in today's Memorial Day sales. These more expensive items typically see fewer discounts throughout the year, and today's sales have some big package offers that generally only appear during high profile discount periods.",
    "This LG bundle deal covering refrigerators, ranges, dishwashers and more can save you 5% on three items - and 10% on four items. This particular offer was available last year, but we haven't seen in return to our shelves in a long time. There's also a $1,700 saving on KitchenAid bundles , which isn't an offer we see every day either.",
    "If you're looking for individual appliances, though, we'd recommend heading over to Lowe's. You can save up to $500 straight away when you buy certain large appliances, so if you're just after a new refrigerator or dishwasher you'll find better value here.",
    "So how do these deals compare to the rest of the year? Well, the best discounts are usually found over holiday weekends, and Memorial Day is a key time to make a big saving, as older stock is replaced by newer models. We regularly see some of the biggest appliance price drops outside of Black Friday on Memorial Day.",
    "The Memorial Day sales aren't as well known for their tech deals, and many of the discounts we're seeing at the moment have either been around for a little while or will likely return very shortly. If you're after a new set of AirPods, a new laptop, or a smartwatch, then we'd recommend waiting for a Prime Day deal for the biggest price drops. However, TVs are seeing some particularly hot savings at Best Buy right now.",
    "Plus, there are some record-low prices flying around, which might be worth grabbing if you're in need of some new gadgets. The Beats Solo Pro headphones, for example, are down to a record low $149 (was $299) and the AirPods Max have also seen their first major discount as well. We're also seeing a particularly stunning saving on the M1 MacBook Pro, now available for $1,099, the biggest discount so far from the $1,299 MSRP.",
    "Aside from some select offers, which you can find in our roundup, we'd recommend holding off on tech deals in today's Memorial Day sales, then.",
    "Check out all the best Lowe's Memorial Day sales and more Best Buy Memorial Day sales as well."
  ],
  "headers": {
    "6": "Memorial Day outdoor furniture sales",
    "11": "Memorial Day furniture sales",
    "15": "Memorial Day appliance sales",
    "19": "Memorial Day tech sales",
    "22": "More Memorial Day sales"
  },
  "links": {
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "savings of up to 60% off": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9118820965248501000/https://www.wayfair.com/daily-sales/outdoor-furniture-clearance~e223296.html",
    "grill discounts": "https://homedepot.sjv.io/c/221109/456723/8154?subId1=trd-us-9788793863013786000&sharedId=trd-us&u=https%3A%2F%2Fwww.homedepot.com%2Fb%2FOutdoors-Outdoor-Cooking-Grills%2FSpecial-Buys%2FN-5yc1vZbxazZ1z11ao3",
    "save an extra 15% on some furniture items": "https://goto.target.com/c/221109/81938/2092?subId1=trd-us-1412257063346476300&sharedId=trd-us&u=https%3A%2F%2Fwww.target.com%2Fc%2Ffurniture-sale%2F-%2FN-13iww",
    "50% off home decor": "https://goto.target.com/c/221109/81938/2092?subId1=trd-us-1886208398714815500&sharedId=trd-us&u=https%3A%2F%2Fwww.target.com%2Fc%2Fup-to-50-off-sale%2F-%2FN-4smig",
    "save up to 60%": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3017715396926923300/https://www.wayfair.com/daily-sales/living-room-seating-clearance~e223260.html",
    "starting from $99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3659620495477520400/https://www.wayfair.com/daily-sales/bedroom-furniture-clearance~e223280.html",
    "5% on three items - and 10% on four items": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-5686359760782671000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fclp-appliances%2Flg-appliances-package-offer%2Fpcmcat1608151677124.c&article_name=Are%20the%20Memorial%20Day%20sales%20worth%20it%3F%20We%20analyze%20today's%20best%20deals&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fare-the-memorial-day-sales-worth-it-this-year",
    "$1,700 saving on KitchenAid bundles": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1040561667664477200&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fconditional-offers%2Fkitchenaid-offer%2Fpcmcat1576778380445.c&article_name=Are%20the%20Memorial%20Day%20sales%20worth%20it%3F%20We%20analyze%20today's%20best%20deals&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fare-the-memorial-day-sales-worth-it-this-year",
    "save up to $500 straight away": "https://lowes.sjv.io/c/221109/897039/12374?subId1=trd-us-3623025220050514000&sharedId=trd-us&u=https%3A%2F%2Fwww.lowes.com%2Fc%2FAppliances",
    "Prime Day deal": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "record low $149 (was $299)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07YVYZLC8%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1003030091504950900-20",
    "first major discount": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08PZD76NP%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9620903185960921000-20",
    "now available for $1,099": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MacBook-13-inch-256GB-Storage%2Fdp%2FB08N5LLDSG%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8754974118049785000-20",
    "in our roundup": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "Lowe's Memorial Day sales": "https://www.techradar.com/news/lowes-memorial-day-sale-2021-best-deals-appliances-patio-furniture-tech",
    "Best Buy Memorial Day sales": "https://www.techradar.com/news/best-buy-memorial-day-sale-2021"
  }
}