{
  "source": "https://www.techradar.com/news/ddr5-ram-prices-could-be-bad-news-for-your-wallet",
  "title": "DDR5 RAM prices could be bad news for your wallet",
  "category": "computing",
  "updated": "2021-10-21T10:21:42Z",
  "author": "darren-allan",
  "summary": "DDR5 memory could turn out to be really expensive, MSI warns",
  "article": [
    "Next-gen RAM is always a lot more expensive than current products of course, but the pricing misery is going to be more intense with DDR5 system RAM, according to a fresh forecast.",
    "This comes from hardware maker MSI, which has produced a FAQ-style blog post on DDR5 memory (spotted by Overclock3D) which will soon be on sale, and can be used with Intel’s theoretically imminent Alder Lake processors.",
    "MSI covers various issues including the expected pricing, with DDR5 estimated to command a 50% to 60% premium compared to current DDR4 asking prices, which is a good chunk heftier than the typical rise with the introduction of new memory.",
    "As MSI notes: “Historically, newer memory technology has always commanded close to a 30-40% premium over the previous generation. However, this time, DDR5 includes additional components that have driven the costs up further.”",
    "Prices will stay inflated for some time, but that’s nothing new and it is always the case that a new standard of RAM will remain costly for some time. As MSI underlines, it takes around two years before pricing normalizes, or in other words, when DDR5 is expected to reach the same kind of price tags as the ones seen on DDR4 now.",
    "In its FAQ, MSI points out that Kingston will launch DDR5 sticks at the same time as Intel unleashes its Alder Lake CPUs and motherboards, which will be the only platform that supports DDR5. Naturally, other RAM makers will be on the case too.",
    "Indeed, as you may know, technically DDR5 is already available to buy, with TeamGroup having released DDR5 RAM kits way back in June, at least in limited fashion in some regions. Currently you can have these shipped from China (ordered from Newegg US), but really, it’s pointless to purchase right now given that there’s nothing to actually put this new system memory into. Not until those aforementioned Intel 12th-gen chips and their Z690 motherboards arrive.",
    "The launch price of that TeamGroup RAM was $400 (around £290, AU$535) for a 32GB, 4,800MHz kit (but it’s also worth noting that to have it shipped from China right now will cost $790 – around £570, AU$1,055 – via Newegg US). The recommended price isn’t too much of an increase on 4,000MHz DDR4, in actual fact, but wider DDR5 RAM costs will likely be a good deal higher as suggested here. Particularly when component shortages and potential stock issues – a constant plague on the tech industry right now – make themselves felt.",
    "Furthermore, remember that 4,800MHz will be entry-level for DDR5 and there will be much faster RAM sticks out there, which will be correspondingly more expensive, and indeed perhaps even thinner on the ground, again leaving the conceivable prospect of asking prices being hiked up well above the recommended levels.",
    "Depending on the price premium Intel exacts for its new 12th-gen silicon – with some rumors reckoning it could be a bit of a jump from Rocket Lake – when you roll into the equation the further expense of DDR5, and a shiny new Z690 motherboard, those making the leap to an entirely new Alder Lake PC could be looking at a steep premium for their machine (on top of the existing additional costs for components in short supply already like GPUs).",
    "Via VideoCardz"
  ],
  "headers": {
    "5": "Analysis: RAM raiding your wallet (probably)"
  },
  "links": {
    "DDR5": "https://www.techradar.com/news/gskill-is-getting-ready-to-release-ddr5-ram",
    "blog post": "https://www.msi.com/blog/all-you-need-to-know-about-ddr5-memory-modules?",
    "Overclock3D": "https://overclock3d.net/news/cpu_mainboard/ddr5_s_going_to_be_extremely_expensive_at_launch_-_msi_admits/1",
    "Intel’s theoretically imminent Alder Lake processors": "https://www.techradar.com/news/new-intel-alder-lake-rumor-suggests-cpu-launch-is-imminent",
    "Alder Lake CPUs": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "TeamGroup having released DDR5 RAM kits": "https://www.techradar.com/news/ddr5-ram-has-officially-hit-the-shelves-but-you-shouldnt-buy-them",
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "VideoCardz": "https://videocardz.com/newz/msi-expects-ddr5-memory-to-be-50-to-60-more-expensive-than-ddr4"
  }
}