{
  "source": "https://www.techradar.com/news/inside-hawkeye-marvels-holiday-themed-and-most-subversive-show-yet",
  "title": "Inside Hawkeye, Marvel’s subversive street level TV show that's reminiscent of Daredevil",
  "category": "entertainment",
  "updated": "2021-12-02T16:18:25Z",
  "author": "tom-power",
  "summary": "‘We haven’t explored a mother-daughter dynamic in the MCU before’",
  "article": [
    "A Hawkeye standalone adventure in the MCU has been a long time coming. As with Black Widow, Marvel fans clamored for a project based around Clint Barton for years. But, when Natasha Romanoff finally took center stage in a solo movie in the summer of 2021, Hawkeye became the last member of the original Avengers line-up without a self-contained story.",
    "Until now. With Marvel’s Phase 4 plans back on track after the Covid-19 pandemic thwarted new project releases in 2020, Hawkeye is getting a solo adventure. However, unlike his fellow original Avengers, all of whom received the big screen treatment, Hawkeye’s independent tale comes by way of a Disney Plus TV series.",
    "Previously, a fictional character’s relegation to small screen productions was indicative of their diminishing popularity. Or, in Hawkeye’s case, not being as universally loved as Iron Man, Captain America or Thor. But, as Hawkeye director Rhys Thomas explains, the TV medium is ironically the best format to tell Clint’s story effectively.",
    "“His MCU history is really interesting,” Thomas tells TechRadar. “He hasn’t had as much screen time as the others, but what makes him intriguing is he’s just this regular guy that happens to have this unusual skill. He feels pain, he gets beaten up, and he has those human vulnerabilities. They [the show’s writers] have set up such a compelling arc for him, so telling that over six one-hour episodes, instead of a two-hour movie, was ideal for us.”",
    "Ahead of Hawkeye’s November 24 launch, TechRadar sat down with Thomas and executive producer Trinh Tran to find out more about Marvel’s latest TV series. We discuss its unusual Holiday-themed setting, bringing a musical sensibility to the MCU, and why Hawkeye may be the most subversive Marvel show yet.",
    "Set sometime after the events portrayed in Avengers: Endgame, Hawkeye follows the adventures of Clint Barton (Jeremy Renner), who has retired from active superhero duty. But, during a New York City trip to celebrate the Holiday season with his family, Barton becomes the target of numerous street gangs when individuals from his past unexpectedly resurface.",
    "Why? Well, someone is masquerading as Ronin, the alter-ego that Barton assumed in Endgame after his family was snapped out of existence by Thanos. Tracking the culprit down, Barton discovers who is wearing his old Ronin costume: Kate Bishop (Hailee Steinfeld), Hawkeye’s self-appointed number one fan and fellow expert archer. Deducing that Bishop is the reason behind his enemies’ returns, for reasons that become clear later on, a reluctant Barton teams up with Bishop to clean up her mess and lay his demons to rest. Oh, and be back with his family in time for Christmas.",
    "If Hawkeye’s plot sounds familiar to comic fans, that’s because elements are based on one of Marvel’s best print series in recent memory. Matt Fraction and David Aja’s Hawkeye comic arc, which ran from 2012 to 2015, was a key inspiration for the show’s chief creative team – not least for its comedy perspective. There’s a clear reason, in Tran’s view, why the Hawkeye TV show puts Clint in unusual situations, such as when he’s forced to take part in a live-action role-playing performance.",
    "“You've seen the family man and the serious superhero,” Tran says. “But you haven't seen a different side of Clint that, in Matt and David’s run, is more comedic. The great thing is that Jeremy is so funny, and that makes it easier to put Clint in settings that connect him with people he wouldn’t normally associate with. From there, how does he react to it and how does he get out of it? Jeremy was excited that we wanted to take risks and explore a different, light-hearted tone for his character.”",
    "Hawkeye’s setting also helped the show’s creators to lean into the more comedy-driven aspect of Clint’s personality. The show’s narrative is spread across the six days leading up to Christmas Day – each episode comprising a single day – as Barton frantically tries to make it home in time for the holidays. The festive period, combined with Clint’s reserved and oft-times grumpy disposition, then, was the dichotomy that the show’s synopsis was built around.",
    "“Tonally, he’s also a bit of a grouchy character,” Thomas says. “But there’s something about the Christmas genre that felt right for the series’ vibe. We’ve seen examples of this before, such as Die Hard and Lethal Weapon, which marries grumpy characters with this lighter, warmer Christmas energy and spirit. Marvel has never done [the Holiday season] before, so it was fun to explore the idea of a Christmas-themed show that’s happening on this tight timeline.”",
    "Holiday-themed productions weren’t the only inspiration for Hawkeye, though. For every film like the The Grinch or Kiss Kiss Bang Bang, non-Holiday flicks, including 1988 action-comedy Midnight Run and 1984 neo-noir crime thriller Blood Simple, were equally and stylistically influential.",
    "Curiously, Hawkeye represents Marvel’s first venture into the musical genre, too. As fans will have seen in Hawkeye’s teaser trailers, Clint and his family attend a Steve Rogers stage play as part of their festive plan. The sequence sees one performer acting out Hawkeye’s role in The Battle of New York and, given what actually happens during those events in 2012’s Avengers movie, it puts Clint in an uncomfortable position.",
    "But Thomas, who's previously worked on music-led productions including Adele Live in New York City, felt that he couldn’t pass up on bringing some musical flair to the MCU when the opportunity arose.",
    "“It was an innocent and silly idea that I threw out early on,” he reveals. “We were trying to think of what Clint would be doing in New York, and it amused me that he’d be watching a stage version of himself, in a bad costume, tap dancing away. It’s kind of absurd but very fun, and I got to work with Marc Shaiman (Hairspray, Mary Poppins Returns), who wrote the music. Again, it’s not something that Marvel’s done before, so it was exciting to sneak a musical reference in the show.”",
    "While Hawkeye is positioned as a Clint Barton solo story, that isn’t actually the case. Kate Bishop has equal top billing with the veteran superhero in Marvel’s latest TV show – a fact that may not surprise some fans, with Bishop adopting the Hawkeye mantle in the comics after Barton retires.",
    "Finding the right actor to portray Bishop, then, was of paramount importance. The perfect candidate didn’t just need to exude the confidence and enthusiasm that Bishop’s comic counterpart does; they also needed to be an amusing and slightly annoying foil to Barton’s world-weary persona. After a lengthy search, Hailee Steinfeld (Bumblebee, Dickinson) was installed as the MCU’s newest addition.",
    "“Hailee’s such a hard worker,” Tran discloses. “She did her homework on Kate to understand who she is and find her voice in the MCU. Kate’s the perfect candidate to pull that fun side out of Clint as she’s so witty and smart, and she idolizes him, which is something he’s not used to seeing.”",
    "Kate Bishop isn’t the only fun character that Hawkeye’s show introduces from the Fraction and Aja run. Lucky the Pizza Dog, the fan-favorite, one-eyed canine from the duo’s series, also makes their live-action debut. Thomas believes that viewers will immediately fall in love with Lucky when he appears. And, like Bishop, Lucky’s inclusion is vital in helping Clint to move past the trauma and baggage that he’s carried around since Endgame.",
    "“Lucky’s such a fun part of that comic run,” Thomas says. “I would happily continue to do things with Lucky – I’d even give him his own spin-off show! Their inclusion is so important for Clint’s arc, and our visual effects team did a great job of removing Lucky’s left eye in post-production [for the role].”",
    "Perhaps unsurprisingly, a father-daughter, buddy cop style dynamic is born out of Clint and Kate working together as the series progresses. For Tran, though, the most interesting relationship at play in Hawkeye doesn’t involve Clint at all. Instead, Tran believes that the strained dynamic between Kate and her mother Eleanor, portrayed by Vera Farmiga (The Departed, Bates Motel), is the true heart and soul of the show.",
    "This, Tran says, is what makes Hawkeye the most subversive MCU TV show yet. In her eyes, fans will go into the series expecting it to primarily focus on Clint. When, in fact, it’ll follow Kate’s story as much, if not more so, than the retired Avenger.",
    "“We haven't explored the mother-daughter dynamic in the MCU much,” Tran admits. “In the comics, it’s Derek Bishop [Kate’s father] who has that tension with his daughter. We decided it’d be more interesting if Eleanor and Kate had opposing views: we wanted to see how Kate sees herself, and who she thinks she wants to be, versus who Eleanor feels her daughter should be. That conflict is what we’re pushing for, and I think that drama is distinct from anything we’ve seen before in the MCU.”",
    "It’s unclear whether Kate Bishop will take over from Clint Barton as the MCU’s version of Hawkeye. After all, unlike a superhero pseudonym such as Iron Man, Hawkeye is gender neutral, meaning that male and female characters can use it as an alias. With Marvel slowly moving towards the next generation of heroes, though, it wouldn’t be a complete shock if Steinfeld’s Bishop becomes Hawkeye Mark II. There’s also the question of how the looming multiverse’s arrival may impact the show’s plot, too.",
    "For now, Marvel is focused on telling a Holiday-themed story that it hopes audiences will watch annually around this time of year. The studio hopes that viewers will make it a staple of their traditional festive film and TV show line-up. And, with its themes of family and unity, twisting and turning narrative, and Christmas-themed aesthetic, Hawkeye might make for the perfect Holiday series that, as the show’s tagline says, is gift wrapped with a bow for everyone to enjoy.",
    "Hawkeye’s first two episodes launch exclusively on Disney Plus on Wednesday, November 24. New episodes will be released weekly."
  ],
  "headers": {
    "5": "Taking aim",
    "9": "A Christmas Carol",
    "15": "A Bishop and her dog",
    "20": "Subverting expectations"
  },
  "links": {
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "Marvel’s Phase 4 plans": "https://www.techradar.com/news/marvel-phase-4",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "may impact the show’s plot": "https://www.techradar.com/news/is-hawkeye-affected-by-the-multiverse-mcu-shows-director-and-producer-weigh-in"
  }
}