{
  "source": "https://www.techradar.com/news/toyota-bz4x-concept-is-the-latest-electric-car-with-solar-panels",
  "title": "Toyota bZ4X Concept is the latest electric car with solar panels",
  "category": "car-tech",
  "updated": "2021-10-14T10:05:15Z",
  "author": "john-mccann",
  "summary": "The first of 15 fully electric cars from Toyota",
  "article": [
    "Toyota is one of the leaders in hybrid vehicles, but the firm is yet to dip its toes into the fully electric car market – however, that's about to change.",
    "The Japanese firm has shown off the Toyota bZ4X Concept, an all-electric car that gives us a look at what the future holds for its electrified range, and a non-concept version of the Toyota bZ4X will be forthcoming for consumers.",
    "Update: Toyota has confirmed to TechRadar that \"worldwide sales [of the bZ4X] should begin by the middle of 2022.\"",
    "We will see 15 fully electric cars from Toyota launched by 2025, and the 'bZ' moniker – which stands for 'Beyond Zero – will be splashed across seven of the initial offerings.",
    "Toyota hasn't revealed too much regarding the specification of this medium -sized SUV, but what we do know is that it features solar panels.",
    "The bZ4X Concept features an \"on-board solar charging system\" which, Toyota says, will be able to extend the range of this battery electric vehicle.",
    "Sadly, it doesn't reveal how much additional range these panels will provide, but don't get your hopes up for a lot of extra mileage.",
    "We've already seen solar panels feature on the Hyundai Ioniq 5, which apparently \"add up to 2,000km per year (around 5-6km per day) of additional range\".",
    "As suggested by the '4X' in its name, this electric car comes with 4-wheel drive, with the system developed in partnership with Subaru and which Toyota claims \"gives genuine off-road capability.\"",
    "Inside, Toyota says the bZ4X Concept offers up a surprising amount of space for its class thanks to a long wheelbase and relatively short overhang at the front and rear.",
    "There's a large display at the top of the center console, and traditional-button fans will be pleased to see there's a selection of physical switches below this for quick access to key functions such as climate.",
    "Meanwhile a digital instrument cluster sits behind a half-sized, futuristic steering wheel.",
    "As this is a concept car, we may see various design elements (such as the steering wheel) and technical features changed for the production Toyota bZ4X.",
    "We have contacted Toyota for more information on the concept and production versions of the bZ4X, but a spokesperson was only able to say \"This world premiere is for the bZ4X concept.",
    "\"All detailed technical and specification information will be disclosed at the launch of the model. The worldwide sales should begin by the middle of 2022.\""
  ],
  "headers": {
    "5": "The power of the sun"
  },
  "links": {
    "seen solar panels feature": "https://www.techradar.com/news/hyundais-new-electric-car-has-a-solar-panel-roof-and-the-ability-to-charge-other-evs",
    "Hyundai Ioniq 5": "https://www.techradar.com/news/hyundai-ioniq-5-review"
  }
}