{
  "source": "https://www.techradar.com/news/intel-iris-xe-finally-gets-an-official-driver-for-rocket-lake-s-desktops",
  "title": "Intel Iris Xe finally gets an official driver for Rocket Lake-S desktops",
  "category": "computing",
  "updated": "2021-04-05T17:30:33Z",
  "author": "john-loeffler",
  "summary": "Rocket Lake-S gets a critical driver update",
  "article": [
    "Intel released the official driver for its Iris Xe GPU built into their new Rocket Lake-S processors, which launched last week without public driver support.",
    "The new processors are the first desktop CPUs to feature Intel Iris Xe graphics, and while OEMs had been supplying the updated driver for their systems, the driver had not been made publicly available, so anyone buying the processor on its own did not have the necessary driver support for the chip's GPU.",
    "Not having such an important driver available when the processors launched was definitely an embarrassing oversight on Intel's part and adds to what has been a somewhat uneven launch.",
    "We reviewed two of the new Rocket Lake-S chips and while our Bill Thomas called the Intel Core i7-11400K \"the mid-range Rocket Lake savior\" in their very positive review, they were less impressed with the Intel Core i9-11900K, giving the processor just two and a half stars after it actually underperformed the previous generation's Intel Core i9-10900K.",
    "This was definitely not the kind of launch Intel was hoping for, especially with AMD's Ryzen 5000-series processors lifting Team Red into the lead for desktop CPU marketshare.",
    "With some unexpected underperformance and the slow-rolling barrage of bad news in its fight against archrival AMD, Intel was undoubtedly hoping that Rocket Lake-S would help stop some of the bleeding.",
    "That probably won't happen, given the success of AMD's Ryzen 5000 series, but 2021 isn't over yet. Later this year, Intel is set to release its 12th-generation Alder Lake CPUs, which are a very different design from its previous processors.",
    "Featuring the same big.LITTLE architecture pioneered by ARM and implemented to great success in the Apple M1 chip, Intel is well ahead of AMD as far as this kind of processor is concerned. AMD has even mocked Intel for going with the design in what could be one of those \"famous last words\" moments in tech.",
    "Given the growth of mobile computing (which requires more energy efficiency to save on battery life) and the demonstrated performance capability of the M1 chip, Intel's adoption of the big.LITTLE architecture for its processors could become a massive differentiator between it and AMD.",
    "Just as Nvidia set itself apart from AMD with its ray tracing Turing cards, Intel's Alder Lake could do something similar later this year and catch AMD similarly flat-footed on an emerging technology.",
    "That's assuming, of course, that Alder Lake lives up to the hype, which remains to be seen."
  ],
  "headers": {
    "5": "Rocket Lake-S might fail to take off, but Alder Lake could be what really matters"
  },
  "links": {
    "Intel Core i7-11400K": "https://www.techradar.com/reviews/intel-core-i5-11600k",
    "Intel Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "Intel Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "desktop CPU marketshare": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "mocked Intel": "https://www.techradar.com/news/amd-has-a-subtle-dig-at-intel-suggesting-alder-lake-cpus-dont-make-sense"
  }
}