{
  "source": "https://www.techradar.com/news/nvidia-rtx-3080-ti-gpu-could-arrive-in-april-with-12gb-vram",
  "title": "Nvidia RTX 3080 Ti GPU could arrive in April with 12GB VRAM",
  "category": "computing",
  "updated": "2021-02-07T12:14:59Z",
  "author": "darren-allan",
  "summary": "Not 20GB of video memory as was previously rumored",
  "article": [
    "Nvidia’s much-rumored GeForce RTX 3080 Ti could turn up in April, and will be loaded with 12GB of VRAM, according to the latest speculation.",
    "This comes from @kopite7kimi (as spotted by VideoCardz) on Twitter, who shared some new info including tweaks to the spec details provided previously by the well-known hardware leaker.",
    "As you likely recall, rumor had it that the purported RTX 3080 Ti would run with 20GB of video memory, but now @kopite7kimi believes the amount will be 12GB. That 12GB loadout of GDDR6X VRAM would point to a 384-bit memory bus.",
    "Furthermore, 10,240 CUDA cores will be present in the card, as opposed to the previous speculation which suggested 10,496 cores.",
    "Interestingly, @kopite7kimi is apparently 95% sure that 12GB will be the loadout of the RTX 3080 Ti, according to a follow-up tweet.",
    "VideoCardz notes that it has heard the same thing from its sources in terms of the hardware spec of this flavor of Nvidia’s GPU, and adds that the supposed release date for the new spin on the RTX 3080 will be April. That’s going by the most recent update to Nvidia’s product roadmap, apparently, but the potential April launch hasn’t been confirmed by the site’s other sources yet.",
    "At any rate, take that, and all this rumored info, with a seriously healthy amount of skepticism. Indeed, speculation has been floating around about the RTX 3080 Ti for a long while now, with the rumor mill even declaring that the GPU had been abandoned at one stage. Of course, it still could be.",
    "If 12GB sounds like too slight a memory count for the 3080 Ti, especially compared to the previous rumor of 20GB, bear in mind that Nvidia will need to differentiate the graphics card considerably from the RTX 3090 – the latter will need a reason to be much more expensive (assuming the Ti doesn’t hike the price too much above the vanilla 3080, which would surely be the intention).",
    "Ultimately, a lot will depend on exactly where Nvidia pitches the price of this purported incoming GPU, and of course performance will also depend on where the card is clocked (and its power envelope) compared to the RTX 3090. Whatever the case, as mentioned, there will need to be some considerable differentiation here.",
    "If the April release date doesn’t change – which VideoCardz admits it could well do – then we may hear more about this graphics card before long. Until we get more concrete leaks, though, we’d still stay very cautious around this particular thread of speculation."
  ],
  "headers": {
    "7": "Memory configuration"
  },
  "links": {
    "much-rumored": "https://www.techradar.com/news/leak-reveals-next-nvidia-gpus-that-could-arrive-including-rtx-3080-ti-and-rtx-3050",
    "VideoCardz": "https://videocardz.com/newz/nvidia-geforce-rtx-3080-ti-with-12gb-memory-to-launch-in-april",
    "purported RTX 3080 Ti": "https://www.techradar.com/news/nvidia-doesnt-seem-spooked-by-amd-big-navi-so-could-delay-rumored-rtx-3080-ti",
    "20GB of video memory": "https://www.techradar.com/news/nvidia-rtx-3080-ti-leak-suggests-a-powerful-gpu-with-20gb-of-vram-to-take-on-amd-big-navi",
    "Nvidia’s GPU": "https://www.techradar.com/news/nvidia-geforce",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}