{
  "source": "https://www.techradar.com/news/amd-fidelityfx-super-resolution-could-be-the-steam-decks-secret-weapon",
  "title": "Steam Deck needs AMD FidelityFX Super Resolution for us to ditch our gaming laptops",
  "category": "computing",
  "updated": "2021-07-16T13:53:49Z",
  "author": "matt-hanson",
  "summary": "Could be the Steam Deck's secret weapon",
  "article": [
    "Valve has just announced its Steam Deck handheld gaming system, which includes a custom-built AMD chip with a Zen 2 quad-core processor and RDNA 2 integrated graphics, along with 16GB of RAM – but will those specs be capable of providing “more than enough performance to run the latest AAA games” as Valve promises?",
    "We have our doubts, as they certainly won’t be able to offer the kind of performance a gaming laptop or desktop PC with dedicated graphics can, but could AMD’s FidelityFX Super Resolution help do some of the heavy lifting?",
    "If Valve is serious about people not just ditching the Nintendo Switch in favor of the Steam Deck, but also choosing the new handheld over a gaming laptop, then it may need to rely on AMD FidelityFX Super Resolution to compete.",
    "If you don’t know, AMD FidelityFX Super Resolution is a new feature that allows games to be upscaled from lower resolutions to look like they're running at higher resolutions – but without the performance impact.",
    "This allows games to perform better, especially on lower-powered or older hardware, and by using spatial upscaling, along with sharpening and other post processing effects, it can have a dramatic impact on improving a game’s performance. And, while image quality won’t quite match running the game at native resolutions, it can be pretty close.",
    "AMD’s rival Nvidia does something similar with DLSS Deep Learning Super Sampling), which has been around a bit longer, and uses AI and machine learning to achieve similar results. However, Nvidia’s implementation requires modern RTX graphics cards.",
    "AMD FidelityFX Super Resolution, on the other hand, is far more open, and is able to run on older GPUs from both AMD and Nvidia. This openness has a lot of benefits, one of which could be using AMD FidelityFX Super Resolution with the Steam Deck. With that implementation, the Steam Deck could offer solid frame rates and graphical fidelity that its hardware would normally struggle with.",
    "While we’ve not heard anything about AMD FidelityFX Super Resolution coming to the Steam Deck, the fact that Valve has been working with AMD on the hardware of the Steam Deck makes it kind of a no brainer.",
    "Interestingly, Nvidia has also been working with Valve on bringing its DLSS tech to Valve’s Proton software. Proton is a compatibility layer that allows games that are traditionally only able to run in Windows to be run in Linux, and DLSS has been used to improve performance in these games and eliminate any hits that running a game via Proton could introduce.",
    "With Steam Deck running Steam OS, which is based on the Linux Arch distribution, Proton will be used a lot to allow Windows games to run. With DLSS’ success with Proton, we expect to see the same with AMD FidelityFX Super Resolution.",
    "AMD FidelityFX Super Resolution has also just had a recent update, and it’s now been made available to pretty much everyone via GPUOpen.",
    "It’s also been updated with early support for the Unity game engine, alongside Unreal Engine as well, which are two of the biggest game engines that power modern games – and this could mean that a huge amount of future games could support AMD FidelityFX Super Resolution (and hopefully existing games could get patched to support it as well).",
    "AMD also announced that Resident Evil Village, Necromunda: Hired Gun, Arcadegeddon, and Edge of Eternity have all been updated to support FidelityFX Super Resolution.",
    "With a growing list of games supporting the technology, AMD FidelityFX Super Resolution could be a big benefit for the Steam Deck if the handheld can indeed take advantage of the tech. As the launch gets closer, we’ll hopefully find out more."
  ],
  "headers": {
    "3": "What is AMD FidelityFX Super Resolution?",
    "10": "AMD FidelityFX Super Resolution goes from strength to strength"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "DLSS tech to Valve’s Proton software": "https://www.techradar.com/news/nvidia-and-steam-are-making-linux-gaming-great-again",
    "GPUOpen": "https://gpuopen.com/fsr-source-available/",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village"
  }
}