{
  "source": "https://www.techradar.com/news/star-wars-visions-looks-totally-different-and-thats-why-you-should-watch-it",
  "title": "Star Wars: Visions looks totally different – and that’s why you should watch it",
  "category": "entertainment",
  "updated": "2021-08-21T16:00:00Z",
  "author": "rhys-wood",
  "summary": "Opinion: Star Wars plus anime is a recipe for success",
  "article": [
    "If you’re at all a fan of Star Wars or anime (or both), then you’ve likely seen the debut trailer for Star Wars: Visions. And if not, what’s keeping you? The trailer, which showcases nine upcoming animated shorts from some of Japan’s most prolific anime studios, including Studio Trigger and Production IG, certainly looks like a visual feast.",
    "Thanks to the talent involved, it’s actually a much bigger deal than you might otherwise think. In my mind, Star Wars: Visions could be so much more than just a flashy way to present new stories in the franchise’s iconic universe.",
    "If it's popular enough (and if it’s as well received as I think it will be), then we might see anime adaptations of various Disney properties become something of a norm. And that would be a wonderful thing indeed.",
    "In case you’re unaware, Star Wars: Visions is an upcoming animated project exclusive to Disney Plus. The season will feature nine standalone episodes, with most being handled by different Japanese animation studios. Think the format of The Animatrix or the more recent Love, Death & Robots, and you’ve essentially got the gist of it.",
    "Star Wars Visions: will be available to watch with both the original Japanese voices (with subtitles) and an English dub which features an incredibly strong cast, including David Harbour, Alison Brie, Lucy Liu and George Takei among many others.",
    "So why is Star Wars: Visions as big a deal as I’m making it out to be? First off, think of a Western-made project based on an existing Japanese franchise. Quite a few come to mind, right? Whether that would be Netflix’s Castlevania, the Resident Evil hexalogy or the 'so-bad-it’s-good' Van Damme-led Street Fighter, Western filmmakers have taken on Japanese projects for decades with varying degrees of success.",
    "It’s so rare to see the opposite in Japanese studios taking on Western intellectual properties. It’s been tried in the past, such as with the aforementioned The Animatrix, or Capcom’s work on several Disney-themed games like DuckTales and Aladdin. But almost never for a franchise that is as grandiose as Star Wars (outside of a few outsourced NES games, at least).",
    "So Star Wars: Visions has an opportunity to break new ground and you can tell the project is far from a gimmick. The studios involved have worked on some of the most influential anime of the past few decades, including the violently dystopian Psycho-Pass and cyberpunk hits like Ghost in the Shell: Stand Alone Complex.",
    "But we may as well address the elephant in the room: Star Wars has seen some pretty divisive entries as of late, particularly when it comes to the sequel trilogy’s movies. It’s been relatively smaller scale projects like The Mandalorian that have picked up the slack, and Star Wars: Visions could help to relieve those sequel trilogy woes even further.",
    "It’s also worth noting that Star Wars has a solid track record when it comes to animation. The 2003 Clone Wars animated series maintains a cult following to this day, and its 2008 CGI follow-up was almost equally well-received. More recently, Star Wars: The Bad Batch has had an impressive start with its inaugural season.",
    "Does that guarantee Star Wars: Visions will be good? No, but it’s genuinely difficult to imagine the series being bad given the high level of talent involved.",
    "At worst, I think Star Wars: Visions could be underwhelming from a narrative standpoint, but I predict the high quality visuals and animation have the potential to win over even the most skeptical of Star Wars fans.",
    "So Star Wars: Visions could not only alleviate the lackluster projects of the franchise’s recent past, but also provide a superb series for the present day.",
    "But what about the future? Will Star Wars: Visions be successful enough to warrant a second season? Or, even better, could the series have a knock-on effect on other Disney properties?",
    "I certainly hope so. Getting such a variety of Star Wars anime is a great thing, but the same concept could easily be applied to other Disney-owned properties, many of which have huge potential.",
    "Imagine a Disney Princess anthology handled by Japan’s most prestigious anime studios. The likes of Mulan, Snow White, Sleeping Beauty and Pocahontas could seriously benefit, as their darker themes could be vigorously explored with anime adaptations.",
    "How about a Marvel anime series, in the vein of Marvel’s What If…? series. Superhero stories naturally lend themselves well to the often intricately detailed animation that anime studios provide. It would be incredible to see MAPPA (the studio behind Attack on Titan’s final season) take charge of a Spider-Man project, for example.",
    "I’d also love to see Studio Trigger — the company behind such eclectically animated projects as Kill la Kill and Promare — take on something equally bonkers. Guardians of the Galaxy immediately comes to mind there, which itself gives me Cowboy Bebop vibes.",
    "Star Wars: Visions and similar projects have a ton of potential but, ultimately, Visions has the capacity to represent a watershed moment for Disney-led animation projects. By taking their franchises to Japan, Disney could essentially unlock a whole new way of telling stories within the worlds of their best franchises. Wouldn't that also be a marvellous opportunity to kickstart a Kingdom Hearts anime in partnership with Square Enix?",
    "It all depends on the success of Star Wars: Visions, though. If most (or rather all) of its nine episodes leave a lasting impression, Disney might well be convinced that 'Visions' could become a brand in and of itself.",
    "I’ll definitely be cheering on Star Wars: Visions. If its success means we could potentially get Disney Princess Visions, Pixar Visions, Marvel Visions or otherwise, Star Wars: Visions could end up becoming one of the most pivotal projects Disney has put out for quite some time. And wouldn’t that be something to celebrate?"
  ],
  "headers": {
    "5": "Visionary talents",
    "9": "Roots in excellence",
    "12": "The vision of Visions",
    "18": "May the ratings be with you"
  },
  "links": {
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "anime": "https://www.techradar.com/best/best-anime",
    "Star Wars: Visions": "https://www.techradar.com/news/star-wars-visions-looks-incredible-and-could-be-the-next-big-sci-fi-anime-series",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Love, Death & Robots": "https://www.techradar.com/news/every-love-death-and-robots-episode-ranked",
    "Netflix’s Castlevania": "https://www.techradar.com/news/castlevania-season-4-will-be-its-last-but-could-there-be-a-sequel",
    "Resident Evil": "https://www.techradar.com/news/resident-evil-games-ranked-which-is-the-best-mainline-resi-game",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Clone Wars": "https://www.techradar.com/news/the-original-star-wars-clone-wars-still-kicks-ass",
    "Star Wars: The Bad Batch": "https://www.techradar.com/news/disney-plus-confirms-star-wars-the-bad-batch-season-2-is-on-the-way",
    "Mulan": "https://www.techradar.com/news/mulan-on-disney-plus-a-vague-war-epic-that-trades-songs-for-platitudes",
    "Marvel’s What If…?": "https://www.techradar.com/news/inside-marvels-what-if-the-disney-plus-animated-show-that-reshapes-the-mcu",
    "Spider-Man": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Guardians of the Galaxy": "https://www.techradar.com/news/guardians-of-the-galaxy-3-and-black-panther-2-get-release-dates-in-new-mcu-trailer"
  }
}