{
  "source": "https://www.techradar.com/news/bigblue-cellpowa500-is-an-affordable-way-to-power-all-of-your-gadgets-outdoors",
  "title": "BigBlue Cellpowa500 is an affordable way to power all of your gadgets outdoors",
  "category": "appliances",
  "updated": "2021-06-01T16:10:37Z",
  "author": "sponsored",
  "summary": "Go green and off-grid",
  "article": [
    "The way we live and work has changed forever, and the BigBlue Cellpowa500 is a revolutionary portable power station that can help power your devices no matter where you are in the world.",
    "Founded in 2015, BigBlue is an ambitious company that specializes in developing energy storage products and solar power products that are safe, efficient and environmentally friendly, and the Cellpowa 500 is the first product that’s been entirely developed by BigBlue - and you can help support it in its Indiegogo crowdfunding campaign.",
    "Indiegogo backers will get the Cellpowa500 at an exclusive price with up to 40% off. That means backers can get it for the equivalent of $0.55/WH, which is lower than the average $1/WH it usually sells for. So, even though raw materials and shipping costs have increased, BigBlue is still supplying products at a partial loss price.",
    "It’s an ideal backup power source for your home – so even if there’s a power outage, the Cellpowa500 can keep your important devices working. The magic is that it’s not only a home backup energy source, but can also be used outdoors for off-grid living and working.",
    "The Solarpowa 100W ETFT solar panel specially designed for Cellpowa500 power station can be used to connect with the power station to convert solar energy into electricity and store it. If you want to get both the Cellpowa 500 and the Solarpowa100, the combined price is only $449.99 on Indiegogo, making this an extremely affordable way to power all your gadgets when you go off-grid.",
    "Having been designed from the ground up by BigBlue, the Cellpowa500 exemplifies the company’s rigorous safety design philosophy, with an intelligent battery management system that allows the device to operate safely in temperatures ranging from 0~45°C.",
    "Even at an extremely low temperature of -20°C or a high temperature of 80°C, Cellpowa 500 will simply stop working – but it won’t get damaged.",
    "What’s more, the self-developed battery management system (BMS) built into Cellpowa 500’s 537.6Wh battery pack will manage the charge, discharge and health of the battery to ensure safety and efficiency, while increasing the battery life.",
    "The unique LiFePO4 battery inside the Cellpowa500 is safer and more stable than common lithium batteries and has been put through rigorous safety testing to ensure there is no danger of it exploding, leaking or catching fire.",
    "It offers a 537.6WH capacity, which is more than enough to keep your essential appliances powered, and it retains 80% of its original capacity after 2,000 full charge cycles - so even after four years of daily use, the Cellpowa500 will still be a dependable power source for your devices.",
    "The compact design and telescopic handle means it’s easy to carry around with you, and it comes with a huge amount of outputs for hooking up to your devices. There’s a 120w cigarette lighter adapter, two 60W DC5.5mm ports, two standard USB-A fast charging ports, two USB-C ports and two 500W AC ports as well.",
    "No matter what device you want to plug into the Cellpowa500, this thing will manage it, making it ideal for off-grid working and living.",
    "You can also try and get your hands on one by taking part in the BigBlue Gleam giveaway.",
    "Ten lucky winners will receive a BigBlue Cellpowa500 worth $500. All you need to do is follow the crowdfunding campaign on Indiegogo and share it with others. The more you share, the better your chance is of winning.",
    "With the energy industry changing - along with the way we work and live, innovative new products like the BigBlue Cellpowa500 may pleasantly surprise you with the freedom they offer you when living off grid or working remotely.",
    "BigBlue Technologies is designing a 3000WH power station now, and they plan to launch it in August. In the meantime they have set up a Facebook group for anyone who is interested in learning the latest news or has questions or comments about the power station."
  ],
  "headers": {},
  "links": {
    "BigBlue": "https://bigblue-tech.com/",
    "Indiegogo crowdfunding campaign": "https://www.indiegogo.com/projects/bigblue-cellpowa500-develop-your-off-grid-space/x/26240288#/",
    "BigBlue Gleam giveaway": "https://gleam.io/competitions/QBvv2-bigblue-cellpowa-500-portable-power-station-global-giveawaytotal-10-winners",
    "Facebook group": "https://www.facebook.com/groups/bigbluelatestnews"
  }
}