{
  "source": "https://www.techradar.com/news/the-best-thing-about-vr-playing-old-school-shooters",
  "title": "The best thing about VR? Playing old school shooters",
  "category": "gaming",
  "updated": "2021-03-14T14:00:39Z",
  "author": "robert-zak",
  "summary": "Opinion: first-person party like it’s 1999",
  "article": [
    "2020 was a breakthrough year for VR, when big questions were finally answered about the medium’s ability to host blockbuster games with full-blooded stories and graphics that could compete with consoles and PC. There was Walking Dead: Saints and Sinners, with its moral quandaries and freedom of approach and, of course, we got Half-life: Alyx, a technical marvel that proved to be just as seminal for VR as its predecessors were for PC gaming.",
    "I own both of the above games and love them dearly. They’re the champions that VR has long been crying out for - proof to the wider gaming public that it’s a serious gaming platform. But I have a confession: I haven’t completed either of them and don’t know when I will.",
    "That’s because I’ve been too busy playing far older, uglier, but no less memorable games in VR. Namely, some of the great first-person shooters of bygone eras. Thanks to my Oculus Quest 2, the sideloading app SideQuest and the work of a wonderful modder called DrBeef, I’ve been seamlessly playing the likes of Quake 2, Hexen, Half-life and Doom 1, 2 and 3 (even Doom 64!) in VR, and I can’t get enough. The future’s going to have to wait because right now I’m completely submerged in the past and I don’t want to leave.",
    "There’s something about exploring the seminal spaces of these old games in VR - Half-life’s Black Mesa, Doom’s Mars bases, Quake’s industrial nether spaces - that reinvigorates them, making me appreciate their level design like never before and recreating that sense of slack-jawed wonder I felt when I first experienced them.",
    "They’re surprisingly well suited to VR too. A part of that is their mechanical simplicity and fast pacing that lends itself well to short sessions, but it’s also the fact that their environments are so clean and clutter-free. This is of course a byproduct of the technological limitations of the time, but those perfectly angled corners, the repetitive textures, the lack of detritus everywhere, the spaces that often feel too vast for the people inhabiting them; all these things make these game worlds feel just as comfortable to inhabit in VR as the modern blockbusters (Half-life 1’s awkward platforming sections notwithstanding).",
    "This isn’t necessarily a criticism of Alyx or Saints and Sinners - I love doing stupid things like sweeping junk off shelves like a tantrum-throwing teen in a supermarket, or putting a dead Headcrab in a crate and marching around with it. But after about 20 minutes of playtime, I feel like my head’s just come out of a microwave.",
    "These are beautiful games, but there’s so much intense environmental stimulation pressed right up against my retinas that it can get a little claustrophobic in there. I also spend so much time goofing around with the physics that I can come away from a session having hardly progressed the plot - a classic case of Gamer Guilt.",
    "Shooters in the 90s didn’t slow you down with storylines and cutscenes - they just handed you a gun (and a whole lot more guns soon thereafter) and got you to shoot first, ask questions never. The relatively short levels of earlier id Software games feel more in line with your more typical short-form VR experiences too, which tend to be divided up into snappy, manageable little missions that clearly punctuate your progress and give you convenient points to call it a day.",
    "The aged graphics and enduring celebrity status of Half-life and Doom et al. (does a week go by without news of a new Doom mod or new toaster/calculator/pregnancy test that you can play it on?) obviates one of the things that made them so monumental in the first place: they were really effective horror games.",
    "Here, VR becomes a kind of sensory time machine, resurrecting feelings that these classics evoked when we first played them. The breathy snarls of a pinky demon lurking around one corner or the next sound all the more menacing when you know that the creature you eventually face will literally loom over you. In VR, you can now stand at a corner and lean out from behind it to scout for (and even cover-shoot) enemies; these inherently VR touches and movements help reignite the long-lost suspense of these games. Even Doom’s regular gunner grunts, who always looked a bit vertically stunted on PC screens, become strapping slabs of pixels in VR. It all looks meatier, more formidable.",
    "The relatively unloved Doom 3, meanwhile, with its shadowy sepulchral corridors and imps jumping out of inexplicably hidden closets, becomes a powerful jumpscare simulator - like VR darling Five Nights at Freddy’s but with the ability to double-barrel your assailants in the face.",
    "Incidentally, a mere couple of months later Bethesda unexpectedly announced its own VR version of Doom 3 would be coming to PSVR. Perhaps the bigwigs are finally starting to see that there’s money to be made here, and we could be looking at the start of a whole wave of old games being revived in virtual reality, backed by full development teams and publisher funding.",
    "These games were designed to make you feel oppressed, jumpy, trapped - they just lost their impact through the attrition of time and advancing technologies.",
    "Reexperiencing these games through VR not only revives those feelings but invites you to poke around and look for details you might not have spotted the first time around. For example, in Half-life I never really paid attention to the suffocating halogen strip lighting casting its grey rays all over Black Mesa. In VR, you really feel that coldness, and suddenly appreciate why all the scientists have the moribund pallor of vitamin-D-deficient zombies.",
    "At one point, I literally got down on my hands and knees (you need to swallow some pride to fully enjoy VR) to inspect the body of a dog I’d just shot in Quake, and noticed for the first time that the poor pooch had a startled expression on its face. I always thought these were faceless monster mutts, not helpless animals that were probably trained in a perpetual cycle of violence and fear.",
    "You’d think that blowing 90s games up to VR size would merely exaggerate their smeary textures and low polygon counts, but in almost all instances you can find high-resolution texture and other mods that beautify the games. You can play Half-life 1 with a complete texture overhaul - so detailed that you can see each individual drink option on the vending machines around Black Mesa, and stare straight into the G-Man’s rather mesmerizing green eyes. You can use the wonderful Brutal Doom mod to turn any of the early Doom games into a cathartic, splattery bloodbath - perfect for unwinding after a day’s work - and replace the weapon models with 3D weapons.",
    "Just whatever you do, do not use the QuestZDoom launcher’s 3D monster models - it will be an ugly reminder of why some things are best left untouched.",
    "A session with one of these games doesn’t last longer than one in Alyx or Walking Dead, but I come away feeling more satisfied with my fix, and less exhausted too. Maybe that’s because of their relative visual simplicity, or perhaps because they’re so familiar to me that playing them in VR is oddly relaxing - like wandering around a refurbished stately home where you’re amazed at just how golden those candelabras are when the years of tarnish have been rubbed away (though for some reason the whole place is strewn with blood and viscera).",
    "I’ll get back to those VR blockbusters one day, and will continue to support the medium by buying the games that push it forward. But right now I’m FPS’ing like it’s 1999 and I just can’t stop. A VR mode has already been confirmed for the upcoming remaster of System Shock 2, which really makes the mind wander - Thief 2 VR, Deus Ex VR? I’d pay good money to see these golden oldies revived in a way that only VR is capable of.",
    "All the above games were sideloaded onto my Oculus Quest 2 through SideQuest, a sideloading app for PC that has a vast library of games not available elsewhere. All this is free, but you’ll need to own the PC version of whatever it is you want to play and copy key files over from the PC version onto your Quest 2. The games are super-cheap these days, and it doesn’t matter if it’s the Steam, DRM-free or original CD version."
  ],
  "headers": {
    "3": "Full 2.5D",
    "7": "Old new wave",
    "17": "Back to the Future"
  },
  "links": {
    "Half-life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "announced": "https://www.techradar.com/news/six-new-psvr-games-are-on-the-way-heres-everything-you-need-to-know",
    "SideQuest": "https://sidequestvr.com/"
  }
}