{
  "source": "https://www.techradar.com/news/apples-new-imac-could-be-unleashed-on-april-20-with-rumors-now-coming-thick-and-fast",
  "title": "Apple’s new iMac could be unleashed on April 20, with rumors now coming thick and fast",
  "category": "computing",
  "updated": "2021-04-18T10:14:11Z",
  "author": "darren-allan",
  "summary": "One tweet provides a render to give us an idea of what the redesigned iMac might look like",
  "article": [
    "Apple could be planning to unleash a new iMac on the world at its ‘Spring Loaded’ event which takes place in just a couple of days on April 20.",
    "Two sources on Twitter have just pushed this rumor, one of those being well-known Apple leaker l0vetodream, who tweeted an image of the graphic on the event invite alongside an old shot of G3 iMacs (as spotted by MacRumors). There’s no text, but this is clearly a suggestion that a new iMac is about to debut, as past speculation has contended that the revamped M1-powered all-in-one will be available in a choice of striking colors (as was the case with the G3 way back in 1998).",
    "Furthermore, Ian Zelbo (@RendersbyIan), who recently provided us with leaked renders of the Google Pixel Watch in conjunction with Jon Prosser, posted a render of the purported incoming iMac on Twitter, noting that based on leaks by Prosser (again), Apple is unleashing a new iMac at the big event on Tuesday.",
    "Jon Prosser, of course, was the source of previous leakage including that the redesigned iMacs will be available in that wide range of colors.",
    "All this – plus some other recent nuggets from the rumor mill, like the discovery of references to unreleased iMac models already being present in macOS Big Sur – is starting to make it seem like there’s a much stronger possibility of an iMac launch coming on April 20 than we previously imagined. Not to mention very recent reports of dwindling stock of existing iMac models, in terms of the 21.5-inch version (which could obviously be seen as a clear-out before a new launch).",
    "Apple’s event is expected to have a focus on the iPad Pro 2021 and much-rumored Apple Airtags, but that’s not to say that there won’t be something else happening at ‘Spring Loaded’ on the iMac front (arguably, the ‘loaded’ part of the title suggests a ton of stuff being announced, theoretically including that revamped iMac).",
    "Also worth bearing in mind is that leaker l0vetodream has previously floated speculation about the larger iMac coming with an even bigger screen – providing more real-estate than the current 27-inch panel – in its new form. As ever, time will tell, and in this case we really don’t have long to wait thankfully…"
  ],
  "headers": {
    "4": "All signs point to yes?"
  },
  "links": {
    "new iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "at its ‘Spring Loaded’ event": "https://www.techradar.com/news/apples-april-20-event-is-official-heres-what-to-expect-including-ipad-pro",
    "tweeted": "https://twitter.com/L0vetodream/status/1383349327658057728",
    "MacRumors": "https://www.macrumors.com/2021/04/17/leaker-new-imacs-apple-spring-event/",
    "M1-powered": "https://www.techradar.com/news/apple-m1-chip",
    "provided us with leaked renders": "https://www.techradar.com/news/google-pixel-watch-leak-hints-at-the-most-stunning-smartwatch-yet",
    "Google Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "redesigned iMacs will be available in that wide range of colors": "https://www.techradar.com/news/check-out-what-an-ipad-air-inspired-imac-m1-could-look-like",
    "unreleased iMac models already being present in macOS Big Sur": "https://www.techradar.com/news/has-apples-imac-2021-surprise-been-spoiled-by-macos-big-sur-beta",
    "reports": "https://arstechnica.com/gadgets/2021/04/21-5-inch-imac-supply-dwindles-amid-chip-shortages-possible-refresh/",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Apple Airtags": "https://www.techradar.com/reviews/apple-airtag-review",
    "larger iMac coming with an even bigger screen": "https://www.techradar.com/news/apples-new-imac-could-have-a-much-bigger-display-than-existing-27-inch-flagship"
  }
}