{
  "source": "https://www.techradar.com/news/apples-airpods-max-finally-get-a-fix-for-dodgy-battery-life",
  "title": "Apple's AirPods Max finally get a fix for battery life problems",
  "category": "audio-visual",
  "updated": "2021-03-18T11:25:58Z",
  "author": "olivia-tambini",
  "summary": "A firmware update has saved the day",
  "article": [
    "The Apple AirPods Max are among the best wireless headphones you can buy today – but some users have found the battery to drain completely overnight, when the headphones should be in a low power mode in their Smart Case.",
    "Now Apple seems to have addressed the problem via a new firmware update, with users noting a vast improvement in the longevity of their headphones.",
    "While Apple hasn't confirmed whether firmware update 3C39 really does improve battery drainage issues, tests carried out by 9to5Mac's Guilherme Rambo seem to confirm that battery life is lost far less quickly after the update:",
    "Furthermore, it appears that the AirPods Max now enter their low power mode far more quickly when placed in the Smart Case. Previously, this would take up to 18 hours, and according to 9to5Mac, this now takes just 30 minutes, which should significantly improve overall battery life.",
    "The update also reportedly improves compatibility with iOS 14.5, fixing an issue where the noise-cancelling headphones would crash after connecting to a device running this operating system.",
    "Unfortunately there's no way to manually update your AirPods Max to the new firmware version – however, they should automatically update when charging and near an iPhone.",
    "If you want to check which firmware version your AirPods Mac are using, you can do so by opening the Setting app on your iPhone and heading to the Bluetooth menu. You should be able to see your AirPods Max in a list of devices – tap the 'i' next to them. Then, you'll be able to see the firmware version number – the number you're looking for is 3C39."
  ],
  "headers": {
    "5": "How can I update my AirPods Max?"
  },
  "links": {
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "best wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "9to5Mac's Guilherme Rambo": "https://twitter.com/_inside/status/1370406681604194309",
    "9to5Mac": "https://9to5mac.com/2021/03/12/airpods-max-battery-drain-issues-fixed/",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490"
  }
}