{
  "source": "https://www.techradar.com/news/squarespace-sees-significant-share-price-boost",
  "title": "Squarespace sees significant share price boost",
  "category": "computing",
  "updated": "2021-05-27T16:30:00Z",
  "author": "abigail-opiah",
  "summary": "Three weeks as a public company and stock prices are back up",
  "article": [
    "Popular website builder Squarespace saw a 25% increase in its stock price following a disappointing recent drop to below its $50 reference price.",
    "At $54.16, Squarespace is now sitting above its reference price, as the firm sits comfortably into its third week as a public company.",
    "NYSE set the company's reference price at $50 on May 19 just before the firm's direct listing commenced under the symbol “SQSP”.",
    "The American website building and hosting company did not meet expectations on its first trading day as its stocks finished at $43.65, down 12.7% from SQSP’s $50 reference level.",
    "Squarespace has had a number of wins this year, with the most recent being its $10bn valuation after raising an additional $300m in its latest round of funding.",
    "The company, which filed to go public via a direct listing last month, offers an all-in-one solution for users wanting to create websites, offering domains, hosting, e-commerce solutions and more.",
    "The website building provider did not raise fresh capital with the offering but its stockholders had the option to sell or not sell their shares.",
    "Other companies that have done direct listings recently include Coinbase, Roblox, Palantir, Spotify and Slack.",
    "With the firm’s direct listing, Squarespace didn’t hire underwriters to market the stock to institutional investors, rather, some of its pre-IPO shareholders made their stocks available to the public.",
    "Squarespace competes against firms like Wix, Shopify and Weebly in the website building sector. The company hosts over 800 million small businesses and self-employed ventures globally."
  ],
  "headers": {
    "3": "Squarespace shares"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "direct listing": "https://www.techradar.com/news/squarespace-dodges-ipo-in-replace-of-direct-listing",
    "Roblox": "https://www.techradar.com/news/best-roblox-games",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Squarespace competes against firms like Wix": "https://www.techradar.com/news/wix-vs-squarespace-which-is-better"
  }
}