{
  "source": "https://www.techradar.com/news/amd-now-lets-windows-10-gamers-with-radeon-gpus-play-local-co-op-remotely",
  "title": "AMD now lets Windows 10 gamers with Radeon GPUs play local co-op remotely",
  "category": "gaming",
  "updated": "2021-04-20T15:12:08Z",
  "author": "darren-allan",
  "summary": "AMD Link app is revamped to flesh out streaming features",
  "article": [
    "AMD now lets gamers hook up with each other to play local co-op games remotely on their Windows 10 PCs, which could obviously be a boon for socially-distanced gaming – with one major caveat.",
    "The catch being that the Windows 10 PCs involved must all be running an AMD graphics card (not just the host computer).",
    "This new functionality arrives with the latest AMD Radeon Adrenalin graphics driver (version 21.4.1), courtesy of the AMD Link version 4.0 software. The ‘Link Game’ feature allows for playing local co-op (or multiplayer split-screen) in remote fashion (in much the same vein as Steam’s cool Remote Play ability). However, as mentioned, Nvidia GPU owners are excluded from the fun.",
    "The (free) AMD Link app has also introduced the ability to stream a game from your host gaming PC to another Windows 10 computer, or you can stream to a phone, tablet or smart TV. In the latter case, support has been brought in for Android TV 7.0 or better, or Apple TV 4th and 5th generation running tvOS 12.x or better.",
    "AMD further notes that the Link app now supports up to 144 frames per second for smoother gameplay (assuming your hardware is capable of that), 4K streaming, and it also caters for 5.1 surround sound.",
    "Various other improvements have been ushered in with the new Adrenalin graphics driver, including different installation options, one of which is a minimal installation with a streamlined interface, or indeed there’s a graphics driver-only install.",
    "There’s a new ‘streaming wizard’ here, too, which aims to help first-time users configure their recording and streaming settings, getting up and running with a minimum of fuss."
  ],
  "headers": {
    "3": "TV smarts"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "AMD graphics card": "https://www.techradar.com/news/amd-big-navi",
    "Steam’s cool Remote Play ability": "https://www.techradar.com/news/steams-remote-play-goes-live-and-may-be-the-best-thing-to-happen-to-pc-multiplayer-in-ages",
    "Nvidia GPU": "https://www.techradar.com/news/nvidia-geforce"
  }
}