{
  "source": "https://www.techradar.com/news/want-an-android-phone-with-magsafe-realme-might-have-what-you-need",
  "title": "The Galaxy S22 likely won't get the iPhone 12's key feature, but this phone might",
  "category": "phones",
  "updated": "2021-12-05T14:11:03Z",
  "author": "tom-bedford",
  "summary": "A MagSafe-ish feature",
  "article": [
    "While Samsung phones and iPhones compete on many fronts, we're not expecting the Samsung Galaxy S22 to get anything akin to the iPhone 12's top feature. The tool in question, MagSafe, was a way of magnetically clipping on accessories like wireless chargers, cases and more, and while it didn't set the world on fire as much as some Apple fans insist, an Android phone might soon embrace something similar.",
    "Realme recently teased an upcoming handset, the Realme Flash , via its Twitter, and shortly after that GSMArena posted lots of information about the phone that someone leaked to the site. Take it with a pinch of salt, as we don't have much information about the source, but there are images and detailed information about the device.",
    "According to GSMArena - and something heavily implied in the introduction to this article - the Realme Flash will debut Realme's MagDart tech. MagDart, apparently, is a magnetic charger which clips onto the back of the Flash, using wireless charging to easily power up the device.",
    "GSMArena's leak only details magnetic charging, but if the Realme Flash has magnets in the back of it, presumably clip-on cases, wallets and more are also feasible.",
    "The leak adds that the Realme Flash will have a curved-edge screen with a 'punch-hole' cut-out for the front-facing camera, a Qualcomm Snapdragon 888 chipset, 12GB RAM, 256GB storage and will come running Android 11. There's no news when this phone is coming, but with Realme literally teasing it, we likely won't be waiting too long.",
    "Apple put a bow on MagSafe, to make it seem like a truly premium feature, with accessories touting top-tier price tags. So is Realme also making a premium smartphone?",
    "It'd be strange for Realme to put out a premium phone, since the relative newcomer is thriving so well in the mid-range market.",
    "In fact, it's odd that Realme would opt to copy a feature from Apple at all - Samsung is usually first to pinch the big A's features, with Xiaomi no slouch either - but Realme has thrived so far on making impressive budget powerhouses, and has shied away from the premium-phone race.",
    "Could that change with the MagSafe - sorry, MagDart - laden Realme Flash? Well, probably not, no. That's because, despite what Apple wants you to think, magnets just aren't a premium feature. In fact, they're not even new to phones.",
    "A few other phones have used magnetic clip-on chargers before - certain gaming smartphones like the Black Shark 3 have offered the feature so you can power up the phone while you play - though Realme could be the first brand outside of that gaming niche.",
    "Hopefully, Realme could do something great with MagDart though - it could take a feature we've only seen in top-end handsets (even if it's not a premium feature in itself) and put it in a phone that costs less. Then, it'd be doing something Samsung could only dream of - democratizing consumer tech.",
    "We've not heard rumors of any other smartphone taking up magnets in a serious way, not the flagship Samsung Galaxy S22 line or equivalents from OnePlus, Oppo or Xiaomi.",
    "So just because Realme has slapped a magnet onto the back of a decent-sounding smartphone that doesn't mean it's going to suddenly start competing with the Samsung Galaxy S21, Xiaomi Mi 11 or Vivo X60 Pro. No, it's probably just trying to undercut the iPhone 12 by offering a cheaper alternative."
  ],
  "headers": {
    "5": "Analysis: Is Realme building a premium smartphone?"
  },
  "links": {
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "iPhones": "https://www.techradar.com/news/best-iphone",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Realme Flash": "https://twitter.com/realmeIndia/status/1419545519127367682",
    "GSMArena": "https://www.gsmarena.com/exclusive_realme_flash_is_the_first_android_phone_with_magnetic_wireless_charging-news-50232.php",
    "Android 11": "https://www.techradar.com/news/android-11",
    "gaming smartphones": "https://www.techradar.com/news/best-phone-for-gaming",
    "Black Shark 3": "https://www.techradar.com/reviews/xiaomi-black-shark-3-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Vivo X60 Pro": "https://www.techradar.com/reviews/vivo-x60-pro"
  }
}