{
  "source": "https://www.techradar.com/news/how-to-watch-the-mysterious-benedict-society-stream-the-new-series-on-disney-plus-from-anywhere",
  "title": "How to watch The Mysterious Benedict Society: stream the new series on Disney Plus",
  "category": "computing",
  "updated": "2021-06-25T05:00:21Z",
  "author": "alice-marshall",
  "summary": "Embark on a mystery adventure",
  "article": [
    "Based on Trenton Lee Stewart's children's book series of the same name, Disney brings to life The Mysterious Benedict Society in this delightful mystery adventure. One for all the family to enjoy, here's how to watch The Mysterious Benedict Society online on Disney Plus.",
    "Following four gifted orphans, Reynie, Sticky, Kate, and Constance are invited to attend Boatwright Academy, their curious benefactor tasking them with stopping the widespread emergency created by the consistent onslaught of bad news. If only it were that simple, eh?",
    "Earning a scholarship to the Boatwright Academy, Reynie joins the equally gifted Sticky Washington, Kate Wetherall, and Constance Contraire. Here they are put through gruelling tests to prove their abilities, before ultimately receiving a perilous mission of infiltrating the L.I.V.E Institute to put a stop to the anxiety gripping the globe due to the ceaseless bad news.",
    "Meanwhile, they'll also have to deal with the very relatable battles of school bullies, odd benefactors, and the familiar Dr. Curtain, who may just be behind the scheme leaving the world paralyzed with fear after all.",
    "With the first two episodes dropping on June 25, make sure you know how to watch The Mysterious Benedict Society in full with the help of a Disney Plus subscription.",
    "Disney Plus is already cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. Obviously you have to splash the cash at the start, but with so much content to get stuck in to we very much doubt you'll run out of things to watch before the 12 months are up. You're looking at $79.99/£79.90/AU$119.99 for the year.",
    "Or if your interests are farther reaching (and you're in the US), then we'd seriously suggest looking at the fantastic value bundle package. It adds Hulu and ESPN Plus to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Helstrom and Normal People. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $13.99 a month.",
    "For more adventures for all the family to enjoy, The Mysterious Benedict Society is just one of many exclusive titles available on Disney Plus. Here you can also watch Love, Victor and The Mighty Ducks: Game Changers. Of course, you'll also find other Disney and Disney Pixar gems including Soul, Hamilton, and Loki.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "In addition, now that Disney has set the precedent of releasing movies like its live-action Mulan remake on the service instead of in theaters through its Disney Plus Premier Access program, expect the company to keep bringing more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021. Most recently, it's the way to watch Cruella online, with Black Widow on the way come July with Black Widow.",
    "And finally, there's the new Star on Disney Plus that most global markets get to enjoy and sees the amount of content available through Disney Plus more than double, with a particular eye to shows grown-ups are going to enjoy.",
    "It's available in the UK, most of Europe, and other select markets like Australia and New Zealand - but not in the US, where the media giant's Hulu service already has very similar ground covered.",
    "Read more:"
  ],
  "headers": {
    "5": "How to save money on Disney+",
    "7": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Disney Plus subscription": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-8890003507871238000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "$79.99/£79.90/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-2552166673683166700&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN Plus": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $13.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1148397412472891000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Love, Victor": "https://www.techradar.com/news/how-to-watch-love-victor-season-2-online-stream-brand-new-episodes-now",
    "The Mighty Ducks: Game Changers": "https://www.techradar.com/news/how-to-watch-the-mighty-ducks-game-changers-online-stream-the-new-disney-plus-series-today",
    "Loki": "https://www.techradar.com/news/how-to-watch-loki-stream-new-marvel-series-online-from-anywhere",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "watch Cruella online": "https://www.techradar.com/news/how-to-watch-cruella-online-and-stream-the-full-movie-on-disney-plus-anywhere",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}