{
  "source": "https://www.techradar.com/news/china-limits-online-video-games",
  "title": "China to limit online video games for minors to just three hours a week",
  "category": "gaming",
  "updated": "2021-08-31T06:38:42Z",
  "author": "will-shanklin",
  "summary": "China to ban online gaming except for Fridays, weekends and holidays if you're under 18",
  "article": [
    "It’s ‘game over’ for playing video games in China on most weekdays if you’re a minor. China will soon ban children – anyone under 18 years of age – from playing online video games beyond three hours per week.",
    "Under the new rules, online gaming companies in China can only offer services to minors for one hour a day between 8 pm and 9 pm on Fridays, Saturdays, Sundays, and holidays. Online gaming on other days and at other times is strictly prohibited for minors, according to CNBC.",
    "China is home to highly successful online gaming companies like Tencent and NetEase, which will be forced to contend with the new restrictions. The rules appeared on Monday in a posting by the China National Press and Publication Administration.",
    "The Chinese government is also forcing gaming companies to use a real-name registration and login. This requirement would prevent children and teens from working around the restrictions, using alternate accounts with fake ages.",
    "China’s notice frames the move as a way to curb video-game addiction and prioritize children’s mental and physical health.",
    "In 2019, the World Health Organization added gaming disorder to its list of classified diseases. The controversial move was disputed not only by gamers and gaming companies but also sizable portions of the scientific community, who described it as a “push to pathologize video games.”",
    "China has a long history of restricting video game use. In 2019, it had adopted a less strict set of rules, allowing children under 18 to play up to 90 minutes of games on most days. In 2000, the country had banned the sale and manufacturing of game consoles, citing similar concerns about children’s health. It didn’t remove that restriction until 2015."
  ],
  "headers": {
    "4": "Restrictive or productive?"
  },
  "links": {
    "CNBC": "https://www.cnbc.com/2021/08/30/china-to-ban-kids-from-playing-online-games-for-more-than-three-hours-per-week.html",
    "posting": "http://www.nppa.gov.cn/nppa/contents/719/98785.shtml",
    "added gaming disorder to its list of classified diseases": "https://www.techradar.com/news/world-health-organization-officially-classifies-gaming-disorder-as-an-illness"
  }
}