{
  "source": "https://www.techradar.com/news/gigabyte-cmp-30hx-officially-announced-but-price-and-release-date-still-a-mystery",
  "title": "Gigabyte CMP 30HX officially announced but price and release date still a mystery",
  "category": "computing",
  "updated": "2021-04-14T18:57:05Z",
  "author": "john-loeffler",
  "summary": "Will this finally help gamers for RTX cards?",
  "article": [
    "The first Nvidia mining GPU has officially appeared online with the announcement of the Gigabyte CMP 30HX card, bringing the cryptomining processor one step closer to the consumer market.",
    "While Nvidia had announced its new CMPs months ago, we had yet to see any official releases of the new cards by Nvidia or its partners. Nvidia said its first two CMPs, the 30HX and the 40HX, would launch in the first quarter of its 2022 fiscal year, which ends in May, so these cards would be coming out just under the wire.",
    "The 30HX CMP is Nvidia's entry-level cryptomining card with the lowest hash rate, 26 MH/s, of any of the announced CMPs so far. As VideoCardz notes, the Gigabyte CMP 30HX is built with a Turing TU116-100 GPU, 6GB GDDR6 RAM, and 1,408 CUDA cores, so the card is essentially a modified Nvidia GTX 1660 Super.",
    "There isn't anything on Gigabyte's product page for the CMP 30HX about pricing or availability, but we have reached out to Gigabyte for more information and will update the story with that information if it is available.",
    "With the official announcement of the new Gigabyte CMP 30HX – which we already knew existed – Nvidia mining GPUs are starting to make it to the consumer market. So far, the two cards that we've seen from Gigabyte and Palit online – both 30HXs – have not been the most impressive hardware we've ever seen, to say the least.",
    "With a hash rate of 26MH/s, the 30MX underperforms cards like the Radeon RX 480 and GTX 1070 Ti, which are much more readily available and cheaper than the prices we've seen for the 30HX so far.",
    "All of that can change, however, if the MSRP of the 30HX and upcoming 40HX are priced much more competitively than these other cards. At the end of the day, cryptominers care about making money, which means making back the initial investment on the graphics cards.",
    "It can take almost an entire year for miners to break even on an RTX 3090 or RTX 3080 right now given the obscene markups we're seeing online, especially from resellers on eBay and StockX. What good is the far superior hash rate of these cards if you end up losing money on them? Ethereum and Bitcoin prices are highly volatile, so the quicker a miner can cross the break-even mark and start making pure profit, the more attractive that card is going to be.",
    "Now that Nvidia CMPs are starting to make it to market, hopefully we can finally see what kind of investment these cards are going to require. If the early markups we've seen online are any indication, the cards are being valued at around $720 (about £525 / AU$940) by the two retailers we've seen so far.",
    "Without an MSRP from Gigabyte or Nvidia, we don't know if this price is anywhere close to what the consumer cards will sell for from major retailers. If Nvidia and its board partners flood the market with dirt cheap CMPs until their more powerful CMPs based on Nvidia Ampere GPUs are released later this year, that could make all the difference in the success or failure of these cards and their impact on the graphics card supply overall."
  ],
  "headers": {
    "4": "Nvidia CMPs are starting to hit the market. Will they make a splash?"
  },
  "links": {
    "appeared online": "https://www.gigabyte.com/Graphics-Card/GV-N30HXD6-6G#kf",
    "VideoCardz": "https://videocardz.com/newz/gigabyte-offically-launches-its-cmp-30hx-mining-card",
    "Nvidia GTX 1660 Super": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super",
    "we already knew existed": "https://www.techradar.com/news/gigabyte-nvidia-cmp-30hx-for-sale-online-and-appears-to-confirm-our-worst-fears",
    "Radeon RX 480": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/amd-radeon-rx-480-review-1324113/review",
    "GTX 1070 Ti": "https://www.techradar.com/reviews/nvidia-gtx-1070-ti",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere"
  }
}