{
  "source": "https://www.techradar.com/news/the-dark-web-is-becoming-more-dangerous-than-ever",
  "title": "The Dark Web is becoming more dangerous than ever",
  "category": "computing",
  "updated": "2021-10-19T12:34:52Z",
  "author": "mayank-sharma",
  "summary": "Dark web experiment finds that cyber criminals are particularly interested in breaking into US Government network",
  "article": [
    "A new study has revealed that stolen data spreads 11 times faster on the dark web today than it did six years ago.",
    "Conducted by cybersecurity vendor Bitglass, the study concludes that the dark web has become darker, busier, and more widespread than ever before.",
    "Bitglass arrived at this conclusion by recreating an experiment they back in 2015, and comparing the results.",
    "The researchers listed links to fake files with supposedly stolen credentials on various dark web marketplaces. These boobytrapped files helped the researchers keep tabs on the files as they circulated on the dark web, gathering valuable insight into the dynamics of the underground marketplace.",
    "According to Bitglass’ report, breach data received over 13,200 views in 2021 as opposed to a mere 1100 views in 2015, registering a whopping increase of 1100%.",
    "Also, while it took almost two weeks to reach the 1100 views back in 2015, it took less than a day to breach that milestone.",
    "“We expect that the increasing volume of data breaches as well as more avenues for cybercriminals to monetize exfiltrated data has led to this increased interest and activity surrounding stolen data on the Dark Web,” reasons Mike Schuricht, who heads the Bitglass Threat Research Group.",
    "Interestingly, of all of the types of data Bitglass researchers floated on the dark web as part of their experiment, data to access retail and US Government networks received the most clicks, 37% and 32%, respectively.",
    "Furthermore, the number of anonymous viewers on the Dark Web in 2021 (93%) outnumber those in 2015 (67%).",
    "“In comparing the results of this latest experiment to that of 2015, it is clear that data on the Dark Web is spreading farther, faster. Not only that, but cybercriminals are getting better at covering their tracks and taking steps to evade law enforcement efforts to prosecute cybercrime,” concludes Schuricht"
  ],
  "headers": {
    "4": "Fast and furious"
  },
  "links": {
    "dark web": "https://www.techradar.com/news/what-is-the-dark-web-how-safe-is-it-and-how-to-access-it-your-questions-answered",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Bitglass": "https://www.techradar.com/news/millions-of-patients-affected-by-healthcare-breaches-last-year"
  }
}