{
  "source": "https://www.techradar.com/news/2021-macbook-pro-14-inch-gets-early-black-friday-deal-for-students-and-teachers",
  "title": "2021 MacBook Pro 14-inch gets early Black Friday deal for students and teachers",
  "category": "computing",
  "updated": "2021-10-22T09:35:28Z",
  "author": "gerald-lynch",
  "summary": "Brand new MacBooks at ridiculously low prices",
  "article": [
    "Apple is renowned for offering great discounts on its products for students and educators, but it’s being beaten at its own game by The EDU Store, which is offering the brand new M1 Pro MacBook Pro at a cheaper price for those in education than even its own student-and-teaching-staff discount can offer. And that's before the Black Friday deals ramp up and kick in.",
    "So long as you can prove you are in education, the 14-inch MacBook Pro with M1 Pro can be picked up for just £1,571.08 – a saving of 8%, or £137.72 under the Apple student discount standard price.",
    "It seems like Apple really took on any criticism of its more recent MacBook Pro models with the new 2021 versions. Full of ports, including a HDMI port and full-size SD card port, and dropping the battery-sapping and -used TouchBar, it seems to tick many of the boxes Apple MacBook fans have been after for years.",
    "Browse even more great MacBook Pro deals from around the web:",
    "UK deals:"
  ],
  "headers": {
    "2": "Today’s best MacBook Pro deal",
    "3": "More MacBook Pro deals"
  },
  "links": {
    "offering the brand new M1 Pro MacBook Pro": "https://www.theedustore.co.uk/mac/macbook-pro/14-inch-macbook-pro-apple-m1-pro-chip-with-8-core-cpu-14-core-gpu-16gb-ram-512gb-ssd-space-grey-4-year-warranty",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "£1,571.08 – a saving of 8%, or £137.72 under the Apple student discount standard price": "https://www.theedustore.co.uk/mac/macbook-pro/14-inch-macbook-pro-apple-m1-pro-chip-with-8-core-cpu-14-core-gpu-16gb-ram-512gb-ssd-space-grey-4-year-warranty"
  }
}