{
  "source": "https://www.techradar.com/news/deathloop-headlines-july-state-of-play-but-dont-expect-horizon-forbidden-west",
  "title": "Deathloop headlines July State of Play, but don't expect Horizon Forbidden West",
  "category": "gaming",
  "updated": "2021-07-06T15:14:18Z",
  "author": "hamish-hector",
  "summary": "Horizon Forbidden West also won't be at the showcase",
  "article": [
    "In and amongst all the Nintendo Switch OLED news, Sony has made sure it won't be forgotten by announcing a State of Play for this Thursday, July 8 2021. The show kicks off at 2PM PT / 10PM BST / 11pm CEST and will go on for 30 minutes.",
    "The short showcase will focus on third-party and indie games, with Bethesda's Deathloop being the headliner for the event. If you're hoping for big announcements like God of War, Horizon Forbidden West or the next generation of PlayStation VR though, you'll be out of luck.",
    "If you want to tune in for the State of Play, you can head over to Sony's official Twitch or YouTube channel to catch all the news as it happens. Don't worry if you can't tune in, as we'll be sure to catch you up on all the important news during and after the event.",
    "Deathloop is an interesting one to be headlining the event as we already know quite a lot about it. We've seen plenty of gameplay and know its release date (September 14, 2021). Hopefully, this deeper dive will manage to deliver something worthwhile, as otherwise, Sony might end up disappointing us.",
    "As for other games, it's hard to predict what might get shown off as we know so little. Every showcase dedicated to indie games will have us looking out for long-awaited games like Hollow Knight: Silksong, but most likely we'll see ANNO: Mutationem and Season. Both of these titles are meant to be releasing this year on PlayStation consoles, though details on either are currently sparse.",
    "Hopefully, Sony will find some way to surprise us with some bigger announcement or reveal, even if it isn't God of War or Horizon, as otherwise this week's State of Play is at risk of being lost in all the gaming news noise. Especially with a new console announcement."
  ],
  "headers": {
    "3": "What do we hope to see at State of Play?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PlayStation VR": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "Twitch": "http://twitch.tv/playstation",
    "YouTube": "http://youtube.com/playstation"
  }
}