{
  "source": "https://www.techradar.com/news/this-playstation-5-controller-patent-isnt-as-bananas-as-you-might-think",
  "title": "This PlayStation 5 controller patent isn’t as bananas as you might think",
  "category": "gaming",
  "updated": "2021-03-03T14:51:57Z",
  "author": "rhys-wood",
  "summary": "Sony’s officially gone bananas...or has it?",
  "article": [
    "Sony has filed a patent that explores the concept of using everyday objects as an alternative to your DualSense controller – even fruit. You might think Sony’s lost the plot with this one, but thankfully, there’s a bit more to it.",
    "The patent, spotted by gamesindustry.biz, demonstrates the concept with a banana as the object of choice. While there’s a great deal of humor to be mined from this, the tech involved does actually sound quite promising when you read into the patent’s finer details.",
    "In short, what Sony aims to achieve with the patent is to offer alternative, more cost-effective ways to play games on PS5. The patent states that there are many different types of controller, many of which can be expensive to both manufacture, purchase, and keep maintained and charged.",
    "The patent states: \"It would be desirable if a user could use an inexpensive, simple and non-electronic device as a video game peripheral…” This is where Sony’s example of a banana comes in, but the patent isn’t just limited to perishable items. Really, most “non-luminous” physical objects could work, such as a bottle, a plush toy, or anything lying around the house, really.",
    "It sounds bizarre, but there does seem to be a method. A camera would be used to track the object in the user’s hands. Depending on the game and the object in use, the camera can then map button placements onto the object and recognize inputs via the camera. As of yet, we don’t know if the existing PlayStation Camera could be used for this, or if a new device entirely would be required.",
    "Honestly, it does sound like quite a novel idea. Not everyone has the funds to pony up for a second controller, or expensive peripherals that work with certain games, as may be the case with the PSVR 2. It’s not too dissimilar to toys-to-life functionality, where recognized figures and objects could be “scanned in” to the game you’re playing, as we’ve seen with Nintendo’s amiibo figures as well as the defunct Disney Infinity series.",
    "The patent could also present a workaround for the DualSense’s analog stick drift problem. As far as we know, pomegranates don’t have this issue, and might offer a clever alternative to combating stick drift woes. Plus, using a banana as a controller shouldn’t feel out of leftfield for Sony – we still have nightmares about that PS3 boomerang controller design.",
    "Of course, there’s no guarantee that the patent will come to fruition. It’s a neat idea, but might just be a bit too gimmicky and fall out of line with PlayStation’s sleek, bespoke designs, especially when it comes to the DualSense and its haptic feedback capabilities."
  ],
  "headers": {
    "3": "A mug's game"
  },
  "links": {
    "patent": "http://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PG01&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.html&r=1&f=G&l=50&s1=%2220210031110%22.PGNR.&OS=DN/20210031110&RS=DN/20210031110",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "gamesindustry.biz": "https://www.gamesindustry.biz/articles/2021-03-02-sonys-controller-tech-is-literally-bananas-patent-trawling",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "amiibo": "https://www.techradar.com/news/gaming/nintendo-amiibo-everything-you-need-to-know-about-nintendo-s-toys-to-life-figures-1271347",
    "Disney Infinity": "https://www.techradar.com/news/gaming/choking-hazard-disney-kills-disney-infinity-and-abandons-console-game-development-1321070",
    "DualSense’s analog stick drift": "https://www.techradar.com/news/ps5-stick-drift-might-be-inevitable-according-to-this-comprehensive-teardown",
    "PS3 boomerang controller design": "https://en.wikipedia.org/wiki/Sixaxis"
  }
}