{
  "source": "https://www.techradar.com/news/tesla-holds-dollar248-billion-of-bitcoin",
  "title": "Tesla holds $2.48 billion of Bitcoin",
  "category": "computing",
  "updated": "2021-05-06T11:02:53Z",
  "author": "anthony-spadafora",
  "summary": "Automaker's initial investment in Bitcoin has already earned it $1bn",
  "article": [
    "US automaker Tesla purchased $1.5bn worth of Bitcoin at the beginning of this year and the company's investment already looks to be paying off as it now holds $2.48bn of the cryptocurrency.",
    "In a filing with the US Securities and Exchange Commission (SEC) back in January of this year, the automaker revealed that it had updated its investment policy to provide the company “with more flexibility to further diversify and maximize returns” on its cash.",
    "Tesla also announced that it will soon begin accepting payments in Bitcoin for its vehicles which helped boost the price of the cryptocurrency even higher.",
    "While the company has not yet begun accepting Bitcoin for payments, in a support page on its site, Tesla is quite clear about the fact that for now, other cryptocurrencies won't be supported, saying:",
    "“For now, Tesla only accepts Bitcoin — not Bitcoin fork products (like Bitcoin Cash and Bitcoin SV) or any other types of digital assets. (Our wallet will not receive or even detect any other digital assets.) Please make sure you only send us Bitcoin because any other digital asset sent might end up lost or destroyed (and we’re not responsible if that happens).”",
    "In a new filing with the SEC regarding its first quarter performance, Tesla revealed that the fair market value of the Bitcoin in its wallet as of March 31 was $2.48bn.",
    "If the company were to sell the Bitcoin gained since its initial investment in January, it could be poised to make around $1bn dollars. While Tesla doesn't plan on selling the majority of its gains anytime soon, it did sell off 10 percent of its Bitcoin holdings during Q1.",
    "According to Tesla, proceeds from sales of its Bitcoin holdings amounted to $272m with a $101m “positive impact”. However, the company also said that it recorded $27m of impairment losses on its bitcoin investment during the first quarter of this year.",
    "Tesla purchasing such a large amount of Bitcoin has been a big deal for the cryptocurrency as it has helped drive up its price while also instilling confidence in it. In fact other companies have since followed suit such as Square which bought a much smaller $170m worth of Bitcoin at the end of February.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies.",
    "Via Reuters"
  ],
  "headers": {
    "5": "Growing investment"
  },
  "links": {
    "Tesla": "https://www.techradar.com/news/tesla-will-make-its-fully-autonomous-mode-accessible-to-more-drivers",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "accepting payments in Bitcoin": "https://www.techradar.com/news/bitcoin-price-hits-new-record-high-after-tesla-confirms-dollar15bn-purchase",
    "support page": "https://www.tesla.com/support/bitcoin",
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "new filing": "https://www.sec.gov/ix?doc=/Archives/edgar/data/1318605/000095017021000046/tsla-20210331.htm",
    "wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "drive up its price": "https://www.techradar.com/news/tesla-has-already-made-dollar1bn-profit-on-its-bitcoin-investment",
    "Square": "https://www.techradar.com/news/square-follows-tesla-by-going-big-on-bitcoin",
    "Reuters": "https://www.reuters.com/business/autos-transportation/tesla-says-bitcoin-investment-worth-248-billion-2021-04-28/"
  }
}