{
  "source": "https://www.techradar.com/news/linkedin-wants-to-help-freelancers-find-their-next-job",
  "title": "LinkedIn wants to help freelancers find their next job",
  "category": "computing",
  "updated": "2021-10-28T10:03:54Z",
  "author": "sead-fadilpasic",
  "summary": "New freelancer-focused features coming to LinkedIn",
  "article": [
    "LinkedIn has unveiled new feature looking to help freelancers and businesses find each other easier as remote working grows more popular.",
    "Called Service Marketplace, the premise of the feature is quite simple - it will let people advertise themselves for short job opportunities, or gigs, instead of long-term, full-time engagements. By doing so, LinkedIn is directly going against the best freelance websites, such as Upwork and Fiverr.",
    "The trick will be whether to tilt more towards the freelancers, or the businesses. While Fiverr leans more towards the freelancers (people advertise their skills and competencies, and businesses scroll in search of the ideal candidate), Upwork leans more towards businesses (firms can post job ads for which freelancers can apply and bid with their own rates).",
    "In that respect, it seems as LinkedIn will be more like Upwork, as businesses can review freelancers, but freelancers can’t review businesses.",
    "The launch of the platform comes almost a year after it was first tested in the US market, managing to gather roughly two million users, according to TechCrunch.",
    "The wbesite is now opening the tool up to its estimated 800 million users worldwide, potentially giving it a major advantage against competitors. According to Wikipedia, Upwork has roughly 23 million users, while Fiverr services roughly 2.5 million people and businesses.",
    "Those interested in creating their own freelancer profile and boosting their productivity should go to their LinkedIn page and look for the button near the top, below the photo and bio sections. There, they can follow the script and set up what they want to work on.",
    "Right now, Service Marketplace is free, and launches with some 250 job categories. According to Tech Crunch, it plans on expanding it to at least 500 in the future.",
    "Looking to boost your hiring? You should also take a look at our list of the best HR software out there right now"
  ],
  "headers": {
    "3": "Successful testing"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "best freelance websites": "https://www.techradar.com/best/best-freelance-websites",
    "TechCrunch": "https://techcrunch.com/2021/10/27/linkedin-rolls-out-its-freelance-services-marketplace-globally-after-picking-up-2m-users-in-smaller-us-beta/",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "best HR software": "https://www.techradar.com/best/best-hr-software"
  }
}