{
  "source": "https://www.techradar.com/news/microsoft-outlook-will-soon-give-you-a-new-way-to-compose-messages-on-the-fly",
  "title": "Microsoft Outlook will soon give you a new way to compose messages on the fly",
  "category": "computing",
  "updated": "2021-09-27T11:08:34Z",
  "author": "joel-khalili",
  "summary": "Forget typing, how about dictation?",
  "article": [
    "Microsoft is working on an update for its Outlook email service that will give users more options for composing messages on Android devices.",
    "According to a new entry in the company’s product roadmap, Outlook users will soon be able to dictate email messages, as well as calendar appointment and meeting content, instead of relying on their touchscreen keyboard.",
    "Already available for desktop and iOS devices, Outlook speech-to-text functionality is set to be extended to Android by the end of the month.",
    "Once dictation mode is live, users will be able to activate the feature by tapping on the microphone icon above the keyboard. A large blue version of the same icon indicates the mode is active and the user can begin to dictate.",
    "There are two options for punctuating messages: a command-based system (whereby users say “period”, “colon” etc. out loud) and an auto punctuation feature. While the former method is likely to be more precise, the latter option allows users to dictate freely without interrupting their flow.",
    "Although some might argue dictation is slower and less convenient than typing out a message, especially given the opportunity for inaccuracies, proponents of speech-to-text often say dictation becomes second nature after a while.",
    "And in any case, the availability of speech-to-text functionality across all devices is not just about convenience, it’s also an important accessibility upgrade for users whose dexterity is limited by a medical condition.",
    "In these scenarios, the new feature will ensure that all Outlook users are able to compose email messages effectively, whether at home or on the move."
  ],
  "headers": {
    "3": "Speech-to-text in Outlook"
  },
  "links": {
    "email service": "https://www.techradar.com/news/best-email-provider",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-6292367315522705000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D72994",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "speech-to-text": "https://www.techradar.com/news/best-speech-to-text-app"
  }
}