{
  "source": "https://www.techradar.com/news/why-ive-started-binge-watching-king-of-the-hill-instead-of-the-simpsons",
  "title": "Why I've started binge-watching King of the Hill instead of The Simpsons",
  "category": "entertainment",
  "updated": "2021-07-04T11:07:19Z",
  "author": "samuel-roberts",
  "summary": "Swapping one animated comfort-food sitcom for another",
  "article": [
    "At its height, animated sitcom King of the Hill was one of Fox's most popular shows in the US. In the UK, where I'm watching it, there's almost no audience at all for the series, as far as I know.",
    "When Disney Plus launched its adult-oriented Star channel in the US, pretty much every major Fox series landed on the service – Family Guy, American Dad, Bob's Burgers and Futurama. King of the Hill is sadly absent, leaving some strangely pricey DVDs as my only legal route to watch it.",
    "I can see why it doesn't have much of a footprint here. Unlike The Simpsons, which has an enormous UK audience, King of the Hill is about a more specific version of the American family experience – set in the fictional town of Arlen, Texas, it's clearly rife with local references, and types of characters who represent the real people you might encounter in these places where British tourists are never likely to visit.",
    "Following the day-to-day lives of the Hill family and their neighbors, the show spends one slightly muted season finding its voice, then immediately hits its stride. The show has a little more texture than The Simpsons, and is definitely more adult – when I watched it as a teenager, I didn't get it at all.",
    "Now I'm closer to the age of conservative patriarch Hank Hill than to his slightly disappointing Millennial wannabe performer son Bobby, and there's a lot more for me to enjoy. If you're a fan of The Simpsons, but you've done the long rewatch a few too many times (if such a thing is possible), I suggest putting King of the Hill in your rotation. It's unbelievably good – it's both timeless, but firmly of its time, much as The Simpsons is, and just as rewarding to rewatch.",
    "No, King of the Hill isn't better than The Simpsons, though comparing them isn't terribly fair. But there's more to appreciate as an adult – it tackles subjects like generational differences between parents and their children, the morality of affairs, and self-worth in ways that feel more realistic than when The Simpsons covers these issues.",
    "The part of the show I love the most is Hank's relationship with Bobby. It captures something very specific: a failed athlete father's inability to live vicariously through his son, who is more interested in prop comedy and eating fruit pies than playing football. Bobby is an overweight, Game Boy-playing Millennial who's comfortable with his interests, even when his father quietly disapproves (though in a deeply endearing way). Bobby is a brilliant creation, and closer to the reality of a 90s boy than Bart Simpson was.",
    "The differences between Hank and Bobby are summed up in this clip from episode 1 of the show, though both characters subtly change over the next few seasons:",
    "King of the Hill is actually quite comforting as a time capsule of the late 1990s and early 2000s – summed up by its choice of guest stars, including Chris Rock, Sarah Michelle Gellar, Reese Witherspoon and Matthew McConaughey.",
    "One area where it's dated surprisingly well is its politics. The show makes no bones about Hank being conservative, and it's a show set in a red state – but one episode shows us that he won't vote for a candidate with a weak handshake (which in 1999, happens to Hank after he meets George W Bush). The show doesn't excuse or exclude certain points of view, instead choosing to depict its characters as complicated human beings, and accepting that their conservative politics are a part of their world.",
    "It would be tough to make a new show now that approaches politics in this way. It's a more barbed, openly political age, which has its upsides, and healthily suggests there should be consequences for who you vote for. But King of the Hill feels very nuanced in the way it depicts this part of American life – it doesn't judge its characters, it just portrays them as richly as possible and lets the audience make their minds up.",
    "I find all of that pretty interesting as a British viewer; but in reality, I'm mostly watching King of the Hill for this sort of nonsense:",
    "The main criticism leveled at later seasons of King of the Hill is that it got repetitive, or too wacky, in a similar way to how The Simpsons is largely considered a lesser series after season 11. There's something in that. Arlen doesn't have as vast a range of characters as Springfield does, and there are probably some limitations to the premise – 13 seasons was a lot, even if many would argue it was still gone too soon.",
    "Recent rumors, though, spurred on by writer Brent Forrester in a Reddit AMA, suggest that a contemporary reboot is in the works for King of the Hill, with a revamped premise to reflect the changing times. This would be a perfect way to continue the story: unlike other animated shows, King of the Hill does reflect the passage of time to a degree – it's heavy on continuity, and characters do age, which adds its own comedic potential.",
    "The idea of picking up with the characters more than a decade later, then, is exciting. A crankier, 60-something retired Hank Hill has a lot of promise, though I dread to think what state his lonely, overweight friend Bill Dauterive will be in, in this day and age. More exciting would be discovering what Bobby Hill is up to in his thirties – hopefully still lightly disappointing his father.",
    "I've still got a long way to go in this marathon, but I can see a world in which King of the Hill comes up in my rewatching rotation as often as Futurama does. At their best, these long-running animated shows are comforting rewatches – and I'll confess that I haven't clicked with many modern shows of this type in the same way.",
    "I will note this about King of the Hill, however. Aside from an active and insightful Reddit community, it doesn't have the same persistently fevered following that The Simpsons or Futurama does – or at least, not one on the same scale. I can't really read good episode recaps anywhere, or find more than a couple of decent features discussing the best episodes.",
    "If it comes back for more seasons that will hopefully change. It's a series that has stood the test of time, and which deserves that depth of appreciation.",
    "King of the Hill is streaming on Hulu in the US. You can't stream it in the UK, sadly, but the DVDs are available if you don't mind tracking them down."
  ],
  "headers": {
    "5": "Better than The Simpsons?",
    "12": "Back from the dead?"
  },
  "links": {
    "reboot is in the works for King of the Hill": "https://www.techradar.com/news/animated-sitcom-king-of-the-hill-is-close-to-a-revival"
  }
}