{
  "source": "https://www.techradar.com/news/every-amazon-device-announced-today-from-amazon-astro-home-robot-to-echo-show-15",
  "title": "Every Amazon device announced on September 28, from Astro home robot to Echo Show 15",
  "category": "smart-home",
  "updated": "2021-10-04T10:13:37Z",
  "author": "gerald-lynch",
  "summary": "Bezos bot steals the show",
  "article": [
    "Quality over quantity seemed to be the mantra of today’s annual Amazon hardware showcase.",
    "Where previous years have seen the retail and technology giant rattle off dozens of product announcements for two hours, from Amazon Kindles to Echo smart speakers, the retailer company this year instead remained relatively reserved in the number of devices it revealed. Though just half a dozen or so brand new hardware products were shown off, what was previewed tended to be more noteworthy than mere line refreshes.",
    "There’s no new Echo speaker to speak of, nor Amazon Fire TV device to gawp at, surprisingly. Instead, we got a look at a cool smart picture frame, integrated security systems, and (best and creepiest of all) a robot for your home.",
    "Read on for the best on show at the Amazon 2021 hardware event.",
    "The headline act, and a relative surprise, the Astro robot is Amazon’s most ambitious device to date. It seems like a monster-mash of all of Amazon’s product innovations, across multiple categories, combining into a single unit. Astro, a shin-high droid that wouldn’t look out of place in the Rebel Alliance base on Hoth, has an Echo speaker’s Alexa voice activating smarts, an Echo Show 10’s rotating display (complete with eyes), and plenty of security features you’d find in a Ring system. Intended to be both an in-the-home helper and something like a robot pet, it can take family snaps, deliver reminders, set timers and even direct video calls with a periscope-like camera.",
    "For those that already find Alexa a bit invasive, Astro will likely seem a nightmare. But there's an obvious application for the roll-along droid to be used in a remote care-giving situation – at least when the person it accompanies isn’t desperately vulnerable. Sure, we all felt a bit isolated during the pandemic, and Astro would likely have been a welcome presence for some. That's without considering the home monitoring and security aspects, too.",
    "Not going up for general sale, but instead via Amazon’s invite-only Day 1 program, Astro will launch sometime in the near future in the US, with an introductory price of $999.99, set to rise to $1,449.99.",
    "We had heard rumors of a large-screen Amazon Echo Show device in the weeks leading up to Amazon’s event and, lo and behold, the rumors were right. The 15-inch Amazon Echo Show 15 offers both traditional Echo Show functionality like the ability to stream content from Amazon Prime Video, Netflix and Sling TV, as well as introduces a few new tricks of its own, like the ability to post custom notes for the family. Its larger form factor makes keeping an eye on calendar events a little easier than its smaller predecessors and can use the optional “Visual ID” profile feature that allows the Amazon Echo Show 15 to recognize a user standing in front of it and customize the content on the screen for that person. The Echo Show 15 launches later this year, priced at $249.99 in the US. It'll be £239.99 in the UK and AU$399 in Australia, with its launch date in the two territories TBC.",
    "The Amazon Glow is something totally different and unique for the little ones. Glow basically combines a touch-compatible projector with an online platform that allows distant relatives to interact with your kids whenever and wherever they’re located through their tablet screen. Amazon Glow has a number of built-in games and apps that family members can complete collaboratively while the screen on the front of the projector has a live feed of the family member on the tablet. Importantly, the Amazon Glow allows parents to restrict who kids can call on the device and the device has a physical button that closes the camera and mutes the microphone. It’s going to be slightly pricey when it launches at $249.99 in the US, but it still looks like a neat way to connect family members across time zones when face-to-face interaction isn’t possible.",
    "Next on Amazon’s hit list? Taking the fight to Fitbit, it would seem. While last year’s screenless Halo fitness tracker from Amazon has us scratching our heads, the Amazon Halo View is a more traditional fitness wearable. The wristband features an AMOLED display and can track data including activity stats, sleep reports, and blood oxygen saturation. It will ping wearers with a haptic feedback system to alert you to smartphone notifications, and will also work with a new Halo Nutrition meal planner system – part of the overarching Halo fitness subscription service. Halo View will launch by the end of the year, priced $79 (about £60 / AU$110), with all purchases coming with a one-year subscription to Halo View. For now, Halo View is only set to launch in the US – we'll keep you posted should that change.",
    "It was only a matter of time before it happened, but Amazon and Disney finally consummated their marriage with the announcement of the new Hey, Disney! smart assistant that runs off the Alexa platform. Hey, Disney! will run on devices inside the Disney parks and hotels to give you information about rides, restaurants and bus schedules – even offering ‘customized’ messages from some of your favorite Disney characters like Mickey Mouse, Olaf, and Dory. What’s unclear at this point is how much the service – if you can even call it that – will cost when you’re outside the park. Unfortunately, we’ll have to wait until Hey Disney! launches on the Alexa Skills store in 2022 to find out. No word yet on a roll out beyond the US, either.",
    "It’s not just Fitbit in Amazon’s sights, but Google’s Nest thermostats, too. The company took its annual showcase to also reveal its Alexa Smart Thermostat – priced incredibly competitively at $59.99 (about £45 / AU$80).",
    "Built in collaboration with Resideo, the makers of Honeywell Home thermostats, it’ll feature Alexa integration and make use of Amazon’s “Hunches” system to learn your preferred temperature settings, and whether or not you are home or away. Controlled via voice or app, select US energy providers will also offer a rebate meaning that the thermostat can be purchased for as little as $10, too, in certain US locations. For now, the Alexa Smart Thermostat is a US-only release.",
    "Two-in-one devices always get a space-saving thumbs up from us, so the Ring Alarm Pro has us intrigued. Not only is it a security device, but it also features a built-in Eero Wi-Fi 6 router too.",
    "The Ring Alarm Pro needs the Ring Protect Pro subscription ($20 a month) to work, and provides the same Wi-Fi 6 coverage as an Eero home router – up to 1,500 square feet of coverage. It’s essentially a backup router then, making sure your security system is always online, should your primary router fail. With local video processing and microSD card support, you can pre-order now in the US for $249.",
    "Remember the fever-dream that was Amazon’s Ring Always Home Cam? You didn’t imagine it – Amazon’s in-the-home, fly-by security drone is real, and finally up for pre-order. Revealed at last year’s event, an invite list to pre-order the video-recording house drone is now open, priced at $249.99 in the US. There’s still no word yet on a wider international rollout, however.",
    "Quite a lot of new subscription services were announced during the Amazon Event – many extensions of their Halo wellbeing line up, or Ring security system updates. A more interesting addition was Alexa Together. Designed as an assisting tool for remote caregiving (as well as a simple way to keep in touch with elderly relatives), it will allow family members to set up smart routines and alerts based on a member’s activity. Alexa Together is designed to give caregivers reassurance that a distant relative is getting about their day without a worrying incident occurring, and offers hands-free, 24/7 access to the Urgent Response organization, a professional emergency helpline."
  ],
  "headers": {
    "4": "Astro home robot",
    "7": "Amazon Echo Show 15",
    "8": "Amazon Glow",
    "9": "Halo View",
    "10": "Hey, Disney!",
    "11": "Amazon Alexa Smart Thermostat",
    "13": "Ring Alarm Pro",
    "15": "Ring Always Home Cam",
    "16": "Alexa Together"
  },
  "links": {
    "Astro robot": "https://www.techradar.com/news/amazons-astro-robot-is-a-24-hour-security-guard-and-smart-assistant-all-rolled-into-one",
    "Amazon Echo Show 15": "https://www.techradar.com/news/amazon-echo-show-15-everything-we-know-about-the-wall-mounted-alexa-device",
    "Amazon Glow": "https://www.techradar.com/news/amazon-glow",
    "Halo View": "https://www.techradar.com/news/amazon-halo-view",
    "Hey, Disney! smart assistant": "https://www.techradar.com/news/new-echo-show-will-turn-alexa-into-mickey-mouse",
    "Nest thermostats": "https://www.techradar.com/deals/best-nest-thermostat-deals",
    "Alexa Smart Thermostat": "https://www.techradar.com/news/amazon-launches-the-alexa-smart-thermostat-to-rival-google-nest",
    "Ring Alarm Pro": "https://www.techradar.com/news/amazon-ring-alarm-pro-is-a-security-system-and-wi-fi-6-router-all-in-one",
    "Ring Always Home Cam": "https://www.techradar.com/news/amazon-rings-new-dronecamera-hybrid-will-fly-around-and-record-your-home",
    "an invite list to pre-order the video-recording house drone is now open": "https://www.techradar.com/news/rings-home-security-drone-is-one-step-closer-to-going-on-sale"
  }
}