{
  "source": "https://www.techradar.com/news/star-wars-the-high-republic-10-things-you-need-to-know",
  "title": "Star Wars: The High Republic: 10 things you need to know",
  "category": "entertainment",
  "updated": "2021-01-27T17:54:35Z",
  "author": "richard-edwards",
  "summary": "How The High Republic is taking Star Wars into entirely new territory",
  "article": [
    "If you’ve only watched the movies, the whole of Star Wars history spans a mere 70 years. That means there’s a whole lot of galaxy far, far away still left to explore…",
    "The High Republic, a new “multimedia initiative”, sets up a whole new era of Star Wars storytelling. Set two centuries before the events of The Phantom Menace, it sees the Jedi Order at the height of their powers, protecting a Galactic Republic that’s enthusiastically expanding into the Outer Rim.",
    "Like 1996’s Shadows of the Empire (set between The Empire Strikes Back and Return of the Jedi), the story of The High Republic will be told across books, comics and magazines. The initiative kicked off with Charles Soule’s novel Light of the Jedi, and fellow Star Wars storytelling veterans Charles Soule, Claudia Gray, Cavan Scott, Justina Ireland and Daniel José Older are continuing the story in subsequent releases.",
    "But how does The High Republic fit in with existing Star Wars lore? Will we recognize any of the characters? Who are the villains? And how does The High Republic offer up any clues to upcoming movies and TV shows? The answers lie below…",
    "Ever since George Lucas’s original movie in 1977, the Star Wars universe has been a constantly expanding entity, with its own unique history and geography. Despite that vastness, however, every story told so far in the movies and TV shows has been set in a remarkably brief time period – the six-and-a-bit decades between that infamous trade dispute on Naboo (The Phantom Menace) and the climactic battle between the Resistance and the Final Order (The Rise of Skywalker).",
    "The stories of the High Republic era dive into an entirely new time period, some 200 years before the events of the Skywalker Saga. That means that the famous galaxy far, far away looks rather different.",
    "“For over a thousand generations, the Jedi Knights were the guardians of peace and justice in the Old Republic…”",
    "When Obi-Wan Kenobi got all nostalgic in A New Hope, he may have been thinking about the glories of the High Republic era. While these stories take place years before he was born, these halcyon days were arguably the greatest time to be a Jedi. With no Sith issues to worry about, and the Republic trying to spread its utopian vision across the galaxy, it must have been like living in Star Trek’s Federation. This is long before the cracks that led to the Clone Wars started to form.",
    "With the Republic having no military to speak of, the Jedi are a low-touch, galactic police force, with plenty of time to philosophize about the nature of the Force as they mediate disputes around the galaxy.",
    "Like the brilliant Clone Wars series, the High Republic shows that Jedi aren’t just a group of identikit cosmic monks running around with laser swords. They come from vastly different backgrounds – Padawan Burryaga Agaburry is a Wookiee who carries a wooden lightsaber, for example – and have very different approaches to life and the Force. For example, Twi’lek Jedi Master Loden Greatstorm believes in learning by doing, so has a habit of pushing his apprentice off cliffs to force him to get to grips with Force-propelled flight.",
    "Many of the things that we’ve come to take for granted in the Skywalker Saga are in their formative stages in The High Republic. The galaxy’s Outer Rim (home to key Star Wars worlds Tatooine, Yavin 4 and Hoth) is still largely unsettled, and thousands of people are travelling from the core worlds to explore opportunities in these new territories – just as Americans headed west in the 19th century.",
    "Chancellor Elina Soh is the main advocate of the Republic’s expansion, looking to spread her peaceful ideals throughout the galaxy. The new Starlight Beacon space station has been built to act as the Republic’s outpost in the Outer Rim – though the fact that the Republic has no presence on, say, Tatooine in The Phantom Menace suggests they weren’t entirely successful.",
    "Faster-than-light travel is also much more complicated than in the movies, with navigation limited to the few mapped hyperspace lanes. Even bacta, the miracle drug that cures every imaginable ailment in the Star Wars movies is in its formative stages – its miraculous properties have been discovered, but not turned into a mass-produced drug.",
    "At the start of Light of the Jedi, the first novel set in the High Republic era, a major accident takes place in hyperspace. The Legacy Run, a transport vessel carrying settlers to the Outer Rim, collides with an object in hyperspace – previously thought to be impossible – and is destroyed. The debris subsequently emerges from hyperspace at close-to-light speed, creating a dangerous barrage of high-velocity projectiles that threaten to destroy any star system in their path.",
    "As the Jedi mobilize to save millions of live, this “great emergence” leads to the closure of hyperspace lanes throughout the Outer Rim, as the Republic tries to work out how the disaster came about.",
    "There have always been different levels of wrong ’uns in the Star Wars universe, ranging from galaxy-ruling empires to smaller gangster cartels. While there’s no Empire/First Order-scale Big Bad in the High Republic (at least, not yet…), villain duties in Light of the Jedi fall to the Nihil. These masked pirates (of various species, among them a Gungan known as Wet Bub) follow few rules as they plunder whatever they want in the lawless Outer Rim.",
    "There is some structure to their operations, however. Autonomous ‘Tempests’ (led by ‘Tempest Runners’) mostly operate autonomously, but are also somewhat dependent on the ‘Eye of the Nihil’. This quasi-leader exerts control over the organization because they possess “Paths”, crucial routes through hyperspace that give them a strategic advantage over all their rivals.",
    "But with the trailer referring to an “evil that none of us had trained for, that threatens everything we know,” it seems likely the Nihil are just the tip of the iceberg.",
    "While the High Republic stories take place long before most of the characters from the Star Wars movies were born, some species in that galaxy far, far away live so long that they overlap the two eras.",
    "Yoda, famously more than 900 years old in Return of the Jedi, is a powerful Jedi Master, while Yarael Poof – a Jedi Council member in The Phantom Menace – is already part of the Order. It’s also conceivable that other centuries-old characters such as Jabba the Hutt and Maz Kanata will make an appearance at some point. Elsewhere, the San Tekka family – presumably ancestors of Lor San Tekka, the Church of the Force follower who helps Poe Dameron at the start of The Force Awakens – are important business people in the High Republic.",
    "Beyond the characters, Light of the Jedi contains numerous references to worlds that will become important later on – such as Hosnian Prime, one of the worlds the First Order destroys in The Force Awakens – while there’s reference to peace negotiations between the Mon Calamari and Quarren, two races native to the aquatic world of Mon Cala.",
    "The High Republic has been planned as a multi-year project, with the story rolling out across three Marvel-style ‘Phases’: ‘Light of the Jedi’, ‘Quest of the Jedi’ and ‘Trials of the Jedi’. As well as being told across novels and comics, the adventures will play out in stories specifically targeted at child, YA and adult audiences.",
    "The first wave of writers all have previous Star Wars stories on their resumés: the list features Charles Soule, Claudia Gray, Cavan Scott, Justina Ireland and Daniel José Older.",
    "Although the High Republic era will (initially) exist on the page rather than the screen, it will be meticulously designed. According to StarWars.com, many of the concept designs take inspiration from the prequel era, an elegant period before spaceships adopted the mass-produced functionality of Imperial designs.",
    "They even recycled unused designs from the movies, with the insectile design of the small Jedi Vector starfighters originally created for Revenge of the Sith. (In universe, these ships were designed specifically for the Jedi, with analogue controls that could be operated by the Force in a tight spot.)",
    "Meanwhile, the look of the Legacy Run – the ship at the centre of the Great Disaster – was taken from an early design for the Eravana, Han Solo’s Rathtar-carrying freighter in The Force Awakens.",
    "When Disney and Lucasfilm announced all those new Star Wars TV shows in December, most of them (Ahsoka, Rangers of the New Republic, The Book of Boba Fett) were set in the same time period as The Mandalorian. One of the new Disney Plus series, however, will be set during the High Republic era.",
    "Russian Doll co-creator Leslye Headland is showrunning The Acolyte, a new show that “will take the audience into a galaxy of shadowy secrets and emerging dark side powers in the final days of the High Republic era”.",
    "While the Sith are conspicuous by their absence at the start of the High Republic stories, The Acolyte’s official synopsis suggests they’ll be making a comeback pretty soon. Indeed, many have speculated we’ll see Darth Sidious’s old mentor, Darth Plagueis, coming to the fore.",
    "So even if you don’t normally dive into the books and comics of Star Wars’ expanded universe, the High Republic stories could well be essential reading ahead of The Acolyte.",
    "Light of the Jedi by Charles Soule, A Test of Courage by Justina Ireland and The Great Jedi Rescue by Cavan Scott are out now, as is the first issue of Marvel’s High Republic comic series by Cavan Scott and Ario Anindito. Into the Dark by Claudia Gray is published on February 2."
  ],
  "headers": {
    "4": "1. It’s set before the Star Wars you know and love",
    "6": "2. The Jedi are at the height of their powers",
    "9": "3. The Jedi are an eclectic bunch",
    "10": "4. The Star Wars galaxy is still evolving",
    "13": "5. The High Republic stories kick off with a great disaster",
    "15": "6. There’s a new group of villains",
    "18": "7. The High Republic features some familiar faces and places",
    "21": "8. The writers have plenty of Star Wars experience",
    "23": "9. The High Republic era has been designed like a movie or TV show",
    "26": "10. The High Republic sets up an upcoming TV show"
  },
  "links": {
    "Jedi": "https://www.starwars.com/news/inside-star-wars-the-high-republic-meet-the-jedi-knights-and-masters",
    "Nihil": "https://www.starwars.com/news/inside-star-wars-the-high-republic-meet-the-villains",
    "StarWars.com": "https://www.starwars.com/news/inside-star-wars-the-high-republic-meet-the-ships-and-vehicles",
    "new Star Wars TV shows": "https://www.techradar.com/news/the-mandalorian-spin-offs-ahsoka-and-rangers-of-the-new-republic-explained"
  }
}