{
  "source": "https://www.techradar.com/news/google-closes-game-development-studios-but-promises-stadia-will-go-on",
  "title": "Google promises Stadia isn't dead, despite closing own game-development studios",
  "category": "gaming",
  "updated": "2021-02-02T17:26:58Z",
  "author": "nick-pino",
  "summary": "Google’s days of game development are over, for now",
  "article": [
    "Google’s run in game development was short but sweet. The company announced that it plans to shut down its internal development studio and divert all resources to enticing third-party developers to launching games on Google Stadia.",
    "Google only began making its own games in the last two years, and now will close the doors on both its Los Angeles and Montreal game studios, parting ways with Jade Raymond (founder of Ubisoft Toronto and Motive Studios) as well.",
    "“Creating best-in-class games from the ground up takes many years and significant investment, and the cost is going up exponentially,” Google said in a new blog post explaining the decision.",
    "“Given our focus on building on the proven technology of Stadia as well as deepening our business partnerships, we’ve decided that we will not be investing further in bringing exclusive content from our internal development team SG&E, beyond any near-term planned games.”",
    "What those near-term planned games are is anyone’s guess. To date Google has yet to ship any first-party titles and has only landed a handful of exclusive titles through third parties, which makes the decision all the harder to wrap our heads around.",
    "The reasoning behind the move, according to Google, is to free up resources that will allow the company to develop the Google Stadia platform itself:",
    "“Having games streamed to any screen is the future of this industry, and we’ll continue to invest in Stadia and its underlying platform to provide the best cloud gaming experience for our partners and the gaming community. This has been the vision of Stadia since the beginning.”",
    "So what does that mean for Stadia going forward? Well, it means we won’t ever get those first-party games Google promised (bummer) – and could possibly be seen as a move towards obsolescence – but for now there’s going to be very little change for Stadia users and Stadia Pro subscribers.",
    "Your games will all still be there, and nothing is getting removed from the store."
  ],
  "headers": {
    "5": "Game over for Google Stadia? Not yet"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "new blog post": "https://blog.google/products/stadia/focusing-on-stadias-future-as-a-platform-and-winding-down-sge/"
  }
}