{
  "source": "https://www.techradar.com/news/ps5-games-will-never-launch-on-pc-the-same-day-says-former-ceo",
  "title": "PS5 games will never launch on PC the same day, says former CEO",
  "category": "gaming",
  "updated": "2021-10-05T09:45:10Z",
  "author": "hamish-hector",
  "summary": "And we can't see that changing anytime soon",
  "article": [
    "PlayStation has been tentatively dipping its toes into PC gaming for the past few years now by releasing several Steam ports of its best games, and according to former CEO of Sony Interactive Entertainment Shawn Layden, more support is coming. However, he also warns we shouldn’t hold our breath for day and date releases on both PS5 and PC.",
    "During a video interview with the What’s Up PlayStation YouTube channel, Layden divulged a few details about PlayStation’s PC plan when he left the company. In it, he said the plan with PC was “to go out to where these new customers are, these new fans could be” in a hope to sway them over to PlayStation consoles and games.",
    "This would certainly make sense with PC releases like Horizon Zero Dawn which was released on PC and now has a new fanbase that might be desperate to play the PlayStation console-exclusive sequel, Horizon Forbidden West when it releases early next year.",
    "It’s worth noting that Layden retired from his position as CEO of SIE Worldwide Studios just over two years ago in 2019 so his information may be a little out of date.",
    "Considering that since his departure we’ve been plagued by a global pandemic and faced huge PS5 shortages, there’s a strong chance Sony’s internal conversations are very different today than they were back then.",
    "However in terms of PlayStation experts, you can’t do much better than Layden, and so far his comments match up with what we’ve both seen and heard from the company in more recent months. Only time will prove if Layden's predictions are correct, but we'd be inclined to believe him.",
    "Consoles always like to boast the best graphic performance and shortest load times, but we all know the real reason people buy one machine over another is the exclusives; how else do you think Nintendo’s underpowered hardware keeps selling so well?",
    "So you wouldn’t be weird for thinking that giving up that exclusivity to release on PC too would be a bad business decision.",
    "For Sony, it almost certainly would be a bad idea if it wanted to go for a day and date release on both PC and PS5, but for now, that doesn’t seem to be the case. Instead, Sony hopes that the delayed release will help it turn a bigger profit on console exclusive games like Horizon Zero Dawn and Days Gone.",
    "As part of an interview with GQ, current SIE boss Jim Ryan explained that the cost of making games is high and that selling enough copies to break even is more difficult for exclusives as the pool of players is much smaller.",
    "This would be especially true with the PS5 considering how many people still can’t get their hands on them thanks to stock issues and scalpers.",
    "For Microsoft, the strategy gets much more muddy thanks to Windows 11 on PC and Xbox Game Pass, but for Sony it’s all about encouraging players to PS5 first then when the game is old enough releasing it to the masses.",
    "As time goes on we’ll have to wait and see how its PC plans change, but at least we know it’s dedicated to its PC efforts with Uncharted: Legacy of Thieves soon to release on PC. Hopefully, games like God of War and Marvel’s Spider-Man will follow too."
  ],
  "headers": {
    "6": "Analysis: why release on PC at all?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "What’s Up PlayStation": "https://youtu.be/a1vhZJg-3SY",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PS5 shortages": "https://www.techradar.com/news/why-ps5-shortage",
    "turn a bigger profit on console exclusive games": "https://www.techradar.com/news/days-gone-is-coming-to-pc-and-more-playstation-exclusives-are-on-the-way",
    "GQ": "https://www.gq-magazine.co.uk/culture/article/playstation-vr-jim-ryan-interview-2021",
    "Uncharted: Legacy of Thieves soon to release on PC": "https://www.techradar.com/news/uncharted-is-coming-to-ps5and-pc"
  }
}