{
  "source": "https://www.techradar.com/news/xbox-series-x-stock-shortages-could-last-until-june-or-later-microsoft-admits",
  "title": "Xbox Series X stock shortages could last until June or later, Microsoft admits",
  "category": "gaming",
  "updated": "2021-02-01T16:10:45Z",
  "author": "adam-vjestica",
  "summary": "Xbox Series X consoles won’t be widely available for some time",
  "article": [
    "Xbox Series X stock shortages look set to continue throughout 2021, as Microsoft revealed that supply of its next-gen console will be limited until “at least through June”.",
    "Microsoft’s head of investor relations, Mike Spencer, revealed the sobering news in an interview with The New York Times, in which he also added that the company had sold every Xbox unit it had last quarter.",
    "Spencer’s comments line up with those of Microsoft CFO Amy Hood, who previously said that Xbox Series X stock will be “constrained” until at least March 31.",
    "Unfortunately, the promise of readily available Xbox Series X stock has been further hindered by chip shortages from AMD, who produce the Zen 2-based CPU and RDNA 2-based GPU in the Xbox Series X and Xbox Series S.",
    "AMD CEO Dr. Lisa Sue said chip shortages will continue until the middle of 2021, and that she expected to see “tightness” in terms of production capacity throughout the first half of 2021.",
    "Finding either the Xbox Series X or more affordable Xbox Series S in stock has been a challenge for consumers. Ever since pre-orders opened up back in September 2020, the consoles have quickly sold out whenever retailers post new stock.",
    "The lack of supply and high demand hasn’t been helped by scalpers, bots and even gangs who have targeted and taken advantage of the buying frenzy surrounding the next-gen consoles.",
    "Lockdown has also added to buyer's woes as brick and mortar stores have been closed to combat the spread of coronavirus, meaning the consoles have only been available to purchase online.",
    "While the Xbox Series X isn’t widely available, it hasn’t stopped Microsoft from posting a $5 billion quarterly revenue for its Xbox division, which is an all-time high.",
    "The new consoles helped boost hardware sales by 86% for the period, and Microsoft’s revenue from services such as Xbox Game Pass rose by 40%. The new Xbox consoles also became Microsoft's most successful launch in its history.",
    "We're continuing to provide Xbox Series X stock updates to help you secure Microsoft's elusive console, so stay tuned to TechRadar so you don't miss out. You can find a list of quick links below to all the retailers you'll need, but bear in mind the console currently isn't in stock."
  ],
  "headers": {
    "8": "Super seller",
    "11": "Where to buy Xbox Series X UK: quick links"
  },
  "links": {
    "Xbox Series X stock": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "The New York Times": "https://www.nytimes.com/2021/01/29/business/ps5-xbox-console-shortage.html",
    "Xbox Series X stock will be “constrained” until at least March 31": "https://www.techradar.com/news/xbox-series-x-stock-will-be-constrained-until-at-least-march-31-microsoft-admits",
    "chip shortages will continue until the middle of 2021": "https://www.techradar.com/news/ps5-and-xbox-series-x-chip-shortages-will-continue-until-mid-2021-amd-warns",
    "scalpers": "https://www.techradar.com/news/ps5-scalpers-are-probably-the-reason-you-cant-find-sonys-console-in-stock",
    "bots": "https://www.techradar.com/news/ps5-and-xbox-series-x-stock-update-walmart-cracks-down-on-bots-and-scalpers",
    "gangs": "https://www.techradar.com/news/lorries-carrying-ps5-stock-are-being-hit-by-gangs-in-the-uk",
    "Microsoft's most successful launch in its history": "https://www.techradar.com/news/xbox-game-pass-hits-18-million-subscribers-as-microsofts-strategy-pays-off"
  }
}