{
  "source": "https://www.techradar.com/news/samsung-qd-oled-tvs-are-coming-next-year-say-insiders",
  "title": "New Samsung TVs with quantum OLED panels could launch in early 2022",
  "category": "televisions",
  "updated": "2021-07-27T20:01:04Z",
  "author": "henry-st-leger",
  "summary": "Quantum dot OLED screens are imminent, say industry insiders",
  "article": [
    "Samsung's QD-OLED TVs are finally coming into focus – with industry insiders confirming that the hybrid televisions are set to launch in 2022, meaning they'll be included in next year's new Samsung TV range.",
    "The hybrid screens are set to combine the picture advantages of OLED panels (deep blacks, infinite contrast, flexible panels) and Samsung's QLED or quantum dot filters (used to enhance color and contrast) – hopefully offering something that transcends both technologies.",
    "They've been rumored for a long while, but recent reports of QD-OLED prototypes and large financial commitments from Samsung have all pointed to a 2022 launch window, and this latest report confirms that.",
    "The announcement comes not from Samsung itself, but Korea Economic Daily, which has a longstanding reputation for credible industry leaks. It reports that, \"according to industry sources [...] the South Korean tech giant is developing 55-inch and 65-inch quantom dot organic light emitting diode (QD–OLED) TVs for market launch in the first half of 2022,\" with 70-inch models coming later in the year.",
    "The article also states that the upcoming CES 2022 expo will likely see the QD-OLED TVs unveiled for the first time. CES is held every January in Las Vegas, and is usually a hotbed for brand new TV showcases.",
    "One source tells the outlet that “Samsung is strengthening its premium strategy. Next year, it plans to unveil new QLED and QD-OLED TVs in the quantum dot category as well as Micro LED TVs in various sizes.”",
    "Perhaps what's most interesting about this report is its predictions of where these QD-OLED TVs will sit in Samsung's annual TV range.",
    "The report states that these hybrid screens \"will be placed between its top-premium segment of Micro LED TVs and its flagship QLED lines\" – suggesting that they could even sit above the Mini LED and 8K TVs that currently sit at the high-end of Samsung's TV range.",
    "If these sets are even more expensive than the 2021 QN900A flagship, which starts at $4,999 / £5,999 / AU$7,579 for a 65-inch model, they'll likely make little traction in today's TV market – acting largely as a symbolic gesture of what Samsung is technically capable of, and which very few will be able to afford to bring into their homes.",
    "However, the integration of QD-OLED screens may shake things up a little. We could see Samsung reduce the number of QLED and Neo QLED screens in its 2022 range, simplifying their offering in order to make room for these higher-end sets. We could also see them occupy a similar price point to current 8K TVs, positioning them as equal alternatives rather than competitors with a clear winner.",
    "Where QD-OLED TVs sit in Samsung's range, and how well they fare in today's market, will come down to the same thing – the price. If they're too costly, they'll remain what they are today: full of potential, but with little consequence to the everyday buyer who can't get their hands on them.",
    "Via OLED–info"
  ],
  "headers": {
    "3": "Coming back for CES 2022",
    "6": "Analysis: Where do QD-OLED TVs fit into Samsung's strategy?"
  },
  "links": {
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "QD-OLED prototypes": "https://www.techradar.com/news/samsung-oled-tv-hybrids-are-in-the-works-says-report",
    "large financial commitments from Samsung": "https://www.techradar.com/news/new-samsung-tvs-could-ditch-lcd-for-oled-as-soon-as-next-year",
    "Korea Economic Daily": "https://www.kedglobal.com/newsView/ked202107250002",
    "CES 2022": "https://www.techradar.com/news/ces-2021-highlights",
    "Micro LED TV": "https://www.techradar.com/news/micro-led-tv",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "QN900A": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "QLED and Neo QLED": "https://www.techradar.com/news/qled-vs-neo-qled",
    "OLED–info": "https://www.oled-info.com/samsung-electronics-launch-its-first-qd-oled-tvs-first-half-2022"
  }
}