{
  "source": "https://www.techradar.com/news/the-top-10-worst-games-for-thalassophobia",
  "title": "The top 10 worst games for thalassophobia",
  "category": "computing",
  "updated": "2021-09-01T13:00:29Z",
  "author": "jess-weatherbed",
  "summary": "Or, put simply, a fear of deep water",
  "article": [
    "Does the idea of scuba diving send you into a panic? Do you watch films like Jaws through your fingers? If you do, chances are you have thalassophobia.",
    "Thalassophobia might not be as familiar to the ear as other fears, such as arachnophobia (spiders) or claustrophobia (confined spaces), but there's a good chance you'll know somebody suffering from it. It can technically be described as a fear of large bodies of water such as the ocean or large lakes – and while it presents differently for each person, it's unlikely that you'd find yourself paralyzed over bathtime.",
    "I myself have severe thalassophobia, as well as submechanophobia (a niche but similar fear of submerged manmade objects). I'll happily take on an entire army of spiders rather than be made to swim in water any deeper than my waist, and it's bad enough send me into a crying mess if I'm surprised by intense underwater scenes in movies or TV shows. Titanic is closer to psychological horror than romance to me.",
    "But movies aren't the only media to take advantage of how unsettling the watery abyss can be, as I've often found in my many years of playing video games. The trope of 'underwater levels' is hardly new, but where some titles can make this a pleasant experience, such as the Aquaria Towers realm in Spyro 2: Ripto's Rage, some games opted for an entirely nightmarish environment.",
    "I've listed the top ten worst games to play if you share my phobia in the hope that you can avoid the same meltdowns I've subjected myself to. Of course, if you somehow enjoy being surrounded by endless murk and untold nightmarish marine life then you might find these need to be added to your 'must play' list.",
    "Let's get the obvious out of the way: Subnautica and Subnautica: Below Zero are two open-world survival games from Unknown Worlds Entertainment that share a common theme: you're deserted on an alien planet that forces you to adapt to the hostile aquatic environment. While the early gameplay is manageable, with crystal clear shallow waters hosting an array of delightful (and non-aggressive) wildlife, you're soon pushed to explore the deeper areas of your watery surroundings.",
    "Monsters lurk in that deep, murky abyss. Appropriately named leviathan-class predators will hunt you down if you get too close, and with the environment being so dark at times, who can really tell how close anything is? Anything could be stalking you from a blind spot behind you – or at least, that's what my brain is telling me if I spend more than five minutes attempting to play through either of these games.",
    "If you love diving simulators then you'll likely love exploring what Subnautica has to offer, but avoid it if you can't stomach sharing your surroundings with sea monsters that want to make a meal of you.",
    "You can download Subnautica on Steam.",
    "I adore the Witcher franchise. It gave me everything I wanted from an RPG, from the soundtrack to the sidequests. I've easily sunk 300+ hours into The Witcher 3 on both PC and PS4, though I'll never fully complete the game. Why? Because a handful of side missions and treasure hunts require you to row your dinky little boat out to some remote patch of the ocean and throw yourself into the depths. No, thank you.",
    "Sure, you have a few potions that can help make the murk easier to see through and help protagonist Geralt hold his breath for longer, but as fearless as the White Wolf may be, I am a twitchy little coward. Drowners and Sirens lay in waiting below the surface to bite at your ankles, whales will swim out of the depths, and the draw distance (the time it takes for graphical assets to appear on screen) means that shipwrecks loom out of the darkness suddenly. As far as I'm concerned, the damn treasure can stay on the ocean floor.",
    "You can download The Witcher 3: Wild Hunt on Steam.",
    "Yo-ho me hearties! If you love the idea of donning an eyepatch and setting sail then this popular multiplayer action-adventure game could be for you. It has everything: Grog! Guns! Giant, ship-destroying megalodons? Ah, the pirates' life may not be for me.",
    "Indeed, the actual sailing and swashbuckling aspect of Sea of Thieves is incredible, and arguably one of the best online multiplayer experiences available right now, especially when you play with a crew of your friends: they're called 'shipmates', after all, but If you too hold a fear of the sea then you'd best hope you don't fall overboard.",
    "Getting stranded in the middle of the ocean isn't ideal, but at least there are mermaids that help teleport you back to your vessel. That doesn't mean the experience of swimming around in choppy waters, with lord only knows what swimming below you is any fun though. If you've got your sea legs then I recommend giving it a try (and it's free on Xbox Gamepass), but if you're as lily-livered as I am, you might be best sticking to the taverns.",
    "Play for free on Xbox Gamepass, or download Sea of Thieves on Steam.",
    "Can you have a list of underwater games without including Andrew Ryan's soggy utopia? Bioshock rose to seemingly overnight fame when it hit the shelves back in 2007, and while this original retrofuturistic shooter is now a beloved cult classic, it's the second game of the franchise that fills me with reminiscent dread. In particular, an early scene that serves as your first introduction to the Little Sister character in which, after she smashes several windows, the entire ocean pours in to greet you.",
    "This is one of my earliest recollections that made me aware of my phobia. Water levels in games typically give you some warning or preparation, time for people like me to spiral for several minutes before trying to grit your teeth and push through. Only BioShock 2 doesn't let you take your time, instead, forcing your character to take a long walk across the ocean floor to a door that will let you back inside the submerged city. Nightmare fuel barely covers it.",
    "You can download BioShock 2 (Remastered) on Steam.",
    "I was a dinosaur kid growing up, so ARK was an obvious choice of survival game for me to play with a few friends. I was very content running around, punching dodo's and riding around on the back of a triceratops, but when you get to the midgame, you need better resources than the wood and stone that's readily available around the island. Thing is, those resources are at their most plentiful at the bottom of the ocean floor, an ocean full of giant sharks and other aggressive sea monsters.",
    "Worse still, there are shallow areas of water that you can swim around in like rivers and lakes, but when these connect to the ocean they don't do so in a gentle slope. Instead, you're faced with a sheer, deep cliff that seems to go endlessly down into the murk below. It's safe to say I haven't made much effort to try taming any aquatic animals yet, despite playing the game for a few years, because that would require me to actually go and find them. No, thank you.",
    "You can download ARK: Survival Evolved on Steam.",
    "If you're not put off by Early Access then Raft is well worth checking out, and is actually one of the more manageable games on this list if the idea of fighting off a persistent shark doesn't give you the creeps.",
    "Raft is an open-world survival game that requires you to upgrade and expand your teeny raft as you sail around looking for resources and stabbing seagulls. Thankfully, it's also multiplayer, which means cowards like myself can assign themselves as 'raft mom', tending to the cooking stations and choosing what color to paint the makeshift rooms, while your braver friends can dive down hunting for scrap and metal ore.",
    "If you're playing solo though, you'll need to drop anchor and take the plunge when you find an island to pillage for resources, which is going to require a bit of swimming. The shallow water is tolerable (provided you avoid the aforementioned shark), but try not to fall off the raft while it's in motion... you're probably not getting back on again.",
    "You can download the Early Access version of Raft on Steam.",
    "If you've ever played Dead by Daylight but think it isn't spooky enough, you might like Depth, an asymmetrical multiplayer game that pits treasure-hunting divers against sharks. If you play as a diver then you'll start each game being lowered onto the ocean floor in a shark cage, surrounded by some typically nightmarish stuff like shipwrecks or deep-sea caves.",
    "It's safe to say I've never played Depth, and I never will. Watching a few hours of gameplay on Twitch was more than enough to convince me that I can't cope with the visceral image of being torn apart by a man-eating shark that seems to be juicing with something to swim towards you so quickly. And trying to not have a meltdown when seeing submerged ships and other machines popping out of the gloom as you run away? Impossible. I can feel my anxiety spiking already.",
    "You can download Depth on Steam.",
    "As frightening as the previous games on this list may be to folk like myself, Soma is the first actual horror game to make an appearance – a blend of survival and psychological horror to be precise. If games like Amnesia: The Dark Descent are your bread and butter then you're in luck, as Soma was created by the same developer, Frictional Games.",
    "Set in an eerily abandoned underwater research facility, you'll encounter rusting robots, puzzles and, of course, terrifying monsters that you're powerless to defend yourself against. It's hardly a new premise for video games, but I'm more willing to cower behind rocks in underground mines or run into cupboards aboard a spaceship than I am trying to avoid fish monsters in a soggy, submerged laboratory –or worse yet, at the bottom of an incredibly dark trench on the ocean floor.",
    "You can download Soma on Steam.",
    "The Tomb Raider franchise was one that I'd try to forgive for its inclusion of the 'water level' trope, right from its first game back in 1996 where you had to swim between rooms using flooded tunnels. That said, Tomb Raider: Underworld goes a step further, by donning Lara with some scuba gear and sticking you at the bottom of the Mediterranean Sea. Regardless of how attractive Ms. Croft was to my young, queer self, nothing will sell me on enduring that.",
    "The landscape will appear out of the gloom thanks to our old friend draw distance, while you solve puzzles and have the life scared out of you by a giant octopus. It's dark, the audio is creepily accurate, and swimming around the vast seafloor is a genuinely terrifying experience. Sorry Lara, some treasures will have to stay in their watery resting place.",
    "You can download Tomb Raider: Underworld on Steam.",
    "There are numerous VR experiences and games that stick you into the sea with the promise of an immersive interaction with some wildlife, but Ocean Rift appears to be one of the more popular choices.",
    "Right from the selection menu, it appears you're standing at the bottom of some dark, bubbling trench, something I'm sure the developer intended to be a calming experience, but in actual fact is some elaborate form of psychological torture. Who knows what's swimming behind you? Given you're donning a VR headset, you can spin yourself around in paranoia until you're sick with fear.",
    "And of course, the actual animal interactions are just as awful. Even the jovial sea turtles should probably be a soothing experience, but instead, you'll find yourself constantly on edge because this is VR, and if you lose focus it really does feel like you've been plunged into the sea to swim with these creatures.",
    "There are some interactions that are intended to be scary of course, with 'Deep Sea', 'Blue Sharks' and 'Orcas' available to select if you ever wanted to know what it feels like to wet yourself while thinking you're about to be consumed by animals so terrifying that they were placed as far away from human civilizations as possible.",
    "You can download Ocean Rift on Steam."
  ],
  "headers": {
    "5": "1. Subnautica",
    "9": "2. The Witcher 3",
    "12": "3. Sea of Thieves",
    "16": "4. BioShock 2",
    "19": "5. ARK: Survival Evolved",
    "22": "6. Raft",
    "26": "7. Depth",
    "29": "8. Soma",
    "32": "9. Tomb Raider: Underworld",
    "35": "10. Ocean Rift VR"
  },
  "links": {
    "Subnautica: Below Zero": "https://www.techradar.com/news/subnautica-below-zero-dives-onto-pc-ps5-xbox-series-x-and-switch-in-may",
    "download Subnautica on Steam.": "https://store.steampowered.com/app/264710/Subnautica/",
    "download The Witcher 3: Wild Hunt on Steam.": "https://store.steampowered.com/app/292030/The_Witcher_3_Wild_Hunt/",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
    "Xbox Gamepass": "https://www.techradar.com/reviews/xbox-games-pass",
    "download Sea of Thieves on Steam.": "https://store.steampowered.com/app/1172620/Sea_of_Thieves/",
    "download BioShock 2 (Remastered) on Steam.": "https://store.steampowered.com/app/8850/BioShock_2/",
    "download ARK: Survival Evolved on Steam": "https://store.steampowered.com/app/346110/ARK_Survival_Evolved/",
    "download the Early Access version of Raft on Steam": "https://store.steampowered.com/app/648800/Raft/",
    "download Depth on Steam": "https://store.steampowered.com/app/274940/Depth/",
    "download Soma on Steam": "https://store.steampowered.com/app/282140/SOMA/",
    "Tomb Raider: Underworld on Steam": "https://store.steampowered.com/app/8140/Tomb_Raider_Underworld/",
    "download Ocean Rift on Steam.": "https://store.steampowered.com/app/422760/Ocean_Rift/"
  }
}