{
  "source": "https://www.techradar.com/news/what-the-panasonic-gh6-means-for-micro-four-thirds-cameras",
  "title": "What the Panasonic GH6 means for Micro Four Thirds cameras",
  "category": "cameras",
  "updated": "2021-07-01T16:32:15Z",
  "author": "amy-davies",
  "summary": "Could it reinvigorate the small(er) sensor market?",
  "article": [
    "Mirrorless cameras have been around for more than a decade now, with all of the latest innovations and big-name releases appearing in this sector of the market. The DSLR market is almost certainly in its final throes, and it definitely feels like the future is without mirrors.",
    "That said, the mirrorless market itself has recently been obsessed with full-frame sensors, sacrificing one of the original major selling points of the mirrorless camera. Their more compact form has been lost as companies (perhaps understandably) promote higher image quality over portability.",
    "For that reason, the recent development announcement of the Panasonic GH6 feels like an out-of-the-ordinary moment for continuing with the somewhat beleaguered Micro Four Thirds format from which we haven't heard much of late.",
    "Let’s take a look at the early days of mirrorless, of which Panasonic was a pioneer. It released the Lumix G1 back in October 2008 and kick-started a revolution in camera technology that has continued to this day.",
    "At that time, Micro Four Thirds was being heralded as the perfect blend of portability and image quality. The sensors may not have been as large as full-frame, but they were certainly larger than anything you’d find in a compact camera and enabled you to carry a whole bag of lenses in a relatively small bag. Olympus wasn’t far behind, launching its own line of cameras using the same sensor and mount.",
    "It didn’t take long for other companies to get in on the act and declare that the Four Thirds sensor was too small, however, claiming that bigger equals better. Sony introduced its APS-C format NEX models just a couple of years later in 2010.",
    "For a few years, then, we had a battle between Four Thirds and APS-C, while the biggest and most recognisable camera brands such as Nikon and Canon all but ignored the idea together – they were resolutely sticking with DSLRs. Deciding that even APS-C was too small, the first full-frame mirrorless models were introduced in 2013 from Sony in the form of the A7 and A7R.",
    "From that moment on, the mirrorless market was shook up, and although for a few years there was still plenty of Micro Four Thirds options, in more recent times, new announcements in this format have all but disappeared.",
    "Now, all the major players – including mirrorless resisters Nikon and Canon – are releasing full-frame mirrorless models at a rapid pace. Even Micro Four Thirds pioneer Panasonic finally succumbed, adding its on S-series full-frame line in 2018. Throw in troubled times for Olympus – which was sold at the beginning of this year – and you’d be forgiven for thinking that Micro Four Thirds was soon to be a thing of the past.",
    "At the same time, the market was also facing increasing pressure from the smartphone industry, which has been producing ever more remarkable camera-equipped handsets over the past 10 years. With smartphones on one side and full-frame mirrorless models on the other, Micro Four Thirds has been stuck in an awkward halfway-house limbo for some time. It offers neither the true portability of your mobile phone – you’ll almost certainly never be able to jam a Panasonic GH camera in your pocket – nor the high-resolution crispness and super low-light capabilities of its full-frame rivals.",
    "All that said, Panasonic’s GH line was always a bit of a standout, since it was so favoured by film makers and video content creators. The GH5 was the go-to camera for that type of user for some time, but having been on the market since January 2017, it was starting to feel a little long in the tooth. With Panasonic throwing plenty of video nous at its S-series models, including the Panasonic S5 (a full-frame camera in the small body of the GH), many thought that perhaps the GH line was also dead in the water.",
    "That was until a development announcement confirmed some long-held rumours that GH6 was on the way, along with the interim announcement of the GH5 Mark II – a body that's largely the same as its predecessor, but now with added streaming capabilities. We don’t yet know many specifics about the the GH6’s specs, but we do know that it will feature a high-speed sensor and processor, and that it will hit the market before the end of the year.",
    "We also know that it will be capable of shooting 5.7K/60p video, and 4:2:2 10-bit Cinema 4K/60p video internally. While that can't compare with the 8K of some full-frame models, it puts the GH6 in a good position to compete with the likes of the Sony A7S III – and, importantly, at a more affordable price than the majority of full-framers.",
    "At a price point of $2,500 (around £1,770 / AU$3,225), the GH6 should speak to the type of user whose budget may be more limited but for whom creating good-quality content remains a priority. This appears to be something that many of the manufacturers, seemingly obsessed with adding numerous high-end features to the spec-sheet – perhaps solely for marketing purposes – have forgotten. Catering to the more ordinary user puts you in a strong position for mass-market dominance and, in the end, is arguably more impressive than producing the best camera on the market that few can actually afford.",
    "With all of that in mind, it could potentially be an exciting time for Micro Four Thirds. A new and exciting flagship in the market again might make the average consumer sit up and recall exactly what they loved about these small-format pocket powerhouses in the first place. They proved that you could get a lot of bang for your buck – and helped to keep that chiropractor's bill down, too, as a result of being a dinky overall system.",
    "Either way, it’s excellent news for consumers and camera fans all over the world. A more diverse market almost always leads to price reductions, while it spurs manufacturers to think more about what’s important to the every day user and thus deliver more for their money."
  ],
  "headers": {
    "4": "Gold blend",
    "10": "Film fans"
  },
  "links": {
    "GH6": "https://www.techradar.com/news/panasonic-gh6-release-date-price-specs-and-features",
    "GH5 Mark II": "https://www.techradar.com/reviews/panasonic-gh5-mark-ii",
    "best camera": "https://www.techradar.com/news/best-camera"
  }
}