{
  "source": "https://www.techradar.com/news/true-to-form-german-scientists-count-up-beer-molecules-turns-out-theres-ale-lot",
  "title": "True to form, German scientists count up beer molecules. Turns out there's ale-lot",
  "category": "fitness",
  "updated": "2021-08-09T21:22:13Z",
  "author": "john-loeffler",
  "summary": "Thousands of unique molecules found – and not just in a pub",
  "article": [
    "Beer brewing is nearly as old as agriculture itself, but few have taken the science and traditions of brewing beer as seriously as the Germans. So it's no surprise then that a team of German chemists went to town and counted up all the different kinds of molecules in commercially available beer, but even they were surprised by how many they found.",
    "In a new study published in Frontiers in Chemistry on July 20, chemistry researchers with Technical University of Munich (TUM) and Helmholtz Zentrum München, Neuherberg, Germany (HZM-Neuherberg), used advanced mass spectrometry techniques to reveal the incredible metabolic complexity of many commercially available beers from around the world, revealing tens of thousands of distinct types of molecules that make up the characteristics of your favorite brew.",
    "\"Beer is an example of enormous chemical complexity,\" said Professor Philippe Schmitt-Kopplin, head of the Comprehensive Foodomics Platform at TUM and the Analytical BioGeoChemistry research unit at the Helmholtz Center in Munich.",
    "\"And thanks to recent improvements in analytical chemistry, comparable in power to the ongoing revolution in the technology of video displays with ever-increasing resolution, we can reveal this complexity in unprecedented detail.\"",
    "Researchers used two powerful mass spectrometry methods on 467 different types of beer from the US, Latin America, Europe, Africa, and East Asia, brewed from barley alone or from a mix of barley and either wheat, rice, or corn.",
    "They found around 7,700 molecular building blocks with unique masses and formulas – around 80% of which have not yet been described in chemical databases. And with each formula covering up to 25 different molecular structures, this puts the total number of unique molecules in any given brew well into the tens of thousands.",
    "The two analytical methods complemented each other to provide the deepest look yet into the chemistry of one of humanities oldest – and favorite – past times. Evidence of beer brewing dates back thousands of years to at least 7,000 BCE, and humanity's oldest existing code of law, decreed by Babylonian king Hammurabi sometime between 1792 and 1750 BCE, dedicated no less than four laws for regulating the production, purity, and sale of beer.",
    "\"We show that this diversity originates in the variety of raw materials, processing, and fermentation,\" said first author Stefan Pieczonka, a PhD student at TUM. \"The molecular complexity is then amplified by the so-called ‘Maillard reaction’ between amino acids and sugars which also gives bread, meat steaks, and toasted marshmallow their ‘roasty’ flavor.\"",
    "\"This complex reaction network is an exciting focus of our research,\" they added, \"given its importance for food quality, flavor, and also the development of novel bioactive molecules of interest for health.\"",
    "Since this is serious science, researchers point out that their technique could be an important step towards safer foods in the future. \"Our mass spectrometry method, which takes only 10 minutes per sample, should be very powerful for quality control in food industry,\" Schmitt-Kopplin said, \"and set the basis of novel molecular markers and non-targeted metabolite profiles needed in foodstuff inspection.\""
  ],
  "headers": {},
  "links": {
    "Frontiers in Chemistry": "https://doi.org/10.3389/fchem.2021.715372"
  }
}