{
  "source": "https://www.techradar.com/news/verizon-switches-to-android-messages-as-default-for-rcs",
  "title": "Verizon switches to Android Messages as default for RCS",
  "category": "phones",
  "updated": "2021-07-22T03:38:16Z",
  "author": "anthony-spadafora",
  "summary": "RCS will be available for all Verizon Android users beginning next year",
  "article": [
    "Through a new collaboration with Google, Verizon has announced that it will expand advanced messaging services to Android users in the US beginning next year using the Messages by Google app.",
    "Messages by Google is based on the Rich Communications Service (RCS) standard which provides a more interactive and modern messaging experience for users with Android smartphones.",
    "As a result of Verizon and Google's collaboration, Messages will work with the US telecom's network and RCS messaging service. However, the two companies will also work together to provide a robust business-to-consumer messaging ecosystem using RCS.",
    "EVP and CEO of the Verizon Consumer Group, Ronan Dunne provided further insight in a press release on why the company decided to work with Google to bring RCS to its users, saying:",
    "“Our customers depend on us to provide a reliable, advanced and simple messaging platform to stay in touch with the people that matter the most in their lives. By working with Google, Verizon will offer our Android users a robust messaging experience that allows them to engage with loved ones, brands and businesses in new and innovative ways.”",
    "Beginning next year, Messages by Google will be preloaded on all Verizon Android devices so that consumers can take advantage of rich messaging features available with RCS.",
    "These include being able to send and receive higher-quality photos and videos, chatting over Wi-Fi or data, knowing when a message has been read, enjoying more dynamic and engaging group chats and securely chatting with other Messages users in one-on-one conversations with end-to-end encryption (E2EE).",
    "Businesses will also be able to leverage RCS to better reach their customers who will be able to easily connect with them to purchase products, make reservations, ask questions and more.",
    "The RCS standard has been gaining momentum worldwide and there are currently over 444m active monthly users in 60 countries using it according to GSMA.",
    "We'll likely hear more from both Verizon and Google once the telecom's rollout of RCS is complete next year."
  ],
  "headers": {
    "5": "Messages by Google"
  },
  "links": {
    "Verizon": "https://www.techradar.com/news/phone-and-communications/mobile-phones/verizon-wireless-plans-1321179",
    "Messages by Google": "https://www.techradar.com/news/google-adds-end-to-end-encryption-to-android-messages-app/news/google-messages-app-is-preparing-end-to-end-encryption-for-rcs-chat",
    "RCS": "https://www.techradar.com/news/google-led-successor-to-sms-is-a-boon-for-mobile-operators",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1911524051205505800/https://www.verizon.com/about/news/verizon-google-messaging-services-android",
    "Verizon Android devices": "https://www.techradar.com/news/phone-and-communications/mobile-phones/verizon-phones-1322930",
    "securely chatting": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "E2EE": "https://www.techradar.com/news/google-adds-end-to-end-encryption-to-android-messages-app"
  }
}