{
  "source": "https://www.techradar.com/news/what-a-decade-of-distributed-work-has-taught-us-about-the-future",
  "title": "What a decade of distributed work has taught us about the future",
  "category": "computing",
  "updated": "2021-06-08T14:11:36.349Z",
  "author": "lara-owen",
  "summary": "Operationalizing distributed work needs to go far beyond simply rolling out technology",
  "article": [
    "That old cliché about there being opportunity in every crisis really rings true when it comes to remote working. While Covid-19 plunged many companies into outright panic about how to cope with a distributed workforce, plenty of organizations are now starting to embrace the long-term value of the concept. It feels like there is a news headline everyday about businesses making the enforced switch to distributed work part of their future in some form.",
    "What most business leaders are realizing is that fully operationalizing distributed work needs to go far beyond simply rolling out technology like video conferencing software and collaboration tools. Reaping the undoubted rewards requires introspection, a clearly defined mission and a strategy to turn that into fruition.",
    "Businesses are now seeing that location does not have to place limits on what people can achieve. Flexibility has long been the backbone of the open source community in particular. From a software perspective, efficient “asynchronous”, online and distributed work can and will result in the right communication and collaboration needed to create software that - and this isn’t hyperbole - can change the world.",
    "Measuring a distributed work strategy purely in terms of productivity misses the mark. While it’s an undeniably important metric - and data shows that last year developer productivity actually rose, with pull requests and push volumes per person per day increasing - it’s too reductive to base a workforce’s value solely in terms of productivity. Developer productivity, for example, is better measured using the likes of the SPACE framework, which takes into account a much broader set of categories beyond the amount of code produced.",
    "Despite the many benefits of remote work our experience tells us that offices are not going away. Instead, they will be redesigned for a new era. We will see more hot-desking, more hybrid experiments, a reduction in office footprints and creative ways of using space. The knock-on impact of enforced remote working means teams are arguably better equipped to know how they need to work. As a result, offices will be re-engineered with collaboration at the heart, whether that’s for team deep-dives, customer and community events, celebrations, planning and design work.",
    "Distributed work also necessitates a leadership mindset shift. A recent study published by the Journal of Business and Psychology discovered that the successful traits of an in-office leader differ from the skillset of one required to run a remote, distributed team. Successfully building a distributed team demands deliberate changes in the way people work and a shift in the way companies train, empower and support people to work in new ways. Everyone must contribute to reducing friction caused by differing work environments or time zones by ensuring work is clearly documented, visible, and doable in an asynchronous manner. That’s as true for the most senior employee as it is for the most inexperienced. A positive culture starts from the top down.",
    "The bottom line is that whatever a company’s chosen operational path, from hybrid to digital by design, it’s crucial that decision makers have clarity on their core cultural priorities and needs before making tactical changes and investments. Companies with a clear mission and purpose, an invested leadership team, and a willingness to let go of parts of the past which do not serve them, will thrive and usher in the new future of work."
  ],
  "headers": {},
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "p": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1202097381777748500&xs=1&url=https%3A%2F%2Foctoverse.github.com%2Fstatic%2Fgithub-octoverse-2020-productivity-report.pdf&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhat-a-decade-of-distributed-work-has-taught-us-about-the-future"
  }
}