{
  "source": "https://www.techradar.com/news/apples-new-macbooks-are-selling-well-but-still-lost-serious-ground-to-chromebooks-and-windows-laptops",
  "title": "Apple’s new MacBooks are selling well – but still lost serious ground to Chromebooks and Windows laptops",
  "category": "computing",
  "updated": "2021-06-09T09:51:41Z",
  "author": "darren-allan",
  "summary": "Notebook sales are huge in the US, driven by pandemic-related hardware demand",
  "article": [
    "Apple Mac sales are up strongly in the US, but then other PC makers have been selling a ton of devices as well – and in fact, a new report detailing Q1 sales figures shows that Apple has actually lost its position as top dog vendor in the US, and slipped quite some way.",
    "The report from Canalys details PC sales – meaning desktops, laptops and tablets – in the US for Q1 of 2021, which witnessed some incredible growth, driven by the pandemic that has sparked considerable demand for new hardware (because many folks are now working, or learning, from home).",
    "Overall growth in the PC market in the US was 73% compared to Q1 in the previous year, a massive uptick (with 34 million devices sold), and notebook shipments spiked higher with 131% growth year-on-year.",
    "Apple did well on the face of it, with sales growth of 35.7% year-on-year, but at the same time as mentioned at the outset, other manufacturers did even better still, and Apple actually lost its place as the number one PC vendor in the US.",
    "Apple slipped from top spot to number two with a decline in overall PC market share of 5.5%, dropping from a 25% share in Q1 of 2020, down to 19.5% in the first quarter of this year.",
    "That’s a considerable jolt downwards, and while the analyst firm observes that “Apple performed well considering Q1 tends to be a weaker quarter for Mac and iPad shipments”, we’re still comparing to the same (weaker) quarter of the previous year. Even so, we do agree that it can hardly be regarded as a bad result for Apple; but that slippage is certainly worrying.",
    "The main reason for Apple’s market share decline is the strength of the Chromebook, which made huge gains, as well as Windows machines also seeing a spike in sales.",
    "Canalys stated: “Much of the record-breaking growth over the past year occurred due to the surge of Chromebooks for education alongside 92% year-on-year growth in the consumer segment.”",
    "The new top PC vendor in the US is now HP, just sneaking ahead of Apple with a 21.1% market share (which is up strongly from 16.4% last year). HP recorded a blazing growth level of 122% year-on-year, and a good deal of that success was down to Chromebooks. Canalys also broke down gains for vendors selling Chrome OS machines, and HP secured 44% of all Chromebook sales in the US, with shipments up massively compared to 2020.",
    "Indeed, the overall market growth for Chromebooks in the US was a massive 548%, and Samsung recorded a staggering 1,963% growth. As a result, in terms of overall PC sales, Samsung hit a year-on-year growth level of 116%, almost matching top performer HP.",
    "Samsung remained in fifth position in the rankings of PC vendors, though, and still a fair way behind fourth-placed vendor Lenovo which has a market share of 13.7% compared to Samsung’s 9.9%. Last year, Samsung stood on 7.9%, so it’s certainly presenting a strong challenge to the big four driven by that major Chromebook growth.",
    "The future is only going to get brighter for Chromebooks, too, with Ishan Dutt, Senior Analyst at Canalys, noting: “There is no return to normal for education. The PC’s role in the classroom will remain strong for years to come, ensuring ongoing demand for Chromebooks.",
    "“The growing Chromebook installed base will lead to consistent upgrades and support for the product line. Educational institutions, teachers and parents have made investments in digital curricula and processes that they will not want to abandon.”",
    "Via Wccftech"
  ],
  "headers": {
    "6": "Chromebook corner"
  },
  "links": {
    "Apple Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Canalys": "https://www.canalys.com/newsroom/us-pc-market-q1-2021",
    "considerable demand for new hardware": "https://www.techradar.com/news/pc-sales-are-set-for-their-most-successful-year-ever",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "Wccftech": "https://wccftech.com/mac-shipments-in-the-u-s-have-grown-by-35-year-on-year-with-apple-now-down-to-the-2nd-spot/"
  }
}