{
  "source": "https://www.techradar.com/news/e3-2021-awards-show-will-wrap-up-conference-heres-what-you-need-to-know",
  "title": "E3 2021 awards show will wrap up conference - here's what you need to know",
  "category": "gaming",
  "updated": "2021-06-01T14:22:12Z",
  "author": "samuel-tolbert",
  "summary": "Who takes the lead?",
  "article": [
    "E3 2021 is rapidly closing in and, ahead of the event's kickoff, the ESA (Electronic Software Association) has announced that an E3 2021 award show will be held on June 15, 2021. The awards will be chosen by a panel of journalists from IGN, PC Gamer, GamesRadar and GameSpot.",
    "“For this year’s event, we are collaborating with editors at some of the world’s leading video game media outlets to create the Official E3 2021 Awards Show, recognizing the show’s most anticipated games,” said Stanley Pierre-Louis, president and CEO of the ESA. “The broadcast is going to be packed with exciting announcements and reveals, and celebrating innovative publishers and developers is an ideal way to close E3 2021.”",
    "E3 2021 runs from June 12 through June 15 this year and is being hosted by esports commentator Alex “Goldenboy” Mendez, content creator and streamer Jacki Jing and Kinda Funny co-founder Greg Miller.",
    "E3 2021 is an all-digital event this year as the world is still dealing with the global pandemic. Several major publishers are taking part in the event, with some holding their own unique showcases.",
    "Ubisoft is holding Ubisoft Forward on June 12, which will be followed by Microsoft presenting an Xbox and Bethesda Games Showcase on June 13. This combined event will run for around 90 minutes and appears set to feature Halo Infinite and Starfield, among other titles.",
    "Not every big gaming publisher is joining in for E3 2021 however, with the notable absence of Sony that has not yet announced any details for some kind of summer showcase. The publisher did however give a recent look at gameplay in its upcoming PS5 and PS4 blockbuster, Horizon Forbidden West."
  ],
  "headers": {
    "3": "Not going back to normal, but..."
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox and Bethesda Games Showcase": "https://www.techradar.com/news/e3-2021-xbox-and-bethesda-games-showcase-set-for-june-13",
    "recent look at gameplay": "https://www.techradar.com/news/horizon-forbidden-west-gameplay-demo-shows-us-a-grappling-hook-glider-and-more",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer"
  }
}