{
  "source": "https://www.techradar.com/news/windows-10-could-soon-make-using-your-webcam-safer",
  "title": "Windows 10 could soon make using your webcam safer",
  "category": "computing",
  "updated": "2021-02-09T10:13:31Z",
  "author": "matt-hanson",
  "summary": "Lets you know when it’s in use",
  "article": [
    "It looks like Windows 10 could soon get a new feature that will make using your webcam more secure, with Microsoft testing a setting that lets you known when your camera is in use – and which apps are using it.",
    "When your webcam is in use, an icon will appear in the taskbar alerting you. If you hover over the icon, a list will appear showing you all the apps that are currently using your webcam.",
    "This will be similar to how you’re alerted in Windows 10 if your microphone is being used. As Windows Latest reports, the feature is apparently being tested in early builds of Windows 10X, but it’s also expected to come to regular Windows 10 as well.",
    "Being alerted that your webcam is in use is a really important feature these days, especially as more of us than ever are working from home and participating in multiple video calls every day.",
    "Being reminded that your camera is still on and broadcasting can avoid any potential embarrassments. This new feature could also alert you if an unknown or malicious app had turned on your webcam without you knowing.",
    "Due to the privacy and security implications, then, we hope Microsoft brings this feature to Windows 10 as soon as possible. While some webcams will alert you that they are in use with an LED light, it can be easily missed, and it won’t tell you what apps are using it."
  ],
  "headers": {
    "3": "Webcam privacy"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows Latest reports": "https://www.windowslatest.com/2021/02/09/windows-10-may-soon-tell-you-which-apps-are-using-your-camera/"
  }
}