{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-appears-in-colorful-unofficial-renders",
  "title": "Samsung Galaxy S21 FE appears in colorful, unofficial renders",
  "category": "phones",
  "updated": "2021-06-05T16:00:14Z",
  "author": "david-nield",
  "summary": "Looking good",
  "article": [
    "All the indications are that the Samsung Galaxy S21 FE is going to show up in August, and we now have a better idea of what it's going to look like thanks to some colorful, unofficial renders that have made their way online.",
    "The pictures come courtesy of noted tipster Evan Blass, who has posted the images on Twitter. They seem to have been rendered from leaked plans of the upcoming phone revealing the design and the dimensions, so Samsung's actual promotional renders are going to look different.",
    "As interesting as the renders are, they don't really tell us anything new about what to expect from the handset. It's going to look a lot like the Samsung Galaxy S21 in terms of its aesthetics, though it will be sold at a significantly lower price point.",
    "As we've seen in previous leaks, the Galaxy S21 FE is set to come in color options that extend across all of the backing of the phone, so there isn't going to be a separate shade for the rear camera array (which we expect to hold three lenses).",
    "We've heard plenty about the incoming mid-ranger already, although nothing is certain until Samsung officially unveils the device. It will be the successor to the Galaxy S20 FE, which made its debut in October 2020.",
    "Among the leaks and rumors that have been floating around about the phone, there's been a suggestion that the Galaxy S21 FE is going to come running the top-end Snapdragon 888 chipset together with 6GB of RAM – so a fairly decent spec.",
    "There's also been talk that Samsung is going to position the phone as a replacement for the Galaxy Note 21, which we're not expecting to see this year – though as the Galaxy S21 FE won't come with a stylus, that's going to be an interesting challenge.",
    "All should become clear in August, when the Galaxy S21 FE is expected to make its official debut. Whenever the date happens to be, we think that the handset is going to arrive alongside the Galaxy Z Fold 3 and the Galaxy Z Flip 3."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "on Twitter": "https://twitter.com/evleaks/status/1400945475558199298",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "previous leaks": "https://www.techradar.com/news/samsung-galaxy-s21-fe-renders-show-off-the-phone-in-full",
    "Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "been a suggestion": "https://www.techradar.com/news/samsung-galaxy-s21-fe-benchmark-suggests-it-will-be-as-powerful-as-we-hoped",
    "been talk": "https://www.techradar.com/news/samsung-galaxy-note-21-even-more-likely-to-be-gone-and-replaced-by-the-s21-fe",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review"
  }
}