{
  "source": "https://www.techradar.com/news/iphone-lightning-port-ban",
  "title": "iPhone 14 could be last with a Lightning port due to EU ban plan – and Apple is 'concerned'",
  "category": "phones",
  "updated": "2021-09-24T15:43:07Z",
  "author": "john-mccann",
  "summary": "The Lightning port's days could be severely numbered",
  "article": [
    "The European Union on Thursday unveiled plans to impose a universal charger rule on technology manufacturers that would mandate the use of USB-C connections – and the iPhone maker has told TechRadar it's none too happy about the idea.",
    "\"We remain concerned that strict regulation mandating just one type of connector stifles innovation rather than encouraging it,\" an Apple spokesman told us, \"which in turn will harm consumers in Europe and around the world\".",
    "The EU's proposal – which isn't yet final or binding – says smartphone manufacturers will be given 24 months to transition to the universal connector type, and Thierry Breton, the EU’s Internal Market Commissioner, noted that it would not explicitly ban alternatives such as Apple's Lightning port.",
    "“If Apple wants to continue to have their own plug, they will have the ability to do it. It’s not against innovation, it’s just to make the lives of our fellow citizens a little bit more easy,” Breton said at a press briefing in Brussels, as reported by the Associated Press, adding that device makers could still put two different ports on their phones if they want.",
    "For Apple, that would mean 2022's iPhone 14 would likely retain the Lightning connection, but the iPhone 15 – which may arrive in 2023 – would either double up on ports or adopt a different connector.",
    "According to the proposal, all phones, tablets, digital cameras, handheld video game consoles, headsets and headphones sold in the European Union would have to feature USB-C ports.",
    "The Lightning port made waves when it was introduced on the iPhone 5 back in 2012, replacing the then long-standing 30-pin connector, which led to a social outcry as a wide range of docks and other accessories that relied on the larger connector type quickly became incompatible with new iPhones.",
    "While some owners at the time were unhappy with the switch of connector type, which meant existing products losing functionality, consumers have moved on in the nine years since, and Lightning has become synonymous with Apple devices.",
    "But those defunct 30-pin accessories are an example of why the EU is keen to push this proposal through, as it looks to reduce waste when it comes to consumers requiring multiple charging cables for different devices.",
    "\"European consumers have been frustrated long enough about incompatible chargers piling up in their drawers,\" EU Executive Vice President Margrethe Vestager said in a statement. \"We gave industry plenty of time to come up with their own solutions, now time is ripe for legislative action for a common charger.\"",
    "An Apple spokesperson told TechRadar the firm isn't a fan of the EU's proposal, though it appreciates the goals behind the plan.",
    "\"Apple stands for innovation and deeply cares about the customer experience. Some of the most innovative thinking at Apple goes toward building products with recycled and renewable materials,\" an emailed statement reads.",
    "\"We share the European Commission's commitment to protecting the environment and are already carbon neutral for all of our corporate emissions worldwide, and by 2030 every single Apple device and its usage will be carbon neutral.",
    "\"We create products that enhance people’s lives, making everyday tasks easier and more efficient, including how you charge and transfer data on your device. We remain concerned that strict regulation mandating just one type of connector stifles innovation rather than encouraging it, which in turn will harm consumers in Europe and around the world. \"We look forward to continued engagement with stakeholders to help find a solution that protects consumer interest, as well as the industry’s ability to innovate and bring exciting new technology to users.\"",
    "Apple will continue to work with the European Commission and gather more details about what exactly this means, although there are concerns the ruling may harm the firm's ecosystem and the 24 month transition period isn't long enough.",
    "This news doesn't come as a surprise, as news of the proposal leaked last month. As we've mentioned, these plans are not final, and there's plenty of time for them to change significantly - or be scrapped altogether - depending on the backlash from the industry.",
    "Apple is quickly becoming the outlier when it comes to handheld device ports, with one of the other big holdouts - Amazon - finally switching its popular Kindle ereader range to USB-C with its latest generation just a few days ago, after persisting with microUSB far longer than other major manufacturers.",
    "However, even Apple has started to embrace USB-C over recent years with both its MacBook and iPad Pro ranges now featuring the port.",
    "These moves have prompted rumors and speculation that it's only a matter of time before iPhone follows suit - which seems like a logical step - but Apple has stuck by the Lightning connector for its most recent installment, the iPhone 13 series, which arrived earlier this month.",
    "Apple could opt to produce two hardware versions of future iPhones, one with a USB-C port for the European market to get past any legislation, while still offering a Lightning-clad variant to the rest of the world, including its home market of the US.",
    "Splitting its hardware portfolio this way will increase productions costs for Apple, something it's unlikely to want to do, so this probably won't be the resolution it opts for.",
    "Other Apple rumors suggest the firm could go with a portless design, relying instead on its MagSafe technology - introduced with the iPhone 12 series in 2020 - and wireless charging support to handle all future charging requirements.",
    "There's still a long way to go then, and this won't be the last we hear about this proposal, with the potential for multiple twists and turns in the next couple of years.",
    "Via RFI"
  ],
  "headers": {
    "10": "Apple remains 'concerned'",
    "15": "Analysis: still a long way to go"
  },
  "links": {
    "EU's proposal": "https://ec.europa.eu/commission/presscorner/detail/en/ip_21_4613",
    "iPhone 14": "https://www.techradar.com/news/iphone-14",
    "iPhone 5": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5-1096004/review",
    "leaked last month": "https://www.techradar.com/news/your-next-iphone-may-finally-ditch-lightning-for-usb-c-because-of-this-new-law",
    "finally switching its popular Kindle ereader range": "https://www.techradar.com/news/not-one-not-two-but-three-new-amazon-kindle-paperwhites-have-been-announced",
    "a portless design": "https://www.techradar.com/news/iphone-13-once-again-rumored-to-be-portless-but-not-all-models",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "RFI": "https://www.rfi.fr/en/business-and-tech/20210923-eu-to-impose-universal-phone-charger-in-blow-to-apple"
  }
}