{
  "source": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
  "title": "The Mandalorian season 3: cast, plot, release date and everything we know",
  "category": "entertainment",
  "updated": "2021-11-15T13:02:00Z",
  "author": "samuel-roberts",
  "summary": "What we've learned so far about the hit Star Wars TV show's next installment",
  "article": [
    "The Mandalorian season 3 has some big questions to answer. For starters (spoilers ahead!) we need to know if we'll ever see Grogu (aka Baby Yoda) again. And then there's the fate of the Darksaber to deal with, now that the ceremonial weapon has inadvertently ended up in Mando's hands. It's unlikely Bo-Katan Kryze, heir apparent of the throne of Mandalore, is going to settle for the current state of affairs...",
    "For now, however, we'd settle for finding out The Mandalorian season 3 release date. Production is now underway but we're yet to get any confirmation of when it will land on Disney Plus – though the smart money is on the second half of 2022.",
    "But despite the absence of an ETA, there's still plenty we can tell you about the show's eagerly anticipated return. Here's everything we know so far about The Mandalorian season 3 cast, story and more.",
    "Is season 3 happening? Yes. The show was renewed before The Mandalorian season 2 even released.",
    "Release date: The Mandalorian season 3 is currently in production, as confirmed by star Carl Weathers (Greef Karga) in an October 2021 tweet. This probably means the show will return to Disney Plus some time in the second half of 2022.",
    "Cast: Pedro Pascal will return as the titular Mandalorian, Din Djarin, and Weathers has confirmed he'll reprise his role as Greef Karga. Giancarlo Esposito has hinted his character, Moff Gideon, may return in future, but Gina Carano won't be back as Cara Dune.",
    "Story: The fate of the Darksaber weapon, and whether Grogu will return to Din after being trained by Luke Skywalker (Mark Hamill), are the plot threads we expect to be picked up in The Mandalorian season 3.",
    "The Mandalorian season 3 doesn't have an official release date yet, but late 2022 seems like a safe bet at this point. In a September 2021 story for the Hollywood Reporter, it was mentioned that the show is part of Lucasfilm's slate for next year. Since both Andor and Obi-Wan Kenobi have already wrapped their respective shoots, we'd expect The Mandalorian to return after they've rolled out on Disney Plus.",
    "Back when The Book of Boba Fett (which lands on December 29, 2021) was announced at the end of The Mandalorian season 2 finale, Grogu fans were concerned that the new show was taking the place of a third season of The Mandalorian. But that's definitely not the case: Favreau has since confirmed that The Mandalorian season 3 will continue the story of Din Djarin.",
    "\"What we didn't say in [the Disney Investor Day announcement about upcoming Star Wars TV] is the next show coming up – [Lucasfilm president Kathleen Kennedy] said the next chapter – that's gonna be The Book of Boba Fett,\" Favreau told Good Morning America in December 2020. \"And then we go into production right after that on season 3 of The Mandalorian, back with the main character that we all have known and loved.\"",
    "Weathers tweeted on October 13, 2021 that he was about to start shooting his scenes:",
    "Given the usual timescales for productions of The Mandalorian’s size, these comments both suggest a late 2022 release date is on the Sabacc cards.",
    "We'll update this section once we have confirmation on an official launch date for The Mandalorian season 3.",
    "Spoilers follow for The Mandalorian season 2. Don't go any further unless you want the series ruined for you.",
    "While there's no officially confirmed supporting cast for season 3 yet, Pedro Pascal will return (at least some of the time) as Din Djarin, aka The Mandalorian.",
    "Why some of the time? In addition to Mando duties, Pascal is committed to HBO's live-action series based on Naughty Dog's critically acclaimed videogame The Last of Us, where he’s starring as Joel Miller. Pascal's contract with HBO means The Last of Us is in \"first position\" – in Hollywood speak, that means it takes precedence over any other shows the actor might work on, including The Mandalorian.",
    "The Last of Us doesn't have to be a big problem for The Mandalorian season 3, however – simply because he's not always the actor inside that iconic helmet, as season 1 director Bryce Dallas Howard revealed to Vulture in 2019. Besides, as Giancarlo Esposito (who plays Moff Gideon) pointed out at GalaxyCon Raleigh (via WRAL.com), “We never have to wait for Pedro”.",
    "As mentioned above, former Rocky star Carl Weathers has confirmed his return as Greef Karga, Bounty Hunter's Guild representative turned magistrate, and ally to Djarin.",
    "Other actors returning in The Mandalorian season 3 cast next season are unclear – no surprise, seeing as Lucasfilm tend to enjoy keeping guest stars secret until new episodes debut on Disney Plus – but the show now has a big ensemble to pick and choose from.",
    "We fully expect to see Katee Sackhoff's Bo-Katan Kryze appear again – in fact, it seems likely that the new season will dig further into her quest to recover the Darksaber and restore Mandalore. It looks like she won't be joined by her Mandalorian colleague Koska Reeves, however, as Mercedes Varnado (better known as WWE star Sasha Banks) told Bleacher Report, “I'm not on next season”.",
    "Bill Burr, who played Imperial sharpshooter turned criminal turned good guy Migs Mayfeld in seasons 1 or 2, is up for a return. “I'm obviously not allowed to say anything other than I just absolutely love being on that show and I hope it continues and if it doesn't, I've had a blast,” he told ScreenRant.",
    "Giancarlo Esposito seems fairly confident he'll turn up again as rogue Imperial Moff Gideon in season 3. \"I have a feeling you'll see more of me next season. More than likely you're going to see a lot of Moff Gideon,\" the actor told Entertainment Weekly. With his life spared by Mando in the season 2 finale, the Imperial bigwig is now in New Republic custody, and clearly has a bigger part to play in the post-Return of the Jedi universe. And besides, why ditch a perfectly good villain?",
    "It's also possible that Boba Fett (Temuera Morrison) and Fennec Shand (Ming-Na Wen) will appear again after their starring roles in the upcoming The Book of Boba Fett, but that's by no means certain. The events of that show will probably shed light on that.",
    "\"I don't know, you'll probably find out before I do,” said Ming-Na when Digital Spy asked her about a possible appearance in The Mandalorian season 3. “You guys have your feelers out on everything. I mean, come on, I didn't even know I was shooting The Book of Boba Fett, so you're asking the wrong person!”",
    "One person who definitely isn't returning is Gina Carano, who won't be back as former Rebel Shock Trooper Cara Dune. We've touched on this further down, so jump ahead if you want to know why.",
    "Additionally, rumors surrounding an appearance from the Wookiees have emerged . According to the Bespin Bulletin podcast, sources close to season 3's production have suggested that a Wookiee will be making an appearance in the show. Naturally, there's no confirmation as to whether this is true, so we're staying skeptical for now. If you're interested in viewing the rumor yourself, though, check out the Instagram post below:",
    "We think there are two big plot threads from season 2 that The Mandalorian season 3 has to pay off. First, who will wield the Darksaber? And, second, when will Grogu – also known as The Child/Baby Yoda – return to Din Djarin's care following his time training with Jedi Master Luke Skywalker?",
    "At the end of season 2, Mando won the Darksaber weapon – the Mandalorian blade highly coveted by Bo-Katan Kryze (Katee Sackhoff) in her journey to reclaim the throne of Mandalore – from Moff Gideon (Giancarlo Esposito). However, he couldn't simply hand it over to Bo-Katan, and tensions mounted as it became clear that she and Mando were going to have to duel in order for her to claim the weapon. This plot thread should be picked up again in The Mandalorian season 3, as any further developments were scuppered by the impromptu appearance of Luke Skywalker in the season finale.",
    "“The way that Lucasfilm left me in season 2...” Sackhoff told SlashFilm, “one of the roads that could be gone down – absolutely, you'd think – would be the unfinished business [about Bo-Katan and the Mandalorians]. But that is so far above my pay grade, and you just don't know, right? As a fan of the show, I'm just excited to see what they come up with.",
    "On the subject of Luke, the other big plot point we expect to be picked up in season 3 is the fate of Grogu after the artist formerly known as Baby Yoda went off with Luke to be trained in the ways of the Force. \"He is strong with the Force, but talent without training is nothing,” said Skywalker. “I will give my life to protect the Child... but he will not be safe until he masters his abilities.\"",
    "Mando promises he'll see Grogu again, but when? We would be shocked not to see the little green guy again next season – if only to keep Disney's merchandising department happy.",
    "If Grogu does reappear, season 3 may see him flex even more Force-based powers than those he used in seasons 1 and 2. \"This child has magic powers, [is] 50 years old, and can see the future,” Esposito told a young fan at GalaxyCon, “and we want everyone to know, eventually on this show, that [Grogu] could save our universe.\"",
    "So, in addition to levitating, choking and looking implausibly cute, Baby Yoda can apparently see the future – which is an ability we’ve come across before in the troubled visions of Anakin and Luke Skywalker.",
    "Esposito also added that Moff Gideon’s pursuit of Grogu is “for a very different reason than many people think”. Could Grogu's clairvoyant abilities be part of Gideon's plans to take control of a resurgent post-Emperor Empire?",
    "Speaking of which, Moff Gideon's ship is just one small part of the Imperial remnant forces out there waiting to be dealt with, and we know that Imperial leader Grand Admiral Thrawn is alive and being hunted by Ahsoka Tano.",
    "We expect the Thrawn story to form the basis of the upcoming Ahsoka live-action show, but it's possible we'll see it picked up again in The Mandalorian, too.",
    "It's also likely that we'll see more hints at what Grogu's blood is being used for by the Empire. It seemed fairly obvious the show was pointing at the cloned origins of the sequel trilogy’s puppet villain Supreme Leader Snoke, and the eventual return of Emperor Palpatine that would make us sigh with disappointment in 2019's The Rise of Skywalker. We'll have to see if season 3 addresses this or not. (A cloning subplot could also tie into The Bad Batch season 2, where we encountered an Imperial scientist wearing a uniform very similar to that of The Mandalorian's Dr Pershing.)",
    "Some members of the cast do at least have an idea of where the show is heading. In an interview with IndieWire in January, Pascal teased that he's aware of \"what the plan is\" for The Mandalorian season 3 and beyond, but obviously couldn't elaborate on it due to spoilers and NDA agreements in his contract.",
    "“I can’t share it (the plot), he said. \"They're in the expansion of this world, where there are so many unexpected surprises and timelines that are going to be dealt with. If the character were to cross over into these worlds, it will be utilized in a way that isn’t meant to be expected. I wouldn’t want to spoil the surprise of whether or not characters from the show we already know are crossing over.”",
    "Due to an offensive social media post, Gina Carano was removed from all future Lucasfilm projects. \"Gina Carano is not currently employed by Lucasfilm and there are no plans for her to be in the future,\" the company said in a statement. That means you won't see her in future Star Wars shows, including The Mandalorian season 3. Carano has since fired back over her removal from the show, with the actress claiming that she had been \"bullied\" by Disney and LucasFilm – accusations that both companies have strenuously denied (h/t BBC).",
    "It's unclear if this means the Cara Dune character is being retired or if she'll be recast. The Mandalorian's showrunners could easily find a way to kill her off-screen but, until we know for sure, we'll wait to see what Favreau and company decide to do with Cara Dune. The fact that the Rangers of the New Republic spin-off – widely rumored to focus on Dune – has been mothballed by Lucasfilm suggests we may have seen the last of the character.",
    "The Mandalorian has two spin-offs in the works: The Book of Boba Fett, which we've talked about already, and Ahsoka. Both are set to take place in the timeframe of the main show, around five years after Return of the Jedi. (The previously mentioned Rangers of the New Republic would also have been set during the same period, until Lucasfilm and Disney put it on ice – or should that be carbonite?)",
    "Most intriguingly, there's a plan for this sub-universe of shows to converge into a larger story. It sounds a little like what Netflix did in uniting its various Marvel superhero TV shows in the miniseries The Defenders, but we'd expect Disney and Lucasfilm's plans to be better received than the Netflix crossover series was.",
    "\"These interconnected shows, along with future stories, will excite new audiences embrace our most passionate fans, and culminate in a climactic story event,\" explained Lucasfilm's Kathleen Kennedy during Disney's Investor Day stream in late 2020.",
    "It sounds to us, then, that we're going to see either a miniseries or movie-length episode that brings these stories together – though we wouldn't expect to see that for a few years from now.",
    "First, let's get The Mandalorian season 3 out of the way..."
  ],
  "headers": {
    "39": "The Mandalorian season 3: Gina Carano won't return"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Release date": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far#the-mandalorian-season-3-release-date",
    "Cast": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far#the-mandalorian-season-3-cast",
    "Story": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far#the-mandalorian-season-3-story",
    "Hollywood Reporter": "https://www.hollywoodreporter.com/business/business-news/lucasfilm-pr-chris-coxall-disney-1235017429/",
    "Andor": "https://www.techradar.com/news/star-wars-andor-everything-we-know-about-the-rogue-one-prequel",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "The Mandalorian season 2 finale": "https://www.techradar.com/news/the-mandalorian-season-2-episode-8-recap-review",
    "Disney Investor Day announcement about upcoming Star Wars TV": "https://www.techradar.com/news/disney-plus-confirms-its-making-10-marvel-and-10-star-wars-tv-shows",
    "The Last of Us": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show",
    "Vulture": "https://www.vulture.com/2019/12/the-mandalorian-pedro-pascal-double-stunt-performer.html",
    "WRAL.com": "https://www.wral.com/mandalorian-villain-talks-season-3-at-galaxycon-raleigh/19800325/",
    "Bleacher Report": "https://bleacherreport.com/articles/2949569-exclusive-sasha-banks-on-wwe-crown-jewel-dream-wrestlemania-matches-and-more",
    "ScreenRant": "https://screenrant.com/mandalorian-season-3-bill-burr-mayfield-return-response/",
    "Entertainment Weekly": "https://ew.com/tv/the-mandalorian-giancarlo-esposito-season-2/",
    "Digital Spy": "https://www.digitalspy.com/tv/ustv/a36878876/mandalorian-ming-na-wen-season-3-update/",
    "SlashFilm": "https://www.slashfilm.com/606587/the-mandalorian-star-katee-sackhoff-teases-season-3s-unfinished-business-exclusive/",
    "even more Force-based powers": "https://www.techradar.com/news/the-mandalorian-season-3-may-see-grogu-flex-even-more-powers",
    "GalaxyCon": "https://www.wral.com/mandalorian-villain-talks-season-3-at-galaxycon-raleigh/19800325/",
    "The Rise of Skywalker": "https://www.techradar.com/reviews/star-wars-the-rise-of-skywalker",
    "The Bad Batch season 2": "https://www.techradar.com/news/star-wars-the-bad-batch-season-2",
    "IndieWire": "https://www.indiewire.com/2021/01/the-mandalorian-ww84-pedro-pascal-stardom-1234609961/",
    "bullied": "https://www.youtube.com/watch?v=mxObG659Sc0",
    "BBC": "https://www.bbc.co.uk/news/entertainment-arts-56156005",
    "Rangers of the New Republic spin-off": "https://www.techradar.com/news/new-star-wars-show-sounds-like-its-on-hold-according-to-report",
    "The Mandalorian has two spin-offs": "https://www.techradar.com/news/the-mandalorian-spin-offs-ahsoka-and-rangers-of-the-new-republic-explained"
  }
}