{
  "source": "https://www.techradar.com/news/this-sony-lens-adaptor-could-change-the-game-for-the-nikon-zfc-and-z50",
  "title": "This Sony lens adaptor could change the game for the Nikon Zfc and Z50",
  "category": "cameras",
  "updated": "2021-08-26T10:13:13Z",
  "author": "mark-wilson",
  "summary": "Opens up a world of glass",
  "article": [
    "The Nikon Zfc and Nikon Z50 are both great cameras with one Achilles heel – a lack of native lenses. But a new adapter, which lets you use Sony E-mount lenses with both cameras, may have just plugged the biggest hole in their retro armory.",
    "In an ideal world, Nikon's two APS-C cameras would have an army of prime lenses for street photographers and travel shooters to choose from. Instead, they only have three native options. So the new Megadap ETZ11 adaptor, which opens up a world of Sony E-mount lenses, is a pretty big deal for anyone who's been considering a Nikon mirrorless camera.",
    "We've seen adapters that let you use Sony E-mount lenses with Nikon Z-series cameras before, like the Techart TZE-01. But that only works with full-frame Nikon bodies like the Nikon Z6 II. The Megadap ETZ11 is the first one to work with Nikon mirrorless cameras that have the smaller APS-C sensor – which right now, is the new Nikon Zfc and Nikon Z50. And it's shaping up to be a good match for those.",
    "One of the reasons for this is because the ETZ11 is incredibly thin for a lens adapter that supports autofocus, at just 2mm thick. This is particularly important for cameras, like the Nikon Zfc and Z50, whose compact size is one of their main appeals.",
    "Another bonus is that the ETZ11 also apparently supports E-mount lenses made by third-party manufacturers, including Sigma, Tamron, Zeiss, Voigtlander and Samyang. This significantly boosts the number of lenses available for Nikon's APS-C cameras, in particular affordable options that match the purpose and price point of models like the new Zfc.",
    "While it is possible to use full-frame lenses with Nikon's APS-C cameras, these lenses tend to be larger and pricier than glass that's been specifically designed for cameras with a 'DX' sensor. It also makes it difficult to get ultra-wide focal lengths on the smaller bodies – for example, the Nikon Z 14-30mm f/4 S lens becomes a 21-45mm lens when mounted on the Nikon Zfc or Z50.",
    "The ETZ11 also claims to support all autofocus modes (including Eye-AF and Face detection) and, if you want to use it on a full-frame Nikon camera, in-body image stabilization. It's compatible with all Nikon Z-series cameras and is available to buy now for $249 (around £181 / AU$343).",
    "Ideally, your favorite camera would instantly come with a huge range of native lenses that are custom-designed for your shooting needs. But that's not often the case, which is why it's often wise to choose the lenses you need, before you set your heart on a particular camera.",
    "In reality, though, special cameras like the Nikon Zfc can turn our heads, or we might be looking for an easy way to switch camera systems (for example, from Sony to Nikon) without having to trade in our collection of lenses. While not a panacea, the Megadap ETZ11 adaptor helps solves these problems and makes Nikon's APS-C cameras much more appealing.",
    "Of course, we'll have to wait to see how well the adaptor works in practice, despite those impressive claims about uncompromised autofocus performance. Its cost, which would go some way towards getting you a Nikon DX 50-250mm f/4.5-6.3 VR lens, might also be prohibitive for beginners who aren't interested in amassing a big lens collection.",
    "But it undoubtedly makes the battle between today's hobbyist-oriented APS-C mirrorless cameras a bit more interesting. Those starting from scratch may still consider Fujifilm the leader in this category, given it's spent years amassing a collection of APS-C lenses that don't require an adaptor. And Sony cameras like the Sony A6600 remain compelling thanks to their class-leading autofocus performance, even though Sony has moved into more of a video-focused direction lately.",
    "But Nikon fans, as well as those who may ultimately want to get a full-frame Nikon Z-series camera, may see this adaptor as the acceptable solution to the main weakness of the Nikon Zfc and Z50. We're aiming to review the Megadap ETZ11 soon, so look out for our final verdict in the near future."
  ],
  "headers": {
    "7": "Analysis: A big boost for the Nikon Zfc and Z50"
  },
  "links": {
    "Nikon Zfc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features",
    "Nikon Z50": "https://www.techradar.com/reviews/nikon-z50",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii",
    "Sony A6600": "https://www.techradar.com/reviews/sony-a6600"
  }
}