{
  "source": "https://www.techradar.com/news/looks-like-razer-might-have-its-own-steam-deck-soon",
  "title": "Looks like Razer might have its own Steam Deck soon",
  "category": "computing",
  "updated": "2021-12-02T15:54:11Z",
  "author": "jackie-thomas",
  "summary": "Analysis: now it's Razer's turn, apparently",
  "article": [
    "While we're still waiting on the Steam Deck, and it seems like Alienware's Concept UFO is vanished into the aether, it looks like Razer has its own handheld coming up, according to some leaked slides.",
    "Some slides from Qualcomm and spotted by VideoCardz detail a Snapdragon G3x handheld developer kit, which can apparently \"play all your games\". The device apparently has a 120Hz HDR OLED display, a 6,000mAh battery and is even 5G compatible. If it's real, this would be an incredible way to play online games on the go.",
    "It's not clear what operating system this developer kit runs on, whether it will be Windows or Android, it's not clear how much of your library would be natively supported on the device. Then again, because it's 5G-compatible, it would be a natural choice for services like Xbox Games Pass and Nvidia GeForce Now. KitGuru suggests that the device will be running on Android, but nothing in the leaked slides actually confirms that, so that's up in the air.",
    "It's also not clear whether or not this device will ever exist. We've seen so many devices like this in early stages from so many different companies, and none of them are currently available on the market. It could very well just be a developer kit to make games for Qualcomm's new Snapdragon SoC, which does seem like a pretty impressive improvement for games - if it's even real.",
    "Either way, it's another step in an industry-wide trend of trying to make niche handheld gaming PCs like the Onexplayer a mainstream product. The Steam Deck will probably be the closest we'll get, but we'll just have to wait and see.",
    "It's pretty obvious why companies are suddenly falling over each other to bring out portable gaming PCs, and it's the Nintendo Switch. I'm not exactly sure why it took this long, especially with the success of handheld devices like the 3DS, but a big part of it is the technology.",
    "Back at CES 2020, Dell showed us the Alienware Concept UFO, which was back when Ice Lake was first a thing, and when Xe graphics were first being hinted at. Now that we've seen just how good Xe graphics can be, these portable gaming PCs are just going to be more and more possible as time goes on.",
    "But it's not even just Xe graphics. Remember Intel 11th-generation Tiger Lake H35 processors? Those are what is powering gaming laptops like the Asus TUF Dash F15, and if coupled with a low-power discrete GPU, like the Nvidia GeForce RTX 3050, we could see one of these handheld devices with actual gaming laptop performance.",
    "Granted, battery life would probably be lousy out of the gate, because all the cooling that would have to be shoved into a handheld-sized machine wouldn't leave much space for a large battery, but technology is getting to the point where PC gaming on the go like this could be an actual possibility.",
    "After all, even the Nintendo Switch is using an Nvidia Tegra SoC, which isn't that far off from the Ryzen/Radeon solution being used by Valve. It's only a matter of time before these handheld gaming PCs are more than just a fun little concept we gawk at during CES time."
  ],
  "headers": {
    "5": "The Switch, but make it PC"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Alienware's Concept UFO": "https://www.techradar.com/reviews/alienware-concept-ufo",
    "VideoCardz": "https://videocardz.com/newz/qualcomm-snapdragon-g3x-powers-razers-handheld-gaming-console-snapdragon-8-gen1-flagship-soc-also-leaked",
    "Xbox Games Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "KitGuru": "https://www.kitguru.net/lifestyle/mobile/mustafa-mahmoud/razers-android-powered-handheld-gaming-device-leaks/",
    "Onexplayer": "https://www.techradar.com/news/cant-wait-for-nintendo-switch-pro-onexplayer-handheld-pc-is-the-answer",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Ice Lake": "https://www.techradar.com/news/intel-ice-lake",
    "Xe graphics": "https://www.techradar.com/news/intel-xe-graphics-cards",
    "gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Tiger Lake H35": "https://www.techradar.com/news/intel-is-making-some-of-the-thinnest-gaming-laptops-ever-at-ces-2021",
    "Asus TUF Dash F15": "https://www.techradar.com/reviews/asus-tuf-dash-f15"
  }
}