{
  "source": "https://www.techradar.com/news/the-suicide-squads-poor-debut-dampens-hopes-of-an-imminent-box-office-recovery",
  "title": "The Suicide Squad's slow debut dampens hopes of an imminent box office recovery",
  "category": "entertainment",
  "updated": "2021-08-09T10:28:53Z",
  "author": "axel-metz",
  "summary": "Not so super",
  "article": [
    "By most accounts, The Suicide Squad is a good movie. Prior to its global release, critics lauded James Gunn’s stylized supervillain adventure for its unconventional take on the comic book formula, and it was hoped – nay expected – that audiences would reciprocate that interest.",
    "Well, The Suicide Squad has posted the second lowest opening weekend return in DCEU history in the US. Only slightly ahead of the pandemic-hampered Wonder Woman 1984, the movie took $72.2 million worldwide and just $26.5 million in the US.",
    "From a project boasting a budget of $185 million, reports suggest Warner Bros. had hoped to generate between $30 and $40 million in the US – figures hit by both Disney’s Black Widow and Jungle Cruise.",
    "So, what does this tell us about the short-term future of the cinema?",
    "Well, it’s worth noting that these lackluster opening weekend returns don’t yet render The Suicide Squad a flop by any means. The movie has almost recouped half of its reported production budget, and has only been out (globally, at least) for less than a week.",
    "But it was expected to perform a lot better. More than that, it was hoped that The Suicide Squad would mark a return to form for theatrical releases, a signal to studios pressing ahead with hybrid release schedules that the cinema – and its revenue-generating power – is back.",
    "Given that the comparably terrible Suicide Squad generated a massive $267 million in its opening weekend back in 2016, $72 million seems an unfair return for an objectively better moviegoing experience. But this is a different world.",
    "It’s clear, then, that Covid-19 is still playing its part in keeping viewers away. Despite the promising vaccine uptake across the globe, fear of new variants continues to prevent theaters reaching pre-pandemic levels of revenue and attendance. According to THR, moviegoing confidence has dropped from 81% to 72% over the past three weeks, based on one US poll.",
    "That means – in the short-term, at least – concurrent releases on services like HBO Max could remain the norm. Warner has several more releases hitting the streamer via day-and-date before the end of the year, including the fourth movie in the Matrix series.",
    "While it’s true that The Suicide Squad’s release on HBO Max in the US may have pulled some audiences away from the theater who otherwise might have bought a ticket, studios like Warner Bros. mitigate the risk of releasing a big movie by generating revenue from streaming.",
    "What’s more, although Warner hasn’t yet disclosed streaming figures for its day-and-date releases like The Suicide Squad and Mortal Kombat, it’s safe to assume that these movies remain a big draw for subscribers. In fact, although not official, HBO insiders say Gunn's movie was the second biggest release of its kind on the streamer to date, which was no doubt healthy for its subscriber count.",
    "As for the rest of 2021, it will be interesting to see the box office performance of highly-anticipated – and much-delayed – releases like No Time to Die and Dune. The latter, like The Suicide Squad, is set to debut concurrently on HBO Max for 31 days, but the former is braving the traditional theatrical release.",
    "Could Bond really be the savior of cinema, then? We’ll find out in October."
  ],
  "headers": {},
  "links": {
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "reports": "https://variety.com/2021/film/box-office/box-office-the-suicide-squad-opening-weekend-projection-1235033787/",
    "Black Widow": "https://www.techradar.com/news/black-widow-is-a-bona-fide-spy-thriller-and-the-mcu-is-all-the-better-for-it",
    "Jungle Cruise": "https://www.techradar.com/news/jungle-cruise-is-a-familiar-and-overly-long-disney-adventure-but-its-still-fun",
    "THR": "https://www.hollywoodreporter.com/business/business-news/delta-variant-disrupts-moviegoing-comfort-levels-1234992378/",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "HBO insiders say": "https://www.hollywoodreporter.com/movies/movie-news/suicide-squad-box-office-jungle-cruise-1234994557/"
  }
}