{
  "source": "https://www.techradar.com/news/windows-11-users-voted-for-the-return-of-clippy-and-now-its-back-sort-of",
  "title": "Windows 11 users voted for the return of Clippy – and now it’s back (sort of)",
  "category": "computing",
  "updated": "2021-11-23T14:11:29Z",
  "author": "darren-allan",
  "summary": "As part of new emoji-laden update that’s still in testing",
  "article": [
    "Windows 11 has got some new emoji which are Fluent-style to keep in line with the rest of the redesign of Microsoft’s revamped desktop OS, and Clippy is back in the mix here (more on that later).",
    "As Microsoft revealed in a blog post, support for Emoji 13.1 has been brought in as part of the November 2021 cumulative update in preview (meaning it is still in testing).",
    "Should you want to take a look now, you can head to Windows Update, check for the latest updates on Windows 11, and grab the KB5007262 preview patch.",
    "Microsoft points out that once installed, you can hit the Windows key + period (full-stop) key to peruse the new additions within the popup emoji picker.",
    "As well as the new emoji, KB5007262 brings a number of changes that include tackling some of the issues with File Explorer, such as fixing a bug where it stops working after closing a window.",
    "The new emoji are more modern-looking to be in line with the overall Fluent Design vibe of Windows 11 as we mentioned at the outset. They look pretty smart on the whole, we think, and of course it’s noteworthy to see Clippy pop up here as the paperclip emoji.",
    "You might remember that Clippy is back by popular demand, as Microsoft implemented a vote for the iconic assistant’s return back in July 2021, and a sizeable number of folks gave the thumbs-up in that poll. It’s a welcome and fun addition, for sure.",
    "However, what has touched a few nerves here is that initially (back in July), Microsoft previewed some 3D-style Fluent Design emoji, and these new additions are clearly simple 2D affairs.",
    "In October, Brandon LeBlanc, Senior Program Manager of the Windows Insider team, tweeted to clarify that the 3D emojis which were originally aired a few months previously were the “wrong graphics” and apologized, but left many folks still feeling unhappy that they’d been hoodwinked into believing something better was in the pipeline."
  ],
  "headers": {
    "5": "Analysis: Clippy’s back, but in 2D, not 3D"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/how-to-download-windows-11",
    "blog post": "https://blogs.windows.com/windowsexperience/2021/11/22/express-yourself-with-new-emoji-now-available-in-windows-11/",
    "Windows Update": "https://www.techradar.com/how-to/software/operating-systems/how-to-fix-a-stuck-windows-update-1326307",
    "KB5007262": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1328069221163555300&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Ftopic%2Fnovember-22-2021-kb5007262-os-build-22000-348-preview-7f3e18d7-4189-4882-b0e9-afc920253aee",
    "implemented a vote for the iconic assistant’s return": "https://www.techradar.com/news/microsoft-365-clippy-is-making-a-triumphant-return",
    "tweeted": "https://twitter.com/brandonleblanc/status/1448806388847710212"
  }
}