{
  "source": "https://www.techradar.com/news/macbook-pro-16-inch-reportedly-has-magsafe-charging-issues-for-some-owners",
  "title": "MacBook Pro 16-inch reportedly has MagSafe charging issues for some owners",
  "category": "computing",
  "updated": "2021-11-30T16:17:39Z",
  "author": "darren-allan",
  "summary": "Some users have theorized that it could be a software issue",
  "article": [
    "Apple’s MacBook Pro 16-inch reportedly suffers from a glitch that means some users are finding that the laptop isn’t charging up properly using the MagSafe connection in one particular scenario.",
    "As MacRumors flagged, what’s purportedly happening here according to reports from affected users on Reddit (and the tech site’s own forums) is that the MacBook Pro is failing to charge when it’s fully shut down.",
    "It’s important to note that this is a specific scenario whereby the laptop is turned off (with the lid closed) and then the ‌MagSafe‌ cable is connected, at which point in problematic instances it just flashes amber (complete with the charging sound effect) and does not charge the battery. If, however, the charger is hooked up while the MacBook Pro is turned on, and then the notebook is turned off, it’ll charge normally.",
    "As MacRumors points out, while Apple has a support document for scenarios where a flashing amber light occurs when charging, that piece of help doesn’t seem to make any difference for these reported fails.",
    "So, what’s going on here according to reports from affected MacBook owners? And more importantly, are there any suggestions for a fix?",
    "The original poster of the above Reddit thread notes that Apple tech support provided a resolution, which worked, but only temporarily. They claim that the support team acknowledged that Apple is “aware of the issue and investigating”, and were advised as a workaround to charge in sleep mode, or with the lid open, or as noted above, to attach the MagSafe charger before shutting down the notebook.",
    "The very first reply on that thread complains about the exact same issue, and observes that Apple is going to replace their MacBook Pro 16-inch (following various diagnostic tests being run by the user).",
    "Of the replies in the MacRumors thread on the matter, various affected owners have theorized that it’s a macOS software bug, and also related to when fast charging kicks in (interestingly, the claim is if you use another charger other than the 140W model that comes with the MacBook Pro, you won’t get fast charging or this bug).",
    "There’s hope then, if Apple is indeed investigating the issue as suggested, that a fix could be in the pipeline with a macOS update.",
    "For now, we've reached out to Apple for comment."
  ],
  "headers": {
    "4": "Analysis: Hopefully just a software bug, perhaps?"
  },
  "links": {
    "Apple’s MacBook Pro 16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "MacRumors": "https://www.macrumors.com/2021/11/30/16-inch-macbook-pro-charging-magsafe-3/",
    "Reddit": "https://www.reddit.com/r/apple/comments/r455s3/2021_macbook_does_not_charge_when_its_completely/",
    "MacBook Pro": "https://www.techradar.com/news/macbook-pro-16-inch-2019-vs-macbook-pro-16-inch-2021",
    "macOS": "https://www.techradar.com/reviews/macos-12-monterey-review"
  }
}