{
  "source": "https://www.techradar.com/news/where-does-eternals-take-place-on-the-mcu-timeline",
  "title": "Where does Eternals take place on the MCU timeline?",
  "category": "entertainment",
  "updated": "2021-09-08T08:42:15Z",
  "author": "tom-power",
  "summary": "Analysis: Eternals' MCU timeline placement seems about right",
  "article": [
    "Marvel's Eternals will be the studio's next movie to arrive in theaters – and now we have confirmation of where it'll fit on the MCU timeline.",
    "In an interview with Empire Magazine, producer Nate Moore revealed that the Chloé Zhao-directed superhero flick takes place not long after the events of Avengers: Endgame.",
    "You can check out Moore's confirmation below, which features images of the interview in Empire's print edition, courtesy of Twitter user gowri_gal:",
    "For those who may be struggling to find Moore's quote, it's situated on the second page of Empire's interview.",
    "When asked where Eternals would fit into the MCU's main timeline, Moore said: \"[Eternals happens] right around the same time as Spider-Man: Far From Home, with the world recovering from the attack of Thanos and the return of half the world population.\"",
    "That means that events in the Eternals movie will occur around eight months after Avengers: Endgame. This is how much time had passed between Endgame and Far From Home so, based on Moore's reply, Eternals will happen within a similar time frame.",
    "Eternals' position on the main MCU timeline isn't unsurprising. The movie heavily ties into the events of Avengers: Infinity War and Avengers: Endgame, so the events that unfold would need to play out sooner rather than later.",
    "The Eternals sat on the sidelines as Thanos wiped out of half of all living creatures in the universe. The superhero group also failed to show up in Endgame's climactic battle, where the Avengers brought everyone back and defeated Thanos and his forces.",
    "No doubt racked by guilt, it makes sense that the Eternals would finally come out of hiding not too long after Thanos' defeat. With the Avengers disbanded and Earth needing new heroes to step up, these superpowered beings feel that they need to start protecting their adopted home from more than just the Deviants, who are their sworn enemies.",
    "It would be silly, then, if Marvel's Eternals was set two years (or even longer) after Endgame. By then, other superheroes like Shang-Chi would have emerged to shield Earth from otherworldly threats.",
    "It wouldn't be too late for the Eternals to help in the fight against cosmic entities and other threats. But, given that the film mentions the Blip – the event that saw Thanos enact his genocidal plan – Marvel's Eternals has to take place soon after. Otherwise, the world (and the MCU) will have moved on.",
    "According to its plot synopsis, Marvel's Eternals is set across a 7,000-year period on Earth. While that's still the case, the majority of the movie will take place less than a year after Endgame. So now we know where to watch Eternals whenever we settle in for our next 'Marvel movies in chronological order' marathon.",
    "Marvel's Eternals arrives exclusively in theaters on November 5."
  ],
  "headers": {
    "6": "Analysis: Eternals' placement on the MCU timeline shouldn't come as a surprise"
  },
  "links": {}
}