{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-pre-order-start-date-announced-but-still-no-release-date",
  "title": "Sony Xperia 1 III pre-order start date announced, but still no release date",
  "category": "phones",
  "updated": "2021-06-24T10:24:20Z",
  "author": "tom-bedford",
  "summary": "You can pre-order from July 1",
  "article": [
    "When the Sony Xperia 1 III was announced in April 2021, a release date for the premium Sony phone wasn't provided, and while we somehow still don't have that date, we've finally been told when pre-orders begin.",
    "According to US retailer B&H, Xperia 1 III pre-orders begin July 1 - the Sony website links to this B&H listing, citing it as an official pre-order site, which makes this look legit. It's worth pointing out, though, that we can't find a single other retailer listing this date, including others that the Sony website lists as open for pre-orders.",
    "The Sony website itself used to list the July 1 pre-order date, according to GSMArena, as well as a price of $1,299. However at the time of writing, this date and the price aren't still on the site.",
    "So it's worth waiting until July 1 to see if this date turns out to be true or not - it's very possible it's a placeholder date. If pre-orders actually do open in July, it's possible we'll hear an official launch date then too.",
    "Due to the lack of official Sony Xperia 1 III release and pricing information lots of leakers have tried filling in the gaps. Retailers adding placeholder information hasn't helped either.",
    "Last we heard, the Sony Xperia 1 III price was listed as $1,298 (which converts to about £920, AU$1,680) by a US retailer - that's notably just $1 off the price GSMArena reportedly saw listed on the Sony website, making it seem likely.",
    "The release date information isn't as consistent though, as last we heard it was scheduled for August 31. Sure, this could still line up with a July 1 pre-order kick-off, but a two-month pre-order window for a smartphone would be surprisingly long.",
    "In all honestly there's no use getting your hopes up for the Sony Xperia 1 III's release or price - it's utterly odd to announce phones then not release them for months, as Sony is prone to do, so we can't guess at what will happen. Maybe the company is hoping you forget all about its phone."
  ],
  "headers": {
    "4": "A history of confusion"
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Sony phone": "https://www.techradar.com/news/best-sony-phones",
    "B&H": "https://www.bhphotovideo.com/c/product/1634539-REG/sony_xqbc62_b_xperia_1_iii_smartphone.html/SID/wtbs_60d45124674e353ed5306748?BI=20811&KBID=16572&SID=trd-us-6418824396764438000",
    "GSMArena": "https://www.gsmarena.com/sony_us_lists_the_xperia_1_iii_at_1300-news-49711.php",
    "the Sony Xperia 1 III price": "https://www.techradar.com/news/sony-xperia-1-iii-5-iii-leaked-prices-are-even-higher-than-youd-expect",
    "last we heard it was scheduled for August 31": "https://www.techradar.com/news/sony-xperia-1-iii-release-date-leak-will-disappoint-sony-phone-fans"
  }
}