{
  "source": "https://www.techradar.com/news/half-the-worlds-population-could-be-using-digital-wallets-by-2025",
  "title": "Half the world’s population could be using digital wallets by 2025",
  "category": "computing",
  "updated": "2021-07-09T09:40:09Z",
  "author": "rob-clymo",
  "summary": "Cash increasingly sidelined by mobile wallets",
  "article": [
    "More than half the world’s population could be using digital wallets by 2025, new research has claimed.",
    "According to a new report from mobile payments network Boku, the number of digital wallets turning over more that $1 million in annual transactions is set to increase by 27% between 2020 and 2025.",
    "At the end of 2020, the survey found there were 2.8 billion digital wallets in use, an obvious boon for merchants - but this figure is projected to increase by nearly 74%, reaching 4.8 billion by the tail end of 2025.",
    "Southeast Asia, Latin America, Africa and the Middle East are the key markets in the growth of digital wallets, with many consumers are sidestepping cash and cards for more convenient digital payment option.",
    "In Southeast Asia alone, digital wallet use is expected to grow by 311% between 2020 and 2025. Meanwhile, the Far East and China is the largest digital wallet region in the world, with 1.34bn users in 2020.",
    "Conversely, take-up of digital wallets has been less sprightly in Western Europe and North America, with 65% growth in the former geographical area and 50% in the latter region expected by 2025. However, the UK is singled out in the research as having shown something of a growth spurt for digital wallets. The pandemic and a desire to move toward using cash much less frequently appears to be driving the increase according to the research.",
    "“While digital wallets are being used on a global basis, we see two distinct types being used today. One is card-based digital wallets, like Apple Pay and Google Pay, which provide an easier way to pay with cards people already have. The other is stored value digital wallets, like AliPay and GrabPay, that enable consumers to transact with digital cash and are popular in emerging markets with fast growing eCommerce sectors,” said Adam Lee, Chief Product Officer at Boku.",
    "“The markets that are set to grow the fastest are those with the lowest levels of card penetration, stored value wallets are thriving. In North America and Western Europe, which are dominated by card-based digital wallets, we are seeing the slowest growth in digital wallet adoption, as the technology provides merely incremental benefit.”",
    "The study also highlights how the growing appeal of digital wallets could be invaluable for merchants, just as long as they invest in the right technology to take advantage of the growth.",
    "Updating point of sale systems and other business infrastructure is therefore vital in order to allow e-commerce businesses to tap into the potential, alongside more conventional bricks and mortar stores."
  ],
  "headers": {
    "5": "Digital wallets"
  },
  "links": {
    "digital wallets": "https://www.techradar.com/news/best-mobile-payment-app",
    "mobile payments": "https://www.techradar.com/news/the-future-for-mobile-payment",
    "merchants": "https://www.techradar.com/best/best-merchant-services",
    "digital payment": "https://www.techradar.com/news/more-than-61-billion-people-will-use-digital-payments-by-2023",
    "Apple Pay": "https://www.techradar.com/how-to/how-to-use-apple-pay",
    "Google Pay": "https://www.techradar.com/how-to/how-to-use-google-pay",
    "point of sale systems": "https://www.techradar.com/news/the-best-pos-system",
    "e-commerce businesses": "https://www.techradar.com/news/best-ecommerce-hosting"
  }
}