{
  "source": "https://www.techradar.com/news/stranger-things-4-is-taking-so-long-because-its-ambitious-but-filming-is-nearly-done",
  "title": "Stranger Things 4 is taking so long because it's 'ambitious' – but filming is nearly done",
  "category": "entertainment",
  "updated": "2021-08-05T10:36:24Z",
  "author": "tom-power",
  "summary": "Filming on Stranger Things 4 is almost complete",
  "article": [
    "Stranger Things 4 has taken so long to film because it's the \"most ambitious\" season so far, according to Shawn Levy.",
    "Levy, who is a director and executive producer on the hit Netflix show, revealed that the sheer scope of Stranger Things season 4, coupled with the Covid-19 pandemic, were the main reasons behind its slow production.",
    "Speaking to Collider during the press tour for his upcoming film Free Guy, Levy was asked for an update on the fourth season of Stranger Things, and he stated the pandemic and ambition of the show had created a \"perfect storm\" for why filming was so slow.",
    "\"As much as it pains our viewers that it will have been so long, trust me, it pains Matt [Duffer], Ross [Duffer], and I more,\" Levy said. \"It's a kind of perfect storm combination of Covid shutdown, slower pace of filming in Covid and health protocols, which are necessary, and coincidentally we chose Season 4 to be by far – and I mean by far – the most ambitious of the seasons.\"",
    "Levy explained that, alongside season 4's global scope (the next instalment will take in new locations in Russia and the US), the show's small creative team was also a factor behind its slow production.",
    "However, Levy was able to provide good news on the filming front. In a separate Collider article, Levy confirmed that principal photography on Stranger Things 4 was nearly complete.",
    "\"I have been, along with the [Duffer] brothers, we have been kind of tag-teaming it and directing it as recently as now,\" he said. \"So not quite done filming. [We’ll be done] imminently.\"",
    "With filming due to end soon, fans will be hoping that a release date (or a tentative release window, at least) will be revealed in the near future.",
    "It's been a long time coming, too. Season 3 of Stranger Things aired over two years ago now, and its fanbase has been desperate for the next entry in the pop culture phenomenon to arrive.",
    "While the principal photography finish line draws ever closer, though, it's unlikely that we'll learn of a concrete launch date for a few months yet.",
    "Filming on season 4 may be on the home straight, but there's plenty of work that needs to be done before it lands on Netflix. A lengthy post-production process, including possible reshoots, editing each episode, layering the score and other sounds over the footage, CGI effects and other elements will all need to be completed before Stranger Things 4 launches.",
    "Levy has hinted that we will have new footage to pour over soon, though. In his release date chat with Collider, Levy suggested that the third teaser for Stranger Things 4 could arrive sooner rather than later, which should tide the show's fanbase – us included – over for a few days.",
    "Our guess? Judging by the release months for the past two teasers – February 2020 and May 2021 respectively – August, i.e. this month, seems like the most likely candidate for the third teaser to arrive.",
    "Take away the years (2020 and 2021) for hypothetical reasons, and that means there's a three-month gap between these months.",
    "If our August 2021 release for the third teaser proves to be correct, the fourth teaser should land in November 2021 – and we would be amazed if this doesn't finally give us a concrete release date for Stranger Things 4, which we suspect will arrive in early 2022."
  ],
  "headers": {
    "7": "Analysis: when can we expect Stranger Things season 4 to be released?"
  },
  "links": {
    "Stranger Things 4": "https://www.techradar.com/news/stranger-things-season-4",
    "Collider": "https://collider.com/stranger-things-season-4-release-date-announcement-when/"
  }
}