{
  "source": "https://www.techradar.com/news/the-new-ghostbusters-afterlife-trailer-teases-a-spooky-cast-reunion",
  "title": "The new Ghostbusters: Afterlife trailer teases a spooky cast reunion",
  "category": "entertainment",
  "updated": "2021-07-27T14:28:57Z",
  "author": "tom-power",
  "summary": "We're still not afraid of no ghosts",
  "article": [
    "The official trailer for Ghostbusters: Afterlife has arrived online – and Sony Pictures' reboot of its supernatural comedy series seems to be making all of the right noises ahead of its release.",
    "Dropping on Sony Pictures' social media channels on Tuesday, July 27, the new trailer showed off plenty of new footage for Afterlife, including a teaser for the return of the original movie's cast and more humorous ghost-based antics.",
    "Check out the new Ghostbusters: Afterlife video in the tweet below:",
    "A true sequel to 1989's Ghostbusters II, Afterlife is set 30 years after its predecessor.",
    "Ghostbusters: Afterlife stars Carrie Coon (The Leftovers) as Callie, a single mom to Phoebe (Designated Survivor's McKenna Grace) and Trevor (Stranger Things' Finn Wolfhard) who move into an old farmhouse that the children's late grandfather left to the family.",
    "Exploring their new abode, Trevor and Phoebe discover that their grandad was an original Ghostbuster – and it isn't long before they're having to follow in his footsteps.",
    "When a series of unexplained (but related) earthquakes in the nearby town of Summerville, Ohio turn out to be ghost-based, the duo take up their grandparent's mantle to save the world once more.",
    "While Afterlife isn't Sony's first attempt to revive its Ghostbusters film series, it feels like a movie that'll please established fans while introducing newcomers to the franchise.",
    "The 2016 reboot, which starred Kristen Wiig and Melissa McCarthy, was fairly well received by fans and critics alike, but it struggled to perform at the global box office.",
    "The movie took $229.1 million overall but, with a budget of around $144 million and the sheer amount of marketing costs, reports at the time claimed that Ghostbusters needed to rake in $300 million to break even.",
    "As a result of underperforming at the box office, a planned sequel was scrapped – and, save for a comic book series and talk of an animated TV show, the Ghostbusters franchise seemed like it was done for the time being.",
    "Fast forward to January 2019 and the announcement that Jason Reitman, the son of Ghostbusters I and II director Ivan, was to direct a new Ghostbusters movie, and fans are more positive about the series' future.",
    "Of course, trailers can be misleading, so it's difficult to gauge if Ghostbusters: Afterlife will be the sure-fire hit that Sony and Ghostbusters diehards will hope it is.",
    "The return of the film's original cast, though, should help Afterlife's box office chances. Bill Murray, Dan Ackroyd, Ernie Hudson, Sigourney Weaver and Annie Potts are all reprising their roles from the first two movies, which will go a long way to enticing older Ghostbusters fans to watch Afterlife.",
    "Yes, that group (alongside Ivan Reitman) made appearances in the 2016 movie, too, but those were largely cameos and nods to the films that came before. Afterlife will see Murray and company portray the same characters as they did in the 1984 and 1989 movies, which provides some much needed continuity between Afterlife and its predecessors.",
    "Combine that with Afterlife being a direct continuation of the first two movies, and a tone and aesthetic that's in keeping with Ghostbusters I and II, and Afterlife could be the movie that finally revitalizes the Ghostbusters series. It's been a long time coming if it does.",
    "Ghostbusters: Afterlife is set to be released exclusively in theaters on November 11 in the US and November 12 in the UK."
  ],
  "headers": {
    "7": "Opinion: Ghostbusters: Afterlife looks like the sequel that fans have waited years for"
  },
  "links": {
    "reports": "https://www.hollywoodreporter.com/news/general-news/ghostbusters-box-office-loss-sequel-unlikely-918515/"
  }
}