{
  "source": "https://www.techradar.com/news/microsoft-defender-for-endpoint-will-now-protect-your-removable-storage-and-printers",
  "title": "Microsoft Defender for Endpoint will now protect your removable storage and printers",
  "category": "computing",
  "updated": "2021-07-27T15:17:12Z",
  "author": "mayank-sharma",
  "summary": "Microsoft’s endpoint protection product also adds new Mac capabilities",
  "article": [
    "Microsoft has added new controls to help businesses secure their removable storage devices and printers to address the increased security concerns brought on by the increase of remote working.",
    "The company reasons that the work-from-anywhere environment has widened the attack surface area, which has led it to expand the scope of the enterprise version of its Windows 10 Defender protection product.",
    "“We are excited to announce new device control capabilities in Microsoft Defender for Endpoint to secure removable storage scenarios on Windows and macOS platforms and offer an additional layer of protection for printing scenarios,” wrote Tewang Chen, a Technical Program Manager at Microsoft.",
    "The new capabilities are designed to allow administrators to exercise access restrictions on removable devices and reign in printing tasks on non-corporate or non-approved printers.",
    "In the post Chen adds that the new printer protection feature allows admins to block users from printing to a non-corporate network printer or non-approved USB printer.",
    "Furthermore, the new removable storage access control capabilities added to the Windows version of the security platform complement the existing device control protections for tasks such as installing a new device, removing BitLocker storage, and others.",
    "With the new removable storage access control, admins will be able to audio, allow, or prevent the read, write, or execute permissions to removable storage based on various device properties, such as Vendor ID and serial number.",
    "Furthermore, the platform now offers removable storage protection on Mac as well. This adds to the endpoint platform growing capabilities on Mac. Notably, last month Microsoft added support for detecting jailbroken iOS devices to the product.",
    "Chen added that while removable storage access control on Windows and removable storage protection on Mac are generally available, printer protection on Windows is currently available as a public preview."
  ],
  "headers": {
    "4": "Wider net"
  },
  "links": {
    "removable storage devices": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "printers": "https://www.techradar.com/best/best-small-business-printers",
    "remote working": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "Windows 10 Defender": "https://www.techradar.com/reviews/windows-defender",
    "Windows": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "macOS": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "wrote": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4831185393842771000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-defender-for-endpoint%2Fprotect-your-removable-storage-and-printers-with-microsoft%2Fba-p%2F2324806&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-defender-for-endpoint-will-now-protect-your-removable-storage-and-printers",
    "network printer": "https://www.techradar.com/news/best-wireless-printers",
    "USB printer": "https://www.techradar.com/news/best-all-in-one-printer",
    "Microsoft added support": "https://www.techradar.com/news/microsoft-defender-atp-now-detects-jailbroken-apple-devices",
    "iOS devices": "https://www.techradar.com/news/best-iphone"
  }
}