{
  "source": "https://www.techradar.com/news/dji-air-2s-vs-dji-mavic-2-pro",
  "title": "DJI Air 2S vs DJI Mavic 2 Pro: which is the best drone for you?",
  "category": "cameras",
  "updated": "2021-08-25T11:48:56Z",
  "author": "james-abbott",
  "summary": "Which 1-inch sensor drone is the best aerial companion?",
  "article": [
    "The DJI Air 2S is the drone king's latest flying camera and one that appears to combine the best parts of two predecessors – the mid-range DJI Mavic Air 2 and the higher-end DJI Mavic 2 Pro. So exactly does it compare to the latter, given it has the same-size sensor and many of the same features?",
    "Before we go in-depth on the DJI Air 2S vs Mavic 2 Pro debate, let's step back a bit and to see where we've come from. The DJI Mavic 2 Pro was released back in mid-2018 and amazed photographers and videographers with its combination of a 1-inch sensor and adjustable aperture, all in a lightweight and portable package. Previously, a 1-inch sensor was only available in the DJI Phantom 4 Pro, which is a considerably larger and heavier drone that’s much less portable.",
    "Fast forward to April of this year, though, and we saw the release of the DJI Air 2S; an early follow-up to 2020’s DJI Mavic Air 2, but with a big difference. As well as several upgrades and new features, the most significant upgrade was the addition of a 1-inch sensor in an even smaller and lighter drone than the DJI Mavic 2 Pro.",
    "While most drone pilots didn’t think that this would be possible so soon, DJI once again managed to surprise and amaze us all. But does that mean you should definitely plump for a DJI Air 2S, or are there still some reasons to go for the Mavic 2 Pro? Let's find out.",
    "These two folding drones look very alike, both when folded and unfolded. In fact, there isn't a huge difference in size, with the DJI Mavic 2 Pro measuring 214×91×84mm and weighing 907g, compared to the Mavic Air 2S at 180×97×80mm and weighing 595g.",
    "In your kit bag, you’re still going to need the same amount of room to carry either drone, but the Air 2S is a crucial 312g lighter. When the drones are unfolded, the size difference is greater, with the Mavic 2 Pro measuring 322×242×84mm compared to the Air 2S' dimensions 183×253×77mm, but this is so important from a practical point of view.",
    "Further weight savings can be found in the batteries, with the smaller DJI Air 2S batteries weighing 198g compared to 297g for the Mavic 2 Pro. If you’re carrying the drone and three batteries, then, the Air 2S is over 500g lighter than the Mavic 2 Pro, which is impressive considering the fact they both feature a 1-inch sensor.",
    "Both batteries are also advertised as having a flight time of up to 31 minutes with no wind. While this is unrealistic in the real world, it’s impressive that a much smaller and lighter battery can perform as well as its larger counterpart.",
    "The controller for the Air 2S doesn’t fold like the Mavic 2 Pro's controller and is considerably larger, which is a curious move for a smaller drone and slightly negates some of those size advantages. Other differences on the Air 2S controller include the lack of a small LCD screen for displaying flight and camera information, as well as a different system for mounting a phone to the controller.",
    "While flying, in general, feels pretty much the same on both drones, the Air 2S provides upgraded safety and flight features. These include having Advanced Pilot Assistance System (APAS) 4.0, and a feature called AirSense.",
    "APAS 4.0 allows you to set the drone to fly and stop autonomously, including the ability to move under or over obstacles when detected to maintain continuous flight. Airsense, on the other hand, uses ADS-B aviation technology to receive signals from nearby airplanes and helicopters and displays their locations on the on-screen map on the DJI Fly app.",
    "Camera-wise, both drones feature a 20MP 1-inch sensor, though there are some subtle differences between them. The Air 2S camera has a fixed f/2.8 aperture with an 88-degree field of view and a full-frame equivalent focal length of 22mm, compared to the Mavic 2 Pro’s 77-degree field of view and 28mm equivalent focal length.",
    "The differences here are once again negligible, but it’s the Mavic 2 Pro’s adjustable f/2.8-f/11 aperture that’s the most significant advantage. When paired with a 1-inch sensor this won’t do much for achieving greater depth of field – instead, the advantage of an adjustable aperture comes when shooting video, because you can adjust the exposure as light changes without the need to land the drone and change the ND filter, like would have to with the Air 2S.",
    "While the Mavic 2 Pro’s adjustable aperture is a compelling feature for videographers especially, the Air 2S has a few impressive tricks up its sleeve. Most notably, it can shoot video up to 5.4K at 30fps, while digital zoom allows you to safely get closer to subjects without moving the drone.",
    "The amount of zoom you get depends on the video resolution you've gone for. From experience, we'd say 2x digital zoom is the maximum you can really use before image quality reduces significantly, but you can see for yourself in the video above.",
    "The Mavic 2 Pro and Mavic Air 2S fly at near-identical speeds and have similar wind resistance, although the Mavic 2 Pro does just have the edge here.",
    "In reality, though, it's unlikely that a few miles per hour here or there is going to make a major difference, and it’s rare to shoot video with the drone traveling at full speed in Sport mode anyway.",
    "In terms of positioning accuracy, both drones are extremely accurate and can’t be faulted, although the Air 2S pips the Mavic Pro 2 in terms of satellite systems by offering GPS, GLONASS, and GALILEO, whereas the Mavic Pro 2 only uses the first two. Once again, in real-world flying situations, you likely won’t notice a difference between the two drones.",
    "Additionally, the connection between the controller and drone is excellent in both cases. Changes to flight controls are immediate with no stuttering or delay visible on the smartphone feed when using it for camera Live View. This is due in part, to both using OcuSync 2.0 for video transmission.",
    "As stated earlier, the drones also have an identical maximum flight time of up to 31 minutes with no wind. In reality, neither will be able to fly for quite this long, particularly as they're programmed to Return to Home when the battery reaches a specified level (25% by default). But you can expect very similar levels of performance in this area, too.",
    "When it comes to image and video quality, neither of these drones will disappoint. The Mavic 2 Pro sensor provides a dynamic range of 14 stops, while the Air 2S is slightly lower at 12.6 stops, so there’s not much between them. Still, that extra 1.4 stops could be the difference between maintaining sky detail and a blown-out white sky.",
    "Overall, image quality across both drones is great, but when it comes to high ISO handling, the Air 2S blows the Mavic 2 Pro out of the water.",
    "Pictures taken at all ISO settings are extremely clean up to ISO 3200 on the Air 2S, and it’s only at ISO 6400 where chroma and luminance noise becomes more noticeable. You may start to see this as early as ISO 400 on the Mavic 2 Pro.",
    "The reason for this is that the Air 2S applies 'Temporal Denoising Technology' to raw files in-camera to reduce high ISO noise. The results are impressive, and while there’s a dubious aspect to cameras applying any kind of processing to raw files, this does have the advantage of making it possible to shoot at higher ISO settings when the situation calls for it.",
    "What about video? If you need footage that can be used in a professional workflow, both drones can shoot in the flat Dlog-M 10-bit color profile. There's also a standard-setting that’s the video equivalent of a JPEG and is ideal for hobbyists. The video produced by both drones looks excellent, so the best way to compare what’s possible with either option is to look at the resolutions and frame rates.",
    "The Air 2S can shoot 5.4K at up to 30 fps, 4K at up to 60fps, 2.7K at up to 60fps, and FHD at up to 120fps, with a maximum bitrate of 150Mbps.",
    "The Mavic 2 Pro, meanwhile, can shoot 4K at up to 30fps, 2.7K at up to 60fps, and FHD at up to 120fps with a maximum bitrate of 100Mbps.",
    "What does all of this mean? The ability to shoot video at 5.4K on the Air 2S isn’t going to wow many people, but being able to shoot 4K at up to 60fps will undoubtedly be attractive to some professional videographers.",
    "The Air 2S is undoubtedly a better overall drone than the Mavic 2 Pro. It brings size and weight savings, despite also housing a camera with a 1-inch sensor, and offers better high ISO noise handling and improved video capture to boot. If you’re a stills photographer, then the Air 2S is the best option for you. But if you're mainly looking to shoot video, the decision isn't quite as simple.",
    "On the one hand, the Air 2S can capture higher resolution 5.4K video up to 30fps and resolutions of 4K video at up to 60fps compared to the Mavic 2 Pro’s maximum of 4k at 30fps.",
    "But the Mavic 2 Pro’s all-important adjustable aperture makes it an extremely convenient and useful option for shooting video. You can still use ND filters to control shutter speed, but the adjustable aperture lets you deal with light changes, so you don't need to land the drone and change the filter to a different strength.",
    "Another factor you’ll want to consider is price. The standard Mavic 2 Pro kit costs £1,349 / $1,599 / AU $2,499 and consists of the drone, controller, one battery, propellers, a charger, and all cables. But the Air 2S is available in a standard kit with all the same accessories as the Mavic 2 Pro, for just £899 / $999 / AU $1699.",
    "What makes the Air 2S drone even more attractive, in terms of value, is that the Fly More Bundle costs £1169 / $1299 / AU $2099. This means you can get everything you need with the Air 2S, including a set of four ND filters, for considerably less than the Mavic 2 Pro standard kit, making it a great deal."
  ],
  "headers": {
    "4": "DJI Air 2S vs Mavic 2 Pro: design and controller",
    "9": "DJI Air 2S vs Mavic 2 Pro: Specs and features",
    "15": "DJI Air 2S vs Mavic 2 Pro: Performance",
    "20": "DJI Air 2S vs Mavic 2 Pro: Image and video quality",
    "28": "DJI Air 2S vs Mavic 2 Pro: Verdict"
  },
  "links": {
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review",
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "DJI Phantom 4 Pro": "https://www.techradar.com/reviews/dji-phantom-4-pro-v20",
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s"
  }
}