{
  "source": "https://www.techradar.com/news/the-worlds-biggest-meat-producer-got-taken-down-by-a-cyberattack",
  "title": "The world's biggest meat producer got taken down by a cyberattack",
  "category": "computing",
  "updated": "2021-06-01T10:43:29Z",
  "author": "sead-fadilpasic",
  "summary": "Australian cattle lived to see another day",
  "article": [
    "Cybercriminals have disrupted operations at one of the world’s largest meat suppliers, forcing it to restore systems from a backup, reports have claimed.",
    "Following the attack, JBS SA was forced to take some of its servers in North America and Australia offline, delaying some transactions with customers and suppliers, although plant operations appeared to continue.",
    "Industry news site Beef Central added that all beef and lamb kills across Australia were canceled, with some kill and fabrication shifts in the US also being halted. Canadian beef plants in Brooks, Alberta, which account for more than a quarter of the nation’s full production, were affected, it was confirmed. It processes around 4,200 head of cattle a day, allegedly.",
    "In total, two shifts were sent home, as they had nothing to do.",
    "“There are no unionized workers there,” Scott Payne, spokesman for United Food and Commercial Workers Canada Union Local 401, told Bloomberg in a phone interview. “That means effectively the plant’s operations have shut for the day.”",
    "JBS’ backup servers were not affected, meaning the company should be able to use data from those servers to restore its systems. So far, it is believed that customer, supplier and employee data wasn’t compromised, stolen or otherwise tampered with.",
    "The damage caused by the attack is not yet known, but it was said that the Australian Cyber Security Center is involved in investigating. Agriculture Minister David Littleproud has said the government is trying to find out who the perpetrators are, and bring them to justice.",
    "Little is known about the nature of the attack and we are yet to find out what type of malware was used. Given that JBS had to bring its servers offline, that it mentioned analyzing data for theft or misuse, and that it said it had to restore the systems from backups, it’s quite possible that JBS was a victim of a ransomware attack.",
    "Via: Bloomberg"
  ],
  "headers": {
    "5": "Restoring from backup"
  },
  "links": {
    "backup": "https://www.techradar.com/best/best-backup-software",
    "added": "https://www.beefcentral.com/news/jbs-global-meat-processing-operations-paralysed-by-cyber-attack/",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-31/meat-is-latest-cyber-victim-as-hackers-hit-top-supplier-jbs?srnd=technology-vp"
  }
}