{
  "source": "https://www.techradar.com/news/you-can-already-use-googles-play-store-in-windows-11-heres-how",
  "title": "You can already use Google's Play Store in Windows 11 – here's how",
  "category": "computing",
  "updated": "2021-10-25T11:19:00Z",
  "author": "daryl-baxter",
  "summary": "This is where the fun begins",
  "article": [
    "Running Android apps in Windows 11 through Amazon was brought to the Insider program last week, and already a developer has unlocked Google’s Play Store for you to run any apps on Microsoft’s operating system instead.",
    "While you can currently run apps from Amazon’s Android Store, you were limited to what was available on there, compared to the thousands of apps on Google’s store.",
    "From games to productivity tools, and other social media apps, there’s thousands to choose from to run on your laptop or tablet, thanks to a guide that the developer has released over the weekend.",
    "However, the benefits of what a larger app store could bring to Windows 11 may show greater opportunities to both Microsoft and Google in the future if users embrace Android on their Windows 11 devices.",
    "A developer by the name of ADeltaX on Twitter has been documenting their efforts in getting the Play Store to work, and over the weekend they achieved it.",
    "The YouTube tutorial they give is easy to follow, and you’ll be able to run your Android apps alongside Paint, Snipping Tool and other Windows 11 apps in no time.",
    "But we should state that this may not be available for long, as Microsoft will most likely revoke access to the store. Currently, the only way to use Android apps will be through the Microsoft Store and the library of Amazon’s App Store.",
    "However, this does open up the avenue for games and productivity apps to be used on tablets and laptops alike running Windows 11 that aren’t available through Amazon.",
    "It’s no secret that the Google Play Store is less regulated than Apple’s App Store when it comes to the types of apps available to install. From emulators that can run consoles from years ago, to ports of games that are unauthorized by the teams behind the originals.",
    "Being able to run these on your Windows 11 device is going to be a tempting prospect to many. There’s around 60,000 apps available on Amazon’s Store, compared to over three million apps on the Google Play Store. With games, media apps and other categories available to download compared to what’s on Amazon’s store, it may tip the scales as to what users want to install on their machine.",
    "But it could also bring an added benefit where Microsoft and Google partner up and make this method official in the future. Microsoft’s CEO, Satya Nadella has been a big proponent of making Windows and the company’s other apps as a service on other devices, so this only makes sense.",
    "Especially when the Surface Duo 2 is running Android, there’s no obvious disadvantage here for both companies.",
    "However, it may be a question of waiting to see how users around the world will react to Android apps in the Microsoft Store, and if there will be enough of a positive reception for a partnership to occur.",
    "But regardless, it’s an interesting time to see the worlds of Microsoft and Google collide. It will ultimately be up to users if they want to see more of their favorite Android apps on Windows 11 devices soon.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "How did this happen?",
    "8": "Analysis: A Tale of Two App Cities"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "developer has unlocked Google’s Play Store": "https://github.com/ADeltaX/WSAGAScript",
    "Surface Duo 2": "https://www.techradar.com/reviews/surface-duo-2",
    "Windows Latest": "https://www.windowslatest.com/2021/10/24/developer-runs-google-play-store-on-windows-11/"
  }
}