{
  "source": "https://www.techradar.com/news/nvidia-rtx-3060-prices-are-spiralling-upwards-and-the-gpu-isnt-even-out-yet",
  "title": "Nvidia RTX 3060 prices are spiralling upwards – and the GPU isn’t even out yet",
  "category": "computing",
  "updated": "2021-02-15T09:52:28Z",
  "author": "darren-allan",
  "summary": "Pre-order price hikes are a very unwelcome sight",
  "article": [
    "Nvidia’s incoming RTX 3060 graphics card, which goes on sale later in February, is seeing its prices hiked even while the GPU is waiting in the wings, still in the pre-order phase.",
    "This is happening in Europe according to a report by VideoCardz, despite Nvidia’s insistence to retailers that the new graphics card should be sold at the recommended price, which is $329 in the US (€329 in Europe) when it comes out on February 25 (in the form of third-party cards – there will be no Founders Edition made by Nvidia).",
    "Europe-based retailers like ProShop are hiking the price of the 3060, the report notes, and it’s now selling the GPU at €499 rather than €329, which is over 50% more expensive than it should be compared to the recommended pricing (or in Polish money, it’s starting from 2799 PLN rather than 1599 PLN – a massive hike of 75%).",
    "This kind of upward movement on the price is evident elsewhere, VideoCardz notes, with the likes of Portuguese retailer PCDiga upping the asking prices on the RTX 3060 by almost €100 inside a week – meaning that it’s pitched at about the same levels as some models of the RTX 3060 Ti at that retailer (indeed, some Ti variants are actually cheaper – not that you can get stock of the latter GPU anyway).",
    "This isn’t hugely surprising, given that all we are hearing about is stock shortages of current-gen GPUs – both Nvidia and AMD models – coupled with the worse news of the latest cryptocurrency boom meaning it’s not just price gougers and scalpers that folks looking for a gaming GPU are now competing against.",
    "Further remember that recently we heard another European retailer, Alternate, predict that the situation around Nvidia’s GPU supply will continue to deteriorate during Q1 of this year, with 3060 Ti and 3080 models supposedly remaining particularly scarce. Indeed, graphics card maker Inno3D has reportedly discontinued at least some of its RTX 3060 Ti models due to supply issues.",
    "If you’re wanting to invest in a new Ampere GPU (or an AMD Big Navi one for that matter), it’s sadly a bleak picture for the near-term prospects in terms of availability and pricing."
  ],
  "headers": {
    "4": "Bleak outlook"
  },
  "links": {
    "Nvidia’s incoming RTX 3060 graphics card": "https://www.techradar.com/news/nvidia-rtx-3060-goes-on-sale-as-retailer-apparently-jumps-the-gun",
    "VideoCardz": "https://videocardz.com/newz/retailers-already-increasing-pricing-on-geforce-rtx-3060-before-it-is-even-released",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "both Nvidia and AMD models": "https://www.techradar.com/news/nvidia-rtx-3000-stock-may-not-improve-until-may-and-amds-gpu-outlook-isnt-great-either",
    "Nvidia’s GPU supply will continue to deteriorate": "https://www.techradar.com/news/nvidia-rtx-3080-stock-shortage-is-set-to-worsen-and-it-could-cause-prices-to-rise",
    "reportedly discontinued at least some of its RTX 3060 Ti models": "https://www.techradar.com/news/nvidia-rtx-3060-ti-stock-woes-could-get-a-lot-worse-with-inno3d-reportedly-dropping-models",
    "Ampere GPU": "https://www.techradar.com/news/nvidia-ampere",
    "AMD Big Navi": "https://www.techradar.com/news/amd-big-navi"
  }
}