{
  "source": "https://www.techradar.com/news/could-your-emails-be-spying-on-you-more-than-you-think",
  "title": "Could your emails be spying on you more than you think?",
  "category": "computing",
  "updated": "2021-02-17T12:00:55Z",
  "author": "mayank-sharma",
  "summary": "Experts call for stronger enforcement of regulations to curb use of 'spy pixels'",
  "article": [
    "A growing number of large brands are now regularly embedding tracking pixels in their emails, in what could be seen as a blatant disregard of privacy rules such as the GDPR.",
    "Brands including British Airways, TalkTalk, Vodafone, Sainsbury's, Tesco, HSBC, Marks & Spencer, Asos, Unilever, and others were highlighted as offenders by premium email service, Hey, which analysed a cache of emails on the request of the BBC.",
    "\"On average, every Hey customer receives 24 emails per day that attempt to spy on them,\" Hey co-founder David Heinemeier Hansson noted, adding that this amounts to \"grotesque invasion of privacy.”",
    "Hansson added that the top 10% of users receive more than fifty emails with tracking pixels.",
    "\"We're processing over one million emails a day and we're just a tiny service compared to the likes of Gmail, but that's north of 600,000 spying attempts blocked every day,” he noted.",
    "Speaking to the BBC, both British Airways and TalkTalk defended using of tracking pixels, saying it was a commonplace marketing tactic to better understand their customers.",
    "In the guise of better customer engagement, the hidden pixels are usually used to track when, and the number of times, an email has been opened, and can even estimate the customers' rough physical location based on their IP address.",
    "GDPR requires organizations to inform recipients of the pixels, and in most cases to obtain consent. However, Pat Walshe from Privacy Matters told the BBC that while the law is clear in terms of what is required of the advertisers, it isn’t backed up enough by regulatory enforcement.",
    "“Just because this practice is widespread doesn't mean it's correct and acceptable,” believes Walshe.",
    "Via: BBC"
  ],
  "headers": {
    "3": "Violation is the norm"
  },
  "links": {
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "email service": "https://www.techradar.com/news/best-email-provider",
    "Hey": "https://www.techradar.com/news/hey-email-gets-cleared-by-app-store-is-now-open-to-everyone",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "BBC": "https://www.bbc.com/news/technology-56071437"
  }
}