{
  "source": "https://www.techradar.com/news/microsoft-teams-update-aims-to-spice-up-your-next-video-meeting",
  "title": "Microsoft Teams update aims to spice up your next video meeting",
  "category": "computing",
  "updated": "2021-09-16T11:18:05Z",
  "author": "joel-khalili",
  "summary": "Share-to-stage feature will give you the chance to get in on the action",
  "article": [
    "Microsoft has dropped new details about an upcoming feature for collaboration platform Teams that will add an additional measure of interactivity to video calls.",
    "Announced back in May 2021 during Microsoft Build, the share-to-stage feature allows meeting attendees to interact with content shared to their screen via third-party Teams apps.",
    "For example, co-workers will be able to scribble on a communal whiteboard or contribute to brainstorm documents in real-time, without leaving the Teams client.",
    "In a blog post, Microsoft revealed the first wave of applications that will take advantage of the feature: MURAL, Miro, Lucidspark and Freehand.",
    "According to Microsoft, Teams features like share-to-stage will be crucial to the success of hybrid working initiatives in the months to come, giving all meeting attendees (whether based in the office or at home) the opportunity to contribute.",
    "“Apps in meetings offer a more effective way to facilitate collaboration, enhance team productivity and drive results during the flow of a Teams meeting,” the company explained. “We can use them while we talk with one another, to help us stay on track with an agenda, to log action items in our plans, and so much more.”",
    "“Until now, we could only interact with an app through the side-panel or in-meeting notifications. But with this new capability, you’ll be able to add an app to a meeting and then share it onto the meeting stage where everyone can see and interact with the app content.”",
    "The four apps that will support share-to-stage when it first goes live all share broadly similar functionality; each fits neatly into the “whiteboarding” category. However, Microsoft says these apps are the first of many that will support the new feature, which suggests the use cases for share-to-stage will broaden over time.",
    "The company has not yet offered a specific date for the rollout of share-to-stage, stating only that the feature is “coming soon”."
  ],
  "headers": {
    "4": "Microsoft Teams collaboration"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5879695322691391000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-teams-blog%2Fbeyond-sharing-your-screen-interactive-collaboration-with-apps%2Fba-p%2F2709595&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-teams-update-aims-to-spice-up-your-next-video-meeting",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}