{
  "source": "https://www.techradar.com/news/shadow-and-bones-new-trailer-shows-why-itll-be-your-next-netflix-fantasy-binge-watch",
  "title": "Shadow and Bone's new trailer shows why it'll be your next Netflix fantasy binge watch",
  "category": "entertainment",
  "updated": "2021-03-30T13:14:59Z",
  "author": "tom-power",
  "summary": "The Grishaverse is almost here",
  "article": [
    "Shadow and Bone arrives on Netflix next month, and the streamer has started to ramp up marketing on its adaptation of Leigh Bardugo's critically-acclaimed book series.",
    "With the TV show's release a matter of weeks away, Netflix has released a new trailer that's jam packed with new footage for fans to mull over.",
    "The series' official trailer was posted on Netflix's multiple social media channels, including its NX Twitter account. You can watch the full trailer, which does a great job of setting up the premise for Shadow and Bone, below:",
    "Shadow and Bone is the name of the first book in Bardugo's Grisha trilogy. However, Netflix is taking a different approach for its TV adaptation, and the streaming giant is amalgamating a couple of Bardugo's different books into the series' first season.",
    "For this adaptation, Shadow and Bone borrows from the book of the same name plus elements of Bardugo's Six of Crows duology. The TV show will largely focus on the events of the Shadow and Bone novel, but it will intersect that story with parts of the Six of Crows book, too. In that way, Netflix's Shadow and Bone acts as a Six of Crows prequel series just as much as it tells the tale of the Grisha trilogy's main players.",
    "If that sounds confusing, think of it in a similar way to Netflix's adaptation of The Witcher. In its first season, the stories of Geralt, Ciri, and Yennefer were told across three different timelines. Some viewers found the premise baffling but, eventually, it made sense when the stories of this key trio intersected at varying points.",
    "Shadow and Bone will work in a similar fashion. The first season will largely follow Alina Starkov (Jessie Mei Li), a lowly soldier and orphan who unleashes an extraordinary power during a battle in an area known as the Shadow Fold. Called up to join a legion of magic wielders known as the Grisha, Alina finds herself pulled in various directions, including her loyalty to close friend Mal (Archue Renaux) and her place in the Grisha army, which is led by the seemingly sinister General Kirigan (Ben Barnes).",
    "While that overarching plot is ongoing, audiences will also be introduced to characters from Six of Crows. The events of this duology take place after Shadow and Bone, so Bardugo and Netflix showrunner Eric Heisserer had to invent prequel stories for this series' characters (h/t The Wrap). That includes Kaz (Freddy Carter) and Inej (Amita Surman), who play prominent roles in Six of Crows and its sequel Crooked Kingdom, with the view to setting their proper stories up for future series.",
    "If nothing else, this timeline problem will give established Grishaverse fans something new to enjoy as part of Netflix's adaptation. Newcomers should revel this new universe, too, particularly if The Witcher is a Netflix favorite of yours.",
    "Shadow and Bone will launch exclusively on Netflix on April 23."
  ],
  "headers": {
    "3": "Shadow and Bone on Netflix is switching up the Grishaverse's formula"
  },
  "links": {
    "Netflix": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1737583789472905000/https://netflix.com/",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "The Wrap": "https://www.thewrap.com/shadow-and-bone-series-netflix-six-of-crows-characters-timelines-books/"
  }
}