{
  "source": "https://www.techradar.com/news/matter-smart-home-system-from-apple-google-and-amazon-delayed-until-2022",
  "title": "Matter smart home system from Apple, Google and Amazon delayed until 2022",
  "category": "smart-home",
  "updated": "2021-08-14T16:01:23Z",
  "author": "david-nield",
  "summary": "A matter of timing",
  "article": [
    "You're going to have to wait a little longer before all of your smart home devices work seamlessly together, because the launch of Matter – the standard protocol backed by Apple, Google, Amazon and many others – has now been pushed back to 2022.",
    "Tobin Richardson, the CEO of the Connectivity Standards Alliance (CSA) organization developing the tech, broke the news in a blog post. It means the first Matter-compatible hardware devices won't appear in 2021, as had originally been planned.",
    "The hold up is related to the Software Development Kit (SDK) and device certification process – basically, the stuff that hardware makers need to work with in order to get a nice big 'works with Matter' badge on the packaging of whatever it is they're making.",
    "The updated timeline for Matter points to the first half of 2022 as the point at which we'll see Matter-compatible devices go on sale (and current devices updated to meet the requirements of Matter). With so many big names behind it, there's no doubt that Matter will emerge as a new standard, eventually.",
    "\"I'm so impressed by the continued investment by so many to make Matter a success,\" writes Richardson. \"We've seen active participation from member companies across the industry, driving the core specification, the budding certification program, and marketing and industry outreach.\"",
    "Several factors apparently contributed to the delay, including the addition of more manufacturers to the CSA, and of course the ongoing impact of the global pandemic we're all living through. There are now more than 200 companies involved, including Samsung and the Zigbee Alliance as well as Apple, Google and Amazon.",
    "If you've got smart home devices set up where you live, they might already work together – perhaps you can tell your Amazon Echo to turn on a Philips Hue light, for example, or maybe you're using a standard such as Apple HomeKit to keep everything in sync together.",
    "However, Matter is hoping to go further than just connecting everything to Alexa or HomeKit: it makes use of existing standards like Bluetooth, Wi-Fi and the newer Thread protocol, and it's IP-based (which helps to simplify connections between devices and the wider internet).",
    "In other words, while there is some interoperability in smart home devices today, Matter will take it to the next level. That will cover everything from the ease with which you can add new devices to the network, to the speed at which devices will work in sync.",
    "Once Matter becomes established then you shouldn't have to worry about buying new smart home kit that's incompatible with what you've already got. Perhaps just as importantly, you should be able to switch from using Apple devices as your main controllers to using Google devices... or at least, that's the theory.",
    "Via The Verge"
  ],
  "headers": {
    "3": "Here comes the hardware",
    "6": "Analysis: Matter should improve the smart home"
  },
  "links": {
    "blog post": "https://zigbeealliance.org/news_and_articles/building-a-standard-that-really-matters/",
    "writes Richardson": "https://zigbeealliance.org/news_and_articles/building-a-standard-that-really-matters/",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Philips Hue": "https://www.techradar.com/reviews/philips-hue-lightstrip-plus",
    "The Verge": "https://www.theverge.com/2021/8/13/22623275/matter-interoperable-smart-home-standard-delay-2022-project-chip-csa"
  }
}