{
  "source": "https://www.techradar.com/news/ee-is-first-uk-operator-to-confirm-3g-switch-off-plans",
  "title": "EE is first UK operator to confirm 3G switch off plans",
  "category": "phones",
  "updated": "2021-07-14T10:48:58Z",
  "author": "steve-mccaskill",
  "summary": "EE will switch off 3G in 2023 to support 4G and 5G",
  "article": [
    "EE is the first UK operator to commit to switching off its aging 3G network, claiming the ability reuse valuable spectrum will enhance its more efficient 4G and 5G services.",
    "The company was also the first operator to launch a commercial 4G service back in 2012 and has continued to operate 3G in order to provide additional coverage in areas that LTE can’t reach.",
    "However, as 4G has become increasingly available, the need for 3G and its inferior speeds and capacity is significantly reduced.",
    "Most mobile data in developed markets is transmitted via 4G, while Voice over LTE (VoLTE) technology means such networks can also handle the majority of calls. Switching off 3G allows operators to reuse valuable spectrum for 4G and 5G networks which are more complementary technologies.",
    "Ironically, the main reason EE was able to secure first mover advantage in 4G was because it was controversially given permission to launch LTE using its 1800MHz 3G frequencies.",
    "BT Consumer CEO Marc Allera said the company was working with any consumer or business customers that still relied on the 3G service and would initiative a phased transition that would be completed by 2023.",
    "“This [Switch off] will reduce complexity and allow us to reuse spectrum,” he said.",
    "Allera was at Three when it became the first UK operator to launch 3G back in 2003 – beating both of EE’s successor networks Orange and T-Mobile. They, along with Vodafone, turned on their 3G networks in 2004. Following the merger of Orange and T-Mobile to form Everything Everywhere (which then became EE), the two 3G services were combined to form a single network accessible to all customers.",
    "2G networks are expected to outlast 3G because of wide coverage and comparatively lower power requirements that make it an ideal standard for mass IoT deployments that require long battery life and minimal bandwidth.",
    "Some elderly and rural users require 2G, as does the government’s smart meter project, that connects vehicles to emergency services in the event of an airbag deployment. BT also noted that it was necessary to maintain 2G because of certain roaming requirements.",
    "It has been suggested that any 2G switchover should wait until at least the 2030s, with a possible shared 2G network touted as a possible solution. However Swiss operator Swisscom has already turned off its 2G service."
  ],
  "headers": {
    "3": "EE 3G switch off"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}