{
  "source": "https://www.techradar.com/news/christopher-nolans-next-movie-may-not-launch-on-hbo-max",
  "title": "Will Christopher Nolan's next movie launch on HBO Max? It's unlikely",
  "category": "entertainment",
  "updated": "2021-09-10T09:05:14Z",
  "author": "tom-power",
  "summary": "Analysis: is this the end of Nolan's association with Warner Bros?",
  "article": [
    "Christopher Nolan's next movie may not arrive on HBO Max – all because the director's upcoming project isn't likely to be distributed by Warner Bros.",
    "According to Deadline, Nolan's next film is being shipped around to multiple studios as the fallout from Tenet's day and date release continues.",
    "The motion picture's screenplay, which will tell the story of atomic bomb creator J. Robert Oppenheimer, is currently being read by numerous unnamed studios. And many are believed to be talking to Nolan and his representatives about purchasing the rights to the movie.",
    "Details on Nolan's next flick are thin on the ground. However, it's thought that The Dark Knight trilogy and Interstellar helmer has tapped Cillian Murphy for an undisclosed role.",
    "The Irish actor has appeared in numerous projects that Nolan has created, so it wouldn't be a surprise if he's involved in some capacity. There's no word on whether other notable Nolan collaborators, including Sir Michael Caine, Tom Hardy and Christian Bale, will be part of the cast.",
    "If Nolan's next project is produced by another studio, it'll be a hugely significant move for the writer-director and the industry as a whole.",
    "Save for his first two films – Following and Memento – every Nolan film to date has been distributed by Warner Bros. That's unsurprising, given that the studio has given him as much creative license as possible; itself a by-product of Nolan's movies being huge box office hits.",
    "However, Nolan's relationship with WarnerMedia soured following the studio's decision to simultaneously release its entire 2021 movie slate in theaters on HBO Max.",
    "A result of the Covid-19 pandemic, Warner Bros. claimed that bringing its new films to its streaming service would provide audiences with a choice over how to watch its movies. However, Nolan, a big proponent of the cinematic experience, expressed dismay at the move in December 2020, calling HBO Max \"the worst streaming service\" (per THR).",
    "It's unclear if Warner Bros. are one of the parties interested in Nolan's take on Oppenheimer. If they are, it's likely that they'll have dropped down the pecking order as a result of their day and date plan. After all, Nolan wouldn't be talking to other studios if WarnerMedia had repaired its relationship with him.",
    "In July, Netflix's Head of Content Scott Stuber said he would \"everything [I] can\" to bring Nolan's next movie to the streaming giant. But, given Nolan's savage riposte to Warner Bros' simultaneous HBO Max and theatrical plan, it's doubtful that he would entertain Netflix's advances.",
    "So where could Nolan go next? The only other big studio he's previously worked with is Paramount Pictures, who co-distributed Interstellar.",
    "Paramount, alongside Universal and Disney, though, have given the greenlight for some of their more recent movies to simultaneously launch in theaters and their streaming platforms. Unless Nolan received assurances that this wouldn't happen, he may not be convinced by this trio.",
    "The only major studio that doesn't own a streaming service yet is Sony Pictures. Currently, Sony has a licensing deal with Netflix and Disney to allow both to stream its movies.",
    "So there would be no day and date release format for Nolan to worry about if he partnered with Sony. Of course, the director's decision may also be dictated by how much creative freedom he's afforded, as well as the budget he'd be given to make his Oppenheimer flick. If Nolan is true to his word about preserving the cinematic experience, Sony should be the frontrunner to be his next movie partner."
  ],
  "headers": {
    "5": "Analysis: is Christopher Nolan done working with Warner Bros?"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/09/christopher-nolan-next-movie-development-of-atom-bomb-robert-oppenheimer-world-war-ii-1234829960/",
    "its entire 2021 movie slate": "https://www.techradar.com/news/hbo-maxs-day-and-date-release-model-isnt-working-and-warner-bros-knows-it",
    "THR": "https://www.hollywoodreporter.com/business/business-news/christopher-nolan-rips-hbo-max-as-worst-streaming-service-denounces-warner-bros-plan-4101408/",
    "bring Nolan's next movie": "https://www.techradar.com/news/netflix-wants-christopher-nolans-next-movie-but-would-he-do-it"
  }
}