{
  "source": "https://www.techradar.com/news/apple-updates-iwork-apps-for-hybrid-work",
  "title": "Apple updates iWork apps for hybrid work",
  "category": "computing",
  "updated": "2021-09-29T04:30:24Z",
  "author": "anthony-spadafora",
  "summary": "Powerful new features allow iWork users to work from anywhere",
  "article": [
    "Apple has updated its iWork suite of productivity tools with new features designed for hybrid work that give users new ways to present and make it even easier to work with documents on the go.",
    "For those unfamiliar, iWork is the Cupertino-based company's free office software that includes the word processor Pages, the spreadsheet software Numbers and the presentation software Keynote. Just like with Microsoft 365 or Google Workspace, Apple customers can use iWork across their devices as the software is compatible with iOS, iPadOS and macOS.",
    "VP of worldwide product marketing at Apple, Bob Borchers provided further details on the company's latest updates to its iWork apps in a press release, saying:",
    "“Whether they are in the office, at school, or working remotely, users around the world love Keynote, Pages, and Numbers for their powerful features, ease of use, and seamless experience across iPhone, iPad, and Mac. Today, we’re adding even more power and capability to these apps with new productivity and collaboration features that enable anyone to create more personal and compelling presentations, make working with documents on iPhone a breeze, and bring full-featured pivot tables to mobile for the first time.”",
    "Apple has added powerful new tools to Keynote to make presentations more personal, engaging and collaborative. For instance, users now have the option to use the front-facing camera on iPhone, iPad and Mac to add live video directly to their presentations.",
    "However, live video objects can also be resized or styled with masks, frames, drop shadows and reflections for a more elegant look. Keynote users on Mac can even connect multiple external cameras to further enhance the live video experience and they can show the screen of a connected iPhone or iPad right on a slide for live, interactive demos. There's also a new multi-presenter option so that multiple users can easily control a shared slideshow.",
    "As more users are reading Pages documents on iPhone more than any other devices, Apple's word processor now offers a new experience that makes it easier to read and edit documents on the go. With the software's latest update, Screen View automatically displays text, images and other elements in a single-column, continuous flow optimized for the iPhone 13 as well as older iPhones. Screen View is available for all word processing documents and doesn't require any additional setup though it can be switched off at any time so that users can see the page layout of their documents before printing or publishing.",
    "Finally, Apple has added pivot tables to Numbers that let users quickly summarize, group and rearrange data to identify and analyze patterns and trends.",
    "All of Apple's new updates for Keynotes, Pages and Numbers are now available and users can install the full suite of iWork apps from the App Store today."
  ],
  "headers": {
    "4": "iWork upgrades"
  },
  "links": {
    "iWork": "https://www.techradar.com/reviews/iwork-review",
    "productivity tools": "https://www.techradar.com/best/best-productivity-apps",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "free office software": "https://www.techradar.com/best/free-office-software",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "press release": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8728514741958224000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fuk%2Fnewsroom%2F2021%2F09%2Fapple-unveils-new-features-in-iwork-suite-of-productivity-apps%2F",
    "presentations": "https://www.techradar.com/best/best-presentation-software",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "word processor": "https://www.techradar.com/news/the-best-free-word-processor",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "App Store": "https://www.techradar.com/news/apple-says-the-app-store-generated-nearly-half-a-trillion-dollars-last-year"
  }
}