{
  "source": "https://www.techradar.com/news/amazon-backed-rivian-to-open-second-factory-report",
  "title": "Amazon-backed Rivian to open second electric vehicle factory",
  "category": "car-tech",
  "updated": "2021-07-26T09:28:39Z",
  "author": "chris-teague",
  "summary": "The Tesla contender gets fiercer",
  "article": [
    "We're just a few months out from a host of new electric vehicles coming to market. The Ford F-150 Lightning will be here soon, along with the GMC Hummer EV and others.",
    "One company that you should not ignore in all of this is Rivian, an electric automaker whose history spans back to 2009.",
    "Company executives recently confirmed reports that it will expand its operations to an additional location in the future, a move that will significantly increase its battery and technology development and production capacities.",
    "The automaker's current facility in Normal, IL, is currently slated to produce the company's lineup of electric vehicles, including the R1T truck, R1S SUV, and a fleet of commercial delivery vans for Amazon.",
    "According to a statement from company spokesperson Amy Mast, Rivian is just now beginning to determine a location for its new facility.",
    "\"We look forward to working with a supportive, technology-forward community in order to create a partnership as strong as the one we have with Normal, Illinois,\" she told TechCrunch.",
    "This news for Rivian comes after a recent announcement that it will delay initial deliveries of its upcoming R1T electric truck and R1S electric SUV beyond their initially planned dates to September 2021.",
    "Blaming the ongoing effects of the pandemic and the severe global semiconductor shortage, Rivian said that its electric truck would land first, followed by the R1S soon after.",
    "Rivian will beat rivals Ford and others to market with an all-electric pickup truck even with the delays.",
    "Rivian is one of several upstart automakers operating in the EV space. Its most notable competitor is Tesla, but many other companies plan to release vehicles in the coming months and years.",
    "Bollinger, Canoo, Fisker, and several others are all vying for a spot in the driveways of the future, but Rivian’s funding is what sets it apart.",
    "Ford happens to be a significant investor in the company and, along with Amazon and others, has helped the automaker raise over $8 billion.",
    "That funding supports Rivian’s 7,000 employees and will be needed for the expansion efforts, which will carry a price tag of at least $1 billion."
  ],
  "headers": {
    "9": "New players in the electric automotive game"
  },
  "links": {}
}