{
  "source": "https://www.techradar.com/news/peloton-treadmills-lose-one-of-their-most-popular-free-features",
  "title": "Peloton treadmills lose one of their most popular free features",
  "category": "fitness",
  "updated": "2021-06-28T09:22:52Z",
  "author": "cat-ellis",
  "summary": "Running free? Not any more...",
  "article": [
    "Peloton has removed a key feature from its Tread+ treadmills, meaning owners can no longer simply hop on and start running if they don't have a costly Peloton All Access subscription.",
    "Tread+ owners, including game developer Brianna Wu, have noticed that the Just Run feature is no longer available, leaving the premium machine unusable without an additional $39 / £39 monthly payment.",
    "To remedy the situation, Peloton is offering a free three-month All Access subscription to all Tread+ owners, and it intends to reactivate Just Run for non-subscribers very soon.",
    "The Tread+ was only sold in the US, and any users who want to claim a free three-month subscription or have their fees waived can call the company's support hotline on 866-678-9129.",
    "However, as PCMag reports, many treadmill owners on Twitter are unhappy that the company didn't clarify the situation earlier.",
    "The change relates to a software update that requires users to enter a passcode before the treadmill's belt will begin moving. This new feature, Tread Lock, is one of several safety measures Peloton has taken in recent months.",
    "Back in May, the company issued a voluntary recall of all its treadmills following reports of serious injuries. Some users were injured by the Tread's screen coming loose and falling off during use, and one child died after being pulled underneath a Tread+.",
    "The company offered to refund all owners, but also provided some other options for anyone who wanted to keep their machine. Tread owners can request a visit from an engineer, who will repair the device's touchscreen so it's more tightly secured. Owners of either treadmill can also request a visit to help move the treadmill to another room in their home, away from pets and children. Although they have wheels, the Peloton Tread weighs 290lb (131kg), and the Tread+ is 455lb (206kg), so moving them alone would be unwise.",
    "Peloton is working on a mechanical safety update for the Tread+ as well. We don't yet know the details, but it could involve a barrier being fitted to the back of the machine to prevent anything becoming caught in the slats."
  ],
  "headers": {
    "5": "Safety steps"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Brianna Wu": "https://twitter.com/BriannaWu/status/1407009346475675651",
    "PCMag": "https://uk.pcmag.com/old-fitness/134077/peloton-axes-free-just-run-feature-from-treadmill-bricking-it-for-non-subscribers",
    "issued a voluntary recall": "https://www.techradar.com/news/peloton-recalls-all-treadmills-in-the-us-what-you-should-do",
    "provided some other options": "https://www.techradar.com/news/dont-want-to-return-your-peloton-treadmill-there-are-other-solutions"
  }
}