{
  "source": "https://www.techradar.com/news/google-pixel-6-launch-event-confirmed-and-you-dont-have-long-to-wait",
  "title": "Google Pixel 6 launch event confirmed, and you don't have long to wait",
  "category": "phones",
  "updated": "2021-10-05T17:00:47Z",
  "author": "james-peckham",
  "summary": "October 19 is the big day",
  "article": [
    "The Google Pixel 6 and Google Pixel 6 Pro launch event is confirmed, and you'll be able to watch the launch on Tuesday October 19.",
    "That's when the company is hosting its Pixel Fall Launch, as the event is officially called, which starts at 10am PT / 1pm ET / 6pm BST (that's 4am in AEDT on October 20). You'll be able to watch the launch on Google's official website.",
    "Unlike prior years, Google has already revealed the design of the upcoming smartphones and specs, making it the first time we've officially heard everything to expect about the company's next flagship devices.",
    "We don't yet know when the Pixel 6 and Pixel 6 Pro will go on sale, but leaks that predicted this October 19 event have suggested the phones will be on shop shelves starting October 28.",
    "One of the biggest upgrades is likely to be the company's new Tensor chipset, which is developed specifically by Google for its Pixel products. Usually Google uses Qualcomm's Snapdragon chips, so we're excited to see what its new Tensor technology can achieve.",
    "The Google Pixel 6 is rumored to feature a 6.4-inch flat screen with a 90Hz refresh rate, while the Pixel 6 Pro is expected to sport a 120Hz curved screen that is either 6.67-inches or 6.71-inches.",
    "Camera leaks suggest the Pixel 6 Pro will feature a 4x telephoto camera, while both phones will feature a 50MP main camera and a 12MP ultra-wide.",
    "Other leaks have suggested to expect 12GB of RAM on some models of the Pixel 6 or Pixel 6 Pro, and it's likely to feature up to 512GB of storage.",
    "We've also heard that there may be a 4,614mAh battery in the Pixel 6 and a 5,000mAh in the Pixel 6 Pro.",
    "Why Google has taken to such an odd reveal for the Pixel 6 series is unclear. We even spotted the Pixel 6 on display in the company's New York City store without any fanfare, plus there are TV commercials about the phone in Japan and the UK.",
    "Be sure to return to TechRadar on October 19 where we'll have a live blog talking you through everything to do with the Pixel 6 and Pixel 6 Pro."
  ],
  "headers": {},
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Google's official website": "https://pixelevent.withgoogle.com/",
    "in the company's New York City store": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-pro-photos"
  }
}