{
  "source": "https://www.techradar.com/news/netflixs-most-watched-tv-shows-and-movies-might-surprise-you",
  "title": "Netflix's most popular TV shows and movies are a surprising bunch",
  "category": "entertainment",
  "updated": "2021-01-20T14:07:59Z",
  "author": "samuel-roberts",
  "summary": "We review Netflix's top hits as the service hits 200 million subscribers",
  "article": [
    "Netflix has revealed which original shows and movies have been streamed the most over the Christmas period, and a few of the results are a little surprising. George Clooney sci-fi movie The Midnight Sky is on-track to be the most-streamed movie of the past few months, estimated to be watched by 72 million households in its first 28 days on release.",
    "That beats a couple of more obvious choices, like the romantic comedy Holidate (68 million households) and Kurt Russell's handsome Santa Claus movie The Christmas Chronicles: Part Two (61 million). The latest movie from Robert Rodriguez, We Can Be Heroes, was also a big hitter, netting 43 million views in the same 28-day period.",
    "Note that Netflix counts two minutes as a view – so if you turned off The Midnight Sky 10 minutes in because it seemed a bit ponderous, yours still counts as a view.",
    "On the TV side, The Crown season 4 attracted more viewers in its first 28 days than any of the previous seasons, perhaps because it's catching up to recent history that a lot of viewers will remember. 100 million households have watched The Crown overall since it started, which is a staggering number.",
    "Costume drama romp Bridgerton is also a huge hit, with 63 million viewers making it the fifth biggest original series launch ever on Netflix.",
    "Other TV show hits include offbeat-but-interesting sci-fi show Alice In Borderland (18 million) and the recent French series Lupin, which is looking at landing 70 million views after its first month in release. (Thanks, Deadline.)",
    "Netflix now has 203.7 million subscribers as of its latest financial results, which is significantly ahead of its competition. Clearly, people still really value having the streaming service in their lives, and the sheer amount of original content means there's usually something good to watch – even if many of its originals fall flat.",
    "Netflix faces heated competition from Disney Plus and countless other streamers over the next few years. While it seems very unlikely that any service will catch up with Netflix when it comes to the volume of new shows and movies, Disney's streamer has showed that the right kinds of originals will capture people's attention."
  ],
  "headers": {
    "6": "Netflix hits a ludicrous milestone"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/01/holidate-the-christmas-chronicles-sequel-viewing-figures-netflix-the-crown-s4-figures-1234676472/",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}