{
  "source": "https://www.techradar.com/news/how-to-watch-britney-spears-documentary-stream-framing-britney-spears-online",
  "title": "How to watch Framing Britney Spears online: stream the Britney documentary anywhere",
  "category": "computing",
  "updated": "2021-05-10T09:15:50Z",
  "author": "james-laird",
  "summary": "Sensational look at 90s pop princess out now in US and UK",
  "article": [
    "The New York Times has released a new documentary about 90s pop princess Britney Spears - and it's causing quite the controversy. The most talked about doc of 2021 to date is out now in the US ahead of wider global distribution, so read on as we explain how to watch Framing Britney Spears and stream the documentary online today.",
    "Framing Britney Spears charts the star's rise to fame, of course, featuring archival footage from as far back as 1992 when she introduced herself to US TV viewers aged just 11 on Star Search.",
    "But it doesn't stop there, with the documentary also focussing on more recent issues surrounding Spears' mental health and her legal battle against her father to regain control over her finances.",
    "It specifically draws attention to the conservatorship arrangement in place with her Dad since 2008, which gives him considerable control over her monetary affairs. Originally resulting in a fan-led #FreeBritney social media movement, the new Britney documentary has shone a renewed light on that controversy, with fellow stars such as Sarah Jessica Parker tweeting their support of the Hit Me Baby One More Time singer.",
    "Unfortunately, this Britney Spears documentary doesn't feature any new contributions from the star herself, but the joint Hulu and FX production has quickly found itself in the limelight. Already, it's been picked up by Sky in the UK, and you can expect streaming services and pay TV providers in other major global markets to grab it as soon as they can, too.",
    "In the meantime, anyone in the US and UK can watch Framing Britney Spears and stream the Britney Spears documentary online right now.",
    "Also on Hulu:"
  ],
  "headers": {
    "6": "How to watch Framing Britney Spears documentary: stream online in the UK"
  },
  "links": {}
}