{
  "source": "https://www.techradar.com/news/nintendo-switch-online-could-get-n64-games-soon-but-itll-cost-you",
  "title": "Nintendo Switch Online could get N64 games soon – but it'll cost you",
  "category": "gaming",
  "updated": "2021-09-16T09:13:15Z",
  "author": "adam-vjestica",
  "summary": "Would you pay more to play N64 games on Switch?",
  "article": [
    "Nintendo Switch Online will reportedly include N64 games in the future, according to the same insider who revealed that Game Boy and Game Boy Color games could also be making their way to the service.",
    "As spotted by Nintendo Life, known insider ‘NateDrake’ corroborated Eurogamer’s belief that “other retro platforms” are likely to show up on Nintendo’s online service in the future, and believes that N64 games will make an appearance.",
    "Speaking on the latest episode of his podcast, NateDrake said: “Eurogamer went one step further, having noted that additional platforms will also be added to Nintendo Switch Online in the future. And today I would like to add to that, yes - that information is accurate and one of the platforms that will be coming to the Nintendo Switch Online in the future is the revolutionary Nintendo 64.”",
    "However, it seems like we might have to pay more to experience the classic titles from the N64 era, as NateDrake believes that Nintendo will up its subscription fees to create a higher-priced tier for Nintendo Switch Online.",
    "“What I'm going to propose, is that when Nintendo 64 does come to Nintendo Switch Online it is going to come with a higher-priced tier - a premium version of Nintendo Switch Online if you will,” said NateDrake. \"I don't think they would try to double the price of it... I'd come in at $30 a year, $35 would be the ceiling, any more than that I think Nintendo would be really pushing things.”",
    "Perhaps somewhat unsurprisingly, NateDrake isn’t sure as to when N64 games will arrive on Nintendo’s online service, but he predicts it’s a real possibility that it could happen in the current fiscal year (which is from April 2021 to March 2022 for Nintendo).",
    "“I mean that's a guess but you know, we will find out as we said, September is the month of reveals, the anniversary of the platform itself, so hopefully, we have some news about Nintendo Switch Online this month, but there is no rule that it has to come this month.”",
    "Nintendo has continued to drip-feed NES and SNES games onto its Switch Online service, many of which are questionable additions. The prospect of playing N64 games would be a great boon for the service, and could ultimately encourage more Switch owners to subscribe.",
    "But what of the higher subscription fee? Well, TechRadar’s executive editor Gerald Lynch wouldn’t be put off. “If they added GBA / GameCube and N64 titles to Switch Online, I'd happily pay more for the privilege,” said Lynch, who has a penchant for retro gaming.",
    "An annual Nintendo Switch Online membership is significantly cheaper than Sony’s PlayStation Plus and Microsoft’s Xbox Live (subscription prices start at $3.99 / £3.49 / AU$5.95 a month). Paying a bit more to access some of Nintendo’s greatest hits anytime, anywhere would certainly be appealing, though don’t expect to see the likes of 007 GoldenEye or Diddy Kong Racing anytime soon due to licensing conflicts."
  ],
  "headers": {
    "7": "Analysis: more retro games on Nintendo Switch would be welcomed"
  },
  "links": {
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "N64 games": "https://www.techradar.com/news/best-n64-games",
    "Game Boy and Game Boy Color games": "https://www.techradar.com/news/nintendo-switch-online-might-actually-be-worth-subscribing-to-soon",
    "Nintendo Life": "https://www.nintendolife.com/news/2021/09/rumour_insider_says_n64_is_coming_to_switch_online_believes_it_will_introduce_a_higher-priced_subscription_tier",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-09-03-game-boy-and-game-boy-color-titles-headed-to-nintendo-switch-online",
    "latest episode of his podcast": "https://www.youtube.com/watch?v=ManeqV-8njk",
    "NES and SNES games": "https://www.techradar.com/news/nintendo-switch-online-torments-us-again-with-dull-snes-and-nes-games",
    "Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "GameCube": "https://www.techradar.com/best/best-gamecube-games",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "Xbox Live": "https://www.techradar.com/news/xbox-live-gold-deals"
  }
}