{
  "source": "https://www.techradar.com/news/home-depot-labor-day-sale-appliances-furniture-mattresses",
  "title": "Home Depot Labor Day sales 2021: now live, see the best deals here",
  "category": "news",
  "updated": "2021-09-06T16:39:50Z",
  "author": "alex-whitelock",
  "summary": "The Home Depot Labor Day sale includes thousands of items",
  "article": [
    "This year's Home Depot Labor Day sales are in full swing and we're rounding up all the best deals here on this page . There are literally thousands of deals now live on everything from appliances to home decor, to grills, and many, many more categories. This end-of-summer sale could be your last chance to bag a nice little discount this side of Black Friday in November, so it's well worth checking out today's deals.",
    "Because today's event is so vast in width and content, we've separated this year's Home Depot Labor Day sales out into handy sections by category - which you can navigate using the provided jumper links. In each section, you'll find links to various sales pages, plus our own recommendations for items that are particularly heavily discounted and popular.",
    "Starting with appliances, you'll also find sections for home (furniture, mattresses), outdoor (grills, power tools), and also smart home tech as well. If you've already drawn up for shopping list and know exactly what you're looking for, simply skip through to the section that's relevant to you.",
    "With a range of free delivery options, the Home Depot Labor Day sale is a good chance to save a ton of cash on heavy items like appliances or tools. That said, you'll find plenty of smaller home decor items and even smart home tech gadgets, should you simply be looking for a couple of things for the house.",
    "As you'd expect, most of these Home Depot Labor Day sales are set to expire on Tuesday 7th September, so there's not much time to catch them. While some may stick around for a few more days (a lot of retailers tend to extend their Labor Day sales a while), it's probably not worth risking it - this is the last big sales event before Black Friday in November after all."
  ],
  "headers": {},
  "links": {
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}