{
  "source": "https://www.techradar.com/news/i-tried-this-ridiculously-easy-nespresso-trick-and-it-was-a-game-changer",
  "title": "I tried this ridiculously easy Nespresso trick and it was a game-changer",
  "category": "appliances",
  "updated": "2021-06-05T14:30:29Z",
  "author": "sophie-bird",
  "summary": "Finally! A way to make Nespresso hotter",
  "article": [
    "Nespresso machines are some of the best coffee makers around but for me, the coffee is just never quite hot enough. Normally when you make a coffee, you’re programed into giving it five minutes or so to cool down before you take that first sip, but every time I do that with my Nespresso coffee, I’ve left it too late and my drink is on the cool side.",
    "There is science behind the temperature of Nespresso coffee though, and that’s because the brand claims it’s just the right temperature for the coffee to be brewed properly without burning the coffee grounds, which can leave you with a nasty bitter taste.",
    "So, is there a way to make Nespresso hotter, and how do you do it? Well, in my quest to not have to drink my coffee within seconds of brewing it, I discovered the easiest Nespresso hack that is a complete game-changer.",
    "There’s a whole army of Nespresso buffs on YouTube that devote their days to testing out machines, but A2B Productions filmed a video with a tip so ridiculously easy, we don’t know why we didn’t try it before.",
    "If you want hotter Nespresso drinks, all you need to do is make sure there are no pods in the machine and that there’s plenty of water in the reservoir. Then, take a mug and place it on the cup holder before switching on the machine so that it runs hot water through the machine.",
    "Running the hot water cycle first gives the machine longer to heat up and increases the temperature of the brew you make after – something you might have noticed if you make two coffees in a row. We tried this handy hack and it works, every time.",
    "Of course, there are drawbacks and that’s because you essentially have to wait the time it takes for the water to run through the machine before you can actually start making the coffee you’re going to drink. Plus, this simple little trick only works if you have one of Nespresso’s Original machine, as the newer Vertuo models don’t let you run a hot water cycle unless you’re deep cleaning the machine – and that cycle takes several minutes. On most Nespresso machines you can’t adjust the temperature of the coffee you’re making and Nespresso will argue there’s good reason too, because increasing the temperature of your espresso can affect the taste.",
    "Let’s be clear, your Nespresso coffee should never be cold (unless you’re making an iced coffee, of course) so if you’re getting a cold brew each time it’s likely that your machine is in need of some maintenance. Try descaling your machine so that all the parts are clear of any limescale which builds up over time. For tips and advice on this, head to our feature on how to clean a Nespresso machine.",
    "Brewing your Nespresso into a cold cup will make it cool down quicker so warming the cup first will also help. If you follow the steps for running a water cycle first that we mentioned above, you can leave the hot water in the mug for a few minutes so that it’s nice and warm for when you brew a coffee into it."
  ],
  "headers": {
    "3": "How to make Nespresso hotter",
    "7": "What other ways can you make Nespresso hotter?"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "A2B Productions": "https://www.youtube.com/c/A2BProductions/about",
    "how to clean a Nespresso machine": "https://www.techradar.com/how-to/how-to-clean-a-nespresso-machine"
  }
}