{
  "source": "https://www.techradar.com/news/oneplus-9-exclusive-ceo-pete-lau-on-its-new-camera-and-whats-next",
  "title": "OnePlus 9 exclusive: CEO Pete Lau on its new camera, and what’s next",
  "category": "phones",
  "updated": "2021-03-12T12:25:49Z",
  "author": "james-peckham",
  "summary": "The challenges of improving a camera",
  "article": [
    "OnePlus is going big on its future smartphone cameras, starting with the OnePlus 9. After consumer feedback and criticisms from some media on the camera performance of some of its previous devices, the company wants to show it’s taking photography seriously.",
    "The OnePlus 9 series will be unveiled on March 23, but that hasn’t stopped the smartphone company teasing out information on its next smartphone, specifically around its next-gen camera. We know the sensor in the OnePlus 9 Pro (Sony’s IMX789), we know there’s a new partnership with Hasselblad and we know a variety of smaller features around the OnePlus 9 camera.",
    "TechRadar spoke to Pete Lau, CEO of OnePlus, on how the company is focusing its efforts on improving the camera, what challenges appeared in this process and how it plans to continue to innovate in the camera space beyond the OnePlus 9 series.",
    "“When we asked our community last year where they would like to see product improvements, they told us they wanted to see upgrades to our camera system” Lau told TechRadar.",
    "“So, at the end of last year, I told the team and the OnePlus community that 2021 is our year of the camera. We’re continuously making great strides in terms of computational software with features like our ever-improving Nightscape, and now we’re also investing much more in top-of-the-line hardware like the custom IMX789 sensor.”",
    "Lau spoke to TechRadar about the camera you can expect to see on the new OnePlus 9 and OnePlus 9 Pro. Those smartphones are rumored to be paired with a OnePlus 9 Lite, but the company has yet to confirm the exact makeup of the OnePlus 9 series.",
    "The company confirmed earlier in March that it would use a custom Sony IMX789 sensor on the OnePlus 9 Pro, marking the first time it’s collaborated directly with Sony on a sensor.",
    "Lau said, “Working directly with Sony meant we were able to collaborate on a number of custom features for the IMX789.",
    "“We were also able to significantly improve video performance and possibilities, resulting in the ability to shoot in 4K at a very high 120fps, which is something very few smartphones today offer, and DOL-HDR, which ensures subjects are always clear in backlit environments.”",
    "DOL-HDR stands for Digital Overlap High Dynamic Range and it works by shooting two frames at the same time with two different exposures. It’ll then merge the two images together in an attempt to improve lighting within a scene.",
    "Another big talking point for the OnePlus 9 series is the company’s new partnership with Hasselblad, and it’s a new three-year partnership that sees the famed camera company help improve color calibration on these upcoming phones. OnePlus has also confirmed its partnership with Hasselblad will expand to other camera aspects on future smartphones.",
    "“Applying Hasselblad’s color expertise to our smartphones was actually quite challenging, since their color science is created for traditional cameras, which is very different from how smartphone cameras work with color” said Lau.",
    "“While this has been a significant challenge to overcome, our R&D teams have been working very closely for months to co-develop our new color solution.",
    "“Natural Color Calibration with Hasselblad, which aims to bring more perceptually accurate and natural-looking colors to photos taken with OnePlus flagship cameras. It also will serve as OnePlus’ new standard for color calibration for its future smartphone cameras.”",
    "The ultrawide camera on the OnePlus 9 series will also use a freeform lens, and it'll help improve distortion around the edges of wider shots. OnePlus says it'll drop the distortion to around 1%.",
    "OnePlus has also committed more than $150 million over the next years to continue its camera developments, and while part of this investment are improvements that will be included on the OnePlus 9 series, but there’s already a lot of experimentation for future products.",
    "With OnePlus’ new Hasselblad partnership also set to last for three years, there’s a clear agenda for camera improvements going forward.",
    "Looking further into the future, past the OnePlus 9, and we already have an idea of what other camera advancements the firm has in store for us. The first of which is a ‘Bionic’ front facing camera for faster focusing. This should allow you to snap selfies more quickly than before, which could be particularly handy when you’re rushing a selfie or filming using the front camera.",
    "It also reduces the size of the selfie camera itself, so that may mean we’ll see a smaller punch-hole on upcoming OnePlus phones in the years to come. Other improvements as part of this ‘Bionic’ selfie camera include improved image stabilization, lower energy consumption and a focal length of 15cms.",
    "Another future improvement is a 140 degree field of view panoramic camera technology which uses two wide angle lenses at the same time to make this possible.",
    "If this technology becomes available on a smartphone, it’ll take two separate images and then combine them together to make a shot with a wider field of view than we’ve seen on any other smartphone.",
    "Lau wouldn’t comment on when these features would be seen on a smartphone, but he said “We’re already actively working on these technologies and, while we don’t have an exact timeline yet, we do have plans to bring them to market in the near future.”",
    "That may mean we see these upgrades on the OnePlus 9T or the OnePlus 10, but it could also be these improvements are scheduled for far future devices. We’ll have to wait and see what happens in the years to come.",
    "We expect to learn more about the OnePlus 9 series as time goes on, and you can likely expect Lau will continue teasing a variety of features ahead of the company’s big March 23 launch.",
    "The OnePlus 9 and OnePlus 9 Pro are confirmed for that launch event, but there are also consistent rumors and leaks of a new OnePlus 9 Lite and the potential we may hear more about the company’s upcoming OnePlus Watch too."
  ],
  "headers": {
    "5": "What improvements are coming?",
    "17": "A Bionic future"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review"
  }
}