{
  "source": "https://www.techradar.com/news/f5-shells-out-dollar500m-on-cloud-management-experts-volterra",
  "title": "F5 completes $500m Volterra deal",
  "category": "computing",
  "updated": "2021-01-26T16:41:28Z",
  "author": "barclay-ballard",
  "summary": "Cloud management experts snapped up by F5",
  "article": [
    "Web applications firm F5 Networks has completed its acquisition of edge-as-a-service platform Volterra in a $440 million deal. In addition, the acquisition will include $60 million in deferred payments and incentives for Volterra’s founders and employees.",
    "The partnership will accelerate Volterra’s deployment of its Edge 2.0 open edge platform, which is set to deliver best-in-class enterprise application security.",
    "The Edge 2.0 platform will also be app-driven, promising to remove multi-cloud complexity and provide unlimited scale by enabling all services to be run on any server, across all clouds and data centers.",
    "Volterra’s founder Ankur Singla added that the coronavirus pandemic, and the rapid uptake of digital services that it has driven, has meant that the need for his company’s Edge 2.0 solution has never been greater. With F5 and Volterra working in harmony, the app security-as-a-service market now has a powerful new player.",
    "For F5, the purchase was followed by the company raising its long-term revenue outlook and reiterating its pledge to return $1 billion of capital over the next two years. The Volterra acquisition might be the last big purchase we see from the firm for a little while after F5 also spent more than $1.6 billion on two major acquisitions in 2019.",
    "“I am incredibly excited to welcome Volterra to the F5 family and get to work bringing Edge 2.0—a key part of our Adaptive Applications vision—to customers,” said François Locoh-Donou, F5 President and CEO. “Joining forces, we will deliver the enterprise-grade features, including world-class security and scale, that have been missing from the edge until now.”",
    "“Current edge approaches were not designed with enterprises in mind,” said Ankur Singla, founder of Volterra. “When Harshad and I started Volterra, we knew the edge would need to be delivered with the scale of public clouds, but with management and security integrated with the data centers where so many enterprise apps still live. Given F5’s leadership in Adaptive Applications and their vast enterprise customer base, I could not imagine a better partner to empower customers’ business transformation through modern apps.”",
    "Via TechCrunch"
  ],
  "headers": {
    "3": "Big spenders"
  },
  "links": {
    "Ankur Singla": "https://www.volterra.io/resources/blog/volterras-next-chapter-joining-f5-for-edge-2",
    "TechCrunch": "https://techcrunch.com/2021/01/07/f5-snags-volterra-multi-cloud-management-startup-for-500m/"
  }
}