{
  "source": "https://www.techradar.com/news/malcolm-and-marie-is-the-perfect-anti-valentines-day-netflix-movie",
  "title": "Malcolm and Marie is the perfect anti-Valentine's Day Netflix movie",
  "category": "entertainment",
  "updated": "2021-02-13T10:00:33Z",
  "author": "samuel-roberts",
  "summary": "If you've got the stomach for it, anyway",
  "article": [
    "I can't say lockdown-filmed content has captured my imagination over the past year. Other than Shudder's brilliant horror movie Host, I'm doing my best not to be reminded of the world around us right now. It's why I won't be watching HBO Max's Locked Down, or the Covid-19-inspired, Michael Bay-produced sci-fi movie Songbird. I wasn't interested in sitcom reunions on Zoom, even for the shows I like, simply because I knew they only existed due to the actors having too much time on their hands.",
    "I made an exception for Malcolm and Marie, though, a film that was shot mid-pandemic, starring Zendaya (Spider-Man, Euphoria) and John David Washington (Tenet). Written and directed by Euphoria creator Sam Levinson, son of extremely successful filmmaker Barry Levinson, the black-and-white movie features gorgeous cinematography by Marcell Rév – another Euphoria collaborator.",
    "Netflix reportedly paid around $30 million for this movie, which features nothing more than two attractive people talking about their lives in one location for 106 minutes. It's an acquired taste.",
    "Malcolm and Marie is about a couple who return to a rented home from a Hollywood premiere. Malcolm is a director on the brink of mainstream success, and after he forgets to thank Marie during a speech – despite thanking everyone else, and despite Marie inspiring the film in question – the two subsequently have an emotional reckoning that rips to the core of their relationship.",
    "If you're in the mood for a romantic Netflix movie for Valentine's Day, this ain't that. At times, the pair's relationship is depicted as being extremely romantic and affectionate – and then alternately emotionally abusive. This is a couple with true ups and downs, who for their mental well-being probably shouldn't be together, but also find they can't bear to be apart.",
    "Malcolm feels like he could be a real person. He's a director with a chip on his shoulder: arrogant enough to feel like every decision he makes is the right one, and furiously pontificating his place in the overall culture of cinema. In truth, his extensive rants about Hollywood in Malcolm and Marie – and how political meaning is retroactively applied to his work as a Black filmmaker by primarily white journalists – end up being some of the weaker, Inside Baseball-style parts of the movie. These come across as more Twitter rant-y than insightful (and have garnered fair criticism for other reasons).",
    "But they do tell you a lot about how Malcolm sees himself. He behaves like he has total ownership of his work, in terms of its meaning and inspiration – he believes the parts of Marie's life he took and put on the big screen only really resonated because of his skill in how he put them there. It's one of the main tension points of the film, that he lacks the self-awareness to credit Marie, and lift her up when it actually mattered to do so.",
    "Malcolm is the one writing his own version of events, and Marie's feelings have clearly come second to that, time and time again. John David Washington brings his petulance, cruelty and occasional delight at his partner's sense of humor to life perfectly.",
    "Zendaya is great in this film, too, and wears the pain of a survivor well – even if she seems a little young for the type of world-weary character Marie is supposed to be. Still, she really conveys the rawness of someone who feels stuck in her partner's shadow, since subconsciously and maybe even deliberately, that's where he'd prefer her to be.",
    "It's a toxic dynamic, especially on Malcolm's side, that's punctured by these unexpected moments of incredible warmth. These come along like a rush, before the pair go back to verbal sparring and taking pieces off of one another again. That part feels quite real, in how volatile relationships can turn on a dime.",
    "So, hey, maybe this isn't the best pick for Valentine's Day if you'd prefer the two leads were having a good time together.",
    "Crucially, however, I never really thought of Malcolm & Marie as a lockdown movie. It simply feels like it joins the ranks of so many movies either set or filmed in a single location, like Rear Window, 12 Angry Men or Panic Room. The cinematography is so satisfyingly inventive with the space that you never really think about the circumstances behind how it got made.",
    "Malcolm and Marie firmly won't be for everyone – but there is something that rings true here, in what successful people feel they owe the people who got them there. It's definitely pretentious. The fact that it's just two people talking for two hours might mean it's a little too barebones for some, too, especially with no wider tension in the film except how their relationship might break apart.",
    "I found its emotional honesty refreshing, though. If Malcolm and Marie sounds a bit too heavy for you, consider checking out Set it Up on Netflix this weekend, which is largely considered the best original romantic comedy on the platform – and won't leave light scars like this movie might."
  ],
  "headers": {
    "5": "Bad romance",
    "11": "Happily ever after?"
  },
  "links": {
    "Shudder's brilliant horror movie Host": "https://www.techradar.com/news/shudder-horror-movie-host-was-somehow-better-on-a-tablet-than-on-my-tv",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "romantic Netflix movie": "https://www.techradar.com/best/best-romantic-movies-on-netflix",
    "and have garnered fair criticism": "https://www.theguardian.com/film/2021/feb/05/malcolm-and-marie-sam-levinson-netflix-john-david-washington-zendaya"
  }
}