{
  "source": "https://www.techradar.com/news/samsung-qn95a-vs-qn90a-two-4k-qled-tvs-with-some-key-differences",
  "title": "Which Samsung QLED 4K TV is best? We compare this year's flagship screens",
  "category": "televisions",
  "updated": "2021-06-04T13:37:21Z",
  "author": "henry-st-leger",
  "summary": "Should you take home the QN95A or QN90A?",
  "article": [
    "Eyeing up the Samsung QN95A or QN90A? We're not surprised – with the two highest-specified Samsung 4K TVs released this year both offering impressive picture quality and packed-out feature sets, as well as a Mini LED backlight to really thrust these screens into the hallowed halls of the best Samsung TVs.",
    "Neither offer the 8K resolution of Samsung's most expensive screens, such as the QN900A, but if 4K will suit your needs just fine, you're still getting a premium offering in both sets.",
    "There are some key differences between the QN95A and QN90A, though, which are well worth noting for anyone after a high-calibre QLED in 2021 – some of which may be hard to spot at a first look. So if you've been considering either model, here's what you need to know before you make your choice.",
    "Samsung generally offers near-identical lineups in regions around the world, though there are always a few exceptions. In this case, shoppers in the US will only be able to choose the QN90A, though the QN95A will be found in the UK and Europe.",
    "Currently only the QN90A is available in Australia, though as last year's Q95T made it to the region in late 2020, we expect its QN95A successor to do the same later in the year.",
    "That limitation for US shoppers is a shame, though, given that the QN95A is the true 4K flagship, but shows that Samsung is keen to motivate high-end buyers to choose an 8K TV rather than a 4K resolution model. As you'll see below, the QN90A just isn't as impressive or premium-feeling as its step-up sibling.",
    "Next up, the pricing. The Samsung QN95A is the flagship 4K TV in Samsung's 2021 lineup, meaning it will cost a pretty penny – if not as much as the company's 8K TVs.",
    "The 55-inch QN95A retails for £1,999, going up to £2,999 for the 65-inch, £3,799 for the 75-inch, and £5,499 for the massive 85-inch.",
    "For the more commonly available QN90A, you’re looking at between $1,499 / £1,799 / AU$2,649 for the 50-inch QN90A and $3,499 / £3,999 / AU$5,749 for the 75-inch model, with scaling pricing for the 55-inch and 65-inch models in between. The biggest 85-inch model is a US exclusive, and sells for $4,999.",
    "For smaller sizes, the QN90A is available for a decent discount, though that distinction is somewhat lost at larger, expensive-to-produce sizes like the 75-inch and 85-inch TVs.",
    "On most things, the QN95A and QN90A are in agreement: a TV should have 4K resolution, a 120Hz panel, and a minimalist design with almost zero bezel. Both utilize what Samsung calls a \"Neo Slim Design\" rather than the 99% screen \"Infinity One Display\" found on its 8K models, though.",
    "You'll get HDR10+ dynamic HDR on both sets (albeit with no Dolby Vision), along with a Mini LED backlight to up brightness, improve luminance control, and gives colors that extra oomph – all of which is to be praised.",
    "However, there are a few key differences that do set these screens apart.",
    "While both support the HDMI 2.1 standard, the QN90A only sports one – with three HDMI 2.0 inputs picking up the slack – while the QN95A supports 2.1 across all four HDMI ports.",
    "One benefit of the QN95A, too – which the QN90A doesn't get – is the Samsung One Connect box. This box outsources important inputs to a secondary piece of hardware, helping the QN95A's screen stay slim and not crowded with wiggly wires. That means the QN90A is a bit thicker, and less conducive to tidy wire arrangement.",
    "The QN90A also makes do with an OTS+ sound system, rather than the OTS+ Pro found on higher-end models (like the QN95A). The branding may be almost the same, but the former is limited to 60W (rather than 70W output), and a rather limited soundstage for the money.",
    "In our review, we wrote that \"the Samsung QN90A didn’t have a large soundstage or convincing holography. That’s severely disappointing as one of the highly touted new features of the Neo Quantum Processor 4K is AI Sound that promises a 3D audio-like experience.\"",
    "On a more mundane note, our reviewer found the pedestal TV stand a bit wobbly for the QN90A's 65-inch size.",
    "Both the Samsung QN95A and QN90A offer similar levels of performance, though there's some clear cost-cutting in the latter model that means its connectivity and sound quality do take a hit – enough so that we gave the QN90A only four stars despite giving the QN95A five.",
    "That makes it all the more frustrating that Samsung has limited the reach of its superior 4K flagship, opting not to release in the US, and delaying its arrival in Australia. For anyone buying a new Samsung TV in those regions today, the QN90A is the best 4K option in this year's range, which isn't saying much.",
    "Some may find the comparative price drop worth it, though it's only really at smaller sizes that this becomes a meaningful amount. The QN90A's smallest 50-inch size is 25% cheaper than the QN95A at 55 inches, and it's worth taking that difference into account.",
    "If you can afford the difference, though, and have the QN95A as an option in your region (Australians, hold tight!) you won't want to be saddled with its step-down sibling."
  ],
  "headers": {
    "3": "Samsung QN95A vs QN90A availability",
    "6": "Samsung QN95A vs QN90A pricing",
    "10": "Samsung QN95A vs QN90A specs and features",
    "18": "Takeaway"
  },
  "links": {
    "Samsung QN95A": "https://www.techradar.com/reviews/samsung-qn95a-neo-qled-4k-tv",
    "QN90A": "https://www.techradar.com/reviews/samsung-qn90a-neo-qled-tv",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "best Samsung TVs": "https://www.techradar.com/news/best-samsung-tv",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "QN900A": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Q95T": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "85-inch TVs": "https://www.techradar.com/news/should-i-buy-85-inch-tv",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "OTS+": "https://www.techradar.com/news/samsungs-new-qleds-nail-built-in-audio-and-other-tv-brands-should-take-note/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021"
  }
}