{
  "source": "https://www.techradar.com/news/iphone-13-pro-looks-to-have-a-much-bigger-camera-than-the-iphone-12-pro",
  "title": "iPhone 13 Pro looks to have a much bigger camera than the iPhone 12 Pro",
  "category": "phones",
  "updated": "2021-07-07T09:00:09Z",
  "author": "james-rogerson",
  "summary": "Surprisingly sizable",
  "article": [
    "It’s been extensively rumored that Apple is making a number of camera changes for the iPhone 13 range, but now we have a good idea of how much of a physical impact these changes could have, with the iPhone 13 Pro seemingly having a much larger camera block than the iPhone 12 Pro.",
    "We’ve reached that conclusion because a user of Weibo (a Chinese social network) posted photos of an iPhone 12 Pro in a case supposedly designed for the iPhone 13 Pro, and the camera cut-out in the case is far too large for the current phone.",
    "Numerous changes have been rumored for the iPhone 13 Pro’s cameras, including improved telephoto range, more lens elements, changes in aperture, and the addition of sensor-shift OIS (optical image stabilization). So it’s not surprising that the camera block could grow, but we’re surprised to see it growing as much as these images suggest.",
    "Of course, the case design could be wrong, as it’s possibly based on leaks, rumors and guesswork rather than any official information, so we’d take this with a pinch of salt.",
    "In smaller news, DigiTimes Asia reports that Foxconn and Pegatron will be the two main manufacturers of the iPhone 13 range, with the two companies apparently sharing iPhone 13 Mini duties, but Foxconn likely building the bulk of the other models.",
    "This isn’t terribly surprising, since Foxconn and Pegatron were Apple’s biggest and second biggest iPhone 12 manufacturers respectively, but notably Apple suspended its partnership with Pegatron in late 2020, after discovering that it was responsible for labor violations. So presumably the companies are back to business as usual.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Weibo": "https://m.weibo.cn/detail/4655948020322921",
    "improved telephoto range": "https://www.techradar.com/news/heres-the-iphone-13-camera-upgrade-rumored-for-2021",
    "changes in aperture": "https://www.techradar.com/news/iphone-13-tipped-to-feature-a-major-camera-upgrade",
    "sensor-shift OIS": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "DigiTimes Asia": "https://www.digitimes.com/news/a20210706PD219.html",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "GSMArena": "https://www.gsmarena.com/apple_iphone_13_to_be_manufactured_by_foxconn_and_pegatron_pro_will_have_a_bigger_camera-news-49911.php"
  }
}