{
  "source": "https://www.techradar.com/news/samsung-galaxy-a82",
  "title": "Samsung Galaxy A82 release date, price, news, leaks and what the phone may bring",
  "category": "phones",
  "updated": "2021-05-05T14:20:35Z",
  "author": "michael-hicks",
  "summary": "The return of Samsung's pop-up selfie cam?",
  "article": [
    "For thrifty buyers who found the Galaxy S21 too expensive, the Samsung Galaxy A82 is on its way with similar flagship specs but a more mid-range price – though we're still waiting on Samsung's official confirmation.",
    "Two years removed from the Galaxy A80 novelty phone and its rotating, pop-up selfie camera, the Galaxy A82 is rumored to have an upgraded version of that camera. We don't yet know exact pricing or where Samsung will sell the A82, but do have some information on specs.",
    "The Galaxy S21 series launched in January and immediately dominated our list of the best phones. Since then, Samsung has focused on developing cheaper models: the Galaxy A72, Galaxy A52 5G, and the upcoming Galaxy S21 FE. Add in the Galaxy A82, and you're looking at a crowded list of options.",
    "Here's what we know about the Samsung Galaxy A82 phone, including how it will stack up against the other 2021 Galaxy A phones, and our wish list of features to make it stand out from the pack.",
    "We don't yet know when the Galaxy A82 will be announced or launched, except that it will ship sometime in 2021. Nor do we have any pricing data, though it's fair to assume that the list price will be higher than the Galaxy A72 (about $580 / £419 / AU$749) but lower than the Galaxy S21 ($799 / £769 / AU$1,249).",
    "When Samsung announced the upcoming launches of the Galaxy A72, A52 and A52 5G, we were somewhat surprised that the A82 didn't feature in the announcement as well. We've known since January that Samsung is actively developing the A82, and all of the AX2 phones were trademarked at the same time.",
    "Perhaps Samsung didn't want to release too many phones at once, or the A82's gimmicky camera needed extra development time. We're hoping Samsung will admit its existence and give us a firm release date and price soon.",
    "We heard rumors in January that Samsung had begun developing a 5G successor to the Galaxy A80. But we didn't have firmer evidence until Google itself leaked its existence, adding the Galaxy A82 to its list of phones that support ARCore.",
    "Then the latest Galaxy A82 leak gave us specific A82 specs: a Snapdragon 860 chipset, 5G connectivity, up to 6GB of RAM, a 1080 x 2400 pixel display, and the Android 11 OS.",
    "That leak – shown in the tweet above – also gave us a potential look at the front side of the A82 handset. This render looks very similar to the A52 and A72, including a punch-hole selfie camera, which made us skeptical whether or not it was genuine.",
    "The A82 reportedly has a pop-up selfie camera, which would have the main rear camera pop up and rotate to take a front-facing shot. A Samsung patent we learned of earlier this year, depicted below, shows a front panel with no selfie camera, notches or cut-outs.",
    "It could be that the Galaxy A82 has both a pop-up camera and a punch-hole camera. If not, we still haven't seen a reliable render of the phone yet.",
    "Pop-up camera aside, we suspect the A82 will have similar specs to the A72 and A52, given they were all developed side-by-side with one another. So though we don't know the A82's specs yet, we can make educated guesses.",
    "Both the A72 and A52 have a 64MP f/1.8 main camera, 12MP f/2.2 ultra-wide camera, and a 32MP f/2.2 selfie camera. The A82 could match or slightly upgrade on its siblings in camera quality, with the big change being that you could use that 64MP rear camera for selfies.",
    "As for battery life, the A52 sports a 4,500mAh battery while the A72 trumps it with a 5,000mAh model. Considering only the Galaxy S21 Ultra matches that 5,000mAh number, we believe the A82 will match but not exceed that capacity. Both phones also have 25W charging.",
    "A leaked teaser for the phone makes a point of highlighting the battery and charging. The fact that these features are the phone's key selling points suggests the device could beat its siblings in this way - maybe it'll reach 6,000mAh.",
    "All of Samsung's 2021 phones have a plastic back, including the S21 lineup. Both the A72 and A52 have super AMOLED screens, though the A52 beats the A72 in refresh rate at 120Hz vs 90Hz; we're not certain which the A82 will get. Each phone has IP67 water resistance, a 3.5mm headphone jack, and either 128GB or 256GB of storage.",
    "With so many 2021 mid-range Samsung phones launching recently, plus the base Galaxy S21 so close in price, Samsung will need to make the Galaxy A82 distinctive and impressive to make it feel less like a novelty or an afterthought to the other Galaxy As. Here's what we hope to see.",
    "Assuming the Galaxy A82 does emulate the Galaxy A80, our concern is that the A80's rotating camera had some significant design issues.",
    "To note some of the lowlights from our review, the pop-up camera took too long to rise up and rotate; the rotating panel was a 'dust magnet'; when down the panel 'shook and rattled as though it was loose'; the phone would 'freak out and close the camera app' if you touched the panel while up; and it could sometimes get stuck mid-rotation.",
    "The pop-up selfie cam will likely be the A82's defining feature to make it stand out from the pack. But it can't just be a promising gimmick the second time around; it needs to be faster, more durable, and more stable when not in use.",
    "The Galaxy A80 has a 6.7-inch Super AMOLED display with high brightness, unblemished by any selfie camera cut-out or notch. Using its high-end display was one of the main upsides of the phone – though it only had a 60Hz refresh rate.",
    "We're hoping the Galaxy A82 matches its predecessor (and the Galaxy A72) with a 6.7-inch display size. But we're also hoping it has the 120Hz refresh rate of the smaller Galaxy A52. Thus, even if it's not as powerful as the slightly pricier Galaxy S21, it'll match it for refresh rate on a 0.5-inches-larger panel.",
    "With the rotating camera as the Galaxy A82's standout feature, we hope that it handles photography better than the Galaxy A80 did.",
    "That camera had difficulty with nighttime photography, and more frustratingly removed certain features when you switched the main camera into selfie mode. The whole point of this kind of camera is to bring rear camera quality to your selfies, but Samsung limited its photography modes and zooming capabilities.",
    "It would be excellent if the Galaxy A82 had a higher-quality rear camera than the other 2021 Galaxy As, though we doubt it. But whatever the specs, Samsung needs to convince us that its rotating camera will provide better selfies than any other phone."
  ],
  "headers": {
    "4": "Samsung Galaxy A82 release date and price",
    "7": "Samsung Galaxy A82 news and rumors",
    "17": "What we want to see",
    "18": "1. A MASSIVE improvement on the A80 pop-up design",
    "21": "2. A 6.7-inch, 120Hz display",
    "23": "3. An upgraded rear camera"
  },
  "links": {
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy A80": "https://www.techradar.com/reviews/samsung-galaxy-a80-review",
    "best phones": "https://www.techradar.com/news/best-phone",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "announced": "https://www.techradar.com/news/samsung-galaxy-a52-and-a72-are-here-and-bring-flagship-features-to-mid-range-phones",
    "developing": "https://www.techradar.com/news/samsung-might-be-working-on-a-5g-successor-to-its-weirdest-recent-phone",
    "trademarked": "https://www.techradar.com/news/samsung-galaxy-a-series-trademark-reveals-the-names-of-the-2021-handsets",
    "leaked": "https://www.techradar.com/news/moto-g100-samsung-galaxy-a82-and-more-phones-unveiled-in-massive-phone-leak",
    "Android 11": "https://www.techradar.com/news/android-11",
    "pop-up selfie camera": "https://www.techradar.com/news/samsung-galaxy-a82-could-have-an-innovative-selfie-camera",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "leaked teaser for the phone": "https://www.techradar.com/news/samsung-galaxy-a82-an-upcoming-cheap-phone-gets-leaks-leaks-and-more-leaks",
    "review": "https://www.techradar.com/reviews/samsung-galaxy-a80-review"
  }
}