{
  "source": "https://www.techradar.com/news/key-samsung-galaxy-s21-fe-specs-may-have-been-revealed-by-google",
  "title": "Key Samsung Galaxy S21 FE specs may have been revealed by Google",
  "category": "phones",
  "updated": "2021-08-25T09:10:38Z",
  "author": "david-nield",
  "summary": "Here's what's coming",
  "article": [
    "We thought the Samsung Galaxy S21 FE might have appeared in August alongside the Galaxy Z Fold 3 and the Galaxy Z Flip 3, but the wait continues. Now a listing on the Google Play Console developer database looks to have confirmed some of the phone's key specs.",
    "As reported by SamMobile, the specs list points to a Qualcomm Snapdragon 888 chipset under the hood, although it's possible that there will be an Exynos 2100 variant available in certain parts of the world.",
    "We've also got 6GB of RAM (though you'll most likely be able to pay extra for more), a screen resolution of 1080 x 2009 pixels, and Android 11 on board. We've heard these key specs before in previous rumors – although the display resolution was supposed to be 1080 x 2340 the last time we checked.",
    "A lot of the more recent rumors around the Samsung Galaxy S21 FE have been around the release date getting pushed further and further back – it now looks as though October is the best bet for when this cut-price handset might finally see the light of day.",
    "We are at least pretty sure about what the handset is going to look like, thanks to unofficial renders that have found their way onto the web. The screen is expected to measure 6.4 inches from corner to corner and come running at a 120Hz refresh rate.",
    "In addition, you can look forward to 5G connectivity, a triple-lens rear camera, and an IP68 rating for water and dust resistance. The color options that have been mentioned are green, white, blue, violet and gray, so there should be plenty of choices.",
    "We're not exactly sure why it's taken so long for the Galaxy S21 FE to make an appearance, but the global chip shortage is likely to have impacted Samsung's plans. The rumor is that the phone will only be available in Europe and the US for the same reason.",
    "While the Samsung Galaxy S20 FE didn't appear until October 2020, bear in mind that the Galaxy S21 launched earlier in the year than the Galaxy S20 – which means its successor is already overdue, and may not appear for another month or so yet.",
    "Despite that delay, the appeal of these Fan Edition phones hasn't changed: the S21 FE is still going to be offering phone buyers some top-tier specs at a more affordable price point, in a sub-flagship segment of the market that's proved very popular with manufacturers and customers alike in recent years.",
    "Samsung is going to have to price it right though: as the weeks roll by, prices will continue to drop on the original Samsung Galaxy S21, and we're likely to see more mid-range, mid-price handsets hit the market as well."
  ],
  "headers": {
    "3": "The Galaxy S21 FE story so far",
    "6": "Analysis: the delayed Galaxy S21 FE can still be a hit"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "the Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "SamMobile": "https://www.sammobile.com/news/google-confirms-several-key-galaxy-s21-fe-specs/",
    "previous rumors": "https://www.techradar.com/news/samsung-galaxy-s21-fe-mentioned-on-samsung-mexico-website",
    "further and further back": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "thanks to unofficial renders": "https://www.techradar.com/news/samsung-galaxy-s21-fe-renders-show-off-the-phone-in-full",
    "a triple-lens rear camera": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked",
    "The rumor": "https://www.techradar.com/news/heres-an-early-look-at-all-the-devices-samsung-is-launching-on-august-11",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S21": "https://www.techradar.com/deals/best-samsung-galaxy-s21-deals",
    "hit the market": "https://www.techradar.com/news/oneplus-9t-might-be-gone-in-favor-of-a-cheap-phone-in-weird-twist"
  }
}