{
  "source": "https://www.techradar.com/news/the-apple-tv-4k-2021-is-only-six-months-old-and-already-on-sale-for-black-friday",
  "title": "The Apple TV 4K (2021) is only six months old and already on sale for Black Friday",
  "category": "televisions",
  "updated": "2021-11-26T17:26:53Z",
  "author": "nick-pino",
  "summary": "Score a 64GB version of the latest Apple TV 4K for $170 at Amazon",
  "article": [
    "If you’re looking for another great Apple Black Friday deal, we found one for you on the Apple TV 4K (2021), which just hit a new low price on Amazon.",
    "To get a $30 discount on the 64GB model, all you have to do is go to the Amazon product page, hit 'add to cart' and make sure that the extra $19 discount is added at checkout. (Not in the US? Keep scrolling to see the best Apple TV 4K deals in your region.)",
    "The Apple TV 4K regularly goes for $200, so getting it for $170 is a solid deal.",
    "So what's so good about this model? As we pointed out in our Apple TV 4K (2021) review, it's powered by the A12 Bionic processor, which is also found in the iPad and iPhone XS, rather than the A10X chip used in the previous iteration. This makes navigating the interface slightly speedier than before, and it also provides enough processing power to play high-frame-rate (60fps) HDR videos more smoothly than before.",
    "On top of that, there’s a handy color balance feature, which uses the light sensor in any iPhone that supports Face ID to check and tweak your TV’s color balance so it's more accurate and in line with industry standards, without you having to manually adjust the TV’s settings.",
    "If you already have Apple products such as an iPhone or AirPods, choosing the Apple TV 4K (2021) over other streaming devices makes sense, as it’ll give you quick access to any apps or services you’ve already downloaded, and set-up will be simple.",
    "Not in the US? No problem! Here are the best Apple TV 4K deals for wherever you are in the world:"
  ],
  "headers": {
    "3": "Today's best Apple TV deal",
    "6": "The best Apple TV 4K (2021) deals in your region",
    "7": "More Black Friday 2021 deals to peruse"
  },
  "links": {
    "Apple Black Friday deal": "https://www.techradar.com/black-friday/apple-black-friday-deals",
    "Apple TV 4K (2021)": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple TV 4K (2021) review": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "iPad": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone": "https://www.techradar.com/news/best-iphone"
  }
}