{
  "source": "https://www.techradar.com/news/google-chrome-extends-support-for-windows-7-for-some-reason",
  "title": "Google Chrome extends support for Windows 7 for some reason",
  "category": "computing",
  "updated": "2021-11-19T02:30:18Z",
  "author": "anthony-spadafora",
  "summary": "Chrome support for Windows 7 has been extended by another year",
  "article": [
    "Despite the fact that Microsoft just released Windows 11, Google has revealed that it will extend support for Windows 7 in Chrome for an additional year.",
    "While most consumers have now moved on to Windows 10, some enterprise businesses are still running Windows 7 due to the fact that they have large fleets of devices to update and may still be running legacy applications.",
    "Although Google initially announced that its browser would support Windows 7 for another 18 months until July 15, 2021, the search giant has now extended its support date for the aging operating system until January 15, 2022 though this deadline could still be extended further down the road.",
    "According to a blog post from January of last year, Chrome will only receive security and stability updates on Windows 7 going forward as “running an OS outside of official support can leave organizations vulnerable to potential security threats”. Chrome's built-in security features such as Safe Browsing, Site Isolation and advanced password and phishing protection should be more than enough to keep enterprise businesses running Windows 7 safe online as they migrate to a later version of Windows.",
    "Microsoft officially ended support for the Home edition of Windows 7 in January of last year but businesses and enterprise customers were able to get additional security updates for their devices by enrolling in the company's Windows 7 Extended Security Updates (ESU) program.",
    "In a blog post last month though, the software giant announced that it won't be extending support for Windows 7 beyond January of 2023. The same goes for Microsoft Edge which will also be supported on Windows 7 until January 15, 2023. However, Internet Explorer 11 will see its support from Microsoft end next summer across all versions of Windows.",
    "Businesses that have enrolled in the ESU program will also be able to use Chrome on Windows 7 as both Microsoft and Google have said that they will end support for the operating system, which was first released all the way back in 2009, on January 15, 2023.",
    "Also check out our roundup of the best browsers available",
    "Via Ghacks"
  ],
  "headers": {
    "4": "Windows 7 End of Life"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "browser": "https://www.techradar.com/best/browser",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1342434754370097200&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fwindows-it-pro-blog%2Fupdate-extended-security-updates-for-windows-7-and-windows%2Fba-p%2F1872910%2Fpage%2F2%23comments&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fgoogle-chrome-extends-support-for-windows-7-for-some-reason",
    "Safe Browsing": "https://www.techradar.com/news/google-chrome-now-warns-you-if-youre-about-to-install-a-dodgy-extension",
    "ended support": "https://www.techradar.com/news/windows-7-end-of-life-everything-you-need-to-know-about-the-death-of-windows-7",
    "Windows 7 Extended Security Updates": "https://www.techradar.com/news/german-government-paying-thousands-to-keep-using-windows-7",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Internet Explorer 11": "https://www.techradar.com/news/internet-explorer-is-still-causing-trouble-even-from-the-grave",
    "best browsers": "https://www.techradar.com/best/browser",
    "Ghacks": "https://www.techradar.com/news/internet-explorer-is-still-causing-trouble-even-from-the-grave"
  }
}