{
  "source": "https://www.techradar.com/news/oneplus-10-pro-dummy-unit-shows-big-cameras-on-a-massive-phone",
  "title": "OnePlus 10 Pro dummy unit shows big cameras on a massive phone",
  "category": "phones",
  "updated": "2021-11-22T09:50:01Z",
  "author": "james-rogerson",
  "summary": "A metal marvel",
  "article": [
    "We’re starting to get a clear idea of what the OnePlus 10 Pro will probably look like, as hot on the heels of some unofficial renders of the phone, we’ve now seen an aluminum dummy unit.",
    "Shared by leaker @xleaks7 in partnership with Fathom Bracelets, you can see some images of the dummy unit below, giving you a sense for how big the OnePlus 10 Pro might be. And big is the key word, as it looks massive in the hand.",
    "The camera lenses and their housing also look very large, though there’s presumably only three of them, with one of the lens-like circles likely being a flash. If not for that, this would seem very much like it could be an ‘ultra’ phone in line with the Samsung Galaxy S21 Ultra or the upcoming Samsung Galaxy S22 Ultra.",
    "Then again, this source claims that there actually are four lenses, with the flash being in the center. But we’re not convinced by that, as the central circle looks a bit too small, and as earlier leaks suggested the OnePlus 10 Pro would only have a triple-lens camera.",
    "Either way, other details you can make out here include a curved screen, with the bottom edge housing the USB-C port, SIM slot and speaker grille, while the right edge has a silent mode switch and power button, and the left edge has volume controls.",
    "With the exception of a disagreement on the number of cameras, this design lines up with what we’ve seen before, so it may well be accurate, but we’d still take it with a pinch of salt.",
    "For one thing, it’s not clear where this dummy unit came from – whether the leaker made it themselves or whether they obtained it, and if so where from.",
    "In either case it could well simply be based on previous leaks. Sometimes dummy units are used by accessory makers to design cases and other accessories prior to the launch of a phone. In those situations they might be based on official details provided by OnePlus, but they could equally be based on likely leaks.",
    "So while this matching up with images we’ve seen is a positive sign, it could also just mean that it’s based on those images.",
    "In any case, we should find out how accurate this is before too long, as leaks suggest the OnePlus 10 range will be unveiled in either late January or early February.",
    "Via NotebookCheck"
  ],
  "headers": {
    "5": "Analysis: a convincing dummy, but we’d still take it with a pinch of salt"
  },
  "links": {
    "OnePlus 10 Pro": "https://www.techradar.com/news/oneplus-10",
    "unofficial renders of the phone": "https://www.techradar.com/news/oneplus-10-pro-renders-specs-and-surprisingly-early-release-date-leaked",
    "@xleaks7": "https://twitter.com/xleaks7/status/1461683682050289669",
    "Fathom Bracelets": "https://fathombracelets.com/collections/homme",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S22 Ultra": "https://www.techradar.com/news/samsung-galaxy-s22",
    "late January or early February": "https://www.techradar.com/news/oneplus-10-could-launch-early-except-you-wont-be-able-to-buy-it",
    "NotebookCheck": "https://www.notebookcheck.net/OnePlus-10-Pro-dummy-unit-reveals-the-scale-of-the-next-OnePlus-flagship.580430.0.html"
  }
}