{
  "source": "https://www.techradar.com/news/grab-these-noise-cancelling-headphones-at-their-lowest-ever-price",
  "title": "Grab these noise-cancelling headphones at their lowest ever price",
  "category": "audio-visual",
  "updated": "2021-12-07T10:55:35Z",
  "author": "olivia-tambini",
  "summary": "Don't miss these excellent headphones deals at Amazon",
  "article": [
    "Noise-cancelling headphones can be pricey, but these excellent deals at Amazon prove you don't have to break the bank in your quest to find a little peace and quiet while enjoying your music.",
    "In the US, Amazon has brought the brilliant Jabra Elite 85H noise-cancelling headphones back down to their lowest ever price – a return to the discounts we saw over Black Friday and Cyber Monday.",
    "Right now, you can get the over-ear headphones from $249.99 to $149.99, saving you $100.",
    "Amazon has also reduced the Jabra Elite 85H in the UK, slashing the price from £279.99 to £169.99 – a huge saving of £110. (Not in the US or UK? Scroll down for the best prices in your region.)",
    "While this deal isn't the lowest price we've ever seen, the Jabra headphones are still far cheaper than best-selling models like the Sony WH-1000XM4 - and you're still getting brilliant sound, active noise cancellation, and a comfy fit for your money. And, if you're a Prime member, you can tick the box to get an additional 15% off, bringing the price down to £144.49.",
    "The best noise-cancelling headphones you can buy may be the Sony WH-1000XM4, but the Jabra Elite 85H are a great option if you need something a little cheaper.",
    "In our Jabra Elite 85H review, we lauded their class-leading battery life, terrific call quality, impressive noise-cancelling and understated style. In fact, the only area where they can't compete with the Sony is in their codec support – the WH-1000XM4 supports LDAC and AAC, while the Elite 85H only supports SBC and AAC, so you won't be able to enjoy hi-res audio files.",
    "Saying that, you won't be disappointed with the audio quality if you're a casual listener. These noise-cancelling headphones sound well-balanced, and the accompanying app allows you to toggle through different audio presets to find the perfect sound for your music.",
    "No matter where you live, you'll find all the lowest prices for the Jabra Elite 85H from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best noise-cancelling headphones deals",
    "8": "More Jabra Elite 85H deals"
  },
  "links": {
    "from $249.99 to $149.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FJabra-Wireless-Noise-Canceling-Headphones-Copper%2Fdp%2FB07RS8CFJZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2348725054983367000-20",
    "from £279.99 to £169.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FJabra-Headphones-SmartSound-Technology-Titanium-Black%2Fdp%2FB07NPN3H25%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1238087643275433500-21",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Jabra Elite 85H review": "https://www.techradar.com/reviews/jabra-elite-85h",
    "WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones"
  }
}