{
  "source": "https://www.techradar.com/news/of-course-the-saints-row-reboot-release-is-being-delayed",
  "title": "Of course the Saints Row reboot release is being delayed",
  "category": "gaming",
  "updated": "2021-11-17T10:58:43Z",
  "author": "gerald-lynch",
  "summary": "Yet another game succumbs to delays",
  "article": [
    "The Saints Row reboot will not make its originally intended release date.",
    "That's the news out of developer Volition, which has announced in a blog post that a six month delay will push the game back from 25 February 2022, to November 23.",
    "Having \"underestimated\" the impact of the Covid-19 pandemic, the studio will take the extra time to \"give our team longer to perfect their craft\", according to Volition chief creative officer Jim Boone.",
    "\"We're doing some fine tuning and there won't be much change in the game outside of overall quality and polish,\" Boone said.",
    "\"As mentioned when we announced Saints Row in August, this will be the biggest and best Saints Row game ever and, in order to achieve our goal, we've settled upon a generous, yet essential amount of time to realize our ambitions.",
    "\"Rest assured, there will not be any changes to the story or the characters or anything that we've lovingly imagined over the last few years and already shared with you.",
    "\"Over the past two years, all corners of the entertainment industry have been affected/impacted in one way or another. As gamers ourselves, we know what it feels like to have something delayed which you've been looking forward to; it's frustrating and you feel disappointed. But we also know that when we finally get Saints Row in your hands, it will have been worth the wait. It's our absolute priority to get this right.\"",
    "Revealed back in August 2021, it never really truly felt like the new Saints Row game would make its original release date. From reveal to launch in just five months doesn't fly these days (even if there's evidence the game has been in development since at least 2019).",
    "It's hard to even remember a game that's made it scheduled release date even before the pandemic kicked in, let alone during it, even if a development team has done well to adapt to the work from home changes.",
    "As such, release dates now do little more than to serve the purpose for investors and shareholders to gauge the interest a game might receive upon its eventual release – and maybe rack up a few pre-orders in the process.",
    "Still, it probably works out for the best for Saints Row regardless – it gives the open-world crime game some extra time to be polished up, and avoids what was shaping up to be a busy February release window which would have seen it rubbing shoulders with Elden Ring, Dying Light 2 and Horizon Forbidden West."
  ],
  "headers": {
    "7": "Analysis: No alarms and no surprises"
  },
  "links": {
    "Saints Row reboot": "https://www.techradar.com/news/saints-row-reboot-what-can-we-expect-to-see-from-volitions-next-game",
    "a blog post": "https://saintsrow.com/news/saints-update-from-jim-boone",
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer"
  }
}