{
  "source": "https://www.techradar.com/news/maintaining-momentum-for-smbs-in-2021",
  "title": "Maintaining momentum for SMBs in 2021",
  "category": "computing",
  "updated": "2021-02-22T15:26:07Z",
  "author": "chris-angus",
  "summary": "The maintaining resilience for SMBs",
  "article": [
    "2020 has dramatically changed the business landscape in a way we didn't think was possible. The events of last year have impacted organizations across the globe, including small businesses, bringing both challenges and the need to remain resilient.",
    "A recent study conducted by 8x8 uncovered the key concerns that more than 1,000 SMB employees have been experiencing since working from home. At the root of these worries was a crisis around communication.",
    "At the start of the pandemic, customers were patient and more forgiving with a less than satisfactory customer experience, as businesses adjusted to the reality of remote service teams and increased demands. However, nearly a year on since the crisis emerged, the expectations of the on-demand generation have slowly resurfaced.",
    "And yet, one of the core challenges SMB employees are facing is around customer service. Over half (54%) of respondents believe that more frequent communication with customers will be critical to the success of their business; only 39% of those surveyed report their company prioritizes customer service.",
    "With almost three quarters (72%) of respondents agreeing that frequent communication is essential to the success of their team, it’s encouraging to see that employees are committed to improving services levels and understand what needs to be done. Business owners that haven’t yet reviewed their communication strategy and technology to address this need to take action to make it a reality. One solution may be to introduce a unified cloud communications platform which allows employees to communicate with colleagues, internally, and with their customers, both while they’re in the office or working remotely from their home. The single platform would also offer more efficiency and improve communication across the entire organization.",
    "A great example of this approach is one of our customers, Eversfield Organic, a UK-based organic grass-fed meat and organic vegetable box company, who experienced a 700% increase in orders during lockdown last March. The business had to respond rapidly to not only meet this surge in demand, but ensure processes were in place to continue internal communication between workers, from a largely remote setting.",
    "By deploying an integrated communications platform, Eversfield was able to continue to operate efficiently, be highly responsive to growing customer needs with call queuing and rerouting set up on the platform to manage customer call volumes, continue team collaboration from disparate locations and ensure customer service and retention levels were not compromised.",
    "In the UK, productivity has long been a challenge, with research from the University of Gloucestershire highlighting that SMBs based in the UK and the EU have lower productivity rates than their counterparts in the US.",
    "It’s clear that technology has a role to play here. Since March 2020, video conferencing adoption has rocketed - enabling face to face interaction to continue online. According to our research, 44% of the SMB employees surveyed believe that with effective communication tools, productivity would be the most improved business challenge. However, at present, only 47% of SMB employees feel that the communication tools their company uses is helping them to do their job more efficiently.",
    "Finding the right communication tools that allow team members to connect with their colleagues, promote team collaboration and offer a more agile working environment will pay dividends this year and beyond. Following the roll-out of the vaccine, we may well be close to business recovery, however, the new working world will present a more hybrid approach which businesses will need to factor into their planning; not only enabling remote working but creating a virtual working environment more conducive to high productivity levels.",
    "While the outlook for this year is unclear, I firmly believe SMBs need to be armed and ready to embrace the opportunities that present themselves later this year. Whether it’s slowly reopening their business, creating a hybrid business model catered for the digital consumer or innovating their current proposition. Regardless of the approach taken, they will all require a robust cloud communications strategy to ensure the power of conversation between workers, customers, and partners remain the heart of their business. When deciding on the best tool for your business, I would encourage owners to consider the following:",
    "Ease of use. For many SMBs, the pace of business has never been faster. Therefore consider a cloud communications tool that offers simplicity and integrates across all workers within the organization, from receptionist to your sales agent, to minimize the number of vendors you have to deal with.",
    "The ability to scale up or down is crucial to a small business, as some may be experiencing greater demand and others needing to reduce costs for the time being. Cloud technology allows you to change your software requirements as they change, offering you true operational efficiency.",
    "Multiple communication channels. As consumer habits continue to evolve, ensure you can stay ahead of these trends and engage with them on the channels of their choice. Whether that is voice, video, chat or SMS, ensure you consider a wide range of communication channels when selecting a cloud technology provider."
  ],
  "headers": {
    "2": "Communication - the bedrock of business success today",
    "7": "Improving productivity in the remote era",
    "10": "What is next for SMBs?"
  },
  "links": {
    "SMB": "https://www.techradar.com/news/best-small-business-servers",
    "working from home": "https://www.techradar.com/news/5-things-you-need-to-consider-when-working-from-home",
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "customer experience": "https://www.techradar.com/best/cx-tools",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams"
  }
}