{
  "source": "https://www.techradar.com/news/apple-iphone-13-launch-event-6-things-you-might-have-missed",
  "title": "Apple iPhone 13 launch event – 6 things you might have missed",
  "category": "phones",
  "updated": "2021-09-15T15:04:05Z",
  "author": "gerald-lynch",
  "summary": "From cinematic shooting to some reassurance for cyclists",
  "article": [
    "The iPhone 13 has launched – but if you’re an Apple smartphone fan, well, you probably knew that was coming anyway, right? Apple works almost like clockwork when it comes to its annual phone refreshes, and the iPhone 13 (as well as iPhone 13 mini and iPhone 13 Pro) came along right on time.",
    "But Apple had a few surprises up its sleeve this year – and we’re not just talking about the launch of a new iPad or Apple Watch Series 7.",
    "Here are 6 details that you may have missed from Apple’s latest product showcase.",
    "We love the iPad Mini, Apple’s most portable tablet. It often gets short shrift at these events – a side-act compared to its larger siblings and iPhone cousins. But the new iPad Mini for 2021 really takes things up a notch.",
    "Closer now in industrial design to the iPad Pro range, it’s the same footprint overall as earlier models while squeezing in more screen real estate – 8.3 inches. With a 40% jump in CPU performance, and a massive 80% jump in GPU performance, it’s ticking every box now thanks to magnetic Apple Pencil support, 5G connectivity and stereo sound speakers. Plus, it’s now working with USB-C, opening up a whole host of newly-compatible accessories to Apple’s miniature slate.",
    "If you’re heading out for a cycle with your Apple Watch on your wrist, the new watchOS 8 operating system for the timepiece will be way more useful than it has previously been.",
    "Cyclists will benefit from automatic prompts to start a workout when cycling activities are recognized, pausing and restarting as you take breaks along your route. More importantly, it’ll now recognize falls – a unique motion in comparison to Apple’s existing ability to spot a fall from a standing position.",
    "And, if you’re taking it slightly easier with the support of an ebike motor, Apple Watch wearers running watchOS 8 can let their device’s know that you’re getting a speed boost from the built-in motor, with the software recalibrating calorie burning with the motor in mind.",
    "If you fancy yourself as a budding movie maker, but can’t get access to pro-grade equipment, Apple had Academy Award winner Kathryn Bigelow on hand to sing the praises of the new iPhone’s Cinematic video shooting mode.",
    "This essentially brings back and simplifies rack focus shooting – letting your iPhone’s video camera make better use of its depth capabilities. Offering a bokeh and depth of field effect to your video, it can hold focus on a subject and automatically transition to a new focus point and depth of field without your needing to do anything. It’ll anticipate a subject entering a frame, and will draw focus to another area of the frame if your subject turns away from the camera. You can also manually tap on a target focus subject to lock them away from Apple’s AI auto choices. All this will be shot in Dolby Vision HDR, too.",
    "The OLED screen on the new iPhone 13 Pro will get a really nifty new feature. Not only does it offer a peak outdoor brightness of 1000 nits, but it’s also getting an adaptive refresh rate mode that Apple’s calling ProMotion. This will allow for buttery-smooth movement, as Apple’s display stays in sync with the exact timings of frames its CPU and GPU is able to produce.",
    "Now, to be clear, there are already a number of Android devices that offer an adaptive refresh rate, so Apple isn’t the first to the party here when it comes to smartphones. But adaptive refresh rates really come into their own when used in a gaming context, and Apple’s App Store and Apple Arcade services have some really excellent, and demanding, games on them. Adaptive refresh rate will be a great match to see them really shine.",
    "Bigger is better, right? With all the 4K Dolby Vision movies you’ll be shooting on your iPhone 13 Pro, you’re not going to be able to make do with some tiddly storage capacity. So, in addition to 128GB, 256GB and 512GB storage sizes, the iPhone Pro 13 will max out at a stonking 1TB storage option. You might want to take a deep breath before considering it though – its price tag is $1,499 / £1,449 / AU$2,569 for the standard Pro, and a whopping $1,599 / £1,549 / AU$2,719 for the 13 Pro Max.",
    "​​The arrival of the iPhone 13 range has shifted all the older iPhones down in price to become more affordable alternatives to the newcomers – and at long last, the venerable iPhone XR has been replaced in the lineup. The iPhone 11 is taking its role as the older option between the iPhone SE 2020 and the iPhone 12 mini at the $499 / £499 price point, and with its night photography, is a handily better option than the iPhone XR. But pour one out for the XR, which launched in 2018 as the first 'affordable flagship' from Apple that offered nearly all the best perks at a lower price. iPhone XR, we hardly knew ye."
  ],
  "headers": {
    "3": "1. iPad Mini finally gets a proper refresh (and USB-C)",
    "5": "2. watchOS 8 works better for cyclists",
    "8": "3. Portrait mode in video = Cinematic mode for iPhone",
    "10": "4. iPhone 13 Pro gets 120Hz adaptive refresh rate",
    "12": "5. 1TB internal storage comes to iPhone 13 Pro and Max",
    "13": "6. RIP, iPhone XR"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "new iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Apple Watch Series 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "iPad Mini for 2021": "https://www.techradar.com/reviews/ipad-mini-2021",
    "Apple Pencil": "https://www.techradar.com/how-to/apple-pencil-on-ipad-our-full-guide-on-how-to-use-it",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "Dolby Vision HDR": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-games-list-every-game-you-can-play-right-now",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review"
  }
}