{
  "source": "https://www.techradar.com/news/microsoft-edge-feature-solves-one-of-the-most-common-browser-problems",
  "title": "Microsoft Edge feature solves one of the most common browser problems",
  "category": "computing",
  "updated": "2021-08-18T18:12:28Z",
  "author": "anthony-spadafora",
  "summary": "New feature will make open tabs searchable in Edge",
  "article": [
    "Microsoft is reportedly working on a new feature in Microsoft Edge that will allow users of its browser to search through their currently opened tabs.",
    "While the software giant has yet to officially announce the feature, Leo Varela was able to enable it back in February and has been keeping tabs on the progress Microsoft has made in implementing it in Edge.",
    "Apparently Edge's new “Search tabs” feature has been in development for months and is now in the early testing stage according to a new Reddit post from Varela.",
    "Back in February, Varela first enabled Edge's search tabs feature by using a command line flag which involves a bit more work than entering edge://flags in the browser's address bar to enable other experimental features.",
    "Now though, Microsoft has added a new “Search tabs” item to the Tab actions menu in Edge Canary according to Varela. For those unfamiliar, the Tabs action menu can be used in Edge to turn off vertical tabs, to access recently closed tabs and to add all tabs to Collections.",
    "Clicking on search tabs opens a pop-up menu in the middle of the browser that currently doesn't expand from the tabs action menu or from the taskbar. However, since this feature is still being tested and hasn't been officially announced yet, its functionality could change upon release.",
    "Microsoft continues to add new features and functionality to Edge to help boost the productivity of users of its browser. While vertical tabs has made navigating open tabs a simpler experience, search tabs will make it easier to find specific content within those tabs once it officially rolls out.",
    "Via Windows Central"
  ],
  "headers": {
    "3": "Search tabs"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "browser": "https://www.techradar.com/best/browser",
    "Leo Varela": "https://www.techradar.com/news/microsoft-edge-will-now-make-it-easier-to-save-pages-as-a-pdf",
    "Reddit post": "https://www.reddit.com/r/MicrosoftEdge/comments/p6cse8/microsoft_has_added_a_new_option_to_the_tab/?context=3",
    "edge://flags": "https://www.techradar.com/news/you-can-give-microsoft-edge-a-windows-11-makeover",
    "vertical tabs": "https://www.techradar.com/news/microsoft-edge-update-might-actually-make-vertical-tabs-useful",
    "Collections": "https://www.techradar.com/news/microsoft-edge-is-attempting-to-reinvent-the-toolbar",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "Windows Central": "https://www.windowscentral.com/microsoft-working-search-tabs-feature-edge-canary"
  }
}