{
  "source": "https://www.techradar.com/news/fitbit-luxe-vs-fitbit-charge-4-two-of-the-best-fitbits-compared",
  "title": "Fitbit Luxe vs Fitbit Charge 4: two of the best Fitbits compared",
  "category": "fitness",
  "updated": "2021-08-25T13:32:13Z",
  "author": "cat-ellis",
  "summary": "Sports or style – what's your priority?",
  "article": [
    "If you're considering buying a new Fitbit, the Fitbit Luxe and Fitbit Charge 4 are likely to be high on your shortlist. They are both excellent watches – two of the best Fitbits you can buy – so how do you know which one is right for you?",
    "Here we've put the two Fitbits side by side, comparing their price, design, features and battery life, and weighing up all the key differences so you can make the right choice.",
    "Ultimately, the Fitbit Charge 4 would be out top choice if you're interested in running. Its plastic case is durable and lightweight, and (most importantly), it has its own GPS to more accurately track your outdoor workouts. That also means you can leave your phone at home while running, as you won't need a Bluetooth connection to your handset to map out your route,",
    "If you're looking for a Fitbit for everyday wear, and not something particularly workout-oriented, the Luxe would be a better choice. It's the most stylish Fitbit around, so you'll be happy wearing it 24/7 – which will help it build up a full picture of your activities and habits, so it can nudge you towards healthier choices.",
    "There's now a third option that's worth your consideration as well: the Fitbit Charge 5. This watch combines the best features of the Charge 4 and Luxe, with on-board GPS, plus a bright AMOLED display so you can easily see all your health stats. It also has an ECG (electrocardiogram) sensor to check for signs of atrial fibrillation, plus an EDA (electrodermal activity) sensor to help monitor stress levels.",
    "Pre-orders are open now, so if you can wait a little while for delivery, it may be your best option.",
    "The Fitbit Luxe became available to pre-order directly from Fitbit on April 19 2021, and started shipping in early July, priced at $149.95 / £129.99 / AU$199.95.",
    "The Fitbit Charge 4 launched on 15 April 2020, priced at $149.95 / £129.99 / AU$229.95 (the same as the Charge 3's launch price). At the time of writing, it's reduced to $99.95 / £99.99 / AU$179.95 when bought directly from Fitbit, and can often be found cheaply at third-party retailers like Amazon.",
    "At the time of writing, both devices come with a free six-month trial of Fitbit Premium for new users.",
    "The Fitbit Luxe and Charge 4 are both narrow, slim devices, but put a different spin on the overall shape.",
    "The Luxe follows the Fitbit's new 'Biologic Design Language', which senior vice president of design Jonah Becker says is \"inspired by and designed for the human body\". That means soft, curved edges and smooth lines that are comfortable, with nothing too squared off.",
    "Its case is stainless steel, and it comes with a silicone band as standard (available in a range of soft colors). For a little extra cash, it's also available with a special edition gold-toned stainless steel bracelet created by jewelry designer Gorjana.",
    "The Fitbit Charge 4 was released before Fitbit introduced its Biologic Design Language, and has a more angular look. It's available in a range of dark colors (black, navy blue and deep purple).",
    "The Charge 4's case and buckle are plastic, and it has a silicone band with a subtle diamond texture. The special edition comes with both the silicone band and a woven strap with reflective strands worked into the material.",
    "The Fitbit Luxe has one of the best screens of any fitness tracker we've tested. Although the narrow AMOLED display measures just 0.76in on the diagonal, is has a resolution of 124 x 206 pixels, meaning graphics and text are smooth and crisp. Colors are vibrant, and it looks striking even at a low brightness setting.",
    "The Fitbit Charge 4's display is functional, but much less impressive. It's slightly larger, measuring 1in diagonally, but has a 100 x 160 pixel resolution and is a backlit monochrome OLED rather than full color.",
    "We're hopeful that the Fitbit Charge 5 will have a color screen when it launches (likely in 2022), but we suspect it won't be a striking AMOLED like the Luxe's.",
    "Neither of these devices are fully-fledged smartwatches (if that's what you're looking for, take a look at the Fitbit Sense and Versa 3), but they still have a modest selection of tools to help you in everyday life,",
    "Both the Fitbit Charge 4 and Fitbit Luxe allow you to receive call and text alerts, plus smartphone app notifications on your wrist. You can also use the Fitbit Charge 4 to control your Spotify playlist, and it has NFC so you can make contactless purchases using Fitbit Pay.",
    "They are both compatible with both Android and iOS smartphones.",
    "Both the Fitbit Charge 4 and Luxe track over 20 different forms of exercise, and can begin tracking certain workout types automatically if you forget to enable the option yourself.",
    "However, only the Fitbit Charge 4 has its own on-board GPS, whereas the Luxe uses 'connected GPS', which means it has to piggyback on your phone to determine your location. This is important because connected GPS is generally less accurate, and means that you have to carry your phone with you in order to track your route on runs, walks and bike rides. The Luxe will still measure your heart rate and the duration of your workout if it can't connect to your phone, but you won't see a map in the Fitbit app afterwards.",
    "Both watches have heart rate tracking, and monitor the number of steps you take each day, but only the Charge 4 has an altimeter to monitor how many flights of stairs you've climbed.",
    "Both watches offer sleep tracking, and can monitor changes in blood oxygen saturation (SpO2) levels at night, which can be a sign of problems like sleep apnea. The Fitbit Charge 4 can also detect changes in skin temperature, which you can track in the Fitbit app after it's established a baseline over a few nights."
  ],
  "headers": {
    "6": "Price",
    "9": "Design",
    "14": "Display",
    "17": "Smartwatch features",
    "20": "Fitness tracking"
  },
  "links": {
    "Fitbit Luxe": "https://www.techradar.com/reviews/fitbit-luxe",
    "Fitbit Charge 4": "https://www.techradar.com/reviews/fitbit-charge-4",
    "best Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "Fitbit Charge 5": "https://www.techradar.com/reviews/fitbit-charge-5",
    "Pre-orders are open now": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5092791710140230000/https://www.fitbit.com/global/uk/home",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3"
  }
}