{
  "source": "https://www.techradar.com/news/seagate-lyve-wants-to-move-all-your-data-to-the-cloud-with-ease",
  "title": "Seagate Lyve wants to help move all your data to the cloud with ease",
  "category": "computing",
  "updated": "2021-03-30T13:01:24Z",
  "author": "mayank-sharma",
  "summary": "New Lyve service relies on purpose-built hardware",
  "article": [
    "Seagate has announced a new data transfer service to help businesses move vast amounts of data from in-house silos to their cloud computing data centers.",
    "Offered as part of its Seagate Lyve portfolio of products, the new Lyve Data Transfer Services (DTS) is vendor-agnostic and works with private, public, and hybrid cloud hosting environments.",
    "“With only a fraction of enterprise data being put to work due to economics and storage complexities, Seagate has simplified how mass capacity data is securely captured, aggregated, transported, and managed,” said Jeff Fochtman, senior vice president of marketing at Seagate Technology.",
    "Seagate relies on its own Rethink Data report that estimated that businesses accumulate data at an average annual growth rate of 42.2%. More than half of the thousand businesses surveyed frequently moved data from their endpoints at the edge to the cloud and the average size of the data transfer was 473TB.",
    "The Lyve DTS is designed to speed up the move.",
    "Seagate says that the service is made up of several components including the Lyve Mobile modular and scalable hardware that’s been purpose-built for secure mass-capacity edge data storage, as well as lift-and-shift initiatives to facilitate the movement of data.",
    "To illustrate the usefulness of the service, the release banks on the example of the Entertainment Technology Center (ETC) at the University of Southern California, which faced difficulties pushing 4K raw video footage through its 35Mbit/s network.",
    "“Lyve Data Transfer Services make it possible to transfer and move 4K production footage to our cloud data center at the end of each day, quickly ingesting and moving the data, saving us time and money,” explained ETC’s production technologist and digital imaging technician, Dane Brehm.",
    "Although exact pricing information for Lyve DTS isn’t available at the moment, Seagate notes that the service is available through scalable and flexible subscription plans."
  ],
  "headers": {
    "3": "Data transfers"
  },
  "links": {
    "data transfer": "https://www.techradar.com/best/best-data-migration-tools",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Seagate Lyve": "https://www.techradar.com/news/seagate-has-launched-a-new-cloud-storage-as-a-service-offering",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "4K raw video footage": "https://www.techradar.com/news/best-4k-camera"
  }
}