{
  "source": "https://www.techradar.com/news/half-life-alyx-could-be-just-the-start-as-valve-confirms-more-single-player-games",
  "title": "Half-Life: Alyx could be just the start, as Valve confirms more single-player games",
  "category": "gaming",
  "updated": "2021-01-21T09:05:16Z",
  "author": "henry-st-leger",
  "summary": "Are there more VR games to come?",
  "article": [
    "It looks like more games are coming from Valve, after Valve president Gabe Newell confirmed the company was working on a number of new titles – seemingly galvanized by the success of Half-Life: Alyx.",
    "“We definitely have games in development that we’re going to be announcing,\" said Newell, in an interview with 1 News, adding that \"it’s fun to ship games.”",
    "As ever, Newell wouldn't be drawn on details, dismissing a rumored title codenamed 'Citadel' that he claimed he'd never heard of: \"We have a bunch of code names – are you referring to a code name? I don't know what 'Citadel' is.\"",
    "But it seems like the launch of Half-Life: Alyx, a widely acclaimed VR game available to play on the Valve Index, as well as Oculus and HTC headsets, has inspired the developers in new ways – and more single-player titles seem certain.",
    "“Alyx was great – to be back doing single-player games, that created a lot of momentum inside of the company to do more of that,\" said Newell.",
    "Half-Life: Alyx was a surprise for fans of the Half-Life series, acting as a spin-off of the beloved sci-fi shooters, which have frustrated and fascinated many in the lack of a Half-Life 3 to tie its story threads together.",
    "Valve hasn't appeared to pay too much attention to single-player games in its recent history, preferring to focus on the multiplayer Dota 2, or even its competitive card game Artifact. After the acquisition of Campo Santo, the developer behind Firewatch, though, it seemed that Valve was renewing an interest in the high-quality single-player storytelling it made its name on.",
    "The Valve Index VR headset has been on the market since 2019, and despite its high price tag compared to the likes of the Oculus Quest 2, garnered rave reviews for its high-spec hardware, intuitive Knuckle controllers, and wide field of vision – even if the SteamVR interface running on it could use some work.",
    "Even for those keen to try out the headset, though, finding stock has been difficult. Newell delves into this in the interview cited above, claiming that necessary components for the headset were in extremely high demand at the start of the Covid-19 pandemic, making further production impossible.",
    "\"We actually have components that are manufactured in Wuhan and when you're setting up your manufacturing lines it doesn't occur to you that you're suddenly going to be dependent on this peculiar transistor that's sitting on one board that you can't get,\" Newell said.",
    "\"Everybody ended up running into the same problem simultaneously – you go from, 'Oh, we're in great shape,' to, 'What do you mean Apple or Microsoft just bought the next two years' supply of this just so they could make sure they aren't going to run out?'",
    "\"You went from a situation where everything was getting done just in time to people buying up all the available supplies.\"",
    "It might be a while until more people can try out the pleasures of the Index, though we're sure Facebook's Oculus Quest 2 will be able to fill in the gaps until then."
  ],
  "headers": {
    "7": "Supply and demand"
  },
  "links": {
    "Half-Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "1 News": "https://www.tvnz.co.nz/one-news/new-zealand/realistic-possibility-48m-e-sports-tournament-could-held-in-nz-says-gaming-tycoon-gabe-newell",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Half-Life 3": "https://www.techradar.com/news/gaming/half-life-3-release-date-news-and-rumours-1290663",
    "Artifact": "https://www.techradar.com/news/artifact-is-valves-shot-at-beating-hearthstone-the-king-of-online-card-games",
    "Firewatch": "https://www.techradar.com/news/gaming/the-witness-and-firewatch-are-the-sorts-of-slow-paced-first-person-experience-vr-needs-1314873",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}