{
  "source": "https://www.techradar.com/news/how-to-watch-frank-of-ireland-online-stream-every-episode-of-new-comedy-show-now",
  "title": "How to watch Frank of Ireland online: stream every episode of new comedy show now",
  "category": "computing",
  "updated": "2021-04-15T18:03:42Z",
  "author": "kevin-lynch",
  "summary": "The Gleeson brothers navigate single life in Dublin",
  "article": [
    "Tipped to follow in the footsteps of Father Ted and Derry Girls, Frank of Ireland sees brothers Brian and Domhnall Gleeson team up for what looks set to be a hit new Irish comedy show. Available to watch in most regions via Amazon Prime Video, find out how to watch Frank of Ireland where you are here.",
    "Written and starring the two siblings, Brian (Peaky Blinders, Hellboy) plays self-centred kiddult Frank, a socially awkward, struggling musician still living at home in suburban Dublin. As he hits the significant Irish age of 33, his family force him to face up to some hard truths about his arrested development, with suitably daft results ensuing.",
    "Very much a family affair, the show sees Domhnall (General Hux in the Star Wars sequels) , play Frank's loyal best friend, Doofus, whose full-time job appears to be clearing up the mess left in his pal’s wake.",
    "The series kicks off with Frank receiving the devastating news that his ex-girlfriend Áine (Sarah Greene) has found a new boyfriend who just happens to be both a doctor and a mixed martial arts expert.",
    "Unable to accept that she could get over him so soon (they only broke up six years ago), Frank endeavours to get a gig at Áine’s grandmother’s funeral, hoping to win her back with his sensitive singer songwriter skills.",
    "Produced by Catastrophe's Sharon Horgan, there's plenty of top drawer TV pedigree involved that should ensure that this new show delivers plenty of laughs . Read on as we detail how to watch Frank od Ireland online, and for FREE if you’re in the UK and Ireland via Channel 4, or a new or returning Amazon Prime Video customer elsewhere around the world.",
    "If you're a Prime Video subscriber or a Channel 4 viewer and find yourself stuck in a country where either service isn't available, or you can’t access the same content provided back home, then that's probably down to geo-blocking restrictions.",
    "Luckily, there’s a simple solution. Downloading a VPN will let you to watch Frank of Ireland online no matter where you are, simply by changing your IP address to one that's back in your country of residence. Now, here's how to get started with this essential bit of streaming software.",
    "More from Amazon Prime:"
  ],
  "headers": {
    "6": "How to watch Frank of Ireland from abroad"
  },
  "links": {
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FTHEM-Season-1%2Fdp%2FB08XXDRJKH%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1022441022675431800-20",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}