{
  "source": "https://www.techradar.com/news/bridgerton-season-2-first-look-and-what-we-know",
  "title": "Bridgerton season 2: first look and what we know",
  "category": "entertainment",
  "updated": "2021-09-25T17:15:55Z",
  "author": "lisa-wehrstedt",
  "summary": "Bridgerton season 2 explained",
  "article": [
    "Bridgerton season 2 is now in the works, and Netflix has released a first look at one of the best Netflix shows' return. Scroll down for more on that. A release date is coming in 2022, it's been confirmed.",
    "The first season of this raunchy period drama was a huge success for Netflix, becoming the streamer's biggest show ever with a whopping 82 million household tuning in to watch it in the first month alone. The show became an instant phenomenon and was quickly renewed for a second season.",
    "With season 3 and 4 also confirmed for the Shondaland series, we're going to explain everything we know about the show’s future so far, including which cast members are joining and leaving for Bridgerton season 2, and what we can expect from the upcoming episodes in terms of story.",
    "There is no official release date for Bridgerton season yet, but the first look teaser confirmed 2022 is when it's coming. An exact date is yet to be nailed back.",
    "When Bridgerton season 2 was announced in a message by Lady Whistledown shared on the show’s official Twitter account (see above), it said that production would resume in \"Spring 2021\". Throughout February and March, Nicola Coughlan (who plays Penelope Featherington on the show) offered a few social media updates about dress and hair fittings already being underway.",
    "Filming has taken place throughout 2021 starting back in May, and with a new teaser now available, we have to assume that the show is nearing the end of production at this point.",
    "Netflix revealed a first look at Bridgerton season 2 during its Tudum event on September 25 – showing Anthony Bridgerton meeting Kate Sharma in the show. Check it out above.",
    "As you might expect, all the Bridgerton siblings are going to be back for season 2: Claudia Jessie will return as Eloise, Luke Newton as Colin, Luke Thompson will continue to play Benedict and Ruth Gemmell will again be the family’s widowed matriarch Lady Violet. Ruby Stokes, Will Tilston and Florence Hunt are all expected to return as the young Francesca, Gregory and Hyacinth Bridgerton. Phoebe Dynevor will reprise her role as Daphne, but will hand over the leading role to Jonathan Bailey’s Anthony.",
    "Anthony will receive a new love interest named Kate Sharma, who will be played by Sex Education's Simone Ashley, according to Deadline. She's described as the headstrong and smart older sister to Edwina, who in turn will be portrayed by Charithra Chandran, while Shelley Conn will play their mother, Mary. Calam Lynch will reportedly make his introduction as Theo Sharpe in season 2, and Rupert Young is joining the show as Jack.",
    "Lady Danbury (Adjoa Andoh), Queen Charlotte (Golda Rosheuvel) and the gossip-modiste Genevieve Delacroix (Kathryn Drysdale) are also expected to be back, alongside most of the Featherington family, including Penelope (Nicola Coughlan) and Lady Portia (Polly Walker) and her other two daughters Prudence (Bessie Carter) and Philippa (Harriet Cains).",
    "Not expected to return in Bridgerton season 2 is, of course, actor Ben Miller, whose character Lord Featherington died at the end of season 1. On a similar note, some characters whose arcs concluded in season 1 seem unlikely to return – like Marina Thompson (Ruby Barker) and opera singer Siena (Sabrina Bartlett), for example. After the season 1 finale revealed the true identity of Lady Whistledown, it’s also not clear whether Julie Andrews will return to voice her.",
    "At the start of April, Netflix announced on Twitter that breakout star Regé-Jean Page would not reprise his role as Simon Bassett, aka the Duke of Hastings, in the second season of Bridgerton.",
    "For those familiar with Julia Quinn’s Bridgerton novels that the show is based on, this might not have come as much of a surprise: each book in the saga follows a different Bridgerton sibling and Simon’s arc was over with his wedding to Daphne is the first book, The Duke and I.",
    "But the news was pretty surprising for fans of the show, especially since they expected Simon to help his best friend Anthony find love in season 2 – the latter informed both Daphne and Simon of his plans of \"finding and promptly declaring my intentions to my new viscountess\" in the last episode of season 1, after Siena moved on with another man.",
    "Responding to news of his departure, Page explained that he only ever signed up for one season and that this limited commitment was something he found appealing from the start: \"It's a one-season arc. It's going to have a beginning, middle, end – give us a year,\" he told Variety of the producers' early conversations with him. \"[I thought] 'That's interesting,' because then it felt like a limited series. I get to come in, I get to contribute my bit and then the Bridgerton family rolls on.\"",
    "That said, according to The Hollywood Reporter, Page turned down a five-episode deal for Bridgerton season 2, with a reported rate of $50,000 per episode to focus on his growing film career.",
    "In the announcement of Page’s departure, the show assured fans that this would not erase his character from the show’s world and added that: “Daphne will remain a devoted wife and sister, helping her brother navigate the upcoming social season and what it has to offer.” Still, that won't come as much comfort to fans of the actor.",
    "Potential spoilers for Bridgerton season 2 follow, as we explore how the books might correspond to the shows.",
    "The Netflix series seems likely to follow the same structure of the Bridgerton series of novels, with each season taking on one book. Book two, The Viscount Who Loved Me, is all about Antony’s pursuit of a wife, as mentioned.",
    "Season 2 will therefore see Anthony become betrothed to Mary's youngest daughter Edwina, but in the run-up to the wedding, the eldest Bridgerton will find himself inexplicably drawn to Edwina's older sister, Kate.",
    "Bailey spoke about his hopes for his character to Decider back in 2020, saying: “I think if everyone can find their Kate, then they’re very lucky. So, yeah, I’m excited for Anthony. I really care for him. If I get to fall in love vicariously through him, with an amazing actress who’s playing Kate, then that’s going to be amazing. I just want him to be okay. I want to see him smile. And I want to see him dance. Because he deserves the happiness afforded to other characters much earlier in their lives.”",
    "Bailey also spoke to Entertainment Weekly about what Kate will bring to the show: “I hope that he meets someone who is as opinionated and offended by Anthony as we all are. She hopefully will be the voice of the audience and then they'll work something out together.”",
    "As far as the other Bridgertons are concerned, Eloise will make her debut into society now that her older sister Daphne has been married off. But it’s unlikely to be smooth sailing, as her mother would hope. \"She's going to shake things up and basically take the piss out of it,\" Eloise star Claudia Jessie told Harper's Bazaar. \"I'm excited for that. But I would really love to see Eloise just really own every space she's in.” It should help that she's free of the shadow of her perfect older sister.",
    "Her character will also have to come to terms with her best friend Penelope being Lady Whistledown, and we’re wondering how she’ll take the news. “I just can’t imagine what that is going to be like. That's such a shock to a friendship,” continued Jessie. “You have this woman, this character, this mysterious scribbler that Eloise is basically a bit in love with, and kinda wants to be her best mate, has been lying to her, writing about her family, and causing scandals. To me, that's the most compelling thing in the world.”",
    "This should be the foundation for plenty of drama in Bridgerton season 2.",
    "In April 2021, it was confirmed that Bridgerton had been commissioned by Netflix for a third and fourth season. If it were to continue at the same pace as the novels, Bridgerton season 3 will focus on Benedict and his Cinderella story with the bewitching Sophie Beckett, an earl’s daughter relegated to the role of a servant by her stepmother. Meanwhile Bridgerton season 4 (presumably based on book four, Romancing Mister Bridgerton), is all about Penelope and Colin.",
    "Chatting to Digital Spy about his intentions for the future of the show before the announcement, series creator Chris Van Dusen said: \"The bedrock of the first season is really Simon and Daphne's love story. We focus on the eldest Bridgerton daughter Daphne. But we know there are eight Bridgerton books or eight Bridgerton siblings, and I would love to be able to explore love stories and romance for all of them.\"",
    "Clearly, Netflix has no intentions of letting this show go anywhere – eight seasons doesn't seem unlikely at this stage."
  ],
  "headers": {
    "3": "Bridgerton season 2 release date: 2022",
    "6": "Bridgerton season 2 trailer: first look at the show's return",
    "7": "Bridgerton season 2 cast: who's expected to return?",
    "11": "Bridgerton season 2 won't feature Regé-Jean Page",
    "17": "Bridgerton season 2 story: what we can guess based on the books",
    "25": "Bridgerton seasons 3 and 4 have already been confirmed by Netflix"
  },
  "links": {
    "best Netflix shows": "https://www.techradar.com/best/best-netflix-shows",
    "Sex Education": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "Deadline": "https://deadline.com/2021/02/bridgerton-simone-ashley-cast-female-lead-season-2-kate-sharma-sheffield-netflix-shondaland-anthony-1234693368/",
    "Netflix announced on Twitter": "https://twitter.com/bridgerton/status/1378015697238908929",
    "his departure": "https://twitter.com/regejean/status/1378021879768735751",
    "he told Variety": "https://variety.com/2021/tv/news/rege-jean-page-bridgerton-season-2-1234942827/",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/live-feed/inside-rege-jean-pages-bridgerton-departure",
    "Decider": "https://decider.com/2020/12/30/bridgerton-jonathan-bailey-interview-anthony/",
    "Entertainment Weekly": "https://ew.com/tv/bridgerton-star-jonathan-bailey-teases-whats-to-come-in-season-2/",
    "Harper's Bazaar": "https://www.harpersbazaar.com/culture/film-tv/a35325503/claudia-jessie-eloise-bridgerton-interview/",
    "Digital Spy": "https://www.digitalspy.com/tv/a35028380/bridgerton-season-2-netflix-release-date/"
  }
}