{
  "source": "https://www.techradar.com/news/worlds-most-advanced-weather-supercomputer-will-help-predict-natural-disasters",
  "title": "World's most advanced weather supercomputer will help predict natural disasters",
  "category": "computing",
  "updated": "2021-04-22T14:13:57Z",
  "author": "joel-khalili",
  "summary": "Supercomputer will help refine weather forecasts and predict extreme storms",
  "article": [
    "The UK Meteorological Office has announced a new deal with Microsoft to build the world’s “most advanced” weather and climate supercomputer.",
    "According to a Microsoft blog post, the new supercomputer will help improve the accuracy of everyday weather forecasting, but also provide advanced warning of extreme weather events.",
    "The Met Office will also utilize additional computing resources for more advanced climate change modelling, which will inform UK government policy in its quest to reach “net zero” by 2050.",
    "Once up and running, the supercomputer is expected to fall within the top 25 most powerful in the world and will outstrip the next most powerful supercomputer in the UK by a factor of two.",
    "Situated in the south of England, the new supercomputer will be built using the $1.67 billion in government funding announced last year. It will leverage a combination of technologies, including HPE Cray EX supercomputers, high-performance data archive systems from Microsoft and other Azure cloud technologies.",
    "In line with the UK’s environmental commitments, the new supercomputer will also be powered entirely by renewable energy and optimized for efficient energy usage.",
    "“We are delighted to be working in collaboration with Microsoft to deliver our next supercomputing capability,” said Penny Endersby, Chief Executive at the Met Office. “Working together, we will provide the highest quality weather and climate datasets and ever more accurate forecasts that enable decisions to allow people to stay safe.”",
    "This sentiment was echoed by Clare Barclay, CEO at Microsoft UK, who said: “To make progress with the ecological challenges we face requires innovation, technology and partnerships.”",
    "“The potential of the deep expertise, data gathering capacity and historical archive of the Met Office, combined with the sheer scale and power of supercomputing on Microsoft Azure will mean we can improve forecasting, help tackle climate change and ensure the UK remains at the forefront of climate science for decades to come.”",
    "The new capabilities are expected to directly benefit a wide range of associated industries, such as aviation, while other businesses will be able to build new services on top of the newly available climate data.",
    "Assuming there are no delays, the Met Office will spin up the new supercomputer in the summer of 2022."
  ],
  "headers": {
    "4": "Climate supercomputer"
  },
  "links": {
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-6221504520291526000&murl=https%3A%2F%2Fnews.microsoft.com%2Fen-gb%2F2021%2F04%2F22%2Fmet-office-and-microsoft-join-forces-to-build-worlds-most-powerful-weather-and-climate-forecasting-supercomputer-in-uk%2F",
    "$1.67 billion in government funding": "https://www.techradar.com/news/uk-met-office-to-spend-pound12bn-on-worlds-most-powerful-weather-computer"
  }
}