{
  "source": "https://www.techradar.com/news/joker-is-getting-a-sequel-but-does-it-need-one",
  "title": "Joker is getting a sequel - but does it really need one?",
  "category": "entertainment",
  "updated": "2021-05-28T08:51:11Z",
  "author": "tom-power",
  "summary": "Joker 2 would have Warner Bros. laughing all the way to the bank",
  "article": [
    "Joker, Warner Bros' spin-off movie of the legendary DC supervillain, wowed fans and critics alike upon its October 2019 release.",
    "Not only did it scoop up numerous gongs during the 2020 awards circuit, it became the most profitable comic book movie of all-time and the first R-rated film to surpass $1 billion at the box office.",
    "Given its mammoth success at the box office, it isn't surprising that talk of a sequel has been on and off for the past 18 months. Now, though, it appears that Joker 2 might be closer to becoming a reality than we initially thought.",
    "According to The Hollywood Reporter, Joker director Todd Phillips is already in the planning stage for Joker 2.",
    "The news surprisingly comes by way of a recent THR article on Hollywood's top 100 lawyers. In a blink-and-you'll-miss-it section on attorney Warren Dern, THR claims that Phillips (one of Dern's clients) has \"struck a deal to co-write the next Joker installment.\"",
    "While this isn't official confirmation about a Joker sequel, it's the biggest hint yet that we may soon see Joaquin Phoenix reprise his role as Arthur Fleck and his seeming alter-ego Joker.",
    "Spoilers follow for Joker.",
    "No, but you can understand why a sequel is likely getting made.",
    "Joker was a gripping and powerful examination of mental illness, poverty, broken societal systems and class divide, and it ended in such a way that it was left up to viewers' interpretation about what its final scene truly meant for Fleck moving forward.",
    "If a Joker sequel does happen, though, it'll detract from each audience member's own opinion on what happens to Fleck.",
    "As we know, Fleck murders talk show host Murray Franklin live on TV - a move that results in an uprising on the streets of Gotham and incites riots across the city - and leads to his imprisonment in a mental institution. However, he bolts from a psychotherapy session at the movie's end, and it's unclear whether he actually escapes the asylum to rein terror on Gotham again.",
    "Of course, there are all manner of directions that a sequel could go (Phoenix admitted as much to IGN back in 2019) but, from a plot standpoint, Joker had a satisfying conclusion in spite of its ambiguity.",
    "The fact remains, though, that Joker was a huge money spinner for Warner Bros.",
    "Even though it took less than $70 million to make (some reports suggested it cost as little as $55 million), Joker resonated with critics and the general public alike. It outperformed all but five other movies at the global box office in 2019 and, if you're Warner Bros, you simply don't walk away from the prospect of greenlighting a sequel to such a high grossing movie.",
    "Yes, there's no guarantee that Joker 2 would perform as well, if not better, than its predecessor. If Phillips can keep the movie's potential production budget under $100 million again, though, Warner Bros. would almost certainly be onto another monetary winner at the global box office with Joker 2.",
    "All of this is dependent on whether Phillips can draft the right script for a sequel, and if Phoenix is happy (or free) to reprise his role. Should the stars align, though, we can expect Joker 2 to become a reality in the not too distant future."
  ],
  "headers": {
    "6": "Analysis: is Joker 2 really necessary?"
  },
  "links": {
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/lists/hollywood-most-powerful-lawyers-2021/warren-dern-9/",
    "IGN": "https://www.ign.com/articles/2019/10/07/joker-joaquin-phoenix-open-to-a-sequel",
    "less than $70 million": "https://deadline.com/2019/10/joker-box-office-opening-weekend-1202752002/",
    "$55 million": "https://www.hollywoodreporter.com/movies/movie-news/joker-batman-suicide-squad-movie-plans-making-sense-dcs-moves-1119489/",
    "draft the right script": "https://www.ign.com/articles/2019/11/15/joker-director-will-only-make-a-sequel-if-it-has-thematic-resonance",
    "reprise his role": "https://www.ign.com/articles/2019/08/21/joker-director-talks-potential-sequel-with-joaquin-phoenix-reprising-his-titular-role"
  }
}