{
  "source": "https://www.techradar.com/news/the-oppo-band-fitness-tracker-could-get-a-global-launch-soon",
  "title": "The Oppo Band fitness tracker could get a global launch soon",
  "category": "wearables",
  "updated": "2021-01-19T09:21:20Z",
  "author": "tom-bedford",
  "summary": "After a China-only launch in 2020",
  "article": [
    "The Oppo Band was unveiled in June 2020, but it only got a release in China - however, it looks like that could be about to change with a possible global launch on the horizon.",
    "This comes from tech site GizmoChina, which spotted certification via the European Economic Community for a product called the 'Oppo Band'. Now why would Oppo get certification in Europe, unless it was planning to launch its band there imminently?",
    "Even if the Oppo Band does get a European or global launch soon, it's not certain this will be the same Oppo Band that hit Chinese store shelves in 2020. Three different versions of the band launched then, and this new version could be one of those or an improved version.",
    "However, this does make it seem likely that Oppo is launching a fitness tracker globally pretty soon.",
    "The original Oppo Band had a 1.1-inch screen, 12 sports tracking modes, and a 14-day battery life. It cost CNY199 (around $30, £22, AU$40), and that price rose a touch for its other versions, the Oppo Band Fashion and Oppo Band Eva, which mainly had design changes.",
    "As previously said, the global Oppo Band could be different, and we'll have to wait to find out.",
    "If the Oppo Band launched in other markets it'd join a long tradition of affordable fitness trackers by phone brands, like the Honor Band 6, Huawei Band 3 Pro, Samsung Galaxy Fit 2, Realme Band and OnePlus Band, among others.",
    "That latter tracker, the OnePlus Band, could end up being the biggest competitor to the Oppo Band, as it's basically the same thing. OnePlus and Oppo are owned by the same parent company and often share tech, and their fitness trackers are almost indistinguishable.",
    "The OnePlus Band is out in China right now pending a global launch, so it's likely a race between the two companies to get trackers on store shelves around the rest of the world. When the Oppo Band does get launched for a global market, we'll be sure to test it out so you can see how it runs.",
    "Via PocketNow"
  ],
  "headers": {
    "4": "What is the Oppo Band?"
  },
  "links": {
    "GizmoChina": "https://www.gizmochina.com/2021/01/18/oppo-band-finally-coming-to-global-markets-as-it-receives-eec-certification/",
    "Honor Band 6": "https://www.techradar.com/reviews/honor-band-6",
    "Huawei Band 3 Pro": "https://www.techradar.com/reviews/huawei-band-3-pro-review",
    "Samsung Galaxy Fit 2": "https://www.techradar.com/reviews/samsung-galaxy-fit-2",
    "OnePlus Band": "https://www.techradar.com/reviews/oneplus-band",
    "PocketNow": "https://pocketnow.com/oppo-band-could-go-global-soon-hints-eec-certification"
  }
}