{
  "source": "https://www.techradar.com/news/this-is-your-first-look-at-the-rolls-royce-spectre-the-super-luxury-electric-car",
  "title": "This is your first look at the Rolls-Royce Spectre, the super luxury electric car",
  "category": "car-tech",
  "updated": "2021-09-29T16:27:39Z",
  "author": "richard-shrubb",
  "summary": "Begins road testing ahead of launch in late 2023",
  "article": [
    "A byword for the most luxurious cars on the planet, Rolls-Royce has announced it has begun road testing its first fully electric car, the Rolls-Royce Spectre.",
    "It's been redesigned from the ground up, to ensure this Rolls-Royce will be the best EV on the road in the eyes of its core, high net worth customers.",
    "Based on the aluminum spaceframe that was first revealed in the 2017 Phantom, the Spectre is expected to go on sale in the fourth quarter of 2023.",
    "The spaceframe was designed for electric as well as internal combustion engines, and the Spectre amounts to an evolution from the current high status cars.",
    "Torsten Müller-Ötvös, Rolls Royce's CEO, didn't reveal much about the powertrain or electronics in the new car. He explained that this is a development of the BMW-owned marque's research over the last 10 or so years since the 102EX electric concept was launched in 2011 and then the 103EX EV concept in 2016.",
    "Like it or not, Rolls-Royce isn-t the independent British firm of yesteryear, so is likely using the German firm's drive and battery technology. It may well have a similar powertrain to the 600bhp twin motor that is going into the BMW iX M60.",
    "Rolls-Royce has begun openly testing the cars on the world's roads. As per the exacting demands of its customers, the marque is to drive the cars more than 2.5 million kilometres (1.55 million miles), which Müller-Ötvös says equates to more than \"400 years of use\" for the average Rolls Royce car.",
    "Unlike many of the firm's rivals the road testing is to be unhidden and the CEO says, \"You will see these test cars on roads, around the world. Look out for them – they will be in plain sight. They will be tested in all conditions and over all terrains.\"",
    "Rolls-Royce cars aren't known for their high speed and sportiness, but more for their refined elegance and quality. This is one of the reasons the UK Royal Family uses them for official engagements.",
    "Even with internal combustion engines they are known for their quietness and comfort - almost perfect for an EV today.",
    "Müller-Ötvös said that the company had been considering EVs for over a hundred years.",
    "In 1900 Charles Rolls said, \"The electric car is perfectly noiseless and clean. There is no smell or vibration, and they should become very useful when fixed charging stations can be arranged.",
    "\"But for now, I do not anticipate that they will be very serviceable – at least for many years to come.\"",
    "That time, it seems, has come thanks to the growing public infrastructure and technology the namesake of Rolls Royce talked about, over 120 years later."
  ],
  "headers": {
    "8": "The time has come for Rolls-Royce to go EV"
  },
  "links": {}
}