{
  "source": "https://www.techradar.com/news/facebook-launches-person-to-person-payments-just-like-venmo",
  "title": "Facebook takes on Venmo with new person-to-person payments",
  "category": "computing",
  "updated": "2021-06-11T12:31:20Z",
  "author": "rob-clymo",
  "summary": "Messenger users can send or receive money with a unique QR code",
  "article": [
    "Messenger users will soon be able to paying another person with Venmo-esque QR codes using Facebook Pay and they don't even have to be Facebook friends in order to do it.",
    "Facebook had previously revealed it was testing the use of QR codes for person-to-person payments inside Messenger, and from today US users will now be able to send or request money this way.",
    "Users can access the feature in the Facebook Pay section in Messenger’s settings. After tapping on your profile icon you’ll be able to use a personalized QR code. The code will feature your profile icon in the center of it and, underneath, there’ll be your personal Facebook Pay ‘https://m.me/pay/UserName’ URL. Usefully, this can also be copied and sent to other users if you’re seeking a payment from them.",
    "Facebook said in a blog post the greatest benefit of the new system is ultimately the convenience factor, claiming that the codes work seamlessly between any US Messenger users. There’s no need for additional software or payment apps while the functionality also removes the need for any contact entry or uploading in order to begin the process.",
    "Users wanting to send or receive money via Messenger will need to be at 18 yearsold and in possession of a Visa or Mastercard debit card. Alternatively, they can have an active PayPal account, a supported prepay card or a government-issued card. The currency setting also needs to be set to US dollars from inside the app.",
    "Following the initial setup procedure you’ll be able to set your preferred payment method as a default option. Payments can be additionally protected using your own unique PIN code. The QR code feature can also be accessed via the Facebook Pay area of the main Facebook app, and is located in the carousel at the top of the screen.",
    "Although Facebook Pay has been around since the end of 2019 many users appear to bypass it in favor of apps like the PayPal-owned Venmo, which already offers person-to-person QR code payments. However, the new feature might appeal to users in the US even though Facebook hasn't given an indication when, or if, it might be rolled out to other markets. It joins Facebook’s cryptocurrency wallet Novi in a bid by the social media giant to expand its reach with a range of financial products and services."
  ],
  "headers": {
    "4": "Facebook Messenger"
  },
  "links": {
    "QR codes": "https://www.techradar.com/news/paypal-rolls-out-qr-code-payments-for-a-touch-free-way-to-buy-and-sell-in-person",
    "Facebook Pay": "https://www.techradar.com/news/facebook-is-making-another-big-push-for-your-wallet",
    "person-to-person payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "blog post": "https://about.fb.com/news/2021/06/more-new-features-coming-to-messenger/",
    "payment apps": "https://www.techradar.com/best/best-money-transfer-apps",
    "PayPal account": "https://www.techradar.com/news/internet/10-paypal-tips-and-tricks-1032142",
    "Facebook app": "https://www.techradar.com/news/facebook-adds-new-shop-feature-to-its-app",
    "Venmo": "https://www.techradar.com/reviews/venmo"
  }
}