{
  "source": "https://www.techradar.com/news/amd-threadripper-5000-cpus-might-not-be-arriving-until-august",
  "title": "AMD Threadripper 5000 CPUs might not be arriving until August",
  "category": "computing",
  "updated": "2021-04-06T09:44:22Z",
  "author": "carly-page",
  "summary": "Rumor claims a launch is still some way off",
  "article": [
    "AMD is reportedly gearing up to launch its next-generation Ryzen Threadripper 5000 CPUs in August.",
    "AMD's Zen 3 architecture can already be found in desktop PCs, laptops and servers, but it has yet to make its way to the high-end desktop (HEDT) market. That looks set to change in a few month’s time, as new rumors suggest AMD’s Zen 3-based Threadripper 5000 CPUs will debut in August.",
    "Leaker KittyYYuko, who has a known track record when it comes to AMD leaks, has said on Twitter: “In August AMD will release a new generation ThreadRipper processor”.",
    "This is the first rumored launch date we’ve heard for Threadripper 5000. However, with AMD yet to confirm any official launch plans for its next-gen HEDT processors, this leak should be taken with a pinch of salt.",
    "Still, adding weight to the rumor, HWInfo recently received an update which said that the software will now be able to detect next-generation AMD Threadripper, which suggests that an official launch is likely to happen sooner rather than later.",
    "AMD’s Ryzen Threadripper 5000 series, codenamed “Chagall”, is expected to retain the 64-core, 128-thread design as AMD's current Zen 2-based Threadripper 3000 lineup - although early rumors suggested the CPUs could return to the same 16-core design as the first generation.",
    "The CPUs are also expected to offer a major IPC uplift thanks to the Zen 3 architecture, alongside higher clock speeds and improved efficiency.",
    "AMD Threadripper 5000 processors will also be compatible with existing TRX40 motherboards, according to speculation, with rumors suggesting that the CPUs will be the last for the SP3 socket before AMD moves to its new platform offering DDR5 and PCIe 5.0 support.",
    "Via: Videocardz"
  ],
  "headers": {},
  "links": {
    "Zen 3": "https://www.techradar.com/news/amd-zen-3",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "KittyYYuko": "https://twitter.com/KittyYYuko/status/1378607922763026436",
    "recently received": "https://www.guru3d.com/news-story/new-threadripper-cpus-start-to-be-mentioned-in-software.html",
    "early rumors suggested the CPUs could return to the same 16-core design as the first generation": "https://www.techradar.com/news/amds-new-ryzen-zen-3-threadripper-5000-processor-could-disappoint-some-people",
    "Videocardz": "https://videocardz.com/newz/amd-rumored-to-launch-zen3-based-ryzen-threadripper-5000-chagall-in-august"
  }
}