{
  "source": "https://www.techradar.com/news/hypermotion-technology-in-fifa-22-sounds-like-a-game-changer-but-what-is-it",
  "title": "HyperMotion technology in FIFA 22 sounds like a game changer – but what is it?",
  "category": "gaming",
  "updated": "2021-07-12T11:28:23Z",
  "author": "adam-vjestica",
  "summary": "11v11 match capture could be transformative for FIFA 22",
  "article": [
    "FIFA 22 will feature an all-new technology dubbed ‘HyperMotion’ that promises to overhaul the game’s animation system, AI, and aerial duels – and it’s only available on PS5, Xbox Series X/S and Stadia.",
    "HyperMotion is a new gameplay technology that promises to revolutionize FIFA 22. It uses a combination of real-time motion capture, as 22 professional footballers took to the pitch wearing Xsens suits that allowed EA to record an “unprecedented volume of high-quality real-human movement data”, which powers how both individual players and teams move across FIFA 22.",
    "FIFA 22 then uses “a cutting-edge proprietary machine learning algorithm” which learns from over 8.7 million frames of capture footage, and creates new animations in real time to create “organic football realism”, according to EA’s website.",
    "That’s not all, though. The combination of HyperMotion and Xsens suit recordings mean FIFA 22 will feature over 4,000 new animations, which should result in a more responsive and physical-feeling experience when playing.",
    "These fancy new additions are only available on next-gen consoles and Stadia, as EA claims that the power of the new systems allows more tactical AI, which means attackers can make “up to 6x more decisions per second” – while the defensive AI has been rewritten so that teams act more as a unit, and even retain their shape when moving across the pitch.",
    "FIFA 22’s should also significantly affect aerial duels, make controlling the ball more natural and fluid and add another layer of humanization to FIFA 22’s players, with more ambient behavior being visible during matches.",
    "FIFA 22’s HyperMotion technology sounds mighty impressive, then, but we’ve seen these types of grand promises before. EA Sports has a habit of using impressive sounding buzzwords to hype up its releases, but the prospect of machine-learning and real professionals wearing Xsens suits has a lot of potential.",
    "Unfortunately for last-gen console owners, EA Sports has confirmed that FIFA 22 won’t receive a free next-gen upgrade if they buy the standard edition of the game. Only the Ultimate Edition, which costs $99.99 / £89.99, comes with Dual Entitlement.",
    "As found on EA’s website (thanks, VGC): “Dual Entitlement is only available with the purchase of the FIFA 22 Ultimate Edition. The Standard Edition of FIFA 22 does not include Dual Entitlement,” it explains.",
    "“That means if you purchase FIFA 22 Standard Edition on PS4 and upgrade to PS5 later, you would need to purchase the PS5 version of the game to play.”",
    "FIFA 22 will be released on October 1, 2021 for PS4, PS5, Xbox One, Xbox Series X, Xbox Series S, Stadia and PC."
  ],
  "headers": {
    "6": "Eat my goal"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Stadia": "https://www.techradar.com/reviews/google-stadia",
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "EA’s website": "https://www.ea.com/en-gb/games/fifa/fifa-22/news/fifa-22-dual-entitlement-faq",
    "VGC": "https://www.videogameschronicle.com/news/fifa-22s-standard-edition-doesnt-come-with-a-free-next-gen-upgrade/",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}