{
  "source": "https://www.techradar.com/news/allbirds-launches-its-first-eco-friendly-trail-running-shoe",
  "title": "Allbirds launches its first eco-friendly trail running shoe",
  "category": "fitness",
  "updated": "2021-10-14T08:00:00Z",
  "author": "cat-ellis",
  "summary": "Keeping your feet dry and secure the natural way",
  "article": [
    "Allbirds – maker of eco-friendly sneakers – has released its first trail running shoe The Allbirds Trail Runner SWT (which stands for 'sugar, wool, 'tree') is suitable for muddy and rocky routes, with an extra durable design to keep your feet dry and well protected.",
    "Whereas most Allbirds shoes have an upper made entirely from ZQ certified merino wool, the Trail Runner SWT also includes recycled polyester for increased durability. The inner sock is made from FSC certified eucalyptus tree fiber combined with more merino wool, with an ankle collar that fits snugly to keep out stones and mud.",
    "The upper has a flat knit to help slow ingress of water and dirt, and the exterior yarn is treated with a fluorine-free water repellent coating (much like Allbirds' water-resistant Mizzles shoes).",
    "We're starting to see a real boom in eco-friendly running shoes, with brands including Reebok and Brooks cutting down their use of virgin plastics, reducing and offsetting carbon emissions, and digging into their supply chains to make sure workers are treated more fairly.",
    "At the moment, however, the vast majority of these are road shoes. If you enjoy exploring off the beaten track, you'll have a much more limited choice - which is a shame since trail runners are particularly likely to appreciate and want to protect the natural world.",
    "The Trail Runner SWT is available today direct from Allbirds, and costs $138 / £128 / AU$225. It's available in US men's sizes 7-14, and women's sizes 5-11 (both of which include half sizes).",
    "We're hoping to test the Allbirds Trail Runner SWT soon, and will bring you a full review when we do."
  ],
  "headers": {
    "3": "Greener running"
  },
  "links": {
    "ZQ certified": "https://www.discoverzq.com/",
    "FSC certified": "https://www.fsc-uk.org/",
    "eco-friendly running shoes": "https://www.techradar.com/best/the-best-eco-friendly-running-shoes"
  }
}