{
  "source": "https://www.techradar.com/news/microsoft-edge-will-now-make-it-easier-to-save-pages-as-a-pdf",
  "title": "Microsoft Edge will now make it easier to save pages as a PDF",
  "category": "computing",
  "updated": "2021-08-06T23:30:48Z",
  "author": "anthony-spadafora",
  "summary": "Save as PDF feature will soon be available in Edge's Context Menu",
  "article": [
    "Saving web pages as PDFs will soon be even easier in Microsoft Edge as the company is working on adding a new option to the settings menu of its browser.",
    "As reported by MSpoweruser and first spotted by Leo Verla, a new option is coming to Edge's settings menu that will enable users to add “Save as PDF” to the browser's Context Menu.",
    "While the content of webpages can change frequently, saving them as PDF files can be a great way to keep a copy of an article or blog post for research purposes.",
    "In a recent post on Reddit, Leo Verla showed some screenshots of Edge's new “Save as PDF” feature and explained that Microsoft has also brought back the “mini-menu and the built-in dictionary” to insider versions of its browser.",
    "Being able to right click to save web pages as a PDF will likely save Edge users a lot of time as they previously had to use the keyboard shortcut Ctrl + P to bring up the browser's print menu and choose “Microsoft Print to PDF” to do so.",
    "While this new feature is currently available in Edge Canary Build 94.0.974.0 as part of a controlled feature rollout, it should arrive in stable versions of Microsoft's browser in the next several months.",
    "Via MSpoweruser"
  ],
  "headers": {
    "3": "Save as PDF"
  },
  "links": {
    "PDFs": "https://www.techradar.com/news/using-pdfs-online-is-about-to-get-more-interactive-than-ever",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "reported": "https://mspoweruser.com/microsoft-adds-new-option-to-right-click-menu-in-edge/",
    "Leo Verla": "https://www.techradar.com/news/microsoft-edge-makes-it-easier-to-keep-work-and-home-browsing-separate",
    "recent post": "https://www.reddit.com/r/MicrosoftEdge/comments/oysna4/in_edge_canary_it_is_now_easier_and_faster_to/?context=3",
    "MSpoweruser": "https://mspoweruser.com/microsoft-adds-new-option-to-right-click-menu-in-edge/"
  }
}