{
  "source": "https://www.techradar.com/news/android-12-is-bringing-some-important-security-features",
  "title": "Android 12 is bringing some important security features",
  "category": "phones",
  "updated": "2021-02-19T20:12:31Z",
  "author": "anthony-spadafora",
  "summary": "Protecting your privacy will be one of the main reasons to upgrade",
  "article": [
    "Google is doubling down on security and privacy enhancements in Android 12 and when the next version of its mobile operating system launches this fall, users will be able to manually block access to some of the hardware sensors on their devices.",
    "As reported by 9To5Google, the latest version of Android includes a pair of new toggles that will allow users to prevent apps from accessing their smartphone's microphone and camera.",
    "The inclusion of these new toggles comes at a time when users have grown more concerned about their privacy and the fact that hackers could use the cameras, microphones and other sensors found on their devices to spy on them. This is why aftermarket webcam covers have become so popular for laptops and Lenovo has started adding its ThinkShutter automatic webcam cover to more of its devices.",
    "With the launch of Android 12, users will be able to quickly turn off access to their microphone and camera right from the operating system's Quick Settings menu which can be accessed by swiping down from the notifications menu.",
    "Once enabled, these toggles will appear in the quick settings menu as icons that read “Block Camera” and “Mute Microphone”. When tapped, these toggles will entirely shut off access to either your device's camera or microphone.",
    "During its tests, 9To5Google found that Android 12's privacy toggles are not currently working with either system apps or third-party apps. For instance, with the “Block Camera” toggle active, the news outlet was still able to use their device's native camera app and this was also the case when it tired to use the viewfinders in Instagram and Twitter. However, at least with those two third-party apps, a system prompt did appear saying they had to turn on the camera though it was still active in the background on the developer preview of Android 12 in testing.",
    "We'll likely hear more about the security and privacy enhancements that will be included in Android 12 once Google begins preparing for its official rollout which will likely happen in September of this year.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "Privacy toggles"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "9To5Google": "https://9to5google.com/2021/02/18/android-12-privacy-toggles/",
    "spy on them": "https://www.techradar.com/news/are-our-phones-listening-to-us",
    "webcam covers": "https://www.techradar.com/news/macbook-display-could-be-cracked-by-camera-cover-apple-warns",
    "ThinkShutter": "https://www.techradar.com/news/lenovo-unveils-suave-new-range-of-thinkbook-laptops",
    "Quick Settings menu": "https://www.techradar.com/how-to/how-to-screenshot-on-android-a-guide-on-taking-a-screenshot-on-an-android-phone",
    "Instagram": "https://www.techradar.com/news/instagram-messages-are-coming-to-messenger-api-and-businesses-should-be-jazzed",
    "Twitter": "https://www.techradar.com/news/twitter-is-moving-more-of-its-platform-on-to-google-cloud",
    "9to5Google": "https://9to5google.com/2021/02/18/android-12-privacy-toggles/"
  }
}