{
  "source": "https://www.techradar.com/news/how-to-take-professional-food-photos-with-your-iphone-or-android-phone",
  "title": "How to take professional food photos with your iPhone or Android phone",
  "category": "cameras",
  "updated": "2021-08-20T09:20:58Z",
  "author": "mark-wilson",
  "summary": "Pros give us their top tips for culinary composition",
  "article": [
    "Food photography sounds like it should be a doddle, but producing shots with a professional sheen is a big challenge – particularly if all you have to work with is a smartphone and available light. But a few simple tricks can help you create mouth-watering images – and we've asked two professional photographers to reveal what those secret ingredients are.",
    "Using a smartphone to take photos of food is nothing new, and when you think about it, it makes a lot of sense. You’ll generally always have your phone with you, so if something particularly photogenic comes out of the kitchen, you’ll be ready to go.",
    "There are other reasons why smartphones are good for food, too. Because smartphones are small and thin, you can get close to the food for the best creative angles, which might not always be possible with conventional cameras. Most smartphones these days have modes such as ‘Portrait’ which you can use to create shallow depth-of-field effects, while multiple lenses can also be used for different compositions.",
    "With all of this in mind, we asked a couple of pro snappers to supply their secrets for getting fantastic food shots. Our professionals use both Android and iOS, so you should find that all of the tips here apply to whatever model of phone you have.",
    "Professional photographer Tim Clinch has been taking pictures for a living for a long time. Roughly 18 months ago, he completed his first ever professional shoot entirely using an iPhone, producing the images for a new website of his client, Cardenal Mendoza Brandy. He says that he showed the client comparable DSLR images, but the client preferred the iPhone images.",
    "One of his biggest tips is also one of his simplest. “Far and away the biggest problem I see when watching people with smartphones – especially the larger models – is what I call the ‘new phone flop’,\" he says. \"Basically – hold it upright! It is so easy to let the top of your phone lean forward, which makes all your verticals go to pot,\" he adds.",
    "\"Sometimes, I will make sure the phone is upright by having someone stand at the side, telling me when my phone is straight – it’s a very different discipline to shooting with a standard camera\" he says.",
    "Although black and white has its place in food photography, a bold use of color will make your food images stand out from the crowd.",
    "Look for vibrant colors when choosing potential subjects, remembering that not all colors will photograph as beautifully on a phone as they look in real life. Browns and beiges can tend to look a little less appetizing, while bright greens, yellows and reds usually look great.",
    "It also pays to shoot in the best light you possibly can, avoiding artificial and low-light to give your phone’s sensor the best chance of reproducing the best detail possible.",
    "If you’re photographing food inside your house, try moving close to a window to make use of natural light coming in from outside for the best results. These photos taken by Tim Clinch show that the best way to add impact to your food photography is through the use of color, which smartphones are more at home with.",
    "Most smartphones have a Portrait mode. Sometimes it may be called something else, such as Aperture or Live Focus. You’re looking for the mode which creates shallow depth-of-field effects, which will help give your shots a professional edge.",
    "This works particularly well when the outline of your subject is clear or well-defined, so you should pay attention to those times when it might not be so effective.",
    "\"The ‘portrait mode’ is a very useful tool in your armory, but beware when shooting subjects such as glasses,\" he says. \"Often, it cannot handle the edge of the glass and you end up with a strange ‘ghosting’ around the rims and often the glass can simply disappear.\"",
    "Kratia Garwal, a professional photographer and content creator based in the Netherlands, often uses her phone for food shoots. As well as taking photographs, she also runs food photography workshops to help others improve their own style. You can see more shots on her Instagram page, too.",
    "A quick and simple tip that she often recommends is switching on the grid lines on your phone’s native camera apps. Most smartphones will offer this somewhere in the settings menu. “I keep this feature always on as it helps me to align the horizontals and verticals within my frame and also get my composition right, using the rule of thirds” she says.",
    "If you’re not sure what the rule of thirds is, check out the screenshot above. Placing your subject where the gridlines intersect will usually result in a pleasing composition, but it’s worth experimenting with to see what works.",
    "If you have a smartphone that has a Pro/Advanced mode, you can use it to great effect for food photography. That said, some models – notably the iPhone – don’t give you a whole lot of control over settings, in the same way that a standard camera would do. While this might be good for quick snaps, third-party apps will let you do more.",
    "If you want to regain some of that control, Kratia Garwal recommends Adobe's all-in-one approach. “The Adobe Lightroom mobile app has a fantastic feature where you can photograph directly from the app,\" she says. \"Both Auto and Pro mode options are available, but it’s so convenient to be able to control shutter speed, ISO or white balance before pressing the shutter. It’s something I often recommend to my participants in workshops,” she says.",
    "If you follow lots of foodie accounts on Instagram, it’s likely you’ll already be very familiar with the concept of a ‘flat lay’, whereby you get an overhead view of the subject. They work particularly well with food, and it’s straightforward to create them with a phone since they’re so easy to position and move around the scene.",
    "That said, for the best results, keeping your phone still and in one position is also a fantastic idea. It will also free you up to alter the setup of the flat lay without having to recompose every time you take a shot.",
    "Kratia Garwal uses a phone holder (like the simple Lamicall Gooseneck model above) for top-down shots. She explains, “That way I can set the timer and not press the shutter button myself. It frees up your hands and also helps to avoid any camera shakes, too.”",
    "Editing is an important part of any professional photographer’s workflow, and although most smartphones do a fantastic job of producing excellent shots straight out of camera, some simple tweaks can boost your shots even further.",
    "Both Tim Clinch and Kratia Garwal are big fans of the ever-popular Snapseed app, which is free to download. “Apart from the regular editing features like brightness, shadows and highlights, I always highlight the brush tool within the app,\" Kratia says. \"With this tool you can selectively control brightness, exposure, temperature and saturation. It’s one of my favorite features.”",
    "Although Tim is also an exponent of editing, he says it’s also important to exercise caution. “With all post production, knowing when to stop is far more important than knowing where to start,” he says. “My mantra is: you can never make a bad picture good by using post production, but you can always make a good picture better.”"
  ],
  "headers": {
    "4": "1. Keep it upright",
    "7": "2. Look for color",
    "11": "3. Use Portrait mode (but be careful)",
    "14": "4. Switch on the gridlines",
    "17": "4. Use pro mode or a third-party app",
    "19": "5. Lay it up with a phone holder",
    "22": "6. Garnish with Snapseed"
  },
  "links": {
    "Tim Clinch": "http://www.timclinchphotography.com/",
    "Kratia Garwal": "https://www.kratiagarwal.com/",
    "food photography workshops": "https://www.kratiagarwal.com/workshopsandevents",
    "Instagram page": "https://www.instagram.com/simpleandsustainable/"
  }
}