{
  "source": "https://www.techradar.com/news/the-fitbit-inspire-2-has-returned-to-its-black-friday-30-discount",
  "title": "The Fitbit Inspire 2 has returned to its Black Friday 30% discount",
  "category": "wearables",
  "updated": "2021-12-07T12:43:13Z",
  "author": "jamel-smith",
  "summary": "Black Friday has struck again",
  "article": [
    "We saw great deals on Fitbits during this year's Black Friday sales, and in a great turn of events, the Fitbit Inspire 2 has returned to its Black Friday 30% discount; bringing the price of the device down from $99.95 to $69.95 on Amazon. (Not in the US? Scroll down for deals in your region.)",
    "The Fitbit Inspire 2 impressed us in our review, with its accurate heart rate monitor, simple to use interface and good battery life lets you go up to 10 days without recharging.",
    "Along with these features, the Fitbit Inspire 2 comes with an OLED backlit display and is water-resistant up to 50m - so you can wear it in the shower or go swimming with it. There are 20 exercise modes to choose from when you’re ready to work out, including walking, running, cycling, weightlifting, and even activities like pilates and kickboxing.",
    "This Fitbit also includes sleep tracking, with your stats and activity being presented on the excellent Fitbit app. You get a free one-year subscription to Fitbit Premium as well, so you get extra insight into all of these stats on your phone, plus access to a huge catalog of instructor-led fitness classes.",
    "No matter where you live, you'll find all the lowest prices for the Fitbit Inspire 2 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "More Fitbit Inspire 2 deals"
  },
  "links": {
    "$99.95 to $69.95 on Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFitbit-Inspire-Fitness-Tracker-Included%2Fdp%2FB08DFGC8YG%2Fref%3Dsr_1_4%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3153324096790228000-20"
  }
}