{
  "source": "https://www.techradar.com/news/the-flash-movie-may-have-lost-one-of-its-batman-actors",
  "title": "Flashpoint movie: Here's why this Batman star may not return",
  "category": "entertainment",
  "updated": "2021-03-25T13:45:07Z",
  "author": "tom-power",
  "summary": "Michael Keaton's version might not return after all",
  "article": [
    "The Flash, one of Warner Bros' many upcoming DCEU film projects, has been beset by production issues since it was first announced way back in October 2014. The movie appeared to finally be back on track with some new casting announcements earlier this year, but a new problem has arisen in recent days.",
    "Michael Keaton, who was believed to be reprising his role as Batman, is unsure if he'll be able to appear after all. In a lengthy chat with Deadline, Keaton admitted that his currently packed schedule meant he might be unable to don the cape and cowl for the first time since 1992.",
    "Deadline was quizzing Keaton over his involvement in The Flash movie - a conversation that Keaton initially tried to move on from with little success. Eventually, though, Keaton explained that he hadn't even had a chance to look over the film's final script yet, and seemed to admit that he might not be able to feature at all.",
    "\"To tell you the truth, somewhere on my iPad is an iteration of the whole Flash thing that I haven’t had time (to read) yet,\" Keaton said. \"I called them and said, 'I have to be honest with you. I can’t look at anything right now.' I’m so deep into this thing I’m doing. Also, I’m prepping a thing I’m producing and getting ready to do down the road in the fall that I’ll be in, and I feel responsible to that. So, yeah, there is that. I’m not being cute or coy.\"",
    "We certainly hope so. While Keaton doesn't sound optimistic, he doesn't outright confirm that he's had to walk away from the project. The actor is currently enjoying a career renaissance, so it stands to reason that he'll be inundated with offers from multiple film and TV studios.",
    "We don't know how involved Keaton's Batman would be in The Flash movie, so there's every chance that he would be able to take on a bit-part or cameo role if he was really stretched for time. If his incarnation of the vigilante detective is needed for a bigger role in the flick, however, that's where issues may arise. If Keaton has already signed onto other projects, as he alludes to in his Deadline response, The Flash may suffer another big blow to its production.",
    "As we mentioned, it's been seven years since Warner Bros originally announced that a Flash movie would be coming soon, and we're still waiting for its arrival. The film has gone through five screenwriters and five directors in that time, with IT director Andy Muschietti and Bumblebee scribe Christina Hodson the latest individuals to enter the respective hot seats.",
    "Other problems, such as Billy Crudup - who was set to reprise his role as Barry Allen's dad Henry - leaving due to scheduling conflicts (The Hollywood Reporter) have beset The Flash's production more recently. Meanwhile, Cyborg's removal from the film over Ray Fisher's ongoing feud with Warner Bros' executives (The Wrap), have also compounded matters from a plot perspective.",
    "The Flash film will reportedly incorporate parts of the Flashpoint comic storyline, which is believed to be key to the return of Keaton's Batman alongside Ben Affleck's iteration of the Caped Crusader. If Keaton did walk away, it would complicate matters again and potentially lead to another script redraft to rework the plot in his absence. Hopefully, Keaton's latest comments aren't as serious as they appear to be and his Batman return is still on the cards.",
    "The Flash is currently slated for a November 4, 2022 release. The speedster can currently be seen in Zack Snyder's Justice League, which is available on HBO Max and Sky Cinema."
  ],
  "headers": {
    "4": "Will Michael Keaton's Batman end up in The Flash?"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/03/michael-keaton-batman-the-trial-of-the-chicago-7-ramsey-clark-sag-ensemble-award-record-interview-1234719059/",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/heat-vision/flash-movie-spanish-actress-maribel-verdu-to-play-barry-allens-mother-exclusive",
    "The Wrap": "https://www.thewrap.com/ray-fisher-cyborg-the-flash-role-written-out-of-screenplay-walter-hamada/",
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-1089862356799882600&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-flash-movie-may-have-lost-one-of-its-batman-actors",
    "Sky Cinema": "https://www.awin1.com/awclick.php?awinmid=11005&awinaffid=103504&clickref=trd-us-4367451347337733600&p=https%3A%2F%2Fwww.sky.com%2Ftv%2Fcinema"
  }
}