{
  "source": "https://www.techradar.com/news/samsung-might-be-working-on-a-5g-successor-to-its-weirdest-recent-phone",
  "title": "Samsung might be working on a 5G successor to its weirdest recent phone",
  "category": "phones",
  "updated": "2021-01-21T14:50:23Z",
  "author": "tom-bedford",
  "summary": "And we're not talking about a foldable.",
  "article": [
    "The Samsung Galaxy A80 from 2019 was an interesting experiment from the company, as it had mid-range specs and a pop-up camera segment that spun around to take selfies. It seems like a successor to this smartphone might be on the way.",
    "Apparently Dutch tech website GalaxyClub has received word that a Samsung Galaxy A82 is in the works, though other than it apparently supporting 5G, nothing has been shared about the handset.",
    "We've actually heard of a Galaxy A82 before though - in early 2020, Samsung filed trademarks for its AX2 series of Galaxy phones (the ones launching throughout 2021), and the A82 was on the list.",
    "So it seems the Korean company could indeed be working on a successor to its pop-up-camera phone, though as GalaxyClub points out, a phone developed under the Galaxy A81 name launched as the Galaxy Note 10 Lite. So take this with a pinch of salt for now.",
    "We didn't exactly give the Samsung Galaxy A80 a glowing review, as it had a few issues which stopped us from being able to fully recommend it.",
    "The main problem was the pop-up segment itself. It was slow to use, collected more dust than a vacuum cleaner, and felt frail and shaky both when popped up or resting down - you can read our Galaxy A80 review design section for more detail on these problems.",
    "That's not all though - the phone felt slow to use, was a touch pricier than it should have been, didn't perform well in camera tests, and didn't actually let you use lots of the rear camera's features for taking selfies, nullifying half the reason you'd have a spinning camera.",
    "So if the Samsung Galaxy A82 is indeed another pop-up beast, and not a Lite version of the Samsung Galaxy Note 20, we'd like to see improvements on lots of fronts."
  ],
  "headers": {
    "4": "Big changes are needed"
  },
  "links": {
    "Samsung Galaxy A80": "https://www.techradar.com/reviews/samsung-galaxy-a80-review",
    "GalaxyClub": "https://www.galaxyclub.nl/nieuws/samsung-werkt-aan-galaxy-a82-5g-nieuwe-slide-out-camera-telefoon/",
    "Samsung filed trademarks for its AX2 series of Galaxy phones": "https://www.techradar.com/news/samsung-galaxy-a-series-trademark-reveals-the-names-of-the-2021-handsets",
    "Galaxy Note 10 Lite": "https://www.techradar.com/reviews/galaxy-note-10-lite-review",
    "Galaxy A80 review design section": "https://www.techradar.com/reviews/samsung-galaxy-a80-review#design",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review"
  }
}