{
  "source": "https://www.techradar.com/news/microsoft-under-fire-for-pushing-users-onto-the-saas-bandwagon",
  "title": "Microsoft under fire for pushing users onto the SaaS bandwagon",
  "category": "computing",
  "updated": "2021-07-12T21:58:36Z",
  "author": "anthony-spadafora",
  "summary": "Software giant broke British and European competition laws says reseller",
  "article": [
    "By pushing B2B users away from perpetual licenses in favor of software-as-a-service (SaaS), Microsoft has infringed on the EU constitution as well as an old UK competition law according to a reseller suing the software giant in London's High Court.",
    "As reported by The Register, details regarding the £270m lawsuit brought against the company by ValueLicensing are now in the public domain after Microsoft filed an acknowledgment of service earlier this month.",
    "In its lawsuit, the British reseller alleges that Microsoft's general licensing terms for its B2B software products broke the UK's Competition Act 1998 and two articles of the Treaty on the Functioning of the European Union (TFEU).",
    "ValueLicensing also argues that Microsoft abused its dominant position in the global desktop business to effectively kill off the market for resellable perpetual licenses by using heavily discounted subscription offers to entice B2B users to switch to SaaS.",
    "Only a few years ago, businesses would buy a license from a software maker such as Microsoft to be able to use their software forever. These perpetual licenses could also be bought and sold as standalone, tradeable commodities and this is how ValueLicensing and other resellers made their money.",
    "However, with the move to SaaS and the introduction of Microsoft 365, resellers could no longer sell licenses since users were now paying a subscription fee to use the software giant's products.",
    "Managing director at ValueLicensing provided further insight on how Microsoft has been trying to do away with perpetual licenses to The Register, saying:",
    "“As part of its efforts to convert enterprise customers from perpetual licences to subscriptions... Microsoft has recently shortened the support period for its perpetually licenced products. Office 2019 has only seven years of support in total, and Office 2021 will have five years... Microsoft's breaches of the competition rules arise from its sustained – and ongoing – campaign to stifle the sale of pre-owned licences for Microsoft software in the UK and EEA.”",
    "Microsoft is currently preparing a challenge to the High Court's jurisdiction to hear the case and as it stands now, the case won't likely be heard until early next year.",
    "Via The Register"
  ],
  "headers": {
    "4": "Perpetual license vs SaaS"
  },
  "links": {
    "perpetual licenses": "https://www.techradar.com/news/microsoft-office-perpetual-licenses-are-no-longer-part-of-the-home-use-program",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "reported": "https://www.theregister.com/2021/07/12/valuelicensing_microsoft_competition_lawsuit_270m/",
    "£270m lawsuit": "https://regmedia.co.uk/2021/07/09/valuelicensing_particulars_claim.pdf",
    "switch to SaaS": "https://www.techradar.com/news/microsoft-is-making-a-significant-change-to-office",
    "Microsoft 365": "https://www.techradar.com/news/microsoft-365-is-getting-a-significant-security-boost",
    "The Register": "https://www.theregister.com/2021/07/12/valuelicensing_microsoft_competition_lawsuit_270m/"
  }
}