{
  "source": "https://www.techradar.com/news/rtx-3060-rtx-3070-rx-6700-xt-available-through-newegg-shuffle",
  "title": "AMD RTX 3060, RTX 3070 and RX 6700 XT now available through Newegg Shuffle",
  "category": "computing",
  "updated": "2021-03-19T16:57:48Z",
  "author": "john-loeffler",
  "summary": "Win a chance to get your mid range GPUs here",
  "article": [
    "The latest Newegg Shuffle is now live, keeping the Shuffle streak going this week, with today's offerings for March 19, 1pm to 4pm EDT, featuring midrange graphics cards like the RTX 3060, RTX 3070, and RX 6700 XT - though they aren't the cheapest ones available.",
    "Starting with the RTX 3060, Newegg has just one on in the Shuffle today, the MSI Gaming X RTX 3060, which is available for $509.",
    "There are four RX 6700 XT cards on offer though, one each from Sapphire and MSI, and two from Asus. The Sapphire Pulse RX 6700 XT is selling for $619, the Asus Dual RX 6700 XT is going for $729, and the MSI Mech 2X RX 6700 XT is available for $749, while the Asus ROG Strix RX 6700 XT is available for $829.",
    "Next up is the RTX 3070, with Newegg offering two Asus RTX 3070s, including one bundle. The Asus Tuf Gaming RTX 3070 is available for $769 on its own or bundled with an Asus Tuf Gaming B550-Plus ATX AMD motherboard for $916, and the Asus ROG Strix 3070 in white for $839.",
    "Again, not the cheapest graphics cards in the midrange, but some pretty decent offerings nonetheless.",
    "The way Newegg Shuffle works is you sign up for a Newegg account and during the event window, you select the items you want and simply click the button marked \"Enter the Shuffle.\"",
    "When the event window closes, in about an hour, winning accounts will be drawn from the list for each item and the winners notified at the email associated with the account.",
    "About 90 minutes after notifications go out, winners will have a roughly four-and-a-half-hour window to follow the link in the email to a secure checkout on Newegg and complete their purchase. If the winners do not complete their purchase in the allotted time, they lose their chance to purchase their item and have to wait until it comes up again in another shuffle and try again.",
    "It definitely isn't a perfect system, but it's better than the wild west shoot-out with bots, profiteers, and Ethereum miners that existed before."
  ],
  "headers": {
    "5": "How to throw your hat in the ring during Newegg Shuffle drawings"
  },
  "links": {
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt"
  }
}