{
  "source": "https://www.techradar.com/news/cannibal-cane-toads-lead-the-weeks-science-news-because-of-course-they-would",
  "title": "Cannibal cane toads lead the week's science news, because of course they would",
  "category": "appliances",
  "updated": "2021-09-04T00:05:26Z",
  "author": "john-loeffler",
  "summary": "There was also some cool and not so cool space stuff, promise",
  "article": [
    "So this week's science news was pretty much dominated by those cannibalistic cane toads in Australia, but there were some other important science news happening this week worthy of a look.",
    "The week started off with news that cracks had been found in the International Space Station (ISS) and ended with a Firefly Aerospace rocket explosion.",
    "In between, there was some other space news including the ancient brown dwarf called The Accident careening through space at half a million miles an hour and speculation about Dyson Spheres around black holes powering advanced alien civilizations.",
    "Lets review the week that was in science!",
    "It turns out that invasive cane toad tadpoles in Australia are eating their younger siblings and cousins so quickly and in such large numbers that it's creating an intergenerational biological arms race to see which can evolve quick enough to beat the other.",
    "The toads, which were brought from South America to Australia in the 1930s are highly poisonous and have no natural predators in Australia (which is saying something), are 30 times more likely to seek out fellow defenseless cane toad hatchlings to eat while tadpoles than their South American cousins.",
    "This has caused the hatchlings to develop even faster to reach the tadpole stage themselves so they won't get eaten, making the cannibal tadpoles even more aggressive to eat what remaining hatchlings there are in the small pools they were born in.",
    "Russian officials reported finding \"superficial fissures\" in the Zarya module of the ISS, with no indication yet if there is any air leak as a result. The fissures themselves are only surface level cracks on the exterior, but they are expected to widen over time.",
    "The cracks in and of themselves aren't completely unexpected for a space station, since the transition from the dayside to the nightside in its orbit around the Earth and back again (which happens 16 times a day) puts extreme cold and extreme heat pressures on the surface of any satellite in orbit and some wear and tear is expected.",
    "But, obviously, astronauts don't like in any of those other satellites so any damage to the environment of the ISS is cause for concern.",
    "The Accident, a nickname given to a surprisingly fast brown dwarf, has been spotted about 50 light-years away travelling about half a million miles per hour. It's also incredibly old.",
    "Brown dwarfs are also known as failed stars as they are anywhere from about 13 to 80 times as massive as Jupiter, but still not big enough to ignite nuclear fusion in their cores.",
    "Though usually cold and hard to see, the incredible speed and chemical makeup of The Accident indicates that it is a remnant of the very young universe 10 to 13 billion years ago, before exploding stars were able to seed a lot of carbon into the universe.",
    "Instead, this mostly hydrogen and helium brown dwarf has been getting whipped around the galaxy by much more massive bodies since those early days accumulating some pretty incredible speed as a result.",
    "A new study out of Taiwan has dug into the math of it and found that if an advanced alien civilization was capable of building a Dyson Sphere, it would be worth the effort to build one around a stellar-mass black hole.",
    "The researchers found that a Dyson Sphere, a theoretical megastructure surrounding a star to better capture the energy it produces, that is instead built around a stellar mass black hole could capture as much as five times the energy from a similarly massive star.",
    "Considering we haven't even found life anywhere other than Earth though (so far), it's all speculative, but could give us a better idea of where to look for extraterrestrial life.",
    "Lastly, who doesn't like a big-rocket-go-boom video? Firefly Aerospace, a private space company, is in the early stages of developing its satellite delivery rocket and conducted a test on September 3, but suffered an anomaly midflight.",
    "After tumbling for a bit high up in the sky, the rocket exploded in truly spectacular fashion – a moment captures by several spectators on the ground.",
    "It looks even better on video, which you can watch here.",
    "That's it for this week in science news, but come back next week as humanity progresses one study, experiment, and rocket launch at a time."
  ],
  "headers": {
    "4": "Cannibal cane toads eat their young so fast it's creating an evolutionary arms race",
    "7": "Fresh cracks found in International Space Station module",
    "10": "The Accident has been barreling through the galaxy for 10 billion years or more",
    "14": "Are aliens building Dyson Spheres around black holes? It's not that bad an idea, actually",
    "17": "Watch Firefly Aerospace's Alpha rocket explode in glorious fashion"
  },
  "links": {
    "invasive cane toad tadpoles in Australia": "https://www.techradar.com/news/invasive-cane-toads-too-deadly-even-for-australia-turn-to-cannibalism",
    "reported finding \"superficial fissures\"": "https://www.techradar.com/news/russian-cosmonauts-find-new-cracks-in-international-space-station-module",
    "build one around a stellar-mass black hole": "https://www.techradar.com/news/could-aliens-be-using-dyson-spheres-around-black-holes-to-collect-immense-power",
    "here": "https://www.techradar.com/news/watch-firefly-aerospaces-new-alpha-rocket-blow-up-in-spectacular-fashion"
  }
}