{
  "source": "https://www.techradar.com/news/no-mans-sky-companions-update-lets-you-adopt-alien-monstrosities",
  "title": "No Man’s Sky Companions update lets you adopt alien monstrosities",
  "category": "gaming",
  "updated": "2021-02-17T17:12:18Z",
  "author": "rhys-wood",
  "summary": "The aliens we made along the way",
  "article": [
    "No Man’s Sky looks to build on the success of its recent expansions with its latest creature-oriented update, which lets explorers befriend, tame, train and even ride the aliens they meet on their space-faring quest.",
    "Hello Games’ Sean Murray summarized the new update in a handy tweet, including a short trailer showcasing some of the new features players can expect to see.",
    "The update, titled Companions, is available right now across all systems, and its feature set is surprisingly robust. From what we’ve seen, it looks like yet another welcome avenue for players to expand their star trekking empire.",
    "Players can adopt up to six alien companions initially, but this can be increased via upgrades. Upon meeting the desired alien, players must feed it to open up a suite of choices. From there, explorers can milk (yes, milk) tame and even ride the creature in question.",
    "The options for training an alien in No Man’s Sky’s Companions update are shockingly well-rounded, but the fun doesn’t stop there. Your new alien chums aren’t just there to be looked at. They can also be customized with various accessories, be given a name and develop their own personalities.",
    "How much you get out of your companions depends on how much trust they have in you. This trust can be built by continually caring for them. They’ll in turn reward this care with some handy exploration bona-fides to help take some of the stress out of your routine mineral hunting.",
    "With enough trust, your new pets can alert you to various landmarks like buildings or mineral deposits. They can warn you of dangers and protect you from threats, as well as taking over mining duties by being given direct control of your tools.",
    "Eventually, a players’ creature may even lay eggs, which can be further edited through the use of an Egg Sequencer tool. And did we mention you can ride really big creatures? Because the Companions update looks like it lets you do that as well.",
    "We have to say, we did not expect Hello Games to explore such a rudimentary feature so thoroughly, but we are glad they went the extra mile, as they tend to do with these big No Man’s Sky content updates."
  ],
  "headers": {
    "3": "Feeling a little alien"
  },
  "links": {
    "No Man’s Sky": "https://www.techradar.com/news/no-mans-sky-origins-30-update"
  }
}