{
  "source": "https://www.techradar.com/news/save-dollar10-on-the-apple-magsafe-charger-in-its-cheapest-deal-yet",
  "title": "Save $10 on the Apple MagSafe Charger in its cheapest deal yet",
  "category": "appliances",
  "updated": "2021-05-12T15:14:37Z",
  "author": "tabitha-baker",
  "summary": "Apple's MagSafe Charger is now under $30",
  "article": [
    "The Apple MagSafe Charger is a popular accessory among iPhone 12 users, and has steadily been dropping its price over the last few weeks. However, we're now seeing it a full $10 off its MSRP for the first time, at just $29.85.",
    "Previously $39.99, incremental discounts from the start of 2021 kicked off a steady price decline, dropping a few dollars every month or so. However, the extra $5 off we're seeing today has been the largest drop so far, and yields an impressive final sales price.",
    "Not in the US? Scroll down for more Apple MagSafe Charger deals in your region.",
    "Launched alongside the iPhone 12 range, the MagSafe Charger locks onto compatible phones to provide fast wireless charging without having to manually align your handset. That's a godsend if you're used to wireless pads with very sensitive charging points.",
    "While the iPhone 12 range is built with the magnets to make the most of Apple's MagSafe Charger, the Qi pad is compatible with iPhone 8 models and above, as well as the AirPods Pro. However, note that you won't receive the same snappy response and some have reported slower charging on these older devices as well.",
    "If you're in the market for a new handset, you can find all the latest iPhone 12 deals right here on TechRadar. Or, take a look at more Apple accessories with the best AirPods deals and AirPods Pro prices around.",
    "You'll find plenty more discounts in the upcoming Amazon Prime Day deals and Memorial Day sales as well."
  ],
  "headers": {
    "5": "More Apple MagSafe Charger deals"
  },
  "links": {
    "$10 off its MSRP for the first time, at just $29.85": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MHXH3AM-A-MagSafe-Charger%2Fdp%2FB08L5NP6NG%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1239921569265391400-20",
    "iPhone 12 deals": "https://www.techradar.com/deals/apple-iphone-12-deals",
    "best AirPods deals": "https://www.techradar.com/news/cheapest-airpods-prices",
    "AirPods Pro prices": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "Amazon Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021"
  }
}