{
  "source": "https://www.techradar.com/news/ces-2021-this-cheap-soundbar-splits-in-half-for-a-simple-surround-sound-setup",
  "title": "CES 2021: This cheap soundbar splits in half for a simple surround sound setup",
  "category": "audio-visual",
  "updated": "2021-01-12T10:22:38Z",
  "author": "olivia-tambini",
  "summary": "Get a soundbar that can do both",
  "article": [
    "CES 2021 has shown off soundbars with innovative add-on speakers, tiny soundbars for small spaces, and cheap soundbars with Dolby Atmos – and now, the tech extravaganza has given us a modular soundbar that you can break in half to make two floorstanding speakers.",
    "The Cowin Soundbar is a wireless 25W bar that you can either place below your TV or mount on the wall to boost your TV's built-in speakers.",
    "However, if you want to spread the audio around your room, you can simply split the soundbar in two and – voila – you now have two separate speakers that can be placed on either side of your TV or even mounted on opposite walls.",
    "It's not clear whether the soundbar can deliver true stereo sound when split in two, but it could certainly add a sense of flexibility to your home audio setup, with support for Bluetooth 4.2, as well as AUX, optical, and HDMI ports.",
    "Now, you may expect that flexibility to come at a high price. However, the Cowin Soundbar will cost just $79.99 on Amazon when it launches \"later in Q1 2021\" – so, likely March – according to the audio brand.",
    "While global pricing and availability is yet to be confirmed, that works out at around £60 / AU$100 – much cheaper than most soundbars on the market, though its worth remembering that you're not getting creature comforts like Dolby Atmos immersive sound or the latest Bluetooth wireless standard.",
    "This isn't the first time we've seen a modular soundbar. At IFA 2017, JBL unveiled a transforming soundbar with detachable wireless rear speakers, which the company later upgraded with Dolby Atmos for CES 2021 with the JBL Bar 9.1.",
    "Of course, the JBL Bar 9.1 is far pricier than Cowin's offering, coming in at $1,000 / £1,000 / AU$1,500, so anyone who wants to try the tech without committing to a huge spend could try the Cowin Soundbar first.",
    "Soundbars may be essential bits of tech for home cinema enthusiasts, but these long, thin speakers can often be a little unwieldy – and don't leave much room for customization.",
    "That seems to be changing, with audio manufacturers looking for ways to make their soundbars suit a wider range of homes.",
    "CES 2021 alone has given us the Dolby Atmos-rocking LG QP5 Éclair, which comes in at just 11.7 inches by 2.3 inches (W x H), making it an ideal choice if you're short on space – or if you simply dislike the look of traditional soundbars.",
    "On the other end of the scale, there's the Samsung HW-Q950A, an 11.1.4-channel soundbar with some seriously innovative rear speakers.",
    "Unlike most soundbar setups, the included wireless rear speakers each come with a side-firing channel, blasting your music or TV audio at you from every angle in conjunction with the bar's upfiring, Atmos-supporting tweeters.",
    "The growing trend for soundbars in all shapes, sizes, and configurations is certainly exciting, and it makes the audio technology more accessible to those working with tight or unusually-shaped spaces. And, as CES 2021 enters its second day, here's hoping that we'll see more innovations in the world of soundbars that will make it possible for anyone to build an impressive home cinema system."
  ],
  "headers": {
    "4": "Keeping costs down",
    "8": "Cinema-style audio for all"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "cheap soundbars": "https://www.techradar.com/news/soundbar-deals",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "floorstanding speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "JBL Bar 9.1": "https://www.techradar.com/reviews/jbl-bar-91",
    "LG QP5 Éclair": "https://www.techradar.com/news/this-eclair-shaped-dolby-atmos-soundbar-could-be-a-satisfying-treat-for-tight-spaces",
    "Samsung HW-Q950A": "https://www.techradar.com/news/samsungs-new-dolby-atmos-soundbar-could-be-its-most-immersive-yet"
  }
}