{
  "source": "https://www.techradar.com/news/psn-is-down-february-27",
  "title": "PSN is down: outage continues to disrupt online games for PS5, other Sony consoles",
  "category": "gaming",
  "updated": "2021-03-01T13:05:19Z",
  "author": "matt-swider",
  "summary": "The PlayStation Network sees some games and functionality limited for the fourth straight day. Here's what we know.",
  "article": [
    "Update: As of 1pm GMT/ 5am PT / 8am ET on March 1, PSN is still down. We're having problems playing some games online (but not all games) and the service has been down for more than 24 hours. Here's what we know about the ongoing PSN outage.",
    "PSN is down with a major outage right now, according to Sony's official PlayStation Network status page – and the fact that we can't log in to some online games today. It's affecting all online-capable Sony consoles: PS5, PS4, PS3 and the PlayStation Vita.",
    "\"You might have difficulty launching games, apps, or network features,\" confirms Sony's official PSN status page. The company is trying to fix PSN, saying, \"We're working to resolve the issue as soon as possible.\"",
    "Good news: only certain PSN games won't function online, and PlayStation Plus as well as select online games seem to have been spared, according to our latest test. The bad news about this PSN outage is you can't do anything but wait for Sony to resolve problem, and the PlayStation Store seems to be affected, too. At least you know that you're not alone with PSN being down for some games.",
    "Monday's ongoing PSN outage actually started a few days ago, according to the company's status page. There's a timestamp attached to the posting, suggesting PSN went down on Friday, February 26. However, user complaints on Twitter seem to predate Sony's official timestamp by at least 24 hours.",
    "It's not clear – judging from Sony's language and our own experiences – how many online games are down right now due to the PSN outage. Xbox Live went down last week and Microsoft disclosed much more granular information on its status page.",
    "PSN is down and the outage now spans at least three days, but this isn't the first or longest downtime for Sony's online gaming network.",
    "Famously, PSN went down in 2011 for 24 days, plus an additional 42 days for the then-budding PlayStation Store. In that much more dire case, it was later confirmed that hackers had exploited PSN and exposed users' information, according to Sony. Today's PSN outage seems to be unfortunate weekend downtime."
  ],
  "headers": {
    "4": "When did PSN go down? Days ago, say some users"
  },
  "links": {
    "PSN status": "https://status.playstation.com/",
    "Xbox Live went down": "https://www.techradar.com/news/xbox-live-is-down-with-a-major-outage",
    "PSN went down in 2011": "https://www.gamingtarget.com/article.php?artid=12407"
  }
}