{
  "source": "https://www.techradar.com/news/microsoft-edge-is-getting-a-funky-new-search-feature",
  "title": "Microsoft Edge is getting a funky new search feature",
  "category": "computing",
  "updated": "2021-05-05T12:01:03Z",
  "author": "joel-khalili",
  "summary": "Reverse image search is coming to Microsoft Edge",
  "article": [
    "Microsoft is currently testing a new search facility for its flagship web browser, Edge, as spotted by an eagle-eyed member of the community.",
    "Available to members of the early-access program via the Canary and Dev channels, the new Edge feature allows users to perform searches using images as the source information, as opposed to text.",
    "As shown in screenshots shared by Reddit user Leopeva64-2, once the image has been analyzed, Edge will offer up a selection of related web pages and information in a dedicated sidebar tab.",
    "To access reverse image searches, early-access users can right-click on an image and select “Search in sidebar for image” from the dropdown menu. The feature builds upon the existing “Search in sidebar” feature for text, which went live in a full public release earlier this year.",
    "In addition to churning up related images and web links, the new Edge search will also extract any text content, which could be particularly useful for deciphering low resolution images or for anyone that struggles with vision.",
    "Unsurprisingly, the new search type is powered by the Microsoft-owned Bing search engine. There is no indication, so far, that Edge will allow users to perform the same type of searches using Google, which has offered similar functionality for a number of years.",
    "While reverse image searches are already available via two early access builds, Canary and Dev, the feature still needs to pass through the more stable Beta channel (which receives a major update every six weeks) before it can be considered for inclusion in a full public release.",
    "For this reason, it’s difficult to determine precisely when the feature will land for regular Edge users.",
    "Via OnMSFT"
  ],
  "headers": {
    "3": "Microsoft Edge image searches"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "screenshots": "https://www.reddit.com/r/MicrosoftEdge/comments/n3q7up/reverse_image_search_in_bing_sidebar/",
    "OnMSFT": "https://www.onmsft.com/news/microsoft-edge-adds-reverse-image-search-feature-for-some-insiders"
  }
}