{
  "source": "https://www.techradar.com/news/xiaomi-redmi-10-unveiled-with-specs-to-rival-the-pixel-5a-but-its-a-cheaper-phone",
  "title": "Xiaomi Redmi 10 unveiled with specs to rival the Pixel 5a, but it's a cheaper phone",
  "category": "phones",
  "updated": "2021-08-18T10:07:35Z",
  "author": "james-rogerson",
  "summary": "High specs, low price",
  "article": [
    "Xiaomi has carved out a name for itself as a company that delivers high-end specs for a fraction of the price of rivals, and it’s just unveiled the Redmi 10, which does exactly that at the budget end of the market.",
    "The Xiaomi Redmi 10 has a 6.5-inch 1080 x 2400 screen with a 90Hz variable refresh rate, while its camera is a quad-lens one, with a 50MP main snapper, an 8MP ultra-wide, a 2MP macro, and a 2MP depth sensor. There’s also an 8MP one on the front.",
    "The battery is big at 5,000mAh, though charging is limited to a sedate 18W, and there’s a MediaTek Helio G88 chipset powering the Redmi 10, along with 4GB or 6GB of RAM and 64GB or 128GB of storage.",
    "There’s also a side-mounted fingerprint scanner, a 3.5mm headphone port, and as you can see from the images, the Xiaomi Redmi 10 has a reasonably modern design, with a punch-hole camera and slim bezels on most sides, other than at the bottom of the display.",
    "Of course, how compelling any of this is will depend on the price, and with that in mind we’d say it’s quite compelling, as the Redmi 10 starts at just $179 (around £130 / AU$245) for a model with 4GB of RAM and 64GB of storage, rising to $199 (roughly £145 / AU$275) for 128GB of storage, and $219 (approximately £160 / AU$300) to additionally boost the RAM to 6GB, with sales opening on August 20.",
    "At the time of writing there's no word on a UK or Australian release, but many Xiaomi phones at least come to the UK.",
    "Google recently launched the Pixel 5a – a phone which (5G aside) has comparable specs in many ways to the Redmi 10, yet costs far more at $449 (around £325 / AU$610).",
    "For that you’re getting a better chipset in the Snapdragon 765G and water resistance, but the same RAM and storage amount as the top Redmi 10 model, a similar screen size and resolution, a worse refresh rate, a smaller battery, and fewer cameras. We suspect Google’s cameras will perform better, but nevertheless you’re paying a lot more for them.",
    "Likewise, the OnePlus Nord CE offers similar specs on paper in a lot of areas. It has a slight edge in most cases, but it isn’t available in the US, and if it was it would probably cost more given its £299 starting price in the UK. And those are just two examples – most companies are struggling to compete with Xiaomi’s budget and mid-range phones when it comes to price.",
    "It’s no wonder given all this that Xiaomi has quickly risen through the smartphone ranks to become the second biggest smartphone vendor in the world, and the biggest in Europe. As Xiaomi becomes more of a household name, its dominance may well continue to increase – just as long as it keeps offering great tech at low prices."
  ],
  "headers": {
    "6": "Analysis: why buy OnePlus or Google when you can buy Xiaomi?"
  },
  "links": {
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "OnePlus Nord CE": "https://www.techradar.com/reviews/oneplus-nord-ce-5g",
    "second biggest smartphone vendor in the world": "https://www.techradar.com/news/xiaomi-leapfrogs-apple-to-become-the-worlds-second-biggest-smartphone-vendor",
    "biggest in Europe": "https://www.techradar.com/news/samsung-is-no-longer-the-biggest-smartphone-vendor-in-europe"
  }
}