{
  "source": "https://www.techradar.com/news/four-of-the-most-important-innovations-in-robot-vacuums",
  "title": "Four of the most important innovations in robot vacuums",
  "category": "smart-home",
  "updated": "2021-09-15T17:13:30Z",
  "author": "sponsored",
  "summary": "What's in your robot vacuum? How these tiny machines work to keep your floors clean",
  "article": [
    "You're interrupted from your work by loud, distressed beeping.",
    "You sigh and stand up from your desk. That's the tenth time today you've had to go and rescue your vacuum from a completely imagined threat. You find it at the edge of a centimeter-tall depression in the floor, sigh, move it, and start it up again.",
    "Ten minutes later, it's stuck under the bed, running repeatedly into one of the legs.",
    "That kind of experience used to be part and parcel of owning a robot vacuum (or robovac) when the technology first came to market. On paper, it was a magnificent idea. A self-directed, automated tool that would keep your floors clean for you.",
    "In practice, though? Not so much. And that's not even going into the nightmarish pet accidents that used to be common with automated vacuum cleaners.",
    "Fortunately, the underlying technology of robovacs has evolved in leaps and bounds since the market's earliest days. Today's vacuums are smarter, faster, better at recognizing obstacles, and better at cleaning. This is due in large part to four technical innovations that we've seen in recent years.",
    "Early robot vacuums relied largely on inertial movement and collision sensors to figure out where they were going. Anyone who purchased one back then knows exactly how well that worked. Whether or not your vacuum actually cleaned your entire house was a toss of the dice — inefficient cleaning paths meant older models frequently missed spots, or repeatedly cleaned the same spot over and over.",
    "As the market evolved, robovacs eventually saw themselves equipped with more advanced navigation systems/sensors, and algorithms that would allow them to map their surroundings based on what those sensors detected. Next, upwards-facing cameras allowed the robovacs to 'see' their surroundings. Combined with simple algorithms, this allowed limited mapping and pathing.",
    "This technology, known as Visual Simultaneous Localization and Mapping (vSLAM), uses 3D mapping to model its surroundings. This allows a robovac to have some degree of spatial awareness and triangulate its position. However, there's a significant drawback — the technology doesn't work well in low-light conditions, as you'd find beneath furniture.",
    "Light Detection and Ranging(LiDAR), an evolution of early sensor tech, does not suffer from this limitation. Rather than relying on cameras and imaging to map its surroundings, a LiDAR-based robovac emits a series of harmless laser pulses, allowing it to accurately define its surroundings. This increased mapping accuracy allows for an incredible level of position, speed, and efficiency when cleaning.",
    "Particularly when used in tandem, these two technologies offer an incredibly high level of precision for both mapping and cleaning, which also translates to greater speed and efficiency.",
    "Roborock, for its part, leverages this to great effect with its LiDAR-powered S-Series robot vacuums. As a result, users are able to exert incredible control over their robovac's cleaning process. This includes setting no-go zones, configuring spot cleaning, and viewing a cleaning map of their home.",
    "Everyone loves pets. What they don't love is the messes they sometimes like to leave on the floor. Especially if there's a robovac involved.",
    "You've no doubt heard the stories. A pet has an accident, and the owner's oblivious robovac bumbles happily towards it, eventually tracking it all over the house. And that's when it's not repeatedly slamming into feet, furniture, and walls.",
    "The problem is that a lot of robovacs, especially older and low-end models, don't really have much in the way of object recognition. They don't know there's something in their path until it's right in front of them (or underneath them). And while technology like LiDAR may help a vacuum go around furniture and obvious obstructions, it doesn't allow the device to recognize obstacles.",
    "This is where artificial intelligence comes in, like the ReactiveAI system on the Roborock S6 MaxV. Two cameras positioned on the vacuum's front captures objects in its path. Images from the cameras are then fed into an algorithm that identifies objects such as wires, pet messes, and more.",
    "Said algorithm has been trained on thousands of real-world images. This means it can easily recognize and avoid household hazards that other robots might bungle right into. And if it ever encounters an object it doesn't recognize?",
    "It will simply go around.",
    "Robovacs haven't just gotten smarter and better at seeing their surroundings. They're also significantly better at cleaning. For the most part, this isn't really due to any groundbreaking innovation.",
    "The underlying technology has simply gotten better, in the same way that a PC from 2020 is going to be better than one from 2004.",
    "That isn't to say there aren't a ton of innovations to enhance the cleaning process.",
    "Another major weakness of robotic vacuums is that they tend to leave certain debris or residue behind; caked-on dirt, spilled drinks, mud, and so on. And even those vacuums that are equipped with mops tend to be a bit lackluster in that department.",
    "Roborock has developed a solution with the Roborock S7's VibraRise technology. The robovac's sonic mopping technology can effectively scrub a floor up to three thousand times per minute., allowing it to mop up even the toughest stains. The S7 is also equipped with an ultrasonic carpet sensor which immediately retracts the mop when the unit detects carpeting, and users can set carpeted areas as no-go zones in the companion app.",
    "The VibraRise system also automatically lifts its wet mop upon detecting carpeted surfaces.",
    "What this means is that the S7 can both vacuum and mop at the same time, leaving your floors more spotless than ever in the process.",
    "The final innovation to discuss probably doesn't seem that exciting. Robovacs have increasingly been shipping with auto-empty docks for added convenience. Rather than having to empty the vacuum after every run, the owner can simply keep an eye on the dock and clear it out when it starts to get full, which usually takes weeks.",
    "As you might expect, not all auto-empty docks are created equal. In order to be effective, the dock must be fitted with a decent filtration system. Otherwise, you're going to end up with a lot of rancid air flowing around the area where your robovac is charging.",
    "Or just a ton of dust.",
    "Roborock has enhanced this technology in a few ways. First, its auto-emptying dock clears dust and debris from the vacuum's main brush, enabling it to pull out large detritus which would otherwise be left behind in the vacuum. Unlike other auto-empty units, which use a specialized tunnel, Roborock's docks remove dust and debris via the same path through which they entered the vacuum — meaning less manual cleanup.",
    "A built-in multi-stage filtration system within the unit itself keeps your house nearly dust-free, capturing up to 99.99% of particles, while its 3L antibacterial dust bag self-seals when removed from the docks, ensuring you won't get a faceful when emptying it.",
    "As with other aspects of its vacuums, Roborock has lightly applied artificial intelligence here, as well. In this case, they take the form of intelligent dust collection algorithms that adjust emptying based on how the vacuum is used, monitoring frequency, time, and duration of cleaning sessions.",
    "Robotic vacuums have come a long way. It seems like only yesterday, they were both clumsy and graceless, jamming themselves into crevices, slamming into furniture, and smearing unmentionable messes all over the floor. Today's vacuums are nothing like that.",
    "They're sleeker, smarter, and considerably more efficient. All they're really missing at this point is the ability to climb stairs. Which, if things keep proceeding at their current pace, might come sooner than anyone expects."
  ],
  "headers": {
    "6": "Intelligent Pathfinding",
    "12": "No More \"Accidents\": Artificial Intelligence",
    "18": "Better Cleaning: Mopping/Advanced Vacuum Technology",
    "25": "Hands-Off, Worry Free: Auto-Empty",
    "31": "Smarter Designs for Cleaner Homes"
  },
  "links": {
    "S-Series robot vacuums": "https://bit.ly/2WZKrzq",
    "ReactiveAI system on the Roborock S6 MaxV": "https://bit.ly/3zV7YQG",
    "sonic mopping technology": "https://bit.ly/3l20KnJ",
    "auto-emptying dock": "https://bit.ly/38QH80q"
  }
}