{
  "source": "https://www.techradar.com/news/parallels-desktop-165-runs-windows-10-on-an-m1-chip-much-faster-than-an-intel-macbook",
  "title": "Parallels Desktop 16.5 runs Windows 10 on an M1 chip much faster than an Intel MacBook",
  "category": "computing",
  "updated": "2021-04-14T16:20:22Z",
  "author": "darren-allan",
  "summary": "30% better performance with M1 chip compared to Intel Core i9-8950HK",
  "article": [
    "Parallels Desktop 16.5 for Mac has been launched, adding a feature that owners of M1-powered Macs have been keenly awaiting – namely support for Apple’s own silicon.",
    "Parallels Desktop allows Mac users to run Windows 10 on their Apple device as a virtual machine, with version 16.5 adding native support for the M1 chip, delivering what the devs describe as a “seamless Windows-on-Mac experience”.",
    "Indeed, running a virtual machine of Windows 10 on an M1-toting Mac offers up to 30% better performance compared to a MacBook Pro with an Intel Core i9-8950HK processor (going by Geekbench 5 scores).",
    "Other interesting comparative stats dropped by the developer include Parallels Desktop 16.5 using 2.5 times less energy with an M1-powered MacBook Air versus a MacBook Air with Intel CPU (Core i5-8210Y). And with gaming, expect 60% better DX11 performance on a MacBook Pro with M1 chip compared to a MacBook Pro with Intel CPU and an AMD Radeon Pro 555X GPU.",
    "Parallels Desktop 16.5 also ushers in M1 support for a number of popular ARM-based Linux distros (like Debian, Fedora, Kali, Ubuntu), and the package comes with Parallels Access and Parallels Toolbox bundled for free, both of which now support Apple’s new M1 chip.",
    "As you may recall, Parallels Desktop 16.5 has been in preview testing for some time now, with testers apparently not holding back with “enthusiastic feedback about [its] remarkable performance”.",
    "Parallels Desktop 16.5 for Mac (for home use, and students) will set you back £69.99 (around $97, AU$125) for a year-long subscription, or £79.99 (around $110, AU$143) for a perpetual license (upgrading versions 14 or 15 costs £39.99, or around $55, AU$71). The Mac Pro Edition or Mac Business Edition cost £79.99 (around $110, AU$143) for a new subscription (also lasting a year), or with Pro you can again upgrade from a previous version by paying £39.99 (around $55, AU$71)."
  ],
  "headers": {
    "3": "Energy boon"
  },
  "links": {
    "virtual machine": "https://www.techradar.com/best/best-virtual-machine-software",
    "M1 chip": "https://www.techradar.com/news/apple-m1-beats-the-xeon-based-macpro-so-much-it-hertz",
    "MacBook Pro with M1 chip": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Parallels Desktop 16.5 has been in preview testing": "https://www.techradar.com/news/this-tool-lets-you-run-windows-10-on-the-apple-m1-heres-how"
  }
}