{
  "source": "https://www.techradar.com/news/aquaman-2-on-set-photo-may-have-teased-its-big-plot-point",
  "title": "Aquaman 2 on set photo may have teased its big plot point",
  "category": "entertainment",
  "updated": "2021-06-29T09:34:37Z",
  "author": "tom-power",
  "summary": "Is Arthur Curry heading to Necrus in Aquaman 2?",
  "article": [
    "Aquaman 2 has officially entered production, and fans are eager to see where the DC Extended Universe (DCEU) sequel takes Arthur Curry in his next adventure.",
    "Titled Aquaman and the Lost Kingdom, it appears that the titular superhero will be, well, searching for an underwater realm that has seemingly disappeared.",
    "To celebrate the sequel's first day of shooting, director James Wan took to Instagram to post an image of the first clap board to be used on set – and it seems that Wan has heavily teased the name of this lost kingdom that Aquaman may head off to find.",
    "Wan's image is a simple one on the surface. The photograph simply shows the clap board leaning against a wall, which is situated in an ice-cold cave.",
    "Look closer at the clap board, however, and you'll see a name – Necrus – that will sound very familiar to DC comic fans.",
    "Check out Wan's post below:",
    "For those who aren't aware, Necrus is a domed underwater city, which exists in DC comics, much like Atlantis.",
    "However, that's where the similarities between the two kingdoms ends. Necrus – also known as the Black City – has no fixed location, and it only appears for brief moments of time (on the material plane of existence, at least). It's also ruled by a tyrant called Mongo, who has a disdain for surface dwellers. As Arthur Curry is half-human, that would certainly set Mongo up as the movie's major antagonist.",
    "Could Necrus be the lost kingdom that Arthur Curry goes in search of in Aquaman 2? Based on the above, it's a big possibility. After all, six of the seven underwater kingdoms were mentioned in 2018's Aquaman movie, but the seventh was conspicuous by its absence.",
    "If Necrus is the seventh kingdom, it would make sense that it wasn't mentioned. Why? Well, the vast majority of ocean dwellers won't have seen it and it may be a myth to many as a result.",
    "Given that it rarely appears on the sea floor (we'd enter major spoiler territory if we reveal why this is the case, so we won't ruin this potential secret for you), Aquaman's search for Necrus would be a solid base for Aquaman 2's story. Atlantis and Necrus have also waged war on one another in the comics, so there's a precedent for hostility between the two kingdoms.",
    "Of course, this could simply be speculation on our part – and it might be a bait and switch from Wan, too.",
    "Necrus may just be the in-house working title for Aquaman 2, but it would be strange to use 'Necrus' as the film's secret production title when we already know what the movie's official name is.",
    "We may find out more as production ramps up further on Aquaman 2, which is currently due to be released on December 16, 2022."
  ],
  "headers": {
    "6": "Analysis: Necrus could be the lost kingdom in Aquaman 2"
  },
  "links": {
    "Aquaman 2": "https://www.techradar.com/news/aquaman-2-release-date-cast-and-what-else-we-know-about-dcs-return-to-atlantis"
  }
}