{
  "source": "https://www.techradar.com/news/the-new-star-wars-knights-of-the-old-republic-is-reportedly-in-the-works-outside-of-ea",
  "title": "The new Star Wars: Knights of the Old Republic is reportedly in the works 'outside of EA'",
  "category": "gaming",
  "updated": "2021-06-28T14:51:53Z",
  "author": "vic-hood",
  "summary": "KOTOR is apparently in development at an unnamed studio",
  "article": [
    "A new Star Wars: Knights of the Old Republic is reportedly in development \"outside of EA\", according to reports.",
    "On a recent episode of B.O.B. the podcast, Star Wars Insider, Bespin Bulletin, claimed that a new Knights of the Old Republic is in development at an unnamed studio (via VGC).",
    "\"Amongst my digging, I heard there is a Knights of the Old Republic project in development somewhere,\" Bulletin said. \"I talked to a couple of people, and I also found out that Jason Schreier said that it’s not with EA, and we’ll ‘never guess’ who the studio is that’s making this game.\"",
    "Bulletin is referring to recent comments made by Bloomberg's Jason Schreier who commented on a Resetera thread titled \"If not Bioware, who can EA (or should we say Lucasfilm Games) pick to develop the rumored KoTOR remake?\", saying \"Nobody's going to guess right that's for sure\".",
    "Rumors that a new Knights of the Old Republic game is in development sparked in early 2020, when a report by Cinelinx claimed that it had two independent sources claiming a new KOTOR was in the works. The report also claimed that rather than be a remake, the new game was going to be more like a sequel.",
    "Cinelinx also claimed that this game would \"integrate elements from the first two games in order to bring certain things into the current Star Wars canon\", essentially making the game more a reboot than a remake. However, at the time, there was no mention of who was developing the game.",
    "It was widely assumed that the game was being developed by EA and BioWare, who originally created the series - with EA having the game rights to the Star Wars franchise. However, Lucasfilm announced last month that it was extending the Star Wars license to other studios outside of EA, with Ubisoft now confirmed to be making an open-world Star Wars title.",
    "It's possible that with EA's exclusivity ending, that another studio has in fact taken up the reigns of Knights of the Old Republic.",
    "Bulletin also claims that EA is working on a smaller Star Wars title, while another Studio is working on a \"bounty hunter game\".",
    "Lucasfilm hasn't confirmed that this rumored new Knights of the Old Republic is in the works but with the company announcing a sleuth of new games recently, including a new Indiana Jones game, we're hoping we'll see more later this year."
  ],
  "headers": {
    "4": "A new hope?"
  },
  "links": {
    "B.O.B. the podcast": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9221322386035290000&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fgb%2Fpodcast%2Fb-o-b-podcast-bespin-bulletin-nick-mirfakhraee-isaac%2Fid1532372711",
    "VGC": "https://www.videogameschronicle.com/news/a-new-knights-of-the-old-republic-is-reportedly-in-development-outside-of-ea/",
    "Resetera thread": "https://www.resetera.com/threads/if-not-bioware-who-can-ea-or-should-we-say-lucasfilm-games-pick-to-develop-the-rumored-kotor-remake.349213/#post-54674392",
    "report": "https://www.techradar.com/news/a-new-star-wars-knights-of-the-old-republic-is-reportedly-in-development",
    "Cinelinx": "http://www.cinelinx.com/news/knights-of-the-old-republic-remake-might-be-back-in-the-cards-exclusive/",
    "Ubisoft now confirmed to be making an open-world Star Wars": "https://www.techradar.com/news/ubisoft-is-making-a-star-wars-open-world-game-ending-eas-exclusivity",
    "new Indiana Jones game": "https://www.techradar.com/news/new-indiana-jones-game"
  }
}