{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-foldable-tipped-to-come-in-a-total-of-8-colors",
  "title": "Samsung Galaxy Z Flip 3 foldable tipped to come in a total of 8 colors",
  "category": "phones",
  "updated": "2021-04-26T13:03:07Z",
  "author": "david-nield",
  "summary": "Almost a whole rainbow",
  "article": [
    "It looks like Samsung is going to make sure you can't miss the Galaxy Z Flip 3 when it breaks cover, with the upcoming foldable clamshell rumored to be available in no fewer than eight different colors when it arrives.",
    "Those colors are light purple, black, green, beige, matte gray, white, dark blue and dark pink, as per a source in South Korea (via SamMobile). You're certainly not going to be lacking in choices if you decide this is going to be your next phone upgrade.",
    "The current Galaxy Z Flip 5G is available in just three colors, given grand names by Samsung: Mystic Grey, Mystic Bronze and Mystic White. This time around, it looks as though Samsung might be following the lead of the iPhone 12, which comes in six shades.",
    "Don't worry, you haven't missed the Galaxy Z Flip 2: we had the original Samsung Galaxy Z Flip, then we had the 5G upgrade, which is essentially the Flip 2, and next we're going to get the Flip 3, so the numbering falls into line with the Galaxy Z Fold 3 as well.",
    "So what else do we know about the upcoming clamshell? It sounds as though some form of water resistance is going to be added for the first time, which is no easy feat considering how many moving and bendable parts are included here.",
    "There has also been talk of a stronger 'Armor Frame' around the sides of both the Z Flip 3 and the Z Fold 3, perhaps made out of carbon, titanium or stainless steel – if that's indeed the case it would certainly add some extra durability to the phone.",
    "The screen size of the new phone has been tipped as being 6.7 inches when opened out fully, with a 3-inch screen on the outside – that external screen would be significantly bigger than the one on its predecessor, though it would appear that the overall dimensions of the phone will be similar to those of the previous models.",
    "As for a launch date, the Galaxy Z Flip 3 could arrive as early as July according to the latest rumors, though that's by no means certain. It sounds very much like the phone will launch at the same time as the Galaxy Z Fold 3, giving you a choice of two new Samsung foldables for your 2021 upgrade."
  ],
  "headers": {
    "4": "Other Z Flip 3 rumors"
  },
  "links": {
    "Galaxy Z Flip 3": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-galaxy-z-flip-2-may-arrive-sooner-than-we-thought",
    "as per a source": "https://m.blog.naver.com/yeux1122/222316423383",
    "SamMobile": "https://www.sammobile.com/news/samsung-galaxy-z-flip-3-colors-leak",
    "Samsung Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "some form of water resistance": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-spec-leaks-point-to-an-important-upgrade",
    "also been talk": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-galaxy-z-flip-3-in-line-for-a-key-design-upgrade",
    "has been tipped": "https://www.techradar.com/news/samsungs-2021-foldables-get-their-screen-specs-and-schedules-leaked"
  }
}