{
  "source": "https://www.techradar.com/news/elden-ring-will-include-a-free-ps5-and-xbox-series-x-upgrade",
  "title": "Elden Ring will include a free PS5 and Xbox Series X upgrade",
  "category": "gaming",
  "updated": "2021-06-11T10:21:14Z",
  "author": "rhys-wood",
  "summary": "Prepare for the best versions of Elden Ring",
  "article": [
    "Now that Elden Ring is well and truly within our grasp with its January 21, 2022 release date, the hype train is in full locomotion once again, and publisher Bandai Namco has released a slew of extra details. One of those is that Elden Ring will support free upgrades to the PS5 and Xbox Series X / Xbox Series S versions of the game.",
    "The news comes from a Bandai Namco press release on Elden Ring, stating: \"Elden Ring will launch on 21st January, 2022 for the PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, and PC via Steam. The game supports the Smart Delivery on Xbox consoles as well as a Free Upgrade to PS5 for players who purchase the PS4 version.\"",
    "This should come as good news for players who are planning on buying the last-gen versions of Elden Ring on PS4 or Xbox One, especially as availability of PS5 and Xbox Series X/S consoles continues to be in a rocky state.",
    "Elden Ring has arguably been one of gaming’s greatest enigmas for a few years now. First announced back at E3 2019 during an Xbox press conference, developer FromSoftware has kept details on the game close to its chest until now, adopting a ‘when it’s ready’ approach to revealing the game proper.",
    "The in-engine trailer was big on boss-sized enemies, and it looks like there will be a good variety of humanoid and monstrous foes to conquer. And now, with Elden Ring’s greater focus on exploration and traversal via horseback which were both shown in the trailer too, we’re expecting a world chock-full of both mysteries and horrors to unearth.",
    "So far, we also know that Elden Ring will return to the heavy elements of customization and weapon builds featured in Bloodborne and the Dark Souls series, breaking away from the predetermined character and moveset in Sekiro: Shadows Die Twice."
  ],
  "headers": {
    "3": "Elden upgrade"
  },
  "links": {
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "FromSoftware": "https://www.techradar.com/news/before-dark-souls-and-elden-ring-fromsoftwares-weird-wonderful-past",
    "Sekiro: Shadows Die Twice": "https://www.techradar.com/reviews/sekiro-shadows-die-twice"
  }
}