{
  "source": "https://www.techradar.com/news/hp-and-microsoft-are-taking-printing-into-the-metaverse",
  "title": "HP and Microsoft are taking printing into the metaverse",
  "category": "computing",
  "updated": "2021-11-10T14:36:37Z",
  "author": "sead-fadilpasic",
  "summary": "Onboarding new printer users is going virtual",
  "article": [
    "Microsoft and HP want to solve printing issues in virtual reality using a new offering called HP xRServices.",
    "Pairing with Microsoft’s HoloLens 2 augmented reality goggles, xRServices will allow users to jump into a virtual-real world combination, in which they can connect with HP engineers. They can then collaborate with HP engineers to get help and advice for any printer-related issue they might be having at any specific point in the print production.",
    "By using Microsoft HoloLens 2 together with HP xRServices, users will apparently get the feeling of being physically present with a virtual coach, eliminating the need for long service calls, or even longer downtime. The company says the service will eliminate the need for face meetings, or long travels, with a complete on-press toolset providing everything needed alongside the step-by-step guidance on hand.",
    "HP notes that another possible use case is for onboarding, as new employees could be guided through the process of learning about printing step by step, “as live” simulation.",
    "The company added that the service will be compatible with all HP industrial printer hardware, and that it will be accessible for all users, both digital natives and newbies.",
    "HP also said managers will be able to utilize HP’s Print OSx to see how to combine the data generated from doing the work, with transactional data. As a result, managers can expect more optimized, smoother future productivity.",
    "The program is currently in the beta stages of testing, and is available to select customers.",
    "The metaverse is essentially another word for virtual reality. encompassing an interactive, collaborative, and shared virtual 3D world, where users can work or entertain themselves.",
    "The term, and all it stands for, has exploded in popularity since Facebook’s Mark Zuckerberg announced that his company would be focusing more strongly on the metaverse goign forward.",
    "These are the best all-in-one printer choices around"
  ],
  "headers": {
    "3": "Compatible with all HP industrial printers"
  },
  "links": {
    "HP": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710",
    "HoloLens 2": "https://www.techradar.com/reviews/microsoft-hololens-2",
    "printer": "https://www.techradar.com/news/best-home-printer",
    "best all-in-one printer": "https://www.techradar.com/news/best-all-in-one-printer"
  }
}