{
  "source": "https://www.techradar.com/news/google-pixel-fold-could-use-the-same-display-as-one-of-its-closest-competitors",
  "title": "Google Pixel Fold could use the same display as one of its closest competitors",
  "category": "phones",
  "updated": "2021-06-08T10:07:15Z",
  "author": "hamish-hector",
  "summary": "Borrowing from the best",
  "article": [
    "Google's Pixel Fold phone could use Samsung’s ultra-thin glass (UTG) displays according to new rumors. We’ll have to take these with a pinch of salt but, if they’re true, Google’s first entry in the folding smartphone market could be a worthy competitor to the best folding smartphones out there.",
    "Right now, only Samsung’s latest Galaxy Z Fold and Z Flip smartphones use UTG displays, with most other manufacturers still opting for plastic solutions. The thin glass sheet design gives the phone’s screen an improved feel and protection, while also being flexible enough to bend and fold.",
    "This deal, if it’s true, could remove one of Samsung’s biggest advantages over the current competition in the foldable phones market. However, the rumored deal could be signs that the tech giants are looking to team up even more on future endeavors following the announcement that Google’s Wear OS is finally coming to Samsung smartwatches.",
    "Right now we don’t know that much for certain about the Google Pixel Fold but there are indications that it might be launching this year. The main piece of evidence is that the Pixel Fold’s codename ‘Passport’ was found in the Android 12 code, suggesting it could be quite a ways through development and is currently being tested.",
    "On top of that, we have a few Google Pixel Fold patents that can give us a clue as to what we might see from the folding smartphone. The most interesting one suggests that not only could the Pixel Fold have a clamshell design, but it could open up and stretch out even more for extra screen space. This seems very ambitious for a first attempt, but perhaps the tech giant is taking a ‘go big or go home' mentality.",
    "For now, most of this is just rumor and speculation, but if a launch is coming in 2021 it might not be long before an official announcement. As we learn more about the Google Pixel Fold we’ll be sure to keep you up to date with all the latest.",
    "Via 91Mobiles"
  ],
  "headers": {
    "3": "What do we know about the Google Pixel Fold?"
  },
  "links": {
    "Google's Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "best folding smartphones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Fold": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Google’s Wear OS is finally coming to Samsung smartwatches": "https://www.techradar.com/news/google-io-2021-live-blog",
    "Pixel Fold’s codename ‘Passport’ was found in the Android 12 code": "https://www.techradar.com/news/google-pixel-6-and-pixel-fold-mentioned-in-android-12-beta-code",
    "Google Pixel Fold patents": "https://www.techradar.com/news/a-future-google-pixel-foldable-phone-may-slide-in-with-a-fun-party-trick",
    "91Mobiles": "https://www.91mobiles.com/hub/google-pixel-foldable-phone-ultra-thin-glass/"
  }
}