{
  "source": "https://www.techradar.com/news/why-im-comfortable-being-trapped-with-apples-iphone",
  "title": "Why I'm comfortable being trapped with Apple's iPhone",
  "category": "phones",
  "updated": "2021-04-09T10:57:11Z",
  "author": "axel-metz",
  "summary": "Opinion: I’ll keep on eating from the Apple",
  "article": [
    "It’s quite frightening to think how integrated into my everyday life Apple and its products have become.",
    "I practically live out of my iPhone reminders, have countless midnight musings buried away in my notes app and rely far too heavily on my pair of AirPods to relax. That’s not to mention the hours whiled away in front of a Mac screen, or the old iPad that sits on the kitchen table like some sort of omniscient Eye of Sauron.",
    "This big behemoth of Silicon Valley is now so embedded into my existence that it would require a serious effort to deviate from continuing to buy its products. Of course, that’s just the way Apple likes it – but it’s also the way I like it, too.",
    "When it comes to buying my next phone, I already know where my money is going. It was the same when it was time for a new laptop – because once you’ve got an iPhone, it doesn’t matter about the competition anymore. The convenience of having all your devices married up to the same OS outweighs, in my opinion, the superior performance you might enjoy from using multiple products from different manufacturers.",
    "Apple’s business model thrives on the loyalty of consumers like me, and I’ve become such a devoted fan of its ecosystem that I’m willing to claim I’ll never buy an Android phone ever again – which, you might say, is a shame, because there are some darn good Androids out there.",
    "Take the Samsung Galaxy S21 Ultra, for example. It tops our list of the best smartphones in 2021, and for good reason. It’s got one of the best cameras on the market, phenomenal power, great battery life and a design that differentiates it from its predecessor – not a claim Apple can often make of its iPhones. Then there’s the OnePlus 8 Pro, the flagship of a once-little-known brand which packs arguably the best display around alongside formidable 5G speeds and, unlike the newest iPhones, reverse charging.",
    "Need I say more? The all-new Oppo Find X3 Pro equals or betters the iPhone 12 Pro in almost every department, and carries a price tag to match – meaning Apple is no longer the most expensive phone-maker by default, as was once the case. Then you’ve got the Xiaomi Mi 11, Motorola Edge, OnePlus 8T and many more devices all boasting features that represent companies trying new things in the face of the decidedly unremarkable iPhone 12 series.",
    "But like I said: convenience, for me, outmuscles performance. The joy – and trust me, it is joy, having once juggled an iPhone, a Windows PC and Bose earbuds – of seeing my laptop react to happenings on my phone in real-time is enough to make me think I’ll be using iPhones for the rest of my life. I can’t speak for the synergy between an iPhone and Apple Watch – a personal preference for regular wristwatches means I haven’t dipped my toe in the smartwatch water just yet – but I’d comfortably add the latter to my basket without even assessing the competition, such is my confidence in the interconnectivity of Apple’s offerings.",
    "I have willingly trapped myself in the Apple ecosystem, and I’m not looking for a way out. I’d wager that this is the case for a lot of others, too, given how effectively the company has managed to market itself as the home of ‘fashionable’ tech even when it’s products no longer always represent the height of innovation. For my money, Apple’s promise of performance, convenience and style is enough to maintain the continued loyalty of its innumerable customers, despite the leaps and bounds made by rival manufacturers that perhaps offer better products.",
    "This is the reason we at TechRadar caveat so many of our Apple reviews with lines like, “the AirPods Pro are the perfect earbuds... for Apple fans.” It’s as if the Cupertino giant designs its products under the assumption that its customers have already bought into the Apple ethos. Those looking for a standalone device – be it a phone, pair of earphones or smartwatch – would probably be unwise to assume Apple’s offerings are the best on the market, but who’s really looking for tech that doesn’t get on with the tech you already have?",
    "That’s been Apple’s gambit for years, and it’s reaped an embarrassment of riches.",
    "In this way, the question of whether Apple is truly innovative has and will continue to rage among consumers and tech experts for years to come (this is also the topic of discussion in episode one of our new Seriously? series, as it happens). Is it still a company that continues to revolutionise the world of tech in the same way as it did with the launch of the original Macintosh, iPod and iPhone? Or, having made its trillions, is Apple now happy to focus on the growth of its own ecosystem, which has expanded to streaming, banking and – in the near future – electric vehicles?",
    "Of course, it all comes down to preference. Yes, there are devices out there which scream innovation louder than any Apple product has done for several years, and I know my iPhone is far from the best around – but it’s indisputably the best for me."
  ],
  "headers": {},
  "links": {
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "equals or betters": "https://www.techradar.com/news/oppo-find-x3-pro-vs-iphone-12-pro",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "personal preference for regular wristwatches": "https://www.techradar.com/news/why-smartwatches-wont-ever-replace-my-humble-wristwatch",
    "the competition": "https://www.techradar.com/deals/smartwatch-deals-sales-prices",
    "Apple reviews": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "episode one of our new Seriously? series": "https://www.youtube.com/watch?v=RH1Roqctank&t=341s",
    "streaming": "https://www.techradar.com/reviews/apple-tv-plus",
    "banking": "https://www.techradar.com/news/apple-card-launches-as-a-new-type-of-credit-card-on-your-iphone",
    "electric vehicles": "https://www.techradar.com/news/apple-car"
  }
}