{
  "source": "https://www.techradar.com/news/ps5-1440p-support-how-much-longer-do-we-have-to-wait",
  "title": "PS5 1440p support: how much longer do we have to wait?",
  "category": "gaming",
  "updated": "2021-11-25T18:01:17Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Demand for 1440p support on PS5 is clear, so where is it?",
  "article": [
    "It’s been almost six months since the PS5 launched, but there’s still no sign of 1440p support for Sony’s current-gen console.",
    "A new PS5 update dropped yesterday, April 14, that added some welcome changes to the PlayStation UI and some much-needed additional functionality to the system, such as being able to store PS5 games on an external USB hard drive. There were also some hidden surprises, too, like being able to turn off HDR for games that don’t support it, and a clear way to enable 120Hz support on PS5.",
    "Annoyingly, though, Sony is still playing coy on when support for the PS5’s internal M.2 SSD bay will be unlocked – which means users still only have 667GB of usable PS5 storage space to for the foreseeable future to play PS5 games from. But the other big omission from the PS5 April update that seems far simpler to implement is 1440p support. Where is it?",
    "1440p is an increasingly common resolution and arguably the standard now for most monitor manufacturers and PC gamers. There’s a large number of users, then, who will be plugging their PlayStation 5 console into a monitor, especially those who stream. But unless you have a 4K display, the PS5 defaults to a 1080p output, albeit downscaled.",
    "That means those who play on a 1440p display are missing out 78% more pixels due to having to play in 1080p, which isn’t really acceptable when you consider that both the Xbox Series X and Xbox Series S do let users output at 1440p. In fact, the Xbox One actually added 1440p support in 2018. Three years later, Sony still hasn’t added the option to either PS4, PS4 Pro and more importantly, PS5.",
    "But why is that the case? Well, according to Sony’s PlayStation hardware boss Masayasu Ito and PlayStation platform boss Hideaki Nishino, it’s because the company wants to “prioritize support for TVs” (thanks, Eurogamer).",
    "Not only does that statement make little sense – the PS4, PS4 Pro and PS5 have never had a problem outputting 4K or 1080p on any display, as far as I’m aware – what makes the situation even more frustrating is that Ito-san also said “there’s no technological problem at all” in terms of the PS5 being able to support 1440p resolution. And yet...",
    "Sony has also said it’s keeping an eye on market trends to see if there’s demand for 1440p, but surely they can see that sales of 1440p monitors no doubt dwarf those of 1080p at this point. Also, if you’re selling a console that is comfortably more powerful than the PS4 Pro, where native 4K resolution was often unobtainable, do Sony really want users playing in 1080p?",
    "1440p support isn’t the only area where Microsoft has an advantage when it comes to supporting a wide variety of displays. Xbox One, Xbox Series X and Xbox Series S also received support for variable refresh rates (VRR) in 2018, which helps eliminate screen tearing and stutters that occur during minor framerate drops. It’s become another must-have feature on PC, with FreeSync and G-Sync achieving practically the same outcome, yet it’s completely absent on PS5 (though Sony has hinted VRR is coming).",
    "Auto low-latency mode (ALLM) is also missing from PS5, which prompts a TV to enable ‘Game mode’, or the equivalent of its lowest input setting, once it detects a console has been turned on. Perhaps unsurprisingly at this point, this feature is available on Xbox One, Xbox Series X and Xbox Series S.",
    "It’s worth noting that Sony is actually a TV manufacturer, while Microsoft is not. If anyone should be able to create a console that supports the latest display technology, it’s Sony. Yet it’s Microsoft who is giving users a quality of life feature that really should be a given at this point.",
    "With Sony usually taking months to drop major system updates, it’s still unclear when 1440p support on PS5 will arrive. But the longer the wait continues, the more ridiculous the situation becomes."
  ],
  "headers": {
    "5": "Display disparities",
    "8": "Visual upgrades"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "1440p": "https://www.techradar.com/news/best-1440p-graphics-cards-2019-the-best-gpus-for-1440p-gaming",
    "new PS5 update": "https://www.techradar.com/news/ps5-april-update-is-full-of-new-stuff-but-still-missing-the-most-important-feature",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "external USB hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "enable 120Hz support on PS5": "https://www.techradar.com/how-to/how-to-enable-120hz-on-ps5",
    "PS5 storage": "https://www.techradar.com/best/best-ssd-for-ps5",
    "4K display": "https://www.techradar.com/news/best-4k-monitors",
    "1440p display": "https://www.techradar.com/reviews/lenovo-yl27gq-20-gaming-monitor",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "Eurogamer": "https://www.eurogamer.net/articles/2020-11-10-sony-says-ps5-currently-doesnt-support-1440p-because-it-wants-to-prioritise-support-for-tvs",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "FreeSync and G-Sync": "https://www.techradar.com/news/computing-components/graphics-cards/nvidia-g-sync-vs-amd-freesync-1289637",
    "VRR is coming": "https://www.techradar.com/news/ps5-will-get-a-key-visual-feature-in-a-future-system-software-update-confirms-sony"
  }
}