{
  "source": "https://www.techradar.com/news/foxit-expands-into-esignatures-to-take-on-docusign",
  "title": "Foxit expands into eSignatures to take on DocuSign",
  "category": "computing",
  "updated": "2021-05-25T22:37:02Z",
  "author": "anthony-spadafora",
  "summary": "Create reusable legally-binding documents with Foxit Sign",
  "article": [
    "In addition to reading and editing PDFs, Foxit will now allow users to sign documents as the company has announced the launch of its new eSignature service.",
    "Foxit Sign is the company's new legally binding eSign service that allows users to create and sign digital contracts, agreements and forms to expedite business in an increasingly digital world. Foxit's new offering will even helps users save time as it was designed to decease the amount of clicks by 30 to 50 percent when sending a document for signature.",
    "As well as creating one-off documents, Foxit Sign users will also be able to create reusable document templates that can be filled out and signed by a different set of recipients each time. When it comes to security, the service supports 256-bit encryption, audit trails, certified completion, control of visibility and email authentication.",
    "Foxit Sign will be available with either a monthly or annual subscription and there are three different plans to choose from in the form Foxit Sign, Foxit Sign Pro and Foxit Sign Enterprise. Foxit Sign costs either $8 per month or $96 for the year, Foxit Sign Pro costs $25 per month or $300 for the year and large organizations will have to contact the company directly for a quote when signing up for Foxit Sign Enterprise.",
    "Besides announcing its new eSignature service, Foxit Software has also changed its name to Foxit and consolidated and simplified the names of its existing products. Going forward, the company's popular PDF editor, Foxit PhantomPDF for Mac and Foxit Phantom PDF Standard for Windows will now both be known as Foxit PDF Editor.",
    "Chief marketing officer at Foxit, Frank Kettenstock explained the reasoning behind the company's new branding in a press release, saying:",
    "\"With Foxit, you can PDF anywhere on any platform. You can conduct business digitally in a way that suits you. We wanted to convey that simplicity and universal experience in our new branding.\"",
    "Foxit has also released new V11 versions of Foxit PDF Editor and Foxit PDF Reader which are now available for download."
  ],
  "headers": {
    "4": "Streamlined branding"
  },
  "links": {
    "Foxit": "https://www.techradar.com/news/lockdown-may-have-helped-kill-off-paper-documents-for-good",
    "eSignature": "https://www.techradar.com/best/best-esign-software-solutions",
    "Foxit Sign": "https://www.foxit.com/esign-pdf/",
    "256-bit encryption": "https://www.techradar.com/best/best-encryption-software",
    "PDF editor": "https://www.techradar.com/best/free-pdf-editor/best/pdf-editors",
    "press release": "https://www.prnewswire.com/news-releases/foxit-introduces-foxit-sign-a-new-simple-to-use-legally-binding-esignature-service-as-part-of-its-comprehensive-pdf-solution-suite-301298108.html",
    "Foxit PDF Reader": "https://www.techradar.com/reviews/foxit-reader-free"
  }
}