{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-could-have-an-apple-watch-beating-health-feature",
  "title": "Samsung Galaxy Watch 4 could have an Apple Watch-beating health feature",
  "category": "wearables",
  "updated": "2021-06-25T15:14:12Z",
  "author": "james-rogerson",
  "summary": "Measure your muscles and fat",
  "article": [
    "The Samsung Galaxy Watch 4 was already sounding like it could be one of the most exciting wearables of the year, but now we’ve heard that it might have yet another impressive feature, namely a BIA (bioelectrical impedance analysis) sensor.",
    "That’s according to Max Weinbach (a leaker with a decent track record), and this is a sensor that should allow the watch to measure your body composition, including body fat and muscle mass. You’ll find this sort of tech in some smart scales, but it would be new to mainstream smartwatches.",
    "It would also make for a significant upgrade, as body fat and muscle mass are two key things that a lot of people will want to monitor. No Apple Watch currently has a BIA sensor either, and so far it hasn’t been rumored for inclusion in the Apple Watch 7, so this could give the Samsung Galaxy Watch 4 the edge in at least one way.",
    "That said, as ever with rumors we’d take this with a pinch of salt, especially as this is the first we’re hearing of it, despite the Samsung Galaxy Watch 4 probably launching quite soon, with August 3 being the main rumored date.",
    "If it does have a BIA sensor though that could join a new operating system, a powerful new chipset, and maybe even a glucometer (for measuring blood sugar), along presumably with all the features already found on the Samsung Galaxy Watch 3, such as an ECG and a blood pressure monitor.",
    "So with all that, the Samsung Galaxy Watch 4 could be the wearable to beat in 2021. Let’s just hope that these rumors all pan out.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Max Weinbach": "https://twitter.com/MaxWinebach/status/1408314186158030849",
    "smart scales": "https://www.techradar.com/best/best-smart-scales",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "the main rumored date": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "new operating system": "https://www.techradar.com/news/samsung-galaxy-watch-4s-major-wear-os-makeover-has-been-detailed-in-a-leak",
    "powerful new chipset": "https://www.techradar.com/news/samsung-galaxy-watch-active-4-could-be-a-very-powerful-smartwatch",
    "a glucometer": "https://www.techradar.com/news/apple-watch-7-and-samsung-galaxy-watch-4-both-could-get-potentially-life-saving-new-feature",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_watch4_bia_sensor_body_composition_monitor-news-49750.php"
  }
}