{
  "source": "https://www.techradar.com/news/old-gpu-maker-3dfx-interactive-is-making-a-comeback-we-dont-think-so",
  "title": "Old GPU maker 3dfx Interactive is making a comeback? We don’t think so",
  "category": "computing",
  "updated": "2021-08-02T12:27:45Z",
  "author": "darren-allan",
  "summary": "The prospect of a new Voodoo graphics card seems unlikely to say the least",
  "article": [
    "3dfx Interactive, a long-gone GPU manufacturer that was big in the 1990s, is poised to return to the world of graphics cards later this week, going by a tweet that has just been spotted. However, this is one we aren’t buying (though, that said, it’s not that we wouldn’t love to see such a comeback).",
    "This comes from a brand new Twitter account for 3dfx Interactive which purports to be the ‘official Twitter handle for 3dfx’, but it’s not verified, and, of course, could be pretty much anyone making this all up. The central claim being that on August 5, in just a few days’ time, 3dfx is “coming back” with what should be a “major announcement”.",
    "So, where to start with all the shakiness around this particular rumor? If this really is an official revelation from the resurrected 3dfx, you’d think it’d be able to manage the fanfare ‘returning to the GPU game’ tweet without making a glaring error (namely ‘an’ major announcement, instead of ‘a’ major announcement).",
    "You’d also expect the firm to use an image to accompany this announcement which isn’t simply a piece of fanart (taken from DeviantArt, and it’s seriously old too). Apparently the budget can’t stretch to a freshly commissioned pic and a proof-reader, which seems unlikely.",
    "If there really is a new graphics card coming from 3dfx later this week, we’ll hold our hands up and admit to being fully wrong, but little-to-nothing about this stands up to any scrutiny.",
    "Naturally, we have to be cautious around any rumor, but offerings from the mill such as this one very much underline that. It’s not even clear that there’s anything left for 3dfx to come back with, certainly not in terms of the IP which Nvidia bought up two decades ago. There is some discussion on Twitter about Team Green letting ownership of the trademark of the name lapse, mind.",
    "Another possibility floated is that the 3dfx brand is somehow coming back, just maybe not with a graphics card, but some other product. Although even that doesn’t seem like a realistic possibility, given that a follow-up tweet asks gamers out there: “You all wanna see a new 3dfx Voodoo card?” So clearly, this is supposedly about GPUs.",
    "Of course, even if we allow the theoretical possibility that 3dfx is re-joining the graphics card arena, the timing really couldn’t be worse. Remember that AMD and Nvidia (mostly the latter) have a stranglehold on the market, are apparently pushing ahead with seriously impressive next-gen products, and Intel is soon enough to join the fight to make it even trickier for another party to get in on the act.",
    "Everything about this seems like a stretch, and it very much feels like somebody out there saw the fake Interplay revival tweet last week, which caused quite a stir and a lot of excitement, and had a brainwave to jump on the bandwagon and grab their 15 minutes – or, er, 5 days rather – of Twitter infamy.",
    "Via Wccftech"
  ],
  "headers": {
    "5": "Analysis: Two can ‘Interplay’ that game"
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "DeviantArt": "https://www.deviantart.com/vermaden/art/3dfx-Legacy-442592147",
    "Nvidia": "https://www.techradar.com/news/nvidia-geforce",
    "seriously impressive next-gen products": "https://www.techradar.com/news/nvidias-rtx-4000-gpus-promise-a-huge-performance-leap-but-amd-rdna-3-might-outdo-them",
    "soon enough to join the fight": "https://www.techradar.com/news/intels-high-end-gaming-gpu-could-launch-at-ces-2022",
    "Wccftech": "https://wccftech.com/gpu-maker-3dfx-interactive-teases-a-comeback-after-20-years-major-announcement-expected-next-week/"
  }
}