{
  "source": "https://www.techradar.com/news/hit-netflix-show-squid-game-is-taking-over-roblox",
  "title": "Hit Netflix show Squid Game is taking over Roblox",
  "category": "gaming",
  "updated": "2021-09-30T09:23:09Z",
  "author": "axel-metz",
  "summary": "The Hunger Games-style TV show comes to Roblox in a big way",
  "article": [
    "Netflix’s latest hit show, Squid Game, has managed to infiltrate a fair few homes since releasing earlier this month – and it’s now found its way into Roblox, too.",
    "As first spotted by Polygon, developers in the world-building game have been using the battle royale series as a source of inspiration for various puzzles, mechanics and minigames, with some titles in the platform’s trending section attracting millions of visitors.",
    "Squid Game, a new Korean drama series which follows a group of civilians invited to risk their lives in a mysterious survival game, is currently the most-watched Netflix show in the US, and is on track to dethrone Bridgerton as the most popular show in the streamer’s history.",
    "Roblox players have developed all sorts of Squid Game-inspired games on the platform, from full-on adaptations – in the form of standard prison break challenges – to titles which borrow certain elements of the Netflix show.",
    "Squid Game (the Roblox version) and Red Light Green Light, for instance, have each attracted 8.3 million and 27.6 million visitors, respectively.",
    "The latter, from developer Slugfo, sees players tasked with having to cross an arena while being careful to avoid movement should the green light turn red – else they’ll be shot by a guard, just as in the show. You can see the game in action via the video below.",
    "Of course, since Roblox encourages players to build their own environments, this isn’t the first time developers have taken inspiration from movies and TV shows in the creation of in-game content.",
    "Some of Roblox’s most popular downloadable games are based on scenes from Star Wars, The Flash or Frozen 2, for example, with some users even developing bona fide campaign adventures based on silver screen counterparts.",
    "It seems inevitable, then, that we’re going to see a lot more Squid Game-inspired games heading to Roblox in the near future – especially as the show’s creator, Hwang Dong-hyuk, is all-but certain to be courted by the Netflix hierarchy to ensure the show’s renewal for future seasons."
  ],
  "headers": {},
  "links": {
    "Polygon": "https://www.polygon.com/22700182/squid-game-roblox-netflix-show",
    "dethrone Bridgerton as the most popular show in the streamer’s history": "https://www.techradar.com/news/squid-game-is-on-track-to-dethrone-bridgerton-as-the-biggest-show-on-netflix#"
  }
}