{
  "source": "https://www.techradar.com/news/the-best-techradar-reads-you-may-have-missed-mar-29-2021",
  "title": "The best TechRadar reads you may have missed",
  "category": "appliances",
  "updated": "2021-03-29T09:52:25Z",
  "author": "axel-metz",
  "summary": "The very best of TechRadar from the week that was",
  "article": [
    "As weeks go in Silicon Valley, the last one was a little quiet. Maybe it had something to do with the giant container ship blocking the Suez Canal? Who knows. Probably not.",
    "But despite the limited mutterings on the computing front in the last seven days, there was still plenty of tech-related news from the worlds of home entertainment, gaming and… vacuum cleaners, as it happens.",
    "Below, you’ll find the best of our web content from the past week, from a detailed rundown of Dyson’s new laser-powered dust-sucker to our look inside Amazon Prime’s latest superhero-fueled TV show, Invincible. We’ve even gone ahead and published a guide to making your e-bike last much longer – small changes for longer ranges, as they say (they don’t).",
    "There’s also a host of review and opinion content for you to sink your teeth into, but if you’re after something a little easier on the eyes (but maybe not the ears), we’ve parked the latest episode of the TechRadar Noise Cancelling Podcast at the end of this article for your convenient listening pleasure.",
    "It’s been a whole 10 years since the launch of the Nintendo 3DS, the wildly-successful handheld console that brought 3D gaming to the homes of millions without the need for 3D glasses.",
    "To celebrate, we put together a list of our favorite 3DS-related memories, from it being a reliable friend while away from home to its impressive roster of titles.",
    "Read more…",
    "The microSD slot, beloved by power users and media hoarders alike, is in jeopardy of joining the smartphone feature graveyard (remember the 3.5mm headphone jack?).",
    "The arrival of the Samsung Galaxy S21, with its abandonment of expandable memory, could sound the death knell for Android phones with microSD. We take a look at why.",
    "Read more…",
    "Vacuum cleaner technology doesn’t get the love it deserves. As helpful and as widely-used as smartphones, the humble dust-sucker has come a long way since its invention in 1901.",
    "In 2021, the Dyson V15 Detect might be the best of the best. For starters, it's a cordless vacuum cleaner that adds in lasers to help you see microscopic dust particles that would otherwise be invisible to the naked eye.",
    "Read more…",
    "If knowing Invincible is a violent, superhero-led animated series based on the works of The Walking Dead's Robert Kirkman isn’t enough to make you watch it, its star-studded cast just might.",
    "But beyond that, Amazon Prime’s new superhero show borrows from The Boys and Batman: The Animated Series to bring something fresh to the genre.",
    "Read more…",
    "An electric bike is a big investment, but a little care and maintenance will ensure it gives you years of happy riding. Any bike requires regular TLC to keep it running smoothly, but an e-bike needs a particular level of extra attention.",
    "Thankfully, e-bike expert Gavin Brough was on hand to bestow upon TechRadar his advice on how to keep your e-bike rolling for years to come.",
    "Read more…",
    "As much as the company has been a trailblazer in the world of smartphone and tablet tech, Apple isn’t known for its range of smart home devices.",
    "That said, its now-discontinued HomePod was one of the best-sounding smart speakers on the market, so could Apple’s rumored new smart display mark the first of its kind to pack truly great audio?",
    "Read more…",
    "Brace yourself for a slew of camera-related compliments. The Sony A1 covers almost every photographic niche thanks to its high-resolution sensor, super-fast burst shooting, lightning quick autofocus, professional connectivity and 8K raw video.",
    "The drawback? Its staggeringly-high price. Check out our review to see if this camera is truly worth the money.",
    "Read more…",
    "It’s been a momentous year for Sony, what with that PS5 console everybody’s talking about being released. But, when it comes to Sony TVs, it’s been something of a different story – and it’s surprising that the company behind the PS5 hasn’t been focused on compatibility across its different product arms.",
    "Now, though, Sony is starting to correct this with its 2021 TV range, as multiple HDMI 2.1 ports are confirmed for a number of models. We take a look at why this is so important.",
    "Read more…",
    "The week's biggest tech news, in podcast form! We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's show is presented by Gareth Beavis, Global Editor-in-Chief of TechRadar, and Sherri L. Smith, Editor-in-Chief of Laptop Mag, with guests James Peckham, Phones Editor at TechRadar, and Chris Barraclough, from the YouTube Channel TechSpurt, who join in (remotely, of course) to talk about the last seven days in tech.",
    "Catch up on all the latest tech gossip, from our thoughts on the OnePlus 9 and OnePlus Watch to our reaction to the new PSVR 2 controllers.",
    "Read more…",
    "You can find every episode of Noise Cancelling here too"
  ],
  "headers": {
    "4": "Our favorite memories of the Nintendo 3DS",
    "7": "Does Samsung’s Galaxy S21 mark the end of expandable storage?",
    "10": "Everything we know about Dyson’s new laser-powered vacuum cleaner",
    "13": "How Amazon Prime’s Invincible switches up the superhero genre",
    "16": "How to make your electric bike last (much, much) longer",
    "19": "Could an Apple smart display ever sound as good as the HomePod?",
    "22": "Sony A1 review",
    "25": "Sony TVs are finally catching up with the PS5",
    "28": "OnePlus 9, PSVR 2 and gifting on Tinder: Noise Cancelling podcast episode 57"
  },
  "links": {
    "Invincible": "https://www.techradar.com/news/invincible-on-amazon-prime-video-is-a-violent-but-heartfelt-superhero-show",
    "Noise Cancelling Podcast": "https://www.techradar.com/news/oneplus-9-psvr-2-and-gifting-on-tinder-noise-cancelling-podcast-episode-57",
    "Read more…": "https://www.techradar.com/news/oneplus-9-psvr-2-and-gifting-on-tinder-noise-cancelling-podcast-episode-57",
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Sony TVs": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "YouTube Channel TechSpurt": "https://www.youtube.com/channel/UCVLN0tY51ewH44wUtx3YZTA",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "You can find every episode of Noise Cancelling here too": "https://audioboom.com/channels/5019679"
  }
}