{
  "source": "https://www.techradar.com/news/sigmas-super-telephoto-lens-could-be-the-new-zoom-king-for-mirrorless-cameras",
  "title": "Sigma's super-telephoto lens could be the new zoom king for mirrorless cameras",
  "category": "cameras",
  "updated": "2021-08-04T17:20:44Z",
  "author": "mark-wilson",
  "summary": "New treat for owners of Sony and Panasonic full-frame cameras",
  "article": [
    "Sigma has taken the wraps off its new super-telephoto lens for Sony and Panasonic full-frame mirrorless cameras – and it looks like a compelling new options for sports and wildlife snappers.",
    "The Sigma 150–600mm F5-6.3 DG DN OS Sports lens has landed for both E-mount and L-mount cameras, which means those from Sony, Panasonic, Leica and, of course, Sigma itself. Sadly for Canon and Nikon fans, there's no sign of a version for their RF-mount or Z-mount cameras yet.",
    "Based on the existing Sigma 150-600mm f/5-6.3 DG OS HSM S lens for DSLRs, Sigma says its mirrorless version has been designed from the ground up for full-frame mirrorless cameras. While the headline is that huge zoom range, there are quite a few interesting features that could sway photographers beyond that huge reach.",
    "Firstly, the 150–600mm F5-6.3 DG DN OS Sports is compatible with Sigma's 1.4x and 2x L-mount teleconverters, which means you could take its focal lengths to 1200mm (with autofocus) on a camera like the Panasonic Lumix S5.",
    "Naturally, you'll need some stabilization at those kind of focal lengths, and fortunately Sigma's ultra-telephoto has a four-stop optical stabilizer on hand to keep your shots steady. Interestingly, there's also a 'Dual Action Zoom' system which lets you zoom in two ways – using the traditional ring-twisting method, or by pushing the lens out in the direction you're shooting.",
    "Super-telephotos are renowned for their hernia-inducing heft, so how weighty is the 150–600mm F5-6.3 DG DN OS Sports? Well, it is pretty heavy at 2.1kg, but that's not significantly beefier than its main rivals. The Sony FE 200-600mm f/5.6-6.3 G OSS, for example, weighs a very similar 2.12kg, while the Tamron 150-500mm f/5-6.7 Di III VC (which is also only available for Sony cameras) sits at 1.725kg on the scales.",
    "Sigma is naturally promising fast and accurate autofocus from its new lens, which is something we'll have to test, but it certainly has strong heritage from the DSLR version it's based on. The lens also has 25 elements in 15 groups and nine aperture blades, which should produce some tasty bokeh.",
    "You'll be able to buy the Sigma 150-600mm F5-6.3 DG DN OS Sports from August 27 for $1,499 / £1,199 (around AU$2,262), which again compares pretty favorably to its rivals.",
    "That's considerably less than the Sony FE 200-600mm f/5.6-6.3 G OSS which cost $2,000 / £1,800 when it launched in 2019 and has stuck around that price. And it's comparable to the Tamron 150-500mm f/5-6.7 Di III VC, which you can find now for $1,399 / £1,379, despite that lens offering 100mm less reach.",
    "Of course, any four-figure lens isn't exactly a impulse buy at the grocery checkout, but this Sigma's versatility could be hugely tempting for owners of Sony and Panasonic full-frame cameras.",
    "The 150-600mm F5-6.3 DG DN OS Sports focuses at a relatively close 58cm at its widest end and is also weather-sealed, which means you get both dust- and splash-resistance. The only real question is how that autofocus performs, as it's particularly important for his lens' target subjects of wildlife, motorsports and pretty much anything that moves quickly.",
    "It's a shame there aren't yet any plans for an RF-mount or Z-mount version of Sigma's new lens, but it certainly makes the super-telephoto decision a lot harder for Sony and Panasonic fans, who now have a pretty healthy range of options from Sony, Tamron and now Sigma."
  ],
  "headers": {
    "7": "Analysis: Super-telephoto could offer super value"
  },
  "links": {
    "full-frame mirrorless cameras": "https://www.techradar.com/news/best-full-frame-mirrorless-camera",
    "Panasonic Lumix S5": "https://www.techradar.com/reviews/panasonic-lumix-s5"
  }
}