{
  "source": "https://www.techradar.com/news/the-xbox-series-s-is-in-stock-at-amazon-move-fast",
  "title": "Xbox Series X now out of stock at Amazon",
  "category": "gaming",
  "updated": "2021-02-12T17:33:32Z",
  "author": "tabitha-baker",
  "summary": "Xbox Series X is now out of stock at Amazon",
  "article": [
    "Update: This Xbox Series X restock has now run out - but be sure to keep checking the retailer links below as you never know when more stock will appear.",
    "The Xbox Series X is now in stock at Amazon for $499.99, but things are going to move fast here so we wouldn't spend too long outside of checkout.",
    "Microsoft’s flagship console is extremely popular at the moment, with Xbox Series X stock continuing to fly off the shelves as soon as it arrives. While Microsoft has promised more stock is on the way, the next-gen system continues to be hard to find.",
    "The Xbox Series X has been one of the hottest products in 2020, and as more great titles come to Xbox, it's sure to be a big seller in 2021. Don't miss out before stock is snapped up once again, then.",
    "Not in the US? Scroll down for the best Xbox Series X offers in your area.",
    "The Xbox Series X and Xbox Series S are in high demand right now, and for good reason. The cheaper Xbox Series S allows for next-gen gaming at 1440p resolution and up to 120fps thanks to its modern GPU and powerful CPU.",
    "We've written extensively about the Xbox Series S's features in our Xbox Series S review and were impressed by Microsoft's cheaper albeit less powerful machine."
  ],
  "headers": {
    "5": "Xbox Series X restocks:",
    "7": "Where to buy Xbox Series X: quick links"
  },
  "links": {
    "at Amazon for $499.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08H75RTZ8%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1037280468065177900-20",
    "Xbox Series X and Xbox Series S": "https://www.techradar.com/news/xbox-series-x-vs-xbox-series-s-which-xbox-will-be-right-for-you",
    "Xbox Series S review": "https://www.techradar.com/reviews/xbox-series-x/reviews/xbox-series-s"
  }
}