{
  "source": "https://www.techradar.com/news/epic-games-store-announces-spring-showcase-and-sale-event",
  "title": "Epic Games Store announces Spring Showcase and sale event",
  "category": "computing",
  "updated": "2021-02-10T16:00:19Z",
  "author": "axel-metz",
  "summary": "Big news and big sales",
  "article": [
    "Epic Games has announced a Spring Showcase event on the Epic Games Store which will see several big-name titles discounted, in addition to a host of announcements and gameplay previews for new games coming to the digital store.",
    "Featuring “a curated collection of exciting new announcements, gameplay, developer insights and more,” the Spring Showcase aims to introduce fans to upcoming titles and offers sizable price cuts on some of the store’s post popular games.",
    "The event will be streamed live on February 11 (at 2:00 PM EST / 11:00 AM PST / 19:00 GMT) via the official Epic Games Twitch channel, when several titles including Star Wars: Squadrons, Cyberpunk 2077 and Assassin’s Creed: Valhalla will go on sale.",
    "While the full list of discounts isn’t yet available, we’ve picked out some highlights revealed so far:",
    "Epic Games has also announced that Star Wars: Battlefront II owners will enjoy further discounts on other Star Wars titles. Eligible players will be able to purchase Star Wars Jedi: Fallen Order at 55% off and Star Wars: Squadrons at 50% off.",
    "The sale runs until February 25 (at 11:00 EST / 08:00 PT / 16:00 GMT).",
    "The showcase and sale event marks another signal that the Epic Games Store remains a dominant presence in the PC gaming market.",
    "The company also has big plans to keep players engaged with its digital storefront in the coming years. According to one Epic Games rep, the developer has “more exclusives coming in the next two years than [it has] published to date”.",
    "It makes sense, then, that Epic Games is so keen to share what titles it has to offer players via a dedicated livestream event. Could we see another game of Fortnite proportions soon? We’ll be tuning in on February 11 to find out.",
    "Via KitGuru"
  ],
  "headers": {
    "6": "Digital dominance"
  },
  "links": {
    "Spring Showcase event": "https://www.epicgames.com/store/en-US/news/introducing-the-epic-games-store-spring-showcase-and-sale-coming-february-11",
    "Epic Games Twitch channel": "https://www.twitch.tv/epicgames",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Assassin’s Creed: Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "one Epic Games rep": "https://www.pcgamer.com/there-are-more-epic-store-exclusives-coming-over-the-next-2-years-than-have-released-so-far/",
    "KitGuru": "https://www.kitguru.net/desktop-pc/mustafa-mahmoud/epic-games-showcase-announced/"
  }
}