{
  "source": "https://www.techradar.com/news/the-apple-m1-max-means-you-dont-need-a-gaming-laptop-for-video-editing-anymore",
  "title": "The Apple M1 Max means you don't need a gaming laptop for video editing anymore",
  "category": "computing",
  "updated": "2021-10-20T16:09:04Z",
  "author": "jackie-thomas",
  "summary": "Analysis: time to leave the RGB keyboard at home",
  "article": [
    "Editors note: In the original story, we said that the Dell XPS 15 doesn't have a full SD Card reader, that is incorrect, it does. Original story with this correction continues below:",
    "It finally happened, Apple released the M1 Pro and M1 Max nearly a year after it launched the M1 in November 2020. While Apple's first go at making its own silicon for laptops was super impressive, these new chips definitely have our attention and even more so than the last time around.",
    "Because at the end of the day, the Apple M1 was behind the MacBook Air and 13-inch MacBook Pro. These are powerful devices for everyday use, to be sure, but there was no shortage of Ultrabook-class laptops before. However, these more powerful chunks of silicon could be a game-changer for creatives, especially when you consider the wider variety of ports available this time around.",
    "If Apple's claims about the M1 Pro and M1 Max are accurate – and it's a bit too soon to say one way or the other – creative professionals who have been relying on edgy-looking devices like the Razer Blade 15 or the Gigabyte Aero will be able to get that performance elsewhere, and likely more efficiently.",
    "MacBooks aren't gaming laptops, no matter how much the company will claim otherwise with its Apple Arcade inclusion. However, gamers aren't the only ones that need fast graphics cards.",
    "More than ever, creative applications like Adobe Premiere, Blender and more are leaning into the huge amount of compute power available in modern GPUs – especially the ones from Nvidia. That means CUDA has become more important than ever, and Apple has been slow to add decent GPUs to its laptops, especially since it effectively banned Nvidia GPUs from running with its hardware – read more in this Gizmodo blog if you want the story on that beef.",
    "Instead, the MacBook Pro 16 2019, which was the last high-powered laptop Apple launched, had the AMD Radeon Pro 5500M with 4GB of VRAM. That's not a lot for video editing.",
    "So while our review of the MacBook Pro 16 was pretty positive, I couldn't personally take it seriously as a professional mobile workstation, because it had such a weak GPU. But from the looks of it, and going entirely off of Apple's own claims – which we will absolutely test when we get our hands on it - that has changed.",
    "Apple is claiming that the M1 Max can compete with the Razer Blade 15 Advanced with the same graphics performance, but with significantly less power consumption. That's one of our favorite laptops, and it's one that is a huge hit with creatives.",
    "One of the trends we've noticed with gaming laptop manufacturers recently is that they've been just rebranding gaming laptops and re-releasing them for creative professionals that want the power that a gaming laptop offers, but with a more office-friendly aesthetic. For the most part, this has been fine, but it has led to some gaming mainstays like the Gigabyte Aero 15 being pitched to creatives instead of gamers because someone who makes their money on their laptop will probably spend more money than someone looking to play Fortnite with ray tracing enabled.",
    "This has led to some pretty spiffy laptops, though, like the Razer Blade 15 Studio Edition. But, again, while it has some security upgrades and different graphics processors (like a Quadro GPU), it's still basically a gaming laptop with a fresh coat of paint.",
    "But the MacBook Pro isn't. This laptop is designed from the ground up for creative professionals, and has some considerations that are going to be a big deal, especially for folks that need to stay mobile.",
    "It's one thing that the MacBook Pro is going to be powerful, but what's perhaps more important is that it's going to be efficient as well. If Apple's power efficiency claims are accurate, we're going to see some incredible battery life coming out of the new MacBook Pro, and it's going to make Intel and Nvidia sweat a little.",
    "Don't get us wrong, gaming laptop battery life has come a long way in the last couple of years, but that only happened once AMD put the pressure on Intel with its Ryzen 4000 processors, namely behind the Asus ROG Zephyrus G15 in 2020.",
    "But even a year after that laptop came out, we're still getting laptops that are struggling to break 5 or 6 hours of battery life. Again, we have to mention the Razer Blade 15. The latest model was only able to get around 6 hours of battery life in our testing.",
    "Apple is claiming that the 14-inch MacBook Pro can get up to 17 hours of battery life and the 21-inch one can get up to 21 hours. We've never seen a manufacturer's battery life claims be realistic, but if the 14-inch gets 12 hours and the 16-inch gets 15 hours, that's going to be huge.",
    "Thunderbolt 4 is pretty incredible, there's no way around it. You can use it to power basically any device under the sun, and do it incredibly quickly. But it also means that a laptop that only uses it is a pain in the ass for anyone that has a lot of legacy devices.",
    "Let's just look at the 16-inch Macbook Pro. On the right-hand side of the device, there's an SDXC card reader, Thunderbolt 4 and an HDMI port. Over on the left side, there's the new MagSafe connector (thank goodness), two more Thunderbolt 4 readers and a headphone jack.",
    "There might not be any USB-A slots, but USB-A frankly needs to die anyway. The ports that creative professionals actually need are there, namely the HDMI and the SDXC reader. I'm not a professional photographer, and even I need to break out a dongle every time I take product photos, just to get them onto my Mac for editing. It's a huge hassle, and more of a hassle than needing a USB-A reader.",
    "But now that Apple has woken up and realized that creative professionals need something that's functional rather than a fashion accessory, maybe we'll stop this trend of other laptop manufacturers trimming useful ports too.",
    "The first thing that comes to mind here is the Dell XPS 15. We love that laptop to death, but there's no HDMI port there, it's USB-C all the way.",
    "It could be argued that Apple started the trend of making laptops thinner and thinner and cutting out all the ports, which is what has driven a lot of creatives to gaming laptops, on top of the sheer power that CUDA-powered GPUs offer. And, well, maybe Apple going back to having actual ports will make other laptop manufacturers start to include more expansion again.",
    "Well, at least for some laptops. Wake us up when the 13-inch MacBook Pro has at least a microSD card reader."
  ],
  "headers": {
    "4": "A GPU that doesn't suck?",
    "9": "Laptop manufacturers need to wake up",
    "16": "Oh yeah, the ports, lol"
  },
  "links": {
    "M1 Pro and M1 Max": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "Apple M1": "https://www.techradar.com/news/apple-m1-chip",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Razer Blade 15": "https://www.techradar.com/reviews/razer-blade-15-2021",
    "Gigabyte Aero": "https://www.techradar.com/reviews/gigabyte-aero-15-oled-2020",
    "Adobe Premiere": "https://www.techradar.com/reviews/adobe-premiere-pro-cc",
    "Gizmodo": "https://gizmodo.com/apple-and-nvidia-are-over-1840015246",
    "video editing": "https://www.techradar.com/news/best-laptops-for-video-editing",
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "Razer Blade 15 Advanced": "https://www.techradar.com/reviews/razer-blade-15-2021",
    "Razer Blade 15 Studio Edition": "https://www.techradar.com/reviews/razer-blade-15-studio-edition-2020",
    "Asus ROG Zephyrus G15": "https://www.techradar.com/reviews/asus-zephyrus-g14",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020"
  }
}