{
  "source": "https://www.techradar.com/news/best-horror-movies-to-stream-and-how-to-watch-them",
  "title": "10 best horror movies to stream and how to watch them this Halloween",
  "category": "audio-visual",
  "updated": "2021-10-28T14:01:51Z",
  "author": "daniel-pateman",
  "summary": "The most brilliant fright flicks according to the critics",
  "article": [
    "Tired of watching masked killers reanimated for another reboot? Scared to sit through one more Stephen King re-imagining, or believe that Freddy, Michael and Ghostface should be laid to rest once and for all? Then our guide to the 10 best horror movies to stream and how to watch them should thrill you with a collection of original, provocative, and downright disturbing titles as judged by critics.",
    "While there are plenty of 2021 horror movie releases on the way, this list is culled from influential aggregator service Rotten Tomatoes, these 10 movies represent that platform’s highest rated horror flicks, which required at least 40 reviews from a venerated group of film critics and journalists to make the grade. It’s a fantastically unique selection, featuring a Swedish vampire love story, MGM’s notorious 1930s classic Freaks, the shattering debuts of Jordan Peele and Jennifer Kent, postmodern horror-comedies, and zombies…lots and lots of zombies!",
    "Previously best known for his comedy sketch show, Jordan Peele wowed moviegoers with his smart and scary directorial debut, which effortlessly blended humor, terror, and social commentary to deliver an incisive critique of race relations in modern America.",
    "Daniel Kaluuya is excellent as Chris, a Black man anxious about meeting his white girlfriend’s parents for the first time. Dean and Missy Armitage (Bradley Whitford and Catherine Keener respectively) appear generally affable, projecting an attitude of middle-class tolerance. Yet the strange behavior of their housekeeper Georgina, and the blasé re-appearance of a Chris’s old friend Andre, reported missing 6 months ago and whose demeanour now appears “white-washed”, suggests that the Armitage family is involved in some horrible conspiracy.",
    "Get Out would end up earning over $255 million dollars worldwide, spawn a whole host of memes, and joins the illustrious ranks of The Silence of the Lambs and Alien as one of a handful of horror movies to be honoured with an Academy Award, now considered one of the best modern horror movies.",
    "Streaming options:",
    "“If it’s in a word, or it’s in a look, you can’t get rid of the Babadook!” This brilliantly creepy horror film about a widowed mother whose six-year-old son becomes convinced of the existence of a threatening monster – the titular Babadook – provides a frightening yet heartfelt metaphor for grief and the need to confront it.",
    "Elsie Davis is sympathetically relatable as Amelia, burnt out by the strain of parenting solo and whose nerves are frayed when Sam starts acting out, accusing the Babadook – a character in a pop-up story – for a series of bizarre occurrences. She attempts to destroy the book. But it only returns to taunt her with prophetic rhymes and disturbing illustrations of Amelia descending into violent madness.",
    "Like The Shinning, one of director Jennifer Kent’s inspirations, The Babadook taps into anxieties about parenthood, mental collapse, and facing up to the dark corners within ourselves. Horror legend William Friedkin declared that he’d \"never seen a more terrifying film,” and that’s high praise indeed. But, as well as scaring you senseless, The Babadook manages to be mordantly funny, psychologically incisive, and optimistically hopeful too.",
    "Streaming options:",
    "We know that when a couple get frisky in a horror movie, they’ll eventually be choked out by their own entrails. Sexual transgression equals death. Writer-director David Robert Mitchell’s indie horror uses this genre convention to explore the existential anxieties stemming from sex. Not just the possibility of infection and STDs, but a loss of innocence heralded by adolescence, the fear of adulthood and death.",
    "Set in Michigan at the end of summer, the film begins with 19-year-old Jamie in the dreamy early stages of her relationship with boyfriend Hugh. But, once they’ve been physically intimate for the first time, she’s drugged, only for Hugh to impart some terrible news: from now on, wherever she goes, she’ll be followed by an entity only she can see. It might look like a stranger or a family friend. But it won’t stop pursuing her until she’s dead. It turns out the only way to halt the curse is by sleeping with somebody else.",
    "Maika Monroe stars as Jamie, alongside Kier Gilchrist, Daniel Zovatto, and Olivia Luccardi as friends Paul, Greg, and Yara. As the group grapple with Jamie’s paranoia and find themselves hunted down too, death threatens to emerge from out of nowhere, with director Mitchell’s wide-angle camerawork really ratcheting up the tension as “it” relentlessly pursues them.",
    "Streaming options:",
    "Dubbed “this generation’s The Exorcist”, Ari Aster’s directorial debut blends a gruelling family drama with supernatural excesses, delivering a terrifying exploration of inherited trauma and grief that will stay with you long after the credits roll.",
    "Award-winning actress Toni Collette delivers a career-defining performance as Annie Graham, a miniature artist who feels her mother’s influence persist from beyond the grave, along with Gabriel Byrne as husband Steve, Alex Wolff as teenage son Peter, and Milly Shapiro as their distinctly odd, tongue-clucking 13-year-old daughter Charlie. Come the second half it’s a full-throttle affair, as the family come to realize they’re the pawns in some diabolic plan. Not for the feint hearted.",
    "Streaming options:",
    "Excising the more hackneyed elements of vampire mythology from Ajvide Lindqvist’s 2004 novel, and filmed from a screenplay by the author, Let the Right One In focused on the burgeoning relationship between two young, tormented characters in 1980s Sweden: bullied 12-year-old boy called Oskar, and Eli, a pale-faced child whose arrival next door coincides with a spate of violent murders.",
    "There’s a hushed restraint to the depiction of the bond between these two troubled souls, and the cinematography of the dark, snow-caked surroundings is starkly beautiful. It’s this languorousness that makes the grisly eruptions of violence all the more shocking, including a woman exposed to sunlight bursting into flames and a number of ghastly deaths carried out to keep Eli alive. The film bagged the Nordic Film Prize in 2008, and was nominated for BAFTA’S Best Film Not in the English Language too.",
    "Streaming options:",
    "Tod Browning’s infamous, pre-Hays code horror film still shocks today. At the time it was released, mainstream audiences couldn’t stomach the taboo subject matter, and this brilliantly subversive picture bombed at the box-office and almost ended Browning’s career.",
    "At a truncated 62 minutes, the film introduces us to a group of sideshow performers, including Harry and Daisy Earles as Hans and Frieda, two performers with Dwarfism; Siamese twins Daisy and Violet Hilton, and Elvira and Jenny Lee Snow, both of whom were born with microcephaly. Into their troupe comes the glamourous trapeze artist Cleopatra (Olga Baclanova), who immediately wins the affection of Hans. Cleo is dismissive, however; that is, until she learns of his large inheritance. Then, aided by strongman Hercules, she plots to marry and then murder him.",
    "Freaks gained a reputation for being exploitative to people with disabilities. But it’s those society deems normal that are the most repugnant here. Cleopatra rounding mocks the good-natured bonhomie of the sideshow performers, who willingly accept her as “one of us! One of us!”, despite her outsider status. Perhaps it was the grotesque karma of her comeuppance that ensured the film stayed banned in countries like the UK for decades to come.",
    "Streaming options:",
    "Richard Matheson’s 1954 novel I Am Legend substantially influenced the script of Night of the Living Dead, despite that novel’s antagonists being premised on vampires. And so amazingly, that post-apocalyptic tale about the last man on earth being hunted by blood-suckers is also partly responsible for the birth of the modern zombie.",
    "George A. Romero’s low-budget horror film concerns a spate of mysterious attacks across America’s east coast, where the recently dead are returning to life to devour the living. In rural Pennsylvania, a small band of survivors have boarded themselves up in an abandoned farmhouse, including the comatose Barbra (Judith O’Dea), Ben, a pragmatic Black man (Duane Jones), and a sick young girl and her parents. While they bicker and struggle to comprehend their situation, growing hordes of the undead amass outside and threaten to engulf them.",
    "It’s a nihilistic vision of America at the end of the sixties, echoing the violent images of the war in Vietnam and anti-Black violence that were being broadcast daily on TV into American homes. In addition to the genre’s requisite thrills, we can credit Romero with giving the zombie flick some real bite too. His subsequent movies, most notably 1978’s Dawn of the Dead, would equally provide a scathing commentary on the times in which they were made.",
    "Streaming options:",
    "This Japanese horror movie from Shin'ichirō Ueda, depicting the filming of a low-budget horror movie whose production is soon plagued by real zombies, was a no-budget affair whose ingenious premise eventually gained it worldwide acclaim. IndieWire declared it “the best zombie comedy since Shaun of the Dead”. It earned a little over $30 million worldwide to reap in a thousand times more than its micro $25,000 budget, and made box-office history in the process.",
    "One Cut of the Dead takes a post-modern approach to the horror film, wringing both laughs and splatter from reanimated cadavers. The first part depicts the filming of the 37-minute long take that comprises the ‘movie within the movie’, with Takayuki Hamatsu playing a director so desperate for success that he forms a blood pentagram in the middle of the set to conjure actual flesh-eaters back from the dead. The second section takes the form of a post-production documentary, while the final act goes ‘behind the scenes’ of the manic, live on-air one-take shoot.",
    "It’s a hilarious celebration of the genre, displaying the same zeal for film-making that a zombie would feel for a buffet of Nobel Prize-winning brains.",
    "Streaming options:",
    "Fans of 80s horror should get a huge kick out of this postmodern love-letter to the genre. Directed by Drew Godard and co-written with Buffy creator Joss Whedon, every cliched convention is present and correct here: a bunch of pretty young things looking to party; a marijuana-loving college student; creepy gas station attendants, and people illogically saying “let’s split up” when they’re in danger. But then Cabin in the Woods entertainingly subverts our expectations.",
    "Chris Hemsworth, Kristen Connolly, Jesse Williams and Anna Hutchison star as your typical slasher movie archetypes, “the athlete”, “the virgin”, “the scholar” and “the whore”, all of whom are heading on vacation to their cousin’s cabin. However, the audience knows from the start that their every move is being manipulated. We see the staff of a huge underground lab, where they control their behavior and the environment, taking bets on which deadly creatures they’ll unleash. It turns out that adhering to these conventions, the horror-movie blueprint, is a ritual necessary to appease ancient gods and avert apocalypse.",
    "It’s a thrilling, fun, and wry commentary on the nature of horror movies, affectionately illuminating their artifice and subverting it, e.g., a female character finding a one-way mirror that overlooks the bedroom of her buff male crush. And, come the final act, it gets brilliantly bonkers when the remaining survivors descend into a subterranean lair, which reveals a vast grid of monsters and mythological creatures just waiting to be unleashed.",
    "Streaming options:",
    "Robert Eggers is a master at slow-burning paranoia and bone-deep dread, and his debut movie holds viewers in a torment of tension. It was another genre hit for indie powerhouse A24, the production company behind the They Come At Night and Hereditary. Yet, more so than the latter film, Egger’s horrors remain fairly ambiguous throughout: teasing us with nightmarish sights, sounds and accusations until that deliciously awful final encounter.",
    "Set in 1690s New England, Egger’s establishes The Witch as an authentic period piece while articulating the God-fearing fervor of America’s Puritan settlers. William’s family, including wife Katherine and their eldest child Thomasin (Anna Taylor-Joy), have recently been exiled from their former colony and now live in the shadow of a large, gloomy forest. One day, their infant child disappears while under Thomasin’s care, and son Caleb later returns from the woods naked and feverishly ill. As the family’s litany of misfortune grows, they begin to suspect their eldest daughter of being involved with diabolical, satanic forces.",
    "Streaming options:",
    "Discover more:"
  ],
  "headers": {
    "2": "1. Get Out (2017)",
    "6": "2. The Babadook (2014)",
    "10": "3. It Follows (2014)",
    "14": "4. Hereditary (2018)",
    "17": "5. Let The Right One In (2008)",
    "20": "6. Freaks (1932)",
    "24": "7. Night of the Living Dead (1968)",
    "28": "8. One Cut of the Dead (2017)",
    "32": "9. The Cabin in the Woods (2012)",
    "36": "10. The Witch (2016)"
  },
  "links": {
    "2021 horror movie": "https://www.techradar.com/news/new-horror-movies",
    "best modern horror movies": "https://www.techradar.com/best/best-horror-movies-2021"
  }
}