{
  "source": "https://www.techradar.com/news/canon-explains-why-its-discontinued-some-ef-lenses-for-its-dslrs",
  "title": "Canon explains why it's discontinued some EF lenses for its DSLRS",
  "category": "cameras",
  "updated": "2021-04-23T14:14:25Z",
  "author": "mark-wilson",
  "summary": "It's all about \"optimization\", apparently",
  "article": [
    "Canon has reportedly discontinued a big batch of EF lenses recently, but the camera giant has stressed that this doesn't mean it's \"abandoning\" its older lens mount for DSLR cameras.",
    "Two weeks ago, Canon Rumors claimed that the company had added nine more EF and EF-S lenses to a discontinued list that already contained 15 lenses. At this stage, the site's list of apparently end-of-life lenses is now 26 entries long, which suggests that the switch to its mirrorless-friendly RF mount is quickly gathering pace.",
    "When we asked Canon if the lenses in that list were indeed discontinued, it told us \"we have a diverse collection of EF lenses available and will continue to manufacture and market them where there is customer demand.\" But Canon Australia has now been a little more forthcoming on the subject in a statement given to Inside Imaging.",
    "In its statement to Inside Imaging, Canon said: \"Over the past two years, we've been focused on building out our range of RF lenses to expand the creative possibilities of our R-System consumers, however our commitment to supporting our EF lens range is unwavering.",
    "\"It's true, Canon has recently discontinued select EF lenses in our range, however this is a process of series optimization, not an indication of us abandoning EF lenses.\"",
    "Canon went on to add: \"Lenses that have been recently discontinued are lenses that have multiple versions available; comprise technology that's been superseded by other available options; or, are low volume lenses. There are still many options for creators to choose from in our EF range, while our RF range continues to expand.\"",
    "It's certainly true that there are still a huge range of lenses for those with EF and EF-S mount cameras to choose from. And to be fair, the average age of the lenses that are on the chopping block is 14 years old. But some of the apparently discontinued lenses, in particular those for the EF-S mount, also don't appear to have alternative options.",
    "As ever, the reality is likely somewhere in between the two debates – Canon is undoubtedly (and understandably) focused on its mirrorless RF mount, which is worth bearing in mind when you're buying a new camera. But it also certainly hasn't abandoned its EF mount just yet.",
    "Some of the apparently 'discontinued' lenses are still available to buy, as plenty of stock already exists. This is another potential reason why some lenses are no longer being produced, as enough samples exist to satisfy demand for some time yet.",
    "On the other hand, only one of the four lenses that Canon Rumors has suggested will be discontinued \"some time in 2021\" – the Canon EF 35mm f/2 USM – is currently in stock on Canon's official store, with the three end-of-life telephotos (the EF 300mm f/2.8L IS USM II, EF 400mm f/4 DO IS USM II and EF 500mm f/4L IS USM II) all currently unavailable to buy.",
    "So while EF and EF-S mount cameras do still currently have a wider choice of lenses than RF mount models like the Canon EOS R5, that choice is getting whittled down quickly – and the dial is quickly swinging towards its mirrorless cameras."
  ],
  "headers": {
    "6": "Glass furnace"
  },
  "links": {
    "reportedly discontinued": "https://www.techradar.com/news/canon-just-discontinued-a-load-more-ef-lenses-for-its-dslr-cameras",
    "Canon Rumors": "https://www.techradar.com/news/canon-just-discontinued-a-load-more-ef-lenses-for-its-dslr-cameras",
    "Inside Imaging": "https://www.insideimaging.com.au/2021/canon-clarifies-on-discontinued-ef-lenses/"
  }
}