{
  "source": "https://www.techradar.com/news/iphone-13-pro-and-pro-max-have-more-storage-more-zoom-and-more-power",
  "title": "iPhone 13 Pro and Pro Max have more storage, more zoom and more power",
  "category": "phones",
  "updated": "2021-09-15T15:03:52Z",
  "author": "tom-bedford",
  "summary": "Apple's two new top-end smartphones",
  "article": [
    "In case you missed it, Apple just unveiled the iPhone 13 at its big annual soirée, alongside the new iPad (2021), iPad Mini (2021), and Apple Watch 7 - and the four new smartphones in this line are capped off by the iPhone 13 Pro and Pro Max.",
    "These two high-end smartphones have plenty of top features including powerful cameras, a high-spec chipset and 5G connectivity, so they earn their place as the new flagship devices from the company. They replace the iPhone 12 Pro models, though they're pretty similar in a few key areas.",
    "Let's start with the new features. The A15 Bionic chipset is apparently the \"world's fastest smartphone chip\" according to the Apple website, and it promises to be great for gaming, video editing and AI tasks. The phone also comes in a 1TB storage option, twice as much as Apple's previous phones have offered, for people who have lots of data they want to store.",
    "The screens now reach 120Hz, a feature phone fans have been demanding for a while now, though it's an adaptive refresh rate so you'll only hit it for certain tasks. This means the display can refresh 120 times per second, instead of 60 times like on previous iPhones, which can make motion look smoother.",
    "The camera system has some improvements like a new 3x zoom telephoto lens, a brand-new macro mode (which iPhones didn't previously have) for close-up photography, Pro video shooting and improved Night mode.",
    "Oh, and if we can briefly jump into Opinion territory for a brief second: we're big fans of the new iPhone 13 Pro colors, as it comes in lovely gold and blue tones, as well as plainer graphite and silver options.",
    "Beyond that, the iPhone 13 Pro and Pro Max are similar to their predecessors. Their displays are 6.1 and 6.7 inches across respectively, they have three rear cameras and one front 12MP camera, they work with Apple's MagSafe accessories, they support wireless charging, they have Lightning Ports for slow charging, and they come in 128GB, 256GB and 512GB storage versions as well as the new 1TB option.",
    "If you can look beyond Apple's rampant hyperbole, these new iPhones aren't exactly giant steps up from the iPhone 12 Pro and Pro Max, but the tweaks might appeal to some. Plus, while the prices are mostly the same, in the UK each phone is actually £50 cheaper than its iPhone 12 series equivalent. Bargain! You can see the rest of the prices below.",
    "The iPhone 13 Pro models are available to check out now from Apple's website. They'll go on sale on September 24, with pre-orders beginning September 17."
  ],
  "headers": {
    "6": "Medium change"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "new iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad Mini (2021)": "https://www.techradar.com/reviews/ipad-mini-2021",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "MagSafe accessories": "https://www.techradar.com/best/best-magsafe-accessories",
    "Apple's website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6826457531712998000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fshop%2Fbuy-iphone%2Fiphone-13-pro"
  }
}