{
  "source": "https://www.techradar.com/news/save-on-the-sony-wf-xb700-with-these-stellar-wireless-earbuds-deals",
  "title": "Save on the Sony WF-XB700 with these stellar wireless earbuds deals",
  "category": "audio-visual",
  "updated": "2021-04-06T10:55:58Z",
  "author": "olivia-tambini",
  "summary": "Grab these wireless earbuds while you can",
  "article": [
    "If you're looking for a fantastic wireless earbuds deal, check out these brilliant discounts on the Sony WF-XB700 in the US and the UK, which sees the in-ear headphones plummet in price. (Not in the US or UK? Scroll down for the best Sony WF-XB700 prices in your region.)",
    "If you're in the US, you can get the Sony earbuds for $69, saving you over $60 on the original retail price of $129.99.",
    "The true wireless earbuds have also been discounted in the UK, with Amazon slashing the price to just £69, again, saving you £60.",
    "These prices aren't the absolute lowest we've seen, but they're pretty close, and well worth snapping up if you need a pair of wireless earbuds.",
    "For their price, you could do a lot worse than the Sony WF-XB700 True Wireless Headphones. They are a marked improvement on the original WF-1000X and WF-SP700N, and without a doubt our second-favorite Sony true wireless earbuds after the Sony WF-1000XM3.",
    "An IPX4 water-resistance rating means you can use these earbuds while working out, without the worry that a little sweat or rain will break them.",
    "They have a fun, energetic sound quality, feel comfortable during long listening sessions and have an 18-hour combined battery life. We don't love their radar-disc shape and their lack of noise cancellation, but these are undoubtedly Sony's second-best true wireless earbuds.",
    "Not in the US or UK? Check out the best Sony WF-XB700 prices we've found in your region below:"
  ],
  "headers": {
    "4": "Today's best wireless earbuds deals"
  },
  "links": {
    "Sony WF-XB700 True Wireless Headphones": "https://www.techradar.com/reviews/sony-wf-xb700-truly-wireless-headphones",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}