{
  "source": "https://www.techradar.com/news/star-trek-picard-season-2",
  "title": "Star Trek: Picard season 2: story, cast, release date and everything we know",
  "category": "entertainment",
  "updated": "2021-12-02T16:22:37Z",
  "author": "andy-kelly",
  "summary": "The stardate for Star Trek: Picard season 2 is February 2022",
  "article": [
    "Season 2 of Star Trek: Picard has a stardate! The ongoing mission of Admiral Jean-Luc Picard (retired) will resume on Paramount Plus in February 2022, the streaming giant confirmed at September's Star Trek Day event.",
    "Having pitted its eponymous hero against classic adversaries the Romulans and the Borg – as well as a bunch of rogue androids – in its first outing, Star Trek: Picard season 2 takes Jean-Luc where he's never gone before. Now, with his present turned into a “totalitarian nightmare”, he's forced to take his newly formed crew back to the 21st century to set things right.",
    "Also coming along for the ride are old-school villains Q and the Borg Queen, and more friendly faces such as Guinan. There's also a new role for Brent Spiner, who played the Enterprise's android officer, Lt Cmdr Data, for more than three decades.",
    "Picard's latest adventure is just three months away, so we dove into Starfleet's logs to tell you everything you need to know about the Star Trek: Picard trailers, cast, story and more.",
    "As the great man himself would say: make it so...",
    "Spoilers lie ahead if you're yet to watch Star Trek: Picard season 1.",
    "Release date: Star Trek: Picard season 2 will debut in February 2022, though a specific date hasn't been offered up yet. It'll stream on Paramount Plus in the US and Amazon Prime Video in other territories.",
    "Story: Jean-Luc Picard and the ragtag crew of La Sirena travel back in time to the 21st century to fix the timeline – with a bit of help from the god-like Q and a Borg Queen.",
    "Is there a trailer? A new Star Trek: Picard season 2 trailer was unveiled at the Star Trek Day event in September 2021.",
    "The Star Trek: Picard season 2 shoot was originally supposed to get underway in June 2020, until Covid-19 put everything on hiatus. Production on season 2’s 10-episode run eventually got under way in California in February 2021.",
    "That delay means we'll see Star Trek: Picard season 2 after Star Trek: Discovery season 4 (due to leave spacedock on November 18) finishes its mission. The Star Trek Day event on September 8, 2021 confirmed that Jean-Luc's second solo voyage will debut in February 2022 on Paramount Plus in the US – as with season 1, the show will stream on Amazon Prime Video in other territories.",
    "The first teaser for Star Trek: Picard season 2 was released during the First Contact Day event in April 2021. Alongside numerous Next Generation Easter eggs (including a model of Picard's first starship command, the USS Stargazer) the major reveal was that John de Lancie will be reprising his role as omnipotent superbeing Q.",
    "A more full-featured trailer featuring Stewart, de Lancie and other members of the cast was released on June 16, 2021. It doesn't give much away about the plot, other than suggesting that Picard and company are trying to stop a dark future from coming to pass.",
    "We learned even more about Star Trek: Picard season 2 in the longer trailer unveiled at Star Trek Day – including a sighting of the Borg Queen...",
    "Red alert! Big spoilers for Star Trek: Picard season 1 follow – change course now if you haven’t seen it yet.",
    "Jean-Luc Picard will be a new man in Star Trek – literally. When Picard’s human body succumbed to terminal Irumodic Syndrome, his consciousness was transferred into to an artificial ‘golem’ body created by Dr Altan Soong, the biological son of Data’s ‘father’, Dr Noonian Soong. Although Soong Jr made it clear that the new body is effectively identical to the old one – it will still age and die, for example – it’s going to have an effect on the way the 90-something character approaches his life.",
    "“I wanted to know exactly what they had done to me when they saved [Picard]’s life,” Patrick Stewart said in an interview with Gold Derby. “Was there any chance that this might have an impact on Picard’s personality or behaviour? [Executive producers Terry Matalas and Akiva Goldsman] felt it probably wouldn’t, but it lies there as an option should we need to take it. But also there is another human aspect being introduced in season 2, which I am not allowed to talk about. But it’s going to have, I think, quite an impact.”",
    "With the first year’s main story arcs about a the Romulan Zhat Vash’s efforts to wipe out all Synthetic life and the reclaimed Borg Cube (now crash-landed on the Synthetic homeworld of Coppelius) now seemingly done and dusted, Star Trek: Picard season 2 is primed to seek out all-new worlds – and civilisations.",
    "“Despite 178 episodes of TNG [The Next Generation] and four feature films, there are events coming up in season 2 that have never been seen before,” Stewart teased at First Contact Day.",
    "It’s clear that not everything will be new, however, now that we know Q is back in Jean-Luc Picard’s orbit. A member of the omnipotent Q continuum, the mischievous character cropped up regularly in The Next Generation (and spin-off shows Deep Space Nine and Voyager) to make life as awkward as he could for Starfleet. He always took a particular interest in Picard, having put humanity on trial in TNG pilot ‘Encounter at Farpoint’ – an arc that was only partially resolved in series finale ‘All Good Things’.",
    "It looks like Q will be continuing his self-convened legal proceedings in Star Trek: Picard season 2. “Do you recall what I said, Jean-Luc, when last we parted ways?” Q asks Picard in the latest season 2 trailer. “The trial never ends.” Not only do we learn that Picard and Q haven't met in the more-than-two-decades since Jean-Luc's days on the Enterprise-D, we know that the former Starfleet officer is “way too old for [Q’s] bulls**t.”",
    "“Q's arrival is, as it often was, is unexpected,” said Stewart. “But it also comes at a shattering moment in the episode. And I do mean a shattering moment. Whether it's directly connected to Q or not, I'm not sure, but there is significant trauma. And in fact at the moment, I'm working on how the trauma of this moment hangs around Picard for quite a substantial part of the episode and then – there [Q] is.”",
    "“In the same way that we have tried to do with Picard himself, Terry Matalas and I don’t pretend that the interstitial years [between The Next Generation and Picard] didn’t happen,” executive producer Akiva Goldsman told the Hollywood Reporter. “Obviously, chronological time is less relevant to Q. The time between shows is probably not even the blink of an eye in Q time – if you even have Q time. But we definitely chose to follow suit when it came to him, so as we tried to evolve the other characters, the same is true of Q. This is a show of a different time with actors of a different age. We’re now talking about the issues that come up in the last [stage] of your life. We wanted a Q that could play in that arena with Picard.”",
    "Goldsman also described Q as a “trickster god” and expanded on the importance of Picard’s relationship with Q. “There’s a lot of discussion in [Star Trek: Picard] season 2 about the nature of connectedness,” he said. “Q’s kind of a great lightning rod for that because in some ways he’s one of Picard’s deepest… not deep in the same way that Riker is or Beverly Crusher was but in its own [way, a] uniquely, profoundly deep relationship.”",
    "Picard's relationship with Q may be deep, but it's also problematic. In the latest Star Trek: Picard season 2 trailer, Jean-Luc says that \"Q went back in time and turned our world into a totalitarian nightmare,” amid scenes of a drastically changed 24th century. Seven of Nine – now without the residual Borg implants on her face – points out that “time has been broken”. Picard adds that, “The only way to heal our future is to go back and repair the past.”",
    "This means a trip back to 21st century, where Picard and his newly formed crew will have “three days before the future is changed irrevocably”, and Seven of Nine will have to take a crash course in driving a car.",
    "But with the time travel element already strongly hinted, perhaps the biggest revelation in the Star Trek: Picard season 4 trailer is that Jean-Luc's route back in time involves the Borg Queen – though it's yet to be revealed whether this is the Borg Queen from Star Trek: First Contact, the one presumed dead after Voyager's return from the Delta Quadrant, or some other incarnation. Or maybe we're guilty of thinking in [merely] three-dimensional terms...",
    "Whichever Borg Queen it is, time travel is familiar territory for Star Trek, the most famous examples coming in Star Trek 4 (where Kirk and crew travelled back to 1980s San Francisco) and First Contact (where Picard fought the Borg in the 21st century). Expect plenty of culture clash comedy/drama as Jean-Luc and his highly sophisticated 24th century companions get used to slumming it present-day Earth.",
    "One major difference between Star Trek: Picard season 2 and its predecessor is that this time Jean-Luc – now long-retired from Starfleet – has his own crew. So don’t be surprised if the new season feels more of an ensemble show, with more time devoted to Cris Rios, Raffi Musiker, Soji Asha, Elnor and Seven of Nine. Integrating all of them – and new characters – into the narrative will be one of the new season’s hardest missions.",
    "“That's the challenge,” season 1 showrunner Michael Chabon told the Hollywood Reporter. “First, it's got to be good, right? It has to be focused on Picard but have room for all the other characters. It’s never going to be just a show about the crew of a starship that's part of Starfleet and everyone's wearing uniforms and they're flying around, encountering alien life and weird planets. Those are the challenges we face going into season 2, and I'm so excited about the story we’ve come up with.”",
    "And for anyone who was left underwhelmed with the season 1 finale, the production team have hopefully found a solution going into Star Trek: Picard season 2. “Figure out the end earlier!” said Goldsman when the Hollywood Reporter asked what the team had learned from their first year. “If you’re going to do a serialized show, you have the whole story before you start shooting. It’s more like a movie in that way – you better know the end of your third act before you start filming your first scene.” Surely that's good advice for every screenwriter...",
    "This is the crew manifest for Star Trek: Picard season 2 as it stands:",
    "The show was always built around the star power of Sir Patrick Stewart, and he’ll be joined in the Star Trek: Picard season 2 cast by his regular La Sirena crew: Michelle Hurd (Raffi Musiker), Santiago Cabrera (Cris Rios), Evan Evagora (Elnor), Alison Pill (Dr Agnes Jurati), and Isa Briones (Soji Asha). Star Trek: Voyager veteran Jeri Ryan will also be back as former Borg Seven of Nine.",
    "It was confirmed at September's Star Trek Day that Seven will come face-to-face with another former member of the Collective, as the trailer introduced the latest iteration of the Borg Queen. The Last of Us star Annie Wersching takes over the role from Alice Krige (Star Trek: First Contact, Star Trek: Voyager) and Susanna Thompson (Star Trek: Voyager)",
    "In addition to the returning John de Lancie as Q, there are some other The Next Generation veterans heading back to the Final Frontier.",
    "The first is Whoopi Goldberg as Guinan.",
    "Stewart formally invited his former co-star to join the Star Trek: Picard season 2 cast during an appearance on Goldberg’s TV show, The View. “It was wonderful having you, and we cannot wait to have you with us again one more time,\" said Stewart.",
    "Officially the bartender in Ten Forward, the Enterprise-D’s bar/relaxation area, Guinan (a centuries-old El-Aurian) was Picard’s confidante. She also had little time for Q, so it’ll be intriguing if they end up colliding with each other in the new season.",
    "And although Brent Spiner said he'd played the android Data for the last time in Star Trek: Picard's first season – “I wouldn't really entertain the idea of doing [Data, an ageless character] again because I just don't think it would be realistic,” he told TV Guide – he is back in season 2. So who's he playing?",
    "“I can tell you I'm not Data,” Spiner told Inverse. “I know they haven't revealed much about me being in the show. I can tell you I'm a member of the Soong family. And, that I'm not playing a character I've ever played before.”",
    "In the words of Data himself, this is \"most intriguing\".",
    "Alongside his most famous role as the Enterprise's resident artificial human, Spiner has also played Data's android ‘brothers’ Lore and B-4 – as well as their creator, Dr Noonian Soong and his 22nd century ancestor, Arik Soong. He also appeared in Star Trek: Picard season 1 as a new member of the family (and AI expert), Dr Altan Inigo Soong.",
    "So who is this mysterious new character? We're ruling out another android, because if Spiner's too old to play Data, he's too old to play another robot. But could the character be Altan's human brother in the Picard era, a new person in the new, alternative, dystopian 24th century, or a great-great-great-great-great-great-great-great-great-grandparent (approx) Picard and co meet when they travel back to the 21st century? Seeing as both Picard and Soji (one of Data's daughters) have connections to Data, both would surely have an interest in meeting an ancestor.",
    "As for the rest of the Next Generation crew, the one star certain to return is Jonathan Frakes – though not necessarily on screen. He confirmed to TrekMovie that he’s back to direct a pair of Star Trek: Picard season 2 episodes, but claimed that he wasn’t sure whether he’d be back on screen as Captain William Riker.",
    "The time travel element of the story may make make bringing the Next Generation cast harder this time out, but if Riker does return, it’s a safe bet Marina Sirtis will be back as his screen wife, Deanna Troi.",
    "But what about Worf, Geordi LaForge and Dr Crusher?",
    "Thanks to the amount of time the role requires in the make-up chair, Michael Dorn said he’d only be up for returning as the Federation’s resident Klingon, Worf, if it was really worthwhile.",
    "“I’m only interested in if it’s something really interesting,” he told Inverse. “If the character was a major part of the franchise or whatever the show is. He’s not just going to show up, beat somebody up, and then go home.”",
    "While Worf’s status is ambiguous, two cast members have seemingly ruled themselves out of a return.",
    "In April 2021, LeVar Burton told Whoopi Goldberg on The View (via TrekMovie) that, “I can say unequivocally that I am not doing season 2 of Picard” – though it’s important to add that he hasn’t ruled out an appearance as Geordi La Forge in a future season.",
    "And there’ll be no return (yet) for Gates McFadden – which means that Star Trek: Picard season 2 won’t be able to explore the status of Jean-Luc’s will they/won’t they relationship with Dr Beverly Crusher.",
    "“I’m not in the second season,” she told TrekMovie. “I’m sad that I’m not. I’m disappointed because it would have been so much fun to just work with those people. But we’ll see. I have no idea…”",
    "But don’t give up hope just yet, because this could be a clever deployment of smoke and mirrors. Marina Sirtis claimed she wasn’t going to be in the first season of the show and look what happened there…",
    "Star Trek: Picard season 2 won't be the end of Jean-Luc's story – the show's Star Trek Day panel confirmed that a third season has been given the greenlight by Paramount Plus.",
    "According to an interview in Variety, Michael Chabon won't be as heavily involved in season 2 of Star Trek: Picard as he was in the first. He's shifting his attention to developing a TV series for Showtime based on his novel The Amazing Adventures of Kavalier & Clay. But he will continue to give notes to the writers. \"I’m still an executive producer on Picard,\" he told Variety. \"I’m writing two episodes. I was there breaking the second season, all the way through. I was engaged, I think, to exactly the same degree as I was on the first season.\"",
    "Terry Matalas, a veteran of Twelve Monkeys and MacGyver will take over as the Star Trek: Picard season 2 showrunner.",
    "Star Trek: Picard will be available to watch from February 2022, on Paramount Plus in the US and Amazon Prime Video in the rest of the world."
  ],
  "headers": {
    "9": "Star Trek: Picard season 2 release date: February 2022",
    "11": "Star Trek: Picard season 2 trailer: see the Borg Queen in the latest teaser",
    "14": "Star Trek: Picard season 2 plot: Jean-Luc's new mission involves time travel",
    "31": "Star Trek: Picard season 2 cast: Q, Guinan, the Borg Queen and other returning characters",
    "53": "Star Trek: Picard season 3 has also been confirmd",
    "54": "Star Trek: Picard season 2 showrunner: there's a change at the helm"
  },
  "links": {
    "Star Trek Day": "https://www.techradar.com/news/star-trek-day-how-to-watch-best-panels-and-everything-we-know",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Star Trek: Discovery season 4": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Gold Derby": "https://www.goldderby.com/article/2021/patrick-stewart-star-trek-picard-cbs-all-access/",
    "A member of the omnipotent Q continuum": "https://www.techradar.com/news/star-trek-picard-what-you-need-to-know-about-q-jean-lucs-omnipotent-sparring-partner",
    "Hollywood Reporter": "https://www.hollywoodreporter.com/live-feed/challenge-star-trek-picard-season-2-1287216",
    "The View": "https://twitter.com/TheView/status/1220028276879568897",
    "TV Guide": "https://www.tvguide.com/news/star-trek-picards-season-1-episode-10-brent-spiner-data-death/",
    "Inverse": "https://www.inverse.com/article/51100-star-trek-next-generation-reboot-cast-worf-spinoff",
    "TrekMovie": "https://trekmovie.com/2021/05/06/exclusive-gates-mcfadden-on-why-shes-sad-to-not-be-in-star-trek-picard-season-2/",
    "Variety": "https://variety.com/2020/tv/features/michael-chabon-star-trek-picard-1203544717/"
  }
}