{
  "source": "https://www.techradar.com/news/heres-how-machete-star-danny-trejo-ended-up-in-far-cry-6s-ridiculous-dlc",
  "title": "Here's how Machete star Danny Trejo ended up in Far Cry 6's ridiculous DLC",
  "category": "gaming",
  "updated": "2021-09-23T18:00:11Z",
  "author": "vic-hood",
  "summary": "Dani & Danny",
  "article": [
    "Ubisoft revealed its post-launch content plans for Far Cry 6 earlier this month, announcing that the new Far Cry is getting DLC themed around Stranger Things, Rambo and...Danny Trejo?",
    "That’s right, the Machete actor will be making an appearance in a crossover mission called Danny & Dani vs. Everybody. In the mission, Trejo’s Tacos (Danny Trejo’s real restaurant) has set up shop on Far Cry 6’s fictional island of Yara in an effort to feed the poor.",
    "However, when Trejo’s Tacos comes under attack from the military forces of Anton Castillo, the oppressive dictator of Yara, it’s up to protagonist (and Trejo superfan) Dani Rojas to team up with their hero Danny Trejo to protect the eatery - with Trejo, of course, armed with his infamous machete. But how did Trejo get involved in a Far Cry game?",
    "“He's a gamer!” Far Cry 6’s Narrative Director Navid Khavari tells us when asked about Trejo’s involvement. “When we first had a call with him, his first question was, 'Is Jack Carver coming back?\" So he'd played, I think, Far Cry 1. It was a dream. I think he was really excited to be part of the franchise, but also, he kind of loved the angle that he's making tacos and trying to feed the poor in Yara. So there was sort of a heartwarming element.”",
    "As we’ve said, Trejo’s Tacos Danny Trejo’s real-life restaurant enterprise, with locations across North America. At the height of the Covid-19 pandemic, Trejo donated hundreds of meals from his restaurants to frontline health care workers in a hospital in LA and donated and distributed hot meals to those in LA who may have been struggling amidst the pandemic. While Trejo’s character in Far Cry 6 clearly reflects some aspects of his iconic role of bounty hunter Machete, Trejo was also keen to include his charitable spirit in his cameo.",
    "“The amazing thing is, if you talk to Danny and his manager, he just somehow ends up in these situations in his life where he ends up helping people,” Khavari explains. “He's some kind of saint. But that was also really important to him and he wanted, and we really pushed for it, for him to share his personal anecdotes and to share his voice within this. We didn't want to just do a cameo, we wanted to be like you're really with Danny Trejo.”",
    "It’s unclear exactly how long Far Cry 6’s Danny & Dani vs. Everybody crossover mission will be, or when it will release, but we can’t wait to serve tacos and cause chaos with Danny Trejo."
  ],
  "headers": {
    "3": "Trejo's Tacos"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6"
  }
}