{
  "source": "https://www.techradar.com/news/secret-invasion-tv-show-is-bringing-back-another-familiar-face",
  "title": "Secret Invasion TV show is bringing back another familiar face",
  "category": "entertainment",
  "updated": "2021-12-02T14:55:20Z",
  "author": "tom-power",
  "summary": "A not-so Secret Invasion",
  "article": [
    "Secret Invasion, one of Marvel Studios' many upcoming Disney Plus TV shows, has reportedly added another familiar MCU face to its cast.",
    "According to Deadline, Cobie Smulders' Maria Hill will reunite with Samuel L. Jackson's Nick Fury for the forthcoming series, which will be just one the many Marvel Phase 4 slate of movies of TV shows.",
    "If Deadline's report is confirmed to be true, it'll be Smulders' first appearance in an MCU live-action movie or TV project since 2019's Spider-Man: Far From Home. Smulders did, however, lend their voice to Hill earlier this year for season 1 of Marvel's What If...? animated series.",
    "Marvel Studios declined to comment on the speculation when quizzed by Deadline. But, given Fury and Hill's tight working relationship throughout the MCU since 2012's Avengers flick, it's likely that the former SHIELD Deputy Director will feature in Secret Invasion in some capacity.",
    "Smulders should join Jackson and Ben Mendelsohn – the latter reprising his role as the Skrulls' Earth-based leader Talos – in Secret Invasion, if she's officially signed on. Other prominent cast members include Emilia Clarke (Game of Thrones), Olivia Colman (Broadchurch, The Favorite), Kingsley Ben-Adir (One Night in Miami) and Killian Scott (Ripper Street).",
    "Secret Invasion will follow Fury, Talos and company as they discover that other shape-shifting Skrulls have been infiltrating Earth for years and, no doubt, look to put a stop to a villainous plot centered around this revelation. Secret Invasion is expected to launch on Disney Plus sometime in 2022.",
    "Spoilers follow for Spider-Man: Far From Home.",
    "Secret Invasion may not be the most anticipated project on Marvel's Phase 4 slate, but it has the potential to be one of the studio's most mind bending productions in some time.",
    "As shape-shifters, the Skrulls can mimic the appearance of any human that they see on Earth – or throughout the universe, seeing as the MCU isn't solely set on our world anymore.",
    "That presents an intriguing proposition for Secret Invasion's showrunners and cast. If a Skrull can impersonate anyone, then one, two or maybe more of the show's all-star cast could be a Skrull who is masquerading as a human.",
    "Maria Hill could be one of that number. Given that the Skrulls have been living on Earth for a while before the events of Secret Invasion, any MCU character that we've met so far could, in fact, be a Skrull themselves. And that extends to Smulders' Hill. Wouldn't it be a fun twist if Hill was actually a Skrull, even though she'd been working alongside Fury the whole time?",
    "That seems unlikely, though. After all, another Skrull – Soren, Talos' wife – impersonated Hill during the events of Spider-Man: Far From Home. It's unclear if a Skrull could impersonate a human, who then has their 'human form' copied by another Skrull. We're guessing that such a scenario isn't possible, however, which would mean that Hill has to be a human in order for a Skrull to mimic her appearance.",
    "Of course, we could be completely wrong. But, if we had to stick our neck out at the present moment, we'd say that Smulders won't be playing a Skrull in Secret Invasion. She should just portray Hill and nobody else.",
    "For more MCU-based content, check out our 'everything you need to know' guides on Doctor Strange 2, Thor 4 and Black Panther 2."
  ],
  "headers": {
    "6": "Analysis: will Cobie Smulders be playing a Skrull?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Deadline": "https://deadline.com/2021/12/cobie-smulders-maria-hill-marvel-series-secret-invasion-1234883068/",
    "Marvel Phase 4": "https://www.techradar.com/news/marvel-phase-4",
    "Marvel's What If...?": "https://www.techradar.com/news/marvels-what-if-is-a-surreal-disney-plus-anthology-show-with-limitless-potential",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Thor 4": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Black Panther 2": "https://www.techradar.com/news/black-panther-2-release-date-cast-plot-and-everything-you-need-to-know-about-wakanda-forever"
  }
}