{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-be-followed-by-a-tri-fold-tablet-in-2022",
  "title": "Samsung Galaxy Z Fold 3 could be followed by a tri-fold tablet in 2022",
  "category": "phones",
  "updated": "2021-04-16T22:39:17Z",
  "author": "david-lumb",
  "summary": "Finally, a Samsung foldable...tablet?",
  "article": [
    "We’re still hearing about the Samsung Galaxy Z Fold 3, but another rumor suggests there’s a new Samsung foldable on the horizon: a triple-folding tablet, which could come out as soon as next year.",
    "The Samsung Galaxy Z Fold Tab, as the device is allegedly called, supposedly has two hinges and three folding segments, like some of the concepts we’ve seen like TCL’s z-shaped model. Samsung’s supposed model is specifically referred to as a tablet, so it’s unclear if this is a device that folds up small enough to fit a phone form factor and would have the mobile connectivity to work like a handset.",
    "The info was first reported by GizmoChina via tipster Yogesh, who didn’t provide too many other details about the Samsung Z Fold Tab except that it will have better ultra-thin glass (UTG) than the current generation displays on the Galaxy Z Flip and Z Fold 2. We could see this UTG first on the Z Fold 3 before the Z Fold Tab. Likewise, the folding tablet will allegedly support a Bluetooth-enabled version of the S Pen stylus that will arrive first with the Z Fold 3.",
    "Per Yogesh, the Samsung Galaxy Z Fold Tab could be teased at the launch of the Samsung Galaxy Z Fold 3 and/or Samsung Galaxy Z Flip 3 launch event alleged to be in August 2021 before finally being released in Q1 2022.",
    "As always, take this leak with a grain of salt, especially with a relatively unknown tipster and a product we haven’t heard about yet.",
    "But flexible display devices are certainly a niche that phonemakers are continuing to invest in, including Samsung, which released the first multi-market mainstream foldable with the original Samsung Galaxy Fold and seems like it will announce the Samsung Galaxy Z Fold 3 soon given we're hearing so much about it (it may be called the Z Fold 3 over the over the Samsung Galaxy Z Flip 3, it won't have an S Pen slot, and so on).",
    "And with rollables expected to hit the mainstream phone market in the next year or two, according to TCL, new devices in unique form factors like the TCL Fold ‘n Roll will keep coming out. In that light, a large multi-hinged foldable tablet like the Samsung Z Fold Tab is alleged to be doesn’t seem too far-fetched.",
    "Via Android Authority"
  ],
  "headers": {
    "4": "Samsung’s foldable future"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "TCL": "https://www.techradar.com/news/this-is-the-best-foldable-phone-concept-weve-seen-so-far",
    "GizmoChina": "https://www.gizmochina.com/2021/04/15/exclusive-samsung-tri-fold-tablet-could-launch-as-galaxy-z-fold-tab-in-q1-2022/",
    "Yogesh": "https://twitter.com/heyitsyogesh/status/1382693303494270987",
    "over the": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-looks-likely-to-launch-instead-of-z-flip-2",
    "S Pen slot": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-probably-wont-have-an-s-pen-slot-after-all",
    "according": "https://www.techradar.com/news/tcls-fold-n-roll-is-both-a-rollable-and-a-foldable-phone-so-when-do-we-get-one",
    "TCL Fold ‘n Roll": "https://www.techradar.com/news/the-tcl-fold-n-roll-ushers-in-a-new-era-of-foldable-and-rollable-crossovers",
    "Android Authority": "https://www.androidauthority.com/samsung-galaxy-z-fold-tab-1218551/"
  }
}