{
  "source": "https://www.techradar.com/news/amd-in-2021-a-look-ahead-for-team-red",
  "title": "AMD in 2021: a look ahead for Team Red",
  "category": "computing",
  "updated": "2021-01-02T14:18:47Z",
  "author": "mark-knapp",
  "summary": "AMD won 2020, how about 2021?",
  "article": [
    "2020 has been a wild year, and yet it still went almost according to plan for AMD. Or at least that perceived plan as laid out by the momentum of its Zen processors. Aside from some inventory shortages in the latter half of 2020, AMD has shown little sign of slowing down, and that may make 2021 another big year for Team Red.",
    "If we’re being realistic, new components are what we’re excited for. Even though AMD’s Ryzen 5000-series CPUs and Radeon RX 6000 series graphics GPUs have only recently hit the market, there’s still plenty we can look forward to.",
    "It’s too soon to get excited about a new generation of products, but there’s plenty of room for AMD to fill out its catalog. Even though Zen 3 CPUs are here, it’s not nearly a complete lineup. The Ryzen 5 5600X, Ryzen 7 5800X, Ryzen 9 5900X and 5950X are likely only a small fraction of the models we’ll see.",
    "We can expect to see more budget options in the Ryzen 3 line, as well as lower-power, non-X variants without factory overclocking. There should be some APUs coming to round out the types of computers AMD processors can power. And, we’d also expect some early 2021 announcements of Ryzen 5000 mobile processors to power laptops. AMD unveiled a suite of Ryzen 4000 mobile processors at CES 2020, so we wouldn’t be surprised to see new ones at CES 2021, where AMD is scheduled to have a keynote. Zen 2 was already impressive enough in mobile devices, so Zen 3 is all but certain to continue wowing us with desktop-like performance in thin and light ultrabooks.",
    "Similarly, AMD still has some ground to cover in its graphics processor stack. The Radeon RX 6900 XT has the high-end of the market covered for now, and the Radeon RX 6800 may be at the bottom of the stack right now, but it’ll surely have a 6700 and 6700 XT below it at some point in the near future, perhaps even as soon as January. These are rumored to feature a more tame 12GB of VRAM (compared to the 16GB in all the Big Navi cards launched so far).",
    "Don’t get your hopes up for Zen 4 and 5nm nodes from AMD in 2021 just yet. Even though AMD has been moving at a steady clip, it appears the company may be shipping Zen 4 processors in 2022, based on the latest leaks – perhaps some Zen 3+ action?",
    "There are two exciting features for AMD’s Big Navi graphics cards that are all but absent right now, and presumably we’ll see something of them next year. The first is Microsoft’s Direct Storage API, which could let AMD really show the power of its PCIe 4.0 support, as graphics cards would be able to pull data directly to video memory from an SSD without the CPU acting as a mediator. A similar pipeline for game data exists on the new PlayStation 5 and Xbox Series X and S, so it’s only a matter of time before developers are taking advantage of it.",
    "The second feature is more AMD specific: FidelityFX Super Resolution. This is supposed to be AMD’s big answer to Nvidia’s DLSS. Right now, when it comes to straight rasterization, AMD performs well compared to Nvidia, but when ray-tracing comes into play, AMD is decimated. Even Nvidia still struggles with ray-tracing, but its DLSS technology can improve performance considerably without visual degradation. AMD desperately needs a response, and that’s what FidelityFX Super Resolution should be. The question is how soon it’ll come (Big Navi is already here.), and just how good it can actually be (Nvidia’s DLSS has already been here for 2 years, and it’s made significant strides since it was introduced.).",
    "AMD scored big when it landed a home at the heart of Xbox One and PlayStation 4 consoles, and that happened again for the latest generation of consoles. We’ve seen just how hot those products are with supply drying up just as soon as it hits store shelves. With any luck, 2021 will see more stock of these products, and AMD will continue to reap the benefit of being the chipmaker behind the exciting new game platforms.",
    "In a similar vein, we’d expect (or hope) for 2021 to a better year for global commerce and supply chains. That would make it easier for all of us to get our hands on the processors and graphics cards from retailers at MSRP, rather than from resellers at the dramatically jacked-up prices we’ve been seeing here at the end of 2020.",
    "While the recent path for AMD may have been lined with roses, the path ahead may continue to have roses but with thorns as well. AMD may be getting some competition in ways that will hurt, and no, we’re not talking about Intel.",
    "Apple introduced its new M1 SoC in November 2020, powering new devices like the MacBook Air. Apple is likely going to continue making its own chips. That means AMD may not have an opportunity to supply components for Apple products. Perhaps worse still, Apple’s chipset was built on a 5nm architecture, and Apple may take up a considerable portion of what chipmakers like TSMC are able to fabricate, leaving AMD with fewer options to manufacture its chips.",
    "And, that’s just Apple. Microsoft, Amazon and Google are all showing their own efforts in chip-making, according to The Wall Street Journal. Though we’ve heard the Microsoft chips are more likely geared for data centers, any of the chips from these companies could cut into AMD’s Epyc line of data center chips. And, just like Apple, these big companies (all worth over a trillion dollars to AMD’s ~$100 billion market cap) calling on the few major chip fabs to make their custom silicon could cut into AMD’s ability to produce its own components."
  ],
  "headers": {
    "1": "New stuff",
    "6": "Graphics features",
    "8": "Even more benefit from consoles",
    "9": "Stock shortages subsiding",
    "10": "A bit of cold water"
  },
  "links": {
    "AMD’s Ryzen 5000-series CPUs": "https://www.techradar.com/news/amd-ryzen-5000",
    "Zen 3": "https://www.techradar.com/news/amd-zen-3",
    "Ryzen 7 5800X": "https://www.techradar.com/reviews/amd-ryzen-7-5800x",
    "Ryzen 9 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Zen 2": "https://www.techradar.com/news/amd-zen-2",
    "Radeon RX 6900 XT": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "perhaps even as soon as January": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-and-rx-6700-may-be-coming-in-january-2021",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "the latest leaks": "https://www.techradar.com/news/leaked-roadmap-of-amds-laptop-cpus-could-give-intel-nightmares",
    "The Wall Street Journal": "https://www.wsj.com/articles/chip-giants-intel-and-nvidia-face-new-threats-from-amazon-to-google-to-apple-11608460201",
    "more likely geared for data centers": "https://www.techradar.com/news/microsoft-surface-pcs-could-be-ditching-intel-for-custom-silicon-too"
  }
}