{
  "source": "https://www.techradar.com/news/buying-ps5-isnt-impossible-restock-advice",
  "title": "Buying PS5 isn't impossible, but people keep making these 3 restock mistakes",
  "category": "gaming",
  "updated": "2021-07-25T21:12:51Z",
  "author": "matt-swider",
  "summary": "It's gotten easier to buy the PS5 in recent weeks, and although that doesn't mean it's easy, there are keys to success",
  "article": [
    "Even if it feels impossible, buying the PS5 console today is easier than it has been in the first half of 2021, and I know this for a fact because I've personally helped nearly 60,000 people find the PS5 for sale by telling them to follow my PS5 restock Twitter Matt Swider Twitter account. That's where I will send you PS5 restock alerts – if you follow my Twitter account and turn on notifications. It's worked.",
    "► When? Follow our PS5 restock Twitter tracker Matt Swider and turn on notifications for restock news. It's the fastest way to get PS5 restock updates.",
    "► Don't buy from other Twitter users – ever. They're all scams. Only buy from the US stores I send alerts about. No one will sell a PS5 for just $550 (they'd lose money– how does that make any sense?).",
    "The truth is that most people make three mistakes that reduce their chances of being able to buy the PS5 whenever there's a restock. Let's go over what those are before you make the same errors, and either give up or send your money to a reseller (which you should never, ever do on social media).",
    "Directions: Click on this image of an example of a Best Buy PS5 restock alert from Matt Swider and turn on notifications (that little bell icon) for instant alerts.",
    "Buying a PS5 bundle is your best route to finding a PS5 in stock. The fact that even a game-and-accessory-filled PS5 restock can be gone in three minutes shows that the demand for the PlayStation 5 is still far too high. Imagine if those same retailers in the US restocked without bundles? That restock be gone in seconds.",
    "Oddly enough, I've had people tell me that PS5 bundles aren't an option for them, which is fine, but then weeks later they end up paying the same amount – usually $800 on eBay or a similar auction website – for just the console. How in the world does that make any sense? Sometimes, if you find a nice GameStop employee, they'll allow you to exchange a game in a bundle for a different game (or store credit) if that's your biggest problem.",
    "GameStop and Antonline are notorious for bundles, while Target, Walmart, and Best Buy sell the $499 PS5 Disc and $499 PS5 Digital Edition consoles as standalones. And guess what? GameStop has proven to be the easiest to get the console. Recently, the game retailer launched another barrier to entry: allowing all PowerUp Rewards members ($15 a year) to get early access to PS5 restock events.",
    "Considering how many people resell PS5 consoles, limiting a restock to members (for a small annual fee) and including games, controllers and gift cards (harder for someone to resell) is the best solution. Plus, fun fact: retailers don't make much money off of selling the PS5 console. So by packing in games and accessories, some stores in the US are actually turning a profit while knowing the PS5 is going to gamers.",
    "You may be the fastest at clicking my PS5 restock links – even, let's say, the very first one to do it – and still be greeted by an 'out of stock' message. Time to give up right? You were the first, right? This is where people keep making mistakes when trying to buy the PS5, and it's frustrating.",
    "Most retailers in the US release PS5 console orders in waves, meaning a few consoles will go up for sale, I'll track it and send out my tweet, and it'll be out of stock instantly for some people – others will see it in stock and begin the process to buy it. It's almost like a lottery when you initially get to that product page, and waiting until the next wave is key to finally getting the console. Sometimes those waves are announced (Walmart) and other times they're assumed (Best Buy). A restock can last anywhere from three minutes (Antonline) to 40 minutes (Walmart and GameStop).",
    "Walmart and Best Buy are known for releasing the console in waves. Walmart does 10-minute waves of the PS5 with a few rounds (usually two rounds lately, but at one time they did 12 rounds over two hours), while Best Buy does something similar and stocks certain store locations at different times (you have to buy the Best Buy PS5 restocks online, but select a store to eventually pick up the console in person).",
    "Key advice: Persistence is much more important than speed. Being the first often doesn't matter as much as hanging in there. The only benefit to quickly clicking on my links is to have more chances to try to buy the PS5 until it sells out. After that, it often comes down to luck.",
    "\"I'll get a PS5 when they're in stores later this year\", say weary PS5 restock seekers who are about to give up on buying the console. And I get that idea: it's impossible to buy PS5 today, but it should be easier when demand wanes, right?",
    "Well, there's a whole audience for the PS5 that hasn't sought out restocks just yet: parents who will want the Sony console for their kids for Christmas, and in the ramp-up to Black Friday and Cyber Monday, we'll likely see the PS5 out of stock from October to the end of December.",
    "Analysts have told me that they expect the PS5 restock chaos to continue into 2022, and Sony itself has been quoted as saying that it doesn't expect supply to catch up any time soon, even if the company claims to be working on the issue.",
    "There's good reason to think that the PS5 will be in stock at several US retailers in the coming days. Specifically, we're tracking PS5 stock at GameStop and Target (they have several at individual stores in the back room and will release them online when there's enough nationwide).",
    "Whenever there's a lack of inventory the week or weeks prior at retailers, people get frustrated and buy from auction websites that weekend. However, the next week is usually the exact opposite situation and restocks happen on back-to-back dates. And those auction sites don't have your PS5 in the mail yet."
  ],
  "headers": {
    "5": "1. They refuse a PS5 bundle, then pay $800 later",
    "9": "2. They give up on PS5 restocks too quickly",
    "13": "3. They think PS5 will be in stock later this year",
    "16": "The PS5 restock situation this week"
  },
  "links": {
    "PS5 restock Twitter Matt Swider": "https://twitter.com/mattswider",
    "Follow our PS5 restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}