{
  "source": "https://www.techradar.com/news/canon-eos-r3s-eye-controlled-autofocus-details-shown-off-in-new-patents",
  "title": "Canon EOS R3's eye-controlled autofocus details shown off in new patents",
  "category": "cameras",
  "updated": "2021-04-30T01:47:22Z",
  "author": "sharmishta-sarkar",
  "summary": "Possible menu setup makes it look like child's play",
  "article": [
    "The Canon EOS R3 development announcement caused quite the furore when the camera maker revealed it would be getting an eye-controlled autofocus point selection mechanism that was seen in the likes of the old EOS 3 and EOS 5 film cameras.",
    "Very little is known about what Canon is calling the Eye Control Function, except that it will allow users to select an AF point by just looking at it through the viewfinder. However, two new patents filed in the US have offered some further insight on how this might work.",
    "US patent number 2021/0124239 shows off what could possibly be the menu setup for this eye-controlled AF point selection mechanism (see image below). We say 'possibly' as this is a patent and things can change between now and when the camera finally makes its public debut.",
    "If the patent is anything to go by, though, it appears that setting up Eye Control Function will be a simple task, with plenty of customization options – true to Canon's easy-to-use style.",
    "While the exact mechanism of how the Eye Control Function will work is not clearly explained in the patent, it does seem a lot of it would be software based. Going by the diagram descriptions in the patent, it seems an algorithm will determine your line of sight to lock in a focus point, and then be able to follow a subject, depending on where your eye moves next.",
    "It does seem like a lot of precision will be needed to make this work in a real-world scenario, but it's possible Canon has worked out the details, as a second patent (US 2021/0125375) indicates.",
    "According to this one, the EOS R3 will likely come with a calibration mechanism on board to help the camera determine your \"eye gaze\".",
    "The above figures indicate on-screen messages that could be displayed when a user calibrates the EOS R3 for eye-controlled autofocus. Again, it seems to be software-driven, thanks to \"a program stored [...] into the system memory\".",
    "Again, exactly how this will work in the real world is as yet unclear, but that calibration system is reminiscent of what was used in the old Canon film cameras that had eye-controlled AF – you follow a moving subject around the viewfinder and the camera's software ought to do the rest.",
    "We'll need to keep in mind that these are still just patents – while they indicate what can be, they are in no way indicative of what will be.",
    "We were told that Eye Control Function will likely not work for anyone wearing glasses or contact lenses, which does limit how many people can make use of this nifty AF-point selection system. We'll just have to wait to find out more."
  ],
  "headers": {},
  "links": {
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "US patent number 2021/0124239": "https://pdfaiw.uspto.gov/.aiw?PageNum=0&docid=20210124239",
    "US 2021/0125375": "https://pdfaiw.uspto.gov/.aiw?PageNum=0&docid=20210125375"
  }
}