{
  "source": "https://www.techradar.com/news/how-to-watch-a-perfect-planet-online-stream-new-bbc-david-attenborough-doc-anywhere",
  "title": "How to watch A Perfect Planet online: stream new David Attenborough series anywhere",
  "category": "computing",
  "updated": "2021-01-05T09:33:40Z",
  "author": "james-laird",
  "summary": "Britain's national treasure is back for a new five-part series",
  "article": [
    "As if right on cue, Sir David Attenborough has arrived with a new five-part BBC documentary series just in time for the UK's third stab at getting a national lockdown right. It's a bit rubbish for Brits, really - but the soothing narrative tones of the 94-year-old national treasure go some way to softening the blow. Read on as we explain how to watch A Perfect Planet online and stream the new David Attenborough documentary today - it's 100% free to watch in the UK thanks to BBC iPlayer and can also be enjoyed wherever you are in the world right now.",
    "It's a very cleverly themed and particularly well timed show, with each hour-long episode of A Perfect Planet dedicated to exploring one of the natural forces that have helped create \"the only planet in the universe, so far as we know, where there is life\".",
    "Episode 1 is dedicated to volcanoes, followed by expositions on the sun, weather, oceans, and humankind. A new episode airs every Sunday night on TV in the UK, but all five parts of the new David Attenborough BBC series have been released on to its streaming service, iPlayer, right away for your binge-watching pleasure.",
    "Expect the usual high production values and breathtaking visuals you've come to expect from Attenborough documentaries, with A Perfect Planet at its best when it's delving into how animals from Canadian white wolves to Russians bears have had to adapt to an ever-changing natural landscape .",
    "Follow our guide below for details of how to watch A Perfect Planet online and stream the new David Attenborough documentary FREE in the UK with BBC iPlayer - or watch it from anywhere in the world.",
    "If you're not in the UK right now but don't want to miss David Attenborough's new documentary, your best bet is a VPN. Once you get the right VPN you can enjoy a secure and speedy connection, even on open Wi-Fi networks at places like hotels when you're abroad, enabling you to tune in and watch A Perfect Planet online for free just like you would at home.",
    "Even if you're not that tech-savvy, don't worry - getting a VPN is super simple and we've outlined how to do it in three easy steps below.",
    "Use a VPN to watch TV's best shows from anywhere"
  ],
  "headers": {
    "5": "How to watch A Perfect Planet online from outside the country"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}