{
  "source": "https://www.techradar.com/news/protonmail-wins-privacy-ruling-on-email-security",
  "title": "ProtonMail wins privacy ruling on email security",
  "category": "computing",
  "updated": "2021-10-25T14:26:25Z",
  "author": "mayank-sharma",
  "summary": "Email isn’t telecom, but OTT rules Swiss court",
  "article": [
    "Switzerland-based Proton AG, the company behind ProtonMail and ProtonVPN, has won an appeal against the Swiss Post and Telecommunications Surveillance Service (PTSS) over its status and obligations to monitor traffic.",
    "Proton, which hails itself the world's largest secure email provider, and uses end-to-end encryption, had challenged its status under Swiss law that governed telecommunications surveillance.",
    "Siding with Proton, the Swiss Federal Administrative Court confirmed that email service providers cannot be clubbed with telecommunications providers in Switzerland, and thus are not subject to the data retention requirements imposed on them.",
    "According to Reuters, the verdict followed a Swiss Supreme Court ruling in April, which observed that providers of chat, instant messaging, video conferencing, or Voice over IP (VoIP) services, such as WhatsApp, iMessage, Zoom, Teams, and Skype cannot be classified as telecom service providers, but rather \"over-the-top\" (OTT) service providers.",
    "In September 2020, PTSS had decided that ProtonMail and ProtonVPN could no longer benefit from limited surveillance obligations. It asked Proton to store all the data necessary for surveillance and be available to answer its questions around the clock.",
    "Proton challenged PTSS, and the court has now overturned that ruling and sent the case back for a fresh decision.",
    "Proton founder and Chief Executive Andy Yen said Friday's ruling was an \"important first step\" in its campaign to advance privacy and freedom.",
    "\"We expect there to be further attempts to force tech companies to undermine privacy in both Switzerland and abroad, and we are committed to continuing to challenge this through both our encryption technology and through the courts,\" he said.",
    "In a statement, Proton hailed both the current and the April rulings as a “victory for privacy.”",
    "For comprehensive privacy, use one of our best business VPN services"
  ],
  "headers": {
    "4": "Victory for privacy"
  },
  "links": {
    "ProtonMail": "https://www.techradar.com/reviews/protonmail-secure-email",
    "ProtonVPN": "https://www.techradar.com/reviews/protonvpn",
    "secure email provider": "https://www.techradar.com/best/best-secure-email-providers",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "email service providers": "https://www.techradar.com/news/best-email-provider",
    "Reuters": "https://www.reuters.com/technology/proton-wins-swiss-court-appeal-over-surveillance-rules-2021-10-22/",
    "instant messaging": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Voice over IP (VoIP) services": "https://www.techradar.com/news/best-voip-service",
    "WhatsApp": "https://www.techradar.com/reviews/whatsapp-encrypted-messaging",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Skype": "https://www.techradar.com/reviews/skype",
    "best business VPN services": "https://www.techradar.com/vpn/best-vpn-for-business"
  }
}