{
  "source": "https://www.techradar.com/news/resident-evil-village-releases-xiaomi-mi-11-ultra-oozes-luxury-on-this-weeks-totally-rated",
  "title": "Resident Evil Village releases, Xiaomi Mi 11 Ultra wows on this week's Totally Rated",
  "category": "appliances",
  "updated": "2021-05-14T15:14:27Z",
  "author": "hamish-hector",
  "summary": "Totally Rated brings shock and awe this week",
  "article": [
    "In the latest episode of Totally Rated, Resident Evil Village shows the series can still surprise and scare fans after 25 years, and the Xiaomi Mi 11 Ultra turns smartphone luxury up to 11.",
    "After months of waiting, the gates to Castle Dimitrescu were finally opened as Resident Evil Village came out on all the major gaming platforms. This direct sequel to 2017’s Resident Evil 7: Biohazard continued the story of Ethan Winters but brought in a few changes to its tried and tested horror formula.",
    "Andy Kelly from PC Gamer appreciated the new spin on the franchise’s tropes, calling it the scariest Resident Evil yet: “Resident Evil Village can occasionally feel like half a dozen different horror games jammed together.",
    "“But the strength and variety of its ideas, the quality of the art direction, and its darkly evocative atmosphere more than make up for it. It's a bold and experimental horror game, but also one that leans into the series' past glories—particularly Resident Evil 4.”",
    "Android Central continued the praise, awarding it a “must play” and calling Resident Evil Village a showcase for series fans and horror newcomers alike.",
    "Capcom’s new direction was not universally praised though, as GamesRadar’s Leon Hurly explains: “It's also a shame (for me at least) that this is one of the 'not a horror game' Resident Evils.",
    "“There are scares and some lovely creepy bits, especially at the start, but Resident Evil Village is mostly a big shooty action game. After Resident Evil 7's creepy tension, Village's extended gun battles with crowds of werewolves feel brash and occasionally fumbling.",
    "“It's only in the latter half where things start to alternate between some good bits, some fumbles, and at least one moment of 'oh my God, what?!' shark-jumping excess that wouldn't look out of place in a Fast and Furious trailer...\"",
    "Even if video games aren’t your thing, then you might want to stick around and check out our rundown of the Xiaomi Mi 11 Ultra smartphone.",
    "Tom Bedford of TechRadar got his hands on the new device early: “The Xiaomi Mi 11 Ultra takes the mantra 'turn it up to 11' and runs with it. Everything on this phone is a case study in smartphone luxuriance.",
    "“Plus, there's a gargantuan rear camera bump with three massive lenses and a little secondary display.”",
    "Yasmine Crossland of T3 thought the camera module on the back was cumbersome but still was impressed: “You can’t call the Xiaomi Mi 11 the perfect phone - it’s heavy, bulky and not to mention the eye-sore that is the camera module on the back.",
    "“I also think it's a shame that the second display isn't more responsive and doesn't have more uses. Having said that, this handset surprised me with lightning speed performance, long battery life, an impressive display and detailed point-and-shoot photography.",
    "“If you need a powerful phone to make photo edits on the go, or you are massively into mobile gaming, the Xiaomi Mi 11 Ultra will be a good fit for you.”",
    "New episodes of Totally Rated will roll out every Thursday."
  ],
  "headers": {
    "1": "Resident Evil Village mixes up its horror formula",
    "8": "Xiaomi Mi 11 delivers smartphone greatness"
  },
  "links": {
    "Tom Bedford of TechRadar": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review"
  }
}