{
  "source": "https://www.techradar.com/news/this-top-cloud-hosting-provider-has-banned-cryptomining",
  "title": "This top cloud hosting provider has banned cryptomining",
  "category": "computing",
  "updated": "2021-05-20T11:33:37Z",
  "author": "mayank-sharma",
  "summary": "Chia creator dismisses reports of the cryptocurrency damaging disks",
  "article": [
    "Hetzner, a popular German web hosting and dedicated server provider has updated its terms of use to ban cryptomining on its servers, after it found several users using its cloud storage offering to mine Chia.",
    "Chia is based on a new consensus algorithm known as proof of space and time, and is a departure from the usual proof of work used by traditional cryptocurrencies.",
    "In essence, unlike traditional cryptocurrencies such as Bitcoin and Ethereum, Chia, created by BitTorrent protocol developer Bram Cohen, demands more storage for its mining, rather than processing prowess.",
    "Hetzner’s high-capacity storage systems known as Storage Boxes offered a perfect platform for anyone wishing to mine Chia.",
    "However, fearing that the Chia mining operations would cut the lifespan of its drives and increase its maintenance costs, Hetzner decided to outlaw the use of its resources for mining cryptocurrencies.",
    "In a tweet translated from German into English by BleepingComputer, the company explains that it noticed a sudden increase in the number of orders for its large hard drive servers.",
    "“In order for us to operate a high-performing and reliable network for our customers, the operation of applications for mining crypto currencies is prohibited,” reads the updated terms for the Storage Box service.",
    "While Chia’s supposed disk destroying abilities have forced several disk manufacturers to ban the use of their disks to mine Chia, the cryptocurrency’s creator Bram Cohen took to Twitter to allay the fears.",
    "“For some odd reason the 'Chia burns out hard drives!' is getting repeated as the fashionable fud. This is odd, because for the most part it's just plain wrong,” Cohen wrote on Twitter.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies.",
    "Via BleepingComputer"
  ],
  "headers": {
    "5": "Just a FUD?"
  },
  "links": {
    "Hetzner": "https://www.techradar.com/reviews/hetzner-online",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "dedicated server provider": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "cryptomining": "https://www.techradar.com/best/mining-rigs",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "Bitcoin": "https://www.techradar.com/news/best-bitcoin-wallets",
    "Ethereum": "https://www.techradar.com/news/ethereum-price-steams-past-another-historic-milestone",
    "BitTorrent": "https://www.techradar.com/best/torrent-client",
    "demands more storage": "https://www.techradar.com/news/this-new-cryptocurrency-could-potentially-cause-an-ssd-or-hard-drive-shortage",
    "Storage Boxes": "https://www.techradar.com/reviews/hetzner-storage-boxes-review",
    "disk destroying abilities": "https://www.techradar.com/news/chia-crypto-mining-could-obliterate-your-ssds-in-a-matter-of-days",
    "allay the fears": "https://twitter.com/bramcohen/status/1393988621921701889",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/cryptocurrency/hetzner-cloud-server-provider-bans-cryptocurrency-mining/"
  }
}