{
  "source": "https://www.techradar.com/news/how-to-watch-home-sweet-home-alone-online-on-disney-plus-today",
  "title": "How to watch Home Sweet Home Alone online on Disney Plus today",
  "category": "computing",
  "updated": "2021-11-12T06:31:20Z",
  "author": "daniel-pateman",
  "summary": "Home Alone’s Buzz is back in this Disney Plus Original sequel",
  "article": [
    "It’s agreed then: Christmas officially begins on November 12, when Home Sweet Home Alone lands on Disney Plus. The sixth film in the festive franchise should win over fans with a new take on the holiday classic. Read our guide below for how to watch Home Sweet Home Alone online with Disney Plus – currently only $1.99 for your first month.",
    "It’s the holidays and the Mercers are frantically preparing for their Christmas getaway. However, the comically large household are split up onto two separate flights and, in the chaos, their 10-year-old son Max (played by Archie Yates) is left at home to fend for himself.",
    "Max is elated at the oversight initially, indulging in refined sugars and bouncing – literally – off the walls. But when two criminals break into his home to steal a priceless heirloom, the enterprising youth does everything he can to repel the bumbling burglars.",
    "Home Sweet Home Alone has promising comedy pedigree, featuring a chucklesome cast that includes Rob Delaney (Catastrophe) and Ellie Kemper (Unbreakable Kimmy Schmidt) as inept crooks Jeff and Pam, and Aisling Bea and Pete Holmes as Carol and Blake, Max’s overwhelmed parents.",
    "Most exciting though is the return of actor Devin Ratray as Buzz, Kevin’s annoying older brother from the first two films who's now all grown up and working as a police officer.",
    "Read on as we explain how to watch Home Sweet Home Alone online from anywhere below, as well as more details on subscribing to Disney Plus for one month for only $1.99/£1.99 as a part of the Disney Plus Day celebrations.",
    "New subscribers signing-up for Disney Plus before November 15 can get their first month for the bargain price of $1.99. Not only does that mean watching Home Sweet Home Alone on the cheap, but other recent high-profile additions, like Shang-Chi and the Legend of the Ten Rings and Jungle Cruise, both of which also arrive on the platform on November 12. Meanwhile, as of November 24 you can catch brand-new episodes of Hawkeye, the latest MCU spin-off.",
    "Disney Plus already offers great value, being cheaper than multiple competing streaming services, e.g. Netflix and HBO Max. But you can get even more bang for your buck when you sign up for an annual subscription and save 15% off the monthly price. Yes, you have to splash the cash at the start, but with so much content to get stuck into we doubt you'll run out of things to watch before your year is up. You're looking at $79.99/£79.90/AU$119.99 for a 12-month membership.",
    "If your interests are farther reaching (and you're in the US), then we'd seriously recommend the fantastic value bundle package. It adds Hulu and ESPN Plus to your subscription price, with the Hulu element opening up a world of more mature content, including Hulu Originals like The Great, Upload, Helstrom, and Normal People. Meanwhile, ESPN Plus brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $13.99 a month.",
    "In addition to Marvel blockbusters, National Geographic documentaries, Pixar, the entire Star Wars saga and every season of The Simpsons – oh, and a growing roster of Disney Originals too – international viewers get the Star on Disney Plus. This provides titles aimed at grown-ups and more than doubles the amount of content available to watch.",
    "Some of the best Star on Disney Plus shows include Big Sky, Solar Opposites, Only Murders in the Building and Love, Victor. And parents won’t have to worry about their kids accidentally seeing inappropriate content, because the rollout of Star includes a slew of new parental control features to ensure the service stays as family-friendly as ever.",
    "What devices can you watch Disney Plus on? The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "Read more:"
  ],
  "headers": {
    "6": "How to save money on Disney+",
    "9": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "currently only $1.99 for your first month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1131176264162632700&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "subscribing to Disney Plus for one month for only $1.99/£1.99": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-5647388999455739000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Disney Plus Day": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
    "signing-up for Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-8572219030071790000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "$79.99/£79.90/AU$119.99 for a 12-month membership": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1617552950409477000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN Plus": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $13.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1280058936198445600&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained",
    "best Star on Disney Plus shows": "https://www.techradar.com/news/disney-plus-star-launch-10-must-watch-shows-on-the-brand-new-channel",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device"
  }
}