{
  "source": "https://www.techradar.com/news/google-pixel-pass-subscription-is-its-answer-to-apple-one-new-leak-suggests",
  "title": "Google Pixel Pass subscription is its answer to Apple One, new leak suggests",
  "category": "phones",
  "updated": "2021-10-11T02:12:32Z",
  "author": "sharmishta-sarkar",
  "summary": "A monthly fee for a possible yearly handset upgrade and more",
  "article": [
    "Google Pixel 6 leaks are coming on thick and fast, with one UK retailer in particular unable to keep the cat in the bag over the weekend. Hot on the heels of that massive leak comes the disclosure of the Pixel Pass.",
    "Shared on Twitter by tech news aficionado M. Brandon Lee of This Is Tech Today fame, Pixel Pass seems to be Google's answer to the Apple One subscription service.",
    "According to the tweet, opting to pay a flat monthly fee could net you not only the Google Pixel 6, but also an extended warranty and access to Google One, Play Pass and YouTube Premium. According to the screenshot shared on Twitter, Pixel Pass will also be likely associated with Google Fi, the company's telephony service that is still only available in the US.",
    "We'd take this reveal with a pinch of salt, as it's unclear where the screenshot was obtained from. It reads like an internal document on how Google should handle Pixel Pass subscriptions.",
    "As per the screenshot in the tweet, customers will have to purchase a Pixel device to take advantage of the subscription service. And if that information is to be believed, it opens the door to getting future device upgrades on a regular yearly schedule, which could be quite tempting.",
    "Google is also seemingly making it easy to pick up a subscription, either via the Google Store or Google Fi. The latter, though, is restricted to US customers only, and Lee theorizes that the subscription service might also only be available to North American customers. However, if it's also going to be available via the Google Store, there's the possibility that a modified carrier-free version of the offer may come to other territories.",
    "A Pixel Pass also makes a lot of sense for any Google fans who are currently paying separately for Play Pass and YouTube Premium. And Apple One, the iPhone-maker's similar all-in-one subscription service, doesn't offer a device upgrade, giving Google a distinct advantage.",
    "The big question, of course, is how much Pixel Pass will cost subscribers; at this point, we don't have any specific details on plan pricing.",
    "Google has already generated a lot of public interest in its upcoming flagships by officially announcing them a couple of months in advance without revealing anything important about the devices themselves.",
    "Leaks around additional perks like the Pixel Pass are only adding to the buzz."
  ],
  "headers": {
    "4": "Analysis: Adding to the excitement of a new Pixel"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "massive leak": "https://www.techradar.com/news/huge-pixel-6-leak-reveals-almost-every-detail-about-the-new-phones",
    "This Is Tech Today": "https://twitter.com/thisistechtoday",
    "Apple One": "https://www.techradar.com/news/apple-one-subscription-service-release-date-price-and-news",
    "announcing them a couple of months in advance": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-pro-officially-revealed-by-google"
  }
}