{
  "source": "https://www.techradar.com/news/the-best-selling-prime-day-deal-is-this-half-price-4k-fire-tv-stick",
  "title": "The best-selling Prime Day tech deal is this half price 4K Fire TV Stick",
  "category": "televisions",
  "updated": "2021-06-22T13:30:45Z",
  "author": "samuel-roberts",
  "summary": "Grab the number one deal while the event is still happening",
  "article": [
    "As is always the case with Amazon's Prime Day deals, its range of Fire TV devices have taken a steep discount across the sales event. And one deal in particular has proven a massive success with Prime members: Amazon's 4K Fire TV Stick, which is just $25 today, half its usual price.",
    "(Not in the US? Keep scrolling for Fire TV deals wherever you are.)",
    "That deal topped Amazon's best-selling electronics in the US on Prime Day 2021 yesterday, June 21, and is still top today – so if you've been eyeballing one of these devices to make your TV smarter, or to give you a simple means of streaming 4K content with Alexa capability, these are the deals to look out for during Prime Day.",
    "Here are Amazon's Fire TV deals in the US right now:",
    "As you probably know, Amazon Prime Day is a finite event – the word 'day' is key, here, although it does span two days, technically. This deal will be available until the end of June 22, then it's gone. Amazon's devices tend to take the steepest discounts on sales events like Prime Day and Black Friday, so while you are likely to see these prices again down the line, you might be waiting a few months to get comparable deals.",
    "These aren't the only big deals on Amazon's electronics that are happening right now, as you might expect – there are some deep discounts on Fire HD tablets, too, not to mention Echo devices."
  ],
  "headers": {
    "4": "Prime Day Fire TV deals",
    "6": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "4K Fire TV Stick": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFire-TV-Stick-4K-with-Alexa-Voice-Remote%2Fdp%2FB079QHML21%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3866379292129696300-20",
    "deep discounts on Fire HD tablets": "https://www.techradar.com/news/these-are-amazons-3-hottest-prime-day-fire-hd-deals-right-now"
  }
}