{
  "source": "https://www.techradar.com/news/fossil-gen-6-smartwatch-release-date-price-news-and-features",
  "title": "Fossil Gen 6 smartwatch release date, price, news and features",
  "category": "wearables",
  "updated": "2021-09-07T13:56:34Z",
  "author": "james-rogerson",
  "summary": "This Fossil is no fossil - it's a high-end smartwatch",
  "article": [
    "The Fossil Gen 6 is the company's latest smartwatch and it includes significant upgrades - though arguably the biggest of these won’t actually be available at launch.",
    "We’re talking about Wear OS 3, a major operating system overhaul that will be available to the Fossil Gen 6 as a software update sometime in 2022.",
    "Still, there’s plenty to get excited about on day one, including a powerful chipset, fast charging, an SpO2 sensor, and more. Below we’ll cover the new wearable in detail, highlighting all the key specs and features, along with the release date and price.",
    "The Fossil Gen 6 was available to pre-order from August 30 in the US, with a price of between $299 (roughly £220 / AU$410) and $319 (around £230 / AU$440).",
    "At the time of writing we don’t have price or availability details for other regions, but the Fossil Gen 5 landed in the UK and Australia too, so we’d expect the Gen 6 would as well.",
    "The Fossil Gen 6 has a 1.28-inch circular AMOLED screen with 326 pixels per inch. That’s housed in a stainless steel case, which you can get in either a 42mm or 44mm size – but that doesn’t affect the size of the display.",
    "Both sizes are 11.5mm thick, but the 42mm model uses 18mm straps, while the 44mm one uses 22mm straps.",
    "The Fossil Gen 6 is also available in seven different styles, with four options available for the 44mm size, and three for the 42mm version. The right edge has two configurable push buttons and a rotating home button, so you’re not reliant purely on the touchscreen.",
    "Finally, the watch has a swim-proof build, with 3ATM water resistance, so you might never need to take it off – other than to charge it.",
    "On the fitness front, the Fossil Gen 6 has a heart rate monitor – one which is supposedly more accurate than the previous gen one on the Fossil Gen 5. It also includes GPS, and for the first time in the range an SpO2 sensor, for estimating your blood oxygen levels.",
    "Additionally, the Fossil Gen 6 can track your sleep, your calorie burn, and your cardio fitness levels.",
    "Beyond fitness, the wearable runs Wear OS, with an upgrade to Wear OS 3 planned for 2022. It has an always on display, and also contains both a speaker and a microphone, so you can not only talk to your watch (such as when saying things to Google Assistant) but also have it speak back. This also means you can take calls from your wrist.",
    "Other features include NFC, Wi-Fi, Bluetooth 5.0 LE, a compass and an altimeter.",
    "Fossil hasn’t said how big the battery is in the Fossil Gen 6, but the company has said that it offers upwards of 24 hours of life.",
    "More impressively, it apparently charges two times faster than leading smartwatches, allowing you to go from zero to 80% in just over 30 minutes.",
    "Charging is handled via a magnetic puck with a USB at the other end, and the watch also has smart battery modes to keep it running for longer.",
    "As for the core specs, the Fossil Gen 6 is powered by a Snapdragon Wear 4100 Plus chipset. This is the first smartwatch to use one, so it should provide plenty of power here.",
    "The watch also has 1GB of RAM and 8GB of storage – which you might want to use to store apps and music."
  ],
  "headers": {
    "3": "Fossil Gen 6 release date and price",
    "5": "Design and display",
    "9": "Fitness and features",
    "13": "Battery life and specs"
  },
  "links": {
    "Wear OS 3": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch"
  }
}