{
  "source": "https://www.techradar.com/news/phrozen-announces-the-highest-resolution-3d-printer-to-ever-hit-the-commercial-market",
  "title": "Phrozen announces the highest-resolution 3D printer to ever hit the commercial market",
  "category": "computing",
  "updated": "2021-10-07T12:00:49Z",
  "author": "jess-weatherbed",
  "summary": "The Sonic 8K Mini has plenty of detail to spare",
  "article": [
    "Phrozen, one of the world’s top manufacturers of 3D printers, has announced the Sonic 8K mini, a resin-based LCD printer with the highest resolution ever seen on a commercially available machine.",
    "As the name would imply, this printer's 8K resolution can achieve crisp details at even the smallest sizes, with an XY resolution of 1152 PPI (or 22 Microns), making it fantastic for tabletop miniatures and prototyping products like jewellery.",
    "While still being classed as a compact-sized printer, you’re getting a decent screen size of 7.1-inches, alongside other benefits like a solid metal resin vat and a 3.5-inch touch display panel.",
    "There are plenty of 3D printers on the market right now, but developments within the making space are coming thick and fast. If you’re on the market for something that can achieve extremely fine detail then you’ll be navigated towards resin-based printers (often called LCD, SLA or DLP dependant on what type of technology is being used), rather than filament (or FDM) printers thanks to their ability to pick up details without noticeable print lines.",
    "The Sonic 8K looks to be especially capable of not only getting in teeny details on prints but also smooth surfaces without any noticeable layer lines which can reduce post-processing time for sanding or priming.",
    "The early bird price for the Sonic Mini 8K will be $349.99 (around £260 / AU$480) with the original price set at $599.99 (around £440 / AU$820), and will be available to preorder over on the Phrozen website from October 17, though you’ll need to sign up for email alerts to get the notification regarding when preorders go live if you’re keen to get that early bird deal.",
    "The specifications and dimensions of the Phrozen Sonic 8K Mini are as follows:",
    "Phrozen is also launching a specialized 8K resin alongside the Sonic 8K, dubbed the Phrozen Aqua-Gray 8K Resin.",
    "It’s not clear if this will be available in other colors going forwards but Gray is a fantastic base for almost every project and prototype anyway that can better display the details of your print than solid black or white.",
    "“With the launch of Sonic Mini 8K, customers can now create extremely high-quality professional prints in 8K resolution effortlessly,” says Ray Wu, the CEO of Phrozen. “We aim to expand the accessibility of LCD 3D printing by continuing to create consumer-friendly and high-resolution 3D printers for the masses so that everyone can experience the joy of 3D printing.”",
    "If you’re especially keen to know more then Phrozen has a Facebook group where it provides more exclusive information to group members, which may prove useful if you’re looking to get yourself to the head of the queue."
  ],
  "headers": {
    "3": "The Phrozen Sonic 8K Mini is almost here",
    "6": "Phrozen Sonic 8K Mini specifications"
  },
  "links": {
    "3D printers": "https://www.techradar.com/news/world-of-tech/how-3d-printers-work-1300339?region-switch=CA",
    "preorder over on the Phrozen website from October 17": "http://phrozen3d.com/pages/mini-8k-preorder",
    "email alerts": "https://mailchi.mp/phrozen3d/something-is-coming",
    "Phrozen has a Facebook group": "https://www.facebook.com/groups/2113793522101458"
  }
}