{
  "source": "https://www.techradar.com/news/sorry-marvels-fantastic-four-cast-wont-be-revealed-any-time-soon",
  "title": "Sorry, Marvel's Fantastic Four cast won't be revealed any time soon",
  "category": "entertainment",
  "updated": "2021-07-02T08:56:31Z",
  "author": "tom-power",
  "summary": "The wait for Fantastic Four news goes on",
  "article": [
    "It's been a long time coming but, finally, Phase 4 of the Marvel Cinematic Universe (MCU) will begin when Black Widow launches on July 9.",
    "We've had to wait two years for a new Marvel movie to be released in theaters (due to the Covid-19 pandemic), but now there are plenty of upcoming MCU films to look forward to.",
    "Marvel's Phase 4 movie slate is almost complete at this point, but there's one superhero flick that's still a mystery to most of us – Marvel's Fantastic Four. Unfortunately, it doesn't sound like we'll be getting any major updates in the near future either.",
    "That's according to Marvel President Kevin Feige, who recently told ET Online that the studio wouldn't divulge any news about Fantastic Four casting announcements, release date or a plot synopsis any time soon.",
    "Speaking on the red carpet for Black Widow, Feige was asked about Marvel's Fantastic Four, but he remained tight-lipped on the subject.",
    "\"We'll see what happens with upcoming gatherings and fan events where we can release more news,\" Feige said. \"I hope sometime in the near future.\"",
    "Despite downplaying rumors of their involvement in the movie, John Krasinski and Emily Blunt have been tipped to fill the roles of Reed Richards/Mr. Fantastic and Sue Storm/the Invisible Woman respectively.",
    "Numerous actors have been linked with playing Johnny Storm/Human Torch and Ben Grimm/Thing, but speculation surrounding Krasinski and Blunt have overshadowed those other reports.",
    "Curiously, Feige teased the possibility that some online speculation (regarding the MCU as a whole) wasn't completely false during his ET Online interview, too.",
    "\"Everything we make is hopefully with the intention of exceeding expectations and fulfilling surprises,\" Feige hinted. \"Not every rumor you read about online is true, not by a long shot, but not every one is false either. So that's the fun.\"",
    "Does this mean that Krasinski and Blunt could be two members of the Fantastic Four's line-up? We're not so sure. After all, Feige's comments regarding rumors could be related to any of Marvel's upcoming slate of movies and TV shows. There's been lots of speculation regarding Spider-Man: No Way Home in particular, so we don't think that Feige's comments allude to Fantastic Four over this flick.",
    "Still, it does seem a bit strange that we haven't had any new information on the MCU's Fantastic Four movie.",
    "Of the 11 films in Marvel's Phase 4 line-up, Fantastic Four is the only one that doesn't have a release date. Every other entry is either set for a 2021 release, has entered post-production ahead of a 2022 launch, is currently being filmed or will start shooting before the end of the year.",
    "The only confirmed Fantastic Four news we have is that Jon Watts will direct it. Watts has helmed all three of Spider-Man's MCU movies, including No Way Home.",
    "Given that Watts will be knee deep into post-production on that movie, he won't be turning his attentions to Fantastic Four until that's completed. Spider-Man: No Way Home will arrive December 17 so, hopefully, we'll receive news on Fantastic Four once work on No Way Home is in the can.",
    "Feige also teased that we may learn more about in-person events once the world opens up more amid the pandemic. If there's any truth to those comments, we might hear during another red carpet event or a Disney Investor Day towards the end of 2021, much like the December 2020 one that revealed Marvel's entire Phase 4 slate."
  ],
  "headers": {
    "6": "Analysis: who could star in Marvel's Fantastic Four?"
  },
  "links": {
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "ET Online": "https://www.etonline.com/kevin-feige-on-how-black-widow-elevates-the-mcu-and-whats-next-for-marvel-movies-tv-exclusive",
    "downplaying": "https://variety.com/2021/film/news/emily-blunt-fantastic-four-invisible-woman-marvel-1234971591/",
    "rumors": "https://comicbook.com/marvel/news/john-krasinski-marvel-fantastic-four-reboot-reed-richards-mcu/",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know"
  }
}