{
  "source": "https://www.techradar.com/news/youll-soon-be-able-to-create-websites-with-drag-and-drop-in-wordpress",
  "title": "You'll soon be able to create websites with drag and drop in WordPress",
  "category": "computing",
  "updated": "2021-01-27T15:41:57Z",
  "author": "barclay-ballard",
  "summary": "Full site editing is coming later this year",
  "article": [
    "It looks like WordPress users may soon be able to create and edit websites using a simple drag and drop approach after reports of an ambitious full-site editing plan came to light.",
    "Looking at the roadmap for the rest of 2021, it appears that WordPress’s core contributors are working hard on launching full-site editing within the Gutenberg plugin by April.",
    "Josepha Haden Chomphosy, executive director of WordPress, has stated that full-site editing would deliver “the ability to edit all elements of a site using Gutenberg blocks.” Previously, themes, plugins, and the block editor were used to give websites their distinctive flavor.",
    "The block editor, also known as the Gutenberg plugin, was launched with WordPress 5.0 and changed how content was created, adding blocks for each paragraph, image, video, gallery, audio, and more. This is set for a major expansion over the next few months.",
    "Based on a GitHub page confirming the milestones being achieved by the full-site editing project, WordPress contributors have already completed aspects relating to the underlying infrastructure and user interface. However, styling, theme blocks, the query block, and the navigation block all need further refinement.",
    "Initially, it was thought that full-site editing would be included with the 5.7 WordPress release but that now looks overly ambitious. Instead, the first rollout of full-site editing is expected in April, around a month or so after the release of version 5.7.",
    "When the Gutenberg plugin was formally launched in December 2018, many WordPress users stuck with the Classic Editor, although perhaps simply to avoid any teething problems associated with the new offering. The same thing may occur with the release of full-site editing in April but nevertheless, many users will be excited by the prospect of full-site block-based editing."
  ],
  "headers": {
    "4": "Pressing ahead"
  },
  "links": {
    "WordPress": "https://www.techradar.com/reviews/wordpresscom#:~:text=WordPress%20offers%20a%20great%20website,features%20for%20a%20lower%20price.",
    "GitHub page": "https://github.com/WordPress/gutenberg/issues/24551"
  }
}