{
  "source": "https://www.techradar.com/news/apples-2022-ipad-could-bring-a-major-screen-improvement",
  "title": "Apple's 2022 iPad could bring a major screen improvement",
  "category": "phones",
  "updated": "2021-07-01T08:55:47Z",
  "author": "balakumar-k",
  "summary": "Possibly the iPad Air",
  "article": [
    "There have been a few reports that Apple is preparing iPad models with OLED screen technology, which would allow for bolder colors and improved contrast from the current LCD displays used in most iPads.",
    "And now South Korean news site The Elec, says Apple is planning to release its first OLED iPad in 2022, while the iPad Pro range will get the new screens by 2023. The ‌iPad‌ claimed to release next year will apparently have a 10.8-inch screen size, which suggests that the report may refer to the iPad Air 5, since that size is the same as the iPad Air 4.",
    "And for 2023, Apple is planning to launch an 11-inch OLED iPad and a 12.9-inch OLED iPad, the report claims. These are typically the screen sizes of the iPad Pro line, making it seem highly likely that they're the slates in question.",
    "As it happens, Samsung Display will be the sole supplier of these OLED panels, the report claims.",
    "Apple is also said to be working on different OLED structures for the iPad launching next year compared to the ones to be released in 2023.",
    "The iPad set for release next year is expected to use rigid OLED, but the iPads for 2023 may use flexible OLED instead.",
    "Flexible OLED is costlier than its rigid counterpart, however it offers more design freedom, as the bezels of the device can be made thinner. Apple uses flexible OLED for its iPhones, and in tablets it may make it easier to offer a 120Hz refresh rate, a feature currently exclusive to the iPad Pro.",
    "Apple is said to be going for the manufacture of rigid OLED screens first because production of flexible OLED is still not at the level it needs for mass production just yet - but by the sounds of it, flexible OLED screens will be used in most iPads beyond 2023."
  ],
  "headers": {
    "4": "Different OLED structures for different iPad models"
  },
  "links": {
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=3009",
    "iPad Air 5": "https://www.techradar.com/news/ipad-air-5",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review"
  }
}