{
  "source": "https://www.techradar.com/news/your-next-vr-game-could-be-based-on-bridgerton-but-will-it-ever-happen",
  "title": "Your next VR game could be based on Bridgerton, but will it ever happen?",
  "category": "entertainment",
  "updated": "2021-07-09T15:14:54Z",
  "author": "hamish-hector",
  "summary": "Wine and dine with the London elite",
  "article": [
    "Dearest readers, it has been brought to our attention that Netflix has made its boldest virtual reality announcement yet, stating it now owns the rights to produce games and VR titles based on Bridgerton.",
    "The declaration was made as part of a newly announced deal with series producer Shonda Rhimes.The expanded 'Creative Pact' between Netflix and Rhimes' Shondaland Media company includes several facets. For Bridgerton fans it means new content will be delivered exclusively through Netflix including three more seasons of the show (season two will debut in 2022) as well as a spin-off story that expands on the origins of Queen Charlotte.",
    "We could also see the so-called 'Bridgerton-verse' expand into other formats too, such as feature films and \"potential gaming and virtual reality content\". There is also a deal to produce live events and experiences too.",
    "This new deal between Shondaland Media and Netflix goes beyond just Bridgerton though. It includes a pledge to create new \"DEIA (Diversity, Equity, Inclusion, Accessibility) programs that can increase industry workplace representation or underrepresented groups both domestically and in the UK.\"",
    "What this means in specific terms will apparently be revealed at a later date, but hopefully, the deal will lead to more diverse talent both on and off-screen at Netflix productions.",
    "Before we start theorizing we’ll need to keep in mind that while Netflix can make a Bridgerton VR game, that doesn’t mean it will. Much like how a patent doesn’t guarantee a piece of tech is on the way, this deal is the same.",
    "As Netflix explores VR and gaming content we’ll likely see more of these kinds of contracts – which leave the door open for Netflix to use properties across a range of different mediums if it wants to. It's yet to be seen if it'll take advantage of this clause or not, though.",
    "However, if we assume Netflix is going to create a VR game, what might it look like? We're not convinced it'll be anything too substantial, and likely won't take the form of something like Beat Saber or Vacation Simulator, but we have a couple of ideas.",
    "After Netflix's Black Mirror: Bandersnatch experience, it could be a choose your own adventure game where you must find your ideal suitor and navigate your way through the complicated maze of high society.",
    "Alternatively the VR 'game' could instead be more of an experience, like the live events Netflix has planned. You could be a guest at a party, able to watch on as the latest drama unfolds around you. There may be opportunities to dance or interact with the odd character, but you would likely have little (if any) control over the narrative that plays out.",
    "Netflix could also choose to do something entirely different, however, we feel like these two ideas are most likely. Hopefully, we won't have to wait too long to find out what the Bridgerton VR game actually turns out to be, if it ends up being made at all."
  ],
  "headers": {
    "5": "What could a Bridgerton VR game look like?"
  },
  "links": {
    "Bridgerton": "https://www.techradar.com/news/bridgerton-season-2-first-look-and-what-we-know",
    "'Creative Pact'": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4668074075507621000/https://about.netflix.com/en/news/netflix-and-shonda-rhimes-expand-creative-pact",
    "season two will debut in 2022": "https://www.techradar.com/news/bridgerton-season-2-first-look-and-what-we-know",
    "Beat Saber": "https://www.techradar.com/best/the-best-vr-games",
    "Black Mirror: Bandersnatch": "https://www.techradar.com/news/the-black-mirror-movie-bandersnatch-hits-netflix-on-december-28-2018"
  }
}