{
  "source": "https://www.techradar.com/news/where-to-watch-run",
  "title": "Where to watch Run: Stream every episode online",
  "category": "entertainment",
  "updated": "2021-04-19T11:25:38Z",
  "author": "kieron-moore",
  "summary": "Escape into this comedy thriller",
  "article": [
    "If you’re looking for a new show to binge on, you might want to watch Run. Created by Vicky Jones, this comedy thriller was first broadcast on HBO in 2020, and though no second season has been commissioned, the seven episodes are well worth catching up on. We’ll tell you where you can find it online in this guide.",
    "Run stars Merritt Wever as the unhappily married Ruby Richardson, whose life is turned upside down when she receives a text simply saying ‘RUN’. It’s revealed that, 17 years earlier, she made a playful pact with a college boyfriend: if either of them ever wanted to escape their life, they’d send this text to the other and then meet at Grand Central Station to embark on an epic US road trip.",
    "The series stars Domhnall Gleeson as Billy, the aforementioned college boyfriend, and Rich Sommer as Ruby’s husband Laurence. Phoebe Waller-Bridge also makes an appearance as a woman they encounter on their journey. The series was critically praised for its energetic pace, witty subversion of rom-com clichés, and the stellar performances of Wever and Gleeson.",
    "While HBO Max is the home of Run in the US, you’ll find it on different online platforms depending on where you are in the world. In this article, we explain how to watch Run if you’re in the US, UK, Australia, or Canada.",
    "Looking for the 2020 film of the same name starring Sarah Paulson? You can watch Run on Hulu in the US, or on Netflix across other territories around the world, including the UK."
  ],
  "headers": {
    "4": "How to watch Run: stream every episode online in Australia"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "watch Run": "https://www.techradar.com/news/how-to-watch-run-movie-hulu-online-sarah-paulson",
    "Hulu": "https://click.linksynergy.com/fs-bin/click?id=kXQk6*ivFEQ&offerid=966271.867&type=3&subid=0&u1=trd-us-1111016153297316400"
  }
}