{
  "source": "https://www.techradar.com/news/seven-trends-accelerating-autonomous-digital-enterprise",
  "title": "Seven trends accelerating Autonomous Digital Enterprise",
  "category": "computing",
  "updated": "2021-04-22T10:41:30Z",
  "author": "april-hickel",
  "summary": "Organizations are laser-focused on digital transformation",
  "article": [
    "Digital transformation was a long-term strategy for many organizations, but the global pandemic has dramatically changed this charter’s cadence. Now every organization, in every industry, is laser-focused on digital transformation as they seek to respond to urgent and rapidly changing customer needs.",
    "Companies on this journey towards achieving greater agility, data driven actionable insights and greater customer centricity are striving towards becoming an Autonomous Digital Enterprise (ADE). And while many have looked to cloud computing, automation, and AI for the flexibility, speed, and agility they need, the mainframe plays a central role in powering one’s ADE journey along with the digital services that organizations and their customers rely on.",
    "As a result, we’ll see seven key mainframe trends emerging while organizations pursue this digital acceleration.",
    "For most of its tenure, the mainframe has been treated with celebrity status, kept behind a velvet rope, separated from the rest of the organization’s IT infrastructure. As it is further integrated with distributed systems and customer-facing web apps, IT and the wider enterprise will realize that the mainframe is a key part of their hybrid digital delivery infrastructure. They will therefore see there’s a pressing need to bring the mainframe out into the mainstream to support their continued transformation. To enable this, we’ll see an increased shift towards self-managing mainframes, with more widespread adoption of modern practices such as AIOps and automation. The traditional adoption curve for this will also be disrupted, as organizations realize they don’t have the luxury of waiting.",
    "As we continue further into 2021, enterprises will double down on digital transformation, as they race to deliver new applications and services faster than ever. The mainframe will be key to their ability to succeed, so must be prioritized and treated in the same way as any other platform that powers transformation. We’ll therefore see organizations increasingly look to integrate the mainframe with wider DevOps approaches to supercharge innovation and delight customers. Application development will begin to look the same on the mainframe as it does off the mainframe, as true cross-platform DevOps arrives.",
    "As cross-platform DevOps gathers momentum, organizations will increasingly realize the need to modernize the developer experience to empower a new generation to work on the mainframe with confidence. To do so, they will need to make it so the only difference between the mainframe and other platforms is in syntax. As such, we’ll see organizations enabling their developers to work on the mainframe using the same intuitive development environments and toolchains for build, test, and deploy that they are familiar with from other systems. In effect, this means developers only need to learn COBOL before they can drive innovation on the mainframe.",
    "Automated testing will be a big priority in the coming year as organizations move towards enabling a self-managing mainframe. Developers traditionally follow the ‘bake a cake’ method, where certain steps such as testing take a pre-determined amount of time, regardless of what is being ‘baked’. This leads to a lengthy process that isn’t suited to the rapid pace of modern transformation. Developers need to know within hours, not weeks, if their change has had the desired effect, or if it adversely impacts the business. Test automation therefore provides a powerful capability to change the way people think about developing apps and how they work, and is a core component of being able to go faster on the mainframe.",
    "There’s a perception that because the mainframe is the most securable platform, it is inherently secure. However, most organizations focus only on access control, which while important, doesn’t ensure the same level of cybersecurity that exists on other platforms. As the mainframe is increasingly part of a hybrid digital delivery infrastructure, it is more open to the internet, and there is no longer the benefit of security-through-obscurity. Bad actors are now targeting mainframes more regularly, to gain access to valuable customer information. As organizations seek to address this, they will treat the security of the mainframe the same way they do for any other platform, governed with the same tools and processes for detection and advanced indicators of compromise.",
    "It’s difficult to measure productivity in a useful way, but you can measure waste and remove it from the system far more readily. As organizations look to apply this thinking to the mainframe to identify how digital innovation can be accelerated, we’ll see the broad adoption of value stream mapping. This will help to identify key bottlenecks, such as where developers are waiting weeks for code to be reviewed before they can progress their project along the delivery pipeline. Once these areas have been identified, it’s easier to determine where automation and other changes can be introduced to deliver greater value through a self-managing mainframe.",
    "Many enterprises still have siloed operations centers for the mainframe, but this will change as they look to accelerate their evolution into an ADE by imbuing Ops with the same speed and agility they’ve achieved in development. In the months ahead, we’ll see growing efforts to break down the silos that remain on the Ops side to accelerate DevOps further. Database change management will be integrated into DevOps, driving a shift from event-driven, towards intelligent operations. This will enable organizations to take advantage of their databases to create a tighter loop between Dev and Ops and enable more predictable outcomes from software delivery.",
    "As the mainframe becomes further ingrained in the backbone of organizations’ IT infrastructure, these seven key trends will become vital to driving digital acceleration and pivotal while on one’s journey to become an Autonomous Digital Enterprise."
  ],
  "headers": {
    "3": "1. The mainframe will go mainstream, quickly",
    "4": "2. The increase of Multi-platform pipelines",
    "5": "3. Developer experience will be a first-class citizen",
    "6": "4. Mainframe testing will be automatic",
    "7": "5. Security through obscurity will disappear",
    "8": "6. Value stream mapping will increase",
    "9": "7. The walls in Ops will come down"
  },
  "links": {
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "IT infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "apps": "https://www.techradar.com/news/best-free-iphone-apps",
    "DevOps": "https://www.techradar.com/best/best-devops-tools",
    "COBOL": "https://www.techradar.com/best/cobol-online-courses",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "productivity": "https://www.techradar.com/best/best-productivity-apps"
  }
}