{
  "source": "https://www.techradar.com/news/dont-hold-your-breath-for-an-oled-ipad-any-time-soon",
  "title": "Don't hold your breath for an OLED iPad any time soon",
  "category": "tablets",
  "updated": "2021-10-01T09:05:37Z",
  "author": "tom-bedford",
  "summary": "Apparently it's been canceled",
  "article": [
    "If you care a lot about screen tech in devices, you might have been excited about rumors that Apple could start using OLED screens on its tablets, instead of LCD like it normally does. Well, you might want to put a pin in that excitement for now.",
    "According to South Korean website The Elec, speaking to sources close to the matter, Apple and Samsung Display (not Samsung Mobile, just the division of Samsung that makes device screens), have ceased working together on a 10.86-inch OLED display that was destined for an iPad. This was anticipated for a 2022 release.",
    "Apparently, the project was canceled either due to issues with the screen structure, or with the ability to turn a profit on this new screen. The report paints a picture of a discordant relationship, with Apple wanting improved longevity for the screens, and Samsung ignoring Apple's requests as it would involve creating a whole new structure for the displays that it hadn't used before.",
    "It remains to be seen how much of this report is true, though, especially since it's been machine-translated from Korean, which could leave scope for misinterpretations.",
    "According to The Elec, Apple is working separately on two other OLED iPads which would launch in 2023 and 2024 respectively, so if you're a fan of OLED screens you're in luck. You just might have to wait much longer than you thought.",
    "Due to the different ways OLED and LCD panels work, the former can be slightly better for brightness and contrast ratios on a screen - they can often look a little crisper too.",
    "Not everyone will notice the difference between LCD and OLED screens though - average tech users will only see that they're different when literally putting them next to each other.",
    "However professionals, and power users, might care about the slight differences between OLED and LCD, and in particular professionals and creatives might. And since that's who the iPad Pro line is aimed at, it makes sense that Apple would want to adopt these screens into certain products.",
    "Still, if you're just in the market for a regular old slate because you're a student or casual iPad user, you might not care about OLED."
  ],
  "headers": {
    "5": "Analysis: what's the buzz about OLED?"
  },
  "links": {
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=3411"
  }
}