{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-vs-motorola-razr-5g-battle-of-the-clamshell-foldable-phones",
  "title": "Samsung Galaxy Z Flip 3 vs Motorola Razr 5G: battle of the clamshell foldable phones",
  "category": "phones",
  "updated": "2021-10-09T13:00:07Z",
  "author": "jon-mundy",
  "summary": "Clash of the clamshells",
  "article": [
    "It seems Samsung has finally cracked the foldable phone market, with the Galaxy Z Flip 3 turning out to be, in our reviewer’s words, the first “clamshell foldable for the mainstream”.",
    "But it isn’t the only clamshell foldable in town. Motorola went with a similar compact foldable concept for its 2020 Razr revamp – admittedly, with mixed results.",
    "So how does the Motorola Razr 2020 stack up to its young upstart rival? That’s what we’re here to unfold.",
    "The Samsung Galaxy Z Flip 3 went on sale on August 27, 2021. The 128GB model costs $999 / £949 / AU$1,499, while the 256GB model will set you back $1,049 / £999 / AU$1,599.",
    "The Motorola Razr 2020 rolled out across September and October 2020, around a year prior to the Galaxy Z Flip 3. It cost $1,399 / £1,399 (around AU$1,900) at launch, but we’ve seen it going for around $1,000 / £850 on Amazon of late.",
    "This means that we’re looking at two similarly priced foldable flip phones – which, to be frank, doesn’t do one of these devices any favors whatsoever.",
    "Both of these phones adopt the same basic design: a clamshell smartphone that’s a compact square when closed, and a long, thin rectangle when open.",
    "The Samsung Galaxy Z Flip 3 is a subtle but welcome refinement of the previous two generations. The main difference here is a refined aesthetic, but there have also been some under-the-skin reinforcements.",
    "We particularly like the new ‘Glasstic’ back and glass camera module surround, which give the phone a far more distinctive and harmonious style.",
    "However, we don’t like how high the power button sits along the right-hand edge, especially since it contains the fingerprint sensor. Motorola wins here with its rear-mounted fingerprint sensor, which is much easier to access.",
    "Both devices are small, but the Galaxy Z Flip 3 is more pocketable. Even unfurled it measures a mere 166 x 72.2 x 6.9mm, and weighs a moderate 183g. While slender, the Motorola Razr feels a little chunky by comparison at 169.2 x 72.6 x 7.9mm and 192g.",
    "Samsung has worked on its hinge mechanism to the point where it feels plenty secure, and will happily sit open at a range of angles. By comparison, Motorola’s handset will only really lock in a fully closed or fully open position, and it feels a little creaky in operation.",
    "In addition, it lacks the chunky chin of the Razr, which despite its aluminum frame and twin-glass surfaces, feels a little cheaper and less premium.",
    "These two phones have a pair of displays each – one large one on the inside, and one smaller one on one half of the external surface.",
    "We’d hand Samsung the win for the main fold-out display, and Motorola the win for the external secondary display.",
    "Samsung’s main screen is a 6.7-inch AMOLED display with a 1080 x 2640 resolution. Motorola’s 6.2-inch P-OLED is significantly smaller, and at 876 x 2142 it’s also less sharp.",
    "The Galaxy Z Flip 3 screen also wins out for smoothness, with a full 120Hz refresh rate compared to the Razr 2020’s meagre 60Hz.",
    "As you might expect from Samsung, its main screen is simply of a higher quality than that of its rival. This is the company that supplies most of the OLED panels in the industry, after all, and that expertise shows.",
    "When closed, however, the Galaxy Z Flip 3 has to rely on a 1.9-inch AMOLED with a mere 260 x 512 resolution. The Motorola Razr 2020 gets a 2.7-inch 600 x 800 screen, which is more useful all-round.",
    "You won’t want to do an awful lot of heavy-lifting on either of these secondary displays, but the Razr’s is undoubtedly better for previewing messages without having to open up the device.",
    "You shouldn’t buy any foldable phone expecting a top-tier camera experience. That’s one of the big compromises you’ll have to make in order to get such a futuristic design today.",
    "It should come as no surprise to learn then that neither device packs a particularly good camera. However, of the two, Samsung’s system is slightly more flexible.",
    "You get twin 12-megapixel cameras here, led by a 1/2.55in wide sensor, and backed up by a 12-megapixel ultra-wide. This is aided by Samsung’s strong software provision, but it simply isn’t in the same league as the Samsung Galaxy S21 family.",
    "The Motorola Razr 2020 doesn’t impress either, with just a single 48-megapixel 1/2.0in wide sensor. There’s no ultra-wide option here.",
    "Both camera systems are capable of taking decent shots, but they lack the extensive features and flexibility of even a good mid-range camera system. For the money, it really isn’t too impressive a showing on either front.",
    "Samsung’s foldable can shoot 4K 60fps video, while the Motorola can capture lesser 4K 30fps footage.",
    "On the selfie front, Samsung offers a 10-megapixel f/2.4 front camera, while Motorola equips you with a 20-megapixel f/2.2 equivalent.",
    "When it comes to raw performance, Samsung wins comfortably. The Galaxy Z Flip 3 packs Qualcomm’s Snapdragon 888 chip, which is the top Android processor for 2021.",
    "The Motorola Razr 2020 doesn’t even get close to this level of performance. It doesn’t even pack a Snapdragon 865, the Snapdragon 888’s 2020 predecessor, but rather relies upon that year’s mid-range Snapdragon 765G.",
    "For a phone that still sells for somewhere in the region of $1,000 / £850, that’s a pretty poor showing. We criticized it at launch, and it’s a decision that hasn’t aged all that well either.",
    "You probably won’t notice a big performance shortfall in general tasks – and this really isn’t the device on which you’d choose to play a lot of high-end mobile games anyway. But we’d still expect better, if only to ensure a longer shelf life for your investment. You can bet that the Motorola Razr 2020 will start to feel slow years before the Samsung Galaxy Z Flip 3 does.",
    "At least both phones are backed by a decent 8GB of RAM. And Motorola has the decency to provide 256GB of internal storage as standard, while Samsung lays on either 128GB or 256GB.",
    "On the plus side for Motorola, the Razr comes with Motorola’s typically clean take on Android, whereas the Galaxy Z Flip 3 packs Samsung’s slightly busy One UI. But even then, some people love Samsung’s hands-on approach, and this has led to some useful split-screen optimization (such as Flex mode).",
    "Neither of these phones will last you much beyond a day in the battery life stakes. Both have fairly small units – 3300mAh for the Galaxy Z Flip 3, and 2800mAh for the Motorola Razr 2020.",
    "Not surprisingly, we often found ourselves running short of juice before the end of the day with both phones.",
    "Neither phone bundles in a charger either, which feels stingy at the prices being quoted. We get the whole sustainability angle, but this feels a little cheap.",
    "In terms of supported charging standards, the Samsung Galaxy Z Flip 3 wins out. It supports 25W wired, whereas the Motorola Razr 2020 supports only 18W wired.",
    "Meanwhile, only the Samsung offers provision for (11W) wireless charging. Again, even at a heavily discounted $1,000 / £850, we’d have expected the Motorola Razr 2020 to offer a similar facility.",
    "Every single foldable phone we’ve reviewed to date has come with its fair share of caveats, and these two clamshell devices are no different. It’s still early days for foldables, and compromises have to be made to attain those futuristic form factors at a less-than-extortionate price.",
    "But the Samsung Galaxy Z Flip 3 gets the closest yet to a truly mainstream-ready foldable phone. It’s tidy, fast, intuitive and well built. The only real compromises are a middling camera, no dust-resistance, and so-so battery life.",
    "The Motorola Razr 2020, on the other hand, is rife with compromises. It’s slower than it should be, a little creaky around the edges, and its main display is worse than that of many modern mid-range ‘normal’ phones.",
    "With a price that still feels expensive, even after heavy discounting, we simply can’t recommend it to anyone – and certainly not over the far superior Samsung Galaxy Z Flip 3."
  ],
  "headers": {
    "3": "Samsung Galaxy Z Flip 3 vs Motorola Razr 2020 price and availability",
    "6": "Design",
    "13": "Display",
    "20": "Cameras",
    "27": "Specs and performance",
    "33": "Battery",
    "38": "Takeaway"
  },
  "links": {
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Motorola Razr 2020": "https://www.techradar.com/reviews/motorola-razr-2020-review"
  }
}