{
  "source": "https://www.techradar.com/news/microsoft-windows-11-design-will-not-hamper-performance",
  "title": "Microsoft: Windows 11 design will not hamper performance",
  "category": "computing",
  "updated": "2021-08-12T12:56:09Z",
  "author": "joel-khalili",
  "summary": "Microsoft says Windows 11 performance is a top priority",
  "article": [
    "Microsoft has dismissed the idea that design elements set to debut with Windows 11 could have a detrimental effect on performance.",
    "In a Q&A session for developers, the company set out its vision for Fluent Design, a framework applied by Microsoft in-house and used by developers to create apps that feel as if they were designed natively for Windows.",
    "Microsoft also shared information about a new “design material” called Mica, housed under Fluent Design , which aligns the background color of certain applications (e.g. Edge, Teams, Settings) with the desktop, and creates a “color hierarchy” that helps distinguish between multiple open instances of the same app.",
    "In Windows 11, Mica will be applied in a range of scenarios, but Microsoft insists the introduction of greater intelligence to design elements will not come at the cost of performance.",
    "“Performance is really a top priority for us and we want to ensure that all these new functionalities (Mica and rounded corners) are super fast and don’t impact the OS,” explained the firm.",
    "“For example, Mica was specifically designed for higher performance when compared to things like Acrylic (ed: another design material). And for rounded corners, we optimized our rendering performance so you shouldn’t notice any difference to square corners.”",
    "Microsoft also took the opportunity to squash rumors that some Windows 11 design components (such as the new Start menu and rounded corners) were inspired by Apple’s macOS.",
    "“Good design tends to be similar,” noted Kevin Gallo, Head of Developer Platform at Microsoft. “We learn from each other, but Fluent has been around a long time.”",
    "“We’re evolving with how people use our devices - and that’s changing all the time. [The design elements] may look familiar, but our goal is that they feel natural and normal.”",
    "While Mica and other Fluid Design elements have already begun to bleed into Windows 11 preview builds, the process will be incremental as Microsoft slowly optimizes its new operating system. It won’t be until launch, then, that users get to experience the fruit of Microsoft’s new approach to design.",
    "Via WindowsLatest"
  ],
  "headers": {
    "6": "Windows 11 design"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Q&A session": "https://www.youtube.com/watch?v=NEJeKICE-XM",
    "Mica": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5646648990198525000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fwindows%2Fapps%2Fdesign%2Fstyle%2Fmica",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "WindowsLatest": "https://www.windowslatest.com/2021/08/12/microsoft-windows-11s-new-design-will-not-affect-performance/"
  }
}