{
  "source": "https://www.techradar.com/news/sorry-nintendo-sega-and-sony-the-a500-mini-is-the-only-tiny-retro-console-i-want",
  "title": "Sorry Nintendo, Sega and Sony – the A500 Mini is the only tiny retro console I want",
  "category": "computing",
  "updated": "2021-08-10T15:59:18Z",
  "author": "matt-hanson",
  "summary": "The Amiga lives!",
  "article": [
    "Retro Games has announced the A500 Mini, a compact mini replication of the Amiga A500 – and I want it NOW.",
    "While the likes of Nintendo, Sega and Sony have been releasing mini reimaginings of their iconic consoles, this is the first one to get me really excited.",
    "Why? Well, the SNES, Mega Drive (sorry US readers, it's not the Genesis), and PS1 are all fine consoles, but the Amiga A500 holds a special place in my heart.",
    "In fact, if I hadn't got the Amiga A500+ for Christmas 30 years ago, I probably wouldn't be a tech journalist. With games like Lemmings, R-Type, Zool and Shadow of the Beast (one day I'll finish that bloody game), my love of computer games was cemented.",
    "The Amiga was so much more powerful than its console contemporaries, which led to games with graphics and audio that Nintendo and Sega fans could only dream of.",
    "So, to see it reimagined as a tiny mini console has really got me excited.",
    "Coming with a compact replica body of the Amiga A500, along with a mouse and new game pad, the A500 Mini can plug into modern TVs via HDMI. It also comes with USB ports for plugging in a real keyboard (it seems the keyboard on the console itself isn't usable, or if it is, would be quite uncomfortable). Hopefully it'll allow me to plug in a joystick as well. I don't think I could imagine playing the likes of Rainbow Islands or Silkworm without one.",
    "This fully licensed mini console also comes with 25 classic Amiga games including Simon The Sorcerer, Worms, Speedball 2, Battle Chess (which taught me to play the iconic game) and more that have yet to be announced.",
    "It doesn't seem like the floppy drive in the A500 Mini actually works, and is instead just for show, which is a shame as I still have all my floppy disks. However, the A500 Mini will allow you to run your own games as well by using a USB memory stick. Emulating Amiga games can be a bit of a pain, so if this allows me to replay some of my most beloved games quickly and easily, then I am sold.",
    "There's also a save game function (essential for some of these exceptionally hard games), a choice of 50Hz or 60Hz screen refresh rates, CRT filters to make games look like they are being played on old TVs, and scaling options.",
    "It'll be coming out in early 2022 for $139.99 / £119.99 / AU$199.99. Pricey, but if this brings the glory of the Amiga to more people, I'm all for it. Personally, I can't wait."
  ],
  "headers": {
    "6": "Mini marvel"
  },
  "links": {}
}