{
  "source": "https://www.techradar.com/news/apple-reveals-another-major-eu-expansion",
  "title": "Apple reveals another major EU expansion",
  "category": "phones",
  "updated": "2021-03-10T14:06:22Z",
  "author": "steve-mccaskill",
  "summary": "Apple's European Silicon Design Center claims to be Europe's largest",
  "article": [
    "Apple is to build Europe’s largest R&D facility for mobile wireless semiconductors and software technology in Munich as part of a $1 billion investment in Germany.",
    "The Bavarian city is already Apple’s largest European engineering hub with more than 1,500 engineers working on power management design, application processors and other wireless technologies that power Apple’s custom chips.",
    "The Cupertino-based company now wants to build on this foundation with the establishment of the a ‘state of the art’ Apple European Silicon Design Center that will house Apple’s cellular unit. The focus will be on 5G and other wireless technologies – including modems.",
    "Apple has moved to design more of its components itself in recent years in order to gain more control over cost, development and timelines. This allows the firm to differentiate against Android manufacturers who source from a pool of suppliers.",
    "The firm has made its own processors for the iPhone and iPad since 2010, while in 2017, it announced it planned to stop including UK chip manufacturer Imagination Technologies’ graphics technology in favour of an alternative developed in-house.",
    "However, developing a modem chip is a complicated and expensive exercise that has necessitated long-term planning. Apple has set up shop in San Diego, home of Qualcomm, in a bid to attract engineers to the endeavour, while it also bought Intel’s 5G modem business back in 2019.",
    "“I couldn’t be more excited for everything our Munich engineering teams will discover — from exploring the new frontiers of 5G technology, to a new generation of technologies that bring power, speed, and connectivity to the world,” said Tim Cook, Apple CEO.",
    "“Munich has been a home to Apple for four decades, and we’re grateful to this community and to Germany for being a part of our journey.”",
    "Hundreds of new jobs will be created at the 30,000 square metre facility in central Munich, which is due to open in 2022, bringing Apple’s total workforce in Germany to above 4,000."
  ],
  "headers": {
    "3": "Apple 5G Munich"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}