{
  "source": "https://www.techradar.com/news/intel-ceo-says-chip-shortage-could-stretch-into-2023",
  "title": "Global chip shortage could stretch into 2023, Intel CEO warns",
  "category": "computing",
  "updated": "2021-07-23T16:27:54Z",
  "author": "mayank-sharma",
  "summary": "It might take up to two more years to fully catch up to demand, says Intel chief",
  "article": [
    "The global chip shortage that has hamstrung manufacturers across the world may go on for some time yet, according to Intel’ CEO Pat Gelsinger.",
    "\"While I expect the shortages to bottom out in the second half, it will take another one to two years before the industry is able to completely catch up with the demand,” said Gelsinger as he announced the company’s Q2 2021 earnings.",
    "The on-going silicon crunch is the result of a multitude of factors, which can be traced back to the beginning of the pandemic, starting with the shuttering of production facilities due to health protocols, coupled with the sudden rise in demand for tech gear, including laptops and tablets as people around the world were forced to work and study remotely due to worldwide lockdowns.",
    "A severe drought in Taiwan, which forced the country to divert water supply from several industrial areas, including a hub of semiconductor manufacturing, further compounded the global shortage.",
    "Gelsinger also used the opportunity to point out that Intel’s IDM 2.0 strategy is helping the chip giant weather the storm.",
    "IDM 2.0 is Intel’s overhauled take on its integrated device manufacturing (IDM) model, which Gelsinger announced earlier this year.",
    "The strategy has already been put into action with the chip giant investing billions of dollars to upgrade and create new chip fabrication units in the US, and is also lobbying for a multi-billion dollar collaboration with the EU to help it double its semiconductor production by 2030.",
    "The real kicker though would be Intel’s acquisition of GlobalFoundries, which operates a number of chip foundries around the world. The two are reportedly in talks, although there has been no official confirmation from either party.",
    "Revenue-wise, Q2 2021 was another strong quarter for Intel. Despite the supply chain challenges, Intel generated $18.5 billion in revenue, riding once again on PC sales, just as it did in its Q1 2021 earnings."
  ],
  "headers": {
    "4": "Building capacity"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "tablets": "https://www.techradar.com/news/best-tablet",
    "work and study remotely": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "severe drought in Taiwan": "https://www.techradar.com/news/global-computer-chip-shortage-could-last-for-months",
    "Intel’s IDM 2.0": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "investing billions of dollars": "https://www.techradar.com/news/intel-investing-billions-in-us-manufacturing-plant",
    "collaboration with the EU": "https://www.techradar.com/news/intel-investing-billions-in-us-manufacturing-plant",
    "reportedly in talks": "https://www.techradar.com/news/intel-in-talks-to-acquire-globalfoundries-in-dollar30bn-deal",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Q1 2021 earnings": "https://www.techradar.com/news/intel-records-mixed-q1-but-pc-sales-offer-a-silver-lining"
  }
}