{
  "source": "https://www.techradar.com/news/a-control-sequel-and-multiplayer-spin-off-are-in-the-works",
  "title": "A Control sequel and multiplayer spin-off are in the works",
  "category": "gaming",
  "updated": "2021-06-30T10:33:01Z",
  "author": "vic-hood",
  "summary": "Out of Control? Not even close",
  "article": [
    "Two new Control games are officially in the works, developer Remedy Entertainment has confirmed – including both a sequel and a multiplayer spin-off.",
    "In a post on the developer's website, titled 'The Future of Control', Remedy Entertainment announced that it has signed a co-publishing and development agreement with 505 Games to make a Control multiplayer spin-off, codenamed Project Condor.",
    "Mikael Kasurinen, Game Director of the Control franchise, wrote in the post:",
    "\"Control is first and foremost a world, a place for multitudes of stories, events, and characters. A place where unexpected, strange, and extraordinary things occur. We kicked it off with Jesse’s entry into the Oldest House, but there is more to this world. Oh, so much more. And Project Condor will be an expression of that.\"",
    "But Kasurinen also acknowledged that some players may not necessarily be pleased about this new multiplayer Control game, after all, spin-off multiplayer modes aren't always a hit with fans.",
    "\"We get that there is going to be skepticism about multiplayer,\" Kasurinen wrote. \"But I believe we can create shared experiences without compromising the unique DNA of who we are, or the stories we want to tell. Yes, we need to re-think our angles, our techniques, our mindset, but we see it as an exciting challenge: What would a Remedy multiplayer game look like?",
    "\"The Vanguard team has done awesome progress on that front already, and the possibilities there are extremely exciting. Both games will be different examples of how you can collectively experience our worlds.\"",
    "Details on this multiplayer spin-off are thin on the ground but we do know it will be a 4-player PvE co-op game set in Control's world – but it sounds like it won't be set in the Oldest house. Remedy shared the image above saying that it \"tells pretty well what Condor is about\", so we imagine players will be working in a team to perhaps take down tackle Altered World Events and creatures, perhaps as part of the FBC?",
    "While the post focused primarily on Project Condor, it also revealed that another \"bigger-budget Control-game\" is in the works, too.",
    "While not much was shared on this other new Control game, Kasurinen called it \"ambitious\" and seemed to suggest that we could see a new protagonist and setting in this new game, saying: \"Control is more than one location, character, or story\".",
    "Control released to critical acclaim back in 2019, so it's no surprise that more games are planned. We're hoping Remedy Entertainment shares more details on these new titles."
  ],
  "headers": {
    "8": "A sequel in the works"
  },
  "links": {
    "Control": "https://www.techradar.com/reviews/control-review",
    "post": "https://www.remedygames.com/the-future-of-control-remedy-505-games/"
  }
}