{
  "source": "https://www.techradar.com/news/spending-on-digital-verification-systems-to-hit-new-high",
  "title": "Spending on digital verification systems to hit new high",
  "category": "computing",
  "updated": "2021-06-21T15:41:15Z",
  "author": "mayank-sharma",
  "summary": "Digital verification will register a 77% growth in the next five years",
  "article": [
    "Businesses are set to spend over $16 billion on digital identity verification technology by 2026, as they transition to a digital onboarding process to accommodate the swelling number of remote employees working from home, according to new research.",
    "The estimate from Juniper Research is a steep rise from the $9.6 billion businesses are expected to spend this year, and represents a 77% increase.",
    "In terms of absolute numbers, the research also suggests that the volume of identity verification checks globally will exceed 92 billion in 2026, which is slightly more than double of the 45 billion estimated in 2021.",
    "A majority (62%) of this growth will be fueled by banking and financial services for whom identity verification is a core aspect of the business.",
    "“Digital-only banks have shown that fully digital Know Your Customer can work and is very engaging for the user, therefore the pressure is on for traditional banks to deploy new identity verification services. Managing this transition quickly, and getting the user convenience/security balance right will determine overall success,” observed Research co-author Vladimir Surovkin.",
    "Interestingly, while banking and financial services sectors will be the major consumers of the remote identity verification services, Juniper believes the process will break new ground and find an uptake in adoption in areas such as remote onboarding for mobile network operators or for digital gambling, over the next five years.",
    "The research also observed that although the Covid-19 pandemic did accelerate digital transformation for several businesses around the world, quite a few industries had already started pushing for remote identity verification, which Juniper argues is a reflection of the “shifting customer appetites and opportunities for operational efficiency.”",
    "Reporting on the research, VentureBeat points to the fact that the rise in work from home has also seen a spurt in cases of identity theft and fraud with the US alone reporting a loss of $56 billion to identity fraud.",
    "In light of these revelations, the report suggests that while ensuring a seamless digital onboarding experience is a must-have ability in the post-pandemic environment, it brings with it issues of usability and security that businesses must address with the help of technology such as Artificial Intelligence “for ongoing, behavioral analytics.”"
  ],
  "headers": {
    "5": "All aboard"
  },
  "links": {
    "digital identity": "https://www.techradar.com/best/best-identity-management-software",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "new research": "https://www.juniperresearch.com/pressreleases/digital-identity-verification-spend-to-exceed",
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "VentureBeat points": "https://venturebeat.com/2021/06/21/digital-identity-verification-spend-to-grow-77-to-16-7b-by-2026/",
    "$56 billion to identity fraud": "https://www.cnbc.com/2021/03/23/consumers-lost-56-billion-dollars-to-identity-fraud-last-year.html"
  }
}