{
  "source": "https://www.techradar.com/news/facebook-makes-messenger-api-for-instagram-open-to-all",
  "title": "Facebook makes Messenger API for Instagram open to all",
  "category": "computing",
  "updated": "2021-06-03T10:17:25Z",
  "author": "rob-clymo",
  "summary": "Move is part of a concerted effort to improve e-commerce fortunes",
  "article": [
    "Facebook will give business users and developers more options to improve their e-commerce fortunes with new tools for both Instagram and WhatsApp.",
    "The news was unveiled at Facebook's virtual F8 Refresh developers conference, and central to the improvements will be the ability for developers to build better ways for messaging customers on Instagram.",
    "According to Facebook, 90% of Instagram users now follow at least one business and WhatsApp is also used by many consumers who want to message companies with enquiries. The new announcements should mean it will be much easier for businesses to build in better messaging options, allowing companies to keep customers updated on things like stock levels and special offers.",
    "The company plans to offer a phased rollout, with Phase 1 involving Instagram accounts with followers of over 10,000, but under 100,000, being offered the chance to connect to the API. Phase 2 should happen by July and will see the same offered to accounts with followers between 1,000 and 100,000. All remaining accounts should be able to use the API by Q3.",
    "The idea has been running as a closed beta since last October, with 30 developers and 700 brands taking part in trials. Following the announcement access to the API will be open to any brand or organization making use of Instagram that wants to interact more effectively with customers. The benefit of businesses being able to use the Messenger API is that it can be integrated into any third-party application, thereby making it easier for companies to adapt their existing customer relationship systems.",
    "Facebook is making a more concerted effort to expand its e-commerce features along with developing augmented and virtual reality tools in a bid to help creators enjoy a more lucrative return from its platforms. However, the expansion has been hampered following an update to the WhatsApp privacy policy, which many users have claimed has been confusing and caused concern that personal data would end up being shared with Facebook.",
    "Indeed, concerns over data privacy could be the thing to slow down progress, despite Facebook’s plans to also launch new tools for researchers. The social media giant claims extra functionality will soon allow researchers to analyze data collected from its public pages, as well as from information gathered via groups and events. The new tools should be available towards to end of this year, although many users remain nervous about data privacy following the Cambridge Analytica scandal."
  ],
  "headers": {
    "4": "Messenger API"
  },
  "links": {
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Instagram": "https://www.techradar.com/how-to/how-to-use-instagram-from-first-snap-to-influencer-status/news/instagram-messages-are-coming-to-messenger-api-and-businesses-should-be-jazzed",
    "WhatsApp": "https://www.techradar.com/news/whatsapp-wants-to-make-business-messaging-faster-and-easier",
    "messaging options": "https://www.techradar.com/best/whatsapp-alternatives",
    "Messenger API": "https://www.techradar.com/news/instagram-messages-are-coming-to-messenger-api-and-businesses-should-be-jazzed",
    "customer relationship systems": "https://www.techradar.com/best/the-best-crm-software",
    "e-commerce features": "https://www.techradar.com/news/best-ecommerce-hosting",
    "virtual reality": "https://www.techradar.com/news/best-business-vr-headset",
    "Cambridge Analytica": "https://www.techradar.com/news/us-uk-investigating-facebooks-role-in-cambridge-analytica-data-breach"
  }
}