{
  "source": "https://www.techradar.com/news/the-sleek-vision-fk-concept-only-emits-water-as-hyundai-bets-big-on-hydrogen",
  "title": "The sleek Vision FK concept only emits water, as Hyundai bets big on hydrogen",
  "category": "car-tech",
  "updated": "2021-09-07T16:47:32Z",
  "author": "chris-teague",
  "summary": "Big plans within the next 10 years",
  "article": [
    "Hyundai has announced its \"Hydrogen Vision 2040,\" which aims to bring hydrogen fuel cell technology to the mainstream by 2040.",
    "To help illustrate that goal, the automaker showed off a new hydrogen-powered performance car called Vision FK.",
    "While most automakers, including Hyundai, are developing new electric vehicles, the Korean automaker is also forging ahead with hydrogen fuel cell technology.",
    "At the Hydrogen Wave online forum, Hyundai laid out its vision to \"popularize hydrogen by 2040 through the introduction of new technologies and mobility solutions in transportation and other industrial sectors.\"",
    "What does that mean? First, the automaker will shift all of its commercial vehicles to either hydrogen fuel cell tech or battery-electric technology by 2028. Beyond that, it plans to develop a new fuel cell vehicle at a price point comparable to that of an EV by 2030.",
    "The Vision FK is a high-performance car with a total output of around 670 horsepower. Hyundai says that the vehicle can reach a 0-62 mph time of fewer than four seconds.",
    "Perhaps the most exciting part of the car is its power source. While the hydrogen fuel cell is what makes headlines, the car also features a plug-in system and rear-wheel drive. Together, the system delivers a range of over 372 miles.",
    "Hydrogen fuel cell cars are an interesting bunch, but they are largely unknown to many car buyers outside of a few limited geographic areas.",
    "Unlike electric cars, which sometimes require lengthy charging sessions, refueling hydrogen fuel cell cars is like refueling a traditional gas vehicle.",
    "Without getting too technical, the hydrogen is combined with oxygen from the air to make water. During the process, electricity is generated and used to power an electric motor. Instead of emissions from a gas engine, the only byproduct is water."
  ],
  "headers": {
    "5": "Vision FK is a high-performance car"
  },
  "links": {}
}