{
  "source": "https://www.techradar.com/news/technologies-enabling-a-more-sustainable-food-supply-chain",
  "title": "Technologies enabling a more sustainable food supply chain",
  "category": "computing",
  "updated": "2021-04-14T11:05:29Z",
  "author": "luq-niazi",
  "summary": "Technologies enabling a sustainable food supply chain",
  "article": [
    "The world produces enough food to support an estimated 10 billion people, but each year, roughly one third of it is lost to supply chain inefficiency. This staggering amount of waste - 1.3 billion tons annually - not only fuels a global crisis of food insecurity, but also exacerbates the adverse environmental impacts of industrial agriculture.",
    "To create a more sustainable food supply chain, the industry is increasingly turning to technologies like blockchain, artificial intelligence and hybrid cloud as a means to mitigate food waste, while offsetting the CO2 emissions generated by farming. Some leading companies are starting to experiment further with the possibilities arising from quantum computing.",
    "Here are four ways new technology is enabling a more sustainable food supply chain.",
    "One of the biggest contributing factors to food waste is the overall lack of visibility and traceability across the supply chain. As food travels from farm to grocery store shelf, it passes through a dizzying number of intermediaries – packagers, wholesalers, distributors – each of whom has their own system and processes for tracking the product journey. These systems are rarely interoperable and are often analogue, making it virtually impossible to see what’s happening in real-time. This, in turn, makes it extremely difficult for retailers to accurately forecast inventory needs, leading to product surpluses and, eventually, waste.",
    "Blockchain provides a unified system for monitoring the path of food from source to endpoint, allowing producers and companies to upload their product data to a single trusted source of data and insight. This not only vastly mitigates inventory surpluses, but also enables stakeholders to perform more targeted recalls in the event of a foodborne illness outbreak, eliminating the need to destroy unaffected meat and produce. The same data can also be used to track sustainability parameters such as CO2.",
    "In support of this, findings from a recent IBM study commissioned by Morning Consult on Food Sustainability within Europe and the UK, reveal 78% of respondents in the UK said they would find it valuable to have food be traceable on the blockchain, allowing public health authorities to identify the source of foodborne illnesses, recognizing if food may be impacted by recall. Ultimately, as blockchain continues to move from concept to reality and exposure moves beyond enterprise practices, we’ll continue to see increased uses of blockchain across our food supply chain, improving traceability and giving consumers reliable information on food provenance, nutrition and shelf life.",
    "Agriculture accounts for a staggering 70 percent of the world’s water usage, but how efficiently is that water utilized? Through AI-enabled analytics and sensor technology, farmers are able to analyze in real-time the chemical composition of their water and soil. Predictive modelling can then mine that data for actionable insights, suggesting more effective irrigation, fertilization and harvesting strategies.",
    "In addition to supporting water conservation, AI also enables better resource planning throughout the supply chain by delivering more accurate and up-to-date crop forecasts. AI-enabled weather predictions also help farmers develop hyperlocal strategies for boosting crop yields.",
    "Whether it’s blockchain-enabled traceability, AI-powered analytics or any number of other cutting-edge capabilities, cloud is the bedrock technology that makes it all possible. Every day, the food industry generates vast quantities of data across a disparate footprint of incompatible point systems, legacy platforms and analogue processes. Cloud – hybrid cloud in particular – is the nexus that bridges these disconnected siloes and allows organizations not only to achieve a more holistic view of their business, but to infuse every process with intelligence and automation. It allows stakeholders to innovate, co-create and share information, regardless of where the data resides.",
    "In scaling food production to meet the needs of a rapidly growing population, one of the greatest bottlenecks is our reliance on nitrogen-based fertilizer. While nitrogen is among the most abundant elements found on Earth, plants can only process it in its “fixed” form. Nature achieves this through a specific type of bacteria found in the roots of certain plants. But humans don’t currently have a method for replicating this catalytic process at scale in the production of commercial fertilizer.",
    "Engineers have been tackling this problem for the better part of a half-century, but quantum computing now offers a fresh approach. In the next few years, researchers hope to use quantum computers to simulate numerous catalytic processes, using AI-enabled predictive modelling to validate their effectiveness.",
    "In the coming years, the need for a more sustainable food chain will only grow more acute. The UN estimates that by 2030, the global population will reach 8.5 billion people, driven primarily by developing countries. To keep pace with the burgeoning needs of a rapidly growing world, the industry must quickly embrace technologies like AI, blockchain, quantum computing and cloud and making it accessible to all types for farmers from professional to small holders."
  ],
  "headers": {
    "3": "Blockchain for food traceability",
    "6": "Artificial Intelligence for resource planning and crop yield optimization",
    "8": "Cloud for value chain digitization",
    "9": "Quantum computing for sustainable fertilizer"
  },
  "links": {
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "hybrid cloud": "https://www.techradar.com/news/what-is-hybrid-cloud",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "modelling": "https://www.techradar.com/best/best-3d-modelling-software",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}