{
  "source": "https://www.techradar.com/news/can-this-gaming-phones-cooler-help-make-ice-cream-i-tried-it-for-science",
  "title": "Can this gaming phone's cooler help make ice cream? I tried it, for science",
  "category": "phones",
  "updated": "2021-04-10T16:00:03Z",
  "author": "tom-bedford",
  "summary": "Maybe. But there are other complications",
  "article": [
    "If you buy a gaming smartphone, you might find yourself buying a clip-on fan for it too - these keep the handset cool through long gaming sessions, and stop it overheating.",
    "At TechRadar my job is to, as our About Us page attests, 'review [tech] thoroughly and carefully' but since gaming-phone-coolers have a very simple job, they're naturally all fit for task.",
    "So to see how good they really are, I had to devise a totally new test for them... one that really puts them through their paces.",
    "What's the most important thing that requires cold temperatures? The answer is, of course, to make ice cream. So to test out a few of these gadgets I've accumulated over time, I tried using these game phone coolers to make my own ice cream.",
    "Pictured are the coolers for the Xiaomi Black Shark 3 and Nubia Red Magic 6.",
    "I'll speed through the ice-cream-making part, because this is a tech website and not an ice cream site (sadly). I used this simple ice cream recipe from Tasty, though while that uses Oreos, we decided to instead use Lotus Biscoff biscuits. I should point out I've made ice cream before, but usually using with more complicated recipes than this.",
    "It's a pretty easy recipe, with just three ingredients, and all that was required was whisking two of the ingredients together, before adding the crushed biscuits. Apparently you need to use a stand mixer or electric whisk for this; I wish I'd read the recipe before starting, because I only had a normal whisk, so lots of frantic arm exercises ensued.",
    "It also would have been smart to read the comments on the recipe first; some recommend using half the quantity of condensed milk, others suggest whisking the cream on its own before adding the other ingredients, which seemingly would have saved me loads of work. Oh well.",
    "Eventually, the ice cream was finished (well, I gave up whisking and hoped enough was done). I was ready for the cooling process, so I plugged in the gaming phone coolers and dolloped the ice cream into the chosen box.",
    "I used two different coolers, that work in different ways, though both have similar designs. Such coolers have extendable 'arms' that hold them to the phone, so they stay clipped on while you're gaming - one of the gadgets only turned on when the arms were extended, and the other had a switch.",
    "If you haven't used a gaming phone cooler before, you should know they're marvelously cold - on one of them, I saw condensation form after just seconds of it being turned on. I wasn't just exploring this subject as a thinly-veiled excuse to make and eat ice cream (who'd do such a thing?!), it seemed a genuine possibility that these coolers would be efficient enough to cool down the ingredients.",
    "The recipe told me I needed to freeze the tub of ice cream for at least four hours before it was edible, but knowing that these coolers wouldn't provide the surround-cooling of an actual freezer, I decided at least six hours would be required. So I created a stand for the tub to the coolers had space to fully attach, and went to clip the things onto the box...",
    "... only to find they wouldn't fit. The box I'd chosen was too tall, and the gaming phone arms wouldn't extend far enough to clip on. So I had to evacuate the ice cream from that tub, and find one that was short enough to work.",
    "Thankfully, as a savvy bulk-cooker I have plenty of Tupperware boxes, and soon enough the ice cream was once again ready. So I closed the lid, put the new tub on the stand, prepared the coolers, and again tried to attach them to the box...",
    "... only to find they wouldn't fit, again. But this time for worse reasons. You see, the lid had a lip, so it stuck out over the rest of the box a little way, and as a result I couldn't clip on the cooler so it was tight against the box. There were a few millimetres of empty space, and as a result the cooler was just having no effect on the tub.",
    "I checked the other Tupperware boxes I own - they were all the same, with lids that stuck out to greater or lesser degrees. This plan wouldn't work.",
    "I tried attaching the gaming phone fans at various angles and in different ways, but it was impossible to get a stable hold that covered any meaningful amount of surface area, but it was a total failure - in the end I gave up and put the thing in my own freezer.",
    "I'm saddened that I didn't manage to test out my hypothesis of gaming phone coolers being cold enough to freeze quantities of ice cream, but at least it's not because of the thermal properties of the tech.",
    "It seems that these coolers are designed exclusively to work with smartphones and won't work for other gadgets that can get warm: tablets, PCs, cameras or ice cream. That's, perhaps, what freezers are for (this is a joke, please don't put your technology in the freezer).",
    "At least my experiment offered me loads of tasty ice cream as reward."
  ],
  "headers": {
    "5": "Making the ice cream",
    "9": "Keeping cool and creamy",
    "17": "Lessons learned"
  },
  "links": {
    "gaming smartphone": "https://www.techradar.com/news/best-phone-for-gaming",
    "About Us page": "https://www.techradar.com/news/about-us",
    "Xiaomi Black Shark 3": "https://www.techradar.com/reviews/xiaomi-black-shark-3-review",
    "Nubia Red Magic 6": "https://www.techradar.com/reviews/nubia-red-magic-6",
    "Tasty": "https://tasty.co/recipe/cookies-n-cream-ice-cream"
  }
}