{
  "source": "https://www.techradar.com/news/new-windows-10-update-breaks-one-of-its-most-useful-features-for-some-users-whats-going-on",
  "title": "New Windows 10 update breaks one of its most useful features for some users – what’s going on?",
  "category": "computing",
  "updated": "2021-12-05T22:14:32Z",
  "author": "matt-hanson",
  "summary": "Another Windows 10 fail has arrived",
  "article": [
    "A new Windows 10 update appears to be breaking a major feature for some users, with the handy Alt-Tab function seemingly not working.",
    "As Windows Latest reports, some people who have downloaded the July 2021 preview (KB5004296) and the August 2021 update (KB5005033) are unable to use the Alt-Tab feature properly.",
    "When using Windows 10, if you hold down Alt, then press the Tab key on your keyboard, you can quickly scroll through open apps and windows. When you stop pressing the Tab key, the highlighted window or app you stop at will be selected.",
    "It’s a quick and easy way to jump between apps, and it can also prove extremely useful if you’re using a full-screen application, such as a game, and you need to jump to another app. It can also be helpful if the app you’re using becomes unresponsive, as using Alt-Tab will get you out of the app that’s crashed, allowing you to save your work and troubleshoot any issues.",
    "However, there are reports that trying to use Alt-Tab between full-screen apps no longer works, with users either getting a blank screen, or just being dumped in the Windows 10 desktop. This is an incredibly useful feature, so for it to break is rather frustrating, to say the least.",
    "Thankfully, there are ways to fix the problem. Some users are reporting that uninstalling the faulty update fixes the issues. This is a rather severe way of fixing the problem, as it means you’re missing out on any other fixes and additional features that the update provides. We always recommend keeping Windows 10 updated, so uninstalling updates should only be done as a last resort.",
    "If you want to do this, follow the steps in our how to uninstall a Windows 10 update guide.",
    "Another way to fix it is to disable the ‘News and Interests’ feed, which is a relatively new addition to Windows 10, and appears to be causing the issue. To do this, right-click on the Windows 10 taskbar and select ‘Settings’, then go to the ‘News and interests’ section and click on ‘Turn off’. This will disable the News and Interests widget in the taskbar, but will make Alt-Tab work again.",
    "This is yet another update for Windows 10 that appears to cause problems for other parts of the operating system, while adding new features. For a few years now, Windows 10 updates that break more than they fix have been frustratingly common, and while not every user experiences these issues, they are widespread enough to cause many people to feel apprehensive about updating Windows 10, in case their working PC suddenly encounters issues.",
    "This isn’t a good look for Microsoft, and while a lot of its energy is being spent on refining Windows 11 before its launch later this year, it really needs to make sure that Windows 10 continues to be fixed – and it needs to make sure that future Windows 10 updates don’t keep breaking things.",
    "This is because users need to have confidence that keeping Windows 10 updated won’t break things. If people stop updating their version of Windows 10, it means they could miss out on important security updates – and that’s not a situation we want to be in.",
    "And, if Windows 10 is still having issues, people will be less likely to trust Windows 11 – after all, if Microsoft can’t fix its six-year-old operating system, what kind of state will its brand-new OS be in?",
    "It’s also interesting that the News and Interests feature seems to be an issue here. This is a new addition that no one really asked for, and many people are getting annoyed by. It feels like a way for Microsoft to push its other services on users – by forcing you to open up news stories in its Edge browser, rather than your default browser – while also collecting user information. This is annoying enough, but if this move is now coming at the expense of genuinely useful features, Microsoft could soon feel the wrath of users – so it’ll need to tread carefully.",
    "You might also want to check out how to fix a stuck Windows update."
  ],
  "headers": {
    "5": "How to fix the problem",
    "8": "Analysis: Microsoft still needs to fix Windows 10"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows Latest reports": "https://www.windowslatest.com/2021/08/17/windows-10-kb5005033-is-causing-new-issues-for-some-users/",
    "how to uninstall a Windows 10 update": "https://www.techradar.com/how-to/how-to-uninstall-a-windows-10-update",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "fix a stuck Windows update": "https://www.techradar.com/how-to/software/operating-systems/how-to-fix-a-stuck-windows-update-1326307"
  }
}