{
  "source": "https://www.techradar.com/news/windows-11-could-freshen-up-the-most-tired-bits-of-windows-10s-interface",
  "title": "Windows 11 could freshen up the most tired bits of Windows 10’s interface",
  "category": "computing",
  "updated": "2021-06-19T11:05:57Z",
  "author": "darren-allan",
  "summary": "Control Panel, Device Manager and other dusty old corners of the UI",
  "article": [
    "Windows 11 is purportedly inbound with a major redesign for later in 2021 that we’ve already seen courtesy of a leaked build, and that overhaul will apparently reach out to touch even the oldest legacy parts of the operating system’s interface.",
    "As Windows Latest reports, the old-style Control Panel, which is still present in the OS (alongside the new Settings panel, as it is in Windows 10) now has the rounded corners which will apparently be a more or less all-pervading theme of Windows 11. Some of the icons within the Control Panel also seem to have been revamped (and perhaps more are due a fresh lick of paint, as remember the leaked build is still an early working version of Windows 11 – well, theoretically).",
    "Those rounded corners are also coming to the disk management tool, and other dusty old corners of Windows like the Device Manager. Even the ODBC Data Source Administrator, which as Windows Latest notes is one of the oldest legacy parts of Windows, is getting its sharp edges replaced with rounded corners on its panel.",
    "The changes for these long-standing legacy portions of Windows are not huge, then, but they really are necessary to maintain the consistency across Microsoft’s operating system as much as possible, and avoid any jarring experiences when popping into the windows which are less traveled.",
    "There’s a minimal amount of tweaking evident here, though, mainly revolving around either the rounded corners or fine-tuned icons, but that makes sense in that hopefully, one bright and fine day, Microsoft will be able to ditch elements like the old Control Panel entirely.",
    "Having the Control Panel and the Settings app duplicating a lot of functionality only serves to confuse folks, particularly those new to Windows – and remember, we’ve already seen signs that Microsoft’s plans are to ditch the Control Panel entirely at some point down the road."
  ],
  "headers": {
    "3": "Tweaking and tuning"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "major redesign": "https://www.techradar.com/news/windows-10-could-be-getting-a-modern-redesign",
    "Windows Latest": "https://www.windowslatest.com/2021/06/19/windows-11-old-school-windows-dialogs-are-also-getting-ui-changes/",
    "Settings panel": "https://www.techradar.com/news/windows-10-update-will-give-the-settings-panel-a-much-needed-overhaul",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "leaked build": "https://www.techradar.com/news/windows-11-is-real-and-microsoft-hasnt-even-announced-it-yet",
    "signs that Microsoft’s plans": "https://www.techradar.com/news/microsoft-begins-killing-off-the-control-panel-in-windows-10"
  }
}