{
  "source": "https://www.techradar.com/news/the-oculus-rift-s-is-dead-long-live-the-oculus-quest-2",
  "title": "The Oculus Rift S is dead, long live the Oculus Quest 2",
  "category": "gaming",
  "updated": "2021-07-06T10:00:47Z",
  "author": "axel-metz",
  "summary": "Rest in peace, old friend",
  "article": [
    "The time has come to bid farewell to the Oculus Rift S – it’s now officially off the shelves, having been discontinued earlier in the year.",
    "A statement posted to the Oculus website reads “Oculus Rift is no longer available,” marking the end of a two-year lifespan for the VR headset, which launched in May 2019 as the successor to the original Oculus Rift model.",
    "The Rift S is survived by the Oculus Quest 2, which is now the brand’s flagship entry-level VR headset and, for our money, the best VR headset for most gamers.",
    "This isn’t surprising news, of course. Facebook, parent company to Oculus, revealed earlier this year that it wouldn’t be shipping any more Rift S units to retailers once they had sold out, following the launch of the Quest 2 in October 2019. Facebook will also now focus on standalone VR headsets in the future, scrapping development of PC-only systems like the Rift S.",
    "What’s more, the company is retiring support for Oculus accounts in 2023, meaning users will be forced to connect a Facebook account to their chosen Oculus device in order to access the system.",
    "That news won’t go down well with players unwilling to become subject to Facebook’s data monitoring practices, though, or indeed those unsettled by the company’s recent ad testing on its Quest systems.",
    "Facebook says ads will allow for \"new ways for developers to generate revenue\" with the aim of \"creating a self-sustaining platform,” though the decision to impose ads in the virtual world of a video game is one sure to frustrate VR enthusiasts – and gamers in general, for that matter.",
    "It’s rare that a major tech company axes a product without announcing a direct successor, but that’s now the case with the Oculus Rift S. It’s clear Facebook intends to push full steam ahead with the Quest 2, though, so it’s not as if VR fans have been left wanting for a capable mixed reality headset.",
    "But what of the Oculus Quest 3? Well, in a recent Twitter Q&A, vice president of Facebook Reality Labs, Andrew Bosworth, said that right now, a Quest 3 headset is still “a little way off.”",
    "A new Oculus-related project is currently in development, though, having been confirmed by Facebook CEO Mark Zuckerberg in a January earnings call for the company. Details of the device haven’t yet been officially confirmed as plans for a third generation Quest device, but Zuckerberg told investors, “We’re continuing to work on new hardware [which] will fit the same platform, so the content that works on Quest 2 should be forward-compatible.”",
    "This could refer to an Oculus Quest Pro, also rumored to arrive in the coming years, but stay tuned to our hub for all the latest news and rumors surrounding the company’s next VR project.",
    "Via Rockpapershotgun"
  ],
  "headers": {
    "7": "What comes next?"
  },
  "links": {
    "Oculus Rift S": "https://www.techradar.com/reviews/oculus-rift-s-review",
    "Oculus website": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-7554675671838494000&murl=https%3A%2F%2Fwww.oculus.com%2Frift-s%2F",
    "Oculus Rift": "https://www.techradar.com/reviews/gaming/gaming-accessories/oculus-rift-1123963/review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "best VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "forced to connect a Facebook account": "https://www.techradar.com/news/oculus-quest-vr-headsets-are-being-held-to-ransom-by-facebook-and-your-vr-games-are-at-risk",
    "recent ad testing": "https://www.techradar.com/news/oculus-quest-vr-headsets-are-now-blighted-by-facebook-ads",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "confirmed by Facebook CEO Mark Zuckerberg": "https://www.techradar.com/news/oculus-quest-2-vr-headset-already-has-a-successor-on-the-way-says-zuckerberg",
    "hub": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "Rockpapershotgun": "https://www.rockpapershotgun.com/the-oculus-rift-s-is-no-longer-available"
  }
}