{
  "source": "https://www.techradar.com/news/ipad-deals-at-amazon-this-weekend-feature-price-cuts-and-coupons-for-the-pro-and-air-4",
  "title": "iPad deals at Amazon this weekend feature price cuts and coupons for the Pro and Air 4",
  "category": "tablets",
  "updated": "2021-01-16T17:24:14Z",
  "author": "alex-whitelock",
  "summary": "Amazon once again featuring great iPad deals",
  "article": [
    "If you're shopping for iPad deals this weekend, Amazon has some superb options right now on both the new iPad Pros and the iPad Air 4 that could potentially save you a good chunk of change.",
    "First up is a handy little coupon over at Amazon that you may have previously missed on the 2020 11-inch iPad Pro. Retailing for $789 at first glance, you can in fact get this superb premium tablet for just $759.05 this weekend with an auto-applying coupon at checkout. This isn't the cheapest price we've seen on this iPad Pro (that record is around $699 from Black Friday), but considering the last significant price cut was back in December, this is quite a good option all around.",
    "What is at its lowest price, however, is the new iPad Air 4, which can be picked up for just $559 (was $599) right now at Amazon. This is also a great discount because it's available on the rarer Silver and Space Gray colors - popular choices which often don't see discounts like on the others. Again, this is a superb option if you're looking for a tablet that has a stunning screen, premium build, and plenty of power on tap under the hood.",
    "We've also included Amazon's sale on the iPad Pro 12.9, which can be picked up for $849 (was $899) this weekend. This one's $50 more than the cheapest price we've seen on this model, so it's probably the weakest of the three featured iPad deals today. However, it's still a good price for such a powerful machine and worthy of consideration if you're weighing up how much screen real estate you'd like.",
    "Not in the US? See the best iPad deals in your region just below.",
    "Want to shop around? See our main best iPad deals article to see the best prices across the entire range. Alternatively, head over to the best Samsung tablet deals to see some compelling Android alternatives."
  ],
  "headers": {
    "5": "iPad deals at Amazon this weekend"
  },
  "links": {
    "for just $759.05": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-iPad-11-inch-Wi-Fi-128GB%2Fdp%2FB08637NV8M%2F%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8294171325213311000-20",
    "for just $559 (was $599)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J66ZMY7%2Fref%3Dfs_a_ipadt2_us2%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1206636178731753700-20",
    "for $849 (was $899)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08639YQTV%2Fref%3Dtwister_B0863WSHGD%3F_encoding%3DUTF8%26psc%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9210644447022276000-20",
    "best iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "best Samsung tablet deals": "https://www.techradar.com/news/mobile-computing/tablets/samsung-galaxy-tab-deals-1295910"
  }
}