{
  "source": "https://www.techradar.com/news/over-the-horizon-10-years-of-samsung-ringtones-leading-to-the-galaxy-s21",
  "title": "Over The Horizon: 10 years of Samsung ringtones leading to the Galaxy S21",
  "category": "phones",
  "updated": "2021-01-10T07:00:32Z",
  "author": "tom-bedford",
  "summary": "The Samsung Galaxy S21 has a new re-imagining of the song",
  "article": [
    "When you boot up a new Samsung phone and head over to the music library, you’ll find there’s a song already there - it’s called Over The Horizon, and it’s the official ‘anthem’ or jingle for the Galaxy S phones. If you’ve ever owned a Galaxy phone, you’ll probably recognize the tune’s central motif.",
    "Over The Horizon debuted with the Samsung Galaxy S2 in 2011, and the January 14 launch date of the Samsung Galaxy S21 will bring with it the 10th version, or the 9th re-imagining, of that tune.",
    "Each iteration of Over The Horizon is different, in terms of instrumentation, tone and length, but they’re all written around a six-note motif, which is woven into each version of the jingle in different ways.",
    "So ahead of the Samsung Galaxy S21 launch, let’s go on a little history lesson, and listen to 10 years of catchy tunes.",
    "The original Over The Horizon for the Samsung Galaxy S2 defines the first few versions of it - it’s upbeat, poppy, uses a busy instrumentation (with real and digital instruments), and sounds like it would fit right in to The Sims soundtrack.",
    "The theme for this original version was ‘Beyond Smart Experience’ and it’s as quaintly optimistic as we all were back then. The motif is repeated again and again, even played in a little guitar solo part-way through.",
    "With a jolly tone and fast pace, this version of the theme was the perfect alarm song, as it kicked your day off to a great start - although perhaps it sounds a lot better through your computer or phone speakers now compared to those on the Galaxy S2.",
    "The first reimagining of Over The Horizon starts quite soft, with more acoustic instruments like strings and pitched percussion carrying it for the first minute, until a wider string section and piano jump in later.",
    "Compared to the other first few years of Over The Horizon, it’s a bit of an outlier in terms of instrumentation and tone, but that’s the point of the whole ‘reinterpretation’ exercise, after all.",
    "The theme for the song was ‘Designed by Humans’ - that’s not to say robots or aliens wrote the other versions, but Samsung’s entire design philosophy for the Galaxy S3 was to make it seem more man-made and artisanal. The lack of obviously-digital instruments attests to this.",
    "The third version of Over The Horizon, debuted in 2013 with the Samsung Galaxy S4 and used again with the Galaxy S5 the year after, bears more than a passing resemblance to the original version.",
    "The song, written to the vague theme ‘Life Companion’, starts slow with synths and pianos, before slowly building up to a crescendo with busy instrumentation. There’s what sounds like a guitar, strings, drums, piano, and more. It’s also the most distinctly-structured piece, moving between themes and variations of the original motif.",
    "It’s not hard to imagine this version of the song accompanying a climactic moment in a film, but the ‘Sims soundtrack’ vibe is here too. This piece would definitely work in the trailer though.",
    "Based on numerous YouTube comments under all the Over The Horizon videos (admittedly, not necessarily a reliable source, but the best we can do), the Samsung Galaxy S6 version of the song is the most popular.",
    "The piece starts slow, with a soft harp rendition of the motif, and it takes a lot longer to build up than the previous versions, only bringing percussion and a full orchestra in after two minutes. It’s certainly not as obviously upbeat as the 2013 version, harkening more to the 2012 song.",
    "This is the last piece in what we’re deeming the ‘Sims era', signified by jolly pieces that could fit right into the soundtrack of simulator video games (and other things, obviously). Things get weird from here.",
    "The 2016 Over The Horizon starts off normal enough, with the motif played immediately, but then we get a quick drum break, a jazzy brass harmony, and the first human vocals of the songs, all in the first 10 seconds.",
    "This rendition of the song was written and performed by Dirty Loops, a jazz-funk group from Sweden, and marks a dramatic departure from the previous songs.",
    "It’s cool to see the original motif presented in a jazzy way, and if Samsung was looking to go in a new direction with the Samsung Galaxy S7’s version of the piece, this is one of the best iterations we could have expected.",
    "Over The Horizon in 2017 was written by artist Jacob Collier, and he seems to be going in a similar direction to Dirty Loops - this is another jazz-funk take on the piece, although it certainly leans more on the latter of those two words, with some slap bass thrown in for good measure.",
    "Like the original version of the song, Collier’s leans heavily on the motif, singing it repeatedly throughout the piece. There’s also an ever-changing instrument lineup with keyboards, guitars, layered vocals, a mouth keyboard and more joining and leaving the piece at various intervals.",
    "Samsung’s ‘jazz-funk’ phase lasted only two years, and it was a shame to see it go, because eclectic pieces like these made for great alarms or ringtones.",
    "Now we enter Samsung’s ‘natural’ phase, of pieces inspired by nature. This first one takes the listener on an ‘atmospheric journey of discovery’, according to the video description.",
    "The song begins with a piano playing the motif, and variations on it, before an orchestra joins in halfway through the piece. It’s best to listen along with the video embedded above, as the music suits the visuals.",
    "The Samsung Galaxy S9 version of Over The Horizon marked another dramatic shift in the direction of the songs, and one could argue the new pieces were less useful as alarms and better suited for ringtones, due to their soft opening. Still, if you like being woken up lightly instead of by a full digital orchestra, this version could be better for you.",
    "The Samsung Galaxy S10’s ringtone was inspired by, as the accompanying video makes patently clear, water and oceans. Great for people who like natural-sounding music, bad for people with thalassophobia (fear of the sea).",
    "The piece uses strings, piano and woodwind to create something of a soundscape, though one that has the motif popping its head up now and then in various ways. Towards the end, the piece harkens back to the first few versions of Over The Horizon, with a percussion section and piano leading to an increased tempo.",
    "Last year’s reimagining of Over The Horizon is again nature-themed, but it takes us to dry land (well, land, though there’s lots of water still). The first minute or so of the piece is entirely natural sounds, like running water and birdsong, so it’s perfect for people who like a soft wake-up.",
    "The piece overall resembles ambient music more than it does a ringtone, with the tempo and full instrumentation only really picking up in the last minute of the piece. There are some strings and a piano, but it feels like the nature-inspired sounds at the beginning are the real star of the piece.",
    "We don’t hear the original motif too much in this interpretation of Over The Horizon, as it only shows its head now and then. It would be rather hard to train birds to sing the thing though, or for water to run in that particular rhythm, so we’re not surprised.",
    "The newest version of Over The Horizon technically hasn’t been unveiled yet at the time of writing - we’re waiting on the Samsung Galaxy S21 launch for that - but it has been leaked. We don’t know if this is the full song, or just one part of it, but it gives us a glimpse at the direction Samsung is going in.",
    "Well, Samsung isn’t ‘going in a direction’ as much as it’s ‘staying in the same direction’, because this is another soft and gentle version of the piece.",
    "The reason we’re not sure if this is the full version of Over The Horizon, or just one part of it, is because there’s only one instrument - a piano. It’s rather like the 2018 version in that sense, but without the orchestra appearing part-way through.",
    "The original motif is barely present in the song, appearing more in harmonies and variations on the theme, than as the theme itself. That would make most sense if the piano was accompanied by other instruments which took the melody, though perhaps Samsung just wanted to relax on the iconic six-note soundbite for a year."
  ],
  "headers": {
    "4": "Over The Horizon 2011 (Samsung Galaxy S2)",
    "7": "Over The Horizon 2012 (Samsung Galaxy S3)",
    "10": "Over The Horizon 2013 and 2014 (Samsung Galaxy S4 and S5)",
    "13": "Over The Horizon 2015 (Samsung Galaxy S6)",
    "16": "Over The Horizon 2016 (Samsung Galaxy S7)",
    "19": "Over The Horizon 2017 (Samsung Galaxy S8)",
    "22": "Over The Horizon 2018 (Samsung Galaxy S9)",
    "25": "Over The Horizon 2019 (Samsung Galaxy S10)",
    "27": "Over The Horizon 2020 (Samsung Galaxy S20)",
    "30": "Over The Horizon 2021 (Samsung Galaxy S21)"
  },
  "links": {
    "new Samsung phone": "https://www.techradar.com/news/best-samsung-phones",
    "Samsung Galaxy S2": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s2-930907/review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S3": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s3-1078667/review",
    "Samsung Galaxy S4": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s4-1137602/review",
    "Galaxy S5": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s5-1226990/review",
    "Samsung Galaxy S6": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s6-1285636/review",
    "Samsung Galaxy S7": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-1315188/review",
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}