{
  "source": "https://www.techradar.com/news/starfields-newest-video-introduces-the-games-setting-and-its-backstory",
  "title": "Starfield's newest video introduces the game's setting and its backstory",
  "category": "gaming",
  "updated": "2021-10-20T17:29:29Z",
  "author": "emma-boyle",
  "summary": "Get ready to explore The Settled Systems",
  "article": [
    "Bethesda has released a brand new Starfield video, this time giving an overview of the game’s overall setting, known as 'The Settled Systems'.",
    "Narrated by Bethesda Game Studios Design Director Emil Pagliarulo, the video explains that Starfield will transport players to the Settled Systems in the year 2330. The Settled Systems are located in “a relatively small pocket of the Milky Way, in an area that extends outward from our Solar System for approximately 50 light-years.”",
    "Giving some background information on the Settled Systems, Pagliarulo reveals that twenty years before the events of Starfield, the two largest factions in the Systems, the United Colonies and the Freestar Collective, were engaged in a “bloody colony war”. By the time Starfield starts, the factions have settled into an “uneasy peace” but that doesn’t make the game world any less dangerous for wide-eyed explorers.",
    "And a wide-eyed explorer is exactly what you'll be. As one of the newest recruits of Constellation, an organization “committed to uncovering the mysteries of the galaxy\", players will be expected “explore the deepest reaches of the Settled Systems.”",
    "Regardless of the peace between the big factions, it seems that players should be prepared to encounter a wide range of other potentially dangerous groups, from mercenaries and pirates to “fanatical religious zealots”.",
    "Just like previous Starfield information videos, this doesn’t include any gameplay footage or in-game screenshots of the Settled Systems. Instead, you get a glimpse of various pieces of concept art designed to fuel your imagination and give a general impression of the epic scale that Bethesda seems to be aiming for with Starfield. You can watch the video for yourself below:",
    "After revealing three specific but diverse cities that will be in Starfield back in August, it feels like Bethesda is really zooming out with this new video, giving us an even more tantalizing glimpse at the sheer scale we might be able to expect from this game world.",
    "The last clips introduced us to the capital cities of the United Colonies and the Freestar Collective, respectively called New Atlantis and Akila. These were some pretty contrasting settings so, taking these videos together, it’s just about possible to start constructing a more complete picture of the tensions between the game’s largest factions and why there might be some lingering issues twenty years after their bloody war apparently ended. It sounds like just the kind of fragile peace a mischievous or well-meaning player might be able to poke their nose into, doesn't it?",
    "Still, it's worth remembering that while the concept art on show here is beautiful and the perfect thing to whet our appetite for Starfield, it's not necessarily an exact reflection of what we'll eventually see in the game itself. As it is, there's still plenty more we have to see. From everything shown so far, though, Starfield appears to be an ambitious game with a whole lot of promise.",
    "Starfield’s release date is still slated for November 11 2022, which is still more than a year away so we’ve got plenty of time before we should expect more cinematic trailers and gameplay footage. When Starfield does launch it'll be playable on PC and Xbox Series X, with a day one Xbox Game Pass release."
  ],
  "headers": {
    "6": "Analysis: Putting the pieces together"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "back in August": "https://www.techradar.com/news/new-starfield-videos-give-a-glimpse-of-three-locations-from-the-game",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}