{
  "source": "https://www.techradar.com/news/aws-extends-free-work-from-home-workspaces-offer-to-help-smbs-stay-online-during-pandemic",
  "title": "AWS extends free Work From Home Workspaces offer to help SMBs stay online during pandemic",
  "category": "computing",
  "updated": "2021-02-04T10:39:29Z",
  "author": "barclay-ballard",
  "summary": "Access your desktop remotely for free",
  "article": [
    "AWS has reintroduced its free Work from Home Offer for Amazon WorkSpaces in order to support small and medium-sized businesses. The offer should help firms as they look to implement long-term remote work policies in light of the ongoing COVID-19 pandemic.",
    "“WorkSpaces can be used to provision either Windows or Linux desktops in just a few minutes, and quickly scale to provide hundreds or even thousands of desktops to workers across the globe,” Eron Kelly, General Manager of Product Marketing at AWS, explained. “Effective immediately, new Amazon WorkSpaces customers are able to use up to 50 Windows Standard Bundle WorkSpaces – plus one Windows performance bundle, two Linux standard bundles and one Workspaces Windows Value bundle – through July 31, 2021 at no charge.”",
    "When the pandemic first began disrupting workplaces a year ago, AWS helped businesses scale up on Amazon WorkSpaces to enable home working. Although vaccinations offer some hope of a return to normality, for the time being, many organizations continue to rely on cloud solutions to remain operational.",
    "In fact, it is likely that the coronavirus crisis has changed the business world forever. Even when firms can invite employees back into the office, some form of remote working will probably be retained.",
    "In addition to its WorkSpaces offer, AWS has also recently released a WorkSpaces Streaming Protocol (WSP), a cloud-native streaming protocol that enables a consistent user experience even on unreliable networks. This could help enhance productivity immensely for individuals making do with patchy home connections.",
    "For more details on the Amazon WorkSpaces free offer, AWS users can visit the FAQ here. To qualify for the offer, new customers must be under an Amazon account and not under a partner account."
  ],
  "headers": {
    "3": "Home comforts"
  },
  "links": {
    "AWS": "https://www.techradar.com/news/aws",
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8603044354846574000&xs=1&url=https%3A%2F%2Faws.amazon.com%2Fblogs%2Fdesktop-and-application-streaming%2Famazon-workspaces-free-tier-extension-2021%2F%3Fnc1%3Db_rp&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Faws-extends-free-work-from-home-workspaces-offer-to-help-smbs-stay-online-during-pandemic",
    "here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1373504391948687600&xs=1&url=https%3A%2F%2Faws.amazon.com%2Fworkspaces%2Ffaqs%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Faws-extends-free-work-from-home-workspaces-offer-to-help-smbs-stay-online-during-pandemic"
  }
}