{
  "source": "https://www.techradar.com/news/get-unlimited-data-for-dollar25-a-month-and-5g-support-with-visibles-new-phone-plan",
  "title": "Get unlimited data for $25 a month and 5G support with Visible's new phone plan",
  "category": "phones",
  "updated": "2021-03-29T13:50:21Z",
  "author": "mackenzie-frazier",
  "summary": "Join Visible's affordable new plan today",
  "article": [
    "Visible's launching a new phone plan that includes unlimited data, messages, and minutes for as little as $25 a month and is supported by Verizon's 5G network. This launch is the latest effort by Visible to be recognized as one of the most accessible, transparent, and affordable wireless carriers to date. As per before, the low-cost carrier offers online services only with contract-free prepaid plans, so there's no cancelation fee here. The new Party Pay plan from Visible, however, now also allows an unlimited number of people to join. Previously, it was capped at four people for just $25 a month, so you've got even more options to share your savings out with friends and family now.",
    "Even better still, Visible will drop your next bill to just $5 a month if you refer a family member or a friend to sign up with the carrier. Alongside full access to Verizon's 5G network, Visible's new plan now also offers international calling to Canada, Mexico, US Virgin Islands, and Puerto Rico too.",
    "Visible works with both iPhone and Android phones, and you can check your phone's compatibility here. You can also buy a new phone from Visible with a wide selection that includes the iPhone 12, Google Pixel 5, OnePlus 8, iPhone SE, and more. If you'd like to read more about this prepaid carrier, see our guides on this week's best Visible wireless plans and Visible deals.",
    "See more offers with our roundup of the 15 best unlocked SIM-free phones, prices, and deals, and the best cell phone plans. Shop more bargains with our roundup of the best Presidents' Day sales that are happening now."
  ],
  "headers": {
    "3": "Visible phone plan:"
  },
  "links": {
    "$25 a month and is supported by Verizon's 5G network": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-1160625347473963000&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Fplan%2F",
    "Party Pay plan": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-9030539918477549000&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Fplan%2Fparty-pay",
    "here": "https://visible.pxf.io/c/221109/12909/12909?subId1=trd-us-1425936525314087700&sharedId=trd-us&u=https%3A%2F%2Fwww.visible.com%2Fcompatibility",
    "Visible wireless plans": "https://www.techradar.com/deals/best-visible-wireless-plans",
    "Visible deals": "https://www.techradar.com/deals/best-visible-deals-coupon-codes",
    "15 best unlocked SIM-free phones, prices, and deals": "https://www.techradar.com/deals/unlocked-mobile-phones",
    "best cell phone plans": "https://www.techradar.com/deals/best-cell-phone-plans",
    "best Presidents' Day sales": "https://www.techradar.com/news/presidents-day-sales-deals-2021"
  }
}