{
  "source": "https://www.techradar.com/news/microsofts-latest-smart-speakers-are-the-perfect-teams-companion",
  "title": "Microsoft's latest smart speakers are the perfect Teams companion",
  "category": "computing",
  "updated": "2021-03-03T22:30:17Z",
  "author": "anthony-spadafora",
  "summary": "Transcribe and even translate your meetings in Teams",
  "article": [
    "Whether you're working from home or have already returned to the office, Teams can be a great tool for staying connected and Microsoft has worked with its partners to create an entire ecosystem of Microsoft Teams Rooms devices.",
    "At its annual Ignite conference, the software giant has announced a new addition to its lineup of Teams devices in the form of new smart speakers.",
    "The company's new Microsoft Teams Intelligent speakers were created in partnership with EPOS and Yealink though we could see other hardware manufacturers create similar devices of their own.",
    "The two new Microsoft Teams Intelligent Speakers from EPOS and Yealink can identify and differentiate the voices of up to 10 people speaking in a Microsoft Teams Room.",
    "These new speakers are also capable of transcribing what was said in a meeting so that all attendees can follow along or capture actions to know exactly who in the room said what. Regardless of whether you're working remotely or following a meeting in the conference room, you can effectively see who said what during the meeting. These new devices also support translation for organizations conducting business with international firms.",
    "To protect the privacy and security of everyone in a meeting, Teams users can even turn attribution on or off at any time when using an Intelligent Speaker.",
    "Even when workers do begin returning to the office in droves, video conferencing software isn't going anywhere and with these new devices, Teams users will gain an advantage when it comes to ensuring they don't miss anything said at an important meeting.",
    "Via The Verge"
  ],
  "headers": {
    "3": "Intelligent Speakers"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Microsoft Teams Rooms devices": "https://www.techradar.com/news/video-conferencing-gets-less-painful-with-microsoft-teams-rooms",
    "Ignite conference": "https://www.techradar.com/news/microsoft-teams-is-finally-getting-end-to-end-encryption-and-bunch-of-other-security-upgrades",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Microsoft Teams Room": "https://www.techradar.com/news/new-microsoft-teams-integration-makes-for-even-more-elaborate-video-conferencing",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "The Verge": "https://www.theverge.com/2021/3/2/22308962/microsoft-intelligent-speaker-teams-translation-transcription-features?scrolla=5eb6d68b7fedc32c19ef33b4"
  }
}