{
  "source": "https://www.techradar.com/news/intel-alder-lake-flagship-cpu-may-not-boost-as-fast-as-rumor-mill-hoped",
  "title": "Intel Alder Lake flagship CPU may not boost as fast as rumor mill hoped",
  "category": "computing",
  "updated": "2021-07-14T12:34:10Z",
  "author": "darren-allan",
  "summary": "But Core i9-12900K could still outperform Ryzen 5950X, speculation indicates",
  "article": [
    "Intel’s Alder Lake flagship processor is the subject of a fresh leak, with a purported engineering sample having been spotted with a maximum (single-core) Turbo boost of 5.3GHz.",
    "The spec revelation came alongside a bit of benchmarking speculation, and was uncovered on the NGA.cn forum by renowned leaker @9550pro.",
    "The QS, or Qualification Sample, of the purported Core i9-12900K shows a top boost speed of 5.3GHz for the full-power cores, and 3.9GHz for the low-power cores, but as an engineering model, this CPU is not representative of the final product.",
    "Put your sceptical hat on here, because the source looks sketchier than usual, and doesn’t provide any firm evidence like screen grabs for the benchmarking (which is also guesstimated; more on that later).",
    "So, we definitely shouldn’t get too carried away with the idea that the max Turbo will be 5.3GHz, although it does make some sense in that it equals the Rocket Lake (11900K) flagship.",
    "As Wccftech, which flagged this up, reports, chatter online indicates some disappointment that a previous rumor of a 5.5GHz top speed for the 12900K isn’t borne out here, but that seems like a stretch anyway (remember, Intel is purportedly cramming in a lot of cores here: 16 to be precise, even if half of them are low-power ones for the flagship).",
    "Naturally, performance isn’t all about raw clock speeds anyway. Architectural gains supposedly promise something like a 20% improvement over Rocket Lake, and those ‘little’ low-power cores – which come alongside the standard full-power ones – could help to up overall performance considerably. We’ve heard that before from prolific leaker Moore’s Law Is Dead, and this new rumor also notes that the ‘Gracemont’ (power-efficient) cores are ‘very powerful’ in their own right (and not just something that’ll be useful for laptops and battery preservation).",
    "That’s a potential source of excitement, for sure, and the benchmarking provided with this leak shows a Cinebench R20 multi-core result where the 12900K outdoes the current AMD flagship Ryzen 5950X by almost 10%. However, this is actually only so much guesswork, building in a projected faster performance (and Turbo speed) than the engineering sample, meaning we need to employ huge pinches of salt here.",
    "Another interesting point with this Alder Lake spillage is the reinforcing of the rumor that Windows 11 is needed to get the most from these hybrid CPUs, due to that revamped operating system’s scheduler improvements which are designed to get the most out of the mix of big and little cores.",
    "That could also mean that the performance of Alder Lake silicon won’t just depend on the hardware itself, but also how Microsoft comes through in terms of tuning Windows 11 for Intel’s next-gen CPUs. Given that, and the entirely different approach with the big.LITTLE-style architecture, there are a lot of variables in terms of how the 12th-gen processors will shape up.",
    "Intel’s Alder Lake CPUs are expected to emerge towards the end of 2021, possibly around the close of October, though another rumor has pointed to November."
  ],
  "headers": {
    "6": "Gracemont goodness"
  },
  "links": {
    "Intel’s Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "NGA.cn": "https://bbs.nga.cn/read.php?tid=27580574&authorid=88852&rand=184",
    "11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "Wccftech": "https://wccftech.com/intel-alder-lake-core-i9-12900k-qualification-sample-is-allegedly-able-to-achieve-a-turbo-of-5-3-ghz/",
    "promise something like a 20% improvement over Rocket Lake": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought",
    "from prolific leaker Moore’s Law Is Dead": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought",
    "Windows 11": "https://www.techradar.com/news/how-to-download-windows-11",
    "possibly around the close of October": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows",
    "another rumor has pointed to November": "https://www.techradar.com/news/more-bad-news-for-pc-owners-as-delays-may-hit-intel-alder-lake-cpus"
  }
}