{
  "source": "https://www.techradar.com/news/how-a-former-intel-ceo-threw-himself-under-the-bus-for-the-greater-good",
  "title": "How a former Intel CEO threw himself under the bus for the greater good",
  "category": "computing",
  "updated": "2021-12-02T13:42:52Z",
  "author": "joel-khalili",
  "summary": "Ex-Intel Chief of Staff recounts struggles at the company in the mid-2000s",
  "article": [
    "Lila Ibrahim, who held a series of high-profile roles at Intel over almost two decades, has offered insight into a period of turmoil at the company in the mid-2000s.",
    "Interviewed on stage at Slush 2021 in Helsinki on the topic of “pioneering a culture of responsibility”, Ibrahim recounted an instance in which ex-Intel CEO Craig Barrett sacrificed his own reputation in order to steady the ship.",
    "“When I was in that Chief of Staff role, there was a moment the company wasn’t executing properly, and there was a lot of in-fighting and finger-pointing,” she explained.",
    "To draw a line under these “distractions”, Barrett sent round an internal memo taking responsibility for the issues, in full knowledge it would be leaked to the press, she said.",
    "When Ibrahim asked Barrett why he was willing to take the negative press, he responded: “It’s my responsibility as a leader to be accountable and to get people focused on where they can add the most value.”",
    "Although Ibrahim didn’t offer much in the way of specifics, and nor did she name Barrett explicitly, she is very likely referring to the series of manufacturing issues that led to the delay of a higher-speed version of the Pentium 4 processor in 2004.",
    "The company also missed its goal of reducing the per unit cost of its chips by 15% that year. Intel President Paul Otellini, who later succeeded Barrett as CEO, ascribed the failures to “ups and downs” at the company.",
    "As per Ibrahim’s telling, Barrett had effectively fallen on his own sword to allow the company to move forward with its projects.",
    "Now working as COO at AI company DeepMind, alongside Demis Hassabis, Ibrahim says she learned a valuable lesson about leadership from Barrett’s approach to problem solving and accountability.",
    "“My style of COO is someone who is a servant leader to the organization, the mission and the founder. Sometimes, you have to step up and take responsibility.”",
    "“[It’s vital for leaders] to provide the cover for risk-taking, which is the only way an organization can succeed; not by being complacent, but by taking calculated risk.”"
  ],
  "headers": {
    "5": "A lesson in leadership"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Slush 2021": "https://www.techradar.com/news/live/slush-2021-live-blog-all-the-latest-updates-from-the-startup-conference",
    "processor": "https://www.techradar.com/news/best-processors",
    "ascribed the failures to “ups and downs”": "https://money.cnn.com/2004/12/07/technology/intel_missteps/index.htm",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "DeepMind": "https://www.techradar.com/news/world-of-tech/why-deepmind-s-triumph-over-humanity-should-both-excite-and-terrify-you-1316930"
  }
}