{
  "source": "https://www.techradar.com/news/wearos-is-finally-getting-an-update-that-might-make-its-smartwatches-good-again",
  "title": "Wear OS is getting huge changes - could its smartwatches finally be good?",
  "category": "wearables",
  "updated": "2021-05-18T19:16:34Z",
  "author": "tom-bedford",
  "summary": "Big changes are coming to your wrist",
  "article": [
    "Fans of Wear OS smartwatches have often complained about Google's neglect of its wearables operating system, and at Google IO 2021, the tech giant's annual developer conference, the company unveiled the biggest change to Wear OS that we've seen in years.",
    "Well, it's a series of changes actually – apparently, this new version of Wear OS has been designed in collaboration with Samsung, which almost guarantees that the upcoming Watch 4 and Watch Active 4 will use the platform. The update will be rolling out through the rest of this year.",
    "The new Wear OS isn't exclusive to Samsung and Google wearables though – any device makers will be able to use it, and we'd expect the same companies who already use the platform, like Fossil and Suunto, will continue to do so.",
    "Apparently this new Wear OS takes much of its DNA from Tizen – that's the operating system previous Samsung wearables have run on – and rolls it into the existing Wear OS.",
    "Google says the key feature of the new Wear OS update is improvements to battery life – typically, Wear OS watches last about a day, which is poor compared to most watches, but apparently they'll now last a lot longer. We'll have to wait until we've tested watches running the OS to know what that really means, though.",
    "Performance is apparently another area that will be seeing improvements, with Google stating that apps will open 30% faster, and with smoother transitions.",
    "A rumored Wear OS change was third-party Tiles – those are the displays that appear when you swipe to the side – and Google has confirmed that there will be lots of new Tiles, including from some new platforms. Strava, Spotify and Adidas Running are among the confirmed apps that will get Tiles.",
    "One upgrade (well, some people would call it that) is YouTube Music coming to the platform, so users of Google's music service will be able to download tunes to their wrist.",
    "Apparently Wear OS is also getting changes to how you navigate around the user interface, although lots of the examples Google lists are actually things the platform already does. One new feature is the ability to quickly switch between apps, which is a useful feature on Android.",
    "Google is also working with Fitbit – which it bought earlier in 2021 – to bring new fitness features to Wear OS, but it's not clear what this means. Google Fit is already an expansive platform, so we'll have to see what's new when this change rolls out."
  ],
  "headers": {
    "4": "What's new?"
  },
  "links": {
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Google Fit": "https://www.techradar.com/news/google-fit-all-about-the-smartwatch-and-phone-fitness-app-and-what-sports-it-tracks"
  }
}