{
  "source": "https://www.techradar.com/news/huawei-mate-x2",
  "title": "Huawei Mate X2 release date, price and everything you need to know",
  "category": "phones",
  "updated": "2021-05-04T14:28:07.602Z",
  "author": "tom-bedford",
  "summary": "Huawei's new foldable phone is here",
  "article": [
    "The Huawei Mate X2 is the Chinese company's latest foldable phone, combining top specs and design with the company's own software.",
    "We've actually spent a week with the Huawei Mate X2, and were impressed with its camera and the way it looks, though had trouble with the fact lots of its apps are in the Chinese language.",
    "Why does Huawei's premium foldable phone have Chinese apps on it? Well that's because, as far as we're aware, the handset is only getting launched in China. You probably won't be able to buy it then, unless you make the decision to import one.",
    "You can read that article to find out all about our experiences with the phone; for a more objective round-up of the handset's features and specs, this is the article for you.",
    "The Huawei Mate X2 launch event took place on February 22nd, at we learned about Chinese pricing and availability there, so we're still waiting on that information for a global launch (though there's no confirmation it'll come out elsewhere).",
    "In China, people will be able to buy the phone starting February 25 - that's a pretty quick turn-around.",
    "The phone costs 17,999 CNY (roughly $2,785, £1,985, AU$3,530) for 256GB storage and 18,999 CNY (around $2,940, £2,095, AU$3,730) for 512GB - if those conversions are even remotely accurate, this will be a pricey phone. For context, the last handset, the Mate Xs, cost a princely £2,299 (around $2,750 / AU$4,200).",
    "The Huawei Mate X2 is a 'book-style' foldable phone, meaning it opens up from a 'standard' smartphone to turn into a tablet-style device. Previous Mate X foldables used a similar design except they had their displays on the outside - the Mate X2 has it on the inside.",
    "This primary display measures 8.01 inches diagonally, with a resolution of 2480 x 2200 and a 90Hz refresh rate. The other screen is 6.45 inches, with a 2700 x 1160 resolution and the same refresh rate.",
    "At the launch, Huawei made a point of describing the hinge - it's supposedly very small, so when you fold the phone closed, there's no gap between the two sides. It's also tapered like a wedge, so it gradually gets thicker. At one end it's 4.4mm thick, and we don't know the thickness on the other side.",
    "There are a few benefits to this. Firstly it lets the camera bump be thicker without the actual phone getting too chunky, as when closed, the average thickness balances out. Check out what we mean by this below. Secondly, the center of mass is on one side, so you can more easily hold the phone with one hand, similar to an Amazon Kindle Oasis.",
    "There are four colors for the Mate X2 - pink, black, white and blue - though it's not clear if all four options will be offered in other regions.",
    "The Huawei Mate X2 has six cameras in total - four in the main array, and two selfie snappers in a pill-shaped cut-out in the outer display.",
    "The four main snappers are a 50MP primary, 10MP periscope (for 10x optical zoom), 12MP telephoto (for 3x optical zoom) and 16MP ultra-wide camera. We've seen most of these cameras in other Huawei phones before, so we're confident they'll take great pictures.",
    "The two front cameras are an 8MP main and 16MP ultra-wide camera, which should allow for a diversity of options when you're taking solo or group selfies. At the Mate X2 launch event, Huawei made it clear that you can also use the primary camera array for selfies by unfolding the phone (so the main snappers are facing you) - this does make the selfie snappers seem somewhat redundant though.",
    "The Huawei Mate X2 battery capacity is 4,500mAh, and the handset has 55W fast charging. It doesn't sound like the thing has wireless powering though.",
    "The Huawei Mate X2 uses the Kirin 9000 chipset, which should provide super-fast processing speeds, as well as improved battery optimizations for longer battery life. We previously saw this used in the Huawei Mate 40 Pro, and likely in the P50 too.",
    "That chipset allows for 5G connectivity too, if you have such a contract. The Mate X2 has dual-SIM capabilities, so you can slot two different SIMs in and make the most of different networks.",
    "Speaking of 'dual' things, the phone has dual stereo speakers, so you should get a surround-sound effect when you're listening to music or watching videos.",
    "The software is Android with Huawei's EMUI laid over the top, but alongside announcing the Mate X2, the company announced the rollout of its own HarmonyOS operating system. The Mate X2 is one of the phones eligible for this upgrade, but it sounds like the phone won't come with it installed.",
    "Huawei announced that most of the top few thousand apps in China are now optimized for foldable phones, making the device great for productivity and entertainment tools. Of course, the top apps in China are not the same as the popular ones in the rest of the world, so this could be an issue with the phone's wider rollout."
  ],
  "headers": {
    "4": "Huawei Mate X2 release date and price",
    "7": "Design and display",
    "12": "Cameras and battery life",
    "16": "Performance and software"
  },
  "links": {
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "spent a week with the Huawei Mate X2": "https://www.techradar.com/news/a-week-with-the-huawei-mate-x2",
    "Amazon Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review",
    "Huawei Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "P50": "https://www.techradar.com/news/huawei-p50-series",
    "company announced the rollout of its own HarmonyOS operating system": "https://www.techradar.com/news/harmonyos-is-replacing-android-on-huawei-flagships-from-april"
  }
}