{
  "source": "https://www.techradar.com/news/you-can-now-get-apple-silicon-m1-as-a-service",
  "title": "You can now get Apple Silicon M1 as-a-Service",
  "category": "computing",
  "updated": "2021-02-02T17:22:13Z",
  "author": "barclay-ballard",
  "summary": "It's the first such offering available in Europe",
  "article": [
    "Cloud computing firm Scaleway has announced that it is offering Apple M1 instances, representing the first M1-as-a-service solution in Europe. The new cloud instance will give Apple fans the chance to experience the impressive performance of its new M1 chip as part of a subscription payment plan.",
    "Scaleway will deploy a farm of the latest Mac minis (running on Apple Silicon M1 chips) in its DC4 datacenter, located 25 meters underground in a former nuclear fallout shelter in central Paris. The French cloud provider promises to have your Mac mini M1 up and running in less than five minutes.",
    "Subscribers will be offered M1 access at a price of €0.10 per hour, with a minimum commitment of 24 hours. The price, as well as the flexibility, compares favorably against its industry rivals. In the US, for example, MacStadium recently began offering M1 instances starting from $109 a month for the use of an M1 Mac mini with 8GB of RAM and 256GB of storage.",
    "Scaleway boasts that its new M1-as-a-service offering will allow customers to test, build and submit their iOS and macOS apps more easily, and grant them access to a fully native Big Sur experience. The Mac mini M1 will come with 8GB of unified RAM and a 256GB SSD for intensive workloads.",
    "There has been plenty of excitement surrounding Apple’s M1 chip since it was announced last year. There has also been some speculation that the hardware may suffer from compatibility issues when compared with older Apple devices running Intel processors. However, these issues have largely been avoided, while M1-powered devices have delivered some impressive performance benchmarks.",
    "Scaleway’s Mac mini M1s are available to purchase now and come with 24/7 support as standard."
  ],
  "headers": {
    "3": "Renting excellence"
  },
  "links": {
    "Apple M1": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacStadium": "https://www.techradar.com/news/you-can-now-rent-an-apple-m1-mac-mini-as-a-server-to-run-your-own-website"
  }
}