{
  "source": "https://www.techradar.com/news/samsung-galaxy-book-go-is-a-budget-laptop-with-qualcomms-new-apple-m1-challenging-cpu",
  "title": "Samsung Galaxy Book Go is a budget laptop with Qualcomm’s new Apple M1-challenging CPU",
  "category": "computing",
  "updated": "2021-06-03T10:44:55.425Z",
  "author": "darren-allan",
  "summary": "An affordable, robust and lightweight notebook",
  "article": [
    "Samsung just revealed the Galaxy Book Go, an affordable laptop powered by the new Qualcomm Snapdragon chip that was recently revealed.",
    "The Galaxy Book Go is a slim and portable 14-inch Windows 10 on ARM laptop built around the Snapdragon 7c Gen 2 (a refresh of the original 7c chip). It boasts all the usual strengths you’d expect from such an ‘always connected’ portable, including LTE connectivity (so you can always be online when out and about) and impressive battery life.",
    "The 14-inch screen is a Full HD resolution affair, and there are two models, one with 4GB of system memory, and the other with 8GB. Both of these versions provide 128GB of storage, plus Wi-Fi 5 (and LTE as mentioned).",
    "It’s 14.9mm thick and weighs just a touch under 1.4kg, carrying a pair of USB-C ports, a USB 2.0 connector, and a headphone/mic jack with microSD and nano SIM slots.",
    "The Galaxy Book Go sports Dolby Atmos sound, and is built to last, too – it’s a robust portable which has passed MIL-STD-810G tests for shock, humidity and extreme temperatures.",
    "Sadly, Samsung doesn’t give us any battery longevity figures, but we can expect this notebook to deliver on that front given the Snapdragon 7c Gen 2’s claimed ability to deliver approaching 20 hours of juice.",
    "The Samsung Galaxy Book Go is up for pre-order now starting at $349/£399, and it’ll hit the shelves on June 10."
  ],
  "headers": {
    "4": "Tough enough"
  },
  "links": {
    "new Qualcomm Snapdragon chip that was recently revealed": "https://www.techradar.com/news/new-qualcomm-snapdragon-7c-could-be-apple-m1-for-windows-10",
    "Windows 10 on ARM": "https://www.techradar.com/news/a-closer-look-at-windows-10-s-windows-10-on-arm-and-windows-10-iot",
    "deliver approaching 20 hours of juice": "https://www.techradar.com/news/new-qualcomm-snapdragon-7c-could-be-apple-m1-for-windows-10"
  }
}