{
  "source": "https://www.techradar.com/news/hitman-3-is-the-game-i-wished-assassins-creed-was",
  "title": "Hitman 3 is the game I wished Assassin’s Creed was",
  "category": "gaming",
  "updated": "2021-01-08T15:01:25Z",
  "author": "matt-hanson",
  "summary": "Opinion: perfectly executed",
  "article": [
    "Hitman 3 launches on January 20, but ahead of release I was given the opportunity to slip into Agent 47’s blood-stained shoes. If you’ve played the past two games (2016’s Hitman, and its sequel Hitman 2 in 2018), then you’ll feel instantly at home. The latest game continues to offer beautifully realized exotic locations around the world that offer you deadly playgrounds to stealthily hunt and kill your prey.",
    "After refreshing my memory in the tutorial mission, I tested out the first level, which takes place inside a skyscraper in Dubai. The relatively enclosed space feels like a far cry from some of the more open levels of previous games, but the graphics remain extremely impressive. The skyscraper, and the people inside it (who have gathered together for a party to celebrate its opening), look amazing, and it seems the team is rightfully proud of how the game looks, as at certain points the camera moves to take in some of the stunning scenery, such as the sun bursting through the clouds, bathing revelers in gold.",
    "It’s one of the aspects where IO Interactive’s decision to keep levels small and focused, rather than going the open-world route, has paid dividends. Throughout my time with Hitman 3, I became ever more convinced that this was the game I had always wanted Assassin’s Creed to be.",
    "When Assassin’s Creed was first announced almost 15 years ago, I couldn’t wait to play it. The idea of carefully planning assassinations, stalking your target and gathering intel, sounded brilliant. Alas, the first game, while fun, didn’t live up to my expectations. Gathering intel mainly involved sitting near people and pressing a button, and the assassinations themselves were rather linear (sneak up to your target and press a button, then escape).",
    "Over the following decade, I’ve played most entries in the Assassin’s Creed series, and while I enjoyed most of them, and even loved a few of them, none of them offered the stealthy, open-ended, game I had originally hoped for.",
    "In fact, the last two entries, Odyssey and Valhalla, felt even more removed than ever. Sure, I’m having fun with Valhalla, but it’s not an assassination or stealth game. It’s a sprawling Viking-themed hack-n-slash. Fun, but not what I’m after.",
    "Hitman 3, however, is. As with the previous games, extra intel that can help you get close to your targets is littered organically throughout the level. Walking past a couple of people talking over some drinks, I heard them talk about meeting one of my targets, and where. Sure, they were programmed to say those lines as I approached, but it felt far more immersive. Best of all, I could use that information, or come up with another way (which I did, mainly thanks to my incompetence – more on that in a bit).",
    "Parts of the level are gated off to you unless you’re in disguise, again like previous games. This means isolating, for example, a maintenance worker, by creating a disturbance (I broke a toilet), and when no one is looking, knocking them out, stealing their clothes, and hiding them in a locker.",
    "Assassin’s Creed games also have out of bounds areas, but to blend into them, it usually just means crouching in some long grass.",
    "And, while Hitman 3’s levels are much smaller than the huge open worlds of Odyssey and Valhalla, they feel much richer with things to find and do. As I made my way through that first level, I discovered new potential routes to my targets. I’d skydived in with no weapons, but as well as various tools scattered around the world (such as rat poison for tipping into food and drink, and hammers left in maintenance rooms), I overheard a phone conversation about an exploding golf ball.",
    "With one of my targets liking to hit balls from their penthouse balcony, a devious plan started to emerge. However, after blundering about, getting spotted and having to hide in numerous toilets, my plans changed.",
    "The ability to change your plans on the fly as mistakes are made, or more intel is uncovered, is one of the highlights of the game. In the end, I had to resort to using a hastily-grabbed letter opener to take out my target, after leaping over a coffee table. Not the cool, suave, takedown I was planning, but it did the job.",
    "However, I’m eager to replay the level and try out a few new things. I especially want to try death by golf ball.",
    "So, even though the self-contained levels of Hitman 3 are much smaller than the maps found in modern Assassin’s Creed games, they offer huge amounts of replay value. I feel I only saw a tiny part of the first level during my playthrough.",
    "The smaller, more focussed, maps allow for a greater level of detail. Not only do the levels look amazing graphically, they all feel distinct. They are also populated by NPCs (non-player characters) that feel more individual – and alive – than the copy and pasted NPCs that usually populate huge open-world games.",
    "Also, after playing the likes of Assassin’s Creed: Valhalla, Watch Dogs: Legion and Cyberpunk 2077, which all launched (and continue to have) immersion-breaking bugs, Hitman 3 feels much more polished. Again, that more focussed scope certainly helps.",
    "Hitman 3 certainly feels more like the third part of a trilogy, rather than a distinct entry in a long-running franchise. If you already have Hitman and Hitman 2 in your game library, those games are even integrated into the menus of Hitman 3, making one large game, rather than a trilogy.",
    "This is great news for fans of the series who love every aspect of the game. However, if you didn’t warm to any of the previous games, it’s very likely that you’ll be similarly unimpressed with Hitman 3.",
    "The contained levels and laser-focus on stealth may frustrate many gamers, who like the open worlds and varied gameplay offered by the likes of Assassin’s Creed Valhalla. There aren’t any mini-games or collectibles here.",
    "And, if you’ve not played the other two games in the trilogy, you may feel completely at sea. The first level takes place immediately after the events of Hitman 2. This means you feel like you’re already halfway (or more) through a story, and the importance of characters and targets will be lost on any new players. There’s a recap cinematic, but many people may feel like they’re missing out on many of the narrative beats.",
    "The good news is that Hitman and Hitman 2 have had big price cuts ahead of Hitman 3’s launch, so if you really want to get into this series, now’s a perfect time.",
    "From what I’ve played of Hitman 3, I’m really impressed. The game’s focus on silent assassinations doesn’t mean you’re limited to how you can complete missions. There’s a huge amount of opportunities and secrets to uncover, and this makes each level feel packed with deadly potential.",
    "For anyone who has been disappointed with Assassin’s Creed moving away from being about actual assassins, Hitman 3 offers a brilliant alternative. I can’t wait to play some more."
  ],
  "headers": {
    "3": "Big ideas",
    "13": "Size matters",
    "16": "Déjà vu"
  },
  "links": {
    "Hitman 3": "https://www.techradar.com/news/hitman-3-looks-like-the-most-ambitious-agent-47-game-yet-in-new-gameplay-trailer",
    "Assassin’s Creed: Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Watch Dogs: Legion": "https://www.techradar.com/reviews/watch-dogs-legion",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}