{
  "source": "https://www.techradar.com/news/amazon-prime-video-will-stream-all-4-evangelion-movies-including-the-new-one",
  "title": "Amazon Prime Video will stream all 4 Evangelion movies, including the new one",
  "category": "entertainment",
  "updated": "2021-07-01T16:45:50Z",
  "author": "samuel-roberts",
  "summary": "And they're coming very soon",
  "article": [
    "Amazon Prime Video will exclusively release the new Evangelion movie, Evangelion: 3.0+1.01 Thrice Upon a Time, everywhere outside Japan. The fourth and final movie in the rebooted Evangelion movie series is set to stream on August 13, while the previous three movies will also be available to stream for Prime subscribers.",
    "The Rebuild of Evangelion movies retell the story of the classic '90s anime series Neon Genesis Evangelion, which you might remember Netflix streamed with a new dub back in 2019. The twist with this new set of movies is that key details of the story are changed from the show – including the addition of new characters.",
    "Amazon's acquisition, then, is fairly significant, considering the series is now synonymous with Netflix in much of the world. Amazon will release the Evangelion movies in over 240 countries, and be dubbed in 10 languages. Obviously, this doesn't include the movie End of Evangelion – which is part of the series' canon, and is also available on Netflix.",
    "The series is about the pilots of EVA units, essentially giant robots that represent humanity's last stand against the Angels – giant monsters that are coming to destroy the world. But what's distinctive about the series is how it weaves adult themes into the show, and explores the psychology of its mech pilots. It's really good, and worth a watch even if you don't think you love anime.",
    "This fourth movie has been a long time coming, since the third released back in 2012. It will apparently feature revised scenes from the original movie's release, making it the most up-to-date version of the film.",
    "It's unclear when the first three movies will be available to stream on Amazon Prime Video from the announcement, but we'd expect them very soon, considering the imminent release of Evangelion: 3.0+1.01 Thrice Upon a Time. And yes, that title sure is a mouthful.",
    "Amazon Prime Video's acquisition of the movies is actually a bit of a relief. While the opportunity to see it on the big screen would've been cool, this makes the movies incredibly accessible wherever you want to watch it – and given that the movie's original 2020 release was already pushed back by the pandemic, it's nice that this is happening so soon.",
    "It also suggests that Amazon sees anime as a subject area where it can make big strides with potential subscribers. Even though there are now loads of places where people can stream anime, this is about as big as a splash as you can make in this particular space.",
    "The fourth movie released in Japan back in March."
  ],
  "headers": {
    "6": "Why this is significant for Evangelion"
  },
  "links": {
    "Amazon Prime Video": "https://www.techradar.com/reviews/amazon-prime-review"
  }
}