{
  "source": "https://www.techradar.com/news/heres-how-nasa-perseverance-shot-its-incredible-video-of-the-mars-landing",
  "title": "Here's how NASA Perseverance shot its incredible video of the Mars landing",
  "category": "cameras",
  "updated": "2021-04-19T09:33:11Z",
  "author": "hamish-hector",
  "summary": "The ideal cameras for a picture-postcard planet",
  "article": [
    "The Perseverance rover has put its record-breaking number of cameras to quick use since touching down on Mars, already sending home pictures and video of the red planet, which NASA has released to the public.",
    "But how exactly has it managed to shoot such high-quality footage and send it back to earth so quickly?",
    "These aren’t the first images we have of Mars, but unlike the ones taken by Curiosity – Perseverance’s older sibling that landed in 2012 – these are in full color using 20MP cameras, rather than the measly 1MP black-and-white cameras from before.",
    "Along with video of the landing process, NASA also put out an interactive 360-degree panoramic photo of Perseverance’s landing site, using real images taken by the rover on Mars.",
    "Perseverance’s mission is all about data collection, searching for absolutely any sign of life it possibly can, so it’s been outfitted with plenty of impressive tools. When it comes to the images we’ve seen, they’re thanks to the rover’s 23 cameras – seven of which were just to document the entry, descent, and landing of the craft.",
    "Using cameras positioned on the rover, its parachute and its sky crane – a hovering device that lowers the rover more carefully onto Mars – Perseverance was able to capture the first full video of a rover landing (below), rather than the jerky stop motion Curiosity pulled-off.",
    "Landing is one of the most stressful parts of the rover’s mission, with massive heat and a speedy descent through the atmosphere both ready to cause problems and end the mission before it can even begin.",
    "This new footage should help NASA scientists understand the process more fully and make improvements to their next Mars landing.",
    "The capture of the 360-degree panorama was slightly different, making use of the Navcam on Perseverance's 'head' below.",
    "As Justin Maki, NASA Perseverance's imaging scientist and instrument operations team chief explained in a Tweet on the subject, the panorama was stitched together using several shots and only shows \"approximate color\" of the vista around the rover.",
    "NASA says it has thousands of images already and you can download the full-size images from the Mars Perseverance raw images library.",
    "It's one thing taking photos on Mars – the greater technical challenge is then getting them back to Earth. After all, you can’t just ping them off in an email or upload them to Google Photos as we can here.",
    "This is where Nasa’s MAVEN satellite steps in. Not only has it been tasked with monitoring Mars’ atmosphere, but nearly six-and-a-half years after it began orbiting the planet, MAVEN has become an integral part of Perseverance’s mission as a telecommunications relay.",
    "Using its ultra-high frequency (UNF) radio transceiver, MAVEN is able to transmit data at a max rate of about 2048 kbps (kilobits per second) between Earth and the rover. It does this from an adjusted orbit which it took on last year in preparation for Perseverance’s arrival.",
    "In the US the average broadband speed is about 120 Mbps (megabits per second), or around 60 times faster, so NASA also used some clever compression to get the image data back quickly.",
    "In a Reddit AMA with scientists and engineers working on Perseverance, Adam Nelessen (EDL Cameras Engineer, NASA Jet Propulsion Laboratory) explained how this was done: \"A key part of the EDL (Entry, Descent and Landing) Cameras instrument is a small computer on the Rover called the Data Storage Unit (DSU). The DSU stored raw images from the 6 EDL Cameras (Rover Uplook, Rover Downlook, Descent Stage Downlook, and Parachute Uplook) and audio captured by the microphone,\" he said.",
    "\"We were able to compress the raw images into videos right there on Mars on the DSU, which cuts down dramatically on the data volume needed to send the products back to Earth for all of us to feast our eyes on!\".",
    "The good news is that NASA hasn't received all of the images from Mars yet, \"just the videos of the really top priority events\", according to Adam Nelessen. But NASA thinks we'll get full-resolution imagery \"over the coming months\", which is good news for anyone hoping to use it as their new wallpaper.",
    "One piece of footage NASA hopes to capture next is a photos and video of Ingenuity in flight on Mars. Ingenuity is a drone-sized helicopter that dropped with Perseverance and is intended to be the first helicopter to fly on another planet.",
    "Perseverance will take pictures and recordings of Ingenuity's tests to help NASA confirm if flight is possible on Mars like it is on Earth, when it launches in the next month or two.",
    "And according to a Reddit AMA with scientists working on the Perseverance Rover, the \"the Mastcam-Z and navigation cameras will attempt to take images and possibly video of Ingenuity's flight\".",
    "The rover is also fitted with a SkyCam. The purpose is to take science-quality images of the sky above Perseverance to show what the stars look like from another planet. In the same Reddit AMA, scientists and engineers working for NASA told fans to stay tuned for those images to be released at some point soon, too.",
    "Most importantly, Perseverance will have a lot of rock pictures to send back to Earth. As part of Perseverance’s mission to look for signs of life it will be analyzing the composition of rocks it finds. The rover will do this using its all-in-one camera, laser, and spectrometer SuperCam, which can also make a shockwave to clear dust from surfaces it wants to investigate."
  ],
  "headers": {
    "4": "How were the video and photos taken?",
    "11": "How were these pictures sent to Earth?",
    "18": "What will Perseverance take pictures of next?"
  },
  "links": {
    "record-breaking number of cameras": "https://www.techradar.com/news/nasa-mars-rover-launches-a-closer-look-at-its-record-breaking-cameras",
    "NASA": "https://mars.nasa.gov/mars2020/multimedia/images/",
    "jerky stop motion": "https://www.youtube.com/watch?v=UcGMDXy-Y1I",
    "Mars Perseverance raw images library": "https://mars.nasa.gov/mars2020/multimedia/raw-images/",
    "adjusted orbit": "https://mars.nasa.gov/news/8844/nasas-maven-continues-to-advance-mars-science-and-telecommunications-relay-efforts/",
    "Reddit AMA": "https://www.reddit.com/r/IAmA/comments/lpzbzo/were_scientists_and_engineers_working_on_nasas/",
    "Ingenuity": "https://www.techradar.com/news/nasa-is-sending-this-tiny-helicopter-to-mars-next-year"
  }
}