{
  "source": "https://www.techradar.com/news/popular-privacy-extension-clearurls-removed-from-chrome-web-store",
  "title": "Popular privacy extension ClearURLs removed from Chrome web store",
  "category": "computing",
  "updated": "2021-03-25T20:30:31Z",
  "author": "anthony-spadafora",
  "summary": "Extension removes tracking elements from URLs in your browser",
  "article": [
    "Google has removed a popular Chrome extension called ClearURLs from the Chrome Web Store and its creator has described the company's reasoning for doing so as “ridiculous”.",
    "As reported by The Register, the Chrome team emailed the developer of the extension Kevin Röbert to inform him that his extension had been removed from its store due to violating its terms. According to the Google Chrome team, ClearURLs was banned for having an inaccurate description, using permissions and keyword spam.",
    "In the extension's page on the Chrome Web Store, Kevin Röbert describes how it can prevent unwanted tracking online by removing tracking elements often found inside URLs, saying:",
    "“This extension will automatically remove tracking elements from URLs to help protect your privacy when browse through the Internet. Many websites use tracking elements in the URL (e.g.https://example.comutm_source=newsletter1&utm_medium=email&utm_campaign=sale)to mark your online activity. All that tracking code is not necessary for a website to be displayed or work correctly and can therefore be removed—that is exactly what ClearURLs does.”",
    "Although ClearURLs has been available on the Chrome Web Store for some time now, it was removed from the store after Google discovered several violations. At the time of writing though, the extension's page is back up and you can download ClearURLs here. Even when the extension was unavailable on the Chrome Web Store, interested users could still download it for other browsers including Firefox and Microsoft Edge as well as manually for Chrome from GitHub or GitLab. One of the reasons that Röbert believes his extension was removed in the first place is due to how it could potentially hurt Google's business model as the search giant uses tracking elements in URLs to help advertisers. Still though, Robert made the necessary changes to his extension and appealed against its removal from the Chrome Web Store. It appears that Röbert's appeal was successful but we'll have to wait and see whether or not Google tries to remove similar privacy-focused extensions that alter URLs from the Chrome Web Store.",
    "Via The Register"
  ],
  "headers": {
    "4": "ClearURLs"
  },
  "links": {
    "Chrome extension": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "Chrome Web Store": "https://www.techradar.com/news/google-announces-chrome-web-store-security-crackdown",
    "The Register": "https://www.theregister.com/2021/03/24/popular_privacy_extension_clearurls_removed/",
    "extension's page": "https://chrome.google.com/webstore/detail/clearurls/lckanjgmijmafbedllaakclkaicjfmnk?hl",
    "download ClearURLs here": "https://chrome.google.com/webstore/detail/clearurls/lckanjgmijmafbedllaakclkaicjfmnk?hl",
    "browsers": "https://www.techradar.com/best/browser",
    "Google's business model": "https://www.techradar.com/news/google-vpn-why-one-company-thinks-big-techs-entry-into-the-privacy-space-is-a-terrible-idea"
  }
}