{
  "source": "https://www.techradar.com/news/android-exodus-more-phone-makers-may-turn-to-huaweis-harmonyos",
  "title": "Huawei responds to rumors of phone brands ditching Android for HarmonyOS",
  "category": "phones",
  "updated": "2021-05-10T14:39:40Z",
  "author": "tom-bedford",
  "summary": "Update: Huawei responds to rumors",
  "article": [
    "Update: After this story was originally reported on May 7, Huawei provided comment to TechRadar, stating 'HarmonyOS is available to all smartphone manufacturers'. Xiaomi and Oppo declined to comment.",
    "This is big news, as it tells us Huawei's plans for HarmonyOS. By the sounds of it, the software isn't just designed as the company's Android replacement for its own devices, but as a true alternative to Google's operating system juggernaut that other companies are able to use too.",
    "Time will tell the future of HarmonyOS - it'll need to be proven as a worthy operating system on Huawei phones before other companies even consider using it on their devices. But a few years down the line, if all goes as Huawei likely hopes, we could see other brands start to turn from Android.",
    "The original story, first published on 07/05/2021 under the name 'Android exodus: more phone makers may turn to Huawei's HarmonyOS', follows below.",
    "When it comes to smartphone operating systems Android is the big name on campus, with an estimated 87% of all smartphones running Google's operating system, according to 2019 stats. However Android might be about to face its biggest threat yet, and we're not talking about iOS.",
    "HarmonyOS, Huawei's homemade operating system and Android rival, might not just run on Huawei phones, but apparently handsets from Xiaomi, Oppo, Vivo and more, all of which are currently Androiders, too.",
    "This comes from a leaker on Chinese social media platform Weibo, who wrote regarding HarmonyOS \"some mobile phone manufacturers are also contacting, and have plans to adapt\" [the OS for their devices]. Following that up, MyFixGuide quoted a separate source which named Xiaomi, Oppo, Vivo and Meizu as the brands in question.",
    "Reading between the lines, it seems that the listed phone brands are just considering HarmonyOS and keeping their options open - this doesn't confirm they're ditching Android for Huawei's brand-new alternative. But this news does give HarmonyOS some much-needed legitimacy.",
    "In 2019 the Huawei ban started: due to a US-China trade war coupled with national security concerns, Huawei stopped being able to use any Google apps on its future Android phones - that includes the Google Play Store, Gmail, Maps and more. Some time later the brand unveiled HarmonyOS, its own operating system.",
    "Communication around HarmonyOS has been confusing, and the operating system isn't actually available on any smartphones just yet, though a rollout on some modern Huawei phones is expected, including the Huawei P40 and Mate 40 Pro. Some insiders think the upcoming Huawei P50 will be the first phone with it pre-installed.",
    "It's also worth pointing out some Huawei gadgets on sale in China already use HarmonyOS, as the operating system is meant to work on many different devices, not just smartphones.",
    "Since it's not widely used (or even commercially available on phones), HarmonyOS is still a big question mark, and we've no idea if it'll truly rival Android and iOS or whether it will quickly become dead in the water.",
    "However the fact that Xiaomi and Oppo are apparently considering HarmonyOS is a big vote of confidence, especially coming from two of the biggest phone makers in the world.",
    "At the moment, there doesn't seem to be much of a threat to Android's market dominance - Huawei's HarmonyOS is still totally unproven, as we've said, and it'll take years for it to find its stride in any case.",
    "That doesn't mean Google shouldn't take note, though, because if any company can rival the juggernaut that is Android, it's the all-powerful Huawei. They've got the money and brand recognition for HarmonyOS to give Android a run for its money.",
    "The openness that made Android popular could also be its undoing - updates to new versions of the OS are often incredibly delayed, as Google needs to design each new iteration, before putting it in the hands of phone brands for them to tailor it to all their devices.",
    "If Huawei designed HarmonyOS with its own phones in mind, updates could be quick, and work well with the hardware in question.",
    "Still, that's all speculation for now, and we'll have to see what the future holds to know for sure."
  ],
  "headers": {
    "8": "What is HarmonyOS?",
    "13": "The future of Android"
  },
  "links": {
    "Android": "https://www.techradar.com/news/android-12-news",
    "2019 stats": "https://www.statista.com/statistics/272307/market-share-forecast-for-smartphone-operating-systems/",
    "HarmonyOS": "https://www.techradar.com/news/harmonyos-2",
    "Huawei phones": "https://www.techradar.com/news/best-huawei-phones",
    "Weibo": "https://m.weibo.cn/status/4634219848402121",
    "MyFixGuide": "https://www.myfixguide.com/smartphones-manufacturers-to-adopt-harmony-os/",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "Huawei P40": "https://www.techradar.com/reviews/huawei-p40-review",
    "Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series"
  }
}