{
  "source": "https://www.techradar.com/news/donald-trump-blog-page-taken-offline",
  "title": "Donald Trump blog page taken offline",
  "category": "computing",
  "updated": "2021-06-03T13:10:18Z",
  "author": "mayank-sharma",
  "summary": "Trump is moving to another social media platform, confirms staff",
  "article": [
    "Former US President Donald Trump is once again hunting for another social media platform after his team confirmed it was taking down his official blog less than a month after it went live.",
    "The blog, entitled “From the Desk of Donald J. Trump”, was setup after mainstream social media platforms such as Twitter and Facebook had banned the former president from their platforms.",
    "The platforms blamed the then-President for using their platform to incite his followers leading to the January 6 invasion of the U.S. Capitol, in a clear violation of their terms of use. Trump was first banned temporarily by both Facebook and Twitter, before making the bans permanent.",
    "Following his exit from the White House and the launch of his blog, Trump had been sharing official statements through his office and his political action committee, Save America, according to reports.",
    "While the President was invited by Parler, the platform of choice for many of his supporters, which has been dealing with issues of its own, Trump instead decided to set up the blog on his website itself.",
    "Citing data compiled with BuzzSumo, NBC News had reported that Trump’s short-lived blog had failed to garner even a fraction of the millions of followers he had on Twitter and Facebook at the time of his ban.",
    "Confirming the deletion of the blog, senior aide Jason Miller confirmed to CNBC that the blog will not be returning.",
    "“It was just auxiliary to the broader efforts we have and are working on,” Miller told CNBC via email, without adding further details.",
    "However, when quizzed on Twitter whether the blog’s deletion was a “precursor” to the former president joining “another social media platform,” Miller replied “Yes, actually, it is. Stay tuned!”",
    "Via CNBC"
  ],
  "headers": {
    "4": "Move to another platform?"
  },
  "links": {
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "banned the former president": "https://www.techradar.com/news/twitter-is-the-latest-social-network-to-ban-donald-trump",
    "issues of its own": "https://www.techradar.com/news/aws-suspends-web-hosting-for-controversial-parler-app",
    "NBC News": "https://www.nbcnews.com/tech/tech-news/trumps-blog-isnt-lighting-internet-rcna890",
    "CNBC": "https://www.cnbc.com/2021/06/02/trump-blog-page-shuts-down-for-good.html"
  }
}