{
  "source": "https://www.techradar.com/news/seagate-is-set-to-launch-20tb-consumer-hdds-soon",
  "title": "Seagate set to launch mass-market 20TB HDDs",
  "category": "computing",
  "updated": "2021-07-23T15:29:31Z",
  "author": "mayank-sharma",
  "summary": "Seagate offers multiple technologies in its 20TB drive portfolio",
  "article": [
    "Seagate has confirmed plans to launch a 20TB disk based on the cost-effective perpendicular magnetic recording (PMR) technology, in the second half of the current year.",
    "The announcement was made by Seagate’s CEO Dave Mosley during the company’s Q2 2021 earnings call.",
    "PMR along with shingled magnetic recording (SMR) technologies, are the more cost effective solutions than the heat-assisted magnetic recording (HAMR) technology that Seagate is using in its current line of 20TB drives that it ships to select partners.",
    "“We extended our HDD technology leadership, as evidenced by Seagate being the first company to commercialize HAMR technology and the first to deliver dual actuator performance drives, which are now shipping in high volume to support multiple customers,” Mosley said during the call.",
    "In response to a question, Mosley said the company is “very aggressive” with the 20 terabyte qualification and is in fact using all the tools in its arsenal to work on different products for different segments of users.",
    "“We have a number of different 20 terabyte platforms coming - PMR, SMR, HAMR. There’s a lot of different flavors of them, and they are targeted to different customers so different qualification schedules for each,” noted Mosley.",
    "He added that the company is already producing PMR-based 18TB drives in high volumes, and is ramping up to mass produce PMR-based 20TB drives for delivery in the second half of the year.",
    "Meanwhile, Mosley noted that the rise of Chia cryptocurrency, which demands more storage for its mining, rather than processing prowess, did increase demand for HDDs.",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "4": "20TB battleground"
  },
  "links": {
    "Seagate": "https://www.techradar.com/reviews/seagate-onetouch-1tb-external-ssd",
    "20TB drives": "https://www.techradar.com/news/seagate-confirms-20tb-hamr-hard-disk-drives-have-been-shipped",
    "select partners": "https://www.techradar.com/news/seagates-latest-high-capacity-datacenter-hdd-makes-a-debut-earlier-than-expected",
    "HDD": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "Mosley said": "https://seekingalpha.com/article/4440420-seagate-technology-holdings-stx-ceo-dave-mosley-on-q4-2021-results-earnings-call-transcript",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "demands more storage": "https://www.techradar.com/news/this-new-cryptocurrency-could-potentially-cause-an-ssd-or-hard-drive-shortage",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/seagate-readies-20tb-mass-market-hdds"
  }
}