{
  "source": "https://www.techradar.com/news/sap-snaps-up-signavio-in-billion-dollar-deal",
  "title": "SAP snaps up Signavio in billion-dollar deal",
  "category": "computing",
  "updated": "2021-01-28T14:25:50Z",
  "author": "barclay-ballard",
  "summary": "Acquisition expected to close in the first quarter",
  "article": [
    "Multinational software company SAP has agreed to acquire Signavio, a German manufacturer of Business Process Management solutions, in a deal thought to be worth around $1.2 billion.",
    "SAP hopes that the deal will strengthen its ability to support customers as they attempt to transform and manage their business processes at scale.",
    "In particular, Signavio’s cloud-native process management suite should integrate well with SAP’s existing business process intelligence tools. It may find a suitable home within “RISE with SAP,” a new subscription service built to aid customers in their business transformation efforts.",
    "Working together, SAP and Signavio will be able to give customers a 360-degree view of their business processes, utilizing process mining, behavior mining, and customer experience analysis. From Signavio’s point of view, being able to tap into SAP’s customer base, financial clout, and broad software portfolio is bound to offer a number of benefits as well.",
    "It’s likely that the Signavio acquisition will also tie in nicely with movements that SAP has made recently into the process automation space. Signavio already offers its customers robotic process automation to reduce the number of business resources that must be committed to repetitive, high-volume tasks.",
    "SAP’s acquisition of Signavio is expected to close in the first quarter of 2021, subject to regulatory approval.",
    "“In today’s dynamic world, companies of all sizes need the ability to rapidly adapt their business processes to fast-changing market conditions,” Luka Mucic, SAP’s chief financial officer, explained. “I cannot overstress the importance for companies to be able to design, benchmark, improve and transform business processes across the enterprise to support new capabilities and business models. The combination of business process intelligence from SAP and Signavio creates a leading end-to-end business process transformation suite to help our customers achieve the requirements needed to gain a competitive edge. SAP and Signavio are a great cultural fit and share the same values, and we are excited about joining forces with them to deliver on our Intelligent Enterprise strategy.”",
    "Via TechCrunch"
  ],
  "headers": {
    "3": "Acquiring automation"
  },
  "links": {
    "SAP": "https://www.techradar.com/news/sap-rise-wants-to-offer-digital-transformation-as-a-service",
    "around $1.2 billion": "https://www.bloomberg.com/news/articles/2021-01-25/sap-is-said-in-talks-to-buy-apax-backed-cloud-startup-signavio",
    "explained": "https://news.sap.com/2021/01/sap-to-acquire-signavio/",
    "TechCrunch": "https://techcrunch.com/2021/01/27/sap-is-buying-berlin-business-process-automation-startup-signavio/"
  }
}