{
  "source": "https://www.techradar.com/news/apple-reportedly-staffed-its-own-medical-clinics-to-fix-us-healthcare",
  "title": "Apple reportedly staffed its own medical clinics to pioneer its own US healthcare fix",
  "category": "phones",
  "updated": "2021-06-17T07:33:51Z",
  "author": "david-lumb",
  "summary": "Instead, the Apple's health developments have been in the Apple Watch",
  "article": [
    "It’s no secret that Apple has been working with healthcare providers and experts to explore integrations between gadgets like the Apple Watch into medical care. But a new report claims that the tech giant’s ambitions were much, much bigger: ‘Apple Doctor’ was a plan to fix US healthcare by treating patients in Apple-run primary care clinics.",
    "The endeavor began shortly after the Apple Watch hit the market in 2015, when Apple realized how much health data was being gathered by the wearables. Apple concocted a plan to offer the company’s own reinvented version of US healthcare, according to an expansive Wall Street Journal report.",
    "The original idea was to staff clinics with Apple-employed doctors and offer its own brand of medical service, conceivably replete with care angled around its own consumer devices. Apple had reportedly taken over several primary care clinics in the Cupertino area and built up a team of clinicians, engineers, product designers, and others, per the Wall Street Journal.",
    "Apple reportedly claimed the overall report is incorrect, and based on “incomplete, outdated and inaccurate information,”a spokesperson told the publication.",
    "This didn’t happen, obviously, and sources told The Wall Street Journal that the efforts stalled for a few reasons as Apple shifted its health focus to anchor around selling devices instead – namely, the Apple Watch. That seems to have become the route that Apple invested in for its public-facing health steps, especially with the shareable health reports coming to iOS 15 that were revealed during WWDC 2021.",
    "But there were other setbacks, sources told The Wall Street Journal, including pushback on the integrity of the clinic-generated health information that was fed into developing products.",
    "Apple reportedly hired Dr. Sumbal Ahman Desai from Stanford University to run the health endeavors, called Project Casper. Desai led the development of the third-party API HealthKit, which debuted in iOS 8 in 2014, but has stuck with Apple since, working on health-related software and even introducing it on stage like she did with the menstrual Cycle Tracking that arrived in watchOS 6, as well as showing off the aforementioned iOS 15 health features at WWDC 2021.",
    "The report asserts that Dr. Desai has continued running Casper clinics through the present day, though it’s unclear what, if anything, has resulted from them or if they’re serving their reported original purpose of pioneering an Apple-dominated healthcare solution. The Wall Street Journal did indicate Apple is working on a new app, HealthHabit, designed to help the user set health challenges and connect to health coaches to follow through – but internal tests with Apple employees haven’t seen much adoption.",
    "Via AppleInsider"
  ],
  "headers": {
    "4": "So...what happened?"
  },
  "links": {
    "Wall Street Journal": "https://www.wsj.com/articles/apple-struggles-in-push-to-make-healthcare-greatest-legacy-11623832200",
    "shareable health reports": "https://www.techradar.com/news/apple-is-bringing-shareable-health-reports-to-ios-15-but-how-will-they-work",
    "debuted": "https://www.techradar.com/news/phone-and-communications/mobile-phones/apple-unveils-ios-8-with-healthbook-app-and-other-clues-to-iphone-6-1251473",
    "Cycle Tracking": "https://www.techradar.com/news/apple-is-adding-menstrual-cycle-tracking-to-watchos-6",
    "AppleInsider": "https://appleinsider.com/articles/21/06/16/apples-stalled-plan-to-offer-primary-health-care-revealed"
  }
}