{
  "source": "https://www.techradar.com/news/xiaomis-next-cheap-phone-is-actually-two-years-old",
  "title": "Xiaomi’s next cheap phone is actually two years old",
  "category": "phones",
  "updated": "2021-05-24T08:07:17Z",
  "author": "tom-bedford",
  "summary": "Forget the Redmi Note 11, the 8 is back",
  "article": [
    "Xiaomi’s Redmi series of cheap phones is in its 10th generation, and through early 2021 we’ve been seeing the Note 10 devices launch. However the brand’s rolling back the clock for its next release, which is actually an upgraded version of 2019’s Redmi Note 8.",
    "After weeks of rumors, Xiaomi has officially announced the new Redmi Note 8 2021 via its Twitter account, and it has confirmed some of the phone’s specs too. We’ll likely see a formal unveiling in the coming weeks.",
    "We now know the phone will have a 48MP camera, the MediaTek Helio G85 chipset and a 6.3-inch screen broken up by a teardrop notch. That latter trait is pretty old-school, with virtually every Redmi device now opting for screen cut-outs.",
    "Those specs are the same as the older version save the chipset, as the 2019 model had the Snapdragon 665. We’d presume the Helio provides better processing power, as otherwise Xiaomi’s decision to opt for it would be a curious one, but we’ll have to wait and see.",
    "The Redmi Note 8 was a huge hit for Xiaomi, with official numbers putting the sales at over 25 million units sold around the world. That’s a huge number, and reading between the lines, it suggests those figures are higher than for subsequent Redmi phones.",
    "Perhaps Xiaomi is looking to cash in on the name value of this popular phone, or provide a newer version for people who own that two-year-old device and want an upgrade.",
    "The 2019 phone was a low-cost powerhouse, though even in two years lots has changed in the cheap phone market, so we’ll need to see if the Note 8’s lightning strikes twice.",
    "Still, it’s a curious decision for Xiaomi to literally call this new phone the ‘Redmi Note 8 2021’ when it’s coming out alongside the Note 10 devices - you’d think the company would package it as a version of the Note 10, or as the Redmi Note 11.",
    "Perhaps we’ll get an official explanation at the Note 8 2021 launch event. Otherwise we’ll have to defer to the typical explanation behind Redmi naming schemes, which seems to be the shrug emoji."
  ],
  "headers": {
    "4": "Why the Redmi Note 8?"
  },
  "links": {
    "Twitter account": "https://twitter.com/xiaomi/status/1396088477163429896?s=21"
  }
}