{
  "source": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
  "title": "We might finally have a date for Samsung's next big phone and wearable launch",
  "category": "phones",
  "updated": "2021-06-12T14:30:09Z",
  "author": "david-nield",
  "summary": "Foldables, phones, wearables, earbuds",
  "article": [
    "There's a ridiculous amount of Samsung hardware in the pipeline, including but not limited to the Galaxy Z Fold 3, the Galaxy Z Flip 3, the Galaxy S21 FE, the Galaxy Watch 4, the Galaxy Watch Active 4, and the Galaxy Buds 2. Now we're got our best hint yet at when it's all going to appear.",
    "According to usually reliable tipster Max Weinbach, the two foldable phones and the two smartwatches are scheduled to be unveiled on August 3. He didn't mention the Galaxy S21 FE and the Galaxy Buds 2, but we're expecting them on the same day.",
    "That would mean Samsung's next gadget showcase would be quite the event, with multiple devices in multiple categories on show. Previous rumors have pointed to an August announcement, though this is the first time that we've had a specific date.",
    "As for when the devices will actually go on sale, well-known source Jon Prosser says that we can expect the smartwatches to start shipping on August 11, with the foldable smartphones shipping on August 27. It's going to be a busy month.",
    "At this point we've already heard plenty about what these phones and wearables are going to bring with them, though it remains to be seen how accurate the leaks and rumors are. We do know for sure that the Galaxy Watch 4 and Galaxy Watch Active 4 will come running Google's Wear OS rather than Samsung's Tizen.",
    "We're expecting slightly bigger versions of the smartwatches this time around, and we've also heard rumors about a significant step up in terms of performance power under the hood – which means these two smartwatches should be worth waiting for.",
    "When it comes to the foldable phones, the Galaxy Z Fold 3 is rumored to be arriving with support for the S Pen stylus, perhaps to make up for the lack of a Galaxy Note device this year. As for the Galaxy Z Flip 3, the word on the Samsung street is that it'll come sporting a new two-tone design to help it stand out from the crowd.",
    "This is all speculation for now, even if it comes from some of the most reliable sources in the business. As and when Samsung decides to make its next hardware launch official, we will of course be ready to bring you all the details."
  ],
  "headers": {
    "4": "What we know so far"
  },
  "links": {
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Max Weinbach": "https://twitter.com/MaxWinebach/status/1403444486307467267",
    "Previous rumors": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-and-z-fold-3-foldables-tipped-to-launch-in-august",
    "on August 11": "https://www.frontpagetech.com/2021/06/11/exclusive-samsung-galaxy-watch-4-launching-august-11th/",
    "on August 27": "https://www.frontpagetech.com/2021/06/11/samsung-galaxy-z-fold-3-flip-3-launching-august-27th/",
    "will come running": "https://www.techradar.com/news/wearos-is-finally-getting-an-update-that-might-make-its-smartwatches-good-again",
    "slightly bigger": "https://www.techradar.com/news/samsung-galaxy-watch-4-and-active-4-likely-to-land-soon",
    "heard rumors": "https://www.techradar.com/news/samsung-galaxy-watch-active-4-could-be-a-very-powerful-smartwatch",
    "support for the S Pen stylus": "https://www.techradar.com/news/the-samsung-galaxy-z-fold-3-might-finally-add-s-pen-support-to-the-foldable",
    "sporting a new two-tone design": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-could-take-design-cues-from-the-pixel"
  }
}