{
  "source": "https://www.techradar.com/news/modders-rejoice-starfield-will-be-just-as-moddable-as-skyrim",
  "title": "Modders, rejoice! Starfield will be just as moddable as Skyrim",
  "category": "gaming",
  "updated": "2021-11-11T10:21:52Z",
  "author": "gerald-lynch",
  "summary": "Creation Engine 2 will have plenty of tools for modders",
  "article": [
    "Starfield, the next big open-world RPG from the makers of The Elder Scrolls V: Skyrim, will be compatible with mods.",
    "Bethesda Game Studios boss Todd Howard confirmed the news during a Reddit AMA, revealing that despite the game moving to an all new engine from the studio’s previous titles, Starfield will offer the same deep mod support as previous titles from the developer.",
    "\"Our plan is to have full mod support like our previous games. Our modding community has been with us for 20 years. We love what they do and hope to see more make a career out of it,\" said Howard, referencing the numerous mod makers who have gone on to take full time jobs at Bethesda.",
    "But don’t expect an immediate influx of mods when Starfield launches on November 11, 2022. With the game running on the new Creation Engine 2, even the most accomplished of modders will have to get their heads around a whole new toolset first.",
    "It’s no surprise that Starfield will support mods. Bethesda’s commitment to its hardcore modding community has paid dividends over the past two decades, with the longevity and popularity of its titles hugely extended by the creations of its community members.",
    "For instance, today marks the 10th anniversary of Skyrim, being celebrated with yet another re-release. There’s no way that title would have remained as beloved and played were it not for the thousands of mods made for it that over the years have added new features and updated the visuals and mechanics for modern systems and gamers.",
    "Bethesda will be hoping that mod support for Starfield will have the same effect for its sci-fi epic as its fantasy adventures. And the company has done well in recent years to make sure its entire audience can enjoy tapping into the modding scene, with Xbox and PlayStation consoles now also supporting a modest (if growing) number of mods for existing Bethesda games. However, it should be noted that Starfield will not be coming to PS5."
  ],
  "headers": {
    "4": "Analysis: The long game"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Reddit AMA": "https://www.reddit.com/r/IAmA/comments/qr1f5c/hi_im_todd_howard_game_director_and_executive/hk3xl24/?context=3",
    "Starfield will not be coming to PS5": "https://www.techradar.com/news/starfield-gets-a-november-2022-release-date-and-isnt-coming-to-ps5"
  }
}