{
  "source": "https://www.techradar.com/news/many-workers-would-accept-a-pay-cut-for-remote-working",
  "title": "Many employees would accept a pay cut to work from home",
  "category": "computing",
  "updated": "2021-01-07T12:45:46Z",
  "author": "barclay-ballard",
  "summary": "Three-quarters of survey respondents would accept a pay cut",
  "article": [
    "A new survey of 1,000 UK-based office workers has found that a significant majority would be willing to accept a pay cut if it meant they could work from home all of the time. The findings, which were collected and compiled by OnePoll and Citrix, suggest that the coronavirus pandemic has had a huge impact on workplace attitudes.",
    "The research found that 75% of UK office workers would accept, or have accepted, a pay cut in exchange for a fully remote role.",
    "On average, respondents said they would be willing to accept a 14% pay cut for the opportunity of working remotely, which would work out at just over £4,000 per year based on the average UK salary.",
    "Looking at the survey results in more detail, it seems that those aged between 45 and 54 were prepared to make the largest salary sacrifice, while the over-55s were the least willing, with 36% of this age group stating that they would not accept any pay cut for the opportunity to work remotely.",
    "“We’re now in a world where employees have seen the potential that remote working holds to improve their work/life balance – so much so that they’re willing to forgo a significant portion of their salaries to achieve this on a permanent basis,” Darren Fields, Regional Vice President for the UK & Ireland at Citrix, said.",
    "“Technology allows us to take control of our working lives in a way we’ve never been able to before. Thankfully, those wishing to spend more time working remotely are no longer burdened by outdated cultures and stigmas.",
    "As the coronavirus pandemic began sweeping across the globe in 2020, businesses had to rapidly make arrangements to maintain employee safety while still keeping operations going. In most cases, this meant a relaxation of work from home rules, with video conferencing tools and other digital solutions making up for lost in-person interactions.",
    "It will be interesting to observe if the remote working trend persists once countries begin to get a handle on the pandemic later this year."
  ],
  "headers": {
    "3": "Worth paying for"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}