{
  "source": "https://www.techradar.com/news/zoom-is-readying-an-all-in-one-platform-for-virtual-events",
  "title": "Zoom is readying an all-in-one platform for virtual events",
  "category": "computing",
  "updated": "2021-05-19T21:23:33Z",
  "author": "anthony-spadafora",
  "summary": "Zoom Events is launching later this summer",
  "article": [
    "Even as organizations prepare to return to the office using a hybrid working model, Zoom believes that virtual events are here to stay which is why the company behind the popular video conferencing software has announced its new all-in-one platform Zoom Events.",
    "According to a recent global study conducted by Zoom, 80 percent of US respondents agreed that everything will continue to have a virtual element once the pandemic is finally behind us with 52 percent of those surveyed planning to enjoy events both in-person and virtually.",
    "When Zoom Events launches this summer, the all-in-one virtual event platform will combine the reliability and scalability of Zoom Meetings, Chat and Video Webinars into one comprehensive solution for event organizers and participants.",
    "Zoom Events aims to be the go to virtual event platform for both large and small businesses. For instance, large organizations may use the platform to manage and host internal events such as all-hands meetings and sales summits as well as external events like user or developer conferences.",
    "At the same time though, smaller businesses and entrepreneurs that have been using OnZoom to create, host and monetize events including fitness and cooking classes, theatrical presentations and more will also be able to use Zoom Events too as OnZoom will be rebranded and folded into Zoom's new all-in-one platform.",
    "Chief product officer at Zoom, Oded Gal explained in a press release how the hybrid model for events is here to stay, saying:",
    "“It’s an exciting time to be at Zoom where the pace of innovation continues to accelerate. We know that people are looking for flexibility in how they attend events in the future. The hybrid model is here to stay, and Zoom Events is a perfect solution for our customers who are looking to produce and host customer, company, and public events with an easy, yet powerful solution. This is another way we’re helping customers scale to meet consumer demands and the evolving virtual and hybrid landscape.”",
    "We'll likely hear more about Zoom Events and the features the platform will offer once we get closer to its launch later this summer."
  ],
  "headers": {
    "3": "Zoom Events"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "global study": "https://zoom.us/docs/en-us/future-of-video-conferencing.html",
    "virtual event platform": "https://www.techradar.com/best/best-virtual-event-platforms",
    "developer conferences": "https://www.techradar.com/news/top-tech-conferences-the-ultimate-tech-events-and-show-guide",
    "OnZoom": "https://www.techradar.com/news/zoom-wants-to-become-the-airbnb-of-virtual-events-classes-and-concerts",
    "press release": "https://www.globenewswire.com/news-release/2021/05/19/2232580/0/en/Zoom-Announces-Zoom-Events-Platform-for-Virtual-Experiences.html"
  }
}