{
  "source": "https://www.techradar.com/news/one-of-the-apple-watchs-slickest-features-isnt-working-on-the-iphone-13-yet",
  "title": "One of the Apple Watch’s slickest features isn’t working on the iPhone 13 yet",
  "category": "wearables",
  "updated": "2021-09-27T09:47:05Z",
  "author": "henry-st-leger",
  "summary": "iPhone 13 upgrades won’t feel necessary until Apple irons out the kinks",
  "article": [
    "Any Apple diehards looking forward to using their Apple Watch to unlock their shiny new iPhone 13 may be out of luck – as it sounds like the latest Apple smartphone range is causing users trouble.",
    "The Unlock with Apple Watch feature allows you to tap your smartwatch on your iPhone, accessing the handset without needing to remember your passcode, or keep your face visible. But a number of Reddit users on the r/AppleWatch forum have reported similar issues using their Apple smartwatches to gain access to the iPhone 13.",
    "While the problem doesn’t prevent them using their passcode, or even Face ID, the handy feature is still being missed – and seems to still be working on older iPhone models.",
    "Original poster u/ Monzilla88 wrote that “Whenever I try to enable unlock with Apple Watch on my phone I get an error saying ‘Unable to communicate with Apple Watch’.”",
    "While a number of comments suggest a hard rest of your new iPhone solves the issue, it seems not to have worked for others. A software fix is incoming, but there’s no date confirmed, meaning anyone burdened with various pieces of Apple hardware may have to wait not only days, but possibly weeks for the feature to function.",
    "Apple introduced ‘Unlock with Apple Watch’ in response to changing user habits, with Face ID proving more difficult to utilise in public spaces when large swathes of the populace are wearing face masks. Its support page also makes it clear that the feature means you won’t have to take off your sunglasses either.",
    "The feature came in with the iOS 14.5 update released in April 2021, and has been carried over to iOS 15, which launched alongside the new iPhone range.",
    "We don’t expect this issue will affect enough users to be a dealbreaker for those upgrading to the iPhone 13 – especially since unlocking via passcodes or Face ID still provides a decent amount of options.",
    "However, this issue – and any other issues like it – may need time to be resolved, as Apple figures out what software fixes are most urgent and then rolling them out in a single update in the near future.",
    "And given how beloved the new iOS 15 operating system seems to be, and the lack of Apple Watch unlocking issues on the iPhone X, iPhone 11 and iPhone 12 ranges, there’s not necessarily a huge reason to upgrade if you’re currently sporting an Apple phone and an Apple smartwatch already."
  ],
  "headers": {
    "5": "Analysis: a frustration, but likely a fixable one"
  },
  "links": {
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "r/AppleWatch": "https://www.reddit.com/r/AppleWatch/comments/puglid/unlock_with_apple_watch_not_working_unable_to/",
    "won’t have to take off your sunglasses either": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1439800973686490600&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT212208",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "how beloved the new iOS 15 operating system seems to be": "https://www.techradar.com/news/apple-iphone-users-are-loving-the-ios-15-update"
  }
}