{
  "source": "https://www.techradar.com/news/specializeds-super-light-e-bike-can-carry-twice-its-own-weight-in-cargo",
  "title": "Specialized's super light new e-bike can carry 1.6 times its own weight in cargo",
  "category": "fitness",
  "updated": "2021-04-06T09:50:33Z",
  "author": "cat-ellis",
  "summary": "Thinking of ditching the car?",
  "article": [
    "Specialized has launched a new electric bike that's capable of carrying 1.6 times its own weight in cargo. The Specialized Como SL (Super Light) 4.0 tips the scales at 21.5kg, while the Como SL 5.0 weighs 22kg. Both bikes have a luggage capacity of 35kg.",
    "If you're trying to use your car less (or don't own one at all), cargo e-bikes can be a good alternative for chores like grocery shopping, allowing you to carry heavy loads without breaking a sweat.",
    "The downside is that many such bikes tend to be heavy. A conventional road e-bike like the Ribble Hybrid AL e might weigh just 14kg, but a similarly priced cargo bike can easily weigh twice as much due to its more robust frame and the more powerful motor and battery needed to carry heavy loads.",
    "That's not the case with the two new Como SL bikes, which are capable workhorses, yet surprisingly lightweight. Both bikes can handle two panniers weighing 20kg in total at the rear, while the removable front basket can hold a further 15kg.",
    "Whether you opt for the 4.0 or 5.0, the Como SL is a bike built for practicality first and foremost, and Specialized's choice of components reveal a design that should be comfortable and convenient even for inexperienced cyclists.",
    "Like the Islabikes eJanis we reviewed recently, the Como SL has a step-through frame that makes it a good choice for cycling in everyday clothes, and for anyone who's perhaps not as limber as they once were due to age or injury.",
    "Its belt drive requires much less maintenance than a chain (no oiling and re-tensioning necessary), and cables are integrated to help avoid damage. It's worth noting that belt drives aren't suitable for off-road riding – if you're planning a bikepacking adventure on loose or wet terrain, you'll be better served by a more robust cargo bike like the Rad Power Radwagon – but the Como SL is equipped with fenders as standard to deflect water and dirt.",
    "The bike's internal battery has a range of 62 miles, and the optional range extender (essentially an extra battery pack) gives you an additional 31 miles, making it suitable for a whole week of chores, or a weekend of casual cruising.",
    "As with any e-bike, the range you can achieve in real life will depend on how you manage the power assistance as you ride. Unlike some e-bikes, which only offer a single power setting, the Como SL has three (Eco, Sport and Turbo) that you can switch between depending on how tough the hills are getting, and how long you're planning to ride.",
    "The Como SL is available now from Specialized, starting at £3,500 (about $4,800 / AU$6,400). We hope to put it to the test soon, and will bring you a full review when we do."
  ],
  "headers": {
    "4": "Light and easy"
  },
  "links": {
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "Ribble Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "cargo bike": "https://www.techradar.com/news/would-you-trade-in-your-car-for-this-e-bike",
    "Islabikes eJanis": "https://www.techradar.com/reviews/islabikes-ejanis",
    "Rad Power Radwagon": "https://www.techradar.com/news/would-you-trade-in-your-car-for-this-e-bike",
    "available now from Specialized": "https://www.specialized.com/gb/en/turbo-como-sl"
  }
}