{
  "source": "https://www.techradar.com/news/intels-flagship-gaming-gpu-may-not-trouble-nvidia-or-amd-until-2022",
  "title": "Intel’s flagship gaming GPU may not trouble Nvidia or AMD until 2022",
  "category": "computing",
  "updated": "2021-05-10T12:52:20Z",
  "author": "darren-allan",
  "summary": "DG2 may not be just around the corner after all",
  "article": [
    "Intel’s high-end gaming graphics card may not be out until much later this year – or even 2022 for the flagship model – according to the latest from the GPU grapevine.",
    "Previous rumors had indicated that Intel might be targeting an end of 2021 launch for the Xe HPG (high-performance gaming) card, but then just last week an Intel employee suggested that the GPU (codenamed DG2) was ‘right around the corner’, hinting at a more imminent launch, perhaps.",
    "However, fresh word from well-known leaker Igor Wallossek (of Igor’s Lab fame) is that his sources believe Intel won’t start manufacturing the lower-powered DG2 GPUs until November or even December – so not until the very end of 2021 – with the higher-tier offerings not being made until early 2022 (January or February). Those will be the mobile GPUs, too, according to the report, which are apparently being prioritized over the desktop graphics cards.",
    "This would mean that Intel’s flagship gaming graphics card (the one which will supposedly be loaded with 512 Execution Units or EUs, and could outdo Nvidia’s RTX 3070) might not be available until the spring of 2022 at the earliest if manufacturing is theoretically only going to start in February. And the desktop version might be a bit further out still, or that seems to be the suggestion...",
    "This sort of timeframe – or some kind of late 2021 launch as the rumor mill has previously held – does seem a lot more likely than Xe HPG cards turning up any time soon. Remember that not only has Intel got to nail the hardware – which has only relatively recently started undergoing testing – but the company has to get the software and drivers down as well. Of course, first impressions will be hugely important as Intel tries to break into the GPU market held by Nvidia and AMD, so there’s no room for missteps on either front.",
    "Igor also provided some spec details about the mobile versions of Intel’s DG2, and the top-end model for laptops with 512 EUs will purportedly be clocked at 1100MHz with boost to 1800MHz, backed with 16GB of VRAM and a 256-bit bus (with 100W power usage). For comparison, the desktop version of the 512 EUs flagship is expected to clock at speeds of up to 2.2GHz, with a TDP extending towards 275W, but apply some heavy pinches of condiments all-round, naturally.",
    "Lower down the mobile range, Igor believes that 12GB, 8GB and 4GB memory configurations will be used, and the mid-range 256 EUs laptop card will boost up to 1400MHz.",
    "Via TechSpot"
  ],
  "headers": {
    "4": "First impressions"
  },
  "links": {
    "Intel’s high-end gaming graphics card": "https://www.techradar.com/news/intels-high-end-gaming-gpu-possibly-spotted-in-testing-hinting-at-a-2021-debut",
    "Xe HPG": "https://www.techradar.com/news/intel-xe-hpg-gaming-graphics-card-could-beat-nvidia-and-amds-best-in-one-key-area",
    "Intel employee suggested that the GPU": "https://www.techradar.com/news/intels-new-gaming-graphics-card-is-right-around-the-corner",
    "Igor’s Lab": "https://www.igorslab.de/en/exclusive-intels-dg2-for-mobile-and-desktop-xe-goes-into-its-second-phase/",
    "desktop graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "could outdo Nvidia’s RTX 3070": "https://www.techradar.com/news/intel-xe-high-end-gaming-gpu-could-be-faster-than-nvidias-rtx-3070",
    "expected to clock at speeds of up to 2.2GHz": "https://www.techradar.com/news/intel-xe-high-end-gaming-gpu-could-be-faster-than-nvidias-rtx-3070",
    "TechSpot": "https://www.techspot.com/news/89601-intel-xe-dg2-gpus-could-around-corner-or.html"
  }
}