{
  "source": "https://www.techradar.com/news/free-guy-did-nothing-for-me-because-i-am-the-enemy-of-fun",
  "title": "Free Guy did nothing for me, because I am the enemy of fun",
  "category": "entertainment",
  "updated": "2021-10-16T12:00:29Z",
  "author": "samuel-roberts",
  "summary": "Opinion: I'm glad you enjoyed Free Guy",
  "article": [
    "Spoilers follow for Free Guy.",
    "I'm not a Ted Lasso guy. I gave it four episodes, and I didn't click with it. I didn't make a big deal about it, because it was so obvious to me that the show's relentless, uncomplicated optimism was powering a lot of people through the pandemic. Who was I to take that from them, even if I didn't laugh at a single joke or have any inch of my cold heart warmed by the sight of Ted making biscuits?",
    "Just because I pull a face like someone farted every time someone tweets 'Trent Crimm, The Independent', it doesn't mean I'm coming over to your house to cancel your Apple TV Plus subscription. Although, if I could, I would at least consider doing so.",
    "I get the impression people have the same fuzzy feeling towards Free Guy, Shawn Levy's video game-set movie. It's one of the few films that genuinely took off at the box office this year – which perhaps hints at a future where video game movies might step up to the plate to succeed comic book films. That, in theory, isn't too horrible to me, as long as they're better than this one.",
    "Unlike Ted Lasso, I found this to be a much more cynical source of optimism and feel-good moments.",
    "It's a film about an NPC called Guy living a normal, cheerful life inside a Fortnite/GTA hybrid game called Free City. He essentially gains sentience within this simulation, after falling in love with Jodie Comer's character, Millie, a developer whose code was stolen to make Free City.",
    "When confronted by the truth that he's not a real person but a character living in a game, Guy goes through an existential crisis, before discovering his own self-worth and saving the digital denizens of Free City from being deleted. His real-life creators, played by Comer and Joe Keery, then build a virtual paradise for Guy and the other NPCs to live inside.",
    "Generously, the film hit Disney Plus in the UK earlier this month, and I used that as an opportunity to check it out. I didn't like it at all. But unlike Ted Lasso, which is (allegedly) built on sincere sentimentality, Free Guy just struck me as a kid-friendly version of Ready Player One that adults were more prepared to like.",
    "This film has drawn praise for being more game literate than Hollywood productions typically are, which is a low bar. I didn't love the game side of things in Free Guy – Joe Keery's character, Keys, is very concerned about selling out for a guy who's chosen to work for a major developer ran by an asshole (played by Taika Waititi).",
    "\"I'm just saying we could...make an original game,\" Keys tells Antwan, after his boss goes back on a promise to port over players' old characters from Free City 1 into Free City 2. The movie establishes that the new game is launching on the following Monday – so making a new game would throw away years and tens of millions in work, no matter how bad the finished product is. Don't you know anything about how games are made, Keys?",
    "That was daft, but I get why the filmmakers did it: people watching this don't really care about how games are made, they just need easy dramatic concepts to understand. But that's where it's separated from something like Apple TV's Mythic Quest, which is fanciful about games development, but feels more tuned in to how modern games are actually made and how they play.",
    "The film ends with Free City 2 being a massive failure. Instead, all the citizens of Free City are now living in a new and more popular game where people just watch the characters interact, rather than shooting anyone, made by Keys and Millie. It's their dream of a game called Life Itself come true.",
    "Well done, team, you've just invented a boring game that few people would actually play – this also suggests shooting people is some kind of morality issue in online games, when microtransactions and the way free-to-play games waste your time are arguably more worthwhile things to take aim at.",
    "\"Who'd have thought that so many people would want to watch video game characters instead of shoot at them?\" asks one character. Oh, give me a break. I regret to inform you that shooting NPCs and hijacking cars are the fun parts of playing a game like GTA Online.",
    "\"IPs and sequels, that is want people want,\" says Waititi's game mogul Antwan, firmly establishing him as the film's villain. It's bold of Free Guy to suggest that the idea of making a buggy and creatively bankrupt Free City sequel is selling out – especially when the film sells out itself in its final battle.",
    "You know the bit I mean. There's a lightsaber, the John Williams, Star Wars theme, Captain America's shield, and a Chris Evans cameo. It's the part where my soul left my body.",
    "It's been slammed on social media already, which generated plenty of debate:",
    "It's true, this sort of licensed paraphernalia is very much part of modern gaming, with everyone from Ariana Grande to Thanos having made the crossover into Fortnite. But for whatever reason, I just hated this moment. It didn't so much galvanize my enjoyment of Marvel and Star Wars – I like both a great deal – as much as make me embarrassed for being too invested in those things.",
    "Even if you're a fan, your standards should be higher than having the pleasure center of your brain jolted with the lowest hanging fruit. What would they actually have done in this moment if the movie wasn't a Disney production?",
    "Still, the whole 'not selling out' thing isn't really the film's main message – it's firmly in second place to the idea that anyone can be a hero and help change the status quo against impossible odds. This is mirrored by Guy in the game, and Millie and Keys with their dream game in the real world, which is elegantly done. The Star Wars and Marvel references just mark the worst creative choices of this movie, to me.",
    "Free Guy made me think more about The Lego Movie than anything else, and how that tackles a similar theme. In that film, the main character, Emmet, is also an everyman who learns he's extraordinary in a 'fake' world controlled by humans. And that too features a ton of product placement and characters from other franchises.",
    "But it's all about the wrapping. And there's just something cynical about the intersection of pop culture that Free Guy has planted its flag at – perhaps there's a layer of magic I lost by not seeing it in the cinema. But in The Lego Movie, the themes and characterization just landed perfectly for me, without all the other stuff being distracting. Here, the distractions became the point.",
    "There's a fine line between the kind of optimism we like in our pop culture and that we don't like – after all, Ted Lasso and Free Guy are aiming for a similar thing. They're meant to be heartwarming and life-affirming but also entertaining.",
    "Unfortunately, this is a video game movie made for people who don't actually like them, and I just responded badly to its manufactured positivity, which barely resembled the real thing to me. That said, I hope you enjoyed it, though I am mostly saying that to avoid getting drive-by dunks on social media.",
    "Still: give me a whole film of Channing Tatum acting out dance emotes in real life. I laughed at that more than anything else in Free Guy.",
    "Free Guy is available now on Disney Plus UK."
  ],
  "headers": {
    "8": "Game of life",
    "14": "Selling out"
  },
  "links": {
    "Free Guy": "https://www.techradar.com/news/my-mom-accidentally-went-to-see-free-guy-with-her-80-year-old-sister-heres-her-review"
  }
}