{
  "source": "https://www.techradar.com/news/iphone-13-release-date-may-be-sooner-than-expected-but-could-an-event-be-canceled",
  "title": "iPhone 13 release date may be sooner than expected – but could an event be canceled?",
  "category": "phones",
  "updated": "2021-08-18T08:48:23Z",
  "author": "tom-bedford",
  "summary": "October? Barely know 'er",
  "article": [
    "There's been some question as to when the iPhone 13 launch, and therefore release date, will be – in 2020 we saw an October unveiling, but in the deep distant past of 2019 and even further back in time, September used to be iPhone month.",
    "We're starting to hear rumors weighing in on what could happen this year. As reported by MyDrivers, analyst Daniel Ives thinks the iPhone 13 launch date will be the third week of September – since the company always opts for a Tuesday for its hardware parties, that'd be September 14.",
    "This isn't the first time Ives has made this assertion, though since then Ives has made some other predictions that haven't paid off. Also, this new report includes a tiny bit more information on the iPhones.",
    "Ives adds that the two Pro-level iPhone 13s will come with 1TB storage options, double the maximum currently available on iPhones, which will be useful for professionals as well as people with really big WhatsApp backups.",
    "Going by precedent, a September 14 launch date could see a release of the phones on September 21, or maybe we'll see some of the handsets come on that date, and some a week or two later.",
    "In 2020, though the iPhone 12 launched later than we expected, we weren't left hanging. In September Apple held an earlier event that didn't bring the iPhones, but let the company show off the iPad 10.2, iPad Air 4, Apple Watch SE, Apple Watch 6, a new fitness subscription service and a few other bits and bobs.",
    "This meant Apple could stagger these product launches, so it didn't need to rush through devices at the iPhone launch (that's where, in previous years, we saw the new tablets and smartwatches), which in turn resulted in even more tech than we'd normally get.",
    "If the iPhone 13 launch is in September this year though, it sounds unlikely there would be a warm-up event a month prior – because it would have already happened. Unless TechRadar slept in and missed it, we're pretty sure no such unveiling live stream took place.",
    "To read even further into this news, that makes it sound like the iPhone 13 could launch alongside just one other tablet and smartwatch – presumably the iPad 10.2 (2021) and Apple Watch 7 – as there just wouldn't be the time for the company to explore four smartphones, two watches and two tablets.",
    "It's likely, then, that you shouldn't hold your breath for an Apple Watch SE 2 or iPad Air 5 to come along any time soon.",
    "Maybe we'll be proven wrong in this prediction, and the September launch event will bring all the tech in the world. But we're probably not."
  ],
  "headers": {
    "5": "Analysis: does this mean no double-event party?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "MyDrivers": "https://news.mydrivers.com/1/776/776955.htm",
    "Ives has made this assertion": "https://www.techradar.com/news/iphone-13-range-likely-to-land-in-september",
    "made some other predictions that haven't paid off": "https://www.techradar.com/news/new-macbook-pro-could-appear-at-wwdc-2021-sporting-m2-chip",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPad 10.2": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "iPad 10.2 (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Apple Watch SE 2": "https://www.techradar.com/news/apple-watch-se-2",
    "iPad Air 5": "https://www.techradar.com/news/ipad-air-5"
  }
}