{
  "source": "https://www.techradar.com/news/millions-of-users-still-havent-updated-from-windows-7",
  "title": "Millions of users still haven't updated from Windows 7",
  "category": "computing",
  "updated": "2021-01-01T18:06:13Z",
  "author": "mayank-sharma",
  "summary": "Windows 7 could pose a major security risk for millions",
  "article": [
    "If reports are to be believed, several million Windows 7 users haven’t upgraded their machines to a newer version, even after almost a year of Microsoft retiring the decade old operating system.",
    "Microsoft stopped delivering security updates to WIndows 7 installations on January 14, 2020. The move was quickly followed by many third-party vendors, who dropped support for the OS soon after Microsoft’s announcement.",
    "Now, as we approach the first anniversary of the end-of-support, prolific Windows author Ed Bott wrangled up some data to deduce that while the number of Windows 7 installations have certainly gone down in the past twelve months, there are still over 100 million PCs that are still running Windows 7. More worryingly Bott thinks “that [the actual] number could be significantly higher.”",
    "Last year Bott consulted some analytics experts and came to the conclusion that roughly 200 million PCs worldwide would continue running Windows 7 even after Microsoft stopped sending security updates.",
    "His latest estimate builds on top of that data, after analyzing various metrics, such as the United States Government Digital Analytics program. One of the parameters tracked by the program is the number of visits from Windows PCs.",
    "Comparing the figures between December 2019 and December 2020, Bott notes that the number of machines running Windows 7 has gone down from 18.9% to 8.5%. The numbers from NetMarketShare, which tracks web usage, show a similar drop with Windows 7 usage down from 31.2% to 21.7%.",
    "Bott agrees that while “turning those percentages into whole numbers isn't a matter of simple division”, his 100 million estimate is the result of correlation between the number of Windows 7 machines still accessing the Internet and his earlier calculations.",
    "While some of these machines could be enrolled with the Windows 7 Extended Security Updates (ESU) program, a majority are unprotected installations that are exposing themselves to all kinds of danger lurking on the Internet.",
    "Via: ZDNet"
  ],
  "headers": {
    "3": "Not simple maths"
  },
  "links": {
    "Windows 7": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-7-622923/review",
    "Microsoft retiring": "https://www.techradar.com/news/windows-7-end-of-life-what-your-business-needs-to-know",
    "Windows 7 Extended Security Updates": "https://www.techradar.com/news/microsoft-is-killing-off-windows-7-but-microsoft-security-essentials-lives-on",
    "ZDNet": "https://www.zdnet.com/article/windows-7-a-year-after-the-end-of-support-deadline-millions-choose-not-to-upgrade/"
  }
}