{
  "source": "https://www.techradar.com/news/google-chrome-will-transform-how-you-work-with-windows",
  "title": "Google Chrome is about to transform how you work with multiple windows",
  "category": "computing",
  "updated": "2021-03-17T17:05:56Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Tab management is one thing – next up is window management",
  "article": [
    "Google Chrome and Microsoft Edge will soon offer new features that make it easier to manage multiple browser windows at once.",
    "The arrival of tabs in web browsers revolutionized the way we surf the web. The ability to open links in a new tab rather than a new window helps to dramatically reduced clutter on the desktop, although it also introduced the problem of managing large number of tabs. If you ware one of those people who uses a combination of several browser windows and multiple tabs within each, there's some great news for you.",
    "Both Microsoft Edge and Google Chrome are gaining new window management options that will help to make it easier to identify and navigate multiple browser windows. The feature works in the same way in both browsers, and it's something that will be welcomed by power users and the hitherto disorganized alike.",
    "The new 'window naming' functionality is coming in Edge 90 and Chrome 90. It's currently available for testing the beta versions of these browser builds and is enabled by default without the need to tinker with hidden settings. It’s a feature that works in much the same way as tab management, applying many of the same ideas to browser window.",
    "The idea is pretty simple. Imagine you are researching a project for work and have a browser window open with multiple tabs related to this. You may also have a widow open with tab for a second project, perhaps a third or fourth for personal browsing. Keeping these windows organized and identifiable is tricky, and that's precisely what windows naming aims to help with.",
    "As you would probably guess from the name of the feature, it lets you assigned names or labels to browser windows. These can be applied by selecting Settings > More tools > Name window or by right clicking the edge of a browser window and select the Name this window option. The name you assign to a window will be displayed as a popup when you hover your mouse over the Windows taskbar button, or the macOS dock icon.",
    "Providing you have the option to continue from where you left off enabled, when you close your browser, the names you have configured will be saved, and loaded next time you fire up the app.",
    "The feature had original been planned for Chrome 88, but problems with the design held things up slightly. That Edge should follow suit is a direct result of being based on the same Chromium engine as Google's web browser.",
    "Via Techdows"
  ],
  "headers": {
    "5": "Under new management"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "Techdows": "https://techdows.com/2021/03/chrome-90-and-microsoft-edge-getting-a-window-management-feature.html"
  }
}