{
  "source": "https://www.techradar.com/news/samsung-lg-vizio-and-roku-smart-tvs-are-losing-a-very-important-movie-app",
  "title": "Samsung, LG, Vizio and Roku smart TVs are losing a very important movie app",
  "category": "televisions",
  "updated": "2021-04-13T09:31:17Z",
  "author": "henry-st-leger",
  "summary": "Google Play Movies & TV is no more",
  "article": [
    "Google Play Movies & TV is no more, with the tech giant announcing that users of its ubiquitous movie rental and purchase smart TV app will be migrated over to YouTube instead (via The Verge).",
    "As of June 15, access to the Google Play Movies & TV app will be shuttered across smart TVs carrying the Samsung, LG or Vizio branding – with Roku streaming devices affected too.",
    "A blog post for the announcement states that \"Starting 6/15/2021, the Google Play Movies & TV app will no longer be available on Roku, Samsung, LG, and Vizio smart TVs. The YouTube app will be your new home for movies and shows. Just log in with your Google account in the YouTube app today, you’ll have access to all of your past purchases, and will be able to browse, purchase, and rent new content.\"",
    "That last point is crucial, meaning you won't be losing access to films and TV series you've already spent some cash on – and it's worth noting that any existing credit on your Google Play account will be transferred over too. You Watchlist won't make the cut, but Google invites users to make use of YouTube's Playlist functions instead.",
    "Google hinted at the incoming move last year, when it made all Google Play Movies & TV purchases available on the YouTube app – though some temporary 480p streaming caps made it a less-than-ideal place to watch your favorite films for much of 2020.",
    "There's no word on the mobile or tablet iteration of the app, though we expect it to follow suit in the coming months.",
    "Google's movie rental / purchase app is, though, just the latest casualty of the company's complex network of competing services.",
    "Back in December 2020, the Google Play Music service was shut down to drive more users towards YouTube Music – and while users could transfer files and purchases across to the YouTube platform, it shows how the awkward coexistence of Google and YouTube branded services was never meant to last.",
    "In the short term, having to shift between services may be a bit of a headache, as it always is when a much-used app is shut down. However, it will mean Google can focus its efforts on a single movie and TV rental platform going forward, which can only be a good thing."
  ],
  "headers": {
    "6": "Service synergy"
  },
  "links": {
    "The Verge": "https://www.theverge.com/2021/4/12/22380593/google-play-movies-tv-app-smart-tvs-roku-samsung-lg-vizio-youtube-support",
    "blog post": "https://support.google.com/googleplay/thread/102498448?hl=en",
    "some temporary 480p streaming caps": "https://www.techradar.com/news/youtube-and-game-downloads-add-to-growing-list-of-throttled-services",
    "the Google Play Music service was shut down": "https://www.techradar.com/news/google-play-music-will-shutdown-completely-in-december-heres-how-to-save-your-music"
  }
}