{
  "source": "https://www.techradar.com/news/a-second-james-bond-themed-leica-q2-has-leaked-and-it-looks-particularly-dashing",
  "title": "A second James Bond-themed Leica Q2 has leaked – and it looks particularly dashing",
  "category": "cameras",
  "updated": "2021-02-09T11:32:34Z",
  "author": "mark-wilson",
  "summary": "Bring it back in one piece...",
  "article": [
    "A second James Bond-themed version of the Leica Q2 full-frame camera has just leaked ahead of its official announcement – and this one looks much smarter than the original Q2 007 edition we saw rumored last year.",
    "The model will apparently be called the Daniel Craig x Greg Williams edition and the images, which were leaked by the ever-reliable Nokishita and picked up by Leica Rumors, show a minimalist Leica Q2 with subtle gold or brass highlights.",
    "Of course, the design isn't radically different from the standard Leica Q2, but it's arguably an improvement on the James Bond 007 edition of the camera we saw leaked in September 2020 (below). That version brought a slightly tacky 'gun barrel' lens cap and a divisive racing green body.",
    "Both of the unconfirmed cameras have likely been designed to celebrate the release of No Time To Die – but with that film's release now pushed back to October 8 2021 (its third delay), it's unclear exactly when we'll see these special edition Leica Q2s.",
    "At least the Q2's classic design doesn't age, unlike the Nokia smartphones used in the film – the Nokia 8.3 5G will be so old by the time we get to see Daniel Craig's final appearance as 007 that rumors have suggested some scenes may even need to be reshot.",
    "While this new Daniel Craig x Greg Williams edition of the Leica Q2 is unlikely to feature in the film itself, Craig himself has been spotted shooting with Leica cameras in the past – so it's likely to be the one the actor sports during his retirement from Bond duty.",
    "If the final version does indeed match these leaked images, it could be the best limited edition Leica Q2 we've seen so far – from the top, those brass or copper markings look particularly classy against the black, weather-sealed body.",
    "Perhaps the only blot is the inclusion of that Daniel Craig x Greg Williams name below the screen – if you're not sure who Williams is, he's the official set photographer for most recent Bond films, including No Time to Die.",
    "Otherwise the Leica Q2 Daniel Craig x Greg Williams edition will function just like a standard Q2 – which means you'll get a 47.3MP full-frame sensor paired with a 28mm f/1.7 lens, a pairing that means it's widely considered as one of Leica's best and most desirable cameras.",
    "Alongside that classic combo, you also get a 3.68-million dot EVF, a 3-inch touchscreen and a magnesium alloy body with tank-like build quality. Naturally, this will all come at a hefty premium – there's been no leaked pricing for the Daniel Craig x Greg Williams edition, but the earlier 007 edition was rumored to cost around €7,000 (around $8,475 / £6,150 / AU$10,960).",
    "This means we'd expect this edition to be in that ballpark too, which is a fair markup on the standard Leica Q2's price tag of $4,995 / £4,250 / $AU7,570. But as Leica Rumors reports, there will likely only be 750 units of the Daniel Craig x Greg Williams edition available worldwide (or perhaps 748, once Daniel and Greg have grabbed theirs)."
  ],
  "headers": {
    "5": "No time to buy"
  },
  "links": {
    "Leica Q2": "https://www.techradar.com/reviews/leica-q2-monochrom",
    "Nokishita": "https://twitter.com/nokishita_c/status/1358918958401744896",
    "Leica Rumors": "https://leicarumors.com/2021/02/08/new-leica-q2-daniel-craig-x-greg-williams-limited-edition-camera-leaked-online.aspx/#more-71587",
    "Nokia 8.3 5G": "https://www.techradar.com/reviews/nokia-83-5g-review",
    "some scenes may even need to be reshot": "https://www.techradar.com/news/no-time-to-die-may-need-reshoots-so-it-can-include-modern-nokia-smartphones"
  }
}