{
  "source": "https://www.techradar.com/news/wwdc-2021-apple-music-spatial-audio-event-set-to-follow-keynote",
  "title": "WWDC 2021: Apple Music Spatial Audio rumored, but never materialized",
  "category": "audio-visual",
  "updated": "2021-06-07T20:56:40Z",
  "author": "olivia-tambini",
  "summary": "A teaser uploaded to Apple Music gave us some false hope",
  "article": [
    "After getting our hopes up earlier in the day for a deep dive Spatial Audio event, Apple never delivered on it, leaving many scratching their heads.",
    "It all started with a teaser video was uploaded to Apple Music for a special event called Introducing Spatial Audio, first reported by MacRumors.",
    "The teaser video has since been removed, but it revealed that an event will take place after the annual WWDC (Worldwide Developer's Conference) at 3PM ET / 12PM PT / 8PM BST on June 7, or 3AM ACT on June 8 in Australia.",
    "But then it never happened.",
    "What we got instead was a tantalizing bit of Spatial Audio news at WWDC: we learned that Spatial Audio support would be coming to tvOS and MacOS and that the AirPods are slated for a whole host of new features this once iOS 15 comes out.",
    "However, a specific event for Spatial Audio, well... it never materialized.",
    "Apple recently announced that Apple Music will be getting Spatial Audio with support for Dolby Atmos, with a release date still to be confirmed.",
    "The immersive sound technology was initially designed for cinema, bringing a sense of height as well as width to soundtracks and effects, making it feel as though sound is coming at you from all angles.",
    "If you have a pair of AirPods or Beats headphones with either the H1 or W1 chip, Apple Music will be able to automatically play Dolby Atmos tracks by default – according to the company, \"thousands\" will be available at launch, with more to follow.",
    "Apple says that it will be constantly adding new Dolby Atmos tracks to the service, as well as curating dedicated playlists to help you find your favorite tracks in the 3D sound format. Albums that are available in Atmos will also have a badge on its detail page, so you should be able to spot them quickly.",
    "This feature was announced alongside Lossless Audio, with both features coming to Apple Music at no extra cost to subscribers. According to Apple, subscribers will \"be able to hear the exact same thing that artists created in the studio\", with Lossless Audio. To begin listening to Lossless Audio, you can turn it on in Settings > Music > Audio Quality, where you'll be able to choose the resolution of your music based on your connection (cellular, Wi-Fi or download).",
    "The Lossless tier starts at CD quality (16 bit / 44.1kHz), and goes up to 24 but / 48 kHz, and can be played natively on Apple devices. And, for audiophiles, there's Hi-Resolution Lossless, which goes all the way up to 24 bit / 192kHz.",
    "Both Spatial Audio and Lossless Audio are expected to launch in June, so it's no big surprise that the company would want to highlight it at this year's WWDC. And, if the official launch coincided with a new AirPods model, Apple will really shake up its audio competitors like Sony, Bose and Sennheiser."
  ],
  "headers": {
    "6": "Cinematic sound"
  },
  "links": {
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "MacRumors": "https://www.macrumors.com/2021/06/06/apple-music-event-june7-after-wwdc/",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Apple Music will be getting Spatial Audio with support for Dolby Atmos": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "Beats headphones": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066"
  }
}