{
  "source": "https://www.techradar.com/news/sex-education-season-3-finally-has-a-release-date-netflix-confirms",
  "title": "Sex Education season 3 finally has a release date, Netflix confirms",
  "category": "entertainment",
  "updated": "2021-06-24T13:52:28Z",
  "author": "samuel-roberts",
  "summary": "The acclaimed British series returns",
  "article": [
    "Netflix has confirmed that Sex Education season 3 is finally releasing on the streaming service on September 17, 2021. The show's return has been a long time coming – season 2 landed back in January 2020, so that's almost two years between installments.",
    "Netflix confirmed the news on Twitter, as per the below. We also got a first look at images from the show's return – take a look:",
    "This is one of several big Netflix shows that'll finally return in late 2021, along with You season 3, The Witcher season 2 and Cobra Kai season 4.",
    "Sex Education season 3 started filming late last year. The cast and crew isolated to make the series safely – it was mentioned by a crew member on Instagram in March 2021 that the show had wrapped filming.",
    "The comedy stars Asa Butterfield, Gillian Anderson, Ncuti Gatwa and Emma Mackey, and has drawn positive notices for its progressive and empathetic depiction of sexuality, as well as its rich character writing.",
    "Netflix hasn't had a bad 2021 so far, when you look at shows like Sweet Tooth and Shadow and Bone – but it definitely feels like it's been a while since we saw some of its big hitters reach the platform on the TV side. That's the impact of the pandemic hitting production last year, really, and isn't something Netflix could control.",
    "But it's vital that these series return in the second half of the year. As the old world slowly returns, streaming habits were always going to change a little – and having popular shows come back in late 2021 reminds people of the value of the service. This year, too, has so far seen Marvel release three series on Disney Plus with relatively little competition.",
    "Later this year, then, Netflix plans to remind us why it's worth paying that monthly fee."
  ],
  "headers": {
    "5": "Analysis: Netflix needs its big hitters back"
  },
  "links": {
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "You season 3": "https://www.techradar.com/news/you-season-3",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Cobra Kai season 4": "https://www.techradar.com/news/cobra-kai-season-4",
    "Sweet Tooth": "https://www.techradar.com/news/sweet-tooth-season-2",
    "Shadow and Bone": "https://www.techradar.com/news/shadow-and-bone-season-2",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}