{
  "source": "https://www.techradar.com/news/pre-ordered-apple-airtags-you-could-get-yours-early",
  "title": "Pre-ordered Apple AirTags? You could get yours early",
  "category": "phones",
  "updated": "2021-04-29T09:04:57Z",
  "author": "hamish-hector",
  "summary": "AirTags are almost here",
  "article": [
    "If you’ve pre-ordered Apple’s AirTags you might be getting them early. People are sharing images of their AirTags ahead of the official release this Friday. There are usually strict delivery restrictions on pre-ordered Apple products, so this is a rare early glimpse at one of its products.",
    "However, we wouldn’t suggest you hold out hope for your own arriving early, we imagine there may now be extra pressure from Apple to ensure no more AirTags to be delivered early.",
    "We were able to get our hands on some ahead of time though, so check out our review of the Apple AirTags if you want to know how they’ll work when yours arrive.",
    "If you haven’t yet heard, AirTags are Apple’s long-awaited tracking chips to rival similar products produced by Tile. Attaching an AirTag to an item and then linking it with your iPhone adds it to the Find My app network. Now, when you lose it you’ll be able to use Bluetooth signals to detect exactly where the AirTag is.",
    "The AirTag relies on other iPhone and iPad users, piggybacking off their devices to alert you and say where your lost item is. If you want to know more, we answer all your questions in our AirTag explainer.",
    "AirTags are available for preorder now selling for $29 / £29 / AU$45 each or a pack of four costs $99 / £99 / AU$149. They release April 30.",
    "Via MacRumors"
  ],
  "headers": {
    "3": "What are Apple AirTags?"
  },
  "links": {
    "Apple’s AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "review of the Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "AirTag explainer": "https://www.techradar.com/how-to/how-do-apples-airtags-work-your-questions-answered",
    "MacRumors": "https://www.macrumors.com/2021/04/28/airtags-arriving-early-to-some-customers/"
  }
}