{
  "source": "https://www.techradar.com/news/google-drive-users-can-now-fully-back-up-their-files-on-apple-m1-macs",
  "title": "Google Drive users can now fully back up their files on Apple M1 Macs",
  "category": "computing",
  "updated": "2021-01-27T14:54:14Z",
  "author": "barclay-ballard",
  "summary": "Full range of Google products will be available on M1 Macs soon",
  "article": [
    "Owners of Apple’s M1 Macs will soon have access to the full range of Google products after the search engine firm announced that it had ironed out the remaining compatibility issues affecting Google Drive Backup and Sync. Google also confirmed that support for Google Drive File Stream will be coming in April.",
    "Backup and Sync works with both Google Drive and Photos but was not available to M1 mac users when the devices launched in November last year. However, a Google Workspace update published earlier this month indicated that this particular issue had been resolved.",
    "“Fixed remaining M1 chip issues that prevented previous versions of Backup and Sync from running for some users,” the update read.",
    "In addition to the availability of Backup and Sync, M1 mac users won’t have too long to wait before they will be able to make use of Drive File Stream, the on-demand cloud service that streams files directly to a user’s device. Google has confirmed that it will be coming to M1 macs in April, albeit under a new name.",
    "Any day now, users of Drive File Stream should start to notice that the cloud service will be listed as \"Google Drive for desktop\". The name change has reportedly already debuted with version 45.0 but appears to be rolling out gradually.",
    "When Apple announced that it would be ditching Intel-produced chips in its new devices in favor of its own in-house processors, there were concerns surrounding potential compatibility issues. While there have been teething problems along the way, app developers are mostly coming up with suitable workarounds to get their solutions working on the new macs.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "Coming soon"
  },
  "links": {
    "M1 Macs": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "read": "https://support.google.com/a/answer/7573023?hl=en&ref_topic=7455083",
    "9to5Google": "https://9to5google.com/2021/01/22/google-drive-file-stream-m1/"
  }
}