{
  "source": "https://www.techradar.com/news/nvidia-rtx-3070-ti-might-come-in-both-8gb-and-16gb-variants",
  "title": "Nvidia RTX 3070 Ti might come in both 8GB and 16GB variants",
  "category": "computing",
  "updated": "2021-03-26T11:58:21Z",
  "author": "jess-weatherbed",
  "summary": "And could be here in a matter of weeks",
  "article": [
    "The Nvidia GeForce RTX 3070 Ti has been popping up in various rumors as far back as the release of the original Ampere graphics cards. The lengthy speculation may soon be over, as the mystery surrounding this GPU's release date, specification and even general existence is starting to lift.",
    "This latest information was provided by established leaker Uniko's Hardware, who claims the Nvidia GeForce RTX 3070 Ti will feature Micron GDDR6X memory clocked at 19 Gbps, and offered in not just the 16GB we initially thought, but also 8GB.",
    "The 16GB of GDDR6 isn't new information as this has been circulating for a while, but the inclusion of an additional 8GB card certainly is. We have yet to see any dual-sided memory SKUs that would give any weight to these claims however, so as with all unofficial leaks, take it with a healthy pinch of salt.",
    "If the Nvidia GeForce RTX 3070 Ti does launch with a 16GB pool of GDDR6 memory, then it'll have more VRAM than all the other Ampere GPUs, save for the RTX 3090 and potentially the unreleased RTX 3080 Ti. It's unclear why Nvidia would opt to supply an 8GB variant of the card at all, but there is a possibility that the RTX 3070 Ti is intended as more of a general replacement for the original RTX 3070 given the small leap in overall power. When word of the RTX 3070 Ti first appeared, we initially assumed this was a planned rival to the AMD Radeon RX 6800, especially as it was initially rumored to have 10GB of VRAM with a 320W TGP (total graphics power), though this is likely no longer the case given recent information.",
    "The NVIDIA GeForce RTX 3070 Ti is currently expected to arrive in May alongside the RTX 3080 Ti, though we don't have any pricing information for the cards. This is yet another GPU that will hit the shelves during the current global shortage, so the chances of actually getting your hands on one will be extremely slim. With any luck Nvidia are working on more solutions to get these graphics cards into the hands of gamers, rather than snapped up by bots and cryptominers.",
    "Via VideoCardz"
  ],
  "headers": {
    "3": "Do we need an RTX 3070 Ti?"
  },
  "links": {
    "Ampere graphics cards": "https://www.techradar.com/news/nvidia-ampere",
    "Uniko's Hardware": "https://twitter.com/unikoshardware/status/1375323061180723200?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1375323061180723200%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwccftech.com%2Fnvidia-geforce-rtx-3070-ti-could-feature-8gb-and-16gb-gddr6x-variants%2F",
    "Nvidia GeForce RTX 3070 Ti": "https://www.techradar.com/news/the-nvidia-rtx-3070-ti-might-actually-release-after-cancellation-rumor",
    "has been circulating for a while": "https://www.techradar.com/news/the-nvidia-rtx-3070-ti-might-actually-release-after-cancellation-rumor",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "unreleased RTX 3080 Ti": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-might-have-just-been-leaked-by-hp",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "AMD Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "current global shortage": "https://www.techradar.com/news/nvidia-rtx-3080-shortage-could-continue-until-q3",
    "VideoCardz": "https://videocardz.com/newz/nvidia-geforce-rtx-3070-ti-could-feature-8gb-and-16gb-gddr6x-variants"
  }
}