{
  "source": "https://www.techradar.com/news/first-sigma-mid-range-zoom-for-sony-aps-c-cameras-incoming",
  "title": "First Sigma mid-range zoom for Sony APS-C cameras incoming?",
  "category": "news",
  "updated": "2021-09-24T12:41:01Z",
  "author": "amy-davies",
  "summary": "An 18-50mm lens from the third-party manufacturer should make an excellent walkabout lens for models like the A6600",
  "article": [
    "We’ve seen a lot of news about lenses for full-frame mirrorless cameras of late, so it’s interesting when something for smaller crop-sensor cameras appears on the horizon.",
    "That’s especially true considering the popularity of models in Sony’s A6000 range, including the A6000 itself and newer cameras like the A6600, A6400 and A6100. These smaller and lighter cameras share the same mount as the full-frame models, but come in at much more consumer-friendly prices, and are loved by a wide range of users, including vloggers and travel snappers.",
    "So we're excited to hear that, if rumors are to be believed. Sigma is about to launch its first mid-range zoom for Sony APS-C in the shape of an 18-50mm f/2.8 DC DN Contemporary lens.",
    "Reliable leaker Nokishita has shared a few speculative features (via Sony Alpha Rumors), which includes 13 elements in 10 groups, a minimum shooting distance of 12.1cm and a filter diameter of 55mm.",
    "With a constant f/2.8 aperture, and a 35mm equivalent focal length of 27-75mm, it would make for an ideal walk around, high-quality 'ordinary' lens well suited to a wide variety of situations, being akin to the classic 24-70 mm f/2.8 type optics that many full-framers are accustomed to.",
    "Weighing in at just 290g (apparently) and with relatively compact measurements of 61.6 x 76.5mm, it’ll likely be a lovely addition to the kit bag of anybody toting one of Sony’s APS-C bodies.",
    "If the rumors about this lens prove to be true, then it’ll mark the first time that Sigma has created a zoom lens for Sony’s APS-C range of models. Hitherto the brand has concentrated on optics for full-frame Alphas, as well as lenses for other manufacturers.",
    "It signals that manufacturers are expecting some demand for versatile, flexible and high-quality lenses that are well-suited to a number of situations.",
    "In short, this is the ideal travel lens, and after a lengthy period during which many of us have been in lockdown to varying degrees, it perhaps also signals some confidence that things are staring to return to normal – both inside the camera industry and out in the wider world.",
    "On top of that, if the build and image quality of the 18-50mm f/2.8 DC DN Contemporary lens is anywhere near Sigma’s 24-70mm f/2.8 DG DN Contemporary lens for full-frame E-mount cameras then we’ll very much be in for a treat – and likely an affordable one at that.",
    "It’ll go up against Sony’s own Sony E 16-55mm f/2.8G lens, but the Sigma version is likely to be launched at a lower price than the manufacturer’s own optic – if it comes soon, expect to see it at the top of the Christmas lists of many a Sony APS-C shooter."
  ],
  "headers": {
    "6": "Analysis: Could this be travel perfection?"
  },
  "links": {
    "a few speculative features": "https://www.sonyalpharumors.com/those-are-the-rumored-sigma-18-50mm-f2-8-dc-dn-contemporary-lens-specs/"
  }
}