{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-phone-sizes-shown-off-in-latest-image-leaks",
  "title": "Samsung Galaxy S22 phone sizes shown off in latest image leaks",
  "category": "phones",
  "updated": "2021-11-28T16:36:16Z",
  "author": "david-nield",
  "summary": "Screen protectors reveal more about these handsets",
  "article": [
    "We've already seen a plethora of leaks around the Samsung Galaxy S22, but we're happy to add another one to the pile: new pictures show off what look to be official screen protectors for all three phones in the range, giving us an idea of their front-facing design and their relative sizes.",
    "These come from prolific and reliable tipster @UniverseIce, so it's more likely than not that they're the real deal. The clues that they give us match up with what we've seen from previous leaks and rumors as well.",
    "The Samsung Galaxy S22 Ultra is clearly the largest of the three smartphones, and takes a more Galaxy Note-like approach to its design, with squared corners – in fact, there has been talk that the S22 Ultra is actually going to adopt the Note moniker this time.",
    "Based on previous rumors, we're expecting the standard Galaxy S22 to have a 6.06-inch screen, the Galaxy S22 Plus to have a 6.55-inch screen, and the Galaxy S22 Ultra to have a 6.81-inch screen. That fits in with these new images that have found their way online.",
    "These screen protectors also confirm that all three models are going to come with punch hole selfie cameras cut out of the front display. As per earlier leaks, under-display front-facing cameras are going to have to wait until the Galaxy S23 update (or perhaps even later than that).",
    "Screen protector accessory leaks like this one aren't the most revealing, but it does mean that we've got more evidence for some of the rumors we've been hearing about these phones. As for a launch date, they're likely to be arriving in February 2022.",
    "We've seen strong showings from Apple and Google in recent months, with both the iPhone 13 and the Pixel 6 impressing us and attracting lots of interest from smartphone buyers – and that means the next Samsung Galaxy S series phones are going to be up against some stiff competition.",
    "Like just about every other company on the planet, Samsung has been affected by the ongoing pandemic over the last 18 months. Add in the global electronic chip shortage and it's no surprise that the Galaxy Note 21 was canceled and the Galaxy S21 FE is appearing later than we expected it to.",
    "With that recent history in mind, it's going to be interesting to see what Samsung is able to offer consumers with the Galaxy S22 range. These phones will of course be faster and better than ever, but just how much better they'll be than their Galaxy S21 equivalents remains to be seen.",
    "It looks very much as though the Galaxy S22 Ultra is going to fill the Note-shaped void in Samsung's 2022 line-up, and it would seem to be the most interesting phone of the three – complete with support for the S Pen stylus and a more advanced rear camera."
  ],
  "headers": {
    "3": "Selfie cameras",
    "6": "Analysis: the Samsung empire strikes back?"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1464557133333397510",
    "been talk": "https://www.techradar.com/news/samsung-galaxy-s22-and-s22-renders-leak-out-hint-at-a-galaxy-note-22-ultra",
    "previous rumors": "https://www.techradar.com/news/samsung-rumored-to-shrink-galaxy-s22-save-best-display-and-glass-for-s22-ultra",
    "earlier leaks": "https://www.techradar.com/news/samsung-galaxy-s22-probably-wont-have-an-under-display-camera",
    "in February 2022": "https://www.techradar.com/news/samsung-galaxy-s22-and-galaxy-s21-fe-launch-and-preorder-dates-leak-out",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "very much as though": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-basically-sounds-like-the-note-21-at-this-point"
  }
}