{
  "source": "https://www.techradar.com/news/new-mint-mobile-free-trial-lets-you-try-one-of-the-best-prepaid-plans-on-the-market",
  "title": "New Mint Mobile free trial lets you try one of the best prepaid plans on the market",
  "category": "phones",
  "updated": "2021-04-12T19:00:16Z",
  "author": "alex-whitelock",
  "summary": "An easier way to try Mint Mobile",
  "article": [
    "Mint Mobile is already one of the best prepaid carriers around right now in our books, with excellent prices, features, and generous helpings of data. However, one feature was conspicuously missing from its site - a free trial.",
    "Well, that's no longer the case it seems, with the service launching a brand new free trial page on its website. As with the prior starter kit (which costs $5, no less), you'll get yourself 7-days of Mint Mobile service with 250MB of 5G data, plus 250 minutes and texts - all with no cost incurred.",
    "To begin your new Mint Mobile free trial, simply check your existing device is compatible, then input your email address. Mint Mobile will then email you directly with the various details you'll need to receive your SIM. Note - you'll need to provide credit card details to be eligible for the Mint Mobile free trial, but you won't be credited unless you choose to carry on your subscription.",
    "We're anticipating this new Mint Mobile free trial operates in the same way as the old starter kit. You'll essentially receive two SIM cards, one of which will be your trial SIM with 250MB of data, plus 250 call minutes and texts, plus another which will be the SIM you'll use if you want to carry on using Mint Mobile using an old number.",
    "Mint Mobile plans include some rather excellent prepaid options for as little as $15 a month right now, so it's definitely worth trying out if you're looking to save some cash on your cell phone bill.",
    "For more excellent Mint Mobile coverage, see our pages on this week's best Mint Mobile deals and the best Mint Mobile phones - where you'll find plenty of tips on how to save cash, plus recommended handsets to pair with the service. Alternatively, see what other carriers are offering in our guide to the best prepaid phone plans."
  ],
  "headers": {
    "5": "Mint Mobile free trial now available"
  },
  "links": {
    "Mint Mobile": "https://www.techradar.com/deals/mint-mobile-what-is-it-and-is-it-worth-it",
    "a brand new free trial page": "https://mint-mobile.pxf.io/c/221109/444520/7915?subId1=trd-us-8431982252739710000&sharedId=trd-us&u=https%3A%2F%2Fwww.mintmobile.com%2Ffree-trial%2F%3F%25243p%3Da_impact_radius%26_branch_match_id%3D906682889590581280",
    "Mint Mobile plans": "https://www.techradar.com/deals/best-mint-mobile-plans",
    "Mint Mobile deals": "https://www.techradar.com/deals/the-best-mint-mobile-deals",
    "Mint Mobile phones": "https://www.techradar.com/deals/best-mint-mobile-phones",
    "best prepaid phone plans": "https://www.techradar.com/deals/best-prepaid-plans"
  }
}