{
  "source": "https://www.techradar.com/news/firefox-is-great-so-why-has-it-lost-almost-50-million-users",
  "title": "Firefox is great, so why has it lost almost 50 million users?",
  "category": "computing",
  "updated": "2021-08-06T10:50:15Z",
  "author": "jess-weatherbed",
  "summary": "The beginning of the end?",
  "article": [
    "Reddit user nixcraft noticed in Mozilla's own Public data Report that Firefox has lost 46 million users over the last three years. As PC Gamer reports, Firefox is still sitting pretty with 198 million active monthly users, but this number was much higher at the end of 2018 at around 244 million.",
    "The internet is an ever-evolving beast of course, so while Firefox accounted for around 30% of all browser usage back in 2008 (trailing behind Internet Explorer's impressive 60%), Mozilla's once-popular browser now sits at under 3%. We currently have Firefox ranked in first place on our list of the best web browsers, but if it's so much better than the competition, why are people moving away from it?",
    "There are a few reasons why the migration is happening, and why Chrome is mostly benefitting. Many websites are best optimized for Google's web browser, with faster loading times and allows for easier access to other products within its ecosystem such as Google Sheets and Google Meet.",
    "Many businesses use G Suite too, which makes downloading Chrome preferable over other available browsers. Chrome also has the advantage of being the default browser across Android devices, and of course Google is happy to nag you to download Chrome if it catches you using its services on another browser like Edge.",
    "Speaking of which, Edge is now based on Chromium and offers more compelling benefits than Microsoft's now-retired Internet Explorer, with instant web compatibility and support for Chrome extensions. Firefox has its own Add-ons of course and long-time users will often reference its advantage in privacy protection, but recent updates have felt a tad lackluster and it's noticeably slower than Chromium-based browsers. Many users will also take the path of least resistance, and given Google and Microsoft's annoying ad campaigns that push you towards using their products it's understandable that folk will eventually concede to get some peace.",
    "The anti-competitive approach that Google has over browsers is cause for concern, but Firefox isn't going to disappear overnight, even with it being strangled by rivals based on Chromium. ItsFoss, who originally reported on nixcraft's Reddit thread recommends downloading Firefox for use as a secondary browser in a bid to try and fight back against Google's quest for domination, and it's hard to argue against but we doubt that this will work in practice. Mozilla needs to improve its performance to match that of Chromium if it wants to remain a viable alternative because all the enhanced security and customization in the world won't help if it takes forever to load your favorite websites."
  ],
  "headers": {
    "2": "Out-muscled by Google"
  },
  "links": {
    "nixcraft": "https://www.reddit.com/r/linux/comments/ov8jsf/firefox_lost_50m_users_since_2019_why_are_users/",
    "PC Gamer reports": "https://www.pcgamer.com/firefox-has-lost-46m-users-over-the-last-three-years/",
    "best web browsers": "https://www.techradar.com/best/browser",
    "Google Sheets": "https://www.techradar.com/reviews/google-sheets",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "G Suite": "https://www.techradar.com/reviews/google-workspace",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "ItsFoss": "https://news.itsfoss.com/firefox-decline/"
  }
}