{
  "source": "https://www.techradar.com/news/alexa-can-now-control-your-smart-home-gadgets-without-voice-commands",
  "title": "Alexa can now control your smart home gadgets without voice commands",
  "category": "smart-home",
  "updated": "2021-01-27T08:25:01Z",
  "author": "carrie-ann-skinner",
  "summary": "The Alexa Hunches feature can now automate smart home devices based on previous behaviour",
  "article": [
    "Alexa is getting even smarter and can now proactively control your smart home gadgets based on your previous requests and behavior.",
    "The Alexa Hunches feature, which was introduced in the US in 2018, offers suggestions for your smart home devices. For example, if you said \"Goodnight\" to Alexa and a smart light was still switched on, Alexa would offer to turn it off for you.",
    "However, you’d need to confirm Alexa could perform the action before it happened, either by replying to her audible response or by tapping the notification that appears on your smartphone.",
    "Now Amazon is rolling out the ability to make these actions automatic, reducing the number of interactions you have to make with Amazon's voice assistant on a daily basis. Hunches will work with a number of smart home devices including smart lights, smart locks and even smart thermostats.",
    "Alexa Hunches are separate to Routines, which are automations programmed by the user to take place at a certain time or when a certain phrase is spoken. Hunches are automations that are based on Alexa’s assumptions rather than needing any routines to be created in advance.",
    "Alexa Hunches are enabled by default, but if you don’t want Alexa to ask you first before initiating the action, you’ll need to switch on ‘automatic actions’ in the Alexa app.",
    "Open the app and tap More. Now choose Settings and scroll down, selecting Hunches. Choose set-up automatic actions and select the ones you want enabled. The choices will be based on the compatible smart home gadgets you have installed.",
    "If you want to disable the Hunches feature, you can either say “Disable Hunches” to Alexa or open the Alexa app and tap More. Select Settings and Scroll down to the section Marked Hunches, then deactivate the feature.",
    "The Alexa Hunches feature is currently only available in the US."
  ],
  "headers": {
    "5": "How to turn on Alexa Hunches",
    "7": "How to turn off Alexa Hunches"
  },
  "links": {
    "Alexa": "https://www.techradar.com/news/new-alexa-feature-lets-you-text-amazons-voice-assistant-with-commands",
    "smart home gadgets": "https://www.techradar.com/news/the-best-cheap-smart-home-gadgets-of-2019/news/smart-home-devices",
    "introduced in the US in 2018": "https://www.techradar.com/news/amazons-next-shipment-of-alexa-devices-includes-a-new-amazon-echo-dot",
    "smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "smart thermostats": "https://www.techradar.com/news/best-smart-thermostat"
  }
}