{
  "source": "https://www.techradar.com/news/fujifilm-x-e4-vs-fujifilm-x-t30-which-beginner-mirrorless-camera-should-you-buy",
  "title": "Fujifilm X-E4 vs Fujifilm X-T30: which beginner mirrorless camera should you buy?",
  "category": "cameras",
  "updated": "2021-02-14T11:00:35Z",
  "author": "andrew-williams",
  "summary": "We compare the small, retro beginner cameras",
  "article": [
    "Fujifilm makes some of the most charming compact mirrorless cameras around –and the new Fujifilm X-E4 is another fine addition to its vintage series.",
    "Like the Fujifilm X-T30, the design is modern retro without anachronism, while its combination of Fuji sensors and image processing promises some of the prettiest images in its class.",
    "But buying a mid-range mirrorless Fujifilm camera just got more complicated with the X-E4's arrival. A newer and slightly cheaper alternative to the established Fujifilm X-T30, both cameras offer a very similar, travel-friendly proposition.",
    "In the last generation, we routinely recommended the T-series model over the E-series one. But this time the decision is not so simple.",
    "The Fujifilm X-T30 and X-E4 have the same sensor and the same processor. And while some may prefer the T-series’s more enthusiast style controls, there are major benefits to the X-E4 if you’ll shoot a lot of video or want the most compact camera you can get, without sacrificing image quality.",
    "Here's how to decide between the two beginner-friendly mirrorless cameras...",
    "Comparing cameras in the same ballpark often boils down to the stuff inside, and whether a company’s lens selection suits your needs and budget. This time a quick look at the outside tells you much of what you need to know.",
    "A compact shell is the main draw of the FujiFilm X-E4. It is just 32.7mm thick, compared to the 46.8mm depth of the X-T30. Fuji achieves this by using a display that sits flush with the back, trimming down the eyepiece of the EVF and nixing the grip entirely.",
    "Sure, the latter is a sacrifice. But match the X-E4 with the new 27mm pancake kit lens and you have a dream team for breezy street photography.",
    "The X-E4 also has fewer controls than the FujiFilm X-T30. You lose a mode dial up top, plus a control dial on the back.",
    "However, anyone accusing the X-T4 of being a 'baby' camera is wrong. There’s still a dial on the front, and a shutter speed control up top. It seems made for the manual 'priority' modes that many of us photography enthusiasts use by default. And, of course, for full 'auto' shooting.",
    "There’s only a slight weight disparity here. The X-E4 weighs 364g with battery and card, the X-T30 383g. You buy an X-E4 if you want it to slip into a coat pocket, but it still has a tough magnesium inner frame.",
    "The FujiFilm X-E4 and X-T30 have the same sensor – it’s the fourth-generation X-Trans chip, with a 26.1MP resolution.",
    "Aside from potential for some minor differences in processing algorithms in their respective firmwares, these cameras should offer the same image quality. And that is certainly no bad thing.",
    "Their standard ISO range is 160-12800, but this can be extended down to ISO 80 and up to ISO 51200. There’s nothing to see here. You can expect more-or-less the same images from each.",
    "Neither body is stabilized either, so buy your lenses carefully if you want the benefits of stabilization – like having the flexibility of slower shutter speeds while shooting handheld.",
    "The FujiFilm X-E4 and X-T30's EVFs are very similar, too. They have 2.36-million-dot resolution, equivalent to 1024 x 768 pixels, and 0.62x magnification.",
    "Some will prefer to use the X-T30’s EVF, though, as the design gives the eyepiece more clearance from the back of the camera. The X-E4’s viewfinder is positioned in rangefinder style, sitting at the corner so your nose won’t bump against the camera back.",
    "The two cameras' rear screens are in lock step with these cameras’ intended audiences. The FujiFilm X-T30 has the two-way tilt style screen Fuji has used in several other models. It angles plenty for below-head shooting, but only a little the other way.",
    "The FujiFilm X-E4’s screen mechanism lets it flip all the way up, above the camera’s top so you can use it as a vlog monitor. It’s not just for video fans, of course — this setup is also perfect for holiday selfies, and is better for the purpose than a fully articulated monitor. As you'd expect in 2021, both screens are touch-sensitive, too.",
    "Once again, there’s almost nothing to separate the FujiFilm X-E4 and X-T30 in autofocus performance and burst speed departments.",
    "Both cameras have 425 phase-detection AF points, and there’s both eye and face tracking. It would be stranger if their capabilities were different. After all, they both have the X-Trans 4 sensor and X-Processor 4 CPU.",
    "Burst speeds reach 20fps using the electronic shutter. Or 30fps if you use the 1.25x crop mode, which may be useful in some action or nature shoots.",
    "There is one slight difference according to FujiFilm. Use the top 8fps mechanical shutter burst mode and the buffer runs out after 90 JPEGs on the X-T30, or 105 shots on the X-E4.",
    "This suggests an improvement to the way the buffer is offloaded to the SD card. And it lets the X-E4 shoot endlessly at 4fps (JPEG), whereas the X-T30 gives up after 209 frames. This may be due to a difference in hardware, but if it is not, the X-T30 may get an update to bring it up to X-E4 speed. But that's by no means certain.",
    "The cameras' respective video modes provide more evidence that the FujiFilm X-E4 is better at handling a large amount of data in a short amount of time.",
    "The FujiFilm X-E4 can shoot 240p slo-mo at 1080p – that is an 8x slow-down. But the older X-T30 can only reach 120 frames per second, again at 1080p.",
    "FujiFilm had already developed the 240p video mode for the X-S10, which is slightly more expensive than either of these cameras and has in-body image stabilization.",
    "The X-E4 can also shoot for far longer than the X-T30, too. It can capture 4K or 1080p for 30 minutes continuously, up from just 10 minutes of 4K in the X-T30, or 15 minutes of 1080p. There’s clearly a big efficiency change here, or at least a different approach to heat dispersal.",
    "Other video modes are largely the same. You can shoot 4K/30p footage with either, but there’s no 4K/60p shooting here. And color depth is 4:2:0 8-bit in-camera, or 4:2:2 10-bit over HDMI. It’s hard to imagine too many people buying an X-E4 for use with an external recorder, though.",
    "Both cameras’ 4K modes also cap out at a solid 200Mbps bitrate. Bear in mind that, as neither camera has IBIS, you’ll likely need to apply additional software stabilization in the edit for the best results when shooting handheld.",
    "There’s another video shooter benefit for the Fujifilm X-E4 in its connectivity. The camera has a 3.5mm jack for an external microphone – and despite its small size, there’s still a hotshoe up top for accessory mounting.",
    "Want to monitor audio on the X-E4? No problem. You can use the USB-C port for that, and a USB-to-3.5mm adapter comes in the box.",
    "The X-T30 uses the smaller 2.5mm socket for an external mic, which likely means you’ll need another adapter. And while you can again use the USB-C to monitor audio, a USB-C-to-3.5mm cable is not included. Fujifilm seems to have learned from complaints leveled at the earlier camera. Both also have a micro HDMI connector.",
    "These cameras use exactly the same battery, an NP-W126S. However, while the X-T30 is rated for 380 frames, the X-E4 can capture 460 frames per charge, according to Fujifilm’s figures. Once again, it seems there’s some efficiency improvement here.",
    "Video claims are the same, though. Fujifilm says you’ll get 60 minutes of 4K capture, or 75 of 1080p, off a charge with either camera.",
    "The wireless specs haven't changed either – the X-T30 and X-E4 both have 2.4GHz Wi-Fi and Bluetooth 4.2, but there's sadly no 5GHz Wi-Fi.",
    "Fujifilm has a tough job stratifying the prices of its mid-range cameras. We have the Fujifilm X-E4 at $850 / £799 / AU$1,399, while the X-T30 originally arrived for $899 / £849 / $1420 (although you can now find it for less).",
    "It is probably this closeness to the T-series model that gave the last X-E3 such trouble. Fujifilm offers the X-E4 with a 27mm kit lens this time around, a pancake with a solid F/2.8 aperture. This highlights the (large) pocket-ready appeal of the camera.",
    "Last time around, our usual advice was to buy the Fujifilm X-T20 over the Fujifilm X-E3. But things have changed a bit with the X-E4.",
    "It’s a smaller camera with a selfie and vlogging-friendly flip up screen, and several features that are handy for those more keen on video than stills. Slo-mo skills are increased from 120fps to 240fps (1080p), while the restrictive time limits on 4K and 1080p video have been raised to 30 minutes.",
    "There’s less to choose between them on the stills front, though. These cameras will take similar photos, but the X-E4 does have slightly better burst performance, with a buffer that never runs out at 4fps and below.",
    "That said, if you're not planning to shoot much video, your choice will likely come down to whether you prefer the corner-mounted EVF of the X-E4 or the X-T30's central viewfinder."
  ],
  "headers": {
    "6": "Design",
    "12": "Sensor",
    "16": "Screen and EVF",
    "20": "AF and burst shooting",
    "25": "Video",
    "31": "Connections and battery life",
    "37": "Price",
    "39": "Takeaway"
  },
  "links": {
    "Fujifilm X-E4": "https://www.techradar.com/news/the-fujifilm-x-e4-is-a-retro-travel-camera-with-an-attractive-price-tag",
    "Fujifilm X-T30": "https://www.techradar.com/reviews/fujifilm-x-t30-review",
    "Fujifilm X-T20": "https://www.techradar.com/reviews/fujifilm-x-t20-review",
    "Fujifilm X-E3": "https://www.techradar.com/reviews/fujifilm-x-e3-review"
  }
}