{
  "source": "https://www.techradar.com/news/microsoft-office-2021-release-date-pricing-features-and-everything-else-you-need-to-know",
  "title": "Microsoft Office 2021 release date, price, features and everything else you need to know",
  "category": "computing",
  "updated": "2021-12-06T00:25:48Z",
  "author": "joel-khalili",
  "summary": "Office 2021 is out now - here's our full rundown",
  "article": [
    "Office 2021, the latest version of Microsoft's iconic office software suite, is out now.",
    "With the company going all-in on its Microsoft 365 subscription package, it looked as if we may never see another traditional Office release. But Microsoft has now confirmed it will give users the chance to access the newest versions of Word, Excel, PowerPoint and the like for a one-time fee.",
    "The Office 2021 bundle arrived on the same day as the company’s new operating system, Windows 11, and follows the same pricing format as the previous edition.",
    "Here’s everything you need to know about Office 2021, from release date and availability to pricing and new features.",
    "What is it? The latest version of Microsoft’s suite of office software When is it available? October 5, 2021 How much does it cost? Office Home and Student 2021 - $149.99/£119.99, Office Home and Business 2021 - $249.99/£249.99 Who is the target audience? Office users who prefer one-time purchases over regular subscription fees",
    "Office 2021 is the latest edition of Microsoft’s famous suite of office software for PC and Mac. It includes favorites such as Word, Excel, PowerPoint and Outlook, as well as newer offerings such as Teams.",
    "Although competition from Google Workspace has become increasingly fierce, Microsoft Office is still widely considered the most powerful bundle of productivity tools on the market.",
    "The new bundle is live now to buy.",
    "Microsoft Office 2021 comes in two flavors: Office Home and Student 2021 and Office Home and Business 2021.",
    "The former is the cheaper of the two at $149.99/£119.99 and comes with Word, Excel, PowerPoint, OneNote and Microsoft Teams for both PC and Mac.",
    "Office Home and Business 2021 comes in at $249.99/£249.99. Other than price, the only difference between this package and the cheaper option is the addition of email service Outlook and the legal rights to use the apps in a commercial context.",
    "Both versions of the suite have to be purchased on a per device basis.",
    "As you might expect, the latest version of Microsoft’s Office package comes with a range of new features, detailed in full here.",
    "Beyond performance improvements across the board, the highlights include support for OpenDocument format (ODF) 1.3, new Excel functions, a new presentation recording feature for PowerPoint and updated translation functionality for Outlook.",
    "At the top of all Office apps, users will also find a new intelligent search box, which is designed to help surface documents, commands and specific portions of text more easily.",
    "Finally, all the apps have been given a visual refresh that aligns the user interface with Microsoft’s new operating system, Windows 11. That means rounded corners, a new color palette and an updated ribbon interface.",
    "The primary difference between Office 2021 and Microsoft 365 is the way in which customers pay for the services.",
    "Microsoft 365 follows the software-as-a-service (SaaS) business model, whereby customers pay a regular subscription fee for access to Word, Excel, PowerPoint, Outlook etc. Meanwhile, Office 2021 customers pay a single upfront fee in exchange for a lifetime license.",
    "Office 2021 has the potential to be cheaper in the long run and the apps still benefit from the same kinds of online collaboration features as their Microsoft 365 counterpart.",
    "The downside of choosing Office 2021 over Microsoft 365, however, is that the feature set will only remain current for a limited amount of time (i.e. until the next version is released), whereas Microsoft 365 users will always enjoy the very latest updates and features.",
    "Further, for businesses that would prefer to shift spending from CapEx to OpEx, Microsoft 365 is the obvious choice.",
    "If you want to compare elsewhere, we've also built a list of the best Office alternatives around",
    "You might also want to check out how to download and use Microsoft Word for free."
  ],
  "headers": {
    "4": "Cut to the chase",
    "5": "What is it?",
    "8": "Pricing and availability",
    "12": "Features",
    "16": "Office 2021 vs Microsoft 365: What’s the difference?"
  },
  "links": {
    "office software": "https://www.techradar.com/news/office-365-vs-g-suite-whats-the-best-office-software",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "PowerPoint": "https://www.techradar.com/reviews/microsoft-powerpoint",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "productivity tools": "https://www.techradar.com/best/best-productivity-apps",
    "OneNote": "https://www.techradar.com/reviews/microsoft-onenote",
    "email service": "https://www.techradar.com/news/best-email-provider",
    "here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1060892414946817900&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Foffice%2Fwhat-s-new-in-office-2021-43848c29-665d-4b1b-bc12-acd2bfb3910a",
    "best Office alternatives": "https://www.techradar.com/news/best-microsoft-office-alternative",
    "how to download and use Microsoft Word for free": "https://www.techradar.com/how-to/how-to-download-and-use-microsoft-word-for-free"
  }
}