{
  "source": "https://www.techradar.com/news/sex-education-season-3-on-netflix-looks-like-its-finished-filming",
  "title": "Sex Education season 3 on Netflix looks like it's finished filming",
  "category": "entertainment",
  "updated": "2021-03-24T16:31:34Z",
  "author": "samuel-roberts",
  "summary": "Could a release date be close?",
  "article": [
    "Sex Education season 3 on Netflix looks like it's finished filming. As spotted by eagle-eyed fans on the Sex Education subreddit, a member of the show's production team posted a picture saying 'And that's a wrap!', with the Moordale Secondary School symbol in clear view.",
    "The show has been filming safely in a bubble in Wales since last year, where actors and crew isolated before production began. It's widely expected the series will return this year – if filming has wrapped up, we'd almost certainly expect that to be the case.",
    "Here is the image in question:",
    "Sex Education is a touching Netflix comedy about sexuality in a British secondary school. It sees nervous student Otis (Asa Butterfield), the son of a sex therapist (played by Gillian Anderson), set up a sex clinic in his school along with fellow student Maeve (Emma Mackey).",
    "The series has drawn critical acclaim for the way it sensitively tackles difficult subjects that aren't ordinarily covered in mainstream entertainment – and anticipation for this third season is high.",
    "Like all streamers and networks, Netflix was hit with production shutdowns on a whole bunch of its shows in 2020, and had to figure out how to film safely before the shows could resume.",
    "The Witcher season 2 and Stranger Things season 4 are two of the highest profile examples – though you might've been hard-pushed to notice that Netflix's schedule has been affected by the whole thing, given the sheet amount of content it pumps out.",
    "Still, that hopefully means that the second half of this year will be packed with new show arrivals – and Netflix has a few big hitters coming up, like book adaptation Shadow and Bone on April 23, and Jupiter's Legacy on May 7."
  ],
  "headers": {
    "5": "Netflix gets back on-track post-Covid"
  },
  "links": {
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "Sex Education subreddit": "https://www.reddit.com/r/NetflixSexEducation/comments/m9imf5/and_thats_a_wrap_on_season_3/",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4",
    "Shadow and Bone": "https://www.techradar.com/news/netflixs-shadow-and-bone-trailer-teases-your-next-fantasy-tv-show-binge-watch",
    "Jupiter's Legacy": "https://www.techradar.com/news/netflix-teases-superhero-drama-jupiters-legacy-with-first-look-images"
  }
}