{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-be-the-next-phone-to-get-s-pen-support",
  "title": "Samsung Galaxy Z Fold 3 could be the next phone to get S Pen support",
  "category": "phones",
  "updated": "2021-02-22T12:25:04Z",
  "author": "david-nield",
  "summary": "But will it replace the Note?",
  "article": [
    "Support for the S Pen stylus is no longer the Galaxy Note-exclusive that it once was. The Galaxy S21 Ultra launched with support for the Samsung stylus earlier this year, and new reports back up previous rumors that the Galaxy Z Fold 3 will be the next phone in line to work with the Samsung stylus.",
    "As reported by ET News in South Korea, the upcoming foldable will indeed have S Pen support when it arrives – there's no official launch date for the phone yet, but the Galaxy Z Fold 2 launched in September 2020, so later in 2021 is a good bet.",
    "This is by no means a new rumor, but considering more sources are backing it up all the time, it's looking more likely than ever. The Galaxy S21 Ultra is evidence that Samsung is happy to add stylus functionality to more handsets going forward, although apparently the Fold 3 will include a stylus slot in its casing, which the S21 Ultra doesn't have.",
    "This isn't the only tidbit of advance information we've heard about the upcoming Samsung Galaxy Z Fold 3: the foldable phone is also reported to be arriving with an in-screen camera, and perhaps even RGB lighting along its hinge.",
    "The process of adding S Pen support is more difficult than you might think: extra layers under the screen are required to recognize the input of a digital pointing device, which is even harder to do on a foldable phone than it is on a regular one.",
    "We had previously heard about Samsung potentially changing the display tech used in the Galaxy Z Fold 3 to enable stylus support, and making the ultra-thin glass (UTG) sported by its foldable handsets thicker in order to stand up to the prodding of a pen.",
    "The new report from ET News doesn't go into detail about the solution that Samsung has come up with, but it does appear that a solution has been found. The usual 'people familiar with the matter' are anonymously quoted in the article.",
    "Questions remain around what this means for the Galaxy Note line, with some sources suggesting that Samsung's foldable phones will eventually replace it. For now, though, Samsung says it's committed to the Note range, so we're still expecting to see the Galaxy Note 21 later in the year.",
    "Via SamMobile"
  ],
  "headers": {
    "4": "Taking notes"
  },
  "links": {
    "Galaxy Note": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "ET News": "https://www.etnews.com/20210222000171",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "a new rumor": "https://www.techradar.com/news/samsung-galaxy-s21-and-fold-3-may-support-s-pen-while-the-note-might-be-dead",
    "an in-screen camera": "https://www.techradar.com/news/samsungs-next-foldable-phone-could-use-an-under-display-camera",
    "along its hinge": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-rgb-lighting-on-the-hinge",
    "previously heard": "https://www.techradar.com/news/the-samsung-galaxy-z-fold-3-might-finally-add-s-pen-support-to-the-foldable",
    "will eventually replace it": "https://www.techradar.com/news/samsung-galaxy-s21-and-fold-3-may-support-s-pen-while-the-note-might-be-dead",
    "it's committed to the Note range": "https://www.techradar.com/news/samsung-suggests-its-committed-to-the-galaxy-note-range-so-will-we-see-a-note-21",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "SamMobile": "https://www.sammobile.com/news/galaxy-z-fold-3-feature-s-pen-support/"
  }
}