{
  "source": "https://www.techradar.com/news/apple-may-have-quietly-discontinued-some-imac-4k-models",
  "title": "Apple may have quietly discontinued some iMac 4K models",
  "category": "computing",
  "updated": "2021-03-03T11:45:19Z",
  "author": "jess-weatherbed",
  "summary": "Out with the old",
  "article": [
    "Apple has seemingly stopped producing both the 512GB and 1TB SSD 21.5-inch iMac configurations, which may indicate a refreshed design is on the horizon. Both of these models are currently listed as 'unavailable' on the Apple website, though other iMac 4K models are currently still available to buy. No official statement has been given for the removal of these specific designs, but there has previously been speculation that Apple is refreshing existing iMacs for 2021 to replace both the 21.5-inch and 27-inch styles.",
    "This information was leaked to Apple Insider by a \"long-time source\", but as with any unofficial information we shouldn't take this industry information as gospel. We're not expecting a new exterior design given its history when updating from PowerPC to Intel, and the more recent updates to MacBooks to Apple Silicon. The existing pattern suggests that the hardware itself will be updated while leaving the current chassis as is until any exterior updates need to be made. If it ain't broke, don't fix it, as they say.",
    "This isn't to completely discount the idea of a visual redesign – well-known leaker John Prosser previously released what appeared to be prototype designs for the M1 iMac in some nostalgic colors similar to those found in the new M1 MacBook Air. It's also been suggested that these updated models could have a design more akin to that of the Pro Display XDR. It's been a while since we saw a design update to the iMac range, but we don't currently have a release timeline for when we could expect to see these new models. If the current rumors are true then we might get a glimpse before the end of 2021. We're certainly excited to see what the power of M1 could bring to Apple's all-in-one desktop though, regardless of a potential facelift being included.",
    "Via Apple Insider"
  ],
  "headers": {
    "2": "Will we see the M1 iMac in 2021?"
  },
  "links": {
    "speculation that Apple is refreshing existing iMacs": "https://www.techradar.com/news/apple-may-be-planning-the-first-imac-redesign-in-almost-a-decade",
    "21.5-inch": "https://www.techradar.com/reviews/apple-imac-215-inch-2019-review",
    "27-inch": "https://www.techradar.com/reviews/apple-imac-27-inch-2020",
    "Apple Insider": "https://appleinsider.com/articles/21/02/23/macbook-pro-will-regain-sd-card-reader-and-hdmi-port-in-2021-kuo-says",
    "prototype designs for the M1 iMac": "https://www.techradar.com/news/check-out-what-an-ipad-air-inspired-imac-m1-could-look-like",
    "Pro Display XDR": "https://www.techradar.com/news/pro-display-xdr-first-look-a-monitor-not-for-mere-mortals"
  }
}