{
  "source": "https://www.techradar.com/news/larry-ellison-says-oracle-cloud-never-goes-down-following-aws-outage",
  "title": "Larry Ellison says Oracle cloud \"never goes down\" following AWS outage",
  "category": "computing",
  "updated": "2021-12-10T14:49:37Z",
  "author": "mike-moore",
  "summary": "Also promises major growth in Oracle ERP Cloud",
  "article": [
    "The co-founder of Oracle has surreptitiously hit out at Amazon Web Services (AWS) following a major outage that hit the platform recently.",
    "Speaking at its recent earnings call, Oracle Chairman Larry Ellison quoted a company customer who reportedly told him that the reason his platform was so popular was due to its lack of downtime.",
    "“I’m going to paraphrase from a very large telecommunications company who uses our cloud and all the other three North American clouds — Google, Amazon and Microsoft,” Ellison said. “And the note basically said the one thing we’ve noticed about Oracle, Oracle’s cloud, is that it never ever goes down. We can’t say that about any of the other clouds. We think this is a critical differentiator.”",
    "AWS suffered a significant outage across its North-East 1 cloud region earlier this week that saw other Amazon services such as Prime, Alexa and Ring all hit with major issues, while major customers such as Facebook and Disney Plus also affected.",
    "The outages were centred on a number of core AWS services, including increased API error rates with Amazon DynamoDB and Amazon Elastic Compute Cloud, as well as Amazon Connect, which handles contact center calls.",
    "Although still far behind AWS' market share and revenue figures, Ellison was able to highlight some encouraging financial results for the company, particularly in its ERP cloud products.",
    "Oracle noted that its ERP cloud business is set to nearly reach $20bn within the next five years, with new partnerships in the logistics and financial industries playing a ket role.",
    "Elsewhere, CNBC reported that Ellison also hit out at AWS' database provisions, noting that Oracle's technology is far superior. “We have MySQL, but our version of MySQL is much better than Amazon’s version of MySQL,” Ellison reportedly said. “Much faster. I mean, more than ten times faster.”"
  ],
  "headers": {
    "3": "AWS outage"
  },
  "links": {
    "AWS": "https://www.techradar.com/news/aws",
    "major outage": "https://www.techradar.com/news/aws-is-down-and-taken-whole-chunks-of-the-internet-with-it",
    "CNBC": "https://www.cnbc.com/2021/12/09/after-aws-outage-larry-ellison-says-oracles-cloud-never-goes-down.html"
  }
}