{
  "source": "https://www.techradar.com/news/valve-reveals-more-juicy-details-about-the-steam-deck",
  "title": "Valve reveals more juicy details about the Steam Deck",
  "category": "computing",
  "updated": "2021-09-23T10:22:16Z",
  "author": "matt-hanson",
  "summary": "Answers some of the most asked questions",
  "article": [
    "As the launch of Valve’s upcoming Steam Deck handheld gaming system approaches, the company has answered some of the most frequently asked questions that people have been sending to CEO Gabe Newell.",
    "Posted as a new FAQ, Valve confirms certain things we already knew, while also announcing some new, and welcome, features.",
    "So, it’s confirmed that you can use multiple Steam accounts on one Steam Deck device, with each account having its own local save data and settings.",
    "Valve also confirmed that you can run non-Steam games via Proton on the Steam Deck. Proton is a tool that allows Windows games to run in Linux (which the Steam Deck uses for its SteamOS 3.0 operating system).",
    "This is great news for people who have substantial game libraries in other launchers, such as Epic Games Store. Valve also confirms that you can add non-Steam games to your Steam Deck’s library in a similar way to how you do it on the desktop version of Steam.",
    "An interesting new feature announced in the FAQ is the fact that the Steam Deck can be used as a PC controller as well. This can be done by using Remote Play on the Steam Deck, which then allows you to control the action on your PC using the Steam Deck.",
    "This could be handy for people who don’t have a controller but want to play games on their PC that work best with controller support, or if you want to use some of the Steam Deck’s additional features, like haptic feedback and touchpads, that even the best gamepads for PC don’t have.",
    "The FAQ also confirms that you can dual-boot operating systems on the Steam Deck. That means you can install additional operating systems alongside SteamOS, rather than having to completely replace SteamOS. So, when you start up the device, you can choose to load into SteamOS, or Windows 11, for example.",
    "This will make it even easier for people who want to play Windows-based games that aren’t supported by Proton.",
    "You can also install an operating system on an SD card, and boot off that, which will save you space on the built-in hard drive, though performance might not be that great.",
    "While a lot of the answers Valve gives in the FAQ are exciting, there are a few answers in there which, while still expected, may be disappointing.",
    "There’s no support for external GPUs, for example, so you can’t use one to boost the performance of the device, though this would have been a niche feature at the best of times.",
    "Valve also states that while PC VR headsets can be connected, the Steam Deck “is not optimized for PC VR experiences.”",
    "Valve has been a big supporter of VR, releasing its own headset, the Valve Index, as well as one of the best VR games made – Half Life: Alyx – but it looks like its VR support won’t stretch to the Steam Deck. This is understandable considering the hardware involved, however, as good PC VR performance requires pretty hefty hardware.",
    "The more we hear about the Steam Deck, the more excited we are about it. Having powerful gaming hardware in a handheld device could prove serious competition for Nintendo with its Switch handheld, whose hardware is increasingly feeling like it needs an update – something that Nintendo seems unwilling to do (apart from adding a larger OLED screen).",
    "For PC gamers with large Steam libraries, the idea of having all those games ready to play on the Steam Deck (or, a majority of them, at least), is also very exciting. So, confirmation that we’ll be able to play non-Steam games via Proton is also incredibly welcome.",
    "The flexibility and openness of the Steam Deck feels like a breath of fresh air compared to the restricted nature of games consoles, so we’re really looking forward to getting our hands on one.",
    "Via GamesRadar"
  ],
  "headers": {
    "5": "You can use the Steam Deck as a controller",
    "7": "Dual boot operating systems",
    "10": "Don’t get your VR hopes up",
    "14": "Analysis: Steam Deck is shaping up to be a great device"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "a new FAQ": "https://www.steamdeck.com/en/faq",
    "Proton": "https://www.techradar.com/news/what-is-proton",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "best gamepads for PC": "https://www.techradar.com/news/best-controllers-for-pc-2019-the-best-pc-game-controllers-you-can-buy-today",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "best VR games": "https://www.techradar.com/best/the-best-vr-games",
    "Half Life: Alyx": "https://www.techradar.com/news/half-life-alyx-is-a-watershed-moment-for-virtual-reality",
    "its Switch handheld": "https://www.techradar.com/reviews/nintendo-switch",
    "adding a larger OLED screen": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "GamesRadar": "https://www.gamesradar.com/valve-answers-all-your-burning-steam-deck-questions-in-new-faq/"
  }
}