{
  "source": "https://www.techradar.com/news/there-are-more-developers-in-the-world-than-ever-before",
  "title": "There are more developers in the world than ever before",
  "category": "computing",
  "updated": "2021-04-27T11:31:43Z",
  "author": "mayank-sharma",
  "summary": "JavaScript rules the roost when it comes to programming",
  "article": [
    "A new report suggests there has been a meteoric rise in the number of active software developers worldwide, with the figure currently standing at around 24.3 million.",
    "The insight is presented in the 20th edition of the State of the Developer Nation report and collates data from a SlashData survey conducted between November 2020 and February 2021, involving more than 19,000 developers in 155 countries.",
    "SlashData’s estimate of the number of developers in the world is a fourteen percent increase from October 2020, when the number stood at around 21.3 million.",
    "By extrapolating the survey data, collected every six months, the report brings out several interesting trends in terms of the choice of programming languages.",
    "The report pegs JavaScript as the most popular language that, together with variants including TypeScript and CoffeeScript, is used by almost 14 million developers around the world.",
    "Based on SlashData’s observations over the past several years, more than 4.5 million JavaScript developers have joined the ranks between Q4 2017 and Q1 2021. This is the highest growth in terms of absolute numbers across all programming languages.",
    "JavaScript is in fact so popular that a quarter of the developers use it even in software sectors such as data science and embedded, where it isn’t among the developers’ top choice.",
    "Next up is Python with just over 10 million users, followed by Java with 9.4 million, and C/C++ with 7.3 million.",
    "The report notes that Python added 1.6 million new developers in the past year, recording a growth rate of 20%. It attributes Python’s popularity to its use in machine learning and data sciences.",
    "Via The Register"
  ],
  "headers": {
    "3": "Popular languages"
  },
  "links": {
    "software developers": "https://www.techradar.com/news/best-laptop-for-programming",
    "choice of programming languages": "https://www.techradar.com/news/software-programming-languages-which-is-best-for-your-next-project",
    "JavaScript": "https://www.techradar.com/best/best-online-courses-to-learn-javascript",
    "TypeScript": "https://www.techradar.com/news/bloomberg-improves-javascript-with-an-open-source-project-from-microsoft",
    "Python": "https://www.techradar.com/best/python-online-courses",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "The Register": "https://www.theregister.com/2021/04/26/report_developers_slashdata/"
  }
}