{
  "source": "https://www.techradar.com/news/new-facebook-messenger-app-for-windows-11-is-faster-and-better-looking-than-ever",
  "title": "New Facebook Messenger app for Windows 11 is faster and better-looking than ever",
  "category": "computing",
  "updated": "2021-11-23T12:21:05Z",
  "author": "sofia-wycislik-wilson",
  "summary": "The amazing new beta shows off the redesigned and rewritten messaging app",
  "article": [
    "There is a new beta version of the Facebook Messenger app for Windows 10 and Windows 11. This is a significant update to the popular desktop app that sees Facebook using the open-source React Native framework.",
    "The rewrite of the app and the move away from the previously used Electron means that there is a significant performance boost. On top of this, there are also bug fixes and improvements, as well as important interface changes.",
    "The update takes the Messenger app up to version 1320.11.119.0, and there is something of a new look. The app has switched from using its own custom controls, to using the native UWP (Universal Windows Platform) versions instead.",
    "The change means that the app far more closely resembles the look and feel of other Windows apps.",
    "But what is perhaps most noticeable about the app in use is the performance increase. Facebook has not only been able to reduce the size of Messenger by an incredible 100MB, but there is a speed boost that comes thanks to the code re-write.",
    "Switching to React Native has helped to dramatically improve the app's use of system resources, and this in turn has helped to accelerate performance.",
    "If you're already signed up to take part in the beta program, you will need to update to the latest version to experience the improvements. You can find out more about the Messenger beta over in the Microsoft Store.",
    "With this update, Facebook is giving people precisely what they want. No one is going to complain about an improvement in performance, a reduction in resource usage, and a smaller app, after all.",
    "While there is something to be said for apps that have a unique look, users tend to feel more comfortable with familiarity. This means that custom controls and unusual app furniture serve as friction point.",
    "In adopting native UWP controls, Messenger is now much more like other apps and is therefore easier to use. While a messaging app is perhaps not the most complex or confusing type of app available, it's important to remember that developers need to cater for the lowest common denominator. By eliminating custom controls, the potential for confusion has been reduced, and this is a win for all users.",
    "Via: MSPoweruser"
  ],
  "headers": {
    "4": "The need for speed",
    "7": "Analysis: performance and prettiness"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Microsoft Store": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6040451992234451000&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fp%2Fapp%2F9nblggh2t5jk&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnew-facebook-messenger-app-for-windows-11-is-faster-and-better-looking-than-ever",
    "MSPoweruser": "https://mspoweruser.com/facebook-messenger-for-windows-updated-with-native-uwp-controls/"
  }
}