{
  "source": "https://www.techradar.com/news/nvidias-geforce-experience-lets-you-tame-the-noise-of-your-gaming-laptop-with-rtx-30-series-gpus",
  "title": "Nvidia’s GeForce Experience now lets you tame the noise of your gaming laptop with RTX 30 series GPUs",
  "category": "computing",
  "updated": "2021-01-26T16:16:40Z",
  "author": "darren-allan",
  "summary": "WhisperMode 2.0 intelligently manages the GPU and CPU to achieve the desired noise level",
  "article": [
    "Nvidia has pushed out a fresh version of GeForce Experience which comes with support for the new ‘WhisperMode’ that allows laptops equipped with Nvidia’s latest Ampere-based mobile GPUs to run as quietly as you want them (or at least more quietly).",
    "GeForce Experience version 3.21 brings in WhisperMode 2.0, which gives owners of gaming notebooks with GeForce RTX 30 series graphics cards the ability to alter the noise level that their portable makes.",
    "Nvidia observes that you can “pick your desired acoustic level”, and that the new mode’s AI-driven algorithms will then manage the GPU along with CPU and overall system temperatures to ensure that a certain fan speed (ie noise level) can be achieved.",
    "Naturally, that could mean if you want quieter running that performance is reined in, but at any rate, it’s pretty cool (pun not intended) to get the choice, and Nvidia promises to “deliver great acoustics and the best possible performance”.",
    "If you missed the launch of Nvidia’s new mobile GPUs back at CES 2021, we can quickly get you up to speed with exactly how the new RTX 3000 laptop cards stack up in comparison to their desktop siblings.",
    "So, what else is new with this update for GeForce Experience? As you might expect, Nvidia has provided a bunch of optimal settings for new games – 58 of them in total – and that includes Cyberpunk 2077 and FIFA 21.",
    "Nvidia has also added Freestyle and Ansel support for some 38 games with the latest Game Ready Driver, which again includes Cyberpunk 2077 and FIFA 21, as well as Assassin’s Creed Valhalla and Call of Duty: Black Ops – Cold War.",
    "There are some bug fixes here too, including a solve for an issue whereby ShadowPlay videos looked darker on YouTube, and a cure for a gremlin which meant that screen grabs weren’t being successfully captured with some DX12 games. Plus there are some security updates thrown in for good measure, which never hurts.",
    "Via Hexus"
  ],
  "headers": {
    "5": "Cyberpunk 2077 optimal settings"
  },
  "links": {
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "observes": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-1367457899189198600&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-gb%2Fgeforce%2Frelease-notes%2FGFE%2F3_21_0%2FWeb%2Fgfe-v3_21_0-web-release-highlights%2F",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "RTX 3000 laptop cards stack up in comparison to their desktop siblings": "https://www.techradar.com/news/the-new-nvidia-rtx-mobile-gpus-are-here-and-we-put-them-to-the-test",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Hexus": "https://hexus.net/tech/news/graphics/147332-nvidia-geforce-experience-321-intros-ai-powered-whispermode/"
  }
}