{
  "source": "https://www.techradar.com/news/horizon-forbidden-west-delayed-to-2022-but-its-not-all-bad-news",
  "title": "Horizon Forbidden West delayed to 2022, but it's not all bad news",
  "category": "gaming",
  "updated": "2021-08-25T19:29:13Z",
  "author": "adam-vjestica",
  "summary": "There's never been a better time to play Horizon Zero Dawn",
  "article": [
    "Horizon Forbidden West has been delayed to 2022, developer Guerilla Games has confirmed.",
    "The sequel to Horizon Zero Dawn is now set to release on February 18, 2022, which means that Sony will be without a big first-party exclusive release for the holiday season.",
    "But it isn't all bad news for PlayStation 5 owners. Horizon Zero Dawn has received a new update which lets the game run at 60fps, just like we've seen for God of War, Days Gone, Ghost of Tsushima and The Last of Us 2.",
    "Update 1.53 unlocks the game's previous 30fps cap, meaning players can enjoy a smoother and more responsive experience that's more akin to the PC release of the game. The patch also fixes a streaming issue that was present when playing the game on PS5.",
    "Here are the full patch notes below:",
    "While it's disappointing to see Horizon Forbidden West's 2021 release date slip to next year, it's certain to give developer Guerilla Games the time it needs to ensure the PS5 exclusive is just as polished as we'd expect.",
    "The game will also release on PS4, which means that if you haven't managed to buy a PS5 yet, you won't have to miss out on Aloy's next big adventure."
  ],
  "headers": {},
  "links": {
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review"
  }
}