{
  "source": "https://www.techradar.com/news/icloud-apples-cloud-storage-service-is-getting-a-free-vpn-and-more",
  "title": "iCloud+: Apple’s cloud storage service is getting a free VPN and more",
  "category": "computing",
  "updated": "2021-06-07T19:13:57Z",
  "author": "joel-khalili",
  "summary": "iCloud is getting a major expansion - and a new name",
  "article": [
    "Apple has announced a series of privacy-centric features for its premium cloud storage service, which has been rebranded iCloud+.",
    "At the company’s annual WWDC conference, Apple revealed three new additions for the service: a VPN-like tool, new email privacy feature and improved support for home security set-ups.",
    "The new-look subscription package is designed to provide Apple customers with the tools they need not only to store their files securely, but also shield their online activity and personally identifiable information (PII).",
    "The most exciting iCloud+ upgrade is probably Private Relay, a VPN-like service said to allow users to browse Safari in a more secure and private way.",
    "“On any given day, we all use a variety of networks to browse the web. Behind the scenes, network providers and websites can combine your identity and browsing history into a detailed profile about you,” said Apple.",
    "“[Private Relay] ensures the traffic leaving your device is encrypted, so no one can intercept and read it. Then all the requests are sent through two separate internet relays.”",
    "According to Apple, no one will be able to see what sites users are visiting when Private Relay is active, including itself. It’s not clear, however, whether the service will allow users to throw their IP address to another location, or unblock geo-restricted VOD content.",
    "The second new feature, called Hide My Email, allows users to create new email addresses that can be handed out in situations where they would prefer not to share their personal address (e.g. when filling out a web form).",
    "iCloud+ customers can set up as many new addresses as they need, each of which will forward emails to the original inbox. These forwarding addresses can be managed from within Apple Mail and Safari settings.",
    "Finally, Apple announced built-in support for HomeKit Secure Video, which will mean users can collect footage from a greater number of home security cameras. And none of the video will count towards iCloud+ storage limits.",
    "The price of Apple’s premium cloud storage subscriptions will remain unchanged, with all the new features coming at no additional cost. The 50GB plan is cheapest, at $0.99/AU$1.49/£0.79 per month."
  ],
  "headers": {
    "3": "iCloud+ features"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "email": "https://www.techradar.com/news/best-email-provider"
  }
}