{
  "source": "https://www.techradar.com/news/343-industries-says-it-has-no-current-plans-for-halo-wars-2-or-a-sequel",
  "title": "343 Industries says it has ‘no current plans’ for Halo Wars 2 or a sequel",
  "category": "gaming",
  "updated": "2021-02-13T10:02:37Z",
  "author": "emma-boyle",
  "summary": "Halo Infinite but not infinite Halo",
  "article": [
    "The immediate future doesn’t look particularly bright for the Halo Wars series after 343 Industries has said it has “no current plans” to add to its 2017 game Halo Wars 2 or to develop a sequel.",
    "Back in 2019, fans of Halo Wars 2 used a petition to ask that 343 Industries continue support for the game by adding new content, features and making quality of life improvements. 343 Industries responded to say that it was “unable to commit to any future Halo Wars 2 continued development or support” as the team that was bringing the Master Chief Collection to PC was “also the team that helped make Halo Wars 2 a reality” and that “resources that were previously focused on Halo Wars 2 have been pulled over to help support MCC and Halo: Reach development.”",
    "In the same post, 343 also said “never say never” to the idea of returning to Halo Wars 2, so now that the Master Chief Collection has arrived on PC in full, some still-hopeful fans wondered if now might be the time, especially after a recent job listing (via IGN) hinted at “a new project in the Halo universe”.",
    "However, 343 has confirmed in a recent Waypoint post that’s not to be the case and separately confirmed that the job listing was for Halo Infinite.",
    "In a new post on Halo Waypoint 343 community manager John Junyszek wrote “It’s not always easy to be open and transparent - particularly when we expect it’s not an answer the community wants to hear - but we want to give it to you straight: 343 Industries has no current plans for further Halo Wars 2 work including content updates, balance patches, bringing the title to other platforms, or a new game in the series,” adding, ”We will, however, continue to monitor the game and ensure everything is working as expected.”",
    "Junyszek did offer some hope by pointing out that “currently” doesn’t mean never, saying, “Yes, we did use the word ‘currently’ because it’s the truth – as of today, there is no plan for the development team to re-engage with Halo Wars 2 and we aren’t working on a new game in the series at this time. But, we’re specifically never going to say never because, well, who knows what the future may bring. “",
    "The reason for the indefinite step back from the Halo Wars series is, according to Junyszek, simply down to “the realities of finite time, resources, and focus for the studio.”",
    "He explained that 343 Publishing “has no shortage of ideas and inspiration to pursue for MCC and plenty of ongoing work to support the Halo franchise. Meanwhile, the majority of the studio is incredibly focused working towards Halo Infinite’s launch (and you may have also heard, ‘launch is only the beginning’).",
    "“Given the broader impact initiatives the studio is already committed to, we unfortunately can’t devote the time and attention we’d need to deliver additional updates and content for the Halo Wars franchise.”",
    "Now that 343’s plans around Halo Wars have been laid out, it looks like it’s full steam ahead to Halo Infinite, which is expected to launch later this year for Xbox One, Xbox Series X, Xbox Series S and PC."
  ],
  "headers": {
    "6": "Finite time and resources"
  },
  "links": {
    "Halo Wars 2": "https://www.techradar.com/news/halo-wars-2-review",
    "responded": "https://www.halowaypoint.com/en-us/forums/38bd6e2ebbb14e5b9b359bb029588800/topics/halo-wars-2-petition-response/e99f479e-06d4-483a-92b5-6bcf2bf4a4f5/posts",
    "IGN": "https://www.ign.com/articles/unannounced-halo-game-seemingly-in-development",
    "the job listing was for Halo Infinite": "https://twitter.com/Unyshek/status/1358864437424259073?s=20",
    "new post on Halo Waypoint": "https://www.halowaypoint.com/en-us/news/lovely-letters",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}