{
  "source": "https://www.techradar.com/news/gears-6-release-date-xbox-series-x-update",
  "title": "Gears 6 release date for Xbox Series X isn't expected soon due to this switch",
  "category": "gaming",
  "updated": "2021-05-10T16:20:17Z",
  "author": "samuel-tolbert",
  "summary": "But Gears 6 is locked and loaded for upgrades",
  "article": [
    "It may be a while before Gears 6 is announced, much less released for Xbox Series X, Xbox Series S and PC. The developers at The Coalition released a blog post today, stating that the team is working on upgrading from Unreal Engine 4 to Unreal Engine 5 in order to better work on \"multiple new projects.\"",
    "\"Shifting to a new engine is a big undertaking, so we want to be clear that we will not be announcing any new projects or titles for some time,\" the team says.",
    "Support for Gears 5 will continue through 2021 with Operation 7 and Operation 8, each of which brings new characters, new maps and more.",
    "The team closes the blog post by saying \"We’re eager to get to work and show you what we’re working on when the time is right.\"",
    "The Coalition is one of the 15 studios at Xbox Game Studios. Together, with Bethesda Softworks, these two publishing divisions make up Xbox first-party with 23 separate studios.",
    "In the Xbox One generation, the team at The Coalition released Gears of War: Ultimate Edition, Gears of War 4 and Gears 5 from 2015 through 2019, as well as the console version of Gears Tactics in 2020 and upgrades like a 120 FPS mode on Xbox Series X and S for Gears 5.",
    "With The Coalition switching to Unreal Engine 5 and openly stating that it'll be a while before the studio's next game is released, it'll be interesting just what form the \"multiple new projects\" take. No doubt Gears 6 is one of the games being worked on but what else is in store? We'll have to wait and see."
  ],
  "headers": {
    "4": "Not just a pillar"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "blog post": "https://www.gears5.com/the-future-of-gears-5",
    "120 FPS mode": "https://www.windowscentral.com/list-xbox-series-x-and-s-games-120-fps-support"
  }
}