{
  "source": "https://www.techradar.com/news/switch-oled-wont-fix-potential-joy-con-issues-nintendo-confirms",
  "title": "Switch OLED won't fix potential Joy-Con issues, Nintendo confirms",
  "category": "gaming",
  "updated": "2021-07-12T13:30:10Z",
  "author": "adam-vjestica",
  "summary": "There’s no joy to be had here",
  "article": [
    "If you were wondering whether the Nintendo Switch OLED comes with updated Joy-Con controllers – ones that would specifically eliminate the dreaded hardware issue known as Joy-Con drift – you might be disappointed.",
    "A Nintendo representative told GameSpot that the Joy-Con controllers that come with the new Switch are the same stock controllers we’ve seen since the console first launched in March 2017, and therefore will still be susceptible to developing drift.",
    "\"The Joy-Con controller configuration and functionality did not change with the Nintendo Switch system (OLED model),\" the Nintendo representative said. \"The configuration and functionality is the same as that of the Joy-Con controllers for the Nintendo Switch system.\"",
    "Joy-Con drift has impacted a large number of Switch users, and occurs when the analog stick of either Joy-Con inputs signals even when in the neutral position. This can lead to your onscreen crosshair or character moving without any input from the user. Nintendo has faced multiple lawsuits regarding the problem, including one from a child, and even publicly apologized for Joy-Con drift in 2020.",
    "However, it seems that no changes have been made to combat the issue, which could dissuade users who were thinking about upgrading to the Switch OLED model in hopes it might correct the problem.",
    "Stick drift isn't an issue that's exclusive to Switch hardware – Sony's DualSense controller and Microsoft's Xbox controller can also exhibit the problem – but the Switch seems more susceptible because of the Joy-Con controllers less robust design.",
    "The Nintendo Switch OLED is technically the fourth iteration of Nintendo’s popular handheld hybrid console since its release in 2017. We’ve seen the Nintendo Switch and Nintendo Switch Lite, along with an updated Switch that improved battery life. The Switch OLED is more of the same, however, it features a 7-inch OLED screen, an improved kickstand and speakers, and a new dock that includes a LAN port. It also boasts more storage than the original Switch: 64GB as opposed to 32GB.",
    "Despite multiple rumors of a Nintendo Switch Pro, the Switch OLED model isn’t capable of outputting at 4K resolution when docked, nor does it feature any hardware upgrades to make Switch games run better. The Nintendo Switch OLED launches on October 8 for $349 / £309 / AU$539 and is available to pre-order now."
  ],
  "headers": {
    "6": "What’s new about the Switch OLED?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "GameSpot": "https://www.gamespot.com/articles/oled-nintendo-switch-model-has-the-same-joy-cons-nintendo-confirms/1100-6493614/?UniqueID=0C154300-DFEC-11EB-BABD-54103A982C1E&TheTime=2021-07-08T12%3A57%3A27&ServiceType=twitter&ftag=ftag%3DGSS-05-10aab8e&PostType=image",
    "Joy-Con": "https://www.techradar.com/how-to/how-to-fix-joy-con-drift-on-nintendo-switch",
    "from a child": "https://www.techradar.com/news/now-nintendo-is-being-sued-by-a-child-over-joy-con-drift",
    "publicly apologized for Joy-Con drift in 2020": "https://www.techradar.com/news/nintendo-finally-apologizes-for-joy-con-drift-amid-lawsuit",
    "Sony's DualSense controller": "https://www.techradar.com/news/ps5-stick-drift-might-be-inevitable-according-to-this-comprehensive-teardown",
    "Xbox controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "pre-order now": "https://www.techradar.com/deals/nintendo-switch-oled-stock-where-to-buy"
  }
}