{
  "source": "https://www.techradar.com/news/amd-radeon-rx-6900-xt-topples-nvidia-to-claim-gpu-clock-speed-record",
  "title": "AMD Radeon RX 6900 XT topples Nvidia to claim GPU clock speed record",
  "category": "computing",
  "updated": "2021-04-21T16:53:24Z",
  "author": "carly-page",
  "summary": "Overclocker pushes the flagship GPU to its limit",
  "article": [
    "An AMD Radeon RX 6900 XT graphics card that features an featuring an “updated” Navi 21 XTXH GPU has been overclocked to a record 3.2GHz.",
    "When AMD first launched Radeon RX 6000 series - albeit in limited quantities - the GPUs had an artificial limit to a maximum clock speed of 3GHz, which blocked any attempts to go higher. AMD recently started shipping its higher-binned Navi 21 XTXH GPUs to AIBs which increases this limit to 4GHz, and it allows overclockers to reach new heights.",
    "German overclocker Der8auer got his hands on PowerColor's Radeon RX 6900 XT Red Devil Ultimate, a premium card aimed at overclocking and AMD enthusiasts that's one of the first GPUs to ship with the Navi 21 XTXH GPU, and he's already the card to its limit.",
    "With standard liquid cooling, the PowerColor Radeon RX 6900 XT hit speeds of around 2.85GHz in the 3D Mark test. However, when Der8auer moved over to LN2 (liquid nitrogen) cooling, the GPU hit an impressive 3.2GHz clock speed - way beyond PowerColor's listed OC boost speeds of 2.25GHz.",
    "This is the fastest frequency ever achieved by any GPU to date and is about 200 MHz higher than the previous world record which was set by Kingpin on an Nvidia GeForce RTX 1080 Ti GPU.",
    "What's more, Der8auer says that the card might just have the potential to go up to 3.5 GHz with increased voltages - which means this could be the ultimate graphics card for keen overclockers.",
    "Still, that doesn't mean they'll be able to get their hands on one. Due to the ongoing component shortage crisis, AMD Radeon RX 6000 GPUs are vanishing from shelves as soon as appear - much like Nvidia's RTX 3000 series cards.",
    "Via: VideoCardz"
  ],
  "headers": {},
  "links": {
    "AMD Radeon RX 6900 XT": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "RX 6000 series": "https://www.omgpu.com/amd-radeon-rx-6000-performance-specification-prix-et-date-de-sortie/",
    "limited quantities": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6800-find-stock-here",
    "PowerColor's Radeon RX 6900 XT Red Devil Ultimate": "https://www.techradar.com/news/this-powercolor-rx-6900-xt-is-the-fastest-big-navi-card-you-can-get",
    "Nvidia GeForce RTX 1080 Ti GPU": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1080-ti",
    "AMD Radeon RX 6000": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "VideoCardz": "https://videocardz.com/newz/der8auer-breaks-gpu-clock-speed-world-record-with-3-225-ghz-on-powercolor-rx-6900-xt-liquid-devil-ultimate"
  }
}