{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-november-12-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-11-12T15:00:19Z",
  "author": "axel-metz",
  "summary": "Here’s what’s new on Netflix and other streamers this weekend",
  "article": [
    "It’s only November, but Christmas is already beginning to rear its festive head on streamers. This week, we’re treated (or subject) to a remake of Home Alone on Disney Plus, but the next month will see plenty more snow-capped movies and TV shows make their way to the likes of Netflix, Amazon Prime and HBO Max.",
    "Our advice, then, is to enjoy the non-Christmas content while you can. Luckily, there’s several exciting new streaming additions to enjoy this weekend, from Rebecca Hall’s poignant directorial debut, Passing, to the Will Ferrell-starring The Shrink Next Door on Apple TV Plus.",
    "To help you decide what to watch, we’ve rounded up the seven biggest movies and TV shows worth tuning into over the next few days.",
    "In this big-budget Netflix original movie, a daring heist brings together FBI agent Dwayne Johnson and art criminal Ryan Reynolds to foil the plans of rival thief Gal Gadot.",
    "Gadot is the subject of the titular Red Notice in this one, a global alert to hunt and capture the world’s most wanted, so we’re anticipating a John Wick-esque action adventure with heaps of humor thrown in for good measure.",
    "Early reviews haven't been too kind so far, but the chemistry of its charismatic (and undoubtedly expensive) leads should outweigh its lack of originality in the plot department.",
    "Now available to stream on Netflix",
    "The Shrink Next Door, the hotly-anticipated new dark comedy series fronted by Will Ferrell and Paul Rudd, lands on Apple TV Plus this weekend.",
    "Inspired by true events (and the hit Bloomberg podcast of the same name), this eight-episode show follows the relationship between celebrated psychiatrist Dr. Isaac “Ike” Herschkopf (Rudd) and his longtime patient, Martin “Marty” Markowitz (Ferrell).",
    "Both Ferrell and Rudd served as executive producers on the show, which was written by award-winning screenwriter Georgia Pritchett (Succession, Veep), so we’re excited to see its oddball drama unfold.",
    "Now available to stream on Apple TV Plus",
    "The second Netflix original movie of the week, Passing follows two black women (Tessa Thompson and Ruth Negga) who can 'pass' as white, but choose to live on opposite sides of the color line in 1929 New York.",
    "Based on the celebrated novel by Nella Larsen, this one marks actress Rebecca Hall's directorial debut, and has been near-universally praised for the sensitive handling of its complex subject matter and important examination of racial identity in the early 20th century.",
    "Its lead performances are already proving the subject of much Oscar buzz, too, so expect to be hearing awards noise about this one long into next year.",
    "Now available to stream on Netflix",
    "In fairness to Disney, it’s been a while since it last remade one of its classic movies – we just didn’t want the next one to be Home Alone.",
    "The title, at least, is different. Sort of. The plot? Not so much. Home Sweet Home Alone follows troublesome youth Archie Yates (Jojo Rabbit) as he attempts to defend his home from invading crooks Ellie Kemper and Rob Delaney.",
    "There are some nostalgic cameos from original stars Devin Ratray and Macaulay Culkin, but fans of the 1990 classic shouldn’t go into this one expecting too much by way of warm Christmas magic.",
    "Now available to stream on Disney Plus",
    "The acclaimed Chicago-set comedy series South Side moves from Comedy Central to HBO Max for its delayed second season, which arrives this weekend to add some humor to your entertainment diet.",
    "Season two continues in the vein of the first by following two recent community college graduates, Simon and Kareme, on the hunt for better employment opportunities while grinding through life at a furniture rental store.",
    "South Side’s debut outing, which aired more than two years ago, won over critics with its diverse cast of characters and smart situational comedy, so we expect season 2 to offer more of the same.",
    "Now available to stream on HBO Max",
    "The latest in Disney’s long line of behind-the-scenes documentaries is Under the Helmet, a deep dive into the history of Star Wars’ most iconic bounty hunter, Boba Fett.",
    "Like Marvel’s Assembled documentaries before it, this one will combine interviews and never-before-seen archive footage to paint a picture of Fett’s enduring legacy as one of the coolest movie characters of all time. And it dropped on Disney Plus Day alongside a slew of other announcements, so be sure to check our Disney Plus Day hub for more news and reveals as they arrive.",
    "Disney hasn't released an official trailer, so we’ve attached the brand new The Book of Boba Fett trailer, instead, to get you in the mood for the macho mandalorian.",
    "Now available to stream on Disney Plus",
    "Sticking with the documentary theme, Mayor Pete lands on Prime Video this weekend to tell the inside story of Pete Buttigieg’s headline-generating campaign to be the youngest US President of all time.",
    "Mayor Pete charts the journey of the young politico from the earliest days of his campaign through to his unlikely, triumphant victory in Iowa, and examines how his leadership bid changed the lives of those involved in it.",
    "This one is directed by Jesse Moss, who helmed acclaimed documentaries Boys State and The Overnighters, so we’d say it's absolutely worth a watch if you’re into your politics.",
    "Now available to stream on Amazon Prime Video"
  ],
  "headers": {
    "3": "Red Notice (Netflix)",
    "7": "The Shrink Next Door (Apple TV Plus)",
    "11": "Passing (Netflix)",
    "15": "Home Sweet Home Alone (Disney Plus)",
    "19": "South Side season 2 (HBO Max)",
    "23": "Under the Helmet: The Legacy of Boba Fett (Disney Plus)",
    "27": "Mayor Pete (Amazon Prime Video)"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Disney Plus Day hub": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
    "The Book of Boba Fett": "https://www.youtube.com/watch?v=rOJ1cw6mohw"
  }
}