{
  "source": "https://www.techradar.com/news/steam-deck-windows-11-support-could-be-great-news-for-gamers",
  "title": "Steam Deck Windows 11 support could be great news for gamers",
  "category": "gaming",
  "updated": "2021-08-09T10:29:20Z",
  "author": "darren-allan",
  "summary": "Assuming it’s implemented with no hitches, which Valve fully expects",
  "article": [
    "The Steam Deck should be good to go with Windows 11, for those who are thinking about replacing the default operating system – a custom version of Steam OS (Linux) – with Microsoft’s desktop OS.",
    "While we already know that Windows 10 will be compatible with the portable PC for those who might want to make the switch to Microsoft, Windows 11 is a distinctly thornier issue due to its system requirements including the stipulation for TPM.",
    "If you recall, Windows 11 has been causing a stir by leaving certain PCs out in the cold due to that requirement for TPM or Trusted Platform Module, a tiny security coprocessor (on the motherboard, or built into the CPU) that toughens up the defenses of a device against exploits.",
    "So, will Valve’s hardware be good to go TPM-wise? Greg Coomer, a product designer at Valve, told PC Gamer: “There’s work looking at TPM just now. We’ve focused so much on Windows 10, so far, that we haven’t really gotten that far into it. Our expectation is that we can meet that.”",
    "Coomer adds that ensuring this compatibility is also about working with AMD, which is making the Zen 2-based processor for Valve’s handheld, and that it’s “a conversation that’s going on with AMD to make sure that, at the BIOS level, we can accommodate that. So there’s nothing to indicate to us yet that there’ll be any issues with Windows 11.”",
    "Things should be just fine with the Steam Deck and Windows 11, then, although Coomer’s statement does, of course, leave a little room for doubt in that it’s a current ‘expectation’ as opposed to a certainty.",
    "Valve seems to be aiming for the utmost in terms of versatility with the Steam Deck, and working to ensure that you can replace the default custom Linux operating system with Windows 11, if you wish to do so, is another good example of the openness and flexibility that the device is bringing with it. A laudable philosophy indeed…",
    "That said, Steam OS will be a major part of the overall Steam Deck experience, so it’s certainly true that most folks won’t want to get rid of the default OS – as running it will come with benefits such as the operating system automatically handling software updates, things like new drivers and so forth. Less tech-savvy users will particularly appreciate that kind of convenience and ease of use.",
    "Still, even if the number of gamers wanting to use Windows 11 with the Steam Deck is very much a niche, it’s great to have that option: the more choice, the merrier, as ever. And if Valve does struggle to implement compatibility for the Steam Deck with certain Windows games, then using Windows 11 will obviously give you a cast-iron guarantee you can run anything (and don’t forget that includes games outside of your Steam library, and Windows apps for that matter).",
    "Remember that Valve has promised that games which are currently troublesome to run using the Proton compatibility layer (which will facilitate Steam OS playing Windows titles) – due to issues like anti-cheat software – will be fully functional by the time the Steam Deck launches, and it’s working hard to ensure this. But there is a theoretical possibility that these plans could somehow stumble or falter, at least partly, and if so, Windows 11 should be on hand as an alternative for any frustrated gamers."
  ],
  "headers": {
    "6": "Analysis: Options in spades has to be a good thing"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "system requirements including the stipulation for TPM": "https://www.techradar.com/news/hardware-vendors-can-avoid-tpm-20-for-windows-11-if-needed-heres-how",
    "PC Gamer": "https://www.pcgamer.com/steam-deck-windows-11-tpm-compatibility/",
    "utmost in terms of versatility with the Steam Deck": "https://www.techradar.com/news/steam-deck-game-streaming-offers-8-hours-of-battery-life-and-loads-of-flexibility",
    "Steam Deck launches": "https://www.techradar.com/news/when-will-you-actually-get-your-steam-deck"
  }
}