{
  "source": "https://www.techradar.com/news/lg-oled-evo",
  "title": "What is LG OLED evo?",
  "category": "televisions",
  "updated": "2021-06-28T11:28:26.880Z",
  "author": "henry-st-leger",
  "summary": "LG’s new OLED TV panel technology explained",
  "article": [
    "What is LG OLED evo? The new panel technology is whipping up a storm in today’s OLED TV market, by improving manufacturing methods to increase the brightness output possible in an OLED display.",
    "OLED TVs are, by and large, capable premium screens – though their relatively dim brightness compared to high-end LCD and QLED TVs remains a sore point for many, especially those who tend to watch in well-lit rooms or during daytime hours. While an OLED TV may be ideal for a dedicated home theater room, the realities of some homes mean that a bright LCD display can often be more practical.",
    "That’s all changing with the arrival of OLED evo, which is how LG describes the unique panel used in its LG G1 Gallery Series flagship.",
    "But how does OLED evo actually work, and how much of a difference does it really make?",
    "OLED evo is how LG Electronics refers to the brightness-enhanced OLED panel technology used in its 2021 flagship, the LG G1.",
    "LG tells us directly that “LG OLED evo is a combination of a new panel and optimised processing, available exclusively in G1-series. OLED evo technology is the next step in the evolution of LG OLED that delivers better luminosity for higher brightness and punchy images with amazing clarity, detail, and realism.”",
    "The panel itself improves on LG’s regular OLEDs “with an added layer made of stronger emissive material that refines the wavelengths of light and as a result, increases efficiency and improves brightness with the same amount of light input. The materials used for OLED lighting have also been changed to enhance and strengthen light intensity and this is what delivers the brighter, sharper images.”",
    "We’re also told that the OLED evo panel was specifically designed for the “optimised processing within the Alpha 9 Gen 4 Processor,” meaning you wouldn’t necessarily get the same results with the cheapest a7 (Alpha 7) chipset range used in the LG B1 and LG A1.",
    "OLED evo is said to increase peak brightness by 20% – a notable uptick given the usual brightness of OLED screens, which lags far behind the 1,000 nits used to master HDR (high dynamic range) content.",
    "OLED evo doesn’t currently have the capabilities to get to 1,000 nits, but it certainly gets closer. In our LG G1 review, we recorded a peak brightness reading of “just over 870 nits” rather than the “754 nits of last year’s GX range.”",
    "We noted that “the peak brightness reduces by 100 nits or so when you shift from the (inadvisable) Vivid picture preset to Standard,” meaning those gains aren’t entirely felt in more commonly-used picture modes. The extent of the G1 brightness improvement versus the GX, though, tends to be between 10% and 20% across all picture presets.”",
    "The difference isn’t seismic, but the LG G1 is certainly a better friend to high dynamic range imagery than any LG OLED before it.",
    "LG wouldn’t be drawn on plans to implement OLED evo into its other television ranges, like the C Series, B Series or A Series, telling us that “LG is unable to comment on the next stage of product development regarding increased brightness in future models.”",
    "However, we can predict a likely rollout of OLED evo based on the expansion of the 48-inch OLED TV size that first released last year.",
    "At first, the LG CX was the only OLED TV on the market to come in a 48-inch size, followed shortly by the Sony A9S and Philips OLED+935. In 2021, though, it’s a bit more common, coming to both the LG C1 and entry-level A1 – with options for both a premium model and a more affordable one.",
    "We expect to see OLED evo return in the Gallery Series model next year – likely named the ‘G2’ – though it could always come to the C Series, or even the 8K OLED TV (Z Series) for truly high-end buyers.",
    "So far, you’ll only get OLED evo with LG Electronics – which makes sense, given its close relationship with OLED panel supplier LG Display. However, we do expect that to change relatively soon, if just to make sure LG Display can start producing OLED evo at a larger (and more cost-effective) scale.",
    "We recently reported that researchers at the University of Michigan have developed a new electrode that can \"liberate\" more light from self-emissive OLED panels – at the same time as increasing energy efficiency and improving the battery life of portable OLED displays (smartphones and the like).",
    "The new design replaces a typically transparent module with a 5nm silver layer (on a copper base) that better directs light and ensures less light is lost in the transition between the panel’s diodes and the glass surface above them. The study’s authors claim that they recorded a 20% brightness increase, but predict that a 40% increase would be possible for manufacturers too.",
    "It’s that 40% increase that would really help OLED TVs compete with the brightness of QLED screens. And while brightness isn’t everything – contrast, black levels, color accuracy and processing all playing a huge part in determining a set’s picture quality – ridding OLED of this weak spot would certainly help to elevate the technology in the face of the Mini LED and Micro LED displays now entering the market."
  ],
  "headers": {
    "4": "What is OLED evo?",
    "8": "How bright does OLED evo actually go?",
    "12": "Will other LG OLED TVs get OLED evo panels?",
    "16": "Are other TV brands using OLED evo?"
  },
  "links": {
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "home theater": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "LG G1": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "LG B1": "https://www.techradar.com/news/lg-b1-oled-price-release-date-specs",
    "LG A1": "https://www.techradar.com/news/lg-a1-oled-price-release-date-specs-sizes",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "LG G1 review": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "GX": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "48-inch OLED TV": "https://www.techradar.com/best/48-inch-oled-tv",
    "LG CX": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Sony A9S": "https://www.techradar.com/news/sony-a9s-48-inch-oled-price-specs-and-features",
    "Philips OLED+935": "https://www.techradar.com/reviews/philips-oled935-tv",
    "8K OLED TV": "https://www.techradar.com/best/best-8k-tv",
    "researchers at the University of Michigan": "https://www.techradar.com/news/the-best-oled-tvs-could-get-even-brighter-heres-how",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "Micro LED": "https://www.techradar.com/news/micro-led-tv"
  }
}