{
  "source": "https://www.techradar.com/news/you-can-use-lgs-new-ultragear-gaming-speaker-for-team-chat-instead-of-headsets",
  "title": "You can use LG's new UltraGear Gaming Speaker for team chat instead of headsets",
  "category": "audio-visual",
  "updated": "2021-08-30T22:41:40Z",
  "author": "nick-pino",
  "summary": "A soundbar for gamers everywhere",
  "article": [
    "After its unveiling way back at CES 2021, LG has finally put a release date to its brand-new gaming soundbar, the LG UltraGear Gaming Speaker GP9.",
    "The speaker is due out in September in South Korea, the US and parts of Europe. While we still don’t know the price, LG has given us all the specs and features – some of which sound absolutely amazing for gamers, cinephiles and audiophiles alike.",
    "Among the newly announced features are LG’s proprietary 3D Gaming Sound technology that utilizes a special HRTF (head-related transfer function) algorithm to simulate virtual surround sound that you’d hear from a gaming headset in a two-channel soundbar. It’s also DTS:X Headphone-certified which means you’ll be able to hear some spatial audio effects in movies as well.",
    "We also now know that the GP9 will use a built-in Hi-Fi Quad DAC (ES9038PRO) and supports Hi-Res Audio, which is perfect for audiophiles who want to get in a listening session between matches, as well as a built-in microphone that allows you to talk with your teammates without putting on a headset. For gamers, that alone could be a real game-changer.",
    "LG obviously designed the GP9 to be paired with one of its UltraGear monitors – like, say, the stunning LG UltraGear 38GN950 – but there’s no feature that’s exclusively locked to LG hardware. If you want to pair it with a different monitor, go right ahead.",
    "In fact, according to LG, the soundbar works with both PCs and the latest gaming consoles via a USB-C and optical audio cable, but there’s also Bluetooth if you want to stream music from your phone or tablet, too.",
    "LG isn’t the first to make a gaming soundbar by any means – Creative, Panasonic and Polk have all made a gaming-specific model – but LG’s does seem to be the most robust yet, and to our knowledge it’s the only one that supports Hi-Res Audio.",
    "While it's unlikely to overtake your living room's surround sound anytime soon, if it's priced appropriately the LG UltraGear Gaming Speaker GP9 could be a great alternative to standard PC speakers and a replacement for your constantly breaking gaming headset."
  ],
  "headers": {
    "4": "A soundbar designed with monitors – and consoles, phones and PCs – in mind"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "LG UltraGear 38GN950": "https://www.techradar.com/reviews/lg-ultragear-38gn950",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}