{
  "source": "https://www.techradar.com/news/halo-infinites-controversial-battle-pass-progression-just-got-a-whole-lot-better",
  "title": "Halo Infinite’s controversial Battle Pass progression just got a whole lot better",
  "category": "gaming",
  "updated": "2021-11-30T10:26:57Z",
  "author": "adam-vjestica",
  "summary": "Earn significantly more XP",
  "article": [
    "Halo Infinite will now reward players with significantly more XP for completing the first six matches of each day, which should make progressing through the game’s Battle Pass a lot easier.",
    "343 Industries’ community manager John Junyszek announced on Twitter that players would now receive increased XP. The first game of each day will reward players with 300 XP, the second and third games will grant players 200 XP, while the fourth, fifth and sixth games will give players 100 XP. After that, it’s back to the regular 50 XP payout.",
    "Junyszek hopes the change will benefit those who jump on and play each day, but stressed that the team at 343 is aware that “many of you want even larger changes and we’re committed to doing so,” but noted that “those will take time.”",
    "The XP changes will mean that players who have completed all their weekly challenges will only need to play six games of Halo to level up as opposed to 20, which is obviously a huge difference.",
    "343 Industries recently changed the XP system to award players 50 XP per game played, and also doubled the time of XP Boost items from 30 minutes to an hour. This change, however, goes much further in addressing complaints that Halo Infinite's Battle Pass is a slog to get through.",
    "While it’s worth stressing that Halo Infinite’s multiplayer is still in beta, the game’s Battle Pass continues to draw the ire of players who believe progression is too slow, and that the game’s challenges go against the spirit of Halo.",
    "Previous Halo games, and other popular first-person shooter titles, tend to award XP based on your personal or team’s performance after a game. That’s not the case with Halo Infinite, which only gives players XP for completing matches or arbitrary challenges.",
    "One of Halo’s key strengths over other titles is its sandbox nature, and forcing players to complete specific challenges is counterintuitive to the experimental and freeing nature of Halo Infinite’s gameplay, as it forces you to use certain weapons and play a certain way, which can sometimes be to the detriment of your team.",
    "Again, with Halo Infinite’s multiplayer launching early, it’s given the team at 343 Industries a massive headstart in addressing the most critical issues that players are taking issue with. Crucially, the game isn’t plagued with technical or server issues, which is often the case with far too many online-focused games these days. Halo Infinite’s gameplay has also been widely regarded as excellent.",
    "Halo Infinite’s multiplayer official launches on December 8 alongside the game’s campaign. We’ve been hands-on with Master Chief’s next adventure, and came away extremely impressed."
  ],
  "headers": {
    "5": "Analysis: Halo Infinite’s multiplayer is brilliant; its Battle Pass less so"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "hands-on with Master Chief’s next adventure": "https://www.techradar.com/reviews/halo-infinite"
  }
}