{
  "source": "https://www.techradar.com/news/new-horror-movies",
  "title": "New horror movies 2021: every big scary film coming to theaters and streamers",
  "category": "entertainment",
  "updated": "2021-11-30T11:45:57Z",
  "author": "axel-metz",
  "summary": "Plenty of new horror movies are on the horizon",
  "article": [
    "After the pandemic-induced chaos of 2020, this year has turned out to be a great year for movies – new horror movies, in particular. But there are plenty more to look forward to in 2021 and beyond.",
    "In the below list, we've highlighted the most hotly-anticipated horror films worth keeping an eye out for as we move into 2022 – from returning franchises like Halloween and Jeepers Creepers to original scary flicks like Jordan Peele’s Nope.",
    "We're updating our picks regularly with new entries and revised release dates whenever relevant, especially as studio schedules continue to shuffle without warning in light of ongoing Covid-19 regulations.",
    "Alongside the horror movies going straight to theater screens, we've also included those hitting the likes of Netflix, HBO Max, Shudder and Hulu, too. Where we’re unsure of a movie’s destination, we’ve assumed the former, and have included posters or stills where possible.",
    "When? December 2, 2021",
    "Where? Shudder",
    "We all love a good Christmas movie, don't we? In Patrick Ridremont’s upcoming Shudder exclusive, a wheelchair-bound ex-dancer is given a mysterious advent calendar which isn't quite as festive as it seems. The streaming service describes this one as an “ornate and elegant French horror fantasy combining Faustian themes, European folklore and tense, chilling terror\" – so yeah, maybe don't show this one to the kids?",
    "When? November 24, 2021 (US), December 3, 2021 (UK)",
    "Where? Theaters",
    "Yes, the long-running movie franchise based on the even-longer-running videogame franchise is getting a reboot. Resident Evil: Welcome to Raccoon City will see 47 Meters Down director Johannes Roberts marshal the survival horror carnage, with The Maze Runner's Kaya Scodelario starring as Claire Redfield. The Tomorrow People's Robbie Amell and Ant-Man and the Wasp's Hannah John-Kamen also feature. It looks a lot closer to the games than the previous movies did, which is hopefully to its benefit.",
    "When? December 31, 2021",
    "Where? Theaters",
    "BBC Culture has already called Julia Ducournau’s Titane \"the most shocking film of 2021,\" which has us more excited than we otherwise usually would be to see a movie about a woman with a unique attraction to cars. Titane follows Alexia (Agathe Rousselle in her feature film debut), a woman who, after being injured in a car accident as a child, has a titanium plate fitted into her head. Ducournau wowed audiences with her 2016 debut, Raw, so we've got high hopes for this one.",
    "When? January 14, 2022",
    "Where? Theaters",
    "Moving into 2022, Scream will see Ready or Not directors Matt Bettinelli-Olpin and Tyler Gillett breathe (or scream?) new life into the long-running horror franchise. Though marketed without the numerical title, the movie will be a direct sequel to 2011's Scream 4, and the first in the series not to be directed by Wes Craven, who died in 2015.",
    "When? January 28, 2022",
    "Where? Theaters",
    "Marvel fans, fear not – horror cinema has not left you behind. Morbius will see Jared Leto’s titular biochemist forced to face the consequences of a blood experiment gone wrong, which infects him with a vampiric mutation. Our hopes aren’t too high for this one, but Venom fans might find something to enjoy here.",
    "When? February 4, 2022",
    "Where? Theaters",
    "Wow, an entirely new IP? Not exactly. The Black Phone will see director Scott Derrickson adapt a 2004 short story of the same name by Joe Hill, which follows the plight of a kidnapped child who communicates – through, you guessed it, a black phone – with his kidnapper’s previous victims to try and escape. Sounds like a neat premise, at least.",
    "When? TBA, early 2022",
    "Where? Netflix",
    "There’s not much to go on for this one, but Texas Chainsaw Massacre is returning as a Netflix movie directed by David Blue Garcia, based on an original story co-written by Fede Álvarez and Rodolfo Sayagues (both known for their work on Evil Dead and Don't Breathe). It will represent the ninth instalment in the franchise, and is intended to be a direct sequel to the 1974 original.",
    "When? TBA, early 2022",
    "Where? Theaters",
    "Another reboot – though perhaps from a less well-known horror franchise – is hitting theatres in 2022 in the form of Jeepers Creepers: Reborn. It’s being directed by Timo Vuorensola from a screenplay by Sean Michael Argo, and is intended as the first in a planned trilogy set apart from the first three movies of director Victor Salva.",
    "When? July 22, 2022",
    "Where? Theaters",
    "Get Out and Us director Jordan Peele’s next movie will star Daniel Kaluuya, Keke Palmer, and Steven Yeun, and is scheduled to hit theatres in July. Do we know anything more than that? Nope. We’ve got a poster, at least, which shows… a floating cloud. Make of that what you will.",
    "When? October 14, 2022",
    "Where? Theaters",
    "A direct sequel to Halloween Kills – which arrived in October 2021 – Halloween Ends will (supposedly) end the long-running franchise almost exactly a year later. We expect Michael Myers and Laurie Strode to both return, though, which begs the question: was Halloween Kills actually necessary? Expect some near-misses and (another) cliff-hanger ending.",
    "When? TBA, 2022",
    "Where? Hulu",
    "One movie we didn’t expect to get a reboot in 2022 was Clive Barker’s 1987 British supernatural horror, Hellraiser. This updated version will again be based on Barker's novella, The Hellbound Heart, and its existing film adaptation, so will almost definitely see the return of Pinhead and his group of sadomasochistic beings known as the Cenobites.",
    "When? TBA, 2022",
    "Where? Theaters",
    "Expected to be the fifth instalment of, and prequel to, the Predator franchise, Skull will follow the creature's first journey to Earth. 10 Cloverfield Lane director Dan Trachtenberg has signed on to direct, while Amber Midthunder, Dakota Beavers and Dane DiLiegro are all confirmed to star. No Arnie, though, unfortunately.",
    "When? TBA, 2022",
    "Where? Theaters, HBO Max",
    "One more reboot? Sure, why not. Evil Dead Rise will become the fifth instalment in the Evil Dead franchise, and will follow two sisters trying to survive and save their family from demonic creatures. Alyssa Sutherland, Lily Sullivan, Gabrielle Echols, Morgan Davies, Nell Fisher and Mia Challis are all confirmed to star, while Spider-Man director Sam Raimi will serve as executive producer alongside Irish filmmaker Lee Cronin."
  ],
  "headers": {
    "4": "The Advent Calendar",
    "7": "Resident Evil: Welcome to Raccoon City",
    "10": "Titane",
    "13": "Scream",
    "16": "Morbius",
    "19": "The Black Phone",
    "22": "Texas Chainsaw Massacre",
    "25": "Jeepers Creepers: Reborn",
    "28": "Nope",
    "31": "Halloween Ends",
    "34": "Hellraiser",
    "37": "Skull",
    "40": "Evil Dead Rise"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "BBC Culture": "https://www.bbc.com/culture/article/20210715-titane-the-most-shocking-film-of-2021"
  }
}