{
  "source": "https://www.techradar.com/news/apple-vr-headset-could-weigh-less-than-the-airpods-max",
  "title": "Apple VR headset could weigh less than the AirPods Max",
  "category": "wearables",
  "updated": "2021-03-24T10:59:49Z",
  "author": "rhys-wood",
  "summary": "Including the case, of course...",
  "article": [
    "The much-rumored Apple VR / mixed reality headset could weigh as little as 150 grams, according to respected Apple analyst Ming-Chi Kuo, who suggested as much in a research note seen by 9to5Mac.",
    "This would fill a significant gap in the virtual reality market, with competing VR headsets typically being far more bulky in terms of weight and form factor. For example, the Oculus Quest 2 weighs around 503 grams, while the Valve Index clocks in at a very chunky 809 grams.",
    "The supposed weight of Apple’s mixed reality headset would allow the device to be worn comfortably for much longer periods of time. In fact, it’s more in line with the weight of a smartphone - the iPhone 12, for example, weighs roughly 164 grams.",
    "Creating a device that packs in both augmented and virtual reality tech while using such lightweight materials likely presents a major challenge for Apple, so much so that Kuo mentions supply issues could present themselves. According to Kuo, this would push back the rumored 2022 release date.",
    "As for the cost of Apple’s mixed reality headset, Kuo believes the device will cost as much as $1000, but other analysts think it would cost up to $3000 based on the rumored specs, which include ultra-short focal length lenses and a pair of Sony-developed micro-OLED displays.",
    "The ultra lightweight form factor of Apple’s mixed reality headset might seem a little hard to believe given the rumored specs of the device, but it’s not unprecedented for the tech giant. Apple has always been on point with providing devices with relatively light builds.",
    "Apple’s Air lineup of products, for example, specialize in lightweight form factors, including the Macbook Air which weighs 1.27kg, and the iPad Air clocking in at just under 470g. When looking at these comparatively lighter weights to its competition, the rumored 150g weight of Apple’s mixed reality headset might not seem all that farfetched, after all."
  ],
  "headers": {
    "3": "Light as a feather"
  },
  "links": {
    "Apple VR / mixed reality headset": "https://www.techradar.com/news/apple-vr-headset",
    "9to5Mac": "https://9to5mac.com/2021/03/22/kuo-apple-headset-to-have-ultra-short-focal-length-lenses-and-weigh-less-than-150-grams/",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "will cost as much as $1000": "https://9to5mac.com/2021/03/07/apple-vr-ar-headset-in-2022/",
    "Macbook Air": "https://www.techradar.com/reviews/macbook-air-2020",
    "iPad Air": "https://www.techradar.com/reviews/ipad-air-4-review"
  }
}