{
  "source": "https://www.techradar.com/news/oneplus-9t-may-be-canceled-says-leaker",
  "title": "OnePlus 9T may be canceled, says leaker",
  "category": "phones",
  "updated": "2021-07-28T08:23:58Z",
  "author": "aakash-jhaveri",
  "summary": "A new leak says the OnePlus 9T may not happen this year",
  "article": [
    "The OnePlus 9 and OnePlus 9 Pro from earlier in the year took the company to new heights in the smartphone market, but it seems the company may not be following it up with a OnePlus 9T later in 2021.",
    "OnePlus often releases two series of flagship phones a year with a T series device gently iterating on the main flagship handset. A new leak has suggested that won't be the case in 2021, and the next flagship phone from the company will be the OnePlus 10.",
    "Max Jambor, a tipster who has often revealed interesting tidbits around upcoming OnePlus products, took to Twitter to say “no 9T”, suggesting that there will not be a OnePlus 9T device this year.",
    "In his tweet, he explained his thought process behind this move. His point is there isn’t much left to upgrade on the existing OnePlus 9 lineup as the screens, charging tech, performance and cameras are already adequate.",
    "A new smartphone with minor improvements would not be viable, and this is especially true for the Pro variant.",
    "His logic is quite sensible as the only clear change would be to offer the Snapdragon 888 Plus, which is nothing more than an incremental update. However, optimizing a device for a new chipset might be a difficult task, which might not even bring the performance gains that are possible.",
    "The ongoing semiconductor shortage is also likely to have an impact, and we'd expect Jambor has heard something more detailed through sources on whether the OnePlus 9T will happen or not.",
    "OnePlus has declined to comment in any official capacity. If this leak ends up being true, this would be the first time since 2015 that OnePlus will follow a refresh cycle of longer than six months. There are likely to be bigger reasons for the shift in strategy apart from the existing lineup being “good enough”.",
    "OnePlus might not be only smartphone maker to sit out of the second half of 2021 flagship game, as Samsung and a few others are also expected to stick to only one hero product this year.",
    "Apart from better utilizations of resources and greater economies of scale, this would also allow each company to announce its next crop of devices a little earlier. Rumors point at a January 2022 unveiling for Samsung’s Galaxy S22. If the OnePlus 10 series arrives in early 2022, it could better compete with Samsung.",
    "This move could also be predicated on the recent Oppo-OnePlus merger. While the brands maintain that they will continue to function independently, we can’t help but think about how they wouldn’t want to have similar products at similar price points around the same time to avoid internal product cannibalization.",
    "So there could be a possibility that Oppo unveils another flagship later this year, while OnePlus opts for early next year.",
    "Then there’s also the factor of chipset development. The successor to the Snapdragon 888 is expected in December and should make its way to global markets early next year.",
    "With Samsung likely to stick with Exynos for most countries, and the rest of the competition expected to be limited to China for a bit, it could let the OnePlus 10 be one of the first to adopt the next flagship chipset from Qualcomm."
  ],
  "headers": {
    "8": "Analysis: Reasons why the OnePlus 9T may not exist"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "OnePlus 9T device": "https://www.techradar.com/news/oneplus-9t-canceled",
    "Snapdragon 888 Plus,": "https://www.techradar.com/news/snapdragon-888-plus-5g-processor",
    "first time since 2015": "https://www.techradar.com/reviews/oneplus-3t-review",
    "Samsung’s Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Oppo-OnePlus merger": "https://www.techradar.com/news/oneplus-oppo-merger-implications-expectations",
    "likely to stick with Exynos": "https://www.techradar.com/news/samsung-and-amds-exynos-chip-could-power-your-next-laptop-and-smartphone"
  }
}