{
  "source": "https://www.techradar.com/news/should-you-buy-the-new-iphone-13-range-directly-from-apple",
  "title": "Should you buy the new iPhone 13 range directly from Apple?",
  "category": "phones",
  "updated": "2021-09-16T09:51:52Z",
  "author": "alex-hughes",
  "summary": "The iPhone 13 is almost here but is Apple the best place to buy?",
  "article": [
    "Apple has done its typically flashy launch event, revealing all of the new iPhone 13 devices, their specs, designs and the myriad of improvements on-board. Now the next step, pre-ordering your choice of the four new handsets.",
    "There is a couple of days to rest before pre-orders become available, giving you time to do your research and choose your favourite of the four. From 1pm on Friday, September 17, you'll then be able to get your pre-order in.",
    "So, where should you go to pre-order the new devices? Because this is Apple, you can expect the large majority of big retailers in both the UK and US to get involved, giving you an overwhelming amount of choice.",
    "The most obvious place to go would be Apple - it is making the devices after all! However, the key question to ask yourself is which retailer has the best offer when it comes to pre-orders?",
    "Everywhere will be offering the exact same price for the device but a lot of them will throw in an extra or two. Whether you're going for the iPhone 13 mini, 13, Pro or Pro Max, you'll need to do your research to see what's available.",
    "Unfortunately, Apple has a history of not offering much directly through its store. Even during pre-order stages, Apple tends to simply have the handsets with trade-in offers. There are usually no added extras, discounts or freebies.",
    "However, to beat out the competition, many retailers are likely to try and grab your attention in different ways. With the iPhone 12 launch last year we saw everything from free Airpods through to vouchers for Amazon, massive trade-in schemes, bonuses for switching and more.",
    "So if Apple is unlikely to go big on its pre-order offers, where should you look instead? For those in the US, this will be a case of weighing up what the other key carriers and retailers can offer.",
    "The likes of Verizon and AT&T will likely offer some big trade-in schemes and affordable pricing for unlimited data plans. Walmart, Best Buy and other retailers will also have trade-in schemes and Walmart has already confirmed an $100 off pre-order bonus.",
    "For those in the UK, there should be a lot of retailers throwing in free gifts. This could be Apple Airpods, Air Tags or vouchers for Amazon, M&S, Tesco and other popular shops. Or, like the US, an increased amount of money back on your trade in.",
    "Put simply, there will be a lot of choice when it comes to pre-ordering your new iPhone 13. When pre-orders go live on Friday at 1pm, do the research on the retailers offering the devices and find the one with the best value.",
    "We've listed the retailers we expect to be offering the four devices in both the UK and US below.",
    "iPhone 13 mini: The smallest of Apple's four new devices, the iPhone 13 mini is both the cheapest option and the one best suited for those after a more one-handed experience.",
    "Despite the smaller size, it features a lot of the same features as the iPhone 12. It has the A15 Bionic chip, Magsafe technology, a dual camera system with wide and ultrawide lenses and the same durable display with ceramic shield glass.",
    "iPhone 13: The iPhone 13 is the main device of the four, sitting in between the Pro models and the mini, offering a blend of affordability and specs, as well as a slightly larger design than the mini for those put off by its size.",
    "Just like the mini, the iPhone 13 includes Apple's A15 Bionic chip, the same durable glass display, dual camera technology and more. The main differences is its larger and slightly brighter display as well as featuring a larger battery. iPhone 13 Pro: Step up to the iPhone 13 Pro and you'll see a few key areas of the handset get improvements. Most obviously is the addition of a third camera lens and brighter and larger display.",
    "On the iPhone 13 Pro, you get three 12MP cameras that feature new sensors and lenses. Apple has made the claim that the main camera on this device is 2.2x better in low light than last year's iPhone 12 Pro - how specific!",
    "The display on the iPhone 13 Pro comes with a Super Retina XDR that has a 1200-nit peak brightness - up to 25% brighter outdoors. It also has an 120Hz refresh rate and a larger battery than the two smaller devices.",
    "iPhone 13 Pro Max: Finally, Apple's most powerful handset to date - the iPhone 13 Pro Max. In most ways, it is the same as the iPhone 13 Pro with a few minor improvements to earn its 'Max' title.",
    "The most obvious chance is the screen size, bringing you all the way up to a whopping 6.7-inches. That makes this almost the same size as Samsung's Galaxy S21 Ultra.",
    "Other than the increase in battery size, there aren't many improvements over the Pro model. It has the same processing chip, camera and MagSafe functionality and almost identical displays and glass strength."
  ],
  "headers": {
    "3": "Should you pre-order the iPhone 13 from Apple?",
    "7": "Where else will you be able to get the iPhone 13 series?",
    "12": "What are the iPhone 13 devices like?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1889437012464517400&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2F",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Verizon": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4836241639611197000/https://www.verizon.com/",
    "AT&T": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3662892066505480700/https://www.att.com/"
  }
}