{
  "source": "https://www.techradar.com/news/shadow-and-bone-season-2",
  "title": "Shadow and Bone season 2: everything we know so far",
  "category": "entertainment",
  "updated": "2021-12-01T15:25:23Z",
  "author": "tom-power",
  "summary": "Shadow and Bone season 2 is coming to Netflix",
  "article": [
    "Shadow and Bone season 2, the next installment in Netflix's adaptation of Leigh Bardugo's fantasy novel series, is in development. That, though, is all that we know about the show's second season, and it may be a while before we see it return to our TV and mobile screens.",
    "Or will it? The latest rumors suggest that Shadow and Bone season 2 will begin filming shortly, but you'll need to read on to find out more about that. The series is also up for a People's Choice award in the \"sci-fi/fantasy show of 2021\" category, and we'll find out if it wins when the ceremony takes place on December 8.",
    "In the meantime, what do we know about Shadow and Bone season 2?",
    "Below, we'll tell you everything we know about the show's second season, including its potential plot points, returning cast members, when we suspect it'll return and more. Beware spoilers for Shadow and Bone season 1, and possible future plot details based on what we know of the novels, from this point on, though. If you'd prefer not to know anything, you should turn back now.",
    "There’s no official release date for season 2 just yet.",
    "We know that a second season of Shadow and Bone is coming, as its return was confirmed during Netflix Geeked Week in June. That aside, there are no other details about when it'll be back on our screens.",
    "In a thread on his personal Twitter account, showrunner Eric Heisserer revealed that he had written a lot of (if not all) of the next entry's scripts already. And he seemingly finished penning season 2 in April 2021, right before a second season was picked up by Netflix.",
    "Check our Heisserer's Twitter thread below:",
    "That appears more likely, too, given an Instagram post from Bardugo. The author told her followers that she'd be taking a social media break over the next few months to work on, among other things, Shadow and Bone season 2. Hopefully, much of pre-production will be sorted before the year is out so that principal photography can begin in earnest.",
    "Additionally, executive producer Shawn Levy told Collider that the show would be \"heading into production shortly\" after Heisserer and Bardugo had finished penning the scripts. Since then, though, there's been no major updates to speak of.",
    "Levy's comments appear to have been backed up by Moviesr.net. Per the publication's supposed sources, Shadow and Bone season 2 was rumored to begin filming in November 2021. But, given that shooting doesn't appear to have started, that seems to be false information.",
    "According to other reports, such as one from What's On Netflix, principal photography will actually begin in January 2022. This seems to be a more believable date, too, as an Active Productions List – for movies and TV shows due to be filmed in Canada – strongly suggests that part of Shadow and Bone's second season will be shot between January 10 and May 18. Filming is also allegedly taking place in Budapest again, too.",
    "Additionally, a number of Shadow and Bone cast members are due to appear at Paris' Roster Con between January 22 and 23. So we may get official confirmation on season 2's start date here, as well as potential new cast announcements.",
    "Regardless, hopefully it won't be long before the cameras begin to roll on season 2. If that's soon, we might get Shadow and Bone's second season in late 2022. Don't get your hopes on that front, though, as there'll be plenty of post-production work to carry out once filming has ended. With that in mind, we suspect that Shadow and Bone season 2 may arrive in early 2023.",
    "There’s no confirmation on this front, but we think that all of season 1's main stars will return. That would include:",
    "As Shadow and Bone’s principal protagonists, Alina and Mal are certain to return, while Kirigan – who survived the attack in the Shadow Fold in the season 1 finale – will also be back.",
    "Kaz, Jesper and Inej, too, should be part of the season 2 line up. As in the Six of Crows duology, the Dregs’ story (more on this below) will line up with Nina and Matthias’, so we should see that trio link up with the latter duo. This was hinted at in season 1’s final episode, so expect them to join forces as they do in the novels.",
    "As for which characters could make the leap from Bardugo’s book series to the live-action TV series, Heisserer has confirmed that there will be “one hundred percent more Wylan” in season 2. In the novels, Wylan Van Eck joins the Dregs as their demolitions expert for a job inside Fjerdan’s military stronghold known as the Ice Court. But we don't know if season 2 will follow this exact storyline or not.",
    "Another character who could appear in season 2 is Nikolai Lantsov. In the books, Nikolai adopts the pseudonym Sturnhound and leads a pirate armada that aids the war effort for the kingdom of Ravka. Nikolai becomes a key ally of Alina and Mal’s, so his arrival in Netflix’s adaptation will be vital if the TV show predominantly follows Siege and Storm’s storyline in season 2.",
    "Heisserer teased Nikolai’s potential involvement in season 2 during a chat with Inverse, so he may be a new cast member when the next entry's casting announcements are revealed.",
    "No, and there won’t be for a while. If principal photography begins soon, we could get a teaser in late 2022. Until that time, there won't be any footage for any of us to view.",
    "Season 2 may follow concurrent stories from Siege and Storm and Six of Crows. With Alina and Mal going their separate ways to the Dregs following season 1’s finale, season 2 should continue their journey to new lands to keep Alina out of Kirigan’s reach.",
    "As season 1’s final entry revealed, Kirigan has tapped into his Darkling powers and created new Fold creatures known as Nichevo’ya. Unlike the Volcra that inhabit the Fold, these monsters can move in broad daylight and will prove to be difficult adversaries for Alina and Mal to overcome.",
    "Ben Barnes, who portrays Kirigan/the Darkling in Netflix’s TV show, has expressed interest in seeing season 2 “steer off” from the story in the books (per Collider) in a similar vein to how season 1 incorporated the Dregs into Alina’s arc.",
    "It’s unclear if Heisserer and the series’ other producers will do so, but it would be an intriguing twist on the source material if they did. It would give established fans some new content, like season 1 did, but we'll have to wait and see if this is an avenue that the show's creative team pursues.",
    "The Dregs, meanwhile, are likely to team up with Nina in a bid to free Matthias, with the duo – and potentially Wylan – being key to Kaz’s plan to rescue Bo Yul-Bayur, an inventor of a drug that Grisha find addictive, from Fjerda’s Ice Court. Shadow and Bone season 1 has already utilized the Ice Court’s ‘impossible heist’ angle for the Dregs’ initial mission to try and capture Alina, though, so it’s possible that Bo’s rescue may be altered for the TV series.",
    "Another arc that could be adapted from another Grishaverse duology – King of Scars – is Zoya’s. A supporting character in the Grisha trilogy, Zoya’s character is given a more prominent role in Bardugo’s second duology and elements of the story from these books may be incorporated into the TV show, as Bardugo teased in an interview with Entertainment Weekly.",
    "In the season 1 finale, Zoya was seen heading to Novokribrisk – the city that Kirigan destroys with the Fold – to search for her family. Should she find that they’ve perished, Zoya could team up with the Dregs again, as she does in the Six of Crows’ Crooked Kingdom novel, or add in parts of her story from the King of Scars book.",
    "One thing we do know is how many episodes there will be in season 2. Per The Hollywood Reporter, Shadow and Bone will return with another eight-episode run.",
    "It's unclear if this will only focus on Alina and Mal's journey, though, or if the Dregs and Zoya will also feature in some capacity (as we speculated above). We'll find out when Netflix provides a synopsis, or when the cast and crew start posting about the show on social media again. For now, we're as much in the dark as you are.",
    "Yes. While it doesn't have a following as big as other major fantasy series, such as The Witcher, Harry Potter or The Lord of the Rings, the Grishaverse still has a sizable and passionate audience. Its fanbase is likely to have grown, too, with Netflix's adaptation introduces the series to new audiences since it debuted on the streamer in April.",
    "There are plenty of directions that Netflix's adaptation of the Grishaverse can go as well. Like the streamer's growing Witcher-Verse, Shadow and Bone could potentially lead to spin-offs that delve into the wider universe and use Bardugo's source material as a base for this. Whether it's expanding on a pre-existing short story or creating entirely new content, Netflix can go in all manner of directions in and around season 2.",
    "And, if it continues to be a success, future seasons and spin-offs may be put into production by Netflix, too. The streaming giant has shown it'll put faith in projects that deliver huge viewing figures, so Shadow and Bone's future may be bright if its second season draws in a large audience again."
  ],
  "headers": {
    "4": "Shadow and Bone season 2 release date: 2023?",
    "14": "Shadow and Bone season 2 cast: which characters are returning?",
    "20": "Shadow and Bone season 2 trailer: is there one?",
    "21": "Shadow and Bone season 2 plot: what will it be?",
    "30": "Shadow and Bone season 2: does it deserve another outing?"
  },
  "links": {
    "Shadow and Bone": "https://www.techradar.com/news/shadow-and-bone-is-netflixs-new-fantasy-series-that-borrows-from-doctor-strange",
    "up for a People's Choice award": "https://twitter.com/shadowandbone_/status/1453809475006222336",
    "Collider": "https://collider.com/ben-barnes-shadow-and-bone-interview-darkling/",
    "Moviesr.net": "https://moviesr.net/p-shadow-and-bone-season-2-won-t-be-coming-before-2023-on-netflix",
    "What's On Netflix": "https://www.whats-on-netflix.com/news/shadow-and-bone-season-2-starts-filming-in-january-2022/",
    "Active Productions List": "https://www.ubcpactra.ca/wp-content/uploads/2021/11/Active-Productions-2021-11-19-15-28-50.pdf",
    "Paris' Roster Con": "https://www.rostercon.com/en/event-convention/a-storm-of-crows-and-shadows",
    "Inverse": "https://www.inverse.com/entertainment/shadow-bone-season-2-release-date-trailer-plot-spoilers-netflix",
    "Entertainment Weekly": "https://ew.com/tv/shadow-and-bone-finale-burning-questions-season-2/",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-news/shadow-and-bone-renewed-season-2-netflix-1234963789/",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "The Lord of the Rings": "https://www.techradar.com/news/lord-of-the-rings-on-amazon"
  }
}