{
  "source": "https://www.techradar.com/news/the-best-fighting-game-of-all-time-nidhogg-just-got-a-major-update-7-years-after-launch",
  "title": "The best fighting game of all time, Nidhogg, just got a major update 7 years after launch",
  "category": "gaming",
  "updated": "2021-09-16T10:10:53Z",
  "author": "gerald-lynch",
  "summary": "New levels, plus cats!",
  "article": [
    "You may not have heard of Nidhogg and its sequel, but let this post act as an education. These 2D fencing brawlers are superb, and they’re getting even better thanks to a surprise drop of new updates for both games.",
    "The original Nidhogg’s update is most surprising – despite the game being more than seven years old, developer Messhof has added a whole new battleground for swordsmen to battle it out in, as well as adding a feature where the in-game blood will no longer disappear after a time. And there are cats in the game now too!",
    "The newer (if slightly inferior) Nidhogg 2 gets two new levels, one set on a moving train, the other in an office, as well as some new costumes for your fighters.",
    "It may not have the flash of Soul Calibur, the recognizable characters of Street Fighter, or the gore of Mortal Kombat (though it comes close on that last one), but Nidhogg is simply one of the best fighting games you’ll ever play. And you may have never heard of it.",
    "Originally commissioned for the New York University Game Center's first No Quarter multiplayer show, it’s a wildly tactical sword fighting game. Playing out a bit like a high-speed, twitchy game of rock-paper-scissors as you block, parry and disarm rivals before going in for the kill, your ultimate goal is to run to the extreme end of an arena a few screens away, and then be eaten by a giant worm thing.",
    "Its trippy pixelated graphics and trancey soundtrack make it incredibly stylish too. Nidhogg is pick-up-and-play friendly, but also one of the most dastardly competitive games I’ve ever played – some matches can last seconds, others a lifetime if two well-matched duelists meet. I’ve had whole rooms of friends, including non-gamers, screaming at the TV as they watch a tensely-fought match.",
    "Nidhogg 2 tried to capture that same lightning in a bottle, and it remains a great fighter. But its 16-bit aping visuals didn’t have quite the same cool charm as the original.",
    "If you’ve never played Nidhogg or its sequel before, there’s never been a better time. It’s available on PC, PlayStation 4 (and thus PS5), macOS and even the PlayStation Vita."
  ],
  "headers": {
    "3": "Opinion: The connoisseur’s battler"
  },
  "links": {
    "Soul Calibur": "https://www.techradar.com/news/soul-calibur-vi-release-date-trailers-news-and-features",
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation Vita": "https://www.techradar.com/reviews/gaming/handheld-consoles/ps-vita-1202627/review"
  }
}