{
  "source": "https://www.techradar.com/news/oppo-x-2021-first-look",
  "title": "See the Oppo X 2021 rollable phone in action as you'll probably never be able to buy it",
  "category": "phones",
  "updated": "2021-02-26T12:12:29Z",
  "author": "aakash-jhaveri",
  "summary": "We can't stop looking at it!",
  "article": [
    "Foldables, even if in their early stage, are shaping up to be the most exciting thing to happen to smartphones in a long time. Most manufacturers are still just warming up to the idea of flexible displays, leaving a lot of experimentation (and failure) until the market matures. The Oppo X 2021 is one of the first to opt for a rollable form, and here's a closer look at everything it can do.",
    "Since OEMs are still figuring out the best ways to make these work, we are likely to see unique approaches to offering devices with flexible displays. The current crop of foldables includes clamshells, inward-folding tablets, displays on the outside, tri-folds and more.",
    "The Oppo X 2021 stands out from that crowd with a \"rollable display\" — the screen can unfurl from the side to become a larger tablet. Before you get excited, it needs to be noted that it is purely a concept product and is not intended to go on sale. Oppo hasn't talked about its pricing or specifications either.",
    "You can see the Oppo X 2021 in action in the tweet below:",
    "The biggest advantage of a rollable screen over a foldable with two distinct screens joined by a hinge is the lack of a crease. Every other foldable, including the Samsung Galaxy Z Fold 2 and the new Huawei Mate X2, has an evident wrinkle running through the spine, affecting the viewing and swiping experience. It might not be a deal-breaker for everyone, but it’s better to not have one at all.",
    "The Oppo X 2021 has two states: collapsed and expanded. A swipe on the capacitive pad on the right edge initiates the transformation; and it's exciting to watch it unfurl. When contracted, it's like a regular smartphone with a 6.7-inch display, albeit a lot thicker and heavier. When unrolled, it spans 7.4-inches in what looks like a 4:3 aspect ratio.",
    "For the display to have no fold marks, Oppo has used a \"Warp Track\" laminate screen that is 0.1mm in thickness – thick enough to be resilient yet thin enough to be flexible. It wraps around a 6.8mm axis on the left edge along a conveyor belt-like implementation for smooth unrolling.",
    "The rigour of the mechanism allows the Oppo X 2021 to hold its shape at intermediate positions too. It opens up new customization opportunities, where the display can be just as big as you'd want.",
    "For example, having a movie on the top and a Twitter feed running on the bottom would usually come with unwanted byproducts such as letterboxing (black bars on the top and bottom) around the content. But on a rollable like this, you may be able to tailor the screen and app sizes as per your liking.",
    "To achieve that, the software from Oppo has been heavily customized to ensure the UI elements remain functional at all aspect ratios. Only extended testing will tell how many apps along to this.",
    "Android isn't particularly great at adapting to bigger screens, such as tablets. With Google having announced support for foldables a few years ago, perhaps we will soon start seeing fruits of that effort in future upgrades to Android software.",
    "Interestingly, the Oppo X 2021 at the booth at MWC Shanghai also supported truly contactless wireless charging. As seen in the above images, the attendant held the phone in their hand as it charged without any wires or pads in its vicinity.",
    "This feature was not talked about when the phone was unveiled but could be a part of Oppo's bigger plans with wireless charging.",
    "By the looks of it, Oppo doesn't seem to be keen on selling this \"prototype\". We will have to settle for it to remain as a proof of concept of what alternate forms of foldables can be like.",
    "Though, you won’t have to wait much longer for other high-end devices from the brand, as the Oppo Find X3 is rumoured to be a couple of weeks away."
  ],
  "headers": {},
  "links": {
    "Oppo X 2021": "https://www.techradar.com/news/oppos-next-foldable-phone-will-have-a-rollable-oled-display-but-you-cant-buy-it",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Huawei Mate X2": "https://www.techradar.com/news/huawei-mate-x2-hands-on-exclusive",
    "support for foldables": "https://www.techradar.com/news/google-announces-official-android-support-for-foldable-phones",
    "Oppo's bigger plans": "https://www.techradar.com/news/oppo-unveils-new-flash-charge-and-5g-products-at-mwc-shanghai",
    "Oppo Find X3": "https://www.techradar.com/reviews/oppo-find-x3-pro"
  }
}