{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-apple-tv-hbo-max-and-more-this-weekend-february-26-2021",
  "title": "7 new movies and TV shows on Netflix, Apple TV, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-02-26T20:57:50Z",
  "author": "hamish-hector",
  "summary": "From classic cartoon hijinks to superstar life stories",
  "article": [
    "Looking for something new to stream on Netflix and other services this weekend? If you're living in the US, this is a bumper weekend, with the premiere of a new Superman TV show and another of Warner Bros' big 2021 blockbusters landing on HBO Max.",
    "If you're in the UK, though, you've got plenty to watch too – especially with the launch of Disney Plus Star, which just gave you an expanded library of stuff to enjoy on the service besides WandaVision and The Mandalorian.",
    "On more region-agnostic services like Apple TV Plus and Netflix, too, there are several originals worth watching this weekend. Below, we'll pick out the highlights of what to watch over the coming few days.",
    "Everyone’s favorite cat and mouse duo have arrived back on our screens in an all-new movie set in New York City. Jerry has become an unwanted guest at a prestigious hotel so new employee Kayla – played by Chloë Grace Moretz – and Tom the cat must try their best to get rid of him. Expect much of the classic slapstick cartoon humor you’re used to seeing as the trio battle it out, but not necessarily a good movie: this one's only got 44% positive reviews on Rotten Tomatoes at the time of writing.",
    "This one is available on HBO Max for 31 days from February 26.",
    "Now streaming on HBO Max",
    "This film first premiered at the Sundance Film Festival all the way back in January 2020, winning both the U.S. Dramatic Grand Jury Prize and the U.S. Dramatic Audience Award, but now it's finally available on VOD. Minari tells the story of a family of immigrants from South Korea looking to make it in 1980s rural America, and stars Steven Yeun, who's appeared in a string of amazing movies over the last few years (Burning and Sorry to Bother You among them).",
    "Sitting at a 98% on Rotten Tomatoes and up for the Golden Globe for Best Foreign Language Film, this is one you need to watch this weekend if you're in the US. You can rent Minari on Amazon Prime Video now.",
    "Now available via video on demand in the US",
    "If you’re looking for a little more DC in your life ahead of the Justice League Snyder Cut, why not check out this new series that’s part of the ongoing Arrowverse from The CW? Clark Kent (Tyler Hoechlin) and Lois Lane (Elizabeth Tulloch) have moved to Smallville with their two sons, but their idyllic life is about to be disrupted as behind-the-scenes forces believe the world no longer needs Superman. If Snyder's take on Superman is too dark for you, Hoechlin's portrayal of Man of Steel might be just what you need. Critics have responded positively to this series so far, and US viewers can watch it now – it's unclear when it'll launch in the UK.",
    "Now streaming on The CW app and website with new episodes releasing weekly",
    "Sports fans have a new documentary to enjoy about one of soccer’s best-ever players this weekend, as Netflix rolls out this film about the Brazilian superstar. Pelé features interviews with the sporting star himself, as well as insight from his former teammates, and charts his rise to unprecedented success from the late '50s through to the early '70s. If you want to know a little bit more about how the four-time World Cup winner ticks, this could be the one for you.",
    "Now streaming on Netflix",
    "This new Apple TV Plus documentary reveals behind-the-scenes footage of Billie Eilish’s creative process, taking an in-depth look at her debut studio album When We All Fall Asleep, Where Do We Go? As one of the modern music industry’s biggest and youngest stars – at only 19-years-old – this revealing look at Eilish’s career to date is worth a look. Apple TV Plus' Beastie Boys Story was a terrific music documentary, so we've got high hopes for this one.",
    "Now streaming on Apple TV Plus",
    "Season 4 of FX's American drug drama series is finally releasing, after filming was delayed due to the Covid-19 pandemic. Set in 1980s Los Angeles during the crack cocaine epidemic, this series has attracted acclaim with its detailed characterization of a varied cast – it's well worth a look if you need another prestige TV drama to add to your list. In the US, episode 1 of the 1985-set season 4 is now available on Hulu. In the UK, Snowfall tends to release on BBC iPlayer – but it's unclear when the new episodes will land.",
    "Now streaming on Hulu with new episodes releasing weekly",
    "Already available for a while in the US on Hulu, this week the UK got Solar Opposites for the first time with the launch of Star on Disney Plus. This animated series is about a family of aliens who try (sort of) to blend in to a human neighborhood, and it comes from Rick and Morty co-creator Justin Roiland.",
    "To say that Solar Opposites is similar to the Adult Swim series would be an understatement – it actually feels like a series that could've been dreamed up in one of Rick and Morty's Interdimensional Cable episodes. If you're a diehard fan of Roiland's other work, you will definitely enjoy this. Three episodes are available now for UK viewers.",
    "Now streaming in Hulu in the US and Disney Plus in the UK"
  ],
  "headers": {
    "3": "Tom and Jerry (HBO Max)",
    "6": "Minari (VOD)",
    "9": "Superman & Lois (The CW app and website)",
    "11": "Pelé (Netflix)",
    "13": "Billie Eilish: The World’s A Little Blurry (Apple TV Plus)",
    "15": "Snowfall season 4 (Hulu)",
    "17": "Solar Opposites (Disney Plus UK)"
  },
  "links": {
    "Disney Plus Star": "https://www.techradar.com/news/disney-plus-star-explained",
    "WandaVision": "https://www.techradar.com/news/wandavision-release-date-trailer-disney-plus/news/wandavision-explained",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "rent Minari on Amazon Prime Video now": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FMinari-Steven-Yeun%2Fdp%2FB08WM1FTDX%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7618279619688497000-20",
    "Justice League Snyder Cut": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}