{
  "source": "https://www.techradar.com/news/the-world-needs-to-improve-when-it-comes-to-digital-privacy",
  "title": "The world needs to improve when it comes to digital privacy",
  "category": "computing",
  "updated": "2021-03-24T21:11:56Z",
  "author": "anthony-spadafora",
  "summary": "Although many users know how to protect their privacy online, few practice what they preach",
  "article": [
    "Although more aspects of our daily lives now take place online, new research from NordVPN has found that the world's online privacy awareness is just satisfactory.",
    "To compile its new report based on the results from its National Privacy Test, the VPN company surveyed 48,063 users from 192 countries to evaluate their online habits, theoretical knowledge and practical skills when it comes to reacting to online threats.",
    "NordVPN's survey found that the global score for its digital privacy test was just 65.2 points out of 100. Despite knowing how to assess and react to online threats (84.2/100) and knowing in theory how to stay safe online (72.2/100), internet users around the world have very poor cybersecurity habits and often fail to practice what they preach. For instance when it came to habits, the global score was 47.1 points out of 100.",
    "Digital privacy expert at NordVPN, Daniel Markuson provided further insight on the results of the National Privacy Test, saying:",
    "“The biggest problem we see is the understanding of what does and doesn’t make you private online. To be truly private online, one must not only know how to react to threats but also how to prevent them in the first place. Clearing the browsing history will not make you more private, as half of the world thinks. But good habits and comprehensive cybersecurity tools like VPN and an antivirus will.”",
    "When it came to the performance of 21 different countries where the number of respondents was the highest, NordVPN found that Germany is the most advanced country (71.2) on all accounts. Its internet users have knowledge of online privacy (78.0), understand what not to tolerate when faced with online threats (90.2) and practice healthy online habits (53.2).",
    "The survey also found that nine out of the ten best performing countries are European with the Netherlands being the second best (69.5/100) and Switzerland the third (68.9/100). The US came in fourth when it comes to digital privacy with an overall score of 68.5. When it came to the countries with the worst digital privacy scores, Japan came in last with a score of 44.4, followed by Russia at 53.6 and India at 51.2 points.",
    "NordVPN also found that the world completely ignores the Privacy Polices and Terms and Conditions of online services and software with 41.9 percent of respondents saying they proceed without reading anything. On the other hand, 42.2 percent said that the most important thing to know is with whom their data is being shared.",
    "The survey's respondents were also asked whether or not they share personal data with their friends or followers online. A surprising 15.2 percent said they allow them to see their personal details including their email addresses and full names while 5.9 percent said they have no issue sharing their current location.",
    "Improving your digital privacy is no small task but by using a VPN when connecting to public or unfamiliar networks, installing antivirus software on your devices and using a password manager to generate and store strong, complex and unique passwords, you can make it much more difficult for others to track you online and gain access to your personal information."
  ],
  "headers": {
    "5": "National Privacy Test"
  },
  "links": {
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "National Privacy Test": "https://go.nordvpn.net/aff_c?offer_id=564&aff_id=3013&source=trd&aff_click_id=trd-us-7610722241913144000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-world-needs-to-improve-when-it-comes-to-digital-privacy&url=https%3A%2F%2Fnordvpn.com%2Fnational-privacy-test%2F",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "how to stay safe online": "https://www.techradar.com/how-to/computing/how-to-stay-even-safer-online-1314589",
    "digital privacy": "https://www.techradar.com/how-to/how-to-become-invisible-online-well-almost",
    "Privacy Polices": "https://www.techradar.com/news/android-app-privacy-policies-contain-contradictions-about-data-collection",
    "data is being shared": "https://www.techradar.com/news/these-popular-apps-may-be-leaking-personal-details-online",
    "antivirus software": "https://www.techradar.com/best/best-antivirus",
    "password manager": "https://www.techradar.com/best/password-manager"
  }
}