{
  "source": "https://www.techradar.com/news/the-perseverance-mars-rover-is-running-linux",
  "title": "The Perseverance Mars rover just took Linux to another planet",
  "category": "computing",
  "updated": "2021-02-19T13:00:53Z",
  "author": "mayank-sharma",
  "summary": "“It’s kind of an open-source victory,” says NASA expert",
  "article": [
    "The landing of the Perseverance rover on Mars was not just a victory for science, but also for open source software, the team behind the project has revealed.",
    "In its bid to use software that was “safe and proven”, NASA turned to Linux and open source. “This the first time we’ll be flying Linux on Mars,” said Tim Canham, Mars Helicopter Operations Lead at NASA’s Jet Propulsion Laboratory (JPL) in a discussion with IEEE Spectrum.",
    "Without going into too much detail, Canham mentioned that the flight software framework NASA is using on the tiny helicopter dubbed Ingenuity, that’s tucked under the Perseverance Mars rover, was originally developed for miniature satellites called CubeSats.",
    "The multi-platform framework called F´ (pronounced F prime) was open sourced by JPL a few years back. The project is actively developed and while it was originally tailored for small-scale spaceflight systems, it is now part of the autonomous little helicopter that’ll be flying around on the red planet.",
    "This isn’t the first open source software that’s made its way into space. NASA has in fact over 500 software projects that it has released under the NASA Open Source 3.0 license, which is an Open Source Initiative (OSI)-approved open source license.",
    "In the interview, Canham added that they’re also “running on a Linux operating system,” again skipping on the details whether he was referring to the Perseverance rover or the Ingenuity helicopter or both.",
    "Just like open source, Linux too has been in the good books of NASA for several years now. The space agency, along with the United Space Alliance, which manages the computers aboard the International Space Station, switched the computers aboard the International Space Station to Debian Linux in 2013.",
    "Canham went as far as to call the latest Mars mission as a win for open source.",
    "“It’s kind of an open-source victory, because we’re flying an open-source operating system and an open-source flight software framework and flying commercial parts that you can buy off the shelf if you wanted to do this yourself someday.”",
    "Via: IEEE Spectrum"
  ],
  "headers": {
    "4": "Open Source victory"
  },
  "links": {
    "open source software": "https://www.techradar.com/best/best-open-source-software",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "F´": "https://github.com/nasa/fprime",
    "500 software projects": "https://code.nasa.gov/",
    "Debian Linux": "https://www.techradar.com/reviews/debian-101-buster",
    "IEEE Spectrum": "https://spectrum.ieee.org/automaton/aerospace/robotic-exploration/nasa-designed-perseverance-helicopter-rover-fly-autonomously-mars"
  }
}