{
  "source": "https://www.techradar.com/news/ces-2021-is-still-a-thing-and-its-going-to-be-huge-for-pc-gaming",
  "title": "CES 2021 is still a thing, and it's going to be huge for PC gaming",
  "category": "computing",
  "updated": "2021-01-09T14:00:49Z",
  "author": "bill-thomas",
  "summary": "Nvidia, Intel and AMD all likely have huge stuff coming",
  "article": [
    "We're living in strange times, so CES 2021, arguably the biggest tech event of the year, obviously had to adapt. And while a lot of the digital events that have emerged during the pandemic have been relatively minor, CES 2021 is shaping up to be a pretty major show for PC gamers.",
    "Nvidia, AMD and Intel all have major keynote shows over the next week, and the way rumors have been shaping up for all three points to some major hardware launches. So, whether you're a laptop warrior or you're looking for a way to upgrade or build a new PC, you'll probably want to keep an eye on the proceedings over the next week or so.",
    "Nvidia launched its Ampere graphics cards, led by the RTX 3080, back in September 2020. Then, AMD followed in October with its initial Big Navi cards heralded by the Radeon RX 6800 XT. However, neither graphics card manufacturer launched a full lineup of GPUs.",
    "The initial Nvidia launch gave us the Nvidia GeForce RTX 3080, RTX 3090 and RTX 3070, followed shortly by the GeForce RTX 3060 Ti in December 2020. AMD released even fewer cards, with the AMD Radeon RX 6800 XT and Radeon RX 6800 in November 2020, followed shortly by the Radeon RX 6900 XT in December.",
    "However, looking back at the previous Turing and Navi generations for Nvidia and AMD, respectively, we can expect quite a few more graphics cards over the next year or so.",
    "For Nvidia, specifically, the CES 2021 timing for more graphics cards is obvious once you look at the past. At Gamescom 2018, Nvidia launched its Turing lineup of graphics cards, but, again, just the 2080 Ti, 2080 and 2070. Then, at CES 2019, Nvidia followed that up with the Nvidia GeForce RTX 2060. That mid-range champion was then followed by the GTX 1660 Ti in February.",
    "AMD's releases for its Navi cards were a little less consistent, though. It launched the Radeon RX 5700 and Radeon RX 5700 XT at E3 2019, followed by the Radeon RX 5500 XT nearly six months later in December 2019 and the Radeon RX 5600 XT in January 2020.",
    "So, if AMD and Nvidia were to follow similar launch schedules this year, we could totally see new graphics cards from both major companies at CES 2021.",
    "Sure, Nvidia already launched the Nvidia GeForce RTX 3060 Ti back at the beginning of December 2020, but the RTX 2060 and GTX 1660 Ti were just a month apart, so these rapid releases aren't unheard of.",
    "It doesn't hurt that a lot of rumors are currently pointing to CES 2021 as being the springboard for a lot of graphics card launches. Just a few days before CES 2021 kicked off, we heard a rumor that Nvidia would delay not just one graphics card, but three: the RTX 3050, RTX 3050 Ti and the Nvidia GeForce RTX 3060.",
    "Then there's the ever-present rumor surrounding the RTX 3080 Ti. Originally, rumors suggested that Nvidia would be dropping this graphics card in response to the Radeon RX 6900 XT, as Nvidia doesn't have anything that competes with that card in the same price point – the GeForce RTX 3090 is 50% more expensive.",
    "The last we heard, though, was that it was showing up in some driver code. In the past this has signaled imminent GPU launches, but it's not always the case. Given that the RTX 3060 and RTX 3050 rumors appeared due to a Lenovo listing – we'd put our money on those cards being the ones announced at CES 2021.",
    "The rumors surrounding the AMD Radeon RX 6700 XT point to a March 2021 release, however, so it's very possible we won't hear anything when AMD CEO Lisa Su takes the stage for the keynote. But, she does have a habit of saving a big announcement for the end of her keynotes, so it's very possible she'll give a Radeon teaser at the end – just like she did at Computex 2019 for the first generation of Navi.",
    "While desktop graphics cards get all the excitement at the beginning of a GPU generation, gaming laptops are becoming more and more popular, so we're sure to hear something.",
    "The most likely launch is going to be Nvidia Ampere mobile GPUs, especially given the timing. Again, Turing mobile launched at CES 2019, right alongside the RTX 2060. That would mark a perfect two year upgrade cycle for gaming laptops. It helps that Asus has been tweeting cryptically about how it's \"upgrading TUF\".",
    "That could also point to processors, however. And, in that realm, there are two possibilities: AMD Ryzen 5000 or Intel Tiger Lake-H – or even both. AMD's mobile refresh is a bit more likely, as it launched its Zen 2-based Ryzen 4000 mobile processors at CES 2020, which would give it the typical one year between launches.",
    "Intel Comet Lake-H is a bit newer, however, launching in mid-April 2020. Now, Intel is likely hungry to reclaim the bit of the mobile market it's lost to AMD, so we could see an 11th-gen gaming laptop chip.",
    "It's also likely that Intel could launch its 11th-generation desktop processors, or at least give them an announcement. We've been seeing a ton of leaks from Team Blue on the desktop front lately. Not only has Intel discontinued popular 9th-generation Coffee Lake Refresh CPUs like the Intel Core i9-9900K, it's also discontinued the 300-series chipset that powered those processors.",
    "Intel typically only does this ahead of the release of a new generation, and it's been dropping hints about Rocket Lake-S ever since it made a cryptic Medium post on the topic back in October.",
    "A CES 2021 reveal for Rocket Lake isn't exactly guaranteed, though. Rumors are currently pointing at a March 2021 launch, with MSI leaking out the release window in a support forum post about upcoming 500-series motherboards. Plus, it wouldn't be the first time Intel disappointed, with CES 2020 coming and going without any hardware launches from the company.",
    "At the end of the day, though, we won't know anything until Intel, AMD and Nvidia have a chance to take the stage and show the world what's coming next in the world of PC gaming. However, the timing is kind of lining up on all fronts, so we're bracing ourselves for one of the most explosive CES shows in years – even if we're watching it from our computer screens, rather than the Las Vegas strip."
  ],
  "headers": {
    "2": "Ampere and Big Navi are still brand new",
    "9": "We're not alone here",
    "13": "Where are all the gaming laptops?"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "build a new PC": "https://www.techradar.com/how-to/how-to-build-a-pc",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "GeForce RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Turing": "https://www.techradar.com/news/nvidia-turing",
    "Gamescom 2018, Nvidia launched its Turing lineup": "https://www.techradar.com/news/nvidia-gamescom-2018-press-conference-live-blog-will-we-see-the-geforce-rtx-2080",
    "Nvidia GeForce RTX 2060": "https://www.techradar.com/news/nvidia-finally-announces-the-geforce-rtx-2060-graphics-card",
    "Radeon RX 5700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5700-xt",
    "E3 2019": "https://www.techradar.com/news/e3-2019",
    "Radeon RX 5500 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5500-xt",
    "Radeon RX 5600 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5600-xt",
    "RTX 3050, RTX 3050 Ti and the Nvidia GeForce RTX 3060": "https://www.techradar.com/news/nvidia-rtx-3050-rtx-3050-ti-and-rtx-3060-might-debut-at-ces-next-week",
    "showing up in some driver code": "https://www.techradar.com/news/leak-reveals-next-nvidia-gpus-that-could-arrive-including-rtx-3080-ti-and-rtx-3050",
    "point to a March 2021 release": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-and-rx-6700-graphics-cards-may-launch-in-march",
    "Turing mobile launched at CES 2019,": "https://www.techradar.com/news/ces-2019-has-made-gaming-laptops-exciting-again",
    "It helps that Asus has been tweeting cryptically about how it's \"upgrading TUF\".": "https://www.techradar.com/news/nvidia-rtx-3080-mobile-gpu-details-start-to-leak-ahead-of-ces-2021",
    "Ryzen 4000 mobile processors at CES 2020": "https://www.techradar.com/news/amd-flexes-on-intel-at-ces-2020-with-new-architectures-and-graphics",
    "launching in mid-April 2020": "https://www.techradar.com/news/intel-10th-gen-comet-lake-h-is-here-to-bring-the-fight-to-amd-ryzen-4000",
    "lost to AMD": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
    "discontinued popular 9th-generation Coffee Lake Refresh CPUs like the Intel Core i9-9900K": "https://www.techradar.com/news/intel-core-i9-9900k-has-been-discontinued-along-with-other-9th-gen-cpus",
    "300-series chipset that powered those processors": "https://www.techradar.com/news/intel-hints-at-imminent-rocket-lake-s-launch-with-discontinuation-of-older-300-series-chipsets",
    "Rocket Lake-S ever since it made a cryptic Medium post on the topic back in October": "https://www.techradar.com/news/11th-generation-intel-rocket-lake-processors-are-officially-coming-in-2021",
    "MSI leaking out the release window": "https://www.techradar.com/news/intel-11th-generation-processors-launch-window-may-have-just-leaked-from-msi",
    "CES 2020 coming and going without any hardware launches from the company": "https://www.techradar.com/news/at-ces-2020-intel-fails-to-defend-its-crown-from-amd"
  }
}