{
  "source": "https://www.techradar.com/news/iphone-showing-no-service-bug-ios-1471-is-the-issue-and-apple-has-suggested-a-fix",
  "title": "iPhone showing 'no service' bug? iOS 14.7.1 is the issue, and Apple has suggested a fix",
  "category": "phones",
  "updated": "2021-08-24T09:10:46Z",
  "author": "james-peckham",
  "summary": "Something to try",
  "article": [
    "iOS 14.7.1 landed back in July, and some who have upgraded have been reporting a bug where you lose mobile service on your iPhone in areas you've previously had signal.",
    "This issue doesn't impact all users, but it has been reported on Apple's forums multiple times with very similar circumstances, where it limits your phone's signal more than before you upgraded the software.",
    "The issue is persistent enough that Apple has now shared some advice on how you may be able to fix it. The main thing you can try to solve the issue is to undertake a carrier settings update.",
    "For this, you're advised to enter an area where you know you have previously had coverage with your cellular provider. If you get signal at home, you should be able to do this from there. You should then head to the Settings app, tap on General and then tap on About.",
    "If there is an update available, you will then be able to apply it there under carrier settings. If that hasn't worked, Apple also advised you reset your network settings.",
    "To do this, you should head to the Settings app, tap on General, tap on Reset and then tap on Reset Network Settings. Be aware that this will mean your phone forgets your Wi-Fi passwords, but it may be worth that small annoyance to try to fix the issue.",
    "If this hasn't worked, take a look at the support document from Apple for further details on what you can try.",
    "Otherwise, you may have to wait until Apple rolls out a new update such as iOS 14.8, which the company is rumored to be working on. iOS 15 is likely coming soon too - it's expected to arrive alongside the iPhone 13 in September.",
    "iOS 14.7 for its part didn't bring any major new features to your iPhone, but it did introduce a few bug fixes and important security updates.",
    "Weirdly, the iOS 15 beta doesn't seem to be suffering from the same issue. Those on Apple's forums have said that they haven't seen the same problem within the iOS 15 public beta.",
    "This seems to be a problem that is just for iOS 14.7.1, so you may also be able to upgrade yourself to the iOS 15 public beta to fix the problem.",
    "Bear in mind that this is going to come with its own risks - beta versions of software are a work in progress, so it may mean you have some other issues with your iPhone while running it.",
    "But if your smartphone is without signal because of iOS 14.7.1, this may be a trade off that is worth it for you.",
    "Via Phone Arena"
  ],
  "headers": {
    "9": "Analysis: iOS 15 doesn't have this issue"
  },
  "links": {
    "Apple has now shared": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1418662498279126300&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT201415",
    "at the support document": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1383964055001685200&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT201415",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Phone Arena": "https://www.phonearena.com/news/iOS-update-causes-connectivity-problems_id134524"
  }
}