{
  "source": "https://www.techradar.com/news/gopros-new-app-wants-to-be-your-one-stop-video-editor-for-a-price",
  "title": "GoPro’s new app wants to be your one-stop video editor – for a price",
  "category": "cameras",
  "updated": "2021-03-16T22:23:41Z",
  "author": "mark-wilson",
  "summary": "Revamped Quik app replaces existing GoPro app",
  "article": [
    "GoPro has launched a new Quik app that brings its automated editing skills to all of your videos, whether they've been shot on your smartphone, DSLR or action camera.",
    "The app, which replaces the existing GoPro app for iOS and Android, is aiming to solve what GoPro calls the \"black hole\" problem of your phone's camera roll, where your favorite videos and photos get lost in a sea of screengrabs and duds.",
    "GoPro actually merged the previous incarnation of Quik – an app it bought in 2016 – with its own GoPro app in 2019. But now the latter is being rebranded as Quik and given some new editing tools that GoPro hopes will broaden its popularity beyond owners of its action cams.",
    "So what's new in GoPro's revamped one-stop shop? On the plus side, there are some new automatic video creations tools, which add things like royalty-free music that's beat-synced to your videos.",
    "Another nice touch is a video speed tool, which lets you speed ramp your videos to make them faster or slower and add super slo-mo segments at various points throughout a clip.",
    "Like before, you also get access to GoPro's video editing themes and filters for a social media-friendly look, plus the Mural feature (which arrived in December 2020) for a personalized 'wall' of your favorite photos and videos.",
    "On the downside, though, the Quik is only free to use on a trial basis. If you want to unlock its full powers, you'll need to subscribe for a cost of $1.99 / £1.79 / AU$2.99 per month or $9.99 / £9.49 / AU$14.99 annually.",
    "This subscription will eventually give you unlimited cloud backup for all your photos and videos at their original quality, though this feature won't be released until \"later this year\", according to GoPro.",
    "The revamped Quik app, which replaces the existing GoPro app, represents another move by GoPro to get into subscription services to help supplement its action cam sales.",
    "It already offers a GoPro subscription ($49.99 / £49.99 / AU$69.99), which gives owners of action cams like the GoPro Hero 9 Black unlimited cloud storage of videos and photos at original quality, live-streaming, and replacements for damaged cameras.",
    "If you already have that subscription, you'll automatically get full access to the Quik app's skills for no extra cost.",
    "But for those who don't already subscribe to GoPro, the standalone Quik subscription might be a tougher sell – particularly considering the number of alternative apps and the fact that unlimited cloud backups won't be available until later in 2021.",
    "There's no doubt Quik has its charms, particularly if you don't want to get into the weeds of video editing and need a quick, automated edit with music and social-media friendly effects.",
    "But with the likes of iMovie and Clips, not to mention powerful paid-for options like LumaFusion, already widely used, the new app's subscription option might struggle to gain traction before those cloud backups arrive, despite the snazzy beat-timing skills and stylish themes."
  ],
  "headers": {
    "8": "Automatic pilot"
  },
  "links": {
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black"
  }
}