{
  "source": "https://www.techradar.com/news/these-apps-are-sharing-a-lot-of-your-data-online",
  "title": "These apps are sharing a lot of your data online",
  "category": "computing",
  "updated": "2021-03-08T22:49:04Z",
  "author": "anthony-spadafora",
  "summary": "More than half of the top 100 apps share your data with third parties",
  "article": [
    "Following Apple's recent introduction of privacy labels in the App Store, the secure cloud storage provider pCloud decided to take a deeper look into the mobile apps we use everyday to determine which apps share the most personal data.",
    "To compile its new Invasive apps study, the firm analyzed the iPhone maker's “Third Party Advertising” and “Developer's Advertising or Marketing” sections from its privacy labels to find out which apps share the most data with third parties as well as which apps collect the most data for their own marketing.",
    "pCloud's research found that 52 percent of all apps share your data with third parties that are either associated with a company that runs a particular app or they might just pay a fee to access user data. Of these apps, Instagram, Facebook and LinkedIn collect the most personal data at 79, 57 and 50 percent respectively.",
    "When it comes to sharing your information though, Instagram was the biggest offender as its app shares 79 percent of user data with other companies. Instagram's parent company Facebook came in second place by giving away 57 percent of user data while LinkedIn and Uber Eats both sell of 50 percent of their user data.",
    "pCloud's study also highlighted the fact that 80 percent of apps use user data to market their own products in their apps and beyond. This includes things like apps serving their own ads on other platforms as well as in-app promotions for their own benefit.",
    "Facebook and Instagram topped the list of apps which collect user data for their own benefit and both services use 86 percent of their user data to sell their own products and serve relevant ads on behalf of others. The data collected by these apps range from a user's date of birth all the way through to the times of day when users usually use their apps.",
    "When it came to the apps that do the best job of keeping user data safe and private, pCloud found that Signal, Clubhouse, Netflix, Microsoft Teams, Google Classroom, Shazam, Etsy, Skype, Boohoo, Amtrack, Zoom, Shop and IRS2Go all collect no data on their users. The company also ranked over 100 of the most popular apps in the world by how invasive they are to reveal that Instagram, Facebook, Uber Eats, Trainline and eBay track the highest percentage of personal data overall.",
    "While an app may be convenient, installing it on your smartphone could put your personal data and privacy at risk which is why you should always do the necessary due diligence before clicking download on the App Store or Google Play Store."
  ],
  "headers": {
    "4": "Collecting app data"
  },
  "links": {
    "privacy labels": "https://www.techradar.com/news/whatsapp-is-kicking-up-a-stink-about-apples-app-store-privacy-labels",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "pCloud": "https://www.techradar.com/reviews/pcloud",
    "Invasive apps study": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2389269495256980500&xs=1&url=https%3A%2F%2Fblog.pcloud.com%2Finvasive-apps%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthese-apps-are-sharing-a-lot-of-your-data-online",
    "in-app promotions": "https://www.techradar.com/news/apple-allows-developers-to-give-in-app-discounts-to-existing-users",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "App Store": "https://www.techradar.com/news/apple-app-store-is-apparently-still-littered-with-malicious-apps",
    "Google Play Store": "https://www.techradar.com/news/scammers-use-innovative-google-play-store-ploy-to-trick-users"
  }
}