{
  "source": "https://www.techradar.com/news/panasonic-gh5-mark-ii-leak-points-to-surprise-launch-of-mirrorless-camera",
  "title": "Panasonic GH5 Mark II leak points to surprise launch of mirrorless camera",
  "category": "cameras",
  "updated": "2021-05-10T09:23:05Z",
  "author": "techradar",
  "summary": "What does it mean for the rumored Panasonic GH6?",
  "article": [
    "A new leak for the Panasonic GH5 Mark II suggests the mirrorless camera could launch soon – and possibly put an end to rumors of an 8K successor to the GH5.",
    "The ever-reliable Nokishita has posted a list of specs for the Micro Four Thirds camera, which suggest it'll only be a minor upgrade on the Panasonic GH5. While the GH5 is a still popular choice among videographers looking for a compact mirrorless cameras, it was launched way back in 2017.",
    "According to the leak, the Panasonic GH5 Mark II will have a 20.33MP sensor (the same as the GH5) capable of shooting 4K/60p video, plus a 3.68-million dot EVF with a faster 120fps refresh rate.",
    "If the rumors are correct, the GH5 Mark II will also have the same form factor as its predecessor, with a 138.5x 98.1x87.4mm body that weighs 647g. In other words, ideal for run-and-gun filmmaking or balancing in a small gimbal.",
    "The final spec shared by Nokishita is a possible US price of $1,697 (around £1,205 / AU$2,160), which would make the GH5 Mark II a fair bit cheaper than the GH5 at launch, which landed in 2017 for $1,999.",
    "Given the seemingly minor upgrades, though, this is perhaps to be expected, and you can currently find the GH5 for only $1,299 / £1,199 / AU$1,999. According to the Nokishita leak, you'll also apparently be able to buy the camera with a 12-60mm kit lens for $2,297 (£1,630 / AU$2,925).",
    "The arrival of a Panasonic GH5 Mark II would be something of a surprise, given the steadily increasing speculation about a Panasonic GH6 arriving later this year. Just a couple of weeks ago, rumors were pointing towards an 8K-shooting GH6 landing for the Lumix range's 20th anniversary in September.",
    "Of course, that could still happen, but it seems less likely if the Panasonic GH5 Mark II does indeed launch soon. It's not yet clear what other upgrades the rumored camera will bring, with Nokishita's leak making no mention of autofocus, the possibility of 10-bit video and potentially improved codec support.",
    "It also wouldn't be the only slightly oddball camera launch we've seen recently – Sony recently released 'upgraded' versions of its Sony A7R IV and Sony A7R III mirrorless cameras, with the only new feature being a higher-resolution rear LCD.",
    "It's not yet clear whether or not the rumored Panasonic GH5 Mark II might fit into this 'stop gap' launch bracket, ahead of a Panasonic GH6 launch further down the line. Or if Panasonic has decided to a conservative upgrade with an affordable price tag that undercuts its full-frame alternatives is what filmmakers are looking for in 2021. But we're looking forward to an official launch hopefully filling in the gaps soon."
  ],
  "headers": {
    "6": "Missing pieces"
  },
  "links": {
    "Nokishita": "https://twitter.com/nokishita_c/status/1391641119931260932",
    "Panasonic GH5": "https://www.techradar.com/reviews/panasonic-lumix-gh5-review",
    "Panasonic GH6": "https://www.techradar.com/news/panasonic-gh6-release-date-price-specs-and-features",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A7R III": "https://www.techradar.com/reviews/sony-alpha-a7r-iii-review"
  }
}