{
  "source": "https://www.techradar.com/news/forza-horizon-5-will-generously-reward-series-veterans-with-free-cars",
  "title": "Forza Horizon 5 will generously reward series’ veterans with free cars",
  "category": "gaming",
  "updated": "2021-10-29T13:23:14Z",
  "author": "jamel-smith",
  "summary": "Save some virtual cash by playing previous Forza games",
  "article": [
    "Developer Playground Games has outlined the details of its Forza Horizon 5 loyalty rewards program, which grants players free cars for the upcoming racing game if they’ve played previous titles in the series.",
    "Those who have played the first four Forza Horizon games and Forza Motorsport titles can receive six free cars in total, which were the cover cars for previous Forza titles.",
    "It means that instead of purchasing these cars from the Autoshow (the car marketplace in Forza Horizon 5), series’ veterans will save a ton of virtual money and have some fantastic cars to drive straight away.",
    "Players will need to use the same Xbox account they were signed in as when playing the previous games to successfully unlock the free cars.",
    "To gain access to these loyalty rewards, you’ll need to complete the first initial drive in Forza Horizon 5 for the new unlocked cars to appear in your garage. It’s worth noting that the unlocked cars won’t feature any special upgrades, so you’ll need to cough up some extra virtual money if you want to pimp your ride.",
    "The loyalty rewards program will come as a pleasing bonus for Forza veterans who've played most, if not all Forza titles. However, for newer fans who are just getting into Playground Games open-world racer, the only existing Forza title you can buy digitally today is Forza Horizon 4 (the game is also available on Xbox Game Pass).",
    "That means that newer players won’t be able to take full advantage of the loyalty rewards program, but they can still unlock one car: the 2018 McLaren Senna. However, if you really want to unlock the other five vehicles, you can still purchase physical copies of past Forza titles.",
    "The reason why you can’t buy older Forza games digitally anymore is because Microsoft has delisted past titles from the Microsoft Store once they reach their 'end-of-life status'. The most recent game to be delisted was Forza Motorsport 7, much to fans’ dismay. In a statement, Microsoft said: “Forza games have to go unlisted after several years because the third party licenses that we use to feature real-world cars, tracks and other elements will begin to expire.”",
    "Despite this disappointment, Forza Horizon 5 is looking to be a spectacular racing game. It’s poised to feature the largest car list at launch of Forza title to date, plus the most diverse map yet.",
    "Thankfully we don’t have to wait too much longer to experience the sights and sounds of the game's setting of Mexico, as Forza Horizon 5 arrives on November 9 (Those that pre-order the Premium Edition can play from November 5).",
    "Forza Horizon 5 will be available on Xbox One, Xbox Series X/S, and PC for $59.99 / £54.99 (around AU$75), the premium edition costs $99.99 / £84.99 (around AU$130). The game will also be available to Xbox Game Pass subscribers on day one.",
    "Via Windows Central"
  ],
  "headers": {
    "5": "Analysis: only Forza veterans will truly benefit"
  },
  "links": {
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Forza Motorsport 7": "https://www.techradar.com/news/forza-motorsport-7-review-fifth-gear-style-first-gear-substance",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Via Windows Central": "https://www.windowscentral.com/forza-horizon-5-loyalty-rewards-reveal"
  }
}