{
  "source": "https://www.techradar.com/news/xbox-live-is-down-with-a-major-outage",
  "title": "Xbox Live was down for five hours – here's what stopped working during the outage",
  "category": "gaming",
  "updated": "2021-02-26T07:25:11Z",
  "author": "matt-swider",
  "summary": "Five hours without Xbox Live during prime time gaming hours left new Xbox Series X users wanting. Here's what went down – literally.",
  "article": [
    "Update: Xbox Live was down for more than five-and-a-half hours on Thursday evening, prime time for gaming in US time zones. Almost all Xbox Live services, including online gaming, appear to be back, according to Microsoft and our own testing on an Xbox Series X. Three games, Rouge Company, Smite and Rec Room, still have intermittent problems.",
    "Prior story – here's what happened",
    "Xbox Live is down with a major outage, according to the official Microsoft Xbox status page and the fact that we can't log in right now on our Xbox Series X. The online gaming service has been down for more than five hours. \"We are aware that users may not be able to sign-in to Xbox Live at this time,\" said Xbox Support through its official Twitter account. \"Our teams are currently investigating to fix this issue.\"",
    "Today's Xbox Live outage started about at 4pm EST, according to the timestamp on the Xbox Support tweet as well as the roaring complaints of suddenly offline gamers. Many people who recently bought the new Xbox Series X and Xbox Series S consoles expected to go online this evening.",
    "Microsoft's status page indicates that Xbox Live being down is ongoing and affects some core functionality. Across its online gaming community, you won't be able access your account and profile, the Xbox store and or its subscription service, and, key, multiplayer gaming and cloud gaming. This includes Xbox Game Pass, which has been heavily pushed by Microsoft in this new console generation.",
    "In other words, you can't do much of anything with the Xbox Series X, Series S or Xbox One when it comes to Xbox Live functionality. \"Friends and social activity\", for example, remains intact, so you can join a watch party or prune your Xbox Live friends list. Exciting for a Thursday night."
  ],
  "headers": {},
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Support": "https://twitter.com/XboxSupport/status/1365043994552455168",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}