{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-and-oppo-find-x3-pro-have-kicked-off-a-new-phone-camera-craze",
  "title": "Xiaomi Mi 11 and Oppo Find X3 Pro have kicked off a new phone camera craze",
  "category": "phones",
  "updated": "2021-03-14T09:00:19Z",
  "author": "tom-bedford",
  "summary": "Macro-photography for the masses",
  "article": [
    "First they came without a camera. Then they came with a camera. Then secondary and tertiary cameras started popping up, sporting ultra-wide or telephoto lenses, or with auxiliary depth sensors, all in the name of helping your smartphone take better pictures. And now, at the beginning of 2021, it seems a new kind of photography mode for smartphones might be all the rage.",
    "The Xiaomi Mi 11, launched in February 2021, and the Oppo Find X3 Pro, shown off the month after, both have notable macro-photography modes, using bespoke hardware and smart software to take such photos. These aren't just extra modes thrown in to bulk out a feature list, but complicated modes that marry hardware and software.",
    "'Macro' in the photographic sense refers to close-ups, usually of small things, so macro photography consists of taking pictures of often tiny subjects, and capturing those images in loads of detail. Using this kind of photography you can really appreciate the details in the world around you, whether that's in your food, or clothes, or technology.",
    "Some smartphones have had macro modes before, though never great ones, but the fact Xiaomi and Oppo have both developed brand-new macro systems suggests it could be becoming a new trend.",
    "There's a short history of macro cameras on smartphones, but it's a pretty sorry one. Quite a few budget phones come with 2MP depth-sensing and 2MP macro cameras, a duo that's become synonymous with 'cheap phones'.",
    "We've rarely found these macro cameras are actually good for taking macro photos, though, as they don't do anything the main camera doesn't - instead, the inclusion of this duo often seems more a ploy to flesh out a phone's specs list.",
    "Some phones have a different way of doing macro-photography - they use the ultra-wide lens in macro modes, which works better for this than a phone's main camera, but isn't always perfect, particularly thanks to the distortion this kind of lens can cause.",
    "One of the biggest issues smartphones have for macro shots, is that photography needs good lighting. If you've put your smartphone right up against a subject to take a macro shot, there's a good chance you're blocking out loads of natural light with the phone's chunky body. This is an issue that both the Xiaomi Mi 11 and Oppo Find X3 Pro solve.",
    "The Xiaomi Mi 11 and Oppo Find X3 Pro take very different approaches to their macro photography modes.",
    "The Mi 11 has a 'telemacro' lens paired with a 5MP sensor - this lets you hold the phone a fair way from your subject and still get good macro shots. Therefore you're not blocking all the light.",
    "The Find X3 Pro has a 3MP sensor, but it has a ring light on it to ensure the subject is lit up, and comes with a 'microlens' - this takes really zoomed-in shots, almost like a microscope, to pick out the tiny details of a subject.",
    "So the two phones don't do quite the same thing - the Oppo phone is designed for much closer shots than the Xiaomi phone - but the fact they both have such complex and novel systems for macro photography (at least for smartphones) suggests it could be a trend going forward.",
    "So is there any likelihood of other brands following suit with Xiaomi and Oppo? Well, there's a precedent.",
    "Xiaomi was the first company to use 108MP sensors in its smartphones and now Samsung and Realme have followed suit - similarly, Oppo has a history of using bespoke Sony sensors for its cameras, something OnePlus recently also started doing.",
    "It can be seen, then, that the two Chinese companies have each started mini trends with regards to smartphone photography. And a bigger focus on macro photography in other brands' phones would make a lot of sense because, as we've already mentioned, many smartphones already try to do the whole 'macro' thing, just poorly.",
    "So how could we see other phones do it? Xiaomi's telemacro lens method seems easily replicable - more so than Oppo's microlens strategy, at least - but we could perhaps see other strategies.",
    "Perhaps macro lenses could be paired with higher-res sensors, to make that type of phone camera better to use. There are also software solutions that could mimic some of the elements of macro lenses, like the ability to focus on something closer, though traditionally camera software doesn't do as good a job at things as hardware.",
    "We're not the phone designers, though, the phone companies are, so hopefully they're currently working on new ways to create macro phone cameras.",
    "Close-up photography is great fun on smartphones and on standard cameras, as it lets you see small details around you in a new light, and easily take pictures of different subjects. Hopefully, if more phone manufacturers work on creating new types of macro modes, smartphones will just get better for photography."
  ],
  "headers": {
    "4": "Macro is lacking",
    "8": "How these new macro cameras work",
    "12": "Macro to the future"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro"
  }
}