{
  "source": "https://www.techradar.com/news/adata-unleashes-ultra-fast-4000-mbs-external-ssds",
  "title": "Adata unleashes ultra-fast 4000 MB/s external SSDs",
  "category": "computing",
  "updated": "2021-08-06T20:33:48Z",
  "author": "anthony-spadafora",
  "summary": "Adata SE920 external SSDs will feature a USB4 interface",
  "article": [
    "At its Xtreme Innovation virtual event in Taipei to mark its 20th anniversary, Adata has unveiled its first external SSD with a USB4 interface with the claim that it's the “world's fastest portable storage device”.",
    "The company's new SE920 external SSD is capable of delivering a max transfer speed of 4000 MB/s thanks to the inclusion of USB4. The new device is even four times faster than its USB 3.2 predecessors according to Adata's online product launch video.",
    "Adata's new SE920 drives are also equipped with the company's proprietary heat conduction technology for maximum stability in any environment to keep the device cool and optimal.",
    "When the Adata SE920 series launches, the company plans to offer different versions of its first USB 4 external SSD in a variety of capacities.",
    "However, during its virtual event, Adata did not reveal any details on the pricing of these drives or provide any information on the architecture they'll use.",
    "Still though, Adata's SE920 drives will likely be among the fastest portable hard drives as they will be able to outperform both USB 3.2 drives as well as those using a Thunderbolt 3 or Thunderbolt 4 interface when it comes to sequential read speed.",
    "We'll likely find out more on the Adata SE920 series from the company once we get closer to its launch later this year.",
    "Via Tom's Hardware"
  ],
  "headers": {
    "3": "Adata SE920 external SSD"
  },
  "links": {
    "virtual event": "https://www.techradar.com/best/best-virtual-event-platforms",
    "Adata": "https://www.techradar.com/news/adata-just-revealed-the-worlds-fastest-ssd",
    "external SSD": "https://www.techradar.com/news/best-portable-ssd",
    "USB4": "https://www.techradar.com/news/usb4-everything-you-need-to-know",
    "online product launch video": "https://www.youtube.com/watch?v=T6JQygZsAXE&t=441s",
    "portable hard drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "USB 3.2": "https://www.techradar.com/news/usb-32-to-take-over-the-worlds-computers-but-not-how-you-think",
    "Thunderbolt 4": "https://www.techradar.com/news/thunderbolt-4-what-you-need-to-know-about-next-generation-connectivity",
    "Tom's Hardware": "https://www.tomshardware.com/uk/news/adata-launches-external-usb4-ssd-with-a-4000mbs-throughput"
  }
}