{
  "source": "https://www.techradar.com/news/new-qualcomm-ceo-promises-powerful-new-chip-to-rival-the-apple-m1",
  "title": "New Qualcomm CEO promises powerful new chip to rival the Apple M1",
  "category": "phones",
  "updated": "2021-07-02T11:12:33Z",
  "author": "steve-mccaskill",
  "summary": "New Qualcomm CEO Cristiano Amon says chip should be ready in 2022",
  "article": [
    "New Qualcomm CEO Cristiano Amon has told laptop manufacturers that, by next year, it should have a PC processor capable of challenging the M1 chip Apple uses to power its MacBook range.",
    "Amon replaced the retiring Steve Mollenkopf last month, having joined the company as an engineer back in 1995.",
    "As president, Amon is responsible for Qualcomm’s semiconductor business and has been instrumental in the development of its 5G technical roadmap and strategy.",
    "The company’s mobile processor and modem technology powers the vast majority of high-end Android smartphones, but Amon wants the San Diego-based firm to secure a greater share of the PC market too.",
    "Previous efforts have failed to make a serious impact on a space that has traditionally been dominated by Intel and AMD. However, Amon told Reuters in an interview that he believes that Qualcomm will enjoy greater success by designing its own PC chips, rather than licensing designs from Arm.",
    "A key factor will be matching the energy efficiency of Apple’s processors, a capability that has greatly extended the life of the MacBook range, but Qualcomm also believes its connectivity expertise will be hugely significant as the industry shifts to 5G.",
    "“We needed to have the leading performance for a battery-powered device,\" Amon is quoted as saying. “If Arm, which we've had a relationship with for years, eventually develops a CPU that's better than what we can build ourselves, then we always have the option to license from Arm.”",
    "Other areas of opportunity he identified include an Android market reacting to Huawei’s struggles and ongoing growth in China.",
    "One segment that Qualcomm has no intention of expanding into is data centre chips. However, Amon did say that the company could licence chip designs to cloud giants wanting to build their own processors.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Qualcomm chip shortage"
  },
  "links": {
    "MacBook": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Reuters": "https://www.reuters.com/technology/qualcomms-new-ceo-eyes-dominance-laptop-markets-2021-07-01/"
  }
}