{
  "source": "https://www.techradar.com/news/browser-wars-microsoft-edge-is-showing-the-first-signs-of-weakness",
  "title": "Browser wars: Microsoft Edge is showing the first signs of weakness",
  "category": "computing",
  "updated": "2021-05-04T10:21:58Z",
  "author": "joel-khalili",
  "summary": "Microsoft Edge has failed to climb above Firefox in the browser rankings",
  "article": [
    "Microsoft Edge, the company’s flagship web browser, has enjoyed rapid growth since it went live last year, but new figures suggest the service may have reached an abrupt plateau.",
    "According to data from Statcounter, Edge’s market share has dipped month-on-month for the first time, falling from 3.45% in March to 3.39% in April. The drop marks the end of a run of fourteen consecutive months of growth.",
    "On its previous trajectory, Edge looked set to vault beyond established rival Firefox, which has suffered a slow but steady decline over the past twelve months. However, although Firefox only holds 3.59% of the market, the latest data suggests predictions may have been misguided.",
    "Microsoft debuted the new Chromium-based Edge in January 2020, with the launch of the first stable build. The browser took a few months to gain any momentum, but its growth quickly steepened in the spring.",
    "The increase in adoption can be attributed in part to renewed marketing efforts, but also to improvements made to the platform that bring it in line with the experience a user might expect from a modern web browser.",
    "The introduction of features such as vertical and scrolling tabs, a secure password generator and in-built price comparison tool all proved popular with users. As did a number of tweaks designed to improve the browser’s performance, including sleeping tabs and a feature known as start-up boost.",
    "In a recent update, Microsoft also stated bundling the new Edge with Windows 10 by default, increasing the browser’s install base dramatically almost overnight. However, it appears a larger install base has not necessarily translated into a larger user base.",
    "Although Microsoft will be encouraged by its early performance, Edge remains a minor player in comparison to Google Chrome, which holds 64.47% of the market. Despite controversy surrounding Google’s new replacement for third-party cookies, FLoC, Edge appears to have struggled to wrestle users away from the top dog.",
    "Another factor contributing to the apparent plateau is that, until now, the growth of Edge has been fuelled by the decline of Internet Explorer and Edge Legacy, both of which have been retired by Microsoft.",
    "Over the last twelve months, the Internet Explorer market share has dropped from 1.41% to 0.71%, while Edge Legacy has fallen from 2.23% to 0.25%. With few gains left to tap into here, Microsoft will need to find a way to snatch users from the largest browsers in the market if Edge is to return to growth."
  ],
  "headers": {
    "3": "New Microsoft Edge"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "Statcounter": "https://gs.statcounter.com/browser-market-share",
    "password generator": "https://www.techradar.com/best/password-generator",
    "FLoC": "https://www.techradar.com/news/google-is-trialling-its-first-alternative-to-tracking-cookies"
  }
}