{
  "source": "https://www.techradar.com/news/the-best-memorial-day-appliance-sales-deals-from-home-depot-lowes-and-more",
  "title": "Memorial Day appliance sales 2021: best deals from Home Depot, Lowe's and more",
  "category": "appliances",
  "updated": "2021-08-26T16:26:13Z",
  "author": "mackenzie-frazier",
  "summary": "Memorial Day appliance sales are live - see the best deals",
  "article": [
    "The Memorial Day appliances sales event is officially underway with fantastic deals from all your favorite retailers like Home Depot, Best Buy, Lowe's, Walmart, and More. It's the perfect opportunity to score record-low prices on major appliances, kitchen devices, robot vacuums both from stalwarts like Roomba as well as newer brands, as well as cordless and handheld vacuums, and more. To help you sort through all the offers, we're rounding up the best Memorial Day appliance sales below and the stand-out deals on air fryers, robot vacuums, coffee makers, and more. Appliances are always a popular category during Memorial Day sales, with retailers offering some of the best discounts you'll find all year from top brands like Samsung, LG, Whirlpool, and more. You can find record-low prices on a wide range of appliances, including refrigerators, dishwashers, and blenders to vacuums, air fryers, coffee makers, and so much more. See the best Memorial Day appliance sales below as well as the top stand-out deals, and keep in mind, most offers end today, so you should take advantage now before it's too late.",
    "See more offers with our roundup of the best Memorial Day mattress sales and the best Memorial Day TV deals."
  ],
  "headers": {
    "1": "More Memorial Day sales"
  },
  "links": {
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "Roomba": "https://www.techradar.com/news/best-robot-vacuums",
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "best Memorial Day mattress sales": "https://www.techradar.com/news/memorial-day-mattress-sale-2021",
    "best Memorial Day TV deals": "https://www.techradar.com/news/memorial-day-tv-sales-2021"
  }
}