{
  "source": "https://www.techradar.com/news/joaquin-phoenix-weighs-in-on-those-joker-2-rumors",
  "title": "Joaquin Phoenix weighs in on those Joker 2 rumors",
  "category": "entertainment",
  "updated": "2021-10-07T09:54:14Z",
  "author": "axel-metz",
  "summary": "“There are some things we could do with this guy”",
  "article": [
    "Joaquin Phoenix has weighed in on the possibility of a sequel to 2019’s Joker.",
    "In a recent interview with The Playlist, the actor confirmed that, while he’s interested in developing the eponymous anti-hero further, he doesn’t know whether a follow-up movie will ever happen.",
    "“There are some things we could do with this guy and could [explore] further,” Phoenix said, \"but as to whether we actually will? I don’t know.” It’s clear, then, that development on a second Joker movie hasn’t yet gotten underway.",
    "The movie’s director, Todd Phillips, originally said that he and his team have “no plans for a sequel,” though reports emerged earlier this year suggesting that Warner Bros. had indeed given Phillips the green light for another Joker instalment.",
    "Nothing has yet been confirmed officially, though, with those rumors coming primarily from a blink-and-you'll-miss-it quote in a THR article on attorney Warren Dern suggesting that Phillips (one of Dern's clients) had \"struck a deal to co-write the next Joker.\"",
    "Phillips has also been quoted as implying that any potential sequel would be dependent on Phoenix's involvement, telling IGN in 2019 that “if we can figure it out, and if Joaquin's down to do it, we would do it.”",
    "Given the actor’s recent comments to The Playlist, then, it looks like a Joker follow-up has got the seal of approval from both its would-be leading man and filmmaker. In theory, it’ll now be up to Warner Bros. to “figure it out,” as Phillips puts it.",
    "Put simply, we expect it would – especially if Phoenix is up for it, which was perhaps the biggest question mark over a potential sequel.",
    "Joker was a huge – and likely unexpected – financial success for the studio, raking in a whopping $1 billion from a reported budget of less than $70 million, so it figures that Warner Bros. would jump at the chance to cash in on a follow-up movie.",
    "Part of the original’s appeal, though, was its stripped back approach to telling the origin story of a character so often accustomed to big-budget superhero productions. Not to spoil the ending of Phillips’ Joker, but any potential sequel seems unlikely to be capable of matching that same character-driven narrative interest.",
    "Joker is a character study that intimately follows the life of a downtrodden individual on his way to becoming the face-painted villain popularized by the original comics – that’s what made it such an interesting, if divisive, take.",
    "Any sequel, though, would be forced to either pick up almost immediately after the original’s ending, or some years down the line – but either way, it would struggle to carry the same emotional power as the original movie, simply because there’s very little room left for further developing the Joker as a character.",
    "Still, that’s unlikely to deter Warner Bros. from heading back to Gotham City. Money talks, after all, and having Phoenix return to the role would almost certainly prove a profitable move for the studio.",
    "Should there be a Joker 2? Probably not. Will there be? It’s looking likely, at this point. Given Phoenix’s supposed lack of knowledge around the whole project, though, we wouldn’t expect to see a sequel arrive any time soon."
  ],
  "headers": {
    "7": "Analysis: Would Warner Bros. head back to Gotham?"
  },
  "links": {
    "The Playlist": "https://theplaylist.net/joaquin-phoenix-still-open-to-more-joker-hasnt-heard-updates-sequel-20211005/",
    "reports emerged": "https://www.techradar.com/news/joker-is-getting-a-sequel-but-does-it-need-one",
    "THR article": "https://www.hollywoodreporter.com/lists/hollywood-most-powerful-lawyers-2021/warren-dern-9/",
    "IGN": "https://www.ign.com/articles/2019/12/03/todd-phillips-joker-sequel-dc-black-label-pitch",
    "reported budget": "https://deadline.com/2019/10/joker-box-office-opening-weekend-1202752002/"
  }
}