{
  "source": "https://www.techradar.com/news/new-oneplus-nord-phone-may-launch-in-us-soon-fcc-filings-suggest",
  "title": "New OnePlus Nord phone may launch in US soon, FCC filings suggest",
  "category": "phones",
  "updated": "2021-06-11T23:35:26Z",
  "author": "david-lumb",
  "summary": "A new OnePlus phone may release in the US after approval from FCC",
  "article": [
    "A new OnePlus phone might be released in the US soon, as two unnamed devices have been certified by the FCC. Could these be versions of the OnePlus Nord N200 5G?",
    "TechRadar first confirmed from OnePlus CEO Pete Lau that the N200 5G would be coming exclusively to the US and Canada. The phone would launch a bit later than the OnePlus Nord CE 5G’s June 10 release date, Lau said – meaning a forthcoming launch of these two mystery phones lines up with the N200 5G’s launch window.",
    "The two phones approved by the FCC only have model numbers, DE2118 and DE2117, which could represent the T-Mobile and unlocked versions, theorized PhoneArena, which first noticed the filings. The site further pointed out that the phones were likely distinct from the earlier Nord N10 and N100 phones, which used a BE prefix for their model numbers; no OnePlus phone has used a DE prefix before.",
    "Given the just-released OnePlus Nord CE 5G was confirmed not to come to the US, we can reasonably expect that these FCC-approved models don’t refer to that phone. The Nord CE – for ‘Core Edition’ – is a version of last year’s OnePlus Nord that’s stripped away a few features for more affordability, OnePlus confirmed to TechRadar ahead of its release.",
    "Nor do we suspect the FCC-approved phones to be the OnePlus 9T and 9T Pro, which we expect later in the year when the T-series OnePlus flagship phones typically launch. Thus, the OnePlus Nord N200 is a good guess, but we’ll wait to hear more about an upcoming US release."
  ],
  "headers": {
    "3": "What phone ISN’T this likely to be?"
  },
  "links": {
    "confirmed": "https://www.techradar.com/news/exclusive-oneplus-nord-ce-design-first-look-and-how-oneplus-designed-it",
    "DE2118": "https://fccid.io/2ABZ2-EF000/Label/DE2118-Label-5175724",
    "PhoneArena": "https://www.phonearena.com/news/fcc-document-could-signify-imminent-unveiling-of-new-oneplus-nord-phone-for-the-states_id132802",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled"
  }
}