{
  "source": "https://www.techradar.com/news/ces-2021-highlights",
  "title": "CES 2021 news: it's over – but here are the highlights and best tech",
  "category": "appliances",
  "updated": "2021-07-15T16:05:52Z",
  "author": "henry-st-leger",
  "summary": "Live CES 2021 news updates and hands-on updates of the remote tech show's best gadgets",
  "article": [
    "CES 2021 is over and our deep dive into CES news and highlights is winding down. But we'll continue to update this page with hands-on experiences of the best CES gadgets we've checked out, many from from afar and a few in person.",
    "We recapped all of the CES 2021 highlights and rounded up all the hottest tech from CES 2021, in case you missed the major announcements from the likes of LG, Samsung and Sony, among many others.",
    "There's been a wave of big news across 8K TVs, rollable tablets, affordable 5G smartphones, terrifyingly capable drones, and faster laptop chipsets. Of course, there's also been a generous sprinkling of weird tech, including Moflin the AI pet robot, smart face masks and a spectacularly unnecessary gaming chair from Razer.",
    "In short, there's a lot to catch up on. Despite being a remote, virtual experience this year, CES 2021 has shown that it's still a weird and wonderful way to get a taster of the tech year ahead. Day 4 was mostly just be a wrap up day – and dominated by the Samsung Galaxy S21, Galaxy S21 Plus, and Galaxy S21 Ultra announcements.",
    "The biggest story of CES 2021 has arguably been the LG Rollable smartphone, which we saw for the first time in a short teaser trailer. That doesn't mean there haven't been some other strong contenders for the CES limelight, though.",
    "Day two was the turn of the graphics card titans, with Nvidia and AMD both delivering big news. The confirmation that Nvidia's RTX 3000 graphics cards are coming to gaming laptops is huge news that could see next-gen laptops arrive with a serious performance boost. Not to be outdone, AMD fought back by showing off its exciting Ryzen 5000 series of mobile processors.",
    "This followed several big CES 2021 stories in TVs and home theater land on the previous day. A landmark announcement was LG Display's confirmation that 42-inch OLED TVs will launch this year. We've been waiting for OLED tech to arrive in smaller screen sizes for a while, so this could be big news if you've been thinking about getting a second screen for your home this year.",
    "Keener to upgrade your home cinema audio? Samsung also announced a new Dolby Atmos soundbar, which could be its most immersive yet and pair nicely with its new flagship 8K TV, the Samsung Neo QN900 8K QLED TV. The tech giant also revealed some AI-powered washers and dryers for those of us who are unimpressed by the intelligence of our home appliances, and confirmed that the Samsung Galaxy S21 will arrive on Thursday.",
    "With Sony also showing off its Airpeak drone for the first time and TCL confirming that it'll be launching a rollable or foldable phone this year, CES 2021 has been a brilliant sneak peek of the biggest launches coming this year.",
    "In the last few days alone, Samsung has announced its new Neo QLED TVs that offer brighter, more colorful pictures; Sony unveiled its new Cognitive XR Processor as a successor to the X1 Ultimate and Acer has announced the next generation of Chromebooks.",
    "We've also seen lots of new audio products from the likes of JBL, as well as a mightily impressive Dolby Atmos soundbar from Samsung.",
    "That said, today is the day that everyone's been able to watch LG, Panasonic, Samsung and Sony take to the virtual stage to talk about their other upcoming innovations. You can expect to hear a lot more about the next-gen 8K TVs and IoT smart devices, plus a few surprises at the Samsung Unpacked event that's happening in the middle of CES week.",
    "Once the keynotes are over, the CTA (the company behind the event) says that it's opening a virtual show hall that exhibitors will be able to show off their wares and answer questions from attendees and retailers about their new products. Exhibitors will be able to hold meetings of up to 30 people at a time and chat in real-time with one another. It's all the practical parts of CES, basically, without all of us crowding into the Las Vegas Convention Center.",
    "So what, exactly, are we going to see at this year's show? This guide will run you through our predictions for Sony, Samsung, AMD, and more based on pre-show rumors and what they got up to at last year’s event.",
    "A press release on the CES website originally put the CES 2021 dates at January 6-9, however those dates have since shifted to January 11-14, 2021.",
    "That first day of the show will be keynotes from AMD, General Motors, Verizon and the CTA themselves, plus press conferences from LG, Sony and Samsung.",
    "Here's the complete January 11 press day schedule provided by the CTA:",
    "In a typical year, CES takes over Las Vegas for nearly a week, with tech brands and press coming from all over the world to meet, make deals, and cover the latest announcements all together. How any of that will happen when it's online-only is kind of hard to foresee, but it's something the CTA has been hammering out for months, so we're expecting things to run smoothly.",
    "Future CES events have definitive dates, too. CES 2022 and CES 2023 are scheduled for January 5-8, while CES 2024 is pencilled in for January 9-12.",
    "Keynote time: January 11 at 9 am EST on Samsung's global news website.",
    "CES is always a big show for Samsung. It’s the place the company picks to roll out its latest QLED TVs, concept screens and monstrous custom-installs, plus innovations in the computing and phone space.",
    "Samsung's First Look event gave us a glimpse of what's to come, with the brand taking the wraps off its QLED TV successor - a technology it’s dubbed Neo QLED - that packs in 10 times the amount of LEDs into a screen to radically increase brightness, reduce blooming and widen viewing angles.",
    "As well as that, we've seen Dolby Atmos soundbars, new TV models for 2021, and even a solar-powered smart remote. Will Samsung's press conference bring more surprises? Only time will tell.",
    "Samsung CES 2021 news",
    "Samsung CES 2021 previews",
    "Keynote time: January 11 at 5 pm EST",
    "Sony has just released its latest noise-cancelling headphones, the Sony WH-1000XM4 (which we’ve dubbed the best headphones of 2020), so it’s unlikely that we’ll see a new pair of flagship over-ear headphones from the tech giant debut at CES 2021.",
    "While we're hoping to see a follow up to the Sony WF-1000XM3, we're not super hopeful for many groundbreaking announcements – CES 2020 was pretty quiet for the company. Saying that, Sony has already unveiled new wireless speakers and an update to its 360 Reality Audio technology.",
    "Sony CES 2021 news",
    "Keynote time: January 11 at 8 am EST on Exhibition.LG.com.",
    "LG usually uses CES as a launchpad for its latest TV range, and 2020 was no different. We saw a fleet of 8K TVs shown off, as well as confirmation of a new 48-inch OLED size. LG announced that the glass-panel E Series OLED was being retired in favor of a Gallery Series model, too, so we don’t expect the former to show up in any guise at CES 2021.",
    "So far, LG has announced a fleet of new laptops, a new Smart TV interface, and shown off its bendable OLED and transparent displays.",
    "Gamers, in particular, should be excited about the recently unveiled Bendable CSO (Cinematic Sound OLED) display that can morph between a flatscreen TV and a curved monitor at the press of a button.",
    "Speaking of rollables, we’ve been hearing that the launch of the rollable Signature Series OLED R has been imminent for a few trade shows now, though, so don’t be surprised if LG makes the same announcement at CES 2021.",
    "LG CES 2021 news",
    "Hisense usually puts on something of a show at tech expos, and in 2020 we saw it unveil a refresh of its projector-television hybrid, more ULED TVs, and a new DualCell technology – one that combines two TV panels for enhanced contrast.",
    "Hisense’s OLED ambitions have been dashed by this point, and we don’t expect any O8B successors at CES 2021. More laser TVs, as well as more mid-range quantum dot displays, seem likely. The popular Hisense Roku TV line expanded to the UK in late 2018, too, and we wouldn’t be surprised to see Hisense announce a refresh next year.",
    "TCL runs on a slightly different release schedule than many TV brands, which can mean CES is a bit light on concrete information. At the 2020 expo it announced plans for a new fleet of Mini-LED TVs – to compete with OLED models – which use smaller LEDs for more precise brightness control than traditional LCD screens.",
    "Those TVs just started rolling out in the US in the form of the new 6-Series R635 models and launch alongside new 5-Series TVs that, for the first time ever, use QLED technology.",
    "On top of that, TCL recently confirmed its range of Roku TVs were coming to Europe and South America, and most likely the UK too. More details on this will likely come at IFA 2020, but there’s a chance that the company’s global pipeline – with precise product names and pricing – for its new Roku sets could take until January 2021 to see the light of day.",
    "Last year, Panasonic announced its first noise-cancelling true wireless earbuds, the RZ-S500W, which represented a cheaper alternative to the likes of the Sony WF-1000XM3 and the AirPods Pro.",
    "While we were impressed with the quality of noise cancellation, the audio left a little to be desired, with muddy bass frequencies. At CES 2021, we’d love to see an improved version of these earbuds with a more well-balanced soundstage.",
    "We expect more high-end Panasonic TVs to be on show, too. Panasonic opened CES 2020 with its new HZ2000 OLED, and news of light-sensitive HDR calibration (via Dolby Vision IQ). We may get to hear more about its mid-range OLED plans at CES 2021, given the recently-announced HZ980 model hasn’t been available to review, and it may be Panasonic is testing the waters before plunging into this price band more firmly.",
    "Panasonic CES 2021 news",
    "CES 2020 surprised us by featuring one of Philips’ OLED TVs, the OLED 804. Unfortunately, we won't be seeing any Philips TVs at CES 2021, as was recently confirmed to us by a spokesperson for the company.",
    "Companies rarely debut new phones at CES given the smartphone-focused Mobile World Congress (MWC), which starts a month later, has traditionally been the stage for teasing and debuting that year’s handsets.Which doesn’t mean we won’t see any phones at CES 2021 – in the past, some enterprising companies have used the dearth to introduce new handsets in a relative vacuum of phones announcements.",
    "That was the case with the Flexpai Royole, which debuted at CES 2019 as the world’s first foldable a full month before Samsung showed off the original Galaxy Fold at MWC 2019. But we’ve also seen newcomers to the phones industry show their stuff, like TCL did when the company debuted its first-ever smartphones, the TCL 10 Pro, TCL 10L and TCL 10 5G at CES 2020. Bigger companies do occasionally unveil new phones, but they’re often more affordable models that are headed for limited markets, like the Samsung Galaxy A51 and Samsung Galaxy S10 Lite that also appeared at CES 2020.",
    "Ergo, we’re not expecting big phones to debut at CES 2021 – but we could see some budget and mid-range handsets from companies that don’t want to be outshone at MWC 2021. Given how well those affordable models have performed this year, we wouldn’t be surprised if companies more boldly announced their cheaper handsets at the biggest tech show on the world – even if it’s just online.",
    "Here's all the mobile news and our early product reviews so far from CES 2021:",
    "CES has been pretty low-key for camera announcements in the last few years, as the big guns tend to favor Japan’s CP+ Show in February or their own independent launches. Still, we were treated to a few teaser announcements at CES 2020, including the Canon EOS 1DX Mark III – and with the Photokina camera show (now held every May) postponed until 2022, we may see some interesting arrivals at CES 2021.",
    "Another factor could be the knock-on effect of delays from the global pandemic, which could see announcements that were originally scheduled for late 2020 pushed back to January 2021. For example, the latest rumors suggest that we could see a Nikon Z9 or Sony A5 all arrive in early 2021. It’s feasible that one or more of these cameras could get teaser announcements at CES 2021, but this is more likely to happen after the show.",
    "Would the likes of Canon, Nikon and Sony risk a full launch getting lost in the noise of a big generalist tech show? That’s less likely, so there’s a bigger chance that some of the more fringe camera brands – think Insta360, DJI and GoPro – will again step in to fill the photographic gap with some new action cameras and drones. As is CES tradition, we’d also expect to see a crazy storage story like a 2TB microSD card from the likes of SanDisk.",
    "CES 2020 was a great year for audio, and we’re expecting to see more great headphones, earbuds, soundbars, and Bluetooth speakers in 2021, too.",
    "Sony will likely be the brand to watch, having dominated the noise-cancelling headphones and true wireless earbuds market for the last year, with class-leading models like the Sony WH-1000XM4 and the Sony WF-1000XM3 making waves in the audio world. The time is right for a new generation of the WF-1000XM3s, and we’re crossing our fingers that CES 2021 will be the place to see them.",
    "In fact, last year was dominated by true wireless earbuds, with audio brands experimenting with adding smart features to the diminutive form factor. Mobvoi, for example, brought us the TicPods 2 Pro, which can be controlled with a shake of the head, while Klipsch announced its (still yet to be released) T10 true wireless earbuds, which come with built-in artificial intelligence.",
    "While these features were certainly interesting, many weren’t fully realized; CES 2021 could see a refinement of features like AI and gesture-control, making them worth buying into.",
    "The over-ear headphones category felt somewhat sparse at CES 2020, so we could see more audiophile-focussed cans at this year’s event. It was the same story for smart speakers and wireless speakers, too – with such a focus on true wireless earbuds last year, we’d love to see more gadgets for at-home listeners at CES 2021.",
    "Here's all the latest audio news from CES 2021 so far:",
    "2021 will likely be a big year for many of the biggest TV brands. We’ve seen both Samsung and LG push hard into 8K TV technologies – and in both cases CES 2020 was the occasion they chose to announce it.",
    "LG also confirmed quite big lineup changes at the event, ditching the E Series OLED in favor of the new Gallery Series, and Samsung raised eyebrows with its rotating Sero TV, so the most exciting news might come from elsewhere next time around.",
    "Panasonic has had a relatively quiet year, with little changing in its TV lineup aside from a new mid-range OLED model, the HZ980. We’re yet to hear much of it and review units aren’t being sent out, so we predict it may be paving the way for a bigger refresh of the company’s TV range at the CES expo next year.",
    "At CES 2020, it was clear that TV brands were thinking big, with many 75-inch-plus screens on display. But they were also thinking small, with confirmation of a new 48-inch OLED size, a 32-inch version of Samsung’s The Frame (2020) display, as well as TV models designed for use with smartphones rather than 4K Blu-ray players or AV receivers.",
    "We expect CES 2021 to dive deeper into these extremes, with more 48-inch OLEDs than the LG CX and Sony A9G we have currently, and more compact 32-inch / 43-inch sizes for premium sets.",
    "CES is always a big event in the computing world, mainly because the big hardware players Intel, AMD and Nvidia often announce new components, which leads PC and laptop makers like Dell, HP and Lenovo to release new models of their devices that feature the cutting edge tech.",
    "CES 2021 looks set to be no different, with Intel, AMD and Nvidia all hosting keynote presentations throughout the week. Each one is expected to announce new hardware that will power next generation laptops, and there are hints we could see powerful new desktop components as well.",
    "If these companies do show off new mobile components, you can be sure that laptop makers won't waste any time showing off their new devices as well. We're hoping to see slimmer and more powerful laptops this year, as well as drastically improved battery lives as well. We'll also be on the lookout for weird and wonderful laptops and PCs that do really new and exciting things.",
    "Peripheral makers such as Razer and Thermaltake will also be in attendance, so we should be seeing some great new gadgets to plug into our PCs as well. In fact, we confidently predict that CES 2021 will be huge for PC gaming.",
    "Registration for CES 2021 is available now to the public now at the CES website. In terms of cost to the average public, the CTA plans to charge a $149 fee. The fee will apply to most attendees, including retailers, but like in past years, credentialed journalists and analysts will be exempt."
  ],
  "headers": {
    "4": "Quick CES 2021 recap",
    "67": "CES 2021: how to register"
  },
  "links": {
    "hottest tech from CES 2021": "https://www.techradar.com/news/techradars-hottest-at-ces-2021-awards",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "gaming chair": "https://www.techradar.com/news/best-pc-gaming-chair-5-best-chairs-to-game-in-comfort",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable-teased-as-the-first-phone-with-a-rollable-screen",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "42-inch OLED TVs will launch this year": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "new Dolby Atmos soundbar": "https://www.techradar.com/news/samsungs-new-dolby-atmos-soundbar-could-be-its-most-immersive-yet",
    "Samsung Neo QN900 8K QLED TV": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "AI-powered washers and dryers": "https://www.techradar.com/news/samsungs-new-washers-and-dryers-use-ai-to-clean-your-clothes-more-efficiently",
    "Airpeak drone": "https://www.techradar.com/news/sony-airpeak-drone-release-date-price-rumors-and-leaks",
    "rollable or foldable phone this year": "https://www.techradar.com/news/tcl-confirms-it-will-launch-a-rollable-or-foldable-phone-this-year",
    "Neo QLED TVs": "https://www.techradar.com/news/samsung-neo-qled-tvs-meet-the-future-of-quantum-dot-tvs",
    "Sony unveiled its new Cognitive XR Processor": "https://www.techradar.com/news/sony-oled-tvs-could-shine-brighter-than-lgs-thanks-to-new-xr-processor",
    "Acer has announced the next generation of Chromebooks": "https://www.techradar.com/news/acers-amd-powered-chromebook-spin-514-aims-to-revolutionise-chromebooks",
    "Dolby Atmos soundbar from Samsung": "https://www.techradar.com/news/samsungs-new-dolby-atmos-soundbar-could-be-its-most-immersive-yet",
    "Samsung Unpacked": "https://www.techradar.com/news/samsung-galaxy-s21-launch-date",
    "press release": "https://www.ces.tech/News/Press-Releases/CES-Press-Release.aspx?NodeID=321a27ba-86f2-4c8d-92d2-fb0f4580ed18#:~:text=The%20Consumer%20Technology%20Association%20(CTA,media%20from%20around%20the%20world.",
    "Samsung's global news website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3340368878040321500&xs=1&url=https%3A%2F%2Fnews.samsung.com%2Fglobal%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fces-2021-highlights",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "best headphones of 2020": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Exhibition.LG.com": "https://urldefense.proofpoint.com/v2/url?u=http-3A__exhibition.lg.com_&d=DwMFaQ&c=5oszCido4egZ9x-32Pvn-g&r=4yZOPRIt7wEWcUzzOwPYlGjqdcNwHWbw_l3DFW_Yud0&m=MZ0ie7a5v99Gl4gAJcKQDtnTINIaSjdJu7UrU7llfSA&s=neoD1f0y9aJ6yShsZUj4KiZAG3ua0X_xkpXA-cAGRs4&e=",
    "E Series OLED": "https://www.techradar.com/news/the-e9-oled-was-one-of-lgs-best-tvs-so-where-did-it-go",
    "Gallery Series": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "Signature Series OLED R": "https://www.techradar.com/reviews/lg-signature-series-oled-tv-r-65r9",
    "more ULED TVs, and a new DualCell technology": "https://www.techradar.com/news/hisense-shows-off-flashy-laser-tvs-and-dual-cell-uleds-for-ces-2020",
    "O8B": "https://www.techradar.com/reviews/hisense-o8b-oled-tv",
    "Hisense Roku TV": "https://www.techradar.com/reviews/hisense-roku-tv-r50b7120uk",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "6-Series R635": "https://www.techradar.com/news/tcls-new-6-series-tvs-could-rival-lg-oled-screens-at-a-third-of-the-price",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "and most likely the UK too": "https://www.techradar.com/news/tcl-roku-tvs-are-finally-coming-to-europe-with-uk-models-in-sight",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "RZ-S500W": "https://www.techradar.com/reviews/panasonic-rz-s500w",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "HZ2000 OLED": "https://www.techradar.com/reviews/panasonic-hz2000-oled-tv/reviews/panasonic-hz2000-oled-tv",
    "Dolby Vision IQ": "https://www.techradar.com/news/dolby-vision-iq-is-about-to-make-hdr-tvs-even-better-to-look-at",
    "recently-announced HZ980 model": "https://www.techradar.com/news/panasonic-shakes-up-2020-tv-range-with-new-budget-oled-tv",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED 804": "https://www.techradar.com/reviews/philips-55oled804",
    "Flexpai Royole": "https://www.techradar.com/reviews/hands-on-royole-flexpai-review",
    "Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "TCL 10 Pro": "https://www.techradar.com/reviews/tcl-10-pro-review",
    "TCL 10 5G": "https://www.techradar.com/reviews/tcl-10-pro-review/reviews/hands-on-tcl-10-5g-review",
    "Canon EOS 1DX Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "Sony A5": "https://www.techradar.com/news/sony-a5-everything-we-know-so-far-about-the-rumored-full-frame-camera",
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "TicPods 2 Pro": "https://www.techradar.com/reviews/ticpods-2-pro",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "ditching the E Series OLED": "https://www.techradar.com/news/the-e9-oled-was-one-of-lgs-best-tvs-so-where-did-it-go",
    "Sero TV": "https://www.techradar.com/reviews/samsung-sero-tv-review",
    "32-inch": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "Samsung’s The Frame (2020)": "https://www.techradar.com/reviews/samsung-the-frame-tv-2020",
    "4K Blu-ray players": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "AV receivers": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy",
    "LG CX": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Sony A9G": "https://www.techradar.com/reviews/sony-bravia-a9g-ag9-oled",
    "43-inch": "https://www.techradar.com/news/best-40-inch-tv",
    "CES 2021 will be huge for PC gaming": "https://www.techradar.com/news/ces-2021-is-still-a-thing-and-its-going-to-be-huge-for-pc-gaming",
    "CES website": "https://www.ces.tech/Logistics/Register-Now.aspx"
  }
}