{
  "source": "https://www.techradar.com/news/zoom-is-coming-to-your-living-room",
  "title": "Zoom is coming to your living room",
  "category": "computing",
  "updated": "2021-08-19T22:39:55Z",
  "author": "anthony-spadafora",
  "summary": "Why not take your video calls on the biggest screen in your house?",
  "article": [
    "After launching Zoom for Home last year, Zoom has been working with its hardware partners to develop solutions to ensure that users have the best video conferencing experience wherever they find themselves working.",
    "As organizations are now in the process of transitioning their work from home policies to hybrid work policies, remote workers need to be equipped with the same capabilities as on-site workers to effectively communicate and collaborate.",
    "In a new blog post, Zoom has provided further details on how remote workers can take advantage of Amazon's second-gen Fire TV Cube, DTEN GO with DTEN Mate and Portal TV from Facebook to make high quality video calls right from their living rooms.",
    "Being cramped inside a small home office while working remotely can get tiresome which is why Zoom has worked with its hardware partners to bring its video conferencing software to the larger screens found on some of the best TVs.",
    "If you have a second-gen Fire TV Cube, you can start making calls with Zoom by downloading the company's app for Fire TV and plugging in a compatible webcam to the device using a Micro USB to USB adapter.",
    "For those that want take things up a notch though, DTEN's latest product DTEN Go is a portable, all-in-one appliance with four cameras, 12 microphones and 160 degrees of coverage that can transform your living room into a Zoom Room. However, the device can be paired with a ten-inch DTEN Mate companion tablet that allows users to annotate shared content and whiteboard ideas using its touch screen.",
    "For those that like to move around while video conferencing, Portal TV from Facebook may be a better choice as its Smart Camera pans and zooms to keep you in frame. The device also supports Zoom as well as all of the software's features including breakout rooms, screen sharing and virtual backgrounds.",
    "If attending meetings on a laptop in your home office has lost some of the initial appeal, then moving your video calls to the TV in your living room might be the perfect way to mix things up."
  ],
  "headers": {
    "3": "Extending your home office to the living room"
  },
  "links": {
    "Zoom for Home": "https://www.techradar.com/news/zoom-for-home-is-everything-you-need-for-remote-working-in-one-bundle-but-its-got-one-big-flaw",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "blog post": "https://blog.zoom.us/extend-home-office-to-living-room-with-amazon-dten-facebook/",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "best TVs": "https://www.techradar.com/news/best-tv",
    "Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "Zoom Room": "https://www.techradar.com/news/zoom-launches-hardware-subscription-service",
    "Portal TV from Facebook": "https://www.techradar.com/reviews/facebook-portal-tv",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}