{
  "source": "https://www.techradar.com/news/new-2021-apple-ipad-102-gets-surprise-dollar30-price-cut-at-amazon-its-selling-fast-though",
  "title": "New 2021 Apple iPad 10.2 gets surprise $30 price cut at Amazon - it's selling fast though",
  "category": "tablets",
  "updated": "2021-09-27T11:48:51Z",
  "author": "alex-whitelock",
  "summary": "The first post-launch discount on the 2021 Apple iPad 10.2",
  "article": [
    "The new 2021 iPad 10.2 has barely been released a few days but Amazon is already offered up a promising discounted price of just $299 (was $329) today.",
    "This isn't actually the first iPad deal we've seen on this model - the retailer has actually discounted both the Space Grey and Silver colors briefly during the tablet's initial pre-orders phase. This is, however, the first post-launch discount and the lowest price yet from Amazon.",
    "Note - Amazon's latest iPad deal is only available on the 64GB Space Grey color right now and delivery estimates currently range from one to four weeks. It's likely we'll see that estimate go up if this deal proves popular, so it's definitely worth acting quickly if you're interested.",
    "And, there's plenty of reasons to consider the new iPad 10.2 (2021) if you're looking for a great value Apple slate. While the overall design is quite iterative over last year's model, a new A13 Bionic processor, front camera upgrade, and storage bump from 32GB to 64GB make it a very compelling choice - especially at this price.",
    "Outside the US? See the best iPad deals in your region just below.",
    "We're rounding up plenty more of this week's best iPad deals here at TechRadar if you're looking for the latest on the other models. Also worth checking out are this week's best Amazon deals - including cheap 4K TVs, laptops, and much more."
  ],
  "headers": {
    "5": "More iPad deals at Amazon"
  },
  "links": {
    "of just $299 (was $329)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB09G9FPHY6%2F%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1216077500460303400-20",
    "iPad 10.2 (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "best iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "Amazon deals": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts"
  }
}