{
  "source": "https://www.techradar.com/news/intel-arc-alchemist-could-take-on-nvidia-gtx-1650-super-for-the-entry-level-gpu-crown",
  "title": "Intel Arc Alchemist could take on Nvidia GTX 1650 Super for the entry-level GPU crown",
  "category": "computing",
  "updated": "2021-12-02T11:15:07Z",
  "author": "darren-allan",
  "summary": "Intel Arc A380 is the rumored name of the entry-level graphics card",
  "article": [
    "Intel’s Arc Alchemist entry-level graphics card has seen another rumor spilled on the specs, including the rough performance level we can expect from this base offering.",
    "As shared by ever-present Twitter leaker Tum_Apisak, the GPU will apparently be named the Intel Arc A380 – presumably the ‘A’ stands for Alchemist – and it’ll come loaded with 6GB of VRAM, boasting a clock speed of 2.45GHz.",
    "This is the entry-level model with 128 EUs (Execution Units) and Tum_Apisak asserts that it will have performance levels equivalent to a GTX 1650 Super. On the AMD side, that roughly equates to an RX 590.",
    "It’s not mentioned here, but the expectation is that Intel’s lowest-end Alchemist graphics card will run with a 96-bit memory interface and a TDP of 75W.",
    "Elsewhere in rumor territory, we’ve heard that the price of this entry-level product will be $179 or thereabouts (around £135, AU$250), and previous speculation has pointed to 6GB of video memory, and also a clock speed of up to around the 2.5GHz mark. So, these latest nuggets are pretty much in line with what’s been aired so far…",
    "At first glance it might seem disappointing to see the new Alchemist graphics card roughly compared to the GTX 1650 Super for performance, but remember that this is Intel’s most basic GPU.",
    "Also consider that the GTX 1650 Super is still (broadly) okay for 1080p gaming, and that Intel’s purported Arc A380 still isn’t quite finished yet – it won’t be out until Q2 of 2022 in theory (mobile Alchemist cards are coming first, early next year), and so there’s still tweaking to be done for more speed with the drivers (which doubtless aren’t nearly optimal yet).",
    "The Arc A380 will also offer something else that the GTX 1650 Super doesn’t, namely XeSS or Intel’s take on DLSS, which should help to boost frame rates nicely without much impact on visual quality (or that’s the idea, anyway).",
    "As a bonus, the A380 will also support ray tracing, and will be considerably more power-efficient than the 1650 Super to boot (75W vs 100W).",
    "If the rumor mill is right about pricing, and Intel attacks on this front, and the A380 does indeed improve a bit with driver optimizations as the launch date rolls around, this could be a tasty option capable of taking the budget GPU crown. Indeed, just the simple availability of another budget card will be a big win in itself, considering the current climate for GPU stock woes (which is unlikely to be resolved next year, as we’ve heard).",
    "Via Wccftech"
  ],
  "headers": {
    "5": "Analysis: Put any hints of disappointment aside for now"
  },
  "links": {
    "Intel’s Arc Alchemist": "https://www.techradar.com/news/intel-arc",
    "graphics card": "https://www.techradar.com/news/nvidia-geforce",
    "GTX 1650 Super": "https://www.techradar.com/news/should-i-buy-the-nvidia-geforce-gtx-1650-super",
    "price of this entry-level product will be $179": "https://www.techradar.com/news/the-entry-level-intel-arc-alchemist-gpu-could-actually-be-affordable",
    "namely XeSS or Intel’s take on DLSS": "https://www.techradar.com/news/intel-xess-shown-with-hitman-3-and-the-nvidia-dlss-rival-looks-promising",
    "unlikely to be resolved next year, as we’ve heard": "https://www.techradar.com/news/nvidia-ceo-says-theres-no-magic-cure-for-gpu-shortage-thatll-last-until-2023",
    "Wccftech": "https://wccftech.com/intel-arc-a380-discrete-graphics-card-128-eu-gpu-clocked-2-45-ghz-6-gb-gddr6-memory-performance-gtx-1650-super/"
  }
}