{
  "source": "https://www.techradar.com/news/android-apps-on-oculus-quest-could-make-vr-an-office-staple-heres-how",
  "title": "Android apps on Oculus Quest could help us ditch our work laptops – here's how",
  "category": "computing",
  "updated": "2021-05-10T12:30:12Z",
  "author": "gerald-lynch",
  "summary": "The kick VR needs to become a productivity computing platform?",
  "article": [
    "A new Oculus Quest rumor suggests the Facebook-owned VR company could be bringing Android apps to its headsets. If so, it could lead to a major shake-up of what we consider our go-to computing devices.",
    "VR computing has been something of a pipe dream since the world first jacked into William Gibson’s 1984 novel Neuromancer. Here was a world where commerce, creative arts and the day-to-day admin of life was carried out within cyberspace – a second, digital realm parallel to real life.",
    "The modern evolution of virtual reality is still in its infancy, even if it is quickly maturing. Headsets like the Valve Index show the premium potential of high-end immersion, while the super-popular Oculus Quest 2, with its wireless capabilities, show that virtual reality can be accessible too. But despite some bespoke applications for businesses, and desktop mirroring software, virtual reality still hasn’t become an every day computing platform – one that can be productive as well as entertaining.",
    "However, the latest rumors point to Facebook’s Oculus VR division experimenting with bringing Android apps natively to its headsets, a potential gamechanger for computing in VR.",
    "YouTuber ‘The Mysticle’ spotted a number of Android apps in the ‘Preview App’ section of the Oculus store.",
    "The Preview App section is where developers can distribute test and preview builds of applications that are in the works for Oculus headsets.",
    "Briefly listed in the section was the indie game Among Us, social platforms TikTok and Snap, video conferencing software Zoom, streaming service Spotify, as well as the MS Remote Desktop and MS One Note office software. These currently do not have Oculus-specific variants, and were presented under the developer umbrella of “Android Apps for Quest.”",
    "Whether these prove to be full VR apps that take advantage of the platforms stereoscopic depth and presence – or merely 2D panes as if seen on a phone screen – remains to be seen. There has yet to be any official confirmation of them coming to VR, though Consulting CTO at Oculus, John Carmack, is known to be pushing for Android apps on Quest.",
    "But the potential for familiar apps within VR could really open the doors for VR headsets as a workplace mainstay, whether that’s in a commercial office space or the ever-increasing number of home offices.",
    "Familiarity and shared workflows are hugely important when it comes to productivity. If you can get up and running with an application that you are already comfortable with, you’re far more likely to use it in an unfamiliar environment, like VR. If you can use cloud services to seamlessly bring existing projects into the new platform, even better – and the Oculus headset’s grounding in the Android operating system make this very possible.",
    "There are still some hurdles that will need to be overcome for virtual reality headsets to become as ubiquitous in the office as computers and laptops, though.",
    "VR headsets are still relatively cumbersome items – as long as the working day remains eight hours long, today’s headsets are going to be too fatiguing to be practical. They also limit social interaction by virtue of their view-encompassing design, locking out the outside world – even if efforts to bring social spaces have improved, avatar design has evolved, and facial tracking for better emotive recognition has become more effective, too, with devices like the HTC Vive facial tracker.",
    "As with the potential introduction of Android apps, Oculus is leading the way here. It seems to be more aware than some of the importance of convenience in virtual reality experiences, removing as much friction as possible when jumping from one reality to another. Oculus is making a virtual desktop application a platform-based option in its headsets rather than a discrete app, and is allowing users to map a physical keyboard or even a chair into its guardian boundary system, letting users comfortable identify where their furniture and accessories are from within the headset.",
    "Perhaps all this effort will prove futile, and we’ll stick to the comfort of our regular computers, thanks to the decades of ergonomic and cultural moulding that has made them central to our everyday lives. Smartphones haven't exactly replaced the laptop, after all. Or perhaps it will be AR, augmented reality, rather than virtual reality, with its dual view of the real and digital realms, that will prove the more natural workplace platform. With Apple investing in AR for some time now, ahead of a big expected reveal later this year, it shows the potential power that the technology giant sees in AR’s future.",
    "But for now, all eyes are on, and in, VR. With Oculus making concerted efforts to improve the working situation inside virtual reality, it might not be long before our 9-to-5 takes place inside one of its headsets. Quest: Office Edition, anyone?"
  ],
  "headers": {
    "7": "VR office space",
    "12": "A comfortable working environment"
  },
  "links": {
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "The Mysticle": "https://twitter.com/TheMysticle?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1390473244357152778%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fpublish.twitter.com%2F%3Fquery%3Dhttps3A2F2Ftwitter.com2FTheMysticle2Fstatus2F1390473244357152778widget%3DTweet",
    "pushing for Android apps on Quest": "https://www.roadtovr.com/oculus-quest-android-apps-carmack-debate/",
    "HTC Vive facial tracker": "https://www.techradar.com/news/htc-vive-has-a-new-vr-trick-full-facial-tracking",
    "ahead of a big expected reveal later this year": "https://www.techradar.com/news/apple-glasses"
  }
}