{
  "source": "https://www.techradar.com/news/loginid-introduces-new-passwordless-authentication-wordpress-plugin",
  "title": "LoginID introduces new passwordless authentication WordPress plugin",
  "category": "computing",
  "updated": "2021-05-17T15:24:57Z",
  "author": "abigail-opiah",
  "summary": "Plugin looks to help reduce phishing attacks",
  "article": [
    "LoginID has launched its latest WordPress plugin, in a bid to strengthen online website’s security.",
    "With this plugin, websites powered by WordPress will be able to install strong passwordless authentication, with the solution set to also help website builders align to compliance regulations such as PSD2 and GDPR.",
    "According to LoginID, the integration of a customizable way to authenticate users will now be top priority, as the plugin comes into effect.",
    "Currently available on the WordPress Plugin Directory, the passwordless plugin is the company’s latest product that provides WordPress-created websites the ability to add passwordless, biometric sign on and registration.",
    "The company revealed the new capability will eradicate the risks of account takeovers, phishing, SIM swaps and man-in-the-middle attacks.",
    "Speaking on the new plugin, Simon Law, CEO of LoginID explained that unlike other popular single-sign on solutions, user information cannot be used for tracking purposes, ensuring a private experience on websites that integrate the LoginID WordPress Plugin.",
    "“The plugin can be easily installed by any WordPress developer in minutes, making it the fastest way to add FIDO-certified strong authentication into websites,” he added.",
    "The plugin allows websites to integrate FIDO-certified strong authentication in five clicks, and enables WordPress end users to register and authenticate through secure public key cryptography.",
    "It also eliminates the need for customers to enter a password when they log in to a WordPress website and reduces customer abandonment rates through seamless transactions, according to LoginID, which is the creator of the FIDO-powered passwordless authentication solution.",
    "The San Mateo/Toronto based company focused on bridging the gap between authenticating users and securing their information, through its FIDO2 and UAF certified customer authentication, privacy and tokenization platform."
  ],
  "headers": {
    "3": "WordPress plugin activated"
  },
  "links": {
    "WordPress plugin": "https://www.techradar.com/best/best-wordpress-plugins",
    "website builders": "https://www.techradar.com/news/the-best-website-builder"
  }
}