{
  "source": "https://www.techradar.com/news/apple-watch-7-is-out-now-but-you-may-struggle-to-get-one-soon",
  "title": "Apple Watch 7 is out now, but you may struggle to get one soon",
  "category": "wearables",
  "updated": "2021-10-15T09:21:44Z",
  "author": "james-rogerson",
  "summary": "There's a long queue",
  "article": [
    "It’s been a bit of a wait for the Apple Watch 7 to launch, as it was announced back on September 14 and it only went on sale October 15. But if you haven’t already ordered an Apple Watch 7, you might still have a long wait before you’ll get one.",
    "That’s because while the watch is winging its way to doorsteps as we speak, Apple is clearly struggling to keep up with demand, unsurprisingly perhaps, given our glowing Apple Watch 7 review.",
    "Apple’s online store estimates delivery dates of between November 25 and December 15 in the UK at the time of writing, for those ordering now, depending on the model you pick.",
    "The situation doesn’t seem quite so dire in the US, where the wait is listed as 5-7 business days for some models, but for others it’s up to 5-6 weeks. In Australia meanwhile the wait is listed as between 4 and 6 weeks, depending on model.",
    "With so many different strap options and other variables it may be possible to find a model with shorter waits than the times above, but most we've checked are in those ranges.",
    "There’s no guarantee that these wait times will get shorter anytime soon either, in fact they might even get longer, as Apple will presumably have burned through all the stock it had built up for launch. So if you want one, you should probably order it now.",
    "This situation was expected really, as analysts previously predicted that supply would be limited, suggesting that those who waited for the release date to place an order might even struggle to get the Apple Watch 7 this year. Thankfully the delays aren’t quite that bad yet, but they could get worse.",
    "The long wait between announcement and launch is likely because Apple was struggling to stockpile a large supply – something which reports suggest could be down to a combination of wider industry supply chain issues, and of ‘production snags’ related specifically to the Apple Watch 7.",
    "Demand for the Apple Watch 7 is unlikely to slow down anytime soon either, with the holiday season likely to attract present buyers, while others may have been waiting for reviews and placing their orders now."
  ],
  "headers": {
    "6": "Analysis: why is the Apple Watch 7 in such short supply?"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "ordered an Apple Watch 7": "https://www.techradar.com/deals/apple-watch-7-deals-sales",
    "Apple Watch 7 review": "https://www.techradar.com/reviews/apple-watch-7",
    "predicted that supply would be limited": "https://www.techradar.com/news/pre-order-an-apple-watch-7-tomorrow-or-risk-waiting-until-next-year-analyst-says"
  }
}