{
  "source": "https://www.techradar.com/news/sony-state-of-play-when-is-the-next-playstation-event-and-what-to-expect",
  "title": "Sony State of Play: when is the next PlayStation event and what to expect?",
  "category": "gaming",
  "updated": "2021-10-28T14:40:55Z",
  "author": "vic-hood",
  "summary": "What could we see at Sony's next State of Play event?",
  "article": [
    "Sony State of Play is a semi-regular digital event, which showcases the latest and greatest PlayStation news, updates, reveals and announcements.",
    "Since the showcase began in 2019, Sony has used State of Play to reveal The Last of Us 2 release date, debut gameplay footage for Ghost of Tsushima, and drop new trailers for games including Final Fantasy 7 Remake and Returnal. So it's always worth tuning in to the State of Play livestreams if you want to be alerted to any big announcements for PS5 games, PSVR games and PS4 games.",
    "The most recent State of Play stream took place on October 27 and focused on announcements and updates for upcoming third-party releases headed to PS5 and PS4, including Little Devil Inside, Death's Door and a spin-off of Let it Die.",
    "Sony hasn't confirmed when its next State of Play will take place, but that hasn't stopped us from predicting when the next event will happen and what we could see at it.",
    "Sony hasn't confirmed when its next State of Play event will take place, but we imagine the company will host another showcase before the end of the year - perhaps in December. This would allow it to showcase its upcoming PS4 and PS5 games ahead of Christmas, encouraging players who haven't yet picked up a PS5 to grab one (if they can) and to remind us of upcoming PlayStation releases in early 2022, such as the Uncharted: Legacy of Thieves Collection and Horizon Forbidden West.",
    "However, the next PlayStation event may not be a State of Play at all. There are rumors Sony will host an event called the \"PlayStation Experience\" in December, where it will finally unveil PSVR 2. Either way, we imagine there will be some sort of PlayStation event in December.",
    "As we've said above, we imagine Sony's next State of Play event will provide updates and announcements on PS4 and PS5 games coming in early 2022. The biggest release Sony has in that time period is PlayStation exclusive Horizon Forbidden West, which is due to release in February and is set to be one of the company's biggest games of the year. We also imagine the next event will give us an update on first-party titles Uncharted: Legacy of Thieves Collection, Bugsnax: The Isle of Bigsnax DLC and Forspoken.",
    "We could also see some third-party titles making an appearance, with a bunch of big hitters set to release between February and March 2022, including Saints Row, Elden Ring, Dying Light 2 and GTA 5 on PS5.",
    "But the most likely product that the next PlayStation event will focus on is the upcoming PSVR 2. Rumors suggest a full reveal of Sony's next-gen VR hardware will take place in December, so we imagine that the company's next showcase won't be a State of Play, but instead will be an event similar to Sony's PlayStation Showcase earlier this year - with PSVR 2 the main focus of the show. Alongside the reveal of the new hardware, we expect the announcement of PSVR 2 games too.",
    "The last State of Play took place on October 27 and had a focus on upcoming third-party titles for PS4 and PS5. The event gave us our first in-depth look at action-adventure Little Devil Inside but the biggest news from ther show was the announcement of the first Bugsnax DLC, which brings bigger bugs to the island in early 2022 for the appealing price of absolutely free. A new Star Ocean game was revealed (Star Ocean: The Divine Force), which will come exclusively to PS5 (and PS4) sometime in 2022. And we got our first look at King of Fighters XV, the first new game in the storied franchise in five years – and though it’s not coming until February 2022, a beta test will give players the chance to try it out for a late November weekend.",
    "We did however miss updates on bigger upcoming titles, which we thought could include Call of Duty: Vanguard, Battlefield 2042, Stray, Final Fantasy 14: Endwalker expansion or maybe even GTA 5 on PS5."
  ],
  "headers": {
    "4": "When is the next Sony State of Play?",
    "6": "What can we expect from the next Sony State of Play?",
    "9": "What was revealed at the last Sony State of Play?"
  },
  "links": {
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "PSVR games": "https://www.techradar.com/best/best-playstation-vr-games",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Uncharted: Legacy of Thieves Collection": "https://www.techradar.com/news/uncharted-is-coming-to-ps5and-pc",
    "Forspoken": "https://www.techradar.com/news/forspoken-release-date-trailers-news-and-rumors",
    "Saints Row": "https://www.techradar.com/news/saints-row-reboot-what-can-we-expect-to-see-from-volitions-next-game",
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "GTA 5 on PS5": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "Little Devil Inside": "https://www.techradar.com/news/ive-no-idea-what-little-devil-inside-is-about-but-i-cant-wait-for-it",
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Final Fantasy 14": "https://www.techradar.com/news/live/final-fantasy-14-endwalker-live-blog-come-and-experience-the-launch-with-us"
  }
}