{
  "source": "https://www.techradar.com/news/ps5-players-wont-get-future-bethesda-games",
  "title": "PS5 players won't get future Bethesda games",
  "category": "gaming",
  "updated": "2021-03-12T12:39:44Z",
  "author": "vic-hood",
  "summary": "It looks like future Bethesda titles will be Xbox exclusives",
  "article": [
    "Xbox boss Phil Spencer has confirmed that future Bethesda games will be exclusive to \"platforms where Game Pass exists\", meaning PS5 players will miss out.",
    "During the \"Bethesda Joins Xbox\" roundtable on March 11, Spencer addressed speculation around whether the acquisition will see future Bethesda titles, such as Starfield and The Elder Scrolls 6, becoming Xbox exclusives – and it's not good news for PS5 players.",
    "\"If you’re an Xbox customer, the thing I want you to know is that this is about delivering great exclusive games for you that ship on platforms where Game Pass exists,\" Spencer explained. \"That’s our goal, that’s why we’re doing this, that’s the root of this partnership that we’re building.",
    "But what does that mean for gamers? Well, it means Bethesda titles will be exclusive to platforms that house Xbox Game Pass: Xbox One, Xbox Series X, Xbox Series S and PC. It's a roundabout way of saying they won't come to PS5 or Nintendo Switch.",
    "However, games under contractual obligations from before the acquisition, such as Deathloop, will still land on PS5 – while games that currently exist on other platforms will continue to be supported.",
    "\"Obviously I can’t sit here and say every Bethesda game is exclusive, because we know that’s not true,\" Spencer said. \"There are contractual obligations that we’re going to see through, as we always do in every one of these instances. We have games that exist on other platforms, and we’re gonna go support those games on the platforms they’re on. There are communities of players and we love those communities and we’ll continue to invest in them. And even in the future, there might be things that have contractual things or legacy on different platforms that we’ll go do.\"",
    "It's not a huge surprise that Microsoft is choosing to utilize its Bethesda acquisition to secure exclusivity for some of the biggest game franchises around, but it is a major hit to those on PS5 who were looking forward to playing future Bethesda titles.",
    "Though it's worth noting that Starfield and The Elder Scrolls 6 may not fall under this Xbox Game Pass exclusivity umbrella if Sony has already secured the games on its platform, it is entirely possible that these big hitters will only be available on Xbox and PC – for a time, at least – especially given platforms haven't been confirmed for either yet.",
    "According to Microsoft and Bethesda, we'll find out more about future games during a special showcase event planned for this \"Summer\", so likely sometime in June."
  ],
  "headers": {
    "6": "A blow to PS5"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Bethesda Joins Xbox\" roundtable": "https://youtu.be/YJneU_qBMPM",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review"
  }
}