{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-tab",
  "title": "Samsung Galaxy Z Fold Tab release date, price and the foldable tablet leaks so far",
  "category": "phones",
  "updated": "2021-04-24T23:43:35Z",
  "author": "michael-hicks",
  "summary": "The world's first folding tablet?",
  "article": [
    "The Samsung Galaxy Z Fold Tab could be the world's first foldable tablet. Foldable phones – when unfolded – are nearly large enough to be mini-tablets, but this foldable could bridge the gap between Samsung's Galaxy phones and Galaxy Tab lineup.",
    "Samsung has so many foldables on the horizon that it's difficult to keep track, from the Galaxy Z Fold 3 to the Galaxy Z Flip 3 and Galaxy Z Flip Lite. The big (alleged) difference is that the Z Fold Tab could have two hinges instead of just one.",
    "The Samsung foldable tablet could combine the best features of the Galaxy Tab S7 Plus – one of the best tablets available today – with the tech and tricks behind the Fold and Flip lineups. We're hopeful that Samsung has enough experience with both categories to build a successful hybrid.",
    "We've seen several leaks and patents in recent days, showing up to four separate potential designs for the Galaxy Z Fold Tab. Let's dive into the different ways that Samsung could build its foldable tablet – plus our expectations for when it will arrive, how much it will cost, and some of its potential features.",
    "Most of our information on this mysterious Samsung foldable tablet comes from Gizmochina. It reported that the Samsung Galaxy Z Fold Tab release date would likely be in 'Q1 2022', which means anytime from January through the end of March.",
    "We don't have any speculation on the price. However, given that the original Galaxy Z Fold and Fold 2 cost about $1,999 / £1,799 / AU$2,999, and that the Z Fold Tab will be much bigger with multiple hinges, it could be an incredibly expensive luxury item.",
    "According to Gizmochina, we will likely learn more about the Galaxy Z Fold Tab in August 2021, when Samsung officially announces the Z Fold 3 and Z Flip 3. However, this hasn't been decided yet, and the reveal could be pushed back.",
    "We've seen four different potential designs for a Samsung foldable tablet, one from an alleged Samsung leaker and three from two separate Samsung patents. Any of them could end up being the final version of the Galaxy Z Fold Tab – or a separate foldable tablet entirely.",
    "Let's start with the most intriguing design: a tri-fold tablet. According to tipster Yogesh, Samsung is developing a triple-folding tablet with updated ultra-thin glass (UTG) to improve the phone's durability.",
    "Considering how expensive this tablet will likely be, it's heartening to hear that its display will be made of resilient materials.",
    "Otherwise, Yogesh only revealed one other potential feature: the Galaxy Z Fold Tab could ship with a new S Pen with unspecified upgrades on the old S Pen model. Since we just learned the Z Fold 3 likely won't ship with an S Pen, this is a welcome addition.",
    "The main reason for this Z-fold design is to have a tablet-sized device that could fit inside your pocket for transportation or use on the go. We tested a similar TCL prototype last year that worked surprisingly well in phone and tablet mode; however, when folded, it had the thickness of three phones, making it bulky to hold and difficult to slide inside tight pants pockets.",
    "That's potential Samsung foldable tablet number one. Letsgodigital spotted the second potential design in a Samsung patent that was approved in February 2021. In it, you'll find a much more straightforward tablet design: the Galaxy Z Fold Tab could have just one set of hinges, meaning it would only fold once.",
    "The patent describes itself as an 'ornamental design for a display device' but doesn't name itself as the Galaxy Z Fold Tab. This isn't surprising, as patents rarely give away information, yet this may be an entirely separate foldable tablet that could launch under a different Galaxy Z branding.",
    "If this does become the final Galaxy Z Fold Tab design, it will remove the potential for a tablet that could fit inside your pocket. On the other hand, fewer hinges and a more straightforward design could mean better durability and a more reasonable price.",
    "For the final two potential Galaxy Z Fold Tab designs, we turn once again to Letsgodigital, which found a Samsung WIPO patent for a 'foldable electronic device' approved on April 22.",
    "With this design, the center panel is twice as large as the two outer panels. Rather than folding in a Z shape, the two outer panels fold inward to meet one another in the middle, with a small magnetized slot between them to place an S pen.",
    "We mentioned two potential designs because Samsung's patent said that this design could have 'out-folding' or 'in-folding' panels. When folded shut, the Z Fold Tab could have two fully visible and usable cover panels on the left and right; or, they could fold inward, so none of the panels are visible when closed.",
    "The inward-folding design acts as a built-in protective case for transit. The outward-folding model is fascinating in concept, but it's unclear why anyone would use two panels with a pen in the middle; it's more likely they would use the other side (the larger middle panel) if they wanted a more compact, easier-to-hold layout.",
    "This final patent shows two punch-hole selfie cams on the central panel, while other patent sketches show dual cameras on the back or on the widened bezel of one foldable panel when closed.",
    "We don't know which, if any, of these potential designs will end up being used for the Galaxy Z Fold Tab. We'll have to wait for more Samsung leaks to get a clearer picture.",
    "As of this moment, we don't have hard details on specs, pricing, or other Samsung Galaxy Z Fold Tab – possibly because Samsung itself hasn't decided them yet. But based on our experiences with foldables, here's what we're hoping to see.",
    "Samsung should go bold and try to make its foldable tablet compact enough to fit inside a pocket. Otherwise, we don't see the appeal of a tablet that, when closed, still requires a backpack to carry around.",
    "Sure, it makes it easier to store and transport with the display protected, but otherwise, you're paying extra for a tablet with a crease (or two creases) in its center, with no reason to play with it in folded mode because it'll be too large to use one-handed.",
    "That's why the Galaxy Z Fold Tab should live up to the 'Z' in its name and let you condense it into thirds.",
    "The Galaxy Z Fold 2 weighs 282g (0.62lb) and when folded measured 16.8mm (~0.66in) thick, while most of the best phones weigh around 200g (0.44lb) with only 8mm (0.31in) of thickness.",
    "Now consider the Galaxy S7 tablet, which weighs 498g (1.1lb) and is 6.3mm thick without even considering folding it.",
    "Samsung needs to deliver a super-light and thin tablet that, when folded in on itself twice, won't become too difficult to hold one-handed. Looking at the best tablets, only the 2019 iPad Mini (304g) looks manageable. Get rid of the massive bezels, and you're looking at eight or nine inches of horizontal screen real estate.",
    "Folded into thirds, the Galaxy Z Fold Tab's width would be slightly wider than that of the folded Galaxy Z Fold 2 (about 68mm or 2.6in).",
    "Based on our prediction of how expensive this tablet/ phone hybrid will be, it needs to have the specs to justify the price. Because you could easily buy a high-quality phone and tablet separately for the same price, so why buy a mediocre combination of the two?",
    "The Galaxy Z Fold Tab needs a powerful battery capacity to keep its large display running; most phones stop at 5,000mAh, but most of the best tablets start at 7,000mAh.",
    "Next, it should take full advantage of Samsung's camera expertise and add plenty of megapixels to match the Galaxy S21 lineup. Camera quality was a weak point for the Fold 2 and Flip.",
    "Finally, it should have the new, rumored Armored Frame tech with a stronger frame and water resistance. We're not entirely clear how this kind of tablet could fit into a case, so it's important that it be able to withstand falls or the elements."
  ],
  "headers": {
    "4": "Samsung Galaxy Z Fold Tab release date and price",
    "7": "Samsung Galaxy Z Fold Tab rumors and leaked designs",
    "21": "What we want to see",
    "22": "1. Triple-fold design or bust",
    "25": "2. Keep the weight and size reasonable",
    "29": "3. Top-of-the-line specs"
  },
  "links": {
    "Foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy Z Flip Lite": "https://www.techradar.com/news/samsung-galaxy-z-flip-lite-leak-suggests-a-cheaper-foldable-phone-is-coming",
    "Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Gizmochina": "https://www.gizmochina.com/2021/04/15/exclusive-samsung-tri-fold-tablet-could-launch-as-galaxy-z-fold-tab-in-q1-2022/",
    "tri-fold tablet": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-be-followed-by-a-tri-fold-tablet-in-2022",
    "Yogesh": "https://twitter.com/heyitsyogesh/status/1382693303494270987",
    "won't ship": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-probably-wont-have-an-s-pen-slot-after-all",
    "TCL prototype": "https://www.techradar.com/news/this-is-the-best-foldable-phone-concept-weve-seen-so-far",
    "Letsgodigital": "https://nl.letsgodigital.org/smartphones/samsung-galaxy-z-fold-s-pen-2021/",
    "patent": "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=D910619.PN.&OS=PN/D910619&RS=PN/D910619",
    "WIPO patent": "https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2021075726",
    "best phones": "https://www.techradar.com/news/best-phone",
    "best tablets": "https://www.techradar.com/news/best-tablet",
    "Armored Frame": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-galaxy-z-flip-3-in-line-for-a-key-design-upgrade"
  }
}