{
  "source": "https://www.techradar.com/news/netflixs-avatar-the-last-airbender-show-finally-reveals-its-cast-and-whos-making-it",
  "title": "Netflix's Avatar: The Last Airbender show finally reveals its cast – and who's making it",
  "category": "entertainment",
  "updated": "2021-08-12T16:59:17Z",
  "author": "samuel-roberts",
  "summary": "The first wave of actors are revealed",
  "article": [
    "Netflix's upcoming live-action adaptation of the Nickelodeon animated favorite Avatar: The Last Airbender has revealed its cast – including the actor playing the protagonist Aang in the long-awaited series.",
    "Young actor Gordon Cormier, who featured in the recent TV adaptation of Stephen King's The Stand, will take on the role of Aang. Actress Kiawentiio is playing Katara in the show. Ian Ousley is playing Sokka, while Dallas Liu is playing Zuko in the series.",
    "Netflix notes this is only the first of the show's cast – so expect more character castings to be revealed down the line. The original series is about the siblings Sokka and Katara waking Aang after a long sleep – they learn he's an element-wielding being known as an Avatar, and need his air-bending abilities to help defeat an evil faction with world-dominating aspirations known as Fire Nation.",
    "Take a look at the four actors below:",
    "Another, arguably more crucial part of the Avatar: The Last Airbender behind-the-scenes has also been revealed: its writer and showrunner. The series will be overseen by Albert Kim, who has credits on Sleepy Hollow and Nikita, among other things. Other producers include Dan Lin, Lindsey Liberatore and Michael Goi. Roseanne Liang is one of the show's directors.",
    "This part is crucial because the show's original creators quit Netflix's adaptation last year – co-creator Michael Dante DiMartino said \"things did not go as we hoped\" in an open letter to fans, which was disappointing to those who loved the original animated series.",
    "The pressure is on to get this show right, then. Avatar: The Last Airbender originally aired between 2005 and 2008 on Nickelodeon, but it has subsequently found a second life in the world of streaming – and its appeal has arguably only grown since it ended. A sequel series, The Legend of Korra, followed in 2012 and expanded the show universe.",
    "\"...A live action version would establish a new benchmark in representation and bring in a whole new generation of fans,\" said Kim in a statement, explaining that the show offers the opportunity to \"showcase Asian and Indigenous characters as living, breathing people.\"",
    "He also says they'll be \"expanding and growing the world\" in the Avatar series, with \"surprises\" aimed to delight existing fans and excite newcomers.",
    "No release date has been set for the series yet.",
    "Netflix's Avatar: The Last Airbender series isn't the only game in town, however – in fact, the next few years are likely to bring us a number of new streaming projects set in that universe.",
    "Netflix will be arguably be competing with the original series creators, who founded a company called Avatar Studios specifically to make new projects based on the series with Paramount Plus and Nickelodeon – the rights holders to the franchise. Already in the works as part of that deal is a new Avatar animated movie. More projects will follow.",
    "Why is Avatar so popular now? Streaming has supercharged its popularity in the modern age, and the appetite for more stories in that universe is clearly huge. It's the same story we've seen with so many shows that emerged in a past era of TV: people want to bring it back because they know fans will pay to see more of a certain set of characters or fictional universe.",
    "Paramount Plus, though, has the added bonus of the original creators' input. That's why Netflix's adaptation is likely to face more of an uphill struggle with fan perception."
  ],
  "headers": {
    "10": "Analysis: Why Avatar: The Last Airbender is now a streaming battleground"
  },
  "links": {
    "quit Netflix's adaptation": "https://www.techradar.com/news/netflixs-avatar-the-last-airbender-adaptation-loses-its-original-creators",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch"
  }
}