{
  "source": "https://www.techradar.com/news/celebrate-pride-month-with-this-excellent-free-pc-and-xbox-game-giveaway",
  "title": "Celebrate Pride Month with this excellent free PC and Xbox game giveaway",
  "category": "gaming",
  "updated": "2021-06-07T13:42:54Z",
  "author": "hamish-hector",
  "summary": "Tell Me Why is free until June 30",
  "article": [
    "Tell Me Why, Dontnod's episodic narrative-adventure title, won universal praise upon its initial August 2020 release.",
    "The video game was the first of its kind to feature a transgender character as one of its main characters and, to celebrate Pride month (which runs throughout June), you can play Tell Me Why for free right now on Xbox and PC.",
    "The three-part game can be downloaded in its entirety at no cost until June 30th and, if you download it before then, you’ll be able to keep the game permanently.",
    "If you’ve played either of Dontnod’s other titles - Life is Strange or its sequel Life is Strange 2 - before, you’ll have an idea of what to expect from Tell Me Why. This heartfelt story is told through choose-your-own-adventure style gameplay and there are a few supernatural elements thrown in to spice things up, too.",
    "Given that you can now play Tell Me Why for free, there’s no reason not to give it a try. Just remember to head to Steam, the Windows 10 store or the Xbox marketplace before June 30th to snag yourself a copy.",
    "In its blog post announcing the Pride month giveaway, Dontnod has given some suggestions for how your savings could be spent elsewhere.",
    "If you’re looking for another game to play after Tell Me Why, Dontnod recommends you try That Which Faith Demands by Jenna Yow, Spirit Swap by Soft Not Weak, Ikenfell by Happy Ray Games, or If Found… by DREAMFEEL (all of which are made by trans and queer creatives). Alternatively, Dontnod asks that you consider donating to charity, particularly one that helps “Black, Latinx/Latine and/or Indigenous trans people.”",
    "However, if you aren’t able to give anything that’s okay, too. Adding the games to your wishlist can be a huge boost for visibility, and simply being an outspoken advocate for trans rights can be more than enough support for the community."
  ],
  "headers": {
    "5": "Supporting trans creatives and charities"
  },
  "links": {
    "Life is Strange": "https://www.techradar.com/news/gaming/life-is-strange-and-the-importance-of-contemplation-1313600",
    "Life is Strange 2": "https://www.techradar.com/news/life-is-strange-2-explores-adolescence-and-the-bond-between-brothers",
    "blog post": "https://www.tellmewhygame.com/pride-month-2021/"
  }
}