{
  "source": "https://www.techradar.com/news/windows-11-update-might-fix-your-printer-issues-but-who-knows-at-this-point",
  "title": "Windows 11 update might fix your printer issues, but who knows at this point",
  "category": "computing",
  "updated": "2021-12-05T22:20:36Z",
  "author": "joel-khalili",
  "summary": "Windows 11 and 10 have been plagued by printer-related issues",
  "article": [
    "Microsoft is testing an update for Windows 11 that should remedy multiple printing issues encountered by a large section of users.",
    "Available to members of the Insider early access program, the new Windows 11 build addresses a problem whereby some USB printers fail to complete installation via the Internet Printing Protocol (IPP).",
    "The new build also fixes a separate issue, which is causing various errors when users attempt to launch prints remotely via Windows print servers.",
    "Although the fixes are currently available to early-access members only, they should roll out far and wide as part of next month’s Patch Tuesday updates on December 14.",
    "While the new Windows 11 build will supposedly fix a number of printing problems, this isn’t the first time we’ve heard that in recent months.",
    "Last month, it was discovered that the now-infamous PrintNightmare vulnerability had made its way to Windows 11, despite multiple rounds of patches for Windows 10, each of which was supposed to have cracked the problem.",
    "At a similar time, manufacturer Brother announced that many of its inkjet printers and laser printers were malfunctioning with Windows 11 when connected via USB. All in all, this problem was thought to have affected roughly 90 SKUs.",
    "Later, it emerged that multiple versions of the Windows OS had begun to demand admin credentials before executing certain print jobs. Thankfully, this problem only arose in situations where the print client and server were located in different time-zones, sparing pretty much all home users - but multinational businesses weren’t so lucky.",
    "Although problems are to be expected when a brand new operating system first goes live, Microsoft will want to get a handle on these printing issues sooner rather than later. Whether the latest Windows 11 build spells the end of printer troubles will become apparent when the fixes are made public next month.",
    "You might also want to check out how to fix a stuck Windows update.",
    "Via Bleeping Computer"
  ],
  "headers": {
    "4": "Windows 11 printing bugs"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "printers": "https://www.techradar.com/news/best-home-printer",
    "made its way to Windows 11": "https://www.techradar.com/news/windows-11-joins-windows-10-in-breaking-printers",
    "inkjet printers": "https://www.techradar.com/news/best-inkjet-printers",
    "laser printers": "https://www.techradar.com/news/best-laser-printer",
    "malfunctioning with Windows 11": "https://www.techradar.com/news/a-large-number-of-printers-may-not-work-with-windows-11",
    "demand admin credentials": "https://www.techradar.com/news/want-to-print-your-windows-11-documents-youll-have-to-be-an-admin",
    "fix a stuck Windows update": "https://www.techradar.com/how-to/software/operating-systems/how-to-fix-a-stuck-windows-update-1326307",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/microsoft/new-windows-11-build-fixes-widespread-printer-issues-system-freezes/"
  }
}