{
  "source": "https://www.techradar.com/news/these-are-the-windows-10-apps-and-services-microsoft-is-killing-off-in-2021",
  "title": "These are the Windows 10 apps and services Microsoft is killing off in 2021",
  "category": "computing",
  "updated": "2021-01-05T17:26:01Z",
  "author": "matt-hanson",
  "summary": "Make a note",
  "article": [
    "Microsoft is constantly updating and tweaking both Windows 10 and its Microsoft 365 subscription service, and that often means that some outdated or under-used applications and features get cut.",
    "While the services and apps usually killed off by Microsoft are rarely used (or so outdated that they’ve been replaced with better, more secure, alternatives), there will still be soe people who continue to rely on them – so TechRepublic has handily listed all the apps and services Microsoft is ceasing support for in 2021, along with their expected retirement dates.",
    "If an app or product you use is listed below, you should start looking into alternatives. While you may want to stick with what you’ve been using, it’s never recommended to continue to use an app or service that is no longer being updated or supported.",
    "And, as frustrating as it is, there’s usually a good reason why Microsoft has ended support, especially when it comes to security.",
    "January 11: TLS 1.0 and TLS 1.1",
    "On January 11, Microsoft’s Exchange Online service will no longer support the TLS 1.0 and TLS 1.1 protocols. If you use Exchange Online for sending and receiving emails, you should make sure you’ve upgraded to TLS 1.2, which offers greater security.",
    "February 15: Skype for Business Online Connector",
    "If you use Skype for Business Online Connector to manage online meetings, you have until February 15. After that, you’ll need to use the latest version of Microsoft Teams, instead.",
    "Microsoft has been planning to move Skype for Business users over the Teams, so it’s worth making the jump as soon as possible to get to grips with the new app, as the company seems committed to killing off Skype for Business entirely.",
    "March 9: Microsoft Edge",
    "The original Microsoft Edge web browser, which came with Windows 10, will stop being supported in March. Instead, users are encouraged to use the new version of Microsoft Edge, which has been rebuilt based on the Chromium web engine – which is what Google’s Chrome web browser uses.",
    "If you install the Windows 10 20H2 update (also known as the Windows 10 October 2020 update), the new Edge will be automatically included.",
    "It’s never recommended to use a web browser that is no longer being supported or updated with new security fixes, so we recommend you make the change as soon as possible. In our opinion, the new version of Edge is a big improvement on the original.",
    "August 17: Microsoft 365 support for Internet Explorer 11",
    "Another of Microsoft’s old web browsers is getting more features cut. Microsoft 365’s services and online applications will no longer support Internet Explorer 11. If you are still using that old web browser, you will find after August 17, 2020, you may no longer be able to access Microsoft 365 apps and tools online, and many features will be unavailable.",
    "Microsoft has been weaning people off Internet Explorer for years now, encouraging them to upgrade to Edge. Any users still using Internet Explorer should move to a newer web browser as soon as possible.",
    "September 30: Visio Web Access",
    "At the end of September, Microsoft will kill off Visio Web Access (Visio Service) and its Web Part for SharePoint Online, and will instead move customers to Visio Online.",
    "After this date, Visio Web Access diagrams will only be available for viewing, not for editing.",
    "If you still use any of the above apps and services, it is worth making preparations for moving to an alternative as quickly as possible. You don’t want to still be relying on them when Microsoft ends support."
  ],
  "headers": {
    "4": "The apps and services due to be killed off in 2021"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review?region-switch=1582243200",
    "Microsoft 365": "https://www.techradar.com/news/office-365-is-becoming-microsoft-365-heres-what-you-need-to-know",
    "TechRepublic has handily listed all the apps": "https://www.techrepublic.com/article/microsoft-feature-and-application-retirement-dates-to-remember-in-2021/",
    "Windows 10 October 2020 update": "https://www.techradar.com/news/windows-10-20h2-update"
  }
}