{
  "source": "https://www.techradar.com/news/exclusive-oneplus-nord-ce-5g-is-official-and-itll-be-cheaper-than-a-oneplus-9",
  "title": "Exclusive: OnePlus Nord CE 5G is official, and it’ll be cheaper than a OnePlus 9",
  "category": "phones",
  "updated": "2021-05-27T13:24:46Z",
  "author": "james-peckham",
  "summary": "CEO Pete Lau has confirmed the phone is coming soon",
  "article": [
    "OnePlus is about to announce new Android phones as cheaper alternatives to the OnePlus 9 and OnePlus 9 Pro. The first is called the OnePlus Nord CE 5G and it’ll be joined by another handset called the OnePlus Nord N200 5G, TechRadar can confirm.",
    "OnePlus CEO Pete Lau spoke to TechRadar and confirmed the existence of both the new handsets as well as a few other details about the upcoming cheaper alternatives to the company’s flagship phones.",
    "The OnePlus Nord CE 5G – the CE stands for Core Edition – is a revamped version of last year’s Nord handset. Lau says, “we have distilled the original Nord down to its core elements, and added a few extra features to create a great everyday phone at an even more affordable price.”",
    "That handset will be announced on June 10, and it’ll be released in both Europe and India. We’ve yet to hear any specifics on price, or what specs we can expect from this handset.",
    "The company has also confirmed the OnePlus Nord N200 5G, which is an exclusive product for those in the US and Canada. This won’t debut at the company’s June 10 event, and we’ll instead have to wait a touch longer to hear more about the handset.",
    "OnePlus has yet to share specs for either of these handsets, but it has given us a few tidbits of information with our time talking to Lau. It’s likely you’ll have to wait until June 10 to get the full picture of the Nord CE, while the N200 5G may take even longer.",
    "Both handsets, as their names suggest, are 5G compatible. Last year’s OnePlus N100 wasn’t a 5G handset, so that is an upgrade for this year’s cheaper device.",
    "“Making the signature OnePlus experience more accessible is a balancing act” said Lau. “But there are certain classic flagship features which we have brought onto the OnePlus Nord series this year to ensure we are delivering that fast and smooth experience with the Nord series.”",
    "Exactly what those flagship features are is unclear at the moment, and Lau wouldn’t hint at anything further apart from 5G connectivity. It may be the company announces features over the coming weeks, as it has done for previous launches.",
    "Lau continued, “OnePlus Nord CE 5G delivers a fast and smooth experience and powerful core features all backed by the OnePlus quality users know and love.”",
    "The OnePlus Nord was a great combination of a lower price phone with some top specs, and we gave the original handset a 4.5 star review back in 2020. We particularly liked its design, its versatile camera and the performance of the phone.",
    "If the OnePlus Nord CE 5G has remarkably similar specs to last year’s handset, this may not be as impressive a year later as the competition has improved around the OnePlus Nord. That said, the name ‘Core Edition’ sounds like it may be a cheaper handset than last year’s Nord.",
    "Lau said that the reaction to the original OnePlus Nord handsets has influenced this series of devices. He said “We’ve learned more about what our users have really enjoyed about the Nord, and also gained a deeper understanding into what they are looking for in a more affordable phone.",
    "Lau claims the brand has created an “even more accessible product”. Exactly what Lau means by accessible here is unclear, but it may be specifically about price and how these handsets will be affordable alternatives to more expensive options on the market including the company’s own flagship phones.",
    "Does this mean the OnePlus Nord 2 doesn’t exist? Lau didn’t confirm the OnePlus Nord CE 5G is a direct sequel to last year’s standard OnePlus Nord, and his wording in our interview sounds like it may be a separate device.",
    "A leak on the OnePlus website this week included the name OnePlus Nord 2, so while Lau didn’t confirm the product’s existence it may well be that there is at least one other smartphone to come in this series.",
    "June 10 may be where we hear more details, or it may be that the OnePlus Nord 2 is coming at a later date altogether.",
    "The OnePlus Nord N100 was a bit of a surprise in 2020, and it was an even more affordable product than what OnePlus offered with the original Nord smartphone.",
    "Lau wouldn’t share any further details about the Nord N200 5G. He said “With the OnePlus Nord N200 5G, we've given the N100 successor 5G capabilities to further improve the user experience at an even more accessible price point.”",
    "He also claimed “users can expect this to be one of the most affordable 5G smartphones available within the North American market.” That isn’t an exact price, but we should hopefully hear more from the company on that in the near future.",
    "It may well be that this handset is very similar to the OnePlus N100, but this time it will come with 5G connectivity which the original handset did not. Exactly what we can expect from this next smartphone is very unclear at the moment."
  ],
  "headers": {
    "14": "But what about the OnePlus Nord 2?",
    "17": "What about the OnePlus Nord N200 5G?"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus N100": "https://www.techradar.com/news/oneplus-nord-n10-5g-and-n100-announced-as-two-new-super-cheap-phones",
    "OnePlus website this week": "https://www.techradar.com/news/oneplus-nord-2-confirmed-seemingly-by-accident"
  }
}