{
  "source": "https://www.techradar.com/news/the-best-games-shown-at-black-voices-in-gaming-2021-and-why-events-like-this-matter",
  "title": "The best games shown at Black Voices in Gaming 2021 – and why events like this matter",
  "category": "computing",
  "updated": "2021-06-08T11:50:49Z",
  "author": "rosario-blue",
  "summary": "What we loved from the showcase of up-and-coming Black game developer talent",
  "article": [
    "On Saturday June 5 2021, The Guerrilla Collective held its second two day online games showcase. Hosted by Justin Woodward and Alex Wilmer, its first day featured Black Voices in Gaming, a showcase of up-and-coming Black game developer talent, a portion of which we’ll showcase later.",
    "The Guerrilla Collective is, in Woodward’s words, “a global coalition of leading game studios, publishers, and industry Leaders, coming together to help bring new announcements, gameplay trailers and reveals from studios of all sizes direct to enthusiasts worldwide.”",
    "Produced by the Media Indie Exchange (MIX), an organization created by indie developers and indie lovers with indie studios in mind, the Collective has helped uplift the work of many developers by giving them real connections and opportunities. The event concludes on Saturday June 12, 2021 and is available to watch on Twitch, IGN, GameSpot, Steam and the Guerrilla Collective website.",
    "Where are all the Black developers? When you look around at games and see so few, it’s easy to think they’re just not there. Of course, we know they are, and with E3 right around the corner, now would be a good time to discuss this.",
    "Many of them have spoken about their struggles trying to gain access to the gaming space, saying that often publishers are not interested in supporting their work. One reason given is publishing their game would isolate the (apparently) predominantly white player-base.",
    "Take, for instance, Dani Lalonders’ inability to secure funding for her game, the visual novel Validate (one of the games on our list). She was told it wasn’t marketable enough – visual novels are already a niche market in gaming, and one that features only people of color was considered too hard to sell.",
    "“A lot of publishers were just like, you know, that’s too risky,” said Lalonders during the event. “Or, like, maybe [they’re] a little racist. You know, it’s just the gaming industry.”",
    "In the end she made the decision other Black developers have sometimes had to resort to – funding it herself, a route that isn’t realistic for many creators.",
    "After Lalonders released a demo of Validate last summer, the game garnered an extraordinary amount of backlash from racist gamers. They didn’t like that only people of color featured heavily in it, and unfortunately, anticipation of this backlash was another reason publishers were put off funding the title.",
    "2020 was not just the year that a global pandemic hit, it was also the year that the Black Lives Matter movement grew momentum, following the murder of George Floyd. The ensuing worldwide outcry was heartening; people of all races and backgrounds came together to make their stance against racism known loud and clear.",
    "Many industries, including that of tech and gaming, pledged to make real change, making statements detailing how they would make their companies more inclusive and reflective of today’s society.",
    "Some of those companies have kept to their word, while others have dropped the ball considerably.",
    "In June 2020, Humble Games (famed for its Humble Bundle which releases some of its bundles using a pay-what-you-can system, and donates a lot of the proceeds to charities) announced that it was launching its $1 million annual Black Game Developer Fund.",
    "The fund was created to publish Black game developers via the Humble Games publishing label. It provides marketing, funding, and production for developers from Black African, Caribbean and African American backgrounds.",
    "What is less heartening is the number of organizations that haven’t kept to the promises made last year. It makes their activism appear performative. The best you can say is they were simply caught up in the “moment”, which, in the manner of moments, has passed.",
    "While it might make many in the industry uncomfortable, the tech and gaming industry is overwhelmingly white, to the degree where some companies do not have a single staff member of color in its ranks.",
    "Much of the blame is put on the belief that Black developers are rare, but events like Black Voices in Gaming show this to be untrue, opening up the conversation and creating an opening for Black developers to come forward and be seen.",
    "Much like famous hip-hop magazine XXL’s Freshman Class list, which highlights the best up and coming rappers in the game, Black Voices in Gaming has its own Freshman Class 2021, which highlights the best games coming from independent Black developers.",
    "This year’s list is a great example of the amount of talent and creativity these developers have, some of whom have benefitted from Humble’s Black Game Developer Fund.",
    "Kung Fu kickball is a hilarious fighting sports game developed by WhaleFood Games. In this action-packed side-on 2D multiplayer title, you have to kick the ball into your opponent’s bell. But to do that, you’ll have to (get to) kick the crap out of your opponents.",
    "KungFu kickball has 1v1 and 2v2 online multiplayer modes, an arcade coop mode, and six detailed stages along with six unique characters: Monk, Legend, Panda, Assassin, Old Master and drunken Boxer. Published by Blowfish Studios, the title is available to purchase on Steam as an early access title.",
    "For the hardcore arcade games fan there’s a limited release of KungFu Kickball arcade cabinets available for purchase. Contact WhaleFishGames.",
    "Validate is a visual novel developed and published by Veritable Joy Studios. It takes you through the complex journeys of twelve twentysomething singles, promising 70-90 hours of gameplay and 60 routes through the ups and downs of the characters’ lives.",
    "Validate is an exceptionally inclusive labor of love that deserves recognition for the various topics it covers. Issues such as gentrification, gender identity, race, anxiety and other mental health conditions are all tackled delicately in Validate.",
    "And, while it’s not available for purchase just yet, you can add it to your wishlist on Steam, and try out the free demo to get a taste of it.",
    "She Dreams Elsewhere is a dark and surreal RPG set in an unsettling dream world.",
    "Developed and Published by Studio Zevere, you play as Thalia, a woman stuck in a coma, unable to escape the horrors of the nightmare world she is experiencing in her dreams. This narrative-heavy and hard-hitting title explores the mental health issues and identity crises.",
    "You have to fight the nightmares that haunt your dreams in a strategic turn-based combat system, with an appealing pixelly, mostly black and white art style that truly captures the twisted and deeply disconcerting impact that anxiety can have on one’s mind.",
    "You can add it to your Steam wishlist and try out the free demo untill its release.",
    "Originally released in 2015, The Celestial Tear: Demon’s Revenge is an episodic RPG set in a sci-fi fantasy universe.",
    "Developed by White Guardian Studios,“ Where Video Games and Comics Collide”, The Celestial Tear: Demon’s Revenge has a rich storyline, with classic RPG and 2D pixel art and an impressive art and turn-based (“combo-based”) combat system.",
    "Developers Tyrell and Whitney White decided to rework the game in a new engine for better performance and with new features and additions.",
    "Add it to your wishlist on Steam and check out the motion comic book series that tells the wider story. You can also support the studio on Patreon and Twitch.",
    "Super Space Club is an action shooter in which you battle it out to reign supreme as the best defender of the galaxy.",
    "Developed and published by Graham of Legend, this visually stunning game featuring cool lo-fi beats requires you and your crew of pilots (the Super Space Club) to defeat your enemies while keeping your ship’s energy pumping, and avoiding the trip of shame back to your base.",
    "Super Space Club feels like you’re being transported back in time to 80’s arcade mega-star Asteroids, and serves as a great example of why indie games development is so important – much-loved genres will never die!",
    "Add it your wishlist on Steam and keep up to date with Super Space Club news on the Graham of Legend website.",
    "Onsen Master is a time management arcade game set in a Japanese Onsen (a hot springs bath). You have to manage your customers’ needs: greeting them, mixing ingredients and healing their ailments.",
    "Developed by Waking Oni Games and published by Whitethorn Games, Onsen Master is a cute singleplayer title with anime-style art and visual novel-style dialogue. Set in a fictional island called Izajima, six Onsens await you. Putting you in mind of Spirited Away, the game also features yokai (spirits, monsters, demons).",
    "It’s available to add to your wishlist on Steam, where you can also request access to join its playtest, but it’s only configured for a controller at the moment.",
    "While there may not be very much that you can do as an individual in terms of publishing or marketing for Black developers, things as simple as a follow on their socials, wishlisting their titles on Steam or Humble, and so on, remind them that there are people interested in the work that they create.",
    "Gaming and tech is diversifying, even beyond race, but the more companies, organizations, and businesses get behind this change the more real and effective it will be."
  ],
  "headers": {
    "3": "Why amplifying Black voices in gaming is important",
    "9": "Performative allyship?",
    "17": "Best games from the Black Voices in Gaming Freshman Class 2021",
    "19": "Kung Fu Kickball",
    "22": "Validate: Struggling Singles In Your Area",
    "25": "She Dreams Elsewhere",
    "29": "The Celestial Tear: Demon’s Revenge",
    "33": "Super Space Club",
    "37": "Onsen Master",
    "40": "How you can help"
  },
  "links": {
    "Twitch": "https://www.twitch.tv/yinandrell",
    "IGN": "https://www.youtube.com/watch?v=GFmtz1NWynw&ab_channel=IGNIGNVerified",
    "GameSpot": "https://www.youtube.com/watch?v=H_wuLg5gE3w&ab_channel=GameSpotGameSpotVerified",
    "Steam": "https://store.steampowered.com/app/1334780/Onsen_Master/",
    "Guerrilla Collective": "https://www.guerrillacollective.com/",
    "E3": "https://e3expo.com/",
    "Black Lives Matter": "https://blacklivesmatter.com/about/",
    "Humble Games": "https://www.humblegames.com/",
    "Humble Bundle": "https://www.humblebundle.com/?partner=pcgamer",
    "hip-hop magazine XXL": "https://www.xxlmag.com/",
    "Black Voices in Gaming": "https://blackvoicesingaming.com/",
    "Freshman Class 2021": "https://blackvoicesingaming.com/events/black-voices-in-gaming-freshman-class-2021",
    "KungFu kickball": "https://www.kungfukickball.com/",
    "Blowfish Studios": "https://www.blowfishstudios.com/game/kfk",
    "WhaleFishGames": "mailto:Hello@WFGames.com",
    "Validate": "https://validategame.com/",
    "Studio Zevere": "https://www.studiozevere.com/",
    "White Guardian Studios": "https://whiteguardianstudios.com/",
    "The Celestial Tear: Demon’s Revenge": "https://celestialtear.com/",
    "Add it to your wishlist on Steam": "https://store.steampowered.com/app/385190/Celestial_Tear_Demons_Revenge/",
    "Patreon": "https://www.patreon.com/YinandRell",
    "Super Space Club": "https://grahamoflegend.com/superspaceclub",
    "Graham of Legend": "https://grahamoflegend.com/superspaceclub",
    "Onsen Master": "https://whitethorndigital.com/onsen-master",
    "Waking Oni Games": "https://wakingonigames.com/",
    "Whitethorn Games": "https://whitethorndigital.com/"
  }
}