{
  "source": "https://www.techradar.com/news/apple-may-be-planning-the-first-imac-redesign-in-almost-a-decade",
  "title": "Apple may be planning the first iMac redesign in almost a decade",
  "category": "computing",
  "updated": "2021-04-19T11:38:35Z",
  "author": "john-loeffler",
  "summary": "The iconic iMac may get a new look this year",
  "article": [
    "Apple is reportedly planning its first major redesign of their desktop iMac computers in nearly a decade with the iMac (2021).",
    "The design of the popular iMac desktop all-in-one computer was first introduced in 2012 and has remained largely unchanged in the years since, something that many of us have noted over the years.",
    "Now, however, they may be getting a major refresh thanks to the new Apple M1 chip. By moving away from Intel processors for their desktop, Bloomberg says, Apple is now free to make some major design changes that wasn't possible with their Intel-powered systems.",
    "According to the report, Apple will be slimming down their iMacs considerably by moving to a flat back rather than the current curved one it has now. This is likely a function of the reduced cooling requirements of the more efficient M1 chip - a CPU fan takes up a good bit of space, after all.",
    "Moreover, Apple apparently wants a design similar to their Pro Display XDR monitor, which has significantly thinner bezels around the screen and doesn't have the metal chin found on current iMacs.",
    "Apple is said to be planning on introducing the new designs on their 21.5-inch and 27-inch iMacs later this year.",
    "When the Apple MacBook Air and 13-inch Apple MacBook Pro were released late last year, we noted at the time that we were surprised that the basic design of the MacBooks were essentially unchanged over previous generations. A major change like the move to the new Apple Silicon seemed like the perfect opportunity to revamp their look as well.",
    "This seems to be the direction that Apple wants to go this year as it moves more of its product line off of Intel processors and onto its own. In many ways, introducing this kind of redesign with the next generation of iMacs actually makes more sense.",
    "The launch of the iMac in 1998 is widely seen as a watershed moment for the company and helped propel the personal computing pioneer away from bankruptcy and set it on the path to its current dominance today.",
    "For symbolic reasons then, launching an all new iMac design would be a fitting way from the company to move into a new era. The iMacs aren't the only computers in the company's lineup that are expected to get a new look.",
    "Apple appears to be planning on two new Mac Pro in the next year or two as well. One is said to be a fairly standard update to the existing system and is going to use the same design as the current generation Mac Pro. It will continue to use an Intel processor rather than Apple's own silicon.",
    "The other Mac Pro, however, will apparently use a new Apple processor and will feature a new design, possibly inspired by the more compact Power Mac G4 Cube.",
    "Neither Mac Pro will come with a display, though Apple is said to be designing a new, much more affordable monitor which could be paired with the new Mac Pros or other systems. It won't have the same kind of professional tuning as the current $5,000 Pro Display XDR, so pros will still likely use the more expensive monitor, but the new display will reportedly be geared more toward consumer use and so will likely be much more reasonably priced.",
    "Once 2021 really gets going, we expect we'll see a lot more rumors swirling as we get closer to WWDC and other major Apple events, so stay tuned."
  ],
  "headers": {
    "6": "Redesign part of Apple's ongoing break with Intel"
  },
  "links": {
    "iMac (2021)": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-01-15/apple-plans-redesigned-imac-new-mac-pro-smaller-mac-pro-cheaper-monitor",
    "Apple MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "13-inch Apple MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020"
  }
}