{
  "source": "https://www.techradar.com/news/we-asked-an-expert-to-redesign-twitter-heres-what-they-came-up-with",
  "title": "We asked an expert to redesign Twitter - here's what they came up with",
  "category": "computing",
  "updated": "2021-04-04T04:31:50Z",
  "author": "techradar-pro",
  "summary": "A design expert from Fiverr has given the Twitter logo and UI a makeover",
  "article": [
    "As part of a new series, TechRadar Pro has asked designers from freelance platform Fiverr to give the branding of a selection of well-known companies a makeover.",
    "The idea isn't to return to the drawing board completely, only to imagine what famous branding might look like with a few tweaks here and there.",
    "First up, a rethink of the Twitter logo and user interface by UX designer Yaeliroz, who also talked us through her decision-making process.",
    "A simpler, reimagined view of an iconic brand combined with a bold vision of the web-based interface with a clear inclination for gradients, random shapes and curves. Here's what she came up with:",
    "\"Twitter is a well-known brand, very recognizable by its main specific color and the bird logo.\"",
    "\"This is exactly why I wanted to keep the layout the same, just change the logo to be less graphic, and more of a bird layout, keeping the legendary color, adding only one secondary color to be used in some places around the website.\"",
    "\"Furthermore, I decided to make the solid look, a bit more vibrant and edgy. I also wanted to make it approachable to younger audiences, by adding the illustrations elements, giving them only a hint of color. The rounded corners also give the website a new look and feel, making it more accessible, and less strict and old fashioned.\""
  ],
  "headers": {
    "4": "Yaeliroz's rationale"
  },
  "links": {
    "freelance platform": "https://www.techradar.com/best/best-freelance-websites",
    "Yaeliroz": "https://www.awin1.com/awclick.php?awinmid=6288&awinaffid=103504&clickref=trd-us-1194635235991161000&p=https%3A%2F%2Fwww.fiverr.com%2Fyaeliroz%3Fsource%3Dorder_page_user_message_link"
  }
}