{
  "source": "https://www.techradar.com/news/chromeos-has-a-built-in-screen-recorder-now",
  "title": "ChromeOS has a built-in screen recorder now",
  "category": "computing",
  "updated": "2021-02-18T21:53:37Z",
  "author": "anthony-spadafora",
  "summary": "Recording virtual lessons is now even easier on a Chromebook",
  "article": [
    "Recording lessons and doing homework will soon be a lot easier for teachers and students using Chromebooks as Google is bringing a built-in screen recorder to ChromeOS in March.",
    "As parents around the world made the transition to working from home during the pandemic, students and teachers switched to distance learning and this required them to to learn how to use a variety of new tools including screen recorders to create video lessons.",
    "While Windows 10 has a screen recorder built into the operating system's Game Bar and macOS allows users to record their screens using QuickTime Player, doing so in ChromeOS previously required users to download a third-party app to accomplish the same thing.",
    "Once ChromeOS' screen recorder arrives in a new update, users will be able to capture the contents of the screen and a red circle will appear on the right side of the shelf to let them know they're recording.",
    "In addition to the new built-in screen recorder, Google has also updated its screen reader ChromeVox with new features. These include improved tutorials, the ability to search ChromeVox menus and smooth voice switching that automatically changes the screen reader's voice based on the language of the text.",
    "At the same time, Google is also making audio, video and reliability improvements to Meet on Chromebooks so that students and teachers can have the best experience possible when using the search giant's video conferencing software.",
    "To help parents manage screen-time limits and other restrictions on their children's Chromebooks, the company has made it possible for them to use its parental control app Family Link to manage both their children's school accounts as well as their personal accounts.",
    "Finally, Google has released a list of Chromebooks to help schools better understand all of the devices available.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Chromebooks for education"
  },
  "links": {
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "ChromeOS": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/google-chrome-os-1082513/review",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "screen recorders": "https://www.techradar.com/best/best-screen-recorders",
    "Game Bar": "https://www.techradar.com/news/microsoft-tweaks-xbox-game-bar-in-windows-10-to-make-it-actually-useful",
    "QuickTime Player": "https://www.techradar.com/how-to/how-to-screen-record-on-a-mac",
    "screen reader": "https://www.techradar.com/best/best-text-to-speech-software",
    "Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "parental control app": "https://www.techradar.com/best/parental-control",
    "The Verge": "https://www.theverge.com/2021/2/17/22288149/chrome-os-screen-recorder-chromebooks-google-school"
  }
}