{
  "source": "https://www.techradar.com/news/in-a-post-covid-world-the-future-of-cybersecurity-is-sase",
  "title": "In a post-Covid world, the future of cybersecurity is SASE",
  "category": "computing",
  "updated": "2021-12-08T17:27:45Z",
  "author": "jim-fulton",
  "summary": "Why SASE is the new de facto standard for cyber",
  "article": [
    "You don’t need me to tell you our lives have changed a fair bit in the last year. How we shop, how we socialize, how we work - the pandemic has forced us to upend the way we live our lives. Some of these changes will recede once we exit the shadow of COVID-19. But others will stick with us, particularly as the pendulum swings back and people begin to work in multiple places at once - at home a few days a week, in the office, even travelling.",
    "The pandemic has had an accelerating effect: those enterprises who embraced digital transformation have doubled down on their investments, while laggards have found it more difficult than ever to keep pace. Agility. Flexibility. Transparency. These were all nice-to-have pre-2020. But today, they are business staples. We’re now living in the age of the ‘unbound enterprise’: enterprises that are free from physical and network infrastructure limitations. And while there are a number of hoops businesses must jump through before achieving this status, one of the biggest – and most daunting – is cybersecurity.",
    "Simply put, cybersecurity cannot remain dormant. When employees can work from any location around the world, simply defending laptops within the office is not enough. Businesses’ IT estates have widened considerably, and with that comes the need for a new approach to cybersecurity.",
    "Secure access service edge (SASE, pronounced Sassy, like SaaS-y) is an emerging cybersecurity architecture that everyone now seems to be talking about.",
    "In essence, SASE reinvents networking and security technologies that used to be delivered in hardware appliances throughout the enterprise, replacing them with converged cloud computing services that can be used seamlessly from anywhere. By weaving together advanced security capabilities including web content inspection, malware scanning, URL filtering, cloud application access and advanced data protection, SASE architectures offer security that is smarter, more dynamic, and ‘always on’ no matter where people are working – perfect for a world where cybercriminals never rest.",
    "We’ve recently conducted research in partnership with WSJ Intelligence, surveying 508 CEOs and CISO around the world. One thing that has really stood out is just how perceptions have changed about SASE – and cybersecurity in general – since the world was rocked by COVID-19. For example, 48% of businesses say they are substantially increasing the use of cloud-based cybersecurity systems, and 58% recognize the need for a more integrated trust framework. This indicates businesses understand the needs for more distributed connectivity and security, and are putting in place plans to make it a reality.",
    "When asked directly about SASE, the enthusiasm is even more pronounced. 90% of CEOs have either already adopted SASE (43%) or are currently evaluating SASE with a view to adopt (47%). It’s pretty astounding that this approach has gone from a future dream to an everyday reality so quickly – to the extent that nearly half of businesses have adopted it. It’s testament to just how much the pandemic has accelerated technological progress, and forced businesses to rethink how they handle cybersecurity.",
    "And that last point is important. Because as the security needs of businesses change, the role of cybersecurity – and the roles of cybersecurity professionals – changes with it. Some 45% of businesses have accelerated their digital transformation plans as a result of the pandemic. But what’s also interesting is that 45% report cybersecurity now has a bigger role in enabling innovation. Furthermore, 41% agree that it delivers a competitive edge.",
    "It’s been said defense is the best offence. And in a way, that’s true here. For the unbound organization, cybersecurity which is not up to scratch can be one of the biggest limiters of growth. The more a business decentralizes its people and data, more opportunities are created for thieves and attackers to break into systems and steal valuable information.",
    "Having a solid foundation of cybersecurity based on SASE enables businesses to scale up their operations, launch new services, and enable more staff to work remotely without fear of security breaches. Through this lens, cybersecurity isn’t just about protection: it’s about enablement. It allows businesses to pursue their ambitions and innovate without fear.",
    "Of course, the pandemic isn’t over yet. The pace of change is still lightning fast. And even when we do return to some semblance of normality, businesses are not going to want to slow down. Instead, we’re already seeing “work-from-home” evolving into the “hybrid workforce” in which people work in different locations throughout the week. It’s no coincidence that 74% of funds were reallocated to cybersecurity programs during COVID-19. Businesses have discovered security is one of the keys to unlocking the future, so we are going to see more and more investment",
    "SASE has well and truly become the new de facto standard for delivering cybersecurity. And as we press on into a post-pandemic world, it’s exciting to see what innovations this new generation of security will enable. This article is based on the findings from our recent report, The C-Suite Report: Business and Security Strategies for The Unbound Enterprise."
  ],
  "headers": {
    "3": "Embracing a different approach: SASE",
    "7": "Reimagining cybersecurity"
  },
  "links": {
    "office": "https://www.techradar.com/best/best-office-desks",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "networking": "https://www.techradar.com/best/best-business-networking-apps",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}