{
  "source": "https://www.techradar.com/news/halo-infinite-devs-show-the-game-is-coming-together-with-new-screenshots",
  "title": "Halo Infinite devs show the game is ‘coming together’ with new screenshots",
  "category": "gaming",
  "updated": "2021-02-27T22:29:04.121Z",
  "author": "emma-boyle",
  "summary": "\"You have more freedom than ever before to choose your path through the world\"",
  "article": [
    "343 Industries has released a handful of brand new Halo Infinite screenshots, giving fans a fresh look at the game world and the visual progress that’s been made in recent months.",
    "The screenshots (some of which can be seen below) appeared in the latest Inside Infinite blogpost on Halo Waypoint, in which there’s a focus on Halo Infinite’s campaign mode and its setting, Zeta Halo.",
    "In the post, Alex Le Boulicaut, Halo Infinite’s Graphics Producer, said that after the widely criticised Campaign demo from July 2020, “the team has been continuously iterating on outstanding graphics and lighting work to deliver a more immersive experience” and that “this team effort is finally coming together, and we are very excited to share some of the results with our community today!”",
    "The work-in-progress 4K screenshots, captured on PC, have been selected to show some of the visual details in the game world, with a particular focus on the game’s time-of-day lighting system which Campaign Art Lead, Justin Dinges, called “one of, if not THE largest graphical feature implemented into our engine over the past few years.”",
    "Dinges explained that the time-of-day system can change the tone and mood of a location depending on when you visit it, saying that “coming across a mysterious Forerunner obelisk during the day may feel peaceful and serene, where at night it might feel much more ominous and threatening - it really adds some incredible dynamically-driven visual variety throughout the experience where we were not able to have it before.”",
    "Alongside Sandbox Lead, Troy Mashburn, and World Design Lead, John Mulkey, Dinges also used the post to expand on what 343 Industries mean when they call Halo Infinite a ‘spiritual reboot’.",
    "Mashburn explained that it’s “a term we use to describe our approach to introducing new ideas while staying true to what it felt like to play the classic games”, adding that “feeling is the key word” as the team still wants “to evolve, by creating new experiences and new opportunities, but still maintain the original essence.”",
    "Mashburn referenced the Grappleshot as one of these new experiences, calling it “a great example of adding something new that also super-charges things you are already familiar with like clamber or melee”. The team as a whole discussed the way the Grappleshot impacted the way they created the world of Zeta Halo, with Mashburn calling the freedom it gives to players “terrifying and completely liberating at the same time” from a developer's perspective.",
    "Dinges explained that while the addition of the Grappleshot and the kinds of traversal it enables challenged the art team by forcing them to ensure that they “allow for players to get to spots and areas that in previous titles we may have prevented them from getting to”, it also makes the gameplay “much more fun” and they “expect players to get to some really awesome locations and vantage points that will further show off the beauty of the world we have created.”",
    "Mulkey expanded on the capabilities of the Grappleshot, adding that while it’s useful for traversal, it also “allows for pulling weapons to you, pulling an explosive Fusion Coil to you that you can then throw to take out a Shade Turret, or grapple to…and launch yourself into an enemy to land a powerful melee attack.”",
    "As for where Halo Infinite is in its development at the moment, Dinges said “the Art Team, like most of the development teams, are quickly wrapping up all of our remaining tasks and polish items as we approach our bug-fix and performance stage of the game’s production.” It looks like in the game’s final few months the team will be fixing bugs and ensuring that the game “runs smoothly across all the platforms”.",
    "Halo Infinite is still scheduled to release on Xbox One, Xbox Series X/S and PC in Fall 2021. The game’s development team will continue its Inside Infinite updates next month, with a focus on the Audio team before moving to the PC team in April."
  ],
  "headers": {
    "5": "What's a 'spiritual reboot'?",
    "10": "What's next?"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Inside Infinite blogpost on Halo Waypoint": "https://www.halowaypoint.com/en-us/news/inside-infinite-february-2021",
    "widely criticised Campaign demo": "https://www.techradar.com/news/halo-infinite-developer-admits-it-has-work-to-do-over-the-games-polarizing-graphics",
    "still scheduled": "https://www.techradar.com/news/halo-infinite-release-date-pushed-to-late-2021-nearly-a-year-after-xbox-series-x-launch",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}