{
  "source": "https://www.techradar.com/news/samsung-launches-870-evo-in-its-sata-ssd-series",
  "title": "Samsung launches '870 EVO' in its SATA SSD Series",
  "category": "computing",
  "updated": "2021-11-23T08:18:26Z",
  "author": "balakumar-k",
  "summary": "Offers 38% improvement over its predecessor",
  "article": [
    "Samsung Electronics has announced the launch of 870 EVO SSD, the company’s latest SATA solution as a part of its SSD (Solid State Drive) series.",
    "The new drive, which touts itself high on performance and reliability, is slotted as an \"all-round storage solution\" for a wide range of consumers from general PC users to IT professionals.",
    "“Representing the culmination of our SATA SSD line, the new 870 EVO delivers a compelling mix of performance, reliability and compatibility for casual laptop and desktop PC users as well as Network Attached Storage (NAS) users,” said KyuYoung Lee, vice president of Memory Brand Product Biz at Samsung Electronics.",
    "The Samsung 870 EVO features the company’s latest V-NAND and controller, allowing it to reach the maximum SATA sequential read and write speeds of 560 and 530MB/s, respectively, the company said in a press statement.",
    "Using a large variable SLC buffer, the drive’s Intelligent TurboWrite technology helps maintain its peak performance levels.",
    "According to Samsung, the 870 EVO also delivers a nearly 38% improvement in random read speed over the previous 860 model, enabling enhanced user experiences when multi-tasking, web browsing or simply booting up PCs.",
    "It also said that 870 EVO offers around 30% improvement in sustained performance over the 860 EVO, as well as a class-leading terabytes written (TBW) rating of 2,400TB,4 or a 5-year limited warranty, for its 4TB model.",
    "With its power saving sleep mode, the 870 EVO is compatible with devices that support Window’s Modern Standby function, offering added convenience to PC users.",
    "The 870 EVO provides broad compatibility with many computing devices and the most up-to-date PC features. The drive can be used with all devices that have 2.5-inch SATA interface connection.",
    "The Samsung 870 EVO arrives at a retail price that starts at $49.99 for the 250GB model.",
    "Via: Samsung"
  ],
  "headers": {
    "3": "Samsung 870 EVO specifications",
    "7": "Compatible with many devices"
  },
  "links": {
    "870 EVO SSD": "https://www.techradar.com/reviews/samsung-870-evo-ssd",
    "SSD (Solid State Drive) series": "https://www.techradar.com/news/samsungs-new-ssd-has-a-feature-every-mainstream-vendor-should-copy",
    "Samsung": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9015721966246243000&xs=1&url=https%3A%2F%2Fnews.samsung.com%2Fglobal%2Fsamsung-introduces-latest-in-its-worlds-best-selling-consumer-sata-ssd-series-the-870-evo&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-launches-870-evo-in-its-sata-ssd-series"
  }
}