{
  "source": "https://www.techradar.com/news/rtx-3080-stock-best-buy-newegg-and-amazon",
  "title": "RTX 3080 stock: the best places to find it in stock – Best Buy, Newegg and Amazon",
  "category": "computing",
  "updated": "2021-07-14T16:00:13Z",
  "author": "matt-swider",
  "summary": "Our GPU restock tracker Matt Swider has been tracking those hard-to-find Nvidia RTX 3080 graphics cards. This is where to buy them in the US.",
  "article": [
    "Finding Nvidia RTX 3080 stock in the US has suddenly become the hardest boss level for gamers looking to upgrade their graphics card, but our GPU restock Twitter tracker Matt Swider will send you an alert when there's an Nvidia GPU restock – if you follow his account and turn on notifications (tap the little bell icon). There are four online stores we constantly track with our 24/7 RTX 3080 tracker, and most have the sought-after Nvidia graphics card for MSRP, or close to it. We've found the RTX 3080 in stock at Amazon, Best Buy, Antonline and the Newegg Shuffle recently.",
    "► When? Where? Follow our GPU restock Twitter tracker Matt Swider for notifications and live updates. It's the fastest way to get real-time updates on graphics cards.",
    "These RTX 3080 stock tracker alerts really do work:",
    "Click on this example of a GPU restock alert that Matt will send on Twitter. Matt does the same with PS5 restock and Nintendo Switch OLED pre-order efforts.",
    "RTX 3080 stock is currently part of the Newegg Shuffle, the popular products lottery that offers you a chance to buy graphics cards and maybe an Xbox Series X restock every weekday (and sometimes Saturdays).",
    "Today, July 14, the RTX 3080 is available – one from MSi and another from Gigabyte – but be warned the price climbs to over $1,000 for both graphics cards. Normally, Newegg will sell the Gigabyte RTX 3080 for $699, but a Gigabyte motherboard is thrown in, too, and that makes the price go up another $401. The MSI RTX 3080 Gaming Z Trio 10G is just that expensive at $1,159.99 – it comes unbundled.",
    "here's the full RTX GPU lineup from the Newegg Shuffle today:",
    "The Newegg Shuffle selection window for the RTX 3080 and other graphics cards ends at 1pm PDT.",
    "Best Buy always has Nvidia graphics cards for MSRP, including the RTX 3080 – but finding them in stock is easier said than done. It's been five weeks since we saw the RTX 3080 Founder's Edition in stock.",
    "Best Buy has been far from consistent with its product restock efforts, but among its GPU stock, the RTX 3080 is in stock most consistently on a Thursday or occasionally on a Friday. So we'll update our RTX 3080 restock news when it happens: last month, it did restock at 4:15pm EDT on a Thursday, but we're constantly tracking it.",
    "There's a problem: the Best Buy restock time is never consistent, which is why our GPU restock Twitter tracker has become so popular recently. Instead of you having to check Best Buy all day every Thursday and Friday, we're doing that for you. Of course, this all depends on Best Buy RTX 3080 stock; there's no guarantee it'll be this Friday.",
    "Antonline is due to have RTX graphics cards in stock this week and the online store always pairs them with other components (just like Newegg does). So you'll also be buying a motherboard, case, monitor or something else with it.",
    "The difference with Antonline is that it's first-come-first-serve (vs Newegg's lottery), so if you're fast enough, this is the one to watch. You just have to be okay with GPU bundles with tons of extras – everything tends to be at MSRP when you add it up, but the price is steep.",
    "Amazon is at the bottom simply because it's harder to find a GPU restock at Amazon. Whether it's bot scooping up the console before everyone else or a lack of inventory, securing a GPU at Amazon feels next to impossible. That's why our GPU restock tweets tend to focus on Newegg, where it's done by chance, and Best Buy, where it often has two weeks of RTX stock built up and unleashes them all at once. Amazon GPU sales come in drops and drabs.",
    "There are other options for RTX 3080 stock outside of these online retailers. At times we've seen Microcenter carry Nvidia and AMD cards at its local stores with a strict limit of one purchase per person per month. However, it's harder to track the RTX 3080 at the many store locations around the United States.",
    "GPU manufacturers like EVGA and Zotac have gone with a virtual queue system, not unlike the PS5 restock at Sony Direct, and they have been an extra source to find a brand-specific RTX card. We've seen Zotac restock the RTX 3080 at midnight on certain weekdays, while EVGA has favored mornings, but the next restock date is almost impossible to determine."
  ],
  "headers": {
    "4": "RTX 3080 news at Newegg on a daily basis",
    "8": "Overdue RTX 3080 stock at Best Buy for MSRP",
    "11": "RTX 3080 bundles at Antonline",
    "13": "Amazon and its impossible-to-buy RTX 3080 stock",
    "14": "Other RTX 3080 stock sources"
  },
  "links": {
    "GPU restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider.",
    "Follow our GPU restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Nintendo Switch OLED pre-order": "https://www.techradar.com/deals/nintendo-switch-oled-stock-where-to-buy",
    "Newegg Shuffle": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1998415237065878300&murl=https%3A%2F%2Fwww.newegg.com%2Fproduct-shuffle",
    "Xbox Series X restock": "https://www.techradar.com/news/xbox-series-x-restock-in-usa-best-buy-walmart-target-microsoft-availability",
    "GPU restock Twitter tracker": "http://www.twitter.com/mattswider",
    "PS5 restock at Sony Direct": "https://www.techradar.com/news/ps5-restock-sony-direct-virtual-queue-time"
  }
}