{
  "source": "https://www.techradar.com/news/new-google-chrome-update-for-iphone-and-ipad-includes-widgets-heres-how-to-use-them",
  "title": "New Google Chrome update for iPhone and iPad includes widgets – here's how to use them",
  "category": "computing",
  "updated": "2021-05-11T15:21:11Z",
  "author": "daryl-baxter",
  "summary": "Fire up the Dino widget",
  "article": [
    "Google has released a new version of its Chrome browser for iPhone and iPad, which brings widgets to your home screen, alongside bug fixes and the ability to edit your username and passwords from the app.",
    "If you use Chrome on another device such as a PC, using it on your iPhone or iPad feels familiar in many respects. However, Google has been slow to update its apps on Apple’s devices since iOS 14 was released late last year, with Google Docs only gaining support for split-view multitasking on iPad in the last few months.",
    "Widgets are another example, with Google, along with other companies still introducing them to their apps eight months on since the debut of iOS 14, but now Google has brought in a useful selection for your home screen, enabling you to quickly search the web and more.",
    "On either an iPhone or iPad running iOS 14, hold down on the home screen for three seconds and once the icons are wiggling, select the ‘add’ icon towards the top of the screen.",
    "There should be a Google Chrome section in the ‘add widget’ window to add one of three widgets:",
    "You can drag and drop a widget to anywhere on your home screen on your iPhone, or to a section in the column of widgets on your iPad.",
    "Open up the App Store, and check if there’s an update notification for Chrome superimposed on your profile picture towards the top-right. If there is, select ‘Update’ and you’ll soon be able to access the three widgets and customize your username and password information from the app.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "How to use the new widgets",
    "6": "How can I access Chrome 90?"
  },
  "links": {
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1080938338937967600&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Fgoogle-chrome%2Fid535886823",
    "9to5Google": "https://9to5google.com/2021/05/10/chrome-90-iphone-widget/"
  }
}