{
  "source": "https://www.techradar.com/news/new-lg-cinebeam-4k-laser-projector-launches-over-ces-2021-heres-what-it-costs",
  "title": "New LG CineBeam 4K laser projector launches over CES 2021 – here's what it costs",
  "category": "audio-visual",
  "updated": "2021-01-25T14:31:41Z",
  "author": "henry-st-leger",
  "summary": "The next iteration of LG's CineBeam projector is here",
  "article": [
    "The new LG CineBeam HU810P 4K laser projector is launching off the back of the CES 2021 expo, with the next iteration of LG's accomplished projector range landing on January 18.",
    "We first heard about the HU810P in September 2020, when LG announced the new model, though we now have a release date, and even a price tag – with the HU810P set to retail at $2,999 (around £2,000 / AU$4,400).",
    "But what makes the new CineBeam projector so special? Well, it has a huge range of flexibility when it comes to the projection size, from a compact 40 inches to a massive 300-inch image. That maximum size is around twice what we'd expect from a projector of this price and specification.",
    "It'll work both in small and large homes, then, and allow some wiggle room for those who tend to move their projector between different rooms.",
    "You're also getting 2,700 lumens of brightness, which matches the excellent HU85LA CineBeam ultra short-throw projector we reviewed last year, with 10-bit color and support for 97% of the DCI-P3 color space.",
    "There's also support for HDR10 and HLG, the brilliant webOS smart TV platform, and the Disney Plus streaming service. Those of you who might want to set up next-gen gaming consoles like the PS5 and Xbox Series X with this projector, too, will be happy to know it comes with a single HDMI 2.1 (and eARC) alongside two regular HDMI 2.0 inputs. You can also connect it over Bluetooth.",
    "The CES 2021 expo hasn't been packed with projector announcements, which may have something to do with the event moving online and some manufacturers not feeling beholden to the usual tradition of unveiling new tech in early January.",
    "We did, however, hear about a number of new projectors in late 2020, including LG's HU810P CineBeam, as well as the Samsung Premiere tri-color laser projector.",
    "The Premiere marks a return to high-end projectors for Samsung, earning the manufacturer five stars in our review for its colorful pictures, high brightness, and fully-fledged Tizen interface (usually saved for new Samsung TVs).",
    "However, the Premiere's $6,490 / £6,999 / AU$10,999 price tag will keep it out of reach for many, and the CineBeam is retailing for less than half that amount – also with a fleshed-out webOS smart TV platform in place of the patched-together interfaces so often found on projectors.",
    "We'll be putting the HU810P to test in our upcoming review, so do keep an eye out for it in the coming weeks."
  ],
  "headers": {
    "6": "Future projection"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "We first heard about the HU810P": "https://www.techradar.com/news/the-new-lg-cinebeam-4k-projector-puts-a-300-inch-movie-screen-in-your-home",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021"
  }
}