{
  "source": "https://www.techradar.com/news/why-hands-free-wearable-computing-has-become-a-necessity-for-industrial-work-environments",
  "title": "Why hands-free, wearable computing has become a necessity for industrial work environments",
  "category": "computing",
  "updated": "2021-01-26T20:07:49Z",
  "author": "jon-arnold",
  "summary": "Industry is starting to recognise the critical role of augmented reality",
  "article": [
    "The speed at which technological innovation is occurring has never been as fast paced as it is today. We can appreciate this now more than ever in both our personal and professional lives. Take, for instance, the rapid advancements in smartphone technology over the past few years and the way in which people now have access to increasingly vast amounts of computing power in such a compact form. Even cars and homes are now ‘smart’, with both connectivity and automation in place to make our lives as easy as possible.",
    "Innovation though has never been as important as it is in 2020. Born out of necessity due to the global pandemic, we are now completely reliant on technology in order to communicate with friends, family and colleagues safely. Thanks to innovation - and the admirable resilience of the cloud - many more of us have been able to work and learn remotely. Gone are the days where the majority of the workforce are required to be physically present in an office or travel on a whim. In a move triggered by the pandemic, many more of us are now accessing all of the tools and online resources we need to do our jobs at home. This has benefited both employers and employees alike, resulting in a boost in productivity, as time is not wasted commuting to a physical office.",
    "Across industrial work environments, notable advancements in technological innovation are taking place too. ‘Industry 4.0’ has been a broad catalyst in bringing about an industrial digital revolution, and a driver for companies to accelerate their digital transformation plans. There are numerous considerations to reflect on when looking at trends in Industry 4.0; ensuring that workers themselves can benefit from future-proof technology to not only do their job better, but also to be safer, is imperative. Wearable computing has now bridged that gap.",
    "Augmented Reality (AR) and wearables may still seem like buzzwords to most people, but there has been a shift from hype to reality for those using the technology. Industry is starting to recognise the critical role of this technology in their digital transformation strategies as well as the advantages of this technology; from training and simulation, to leveraging AR for workers in Oil & Gas to working offshore. In these scenarios, wearables ensure that users can maintain full situational awareness. This is a quality that is essential in potentially hazardous work environments, where technology needs to be hands-free and not obstructive in any way.",
    "Upcoming technologies, such as 5G, will also be deployed in industrial settings and are already starting to usher in a host of changes to prepare companies for the digital world. Due to the pandemic, digital transformation plans have been fast tracked with companies digitising rapidly in order to keep essential operations functioning, or even leveraging the disruption to optimise their operations further.",
    "This year, many industries had to rapidly adapt in response to lockdown scenarios, given the requirement to maintain social distance. In such instances, wearable computing has become a necessity in its own right in order to enable workers to continue to operate safely, whilst limiting the number of people required to be physically present on site. Companies that have since adopted this technology have empowered their workers out in the field to connect with colleagues and experts at any given moment, thus ensuring business continuity for them and the customers they serve. An expert, for instance, can now be based remotely or from home as opposed to being on site, with wearables offering the ability to experience an operator’s surroundings via a live video feed and audio. This mitigates travel time, costs, environmental impact and ensures that people are kept safely apart where possible.",
    "And safety of course is goal number one in industrial settings. There are a number of health and safety aspects to consider when working in an industrial environment such as physical hazards including activities that pose health risks. Extreme temperatures, poor air quality, dangerous chemicals, excessive noise and radiation also need to be managed very carefully. Wearable computing offers the industry the opportunity to use cutting-edge technology to step-change the way organisations protect people and assets, improve workforce capability and operational efficiency, while optimising safety. The importance of wearable technology being hands-free is paramount when it comes to operational safety. Advancements in speech and voice recognition have meant that wearables can be operated in extremely noisy industrial settings and without these advancements the technology would simply be ineffective and its benefits negated.",
    "However, for organisations looking to deploy wearable technology, they need to be aware of a few challenges. Like any new technology, companies need to allow time for adjustments and setup post-deployment. It’s also very much a learning curve in terms of understanding how best to utilise the technology and, as with any new technology introduction, change management will be a factor, too.",
    "It seems like these challenges are relatively easy to overcome, as we are already seeing new use cases for wearable technology surfacing on an almost daily basis. One particularly good example of the benefits of AR is from Vestas Wind Systems AS, a Danish manufacturer, seller, installer, and servicer of wind turbines. Since deploying the technology, Vestas has been able to continue to ramp up its new modular product development platform despite its highly skilled workers and engineers being unable to travel due to lockdown restriction. Vestas has also been able to address the changing workforce in the wind industry; 30% of which is set to retire in the next 10 years. To address this, it is deploying wearable technology to facilitate knowledge transfer and step-by-step technical work instructions to the field.",
    "The rise in Industry 4.0 applications and Internet of Things (IoT) that integrate AR will only serve to drive further adoption of solutions like wearable technology. The next wave of innovation and new use cases will occur with the widespread roll-out of 5G and further advancements in cloud services, which will accelerate or complement organisations’ digital transformation plans. Looking forward to what the future holds, as the digitisation of traditional manufacturing and industrial practices continues, we expect to see that wearable technology will become more commonplace in industrial environments and will be deemed a necessity for use across many more applications."
  ],
  "headers": {},
  "links": {
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Internet of Things": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know"
  }
}