{
  "source": "https://www.techradar.com/news/nikon-z7-ii-8-reasons-why-its-convinced-me-to-finally-upgrade-from-my-nikon-dslr",
  "title": "Nikon Z7 II: 8 reasons why it's convinced me to finally upgrade from my Nikon DSLR",
  "category": "cameras",
  "updated": "2021-07-01T20:37:36Z",
  "author": "tim-coleman",
  "summary": "Plus five reasons why you might want to stick with your D800...",
  "article": [
    "I've owned, used and tested a lot of Nikon cameras down the years, from the Nikon FM through to the Nikon D850. In fact, I still rock what is now a truly beat-up Nikon D800 – surely that shutter is going to pack in any day now. But that's far from the only reason why I'm convinced that now is time to upgrade to a Nikon Z7 II.",
    "Naturally, I was particularly interested when Nikon burst onto the full-frame mirrorless camera scene in 2018 with the dual launch of the Nikon Z7 and Nikon Z6. A totally new system and lens mount, in a familiar and compact form.",
    "With such history using a Nikon DSLR in particular, could I make the switch to Nikon mirrorless? First impressions using the Z cameras were great, but my main reservation was the infancy of the Z-mount system.",
    "Well, we're now more than two years in, with second generation Z cameras arriving in the shape of the Nikon Z6 II and Nikon Z7 II (which I reviewed recently) plus a number of new Z lenses.",
    "After seeing the Z system bed in and grow with a promising road map, I'm now fully convinced that it's time to upgrade and move from a Nikon DSLR to a mirrorless camera like the Nikon Z7 II.",
    "Having used both systems extensively, I've drawn up my top reasons why I'll be making the switch – and, for the sake of balance, why you might want to consider sticking with your DSLR.",
    "High resolution cameras like the Nikon D800 series are particularly unforgiving when it comes to camera shake. Viewed at 100%, detail is soft if you don't use a fast enough shutter speed or steady the camera carefully (for example, using a decent tripod coupled with timer delay or remote release).",
    "With a high-resolution DSLR, you'll need to be even more conservative working from the 'minimum shutter speed = focal length' rule for sharp handheld shots. Not so with mirrorless.",
    "In-body-image-stabilisation (IBIS) is a godsend when shooting at high resolution and is perhaps my number one handling improvement with the Nikon Z system. Yes, many Nikon G lenses for DSLRs feature optical image stabilization (OIS), but IBIS is next level, offering up to 5EV of compensation.",
    "I've consistently got sharp shots at 1/10sec with the 85mm f/1.8 Z lens and that is simply not possible with a Nikon DSLR. In short, the Nikon Z7 II is a much more versatile handheld camera. Oh, and IBIS for handheld video shooting is supremely helpful, too.",
    "In the Nikon Z7 II, Eye AF is superb for portraits, being both quick and reliable. I particularly appreciated this feature during portrait shoots where sharp focus on the subject's eyes was nailed every time. Truly, it takes a fundamental stress out of the equation.",
    "Conversely, single point AF in a Nikon DSLR is hit and miss for portraits, especially given that the focus point is not a super-precise 'pinpoint' type. A sharp focus is more likely when the subject is closer (with the eye larger in the frame), but that's not always the case.",
    "In the Z7 II, Eye AF is now available in the wide-area AF mode for both humans and animals (and for video), meaning that subjects are detected within a wide area of the image area and they don't need to be in the center.",
    "You can scroll between subjects when there is more than one detected in the AF area. Honestly, it feels like cheating, the results are so reliable.",
    "The Nikon F lens mount used by the company's DSLRs is more than 60 years old now. What particularly grabbed my attention when the Nikon Z system was launched was the new Z lens mount. Put simply, it's the most versatile full-frame lens mount available today.",
    "You have the largest diameter full-frame lens mount (55mm) coupled with the shortest flange distance (16mm). Lens diameter and flange distance determine the maximum possible angle of incidence – the larger it is, the easier it is to make high performing lenses. For comparison, the Nikon F lens mount diameter is 44mm and the flange distance is 46.5mm.",
    "Nikon's early Z lenses did not grab the headlines – what's exciting about a costly 50mm f/1.8? However, the performance of these lenses is outstanding. Sharp detail from center to edges, along with minimal lens aberrations and distortion.",
    "Two years on, we're also starting to see some intriguing new lenses. That lens mount truly is the unsung hero.",
    "The Nikon Z7 II has the same form factor as its predecessor and the design is up there with the best mirrorless cameras that have DSLR styling. The generous hand grip and logical button layout are particularly impressive.",
    "The Z7 II is a lot smaller than a Nikon DSLR and it is about 30% lighter. Those numbers are squeezed when you factor in a lens, because the Nikon F mount and Z lenses are, overall, of similar size and weight. But there is no doubt that the Z7 II is less taxing to hold and lug around all day.",
    "And if you are making the transition from a Nikon DSLR to the Z7 II, it's an easy journey. In-camera menus, build quality, feel and style are all familiar. It's like a mini Nikon DSLR.",
    "Building on my point about Eye AF reliability is the fact that Nikon Z lenses are good-to-go, straight out the box. Conversely, I've used numerous Nikon F mount lenses with focusing that has simply been 'off'.",
    "Some lenses are more notorious for autofocus issues than others. Take the Nikon 50mm f/1.4 G lens and its back-focusing problems – I've had so many portraits that I thought were sharp on the eyes only to discover that the focus was on the ears. These are considerable margins.",
    "Such problems can be addressed through lens calibration, for a time. But those uncertainties around lens micro focus adjustments and inaccuracy with single point AF weigh on the mind.",
    "The Nikon Z7 II in a similar scenario with the 50mm f1.8 Z lens is a breath of fresh air. Sharp focusing where you expect it. No hassle.",
    "Alright, alright. I know that viewfinder type is a sensitive topic, especially for DSLR diehards. Being a mirrorless camera, the Nikon Z7 II uses an electronic viewfinder (EVF), while a Nikon DSLR uses an optical viewfinder (OVF).",
    "Depending on your viewpoint, you might have expected the viewfinder to be in the 'reasons to stick with your DSLR' section below (and it is in there too). But there's now plenty of reasons to be excited by an EVF. Real-time exposure information, live histogram, focus peaking for accurate manual focus are just a few of the reasons why an EVF kicks an OVF's butt.",
    "Also, the quality of EVF displays are is excellent. The Z7 II has a large display, boasting a 0.8x magnification. It's not the best available with a modest 60fps refresh rate, but you might just be surprised how good it is.",
    "If you're upgrading from an older DSLR like the Nikon D800 rather than a more recent one like the Nikon D850, you'll discover lots of additional benefits from moving to a mirrorless camera like the Z7 II.",
    "For example, the video specification is in another league, jumping from Full HD at 30fps with unusable liveview autofocus to 4K/60p with IBIS and responsive autofocus.",
    "The respective LCD screens give you quite a different experience, too. The D800 has a fixed rear screen with no touch function, whereas the Nikon Z7 II features a tilt-touchscreen that is inherently more user-friendly.",
    "Lastly, the option of a silent shutter is great when you need to be inconspicuous – for example, wildlife photography or during a wedding ceremony. It's not perfect, though – be mindful of banding issues in artificial lighting, while fast-moving subjects can be distorted.",
    "Nikon DSLRs are still available, but there is no doubt that the technology has reached its peak in many areas and Nikon has publicly stated that its focus moving forward is developing the mirrorless Nikon Z system.",
    "So while there might still be a new DSLR every now and then (the Nikon D850 is three years old already), the tech advancement is in mirrorless.",
    "That large lens mount can future-proof the Nikon Z system, too. I can see scope for even better image stabilization (there's physical space for the sensor to move more), and new lens designs. If you're a Nikon user wanting the latest and greatest camera tech, it's going to be through Nikon Z.",
    "Mirrorless cameras like the Nikon Z7 II might be the future, but there are still some areas where DSLRs still reign – here's why you might want to stick with your older camera.",
    "There's a reason why I'm still using the Nikon D800 – a system switch isn't cheap, even within the same brand.",
    "The Nikon Z7 II launch price was an aggressive at $2,999 / £2,999 / AU$5,499, which is considerably lower than the Nikon D850's launch price in 2017 (although you can currently find the D850 for around $2,400 / £2,500 / AU$4,700).",
    "Of course, a camera is only one consideration when switching systems.",
    "Yes, I can use all of my Nikon G lenses via the FTZ adaptor and still enjoy their autofocus performance. However, to make the most out of the Nikon Z system I want those Z lenses.",
    "Many Z lenses cost considerably more than the F mount lens equivalents. The 50mm f/1.8 and 85mm f/1.8 lenses are at least 35% more, while the margin between key zoom lenses is lower, but there's still a difference.",
    "Outright battery life is one of the last remaining advantages that a DSLR possesses over mirrorless cameras. For example, the Nikon D850 has a frankly ridiculous battery life of 1,840 shots.",
    "Even older DSLRs like the Nikon D800 are pushing on 1,000-shots. Compare that to the 420-shot life of the Z7 II, and there's a clear winner.",
    "The Nikon Z7 II does have a trick up its sleeve, though – USB-C charging. If you pack a powerbank in the camera bag for a day out with the camera, you can top up the battery on-the-go. This feature makes the battery life shortcomings less relevant. On-the-go charging is a new way of working, but it honestly isn't that hard.",
    "Also, if you invest in the optional grip for the Z7 II and two additional batteries, one of those batteries can be swapped out even during video recording for example, without losing power.",
    "No lag. Bright display. For any scenario, especially low light and action, you might just feel that the optical viewfinder is superior to an EVF. And when we're talking the Nikon full-frame DSLR series, those large optical viewfinders are a joy to use.",
    "I love the large unimpeded OVF display really immersing you in the scene, without all of the additional digital information littered over the EVF view (that annoyingly can't seem to be hidden in the Z7 II). Also, an optical viewfinder doesn't drain battery life in the way an EVF does.",
    "If you are an action photographer, then phase-detection AF in the more recent full-frame Nikon DSLRs is still better than the system that the Nikon Z7 II uses.",
    "In fact, you'd be hard pressed to find a more effective autofocus system anywhere for action photography than what is available in the Nikon D6 or Nikon D850.",
    "It's a minor point, but one that studio photographers in particular might notice – the Z7 II flash sync speed is 1/200sec, compared to the typical 1/250 sec on Nikon DSLRs. That doesn't sound like much, but if you know, you know."
  ],
  "headers": {
    "6": "1. IBIS rocks for handheld shooting",
    "10": "2. Eye AF beats single-point AF for portraits",
    "14": "3. The Z-mount is the most versatile for full-frame",
    "18": "4. The Z7 II is smaller and has a great form factor",
    "21": "5. There's no need for lens calibration",
    "25": "6. The EVF gives you loads of valuable information",
    "28": "7. The screen and video specs are big upgrades",
    "32": "8. Mirrorless is now Nikon's priority",
    "35": "5 reasons to stick with your DSLR",
    "36": "1. Switching to Z lenses is expensive",
    "41": "2. DSLRs still have superior battery life",
    "45": "3. OVFs still rock, don't they?",
    "47": "4. Autofocus for action photography is undisputed",
    "49": "5. The Z7 II has a slower flash sync speed"
  },
  "links": {
    "Nikon D850": "https://www.techradar.com/reviews/nikon-d850-review",
    "Nikon D800": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/nikon-d800-1074183/review",
    "Nikon Z7 II.": "https://www.techradar.com/reviews/nikon-z7-ii",
    "full-frame mirrorless camera": "https://www.techradar.com/news/best-full-frame-camera",
    "Nikon Z7": "https://www.techradar.com/reviews/nikon-z7-review",
    "Nikon Z6": "https://www.techradar.com/reviews/nikon-z6-review",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii",
    "Nikon Z7 II": "https://www.techradar.com/reviews/nikon-z7-ii",
    "best mirrorless cameras": "https://www.techradar.com/news/best-mirrorless-camera",
    "Nikon D6": "https://www.techradar.com/reviews/nikon-d6"
  }
}