{
  "source": "https://www.techradar.com/news/epic-games-settles-fortnite-lawsuit-with-v-bucks-and-you-may-be-entitled-to-some",
  "title": "Epic Games settles Fortnite lawsuit with V-Bucks - and you may be entitled to some",
  "category": "gaming",
  "updated": "2021-02-23T18:09:19Z",
  "author": "rhys-wood",
  "summary": "Epic has its V-Bucks at the ready",
  "article": [
    "Epic Games will be compensating Fortnite: Save the World players who purchased random item loot boxes, when they were available, with 1,000 V-Bucks, as a way to settle a class-action lawsuit against the company.",
    "The lawsuit comes from allegations that Epic Games had violated state consumer protection laws and misrepresented the value of items available in both Fortnite and Rocket League.",
    "V-Bucks are Fortnite’s in-game currency used to buy a variety of items like character skins, emotes and other cosmetic goodies including the aforementioned loot boxes. These random item boxes were dubbed “V-Buck Llamas,” and were replaced in 2019 with X-Ray Llamas, which allowed players to see what could be inside the box before purchase.",
    "The settlements also extend to Rocket League players who purchased loot boxes prior to them being phased out in 2019. In this case, Rocket League players will receive 1,000 Credits as compensation.",
    "If you played Fortnite: Save the World or Rocket League during the period at which their respective loot box items were available, and you happened to purchase some yourself, then you may be eligible to receive V-Bucks or Credits from Epic.",
    "In a statement released on the official Fortnite Twitter account, Epic said that players don’t have to take any action to claim these free V-Bucks. If eligible, players will see the currencies dropped into their accounts automatically over the next few days (as of February 22). So keep an eye on your account.",
    "While the settlement with Fortnite: Save the World players is supposed to be limited to the US, Epic has said that it will roll out the V-Bucks to Fortnite: Save the World accounts globally. 1,000 V-Bucks is an amount equal to roughly $10, and the handout doesn’t scale relative to how much a player might have spent on Save the World’s loot boxes.",
    "The decision was made in order to help settle a lawsuit against Epic's loot box practices. Approved by the Superior Court of North Carolina, the lawsuit pressures Epic Games to reimburse players who purchased V-Buck Llamas before the company made the change to the more transparent X-Ray alternatives.",
    "If you’re not in the know, a random item loot box is as self-explanatory as it sounds. Usually, players can either pay real money for one or a bundle of loot boxes. The items inside are random until opened, meaning players won’t know what they’re getting until the box has been redeemed. Rarer items are typically much harder to come by, often goading repeat purchases until the desired loot has been acquired.",
    "The concept of the random item loot box has been heavily criticized in games like FIFA, Overwatch, Star Wars Battlefront 2 and more. Loot box regulation has been an ongoing debate for years now, and the items themselves have been linked to enabling minors to develop gambling addictions.",
    "Laws pertaining to the inclusion of loot boxes in games vary across the globe. They are banned in countries like Belgium and The Netherlands. Lawmakers in the UK have also called for the practice to be heavily regulated.",
    "More than anything, the V-Bucks and Credits handouts look to be damage control on Epic’s part. It was a way for them to settle the class action lawsuit without losing substantial resources itself."
  ],
  "headers": {
    "4": "How do I claim my V-Bucks?",
    "6": "Let them eat cake"
  },
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "allegations": "https://www.epiclootboxsettlement.com/",
    "V-Bucks": "https://www.techradar.com/how-to/how-to-get-free-v-bucks-in-fortnite",
    "Fortnite Twitter account": "https://twitter.com/FortniteGame/status/1363954444891783169",
    "develop gambling addictions": "https://www.techradar.com/news/are-loot-boxes-harmful-to-your-kids-yes-says-childrens-organization",
    "The Netherlands": "https://www.ign.com/articles/2018/06/20/the-netherlands-starts-enforcing-its-loot-box-ban",
    "practice to be heavily regulated": "https://www.techradar.com/news/loot-boxes-should-be-called-gambling-uk-house-of-lords-says-will-it-affect-fifa-ultimate-team"
  }
}