{
  "source": "https://www.techradar.com/news/telegram-on-windows-10-is-getting-a-major-security-boost",
  "title": "Telegram on Windows 10 is getting a major security boost",
  "category": "phones",
  "updated": "2021-02-22T19:00:33Z",
  "author": "anthony-spadafora",
  "summary": "Users can now delete their groups and call history without leaving a trace",
  "article": [
    "The secure messaging app Telegram has received a new update on Windows that helps users better protect their privacy by giving them more control over their data.",
    "The update comes at a time when users are turning away from Facebook-owned WhatsApp and moving to more privacy focused messaging apps such as Telegram and Signal. In fact, back in January, Telegram even put out a blog post detailing how users could move their chat history from WhatsApp, Line and KakaoTalk to its service instead.",
    "In the latest update to its app on desktop, Telegram has introduced a new feature that allows users to delete groups they've created as well as all of their call history without leaving a trace. Mobile users also have the ability to delete a secret group for both sides.",
    "Since Telegram doesn't store users deleted chats, call history or groups on its servers, this data disappears completely once a users has clicked on the delete button in the app on both mobile and desktop.",
    "In addition to giving its users more control over their data, Telegram has also added a new feature to improve the service's voice chat experience after rolling out support for group calls last year.",
    "To ensure that every user in a voice chat is heard, the company has introduced a new feature that allows users to adjust the volume on a per user basis. Now when in an active voice chat, Telegram users can click on the top menu and adjust the microphone levels of individual participants while admins can change the volume of everyone in a voice chat.",
    "Telegram has also added the ability for users to report fake groups or channels which are impersonating famous people or organizations. This can be done by opening a channel or group's Profile and clicking on the Report button. Here you can report a channel for spam, violence, adult or illegal content and for being a fake account.",
    "The new update for Telegram desktop is now rolling out via the Microsoft Store for Windows 10 and users can download it directly from the service's page on the store.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Improved voice chat"
  },
  "links": {
    "Telegram": "https://www.techradar.com/news/telegram-had-some-major-security-vulnerabilities",
    "messaging apps": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "blog post": "https://telegram.org/blog/move-history",
    "move their chat history": "https://www.techradar.com/news/you-can-now-import-whatsapp-chats-into-telegram-heres-how",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "group calls": "https://www.techradar.com/news/telegram-launches-group-voice-chat-rooms-and-some-more-goodies",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/software/telegram-for-windows-10-update-brings-a-new-privacy-feature/"
  }
}