{
  "source": "https://www.techradar.com/news/microsoft-surface-adaptive-kit-will-help-people-with-disabilities-use-their-devices",
  "title": "Surface Adaptive Kit shows Microsoft is serious about accessibility",
  "category": "computing",
  "updated": "2021-09-22T16:00:00Z",
  "author": "john-loeffler",
  "summary": "Microsoft is leading the way on accessibility, again",
  "article": [
    "The Microsoft Fall 2021 event is over and we saw lots of incredible new devices, but one of our favorite new offerings from Microsoft isn't a device, it's the Surface Adaptive Kit, which we got to see up close at a press event earlier this week in New York City.",
    "The Surface Adaptive Kit features several sets of adhesive bump labels to provide better touch sensing for key caps, including translucent labels that don't obscure the keys, port indicator labels, and opener support for those with motor disabilities.",
    "During the Microsoft Fall 2021 event, Kris Hunter, principle director of Devices UX Research and Accessibility, and Dave Dame, Director of Accessibility for Devices, demonstrated how the Surface Adaptive Kit can be used to do everything from identify ports to assisting users in opening their devices using pull tabs and lanyards.",
    "\"It's not simply about creating accessible technology,\" said Dame, who has cerebral palsy, \"it's about what the person can achieve and experience because of that technology.\"",
    "The Surface Adaptive Kit is compatible with all the most recent Surface devices like the Surface Laptop 4, Surface Book 3, and Surface Pro 8, but if we're being honest, you could probably use these on any device you have which is one of the best parts about it.",
    "It's great when a manufacturer introduces accessibility features into its devices, but that doesn't do much for people with disabilities who don't own those devices, especially when you consider that people with disabilities are among the most economically vulnerable people in society, owing to employment discrimination or even the inability to work at all.",
    "We've reached out to Microsoft for more details about the pricing and availability of the Surface Adaptive Kit and we'll update this article when we hear back from the company. Whatever its price though, it's going to be far cheaper than buying a whole new device just to have access to better accessibility features.",
    "It's a small thing for most of us, in the grand scheme of things, but for those it empowers to use new technology, or even to simply use their devices in a more comfortable manner, it is a huge improvement over where we were just five years ago when people with disabilities were almost entirely ignored by the large tech companies.",
    "We cover a lot of hardware here at TechRadar, from every major brand on Earth, and there really is no question that Microsoft is becoming a real leader on the accessibility front.",
    "Computer hardware has typically been one of the easier obstacles to overcome when it comes to accessibility, since a USB port is a USB port and so long as a device complies with USB standards, a computer will recognize it, allowing a lot of accessible controllers to work with computers.",
    "But more mobile devices than a desktop or even a laptop are becoming a more common and important feature of the computing landscape, and it's here that accessibility is often being overlooked. While iOS and Android have accessibility features built in, the device running those operating systems typically have no accessibility interfaces whatsoever.",
    "While the Microsoft Surface Adaptive Kit might be branded for Microsoft Surface devices, there is nothing stopping someone with disabilities from using these physical indicators on an iPad, which is a very big deal. Seeing how simple a solution something like the Surface Adaptive Kit is to some very common accessibility issues, you'd think more big name tech companies would have done something like this.",
    "But, as with the Xbox Adaptive Controller, Microsoft seems to be one of the only big name tech companies out there who really care to bother trying to solve those issues, and for that, they deserve real praise."
  ],
  "headers": {
    "8": "Microsoft continues to lead on accessibility"
  },
  "links": {
    "Microsoft Fall 2021 event": "https://www.techradar.com/news/microsoft-announces-surface-go-3-surface-laptop-studio-surface-pro-8-and-more-ahead-of-windows-11-launch",
    "Surface Laptop 4": "https://www.techradar.com/reviews/surface-laptop-4",
    "Surface Book 3": "https://www.techradar.com/reviews/surface-book-3",
    "Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "Xbox Adaptive Controller": "https://www.techradar.com/news/yes-the-xbox-adaptive-controller-is-innovative-if-you-can-afford-the-added-expenses"
  }
}