{
  "source": "https://www.techradar.com/news/google-pixel-6-might-support-faster-wireless-charging-powered-by-a-new-stand",
  "title": "Google Pixel 6 might support faster wireless charging, powered by a new stand",
  "category": "phones",
  "updated": "2021-06-15T08:47:32Z",
  "author": "james-rogerson",
  "summary": "Fan-tastic",
  "article": [
    "Whether with or without wires, the Google Pixel 5 doesn’t charge particularly fast, but that might change with the Google Pixel 6, because there’s evidence that a new wireless charger is in the works, and this one seemingly has cooling fans.",
    "9to5Google has spotted evidence of the device in code from the second Android 12 beta, and the mention of fans (to dissipate heat from both the charger and the phone) suggests it might be able to juice up the Pixel 6 faster than the 12W supported by the Pixel 5.",
    "These fans are apparently clever too, with the code suggesting that they will quiet down if you wake up Google Assistant, or if you’re recording a conversation or in ‘Bedtime mode’. There will also seemingly be a choice of fan settings, including auto, quiet, or power boost – the last of those presumably allowing your phone to charge faster.",
    "This wireless charger is apparently codenamed ‘Luxuryliner’, which means it’s likely to be positioned as a direct successor to the Pixel Stand, as that was codenamed ‘Dreamliner’.",
    "So it will probably launch with Pixel Stand branding, and likely support the same sort of additional features as that charger. These include the ability to display photos on your phone while charging, or to provide shortcuts to smart home controls, as well as a sunrise alarm clock feature.",
    "While we’d take the existence of a new Pixel Stand with a pinch of salt for now, the code found here is certainly convincing, so we’d think such a device is probably in the works – and likely to land alongside the Google Pixel 6. Hopefully it really will allow the phone to charger faster too, as the Pixel range is well behind the likes of OnePlus and Xiaomi on that front.",
    "Via PocketNow"
  ],
  "headers": {
    "3": "A luxury upgrade"
  },
  "links": {
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "9to5Google": "https://9to5google.com/2021/06/14/google-pixel-stand-2-fans-pixel-6/",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "PocketNow": "https://pocketnow.com/upcoming-pixel-6-might-get-a-wireless-charging-stand-with-cooling-fans?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+pocketnow+%28pocketnow.com%29"
  }
}