{
  "source": "https://www.techradar.com/news/whatsapp-goes-on-the-privacy-offensive-after-user-criticism",
  "title": "WhatsApp goes on the privacy offensive after user criticism",
  "category": "computing",
  "updated": "2021-06-14T11:00:17Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Chat platform launches a major privacy campaign",
  "article": [
    "After a vocal and hostile from users about changes to its terms and conditions, WhatsApp has embarked on a marketing drive focused on privacy. The ad campaign also follows attacks by the UK government on WhatsApp's use of end-to-end encryption which has been described by home secretary Priti Patel as \"not acceptable\".",
    "While ostensibly a reputation-boosting PR move, the ad campaign is likely to gain support from privacy groups as it hits back at governmental pressure to reduce encryption protection levels. While such suggestions have been billed as helping to fight crime and terrorism, there are concerns that any backdoors through encryption could have dangerous consequences.",
    "The draw of end-to-end encryption for users is that it means it is impossible to anyone other than the intended recipient to read messages. This means that not only can WhatsApp not intercept messages, but also that governments and law enforcement agency are unable to read messages that could potentially help with investigations – hence constant requests for access to data.",
    "In conversation with the BBC, WhatsApp head Will Cathcart said: \"The first step of keeping people safe is, you have to have strong security, and we think governments shouldn't be out there trying to encourage tech companies to offer weak security. They should be out there trying to encourage or even mandate that companies offer the strongest security possible.\"",
    "While WhatsApp is not able to see the content of any messages sent by users and is unwilling to reduction encryption, the company employs various techniques – including content fingerprinting – to prevent certain illegal content from being shared on its platform. Thew firm is of the view that privacy is of the utmost importance, and believes its users are of the same opinion.",
    "The ad campaign, which will be running for 15 weeks in the UK and Germany, is an attempt by WhatsApp to use public distrust of governments' showing an interest in accessing private messages as a way of boosting its own image, and impress the importance of end-to-end encryption on everyone.",
    "In a separate interview with the Guardian, Cathcart says: \"The concern we heard, and the proof that they care, was 'We're worried you're gonna start reading our messages'. We're not. The privacy of people's personal conversations did not change at all in any way with our update, let alone around end-to-end encryption. We think it is very important that people in the long term understand how the privacy of their personal messages is protected\".",
    "Via BBC News and the Guardian"
  ],
  "headers": {
    "4": "Privacy matters"
  },
  "links": {
    "BBC News": "https://www.bbc.com/news/technology-57440405",
    "Guardian": "https://www.theguardian.com/technology/2021/jun/13/whatsapp-boss-decries-attacks-on-encryption-as-orwellian"
  }
}