{
  "source": "https://www.techradar.com/news/high-staff-turnover-its-time-to-fix-your-work-environment",
  "title": "High staff turnover? It's time to fix your work environment",
  "category": "computing",
  "updated": "2021-10-29T07:40:08Z",
  "author": "techradar-pro",
  "summary": "Get the office environment right",
  "article": [
    "Losing a valued employee can have an adverse effect on a business, especially those in specialist, niche areas, where it’s hard to find skilled employees. Not only does it mean that you have to put the business on hold while you recruit, but there’s also the time lost to you while you recruit, and there’s the cost of running recruitment adverts.",
    "The simple way to reduce the effect of losing staff is to keep staff for longer. It’s not quite that simple, but that should be your primary aim. You stand to save a lot of time and money, and you’ll also be creating a loyal and happy workforce. If you do it right, you’ll produce better work as well as better workers.",
    "An important skill worth developing is teamwork. Business owners are used to doing things and making decisions on their own; for many business owners, the ability to do what you want, when you want, was one of the main driving forces behind starting a business.",
    "Creating teams, however, is one way of reinforcing loyalty. If an employee works as part of a team that they feel happy with, the decision to move will be harder to make than if they work on their own. Additionally, people like working in teams and believe they’re more effective in them.",
    "A Vodafone survey from 2012 showed that employees were clear about the negative impacts of not working effectively as a team. The most serious of these were delayed decision-making (named by 31 percent), unhappy customers through poor response (29 percent), missing targets because of lack of timely input from colleagues (28 percent), and making the wrong decisions because of lack of access to the right people and information (28 percent).",
    "Creating teams involves understanding the different personalities in the team, and helping them work together. It also involves working in close proximity to your staff. You can’t create teams if you sit in a separate office all day. You need to get out and about, and be part of the team.",
    "Although they may carry a financial cost, staff initiative schemes can also be highly effective. A well-thought-out system of incentives and perks – discounts at stores, health benefits, and the like – can help to retain staff.",
    "They can also be used to recognize good work and initiative and encourage staff and teams to compete for the prize. Perks often carry tax breaks for the business. These include occupational pensions, health insurance, season tickets and social events. Subsidies for training might also be available, as well as membership of social clubs or a gym.",
    "All of these can help staff feel valued, while giving them a more enjoyable working experience. Rewards can also take other forms. For example, there are many award schemes for best business teams and best employees. Why not enter your team or your best employee for an award? Even if they don’t win, it still shows that you care enough to regard them as valuable, both to you and the business.",
    "Being able to work flexibly is one of the key things that new employees are looking for. According to a 2010 study by PricewaterhouseCoopers, flexible working was more than twice as important to staff than more traditional benefits such as performance-related bonuses. In the survey, flexible working was rated as the most important benefit by 47 percent of respondents, while bonuses came in second with 19 percent.",
    "That’s a significant figure, and it doesn’t take into account those employees who might have rated it second most important. Basically, everybody likes to work around their personal lives, rather than the other way around. You don’t have to make work completely optional, of course – just give your employees a little freedom when they need it.",
    "Just because you offer flexible working doesn’t mean you’re losing staff or work time; there are plenty of technologies such as laptops, tablets, smartphones, cloud technologies, remote email and the like that enable staff to work from home or on the move, and there’s plenty of data to show that staff working from home are more effective because there are fewer interruptions and it’s easier to concentrate away from the office.",
    "Be sensible, though; if an employee with young children is asking to work from home on a regular basis, a restructuring of working hours may be a more realistic option for their productivity. Work with your employees to find the balance.",
    "Getting the working environment right can really help, particularly if employees are going to spend long hours in the office. An attractive office, kitchen and rest area improve morale massively. Features that can help here include colorful and leafy plants, beautiful paintings and interesting lighting.",
    "Even desks make a difference because it’s where your employees are likely to spend most of their days. A rickety old flat-pack table isn’t going to have the same impact as a stylish professional design. Invest in good office chairs, too, because ergonomics can make the difference between a healthy employee and a hunched-over one.",
    "You may also want to create a business culture where people work hard and play hard. If this is the case, it could be worth investing in a decent pool table or a games console and flat-screen, or a relaxing area with beanbags and sofas. Give staff the freedom to work where they want. Put desks on wheels. Make work fun and your staff will never want to go home.",
    "Too many business owners refuse to pass on responsibilities and this can have a negative effect on your employees. Delegation is one way of building trust in the workforce. Don’t micro-manage your employees; instead, allow them to use their own initiative and they, in turn, will feel empowered to make decisions and meet their goals.",
    "Micro-management can lead to frustration and resentment, particularly if it looks as though you, as a manager, are not doing your part. Tactfully listening to and encouraging people, while giving positive credit where it’s due, are also key elements of good communication. This includes avoiding excessive criticism or blame – even if you might be handing it out in your own head – but finding out what the root problem is and addressing it, and perhaps introducing training as required.",
    "Training staff and investing in expanding and improving their skills may be expensive, but it helps them to understand that you value them and that you want them to be the best at what they do. Investing in professional training courses can help with this; don’t be concerned that staff with training will leave – if they’re happy and valued, they’ll stay."
  ],
  "headers": {
    "6": "Creating staff incentives",
    "9": "Flexible working",
    "13": "Make it a home from home",
    "16": "Stop, delegate and listen"
  },
  "links": {
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "desks": "https://www.techradar.com/best/best-office-desks"
  }
}