{
  "source": "https://www.techradar.com/news/hp-work-from-home-bundles-print-and-pcs-together-for-the-first-time",
  "title": "HP Work From Home bundles print and PCs together for the first time",
  "category": "computing",
  "updated": "2021-10-07T17:32:04Z",
  "author": "anthony-spadafora",
  "summary": "New offering aims to make hybrid work a cinch for organizations",
  "article": [
    "In an effort to make things easier for businesses implementing hybrid work policies, HP has announced that it will combine its printers, PCs and supplies in a new offering called HP Work from Home.",
    "With HP Work from Home, IT leaders will be able to securely deploy and manage the company's PCs, printers and supplies to a distributed workforce. This way their employees can be just as productive when working from home as they are at the office.",
    "While hybrid work comes with a number of benefits due to its flexibility, there are also a lot of challenges that businesses implementing this new way of working will need to overcome. HP believes it can help organizations transition to hybrid work by ensuring their employees have all of the tools and supplies they need to do their jobs regardless of where they're working from.",
    "Global head and general manager of HP Inc's personal systems services division, Sumeer Chandra provided further insight on the company's new offering in a press release, saying:",
    "“While there are a lot of benefits to hybrid work, there are also a lot of challenges. With this combined offering, CIOs and IT managers can easily procure, deploy, and manage PCs and printers, plus ink or toner, no matter where the workforce is located.”",
    "The HP Work from Home service includes PCs and printers delivered to both the office and employees' homes, auto replenishment of ink and toner, remote diagnostics and next-business day support and hardware-enforced protection built into select devices for always-on security for its PCs and printers.",
    "Additionally, HP plans to add cloud security management and secure print path capabilities to its new offering this winter to provide IT admins with increased visibility while simplifying the management of essential security settings for remote devices.",
    "HP Work from Home is available in the US now and the program is expected to launch in additional countries throughout 2021 and 2022."
  ],
  "headers": {
    "5": "HP Work from Home"
  },
  "links": {
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "HP": "https://www.techradar.com/news/hp-streamlines-the-printing-experience-with-new-service",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "press release": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1305274327842551300&p=https%3A%2F%2Fpress.hp.com%2Fus%2Fen%2Fpress-releases%2F2021%2Fhp-powers-hybrid-workforces-united-offering.html",
    "PCs": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "printers": "https://www.techradar.com/news/best-home-printer"
  }
}