{
  "source": "https://www.techradar.com/news/cheap-5g-phones-promised-as-qualcomm-launches-new-snapdragon-4-series",
  "title": "Cheap 5G phones promised as Qualcomm launches new Snapdragon 480 chipset",
  "category": "phones",
  "updated": "2021-01-05T01:55:18Z",
  "author": "stephen-lambrechts",
  "summary": "5G-ready handsets are about to get very affordable",
  "article": [
    "It wasn't long ago that 5G support was only available on top tier premium phones, but with the announcement of Qualcomm's new Snapdragon 480 5G chipset, even budget handsets will have access to next-gen speeds.",
    "As Qualcomm's first 4-series mobile platform to boast 5G connectivity, the new Snapdragon 480 5G chipset is set to make blazing-fast download and upload speeds more readily available around the world, including in developing countries.",
    "From a technical standpoint, the new platform offers a built-in Snapdragon X51 5G Modem-RF System, bringing support for both mmWave and Sub-6 GHz 5G frequencies, with both standalone and non-standalone modes.",
    "Additionally, support for Qualcomm's FastConnect 6200 mobile connectivity subsystem offers 2x2 Wi-Fi (dual Wi-Fi antennas) along with a set of key Wi-Fi 6 features, including 8x8 sounding with multi-user MIMO (Multiple-Input Multiple-Output), which allows for big improvements in terms of wireless range and performance.",
    "Snapdragon 480 5G also boasts Bluetooth 5.1 and support for dual-frequency GPS and NavIC, which should allow for more accurate location positioning overall.",
    "The chipset, which is based on the 8nm process, is said to bring a performance improvement of up to 100% over its predecessor thanks to the combination of Qualcomm's Kryo 460 CPU (2.0 GHz) and Adreno 619 GPU, as well as a 70% improvement to AI performance.",
    "Other features include the 4-series debuts of Qualcomm's Quick Charge 4+ battery technology and its Spectra 345 ISP camera functionality, which allows for capture on three cameras simultaneously for both stills and video.",
    "As for when we'll see the new 4-series chipset in action, Qualcomm says the \"first commercial devices powered by the Snapdragon 480 5G Mobile Platform are expected to be announced in early 2021.\""
  ],
  "headers": {
    "5": "Better performance for cheap smartphones"
  },
  "links": {}
}