{
  "source": "https://www.techradar.com/news/amazons-new-smart-tvs-are-available-now-but-heres-why-you-should-wait-to-buy-one",
  "title": "Amazon's new smart TVs are available now – but here's why you should wait to buy one",
  "category": "televisions",
  "updated": "2021-10-27T18:26:18Z",
  "author": "nick-pino",
  "summary": "Waiting a few weeks could save you a ton of money on an Amazon Omni TV",
  "article": [
    "Amazon announced that its new Omni Series smart TVs are now on sale through its website – but you might want to wait a few weeks before you buy one.",
    "There’s two big reasons for that. The first one is that we’re just a few weeks away from Black Friday and Cyber Monday that kick off on Friday, November 26 and run through Monday, November 29.",
    "It’s then we’ll probably get the best deals on the new TVs as Amazon looks to compete with other major manufacturers like Samsung, TCL, Sony and LG for the lowest TV prices.",
    "But the other reason you might want to wait is that Amazon says it will be rolling out an update for the TVs to work with Apple AirPlay 2 and HomeKit in the near future as well. When that lands, you’ll be able to stream content from your iPhone, iPad or Mac to the TV without having to go through the hit-or-miss Cast function.",
    "If you’re looking to save some cash upfront and willing to put in some work, we’d recommend keeping tabs on the TVs over the next few weeks. At some point they’ll almost certainly drop below their regular MSRP.",
    "That said, while we wouldn’t expect to see discounts in the hundreds of dollars – the Amazon Omni TVs are already pretty cheap – it’s possible that we could see some healthy discounts or bundle deals as Amazon looks to move a ton of TVs over the holidays.",
    "We’d also recommend keeping an eye out for other Black Friday 4K TV deals over the next few weeks as we move towards one of the biggest shopping holidays in the world."
  ],
  "headers": {
    "4": "Analysis: So when should you pick one up?"
  },
  "links": {
    "Omni Series": "https://www.techradar.com/news/amazon-is-making-its-own-tvs-and-theyre-surprisingly-affordable",
    "smart TVs": "https://www.techradar.com/news/best-tv",
    "website": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Famazon-fire-tv-65-inch-omni-series-4k-smart-tv%2Fdp%2FB08T6J1HG8%2Fref%3Dsr_1_1%3Fdchild%3D1%26keywords%3Dfire%252Btv%252Bomni%252Bseries%26qid%3D1633543845%26sr%3D8-1%26th%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1452469975366547200-20",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Black Friday 4K TV deals": "https://www.techradar.com/black-friday/tv-deals"
  }
}