{
  "source": "https://www.techradar.com/news/an-rtx-3060-laptop-under-dollar1000-its-true-thanks-to-this-best-buy-black-friday-deal",
  "title": "An RTX 3060 laptop under $1,000? It's true - thanks to this Best Buy Black Friday deal",
  "category": "news",
  "updated": "2021-11-20T16:03:32Z",
  "author": "john-loeffler",
  "summary": "Up your game with an MSI GF65 for less this Black Friday",
  "article": [
    "Laptops using an RTX 3060 GPU are among the best midrange gaming machines on the market right now, but finding one for less than $1,000 can be tough. Thankfully, Best Buy has this MSI GF65 with RTX 3060 for just $849 right now, a startling $250 discount. We spotted this deal a couple of weeks ago, and it's still going strong - best grab hold before it goes out of stock.",
    "The best gaming laptops are usually the most sought-after Black Friday deals, so we expect a lot of them to start selling out over the next week and a half, so if you're looking to grab a solid laptop for the gamer in your life this holiday season – or if you just want to grab one for yourself, go on, you earned it! – then you can't go wrong getting midrange performance for a budget gaming laptop price.",
    "And the best thing about this gaming laptop deal at Best Buy? The retailer has guaranteed this price won't go any lower over Black Friday. That means you can grab it now, beat the crowds, and get a full month of gaming in ahead of time.",
    "(Not in the US? Scroll down for deals in your region).",
    "This MSI GF65 laptop comes loaded with an Intel Core i5-10500H, Nvidia RTX 3060 GPU, 8GB RAM, and a 512GB SSD.",
    "Its full HD (1080p) display also features a 144Hz refresh rate for smoother graphics, making this a great choice for eSports dabblers who want to take their gaming on the go.",
    "While the processor is a little older, it's still one of the most powerful Core i5s from last year's range and very close to an Intel Core i7-10750H in regards to out-and-out power.",
    "No matter where you live, you'll find all the lowest prices for the MSI GF65 Thin from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best MSI GF65 Black Friday deal",
    "7": "More MSI GF65 deals",
    "8": "More Black Friday deals"
  },
  "links": {
    "MSI GF65 with RTX 3060 for just $849 right now": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1136667317935776500&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fmsi-gf65-15-6-144hz-gaming-laptop-intel-core-i5-nvidia-geforce-rtx3060-512gb-ssd-8gb-memory-black%2F6456144.p%3FskuId%3D6456144&article_name=An%20RTX%203060%20laptop%20under%20%241%2C000%3F%20It's%20true%20-%20thanks%20to%20this%20Best%20Buy%20Black%20Friday%20deal&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fan-rtx-3060-laptop-under-dollar1000-its-true-thanks-to-this-best-buy-black-friday-deal",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "budget gaming laptop": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000"
  }
}