{
  "source": "https://www.techradar.com/news/a-quiet-place-video-game-adaptation-is-in-the-works-but-will-it-be-any-good",
  "title": "A Quiet Place video game adaptation is in the works, but will it be any good?",
  "category": "gaming",
  "updated": "2021-10-27T09:26:18Z",
  "author": "rhys-wood",
  "summary": "A perfect candidate for survival horror?",
  "article": [
    "You might know A Quiet Place as a successful duology of horror movies, and it seems to have been popular enough to warrant a video game adaptation set in the same universe.",
    "Simply known as A Quiet Place at this time, the game is being billed as a \"story-driven horror adventure\" game by the official Twitter account. Coming in 2022, A Quiet Place is being published by Saber Interactive, the team behind the video game adaptation of World War Z that's also making the upcoming Evil Dead: The Game, Bloody Disgusting reports.",
    "Unfortunately, the game's official website doesn't divulge much info beyond the tentative release date. However, a press release from Saber Interactive states that A Quiet Place will \"deliver an original story and gameplay that captures the compelling suspense, emotion and drama for which the series is famous.\"",
    "The A Quiet Place game adaptation is being developed by a studio named iLLOGIKA, primarily made up of veteran talent that worked on the Far Cry and Rainbow Six franchises. This may suggest that A Quiet Place will take place from a first-person perspective, which isn't unusual for contemporary horror games, and something that Resident Evil 7 and Resident Evil Village greatly succeeded at.",
    "We're not sure when exactly A Quiet Place will release, but with a tentative release window of 2022, it's possible we'll start seeing gameplay trailers or snippets before then, perhaps debuting at The Game Awards 2021 taking place on December 9.",
    "Over the past few years, we've seen what appears to be an uptick in movie and TV to video game adaptations, especially from the horror genre. World War Z transformed the epic zombie property into a Left 4 Dead-style horde shooter, while Blair Witch translated the found-footage movie into a first-person survival horror. Some even leant themselves to indie-style projects, as we saw with titles like Stranger Things 3: The Game. And the weirdest part? They've all been pretty good.",
    "A Quiet Place might seem like a strange franchise to adapt into a video game format at first glance, but it makes more sense than you'd think. Both movies excel at suspense-laden horror experiences, ones that lean more towards the psychological rather than rely solely on cheap jump scares. In our books, the best kind of horror is the one that slowly but surely gets into your head, and this is something that many horror games, such as Silent Hill, P.T. and Amnesia, do so well.",
    "That's why we think A Quiet Place is a fine series to receive a game adaptation. It's not one that immediately jumps into your mind, and there's something very intriguing in that. We're not yet sure what kind of a vision the A Quiet Place game will ultimately achieve, but here's hoping it can deliver a tense experience worthy of the franchise's name. Just please don't be a literal survival game where we have to scavenge for food and water. There's already enough of those."
  ],
  "headers": {
    "5": "Analysis: Movie to game adaptations back on the rise?"
  },
  "links": {
    "A Quiet Place": "https://www.techradar.com/news/what-its-like-to-watch-a-quiet-place-in-one-of-the-worlds-quietest-places",
    "official Twitter account": "https://twitter.com/AQuietPlaceGame",
    "Saber Interactive": "https://www.techradar.com/news/nintendo-switch-doesnt-need-better-hardware-according-to-world-war-z-dev",
    "Bloody Disgusting reports": "https://bloody-disgusting.com/video-games/3689031/evil-dead-the-game-developers-saber-interactive-announce-game-based-on-a-quiet-place/",
    "official website": "https://aquietplace.game/",
    "Far Cry": "https://www.techradar.com/reviews/far-cry-6",
    "Rainbow Six": "https://www.techradar.com/news/rainbow-six-extraction",
    "Resident Evil 7": "https://www.techradar.com/news/resident-evil-7-review",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Blair Witch": "https://www.techradar.com/news/blair-witch-game"
  }
}