{
  "source": "https://www.techradar.com/news/popular-wordpress-seo-plugin-makes-controversial-move",
  "title": "Popular WordPress SEO plugin makes controversial move",
  "category": "computing",
  "updated": "2021-01-05T13:04:26Z",
  "author": "barclay-ballard",
  "summary": "Automatic updates were enabled without users being aware",
  "article": [
    "WordPress has angered users after an All in One SEO plugin unexpectedly turned on automatic updates – leading numerous sites to experience outages. The mishap is another embarrassing incident for the website builder, following several security scares last year.",
    "Normally, automatic updates are something that WordPress publishers have to opt into, with many instead choosing to backup their sites before committing to a manual update. That way, should anything go wrong with an update, publishers can simply roll back to the previous iteration.",
    "However, one eagle-eyed WordPress user noticed that the All in One SEO plugin turned on automatic updates without notifying the user, aside from a brief mention in the changelog. The plugin led to a lot of discussion on WordPress user forums, with many noting that other plugins also enabled automatic updates without much in the way of user notification.",
    "One particularly angry WordPress user advised users to migrate their WordPress content now while they have the chance.",
    "“Multiple sites have updated to 4.0.11 without my permission and while all auto-updates are disabled,” they wrote in a WordPress support post. “Your once-reliable plugin has destroyed hundreds of pages of social metadata on multiple sites, broken layout (and this after I fixed the problems and told you last week, I will be disabling all updates). How dare you update my websites without my permission?”",
    "Part of the problem users were faced with was the sheer number of updates being pushed by the All in One SEO plugin – twelve in a little over six weeks. It seems the plugin has also been plagued by bugs – another reason why users are more than a little annoyed with the SEO tool.",
    "Via Search Engine Journal"
  ],
  "headers": {
    "3": "Bugs aplenty"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "security scares": "https://www.techradar.com/news/these-wordpress-plugin-bugs-could-jeopardize-hundreds-of-thousands-of-sites",
    "WordPress support post": "https://wordpress.org/support/topic/auto-update-29/#post-13837970",
    "Search Engine Journal": "https://www.searchenginejournal.com/wordpress-all-in-one-seo-auto-updates-backlash/391607/#close"
  }
}