{
  "source": "https://www.techradar.com/news/samsung-galaxy-s-phones-history",
  "title": "Samsung Galaxy S phones history: from iPhone copycat to dazzling Galaxy S21 Ultra",
  "category": "phones",
  "updated": "2021-04-19T16:36:23Z",
  "author": "andrew-williams",
  "summary": "From Galaxy S to the Galaxy S21 series",
  "article": [
    "Can you believe it? Samsung's famous Galaxy S series has been around for over a decade, and has - so far - culminated in the Samsung Galaxy S21 range, including the Samsung Galaxy S21 Ultra, which at the time of writing sits at the number one spot in our list of the best smartphones.",
    "The Galaxy S series has also made Samsung the biggest seller of smartphones in the world. But how did the South Korean giant become so influential and popular? Below we'll take you through the Galaxy S journey so you can see for yourself.",
    "From the Galaxy i7500, which was be no means a smash hit, through the years and onto the Galaxy S21 range, there have been a couple of misses along the road of regular hits. But the buzz that remains is proof that Samsung is still the only major player that can take on Apple in terms of overall mobile handset sales.",
    "A true shark in the Android lake, this is the story of the Samsung Galaxy S's 12-year history.",
    "The month is April, the year is 2009, and Samsung debuts an Android 1.5 Cupcake phone that we described at the time as \"run of the mill\".",
    "Packing a 5MP camera, the Galaxy i7500 sported a 3.2-inch AMOLED display that offered a measly 320 x 480 resolution, and made use of a conventional D-pad - oh how mobile technology can change in a couple of years.",
    "Under the hood the handset had a 528MHz Qualcomm MSM7200A CPU and an Adreno 130 GPU powering the display, a setup which we found to be laggy on occasion. The i7500 had 8GB of built-in storage and 128MB of RAM (absolutely paltry by today's standards, but not so bad for 2009).",
    "Despite a relatively large 1,500mAh battery, battery life was disappointing: during heavy use it only lasted 3-4 hours, and the handset had to be charged at least once a day.",
    "An underwhelming start for the Galaxy range then, and definitely room for improvement. Android was still in its infancy, and Samsung was still finding its feet: in October 2009, HTC was the only other manufacturer making mobiles running Android.",
    "The price was off-putting too, with the i7500 originally costing £499 (around $645/AU$860) to buy SIM-free.",
    "The next Galaxy handset appeared a little over a year later, in June 2010. The D-pad was gone, and the Samsung Galaxy S had a far more recognizable shape and style to it, with the now ubiquitous back, home and menu buttons in place.",
    "The display was bigger (spot the emerging trend), offering a 480 x 800 resolution across 4 inches of Super AMOLED real estate.",
    "The S originally appeared with Android 2.1 Eclair and bowed out with 2.3 Gingerbread. The RAM was boosted to 512MB, 8GB and 16GB storage options were available, and a 1GHz Cortex-A8 chipset kept everything running.",
    "A PowerVR SGX540 GPU was in charge of graphics, and the handset tipped the scales at 119g.",
    "Android had added support for a forward-facing camera, so the Galaxy S included one, as well as a 5MP shooter around the back. The battery was again a 1,500mAh model, and again the phone struggled to get through a working day without a recharge. The 2.3 Gingerbread update did wonders in this department though, almost doubling its lifespan.",
    "\"There are a few faults, but on the whole it's a cracking bit of kit, and you really could do a lot worse,\" concluded our review at the time, and Samsung now had a foundation it could build on.",
    "In 2010, the SIM-free price for the Galaxy S was £449 (around $580/AU$775).",
    "Okay, it’s finally time to take Samsung’s smartphone seriously, as the Samsung Galaxy S2 (or Galaxy S II, as Samsung liked to word it) was the first Galaxy phone to cause a significant splash in the mobile handset pond.",
    "It was a device that brought an improved Super AMOLED Plus screen that was expanded to 4.3-inches, a faster dual-core 1.2GHz Exynos 4210 CPU, 1GB of RAM and a superior Mali-400MP4 GPU.",
    "Debuting in April 2011 with Android 2.3.4 Gingerbread in tow, the Galaxy S2 would eventually get as far as 4.1 Jelly Bean, a sign of its prowess and longevity.",
    "In terms of storage space, 16GB and 32GB models were available, and the phone was praised for its thinness, lightness (116g), responsiveness and 1080p video recording capabilities.",
    "The camera had been bumped up to 8MP and now had a flash, while the 1,650mAh battery was good for almost two days of average use - a target that many of today's phones would love to be able to stretch to.",
    "It wasn’t cheap though. At launch, SIM-free prices for the S2 hovered around the £500 (roughly $645/AU$865) mark.",
    "A device we described simply as “awesome” at the time, it was an instant hit. After the moderate college radio success of the Galaxy S, Samsung finally had a chart-topping hit on its hands: within five months, the company would shift 10 million of its S2 phones.",
    "After a brief Google-sponsored detour to make the Galaxy Nexus, Samsung returned to its own flagship phone in the shape of the Galaxy S3 in May 2012.",
    "It was the second home run for Samsung in a row: the S3 arrived to almost universal acclaim, and we called it \"the best smartphone around right now\" in our original review.",
    "Again, the screen was bigger: the Super AMOLED display grew to 4.8 inches at a resolution of 720 x 1280, and the weight grew to 133g as well.",
    "The heavy lifting was done by a quad-core 1.4GHz Exynos 4412 CPU, while the Mali-400MP4 GPU showed up again alongside 1GB of RAM. The S3 originally came with Android 4.0.4 Ice Cream Sandwich and was at the same £500 (roughly $645/AU$865) SIM-free price level as its predecessor.",
    "As on the S2, an 8MP camera was around the back, though various software optimizations helped to create slightly better photos. In terms of storage, 16GB, 32GB and 64GB options were available.",
    "Not even battery life could spoil the S3 party: the 2,100mAh battery was good for eight hours or so of heavy use, which placed it very favorably among the other handsets of 2012.",
    "Speed, design, battery life, display, responsiveness, bundled features... this was a phone that ticked all the right boxes.",
    "After successive successes, the Samsung Galaxy S4 was met with much hype and anticipation when it arrived in April 2013, offering users a whopping 5-inch 1080 x 1920 Super AMOLED screen, an upgraded 13MP camera, Android 4.2.2 Jelly Bean and a 2,600mAh battery that typically lasted at least the length of a day.",
    "The specs, for the time, were seriously impressive: an octa-core Exynos 5410 CPU with four cores clocked at 1.6GHz and four at 1.2GHz, a PowerVR SGX 544MP3 GPU, and 2GB of RAM lined up alongside the option of 16GB, 32GB or 64GB of built-in storage.",
    "Weighing in at 130g, it edged the line between useful and gimmicky additions, with a slew of sensors capable of tracking your eyes, measuring humidity and more besides.",
    "All of this novelty came at a cost, but despite being handed a near £600 (roughly $775/AU$1035) asking price on day one, the S4 racked up sales of some 40 million units in the first six months.",
    "It might not have wowed like the S2 or S3, but it was still a resounding success.",
    "Things didn’t remain quite so rosy for the Galaxy S series in 2014. When the Samsung Galaxy S5 was launched unto the baying public in February, it delivered in a number of expected updates but failed to really wow.",
    "The main specs were up again: the CPU was faster at 2.5GHz, the screen was a larger 5.1-inch Super AMOLED 1080p option, the camera boosted to 16MP and the battery now rocked up at 2,800mAh, and the theatrics and pointless sensors were gone.",
    "Instead, a heart rate monitor, blazing fast autofocus and a fingerprint scanner lined up alongside Android 4.4.2 and an interface overhaul, which made things like the lock screen much clearer and generally improved the flow through the device.",
    "While the camera wowed and fitness elements were boosted through S Health 3.0, it was the phone’s 8.1mm thick, soft-touch rear that failed to impress. Despite the phone’s £600 (roughly $775/AU$1035) asking price, this grippy design didn’t look like a high-end device.",
    "It did offer something most high-end handsets of the time didn’t, however, decent, IP67 certified water resistance.",
    "After the Galaxy S5 had been something of a misstep, the Samsung Galaxy S6 was a true return to form for the Samsung Galaxy S series. Well, mostly.",
    "A phone that paved the way for what the Galaxy S9 offers today, the S6 stepped out of the iPhone’s shadow with an innovative new curved edge display.",
    "At least on one of the two models available. The standard, flat Galaxy S6 was joined by the eye-catching Samsung Galaxy S6 Edge, both of which upped the visual stakes with 5.1-inch 1440 x 2560 QHD panels.",
    "Under the hood, each of the S6 iterations packed plenty of grunt courtesy of an Exynos 7420 octa-core chipset made up of four 2.1GHz cores and four 1.5GHz cores. This sizeable CPU was backed up by a Mali-T760MP8 GPU and 3GB of RAM. Despite its solid foundations though, the S6’s specs sheet wasn’t perfect.",
    "These were phones that copied all of the wrong iPhone features, ditching microSD expandable storage in favor of locked 32GB, 64GB and 128GB capacities.",
    "Running Android 5.0.2 Lollipop direct from the box, the S6 has since been upgraded to Android 7.0 Nougat, and paired a stunning 16MP, OIS-enhanced 28mm camera with 4K video capture, a 5MP selfie snapper and a modest 2,550mAh battery that will just about secure you a full day’s use on a single charge.",
    "Despite its flurry of impressive innards, it was the S6 Edge's curvy display that really captured attentions and gave the device the edge.",
    "More of an iterative update than an out and out refresh, despite the familiar look and feel, the Android 6.0-powered Samsung Galaxy S7 was an instant hit when it dropped in February 2016. A phone that refined the solid foundations of the Galaxy S6, it strolled out ahead of all rival devices.",
    "Again the phone came in two forms, with the larger Samsung Galaxy S7 Edge the star of the show. Like the standard, 5.1-inch S7, the S7 Edge stretched a 1440 x 2560 QHD Super AMOLED display over its 5.5-inch form, but it wrapped the panel around both the phone’s left and right hand edges.",
    "These phones were about more than just impressive screens though. The S7’s 12MP camera might sound like an on-paper downgrade, but its new wide aperture f/1.7 26mm lens, phase detection autofocus and optical image stabilization (OIS) enhancements ensured it captured stunning shots in even low light shooting conditions.",
    "Impressive imaging options were backed up by plenty of power, with an upgraded octa-core Exynos 8890 chipset running the show (except in the US, where it had a Snapdragon 820) alongside Mali-T880 MP12 graphics and a sizeable 4GB of RAM.",
    "MicroSD storage expansion made a return too, with both 32GB and 64GB models capable of being enhanced.",
    "Elsewhere, the phone’s sizeable 3,000mAh battery offered a full day's charge, with the phone’s Quick Charge 2.0 skills letting you get a quick fix of extra power, while the S7’s sleek metal frame and high-end glass rear were enhanced by impressive IP68 certified dust and water resistance, without any unsightly port covers.",
    "Goodbye traditional flat panels, curved screens are now standard, and massive. The Samsung Galaxy S8 and larger Galaxy S8 Plus marked a seismic shift in smartphone design, ditching the physical home button of past Galaxy S series handsets in favor of a near edge-to-edge Infinity Display.",
    "Offering more screen on a device with a smaller footprint, the Infinity panels moved to a new 18.5:9 aspect ratio and each boasted 1440 x 2960 resolution stretched out across their respective 5.8-inch and 6.2-inch forms.",
    "Display and design were the main points of attention here, with the IP68 certified handsets each still running 12MP primary cameras and 4GB of RAM, alongside the upgraded Exynos 8895 octa-core chipset (or the Snapdragon 835 in the US) and Mali-G71 MP20 GPU.",
    "While microSD storage expansion remained, multiple storage options were scrapped. Instead, 64GB all the way, with the single option capacity slotted in alongside an impressive new social media-loving 8MP front-facing camera.",
    "A phone that had to shake the shadow of the infamous Galaxy Note 7 combusting battery catastrophe, the S8 had a decent 3,000mAh battery with bafflingly quick recharge times.",
    "Aside from the screen there were no innovative new feature to set the phone apart, with its Bixby smart assistant put on ice for launch. It didn’t matter though. That screen, combined with modest across the board tweaks, were enough to make the S8 a top phone of 2017.",
    "A device that shouldered the future success of Samsung’s smartphones after a tumultuous end to 2016, it’s a phone that forced the competition to up their game.",
    "When the Galaxy S8 arrived, we said \"wow\". 2018's Galaxy S9 family caused a more measured response. The Galaxy S9 and Galaxy S9 Plus are good, great even, but also familiar.",
    "They look a lot like their predecessors, and improvements are subtle tweaks rather than revolutions.",
    "The rear camera can switch between two aperture settings. This hasn't been seen since the Nokia N86 almost 10 years earlier, but only has slight sharpness benefits for your photos.",
    "And while the S9 Plus has a great 2x zoom camera, this just brings it up to the expected standards for the time. The speaker upgrade was another overdue change. Samsung worked with AKG to add louder speakers to the S9 phones, with a 30% volume boost and stereo sound provided by the secondary earpiece driver.",
    "What Samsung didn't do is just as important, though. The Galaxy S9 family has headphone jacks, currently disappearing from phones as if they're made of expensive rare elements. And there's no notch in the display.",
    "The fingerprint was also moved to a more ergonomic position. Samsung showed real consideration and restraint with the S9 and S9 Plus.",
    "That said, it did also bring us AR Emojis, a slightly rubbish take on Apple's Animojis. Let's not give Samsung too much credit.",
    "Early reports suggest early sales were slower than the S8's, although this may be down to an overall slowing in phone sales in general. Samsung may need to make bolder moves in 2019.",
    "At launch the Galaxy S9 cost $719 (£739, $AU1,199), the S9 Plus $850 (£869, $AU1,349).",
    "The Samsung Galaxy S10 lived up to its 10-year anniversary hype. The phone introduced several firsts for the series along with incremental changes that keep it at the top of our best phones list.",
    "Arriving alongside the larger Galaxy S10 Plus and the new, affordable 'budget flagship' variant Galaxy S10e, the S10 expanded its camera suite with a third ultrawide lens and, finally, added an in-screen fingerprint sensor. It also got rid of the notch by tucking the front-facing camera in a punch-hole tucked into a corner.",
    "In 2020 Samsung jumped a few numbers with the Galaxy S20 series. There's no budget device, so the titular device sits at the bottom of the line, with the Samsung Galaxy S20 Plus slightly more accomplished in a few different ways.",
    "If you want a real top-end device, though, you should look for the Samsung Galaxy S20 Ultra, which has a slew of rear cameras, a huge 6.9-inch screen, and a chunky 5,000mAh battery. It'll set you back a lot of money, but if you need the biggest and best, this is a hugely accomplished phone.",
    "Samsung seemingly couldn't wait to launch the Galaxy S21 range, as the phones were announced on January 14 - a month earlier than normal. That said, they certainly don't appear rushed, with Samsung having worked to offer the premium experiences it's known for at a lower price, as the Samsung Galaxy S21, Galaxy S21 Plus, and Galaxy S21 Ultra all cost less than their predecessors.",
    "To manage that, Samsung has lowered the resolution on the standard S21 and S21 Plus to 'just' Full HD+, and the basic model also has a 'Glasstic' rather than glass back. But all three have top-end power, as they're equipped with either a Snapdragon 888 or Exynos 2100 chipset (depending on region).",
    "They also all have at least three cameras, with the Samsung Galaxy S21 Ultra upping that to four, including a 108MP main lens and two telephoto snappers, for a 10x optical zoom range.",
    "The S21 Ultra is a big leap over the other models all round, with a QHD+ screen, up to 16GB of RAM (compared to 8GB on the other two), a larger 5,000mAh battery, and in an S-series first, support for Samsung's S Pen stylus - previously a major selling point of the Galaxy Note series. Though you have to buy it separately for the Samsung Galaxy S21 Ultra, and there's no slot for it in the phone.",
    "Another first for the range is support for both a 120Hz refresh rate and a QHD+ screen resolution at the same time - again, this is exclusive to the Samsung Galaxy S21 Ultra, a phone which while cheaper than its predecessor is still very expensive."
  ],
  "headers": {
    "4": "Samsung Galaxy i7500",
    "10": "Samsung Galaxy S",
    "17": "Samsung Galaxy S2",
    "24": "Samsung Galaxy S3",
    "31": "Samsung Galaxy S4",
    "36": "Samsung Galaxy S5",
    "41": "Samsung Galaxy S6 / Galaxy S6 Edge",
    "48": "Samsung Galaxy S7 / Galaxy S7 Edge",
    "54": "Samsung Galaxy S8 / Galaxy S8 Plus",
    "61": "Samsung Galaxy S9 / Galaxy S9 Plus",
    "70": "Samsung Galaxy S10 / Galaxy S10 Plus / Galaxy S10e",
    "72": "Samsung Galaxy S20 / Galaxy S20 Plus / Galaxy S20 Ultra",
    "74": "Samsung Galaxy S21 / Galaxy S21 Plus / Galaxy S21 Ultra"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "Galaxy i7500": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-i7500-637405/review",
    "Samsung Galaxy S": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s-689293/review",
    "Samsung Galaxy S2": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s2-930907/review",
    "Galaxy Nexus": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-nexus-1039209/review",
    "Galaxy S3": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s3-1078667/review",
    "Samsung Galaxy S4": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s4-1137602/review",
    "Samsung Galaxy S5": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s5-1226990/review",
    "Samsung Galaxy S6": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s6-1285636/review",
    "Samsung Galaxy S6 Edge": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s6-edge-1286088/review",
    "Samsung Galaxy S7": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-1315188/review",
    "Samsung Galaxy S7 Edge": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-edge-1315189/review",
    "Samsung Galaxy S8": "https://www.techradar.com/reviews/samsung-galaxy-s8-review",
    "Galaxy S8 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s8-plus-review",
    "Galaxy Note 7": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-note-7-1325876/review",
    "Galaxy S8": "https://www.techradar.com/reviews/samsung-galaxy-s8-review",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Galaxy S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "Nokia N86": "https://www.techradar.com/news/phone-and-communications/mobile-phones/hands-on-nokia-n86-review-532800",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "best phones": "https://www.techradar.com/news/phone-and-communications/mobile-phones/20-best-mobile-phones-in-the-world-today-1092343",
    "Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Galaxy S10e": "https://www.techradar.com/reviews/samsung-galaxy-s10e",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review"
  }
}