{
  "source": "https://www.techradar.com/news/polestar-2-lineup-gets-a-refresh-and-a-tech-injection",
  "title": "Polestar 2 lineup gets a refresh – and a tech injection",
  "category": "car-tech",
  "updated": "2021-04-13T13:33:50Z",
  "author": "axel-metz",
  "summary": "Because three is better than one",
  "article": [
    "Swedish automaker Polestar is hoping to breathe new life into its electric sports car lineup by introducing two new models to its flagship Polestar 2 EV range – the 2019 car designed to rival the Tesla Model 3.",
    "While the dual-motor launch edition of the Polestar 2 will remain available, a new version will allow for the integration of the brand's latest option packages – the Plus Pack and Pilot Pack – which augment the car in various ways.",
    "Polestar is also introducing a cheaper, single-motor Polestar 2, which will enhance EPA range to an estimated 260 miles (over its sibling's 240) without compromising on interior features.",
    "Of its latest option packages, Polestar says the new dual-motor Polestar 2 will benefit from several new road-related gadgets, depending on the package you choose.",
    "The Pilot package, for example, adds new driver assistance features like Pixel LED headlights with LED front fog lights, a 360-degree surround view camera and a new Blind Spot Information System (BLIS), among other useful additions.",
    "Perhaps the most interesting of all the new upgrades available to the Polestar 2, though, is the addition of a mechanical heat pump. Available with the Plus package, the pump allegedly reduces the need to rely on valuable battery charge in order to heat the interior of the car, enabling further overall driving range.",
    "Polestar says it can reduce the climate draw on the battery by as much as 50% – giving the Polestar 2 up to 10% more range.",
    "Alongside both dual-motor models of the Polestar 2, the company is introducing a single-motor variant into the lineup.",
    "Though pricing hasn't yet been announced, Polestar has confirmed that the single-motor edition of the car will enjoy a sizable price drop over its more powerful sibling.",
    "That's not to say the single-motor Polestar 2 is lacking in performance, though. It'll have a longer range than the base model – boasting 260 miles without the Plus package, although this is also available to further increase its range – and come with 231 horsepower, which is actually an increase on the 204 horsepower on each axle of the dual-motor variant.",
    "It'll also come equipped with the same interior features that made the original Polestar 2 so unique, including built-in Google Assistant and Google Maps.",
    "The exterior and interior design of each Polestar 2 model is largely indistinguishable, so it's clear that the company is hoping to win over more frugal drivers without skimping on the bells and whistles of the original car.",
    "The single-motor Polestar 2 will arrive in North America at the end of 2021, before becoming available worldwide at a later date."
  ],
  "headers": {
    "7": "Same car, smaller price"
  },
  "links": {
    "Tesla Model 3": "https://www.techradar.com/news/tesla-model-3"
  }
}