{
  "source": "https://www.techradar.com/news/vzr-model-one-is-a-new-high-end-gaming-headset-from-apples-former-lead-audio-engineer",
  "title": "VZR Model One is a new high-end gaming headset from Apple's former lead audio engineer",
  "category": "gaming",
  "updated": "2021-02-12T16:09:01Z",
  "author": "nick-pino",
  "summary": "A new gaming headset for both the studio and your next Warzone match",
  "article": [
    "VZR, a company co-founded by Apple’s former Lead Audio Engineer Vic Tiscareno back in 2014, has just debuted its new rival for Razer and Turtle Beach headsets: the Model One.",
    "The new headphones will be the first to feature the company’s new trademarked CrossWave technology that uses an acoustic filter that “selectively and strategically reshapes audio waves to emulate the way one would perceive the sound in real life without headphones”.",
    "The result, VZR says, is a headset that has the fidelity and detail of a studio reference speaker system when critically listening to your favorite music, and accurate 3D spatial positioning when playing your favorite games, all without any software modulation.",
    "The wired headset comes with a detachable boom mic and is slated for launch in Q2 2021 – between April and June of this year – for $349 (around £250, AU$450), a price comparable with other audiophile headsets like the Audeze Mobius.",
    "In a video on VZR’s website, Tiscareno says he was hand-picked by Steve Jobs to be an audio engineer on a number of Apple’s most successful audio gear – including the iPod, iPhone and pack-in EarPods – and yet, he says the VZR Model One is “as innovative as anything I’ve ever made at Apple”.",
    "While open-back gaming headphones are nothing new (just look at the Audeze Mobius and Sennheiser Game One Gaming Headset) the CrossWave audio lens could be a real game-changer as the industry pushes toward 360-degree spatial audio. Being able to get spatial audio-like effects without software upscaling is a huge step up from a lot of the solutions we’ve seen from Dolby and Sony that require specially mastered audio tracks.",
    "That said, without hearing them for ourselves it’s hard to know how well that claim holds up. The idea of an audiophile-grade gaming headset is definitely intriguing, but the execution is really all that matters.",
    "If you're ready to go hands-on with them yourself, VZR says it will opening up pre-orders on its website soon and will have more news to share about the headset before it officially launches later this year."
  ],
  "headers": {
    "4": "From iPods to open-back headphones"
  },
  "links": {
    "Audeze Mobius": "https://www.techradar.com/reviews/audeze-mobius",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "its website": "https://vzraudio.com/"
  }
}