{
  "source": "https://www.techradar.com/news/square-takes-on-major-banks-with-new-suite-of-financial-services-for-your-business",
  "title": "Square takes on major banks with new suite of financial services for your business",
  "category": "computing",
  "updated": "2021-07-20T15:24:44Z",
  "author": "rob-clymo",
  "summary": "Square Banking looks to appeal to businesses of all sizes",
  "article": [
    "Square is looking to muscle in on the lucrative financial services sector with the launch of Square Banking, aimed firmly at Square merchants.",
    "The new product is launching off the back of the company’s already successful Square Debit Card and Square Capital and will help to further diversify what the tech company offers.",
    "Square Banking will feature a range of products and services designed to capitalize on its Square merchant following. Customers will be able to tap into a combination of savings, checking and lending services.",
    "The rollout of Square Banking will benefit from backend muscle provided by Square’s industrial bank, which has been operating since March 2021. In due course merchants will be able to use Square Financial Services, Square Savings and Square Checking. Adding appeal for merchants will be the ability for merchants to save a percentage of each sale processed using the FDIC-insured Square Savings deposit high yield account.",
    "Merchants will also be able to easily manage their accrued savings using tools for prioritizing finances into the likes of quarterly tax or emergency fund folders within the system. Meanwhile, Square Checking will offer merchants the flexibility of an FDIC-insured account to make payments using the Square Debit Card or ACG transfers as well as covering payroll commitments where necessary.",
    "Square Loans rounds out the release structure with the rebranding of the company’s existing lending facility, Square Capital, which launched back in 2014. The product will be of interest to merchants as it allows Square sellers to repay loans by using a percentage of their daily Square sales.",
    "“Small businesses are the heartbeat of our communities and our economy. From our earliest days, Square has focused on building easy-to-use tools and services to empower entrepreneurs to succeed on their own terms,” said Christina Riechers, Square Banking’s Head of Product.",
    "“Historically, small businesses have had to contend with numerous hurdles while trying to access vital financial services that are often readily available to larger companies. With Square Banking, we’ve reimagined the financial system for small business owners with their cash flow needs at the center. We’re introducing fair, accessible financial services that connect directly with our sellers’ payments, helping them unlock instant access to their sales, automate their savings, and receive personalized financing offerings.”"
  ],
  "headers": {
    "4": "Square Savings"
  },
  "links": {
    "Square merchants": "https://www.techradar.com/best/best-merchant-services",
    "Square Banking": "https://www.techradar.com/news/square-plans-to-launch-savings-and-checking-accounts-for-smbs",
    "industrial bank": "https://www.techradar.com/news/square-plans-to-launch-savings-and-checking-accounts-for-smbs",
    "quarterly tax": "https://www.techradar.com/best/small-business-tax-software",
    "make payments": "https://www.techradar.com/best/best-money-transfer-apps",
    "covering payroll": "https://www.techradar.com/best/best-payroll-software"
  }
}