{
  "source": "https://www.techradar.com/news/gta-trilogy-remaster-vs-gta-3-gta-vice-city-and-gta-san-andreas-see-the-differences",
  "title": "GTA Trilogy remaster vs GTA 3, GTA Vice City and GTA San Andreas: see the differences",
  "category": "gaming",
  "updated": "2021-10-22T16:15:48Z",
  "author": "john-mccann",
  "summary": "Check out the originals vs the remasters",
  "article": [
    "Rockstar's hotly anticipated GTA Trilogy remaster now has an official release date of November 11, and we've been treated to a trailer (you'll find it at the end of this article) which shows us just how the remastered versions of GTA 3, GTA Vice City and GTA San Andreas will look compared to the originals.",
    "Thing look promising - although not as promising as a GTA 6 announcement, but you can't have everything - with a clear improvement in detail, lighting, weather and color palettes, while the art styles of the original games have been respected and refreshed.",
    "We've grabbed as many of the comparisons between the originals and remasters as we could from the trailer to give you a side-by-side look of how the games differ.",
    "Hit the arrows on the image to swap between the original and remaster",
    "Liberty City: Notice the improved detail for the bridges and buildings in the background and improved clarity of the road signs in the bottom left corner.",
    "Here comes the rain: weather animation has been greatly improved in GTA: The DefinitiveTrilogy, with more realistic rain in this particular comparison.",
    "Now you see it: Lighting is another area which has been enhanced, and the comparison below shows just that. The remaster makes the visuals much clearer.",
    "Hit the arrows on the image to swap between the original and remaster",
    "An iconic street: there's no mistaking the arc-deco styling and neon lights, and they look even better in the remaster of Vice City.",
    "A private conversation: sometimes talks need to be held in private, like in the back of a limo - and the colors are vastly improved in the remaster.",
    "In da club: It may not be the easiest place to hear what the plan is, but sometimes needs must - and look, there's a cigar in the ashtray.",
    "Hit the arrows on the image to swap between the original and remaster",
    "The sand man: CJ is out in the desert, and just look at the lovely sunset in the remastered screenshot background.",
    "Kitchen conference: The family are together in the kitchen, and who knew about the floral tiling on the wall before today? Beautiful.",
    "Keep walking: CJ is having a disagreement, but take a look at the walls of the house - there's more color, and it feels more homely and lived-in.",
    "Sweet ride: there's nothing like a drive through the forest, and check out the added details on the trees behind the car, and reflections on the car body.",
    "You can get a taste for the GTA Trilogy remaster, and see the comparisons in real-time, with the official trailer below."
  ],
  "headers": {
    "3": "GTA 3 vs GTA Trilogy remaster",
    "7": "GTA Vice City vs GTA Trilogy remaster",
    "11": "GTA San Andreas vs GTA Trilogy remaster",
    "16": "GTA Trilogy trailer"
  },
  "links": {
    "GTA Trilogy": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "has an official release date of November 11": "https://www.techradar.com/news/gta-trilogy-releases-in-november-will-launch-day-one-on-xbox-game-pass",
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6"
  }
}