{
  "source": "https://www.techradar.com/news/canon-is-thinking-of-bringing-the-apc-s-sensor-to-the-eos-r-system",
  "title": "Canon is 'actively' thinking of bringing the APS-C sensor to the EOS R system",
  "category": "cameras",
  "updated": "2021-07-22T05:34:14.824Z",
  "author": "sharmishta-sarkar",
  "summary": "Camera maker rumored to be conducting market research",
  "article": [
    "Reports of Canon developing an APS-C format EOS R camera have been around since October 2020. At the time, it was speculated that this new type of camera would arrive towards the end of 2021.",
    "While that's likely not going to happen, reports of a Canon APS-C RF mount camera are rife, with the oft-reliable Canon Rumors now suggesting that the Japanese camera maker has \"actively been doing market research [...] to see if there's a real demand for such a camera\".",
    "We've already heard of three crop sensor EOS R cameras supposedly in the pipeline – namely the EOS R7, R8 and R9 – that could replace not only the Canon EOS 7D series of DSLRs but also Canon's M-series APS-C mirrorless cameras.",
    "Interestingly, though, the new report suggests Canon has no plans to make RF-S lenses, meaning the company isn't looking at redesigning the RF mount and such a crop sensor camera, if produced, will use existing RF lenses or EF lenses via a lens adaptor.",
    "Nikon has already gone and done it – there are now two APS-C format Z-series cameras in the Z50 and the newly-announced Nikon Z fc. But what's stopping Canon?",
    "So far, the company has kept its two mirrorless lines – EOS M and EOS R – separate, putting in far more resources in perfecting its full-frame mirrorless line-up. If Canon does decide to go down the crop sensor mirrorless pathway, there's a very high chance of the EOS M line being dropped altogether.",
    "In fact, we can even speculate that Canon is already considering doing just that since the last camera to be added to the range – the Canon EOS M50 Mark II – was a disappointing upgrade from the first-gen EOS M50. And it makes a lot of sense for Canon to be concentrating on its full-frame mirrorless system if it's to produce affordable versions of the EOS R and EOS RP, while also adding to the RF lens line.",
    "Then there's the competition from Sony and Fujifilm to consider. Both camera makers have done very well with their APS-C format A-series and X-series cameras respectively, with Canon's M-series falling far behind either brand.",
    "While it's great to have high-specced cameras like the EOS R5, most camera systems are supported by sales of their lower-end models that are a lot more mainstream and accessible. And with DSLRs slowly fading away and no longer the moneymakers for either Canon or Nikon, it makes a whole lot of sense for Canon to consider going down the APS-C RF mount pathway."
  ],
  "headers": {
    "4": "Should Canon make an APS-C EOS R camera?"
  },
  "links": {
    "Canon developing an APS-C format EOS R camera": "https://www.techradar.com/news/canons-developing-a-revamped-eos-r-with-aps-c-sensor-new-report-suggests",
    "Canon Rumors": "https://www.canonrumors.com/there-is-still-discussion-internally-at-canon-about-an-aps-c-eos-r-camera/",
    "heard of three crop sensor EOS R cameras": "https://www.techradar.com/news/canon-eos-r7-and-eos-r8-rumors-hint-at-the-end-for-eos-m-mirrorless-cameras",
    "EOS R7": "https://www.techradar.com/news/canon-eos-r7",
    "Canon EOS 7D": "https://www.techradar.com/reviews/canon-eos-7d-mark-ii-review",
    "Z50": "https://www.techradar.com/reviews/nikon-z50",
    "Nikon Z fc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features",
    "Canon EOS M50 Mark II": "https://www.techradar.com/reviews/canon-eos-m50-mark-ii",
    "EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "affordable versions": "https://www.techradar.com/news/canon-rumored-to-be-launching-the-cheapest-ever-full-frame-camera",
    "EOS R": "https://www.techradar.com/reviews/canon-eos-r-review",
    "EOS RP": "https://www.techradar.com/reviews/canon-eos-rp-review"
  }
}