{
  "source": "https://www.techradar.com/news/eve-online-now-available-natively-on-macos",
  "title": "The best space MMO ever can now be played on Macs",
  "category": "computing",
  "updated": "2021-10-13T11:00:00Z",
  "author": "john-loeffler",
  "summary": "No M1 chip required (though still highly recommended)",
  "article": [
    "One of the best MMO games on the planet is about to get a boost this week after CCP Games released a new native Mac client for their sci-fi hit EVE Online.",
    "The freemium MMO is coming up on its 19th year, but until now there hasn't been a native MacOS client for the game, meaning Mac users would need to rely on virtualization or other workarounds to play the pioneering space RPG.",
    "“Bringing EVE Online to Mac has been a core goal for us at CCP Games,\" Bergur Finnbogason, creative director for EVE Online, said in a statement emailed to TechRadar. \"We’ve worked diligently to improve the game and have collaborated closely with our community to ensure we’re providing the best possible experience to an even wider audience.”",
    "The new Mac client is optimized to take advantage of the new Apple M1 chip, which features an eight-core GPU as part of its architecture, as well as four high performance CPU cores and four efficiency cores, and Apple's Metal API, which lets developers use things like ray tracing in their games.",
    "“With the power of Apple’s M1 chip, Mac users can seamlessly fly into New Eden and enjoy the full EVE Online experience the way it is meant to be played - with great performance and graphics,\" Finnbogason said. \"We can’t wait to welcome a new generation of Mac users to EVE Online.”",
    "Intel-powered MacBooks and iMacs can still get in on the action, however, with the client's minimum spec listed as an Intel Dual-Core CPU running at 2.0GHz, an Nvidia GeForce 320m or Intel HD 3000 GPU, and 4GB RAM. CCP Games recommends that Mac users have at least an Intel Core i5 CPU running at 3.8GHz, an AMD Radeon Pro 580 with at least 4GB RAM or better, and at least 16GB RAM.",
    "EVE Online has one of the most active player bases of any MMO out there and is known for it's Wild West, anything-goes, libertarian ethos, as well as its massive PvP space battles involving upwards of thousands of players piloting ships both massive and miniscule.",
    "If fighting's not your thing, the robust player-driven economy is unlike anything you'll find in other MMOs, with manufacturing, mining, and exploration all offering mostly non-violent career paths for players to experience, though expect to have to fend off the occasional player and NPC pirates as you haul your goods to market.",
    "The client is available now on EVE Online's website",
    "If you're a PC gamer of a certain age, your first computer game was likely Snoopy to the Rescue on the old Apple II, and it's just as likely that that was the last time Apple was considered a major player in the PC gaming scene.",
    "After some rather grim years in the 1990s, the company reestablished itself as a serious professional's go-to computer in the early 2000s, but largely left gaming to Microsoft's various Windows iterations in the process.",
    "That's always been a shame, since most Mac devices have been more than powerful enough to handle many of the most popular PC games, even if not quite at the same level as Windows machines running the best graphics cards.",
    "Thankfully, we're starting to see Apple make a push to get back into the PC gaming market with last year's introduction of the Apple M1 chip. And, if the rumors around the as-yet unannounced Apple M1X chip are any indication, the new 16-inch MacBook Pro we're expecting to see at Apple's October 18 event could be a better gaming laptop than most people realize.",
    "Apple has a long way to go to reestablishing its gaming cred after years of neglect, but here's to hoping that more developers follow CCP Games' lead."
  ],
  "headers": {
    "9": "Analysis: gaming on a Mac is getting easier by the day"
  },
  "links": {
    "best MMO games": "https://www.techradar.com/best/best-mmo-games",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Metal": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4103601167425875000&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fmetal%2F",
    "EVE Online's website": "https://www.eveonline.com/",
    "Snoopy to the Rescue on the old Apple II": "https://www.video-games-museum.com/en/game/Snoopy-To-The-Rescue/37/3/13017",
    "Windows": "https://www.techradar.com/reviews/windows-11",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Apple's October 18 event": "https://www.techradar.com/news/hyperspeed-macbook-pro-2021-coming-next-week-apple-hints-with-invite",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471"
  }
}