{
  "source": "https://www.techradar.com/news/what-time-is-army-of-the-dead-released-on-netflix",
  "title": "What time is Army of the Dead released on Netflix?",
  "category": "entertainment",
  "updated": "2021-05-21T08:23:53Z",
  "author": "samuel-roberts",
  "summary": "You can watch Zack Snyder's movie right now",
  "article": [
    "Update: Army of the Dead is now streaming on Netflix around the world!",
    "Original story: Wondering what time Zack Snyder's Army of the Dead releases on Netflix? The movie lands on the service on May 21, 2021, and is the director's first release on the service. You'll be able to watch it from midnight Pacific time – scroll down and we'll translate that into your local time zone.",
    "Army of the Dead is about an elite unit infiltrating a zombie-infested Las Vegas to try and retrieve a massive score – what they don't count on, though, is the government upping their timetable to level the entire city. Can the group get out before they're killed, either by the undead, or a big explosion?",
    "Dave Bautista stars in this ensemble film, which is a little less serious than Snyder's DC movies, and a lot of fun. If you were a fan of the director's debut, the Dawn of the Dead remake, you're likely to enjoy this.",
    "Here's what time Army of the Dead lands on Netflix.",
    "This is nice and simple – Netflix releases all of its original content at the same time across all regions. So, Army of the Dead will be available to stream on May 21 from midnight PDT / 3AM EDT / 8AM BST / 5PM AEST. Netflix says all original content releases at midnight PT globally as standard.",
    "Since the movie's run time comes in at a hefty 2 hours 28 minutes, it might be a tricky one to watch before you sleep in the US, but other territories get it a little easier.",
    "We think so. Despite that long running time, we thought Army of the Dead was Zack Snyder's best movie yet – and even if theaters are reopening in some countries after a prolonged lockdown, this is basically a big new blockbuster you can watch from home.",
    "You might want to watch it before everyone spoils the best bits with gifs on social media, then."
  ],
  "headers": {
    "5": "What time is Army of the Dead released on Netflix?",
    "7": "Should you watch Army of the Dead this weekend?"
  },
  "links": {
    "Zack Snyder's best movie yet": "https://www.techradar.com/news/army-of-the-dead-on-netflix-is-zack-snyders-best-movie-yet"
  }
}