{
  "source": "https://www.techradar.com/news/mcafee-sells-enterprise-security-business-in-dollar4bn-deal",
  "title": "McAfee sells enterprise security business in $4bn deal",
  "category": "computing",
  "updated": "2021-03-08T19:00:58Z",
  "author": "anthony-spadafora",
  "summary": "McAfee will focus on its consumer cybersecurity business going forward",
  "article": [
    "The cybersecurity giant McAfee has announced that it has entered into a definitive agreement to sell off its enterprise business to the private equity firm Symphony Technology Group (STG) in an all-cash transaction for $4bn.",
    "The sale comes just five months after McAfee went public on the Nasdaq and it plans to become a pure play consumer cybersecurity company going forward. According to McAfee, its enterprise business is a trusted partner for 86 percent of the Fortune 100 firms around the world and last year it brought in $1.3bn in net revenue.",
    "President and CEO of McAfee, Peter Leave provided further insight on the sale in a press release, saying:",
    "“STG is the right partner to continue strengthening our Enterprise business, and this outcome is a testament to the business’ industry-leading solutions and most notably to the outstanding contributions of our employees. This transaction will allow McAfee to singularly focus on our consumer business and to accelerate our strategy to be a leader in personal security for consumers.”",
    "In addition to repaying $1bn of its existing debt, McAfee also expects to use a portion of the proceeds of the sale to pay approximately $175m in customary transaction expenses and other one-time charges. The remaining $2.75bn will be distributed by the company's controlled subsidiary Foundation Technology Worldwide on a pro rata basis to all holders including McAfee Corp.",
    "Until closing, McAfee will continue to conduct and operate its enterprise business while STG and the enterprise business' leadership team work together to plan for a successful transition for the business, its employees and customers.",
    "The enterprise business will then be rebranded when the sale closes by the end of 2021 though it still subject to regulatory approval and closing conditions.",
    "Via VentureBeat"
  ],
  "headers": {
    "4": "Enterprise business"
  },
  "links": {
    "McAfee": "https://www.techradar.com/news/mcafee-why-its-time-to-up-your-mobile-security",
    "Fortune 100": "https://www.techradar.com/news/hundreds-of-gigabytes-of-emails-from-fortune-100-firms-exposed-online",
    "press release": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-1233423418676913000/https://www.mcafee.com/enterprise/en-us/about/newsroom/press-releases/press-release.html?news_id=99600ca9-4df7-41a5-9a0d-63d00b04a625",
    "VentureBeat": "https://venturebeat.com/2021/03/08/mcafee-sells-its-enterprise-cybersecurity-business-to-private-equity-firm-for-4b/"
  }
}