{
  "source": "https://www.techradar.com/news/vpns-are-getting-better-at-streaming-heres-why",
  "title": "VPNs are getting better at streaming - here's why",
  "category": "computing",
  "updated": "2021-05-19T19:42:10Z",
  "author": "mike-williams",
  "summary": "One of the main reasons for getting a VPN is only improving",
  "article": [
    "In the past, unblocking the top streaming sites with a VPN has been nothing short of a usability nightmare. If a service worked at all, it might be only on one or two servers, and you'd left working through the full list to find a location which got you in - Chicago? No. Detroit? No. Miami? No. New Jersey? No...",
    "This inconsistency across locations is a big pain, so we've been keeping a special eye out during our most recent testing to see how bad the problem is in 2021. Even if a streaming VPN has a specialist server for unblocking Netflix, say, we test it at least three times, ensuring we have three different IPs, to get an idea of how reliable its unblocking might be.",
    "More information on using VPNs when you stream",
    "In our most recent round of VPN testing that translated to three checks for each of four core unblocking test sites, across more than 20 VPNs, or over 250 checks in total - so a good sample of what's going on.",
    "As usual, unblocking success rates varied drastically between providers - some were great, others were feeble - but in terms of consistency, our test group scored very well, with only four tests out of 92 where a company got us into a streaming platform with one IP address, but failed with another.",
    "US Netflix proved the greatest challenge, as ever, with three out of 23 providers giving us different results depending on location. BBC iPlayer saw one provider with an issue, while Amazon Prime and Disney+ had no consistency issues at all: we saw the same unblocking success (or failure) with every location we tried.",
    "There's still plenty to do in terms of overall unblocking success - seven of our 23 VPNs failed with at least two streaming platforms - but it's good to see most services deliver such reliable and consistent results. That's a real usability plus."
  ],
  "headers": {
    "3": "Fantastic or feeble?"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "streaming VPN": "https://www.techradar.com/vpn/the-best-vpn-for-streaming"
  }
}