{
  "source": "https://www.techradar.com/news/forget-55-inch-tvs-everyones-buying-massive-oled-tvs-instead",
  "title": "Forget 55-inch TVs – everyone’s buying massive OLED TVs instead",
  "category": "televisions",
  "updated": "2021-05-14T15:11:30Z",
  "author": "henry-st-leger",
  "summary": "65-inch TVs are where it’s at",
  "article": [
    "OLED TVs are all the rage these days, but you may be surprised to hear that it’s the very largest (and therefore most expensive) OLED screens that are proving the most popular.",
    "Market analysts at Omdia (via Business Korea) report that shoppers seem to be moving to even bigger sizes, with sales of OLED TVs in 2020 seeing the traditional flagship size of 55 inches left behind in favor of step-up 65-inch models – the first year on record where that’s happening.",
    "55-inch 4K TVs are the closest thing we have to a ‘standard’ TV size across panel technologies, with OLED, QLED, and LCD ranges alike centering around 55-inch flagships. This latest report, though, shows that the fast-growing appetite for 65-inch TVs is really starting to impact sales figures worldwide.",
    "Specifically, it states that sales of 60-69 inch OLEDs rose to 41.5% of global OLED display sales, just surpassing the 41.4% of 50-55 inch OLEDs. While it’s a small lead, it’s a seismic milestone that shows how our buying habits are changing, and that ever-larger screens are likely set to continue releasing to market to satiate our increasingly maximalist tastes.",
    "It’s not just 65-inch TVs that have seen an uptick, either. Omdia states that OLED TV sales of 80 inches and above – meaning 88-inch 8K OLEDs, and the new 83-inch size being introduced for select models like the LG C1 – are expected to pretty much triple for 2021, with an estimate of over 22,000 units compared to 900 last year. That’s rapid growth for a massive screen size, especially when sporting a premium panel technology such as OLED.",
    "OLED TVs in the 70-79 inch range (essentially 77-inch TVs) are expected to see a 70% uptick in sales this year too.",
    "It’s unclear what this means for LG Display’s foray into ever-smaller OLED TV screen sizes, with the launch of a 48-inch OLED panel that’s been used in the LG CX, Sony A9S, and Philips OLED+935 so far – with even more models set to get a 48-inch option in the coming year. LG Display has confirmed that 42-inch OLEDs are on the way, too, albeit without any confirmed models as of yet.",
    "As appetite keeps moving towards ever larger screens – at least partially driven by even higher resolutions that really justify displays of such large sizes – it’s unlikely that TV makers will be keen to put too much investment into small TVs that pack OLED screens. (Don’t expect a 32-inch TV that pairs OLED and HD resolution, for instance). But the increased variety of OLED panel sizes is only a good thing for consumers, and the expansion isn’t stopping yet."
  ],
  "headers": {
    "4": "Go big or go home"
  },
  "links": {
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Business Korea": "http://www.businesskorea.co.kr/news/articleView.html?idxno=66893",
    "55-inch 4K TVs": "https://www.techradar.com/best/55-inch-4k-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "65-inch TVs": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "48-inch OLED": "https://www.techradar.com/best/48-inch-oled-tv",
    "LG CX": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Sony A9S": "https://www.techradar.com/news/sony-a9s-48-inch-oled-price-specs-and-features",
    "Philips OLED+935": "https://www.techradar.com/reviews/philips-oled935-tv",
    "42-inch OLEDs are on the way": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
    "small TVs": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660",
    "32-inch TV": "https://www.techradar.com/news/television/tv/10-best-32-inch-tvs-in-the-world-today-655660"
  }
}