{
  "source": "https://www.techradar.com/news/make-your-old-car-a-smart-car-for-just-dollar15-with-this-hugely-popular-cyber-monday-deal",
  "title": "Make your old car a smart car for just $15 with this hugely popular Cyber Monday deal",
  "category": "car-tech",
  "updated": "2021-11-27T17:03:11Z",
  "author": "john-mccann",
  "summary": "Bring Alexa to your car for next to nothing",
  "article": [
    "If your current car doesn't lacks smart features like a built-in voice assistant, you can change that for just $15.",
    "Amazon has a whole host of Cyber Monday deals already available, including the Echo Auto which has been reduced from $49.99 to just $14.99.",
    "Modern cars come with a whole host of connectivity features and smart tech, but many of us can't afford a new vehicle, or are still content with what we already drive – but it would be nice to have some level of connectivity available. That's exactly what Echo Auto can offer.",
    "(Not in the US? Scroll down for deals in your region).",
    "Connect Auto to your car and pair it with the Alexa app on your phone and you'll be able to use your voice to make calls, stream music, set reminders, get traffic updates, catch up on news and control your smartphone – all from within your vehicle while on the move.",
    "Echo Auto can be connected to your car's Bluetooth if it has it (via your smartphone) or, for older vehicles, via a cable plugged into the auxiliary port.",
    "No matter where you live, you'll find all the lowest prices for the Amazon Echo Auto from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Echo Auto Cyber Monday deal",
    "6": "More Echo Auto deals",
    "7": "More Cyber Monday deals"
  },
  "links": {
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "$49.99 to just $14.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FEcho-Auto-Add-Alexa-your%2Fdp%2FB07VTK654B%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1081954509999055600-20"
  }
}