{
  "source": "https://www.techradar.com/news/shang-chis-ten-rings-nearly-kept-a-key-part-of-their-original-look",
  "title": "Shang-Chi's Ten Rings nearly kept a key part of their original look",
  "category": "entertainment",
  "updated": "2021-09-17T16:09:52Z",
  "author": "tom-power",
  "summary": "Shang-Chi's Ten Rings almost looked like their comic counterparts",
  "article": [
    "Shang-Chi's Ten Rings weapons were nearly identical to a key part of their original comic book look, according to a member of the movie's VFX team.",
    "Speaking to ComicBook.com, Weta Digital's Sean Walker explained that each of the rings almost had a color palette that was very similar to their comic counterparts.",
    "As Walker revealed, each of Wenwu's Ten Rings attacks, such as when Shang-Chi's father uses them as a whip weapon, had their own individual color scheme so audiences could follow each offensive action as they were wielded.",
    "However, in order to simplify things for viewers, Shang-Chi's VFX team decided not to move forward with that idea. Instead, the choice was made to give distinct color palettes to Shang-Chi and Wenwu, so that audiences could determine which individual was wielding certain rings at any given point.",
    "\"The Ten Rings actually went through a range of color changes,\" Walker said. \"At one point, each individual effect had its individual styled use of the Rings. For example, when Wenwu is creating a bustle out of them, or a whip, or projectiles, they actually had their own unique color scheme, they were all in a similar color palette.",
    "\"But in order to really clearly define this is Wenwu and this is Shang-Chi, we stuck to a much narrower color palette. So Shang-Chi's colors actually mimic his mum's color palette, so we looked to her for her greens and for yellows. Especially in the initial fight between his parents.\"",
    "This isn't the only incident where Marvel decided to change elements for Shang-Chi's live-action debut.",
    "The studio's decision to remove the racially insensitive stereotypes surrounding the character have, naturally, been welcomed by audiences. That includes changing the names of other characters including Wenwu and the mystical dragon known as The Great Protector.",
    "The size of the rings, too, was altered. Historically in the comics, the rings are pieces of jewellery (they're also of alien origin) that the Mandarin wears on his fingers. Each ring allows the Mandarin to wield different powers, such as manipulating objects at an atomic level, project flames or electricity, and alter peoples' thoughts.",
    "In Shang-Chi and the Legend of the Ten Rings, though, the rings are used in unison to create weapons like whips, produce concussive blasts or as projectiles that stun and hurt enemies.",
    "So the removal of the Ten Rings' original colors wasn't much of a stretch for the film's post-production team. As Walker says, if anything, simplifying their color schemes helps audiences to work out which individuals are wielding the Ten Rings at any one time. Giving them individual hues, or using different color shades for specific weapons or abilities, would have been confusing to follow.",
    "It'll be interesting to see if the Ten Rings make future appearances in the MCU. Given Shang-Chi's post-credits scenes, however, they're sure to play some role – and it'll be intriguing to see if those original color palettes end up making it into future Shang-Chi films. After all, he's the only one who can wield them (for now anyway), so there's no need to distinguish between characters who brandish them."
  ],
  "headers": {
    "6": "Analysis: ringing the changes"
  },
  "links": {
    "ComicBook.com": "https://comicbook.com/marvel/news/shang-chi-ten-rings-vfx-looked-entirely-different/"
  }
}