{
  "source": "https://www.techradar.com/news/businesses-unsure-which-tech-is-essential-against-ransomware",
  "title": "Businesses unsure which tech is essential against ransomware",
  "category": "computing",
  "updated": "2021-10-01T10:51:25Z",
  "author": "sead-fadilpasic",
  "summary": "Secure Web Gateway, VPN and Network Access Control are among current top choices",
  "article": [
    "As ransomware attacks grow in numbers, a new report from FortiGuard Labs finds that most organizations are prepared for what’s coming.",
    "Its Global threat landscape report, based on a survey of 455 business leaders and cybersecurity professionals worldwide, claims businesses are deep in employee cybersecurity training, risk assessment plans, and cybersecurity insurance.",
    "However, there is a “clear gap”, in what many respondents see as essential technology solutions for protection, and the technology that can best protect them against the most common intrusion methods.",
    "Based on what the respondents view as essential, organizations seem to be mostly concerned about remote workers and the devices they’re using, as Secure Web Gateway, VPN and Network Access Control are their top choices. Zero Trust, a popular choice, is still an emerging technology, the report states, but should be considered a replacement for traditional VPNs.",
    "The report’s authors found it “most concerning” how segmentation and UEBA (User and Entity Behavior Analytics) weren’t exactly of high importance to the respondents. It describes the technologies as “critical solutions that prevent intruders from moving laterally across the network”, and a key element to identifying intrusions and new malware strains, respectively.",
    "Email gateway was also relatively low on the importance list, despite phishing being reported as a common attack vector.",
    "The poll’s respondents were mostly worried about losing data in a ransomware attack, losing out on productivity, and having operations interrupted. They believe that a solid incident response plan, part of which is cybersecurity insurance, is a good way to mitigate the threat.",
    "For almost half of the respondents (49%) their incident response plan suggests paying the ransom straight away, while for another 25% it depends on the cost. Most of those that paid the ransom eventually got their data back, the report concludes.",
    "“Ransomware grew 1070% year over year. Unsurprisingly, organizations cited the evolving threat landscape as one of the top challenges in preventing ransomware attacks. As evidenced by our ransomware survey, there is a huge opportunity for the adoption of technology solutions like segmentation, SD-WAN, ZTNA, as well as SEG and EDR, to help protect against the threat of ransomware and the methods of access most commonly reported by respondents,” explained John Maddison, EVP of Products and CMO at Fortinet.",
    "“The high amount of attacks demonstrates the urgency for organizations to ensure their security addresses the latest ransomware attack techniques across networks, endpoints, and clouds. The good news is that organizations are recognizing the value of a platform approach to ransomware defense.”"
  ],
  "headers": {
    "4": "Email gateways low on the agenda"
  },
  "links": {
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}