{
  "source": "https://www.techradar.com/news/ipad-pro-2021-and-4-other-gadgets-to-expect-at-apples-spring-loaded-event",
  "title": "iPad Pro 2021 and 4 other gadgets to expect at Apple’s ‘Spring Loaded’ event",
  "category": "tablets",
  "updated": "2021-04-17T06:00:47Z",
  "author": "hamish-hector",
  "summary": "iPads and AirPods could be the highlights",
  "article": [
    "Apple’s ‘Spring Loaded’ event has an official April 20 date, but what could Apple be revealing? Nothing has been officially confirmed so far, but based on rumors and speculation we can create a picture of the Apple tech we’re most likely to see.",
    "Unfortunately, we don't think we’ll see the iPhone 13 until September, so we expect the event to instead focus on a new iteration of the iPad Pro and iPad Mini for 2021. Perhaps new AirPods and Apple TV could be on the cards too.",
    "Here’s our round-up of the most exciting gadgets we might see at Apple’s ‘Spring Loaded’ event, as well as the rumored features we might see each new device come with.",
    "A new iPad Pro for 2021 seems the most likely announcement for the upcoming Apple Spring Loaded event. We’ve seen several leaks pointing to a new entry in the series, and so we’d be more surprised if it didn’t show up.",
    "We recently covered five of the best iPad Pro rumors in a recent round up, where leaks have suggested the next iPad Pro could be powered by a chip that’s “on par” with the M1 - the CPU inside of MacBooks. We might also see it get 5G capabilities and a new kind of display technology called Mini LED.",
    "We might also see a new Apple Pencil 3 launched alongside it, though we don’t know what new functionality the next-gen stylus would include that the Apple Pencil 2 didn’t. We hopefully won’t have to wait long to find out though.",
    "We suspect that the April 20 event will be an iPad launch not just because of the iPad Pro (2021) but because we may see the iPad Mini 6 too. This more entry level range of tablets from Apple last had a new iteration back in 2019 with the iPad Mini 5; two years later we expect a new one.",
    "Unfortunately, there haven’t been many leaks for the iPad Mini 6, though we could finally see the size of the bezels reduced slightly according to leaked images of a dummy model. The iPad Mini 5 had very thick bezels that give the tablet an outdated design.",
    "While nothing has been rumored we’d like to see the iPad Mini 6 get support for the Apple Pencil 2 - which is much more useful than the original though isn’t supported by the iPad Mini 5. We also want the iPad Mini to take on a USB-C port like the iPad Pros have so we can finally stop carrying a Lightning cable around.",
    "Next up we have the Apple AirPods 3; nearly two years have passed since the last iteration, so we think it’s time to see a new version of Apple’s true wireless earbuds.",
    "Taking some design cues from the AirPods Pro, the AirPods 3 are rumored to come with a few nifty features. Ambient light sensors could turn them into health monitoring devices - by shining light through blood vessels you can measure heart rate and measure blood oxygen levels.",
    "In addition, spatial audio looks set to be the AirPods 3’s answer to Dolby Atmos - rather than just giving sounds horizontal direction they’ll incorporate the vertical axis too. The orientation of your head and phone placement would supposedly alter the sound placement too, so you can feel accurately immersed even if you aren’t listening straight on.",
    "While we feel like a new pair of AirPods will release this year, leaks suggest we might have to wait a little longer to see them. Apple Analyst Ming-Chi Kuo stated that Apple AirPods 3 are mostly likely set to sell in Q3 2021, so we could see them announced alongside the iPhone sometime in September - which is usually when a new iPhone is announced.",
    "We last saw a new Apple TV four years ago when the Apple TV 4K launched, and following the release of Apple TV Plus streaming service we think it’s time for a new one.",
    "Again, we don’t know anything for certain but a 6th generation Apple TV would most likely be 4K-capable like its predecessor and is rumored to ship with both a 64GB and 128GB version.",
    "Newer reports suggest the Apple TV (2021) will have a built-in camera and speaker, which in tandem with the Apple TV remote’s microphone could let you FaceTime. Perhaps Apple wants to capitalize on the influx of virtual hangouts since the pandemic started.",
    "If an Apple TV (2021) is announced at all, we’re torn as to whether it will be at Spring Loaded or at WWDC 2021 - which is typically Apple’s major event. So unfortunately you might have to be prepared for disappointment on April 20.",
    "We’ve thought the Apple AirTags would show up at plenty of Apple events over the past few years, and we aren’t going to stop our broken record impression until they’re unveiled.",
    "AirTags would most likely behave like Tile Trackers, where you clip them onto important devices and can later find them if they are lost.",
    "While we don’t know much officially, it’s been rumored the tags will contain chips that interact with nearby iPhones and use ultra-wideband tech. If an Apple user walks past your missing item, it’ll send off a ping and give you an accurate idea of where your item was last seen.",
    "Will Spring Loaded finally give Air Tags time in the spotlight? Be sure to check out our coverage on April 20, 2021, to keep in the know about everything that is announced."
  ],
  "headers": {
    "3": "iPad Pro 2021",
    "6": "iPad Mini 6",
    "9": "AirPods 3",
    "13": "Apple TV (2021)",
    "17": "Apple AirTags"
  },
  "links": {
    "‘Spring Loaded’ event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPad Pro for 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "five of the best iPad Pro rumors": "https://www.techradar.com/news/5-biggest-ipad-pro-2021-leaks-so-far",
    "“on par” with the M1": "https://www.techradar.com/news/new-ipad-pro-2021-might-be-as-powerful-as-the-latest-macs",
    "Apple Pencil 3": "https://www.techradar.com/news/new-apple-pencil-leak-shows-off-the-upcoming-ipad-pro-2021-accessory",
    "iPad Mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "leaked images": "https://www.techradar.com/news/new-ipad-pro-ipad-mini-design-leaked",
    "Apple AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "Ambient light sensors": "https://www.techradar.com/news/future-airpods-could-feature-light-sensors-for-better-health-monitoring",
    "6th generation Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "Tile Trackers": "https://www.techradar.com/news/these-new-tile-trackers-mean-theres-even-less-excuse-for-losing-your-keys"
  }
}