{
  "source": "https://www.techradar.com/news/apple-wants-to-expand-its-ad-empire-even-further",
  "title": "Apple wants to expand its ad empire even further",
  "category": "computing",
  "updated": "2021-04-23T23:00:22Z",
  "author": "anthony-spadafora",
  "summary": "iPhone maker has big plans to grow its nascent advertising business",
  "article": [
    "Apple is planning to expand its advertising business before introducing new privacy rules for iOS that will make it more difficult for rivals in the space.",
    "As reported by the Financial Times, the iPhone maker is planning to expand the number of search ads available on its App Store which developers can use to pay to have their apps listed as the top result.",
    "For instance, if you search for VPN on the App Store, an ad for NordVPN is displayed as the top result while a search for cloud storage displays an ad for Microsoft One Drive.",
    "Apple is now planning to add a second advertising slot to the App Store's search page with the aim of bringing in more advertising revenue. According to one person familiar with the matter that spoke with the news outlet, this new slot will be rolled out by the end of this month and will provide advertisers with a way to promote their apps across the entire App Store as opposed to just when a user searches for a specific app or category.",
    "After rolling out privacy labels for apps in its App Store last year, Apple plans to ban both apps and advertisers from collecting data about its users without their explicit consent when iOS 14.5 is released at the end of April of this year.",
    "As a majority of iPhone users are likely to decline being tracked by advertisers, the new software update could have serious implications for how the mobile advertising industry currently works.",
    "While Apple has said that these changes are intended to improve the privacy of its users, critics have accused the company of trying to give its nascent advertising business a boost. One such critic is Facebook's CEO Mark Zuckerberg who told the financial times that “Apple may say they’re doing this to help people, but the moves clearly track with their competitive interests”.",
    "Facebook and Google are two of the biggest players in the online advertising business at the moment and both companies use data collected on users to serve targeted ads. Apple's iOS 14.5 changes have the potential to hurt the way in which both companies sell ads online.",
    "We'll have to wait until iOS 14.5 arrives to see the impact of Apple's changes but its second advertising slot in the App Store will help the company bring in additional ad revenue regardless of whether or not iOS users choose to opt in to be tracked by advertisers.",
    "Via Financial Times"
  ],
  "headers": {
    "4": "Privacy push"
  },
  "links": {
    "Financial Times,": "https://www.ft.com/content/5527ddd1-77a8-4cd0-82fd-4568be5da80f",
    "App Store": "https://www.techradar.com/news/apple-says-the-app-store-generated-nearly-half-a-trillion-dollars-last-year",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Microsoft One Drive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "privacy labels": "https://www.techradar.com/how-to/how-to-view-the-apple-privacy-labels-in-the-mac-app-store",
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "Mark Zuckerberg": "https://www.techradar.com/news/mark-zuckerberg-wants-facebook-to-be-treated-differently-from-media-organizations",
    "online advertising": "https://www.techradar.com/news/google-is-making-big-changes-to-its-online-advertising",
    "targeted ads": "https://www.techradar.com/news/facebook-now-provides-more-info-about-targeted-ads-and-tools-so-you-can-opt-out",
    "Financial Times": "https://www.ft.com/content/5527ddd1-77a8-4cd0-82fd-4568be5da80f"
  }
}