{
  "source": "https://www.techradar.com/news/how-to-migrate-from-shared-hosting-to-vps",
  "title": "How to migrate from shared hosting to VPS",
  "category": "computing",
  "updated": "2021-05-14T16:55:16Z",
  "author": "desire-athow",
  "summary": "Ready to upgrade from shared hosting to VPS? This guide will walk you through the necessary steps",
  "article": [
    "The majority of hosting clients start their first online experience on a shared server plan. That's less than surprising, considering this is the most affordable option to launch a website, one that easily accommodates startup projects for both individuals and businesses.",
    "But as your website grows and attracts more visitors, naturally, there comes a time for an upgrade.",
    "The market is not shy of possible solutions - VPS, dedicated servers, cloud services. Still, unless some very specific needs arise, virtual servers are the next logical step in your hosting journey.",
    "Before we take a closer look at how to migrate your shared plan to a VPS solution, here are some things you need to know.",
    "VPS Hosting is a specific type of service, where the host splits a physical server into several virtual copies using a process called virtualization. Each of the new instances operates completely independently and receives a dedicated amount of server resources - CPU, RAM, disk space, and bandwidth. Additionally, every user gets their own OS (operating system) and full administrative access to customize the server.",
    "Running a VPS is as close to managing your own dedicated server as you can get. Minus the high prices, of course.",
    "In terms of the scope of the service, we can outline two types of virtual server hosting - managed and unmanaged.",
    "As you can tell by the services included, inexperienced and first-time users naturally prefer the comfort and support stemming from managed VPS plans. On the other side of the spectrum, self-managed deals are mainly preferred by web developers and webmasters with more sufficient server knowledge.",
    "It's great to know you have suitable upgrade options, but when should you consider moving from shared hosting to a VPS?",
    "Some of the alarming signs include:",
    "And that's just scratching the surface.",
    "But when the time comes for a needed upgrade - you have to be prepared to migrate your website.",
    "If you have opted for a self-managed VPS hosting solution, chances are you have to manually transfer your site data from the old to the new account. In such cases, you can follow these simple steps:",
    "1. Create a Site Backup",
    "First of all, you need to copy your website files and associated databases, so you can safely move them to the new server. To do that, log into the control panel with your current host.",
    "For the files, you can utilize an FTP client like Filezilla to connect to your hosting account. Locate your site files (typically in the root folder) and click on the Export option. This will create an archive with your site data.",
    "As for the database(s), you need to find the phpMyAdmin tool in your control panel. Once inside, locate the related database and hit Export. After you verify all information, click Go to finish the process.",
    "If you want to keep your email communication as well, make sure to download your messages through your mail client before you proceed.",
    "2. Set up the VPS",
    "Web hosting providers often cover this step, but self-managed VPS owners might need to go through it regardless. Most hosts utilize the LAMP stack (Linux, Apache, MySQL, PHP), but you are free to configure any other server technology.",
    "Check with your provider about possible options.",
    "3. Upload site data on the new VPS",
    "Now it's time to move the archives from Step 1 to our new virtual server. You can easily do that via a secure SSH connection. All you need is the location of your file backup and the destination on the server. Your commands should look something like this:",
    "scp ~/Downloads/backup_db.sql.gz username@server_ip_address:",
    "scp ~/Downloads/wp-content.zip username@server_ip_address",
    "Alternatively, your FTP client can also do the job.",
    "For easy database restore, head on to the control panel's phpMyAdmin section. Go to New Database and then choose Import. This will allow you to select the database archive from your local machine and upload it to your server.",
    "4. Test everything",
    "Now that you have migrated your shared hosting account to your new VPS, it's time to verify everything is working properly. Try loading your website and testing all associated plugins to ensure nothing failed during the transition.",
    "5. Point your domain DNS",
    "Your website might be fully functional on the VPS platform, but you also have to tell your domain where to find it. To do so, log into the account with your domain registrar and find the option for nameserver change.",
    "Pointing the nameservers is as simple as inputting the ones provided by your VPS provider and saving them. Keep in mind there is a propagation period after such changes, so it might take 24-48 hours for the modification to take full effect globally.",
    "The above steps are great for manual transfer from Shared Hosting to VPS Hosting, but in reality - the host often offers this as a free service, especially if you are upgrading your plan within the same company.",
    "Even if you're moving from another provider, if both support the same control panel solution (often cPanel), the new host shouldn't mind transferring your data. It's a fairly straightforward process, so you can just ask if their support team will be able to assist with the move.",
    "There are enough reasons to switch from Shared to a VPS hosting plan, even if you don't see an immediate need for it. The visible improvement in performance, uptime, and security are not to be taken lightly. Combine that with the limitless scalability and server control, and you can see why this is turning to be one of the most popular hosting services in today's business environment.",
    "As prices for the average VPS plan keep dropping, we might see an even more rising demand for virtual servers.",
    "What is your take on this? Do you think VPS services are taking over? And is your website ready for one?"
  ],
  "headers": {
    "4": "What is VPS hosting",
    "8": "Reasons to upgrade to VPS hosting",
    "12": "How to upgrade from shared to VPS hosting?",
    "32": "How Can Your Hosting Provider Help?",
    "34": "Making the switch"
  },
  "links": {
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "cloud services": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "VPS Hosting": "https://www.techradar.com/news/everything-your-business-needs-to-know-about-vps",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "managing your own dedicated server": "https://www.techradar.com/news/dedicated-server-vs-vps-whats-the-difference",
    "managed and unmanaged": "https://www.techradar.com/news/managed-vs-unmanaged-hosting",
    "migrate your website": "https://www.techradar.com/best/best-data-migration-tools",
    "Filezilla": "https://www.techradar.com/reviews/filezilla",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel"
  }
}