{
  "source": "https://www.techradar.com/news/android-users-scammed-in-their-thousands-by-fake-cryptomining-apps",
  "title": "Thousands of Android users scammed by fake cryptomining apps",
  "category": "computing",
  "updated": "2021-07-08T11:33:59Z",
  "author": "mayank-sharma",
  "summary": "There’s no AI for testing trust",
  "article": [
    "Cybersecurity researchers have discovered a major cryptomining scam, perpetrated via hundreds of Android apps.",
    "Unraveled by the Lookout Threat Lab, the scam tricked over 86,000 people into thinking they are paying for cloud cryptomining services.",
    "The researchers argue that the apps, some of which were listed on the Google Play store, weren’t flagged since they don’t actually appear to do anything malicious.",
    "“They are simply shells set up to attract users caught up in the cryptocurrency craze and collect money for services that don’t exist. Purchasing goods or services online always requires a certain degree of trust — these scams prove that cryptocurrency is no exception,” said Ioannis Gasparis, a mobile application security researcher at Lookout.",
    "In their breakdown of the scam, Lookout notes that all the scam apps can broadly be classified into two distinct app families, namely BitScam and CloudScam.",
    "The BitScam and CloudScam apps advertise themselves as providing cloud cryptocurrency mining services for a fee.",
    "The majority of BitScam and CloudScam apps were paid apps, and furthermore also offered paid subscriptions and commercial services related to crypto mining.",
    "After carefully analyzing the apps, the Lookout researchers found that no cloud crypto mining actually takes place, and the scammers simply pocketed the money their victims spent on the apps and paid upgrades, with over $350,000 thought to have been generated.",
    "In all, Lookout identified more than 170 apps. While a majority of these were sideloaded from third-party app stores, 26 were available for download on Google Play, but have now been removed."
  ],
  "headers": {
    "4": "Caveat emptor"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "cryptomining": "https://www.techradar.com/best/mining-rigs",
    "Android apps": "https://www.techradar.com/best/best-android-apps-2021",
    "cloud cryptomining": "https://www.techradar.com/best/mining-motherboards",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "breakdown of the scam": "https://blog.lookout.com/lookout-unearths-android-crypto-mining-scams"
  }
}