{
  "source": "https://www.techradar.com/news/whatsapp-wants-to-let-you-search-for-businesses-within-its-app",
  "title": "This WhatsApp update is adding a super helpful online shopping tool",
  "category": "computing",
  "updated": "2021-09-16T16:22:27Z",
  "author": "rob-clymo",
  "summary": "You'll soon be able to find shops within WhatsApp",
  "article": [
    "WhatsApp is set to introduce a new update that will let users find and search for shops and other e-commerce businesses within the app itself.",
    "It’s a first for the Facebook-owned messaging service and forms part of an evolving strategy by the social media giant to boost e-commerce revenues.",
    "The search option is currently undergoing testing in Brazil ahead of a planned global rollout, looking to give WhatsApp users quick and easy access to shops and services via a directory contained within the app.",
    "Business owners will doubtless warm to the new initiative as it will allow them to become more visible, directly from inside WhatsApp. Unlike Facebook and Instagram, WhatsApp has never run ads in its software. Up until now, businesses have been forced to put their WhatsApp number in other places, such as promotional packaging or their e-commerce websites.",
    "More recently though, WhatsApp has developed and introduced more tools to help businesses sell their products and services through the hugely popular social media outlet. There’s now a specialized app for small businesses along with an API that allows larger companies to tailor WhatsApp integration into their own business systems. Adding the component parts together could help businesses improve their turnover and also generate revenue for Facebook.",
    "With demand for e-commerce retail proving to be stronger than ever it comes as no surprise to see Facebook continuing to develop its online selling tools. In-app shopping possibilities have grown across the social media platform’s apps with, as an example, Facebook Shops being rolled out to more countries recently. WhatsApp now also features shopping tools including product catalogs and shopping cart options for businesses to use.",
    "The current level of testing remains limited to the Sao Paulo area, with several neighborhoods there validating the business potential across a range of categories including food, retail and local services. India and Indonesia are penciled in as the next countries on the list, where WhatsApp will continue to test the new feature.",
    "However, having previously faced criticism for confusion over privacy updates, WhatsApp has been keen to stress that it will not know or store the location of search results carried out by consumers."
  ],
  "headers": {
    "4": "Business search"
  },
  "links": {
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Facebook": "https://www.techradar.com/news/facebook-adds-new-shop-feature-to-its-app",
    "Instagram": "https://www.techradar.com/how-to/how-to-use-instagram-from-first-snap-to-influencer-status",
    "e-commerce websites": "https://www.techradar.com/news/best-ecommerce-hosting",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "small businesses": "https://www.techradar.com/best/best-small-business-software",
    "business systems": "https://www.techradar.com/best/best-business-phone-system",
    "e-commerce retail": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Facebook Shops": "https://www.techradar.com/news/facebook-shops-is-coming-to-whatsapp-and-instagram",
    "shopping cart": "https://www.techradar.com/best/best-shopping-cart-software"
  }
}