{
  "source": "https://www.techradar.com/news/gta-san-andreas-remastered-5-things-we-want-to-see",
  "title": "GTA San Andreas Remastered: 5 things we want to see",
  "category": "gaming",
  "updated": "2021-08-13T16:30:43Z",
  "author": "henry-st-leger",
  "summary": "The classic GTA game may be coming back, and we have questions",
  "article": [
    "A remastered trilogy of Grand Theft Auto games looks to be coming to current-gen consoles, with Grand Theft Auto 3, Grand Theft Auto: Vice City, and Grand Theft Auto: San Andreas all set to be included.",
    "While rumors have been circulating for a while now, Kotaku seems to have got confirmation from some inside sources that these remastered classics will be landing on PS5, Xbox Series X and even Nintendo Switch, with a mix of “new and old graphics” that retains the feel of the original titles while likely making them a bit easier on the eyes for modern audiences.",
    "It’s San Andreas, though, that seems to be attracting the most attention – which isn’t a surprise. It was critically acclaimed on release, and is frequently referred to as one of the best games of all time – even if the violence, gangster tropes, and sexual cutscenes offer plenty of fodder for the series’ detractors.",
    "Its freeing open world managed to do without loading screens (interiors aside), giving a sense of scale and freedom to its crime-ridden city well before Breath of the Wild landed on the scene. It was also the first GTA game to introduce the light RPG features that are so normal in the series today, allowing you to customize your character’s appearance and train them in specific skills.",
    "With GTA San Andreas remastered likely on the way, then, we asked ourselves what we really wanted to see from the updated classic – given we don’t know how long it’ll be until GTA 6 – and how Rockstar could really improve on a game that’s already a near-perfect realization of the GTA formula.",
    "What's aged the worst about the PS2 GTA games is their unpredictable difficulty settings. Some missions are much harder than others – and the series is notoriously stingy on checkpoints, instead letting you die and take a cab back to the mission location to start again in Vice City and San Andreas. Some optional checkpoints that just quickly restart the mission and give CJ the same inventory, would be most welcome in this game.",
    "Purists hate adding difficulty settings to old games, but San Andreas could really use them. It'd be nice to control in-game parameters like how deadly the NPCs are, or how much health CJ has, or how generous ammo pick-ups are in-game. This seems unlikely if Rockstar is simply going to preserve what made the PS2 games what they were – but it might help mitigate the parts of the game that have dated poorly, like the frantic, messy shooting controls. They were fine for 2004, but in a post-cover shooter era they'll be hard work unless you can do something to make the game a little easier.",
    "GTA's music rights restrictions are the bane of these older games – hence how Vice City's current digital re-releases don't feature Michael Jackson's 'Billie Jean', a fundamental part of how that game starts. San Andreas was dinged by missing music in later releases, too, with the likes of Rage Against the Machine's 'Killing in the Name of' and NWA's 'Express Yourself' removed from the game. No re-release would be complete without all those songs coming back.",
    "If there’s one valid criticism that can be leveled at Rockstar’s titles in general, it’s that its games tend to feature heavy, sometimes unresponsive controls. GTA 5 and Read Dead Redemption 2 are both guilty of making your character feel like you’re handling an immovable object at times, so it would be great if GTA San Andreas Remastered corrected this long-running complaint. It’s possible to make a character’s movement feel realistic without a needless amount of input lag, so if Rockstar can fix this, the game will be a lot more fun to play as a result.",
    "The San Andreas experience wouldn’t be complete without a return of the game’s many cheat codes, letting hardened fans reuse their favorite shortcuts for health, cash, or early access to weapons. Here’s a tip, though – while ‘STICKLIKEGLUE’ will largely take the wheel while you’re driving, the game’s probably a bit more fun if you let yourself crash into the odd thing."
  ],
  "headers": {
    "5": "1. Checkpoints",
    "6": "2. An optional difficulty slider",
    "7": "3. The original music",
    "8": "4. More responsive controls",
    "9": "5. Returning cheat codes"
  },
  "links": {
    "Grand Theft Auto games": "https://www.techradar.com/news/best-gta-games",
    "Kotaku": "https://kotaku.com/the-gta-remastered-trilogy-appears-to-be-real-and-comi-1847474620",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6"
  }
}