{
  "source": "https://www.techradar.com/news/how-to-watch-romeo-and-juliet-online-stream-1996-leonardo-dicaprio-movie-anywhere",
  "title": "How to watch Romeo and Juliet online: stream 1996 Leonardo DiCaprio movie anywhere",
  "category": "computing",
  "updated": "2021-02-14T05:53:43.140Z",
  "author": "aatif-sulleyman",
  "summary": "Baz Luhrmann's neon adaptation of Shakespearean tragedy arguably best ever",
  "article": [
    "The movie that catapulted Leonardo DiCaprio and Claire Danes into stardom, Baz Luhrmann's unapologetically brash, topsy-turvy 1996 adaptation of Romeo and Juliet divided audiences and critics alike at the time, but over the years it's established itself as a classic in its own right. From John Leguizamo's sideburns and Paul Rudd's dad dancing, to Romeo and Juliet's achingly tender moments together, what's not to love? Read on as we explain how to watch Romeo and Juliet online and stream the movie, wherever you are in the world right now.",
    "The most famous love story in Western theatre has been done to death and then some, but of the countless interpretations it's Luhrmann's almost offensively neon depiction that stands out as the biggest and most memorable of all.",
    "The Montagues and the Capulets are reimagined as rival mafia empires, with gunfights and scuffles between the warring factions a regular occurrence in the battleground city of Verona Beach.",
    "Hostilities boil over when the tearaway Tybalt (John Leguizamo), Juliet's cousin, and Romeo's best friend Mercutio (Harold Perrineau) experience the full force of each rival families' hatred, with a lovestruck Romeo caught in the middle, making a secret love affair that was always going to be tricky to explain to the parents a very dangerous game indeed.",
    "The ensemble cast also features Miriam Margolyes as Juliet's nanny, and the late, great Brian Dennehy and Pete Postlethwaite as Romeo's father and Father Laurence respectively. We all know how the story goes, so that's all we'll say for now - here's how to watch Romeo and Juliet online from anywhere.",
    "Unfortunately, if you’re out of your country of residence for whatever reason, then geo-blocks will prevent you from connecting to your streaming services and content back home.",
    "Luckily, there’s a simple fix. Downloading a VPN will let you to change your IP address to that of any country in the world: meaning you can access your preferred VOD platform online from anywhere – just like you would in your own living room.",
    "Use a VPN to watch Romeo and Juliet online from anywhere"
  ],
  "headers": {
    "5": "How to watch Romeo and Juliet from outside your country",
    "8": "How to watch Romeo and Juliet in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}