{
  "source": "https://www.techradar.com/news/anomymous-returns-with-another-huge-epik-data-dump",
  "title": "Anomymous returns with another huge Epik data dump",
  "category": "computing",
  "updated": "2021-10-04T23:00:38Z",
  "author": "anthony-spadafora",
  "summary": "Latest leak reportedly contains private documents from the Republican Party of Texas",
  "article": [
    "The hacktivist collective Anonymous is back yet again with even more data from the web hosting company Epik and this latest leak contains data on the Republican Party of Texas.",
    "In a press release titled “You Lost The Game”, Anonymous revealed that its Operation Epik Fail isn't over yet and part three of the operation contains even more data stolen from the controversial web host.",
    "Publisher of Protean Magazine and independent journalist Steven Monacelli explained in a tweet that this latest leak “appears to be a backup of the Texas GOP server and includes sensitive documents, a database, and more”.",
    "Anonymous first began targeting Epik after the Texas Heartbeat Act which places severe restrictions on when a woman can have an abortion was signed into law last month. This is because the anti-abortion group, Texas Right To Life, turned to Epik as its new domain registrar after losing hosting on GoDaddy.",
    "With the release of this latest data dump, Anonymous has leaked data from Epik three times now and at the moment, it's still unclear as to whether or not the group is done leaking data from the web host.",
    "Operation Epik Fail was first revealed by the group on September 13 when it confirmed that it had breached Epik with the leak of 180GB of sensitive data on its customers. Anonymous then followed up on this first leak on September 30 when it released “The /b/ Sides” which contained more than 300GB of data including bootable disk images of Epik's servers.",
    "While these leaks have certainly hurt Epik's reputation further, many of its customers have also faced repercussions. According to the Daily Dot, a real estate agent in Florida lost her job after registering a number of anti-Semitic domains, a man running websites related to the Proud Boys of Canada was placed under investigation by his employer and other Epik customers have now had their online activities exposed.",
    "We'll have to wait while journalists and researchers verify the data from Anonymous' latest data dump but if this leak is anything like the ones that came before it, the Republican Party of Texas could end up being in even more hot water over its controversial anti-abortion bill.",
    "Via Daily Dot"
  ],
  "headers": {
    "4": "Operation Epik Fail"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Epik": "https://www.techradar.com/news/epik-ceo-attempts-to-hit-back-on-breach-rumors",
    "Operation Epik Fail": "https://www.techradar.com/news/why-anonymous-leaked-decades-worth-of-data-from-the-web-host-epik",
    "tweet": "https://twitter.com/stevanzetti/status/1445026621572980739",
    "Texas Right To Life": "https://www.techradar.com/news/godaddy-boots-texas-abortion-whistleblower-website",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "The /b/ Sides": "https://www.techradar.com/news/anonymous-has-leaked-another-cache-of-epik-user-data",
    "Daily Dot": "https://www.dailydot.com/debug/anonymous-texas-gop-epik/"
  }
}