{
  "source": "https://www.techradar.com/news/motorola-debuts-a-new-cheap-5g-phone-ahead-of-ces-2021",
  "title": "New Moto G phones revealed, plus a new cheap 5G phone for CES 2021",
  "category": "phones",
  "updated": "2021-01-08T14:00:39Z",
  "author": "david-lumb",
  "summary": "Motorola's four-phone CES 2021 lineup includes a new Moto G Stylus",
  "article": [
    "Motorola has announced a new series of smartphones that it is debuting ahead of this year's virtual CES 2021, and there’s a phone for every budget in its new G family of devices.",
    "The new phones include the brand new Motorola One 5G Ace, which is a mid-range handset and the Moto G Stylus 2021. There's also the Moto G Play and Moto G Power, which are US focused releases of the Moto G9 Play and Moto G9 Power.",
    "Those two slightly different versions of the Moto G9 handsets have some alterations to reach certain price points.",
    "The Motorola One 5G Ace is a more affordable iteration on the Motorola One 5G, trading storage space (it comes with 64GB rather than its predecessor’s 128GB) and shedding a depth sensor for a lower price: $399 (around £294 / AU$514) compared to the older One 5G’s $444.99 (£349, about AU$635) pricetag.",
    "That makes the One 5G Ace one of the most affordable handsets to connect to 5G, with a Snapdragon 750G chipset, 6GB of RAM (in the US version), a triple rear camera (48MP main/8MP ultra-wide/2MP macro), and 5,000mAh battery.",
    "Then there's the new Moto G Stylus, which is a refined but not renamed version of the first G Stylus (known as the Moto G Pro in some regions) that debuted in 2019.",
    "The 2020 edition has a larger 6.8-inch Full HD Plus display (presumably LCD like its predecessor), Snapdragon 678 chipset, the same-size 4,000mAh battery, and a similar triple rear camera array (48MP main, 8MP ultra-wide, 2MP macro).",
    "While those are minor, there are improvements to the stylus software, too, like a split-screen feature to sketch in Moto Note while another app is open. The G Stylus costs $299 (around £220 / AU$386).",
    "Then there's the two phones that are similar to the Moto G9 Play and Moto G9 Power seen in other regions.",
    "The Moto G Power’s 5,000mAh battery is noticeably smaller than the Moto G9 Power’s 6,000mAh battery. The former is essentially a US version of the latter, with a bit lower specs (starting 32GB of storage and a 48MP main camera instead of 128GB storage and a 64MP main camera). But the G Power is still a battery powerhouse that starts at $199 (around £146 / AU$), which is somewhat cheaper than the Moto G9 Power’s £179 pricetag.",
    "The Moto G Play is Motorola’s new super-affordable smartphone, with a 6.5-inch HD Plus (720p) display running a Snapdragon 460 chipset, 32GB of storage, 3GB of RAM, and a 13MP rear camera with a 2MP depth sensor paired with a 5MP selfie camera – and a 5,000mAh battery.",
    "That’s less powerful than the Moto G9 Play released in other regions back in August, which packs a Snapdragon 662 chipset, 64GB of storage and 4GB of RAM, a 48MP main and 2MP macro cameras. But the Moto G Play should be notably cheaper with a list price of $169 (around £124 / AU$217), which is cheaper than the G9 Play’s £159 (roughly $210, AU$290) pricetag.",
    "All four phones are up for preorder and will be released in the US on January 14 at major outlets including Best Buy, Walmart, Amazon, and Motorola.com. Carriers such as AT&T, Verizon, T-Mobile, Google Fi, and various MVNOs will begin offering the device in the coming months, according to Motorola.",
    "We've yet to hear availability for the Motorola One Ace 5G or Moto G Stylus in the UK or Australia, but we've asked Motorola for information and we'll update this article when we hear more on those new handsets."
  ],
  "headers": {
    "8": "Two more phones"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Motorola One 5G Ace": "https://www.techradar.com/reviews/motorola-one-5g-ace-review",
    "Moto G9 Power": "https://www.techradar.com/reviews/moto-g9-power-review",
    "Moto G9": "https://www.techradar.com/news/moto-g9-series",
    "Motorola One 5G": "https://www.techradar.com/news/motorola-one-5g-packs-four-rear-cameras-and-5g-connectivity-for-under-dollar500",
    "Moto G Pro": "https://www.techradar.com/reviews/moto-g-pro-review"
  }
}