{
  "source": "https://www.techradar.com/news/legend-of-zelda-skyward-sword-joy-cons-in-stock",
  "title": "Legend of Zelda Skyward Sword Joy-Cons in stock at GameStop – how to buy them",
  "category": "gaming",
  "updated": "2021-07-16T17:23:04Z",
  "author": "nick-pino",
  "summary": "Here’s where you can snag a pair of Zelda Joy-Cons",
  "article": [
    "The Legend of Zelda Skyward Sword Joy-Cons are a hot commodity. The game and the Joy-Cons dropped on Nintendo Switch on July 16 and retailers have already sold through all their stock.",
    "Well, almost all of them.",
    "As of 12pm EDT, GameStop still has a few in stock for the regular retail price of $79.99 and you can get free two-to-five day shipping. Right now, that’s the place to snag them.",
    "Other retailers like Amazon, Best Buy, Target and Nintendo itself also have store pages setup for the Joy-Cons (links down below) but they’re currently out of stock with no indication of when they’ll be available.",
    "Last and very much least, don’t buy them from Walmart right now as you’ll be buying them from a third-party vendor who’s currently charging double the regular MSRP.",
    "Well, they're popular right now because it's the launch of Skyward Sword HD, one of the most anticipated releases on Nintendo Switch this year. Combine that with the fact that they also look pretty cool and you've got a recipe for a sell out.",
    "In terms of aesthetics, the Joy-Cons are two shades of blue and adorned with the Hylian Crest and Triforce on the right Joy-Con. They don't necessarily act any differently from the regular Joy-Cons you already have - but they're certainly eye-catching and a fun accessory for Zelda fans.",
    "The other good news? They should be compatible with the new Nintendo Switch (OLED) when that launches in October."
  ],
  "headers": {
    "5": "Why are they in such high-demand?"
  },
  "links": {
    "GameStop": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24348&u1=trd-us-4249736874246873000&murl=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fnintendo-switch%2Faccessories%2Fcontrollers%2Fproducts%2Fnintendo-switch-joy-con-l-r-the-legend-of-zelda-skyward-sword%2F11118951.html%3F",
    "Nintendo Switch (OLED)": "https://www.techradar.com/reviews/nintendo-switch-oled-review"
  }
}