{
  "source": "https://www.techradar.com/news/netflix-vs-amazon-prime-video-2021",
  "title": "Netflix vs Amazon Prime Video: which streaming service is winning in 2021?",
  "category": "entertainment",
  "updated": "2021-08-21T09:00:39Z",
  "author": "samuel-roberts",
  "summary": "Comparing the two big hitters in streaming",
  "article": [
    "Streaming services have never been a bigger part of our lives. Lest year, most of us went through the same pattern of burning through TV shows and movies until we either exhausted Netflix's library or just couldn't stand to sit in front of our TVs any more – and that habit is now deeply ingrained in 2021.",
    "26% of US TV time is now spent watching streamers, according to a Nielsen report. In the UK, by September 2020, 60% of households were signed up to some kind of streamer, versus 49% a year earlier, according to Ofcom. More than half of UK households are signed up to Netflix alone, and almost twice as much time was spent watching these services year-on-year.",
    "Netflix and Amazon Prime Video are the main paid-for streaming services to most people. Netflix introduced the concept of in-home streaming of premium content to a lot of us, while Prime Video is seen as the main benefit to signing up to the online retailer's membership plan.",
    "In user reach, they're actually comparable. Netflix has 209 million users, as of July, while over 175 million of Amazon Prime Video's 200 million+ users had streamed content within the past 12 months leading up to April 2021. They truly are the market leaders, as it stands.",
    "But which one is actually better in 2021? Which app experience comes out on top, and which is making better original content right now? Below, we'll put them head-to-head for your benefit.",
    "Netflix's Standard plan costs $13.99 (£9.99 / AU$15.99) per month, while the Premium plan with Ultra HD content costs $17.99 (£13.99 / AU$19.99) a month. There's a cheaper basic tier for $8.99 / £5.99 / AU$11.99, but since that comes without HD streaming, it's not one we'd recommend unless you're on a budget.",
    "Lots of Netflix content is available in 4K – the majority of its originals, for example, but also some movies and shows sourced from elsewhere (if you're in the UK, that includes Spider-Man: Far From Home). You can search '4K' on Netflix's app in your region, which reveals which ones are streaming in UHD, even if that's not part of your tier.",
    "Amazon Prime costs $12.99 / £7.99 / AU$6.99 per month, with discounts if you pay yearly. You can also get Prime Video by itself for $8.99 / £5.99, but given that the price difference is minimal in the UK, the main membership tier is the better choice in that region (there's no such option in Australia). Prime membership gets you expedited delivery from Amazon, not to mention other benefits around reading and gaming.",
    "Prime Video offers a decent helping of 4K content, too, as part of the subscription package, with lots of originals covered. You don't have to pay extra to access this, though, unlike with Netflix. You'll find the appropriate tags '4K UHD' and 'HDR' on different pages – if you want to watch The Boys or Chris Pratt action movie The Tomorrow War in 4K, for example, you're in luck.",
    "Unlike Netflix, Prime Video is set up to try and sell you channels that offer extra content for a monthly fee – usually grouped by theme or genre (Shudder), or by rights holder (Paramount Plus and Starz in the US). It's less aggressive at selling these than it used to be, thanks to the 'Free to Me' tab or relevant button in the app, but clearly Amazon wants you to see Prime Video as the base on which to stream lots of other stuff. Which, of course, includes videos sold or made available for rent by Amazon in its own video store.",
    "Price-wise, then, Amazon definitely looks better on paper. But Netflix's app experience and original content mean it's not a straightforward battle.",
    "Netflix's algorithmic recommendations aren't to everyone's liking, but they demonstrate just how considered Netflix's app is overall compared to Prime Video. The streaming app, after all, is Netflix's whole product – for Amazon it's one part of a wider membership program, albeit a key one.",
    "The truth is, both apps get better every year. Netflix's options now include wacky stuff, like having the choice to to watch a show at a slower or faster speed – we don't want to generalize, but you shouldn't trust anyone who's watching The Crown at 1.5x the normal speed. It's the queen. Show a bit of bloody respect!",
    "It's a blessed relief that both the Prime Video and Netflix apps on mobile now let you remove stuff from your recently watched section. No longer will you punished for watching five minutes of an embarrassing erotic thriller, or Marvel's Iron Fist.",
    "Still, Netflix comes out on top when it comes to using its app. Prime Video still feels like a reformatted store front in how it's presented – and yes, clearly Amazon wants you to spend extra money on the service, whether it's through a limited time cheap rental or subscribing to an extra channel. It's just a lot better at delineating this paid-for content than it used to be.",
    "Netflix, by comparison, feels like shutting the world out when you boot it. It's the antithesis to the live TV world of obnoxious adverts, which is why it's such a pleasant app to use – and surely a large part of why it remains so popular. Netflix clearly wants you to try different shows and movies in how it displays content on its homepage, and if you permit it, the service won't be shy about sending you notifications or emails about things to watch. The app lets you switch off autoplaying trailers if you log in via your browser – that's an absolute must for peaceful browsing.",
    "There are other quirks to bear in mind between the different apps. Amazon's customizable subtitles options are excellent in terms of accessibility – but not everything it streams has subtitles, at least in the UK where we're writing this. Point Break? Nope. 21 Grams with Naomi Watts? Nope. Gangs of New York? Nope. What We Do in the Shadows? Nope. JFK? Nope. That's just a handful of big movies we've found from scanning around, and they're fairly obvious omissions.",
    "Netflix seems more consistent with offering subtitles, though again, this is just based on a cursory glance at similar types of movies.",
    "Netflix wins outright when it comes to quantity of original content – and, honestly, on quality as well. Netflix's spend on TV, movies and documentaries is absurd, and the frequency of releases means there are new things to watch every week, even if sometimes that's just an animated series you don't care about or a boring romcom aimed at teenagers.",
    "Amazon definitely has a lot of originals, and plenty of movies badged as exclusives, but Netflix is still splashier in terms of big new content. Still, Amazon Prime has showed multiple times it can make an impact with big movies – Coming 2 America and The Tomorrow War with Chris Pratt are two of the platform's monster hits.",
    "A large part of the value of both services depends on where you live. In the UK, for example, Amazon Prime Video and Netflix are both excellent for older movies. Netflix may have the added advantage of a new original movie every week in 2021 – even if they're a mixed bag, as ever – but Amazon Prime Video always has a vast library of movies to enjoy regardless. The same handfuls of popular '80s, '90s and '00s movies tend to move between the two streamers and Sky in the UK.",
    "In the US, there's a lot more competition, meaning you might find better older movies spread out between the two services and HBO Max, among others.",
    "Netflix is not having its hottest year so far in 2021 for returning TV shows – and you sense it knows it, which is maybe why it's been announcing so many release dates far in advance this year for shows like The Witcher, Cobra Kai or Locke and Key.",
    "The problem is, in the time before the pandemic, Netflix already had long year-plus breaks between seasons of shows like Ozark or Stranger Things, rather than the traditional one-year break of network shows.",
    "Now, that more languid release schedule has come back to bite it in the ass a bit, because combined with pandemic-induced production delays, it means some of these series have had a very slow journey back to your living room.",
    "Stranger Things season 4 is now going to arrive at least two-and-a-half years after season 3, for example. The Witcher season 2 will have taken a whole two years to reach our screens, by the time it arrives.",
    "Still, when Sex Education season 3 kicks off in September, it should mark the start of an avalanche of new, exciting stuff from the streamer.",
    "Netflix has still put out plenty we like in 2021, though. Bo Burnham's Inside is the most acclaimed comedy special of the year – if you can even call it a comedy. Animated series Castlevania ended in style. Lupin is another example of Netflix turning a non-English language series into a massive worldwide hit. Sketch show I Think You Should Leave with Tim Robinson is beloved by those who click with its type of humor. Comic book adaptation Sweet Tooth clearly hit the mark.",
    "The lack of some of Netflix's big TV hitters means Amazon has actually impressed us this year with what it's been putting out by comparison. We'd take Invincible over most of Netflix's series in 2021 – it's a stab at an adult superhero animation that genuinely worked and captured people's imaginations, without the in-built advantage of being based on a Marvel or DC comic.",
    "Netflix's own stab at superheroes, Jupiter's Legacy, didn't catch fire in the same way.",
    "The Underground Railroad, the latest work from Barry Jenkins that's available exclusively on Amazon Prime Video, is the most acclaimed series of the year so far. So Amazon is actually having a pretty solid year, even without its own hits like The Boys and The Marvelous Mrs Maisel, which are both expected to return in 2022.",
    "Both streamers, then, are still experiencing the effects of 2020's pandemic shutdowns – but by the end of 2021, both will have had their fair share of breakout hits.",
    "You can cancel your subscription for both Netflix and Amazon Prime Video at any time, which is a blessed relief. But your opinions on each might change over the next few years as streamers enter the next phase of their content war – and this is where the bets are about to get much bigger.",
    "Amazon, fresh off the success of The Boys and Invincible, is doubling down on genre TV. The Wheel of Time, The Lord of the Rings and the Stranger Things-like Paper Girls are all set to make a big splash on the service when they arrive – as is a reboot of Mr and Mrs Smith starring Donald Glover and Phoebe Waller-Bridge.",
    "Clearly, the retailer's strategy is leaning towards attention-grabbing shows, rather than offbeat series like Mozart in the Jungle or Red Oaks that originally defined its output. On the movie side, it's bought the movie studio MGM, subject to approval, which means that streaming James Bond should soon be available, and it's making a sequel to The Tomorrow War (may we suggest calling it The Day After Tomorrow War?). These are massive, game-changing moves – MGM essentially gives Amazon a permanently robust movie library overnight that it can roll out across the world.",
    "Netflix, meanwhile, has so much to come – follow-up seasons to the likes of Bridgerton and The Witcher will be huge. We wouldn't be surprised to see both become sprawling franchises over the coming years.",
    "It's also got big animated adaptations like Cowboy Bebop and The Last Airbender in the works, and more shows you'll definitely want to add to your Watch List. Ryan Murphy's Monster: The Jeffrey Dahmer Story starring Evan Peters seems certain to be a massive hit. Game of Thrones creators David Benioff and D.B. Weiss are working on The Three-Body Problem, a Netflix sci-fi adaptation. A Resident Evil show starring Lance Reddick is in the works.",
    "This is just scratching the surface – and on the movie side, of the many things you've got to look forward to, the Russo brothers' Bond-esque spy thriller film The Gray Man with Ryan Gosling and Chris Evans is probably the big one.",
    "All of this should mean your subscription fees aren't wasted in the near future, whoever you back.",
    "If you can only afford one, it's Netflix. If you can afford two, it's both.",
    "The truth is, Amazon Prime membership is so reasonably priced for its range of benefits that you might not even think of it as a streaming service subscription. Netflix, though, with its prices creeping above $10 / £10 / AU$10 a month, requires a more considered purchase.",
    "Netflix is still where so much of the TV we love is landing – even if 2021 has been a quieter year so far. Amazon Prime Video still feels like a secondary streaming service for us, in a lot of ways, and even with its prices creeping up, Netflix always has something to pique our interest.",
    "In a year's time, though, who knows? Maybe Amazon's big investments in an entire movie studio and a series based on the works of JRR Tolkien will put it in pole position.",
    "For now, Netflix's investment in content is paying off. But Amazon seems unlikely to settle for second place."
  ],
  "headers": {
    "5": "Netflix vs Amazon Prime Video: pricing and value",
    "11": "Netflix vs Amazon Prime Video: app experience",
    "18": "Netflix vs Amazon Prime Video: content",
    "32": "Netflix vs Amazon Prime Video: the future",
    "39": "Netflix vs Amazon Prime Video: who wins?"
  },
  "links": {
    "Nielsen report": "https://www.cnbc.com/2021/06/17/nielsen-streaming-makes-up-only-26percent-of-time-spent-in-front-of-tv.html",
    "Ofcom": "https://www.ofcom.org.uk/about-ofcom/latest/media/media-releases/2021/brits-spend-a-third-of-2020-watching-tv-and-video",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Cobra Kai": "https://www.techradar.com/news/cobra-kai-season-4",
    "Locke and Key": "https://www.techradar.com/news/locke-and-key-season-2-release-date-netflix",
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4",
    "Jupiter's Legacy": "https://www.techradar.com/news/jupiters-legacy-is-the-subversive-superhero-tv-show-netflix-needs-right-now",
    "The Wheel of Time": "https://www.techradar.com/news/amazons-the-wheel-of-time-season-1-release-date-cast-plot-trailer-and-more",
    "The Lord of the Rings": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "Bridgerton": "https://www.techradar.com/news/bridgerton-season-2-first-look-and-what-we-know"
  }
}