{
  "source": "https://www.techradar.com/news/paypal-plans-to-let-you-withdraw-alternative-funds-to-other-users-and-beyond",
  "title": "PayPal plans to let you withdraw alternative funds to other users and beyond",
  "category": "computing",
  "updated": "2021-05-27T09:18:04Z",
  "author": "rob-clymo",
  "summary": "Payments platform is boosting its ambitions for working with alternative currencies",
  "article": [
    "PayPal looks all set to make the use of alternative currencies such as Bitcoin by its users much easier by offering support for third-party wallet transfers.",
    "The payments company had recently revealed that its users would be able to buy and sell cryptocurrency using its platform, and has also integrated the option of adding Bitcoin buying into its Venmo service too.",
    "In a move that could help to tie it all together, PayPal has now announced that it will allow its customers to send Bitcoin to other users of both PayPal and Venmo, along with being able to move amounts to other services such as Coinbase along with outside crypto wallets.",
    "“We want to make it as open as possible,\" PayPal's head of blockchain and crypto, Jose Fernandez da Ponte told an audience at Consensus yesterday \"and we want to give choice to our consumers.\"",
    "The PayPal exec said the company wanted to encourage customers to \"bring their crypto to us, so they can use it in commerce, and we want them to able to take the crypto they have bought with us and take it to the destination of their choice.”",
    "\"We understand there is more utility to those tokens if you can move them around, so we are definitely exploring how we can let people transfer crypto to and from their PayPal addresses.\"",
    "At present, PayPal has issued no further details on the outline plans, or indeed how the service will function in practice. There’s also no clear indication as to how PayPal is planning to handle the blockchain transactions, which are created when users send and receive their crypto payments. For now, the company will continue to use the services of blockchain infrastructure provider Paxos.",
    "PayPal uses Paxos and several other partners to facilitate its wider global financial operations currently. However, the payments giant could move this in-house in the future, especially since it purchased crypto security firm Curv earlier in the year.",
    "It’s clear that PayPal sees long-term value in both crypto and blockchain. CEO Dan Schulman has said in the past that he views it as a means to lower the cost of money transfers and to help with widening the net of its growing product portfolio, especially in the developing world.",
    "The company is also said to be developing a less volatile stablecoin cryptocurrency that could also make an appearance in the near future. PayPal hasn’t confirmed its existence, but hasn't denied it either.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies."
  ],
  "headers": {
    "3": "Transfer crypto"
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/news/best-bitcoin-wallets",
    "wallet transfers": "https://www.techradar.com/best/best-money-transfer-apps",
    "payments company": "https://www.techradar.com/best/best-payment-gateways",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "Venmo": "https://www.techradar.com/reviews/venmo",
    "Coinbase": "https://www.techradar.com/reviews/coinbase-cryptocurrency-exchange",
    "commerce": "https://www.techradar.com/reviews/paypal-commerce-platform",
    "blockchain transactions": "https://www.techradar.com/news/blockchain-breakthroughs-just-how-much-can-the-tech-do",
    "Curv": "https://www.techradar.com/news/you-could-soon-get-paypal-payments-in-cryptocurrency",
    "stablecoin cryptocurrency": "https://www.techradar.com/news/what-is-a-stablecoin-everything-you-need-to-know"
  }
}