{
  "source": "https://www.techradar.com/news/hitman-3-will-get-ray-tracing-on-xbox-series-x-in-a-future-update-but-what-about-ps5",
  "title": "Hitman 3 will get ray tracing on Xbox Series X in a future update, but what about PS5?",
  "category": "gaming",
  "updated": "2021-01-25T14:16:46Z",
  "author": "adam-vjestica",
  "summary": "IO Interactive confirm ray tracing is coming to Xbox",
  "article": [
    "Hitman 3 is set to get ray tracing on Xbox Series X and Xbox Series S in a future update, according to developer IO Interactive.",
    "In an interview with Xbox Wire, IO revealed that it has “already started working on RT technology for the renderer in our Glacier engine, and once that’s deemed ready for prime time, we’ll definitely bring it to the Series X|S hardware.”",
    "The game currently runs at 4K resolution at 60fps on Xbox Series X, but doesn’t feature any ray tracing. However, Hitman 3 looks best on Xbox Series X in a side-by-side comparison: the PS5 version runs at 1800p resolution and includes lower shadow quality.",
    "IO Interactive doesn't mention PS5 when talking about ray tracing support for Hitman 3, but we know that Sony’s console is more than capable of including the technology. Games such as Devil May Cry 5: Special Edition, Marvel's Spider-Man: Miles Morales and Watch Dogs: Legion all support ray tracing on PS5, so we'd be surprised if it wasn't included.",
    "However, IO said it sees Hitman as a \"live game\" and that its \"launch date on January 20 is just the beginning of a journey, in which we're going to keep working on the game and adding new features.\"",
    "We thoroughly enjoyed Agent 47's latest outing, saying: \"This final entry in the trilogy gave us some of the greatest jaw-drop moments that we’ve ever experienced from IO Interactive’s murder simulator,\" in our Hitman 3 review.",
    "But what's next for IO Interactive? Well, the developer is working on a new James Bond game dubbed Project 007. The game will feature a wholly original story but few details have been shared."
  ],
  "headers": {
    "5": "It's a hit, man"
  },
  "links": {
    "Hitman 3": "https://www.techradar.com/news/hitman-3-is-the-game-i-wished-assassins-creed-was/reviews/hitman-3",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Wire": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1193224436205564700&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F01%2F22%2Finside-xbox-series-xs-optimized-hitman-3%2F",
    "Hitman 3 looks best on Xbox Series X": "https://www.techradar.com/news/hitman-3-looks-best-on-xbox-series-x-as-microsofts-console-finally-trumps-ps5",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Marvel's Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Watch Dogs: Legion": "https://www.techradar.com/reviews/watch-dogs-legion",
    "Hitman 3 review": "https://www.techradar.com/reviews/hitman-3",
    "Project 007": "https://www.techradar.com/news/project-007-release-date-trailers-news-and-everything-we-know"
  }
}