{
  "source": "https://www.techradar.com/news/eas-patent-pledge-is-just-the-beginning-in-improving-video-game-accessibility",
  "title": "EA's patent pledge is just the beginning in improving video game accessibility",
  "category": "gaming",
  "updated": "2021-08-24T11:34:01Z",
  "author": "hamish-hector",
  "summary": "Other companies should do the same",
  "article": [
    "The patenting of video game technologies and features has always been a tricky subject; many believe the practice stifles creativity, while others say it's necessary to ensure developers don’t have their hard work stolen.",
    "Gaming giant EA has been criticized for patenting its technologies and game features in the past, but now it might be winning back some support.",
    "The company has announced a ‘patent pledge’, promising that it won’t sue any developers that want to use its accessibility-related patents in their own games. This includes patents that can make games more visible for those with vision impairments, and allow players to listen to personalized music based on their hearing capabilities and even EA’s patent for its ping system used in Apex Legends (which allows players to quickly highlight areas, items, and players without communicating over a mic).",
    "While the pledge only covers five patents right now, EA has also stated that additional patents could be added to the program later.",
    "If this pledge is honored unconditionally, it could have enormous benefits for developers and gamers alike. But EA’s initiative is only the beginning, and we’d like to see more both from it and from other companies in the future.",
    "EA has argued that its approach to patenting benefits everyone, with executive vice president of Positive Play, commercial and marketing Chris Bruzzo telling GamesIndustry.biz that its patent documents offer “great detail around how the technology works, why it works the way it does, what it means to incorporate it in a way so that it works effectively in your games”.",
    "However, others see this pledge as just a promise which EA could renege on at any time; one day it could simply change its tune and start taking legal action against other companies for using its technology. These detractors argue that the company should instead let its patents expire (for example by not paying its renewal fees) and allow them to enter the public domain early, guaranteeing legal security to developers who use the technology.",
    "However, while it’s understandable that some will be skeptical of EA’s intentions, we hope that its patent pledge inspires other companies to take a similar approach – and go even further. Naughty Dog was heavily praised for the features it implemented in The Last of Us Part 2 in order to make that game as accessible as possible; imagine if it made its research and tech publicly available so that more developers could follow suit.",
    "If more big gaming brands adopted EA’s approach it would be particularly beneficial for smaller indie studios, who may not have the resources to create their own accessibility features from scratch. By using the features detailed in EA and other company’s patent patents, indie developers can much more easily accommodate players with different needs.",
    "It doesn’t just have to stop with virtual technology either - Xbox, for example, could allow other manufacturers to produce a version of its adaptive controller. Third-party creations may make the tech more affordable and could bring the controller to new platforms like PlayStation.",
    "EA’s patent pledge opens the way for others to help make gaming a more inclusive experience for everyone, no matter their needs. We’ll have to wait and see how the gaming industry reacts to the company’s bold initiative, but hopefully even more accessibility patents will become free to use in the future."
  ],
  "headers": {
    "5": "Opinion: EA's patent pledge is just the beginning"
  },
  "links": {
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "GamesIndustry.biz": "https://www.gamesindustry.biz/articles/2021-08-23-ea-shares-five-innovations-via-accessibility-patent-pledge-wants-other-devs-to-do-the-same",
    "The Last of Us Part 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "adaptive controller": "https://www.techradar.com/news/yes-the-xbox-adaptive-controller-is-innovative-if-you-can-afford-the-added-expenses"
  }
}