{
  "source": "https://www.techradar.com/news/stripe-wants-to-make-financial-reporting-less-painful-for-saas-businesses",
  "title": "Stripe wants to make financial reporting less painful for SaaS businesses",
  "category": "computing",
  "updated": "2021-09-22T10:00:34Z",
  "author": "rob-clymo",
  "summary": "New product is aimed at streamlining revenue recognition processes",
  "article": [
    "Stripe has taken the covers off a new financial reporting tool designed to simplify a key aspect of time-sapping accounts processes for SaaS businesses.",
    "Its new Revenue Recognition tool has been engineered so it can automate many of the facets of revenue recognition, including when a customer receives a product or uses it, as opposed to when they paid for it.",
    "The move will help to more effectively document customer behavior, especially when it comes to revenue recognition, which is a central part of Generally Accepted Accounting Principles or GAAP.",
    "Revenue recognition has long been a complex and challenging prospect for many businesses, especially those who operate subscription-based or recurring revenue arrangements. Traditionally, revenue recognition has been a largely manual procedure whereby finance staff previously needed to log details via an Excel spreadsheet.",
    "Stripe’s new Revenue Recognition tool should help alleviate much of the manual intervention by delivering automated income statements and revenue waterfall tables.",
    "Similarly, the automatic processing will log all transactions and the system can even be used to import non-Stripe transactions, further smoothing the process of revenue recognition. Crucially, there’s compliance support, so businesses need not worry about meeting common standards including ASC 606 and IFRS 15.",
    "The new Revenue Recognition tool is another tool in Stripe’s growing product portfolio. Businesses can also make use of Stripe Tax, its tax compliance tool along with Stripe Identity, which helps business owners keep closer tabs on identity verification.",
    "Stripe announced the latest launch yesterday and has already made the product available in over 40 countries around the globe.",
    "Via: ZDNet"
  ],
  "headers": {
    "4": "Revenue Recognition"
  },
  "links": {
    "accounts processes": "https://www.techradar.com/best/best-payment-gateways",
    "Excel spreadsheet": "https://www.techradar.com/best/spreadsheet-software",
    "income statements": "https://www.techradar.com/best/accounting-software-small-business",
    "Stripe Tax": "https://www.techradar.com/news/stripe-tax-wants-to-get-rid-of-all-your-compliance-headaches",
    "Stripe Identity": "https://www.techradar.com/news/stripe-launches-new-tool-for-verifying-user-identities",
    "identity verification": "https://www.techradar.com/best/best-identity-management-software",
    "ZDNet": "https://www.zdnet.com/article/stripe-launches-new-financial-reporting-tool-for-saas-businesses/"
  }
}