{
  "source": "https://www.techradar.com/news/youll-soon-need-a-fingerprint-or-face-scan-to-use-whatsapp-on-the-web",
  "title": "WhatsApp is changing the way some account logins work",
  "category": "phones",
  "updated": "2021-01-28T14:14:34Z",
  "author": "cat-ellis",
  "summary": "Desktop users will need to use their biometrics",
  "article": [
    "WhatsApp is adding an extra layer of security to its desktop and web apps, requiring users to use their phone's face or fingerprint scanner in order to log in.",
    "At the moment, users can log into WhatsApp on the desktop by simply using their phone to scan a QR code on the computer screen. You can only be logged into one device at a time, so doing this will automatically log you out of the app on your phone.",
    "However, WhatsApp will soon allow users to stay logged into multiple devices simultaneously. It's likely that the messaging service is implementing this security change to ensure that if someone else gets hold of your phone, they aren't able to log into your WhatsApp account on the desktop or web without your knowledge.",
    "As Engadget explains, you'll then need to scan the QR code as before to complete the login process and access your messages on the second device.",
    "WhatsApp's controversial new privacy policy explains that the app won't be able to access your phone's biometric sensors directly. Instead, it will use whatever security measures you've enabled in the device's operating system.",
    "If you currently use face recognition or a fingerprint to log into your phone, the new WhatsApp security feature will be enabled automatically, and can only be turned off by deactivating biometrics on your phone.",
    "Other updates to WhatsApp's terms and conditions will require some users to share more of their data with its parent company Facebook – something many users are unhappy with. WhatsApp has postponed the rollout of the new terms in response to the backlash, and explained those specific changes will only apply to business accounts.",
    "The company has also issued a statement to answer some common questions about the new terms of service, explaining that neither WhatsApp nor Facebook can see your messages or hear your calls, log who you're calling and messaging, or see your shared location.",
    "If you're still not entirely convinced, and are thinking about changing to a different messaging service, we've put together a list of the best WhatsApp alternatives so you can weigh up your options and choose the best one for you."
  ],
  "headers": {
    "4": "Can you opt out?"
  },
  "links": {
    "stay logged into multiple devices simultaneously": "https://www.techradar.com/news/whatsapp-update-shows-how-multi-device-linking-will-look",
    "Engadget": "https://www.engadget.com/whatsapp-biometric-authentication-account-linking-080030297.html",
    "WhatsApp's controversial new privacy policy": "https://www.techradar.com/news/whatsapp-exodus-was-largest-digital-migration-in-history-says-telegram-boss",
    "share more of their data with its parent company Facebook": "https://www.techradar.com/news/whatsapps-new-privacy-policy-requires-you-to-share-data-with-facebook",
    "will only apply to business accounts": "https://www.techradar.com/news/whatsapp-tries-to-set-the-record-straight",
    "issued a statement": "https://faq.whatsapp.com/general/security-and-privacy/answering-your-questions-about-whatsapps-privacy-policy?fbclid=IwAR2iTGy1hRasFt216d_RF459pTu1uA_H3yEKdtSHSPDnNywGgYMAl2OOxts",
    "the best WhatsApp alternatives": "https://www.techradar.com/best/whatsapp-alternatives"
  }
}