{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s8-renders-give-us-first-look-along-with-another-specs-leak",
  "title": "Samsung Galaxy Tab S8 renders give us first look along with another specs leak",
  "category": "phones",
  "updated": "2021-10-22T22:11:21Z",
  "author": "david-lumb",
  "summary": "Samsung’s next tablet may have thinner bezels and better specs",
  "article": [
    "The Samsung Galaxy Tab S8 was shown off in a series of renders that gives us a possible first look at what the tablet’s final design might be, as well as a specs leak giving us details about the display, chipset, battery, and another claim that the tablet will release in January or February 2022.",
    "Noted leaker @OnLeaks tweeted out the purported Samsung Galaxy Tab S8 design via renders made by Zouton. The renders show a tablet with thinner bezels than its predecessor, the Samsung Galaxy Tab S7, but largely the same flat-edged design.",
    "The renders were also accompanied by a big specs leak, claiming the Tab S8 will have an 11-inch IPS LCD display with 2560 x 1600 resolution, which means it’ll retain the 16:10 ratio of its predecessors, resembling wider laptop screens rather than that of tablets. The alleged measurements of 253.75 x 165.30 x 6.24mm are virtually identical to those on the Tab S7, so the new tablet may be the same size (and fit the same cases and accessories). This flies in the face of what we’ve heard earlier, like the rumor suggesting a screen size over 12 inches for 2960 x 1848 resolution, so we’re unsure.",
    "The leak claims the Tab S8 will get the Snapdragon 888 chipset found in most of 2021’s best phones not made by Apple, which suggests that Samsung either intended to launch the tablet this year or doesn’t care that its silicon will be slightly outdated by the time it potentially launches in January or February. Other leaks have suggested it will get the Snapdragon 898 chipset rumored to come in next year’s flagship Android phones, so we’re also unsure about this one. Then again, if the tablet was anticipated to come out in late 2021, the slightly older chipset makes sense.",
    "The other alleged specs, like the 8,000mAh battery and 45W charging, are unchanged from the Tab 7, and the 128GB of storage may be inaccurate given last year’s tablet started with that level and went up to 256GB and 512GB – unless Samsung intends to shortchange its main tablet and preserve higher storage for the rumored Plus or Ultra versions.",
    "The Samsung Galaxy Tab S7 had launched in August 2020, so we naturally expected the Galaxy Tab S8 to arrive around the same time this year, but August came and went without the tablet arriving. Given the Samsung Galaxy Note 21, also expected in August, was officially canceled, we suspected the Tab S8 may have suffered the same fate.",
    "But a January or February 2022 release date for the Tab S8, which we’ve heard from multiple rumors, aligns with the supposed launch of another Samsung device: the Samsung Galaxy S21 FE, which we expected in September but still haven’t seen. Rumors suggest that phone is coming in January 2022 as well – and that it was delayed due to the global chip shortage.",
    "The global chip shortage has affected much of the tech world (and many other industries reliant on chips, like automobiles), so we could guess that the S21 FE and Tab S8 suffered the same delays. Shortages on the iPhone 13 have suggested that even the biggest companies are feeling the impact, so the Tab S8 probably won’t be the last device we see getting later-than-expected releases – and a lower supply could seriously impact stock for Black Friday and Cyber Monday deals."
  ],
  "headers": {
    "5": "Analysis: where’s the Galaxy Tab S8 been?"
  },
  "links": {
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "@OnLeaks": "https://twitter.com/OnLeaks",
    "tweeted": "https://twitter.com/OnLeaks/status/1451524241485176838",
    "Zouton": "https://t.co/0b2b38mFKD?amp=1",
    "Samsung Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "rumor": "https://www.techradar.com/news/samsung-galaxy-tab-s8-leaks-are-focusing-on-what-but-not-why",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "best phones": "https://www.techradar.com/news/best-phone",
    "suggested": "https://www.techradar.com/news/samsung-galaxy-tab-s8-trio-could-launch-with-cutting-edge-power",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}