{
  "source": "https://www.techradar.com/news/new-star-wars-movies-and-tv-shows",
  "title": "New Star Wars TV shows and movies explained",
  "category": "entertainment",
  "updated": "2021-06-28T14:56:32Z",
  "author": "samuel-roberts",
  "summary": "Disney Plus will be your main destination for that galaxy far, far away",
  "article": [
    "The Mandalorian was the start of something big. In a mega-announcement at Disney’s Investor Day in December 2020, Lucasfilm confirmed that as many as 10 Star Wars TV shows are heading for Disney Plus. And even though Rangers of the New Republic has seemingly fallen by the wayside, that still means we have The Book of Boba Fett, The Mandalorian season 3, Obi-Wan Kenobi and many more to look forward to – not to mention Clone Wars spin-off The Bad Batch, which kicked off on Disney Plus in May.",
    "But Disney haven’t forgotten about new Star Wars movies now that The Rise of Skywalker has brought the Skywalker Saga to a close. Wonder Woman director Patty Jenkins is working on a Rogue Squadron movie for 2023, while exciting filmmakers like Taika Waititi (Thor: Ragnarok), Rian Johnson (The Last Jedi) and Marvel Studios boss Kevin Feige are working on their own big-screen takes on that galaxy far, far away.",
    "Like a bunch of Bothan spies hunting down Death Star plans, we’ve put together a handy guide to the new Star Wars TV shows and movies we know are currently in production or development at Lucasfilm. There has arguably never been a more exciting time to be a Star Wars fan. The Force is strong with this one…",
    "As teased by the finale of The Mandalorian season 2, Boba Fett is getting his own spin-off TV show in December 2021. The Book of Boba Fett will feature Temuera Morrison reprising his role as the galaxy’s most infamous bounty hunter, along with his partially cybernetic companion, Fennec Shand (Ming-Na Wen) – who recently made an appearance in The Bad Batch. We can't wait to see more.",
    "Little is known about the third season of The Mandalorian – and it looks like we may have to wait until late 2022 to see it, as star Pedro Pascal has revealed it’s yet to go into production.",
    "Still, after the season 2 finale of the show, which saw (spoilers!) Din Djarin hand Grogu over to Luke Skywalker so he could train the Force-wielding little green man in the ways of the light side, we have to assume we'll see Mando traveling alone for a little while. A third season could feature a duel for the Darksaber between Mando and Bo-Katan Kryze (Katee Sackhoff) – and presumably Moff Gideon (Giancarlo Esposito) is going to be a very awkward prisoner for the New Republic.",
    "Like The Book of Boba Fett, this is a spin-off from The Mandalorian, and will see Rosario Dawson reprising her memorable role as the former Jedi Ahsoka Tano. Originally debuting in The Clone Wars animated series – and returning as a key player in Star Wars: Rebels – Ahsoka made a thrilling move to live-action with the Mandalorian episode 'The Jedi'.",
    "Her appearance in Mando suggested that she was on the hunt for the still-living Imperial officer Grand Admiral Thrawn – a villain introduced in Star Wars Expanded Universe stories long ago, and who was added to the newer Disney continuity with the Star Wars Rebels animated series. It's expected the show will touch upon the epilogue of Rebels, which saw Ahsoka and Mandalorian-turned-Rebel Sabine Wren looking for aspiring Jedi Ezra Bridger, who was last seen heading into the unknown with Thrawn.",
    "Dave Filoni – Mandalorian director, former Clone Wars/Rebels showrunner and Lucasfilm’s newly appointed executive creative director – will call the shots on this new Star Wars TV show.",
    "As well as bringing back Ewan McGregor to reprise the Force-wielding role he played in the prequel trilogy, the long-awaited Obi-Wan Kenobi spin-off will feature the return of Hayden Christensen as Anakin Skywalker/Darth Vader – with a new showdown promised between Jedi Master and failed Padawan.",
    "This new Star Wars TV show is set 10 years after Revenge of the Sith. Back in December 2020, TechRadar was lucky enough to see behind-the-scenes footage on the TV series that wasn't broadcast to the public – it didn't reveal much beyond concept art and McGregor praising Christensen's return.",
    "But we did see an image of Kenobi fighting Vader. Expect them to age up Obi-Wan in this series – the Jedi Master looked noticeably older on what appeared to be a dewback creature in one piece of concept art. We saw a lot of images of planets, too, with it being confirmed that Tatooine is just the start of this story.",
    "Deborah Chow, who made The Mandalorian episodes 'The Sin' and 'The Reckoning', is the director of the series, which went into production in April 2021.",
    "The cast features The Queen’s Gambit’s Moses Ingram, Eternals’ Kumail Nanjiani, Game of Thrones’ Indira Varma, Homeland’s Rupert Friend and Fast & Furious 9‘s Sung Kang. Joel Edgerton and Bonnie Piesse reprise their prequel trilogy roles as Luke Skywalker’s legal guardians Uncle Owen and Aunt Beru – could this mean an adolescent Luke will make an appearance in the show?",
    "The long-awaited prequel to 2016's Rogue One: A Star Wars Story, Andor focuses on Rebel Alliance intelligence officer Cassian Andor (played by Diego Luna) – Lucasfilm has described this new Star Wars TV show as a spy thriller. When the crew of the show discuss it in the video above, they make no delineation between the show and a movie in terms of how it's being made – which is exciting.",
    "This show is set five years before the Rebels obtained those infamous Death Star plans in Rogue One, and Bourne screenwriter (and Rogue One reshoot overseer) Tony Gilroy is the show's creator. Stellan Skarsgard, Adria Arjona, Fiona Shaw and Kyle Soller are part of the show's ensemble cast – as is Genevieve O'Reilly, who reprises her Rogue One and Revenge of the Sith role of Rebel leader Mon Mothma. There are also reports that Ben Mendelsohn and Forest Whitaker will be back in their Rogue One roles as Orson Krennic and Saw Gerrera, respectively.",
    "It's 12 episodes long, according to the video above, with over 200 named cast members – this could be a step up even from The Mandalorian in terms of scale.",
    "This series of short films on Disney Plus will be composed of anime-style episodes, made by acclaimed Japanese creators. This should result in a bunch of fresh new angles on the Star Wars universe – similar, we suppose, to The Animatrix, or Halo Legends.",
    "Set at the end of the recently-debuted High Republic era of Star Wars (around two centuries before the events of the original trilogy), The Acolyte is a new Star Wars TV show from the co-creator of Netflix's Russian Doll, Leslye Headland. Not much was said about this series by Kathleen Kennedy in the Disney Investor Day presentation, other than it's a \"mystery thriller\" set in a \"galaxy of shadowy secrets and emerging dark side powers\". Past reports have suggested it's a female-centric show with some martial arts stuff included, too. We can't wait to hear more.",
    "An 'event series' from writer Justin Simien (Dear White People), this show will focus on Lando Calrissian – though actor Donald Glover wasn't confirmed to reprise his Solo role as the smooth-talking and hard-gambling Bespin administrator, Disney's announcement video sure used a lot of footage of the actor. 'Event series' usually means miniseries – so expect just one season of this show. Could Alden Ehrenreich's Han Solo pop up again too? This one is in its early stages, so you might have to wait a while.",
    "Now, onto the movies...",
    "Announced back in December 2020, there was much speculation that this spin-off from The Mandalorian could feature X-Wing pilots Trapper Wolf (played by Dave Filoni) and Carson Teva (Paul Sun-Hyung Lee), both seen saving Mando from ice spiders in 'Chapter 10: The Passengers'. Teva also had an important role as a kind of space cop in subsequent episodes.",
    "Others believed it would feature Cara Dune, the former Rebel Shock Trooper played by Gina Carano.",
    "Unfortunately, it looks like won't get a chance to find out if either (or both) theories was correct as reports in May 2021 said that \"Rangers of the New Republic is no longer in active development”.",
    "This move may be connected to Lucasfilm's decision to part company with Carano in February 2021, after a series of offensive social media tweets from the star.",
    "\"Gina Carano is not currently employed by Lucasfilm and there are no plans for her to be in the future,\" Lucasfilm said in a statement. \"Nevertheless, her social media posts denigrating people based on their cultural and religious identities are abhorrent and unacceptable.\"",
    "With the Skywalker Saga brought to a close (at least for now...) by 2019’s The Rise of Skywalker, Lucasfilm is venturing into new territory with its slate of new Star Wars movies. With Disney Plus’s Star Wars TV shows seemingly the priority for now, little is known about the films’ storylines at present. But given the filmmaking talent involved, they're set to be exciting additions to that famous galaxy far, far away.",
    "Directed by Wonder Woman's Patty Jenkins, the next theatrical release in the Star Wars movies canon after The Rise of Skywalker will be Rogue Squadron – and it's coming in 2023. Rogue Squadron, of course, is the name of Luke Skywalker's fighter pilots who fought in the Battle of Hoth, and were formed after the Battle of Yavin.",
    "This film will be about a new generation of fighter pilots as they \"earn their wings\", according to Kennedy, risking their lives in a \"future era\" of the galaxy.",
    "Rogue Squadron also featured in author Michael A Stackpole's X-Wing series of books from the Expanded Universe of Star Wars that existed before Disney bought Lucasfilm. It was also the name of a series of video games released on the N64, PC and GameCube.",
    "This movie will focus on pilots in the Star Wars universe, then, which means plenty of space battles. Jenkins – herself the daughter of a real-life fighter pilot – admitted in a teaser video on Twitter that she has ambitions to make the “greatest fighter pilot movie of all time”, but that she'd been unable to find the right project. Until now...",
    "Coming to Disney Plus, this co-production between Industrial Light and Magic and Lucasfilm Animation will feature R2-D2 and C-3PO alongside a new hero. Their mission? That's a secret that only the droids know. Expect something light-hearted and fun. Lucasfilm confirmed it's a new Star Wars movie, rather than a TV show, on Twitter.",
    "Having directed one of the best episodes of The Mandalorian (season 1's finale, where Mando takes down Moff Gideon's TIE Fighter), Thor: Ragnarok and Thor: Love and Thunder director Taika Waititi is also working on a Star Wars movie. This one was announced back in 2020 on Star Wars Day, May 4, and surprisingly it's coming after Rogue Squadron. It's been described by Kennedy as \"fresh, unexpected and unique\". Waititi is currently writing the film, though he's joked on Instagram that, “As a longtime fan of Star Wars I'm so angry about what I'm about to do to ruin it.”",
    "Everything Marvel Studios chief creative officer (aka overlord) Kevin Feige turns to box office gold, so it’s no surprise that his Disney stablemates over at Lucasfilm have given him a call about making a Star Wars movie. He’s reportedly producing his own story in that galaxy far, far away, and – according to Deadline – has hired Loki head writer and Doctor Strange in the Multiverse of Madness screenwriter Michael Waldron to pen the screenplay.",
    "Ever since The Last Jedi hit theaters in 2017, there's been talk of a new Star Wars movie trilogy from writer/director Rian Johnson. Eagerly anticipated Netflix’s Knives Out sequel is likely to be dominating Johnson’s attention for a good while yet, but – despite many assuming its absence from December 2020’s Disney Investor Day announcements meant Lucasfilm had put it on the backburner – it seems the trilogy is still a going concern. Author Sariah Johnson recently tweeted as much after interviewing Johnson in February 2021:",
    "“Yes, Rian's SW trilogy is still on,” she said. “No dates or timelines because he has other projects going on, but it is happening.”",
    "She added the caveat that, “THAT IS ALL I KNOW ABOUT IT.”"
  ],
  "headers": {
    "3": "The Book of Boba Fett",
    "4": "The Mandalorian season 3",
    "6": "Ahsoka",
    "9": "Obi-Wan Kenobi",
    "14": "Andor",
    "17": "Star Wars: Visions",
    "18": "The Acolyte",
    "19": "Lando",
    "21": "Rangers of the New Republic",
    "26": "New Star Wars movies",
    "27": "Rogue Squadron",
    "31": "A Droid Story",
    "32": "Taika Waititi's Star Wars movie",
    "33": "Kevin Feige’s Star Wars movie",
    "34": "Rian Johnson’s Star Wars movie trilogy"
  },
  "links": {
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "The Bad Batch": "https://www.techradar.com/news/star-wars-the-bad-batch-release-date-cast-and-what-we-know-about-the-disney-plus-show",
    "Rogue Squadron": "https://www.techradar.com/news/new-star-wars-movies-announced-including-rogue-squadron-for-2023",
    "Pedro Pascal has revealed it’s yet to go into production": "https://www.techradar.com/news/the-mandalorian-season-3-may-not-arrive-until-late-2022-heres-why",
    "season 2 finale": "https://www.techradar.com/news/the-mandalorian-season-2-episode-8-recap-review",
    "Mandalorian episode 'The Jedi'": "https://www.techradar.com/news/the-mandalorian-season-2-episode-5-recap-baby-yodas-name-is-revealed",
    "Obi-Wan Kenobi spin-off": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "Fast & Furious 9": "https://www.techradar.com/news/fast-and-furious-9-trailer-release-date-cast",
    "reports": "https://www.techradar.com/news/star-wars-andor-series-reportedly-casts-two-more-rogue-one-stars",
    "High Republic era of Star Wars": "https://www.techradar.com/news/star-wars-the-high-republic/uk/news/star-wars-the-high-republic-10-things-you-need-to-know",
    "Chapter 10: The Passengers": "https://www.techradar.com/news/the-mandalorian-season-2-episode-2-recap-review",
    "as reports in May 2021": "https://www.techradar.com/news/new-star-wars-show-sounds-like-its-on-hold-according-to-report",
    "Lucasfilm's decision to part company with Carano": "https://www.techradar.com/news/gina-carano-will-no-longer-appear-in-star-wars-projects",
    "Twitter": "https://twitter.com/PattyJenks/status/1337177394625478656?s=20",
    "on Twitter": "https://twitter.com/starwars/status/1337177098364940289",
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Instagram": "https://www.instagram.com/p/CIpljtuj5ae/",
    "Deadline": "https://deadline.com/2021/01/loki-michael-waldron-kevin-feiges-star-wars-movie-as-part-of-newoverall-deal-with-disney-1234665495/",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Doctor Strange in the Multiverse of Madness": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Netflix’s Knives Out sequel": "https://www.techradar.com/news/netflix-is-making-two-knives-out-sequels",
    "tweeted": "https://twitter.com/sariahwilson/status/1361502613728948230"
  }
}