{
  "source": "https://www.techradar.com/news/loki-wont-appear-in-thor-love-and-thunder-heres-why",
  "title": "Loki won't appear in Thor: Love and Thunder – here's why",
  "category": "entertainment",
  "updated": "2021-06-08T14:28:24Z",
  "author": "tom-power",
  "summary": "It seems Loki will remain a Disney Plus exclusive... for now",
  "article": [
    "Loki's Disney Plus series is less than a day away from being released, and fans can't wait to see the God of Mischief get up to his old tricks once more.",
    "While Tom Hiddleston will be reprising his role as Loki in the MCU TV show, though, don't expect him to make a cameo appearance in the next Thor movie when it arrives in May 2022.",
    "Why? Well, according to Hiddleston himself, that chapter in the Norse Gods' lives has ended.",
    "Speaking to Empire Magazine ahead of the launch of Loki (per Digital Spy), Hiddleston was asked if the trickster God would somehow turn up in Thor: Love and Thunder.",
    "\"We have explored about as much as we can about these two brothers,\" Hiddleston said. \"We talked about the Thor movies as a family saga, and the diametric opposition between Thor and Loki, and duality and antagonism, being a book that perhaps should remain closed for the moment.\"",
    "While Hiddleston confirms that Loki won't make a cameo appearance in Thor: Love and Thunder, he doesn't completely rule out a reunion of sorts in the future.",
    "The \"remain closed for the moment\" part of his answer is key here. If Marvel thought there was an opportunity to bring Thor and Loki back together post-Love and Thunder, there's no reason why they couldn't.",
    "We know that the MCU is turning into the Marvel Cinematic Multiverse (MCM) during Marvel's Phase 4 slate, and that other MCU projects will have crossover events where characters from different universes collide.",
    "Spider-Man: No Way Home is one such example. The likes of Alfred Molina's Doc Ock and Jamie Foxx's Electro set to reprise their villanous roles in the MCU, even though they've appeared (and died) in Sony's other Spider-Man movie series adaptations.",
    "This sets a precedent for other MCU (or MCM) productions to follow suit, including Loki and Thor's solo adventures.",
    "If the MCU permanently turns into the MCM after No Way Home and Doctor Strange 2, Loki and Thor could theoretically bump into each other again. We don't know if that would occur in another movie or a potential second season for Loki, but it would be fascinating to see nonetheless.",
    "We imagine Thor wouldn't take too kindly to his brother turning up alive again, while Loki wouldn't be aware of any of the adventures they had been on since 2012's Avengers Assemble.",
    "For now, we'll have to make do with the two Norse Gods making their own way through the MCM. Thor will return in Love and Thunder on May 4, 2022, while Loki season 1 will begin on Wednesday, June 9 exclusively on Disney Plus."
  ],
  "headers": {
    "5": "Analysis: Loki could encounter Thor in the MCU in the future"
  },
  "links": {
    "Loki's Disney Plus series": "https://www.techradar.com/news/what-time-is-loki-episode-6-released-on-disney-plus",
    "next Thor movie": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Digital Spy": "https://www.digitalspy.com/movies/a36656652/loki-thor-love-and-thunder-tom-hiddleston/",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more"
  }
}