{
  "source": "https://www.techradar.com/news/wordpress-now-powers-40-of-the-worlds-websites",
  "title": "WordPress now powers 40% of the world's websites",
  "category": "computing",
  "updated": "2021-02-10T23:30:25.722Z",
  "author": "anthony-spadafora",
  "summary": "The world's most popular CMS continues to grow",
  "article": [
    "The world's most popular CMS continues to grow and new data from W3Techs has revealed that 40 percent of the web or two out of every five websites now use WordPress.",
    "While there are plenty of WordPress alternatives including Shopify and Squarespace, WordPress is still in a league of its own.",
    "This is because in addition to the sites powered by WordPress, an ecosystem has been built up around the CMS which includes more than 58,000 WordPress plugins and more than 8,000 WordPress themes.",
    "At the same time though, many companies and organizations make a living creating WordPress sites or helping users do so. These include both WordPress hosting and managed WordPress hosting providers like Bluehost, Dreamhost and even the company behind WordPress, Automattic. However, the biggest one is still WP Engine which is known for its WordPress expertise.",
    "To come up with its latest statistics on WordPress usage, W3Techs used data from the Alexa top 10 million websites as well as Tranco's top one million list to avoid counting parked domains, spam sites and those with little to no content.",
    "According to the data, WordPress has grown from being used on over 10m sites in 2011 to 40m sites today. It also controls 64.3 percent of the CMS market.",
    "Of the sites that use WordPress, the .blog top level domain has the highest market share at 92.2 percent followed by the .news domain at 87.1 percent. The .mil top level domain on the other hand has the lowest WordPress usage as the military prefers to use DotNetNuke instead.",
    "When it came to the countries with the highest WordPress usage, South Africa leads the way followed by Iran, Israel and Spain. China, South Korea and Russia though are the countries with the lowest WordPress usage.",
    "One of the biggest drivers of WordPress' recent growth is likely due to the fact that many consumers and businesses created new websites during the pandemic.",
    "Via W3Techs"
  ],
  "headers": {
    "4": "Growing market share"
  },
  "links": {
    "CMS": "https://www.techradar.com/best/cms",
    "WordPress": "https://www.techradar.com/news/wordpress-at-15-inside-the-webs-most-popular-hosting-service",
    "WordPress alternatives": "https://www.techradar.com/best/alternatives-to-wordpress",
    "WordPress plugins": "https://www.techradar.com/best/best-wordpress-plugins",
    "WordPress themes": "https://www.techradar.com/news/best-wordpress-theme",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "managed WordPress hosting": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "Automattic": "https://www.techradar.com/news/automattic-snaps-up-web-analytics-firm-parsely",
    "parked domains": "https://www.techradar.com/news/domain-parking-used-to-spread-emotet-and-impersonate-mcafee",
    "DotNetNuke": "https://www.techradar.com/news/ransomware-attack-takes-web-hosting-provider-managedcom-servers-offline",
    "created new websites": "https://www.techradar.com/news/global-appetite-for-website-building-reaches-new-highs-during-pandemic",
    "W3Techs": "https://w3techs.com/blog/entry/40_percent_of_the_web_uses_wordpress"
  }
}