{
  "source": "https://www.techradar.com/news/android-auto-now-lets-you-play-games-on-your-cars-infotainment-display",
  "title": "Android Auto now lets you play games on your car's infotainment display",
  "category": "car-tech",
  "updated": "2021-09-24T10:54:13Z",
  "author": "john-mccann",
  "summary": "But only when you're stationary",
  "article": [
    "Google has a new Android Auto update packed with features for the in-car system, including the ability to play games on your vehicle's infotainment display.",
    "The search giant is using its own developer, Game Snacks - which came out of its Area 120 in-house incubator - to bring a number of games into your car.",
    "You'll need to put your vehicle in park before you'll be allowed to access the games, but the addition could be particularly popular with electric car owners as it gives them something to play while they wait for their car to charge.",
    "The visualization of the game integration on Google's blog shows eight games will be available to play; ZooBoom, Onet Connect Classic, Cannonballs 3D, Pin the UFO, 2048 Giant, Find 500 Differences, Unblock That and Bubble Words.",
    "That's just a handful of over 100 games available on the Game Snacks website though, so there's a chance more could be added to Android Auto in the future.",
    "A word of warning though - your phone will need an internet connection to play, so if you find yourself deep in a parking garage with no cell reception the games may not work.",
    "This isn't the first time we've heard of the Game Snacks integration with Android Auto, as it appeared in a beta version of the platform back in July, but it's now being made available officially.",
    "Another new feature in this Android Auto update allows you to pay for fuel using just your voice, with no need to get a credit card out.",
    "All you'll need to do is arrive at the pump, say \"Hey Google, pay for gas\", select the pump number on screen and complete the contactless payment using Google Pay.",
    "It will only be available in the US initially (and compatible with handsets running Android 10 and above), with over 32,500 gas stations supporting Android Auto's voice payment, including pumps supplied by Exxon and Mobil, Conoco, Phillips 66 and 76.",
    "The new version of Android Auto will also use Google's Assistant to recommend you music, news and podcasts it thinks you'll like, plus the ability to select which app opens by default when you connect your phone to your car.",
    "And finally, the update also includes support for dual-SIM phones, allowing you to pick which one to make calls from, plus Android Auto will also support Work profiles, giving you access to meetings and messages.",
    "The update will fully roll out in the next few weeks for Android phones in English (US, Australia, Canada, Ireland, India, Singapore and UK), German, Spanish (Spain, Mexico), French and Italian."
  ],
  "headers": {
    "7": "Pay for gas using your voice and Android Auto"
  },
  "links": {
    "on Google's blog": "https://blog.google/products/assistant/upgrade-your-drive-google-your-copilot/",
    "Game Snacks website": "https://gamesnacks.com/embed/"
  }
}