{
  "source": "https://www.techradar.com/news/rodes-new-free-audio-app-is-a-boon-for-streamers-and-podcasters",
  "title": "Rode’s new free audio app is a boon for streamers and podcasters",
  "category": "news",
  "updated": "2021-04-14T02:46:42Z",
  "author": "harry-domanski",
  "summary": "Rode Connect is a simple and powerful mixing program for the NT-USB Mini",
  "article": [
    "Known for its prowess in the world of microphones, Rode has been at the forefront of bringing studio quality recording equipment to the modern world of streaming, podcasting and vlogging, and making it affordable in the process.",
    "Rode Connect is the latest product to follow this mission – a free application designed to integrate and mix up to four of the company's NT-USB Mini microphones on one computer.",
    "Typically, when recording via USB microphones, it requires a complicated routing setup and dedicated software or hardware to use multiple microphones at once, as only one USB audio device can be selected by default.",
    "Rode Connect addresses this issue, allowing up to four NT-USB Mini microphones to be plugged into the one computer and be seamlessly controlled within the software, including the ability to mute channels, adjust their levels, add compression or noise gates, and other useful effects.",
    "There's an additional two channels available within Connect as well, dubbed 'virtual' and 'system'. The former allows for remote callers via apps such as Zoom to have a dedicated channel in the software, while the latter can be used to stream any audio from the computer itself, for soundbeds, stings or other audio material.",
    "For podcasters, this suite of features would allow simple and simultaneous control over four participants in the same room, one remote speaker, and a pre-recorded interview, without having to fork out for a dedicated audio interface or specialized streaming kit.",
    "It's worth noting that the software is only compatible with the Rode NT-USB Mini microphone – other USB mics won't work. Rode states that this is because \"Many of the critical aspects of the software (such as the real-time monitoring, compressor, noise gate, APHEX processing, and low-latency recording capability) rely on the powerful internal digital signal processing carried out within the microphone.\"",
    "With this in mind, it's better to view Rode Connect as companion software to this specific product (rather than a free audio suite), which allows more of the 'hidden' features of the microphone to be accessible to the user.",
    "Alongside the launch of the software, Rode released a product called 'Colors', which provides four sets of USB-A, USB-C, and NT-USB Mini colored clips to help distinguish each microphone and cable when using all four at once. In Australia, this set is priced at AU$29 with other region information to follow."
  ],
  "headers": {
    "6": "Caveat"
  },
  "links": {
    "Rode Connect": "https://rode.com/software/rode-connect",
    "NT-USB Mini microphones": "https://www.techradar.com/news/rodes-new-mini-usb-microphone-is-here-to-take-on-the-yeti-nano"
  }
}