{
  "source": "https://www.techradar.com/news/a-week-with-the-huawei-mate-x2",
  "title": "A week with the Huawei Mate X2: what we learned with the latest foldable smartphone",
  "category": "phones",
  "updated": "2021-04-03T07:00:02Z",
  "author": "basil-kronfli",
  "summary": "It was a good week",
  "article": [
    "My week with the Huawei Mate X2 coincided with one of the most stressful times in my life, a house move.",
    "The foldable smartphone launched exclusively in China (for the time being), is Huawei’s first major announcement in years to not debut with an English-speaking launch event. Instead, the China-only launch meant China-only review devices were available, even for English-speaking journalists like me.",
    "With that in mind, I was going into a week of emailing and calling solicitors and mortgage brokers, staying on top of work and family life, while packing up a ton of stuff with digital to-do lists, with a smartphone running Chinese software.",
    "Who cares if it’s foldable; I needed it to work! But I had committed to writing something of a diary, so my mind was made up – unsurprising twist alert – I actually kind of loved it.",
    "Before I dive into my time with the Huawei Mate X2, it’s worth running through what makes the phone special.",
    "The Mate X2 is Huawei’s third foldable, following on from the well-received Mate X and Huawei Mate Xs. While past Mate X phones had wraparound foldable displays, which zapped the need for a second screen, the Mate X2 follows the Samsung Galaxy Fold and Galaxy Z Fold 2, opting instead for an inner folding screen, matched with a traditional outer screen.",
    "Costing CNY 17,999 (roughly $2,785, £1,985, AU$3,530) for the 256GB version, and CNY 18,999 (around $2,940, £2,095, AU$3,730) for 512GB, this is an expensive smartphone.",
    "If these conversions prove even roughly similar to global launch prices, this will outprice the likes of the Galaxy Z Fold 2, which cost $1,999 / £1,799 / AU$2,999 for 256GB. That said, all foldables are expensive. At least with the Mate X2, you get flagship specs across the board.",
    "It all starts with the front screen. It’s bigger than that of the Galaxy Z Fold 2, so will make for a more comfortable experience. The inner screen’s larger too at 8 inches. Having a larger inner screen makes it feel more like a tablet when unfolded, adding to its two-in-one hybrid appeal.",
    "What also helps the Mate X2 stand out from the competition is its camera. Other folding phones have always fallen down when it comes to imaging, with the original Mate X and Mate Xs missing out on a periscope zoom, and the Z Fold and Z Fold 2 not even trying to keep up with Samsung’s Galaxy S20 Ultra and S21 Ultra.",
    "With camera wins come software woes though. Whether you’re using the Chinese version or the global version of any 2021 Huawei phone, you won’t enjoy access to the Google Play Store, or any Google Mobile Services.",
    "We’ve covered the implications of the Huawei ban extensively on TechRadar, and in my week with last year’s Mate Xs, I ended up sideloading Google services sharpish.",
    "This time, however, I went with a pure Huawei experience from start to finish, hammering the phone with everything from work, lockdown life, and managing a house move. I even attempted to watch the only squarish film I could think of (Zack Snyder’s Justice League) on its squarish inner screen. How did I get on?",
    "The box of the Mate X2 has Chinese characters embossed on it. Inside, the phone’s manuals are in Chinese, along with some pretty alarming-looking safety instructions (which I couldn’t read, because I don’t read Chinese). To say I was concerned having committed to a week with the China-only Mate X2 is an understatement.",
    "Taking the phone out of the box though, I was bedazzled. It’s unfolded as you lift the box lid and unsheathe the wraparound protector – gloriously finished and mesmerizingly box-fresh. Instantly, I had confidence in the Mate X2’s design, which is rare for foldables (though not for a Huawei phone).",
    "After I powered up the phone, my stress levels subsided. It was easy to set it up in English. Sure, there are a lot of Chinese apps pre-installed, but they can be removed. The result is a phone that looks very familiar to a global Huawei smartphone sold in the UK - until, that is, I opened the AppGallery (Huawei's app store).",
    "Bombarded with China-only apps on the main AppGallery welcome screen, for a moment, I thought I wouldn’t be able to experience Huawei’s 2021 western app portal.",
    "The company has invested millions in its Android experience since the Google ban was announced, and it’s paid off. Even when using non-Huawei phones, I often install the AppGallery and Huawei’s Petal Search (which finds apps on other sources) to download APK files that are region locked.",
    "The idea that the Mate X2 wouldn’t let me access either the AppGallery I’m familiar with or Petal Search would have been a massive blow to usability.",
    "A quick rummage through the settings, however, led me to a manual region selection override, and with a simple switch-out to the United Kingdom, I was quickly able to install Petal Search and optimism was back in business.",
    "Huawei really does deserve to be commended for how holistically the AppGallery switched to the UK version. It hit home just how localized the service is, with all the Chinese characters filtering out, and apps like Bolt, Just Eat, and Nando’s suddenly populating the AppGallery.",
    "Are there missing apps? Loads, more on that later, but at the very least, I’ve gotten the Chinese Mate X2 to a point of parity with European Huawei phones, so I know what to expect.",
    "Unlike Apple and Samsung, Huawei’s no stranger to shipping its phones with a case in the box. The Mate X2 is no exception, and when you’re paying top dollar for a folding fantasy phone, you’ll want a case to match, and the ‘Flipstander’ doesn’t disappoint.",
    "Sure, its name sounds like a Doc from Back to the Future brainchild, but the very good-looking case, whose texture plays off against the high-gloss back of the phone wonderfully, is much more than a wacky name.",
    "Instagram, Feedly, Twitter - favorites that enjoy portrait scrolling, look fantastic spread across the open Mate X2 in split-screen, and while I was working, typing away, the propped up phone displaying social feeds and my RSS stream was exactly what I needed in the corner of my eye.",
    "Propping up the phone in either tablet (open) or smartphone (closed) orientation, the spring-loaded Flipstander positions the screen at two angles. It's also solid enough to handle a few swipes and taps without crumbling, which is so often an issue with kickstands.",
    "Foldable phones benefit from kickstands more than most. The entire category is all about an incredibly special type of screen, and the Huawei Flipstander case becomes something of a celebration of foldables. It’s exactly what Samsung needs to aspire to with its future Z Folds, even if Samsung sells the case separately.",
    "You could argue that Huawei switching from an outer display on the Mate Xs to a dual-display, one inside and one on the front is Huawei conceding - admitting that Samsung was actually right all along: outer folding screens are a bad idea. But it isn’t that simple.",
    "The Z Fold had a pretty rubbish outer display - it was too small. The Z Fold 2’s was better but is still too tall and thin. The technology has finally developed for an outer display size to deliver a decent user experience, and Huawei is the first foldable maker to make what feels like a compromise-free dual-screen option. At least from a hardware point of view.",
    "While the Galaxy Z Fold 2’s outer screen is 25:9, which is super-long, and makes photos look like thumbnails, letterboxing almost every type of content, the Mate X2’s front display is 21:9. Tall? Yes, absolutely. Unusable? Definitely not, as illustrated by the Sony Xperia 1 II.",
    "We loved the Galaxy Z Fold 2 as there was nothing quite like it when we tested it, but there’s no denying it occasionally forced us into the unfolded state thanks to its awkwardly narrow aspect ratio being difficult to use. In contrast, the Mate X2 never did.",
    "I’ve been getting by with no Google better than I thought. It’s been fun having the Mate X2 as a phone that unfolds on special occasions, but I use it in tandem with my computer and iPad, so have saved my Googling (Docs, Drive, Meet, etc) for other devices.",
    "Unlike me one year ago, I haven’t hit a blockade-a-minute with app support on the Mate X2, because this is the fifth Huawei phone I’ve tested without Google. I knew what to expect, and I haven’t swum upstream and tried to make it work in the way I use other Android phones.",
    "What is weird on a Huawei phone, however, is not having wireless charging, as Huawei is leading the fast wireless charging charge. Its Mate 40 Pro goes up to 50W, matched or beaten only by a few phones like the OnePlus 9 Pro and Xiaomi Mi 11 Ultra, while fast charging of 40W is supported on the P40 Pro.",
    "Even 2019’s Mate 30 Pro powered up cable-free at up to 27W, all trumping the fastest wireless charging from Apple and Samsung today.",
    "We understood why the Mate Xs design didn’t accommodate wireless charging. But with the Mate X2 sporting the same layout as the Galaxy Z Fold 2, and Samsung’s foldable offering wireless charging, it’s probably the only spec (or lack of) that leaves us underwhelmed.",
    "There’s something to be said for having a fantastic camera phone during a dramatic week in your life. It isn’t just for the ‘gram (though it also is a bit); but capturing snapshot memories with actual snapshots is pretty iconic. As luck would have it, in my dramatic moving house week, I had one of the best camera phones money can buy.",
    "Before I fired it up, I had high hopes for the Mate X2’s camera. It shares a similar camera system to that of the Huawei P40 Pro Plus and Mate 40 Pro Plus, loaded up with both a 3x zoom and a 10x zoom camera.",
    "Forget about zoom for a second though; the main 50MP camera is a tried and tested champion-performer. It captures nuanced dynamic range, clear, sharp shots, and tantalizing colors when set in front of sunsets, blue skies, or rolling hills. Better still, it doesn’t crumble at night.",
    "The degree to which the Mate X2's camera was something special became obvious when I visited a friend to drop something off. During these lockdown times, restrictions dictate you keep your distance, so the greeting was at the front door at night.",
    "As you can see from the picture, the photo of a young couple looks wonderfully incidental but were it captured on an inferior camera phone, there’s a good chance it would have been a blurry grain-fest.",
    "The other moment the phone's stellar camera shone saw my family and I toast to our new home with bubbles and the only glasses we could find. I pulled out the Mate X2, and in automatic mode, captured a bokeh-rich moment. It’s pretty emotional looking at the picture, even while writing this a few days later, which says it all.",
    "You can see this snap - along with a gallery of other photos shot on the Huawei Mate X2 - below.",
    "It’s been overwhelmingly positive for the Mate X2 so far, and actually, with my emails hooked up to the Outlook app, which I’m also using as my calendar, I’ve been able to just about get by Google-free.",
    "The main irk is that my Google Calendar doesn’t synchronize with the system calendar, so I’m forced to use Outlook for that too, which isn’t super-intuitive. Still, at least there was a simple workaround. The same can’t be said for other apps.",
    "Take HBO Max. The Mate X2 has an almost square screen. Zack Snyder’s Justice League is a native 4:3 movie. I managed to get Amazon Prime Video, Disney Plus, Netflix, and Sky Go working on the Mate X2; surely HBO Max would make my foldable superhero dreams come true? Nope. The app requires Google Play Services to work.",
    "Then there was Uber Eats. Takeout is a new home ritual, and I installed the Uber Eats app through Petal Search with rumbling stomachs and weary bodies to feed. After trying to locate our new home in the app, however, the lack of Google Maps meant I couldn’t, and in turn couldn't place an order in the app.",
    "It’s okay, Uber Eats has a website. I logged into my account through the browser, found my order, and tried to check out there. I say I tried because a pop-up from the site stopped me from being able to progress my order in mobile view.",
    "After 10 minutes, I finally realized I needed to switch out from mobile to desktop view, and that did the trick; I placed the order, we got food, and a workaround prevailed.",
    "The point is that there are often workarounds, and there are often none. As with any Huawei phone outside China, you’ve got to go in expecting camera and hardware highs, and a nippy, smooth interface, but a handicapped, occasionally clumsy app experience.",
    "A foldable is probably the perfect phone for coronavirus times. When you’re in lockdown, its big screen is a media dream, whether you’re gaming, watching, or swiping through photos.",
    "It’s also perfect for social distancing. I can’t count the number of times I wanted to show a friend or family member something at a distance, and rather than step closer to them, I simply opened the phone, creating an easier-to-see, bigger screen for them.",
    "The Mate X2’s hardware shows off Huawei’s mastery of design, and experience with foldables. Its screen crease is less noticeable than that of the Galaxy Z Fold 2, its outer-screen and inner screen are big enough for comfortable use, and the phone generally feels solid. The case, as mentioned, is also an in-the-box-boon, that helps you get the most out of it without having to fork out extra.",
    "Huawei’s AppGallery has definitely improved the experience, helped in no small part by Petal Search. The fact I’ve had over a year getting used to Huawei phones with no Google also means the limitation doesn’t surprise me.",
    "All that being said, I’m a very unique case, testing a new phone every week, and being well versed with a Google-free Huawei ecosystem. I’m also a big geek, and love working around a problem. In turn, the Mate X2 is like catnip for someone like me; it gives me something extra if I’m prepared to put in the work.",
    "While anyone after an easy life will want to steer clear of a smartphone without Google services, therefore, there are a few key takeaways I personally drew from my week with the Mate X2.",
    "The first: foldable camera systems matter and the Mate X2 is the finest example of one to date. Second: the outer screen may well be even more important than the inner screen on a foldable - with the Mate X2, I was never forced to open it up; something I can’t say for the still excellent Z Fold 2.",
    "Finally: the Mate X2’s hardware is the strongest case for foldable phones as a category I’ve seen. In fact, it was so good, I didn’t want my time with it to stop, even with the allure of Google waiting for me on the other side."
  ],
  "headers": {
    "4": "What is the Huawei Mate X2?",
    "13": "Day one - everything’s in Chinese… oh, wait, English now. Excellent.",
    "22": "Day two - Huawei kickstands Samsung where it hurts",
    "27": "Day three - front display fantastico",
    "31": "Day four - wireless charging would have been nice",
    "36": "Day five - best foldable camera ever",
    "43": "Day six - no Google is a compromise",
    "50": "Day seven - Google or not, I’d use this as my main phone"
  },
  "links": {
    "Huawei Mate X2": "https://www.techradar.com/news/huawei-mate-x2",
    "Mate X": "https://www.techradar.com/reviews/huawei-mate-x",
    "Huawei Mate Xs": "https://www.techradar.com/reviews/huawei-mate-xs",
    "Samsung Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "week with last year’s Mate Xs": "https://www.techradar.com/news/10-days-with-the-huawei-mate-xs-over-a-week-with-the-latest-foldable-phone",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Huawei P40 Pro Plus": "https://www.techradar.com/reviews/huawei-p40-pro-plus"
  }
}