{
  "source": "https://www.techradar.com/news/atari-vcs-release-date-has-finally-been-revealed-along-with-a-high-price-tag",
  "title": "Atari VCS release date has finally been revealed, along with a high price tag",
  "category": "gaming",
  "updated": "2021-06-03T13:06:32Z",
  "author": "adam-vjestica",
  "summary": "Old school Atari action awaits",
  "article": [
    "If you've been patiently waiting for an Atari VCS release date, we finally have an answer, along with how much the retro-inspired system with modern sensibilities will cost.",
    "The Atari VCS is set to launch on June 15, and you can order the base-level model in Onyx for $299.99. You can also pick up an ‘All-In’ system bundle that comes with two controllers – the Classic Joystick and the Modern Controller – for $399.99.",
    "Unlike the base-level model, you have a choice of two color schemes if you opt for the All-In system: either Black Walnut or Onyx. You can also purchase each controller separately for $59.99, if you’d prefer.",
    "The Atari VCS’s design is inspired by the Atari 2600, and although it comes with 100 arcade and Atari 2600 games for owners to enjoy – including a subscription to Antstream Arcade's huge retro library – it can also function as a PC. It means the Atari VCS is rather versatile, and could be a rather snazzy multimedia machine. You can even use it for productivity tasks and install either Windows or Linux to turn it into a mini PC.",
    "The Atari VCS’s dashboard is populated by the usual streaming services we’ve become accustomed to, so expect to see the likes of Netflix and Amazon Prime Video, but you’ll also have access to a built-in Chrome browser and Google’s suite of Workspace apps.",
    "Powering the Atari VCS is an AMD Ryzen processor, and the console is capable of 4K resolution, HDR and targets 60 frames per second. You can also expand the system’s internal storage, and it comes with dual-band Wi-Fi, Bluetooth 5.0 and USB 3.0 support.",
    "It’s hard to see the Atari VCS appealing to anyone but a niche group of consumers, as it’s unlikely to topple the likes of the PS5, Xbox Series X or Nintendo Switch anytime soon. However, that’s not the console’s intention, as Atari VCS COO Michael Artz previously said he hopes the console could provide consumers something different to PS5 and Xbox Series X, specifically for those “who may be weary of the iterative nature of the console wars something different to consider.”",
    "The Atari VCS is only available to purchase via GameStop, Best Buy, Micro Center, and the official Atari VCS website. The console isn’t available in Europe, though the company has said it could release the device in more territories if there is demand."
  ],
  "headers": {
    "6": "Nice and niche"
  },
  "links": {
    "Atari VCS": "https://www.techradar.com/reviews/atari-vcs",
    "Antstream Arcade": "https://www.antstream.com/",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Amazon Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "AMD Ryzen processor": "https://www.techradar.com/news/amd-ryzen-5000",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "something different to PS5 and Xbox Series X": "https://www.techradar.com/news/the-atari-vcs-offers-something-different-over-ps5-and-xbox-series-x-heres-why",
    "official Atari VCS website": "https://atarivcs.com/"
  }
}