{
  "source": "https://www.techradar.com/news/oppo-find-x4",
  "title": "Oppo Find X4 release date rumors, price, news and leaks",
  "category": "phones",
  "updated": "2021-12-01T02:40:54Z",
  "author": "tom-bedford",
  "summary": "Everything we know about the Oppo Find X4",
  "article": [
    "The Oppo Find X4 series of smartphones is expected to launch in early 2022, and it'll probably be one of the biggest gadget events of the early part of the year, alongside the Samsung Galaxy S22 and Xiaomi Mi 12 launches.",
    "Like with those phones, the Oppo Find X4 will probably bring us a few different phones, like a lower-cost mid-range Lite model and a top-end Pro device with impressive specs.",
    "The Oppo Find X3 Pro, Find X3 Neo and Find X3 Lite in 2021 brought us a true premium, mid-range and budget champion respectively, with each packing top specs for their price, and it's likely their Find X4 counterparts will be the same.",
    "Indeed, Oppo's Find X line has come to represent true premiumness, and the handsets rival the Xiaomi Mi, Samsung Galaxy S and OnePlus phones that come out around the same time - though so far those devices have tended to dank higher in our list of the best smartphones.",
    "We haven't heard much about the Oppo Find X4 series of phones just yet, but expect to get the full picture of the new handsets as they leak throughout the coming months.",
    "Oppo has confirmed its next-gen flagship phone will be revealed by the end of March 2022. It said it'd be introduced just Q1 2022, which ends at the end of March next year.",
    "An exact release date has yet to be confirmed, but if it's coming in those first three months it may be we see it at MWC 2022 that starts on February 28.",
    "Regarding prices, there will probably be a Pro, Neo and Lite entry in the line, as a top-end, mid-range and entry-level entry respectively, each with a different price, so the Oppo Find X4 line could hit a few price points.",
    "The Oppo Find X3 Pro cost Oppo Find X3 Pro will cost £1,099 / AU$1,699 (roughly $1500), the Neo started at £699 / AU$1,199 (around $975) and the Lite went for £379 / AU$749 (around $530), so we could see similar prices for the Oppo Find X4 entries.",
    "However, at least for the Pro models, we've consistently complained about the high prices of those phones, so hopefully we could see a lower cost.",
    "Little detail about the Find X4 series has been leaked so far, but we're starting to hear a trickle of news with a few new reports on what we can expect.",
    "The biggest leak so far is that the Find X4 may come with 125W charging. This is a technology that Oppo has already unveiled, but at the time it didn't confirm it'd be available on its upcoming flagship smartphones.",
    "According to tipster Digital Chat Station, some members of the Find X4 family will feature the technology. That would make this specific device the fastest charging smartphone in the world, unless any manufacturer beats Oppo to the title.",
    "We don't yet know which models would feature the tech, but history would suggest that this sort of feature would be exclusive to the Pro model. That may mean we see something like 65W charging on the standard Oppo Find X4.",
    "Another report from Digital Chat Station has claimed the Find X4 will come with a 6.7-inch display that has a resolution of 3216 x 1440. It'll feature a 120Hz refresh rate, much like the Find X3 and Find X3 Pro.",
    "Further information from that same source suggests one phone from the Find X4 line will come with a 50MP Sony IMX766 main camera, a 13MP telephoto camera capable of up to 2x optical zoom and a 3MP microscopic camera.",
    "The phone is confirmed to feature a Qualcomm Snapdragon 8 Gen 1 chipset, which is the next-gen flagship platform that many top-end phones of 2022 will feature.",
    "We don't yet know if this chipset will power all of the Oppo Find X4 series, but it has confirmed it'll be coming to the flagship device. While the name hasn't yet been confirmed, we expect this to be at least the Oppo Find X4 Pro.",
    "Here are some changes and new features we want to see in the Oppo Find X4 line, compared to previous Oppo phones and the range's competition.",
    "If we had to give some feedback on previous Oppo Find phones, especially the Pro models, our first response, written in size-72 font, in bold, and in all caps, would be 'make it cheaper'.",
    "The Find X Pro phones are incredibly pricey, and the Neo phones often aren't quite competitive for their costs either, and while there's lots to love about the phones, they can be hard to recommend to people who don't have bunches of cash ready to spend.",
    "If Oppo reduced the prices of its phones, even by a little bit, they'd be much easier to recommend as great value-for-money devices.",
    "The Oppo Find X2 Pro could be bought in a premium-feeling faux leather version (otherwise known as vegan leather), which felt great to hold and was easily grippable too. The Find X3 Pro line dropped this lovely-feeling material, for a standard glass back.",
    "We'd like to see the return of faux leather - it's a material that signifies the kind of premium-ness the Pro phone's price tag brings.",
    "Now that even mid-range phones have top specs, the design department is one of the few bastions top-end phones have left with which to prove themselves, and we'd like to see the Oppo Find X4 Pro win in this department.",
    "The Oppo Reno 10x Zoom was named after its hybrid 10x zoom lens, which was great for taking pictures of far-away things, and a few other Oppo phones (including the Find X2 Pro) used it too.",
    "The company has stopped using this camera though, and its Find X3 series didn't have amazing zoom capabilities as a result. Instead, the focus was on ultra-wide and, in the case of the Pro phone, microscope, photography.",
    "But zooming is, for some people, a really important part of the phone photography experience, and we'd like to see the camera brought back. If not, we'd at least like to see a similar alternative.",
    "While modern mobiles come with lots of internal storage, professionals or power-users will sometimes want even more space on their phone for apps, videos or photos.",
    "That's where MicroSD slots come in, as they can bump up a handset's internal storage to 1TB or even higher. However lots of companies have started dropping the slots from phones, Oppo included.",
    "We'd like to see some of the Find X4 phones - at least the Pro model, because as the name suggests that's designed for professionals - have the MicroSD slot again.",
    "Orange is arguably the best color for a smartphone - it's bold and vibrant, eye-catching and attractive. In second and third place come red and yellow, for the same reasons.",
    "The Oppo Find X2 Pro came in a lovely orange shade, making it one of the most attractive smartphones we'd seen, but the Find X3 Pro just came in blue. It was a little dull in comparison.",
    "We want an orange phone again, so you can see it a mile away."
  ],
  "headers": {
    "5": "Oppo Find X4 release date and price",
    "10": "Oppo Find X4 leaks and rumors",
    "18": "What we want to see",
    "19": "1. Some lower prices",
    "22": "2. Bring back the (faux) leather",
    "25": "3. A better zoom camera",
    "28": "4. A microSD slot",
    "31": "5. Orange"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Xiaomi Mi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Find X3 Neo": "https://www.techradar.com/reviews/oppo-find-x3-neo-review",
    "OnePlus phones": "https://www.techradar.com/news/best-oneplus-phones",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "biggest leak so far": "https://www.techradar.com/news/oppo-find-x4-may-be-the-fastest-charging-smartphone-ever",
    "Digital Chat Station": "https://m.weibo.cn/detail/4701185858866341",
    "Oppo Reno 10x Zoom": "https://www.techradar.com/reviews/oppo-reno-10x-zoom-review"
  }
}