{
  "source": "https://www.techradar.com/news/the-three-waves-of-the-it-infrastructure-industry",
  "title": "The three waves of the IT infrastructure industry",
  "category": "computing",
  "updated": "2021-06-18T14:08:19Z",
  "author": "matt-watts",
  "summary": "The third wave: pets, cattle, and data fabrics",
  "article": [
    "The IT infrastructure industry has experienced three waves over the past few decades, and I like to use animal analogies to introduce them. The first wave can be referenced using the pets versus cattle analogy, familiar to many in the IT industry. In the old days, servers were few, and treated like pets. We didn’t have many of them but the ones we had, we loved and cared for them. We gave them names and devoted our lives to making them happy.",
    "As technology became more fundamental to a business, so our cluster of servers became more of an army. We now had a herd of cattle rather than a menagerie of pets to look after. Virtualization exacerbated this trend as our physical servers started to become virtual machines (VMs) around the mid noughties. To cut a long story short, we no longer had the bandwidth to name and care for every last one of them.",
    "We are now in the third wave, which includes the rise of hyperscalers, and businesses beginning to consume technology ‘as a service’. Gone are the days when we worried about our pets or cattle. Data is now our most valuable asset.",
    "That’s enough about pets and cattle: the point is that businesses, even IT management teams, are not too concerned about infrastructure. The prolific nature of virtualization – with the majority of IT environments now largely virtualized – has led to commoditization. It’s now all about the data, services and applications running on that infrastructure. Furthermore, user expectations are increasing rapidly. Patience is not a virtue that technologists can bank on. Amazon.com discovered that a delay of 100 milliseconds would cost them 1% in global sales, while a delay of an entire second would cost $1.6 billion. That was a decade ago. And with the cut through of enterprise apps, online shops and food delivery services during the pandemic, our patience levels are only decreasing.",
    "This is social change, but what underpins it is technical acceleration. Cloud providers give developers access to new tools and capabilities, adding new ones all the time. Organisations are rapidly embracing new applications in order to find better business insights from data and the progress of technology is relentless. The largest SSD that NetApp ships is 30TB. It’s actually 30.6TB but we don’t bother to mention the 0.6. Five years ago, it was 0.4Tb. So, the largest SSD you could get five years ago was smaller than the bit we round down on current ones. In the next three years we expect capacities will increase to 240+ TB for a single SSD.",
    "Then we have storage class memories with a whole new level of performance, CPUs with more cores, memory capacities increasing, network bandwidth increasing, new protocols to connect servers to storage such as NVMe. Everything is changing faster than ever before, so how do you procure technology? How can you procure something that’s old after two years, outdated after three and obsolete after this? The answer for most businesses is migrating to the public cloud and paying for a level of service rather than worrying about how you deliver that performance yourself. With each wave we've seen the scope of data grow.",
    "During the first wave we only really considered data to be the things created by users or applications. In the second wave, VMs, their operating systems, and applications are also data. But as we move into the third wave more and more is becoming software-defined. And if it’s defined by software, it’s defined by data. Companies recognize that data is one of their most valuable assets. It’s now the data they treasure, care for, and protect – even aiming to become ‘data-driven’.",
    "Becoming data-driven can mean all things to all people. To some organisations it’s all about data science and analytics. How do we use data to help us make better decisions, products, and models? It is also about enabling DevOps and providing software developers with the tools and platforms they need to continuously churn out new apps and refresh existing ones. This is where infrastructure becomes relevant again with the conversation around containerization. If VMs are the cattle, containers are like insects, companies with large data estates can have tens of thousands of containers. Unlike VMs, containers are light and agile (like insects) and can be set up rapidly using software such as Kubernetes to orchestrate them. This is useful for enabling DevOps – essentially the practice of combining software development with IT operations to reduce the systems development life cycle.",
    "Another trend which is making businesses ‘data-driven’ rather than limited or committed to infrastructure is Anything as a Service (XaaS). In fact, companies can even take advantage of Infrastructure as a Service (IaaS), where they control the operating systems, storage and applications but don’t have to manage the underlying cloud infrastructure.",
    "This is complementary to Platform as a Service (PaaS) and of course Software as a Service (SaaS), which can refer to almost any enterprise application delivered via the cloud. All of these shifts align to the idea of going from being application driven to being function driven. IT is increasingly becoming about strategic initiatives and projects that are underpinned by technology but run by line of business. This may be functional groups looking at IoT projects, AI applications, genome sequencing, Industry 4.0 – all of the things we often refer to as being part of a company’s digital transformation.",
    "That’s why the concept of data fabrics is such a powerful one. If IT teams are less interested in the underlying infrastructure that apps and platforms are running on, the people using those applications – data scientists, software developers, analysts, etc – certainly don’t care about it. However, if you tell a data scientist that a data fabric would enable them to train multiple AI systems in parallel; move or replicate data to, from and within the cloud as and when required; and keep zero-overhead point-in-time copies of algorithm-training data, that’s a game-changer.",
    "In summary, the third wave of IT means that everything in the business is defined by data. Technology is no longer restricted to the IT department but is a key consideration for line of business users who view an application or platform as a means to a predetermined end. In this world, conversations around storage and underlying infrastructure are less relevant.",
    "However, the concept of a data fabric that allows an organisation to seamlessly manage data across physical, virtual, and cloud environments, is a compelling and powerful value proposition for any business pursuing digital transformation."
  ],
  "headers": {
    "3": "Data defines everything",
    "7": "Weaving the data fabric"
  },
  "links": {
    "IT infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "virtual machines": "https://www.techradar.com/best/best-virtual-machine-software",
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "applications": "https://www.techradar.com/best/best-apps-for-small-business",
    "Cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "DevOps": "https://www.techradar.com/best/best-devops-tools",
    "Kubernetes": "https://www.techradar.com/news/what-is-kubernetes",
    "PaaS": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}