{
  "source": "https://www.techradar.com/news/ps5-disc-walmart-free-upgrade",
  "title": "PS5 Disc surprise from Walmart: PS5 Digital buyers get upgraded – for free",
  "category": "gaming",
  "updated": "2021-06-22T14:33:50.550Z",
  "author": "matt-swider",
  "summary": "Walmart is offering PS5 Disc since it overestimated how much PS5 Digital inventory it had on hand. Here's what happened.",
  "article": [
    "Attention, Walmart shoppers: You may be getting a $499 PS5 Disc console instead of the $399 PS5 Digital version, according to an email sent by Walmart today.",
    "A Walmart executive sent an apology email to customers, according to followers who contacted our PS5 restock Twitter tracker Matt Swider with the news, explaining that the store oversold PS5 Digital consoles on Thursday. Walmart is sending those PS5 Digital buyers affected the more expensive PS5 Disc version – for free.",
    "This is one of the PS5 restock alerts Matt sends when there's Walmart stock. Some people who bought the PS5 Digital console got upgraded to the PS5 Disc version for free.",
    "\"The PlayStation 5 is such a hot item we sold more of the exact version you ordered than we had on hand,\" wrote Walmart Chief Customer Officer Janey Whiteside. \"We thought you deserved an upgrade, so we're sending you a PS5 with a disc drive – no extra charge!\"",
    "The good news is Walmart promises there will be no slowdown on these PS5 orders. Of course, according to our 24/7 PS5 restock tracking experience, Walmart tends to ship the slowest among US retailers, especially compared to Antonline, Sony Direct, and GameStop (with Best Buy and Target allowing for in-store pickup).",
    "\"Nothing else has changed and you'll still receive your order on time,\" said the email. \"We apologize for the mix-up, but hope you'll enjoy the upgrade on us.\"",
    "There's a simple explanation of why Walmart shoppers are suddenly getting the PS5 Disc console, even though Disc inventory was never offered on Thursday. It's not just that Walmart has a habit of overselling consoles when the add-to-cart button is live. Where did the Disc consoles come from?",
    "It turns out Sam's Club, owned by Walmart, had a PS5 Disc restock (in bundle form) a few hours after Walmart had the Digital version – technically on Friday morning. The theory from fellow restock tracker Cameron Ritz is that Walmart only sold the PS5 Digital console, saving the more appealing Disc version for club-store bundles (and we all know bundles make more money).",
    "So the retailer's parent company did have PS5 Disc consoles, and probably some on hand, as Sam's Club orders often have more than a few cancelations. Those may have been shuttled to Walmart buyers as a way to prevent shipment delays for affected PS5 Digital buyers.",
    "Walmart often has a PS5 restock on Thursdays (but not every Thursday) at 3pm EDT and, recently, at random times in the middle of the night at 3am EDT (no specific pattern to the date, sorry). PS5 restock tracker Matt Swider often knows about Walmart PS5 restock news on Thursdays ahead of time (usually just after noon time).",
    "Instead, you should turn your attention to a potential Best Buy PS5 restock. The US electronics retailer has been teasing the add-to-cart page for the last week (it hasn't made the console buyable, but the button does flash yellow, indicating Best Buy is testing things out).",
    "Best Buy also added a new bundle, with the newly launched game Ratchet & Clank: A Rift Apart, two weeks ago. That's another sign Best Buy is prepping console inventory online.",
    "Here's what a PS5 restock alert looks like when it goes out:",
    "Being able to buy a PS5 console has gotten easier in the last week: we saw Walmart, GameStop, Antonline, and Sony Direct do a restock last week. In fact, we were able to connect more than 50,000 people with a next-gen console as of this week.",
    "Trust and credibility: Matt has helped 50,00 people get a next-gen console in recent weeks with his in-stock Twitter alerts and restock news reporting."
  ],
  "headers": {
    "6": "Where did the Walmart PS5 Disc consoles come from?",
    "9": "When is the next PS5 restock?"
  },
  "links": {
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "Cameron Ritz": "https://twitter.com/CameronRitz",
    "Ratchet & Clank: A Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart"
  }
}