{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-ultra-leak-shows-off-a-phone-with-120x-zoom-and-a-second-screen-for-selfies",
  "title": "Xiaomi Mi 11 Ultra leak shows a phone with 120x zoom and a second screen for selfies",
  "category": "phones",
  "updated": "2021-02-12T11:19:16Z",
  "author": "bodhisatwa-ray",
  "summary": "It has a massive camera bump",
  "article": [
    "Earlier this week we heard all about the Xiaomi Mi 11, and while we've seen rumors of a Mi 11 Pro and Mi 11 Lite neither of these handsets have been confirmed. A new leak suggests there's also a fourth phone expected to join Xiaomi's lineup; the Mi 11 Ultra.",
    "According to a video by a YouTuber called Tech Buff, the Xiaomi Mi 11 Ultra features a camera with 120X zoom and a mini secondary screen. This tiny screen is embedded in the camera module on the back of the phone, and it's thought to act as a viewfinder for when you're taking selfies with the phone's main camera.",
    "The YouTube channel posted a video where the presenter shows off a handset that they're calling the Mi 11 Ultra. While there are some questions about the authenticity of the details shared in the video, the smartphone shown seems to be authentic.",
    "The video seems to have been made private by the channel, but there is a mirror of the video that you can watch below.",
    "While there is no way to authenticate Tech Buff's sources, the smartphone shown has the model number 'M2102K1G'. A smartphone with the same model number has received certification from bodies such as India’s BIS and the EU’s EEC. That is a good sign that this leak is legitimate, but it isn't a gurantee.",
    "The camera shown in the video features a 120x zoom, which is consistent with its predecessor - that's the the Mi 10 Ultra. The video shows the the UI in a rather inconsistent manner, but it seems to run on a global build of Xiaomi's MIUI 12.5.",
    "The smartphone has a huge camera bump and has a triple camera setup with a 50MP main sensor as well as a 48MP wide-angle and 48MP telephoto zoom shooter.",
    "The YouTuber shows off two different color variants of the Mi 11 Ultra; one white and the other black.",
    "As for specs, the video says the handset has a 6.8-inch quad-curved OLED display with a WQHD+ resolution and 120Hz adaptive refresh rate. The display has a layer of Corning Gorilla Glass Victus for protection, plus there is a 20MP selfie camera inside a hole-punch cutout. It also has an IP68 rating for dust and water resistance.",
    "He also mentions a 5,000mAh battery, speakers tuned by Harman/Kardon, a Qualcomm Snapdragon 888 chipset and both 67W wireless and 67W wired charging.",
    "The Xiaomi Mi 10 Ultra was only available in China, so it may be this is a handset that we won't see released in other markets around the world. We will have to wait to validate these specs, but these seem to be similar to what we've come to expect from the Xiaomi Mi 11 family."
  ],
  "headers": {},
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Mi 11 Pro": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "YouTube channel": "https://www.youtube.com/channel/UCXm4cCkjikHqZYY5YUVY_GQ",
    "video": "https://youtu.be/tk2sZRd7hjQ",
    "Mi 10 Ultra": "https://www.techradar.com/news/xiaomi-mi-10-ultra",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888"
  }
}