{
  "source": "https://www.techradar.com/news/you-can-now-rent-an-apple-m1-mac-mini-as-a-server-to-run-your-own-website",
  "title": "You can now rent an Apple M1 Mac mini as a server to run your own website",
  "category": "computing",
  "updated": "2021-01-13T10:05:51Z",
  "author": "barclay-ballard",
  "summary": "There are a few different configurations on offer",
  "article": [
    "Apple fans that want to experience the company’s M1 Mac mini for themselves can now rent the device as a server from MacStadium. The option of hosting M1 Mac mini servers in the cloud is likely to be of interest to developers and anyone that wants to explore new web hosting opportunities.",
    "MacStadium has plenty of experience offering Mac server hardware but this is the first time it has been able to offer customers the option of renting the new M1-powered Mac mini. The company is known for its competitive prices as well and can offer monthly price plans starting from $109 for the use of an M1 Mac mini with 8GB of RAM and 256GB of storage.",
    "In terms of other configurations offered by MacStadium, customers have the choice of three data center locations: Las Vegas and Atlanta in the US, and Dublin, Ireland. They can also choose to purchase external USB and network storage and gain extra protection by signing up for the Cisco Firewall security solution.",
    "Apple’s decision to switch to its own processors, designed specifically for Mac products, created quite the splash last year. This was followed up by more headlines once performance benchmarks started to be revealed.",
    "While there have been some compatibility concerns following Apple’s move away from Intel-manufactured chips, these have largely been put to rest through assurances that the Rosetta 2 emulator should manage the majority of issues.",
    "Although other cloud providers will soon start offering M1 Mac mini servers, if they haven’t already, MacStadium does have a good track record in this area. In addition to offering a custom private cloud environment, the firm also has a 24/7 support team ready to help should any issues arise."
  ],
  "headers": {
    "3": "Rental specialists"
  },
  "links": {
    "M1 Mac mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "MacStadium": "https://www.macstadium.com/configure?p=minig5&c=VGS2",
    "own processors": "https://www.techradar.com/news/apple-m1-chip",
    "performance benchmarks": "https://www.techradar.com/news/apple-m1-gives-a-glimpse-of-pro-credentials-as-it-shines-in-enterprise-benchmark"
  }
}