{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-pro-and-ultra-launching-soon-to-rival-the-oneplus-9-pro",
  "title": "Xiaomi Mi 11 Pro and Ultra launching soon to rival the OnePlus 9 Pro",
  "category": "phones",
  "updated": "2021-03-23T11:28:34Z",
  "author": "axel-metz",
  "summary": "Leaks and sneak peeks",
  "article": [
    "The Xiaomi Mi 11 Pro and Mi 11 Ultra might appear at the company’s March 29 launch event, according to a big leak, suggesting we could see the super-premium Android phones very soon.",
    "The news comes after recent confirmation of a presumably-global 'mega launch' event, which lacked details as to which devices would be officially revealed.",
    "Now, though, it looks like Xiaomi plans to unveil at least two new flagship devices in its Mi 11 range, after a tweet shared by tech YouTuber Ben Geskin showed promotional material mentioning both the Mi 11 Pro and Mi 11 Ultra by name.",
    "It’s a little unclear whether this means the devices are only launching in China. While Xiaomi’s recent confirmation of a March 29 event was shared via the company’s global Twitter account, the promotional material describing the launch of the Mi 11 Pro and Mi 11 Ultra seems China-specific.",
    "In a follow-up tweet, Geskin does suggest the devices “may launch globally too”, despite the promotional material clearly targeting a Chinese audience, so it seems likely that similar material will be shared via Xiaomi’s global Twitter account in the coming days, ahead of the March 29 launch event.",
    "With the OnePlus 9 Pro scheduled to launch globally on March 23, it would make sense for Xiaomi to debut its premium phones at a similar time in the year, as the two Pro devices will likely have similar specs.",
    "Interestingly, there’s no mention of the Xiaomi Mi 11 Lite in this promotional material.",
    "We’ve heard rumors of a third new entry in the Mi 11 range, which we expect to be an affordable variant dubbed the Mi 11 Lite, but there’s been no official confirmation of the device’s name, or indeed whether it’s on the way soon.",
    "We’re pretty certain it is, though, since a reliable leaker shared a comprehensive look at the Mi 11 Lite’s specs and design on Twitter shortly after Xiaomi confirmed the date of its global launch event.",
    "These leaks detail things such as the device’s width, weight, chipset, display, battery, camera and more – and if true, suggest the Xiaomi Mi 11 Lite could be one of the slimmest phones in recent times.",
    "The device has also been certified in Singapore, which is something that would usually happen close to launch, so it’s not unlikely that we’ll see it officially unveiled come the end of the month.",
    "We’ve rounded up everything we know about the Xiaomi Mi 11 Lite here, but given that its more premium siblings have been confirmed to launch – in China, at least – on March 29, we’re fairly confident we’ll have more information soon."
  ],
  "headers": {
    "6": "Lite on details"
  },
  "links": {
    "Xiaomi Mi 11 Pro": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "'mega launch' event": "https://www.techradar.com/news/xiaomi-mi-11-pro-ultra-and-lite-launch-event-teased-coming-soon",
    "Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Ben Geskin": "https://twitter.com/BenGeskin/status/1374247468607619074",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-review",
    "launch globally on March 23": "https://www.techradar.com/reviews/oneplus-9-review",
    "Xiaomi Mi 11 Lite": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "certified in Singapore": "https://www.techradar.com/news/xiaomi-mi-11-lite-release-date-looks-to-be-soon-with-two-versions-landing",
    "here": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review"
  }
}