{
  "source": "https://www.techradar.com/news/upcoming-moto-g-phone-could-have-5g",
  "title": "Motorola could have another cheap 5G phone",
  "category": "phones",
  "updated": "2021-03-11T14:28:43.694Z",
  "author": "tom-bedford",
  "summary": "The Moto G40 could be coming",
  "article": [
    "Motorola only has one cheap 5G phone so far, despite being known for affordable devices, but that could be about to change. With the launch of the Moto G10 and Moto G30, a new generation of Motorola's affordable smartphone line was kicked off, and we've started hearing about new phones in this wave.",
    "As spotted by MyFixGuide, the Moto G40 has received certification in China - and it's set to have 5G. Judging by the name, this will be a slightly specced-up version of the G30, with possibly only a few tweaks (other than 5G of course).",
    "Other than the name and data connectivity, the only thing we can tell from the listing is that the phone will have 10W charging, which is pretty slow compared to other affordable phones.",
    "There aren't many low-cost 5G phones, and even Motorola has only put out one, the Motorola One / Moto G 5G Plus (it had different names in different regions). Some of Motorola's competitors are beating it in this regard.",
    "It's a little curious that the G40, one of the lower-end members of the new Moto G series, could have 5G, but perhaps that implies many of its other upcoming phones will too.",
    "Could those next handsets be the G50, G70, G90 or something similar? We don't yet know, but we're expecting to see more members of this family in future.",
    "There's no indication of when the Moto G40 could launch, but Motorola rarely uses any kind of regular release pattern for its smartphones, so we'll just have to see it when we see it."
  ],
  "headers": {
    "3": "A new cheap 5G phone"
  },
  "links": {
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review",
    "Moto G30": "https://www.techradar.com/reviews/moto-g30",
    "MyFixGuide": "https://www.myfixguide.com/moto-g40-bags-3c-certification/",
    "Motorola One / Moto G 5G Plus": "https://www.techradar.com/reviews/moto-g-5g-plus-review"
  }
}