{
  "source": "https://www.techradar.com/news/even-the-mafia-is-getting-involved-in-phishing-attacks-now",
  "title": "Even the Mafia is getting involved in phishing attacks now",
  "category": "computing",
  "updated": "2021-09-21T02:30:52Z",
  "author": "anthony-spadafora",
  "summary": "Criminal organizations have adopted tactics used by cybercriminals",
  "article": [
    "Cybercriminals have raked in millions from phishing attacks which is why it's not a big surprise that the Italian Mafia has adopted similar tactics in recent years.",
    "According to a new press release from Europol, the Spanish National Police with support from the Italian National Police, Europol and Eurojust have dismantled an organized crime group linked to the Italian Mafia that was involved in online fraud, money laundering, drug trafficking and property crime.",
    "However, the suspects in this case also used phishing attacks and other types of online fraud including SIM swapping and business email compromise (BEC) to defraud hundreds of victims. In the last year alone, they were able to bring in €10 million ($11.7 million) in illegal funds before laundering this money through a wide network of money mules and shell companies.",
    "In total, the operation resulted in 106 arrests that were mostly in Spain with some in Italy, 16 house searches and 118 bank accounts frozen. Law enforcement agencies also seized a number of electronic devices as well as 224 credit cards, SIM cards, POS systems and a marijuana plantation.",
    "The large criminal network disrupted by the Spanish National Police and Italian National Police was very well organized in a pyramid structure that included different specialized areas and roles.",
    "Among the members of the criminal group, there were computer experts who created the phishing sites used in their attacks and carried out cyber fraud. However, there were also recruiters and organizers responsible for finding mules to move the stolen money and money laundering experts including several cryptocurrency experts.",
    "Most of the suspected members of the group are Italian nationals including some who have ties to the Italian Mafia. The operation was based out of Tenerife in the Spain's Canary Islands and the suspects tricked their victims (many of whom were Italian nationals) into sending large sums to bank accounts controlled by the criminal network. This money was then laundered through a wide network of money mules and shell companies.",
    "Now that the Italian Mafia has shown that it's possible to use tactics commonly employed by cybercriminals, other criminal organizations may follow suit and try their hand at becoming cybercriminals themselves.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Becoming cybercriminals"
  },
  "links": {
    "phishing attacks": "https://www.techradar.com/news/just-one-mobile-phishing-attack-could-cost-your-business-hundreds-of-millions",
    "press release": "https://www.europol.europa.eu/newsroom/news/106-arrested-in-sting-against-online-fraudsters",
    "Europol": "https://www.techradar.com/news/europol-shuts-down-the-worlds-largest-dark-web-marketplace",
    "SIM swapping": "https://www.techradar.com/news/coinbase-customers-up-in-arms-after-hackers-drain-crypto-wallets",
    "BEC": "https://www.techradar.com/news/proofpoints-new-solutions-will-help-defend-against-bec-attacks",
    "POS systems": "https://www.techradar.com/news/the-best-pos-system",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/europol-links-italian-mafia-to-million-dollar-phishing-scheme/"
  }
}