{
  "source": "https://www.techradar.com/news/dji-releases-redefine-flying-launch-teaser-is-this-the-rumored-dji-fpv-drone",
  "title": "DJI releases 'redefine flying' launch teaser, is this the rumored DJI FPV drone?",
  "category": "cameras",
  "updated": "2021-08-25T12:00:22Z",
  "author": "mark-wilson",
  "summary": "We have an official date for an exciting new DJI launch",
  "article": [
    "DJI has posted an exciting teaser for a launch that's taking place next week – along with a dramatic video that suggests it could be for the heavily leaked DJI FPV drone (or 'First Person View' drone).",
    "The Twitter post confirms that the drone giant will be hosting a launch event on March 2 at 9am EST / 2PM GMT, which works out as midnight on March 3 for those in Australia.",
    "The silhouette of the drone in the teaser appears to match the many leaks we've seen for the DJI FPV drone, which included an unboxing video on Twitter, picked up by regular DJI leaker @OsitaLV.",
    "But even more exciting than seeing the first (albeit silhouetted) official image of the drone is the sample video on the official DJI site . The looping footage shows some spectacular, soaring footage over landscapes, drifting cars and motocross riders.",
    "The footage is more reminiscent of a GoPro launch than the traditionally higher-altitude DJI ones, but it appears to confirm that this launch is indeed going to take its drones in a new direction.",
    "So if this launch is indeed for the DJI FPV drone, who will the new flying camera be aimed at?",
    "FPV (First Person View) drones are traditionally built for racing, which is a sport that's been growing exponentially for the past few years. Pilots wear a set of digital goggles, which gives them a birds-eye view from their drone and, thanks to high-quality cameras and zero-latency transmission, lets them fly it around with precision accuracy.",
    "But the footage released by DJI on its site suggests that the new drone it's launching will be as much for aerial filmmaking as racing. It's likely to be for 'cinewhoop' style videos and filmmakers who are looking to capture exciting, high-speed shots that aren't simply possible with DJI's larger or less speedy drones.",
    "DJI drones are also renowned for their user-friendliness, thanks to features like automatic obstacle avoidance, so it'll be interesting to see how the FPV drone (if that's what this launch is indeed for) tackles this. Given the ten-second clip so far, we're certainly excited to find out – and there are now only days until DJI's official reveal."
  ],
  "headers": {},
  "links": {
    "DJI FPV drone": "https://www.techradar.com/reviews/dji-fpv-drone",
    "Twitter post": "https://twitter.com/DJIGlobal/status/1364560713323192320",
    "on Twitter": "https://twitter.com/OsitaLV/status/1360817679557402624",
    "official DJI site": "https://www.dji.com/uk/teaser?utm_source=twitter_organic&utm_campaign=teaser-flash&utm_medium=social&utm_term=HQ"
  }
}