{
  "source": "https://www.techradar.com/news/the-next-major-iphone-5g-upgrade-is-tipped-to-arrive-in-2023",
  "title": "The next major iPhone 5G upgrade is tipped to arrive in 2023",
  "category": "phones",
  "updated": "2021-05-10T09:01:22Z",
  "author": "david-nield",
  "summary": "5G modems are going in-house at Apple",
  "article": [
    "Most of the current iPhone chatter concerns the iPhone 13 that we're expecting to see in September – it's said to come with an upgraded screen and an improved camera – but we can now officially open a rumors and leaks file for the iPhone 15 as well.",
    "Mobile analyst Ming-Chi Kuo – one of the most reliable Apple tipsters in the business – has gone on record (via MacRumors) as saying that custom 5G modems for the iPhone will start appearing in 2023, just in time for the iPhone 15.",
    "That will mean Apple will no longer have to rely on the component that it currently sources from Qualcomm. The iPhone 12 series of handsets was the first from Apple to come with 5G capabilities on board, so the 2023 refresh could be the first to have a significant step up in terms of 5G performance.",
    "At this stage it's hard to say exactly what the switch might mean for users and the 5G performance they can expect, but making its own 5G modems should enable Apple to improve data transfer speeds, reduce latency and improve battery life, as the component can be specifically optimized alongside the rest of the internal hardware.",
    "This news won't come as a surprise to seasoned industry watchers, although the predicted timing is interesting. Ever since Apple bought Intel's modem chip business in 2019 it's been clear that 5G tech development was eventually going to be done in-house at Apple.",
    "Previous predictions had suggested that an Apple phone with an Apple-made 5G modem inside it could appear in 2022, but that seems optimistic now – Kuo says the chips will appear in 2023 \"at the earliest\", so it could be later than that.",
    "Apple has been putting its own bespoke silicon inside the iPhone for more than a decade now, and recently started doing the same on the computing side of the business too – reducing its reliance on third-party suppliers and allowing every part of the hardware and software setup to be tightly integrated and fully optimized for performance and efficiency.",
    "For the time being though, Qualcomm will continue to supply the 5G modems for the iPhone. All the expected models of the iPhone 13 are of course going to come with the technology on board, and it looks as though we could be in line for some aesthetic changes this year as well."
  ],
  "headers": {
    "4": "Chipping away"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "MacRumors": "https://www.macrumors.com/2021/05/10/kuo-apple-designed-5g-modem/",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "bought Intel's modem chip business": "https://www.techradar.com/news/intel-confirms-modem-chip-business-sale-to-apple",
    "Previous predictions": "https://www.techradar.com/news/5g-iphone-in-2022-could-use-apples-own-modem-and-be-all-the-better-for-it",
    "on the computing side": "https://www.techradar.com/news/apple-m1-chip",
    "some aesthetic changes": "https://www.techradar.com/news/iphone-13-dummy-unit-shows-off-smaller-notch-larger-cameras"
  }
}