{
  "source": "https://www.techradar.com/news/do-your-wireless-headphones-work-with-the-nintendo-switch",
  "title": "Do your wireless headphones work with the Nintendo Switch?",
  "category": "audio-visual",
  "updated": "2021-09-15T13:53:21Z",
  "author": "olivia-tambini",
  "summary": "Nintendo's Bluetooth Audio feature may have some issues",
  "article": [
    "Are you experiencing problems using the new Bluetooth audio feature on your Nintendo Switch? If so, you're not the only one.",
    "Over four years since its launch, the Nintendo Switch finally comes with Bluetooth audio support, allowing you to use the handheld console with a pair of wireless headphones for cable-free sound.",
    "It's a feature users have been practically begging for since the Switch first appeared in 2017 – but now that it's here, we've noticed some issues with the technology.",
    "Having tested it out for ourselves, we found the the over-ear Sony WH-1000XM4 sounded great, while the true wireless Sony WF-1000XM4 suffered from a persistent crackling sound.",
    "We had the same problem using the Beats Studio Buds; meanwhile, the on-ear Beats Solo Pro worked just fine.",
    "Initially, we thought the issue may be down to a problem with true wireless earbuds specifically, but using the Switch with the Lypertek PurePlay Z3 didn't come with any audio distortion at all. Saying that, while using the newer PurePlay Z3 2.0, we did notice a little crackling and some latency issues (though Nintendo does warn that there may be a lag between audio and video on its help page for the Bluetooth audio feature).",
    "Interestingly, all the models that encountered distortion issues use the latest Bluetooth 5.2 wireless transmission standard and come with active noise cancellation.",
    "Some users have also reported only able to connect one earbud at a time, very low volume levels, and difficulty with pairing.",
    "A Nintendo spokesperson told us that \"the profile and codec which the feature is compatible with will be A2DP profile and the SBC codec and therefore if the audio device is compatible with the A2DP profile and SBC codec, it should be compatible with a Nintendo Switch system\".",
    "In other words, if your wireless headphones support basic Bluetooth - which they all do – they should work with the Nintendo Switch.",
    "One Reddit user may have found a fix for the issue. u/Lyxess said that their Switch \"sounded terrible\" with the Sony WF-1000XM3 wireless earbuds, with \"latency and crackles and bad audio\". However, after connecting the earbuds to their phone and changing the volume setting in Sony's Headphone Connect app, as well as turning off their adaptive noise cancellation setting, Lyxess found the Bluetooth audio feature worked without a hitch.",
    "If you find your wireless headphones sound too quiet, it's also worth heading into the system settings on your Nintendo Switch and disabling 'limit max volume'.",
    "If you're having difficulty using Bluetooth headphones or earbuds with your Nintendo Switch, we'd love to hear from you – send us an email TechRadar at news@techradar.com with the subject line 'Nintendo Switch Bluetooth Audio'."
  ],
  "headers": {
    "10": "Are there any fixes?"
  },
  "links": {
    "new Bluetooth audio feature on your Nintendo Switch": "https://www.techradar.com/news/nintendo-switch-finally-gets-bluetooth-audio",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Having tested it out for ourselves": "https://www.techradar.com/news/nintendo-switch-finally-gets-bluetooth-audio",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Beats Studio Buds": "https://www.techradar.com/reviews/beats-studio-buds-review",
    "Beats Solo Pro": "https://www.techradar.com/reviews/beats-solo-pro",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Lypertek PurePlay Z3": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "PurePlay Z3 2.0": "https://www.techradar.com/reviews/lypertek-pureplay-z3-20-review",
    "help page": "https://www.nintendo.co.uk/Support/Nintendo-Switch/How-to-Add-and-Manage-Bluetooth-Audio-Devices-2040147.html",
    "u/Lyxess": "https://www.reddit.com/r/NintendoSwitch/comments/poeuqy/the_latest_nintendoswitch_update_is_now_available/hcxdpxu?utm_source=share&utm_medium=web2x&context=3",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925"
  }
}