{
  "source": "https://www.techradar.com/news/sony-xperia-5-ii-might-soon-land-in-pink",
  "title": "Sony Xperia 5 II might soon land in pink",
  "category": "phones",
  "updated": "2021-02-03T09:40:13Z",
  "author": "james-rogerson",
  "summary": "Out now in Germany, Spain and Italy",
  "article": [
    "If you’re in the market for a Sony Xperia 5 II then so far outside Asia your color options have been limited to black, blue, or grey – and not everywhere even has the grey version, but soon you might be able to buy it in pink too.",
    "That’s because a pink shade which previously was exclusive to Asia is now being sold in Sony’s German, Italian, and Spanish online stores.",
    "So far it’s not available in other regions like the US or the UK, but the fact that the pink shade has made it out of Asia suggests it might only be a matter of time.",
    "There’s also an extra bonus for buyers of the Sony Xperia 5 II in pink, as currently it comes bundled with the Sony WF-1000XM3 wireless earbuds at no extra cost. Usually these retail for $230 / £220 / AU$399, so that’s quite a saving, and we awarded them five stars in our review.",
    "Of course, there’s no guarantee that these earbuds will be included with the pink Xperia 5 II in other regions if and when it lands in them, but there’s a good chance they will.",
    "Still, with or without the earbuds the Sony Xperia 5 II is worth buying – we awarded it four and a half stars in our review, praising its great cameras, easy-to-use design, and 120Hz screen.",
    "And once the pink model goes global (if it does) we’ll just be waiting for the purple version of the Sony Xperia 5 II, which is currently exclusive to Japan.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Sony Xperia 5 II": "https://www.techradar.com/reviews/sony-xperia-5-ii-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "GSMArena": "https://www.gsmarena.com/sony_now_sells_the_xperia_5_ii_in_pink_in_europe-news-47536.php"
  }
}