{
  "source": "https://www.techradar.com/news/apple-macs-with-m1-chip-reportedly-hit-by-annoying-screensaver-bug",
  "title": "Apple Macs with M1 chip reportedly hit by annoying screensaver bug",
  "category": "computing",
  "updated": "2021-01-19T10:05:54Z",
  "author": "darren-allan",
  "summary": "Randomly interrupts whatever you’re doing",
  "article": [
    "Apple Macs which have the new M1 chip inside have been suffering reported issues with Bluetooth devices, and now further reports are emerging of problems with a bug that randomly pops up the screensaver – with no easy way to dismiss it.",
    "MacRumors highlighted the problem which seems to be affecting folks who have multiple user accounts on their Mac, and is apparently a bug in macOS Big Sur’s Fast User Switching system. The latter allows for convenient and quick switching between accounts, requiring no logging out (note that this feature has to be enabled in Big Sur, though).",
    "The bug causes the screensaver to activate seemingly randomly – regardless of whether you use it or not – with no way to dismiss it, save for closing the affected MacBook and reopening the device (or pressing the power button, or using Alt-Command-Q).",
    "A denizen of Reddit observes: “I have a brand new M1 MacBook Pro running macOS 11.1 and I’m having a small yet annoying issue. At random times, while in the middle of working, my machine will suddenly activate the screensaver. I cannot click out of it, and my keyboard does nothing.",
    "“The only fix I’ve found is to close the MacBook for 4-5 seconds, then open it and upon reloading in, it fixes itself. This happens randomly .... sometimes once a day, sometimes 5+ times a day.”",
    "As mentioned, affected users have observed that you don’t need to have your screensaver turned on for this to happen – the common factor seems to be having multiple accounts and enabling Fast User Switching. Turning the latter off solves the problem, but obviously leaves you without the benefits of quick account switching.",
    "Reports of the issue have come in from users of M1-powered MacBooks (both models) and the new Mac mini (the latter folks obviously can’t use the ‘close the lid’ solution), across all released versions of macOS Big Sur, too.",
    "Whether Apple is working on a fix or not, we can’t be sure, but we can be hopeful – and indeed there are a couple of users out there who have said that this screensaver problem is fixed in macOS Big Sur’s latest beta (11.2). Someone on the MacRumors forum noted: “This issue annoyed me for weeks, but I just realised I haven’t seen it in a while. I’m running the 11.2 beta update, maybe that fixes it?”",
    "And another post on the Apple.com forums says that “this bug is fixed in 11.2 Big Sur version”.",
    "So those who are suffering at the hands of this particular bugbear might just see it cured with the arrival of version 11.2 of Big Sur. Fingers crossed that’s the case, and for those who are experiencing other issues with Big Sur outside of this, be sure to check out our article that discusses how to fix the most common problems with macOS 11."
  ],
  "headers": {
    "7": "Beta fix?"
  },
  "links": {
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "suffering reported issues with Bluetooth devices": "https://www.techradar.com/news/apple-macs-with-m1-chip-could-soon-get-a-fix-for-reported-bluetooth-issues",
    "MacRumors": "https://www.macrumors.com/2021/01/18/m1-macs-fast-user-switching-screensaver-bug/",
    "Reddit": "https://www.reddit.com/r/MacOS/comments/kj4ova/big_sur_screensaver_bug/",
    "Mac mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "macOS Big Sur": "https://www.techradar.com/how-to/how-to-download-and-install-macos-11-big-sur",
    "MacRumors forum": "https://forums.macrumors.com/threads/some-m1-macs-affected-by-fast-user-switching-screensaver-bug.2280806/",
    "Apple.com forums": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1298752474716263000&sharedId=trd-us&u=https%3A%2F%2Fdiscussions.apple.com%2Fthread%2F252083925%3Fpage%3D7",
    "how to fix the most common problems with macOS 11": "https://www.techradar.com/how-to/macos-11-big-sur-problems-how-to-fix-the-most-common-issues"
  }
}