{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-alternatives",
  "title": "Samsung Galaxy S21 Ultra alternatives: great phones without ultra price tags",
  "category": "phones",
  "updated": "2021-01-24T09:00:06Z",
  "author": "tom-bedford",
  "summary": "Some great low-cost alternatives",
  "article": [
    "It's official: the Samsung Galaxy S21 Ultra has been crowned TechRadar's best phone you can buy, thanks to its good-looking screen, camera features and stylus compatibility.",
    "The vast majority of people can't afford a $1,199 / £1,149 / AU$1,849 phone, though, but if you're in the market for a great handset that won't cost you two arms, two legs and all your internal organs, there are some options.",
    "So below, we've drawn up a list of all the worthy Samsung Galaxy S21 Ultra alternatives that have the same features, or at least one of the key selling points of the Ultra, without the staggering price.",
    "If you're keen on the idea of using a smartphone stylus, but on an affordable smartphone, Motorola has some options for you. The Moto G Stylus (or G Pro in some regions, including the UK) has such a peripheral, so you can sketch or write notes.",
    "This phone costs a fraction of the Galaxy S21 Ultra's price, and while its specs are much lower too - you won't get the Ultra's processing power or camera smarts - it still works well in terms of stylus functionality.",
    "The Moto G Stylus 2021 has been unveiled but you can't buy it just yet, so for now, the 2020 model is a great choice for an affordable stylus phone.",
    "Check out our full Moto G Pro / Moto G Stylus review",
    "If you want a fairly high-end Samsung phone but without the Galaxy S21 Ultra's ultra-high price, then the Galaxy S20 Fan Edition (or FE, for short) might be for you. This is a lower-cost version of the Galaxy S20 from 2020, but unlike that flagship the S20 FE is still sold by the company.",
    "The phone has some great rear cameras, a powerful processor, and a 6.5-inch FHD+ screen, though it comes with a plastic build and no curved-edge screen.",
    "Sure, it's not a budget phone by any means, with a premium price that hasn't gone down much since launch. But when compared to the Galaxy S21 Ultra, anything looks affordable.",
    "Check out our full Samsung Galaxy S20 FE review",
    "There might be a few people reading this article who don't take issue with the Samsung Galaxy S21 Ultra's eye-watering price, but instead with the fact it's an Android phone at all.",
    "If you're more a fan of iOS devices, then the iPhone 12 Pro Max is the top-end handset available to you right now. It has a 6.7-inch display, three rear cameras, and a day-long battery life.",
    "The iPhone 12 Pro Max price actually starts just below the Galaxy S21 Ultra's so it's slightly more affordable, but not by much.",
    "Check our our full iPhone 12 Pro Max review",
    "If you like big-screen phones, you have quite a few options available, but one that mixes good specs and a value-for-money prospect is the Motorola Edge. Its sibling, the Edge Plus, has the same screen size but better specs and a higher price, if you prefer.",
    "Both Motorola Edge phones have 6.7-inch displays, which is actually a touch smaller than the Galaxy S21 Ultra's 6.8, but not by much. Moreover, these phones are much easier to hold - they have 21:9 aspect ratios, so the displays are taller but thinner. This makes it much easier to grip them in one hand.",
    "Sure, the Motorola Edge screen doesn't look quite as good as the S21 Ultra's. But with the amount of money you're saving, that's no surprise.",
    "Check out our full Motorola Edge review Check out our full Motorola Edge Plus review",
    "If you're drawn to the Samsung Galaxy S21 Ultra because of its camera prowess, you can find some competitors on our list of the best camera phones, in particular the Google Pixel 5. Sure, the Pixel isn't at the top of that list, but it's the first in our ranking that doesn't have a premium price.",
    "Google has long been a heavyweight in the camera phone scene, with smart AI optimization and software to take great photos. We found night photography particularly great, and the Pixel 5 also has loads of built-in editing tools to make the most of your snaps.",
    "The Google Pixel 5 doesn't compare to the Galaxy S21 Ultra in many regards, but if you're looking for a great camera phone and don't care about anything else, it's a strong alternative.",
    "Check out our full Google Pixel 5 review."
  ],
  "headers": {
    "3": "Moto G Stylus / G Pro - for stylus compatibility",
    "7": "Samsung Galaxy S20 Fan Edition - for Samsung fans",
    "11": "iPhone 12 Pro Max - for if price isn't the issue",
    "15": "Motorola Edge - for fans of big-screen phones",
    "19": "Google Pixel 5 - for camera fans"
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "best phone": "https://www.techradar.com/news/best-phone",
    "Moto G Stylus 2021": "https://www.techradar.com/reviews/moto-g-stylus-2021",
    "Moto G Pro / Moto G Stylus review": "https://www.techradar.com/reviews/moto-g-pro-review",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S20 FE review": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "iPhone 12 Pro Max review": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Motorola Edge review": "https://www.techradar.com/reviews/motorola-edge-review",
    "Motorola Edge Plus review": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone",
    "Google Pixel 5 review.": "https://www.techradar.com/reviews/google-pixel-5"
  }
}