{
  "source": "https://www.techradar.com/news/did-this-oneplus-9t-teaser-just-suggest-the-phone-isnt-canceled-after-all",
  "title": "Did this OnePlus 9T teaser just suggest the phone isn't canceled after all?",
  "category": "phones",
  "updated": "2021-08-11T18:29:39Z",
  "author": "david-lumb",
  "summary": "Analysis: It’s just a OnePlus 9 in tea – “don’t read too much into it.”",
  "article": [
    "While everyone’s eyes were on Samsung Unpacked, OnePlus coyly dropped its own tease of a phone we weren’t sure existed, suggesting the OnePlus 9T might be coming this year after all.",
    "OnePlus tweeted an artsy image of a OnePlus 9 nestled in tea and, with the brand’s signature cheeky humor, added “Don't read too much into it.”",
    "In any other year, this wouldn’t be too surprising – around September or October, OnePlus typically releases a ‘T’ version of that year’s flagship with a few refinements, so it’s about time for a OnePlus 9T tease. Or it would be if a leak hadn’t claimed the 9T might be canceled.",
    "The OnePlus 9T wouldn’t be the first phone canceled in 2021 – a Samsung executive confirmed that the Samsung Note 21 wouldn’t be coming out. While we didn’t get an exact reason, Samsung CEO DJ Koh said earlier in the year that “it could be a burden to unveil two flagship models in a year so it might be difficult to release Note model in 2H,” suggesting the market would be too crowded with other Samsung flagships.",
    "There’s also a question of the global chip shortage’s impact on tech industries, which led to delays for last year’s phones like the Google Pixel 4a and some of the iPhone 12 range and, rumor has it, pushed back the Samsung Galaxy S21 FE’s release.",
    "In any case, the OnePlus 9T would be a welcome sight if it’s released later in the year, suggesting to whatever degree that the smartphone industry is trucking on despite continued lockdowns and chip shortages. Of course, it’s another question entirely how the 9T will land given the just-launched (and cheaper) Samsung Galaxy Z Flip 3 along with the upcoming Google Pixel 6 powered by its in-house Tensor chipset."
  ],
  "headers": {
    "3": "Canceled? In this pandemic?"
  },
  "links": {
    "Samsung Unpacked": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "tweeted": "https://twitter.com/oneplus/status/1425435845809434625",
    "canceled": "https://www.techradar.com/news/oneplus-9t-may-be-canceled-says-leaker",
    "confirmed": "https://www.techradar.com/news/samsung-confirms-skipping-galaxy-note-21-but-teases-galaxy-z-fold-3-and-flip-3",
    "said": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "pushed back": "https://www.techradar.com/news/samsung-galaxy-s21-fe-delayed-exynos-shortage",
    "Tensor chipset": "https://www.techradar.com/news/samsung-galaxy-s21-fe-delayed-exynos-shortage"
  }
}