{
  "source": "https://www.techradar.com/news/halo-infinite-multiplayer-is-available-to-play-right-now",
  "title": "Halo Infinite multiplayer is available to play right now",
  "category": "gaming",
  "updated": "2021-11-17T15:21:17Z",
  "author": "john-loeffler",
  "summary": "Dive back in Spartans",
  "article": [
    "Spartan season begins today: Season 1 of the hotly anticipated multiplayer game Halo Infinite is available ... right now. Tom French, Multiplayer Associate Creative Director for Halo Infinite, made the announcement during the Xbox 20th Anniversary Livestream on November 15.",
    "\"On behalf of the entire Halo team,\" French said, \"it's my honor and privilege to announce that your Spartan journey begins today. Right now you can download and start playing Season 1 of Halo Infinite's free-to-play multiplayer beta on Xbox One, Series S, [Series] X, and PC.",
    "\"This is the kick off of our season and you'll have access to all the maps, core modes, academy features, and the full Battle Pass to unlock, and your progression will carry over when we officially release the game on December 8.\"",
    "Described by developer 343 Industries as a spiritual reboot of the series, Halo Infinite's campaign mode will continue the ongoing story of the franchise, and Xbox Series X players will enjoy \"up to 4k resolution at 60fps in the campaign and greatly reduced load times creating seamless gameplay that ushers in the next generation of gaming\".",
    "The multiplayer mode saw a couple of initial beta previews earlier this year, with the most recent being just last month. Multiplayer mode will also see the return of split-screen co-op, which was cut from Halo 5 in favor of an online only multiplayer mode – a creative decision that caused considerable controversy among the Halo fanbase.",
    "Bonnie Ross, head of 343 Industries said in 2017 that the removal of split-screen co-op from Halo 5 was \"painful\" and that \"it erodes trust with the community. [We’ve had a] lot of learnings from that, and I would say for any FPS going out forward we will always have split-screen going forward.\"",
    "There are plenty of Halo multiplayer diehards out there, and Halo Infinite definitely aims squarely at the fanbase. But there's plenty of reason to think that this entry in the series could bring in new players who might not have gotten into past entries.",
    "For one thing, cross-progression between Xbox One, Xbox Series X|S, and PC should make it easier for everyone to play with their friends, while a Day One release on Xbox Game Pass could easily rope in a lot of potential players who might not have given it a look otherwise.",
    "Being free-to-play definitely doesn't hurt. But given the popularity of a host of other free-to-play multiplayer shooters like Apex Legends, Fortnite, and Call of Duty Warzone, Halo Infinite has a lot more competition than it did when the first Halo game debuted 20 years ago.",
    "If you plan on jumping into the action, here's everything you need to know about Halo Infinite Season 1."
  ],
  "headers": {
    "6": "Analysis: will free-to-play multiplayer and Day One Xbox Game Pass bring in new fans?"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox 20th Anniversary Livestream": "https://www.techradar.com/news/xbox-series-x-backward-compatibility-just-got-over-70-new-games",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Call of Duty Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Halo Infinite Season 1": "https://www.techradar.com/news/halo-infinite-season-1-battle-pass-length-trailer-and-everything-you-need-to-know"
  }
}