{
  "source": "https://www.techradar.com/news/msi-teases-limited-edition-rtx-3090-suprim-gpu-at-computex-2021",
  "title": "MSI teases ‘limited edition’ RTX 3090 Suprim GPU at Computex 2021",
  "category": "computing",
  "updated": "2021-06-01T16:36:50Z",
  "author": "carly-page",
  "summary": "The graphics card will likely be in short supply",
  "article": [
    "MSI is celebrating its 35th anniversary with a 'limited edition' upgrade to its RTX 3090 Suprim graphics card.",
    "The company teased the MSI GeForce RTX 30 Suprim 35th Anniversary Edition during the firm’s Computex showcase, where the company confirmed the souped-up GPU would be launching as a limited edition product.",
    "Details about the graphics card remain thin, though MSI has confirmed that the GPU will feature its new Tri Frozr 2S cooling solution and will be powered by triple 8-pin power connectors delivering at least 350W of power.",
    "Most of the new features are aesthetic, however, with the shroud and backplate on the RTX 30 Suprim 35th Anniversary Edition featuring renders of previous MSI graphics cards.",
    "“Engraved in the backplate is sketched outlines of past generations that have contributed to our company’s experience and knowledge,” the company said. “This anniversary edition graphics card is built upon the Suprim series foundation and retains all the same key features.”",
    "While MSI didn’t confirm which RTX 30-series GPU the card will be based on, the NV Link connector all but confirms it’ll arrive as an upgrade to MSI’s highest-spec RTX 3090 Suprim graphics card.",
    "Given its “limited edition” status, the RTX 30 Suprim 35th Anniversary Edition - like most of Nvidia’s RTX 30-series graphics cards - will likely be available in short supply at launch. MSI has yet to confirm pricing and availability details.",
    "This isn’t the only new RTX 30-series GPU to debut at Computex, as Nvidia also used this year’s virtual showcase to launch its long rumored RTX 3080 Ti and RTX 3070 Ti graphics cards.",
    "Both GPUs offer noticeable upgrades over their predecessors, with the RTX 3080 Ti boasting 12GB of GDDR6X memory up from 10GB and the RTX 3070 Ti getting an upgrade from GDDR6 to GDDR6X. According to Nvidia, both new cards will offer 1.5x better performance compared to their previous-gen counterparts."
  ],
  "headers": {},
  "links": {
    "MSI": "https://www.techradar.com/news/msi-gaming-laptops-how-to-find-the-best-msi-gaming-laptop-for-you",
    "teased": "https://www.msi.com/news/detail/MSIGeForceRTX30TiGraphicsCardFamilyAssemblesForDuty121984",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Computex": "https://www.techradar.com/news/computex-2021",
    "to launch its long rumored RTX 3080 Ti and RTX 3070 Ti graphics cards": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti"
  }
}