{
  "source": "https://www.techradar.com/news/rick-and-morty-season-5-finale-delivers-what-weve-all-been-waiting-for",
  "title": "Rick and Morty season 5 finale delivers what we’ve all been waiting for",
  "category": "entertainment",
  "updated": "2021-09-06T17:48:22Z",
  "author": "chris-aiken",
  "summary": "Opinion: Rick and Morty lives to the hype",
  "article": [
    "Spoilers follow.",
    "When Rick and Morty told us that it would take a break and come back for a hour-long finale, I didn’t know what to expect. It turns out that the show just meant that it would air its last two episodes of the season back-to-back, instead of giving us a longer instalment. That's okay, however, because both 'Forgetting Sarick Mortshall' and 'Rickmurai Jack' are two of the best episodes of the season, with the final episode giving fans closure to one of the show’s biggest arcs.",
    "Strong Rick and Morty episodes usually land during a season’s final episodes. There are no distracting side stories, no fluff, and unless they play a major role, the other characters take a huge back seat to the plot. The same can be said of season 5’s closing episodes. It’s just Rick and Morty and a big showdown – one that's usually caused by something from Rick’s past. It’s the perfect balance of comedy and storytelling that keeps you glued to the episode.",
    "Strangely enough, 'Forgetting Sarick Mortshall' feels like a season finale, while 'Rickmurai Jack' feels more like the start of a new season. I can’t tell if this is intentional or not, but that’s how the episode came off. Let’s start with 'Forgetting Sarick Mortshall,' an episode that breaks the band up.",
    "There’s something unique about this episode. Yes, we’ve seen Rick and Morty go their separate ways before or have their own adventures, but this feels different.",
    "Morty decides to have some with Rick’s portal gun without permission and…who could blame him? He’s 14 years old and his grandfather is the smartest man in the world with a garage full of cool space shit. This is probably the most normal thing Morty has done in the whole series. Unfortunately, when he tries to cover up his 'joy ride' with the portal gun, he ends up creating a portal on his hand…which happens to connect to some random dude’s thigh.",
    "In true Rick fashion, when he finds out that Morty has been messing with his portal gun, he decides to prove to Morty that he can be replaced with anyone. In this case, anyone means two highly-trained crows.",
    "Meanwhile, Morty decides to hang out with his new portal bro, who met Rick at a bar one time and happens to be stuck inside an insane asylum. Both Rick and Morty attempt to prove they don’t need the other to have awesome adventures, which yields varying results.",
    "This episode highlights two things about our main characters. The first is that Rick is terrible. Terrible in the sense that he’s petty and quick to draft up some ridiculous antics just to prove a point. We all remember Morty's trauma from 'The Vat of Acid Episode.' Here, we have another example of Rick being a jerk just to prove how useless and easily replaceable Morty is. Rick’s lone adventure goes off the rails quickly, as he ends up bonding with the crows in an unexpected way until he accidentally starts a crow invasion he has to fix.",
    "The second thing highlighted by this episode is that Morty has trouble carving his own identity without Rick. Morty’s adventure, which is the more enjoyable of the two stories to actually watch, quickly escalates from a cathartic experience to needless violence.",
    "It turns out, there’s a reason why Rick tossed Morty’s new bud to the curb: he’s power-hungry and dangerous. The Portal Boys are short-lived, and despite what the show says, that’s a cool name. It isn’t long before Morty comes crawling back to Rick, only for Rick to abandon Morty at the end of the episode. It’s a fun episode with some good jokes and interesting character development.",
    "Now, 'Rickmurai Jack' is the episode that every fan of Rick and Morty has been waiting for. Coming right off the tail end of the last episode, where Rick abandoned Morty to instead go on adventures with two crows, we are treated to a hilarious anime-inspired opening.",
    "It’s sad to see Morty keep coming back to Rick early in the episode in an attempt to bring him home – sad due to the fact that Rick would rather be on his anime journey, but also because of the lengths Morty goes to try and bring him back, and how the episode ends.",
    "When the pair do end up back together, things kick off very quickly. It’s a return to the Citadel of Ricks, where Evil Morty has been in charge for a while now. This is the storyline we’ve all been waiting to resume since Evil Morty first showed up back in season 1.",
    "So many fan theories have spawned from his introduction and his connection to Rick. Hell, so many fan theories have accumulated from Rick’s own past as we’ve been drip-fed glimpses of the truth. Both are finally addressed in this episode, with some answers being vague, while others are shown to us in excruciating detail.",
    "You are either going to love or hate the revelations in this episode, which have always had the tall task of living up to our expectations. As the pair finally meet Evil Morty, we don’t get a full idea of where he came from, but that’s alright – it’s not important. He represents the frustrations of all Mortys being stuck as another tool for Rick to use on his adventures. Anything that Evil Morty has done pales in comparison to what we learn about Rick.",
    "There is so much we learn about Rick. The clues from every season of the series are finally put together, and we learn how different Rick really is from all the others. Rick has always been a character motivated by grief, and we finally see his entire story laid out in one grand montage. Putting it together with the truth of the Citadel, there is a lot for Morty to unpack as well.",
    "As Evil Morty says, the only thing he did that makes him evil is wanting to get away from Rick. So much so that all his actions, murders, and schemes were just to find a way to get to a universe where Rick doesn’t exist. It’s something our Morty can’t seem to do, despite being at odds with Rick so many times.",
    "The season is over, and the characters are left to sit with the finale’s revelations. The lore is handled so well in this well-plotted episode that I barely had time to mention how on-point the jokes in these last two episodes are. There are a lot of laughs here, and I thought the idea of Morty’s hand being connected to some guy’s thigh was especially well executed.",
    "With everything on the table, who knows where next season will go? Either way, this finale makes us want to keep watching.",
    "Rick and Morty season 5 airs on Adult Swim in the US, E4 in the UK and Netflix in Australia."
  ],
  "headers": {
    "3": "Two birds, one Mort",
    "11": "Grand closing, grand opening"
  },
  "links": {}
}