{
  "source": "https://www.techradar.com/news/pour-one-out-for-pepper-the-worlds-first-humanoid-robot-now-discontinued",
  "title": "Pour one out for Pepper, the world's first humanoid robot, now 'discontinued'",
  "category": "appliances",
  "updated": "2021-06-29T12:12:21Z",
  "author": "axel-metz",
  "summary": "RIP Pepper, 2014-2021",
  "article": [
    "Japanese robotics company SoftBank has reportedly halted production of its iconic Pepper robot, widely considered to be the world’s first humanoid helper.",
    "According to Reuters, SoftBank is downgrading its industrial ambitions, and hasn’t produced a Pepper robot – also touted as the first robot with a heart – since last year.",
    "Originally launched in 2014, Pepper was built by Foxconn (now parts supplier to Tesla and Apple) and intended as a labour assistant that could complete basic tasks like serving customers and babysitting children.",
    "Despite acting as an unofficial mascot for SoftBank after the company placed the four-foot robot in its mobile phone stores, Reuters’ sources claim only 27,000 Pepper robots were ever produced between 2014 and 2020, citing a limited global demand.",
    "They also added that “culture clashes between the [company’s] French business and Tokyo management” impeded Pepper’s development, impacting its functionality and, ultimately, its sales.",
    "In a statement, SoftBank said it \"will continue to make significant investments in next-generation robots to serve our customers and partners” – with the most notable, at present, being the company’s carpet-cleaning robot, Whiz.",
    "As well as being marketed as a helpful humanoid assistant, Pepper was originally designed with a view to becoming the first robot that could understand human emotion.",
    "That wasn’t possible, though – and remains so to this day – even despite some 2016 assistance from technology giant IBM, which worked with SoftBank to give Pepper improved cognitive capabilities.",
    "After rebranding Pepper as a basic assistance robot, the company capitalized on its charm factor, and it soon became synonymous with SoftBank’s high-tech Japanese mobile stores, where Pepper greeted customers with a friendly smile and a little wave.",
    "Evidently, business pressures have finally caught up with charm, and the beloved Pepper robot now finds itself at the end of its six-year lifespan. In fairness, in its statement, SoftBank did say it would start making the robot again \"when it is needed,\" but we're fairly certain there won't be a sudden demand for thousands of waist-high walking iPads any time soon.",
    "At CES 2021, we saw the announcement of new several assistance robots – like the Samsung Bot Handy and LG CLOi UV-C – on their way to homes over the coming years, but none of them quite have the same twinkle in their eye as SoftBank’s handy helper.",
    "In fact, most of them don’t have eyes at all – which is probably where the Japanese robotics company went wrong.",
    "So long, Pepper. You will be missed.",
    "Via The Verge"
  ],
  "headers": {
    "6": "Boy, why are you crying?"
  },
  "links": {
    "Reuters": "https://www.reuters.com/technology/exclusive-softbank-shrinks-robotics-business-stops-pepper-production-sources-2021-06-28/",
    "Whiz": "https://us.softbankrobotics.com/whiz",
    "CES 2021": "https://www.techradar.com/news/the-coolest-robots-of-ces-2021",
    "The Verge": "https://www.theverge.com/2021/6/28/22554566/softbank-pepper-robot-production-layoffs-robotics"
  }
}