{
  "source": "https://www.techradar.com/news/marvels-supporting-characters-are-the-glue-that-holds-the-mcu-together",
  "title": "Marvel's supporting characters are the glue that holds the MCU together",
  "category": "entertainment",
  "updated": "2021-10-03T11:00:58Z",
  "author": "richard-edwards",
  "summary": "Opinion: Like The Simpsons, the MCU never underestimates the importance of its bit-part players",
  "article": [
    "Beware, spoilers for Shang-Chi and the Legend of the Ten Rings and other Marvel movies lay ahead!",
    "One is the story of an ordinary American family in an ordinary American town; the other is the saga of extraordinary people with superpowers. One resets to the status quo at the end of almost every episode; the other revels in the vastness of its decades-old continuity.",
    "And yet, despite being chalk and cheese on so many levels, The Simpsons and the Marvel Cinematic Universe have much more in common than longevity and their availability on Disney Plus. Because whether you’re hanging out in Springfield or one of the far-flung corners of the MCU, their supporting characters can be just as memorable as the big hitters with their names in the titles.",
    "Ask anyone to name their favorite Simpsons character, and they’re as likely to mention Moe, Sideshow Bob or Comic Book Guy as Homer, Marge, Bart, Lisa or Maggie. In fact, back in the show’s 1990s glory years – remember those? – a major reason for The Simpsons’ success was the way the focus could be on Principal Skinner one week, then Reverend Lovejoy and Aunt Selma the next. In effect, Springfield quickly became a vast shared universe populated by recurring characters you came to know and love.",
    "We don’t know if Marvel Studios boss Kevin Feige is a Simpsons fan – he did voice a Thanos parody in 2020 episode ‘Bart the Bad Guy’ – but it certainly looks like he’s been taking inspiration, even since the MCU’s early days.",
    "In the original Iron Man, it felt safe to assume that Clark Gregg’s Agent Coulson was a random government suit who’d never be seen again. But by the time Loki bumped him off in The Avengers – after appearances in Iron Man 2 and Thor – Coulson’s loss was such a big deal that it brought the feuding Iron Man, Captain America, Thor and Hulk together to save the world. In a room full of supersoldiers, billionaire genius playboys, and Norse gods, it’s the ‘ordinary’ character who keeps things grounded and real. Coulson also gives us mere mortals some perspective on what it’s like to work alongside superheroes – and ask Captain America about getting your prized collection of trading cards autographed.",
    "And for all Tony Stark and Loki’s beautifully crafted one-liners, it’s usually the characters further down the cast list who bring the biggest laughs. Luis (Michael Peña)’s uniquely subjective approach to storytelling gives Ant-Man its most memorable scenes, while wannabe revolutionary Korg (Taika Waititi) is arguably the standout character in Thor: Ragnarok – a movie stacked with A-list comic performances.",
    "Despite their comic relief assignments, however, the MCU’s funniest supporting players aren’t just there to bring the laughs. They’re also fully rounded characters, with lives and motivations of their own, whether their interests are staying out of prison (Luis) or running a successful leafleting campaign (Korg). Crucially, Marvel puts in the hard yards to make sure you care about characters who get relatively limited screentime. Indeed, the thought that Korg may have been killed in Thanos’s assault on the Asgardian ship in Infinity War came as just as much of a hammer blow as that famous finger snap.",
    "Even Trevor Slattery (Ben Kingsley), up there with the silliest of all the MCU characters, is given a degree of pathos. A lauded British stage actor paid to masquerade as terrorist boss the Mandarin in Iron Man 3, Slattery is undeniably ridiculous. But he’s also tragic, as a series of questionable life choices and bad luck have landed him in Xu Wenwu’s prison by the time Shang-Chi and the Legend of the Ten Rings rolls around. As good as he is for a hilarious anecdote – his musings on finding inspiration in Planet of the Apes are priceless – you can’t help but feel for a man who’s spent years in solitary confinement, with only his faceless Dijiang pet, Morris, for company.",
    "When a character like Slattery does make a surprise return, it enhances the connectivity of the universe. While it’s usually the big-name Avengers-style crossovers that grab the headlines, Marvel’s formula allows smaller-scale encounters to happen in almost every movie or TV show – and they don’t even have to shout about it.",
    "It doesn’t even matter if you don’t remember that the vlogger on the bus in Shang-Chi also appeared in Spider-Man: Homecoming. Or if you didn’t spot that the Abomination is a returning character from The Incredible Hulk – a movie many viewers have chosen to forget anyway. But if you’re a big MCU fan, these callbacks – however big or small – make you feel like a privileged member of an inner circle, peeking behind the curtain to see how everything fits together in Feige’s grand plan.",
    "Perhaps the best thing about supporting players, however, is that they don’t have to lurk in the shadows forever. Sharon Carter (Emily VanCamp), effectively Steve Rogers’ love interest who never was, became surprisingly pivotal to the wider MCU when she turned up in The Falcon and the Winter Soldier, while Ayo (Florence Kasumba) got the chance to lead the Dora Milaje in Okoye’s absence.",
    "Dr Darcy Lewis (Kat Dennings) received an even bigger promotion in WandaVision, after spending the first two Thor movies in a thankless sidekick role. Marvel could easily have created a new scientist to be the audience’s eyes and ears in Westview, but by bringing back Darcy – working alongside FBI agent Jimmy Woo (Randall Park), himself a veteran of Ant-Man and the Wasp – they emphasized that connection with earlier entries in the MCU.",
    "Now, as Phase 4 kicks properly into gear, Doctor Strange’s librarian-in-chief Wong (Benedict Wong) has emerged as a surprising frontrunner to become the MCU’s MVP. Not only does he show up in the trailer for Spider-Man: No Way Home and the opening of Shang-Chi (alongside the aforementioned Abomination, bizarrely), he’s part of the brain trust brought in to solve the mystery of the Ten Rings.",
    "While Wong, Darcy, Sharon, Korg and Luis are unlikely to ever headline their own live-action movies or TV shows, the fact they’re there, showing up every now and then to interact with the superstars of the MCU, makes the universe richer. So everyone else who’s trying to build a complex shared universe should take a note from The Simpsons – it never hurts to give your supporting players the respect you give your leads.",
    "Shang-Chi and the Legend of the Ten Rings streams on Disney Plus from November 12."
  ],
  "headers": {
    "6": "More than comic relief",
    "11": "Where stars are born"
  },
  "links": {
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know"
  }
}