{
  "source": "https://www.techradar.com/news/google-photos-vs-amazon-photos-which-cloud-storage-giant-is-the-best",
  "title": "Google Photos vs Amazon Photos: which cloud storage giant is the best?",
  "category": "cameras",
  "updated": "2021-05-18T19:54:10Z",
  "author": "chris-rowlands",
  "summary": "Who wins the great Google Photos vs Amazon Photos battle?",
  "article": [
    "Looking for the best cloud photo storage service for your snaps? Amazon and Google offer two of the best tools for your treasured images – so who wins in the great 'Google Photos vs Amazon Photos' debate?",
    "Backing up your photos to the cloud is a smart idea. Besides keeping your images securely stored online – free from the risk of a hard drive hardware failure – it also means you can easily access your entire library, anytime, anywhere, from almost any web-connected device.",
    "Both Google Photos and Amazon Photos make it easy to sync, upload and manage your image collection across multiple devices. They also offer useful search and filtering tools to help you find specific snaps, as well as handy sharing options for sending snaps to friends and family. You can even order physical prints of your favorite pictures, all of which makes the Google Photos vs Amazon Photos comparison a highly competitive one.",
    "So which service is best for you? While there is a lot of overlap between the functionalities offered by Google Photos and Amazon Photos, there are also some key differences. Amazon Photos, for example, offers unlimited full-resolution photo storage for Prime subscribers, while Google gives 15GB of free storage before you’ll need to pay for a Google One plan.",
    "Amazon Photos seamlessly integrates with Fire TV and Echo Show devices, so you can easily select fresh backgrounds, while Google Photos offers a whole suite of automated editing tools and smart sorting suggestions, to get the very best out of your library.",
    "While you can’t really go wrong with your Google Photos vs Amazon Photos decision, it’s worth reading all the way through the guide below to find out which service will most closely match your photo backup requirements. After all, you don’t want to spend hours – or even days – uploading your image collection, only to find your chosen platform is lacking a feature that’s key for your needs.",
    "Not sure how to pick between the two? The guide below sets out the merits and drawbacks of both Amazon Photos and Google Photos, for every kind of user – from price and storage capacity to editing tools and organization options.",
    "So whether you’re backing up from a smartphone, PC, Mac or even social media, this guide will help you pick the right cloud backup provider for your photos. It's time to get stuck into our in-depth Google Photos vs Amazon Photos face-off...",
    "Both Amazon Photos and Google Photos offer a first slice of photo storage for free: anyone with an Amazon account gets 5GB of cloud capacity, while anyone with a Google account gets a more generous 15GB.",
    "As of 1 June 2021, Google no longer offers unlimited free storage for ‘high quality' photos: both 'original' and compressed photos now count towards your total. So whichever service you choose to use, you’ll need to pay for additional space once you hit the complimentary limit.",
    "With Google Photos, that means taking out a Google One subscription to increase your storage capacity across all Google products. Plans start at US$1.99 / £1.59 per month for 100GB of cloud space, going up to US$10 / £7.99 per month for 2TB.",
    "Amazon’s approach is a little different: subscribers to the company’s Prime service get unlimited storage of full-resolution photos for free as part of their package (plus 5GB for videos). For a single monthly fee of US$12.99 / £7.99, you can use Amazon’s next-day delivery service, access its substantial library of video streaming content and upload as many images as you like to Amazon Photos – without any compression.",
    "Alternatively, you can expand the storage capacity of your Amazon account without a Prime subscription. Plans start at US$1.99 / £1.49 per month for 100GB. This option will also be useful for those who plan to store videos in the cloud.",
    "Which plan is right for you will depend on how many photos you plan to upload – and whether you’ll make use of the extra benefits of a Prime plan. If your photo collection is relatively small and you don’t need the additional features, both services’ basic 100GB plans are straightforward and affordable.",
    "But if your library is sizable and you intend to back up thousands of images – and you’ll make use of Prime’s delivery and streaming features – Amazon Photos offers better value.",
    "Both services offer comparable cross-platform backup options. Amazon Photos and Google Photos can both be accessed from any mainstream web browser. Each also offers dedicated apps for desktop, Android and iOS devices. The Amazon Photos app is available for Fire TV and Fire tablets, too.",
    "There’s little to choose between the two when it comes to image upload and syncing functionality. Accessing either platform via the web lets you directly upload photo folders from your hard drive, while installing their respective apps allows you to automatically backup snaps from your device – whether that’s a laptop, tablet or smartphone.",
    "Both apps allow you to restrict mobile uploads to Wi-Fi, so that you save on data usage, and both also make it straightforward to download synced files to your device’s camera roll for offline storage.",
    "One trump card in the Google Photos tool kit is the ability to backup snaps directly from Facebook, as part of the Data Transfer Project. Find ‘Transfer a copy of your photos or videos’ under your Facebook account settings and you’ll be able to copy your shared snaps straight to Google Photos (for more detailed instructions, check out our Google Photos backup guide). This option isn’t available for Amazon Photos.",
    "On the flip side, Amazon Photos is designed for integration with Alexa-enabled devices. If you have a Fire TV stick, for example, you’ll easily be able to switch up your background using shots stored in your cloud library.",
    "Which photo backup platform is best for you will largely depend on where your photos are currently stored and what devices you plan to sync with your library. Users of Google and Android smartphones will likely find Google Photos a slicker fit, while those invested in the Amazon device ecosystem should enjoy the benefits of saving their snaps to Amazon Photos. Those using Apple hardware will want to weigh up both options.",
    "Both Google Photos and Amazon Photos offer straightforward editing tools through their apps and web platforms. Rather than advanced adjustments, they’re designed to help you quickly tweak levels, apply filters and change cropping.",
    "Its interface isn't as slick, but Amazon Photos does feature several editing tools not offered by Google’s photo backup platform, including the option to add text overlays and apply focus effects. It also features a greater array of filters, plus a wider range of adjustments. The ability to tweak shadows, highlights, gamma, clarity and more beats the simple light, color and pop sliders found in Google Photos.",
    "What really sets Google Photos apart in the editing stakes, though, are its automated adjustments. Google Photos will sometimes suggest edits for your snaps. Alternatively, open up any image, click the ‘Edit’ icon and you’ll find an ‘Auto’ option which consistently brings out the best in images, sensitively tweaking color, brightness and other levels to fantastic effect.",
    "In reality, neither Google Photos nor Amazon Photos represents a genuine replacement for the best photo editors or the best photo editing apps. But if you’re looking for a photo backup platform that can also help you quickly and easily improve your images, Google Photos has the upper hand.",
    "Both Google Photos and Amazon Photos offer smart search tools which make it easy to track down snaps in your cloud photo library. Each backup service employs AI-powered object recognition to help you locate specific shots. Type a term into either service’s toolbar – such as ‘dog’ – and you’ll find they’re both scarily effective at detecting the contents of your image collection.",
    "Distinctive subjects seem to be picked out best by both Amazon Photos and Google Photos, though each is also surprisingly successful at finding background items such as trees, paths and hills.",
    "Google Photos and Amazon Photos can also identify human faces in your photos very effectively. With a bit of time spent labelling mugshots, you can help to improve results. Before long, you’ll find that fresh portraits synced to either platform will be automatically sorted under the name of their subject.",
    "While it’s hard to measure objectively, Google Photos seems marginally more successful at correlating faces. Then again, the effectiveness of each service is influenced by the length of time you’ve been sharing, labelling and uploading images and secondary data. If you’re a long-time user of Google services, you’ll likely find it’s already learnt the faces of your friends.",
    "If you have a sizable image library to backup online, sorting options will be crucial to your user experience. Besides automatically categorizing snaps of people and places, both Google Photos and Amazon photos allow you to sort sets of images into any number of custom albums.",
    "On paper, there’s little to pick between the two. In practice, Google Photos proves slicker when it comes to organization: it will suggest smart albums based on the data and dates of your photos – which might indicate a holiday, for example – and format these into attractive folders with location labels and journey maps.",
    "Like Amazon Photos, Google Photos also includes ‘favorites’ functionality, which allows you to highlight any snap you like outside of a specific album. Unlike with Amazon Photos, the feature is accessible on the web as well.",
    "If you fancy showing certain shots to your family and friends, both backup platforms offer baked-in tools for straightforward sharing.",
    "Amazon Photos allows you to share individual images and albums via email, Facebook or a dedicated link. You can also create shared albums and configure a Family Vault, which lets you pool your favorite pics with up to four other people. As long as one member has a Prime subscription, everyone with access to the vault is able to store unlimited images in there.",
    "Google Photos has a similarly comprehensive set of sharing tools. Besides creating direct links to images and collaborative albums, you can also share snaps to social media. Integration of your Google contacts makes it easy to send shots straight to individuals or groups, too.",
    "In certain regions, both Google Photos and Amazon Photos give you the option of ordering physical prints and photo gifts. Whether you choose to use this over the countless third-party printing services will come down to personal preference and pricing in your area. If you do fancy buying via your photo backup service, you’ll likely find that Amazon offers a wider range of products and variables, from print finish to wall hanging options.",
    "Amazon Photos and Google Photos are both stellar options for backing up your image library. Each syncs seamlessly across a range of devices and each features smart, straightforward tools for sorting, editing and sharing your precious snaps.",
    "Which platform is best for you will depend to some extent on the devices you already own. Those who use Google products are likely to find Google Photos more familiar – and potentially better placed to recognize the faces of your mates. Equally, if you already have several Amazon devices, uploading your snaps to Amazon Photos might make more sense.",
    "Pricing is likely to be one of the biggest factors when choosing the right cloud backup option. Amazon Photos and Google Photos are relatively equal when it comes to monthly storage subscriptions, especially at the 100GB mark.",
    "What really sets Amazon Photos apart is the Prime package: unlimited full-resolution photo storage alone is something of a steal at £7.99 / US$12.99 a month. And with Google no longer offering unlimited high-resolution photo storage for free, it makes Amazon Photos a very attractive option if you plan on backing up a big library.",
    "Add video streaming and next-day delivery into the mix and a Prime subscription becomes a bit of a no-brainer – provided you’ll use all that it has to offer."
  ],
  "headers": {
    "8": "Google Photos vs Amazon Photos: price and storage capacity",
    "15": "Google Photos vs Amazon Photos: uploads and syncing",
    "21": "Google Photos vs Amazon Photos: editing tools",
    "25": "Google Photos vs Amazon Photos: smart searching",
    "29": "Google Photos vs Amazon Photos: organization",
    "32": "Google Photos vs Amazon Photos: sharing options",
    "36": "Google Photos vs Amazon Photos verdict"
  },
  "links": {
    "best cloud photo storage": "https://www.techradar.com/best/best-cloud-storage-for-photos",
    "Google Photos": "https://www.techradar.com/reviews/google-photos",
    "Amazon Photos": "https://www.techradar.com/reviews/amazon-photos",
    "Google Photos backup": "https://www.techradar.com/how-to/google-photos-how-to-back-up-photos-from-your-phone-tablet-or-computer",
    "best photo editors": "https://www.techradar.com/news/best-photo-editor",
    "best photo editing apps": "https://www.techradar.com/best/best-photo-editing-apps"
  }
}