{
  "source": "https://www.techradar.com/news/mortal-kombat-the-suicide-squad-and-more-shown-in-new-hbo-max-movies-trailer",
  "title": "Mortal Kombat, The Suicide Squad and more shown in new HBO Max movies trailer",
  "category": "entertainment",
  "updated": "2021-01-27T14:30:39Z",
  "author": "axel-metz",
  "summary": "New footage of Space Jam, In the Heights and more",
  "article": [
    "Warner Bros. has teased new footage of some of its biggest 2021 releases in the new HBO Max ‘Same Day Premieres’ trailer, including Mortal Kombat, The Suicide Squad and Godzilla vs. Kong.",
    "For the first time ever, Warner Bros is making its entire slate of 2021 releases available to stream on HBO Max alongside their respective theatrical releases – on the exact same day, no less, as this new trailer makes clear.",
    "In addition to previously-unseen clips of King Kong and Godzilla attacking each other, the trailer showcases new footage of some of the studio’s more low-key upcoming releases, including The Little Things, starring Rami Malek and Denzel Washington, and the LeBron James-led Space Jam: A New Legacy.",
    "There’s also a better look at Lin-Manuel Miranda’s In The Heights musical, the new Conjuring movie and King Richard, the story of the father and coach of tennis players Venus and Serena Williams, played by Will Smith.",
    "The announcement that Warner Bros' entire slate of 2021 movies will debut concurrently on HBO Max and in theaters has been met with criticism from some of Hollywood's biggest names. The likes of Denis Villeneuve, whose Dune movie is set to debut via the streaming service, and Tenet director Christopher Nolan have publicly denounced the move.",
    "Villeneuve, in particular, recently criticized the decision for proving the studio has “absolutely no love for cinema, nor the audience”, adding “it is all about the survival of a telecom mammoth, one that is currently bearing an astronomical debt of more than $150 billion.\"",
    "We had previously reported that the producers behind Dune were fighting to keep the movie a theatrical release. This latest trailer suggests Dune will join the studio’s entire roster by releasing concurrently in theatres and on HBO Max."
  ],
  "headers": {
    "4": "Max controversy"
  },
  "links": {
    "‘Same Day Premieres’ trailer": "https://www.youtube.com/watch?v=8maofAPvkJM&feature=emb_logo",
    "publicly denounced the move": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "producers behind Dune were fighting": "https://www.techradar.com/news/dune-producers-are-fighting-to-keep-the-movie-a-theatrical-release-report-says"
  }
}