{
  "source": "https://www.techradar.com/news/apple-m1x-leak-suggests-macbooks-are-in-line-for-a-major-performance-boost",
  "title": "Apple M1X leak suggests MacBooks are in line for a major performance boost",
  "category": "computing",
  "updated": "2021-02-18T17:27:10Z",
  "author": "carly-page",
  "summary": "The M1 successor could boast double the GPU performance",
  "article": [
    "An apparent benchmark listing for the so-called Apple M1X CPU may have given us a glimpse at next-generation Apple Silicon.",
    "The leak shows an Apple M1X with 12 cores, according to CPU Monkey, an increase over its predecessor’s 8, which will reportedly arrive in the form of 8 high-performance ‘Firestorm’ cores coupled with 4 efficient ‘Ice Storm cores’.",
    "The CPU will allegedly see an even more impressive upgrade in the graphics department. The leaked benchmarks, which are said to come from a “pre-sample” of the M1X, suggests the processor will feature a 16-core GPU with 256 execution units.",
    "The M1, found in Apple’s latest MacBook Pro and MacBook Air devices, features an 8-core GPU with 128 execution units, which suggests that its incoming successor could offer up to double the graphics performance.",
    "The Apple M1X will also feature an increased TDP of 35W-45W, according to the listing, and support for up to 32GB of LPDDR4X memory and PCIe 4.0 storage.",
    "Like its predecessor, however, the chip will reportedly still be clocked at 3.2GHz and will be based on a 5nm production process.",
    "CPU Monkey claims the Apple M1X will power debut in the second quarter of 2021 in a 14-inch MacBook Pro, 16-inch MacBook Pro, and 27-inch iMac refresh. While talk of a new MacBook Pro models alights with previous rumors, it’s worth noting that recent speculation suggested the first Apple Silicon-powered iMac had been delayed until October.",
    "Of course, it's impossible to verify whether the specifications are accurate, so we'd advise to take these leaked specs with a pinch of salt for now.",
    "The M1X isn't the only ARM-based processor Apple is working on. According to rumors, the company is also developing in-house CPUs that boast 16-core and 32-core GPUs."
  ],
  "headers": {},
  "links": {
    "CPU Monkey,": "https://www.cpu-monkey.com/en/cpu-apple_m1x-1898",
    "16-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "the first Apple Silicon-powered iMac had been delayed until October": "https://www.techradar.com/news/apple-silicon-powered-imac-rumoured-to-have-been-delayed-until-october-2021",
    "rumors": "https://www.techradar.com/news/apple-m1-follow-up-could-help-macbook-pro-16-inch-2021-crush-x86-competition"
  }
}