{
  "source": "https://www.techradar.com/news/eu-set-to-probe-microsoft-nuance-deal",
  "title": "EU set to probe Microsoft-Nuance deal",
  "category": "computing",
  "updated": "2021-12-07T12:04:05Z",
  "author": "sead-fadilpasic",
  "summary": "Deal had been announced in April 2021",
  "article": [
    "The European Commission’s Competition department is investigating Microsoft’s acquisition of Nuance Communications.",
    "According to Reuters, the EU’s antitrust watchdog recently distributed a questionnaire to Microsoft’s customers and competitors in which it asked them to list different concerns they might be having with the deal, which was announced in April 2021.",
    "The organization also wants to know whether or not the two companies were competitors, or if the deal would affect clients and rivals.",
    "The watchdog is concerned if Microsoft will favor Nuance over competing services.",
    "Nuance's flagship product is its Dragon speech recognition software platform, which utilises deep learning models to improve the accuracy of speech transcriptions.",
    "But the company has a number of other Software-as-a-Service (SaaS) offerings, created mostly for the healthcare industry. One of the most important use cases are doctors and call center agents automating note-taking. The company claims to be serving more than three-quarters (77%) of U.S. hospitals.",
    "Announcing the deal, Microsoft said it wanted to leverage Nuance’s AI knowledge for Interactive Voice Response (IVR), virtual assistants, and digital biometric solutions. Apple’s digital assistant, Siri, was one of the most popular Nuance licensees at the time.",
    "The deal was expected to close by the end of the year, but the deadline seems to have been pushed into early 2022. Both the U.S. Department of Justice, and the Australian Competition Commission reviewed the deal and decided not to contest it. The two companies filed for approval from the European Commission's competition bureau last month.",
    "The watchdog now has until December 21 to either clear the deal, or kick off a much larger investigation.",
    "Both Microsoft and Nuance have so far declined to comment on the matter."
  ],
  "headers": {
    "3": "Servicing the healthcare industry"
  },
  "links": {
    "Microsoft’s acquisition of Nuance Communications": "https://www.techradar.com/news/microsoft-buys-ai-speech-firm-nuance-communications",
    "Reuters": "https://www.reuters.com/markets/deals/exclusive-eu-antitrust-regulator-seeks-input-microsofts-16-bln-nuance-deal-2021-12-07/"
  }
}