{
  "source": "https://www.techradar.com/news/i-expected-more-from-the-halo-tv-show-teaser",
  "title": "I expected more from the Halo TV show teaser",
  "category": "entertainment",
  "updated": "2021-11-16T10:06:06Z",
  "author": "tom-power",
  "summary": "Opinion: Halo, wake me when you actually need me",
  "article": [
    "It's been six years since the Halo TV show was supposed to launch worldwide, and yet we're still waiting for its arrival.",
    "Thankfully, a Master Chief-starring live-action adventure in the Halo universe will be with us soon – sometime in 2022, in fact. And, as part of Microsoft's Xbox 20th anniversary celebrations on November 15, we finally got our first look at how the TV adaptation will look.",
    "As cool as it was to get a tiny glimpse of the Halo TV show, though, I expected a lot more from its unveiling.",
    "Okay, maybe my expectations for a full reveal were a bit too high. This is a TV series that has spent the past eight years in development hell, with the likes of legendary filmmaker Stephen Spielberg attached to the project at one point.",
    "With so many development ups and downs, then, it's only right that showrunners Kyle Killen and Steven Kane – who won't return for a potential second season – have wanted to take their time with it.",
    "We've already seen first-hand, too, what happens when a Halo project is unveiled before it's ready to be shown off. Halo Infinite, the next entry in the iconic gaming franchise, made its debut during an virtual Xbox presentation in summer 2020. But its demo was slammed by fans and critics for its graphics and other issues, which led to developer 343 Industries returning to the drawing board to rework the game. As a result, Halo Infinite's launch was delayed by over a year. The game's multiplayer component, however, is live now ahead of the game's full release on December 8.",
    "Add in the Covid-19 pandemic, which caused filming on the Halo TV show to shut down in March 2020, and it isn't surprising why the likes of 343, Paramount Plus, Amblin Television and other partner studios are reluctant to jump the gun and reveal too much, too soon.",
    "And yet I was still expecting something more than what we got. It's possible that the leaking of the Halo TV show's teaser, which was seen advertised on social media ahead of its debuting at the Xbox 20th anniversary event, made me think that more footage would be shown.",
    "Maybe I thought the advert was a tease before the, well, main teaser arrived. Maybe I hoped that we'd see Master Chief in action, even if it was just for five seconds, to give us a taste of how the TV series channels the frenetic, supersoldier fights that we see in the games. Maybe I thought we'd hear how Pablo Schreiber, who is playing Master Chief, would sound in comparison to Steve Downes, the long time voice actor of John-117.",
    "Whatever it was, I was left underwhelmed by the footage on display. This is a TV show that's launching next year, after all, and we've barely seen anything to get us excited for its eventual arrival.",
    "Has this brief teaser put me off from watching the show when it arrives? No. Did anyone promise to show more and then fail to deliver? Again, no.",
    "But I was still left disappointed by what was teased. A close-up of John-117's scarred back, due to his augmentations, a couple of shots of his armor, Schreiber putting the iconic helmet on, and Jennifer Hale's Cortana saying \"Hello, Master Chief\" before the series' logo was displayed.",
    "And that was it. I wanted to be dazzled in some way by the Halo TV show teaser, or excited by a quick clip of the legendary hero in action.",
    "But, as I turned the Xbox 20th anniversary event livestream off on November 15, I was more hyped about the 76 Xbox titles that are now backwards compatible on Microsoft's console than I was about the Halo TV show. And that stings.",
    "For more Halo content, find out how to fix the blue screen error for Halo Infinite's newly released multiplayer beta."
  ],
  "headers": {},
  "links": {
    "Halo TV show": "https://www.techradar.com/news/the-halo-tv-show-finally-has-a-tentative-release-date-and-a-new-streaming-home",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "is live now": "https://www.techradar.com/news/halo-infinite-multiplayer-is-available-to-play-right-now",
    "76 Xbox titles": "https://www.techradar.com/news/xbox-series-x-backward-compatibility-just-got-over-70-new-games",
    "how to fix the blue screen error": "https://www.techradar.com/how-to/how-to-fix-halo-infinite-blue-screen-error"
  }
}