{
  "source": "https://www.techradar.com/news/onedrive-update-will-makes-sharing-files-much-less-of-a-pain",
  "title": "OneDrive update will makes sharing files much less of a pain",
  "category": "computing",
  "updated": "2021-11-30T19:30:27Z",
  "author": "anthony-spadafora",
  "summary": "New update will let you pin frequently used shared libraries to OneDrive's Quick Access menu",
  "article": [
    "Sharing files from OneDrive will soon be both easier and faster as Microsoft is currently working on a new update for its cloud storage service.",
    "According to a post on the Microsoft 365 Roadmap, the software giant will soon allow users to pin and reorder shared libraries. When this new functionality becomes available next month, it will be easier for users to manage the list of places they've recently accessed or opened a file from.",
    "OneDrive users will also have a simpler time picking up where they left off as they will be able to pin their frequently used shared libraries to the menu on the left side.",
    "While this isn't a major update, it could prove especially useful for those that depend on Microsoft's online collaboration tools and office software as part of their daily workflow as they won't have to waste time trying to find a particular file or shared library.",
    "In a separate post, Microsoft announced that users of its cloud storage service will also soon be able to organize their “Add to OneDrive” shortcuts.",
    "Just like with the ability to pin and reorder shared libraries, this new file management feature will be available next month and with it, users will be able move their “Add to OneDrive” folder shortcuts into any private folder they create in OneDrive.",
    "Microsoft has spent a good part of this year adding new features and functionality to OneDrive and it will be interesting to see what improvements the company has in store for its cloud storage service next year as more people begin upgrading to Windows 11.",
    "Looking to move your files to the cloud? Check out our roundups of the best cloud storage and best cloud backup"
  ],
  "headers": {
    "4": "Add to OneDrive shortcuts"
  },
  "links": {
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9215733667535260000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D82165",
    "online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "office software": "https://www.techradar.com/best/free-office-software",
    "separate post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6495829585918598000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D82166",
    "file management": "https://www.techradar.com/best/the-best-file-manager",
    "upgrading to Windows 11": "https://www.techradar.com/news/barely-anyone-has-upgraded-to-windows-11-survey-claims",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "best cloud backup": "https://www.techradar.com/best/best-cloud-backup"
  }
}