{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leaks-reveal-marketing-materials-specs-and-cases",
  "title": "Samsung Galaxy S21 FE leaks reveal marketing materials, specs and cases",
  "category": "phones",
  "updated": "2021-12-03T07:43:33Z",
  "author": "david-nield",
  "summary": "Multiple spoilers follow",
  "article": [
    "If you're ready and waiting for the Samsung Galaxy S21 FE, then do we have some leaked images and details for you – they reveal just about everything there is to know about the upcoming phone, with some case designs thrown in as well.",
    "First we've got a pile of what look to be Samsung marketing materials from CoinBRS (via Android Police). We haven't heard anything from CoinBRS before, so approach with caution, but these do look very much in line with the promo images that Samsung normally puts out alongside its phones.",
    "What's more, these images match up rather nicely with previous leaks in terms of the appearance and aesthetics of the Samsung Galaxy S21 FE, which makes us more ready to accept that these pictures are in fact the real deal.",
    "We also get a bunch of specs alongside the pictures, which again match up with what we've heard before: expect a 6.4-inch (2340 x 1080 pixel) display with a 120Hz refresh rate, a triple-lens camera on the back led by a 64MP sensor, and either the Snapdragon 888 or the Exynos 2100 processor inside, depending on region.",
    "The leaks don't stop there though, because separately we have a look at some of the incoming Galaxy S21 FE cases from SammyHub (via SamMobile). These would appear to be official cases that Samsung is planning to unveil alongside the smartphone.",
    "We've got a silicone case, a clear case, and a clear case with an integrated kickstand that you can use to prop the phone up. The silicone cases come in green, violet, white, black and orange – the Galaxy S21 FE isn't expected to appear in orange but it seems as though one of the official cases will.",
    "Add these latest Samsung Galaxy S21 FE leaks to the pile of information that we've already got about the phone, and there really isn't all that much more for Samsung to reveal in January. The rumor is that the Galaxy S21 FE is going to be unveiled just before CES 2022, with January 4 the big day.",
    "We've heard about all of the specs, we've seen the phone from the front and back, and we even know which colors it's going to appear in. Of course part of the reason we know so much about it is because we already have the Samsung Galaxy S21 series to refer to.",
    "The Galaxy S21 FE has been a long time coming – its predecessor launched back in October 2020 – and there were reports earlier in the year that Samsung was considering canceling the phone altogether after several delays.",
    "With that in mind it needs to be a success – Samsung has reportedly pushed back the launch of the flagship Galaxy S22 series in order to accommodate the Galaxy S21 FE, which means the pressure is on this affordable handset to justify this kind of special treatment and Samsung's loyalty to it."
  ],
  "headers": {
    "3": "Specs and cases",
    "6": "Analysis: not much more to reveal"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "CoinBRS": "https://coinbrs.com/news/coinbrs-exclusive-samsung-galaxy-s21-fe-5g-revealed-in-full-glory-all-official-images-specs/",
    "Android Police": "https://www.androidpolice.com/samsung-galaxy-s21-fe-fully-revealed-thanks-to-leaked-marketing-materials/",
    "previous leaks": "https://www.techradar.com/news/samsung-galaxy-s21-fe-renders-show-off-the-phone-in-full",
    "Galaxy S21 FE cases": "https://www.techradar.com/best/best-samsung-galaxy-s21-cases",
    "SammyHub": "https://sammyhub.com/2021/11/12/official-galaxy-s21-fe-cases-samsungs-website/",
    "SamMobile": "https://www.sammobile.com/news/galaxy-s21-fe-cases-give-us-another-glimpse-of-the-long-awaited-and-delayed-phone/",
    "just before CES 2022": "https://www.techradar.com/news/galaxy-s22-and-galaxy-s21-fe-launch-dates-revealed-in-latest-leaks",
    "which colors it's going to appear in": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-reveals-full-design-in-a-range-of-colors",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "its predecessor": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "considering canceling": "https://www.techradar.com/news/samsung-galaxy-s21-fe-is-almost-certainly-canceled-as-samsung-removes-support-page",
    "pushed back": "https://www.techradar.com/news/samsung-galaxy-s22-may-be-delayed-with-galaxy-s21-fe-taking-its-place-in-january"
  }
}