{
  "source": "https://www.techradar.com/news/github-releases-is-getting-a-major-upgrade-for-developers",
  "title": "GitHub Releases is getting a major upgrade for developers",
  "category": "computing",
  "updated": "2021-10-05T11:05:52Z",
  "author": "mayank-sharma",
  "summary": "Changes will introduce more clarity and convenience, reasons GitHub",
  "article": [
    "GitHub has announced a public beta of a major update to GitHub Releases, that aims to help developers streamline communication, while encouraging collaboration, and engagement.",
    "Anyone who has ever downloaded software from GitHub has interacted with Releases. In a snap, Releases helps developers put up their software packages in binary format along with the release notes, for every new release of the software.",
    "“Releases have been a core part of the GitHub experience since 2013 and serve as a way for maintainers to manage and promote releases for their projects alongside their project’s code,” explains GitHub.",
    "The new beta refreshes the user interface (UI), and brings in new features to showcase new contributors, and help project leads save time.",
    "One of the first new features of the beta release is the ability to automatically generate release notes.",
    "The feature is available on all repositories on GitHub.com, and works by identifying all of the pull requests that are part of a particular release, in order to automatically generate a summary, while also recognizing the efforts of first time contributors to the project.",
    "“This gives communities the chance to celebrate those who contributed to each release by prominently displaying the profile pictures of contributors. Anyone on GitHub.com can react to releases with emoji or click to sponsor a project they wish to support,” notes GitHub.",
    "While the new Releases features are available for all users, the new UI isn’t enabled by default, and must be enabled manually."
  ],
  "headers": {
    "4": "New features"
  },
  "links": {
    "GitHub": "https://www.techradar.com/news/github-is-making-it-easier-to-manage-all-your-companys-accounts",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "": "https://github.blog/2013-07-02-release-your-software/",
    "core part": "https://github.blog/2013-07-02-release-your-software/",
    "explains": "https://github.blog/2021-10-04-beta-github-releases-improving-release-experience/"
  }
}