{
  "source": "https://www.techradar.com/news/the-mortal-kombat-movie-was-a-much-bigger-hit-than-you-thought-it-was",
  "title": "The Mortal Kombat movie was a way bigger HBO Max hit than you thought it was",
  "category": "entertainment",
  "updated": "2021-08-09T10:00:05Z",
  "author": "samuel-roberts",
  "summary": "Opinion: Are people ready for more video game movies?",
  "article": [
    "This year's Mortal Kombat movie might've only made $83 million at the worldwide box office, putting it below the latest Evangelion movie in the 2021 charts, but it's reportedly proved to be a massive streaming hit.",
    "This past weekend, the long-awaited DC supervillain team-up movie The Suicide Squad hit HBO Max the same time it hit theaters. The movie didn't do amazingly at the box office, but it did rank as the second-best day-and-date movie premier to hit the US-based streaming service so far – still, it couldn't beat a surprising number one.",
    "According to THR's sources, Mortal Kombat is the most popular movie to open on HBO Max so far at the same time it hit theaters, which puts it ahead of Godzilla Vs Kong, Tom & Jerry, Space Jam: A New Legacy and the latest in The Conjuring series, as well as James Gunn's new DC movie.",
    "What does this tell us? Well, the Mortal Kombat franchise is probably more popular than people know. As of July 2021, the fighting game series has sold a massive 73 million copies, putting it significantly ahead of similar series Tekken (51 million) and Street Fighter (46 million), according to analyst Daniel Ahmad. In North America, the series has remained evergreen 29 years after it debuted in arcades, with the last two entries selling more than 10 million copies each.",
    "The appetite for a high-end adaptation of this source material was high, and it's not a surprise to learn that streaming the movie was so popular – the vast majority of people playing Mortal Kombat are doing so on a device that's compatible with HBO Max, like a PS4 or Xbox One. That surely helped in getting people to make the journey to check it out.",
    "Mortal Kombat certainly did okay at the box office, too, generating $22.5 million in its opening weekend versus The Suicide Squad's $26.5 million.",
    "Critics didn't love Mortal Kombat, but it landed at 55% positive reviews on Rotten Tomatoes. This is actually a little better than the last major adaptation of a game, 2018's Tomb Raider starring Alicia Vikander, which got 53%.",
    "Multiple reviews said that series diehards would likely enjoy the action-packed movie more than other viewers – but it turns out that there are a lot of them. The user reviews on Mortal Kombat sit at 86% positive, from more than 5,000 votes.",
    "You'd expect Warner Bros is happy with the results, especially if it got people to use HBO Max more than Godzilla fighting King Kong did. But there are other factors that might've made it more popular than expected.",
    "Game adaptations are historically bad, to the point where it's the main talking point whenever a new one comes along. The truth is, though, games have infiltrated recent pop culture in ways that are less obvious than movie adaptations. Mortal Kombat is just one sign of their ongoing success with audiences.",
    "Look at the two Jumanji movies starring Dwayne Johnson, for example, which are set in video game worlds, or the miserable virtual worlds of Ready Player One from Steven Spielberg. The new Ryan Reynolds movie Free Guy is set inside an open world game, too, and comes equipped with a blockbuster budget.",
    "In TV, the Castlevania series on Netflix has drawn acclaim despite being a very impressionistic use of the source material – and the streamer is now rolling out multiple Resident Evil shows, as well as adaptations of Dragon's Dogma and Assassin's Creed. The world's biggest streaming service likely wouldn't be doing this unless the numbers backed up the decision making. Netflix's Black Mirror draws upon the influence of video games in multiple episodes, too.",
    "Castlevania is the king of the pack, but these movies and shows are likely to keep improving just by the increasing number of them. It also helps that the people making these things are more likely to have had video games built into their lives from an early age than past generations of filmmaker.",
    "Assuming THR's report is correct – it confirms with Warner Bros than The Suicide Squad is the second-best launch on the service – there are other factors worth bearing in mind here.",
    "It doesn't reveal anything in terms of actual viewer numbers, for example, and it's possible that The Suicide Squad will pick up more steam in its 31 days on HBO Max. It should have word of mouth on its side as a universally acclaimed movie.",
    "But still, there's a lot to learn from the fact that people really wanted a Mortal Kombat movie – enough for it to be comparably popular to a massive DC Comics adaptation. That surely bodes well for the future of the form, and the possibility that games might be the next frontier for blockbuster movies after superheroes finally cool down a little.",
    "Mortal Kombat is no longer streaming on HBO Max, as it vanished after 31 days back in May, though we'd hope to see it appear again before the end of the year."
  ],
  "headers": {
    "9": "People are ready for expensive video game adaptations",
    "13": "What it means that more people streamed Mortal Kombat than The Suicide Squad"
  },
  "links": {
    "Mortal Kombat": "https://www.techradar.com/news/mortal-kombat-ending-explained-who-is-cole-young",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-is-refreshingly-ridiculous-but-too-chaotic-for-its-own-good",
    "THR": "https://www.hollywoodreporter.com/movies/movie-news/suicide-squad-box-office-jungle-cruise-1234994557/",
    "Daniel Ahmad": "https://twitter.com/ZhugeEX/status/1419653436740616193",
    "Black Mirror": "https://www.techradar.com/best/best-black-mirror-episodes-the-top-10-episodes-ranked"
  }
}