{
  "source": "https://www.techradar.com/news/windows-11-the-pros-and-cons-for-businesses",
  "title": "Windows 11: The pros and cons for businesses",
  "category": "computing",
  "updated": "2021-10-05T20:03:17Z",
  "author": "joel-khalili",
  "summary": "Windows 11 offers various features that businesses will celebrate, but there are problems too",
  "article": [
    "Microsoft has now begun the process of rolling out Windows 11 to compatible devices, a large proportion of which will be used for work-related activities.",
    "Beyond a sleek and curvaceous aesthetic, reorganized start menu and new-look taskbar, Windows 11 also offers a number of new features that will catch the eye of business users in particular.",
    "The new OS has clearly been optimized for hybrid working, whereby employees split their time between the home and office, with new options designed to allow users to multitask and pick up where they left off.",
    "According to Microsoft, Windows 11 also sets a new benchmark for performance and security, which will help businesses optimize for productivity and shield employees against an ever-changing roster of cyberthreats.",
    "“Windows is a driving force for innovation. It’s an enduring platform for each one of us to create. And it’s home for over a billion people to do their jobs, live their dreams and connect with the people they love,” said Panos Panay, Chief Product Office at Microsoft.",
    "“With the shift to hybrid work, where work is constantly changing, we understand the importance of an operating system that is flexible, consistent, secure and works how you do.”",
    "However, Windows 11 is also likely to create a few headaches for businesses too. The confusion surrounding hardware requirements is yet to be fully resolved, for example, and it looks like users are already encountering a few bugs at launch, so businesses will need to think carefully about when to pull the trigger on Windows 11.",
    "One of Microsoft’s main focuses in the run-up to the Windows 11 launch has been the new level of interoperability with collaboration platform Teams, which has been built into the core of the new OS (and has also received a Windows 11-flavored visual overhaul).",
    "In Windows 11, users can launch directly into Teams chats and meetings with a single click or touch, via an icon that takes a front-and-center position in the taskbar. The new system tray also hosts a mute button for easy access, addressing one of the most common pandemic faux pas.",
    "Microsoft has also introduced a series of upgrades designed to help users maximize productivity at work. For example, Windows 11 offers a new feature called Snap Layouts, which gives users a greater range of orientation options when multitasking across multiple windows or applications.",
    "When reconnecting a laptop or tablet to an external monitor, meanwhile, a feature called Snap Groups can be used to restore all windows to their previous location and orientation, making it easy to jump straight back in.",
    "“These new features are designed to help you organize your windows and optimize your screen real estate so you can see what you need just the way you want in a layout that’s visually clean,” says Microsoft.",
    "During the development of Windows 11, another area Microsoft honed in on was performance and security, two qualities that will top the priority list for any business.",
    "Although the company has not provided hard data, it says Windows 11 boot times are significantly faster, and so is authentication service Windows Hello. Navigating the web and web-based services is also said to be much snappier, and not just on Edge.",
    "The new OS reportedly uses less energy too, which should translate to longer battery life when employees are working on their travels.",
    "Separately, Microsoft has made a point of highlighting Windows 11’s security credentials, with new protections added at a chip and cloud level to ensure company assets remain secure no matter where employees are located.",
    "“Key security features like hardware-based isolation, encryption, and malware prevention are turned on by default. We have also made going passwordless easier by simplifying the steps to deploy Windows Hello for Business,” explained the firm.",
    "“And all these components work together in the background to keep users safe without sacrificing quality, performance or experience.”",
    "With security front of mind, Microsoft has also introduced a strict new set of hardware requirements for Windows 11. For example, all Windows 11-compatible CPUs must feature an embedded TPM, and support secure boot, virtualization-based security (VBS) and specific VBS capabilities.",
    "However, while these requirements will shield users against attack (particularly at a firmware level), they are expected to create serious headaches for businesses too.",
    "Microsoft has confused just about everyone with its minimum hardware requirements for Windows 11. At the heart of the confusion is a piece of technology known as a Trusted Platform Module, or TPM.",
    "The job of TPM chips is to perform cryptographic operations that provide security at a hardware level and verify the authenticity of a system at launch. They also feature various mechanisms to make them resistant to tampering.",
    "Among other specifications relating to the CPU, RAM and storage, Windows 11 will require all machines to feature TPM 2.0 support, either built into the CPU or in the form of an additional chip connected to the motherboard.",
    "A recent report from device audit company Lansweeper suggested that only 44.4% of workstations are eligible to receive the automatic Windows 11 upgrade. And while Windows 11 can technically be deployed on incompatible machines, the installation process is manual (and therefore a giant undertaking for IT teams) and the devices will not receive the regular level of support from Microsoft.",
    "The picture is even more bleak when it comes to virtual machine workstations, only 0.23% of which have TPM 2.0 enabled. And as for the hypervisors themselves, only a few are currently able to meet the necessary requirements to run Windows 11.",
    "According to Microsoft, VMs created using the company’s own service (which comes bundled for free with Windows 10 Pro) will run Windows 11 just fine, provided they are set up as “Generation 2” VMs. And, anecdotally, VMware Workstation Pro is also said to meet the TPM requirement.",
    "However, other companies in the space will have to find a way to adhere to the rules. Oracle told TechRadar Pro it is working on a new version of its VirtualBox VM software, but Citrix did not return our request for comment.",
    "All this means that upgrading to Windows 11 will be far from smooth sailing in many scenarios.",
    "System requirements aside, Microsoft says it has done everything in its power to ensure upgrading from Windows 10 to Windows 11 as easy as possible for IT staff. For example, the company was careful to maintain consistency across the various Windows management tools - such as Endpoint Manager and Windows Update for Business - so everything should feel familiar to administrators.",
    "However, when a new operating system arrives, many businesses choose to delay before rolling it out far and wide - and for good reason. Although Windows 11 will have undergone extensive testing, both in the lab and during early-access, bugs are already beginning to crop up post-launch.",
    "So far, users have reported a variety of issues after installing Windows 11; some say they are experiencing poor Wi-Fi performance, some have found the Start menu search function is broken, and others are having problems with File Explorer. Perhaps most worryingly, it has been reported that Windows 11 suffers from memory issues that will eventually begin to cause slowdown.",
    "All in all, Windows 11 offers plenty for businesses to be excited about, from features that support new ways of working to additions designed to keep employees secure, no matter their location. And if Microsoft is able to deliver on its promises, Windows 11 will deliver value to businesses of all kinds as they look to capitalize on new opportunities in the post-pandemic landscape.",
    "That said, IT teams and business leaders will need to think carefully about whether these benefits are worth the inevitable hassles that early adopters face. Sometimes, after all, slow and steady wins the race."
  ],
  "headers": {
    "7": "Collaboration and productivity",
    "12": "Performance and security",
    "20": "Hardware requirements",
    "28": "To install, or not to install"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "tablet": "https://www.techradar.com/news/best-business-tablets",
    "monitor": "https://www.techradar.com/news/best-business-monitor",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "TPM": "https://www.techradar.com/news/computing-components/peripherals/what-is-tpm-and-why-does-it-matter-to-your-business-1192783",
    "hardware requirements": "https://blogs.windows.com/windows-insider/2021/08/27/update-on-windows-11-minimum-system-requirements-and-the-pc-health-check-app/",
    "recent report": "https://www.techradar.com/news/windows-11-tpm-requirements-will-cause-massive-headaches-for-businesses",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "technically be deployed on incompatible machines": "https://www.techradar.com/news/windows-11-shouldnt-run-on-older-pcs-but-microsoft-wont-stop-you-from-trying",
    "virtual machine": "https://www.techradar.com/best/best-virtual-machine-software",
    "meet the necessary requirements": "https://www.techradar.com/news/bad-news-vm-fans-windows-11-hardware-requirements-strike-again",
    "Windows 10 Pro": "https://www.techradar.com/news/best-windows-10-pro-laptops",
    "variety of issues": "https://www.techradar.com/how-to/windows-11-problems-how-to-fix-the-most-common-issues"
  }
}