{
  "source": "https://www.techradar.com/news/inside-reminiscence-the-hbo-max-thriller-movie-inspired-by-real-life-science",
  "title": "Inside Reminiscence, the HBO Max thriller movie inspired by real-life science",
  "category": "entertainment",
  "updated": "2021-08-28T14:00:00Z",
  "author": "tom-power",
  "summary": "“We wanted to build a world that was futuristic and retro at the same time”",
  "article": [
    "Reminiscence is a movie that provides an intriguing look into our own world’s potential future.",
    "Set in the year 2050, the sci-fi thriller follows Nick Bannister (Hugh Jackman), a Miami-based private investigator whose repurposed army interrogation machine lets people relive any memory they like.",
    "When a client called Mae (Rebecca Ferguson) enters Nick’s life, changes it for the better and suddenly vanishes without trace, he attempts to track her down. But Nick’s desperate search through Florida’s flooded streets – a byproduct of a recent natural disaster – becomes more dangerous than he anticipates.",
    "Reminiscence’s submerged setting and futuristic technology may seem a long way off, but they’re not. Rising sea levels and the ability to recall our memories aren’t distant possibilities; they’re grounded in real-life science and may be closer to reality than we thought.",
    "With Reminiscence out now on HBO Max and in theaters, TechRadar sat down with VFX supervisor Bruce Jones and production designer Howard Cummings to find out how its scenic dystopia was created. We also discuss the real-world experimental technology that inspired Nick’s reminiscence machine and the challenges associated with bringing both aspects to life.",
    "From the outset, writer-director Lisa Joy (Westworld) wanted to craft a world where coastal regions had been partly swallowed by the oceans. Real-world studies have attributed rising sea waters to climate change, but Joy was reluctant to make statements about global warming through Reminiscence’s plot.",
    "Instead, a decision was made to focus on how humanity would adjust to living in flooded cities, with an Italian city serving as a blueprint for Joy’s vision.",
    "“Lisa’s very visual in her storytelling and she wanted global warming to be the cause of Miami’s flooding,” Cummings explains. “We looked at how people would adapt, rather than abandon, Florida and use it like Venice. So we created a map of Miami with flooded and dry areas, and delineated them as areas where the poor and wealthy lived.”",
    "To provide audiences with a clearer picture of its dystopian setting, Reminiscence opens with a three-minute aerial shot that reveals the scope of the flooding. It’s a sequence all the more impressive as Reminiscence wasn’t filmed in Miami. Rather, principal photography occurred nearly 1,000 miles away in New Orleans, Louisiana.",
    "How, then, was Miami recreated in such painstaking detail for Reminiscence’s opening vista? As Jones reveals, by using two specific imaging techniques: Photogrammetry and Light Detection and Ranging (LIDAR).",
    "The first, often used by architects, allows individuals to take multiple, overlapping images of objects and recreate them as 3D models on a computer. Meanwhile, LIDAR uses a targeted laser to build an accurate representation of the Earth’s topography. Merging these with aerial footage of Miami enabled the VFX team to reconstruct the city from scratch.",
    "“We would find nondescript or very specific New Orleans streets that looked identical to ones we’d scouted in Miami,” Jones says. “We made lots of drone references of Miami properties, and then matched those shots with our New Orleans footage using a combination of Google Earth, photogrammetry and LIDAR. Then Rise, our primary VFX vendor, built every model, texture and shader to create the sequence you see.”",
    "Reminiscence’s flooded setting isn’t the only world-building aspect that’s central to its plot. The memory machine is integral to how the story unfolds, with Nick and the local police department using it to get to the bottom of Mae’s disappearance.",
    "Its design was a two-fold process: making it futuristic enough to show advancements in technology have occurred between 2021 and 2050, but grounding it in realism based on the relatively short number of years that have passed.",
    "The machine’s water-filled pod is similar to stasis pods seen in far future sci-fi properties including Interstellar and Star Trek. Meanwhile, on the surface at least, the headgear’s design resembles electrode caps worn by patients during electroencephalograms (EEGs) to study brain activity – thus covering both design bases.",
    "Present day medicine wasn’t the only real-world technology that informed the headgear’s final form. As Cummings reveals, ongoing research at MIT also played a major role.",
    "“We had access to graduate students’ research,” Cummings says. “One student developed a device that rests against your chin and head, and lets you control a computer with your thoughts. Another student created headgear that would interpret what people were dreaming. We saw a recorded demonstration where a computer would cycle through an image database and come up with something that was close to what that person was dreaming. It was fascinating to see, so we took those influences and incorporated them into the machine’s functionality.”",
    "Part of that functionality is the recreation of clients’ memories, which aren’t displayed as simple 2D wall projections that Nick watches. Instead, the design team built a circular set – dubbed the Hamburger – that enabled actors to walk around and view 3D memories from different angles.",
    "The integration of holographic technology, too, helped to lend a greater sense of sci-fi flair to proceedings.",
    "“We did lots of research on how holograms work,” Jones says. “Everything from lazers to smoke-filled rooms and plexiglass, and then we threw all of that away. We wanted something more visceral; something you could almost touch. We wanted you to feel that connection between Nick and Mae where you think they’re in the same room. But they’re not, because one of them is a hologram.”",
    "Step forward Hologauze, a highly transparent and reflective projection surface that offers a 360-degree field of view around its subject.",
    "Created by audiovisual technologist Stuart Warren-Hills, Hologauze’s support for 3D polarized images and screen grain – desired elements for Reminiscence’s memory recreations – made it an ideal choice for this element of the machine.",
    "“Hologauze has been used by YouTube and for concerts,” Cummings explains. “It’s famous for recreating Michael Jackson on stage and it allowed our actors to react to peoples’ memories in real time. We didn’t want to add the memories later with VFX, so we enlisted Hologauze’s help to create a system to project imagery of the memories.”",
    "Semi-virtual movie productions are never without their problems – Reminiscence included. The filming of underwater sequences and compositing the 3,400-frame opening flythrough shot were tough challenges to overcome.",
    "But both issues paled in comparison to the gruelling issues with positioning Hologauze inside the cylindrical Hamburger set.",
    "“Take any type of fabric and wrap it in a cylinder, and it’ll concave in the middle,” Cummings explains. “That gave us something unique from a filming perspective. But the problem was we had to shoot our memory scenes ahead of time so our cast had something to reference during the real-world sequences.”",
    "Shooting memory sequences first presented numerous issues. For one, camera placements had to line up with one another. If a specific angle was used to film one sequence, the same camera position was required to shoot scenes with real-life actors present. Otherwise, parallax, the process whereby an object is displaced because of a change in the observer’s viewpoint, would be unavoidable.",
    "“The camera planes have to line up, otherwise driving your camera dolly rig left or right, or up and down, will parallax,” Jones says. “Getting the Hologauze to work on a curved surface, allowing the cast to walk around and interact with it, and getting shots that matched your initial filmed sequences, was my biggest filming headache.”",
    "As it happens, a simple piece of rope – an item far removed from the futuristic tech used in the movie – allowed Joy to map out camera placements based on the diameter of the Hamburger set’s dimensions.",
    "“When Nick is standing on the floor looking at a memory, that’s one eyeline,” Cummings says. “But when you’re watching over his shoulder and looking at an image up close, that’s a different perspective. So I gave Lisa some rope and said ‘stand where you need to for a shot, move it around and you’ll see what’s in the field of view'. Using that, we built our projector system to accommodate specific angles for certain shots.”",
    "Despite its charismatic lead in Jackman and thrilling plot, Reminiscence’s meagre $4.9 million box office haul is indicative of its failure to capture viewers’ attention. A combination of average-to-poor reviews, the HBO Max release and uptick in Covid-19 Delta variants cases won’t have helped either.",
    "In a time where some viewers and industry employees want more originality from studios, it’s a shame that it didn’t resonate with audiences. With its development ingenuity, impressive world building and real-life scientific inspiration, Reminiscence deserved better – not only from an filmmaking appreciation viewpoint, but from a scientific one, too.",
    "Reminiscence is out now in theaters and on HBO Max."
  ],
  "headers": {
    "5": "An idea surfaces",
    "12": "Making a memory machine",
    "23": "System errors"
  },
  "links": {}
}