{
  "source": "https://www.techradar.com/news/playstations-partnership-with-discord-may-link-the-chat-service-to-your-ps5",
  "title": "PlayStation's new partnership with Discord may link the chat service to your PS5",
  "category": "gaming",
  "updated": "2021-05-03T18:00:28Z",
  "author": "samuel-tolbert",
  "summary": "A new partnership is born",
  "article": [
    "It's official: Sony is investing in Discord. The company has purchased a minority stake in the chat service, with the teams across Sony and Discord working to integrate Discord with PlayStation \"closer together on console and mobile starting early next year,\" Sony Interactive Entertainment CEO Jim Ryan announced today in a statement.",
    "The partnership will enable friends to \"hang out, have fun, and communicate more easily while playing games together\" – presumably by allowing Discord interactions on PlayStation consoles, though the announcement didn't clarify how integrated the chat service would become. Interestingly enough, this news comes just a couple of weeks after the news broke that Microsoft attempted to buy Discord for several billion dollars, but that eventually negotiations fell through.",
    "With Discord receiving a minority stake investment from Sony, the company appears to be staying independent for now.",
    "It's likely we won't have more information until early in 2022 or shortly before then, but it seems likely that PS5 users could be getting cross-platform chat and messaging via Discord. Sony is bringing more and more games to PC, such as a port of Days Gone, with a \"whole slate\" of other titles to follow, so connecting these userbases together certainly makes sense from a business perspective.",
    "This could also be used for cross-platform chat not just for PlayStation and PC users, but potentially other platforms like Xbox if support is added as time goes on. With that in mind, Sony may have some sort of console platform exclusivity in place as part of its minority investment terms, so we'll have to wait and see how things pan out."
  ],
  "headers": {
    "3": "What else could this mean moving forward?"
  },
  "links": {
    "announced": "https://www.sie.com/en/blog/announcing-playstations-new-partnership-with-discord/",
    "buy Discord": "https://www.techradar.com/news/discord-reportedly-staying-independent-denying-rumored-microsoft-buyout",
    "such as a port of Days Gone": "https://www.techradar.com/news/ps4-survival-game-days-gone-hits-pc-in-may"
  }
}