{
  "source": "https://www.techradar.com/news/watch-out-windows-10-google-chrome-is-getting-super-charged-web-apps",
  "title": "Watch out Windows 10, Google Chrome is getting super-charged web apps",
  "category": "computing",
  "updated": "2021-05-21T10:22:26Z",
  "author": "daryl-baxter",
  "summary": "Web apps are about to multiply",
  "article": [
    "Web apps have been a staple of browsers such as Google Chrome for a while now, and they’re set to be even more useful thanks to an upcoming update.",
    "Using an app within your web browser has made it much easier for those who just want to go to one place on their PC to access their most used apps; Google with their Chromebooks are all about this, for example.",
    "Using Google Chrome to access your documents, your bitcoin stocks, your social media channels and lots more all in the same place is appealing to many. However, web apps are set to gain even more useful improvements in the coming months.",
    "Instead of an app being installed on your PC, it runs on a web server instead, accessible through a shortcut on your web browser. Almost no space is used on your hard drive, the only requirement is an internet connection.",
    "But with technologies and mobile speeds becoming more sophisticated, it means that Google can go even further in how a web app can operate.",
    "Google is currently working on a method for a web app to spawn multiple windows within the same browser, which is being called Desktop PWA Sub Apps. It’s aimed more towards productivity suites such as Microsoft Office and Google Docs, where you can run multiple apps in the same browser, with each one working with one another.",
    "This feature is also able to have its own icon on your taskbar, so it could give the impression that it’s an application that’s installed on your PC. At present it’s unavailable in any build of Google Chrome, but it’s likely to appear very soon.",
    "With web apps on the cusp of becoming more sophisticated, it brings into question Microsoft’s efforts with apps on its side. It’s common knowledge that its own Microsoft Store is a mess, filled with many poorly-designed apps. With a web browser however, it’s now easier than ever to have a suite of apps installed in one place, without looking at a separate store for your needs.",
    "With multiple windows now on the horizon, there could be some form of ultimate irony where users are soon installing web apps to their browser more so than into their local Program Files folder.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Multi-Window Web Apps",
    "7": "The Invisible Symbiote"
  },
  "links": {
    "currently working on": "https://chromium-review.googlesource.com/c/chromium/src/+/2684855",
    "Windows Latest": "https://www.windowslatest.com/2021/05/21/google-chromes-new-feature-will-improve-productivity-web-apps/"
  }
}