{
  "source": "https://www.techradar.com/news/toshiba-is-bringing-quantum-computing-capabilities-to-the-desktopkind-of",
  "title": "Toshiba is bringing quantum computing capabilities to the desktop...kind of",
  "category": "computing",
  "updated": "2021-03-30T09:59:31Z",
  "author": "mayank-sharma",
  "summary": "Plug-and-play supercomputers, anyone?",
  "article": [
    "Toshiba looks to have made a signficiant breakthrough by having seemingly managed to scale its quantum computing-inspired algorithm onto a field-programmable gate array (FPGA) that can be plugged into workstations.",
    "The Simulated Bifurcation Algorithm (SBA) is Toshiba’s quantum-inspired classical heuristics algorithm, which the company claims is an order of magnitude faster than competing technologies.",
    "In a new video, Toshiba engineers claim to pack an SBA imprinted FPGAs into what appears to be an Intel PCIe card that can simply be plugged into a standard workstation for an instant computational boost.",
    "SBAs are ideal for solving large optimization (CO) problems, such as vehicle routing, supply chain management, molecular modelling, risk assessment, and more, as long as they are expressed as ISING models.",
    "Toshiba currently offers Simulated Bifurcation Machines (SBM), which are physical systems that are powered by the bifurcated algorithms. These SBMs are also part of Microsoft’s Azure Quantum ecosystem and can also be used via Amazon’s AWS marketplace. While Toshiba offers the SBM for free, AWS charges $3.06/hr of use in its EC2 IaaS service.",
    "Reportedly, Toshiba is now trialing the plug-and-play versions of the SBMs in Japan. In the video Toshiba claims that besides workstations and servers, the portable SBMs can be plugged into drones and robots as well.",
    "If successful, the plug-and-play SBMs will make it possible to solve complex, large-scale CO problems on stock hardware, eliminating the need for dedicated hardware, significantly reducing the costs involved with supercomputing.",
    "Via: The Register"
  ],
  "headers": {
    "3": "Plug-and-play"
  },
  "links": {
    "quantum computing": "https://www.techradar.com/news/a-fridge-thats-colder-than-outer-space-could-take-quantum-computing-to-new-heights",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "Amazon’s AWS": "https://www.techradar.com/news/aws",
    "IaaS service": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "The Register": "https://www.theregister.com/2021/03/30/toshiba_on_prem_simulated_bifurcation_machine/"
  }
}