{
  "source": "https://www.techradar.com/news/forget-prime-day-this-walmart-airpods-deal-beats-amazons-discount-by-dollar25",
  "title": "Forget Prime Day – this Walmart AirPods deal beats Amazon's discount by $25",
  "category": "audio-visual",
  "updated": "2021-06-21T22:12:05Z",
  "author": "olivia-tambini",
  "summary": "Save money with a pair of refurbished Apple AirPods",
  "article": [
    "We've seen some fantastic Prime Day deals on Apple's popular range of AirPods true wireless earbuds and headphones, but this excellent discount from Walmart beats them all.",
    "Costing $159 at launch, Walmart is selling the Apple AirPods with Charging Case for just $99, a return to the lowest price we've seen for these earbuds. (Not in the US? Scroll down for AirPods deals in your region).",
    "Now, this deal is for a refurbished pair of Apple AirPods – though Walmart says all certified refurbished electronics are cleaned and repaired before testing, and come with the original accessories. So, you're essentially getting a 'like-new' pair of AirPods at a steep discount. You're also getting a 90-day warranty, so if you're not happy with your 'Pods, you're protected.",
    "The Apple AirPods (2019) are an upgraded version of the original 2016 AirPods, and while they're starting to get on a bit in age, they're still a popular choice for those looking for true wireless earbuds.",
    "Compared to the older model, the visual design remains the same, but inside, you get a faster H1 processor chip, 50% more talk time, and hands-free Siri interactions.",
    "Battery life comes in at five hours from the earbuds themselves, while the charging case provides a further 20 hours of battery life. They have a lively, powerful presentation, although they can sound slightly harsh when it comes to higher-frequency sounds, and they aren’t the bassiest earbuds on the market – but they're undeniably popular, and are comfortable to wear for long periods of time.",
    "They're also being updated all the time. A recent upgrade made the AirPods able to announce notifications with Siri, thanks to iOS 15, which builds on the earbuds' ability to announce your messages.",
    "If you're looking for deals on the noise-cancelling AirPods Pro or the over-ear AirPods Max, check out our guide to the best Prime Day AirPods deals, where we're bringing you all the latest discounts on Apple headphones.",
    "No matter where you live, you'll find all the lowest prices for the Apple AirPods, AirPods Pro, and AirPods Max from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best AirPods deal on Prime Day",
    "8": "More Apple AirPods deals",
    "9": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Apple AirPods with Charging Case for just $99": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-5395103011127589000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FRefurbished-Apple-MMEF2AM-A-AirPods-Wireless-Bluetooth-Earphones%2F182758816%3Firgwc%3D1%26sourceid%3Dimp_yUTVgU2R8xyLWguwUx0Mo3EFUkB1Ag3%253A4VY5R80%26veh%3Daff%26wmlspartner%3Dimp_1943169%26clickid%3DyUTVgU2R8xyLWguwUx0Mo3EFUkB1Ag3%253A4VY5R80%26sharedid%3D%26affiliates_ad_id%3D568844%26campaign_id%3D9383",
    "Apple AirPods (2019)": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Prime Day AirPods deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-airpods-deals-all-the-best-sales-in-one-place"
  }
}