{
  "source": "https://www.techradar.com/news/the-matrix-4-actor-seems-to-confirm-hes-playing-morpheus-in-the-trailer",
  "title": "The Matrix 4 actor seems to confirm he's playing Morpheus in the trailer",
  "category": "entertainment",
  "updated": "2021-09-10T09:59:17Z",
  "author": "samuel-roberts",
  "summary": "But is the truth more complicated?",
  "article": [
    "One of the big questions arising from this week's The Matrix Resurrections trailer – we covered most of them in our Matrix 4 trailer breakdown – is around the character played by actor Yahya Abdul-Mateen II.",
    "The Watchmen and Candyman actor certainly appears to have a big role in the new film, but the numerous references we get to Laurence Fishburne's Morpheus around Abdul-Mateen's character had led to speculation that he was connected in some way.",
    "Well, the actor himself might now have confirmed his role in the film – the actor shared a photo of his character firing two submachine guns on Instagram with the simple caption 'MORPHEUS'. Check it out below:",
    "We're guessing the truth is probably slightly more complicated than this. Morpheus, after all, actually survived the events of The Matrix Revolutions, the third instalment of the original trilogy – and while Fishburne does not feature in the fourth Matrix movie's cast, Jada Pinkett Smith, who played his former/future romantic partner Niobe, does appear in the movie. Some have speculated Abdul-Mateen's character could be their child.",
    "Again, we're keen not to draw any big conclusions here, in case it looks embarrassing in four months when we all get this wrong. But Abdul-Mateen's referencing 'Morpheus' at least suggests that the character has some connection to Zion's hero, especially when considered alongside some of the more obvious references in the trailer. Abdul-Mateen's character is the one to offer Neo the red or blue pill in this new sequel, and we also see the pair scrapping in a dojo, recalling two iconic scenes from the first movie – and we even see this new character wearing similar sunglasses to Morpheus.",
    "Perhaps he's just taken the codename and the aesthetic?",
    "The Matrix Resurrections will release on December 22 worldwide, though HBO Max subscribers can watch it for 31 days on the ad-free plan in the US.",
    "We may learn more about the movie later today, September 10. Director and co-writer Lana Wachowski is due to appear on a panel with Cloud Atlas author David Mitchell, who also co-wrote this screenplay. You can check that out here.",
    "A big talking point over the past 24 hours has been the fate of Morpheus in The Matrix canon. The character was technically killed off in the little-played video game The Matrix Online back in the mid-'00s – this was an official product with the Wachowskis' backing, at a time when they were clearly happy to step away from the series.",
    "Now, you could argue that this is canon, and that it explains why Fishburne didn't make the cut in Matrix 4. However, we're willing to believe that Lana Wachowski wouldn't let such a great character be taken off the board by a failed MMO game – and that the choice not to cast Fishburne was instead driven by storytelling decisions.",
    "Still, The Matrix Online is a fascinating product of its time. The attempt to continue the story of the movies in a computer game is conceptually sound, but The Matrix Online was another bumpy effort to take the series into the interactive space – Enter the Matrix and The Matrix: Path of Neo are not remembered as classics, all these years later.",
    "If you want to see Morpheus die in a bad video game cutscene, check out the below:"
  ],
  "headers": {
    "8": "Analysis: did Morpheus die in The Matrix Online?"
  },
  "links": {
    "Matrix 4 trailer breakdown": "https://www.techradar.com/news/the-matrix-4-trailer-breakdown-11-things-we-noticed-in-the-resurrections-teaser",
    "here": "https://www.youtube.com/watch?v=rtLbghso0Zc"
  }
}