{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-shown-off-in-full-by-unofficial-renders",
  "title": "Samsung Galaxy S22 Ultra shown off in full by unofficial renders",
  "category": "phones",
  "updated": "2021-12-03T07:41:39Z",
  "author": "david-nield",
  "summary": "New camera design and a new shape",
  "article": [
    "The Samsung Galaxy S22 is expected to be unveiled at the start of next year, and a set of high-quality, unofficial renders have now given us our first proper look at the Ultra model – with one or two surprises visible in the images.",
    "These renders (see below) are courtesy of well-known tipster @OnLeaks and tech site Digit, and they're based on information leaked from inside sources. While these sources can usually be relied upon, bear in mind that the final Galaxy S22 Ultra design might vary from what we're looking at here.",
    "We've got a change in the rear camera module design, with an unusual P-shaped bump that doesn't look much like the camera setup we saw on the Galaxy S21 Ultra. Perhaps most significantly, we've got an integrated slot for the S Pen.",
    "Last year's S21 Ultra was the first non-Note to support Samsung's stylus, but there wasn't anywhere to put it on the phone – you had to invest in a separate phone case in order to carry around the stylus more easily. Next year it looks as though that will change (and S Pen support has been backed up by multiple sources).",
    "The Samsung Galaxy S22 is also going to come with a squarer-edged design at the top and bottom, based on the evidence of these renders, which suggests that it is indeed replacing the Galaxy Note in Samsung's line-up – remember we didn't get a Galaxy Note 21 this year.",
    "We've got a couple of colors to look at here, namely black and a light purple-ish shade, but there's no additional information in this leak on the shades that the Galaxy S22 Ultra is going to come in – or what we can expect from the rest of the phones in the series.",
    "In terms of the internals on the phone, we've heard that the S22 Ultra might not have much of a camera quality boost, although at the same time we are also expecting a bigger and better quality display on the Ultra model.",
    "At first glance, these new Samsung Galaxy S22 Ultra pictures are reminiscent of one phone in particular – the Galaxy Note 20. There are certain design similarities in terms of the overall shape of the unit, and of course there's the support for the S Pen and now the integrated slot where it can be stored.",
    "After a lot of rumor and counter-rumor, we never did see a Galaxy Note 21 in 2021. Samsung never gave a definitive reason as to why the phone was canceled, but the global chip shortage was probably one of the key factors.",
    "Samsung had another flagship phone to focus on in August as well: the Galaxy Z Fold 3, which many industry observers are seeing as the successor to the Galaxy Note. Like the S21 Ultra, the Z Fold 3 supports the S Pen but doesn't feature a slot for it.",
    "We don't have a crystal ball in terms of predicting whether or not the Galaxy Note 22 is ever going to see the light of day, but considering that the S Pen is now supported on a wider range of handsets, and the S22 Ultra is set to have a very Note-like look, we'd say it's looking unlikely."
  ],
  "headers": {
    "4": "Colors and internals",
    "7": "Analysis: it isn't looking good for the Note"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "@OnLeaks": "https://twitter.com/OnLeaks/status/1441426057316368389",
    "Digit": "https://www.digit.in/news/mobile-phones/samsung-galaxy-s22-ultra-exclusive-leaked-renders-specs-61203.html",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "phone case": "https://www.techradar.com/best/best-samsung-galaxy-s21-cases",
    "multiple sources": "https://twitter.com/UniverseIce/status/1441292608278462470",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "we've heard": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-could-be-a-boring-upgrade",
    "also expecting": "https://www.techradar.com/news/samsung-rumored-to-shrink-galaxy-s22-save-best-display-and-glass-for-s22-ultra",
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review"
  }
}