{
  "source": "https://www.techradar.com/news/this-hp-labor-day-chromebook-deal-is-a-bargain-at-under-dollar150",
  "title": "This HP Labor Day Chromebook deal is a bargain at under $150",
  "category": "computing",
  "updated": "2021-09-06T13:59:12Z",
  "author": "james-pickard",
  "summary": "Get an ultra-portable work and school laptop for almost half price",
  "article": [
    "Need a device for school or work and on a tight budget? You'll want to take yourself over to the HP Labor Day sale where you can find one of the lowest prices we've seen for a Chromebook right now.",
    "The HP Chromebook 11a is just $129.99. That’s a $100 saving off the usual price and the cheapest you'll likely ever see a laptop with this spec. In fact, it's the lowest price device in all the Labor Day laptop sales we've currently gathered together.",
    "Of course, you aren't getting a top of the line device at this price. As a laptop for school or a device for basic browsing and everyday tasks at home, though, this is more than suitable. The 32GB storage could be a limiting factor for some, but remember the intention with a Chromebook is to use cloud storage as much as possible.",
    "When you're getting a fully functioning laptop at the price of a decent tablet, it's tough to complain. The HP Chromebook 11a is an ideal portable device for your most basic computing needs.",
    "If you don't think that's quite the right device for you then we've got even more cheap Chromebook deals for you to browse through below.",
    "Fancy saving some more money? You can check out our more in-depth look at all the best Labor Day sales throughout the day. More specifically, we've got pages dedicated to the Labor Day TV sales and the best Amazon Labor Day deals."
  ],
  "headers": {
    "4": "More cheap Chromebook deals"
  },
  "links": {
    "HP Chromebook 11a is just $129.99": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1142572104800761000&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fpdp%2Fhp-chromebook-11a-na0010nr",
    "Labor Day laptop sales": "https://www.techradar.com/news/the-10-best-labor-day-laptop-sales-2020",
    "cheap Chromebook deals": "https://www.techradar.com/news/cheap-chromebook-deals",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020",
    "Labor Day TV sales": "https://www.techradar.com/news/labor-day-tv-sales-deals-wont-last-much-longer",
    "Amazon Labor Day deals": "https://www.techradar.com/news/amazon-labor-day-sale-2020"
  }
}