{
  "source": "https://www.techradar.com/news/halo-infinites-huge-file-size-isnt-a-surprise-but-its-a-growing-problem-on-xbox-series-x",
  "title": "Halo Infinite’s huge file size isn’t a surprise, but it’s a growing problem on Xbox Series X",
  "category": "gaming",
  "updated": "2021-08-12T09:58:56.079Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Space is at a premium on Xbox Series X|S",
  "article": [
    "Halo Infinite will apparently require 97.24GB of storage space to download, according to a leaked image from the Microsoft Store.",
    "If that turns out to be true, Halo Infinite will be yet another Xbox exclusive that comes with a massively bloated file size – and it’s something that’s become a real point of contention on Xbox Series X|S.",
    "A quick look at some of Microsoft’s first-party exclusives shows a worrying trend: Gears 5 takes up 101.5GB, Forza Motorsport 7 needs 98.6GB, Halo 5: Guardians gobbles up 98.8GB, Forza Horizon 4 requires 86.2GB, Halo: The Master Chief Collection eats 103.9GB of space, and Flight Simulator takes up no less than 102GB.",
    "Yes, you can shrink some of these titles’ file sizes by installing and uninstalling specific parts, like only downloading the campaign in Gears 5. But on average – and if you want to experience everything a game has to offer – you best be prepared to sacrifice a large chunk of your storage space.",
    "When you compare the file sizes of Xbox Series X games to notable PlayStation 5 titles, it becomes even more frustrating. Sackboy: A Big Adventure is 31.24GB, Ratchet and Clank: Rift Apart is 42.19GB, while Returnal and Demon’s Souls are 55.56GB and 53.65GB respectively.",
    "Other titles like Destruction AllStars weigh in at only 36.66GB, while Marvel’s Spider-Man Remastered – which includes all the game’s previously released DLC – takes up 53.66GB. The only first-party title that I found that comes close to matching Microsoft’s line-up of heavyweight file sizes is Gran Turismo Sport, which is a chunky 97.38GB.",
    "Yes, you can argue there’s some disparity over file sizes due to the types of games Sony and Microsoft offer, with the latter’s titles tending to be more online focused. But there’s still a clear gap between the two when it comes to the average file size.",
    "As we’ve seen with some PS4 games releasing on PS5, the console’s compression technology, known as Kraken, seems to be one of the reasons why PlayStation 5 games are smaller in general.",
    "Subnautica takes up 14GB on PS4; however, its re-release on PS5 only requires 3.5GB of space – a reduction of 70%. We’ve also seen the benefits of the PS5’s SSD compression tech on games like Control: Ultimate Edition, which weighs in at 42.5GB on Xbox Series X, but only 25.79GB on PS5. That’s a reduction of 39%.",
    "The burgeoning size of Xbox games is even more egregious if you own an Xbox Series S. The digital-only console comes with 364GB of usable storage, which means you’d be able to install just over three of the titles listed above on Microsoft’s diminutive Xbox. File sizes do tend to be slightly smaller on Xbox Series S, due to the console targeting a lower resolution, but it’s still not enough to claw back some much needed space.",
    "Of course, you can expand both the Xbox Series X and Xbox Series S’ storage with the Seagate 1TB Storage Expansion Card or use an external hard drive to store larger Xbox One games (something that is far simpler to do than finding the best SSD for PS5), but those drives will continue to fill up fast unless Microsoft finds a way to control the file sizes of its games.",
    "Halo Infinite is scheduled to release in Holiday 2021, which falls between November and December. A recent technical preview let players go hands-on with the game’s multiplayer, and it was, by all accounts, extremely well-received. Let’s just hope that when Halo Infinite does launch, we won’t have to forgo such a large portion of storage space to play it."
  ],
  "headers": {
    "4": "Large and in charge (of your storage)",
    "9": "Tight squeeze"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "leaked image from the Microsoft Store": "https://twitter.com/oskool_g/status/1424527363841445890?s=20",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "Forza Motorsport 7": "https://www.techradar.com/news/forza-motorsport-7-review-fifth-gear-style-first-gear-substance",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "Halo: The Master Chief Collection": "https://www.techradar.com/news/halo-the-master-chief-collection-is-getting-a-serious-xbox-series-x-upgrade",
    "Flight Simulator": "https://www.techradar.com/reviews/microsoft-flight-simulator",
    "Sackboy: A Big Adventure": "https://www.techradar.com/reviews/sackboy-a-big-adventure-review",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Destruction AllStars": "https://www.techradar.com/news/destruction-allstars-is-worth-a-spin-but-lacks-longevity",
    "Marvel’s Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "Gran Turismo": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "console’s compression technology": "https://www.techradar.com/news/more-ps5-games-are-benefitting-from-sonys-ssd-compression-tech-and-its-impressive",
    "Control: Ultimate Edition": "https://www.techradar.com/reviews/control-review",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "364GB of usable storage": "https://www.techradar.com/news/xbox-series-x-storage-everything-you-need-to-know",
    "Seagate 1TB Storage Expansion Card": "https://www.techradar.com/reviews/seagate-xbox-storage-expansion-card-review",
    "external hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "best SSD for PS5": "https://www.techradar.com/best/best-ssd-for-ps5",
    "technical preview": "https://www.techradar.com/news/halo-infinite-campaign-spoilers-leak-from-technical-preview"
  }
}