{
  "source": "https://www.techradar.com/news/ps5-restock-gamestop-will-have-ps5-bundles-in-stock-today-but-theres-a-catch",
  "title": "PS5 restock: Walmart is a bust, GameStop was a boom – when to get the PS5 next",
  "category": "gaming",
  "updated": "2021-08-30T09:11:20Z",
  "author": "matt-swider",
  "summary": "Our PS5 restock Twitter tracker helped people jump through the hoops of buying a PS5 at GameStop today. Here's how.",
  "article": [
    "Update: The Walmart PS5 restock today was so short-lived, we didn't see it in stock for more than a second. The opposite was true of this GameStop PS5 restock this morning, where many of our followers got the alert and were able to check out.",
    "How? Our 24/7 PS5 restock Twitter tracker Matt Swider will send you a Twitter alert when the console is in stock in the US – if you follow his account and turn on notifications. He will also coach you through the entire process through a PS5 restock live stream. The big catch for today, July 1? You needed to be a GameStop Power Reward Pro member to buy the PS5 at first, and refresh the page a lot.",
    "Trust and credibility: Matt Swider has helped over 55,000 people buy a next-gen console in recent weeks from stores in the US when PS5 restock opportunities last just a few minutes. How? With his tireless 24/7 tracking, in-stock Twitter alerts and exclusive restock reporting.",
    "Click on this example of a prior GameStop PS5 restock to follow Matt Swider and turn on notifications (the little bell icon).",
    "The GameStop PS5 restock makes up for the fact that there was no Target PS5 restock this week, including this morning, July 1.",
    "This may be the easiest PS5 restock yet if GameStop has enough inventory (it's been 13 days since its last PS5 restock, so that's a decent amount of time for the store to gain PS5 console stock). The reason? It become easier and easier to buy a PS5 and GameStop offers bundles.",
    "Not everyone cares for PS5 bundles – it does drive up the price (though everything remains at face value) and some games aren't for everyone – and this means that there will be fewer consumers vying for the GameStop PS5 restock today.",
    "There's an error in the official GameStop PS5 restock email from GameStop, which cites the time at 10am CST. It likely really means 10am CDT (we're in daylight savings time, after all), and that converts to 11am EDT.",
    "So in a few minutes, we should see GameStop add-to-cart buttons go live and the PS5 bundles begin to populate the retailer's website. At first you'll get messages that claim the inventory is unavailable but keep trying.",
    "We'll be on hand to dispense tips on Twitter and our PS5 restock YouTube channel.",
    "GameStop makes it rather difficult to buy the PS5, with many pitfalls. Based on our expertise involving PS5 restock retailers, here's what you need to know in order to have a better shot at getting the Sony console today.",
    "We'll keep this PS5 restock news updated as the console becomes available at GameStop today."
  ],
  "headers": {
    "4": "PS5 restock news: GameStop is ready to restock today",
    "7": "What time is the GameStop PS5 restock?",
    "10": "GameStop restock guide: how to get the console"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "PS5 restock live stream": "https://www.youtube.com/watch?v=6_2svMc3gos",
    "PS5 restock YouTube": "https://www.youtube.com/channel/UCuNMpLS1Jaoglit9w4mtvow"
  }
}