{
  "source": "https://www.techradar.com/news/hostinger-unlocks-cross-border-payments-with-credorax",
  "title": "Hostinger unlocks cross-border payments with Credorax",
  "category": "computing",
  "updated": "2021-10-07T14:53:03Z",
  "author": "abigail-opiah",
  "summary": "120 currencies added to web hosting roster",
  "article": [
    "Hostinger has teamed up with payment service provider Credorax to unlock the web hosting firm's ability to accept and process cross-border payments from more than 120 currencies around the world.",
    "The Lithuanian-based company has joined Credorax's roster of web hosting services and digital SaaS partners, including SEMRush and NordVPN.",
    "Hostinger will have access to Credorax’s acquiring solution including onboarding, approval rate optimisation and analysis, FX conversion optimisation, and proactive 24/7 merchant account monitoring.",
    "Hostinger will use Credorax’s 3DSecure solution to comply with the PSD2 requirements for Strong Consumer Authentication.",
    "“We’re excited to partner with web hosting provider, Hostinger, and expand our footprint in Lithuania, a region that continues to grow as a hub for fintech,” said Igal Rotem, CEO of Credorax.",
    "“Using our services, Hostinger will be able to accept and process payments in widely and thinly traded currencies alike - including those from the Asia and Africa regions – allowing them to cater to their entire customer base, confident they can accept the local currencies.",
    "\"As we build our own presence in the region, we look forward to helping Hostinger grow and provide their services globally.”",
    "Credorax’s services will help Hostinger to accept and process cross-border payments in over 120 currencies, including Indian rupee and South African rand, which is essential to an e-commerce business.",
    "“Credorax’s capabilities in streamlining the payments process made it the clear choice for us when looking for an acquiring partner,” added Daugirdas Jankus, CMO of Hostinger.",
    "“We strive to provide our customers with as easy and frictionless an experience as possible when setting up their online presence.",
    "\"It was important that we find a payment provider that enables us to accept payments seamlessly and in local currencies, to eliminate any barriers to our services. We look forward to working with Credorax, a partner we can count on to support us as we grow and evolve our payment solutions.”"
  ],
  "headers": {
    "3": "Global currencies accepted"
  },
  "links": {
    "payment service": "https://www.techradar.com/best/best-payment-gateways",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "SaaS": "https://www.techradar.com/news/what-is-saas"
  }
}