{
  "source": "https://www.techradar.com/news/walmart-ps5-halo-finite-xbox-series-x-restock-today",
  "title": "Walmart PS5, Halo Xbox Series X console restock tonight right now – get it fast",
  "category": "gaming",
  "updated": "2021-09-24T01:29:20Z",
  "author": "matt-swider",
  "summary": "Update: new Walmart restock time for PS5 and Halo Xbox Series X. Here's when to buy the consoles.",
  "article": [
    "Walmart PS5 and Halo Xbox restock time update: If you're wondering about the Walmart restock time, follow our PS5 and Xbox restock tracker Matt Swider, as he'll send you an alert as soon as the consoles are in stock in the US – if you follow his Twitter account and turn on notifications. The Walmart PS5, Xbox Series X and Halo Infinite-themed Xbox Series X will restock today, but it got delayed from this afternoon to tonight at 9pm EDT / 6pm PDT, according to Walmart official who have contacted TechRadar. It's very different from the in-store Best Buy PS5 and Xbox restock this morning, which was in person at select local stores throughout the US. Walmart will also do something different: sell the hard-to-buy Halo Infinite-themed Xbox Series X that's limited edition, not often for sale.",
    "Here's how to get the PS5 and Xbox Series X restock alerts:",
    "What to do before tonight: Click on this screenshot of this example of a Walmart PS5 restock alert from Matt Swider and turn on notifications (that little bell icon) for instant alerts. This is what you'll see when there's the PS5 is in stock.",
    "Walmart sent out a notice to TechRadar and other media outlets that it was going to have a PS5 and Xbox Series X restock, including the Halo Infinite Xbox Series X. The date was supposed to be today, September 23.",
    "However, the restock time has been delayed, with Walmart only issuing a brief statement on its website. \"Console event will be rescheduled,\" according to Walmart.com. We've reached out to Walmart for further clarification.",
    "This isn't new. Walmart is known for delays of console, both when you go to order it from their website and notoriously when you are waiting for that PS5 delivery.",
    "it's nearly impossible to buy the Halo Infinite Xbox Series X console, as it's a themed special edition and when it sells out, Microsoft won't be making any more. Walmart did put some consoles on sale, but apparently it has more inventory.",
    "The PS5 has proven to be much more popular than the Xbox Series X judging from the demand, especially at Best Buy this morning. When Best Buy ran out of paper tickets for the 53 PS5 consoles it had at one New York City store, they were only up to customer No. 3 when for Xbox Series X buyers.",
    "However, the Halo Infinite Xbox Series X has some additional cache to it, and while it's priced at $549, it comes with the game, making it MSRP for both items. That has sent demand soaring, as Master Chief fans know Walmart will run out and not restock.",
    "Update: While the times have changed, our Walmart guide remains the same. Here's what to do to get the PS5 and Xbox Series X in your cart.",
    "Walmart is the most popular retailer in the US, so consoles sell out quickly when the PS5 is in stock. This is one case in which the mobile app is the hero and the website is the sidekick. We'll explain how and why you should use both during a PS5 drop at Walmart."
  ],
  "headers": {
    "3": "Walmart PS5 and Xbox restock time today",
    "6": "Walmart to have Halo Infinite Xbox Series X restock",
    "9": "Our Walmart PS5 buying guide remains unchanged"
  },
  "links": {
    "PS5 and Xbox restock tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Best Buy PS5 and Xbox restock": "https://www.techradar.com/news/exclusive-ps5-xbox-restock-best-buy-in-store-september-23"
  }
}