{
  "source": "https://www.techradar.com/news/alienware-m15-and-m17-gaming-laptops-get-even-more-powerful-at-ces-2021-with-nvidias-rtx-3000-series-gpus",
  "title": "Alienware m15 and m17 gaming laptops get even more powerful at CES 2021 with Nvidia’s RTX 3000 series GPUs",
  "category": "computing",
  "updated": "2021-01-13T14:25:37Z",
  "author": "darren-allan",
  "summary": "Premium notebooks get a memory and storage boost as well",
  "article": [
    "Alienware has refreshed its m15 and m17 premium gaming laptops over at virtual CES 2021, powering them up with Nvidia’s new RTX 30 series graphics cards – as well as introducing a new Aurora gaming PC.",
    "It’s not yet clear exactly which options will be available when it comes to Nvidia’s new mobile GPUs in the new Alienware m15 and m17 R4 models, but there are RTX 3060, 3070 and 3080 laptop cards which have just been introduced by Nvidia at CES. Alienware previously offered up to the RTX 2080 Super in the R3 versions of these machines, so the RTX 3080 should be available with the R4 variants, we would think.",
    "Alienware further notes that performance is boosted by the use of faster system RAM (up to 2933MHz), but otherwise the core components stay the same as with the R3 incarnations. Storage has been upped to 4TB maximum, though, and new cooling tricks – using vapor chamber tech in every model – promise to deliver better thermal performance.",
    "One other change with the Alienware m17 R4 is on the display front, where there’s now a choice of an even faster 160Hz Full HD panel (compared to 300Hz before, although let’s face it, that’s hardly shabby in itself).",
    "The new Alienware gaming machines will be out on January 28, with prices for both R4 models starting at $2,150.",
    "Alienware also revealed a new Aurora Ryzen Edition R10 PC, which can be configured with up to a Ryzen 9 5950X (16-core) processor with either AMD’s RX 6800 XT graphics card, or an Nvidia RTX 30 series model. Memory fiends can also specify a system loadout of 128GB of dual-channel HyperX Fury DDR4 RAM, should they wish.",
    "The Aurora Ryzen R10 also benefits from a nifty cooling solution (with optimized airflow and vapor chamber tech, again), and a tool-less chassis.",
    "This gaming PC is on sale now with the price starting at $1,080 in the US, although it quickly gets very expensive towards the top-end models as you might imagine."
  ],
  "headers": {
    "5": "Remember Aurora"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "just been introduced by Nvidia at CES": "https://www.techradar.com/news/nvidia-rtx-3000-graphics-cards-are-finally-coming-to-laptops",
    "R3 versions": "https://www.techradar.com/reviews/alienware-m15-r3-2020",
    "machines": "https://www.techradar.com/reviews/alienware-m17-r3-2020"
  }
}