{
  "source": "https://www.techradar.com/news/watchos-74-update-brings-new-health-fitness-and-security-features",
  "title": "watchOS 7.4 update brings new health, fitness and security features",
  "category": "wearables",
  "updated": "2021-04-27T08:58:28Z",
  "author": "james-rogerson",
  "summary": "Including Face ID-free iPhone unlocking",
  "article": [
    "Alongside iOS 14.5, watchOS 7.4 has also landed, and while it’s not quite as big an update as the iPhone-focused one, it still brings some useful new features and improvements to Apple Watch.",
    "The biggest of these is also one of the big iOS 14.5 features, as it requires both an Apple Watch and an iPhone. We’re talking of course about the ability to bypass Face ID to unlock your iPhone while wearing a mask.",
    "This is enabled by the Apple Watch, as if it’s nearby, unlocked and on your wrist then it will be able to unlock your phone – assuming both are running the latest software. When it does so you’ll feel a vibration on your watch to alert you, as well as getting an alert on the Apple Watch’s screen.",
    "Fitness fans meanwhile will now be able to stream audio and video content from Apple Fitness Plus to an AirPlay 2-enabled TV or other device.",
    "The other major changes are region-specific, with the ECG app finally being activated for Apple Watch 4 and above users in Australia and Vietnam. Those countries also now have access to irregular heart rhythm notifications.",
    "Beyond all that there are also bug fixes in watchOS 7.4, so even if you don’t care about any of these features it’s probably worth grabbing soon. To do that, head to the Apple Watch app on your iPhone, then within that go to General > Software Update. Just make sure your Apple Watch has at least a 50% charge, is placed on the charger, and is close to your iPhone."
  ],
  "headers": {
    "3": "ECGs for Australia"
  },
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "the ability to bypass Face ID": "https://www.techradar.com/news/ios-145-update-adds-mask-less-iphone-unlock-ps5-xbox-series-x-controller-support-and-more",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review"
  }
}