{
  "source": "https://www.techradar.com/news/why-sonys-ps5-internal-storage-solution-has-me-concerned",
  "title": "Why Sony's PS5 internal storage solution has me concerned",
  "category": "gaming",
  "updated": "2021-03-08T09:20:00Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Sounds like a noisy compromise",
  "article": [
    "Are you running out of space on your PS5 internal storage? Actually, let me rephrase that: would you like to increase your PS5’s internal storage space? Of course you would.",
    "With only 667.2GB of usable space, the PlayStation 5’s internal drive is rather restrictive for those who like to have more than a handful of games installed. And if you’re a fan of Call of Duty games, you can certainly kiss goodbye to those precious gigabytes.",
    "However, unlike Xbox Series X and the Xbox Series S, which both support the Seagate 1TB Storage Expansion Card that Microsoft made available at launch, Sony still doesn’t give users the option to add more PS5 storage. Microsoft lets users store Xbox Series X and S optimized games on external hard drives, too, although you’ll need to move them to the internal drive or Storage Expansion Card if you wish to play them.",
    "You can attach an external hard drive to your PS5 and store your PS4 games on it, but when it comes to finding a home for all your shiny-new PlayStation 5 games, you're at the mercy of the internal drive only.",
    "That’s about to change, however. Sony is reportedly about to unlock the internal NVMe SSD bay found behind the console’s front faceplate. This is great news for those who want to significantly upgrade the PS5’s storage capacity: simply pop off the faceplate (carefully), slot in a NVMe SSD and screw it into place.",
    "At least, it should be that simple. We don’t yet know which drives the PS5 will support; Sony has said it will make clear which NVMe SSDs are compatible in the future. And while some users may be comfortable wielding a screwdriver, it isn’t exactly consumer-friendly, especially next to the plug and play nature of the Xbox Series X 1 TB Storage Expansion Card.",
    "But this isn’t my main concern; having built a gaming PC from scratch, I’m certainly not scared of a couple of screws. No, it’s the concerning revelation that the upcoming firmware that unlocks the PS5’s ability to run the additional internal drive will also enable higher cooling-fan speeds.",
    "This might not be a surprise to those who are already up to speed on NVMe SSDs. Unlike regular hard drives, they can often become extremely hot. It’s the reason so many models come with their own heatsink, which can be placed over the top to help keep performance optimal.",
    "The PS5, it appears, might struggle to accommodate a drive that comes with an accompanying heatsink, and since the SSD found inside the console is extremely fast, you can bet the drive you’ll need to buy will become quite toasty when in use.",
    "The SSD bay does include a metal lid that could effectively act as a heatsink, but Sony's compatibility list will obviously determine which drives will work with the PS5.",
    "One of the best features of the PS5, in my opinion at least, is how much quieter it is than the PS4 and PS4 Pro, which were both rightly compared to sounding like an aircraft leaving the runway whilst playing certain titles. The knowledge that the PS5’s fans may kick up a stink once you've installed additional storage is, in all honesty, extremely annoying.",
    "I don’t wish to be punished twice by Sony’s decision to supply such a meager amount of storage space: the first being the high price I’ll inevitably have to pay for a top-end SSDs; and then to be potentially subjected to a far louder console than I’ve become accustomed to.",
    "It’s even more frustrating when Microsoft’s storage solution is seemingly so obvious and well executed in comparison. It’s essentially a memory card, something that Sony itself made synonymous with the PlayStation brand, which slots into the back of the console. It delivers identical performance to the Xbox Velocity Architecture used when playing games that have been optimized for the Xbox Series X and S.",
    "The large metal surface area of the Seagate 1TB Storage Expansion Card allows the spreading and routing out of heat from the device. This heat is dissipated away from the chip inside, and pushed out by the Xbox Series X or S’s fans.",
    "Installing a PS5 NVMe drive will be a bit of gamble, then – at least for now. We don’t know to what degree the PS5 fans will ramp up to deal with the additional heat generated by the extra storage. It could be minimal, of course, but they’ll certainly do something, judging by Sony’s need to unlock faster speeds.",
    "Is this an oversight on Sony’s part, then? Maybe, but I’m not prepared to pay the price of a louder console for more storage space, at least not yet."
  ],
  "headers": {
    "4": "More memory for all",
    "6": "Not a fan",
    "10": "Here we go again...",
    "14": "Super hot"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Seagate 1TB Storage Expansion Card": "https://www.techradar.com/news/the-xbox-series-x-1tb-storage-expansion-card-costs-dollar220-heres-how-to-pre-order",
    "Xbox Series X and S optimized games": "https://www.techradar.com/news/best-xbox-series-x-optimized-games",
    "external hard drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "PlayStation 5 games": "https://www.techradar.com/best/best-ps5-games",
    "faceplate": "https://www.techradar.com/news/black-ps5-finally-becomes-a-reality-as-faceplates-go-on-sale-but-not-from-sony",
    "upcoming firmware that unlocks the PS5’s ability to run the additional internal drive": "https://www.techradar.com/news/ps5-internal-storage-upgrade-will-be-unlocked-mid-2021-according-to-report",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "PS4 Pro": "https://www.techradar.com/news/gaming/consoles/ps4-pro-deals-1328247",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "memory card": "https://www.techradar.com/best/nintendo-switch-micro-sd-cards-the-best-memory-cards-for-storing-your-games",
    "Xbox Velocity Architecture": "https://www.techradar.com/news/velocity-architecture-is-the-soul-of-xbox-series-x-heres-what-it-does",
    "PS5 NVMe drive": "https://www.techradar.com/news/ps5-storage-could-be-worryingly-expensive-if-this-2tb-nvme-ssd-is-anything-to-go-by"
  }
}