{
  "source": "https://www.techradar.com/news/intel-hints-at-imminent-rocket-lake-s-launch-with-discontinuation-of-older-300-series-chipsets",
  "title": "Intel hints at imminent Rocket Lake-S launch with discontinuation of older 300-series chipsets",
  "category": "computing",
  "updated": "2021-01-05T18:37:12Z",
  "author": "carly-page",
  "summary": "Intel's 300-series motherboards have reached end of life",
  "article": [
    "Intel has revealed that it is discontinuing its 300-series chipset motherboards, just days before it’s expected to announce its 500-series designs.",
    "In its announcement, spotted by Videocardz, Intel has confirmed that production of the 300 series motherboards, which includes the H310, H370, Z370 and Z390, is officially coming to a halt. Production will end in July, at which point orders will become non-cancelable and non-returnable.",
    "Sales of the 300-series motherboards, which also includes Intel's mobile chipsets such as the QM370, will end for good in January 2020.",
    "The move to put the 300-series motherboards out to pasture is hardly surprising. Not only has the chipset has since been replaced by the 400-series, which includes the Z490, W480, H470, B460, and Q470, but Intel also recently announced the doscontuination of its 9th-gen Coffee Lake Refresh range, which is based on the LGA1151 socket.",
    "The decision also just comes days ahead of CES 2021, where Intel is expected to confirm the launch of its 500-series motherboards.",
    "The 500-series motherboards will feature the Z590, B560, and H510 chipsets, according to rumors, and it's expected that these will be Intel's first desktop motherboards to support PCIe 4.0, and the last to support DDR4 memory.",
    "The series is also rumored to feature an LGA1200 socket compatible with the 10th Gen Core Comet Lake-S series and the upcoming 11th Gen Core Rocket Lake-S.",
    "Intel’s CES 2021 announcement is expected to take place on January 11."
  ],
  "headers": {},
  "links": {
    "Videocardz": "https://videocardz.com/newz/intel-discontinues-its-300-series-motherboard-chipsets-z390-z370-h370",
    "Intel also recently announced the doscontuination of its 9th-gen Coffee Lake Refresh range": "https://www.techradar.com/news/intel-core-i9-9900k-has-been-discontinued-along-with-other-9th-gen-cpus",
    "Intel is expected to confirm the launch of its 500-series motherboards": "https://www.techradar.com/news/intels-next-gen-rocket-lake-cpus-could-be-here-sooner-than-you-think"
  }
}