{
  "source": "https://www.techradar.com/news/choosing-to-challenge-what-steps-can-we-take-for-women",
  "title": "Choosing to challenge: What steps can we take for women?",
  "category": "computing",
  "updated": "2021-04-02T10:20:08Z",
  "author": "pip-white",
  "summary": "Businesses must examine how to improve gender diversity",
  "article": [
    "Each year March represents Women's History Month, while the 8th March represents International Women’s Day. Both of these moments in time are dedicated both to celebrating women and pushing for greater gender equality. For 2021 the day’s theme was #ChooseToChallenge, which called for everyone to choose to challenge and call out gender bias and inequality, and choose to seek out and celebrate women's achievements.",
    "Clearly it’s important that we don’t only shed a light on diversity and inclusion around this time of year. But it does give everyone a chance to check in with themselves, their workplace and their wider industry, to shine a brighter light on issues that need to be reviewed and addressed all year round. That includes men as well as women.",
    "Fighting for gender parity in the workplace is not a new phenomenon. Businesses have been working on it for decades. Yet while the world has taken huge strides around diversity, equity, and inclusion, the tech industry is still lagging behind, with women making up just 20% of the workforce. So, what steps can we take for women in tech?",
    "The tech industry at large needs to focus on building workforces that better represent our world, while ensuring that company cultures make employees feel like they belong, all year round. Hiring and retaining talented professionals from underrepresented groups needs to be a key focus, as does the industry’s work to understand the identities, intersectionalities, and experiences of employees worldwide. Still today you might hear someone refer to a potential candidate as a great “cultural fit” - but actually we need to shift the focus to employing those who are a “culture add”.",
    "One key area in which businesses can reduce gender-related bias is through job descriptions. However unintentionally, gender biased wording in job descriptions can discourage diverse candidates from applying. But this is something that can be easily addressed. At Google, new guidance for job descriptions saw an 11% increase in applications from women. Businesses also need to build pathways for underrepresented talent to join the tech industry, if they’re not already doing so. And that’s not just in computer science, but also in non-technical roles. Educational pathways that will bridge skill gaps and fill new tech roles need to be made accessible to everyone.",
    "Building pathways for underrepresented talent to join the tech industry means businesses need to be ready for when they do. The responsibility to prioritize inclusion involves everyone and needs to be driven by C-suite professionals themselves. Diversity, equity, and inclusion training should be embedded throughout a businesses core learning and development opportunities. In particular, businesses should invest in this training for all managers because they have a direct impact on employee experiences. Managers need to be given the tools to make meaningful human connections across lines of difference and build a workplace where people have a sense of belonging.",
    "Last year Google launched #ItsUpToMe in over 30 offices worldwide, a campaign to energize employees to take an ally ship role in their communities by understanding the experiences of others, modeling inclusive behaviors, and sharing their personal commitment to improving diversity, equity, and inclusion in the region. Google also brought together women from Black communities across EMEA for a summit to share their experiences, address the group’s unique opportunities and challenges, and support personal and professional enrichment.",
    "A key area that requires concrete actions is leadership representation for underrepresented groups. Leaders make decisions that affect the products we build, the people we serve, and the employees and culture of companies. Diverse leadership teams make better decisions, and in turn build a more helpful company for everyone.",
    "To support women in leadership positions, businesses should offer targeted career development programs, which provide coaching, community-building, mentorship, and advocacy to help women foster relationships with senior leaders and advance their careers. And what’s most important is that programs like these - and conversations about these initiatives - need to happen throughout the year, not just around awareness days.",
    "More broadly, leadership teams need to look at investments they can make to strengthen the diverse communities both within and outside of the industry. For example, Google recently launched a Google for Startups Black Founders Fund to support Black-led tech startups. The fund supports the $175 million global investment towards economic opportunity for black business owners announced by Google’s CEO, Sundar Pichai.",
    "While there has been progress in the last few years, we’re still a way off where we need to be as an industry. Even incremental progress in hiring, progression, and retention is hard-won. Only a holistic approach to these issues will produce meaningful, sustainable change. Businesses must continue their work to expand the talent pool externally, and improve their cultures internally, if we want to create equitable outcomes and an inclusive industry for everyone."
  ],
  "headers": {
    "3": "Growing a more representative workforce",
    "5": "Supporting diversity, equity and inclusion within",
    "7": "Honing in on leadership"
  },
  "links": {
    "employees": "https://www.techradar.com/best/best-employee-scheduling-software",
    "training": "https://www.techradar.com/best/online-class-sites-do-these-online-courses-from-the-comfort-of-home",
    "employee experiences": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}