{
  "source": "https://www.techradar.com/news/audio/apple-music-vs-spotify-vs-play-music-vs-tidal-vs-deezer-1296240",
  "title": "Apple Music vs Spotify: the music streaming titans go head-to-head",
  "category": "audio-visual",
  "updated": "2021-08-24T11:56:45Z",
  "author": "dom-reseigh-lincoln",
  "summary": "The two biggest names in music streaming duke it out",
  "article": [
    "The music world has always been about rivalries. There's Taylor Swift vs. Kanye, Tupac vs. Biggie, Eminem vs... everyone? Now, the rise of music streaming services over the last decade means you can add a new rivalry to the mix: Spotify vs Apple Music.",
    "While there are any number of streaming services for you to choose from out there, the only two contenders you should care about are the Swedish-born Spotify, with its freemium music model and Apple Music, the replacement to iTunes that has exclusive albums and a monstrous 75 million song library.",
    "Although up-to-date user numbers aren't often revealed, Spotify certainly appears to have an advantage with a larger user base – it has around 354 million users globally last time we checked. That's in spite of mounting competition from the likes of Apple Music, as well as Jay-Z-owned Tidal.",
    "One big advantage Spotify has over many of its rivals is it doesn't ask for any money upfront, and you can go for years without ever paying a dime. Sure, Apple may offer a free trial but, at some point, you're going to need to pony up.",
    "But Apple Music has become an even more serious contender in 2021 thanks to the introduction of Spatial Audio and Lossless. These are two new formats that will radically change how your favorite songs sound. Spotify will soon be launching Spotify HiFi to compete, but it's not landed yet.",
    "So which service should you invest your entertainment budget in? To help you choose the right one for you, we’ve broken down the pros and cons of each service so you can sign up and start listening.",
    "How big is its music library?",
    "Apple music has a huge library of tracks that's at about 75 million last time we checked, across a broad range of genres. So if you’re into French skiffle or Brazilian electro pop and you’re struggling to find your more obscure artists, there’s a great chance Apple Music will have you covered.",
    "Plus, this being an Apple product, its interface is easy to navigate both on a Mac/PC and in more portable forms such as smartphone or tablet and you can download tracks to take them with you when you’re away from a Wi-Fi connection. It’s a feature Apple Music shares with Spotify, but it’s a vital one if you want to keep users signing up to the paid version.",
    "How much does it cost?",
    "Unlike Spotify, which offers both free and paid versions, Apple Music only offers a free trial version before it requires you to sign up.",
    "It’s understandable from a business POV - especially with so many exclusives serving as a golden carrot for potential users - but not having any form of long-term free-to-use version has ultimately worked against Apple’s desire to increase its overall user base.",
    "Free trials are limiting, especially to those looking to experience the service on a long term basis. Giving users limited access to the full experience of its service might seem like a better deal in the short term, but it suffers in the long-term compared to the free/ad-filled version Spotify offers.",
    "Still, having three different payment plans does show Apple wants its users who are willing to cough up a more dynamic approach. Having a cheaper plan aimed at students ($4.99 / £4.99 / AU$5.99) is a great deal (but not an exclusive one as Spotify offers something similar), especially as this rate still gives you access to every facet of its service. For everyone else its $9.99 / £9.99 / AU$11.99 for an individual, or $14.99 / £14.99 / AU$17.99 for a family subscription for up to six people",
    "What exclusive benefits does Apple Music offer?",
    "Admittedly, Apple has gone to great means to cut Spotify and the smaller music streaming services out of the picture by signing some of the biggest names in popular music to exclusivity deals on new albums.",
    "Apple Music has boasted exclusive album releases from Drake, Taylor Swift, Britney Spears, Frank Ocean, Future and more and it’s a strategy that’s really rankled Spotify over the years. Of course, if you’re not a fan of the artists that initially release exclusively on Apple Music, then this feature might not be a game-changer, but if you do then it’s a serious trump card.",
    "A recent new addition to Apple Music is Spatial Audio with support for Dolby Atmos and Lossless Audio. This brings an enhanced listening experience to all users, Spatial Audio makes tracks sound more immersive – like you're hearing it live. And Lossless Audio essentially means music sounds better – you're listening to tracks at CD quality rather than compressed streaming quality.",
    "Apple Music also offers Apple Music 1 (formerly known as Beats 1), the vanguard for a wider push towards original broadcasting on the service. It’s a 24/7 radio station that offers round the clock playlists and live DJs. It’s an internet radio station backed by Apple, so it’s as slick as you might imagine with the likes of former Radio 1 DJ Zane Lowe and more on its roster. With Apple already planning more stations for the service, this original broadcasting angle is a facet Spotify simply has no answer for.",
    "There’s also an exclusive social feature called Connect that’s packed is as part of the Apple Music package. It’s essentially a way for artists to link up with fans in a more intimate fashion, offering access to new singles, videos and messages.",
    "Connect might seem something designed for the bigger bands, but it’s open to any artist, offering a service not too dissimilar to what MySpace was back in its heyday. For followers, it’s simply a simple yet effective way to get a little closer to the bands you love.",
    "Finally, there’s the exclusive video content. With its integration with iTunes, the ability to browse and play tons of music videos adds a dimension Spotify simply doesn’t offer. And Apple Music is doubling down on the visual side with original programs such as Carpool Karaoke: The Series (a longer version of James Corden’s uber-popular celeb singing skit on The Late, Late Show) and Planet of the Apps (a Dragon’s Den-esque show for app and software developers).",
    "What’s it like to use?",
    "While both the desktop and portable versions are great to look at (aesthetics, after all, is Apple’s thing to a tee), there’s a disparity in the user experience between the two: Apple Music's Mac, PC or laptop version is much superior to the one you'll find on your phone or tablet. That's because the continued use of larger images and boxes suits a larger screen, and it’s really easy to navigate through your playlists, exclusives and your imported iTunes library.",
    "That said, the setup does suit using larger tablets, as having more screen real estate makes the larger icons and more content-heavy focus a far more agreeable experience.",
    "The version optimized for smartphones isn’t broken by any means, but its large icon design often makes it a little fiddly to use since it doesn’t use the smaller screen of a phone to its advantage. Also, launching to your library simply doesn’t make any sense for a service that’s geared towards new music updates.",
    "How big is its music library?",
    "Spotify currently boasts more than 70 million songs and 2.2 million podcasts.",
    "Spotify’s strong influx of tracks over the years has helped jettison it into the stratosphere, with a heavy focus on promoting new tracks and breakthrough artists. Curated playlists are almost always the first thing you see when you load any version of the app, with the service seemingly designing playlists for almost every musical subgenre. These are constantly being updated too, so your favorite ones never grate following extended use.",
    "Discover Weekly, the playlist based off your listening preferences, has come leaps and bounds in the last few years with the nuances of its suggestions, although Apple’s For You playlist (introduced in 2016) now largely offers the same feature so it’s no longer the special boon it was once.",
    "How much does it cost?",
    "So now we get to one of the main reasons why Spotify has always held Apple Music at bay - paid and unpaid access. While it's trialed a few different versions over the years, Spotify has always come back to the basic formula that’s worked best - everyone can sign up and access every track in its catalog for free.",
    "There are ads every few songs, but you can tailor 15 playlists that feature the songs you want. You also get access to top curated playlists like Discover Weekly. In the past you did not have full control over playback, and were only able to skip a limited number of times per hour.",
    "It’s a business model that might seem crazy on paper, but it’s the ideal way to increase your user base by making the whole experience awkward just enough to get those users coughing up for Premium paid accounts.",
    "Rather than locking content behind a paywall, Spotify wisely seals away features that simply make the service more dynamic. Want to listen to music without any adverts? Want to download as many tracks as you want to your smartphone to listen to them when away from home? Want the ability to skip songs as and when you want on your tablet/smartphone? Then it’s time for Premium.",
    "If you want everything that Spotify has to offer, including to choose any song you want with unlimited skipping privileges and no ads, you can get a personal Spotify Premium plan for $9.99 / £9.99 / AU$11.99, while the Spotify Family Plan, which offers simultaneous listening for up to five users, is priced at $15.99 / £16.99 / AU$17.99 after a recent price hike.",
    "Like Apple Music, Spotify also offers discounted plans for students, with total access to the Spotify library priced at only $4.99 / £5.99 / $5.99. Although, you will have to verify your enrollment status.",
    "There's also a brand-new subscription tier for friends, partners, or family members who live at the same address. Spotify Premium Duo allows two people to share one Spotify subscription plan, while still retaining their own individual Premium accounts and logins, allowing you to save on the cost without sacrificing the freedom of listening without ads and creating your own playlists.",
    "Costing $12.99 / £13.99 / AU$15.99 per month, it's considerably cheaper than buying two separate Premium subscriptions, which cost $9.99 / £9.99 / AU$11.99 per month each. If you share the cost with your listening buddy, you're looking at less than $7 /£7 / AU$8 per month to get ad-free Spotify and on-demand listening to tracks in any order you want.",
    "What exclusive features does Spotify offer?",
    "Here’s the thing, right now, you really don’t get much that really sells the exclusivity of using Spotify.",
    "However, the streaming giant has a heavy focus on promoting new tracks and breakthrough artists, through curated playlists like New Music Friday acting as a launch pad for fledgling artists to break through into the big time.",
    "Curated playlists are almost always the first thing you see when you load any version of the app, with the service seemingly designing playlists for almost every musical sub-genre. These are constantly being updated too, so your favorite ones never grate following extended use.",
    "Spotify also has a great podcasts offering, which is well worth tapping into. There are even rumors that Spotify could be on the verge of launching a podcast subscription service.",
    "Low-data mode is another extra. It caches some audio for when you lose signal, and uses less of your data allowance. 75 per cent less according to Spotify. Of course, if you have a Premium sub you can just download songs over Wi-Fi anyway.",
    "What’s it like to use?",
    "Spotify has had its fair few updates over the years, but it’s hard to deny how well the current UI works. Unlike Apple Music, it’s a service that’s clearly been redesigned and tweaked with smaller screens in mind thanks to the raft of options available on screen at any one time. Whether you’re downloading an album or playlist to your phone or starting a radio channel based on an artist, it’s a consistently intuitive experience.",
    "The tile system is just small enough to make selecting new albums and playlists easy while packing in plenty of content into a timeline of content that’s ultimately curated to what you’ve been listening to and what you might want to jump into next. Spotify might just have as many playlists as it does albums, but it’s a strategy that works as its algorithms ultimately tailor the app to each user.",
    "Being able to work with multiple platforms is another huge asset. Being able to work on almost any type of smartphone and tablet increases the scope for its audience and the UIs for all these platforms are uniformly strong. Being able to play Spotify from your console - such as the version running on PS4 - is a massive tick for the service, as is the ease with which you set it up. Overall, Spotify is currently winning the UI war.",
    "Overall, both services come with their pros and cons and each one will suit a user looking for different things from a music streaming platform: Spotify offers a more well-rounded experience that’s effectively open to everyone, its recommendations are fantastic and it's already got a huge number of users. However, its mobile experience is limited unless you’re willing to go Premium and it needs to release its HiFi offering soon to stay ahead of the competition.",
    "Apple’s three-month free trial does give you a taste of its service, recent Spatial Audio with Dolby Atmos and Lossless format upgrades are good news for audiophiles and it's bound to appeal to those who have already heavily bought into the ecosystem. However, its fiddly mobile design remains at odds with its impressive library and exclusive content.",
    "As it stands, Spotify just about remains the stronger service overall, but Apple Music might not always remain in second place now it offers the same big library and an upgrade in music format quality – that's not even taking into account increased pressure from the likes of Tidal."
  ],
  "headers": {
    "6": "Apple Music",
    "26": "Spotify",
    "49": "Verdict"
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Spatial Audio and Lossless": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "Spotify Premium Duo": "https://www.techradar.com/news/spotify-trialling-subscription-plan-for-two-called-premium-duo/news/how-to-get-spotify-for-less-by-sharing-with-a-friend",
    "Spotify could be on the verge of launching a podcast subscription service": "https://www.techradar.com/news/spotify-could-be-considering-a-subscription-package-for-podcasts",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review"
  }
}