{
  "source": "https://www.techradar.com/news/this-playstation-patent-could-take-ps5-game-help-to-the-next-level",
  "title": "This PlayStation patent could take PS5 Game Help to the next level",
  "category": "gaming",
  "updated": "2021-05-04T11:54:49Z",
  "author": "vic-hood",
  "summary": "Experts could help you in real-time",
  "article": [
    "Sony has filed a patent for a method of gaming assistance that would see designated experts being on call to help players who are stuck in challenging game sequences.",
    "The patent (originally spotted by VGC), details how players would be able to register as experts for specific games, based on their gaming history and abilities. These experts would then be able mark themselves as \"available\", meaning that players who are stuck would be able to contact them and get help in real-time.",
    "According to the patent, less experienced players would be able to contact these experts either through an app on the console or via the PlayStation app. The app would then connect the player who needs helps with the expert via a live help session or a prior recording of a session. During a live session, the expert would be able to offer guidance through text, voice, video, and/or embedded video.",
    "The patent likens the method to Uber, explaining that when players request help, the request will be sent to all experts for that game (marked as available), before the player is then matched with their expert.",
    "According to the patent, the system would see data on the player's current session analyzed, such as the quest, level, loadout, location and skills, and then the system would pair the player with an expert who had beaten that part of the game with a similar configuration.",
    "Players would also be able to toggle a spoiler alert option, which would notify the expert not to reveal any spoilers for upcoming game sequences.",
    "The PS5 currently has a Game Help feature that lets players access helpful videos for specific game sequences they may be stuck on via activity cards. Unfortunately, not all PS5 games support this feature at present, though we have seen it used for the likes of Demon's Souls and Sackboy: A Big Adventure.",
    "If this Sony patent comes to light, it would see players being able to access more customized help – though whether you would need to pay for this service isn't clear from the patent. Experts could also benefit from exclusive in-game content for helping out.",
    "It's worth noting that not all patents become a reality, but we hope we will see some version of this feature implemented for the PS5 in the future."
  ],
  "headers": {
    "6": "Levelling up Game Help"
  },
  "links": {
    "patent": "https://patents.justia.com/patent/10874947",
    "VGC": "https://www.videogameschronicle.com/news/playstations-uber-style-help-patent-reveals-potential-plan-to-mark-expert-players/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Demon's Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Sackboy: A Big Adventure": "https://www.techradar.com/reviews/sackboy-a-big-adventure-review"
  }
}