{
  "source": "https://www.techradar.com/news/how-to-watch-american-horror-story-season-10-online-from-anywhere",
  "title": "How to watch American Horror Story season 10 online from anywhere",
  "category": "computing",
  "updated": "2021-09-07T08:28:16Z",
  "author": "daniel-pateman",
  "summary": "Two terrifying tales make up this demented Double Feature",
  "article": [
    "Ryan Murphy’s freak show is finally back on TV. And boy, what a cabinet of curiosities awaits. Subtitled Double Feature and combining two terrifying tales, it promises bug-eyed aliens, razor-fanged sea creatures, and twice the number of frights. Below we’ll explain how to watch American Horror Story season 10 online from anywhere today.",
    "Described as “a collision of terror like you’ve never seen,” we know that season 10 is comprised of two parts. ‘Red Tide’ is the first, made up of six episodes set by the sea in Provincetown, Massachusetts, that follow struggling author Harry (Finn Wittrock), his pregnant wife Doris (Lily Rabe), and their daughter Alma as they encounter dark forces in the isolated beach town.",
    "Thrillingly little is known about ‘Part Two: Death Valley’. But, based on that title and the show’s marketing, viewers can probably expect the final instalment to take place in the Nevada desert, and involve some kind of Area 51 cover up, or another even more bonkers alien conspiracy.",
    "Series stalwarts Sarah Paulson, Evan Peters, and Lily Rabe return in their ninth outing for the show, alongside Adina Porter, Scream Queen’s Billie Lourd and Angelica Ross.",
    "Macaulay Culkin, contortionist Spencer Novich, and Desperate Housewives villain Neal McDonaugh, meanwhile, make their AHS debuts.",
    "We can’t wait to see what this deliriously entertaining anthology series has up its bloody sleeve. Just read on as we break down how to watch American Horror Story season 10 online from anywhere now.",
    "If you’re abroad when American Horror Story season 10 airs, you’ll be unable to watch the show on your usual streaming platform, thanks to annoying regional restrictions.",
    "Luckily, there’s an easy solution. Downloading a VPN will allow you to stream the new season online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch American Horror Story season 10 from anywhere"
  ],
  "headers": {
    "6": "How to watch American Horror Story online from outside your country",
    "9": "How to watch American Horror Story season 10 online in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}