{
  "source": "https://www.techradar.com/news/the-best-star-wars-game-is-now-even-better-on-ps5-and-xbox-series-x",
  "title": "The best Star Wars game is now even better on PS5 and Xbox Series X",
  "category": "gaming",
  "updated": "2021-01-15T12:28:07Z",
  "author": "adam-vjestica",
  "summary": "A new hope",
  "article": [
    "Star Wars Jedi: Fallen Order, arguably the best Star Wars game to come out of Disney’s and EA’s partnership, has received a new update that improves performance on PS5, Xbox Series X and Xbox Series S.",
    "The update for the game is now live and EA has outlined the full list of changes in a blog post – and there’s a couple of points to note.",
    "The game’s framerate has been bumped up from around 45fps to 60fps on Xbox Series X, Xbox Series S and PS5, and the dynamic resolution ranges have been increased, meaning you’ll experience higher resolutions when playing on Xbox Series X and PS5.",
    "Post-processing resolution has also been improved, but only on PS5 and Xbox Series X, not on Xbox Series S.",
    "Now, here’s where things get interesting. Star Wars Jedi: Fallen Order on Xbox Series X has two modes to choose from: Performance and Normal, while the PS5 does not. Normal mode on Xbox Series X sees the game’s post-processing increased to 4K, and the dynamic resolution window ranges from 1512p to 2160p. While in performance mode, you’re getting 60fps with a dynamic resolution range of 1080p to 1440p.",
    "On PS5, meanwhile, the game doesn’t give you the option to choose between modes. Instead, players are locked into the Performance mode. The game runs at a framerate of 60fps, and post-processing is increased to 1440p. Dynamic resolution is disabled entirely, and the game runs at a fixed 1200p resolution instead (up from the previous 810-1080p).",
    "It’s a curious difference between the two systems, then, and there’s pros and cons to either approach. Being able to choose between two modes on Xbox Series X is beneficial to players who might want the best visual experience possible at the expense of performance.",
    "However, while the dynamic resolution range on Xbox Series X in Performance mode can surpass 1200p on PS5, it can also drop as low as 1080p. It’s also unclear what resolution post-processing is running at on the Xbox Series X version when using Performance mode.",
    "But what is dynamic resolution? Well, it's a common technique used by developers that allows a game to change resolution on the fly to help boost performance during more taxing scenes. It's usually hard to notice, but if the resolution hangs around the low end of the range, you may end up with a blurrier, softer image.",
    "Either way, players who are discovering Star Wars Jedi: Fallen Order for the first time or wish to revisit the game on the next-gen consoles will get a better experience. The game is currently on sale on the PlayStation Store for $23.99 (£21.59 / AU$35.98) and is free to Xbox Game Pass Ultimate subscribers as part of EA Play."
  ],
  "headers": {
    "4": "Jedi duel",
    "8": "Resolution wars"
  },
  "links": {
    "Star Wars Jedi: Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "blog post": "https://www.ea.com/games/starwars/jedi-fallen-order/amp/news/next-gen-optimization-update?isLocalized=true",
    "$23.99": "https://store.playstation.com/en-us/product/UP0006-CUSA12539_00-SWJFOSTANDARD000",
    "£21.59": "https://store.playstation.com/en-gb/product/EP0006-CUSA12529_00-RESPAWNSWBIRDDOG",
    "AU$35.98": "https://store.playstation.com/en-au/product/EP0006-CUSA12529_00-RESPAWNSWBIRDDOG",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}