{
  "source": "https://www.techradar.com/news/google-chat-update-will-help-you-get-rid-of-incriminating-evidence",
  "title": "Google Chat update will help you get rid of incriminating evidence",
  "category": "computing",
  "updated": "2021-11-17T19:30:54Z",
  "author": "anthony-spadafora",
  "summary": "Spaces and the content they contain can now be deleted in Google Workspace",
  "article": [
    "Google has announced that paid Google Workspace users will soon be able to delete Spaces group chats completely from Google Chat.",
    "According to a new blog post, the search giant is bringing the ability to delete named Spaces in Google Chat to Google Workspace Business Standard and Business Starter editions first though it plans to extend this capability to other versions of its online collaboration tool next year.",
    "Once this new feature rolls out, creators of a Space will be able to fully delete it along with all of the room tasks, files and attachments not saved elsewhere from Google Chat. Once a Space has been deleted, all of its members will no longer be able to access the space, its files or the member list.",
    "In addition to eliminating clutter and making it easier to navigate to frequently used Spaces, the ability to delete a group chat in Google Chat can also be useful for employees concerned that management may be going through their old messages.",
    "In its blog post, Google points out that this feature is not available for Google Workspace editions that come equipped with the company's information governance and eDiscovery tool Google Vault. If a business upgrades from the Business Standard or Business Starter edition of Workspace to one that supports Google Vault, they will lose the ability to delete named Spaces.",
    "While this feature will initially be available to Google Workspace Business Standard, G Suite Basic and Business Starter customers, Google plans to make it available to all editions of its online collaboration tool next year.",
    "Work with others online more easily with the best online collaboration tools and get more done with the best productivity tools"
  ],
  "headers": {
    "3": "Deleting Spaces in Google Chat"
  },
  "links": {
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Google Chat": "https://www.techradar.com/reviews/google-chat",
    "blog post": "https://workspaceupdates.googleblog.com/2021/11/spaces-in-google-chat-can-now-be-deleted.html",
    "online collaboration tool": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Google Vault": "https://www.techradar.com/news/google-vault-to-support-website-builders-transition-from-google-sites",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "best productivity tools": "https://www.techradar.com/best/best-productivity-apps"
  }
}