{
  "source": "https://www.techradar.com/news/these-are-the-biggest-security-flaws-of-2021-so-far",
  "title": "These are the biggest security flaws of 2021 so far",
  "category": "computing",
  "updated": "2021-07-29T03:00:50Z",
  "author": "anthony-spadafora",
  "summary": "Patch these vulnerabilities now if you haven't done so yet",
  "article": [
    "In an effort to raise awareness among both private companies and government agencies, cybersecurity agencies from the US, the UK and Australia have published a new joint advisory which contains information on the most exploited security flaws from last year and so far this year.",
    "As reported by The Record, the US Cybersecurity and Infrastructure Security Agency (CISA) and the FBI along with the UK National Cyber Security Centre (NCSC) and the Australian Cyber Security Centre (ACSC) all published joint advisories on the top vulnerabilities exploited by cybercriminals.",
    "These vulnerabilities exist in a wide variety of products from VPN appliances, email servers, network access gateways, web-based applications, desktop software and more.",
    "According to the cybersecurity agencies' joint advisory, these were the most exploited security flaws in 2020 by vendor and type along with their CVE tracking numbers:",
    "The joint advisory also contains a second list of vulnerabilities that cybercriminals have been actively exploiting in their attacks so far this year. However, this list is divided by vendor:",
    "By releasing these two lists of the top security flaws last year and so far this year, the cybersecurity agencies from the US, the UK and Australia hope to encourage businesses as well as government agencies to take a second look at their products and services so that they can patch any vulnerabilities they have yet to fix.",
    "Director of operations at the UK's NCSC, Paul Chichester provided further insight on the joint advisory published by the three countries' cybersecurity agencies in a press release, saying:",
    "“We are committed to working with allies to raise awareness of global cyber weaknesses – and present easily actionable solutions to mitigate them. The advisory published today puts the power in every organisation’s hands to fix the most common vulnerabilities, such as unpatched VPN gateway devices. Working with our international partners, we will continue to raise awareness of the threats posed by those that seek to cause harm.\"",
    "Via The Record"
  ],
  "headers": {
    "4": "Top vulnerabilities in 2021 so far"
  },
  "links": {
    "joint advisory": "https://us-cert.cisa.gov/ncas/alerts/aa21-209a",
    "reported": "https://therecord.media/us-uk-australia-issue-joint-advisory-on-todays-top-exploited-vulnerabilities/",
    "CISA": "https://www.techradar.com/news/us-government-issues-guidance-on-enterprise-vpn-use?region-switch=1598918400",
    "NCSC": "https://www.techradar.com/news/ncsc-stop-delaying-updates-and-get-rid-of-flash-now",
    "ACSC": "https://www.techradar.com/news/australian-government-and-opposition-hacked-in-major-cyberattack",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "patch any vulnerabilities": "https://www.techradar.com/news/these-are-the-most-worrying-vulnerabilities-around-today",
    "press release": "https://www.ncsc.gov.uk/news/global-cyber-vulnerabilities-advice",
    "The Record": "https://therecord.media/us-uk-australia-issue-joint-advisory-on-todays-top-exploited-vulnerabilities/"
  }
}