{
  "source": "https://www.techradar.com/news/modular-dji-action-2-tries-too-hard-to-differ-from-gopro-hero-10-black",
  "title": "Modular DJI Action 2 tries too hard to reinvent the GoPro Hero 10 Black",
  "category": "cameras",
  "updated": "2021-10-27T13:05:00Z",
  "author": "mark-wilson",
  "summary": "Action cam is a real charmer, but has limitations",
  "article": [
    "The DJI Action 2 is a dramatic overhaul of the drone giant's previous action camera, the DJI Osmo Action – and while its modular design is clever and versatile, the downsides mean it's a little too niche to worry the GoPro Hero 10 Black. (Want to jump to our in-depth verdict? Check out our full DJI Action 2 review).",
    "The DJI Action 2 crosses the cube-like design of the now-discontinued GoPro Hero Session and the modular approach of the Insta360 One R. Measuring 39x39mm and weighing just 56g, the Action 2's main unit is incredibly dinky – but you'll need to add an extra module, and possibly some accessories, to unlock its full talents.",
    "You get two main choices of base module. There's either the Power Combo (a $399 / £349 / AU$609 bundle that brings better battery life), or the vlogging-friendly Dual-Screen Combo, which is pretty pricey at $519 / £455 / AU $799. Either way, the DJI Action 2 has a 1/1.7-inch CMOS sensor, which is larger than the GoPro Hero 10 Black's 1/2.3-inch sensor chip – though DJI's action cam is limited to 4K resolution, rather than 5.3K.",
    "One other unusual feature for an action cam is that the DJI Action 2 has 32GB of built-in storage. To boost that, though, you'll need to connect it one of the aforementioned modules, which take microSD cards up to 256GB.",
    "So how does the DJI Action 2 actually perform? Our review found it to be a slightly mixed bag. The main drawback compared to rivals is battery life, with overheating limiting the lengths of clips you can record. In our tests, the Action 2 (without any modules attached) stopped recording 4K/60p video after just 5m 45s, with the 1080p mode only pushing it up to 7m 24s. DJI quotes its total battery life as 70 minutes (without any modules) or 180 minutes with the Power Module, but these are in a lab environment recording 1080p video with electronic stabilization disabled.",
    "When it comes to image quality and stabilization, the Action 2 does certainly compete with the GoPro Hero 10 Black. This is impressive for such a small camera, although there are some drawbacks. GoPro's flagship offers better stabilization in low light, and DJI's Horizon Steady – its equivalent of GoPro's automatic horizon-leveling – doesn't work in 4K resolutions, topping out at 2.7K.",
    "Still, that Horizon Steady mode does trump GoPro's by correcting virtually 180-degree tilts, compared to the 45-degree leveling on the Hero 10 Black. And the Action 2's overall image quality delivers more realistic hues than its rivals, with video editors potentially preferring its more neutral footage.",
    "Our DJI Action 2 review also praised its modular design, stating that \"one thing we absolutely love about the Action 2 is how easy it is to clamp it on and off its mounts\". These work using a combination of magnets and clamps, and we added that \"there’s no screwing a fiddly screw that can go missing, and no need to struggle with traditional GoPro mounts\".",
    "In terms of pricing, the DJI Action 2 is available in either a Power Combo ($399 / £349 / AU $609, available end of November) or a pricier Dual-Screen Combo ($519 / £455 / AU $799, available now). You can also grab a range of accessories, including a magnetic Adapter Mount ($25 / £19 / AU $29), Remote-Control Extension Rod ($75 / £50 AU £89), waterproof case ($65 / £45 / AU $79), and the Magnetic Ball-Joint Adapter Mount ($39 / £25 / AU $49).",
    "You can also pick up the Front Touchscreen Module separately for $169 / £155 / AU$249, or add an additional Power Module for $75 / £50 / AU $89. The Action 2 also supports a Macro Lens that magnetically clips onto the Action 2, which you can pick up for $79 / $50 / AU $89.",
    "The DJI Action 2 has left us feeling a little torn. Like Insta360, DJI has innovated hard to deliver a very different action cam experience to the GoPro Hero 10 Black – and while we're fans of the design, it does come with some practical limitations.",
    "On the plus side, the magnetic mounting experience is less fiddly than GoPro mounts, and the Action 2's main unit is considerably smaller than any of its current rivals (as you can see above). For gadget fans, it's a delight.",
    "But it's also important to be aware of the Action 2's limitations. For example, the length of the clips you can shoot is generally limited to five minutes, due to overheating. Also, while the main unit is waterproof to 10m, neither the Power Module nor the Front Touchscreen Module are water-resistant without a case.",
    "The Action 2 also offers no external audio options and, with its Touchscreen Module, is considerably pricier than the Hero 10 Black. This means that vloggers should definitely plump for the GoPro, as should anyone who needs an action camera that can shoot continuously for up to an hour in 4K.",
    "This means we can't help but feel that the DJI Action 2 has tried a little too hard to be different from its GoPro rival – but if you want a modular, modern-day incarnation of the smaller GoPro Session, then it could well still be worth considering."
  ],
  "headers": {
    "10": "Analysis: Charming, if a little too left-field"
  },
  "links": {
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "GoPro Hero 10 Black": "https://www.techradar.com/reviews/gopro-hero-10-black",
    "DJI Action 2 review": "https://www.techradar.com/reviews/dji-action-2",
    "GoPro Hero Session": "https://www.techradar.com/reviews/gopro-hero5-session-review",
    "Insta360 One R": "https://www.techradar.com/reviews/insta360-one-r"
  }
}