{
  "source": "https://www.techradar.com/news/microsoft-is-already-messing-up-windows-11-and-im-worried",
  "title": "Microsoft is already messing up Windows 11, and I'm worried",
  "category": "computing",
  "updated": "2021-07-22T10:38:13Z",
  "author": "matt-hanson",
  "summary": "Taking away choice",
  "article": [
    "An early version of Windows 11 is being used by people around the world – including me – and while there are things to like about the new OS, there’s a few red flags as well that has me concerned.",
    "Recently, it was discovered that people can’t drag and drop files onto app icons on the taskbar, which you could in previous versions of Windows. This was a handy way of quickly opening up certain files in your favorite apps.",
    "When users found this was no longer the case (when you drag a file to the taskbar now, an icon appears showing you can’t ‘drop’ it), they assumed it was a bug in the early version of Windows 11, and one that Microsoft would fix once it was made aware of it.",
    "However, as Windows Latest reports, this isn’t a bug at all, and is in fact a deliberate design choice by Microsoft, which said in its Feedback Hub (where people post bugs) that “Currently, dragging a file onto an app in the taskbar to open it in that app is not supported in Windows 11, but we appreciate all your feedback, and we’ll continue to use it to help guide the future of features like this.”",
    "While that mention of ‘currently’ gives hope that the feature could be reinstated later on as Windows 11 gets nearer to launch, the response to Microsoft’s answer has been brutal.",
    "As many users point out, it is baffling that Windows 11 is deliberately dropping such a useful feature, and for no obvious reason.",
    "This follows a concerning pattern with the Windows 11 taskbar, which has seen other features from Windows 10 being dropped.",
    "For a start, you can no longer drag and drop app icons onto the taskbar either. This was a handy way of quickly adding shortcuts to the taskbar, so you could more easily access them. You can still ‘pin’ apps to the taskbar, but you have to right-click the icon and choose ‘Pin to taskbar’. This isn’t as convenient as simply dragging and dropping the app.",
    "Unlike in Windows 10 and older versions of Windows, you can move the taskbar either. It’s locked to the bottom of the screen.",
    "What makes me worried is that this points to Microsoft limiting how users can configure Windows 11, when in fact a new operating system should be offering more opportunities. It’s a reminder that Windows 11 belongs to Microsoft, not to you.",
    "This is evidenced in the new News Feed/widget board, which appears as a menu when you swipe from the left of your screen (or press Windows + W on your keyboard). While you can configure some settings, such as what ‘widgets’ are shown, if you click on a news headline, for example, it will always open in Microsoft’s Edge web browser, even if you have another browser, such as Chrome, set as your default.",
    "It’s a heavy-handed way of forcing you to use Edge against your wishes, and if this is the direction Windows 11 is going to take, then I’m not too keen.",
    "We’ve been trying out Windows 11 for the past couple of weeks, and while it seems a fine operating system, there are some things that concern us – such as the fact that it’s not that exciting.",
    "Even though it’s relatively early days, my time with the new operating system tells me Microsoft has a fight on its hands to get people to upgrade.",
    "First, the good news. Despite a lot of confusion over what PCs will be able to run Windows 11, installing the Windows Insider version on a HP Elite Dragonfly G2 was incredibly easy.",
    "Since then, it’s been pretty solid. I’ve only had to restart the machine once due to the trackpad not working, but apart from the odd glitch that sorts itself out, for an early version of an operating system for testing, I’ve been pleasantly surprised by how stable it is.",
    "So, while I have no regrets about updating to Windows 11 so far, am I pleased that I upgraded? Not really. This is because, at the moment at least, Windows 11 feels pretty much the same as Windows 10, bar a few graphical changes.",
    "And, as I mentioned above, some of the changes that have been made, has got me worried.",
    "Now, again I should stress that this based on my time with an early version of Windows 11, and when it does officially release, there could be more revolutionary differences, but right now, Windows 11 feels like Windows 10 where the taskbar is more limited. And that’s about it.",
    "It looks nice, sure, but that’s not going to be enough to get people to upgrade. Some more exciting features, such as DirectStorage, which could make games load faster, seemed like a good start, but it’s now emerged that it’s coming to Windows 10 as well.",
    "So, Microsoft needs to do more to convince people to upgrade to Windows 11, and taking away features, or being more aggressive in forcing people to use Edge, isn’t going to do that.",
    "Will Windows 11 be one of those unloved Windows releases like ME, Vista and Windows 8? Microsoft will certainly hope not, and there’s still time to change course and really wow us with the new operating system. But, time is running out."
  ],
  "headers": {
    "4": "Taken to taskbar",
    "12": "Analysis: Windows 11 needs to up its game"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "as Windows Latest reports": "https://www.windowslatest.com/2021/07/22/windows-11-kills-drop-drop-feature-for-taskbar-and-users-are-not-happy/",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "confusion over what PCs will be able to run Windows 11": "https://www.techradar.com/news/tpm-20-windows-11-pc-health-check-and-the-potential-messy-upgrade",
    "HP Elite Dragonfly G2": "https://www.techradar.com/reviews/hp-elite-dragonfly-g2",
    "now emerged that it’s coming to Windows 10 as well": "https://www.techradar.com/news/dont-worry-microsoft-directstorage-wont-be-exclusive-to-windows-11"
  }
}