{
  "source": "https://www.techradar.com/news/these-lg-tone-free-true-wireless-earbuds-go-big-on-private-calls-and-easy-pairing",
  "title": "These LG Tone Free true wireless earbuds go big on private calls and easy pairing",
  "category": "audio-visual",
  "updated": "2021-07-26T10:54:00Z",
  "author": "becca-caddy",
  "summary": "New buds welcome a 'whisper mode' and feature that lets you pair with any device",
  "article": [
    "LG has announced the latest update to its LG Tone Free earbud lineup: the FP9 and FP8 true wireless earbuds. Both models offer noise cancellation thanks to three microphones in each earbud, good sound quality and a few handy new features.",
    "Headphone Spatial Processing comes courtesy of Meridian Audio, which brings a surround sound-like experience to your ears. You’ll find this tech in other LG earbuds, but with larger drivers and 3D Sound Stage in the FP9 and FP8, both audio quality and immersion should be notably improved. (This is a welcome upgrade considering we didn't rate the LG Tone Free HBS-FN6 for sound quality.)",
    "Both the FP9 and FP8 have a ‘whisper mode’, which turns the right earbud into a mic so you can whisper into it when you’re in a public space to give you a bit more privacy without compromising on call quality.",
    "The Tone Free FP9 boasts a new Plug & Wireless feature, which allows you to pair almost any device with the earbuds, even if there’s no Bluetooth on-board.",
    "The feature works thanks to a USB-C to AUX cable that connects whatever device you want to listen from – whether that’s a phone, games console, PC, etc – to the FP9’s accompanying charging case. The case then becomes a wireless dongle making up for any device that lacks Bluetooth connectivity – a helpful feature on flights.",
    "There are naturally a lot of true wireless earbuds on the market these days, from the Apple AirPods to the Cambridge Melomania 1, so the question for you is whether LG offers something different – or at least a promising selection of features at a reasonable price.",
    "The earbuds are both IPX4 rated, so they’re fine for sweaty workouts and light rain showers, and LG promises a more comfortable fit for active lifestyles. This suggests they’re designed for all-day wear, but could be a good choice if you're looking for a new pair of fitness headphones, too.",
    "The FP9 and FP8 come with one of LG’s new UVnano cases, which cleans the buds as they charge up with UV light. A cleaning case might not seem like a top priority, but a lot of bacteria we’d rather not think about can collect on your earbuds – especially if you use them 24/7 and take them to the gym.",
    "You’ll get 24 hours of battery life from both models with the charging case, and a quick charging feature means five minutes in the case equates to around an extra hour of listening.",
    "We’ll update this article with prices as soon as they’re confirmed, but if LG can undercut more premium models, while improving on the performance of past Tone Free earbuds, these new iterations may well be worth checking out.",
    "The LG Tone Free FP9 and FP8 earbuds will be available from July 2021 in black, white and gold."
  ],
  "headers": {
    "5": "Analysis: True wireless earbuds for the everyday listener?"
  },
  "links": {
    "noise cancellation": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "LG Tone Free HBS-FN6": "https://www.techradar.com/reviews/lg-tone-free-hbs-fn6",
    "games console": "https://www.techradar.com/news/best-consoles",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Cambridge Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1",
    "fitness headphones": "https://www.techradar.com/best/the-best-workout-headphones-for-every-sport"
  }
}