{
  "source": "https://www.techradar.com/news/airpods-max-deals-drop-to-new-record-low-price",
  "title": "AirPods Max deals drop to new record low price",
  "category": "audio-visual",
  "updated": "2021-06-28T14:50:48Z",
  "author": "tabitha-baker",
  "summary": "AirPods Max have never been cheaper",
  "article": [
    "We were seeing plenty of excellent AirPods deals earlier in the week, many of which have since disappeared. However, the luxurious AirPods Max are actually offering an even better price this weekend.",
    "You'll find the premium cups available for $489 at Amazon (was $549). That's an additional $10 off the previous record low price (a price that proved popular over Prime Day), which makes these AirPods deals the cheapest they've ever been. Right now you'll find this discount on the Space Gray, Green, and Sky Blue models (though the pink model is only $1 more).",
    "Originally launching at a hefty $549, we've only started to see real movement in this price since May, initially dropping down to $529 and then taking the leap to $499 over the last week. You're getting a fresh price cut here, then, and an overall saving of $60 that many wouldn't have seen coming so soon after launch considering Apple's reluctance to discount its more luxurious products.",
    "Not in the US? Scroll down for more cheap AirPods deals in your region.",
    "The AirPods Max are at a great price right now - but we're still talking close to $500. You'll find much cheaper AirPods deals on the classic 2019 model and the AirPods Pros right now, with all the latest prices from around the web just below.",
    "You'll also find plenty more noise cancelling headphone deals up for grabs right now, including some excellent Sony WH-1000XM4 sales. We're also rounding up all the latest AirPods Pro prices as well and see more offers at the upcoming 4th of July sales event."
  ],
  "headers": {
    "4": "More AirPods deals"
  },
  "links": {
    "for $489 at Amazon (was $549)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNew-Apple-AirPods-Max-Space%2Fdp%2FB08PZHYWJS%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1151098880598943100-20",
    "cheap AirPods deals": "https://www.techradar.com/news/cheapest-airpods-prices",
    "noise cancelling headphone deals": "https://www.techradar.com/deals/cheap-noise-canceling-headphone-deals",
    "Sony WH-1000XM4 sales": "https://www.techradar.com/deals/best-sony-wh-1000xm4-sales-deals-and-prices",
    "AirPods Pro prices": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "4th of July sales": "https://www.techradar.com/deals/the-best-4th-of-july-sales-and-deals"
  }
}