{
  "source": "https://www.techradar.com/news/apple-refuses-to-allow-parler-back-onto-the-app-store",
  "title": "Apple refuses to allow Parler back onto the App Store",
  "category": "computing",
  "updated": "2021-03-11T14:52:26Z",
  "author": "joel-khalili",
  "summary": "Apple has deemed Parler’s new content moderation policies insufficient",
  "article": [
    "Apple recently rebuffed an attempt by social network Parler to return to the App Store after a review of the company’s new content moderation policies, documents show.",
    "The right-leaning social media platform was removed from the App Store in January, in the aftermath of the assault on the US Capitol. At the time, Parler was told it would not be allowed to return until it established moderation policies that prevent threats of violence circulating on the platform.",
    "Although Parler amended its community guidelines in mid-February, Apple does not believe the changes provide adequate protection against the dissemination of hateful content.",
    "“After having reviewed the new information, we do not believe these changes are sufficient to comply with App Store Review guidelines,” wrote Apple, in a letter to Parler. “There is no place for hateful, racist, discriminatory content on the App Store.”",
    "In support of its findings, Apple cited various instances in which users had posted misogynistic, homophobic and racist content. The company also provided screenshots that highlighted the use of white nationalistic imagery in user profiles.",
    "“Simple searches reveal highly objectionable content, including easily identified offensive uses of derogatory terms regarding race, religion and sexual orientation, as well as Nazi symbols. For these reasons, your app cannot be returned to the App Store for distribution,” Apple told Parler.",
    "Marketed as the “free speech” social network, Parler is renowned for its laissez-faire attitude to content moderation and has long resisted any form of user surveillance.",
    "These attributes meant Parler was the odds-on favorite to become the platform of choice for ex-US President Donald Trump after he was banned from Twitter and Facebook, and even topped the App Store download charts for a period.",
    "After the storming of the Capitol Building, however, a raft of partners came out against the social network. Both Apple and Google, which control the two largest mobile application stores in the world, removed Parler from their marketplaces over violent content that remained live on the platform.",
    "The nail in the coffin was delivered by Amazon Web Services, which withdrew its hosting services and effectively removed Parler from the public internet. It took the social network over a month to secure another content distribution partner in the form of domain registrar Epik, known for its conservative sympathies.",
    "Despite its return to action, the future remains uncertain for the platform, which has been hamstrung by its removal from major application marketplaces.",
    "The decision to block Parler’s return to the App Store will add yet more fuel to debates over the ethics and legality of the Parler boycott and the need for new regulation targeting the world’s largest tech and social media companies.",
    "Update: Amy Peikoff, Chief People Office at Parler, has since provided TechRadar Pro with the following statement:",
    "\"Parler’s mission is to provide a welcoming, nonpartisan social media platform which allows users to exercise their freedoms of speech, thought, and association, while also respecting their privacy.\"",
    "\"Over the past two months, we’ve worked towards the goal of returning to Apple’s App Store, in reliance on Tim Cook’s statements that Apple's problem was not with our mission, but only with the perceived lack of enforcement of our guidelines. Parler has always opposed and worked to remove violent and inciting rhetoric from our platform, because it inhibits productive, civil discourse. Accordingly, and even though we knew that problems with violent and inciting content were not unique to Parler in the weeks leading up to Jan 6—a fact that independent reviews of court records have now shown—we worked tirelessly to adopt enhanced protocols for identifying and removing this type of content.\"",
    "“We have since engaged Apple to show them how we’ve incorporated a combination of algorithmic filters and human review to detect and remove content that threatens or incites violence. We’ve also explained our new feature which empowers individual users with the option to filter out personal attacks based on immutable and irrelevant characteristics such as race, sex, sexual orientation, or religion. It’s just the latest way in which Parler enables users to curate their own feeds as they choose.\"",
    "“Parler expects and hopes to keep working with Apple to return to the App Store. We’re optimistic that Apple will continue to differentiate itself from other ‘Big Tech’ companies by supporting its customers’ choice to ‘think different’—to exercise their constitutionally protected freedoms of thought, speech, and association—while using Apple products.”",
    "Via Bloomberg"
  ],
  "headers": {
    "6": "Parler controversy"
  },
  "links": {
    "hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-03-10/parler-cuts-ios-team-after-apple-blocks-return-to-app-store"
  }
}