{
  "source": "https://www.techradar.com/news/get-norton-antivirus-vpn-and-identity-theft-protection-for-only-dollar7999",
  "title": "Get Norton antivirus, VPN and identity theft protection for only $79.99",
  "category": "computing",
  "updated": "2021-09-03T17:13:51Z",
  "author": "desire-athow",
  "summary": "Save $70 on a Norton annual membership",
  "article": [
    "Get online protection and save money with this offer from NortonLifeLock until September 7th, 2021. Norton is offering up to $70 in savings on its annual membership for the first year. Plans start at just $9.99 a year with seven different options so you can choose the level of protection that's right for you. NortonLifeLock is one of the most recognizable names in digital security, offering identity theft and online privacy protection. The Norton 360 with Lifelock Select membership provides real-time protection against ransomware, viruses, spyware, malware, and other online threats for one PC or Mac device.",
    "It also also includes a whopping 100GB of cloud backup storage so you can store and protect important files and documents. All memberships come with the Norton Virus Protection Promise which means experts will be available to help keep your devices virus-free or your money back.",
    "Five devices can also use the Secure VPN feature and you get NortonLifelock's very own identity alert system which is a powerful identity theft protection solution. This is not only an excellent discount but also a fantastic price for a year's worth of online protection. Keep in mind, this offer is only valid for your first year, and after that, your subscription will be billed at the applicable monthly or annual renewal price."
  ],
  "headers": {},
  "links": {
    "up to $70 in savings on its annual membership for the first year": "http://www.tkqlhce.com/click-6361382-13815103?sid=trd-us-2377189324903516000",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}