{
  "source": "https://www.techradar.com/news/stolen-covid-vaccine-data-may-have-been-manipulated-before-being-leaked-online",
  "title": "Stolen COVID vaccine data may have been manipulated before being leaked online",
  "category": "computing",
  "updated": "2021-01-19T14:21:14Z",
  "author": "barclay-ballard",
  "summary": "Hackers are trying to undermine trust in the vaccine",
  "article": [
    "New evidence has come to light indicating that the COVID-19 vaccination data that was stolen from the European Medicine Agency (EMA) last month had been altered before being leaked online. It is thought that the hackers manipulated the information to damage public trust in the vaccination process.",
    "“The ongoing investigation of the cyberattack on EMA revealed that some of the unlawfully accessed documents related to COVID-19 medicines and vaccines have been leaked on the internet,” an update posted by the EMA explained. “This included internal/confidential email correspondence dating from November, relating to evaluation processes for COVID-19 vaccines. Some of the correspondence has been manipulated by the perpetrators prior to publication in a way which could undermine trust in vaccines.”",
    "Although the EMA has not disclosed much information regarding the hack, it has been revealed that some documents relating to the regulatory submission for the Pfrizer/BioNTech vaccine were unlawfully acquired. It is not clear, who the perpetrators of the hack were.",
    "At least it now appears clear what the motives were behind the EMA hack. Despite the urgency that many countries face in the rush to vaccinate their populations against COVID-19, regulators are being careful to not cut corners during the vaccine approval process.",
    "Nevertheless, the vaccines have been developed at a remarkable speed, something that is being upheld as a great scientific achievement. Despite regulatory insistence that the vaccines are safe, many individuals remain skeptical about having the vaccine, which could damage the likelihood of countries achieving herd immunity.",
    "Hacks and data leaks can prove immensely damaging to the COVID-19 vaccination process, and the EMA is not the only organization to be targeted by cyberattackers. Late last year, Microsoft urged governments around the world to provide greater technological and legal safeguards for firms in the vaccine supply chain.",
    "Via ZDNet"
  ],
  "headers": {
    "3": "Injecting misinformation"
  },
  "links": {
    "explained": "https://www.ema.europa.eu/en/news/cyberattack-ema-update-5",
    "Microsoft": "https://www.techradar.com/news/microsoft-flags-major-cyberattacks-on-covid-vaccine-makers",
    "ZDNet": "https://www.zdnet.com/article/hackers-manipulated-stolen-vaccine-data-before-leaking-it-online/"
  }
}