{
  "source": "https://www.techradar.com/news/windows-10-is-getting-a-dedicated-panel-for-power-users",
  "title": "Windows 10 is getting a dedicated panel for power users",
  "category": "computing",
  "updated": "2021-04-13T11:34:21Z",
  "author": "joel-khalili",
  "summary": "Windows 10 update will rebrand and upgrade the Administrative Tools panel",
  "article": [
    "Microsoft is working on an upcoming Windows 10 update that will bring tens of advanced tools under one roof for easy access.",
    "Available to members of the company’s early-access program, Windows 10 preview build 21354 retires the current Administrative Tools menu in favor of a new Windows Tools panel, with an expanded scope.",
    "The new menu houses circa 40 application shortcuts previously located in the Start Menu. These applications include PowerShell, Command Prompt, Registry Editor, Disk Cleanup and other utilities that only advanced users are likely to fully utilize.",
    "It’s unclear precisely when the change will take effect for all Windows 10 users but, providing there are no hiccups in testing, the Windows Tools menu will presumably roll out in the coming months.",
    "The Administrative Tools menu has long been a feature of Windows 10, providing users with a hub for applications that can be used to perform system maintenance and administration.",
    "Its successor, the Windows Tools panel, extends this premise with the introduction of tens of additional tools to the roster. This collection will be situated within Control Panel and, as before, can be accessed via the “control admintools” command line prompt.",
    "According to a Microsoft blog post, the change will also serve to declutter the Windows 10 Start Menu, expanding upon work started with preview build 21343.",
    "“The Windows Accessories, Windows Administrative Tools, Windows PowerShell, and Windows System folders have now been removed from Start and the apps within these folders can now be accessed via the Windows Tools entry point that directs to the full apps list in File Explorer,” the company explained.",
    "“All these apps will still appear via search, launch via any method, can be pinned to Start or taskbar, and any customized shortcuts in the folder paths will remain intact. Also, File Explorer has been moved into its own place in the Start menu as part of this work.”",
    "Although the average user may go their whole Windows 10 career without touching many of the tools housed within the new menu, power users and IT professionals will welcome a comprehensive and centralized hub for administration.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Windows 10 update"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "blog post": "https://blogs.windows.com/windows-insider/2021/04/07/announcing-windows-10-insider-preview-build-21354/",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/microsoft/windows-10-is-getting-a-windows-tools-control-panel-for-power-users/"
  }
}