{
  "source": "https://www.techradar.com/news/oneplus-watch-update-isnt-enough-to-save-the-maligned-smartwatch",
  "title": "OnePlus Watch update isn't enough to save the maligned smartwatch",
  "category": "wearables",
  "updated": "2021-05-06T12:30:30Z",
  "author": "tom-bedford",
  "summary": "...but it's a start",
  "article": [
    "Consumer tech is rarely that divisive, but the OnePlus Watch was a big exception - while some sites gave the smartwatch glowing reviews (including us), others criticized it for various shortcomings. The reception has been mixed, to say the least.",
    "Perhaps that reception can start trending towards 'positive', though, because OnePlus has released its first update for the smartwatch, which brings two key features missing from the initial product.",
    "Firstly, you can now activate an always-on display with the OnePlus Watch - this means, when you're not using the thing, it'll always show you the time by default. Secondly, you can control your smartphone camera from the watch, so you can put your phone down and take a picture from a distance.",
    "These two big features join a few smaller ones - there's a new marathon running mode and a few tweaks to the smartwatch's user interface. This update is rolling out to OnePlus Watch users currently, so if you own the smartwatch you'll likely get it soon.",
    "One little patch won't be enough to save the OnePlus Watch, because 'doesn't have an always-on display' was just one of many, many criticisms people had with the device.",
    "Various reviewers pointed out its software problems, a poorly-laid-out user interface, a barebones smartphone app, wildly inaccurate fitness tracking, the fact it's huge, its high cost, the few fitness modes and the uninspired design.",
    "Some of these problems can't be fixed - a software update isn't going to alter the look of the watch, for example. But more updates (and a price cut) could help the situation.",
    "Software updates could bring mode fitness tracking modes, improve the accuracy of these modes, re-design the user interface on both the watch and its app, and iron out many of the bugs people found with the watch.",
    "So while this first OnePlus Watch update won't re-write people's opinions on the smartwatch, hopefully it's just the first step of many towards a renaissance for the wearable.",
    "Via OnePlusRadar"
  ],
  "headers": {
    "4": "Is the OnePlus Watch saved?"
  },
  "links": {
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "OnePlusRadar": "http://oneplusradar.com/news/oneplus-watch-gets-always-on-display-feature-in-new-update/"
  }
}