{
  "source": "https://www.techradar.com/news/samsung-galaxy-a22-mid-ranger-design-revealed-in-new-case-leaks",
  "title": "Samsung Galaxy A22 mid-ranger design revealed in new case leaks",
  "category": "phones",
  "updated": "2021-04-21T09:04:18Z",
  "author": "david-nield",
  "summary": "5G on the cheap",
  "article": [
    "We'd previously heard that the Galaxy A22 could be Samsung's cheapest 5G phone yet – ready to take on the likes of Xiaomi and Realme in offering the next-gen connectivity at a budget-level price – and we may have just got our first look at the device.",
    "Case renders posted to Twitter by tipster @Sudhanshu1414 (via SamMobile) show a handset that looks rather unremarkable, but then we wouldn't expect a phone at this price point to move the needle in terms of smartphone innovation.",
    "A teardrop notch is visible at the top of the display on the front, while around the back there's a rectangular rear camera array – four sensors are shown, though it's possible that one of these could end up being an LED flash rather than an actual camera.",
    "Other points of note from these designs: it looks like the Samsung Galaxy A22 is going to come with a side-mounted fingerprint sensor built into the power button, and a 3.5mm headphone jack up at the top of the phone.",
    "Bear in mind that case makers don't always get every detail of a phone right in their renders, so some of these details could be subject to change. Don't take any of this as definite until Samsung officially unveils the phone.",
    "Previous reports have suggested the Galaxy A22 will come with a quad-lens 48MP+8MP+2MP+2MP camera on the back, and a single-lens 13MP selfie snapper on the front. Those camera specs would match the Samsung Galaxy A21s we saw last year.",
    "4G and 5G variants are expected, and if the rumored price of around 200,000 won (about $180 / £130 / AU$230) is correct, this would be the cheapest 5G phone from Samsung yet. Grey, white, light green and purple are said to be the color options.",
    "We haven't heard much else about the phone, other than that it is indeed on the way. Considering the Galaxy A21s launched in May, and the timing of this case render leak, it seems a good bet that the Galaxy A22 could be launched in May 2021."
  ],
  "headers": {},
  "links": {
    "@Sudhanshu1414": "https://twitter.com/Sudhanshu1414/status/1384024777103331330",
    "SamMobile": "https://www.sammobile.com/news/upcoming-mid-range-galaxy-a22-looks-the-part-fresh-case-renders/",
    "Previous reports": "http://www.thelec.net/news/articleView.html?idxno=2510",
    "Samsung Galaxy A21s": "https://www.techradar.com/news/samsung-galaxy-a21s-leak-shows-a-cheap-phone-with-a-massive-battery",
    "on the way": "https://www.techradar.com/news/samsung-galaxy-a-series-trademark-reveals-the-names-of-the-2021-handsets"
  }
}