{
  "source": "https://www.techradar.com/news/grab-this-instant-pot-that-can-air-fry-for-its-almost-lowest-price",
  "title": "Grab this Instant Pot that can air fry for its (almost) lowest price",
  "category": "appliances",
  "updated": "2021-08-17T08:56:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Act now to get the Instant Pot Duo Crisp and Air Fryer for less",
  "article": [
    "The best Instant Pots are versatile kitchen appliances that let you employ a multitude of cooking methods from pressure cooking to slow cooking, to help add some sparkle to daily dinners. However, they can be a costly purchase so a good Instant Pot deal is always welcome.",
    "In the US, Amazon has slashed 20% off the price of the Instant Pot Duo Crisp and Air Fryer, reducing it to $159.95 from $199.99. While this isn’t the lowest price we've seen for the Instant Pot, which has the ability to air fryer on top of all its other cooking methods, it’s almost as low as the prices we saw on Black Friday and Cyber Monday. (Not in the US? Scroll down for the best Instant Pot deals in your region.)",
    "This Instant Pot Duo Crisp and Air Fryer has an 8-quart capacity, although it’s also available in a 6-quart version. It also comes with two lids, the first of which is the standard lid that ensures it can pressure cook, slow cook, sauté, steam, sous vide, and reheat – all of which Instant Pot dubs wet cooking methods.",
    "The additional lid ensures the multi-cooker also offers an array of dry cooking modes such as air fry, roast, bake, broil and dehydrate.",
    "On test, we found the Instant Pot excellent at making curry, cooking rice, steaming vegetables and slow-cooking chilli. While the air fryer function was handy, we made fries in the Instant Pot, and found they’re not as crisp and evenly browned as when using a dedicated air fryer. However, if you’re tight on space in your kitchen, or on a budget and can’t afford to invest in both appliances, the Instant Pot Duo Crisp and Air Fryer is a sufficient compromise."
  ],
  "headers": {
    "2": "Today's best Instant Pot deal in the US",
    "5": "More Instant Pot deals"
  },
  "links": {
    "best Instant Pots": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "Instant Pot Duo Crisp and Air Fryer": "https://www.techradar.com/reviews/instant-pot-duo-crisp-and-air-fryer",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "we made fries in the Instant Pot": "https://www.techradar.com/news/i-made-fries-in-an-instant-pot-and-theyre-not-as-good-as-using-one-of-the-best-air-fryers"
  }
}