{
  "source": "https://www.techradar.com/news/you-can-now-get-a-raspberry-pi-chip-for-just-dollar1",
  "title": "You can now get a Raspberry Pi chip for just $1",
  "category": "computing",
  "updated": "2021-06-01T10:35:29Z",
  "author": "mayank-sharma",
  "summary": "Talk about bang for your buck...",
  "article": [
    "Developed at Raspberry Pi HQ, the surprisingly powerful RP2040 system-on-a-chip (SoC) has now gone on sale at a mere $1.",
    "The RP2040 microcontroller powers the recently launched Raspberry Pi Pico (which itself costs just $4), but until now was only available in bulk to partners who wanted to build it into their products.",
    "“Today, we’re announcing the logical next step: RP2040 chips are now available from our Approved Reseller partners in single-unit quantities, allowing you to build your own projects and products on Raspberry Silicon,” said Eben Upton, Raspberry Pi co-founder.",
    "Upton writes that, based on the surging demands for single-unit sales, the team has pulled around 40,000 RP2040 units for general availability and will make “serious volume” available later in the year, around autumn.",
    "The RP2040 is a powerful piece of silicon with dual-core Arm Cortex M0+ clocked at 133 MHz. It includes 264KB of RAM, which might not sound much, but lends the microcontroller to all kinds of uses in the hands of a skillful maker.",
    "The minuscule controller has all the usual interfaces, including hardware UARTs, SPI and I2C controllers, USB 1.1, along with a four-channel ADC. The highlight, though, is the programmable I/O (PIO) subsystem.",
    "Thanks to these specs, makers have rolled the RP2040 into some impressive pieces of tech.",
    "The products that caught the eye of sister site Tom’s Hardware are the Arturo182 RP2040 Stamp, a one-inch square breakout that you can simply drop into a project, Seeed's Wio RP2040, the cheapest way to get your RP2040 online, and Guido Burger's RP2040 CO2 sensing ring, which offers a unique means to detect CO2 levels around you.",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "4": "Power packed"
  },
  "links": {
    "Raspberry Pi": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "SoC": "https://www.techradar.com/news/computing/pc/system-on-a-chip-what-you-need-to-know-about-socs-1147235/2",
    "Raspberry Pi Pico": "https://www.techradar.com/news/the-latest-board-from-raspberry-pi-costs-just-dollar4",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/one-dollar-pi-silicon"
  }
}