{
  "source": "https://www.techradar.com/news/huawei-mate-50-pro-tipped-to-come-with-a-huge-battery",
  "title": "Huawei Mate 50 Pro tipped to come with a huge battery",
  "category": "phones",
  "updated": "2021-04-22T11:27:54Z",
  "author": "david-nield",
  "summary": "Other specs leak out too",
  "article": [
    "We haven't seen the Huawei P50 appear yet, but that's not going to stop us speculating on what specs the Huawei Mate 50 might bring with it later in the year – and the latest reports suggest one of those specs will be a 7,000mAh battery capacity for the Pro model.",
    "That's a huge capacity for a consumer phone, with most other models not even getting close – the Galaxy S21 is fitted with a 4,000mAh capacity battery, while the iPhone 12 makes do with just 2,815mAh. The news comes via GizChina from sources in China.",
    "There's more to battery life than battery capacity – how big the screen is, how much power the components draw, and so on – but with a 7,000mAh battery fitted inside it, you have to think that the Mate 50 Pro is going to be above average in terms of how long it can last between charges.",
    "For comparison purposes, the Huawei Mate 40 Pro arrived last year rocking a 4,400mAh capacity battery, so we're looking at a size increase of almost 60% – that's quite a selling point for Huawei to use on its promotional materials.",
    "Plenty more specs have spilled out at the same time too, though they don't all appear to be from the same source: the 5G-ready phone will apparently be powered by the Kirin 9000 chipset, 12GB of RAM and 512GB of internal storage.",
    "The screen is set to be a 6.8-inch OLED affair, with a 1176 x 2400 pixel resolution and a 120 Hz refresh rate, and there's apparently a quad-lens rear camera around the back: a 64MP main lens, a 12MP telephoto lens, a 12MP ultrawide lens, and a 0.4MP depth lens.",
    "We wouldn't bet your entire life savings on these rumored specs being accurate just at the moment, but they seem to be in the right area based on existing Huawei phones. We should get some more clues when the Huawei P50 makes an appearance at some point around the middle of the year.",
    "The Huawei Mate 50 and its Pro variant are being tipped to launch in October, though as usual they won't come running any Google apps and they won't have access to the Google Play Store, because of the company's US trade ban."
  ],
  "headers": {
    "4": "Specs appeal"
  },
  "links": {
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "Huawei Mate 50": "https://www.techradar.com/news/huawei-mate-50",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "GizChina": "https://www.gizchina.com/2021/04/21/huawei-mate-50-pro-to-sport-godzilla-size-7000mah-battery/",
    "Huawei Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "at the same time too": "https://t.cj.sina.com.cn/articles/view/2416966253/900ffa6d00100xolw",
    "US trade ban": "https://www.techradar.com/news/huawei-ban"
  }
}