{
  "source": "https://www.techradar.com/news/audi-e-tron-sportback-its-digital-mirrors-will-prepare-you-for-the-future-of-driving",
  "title": "Audi e-tron Sportback: its digital mirrors will prepare you for the future of driving",
  "category": "car-tech",
  "updated": "2021-01-30T01:00:46Z",
  "author": "john-mccann",
  "summary": "Look ma, no mirrors!",
  "article": [
    "Remember side-view mirrors? Those reflective panels that stick out either side of your car, allowing you to see what's behind, and in the lanes beside you? Of course you do, because the majority of cars still feature them - but this may be the beginning of the end.",
    "A number of manufacturers are experimenting with alternative options for keeping an eye on what's around your vehicle, and the all-electric Audi e-tron Sportback is one of the cars where a more futuristic option is available.",
    "The Sportback is a slight variant on Audi's first fully electric car, the e-tron SUV. It has a roofline more akin to a coupe, giving it a sportier and sleeker aesthetic. You'll pay extra for this enhanced look, even though it actually gives you slightly less room inside.",
    "Prices for the e-tron Sportback start at £69,850 / $69,100 (around AU$125,000), but our test loan came with a more powerful, 300kW electric engine and a host of optional extras which pushed its price tag up to £89,470 (around $120,000 / AU$159,000).",
    "Onto the tech, and specifically those fancy side mirrors. Audi calls them 'virtual door mirrors' and they were a £1,250 option on our e-tron Sportback 55.",
    "Externally, it looks as if the mirror housing has been lost, with a stalk either side of the car protruding out from the A pillar.",
    "It's a look which takes a little time to get used to, as our mind is so used to seeing traditional mirrors in this area of the car - you'll find other people notice too.",
    "When we were packed up, a family walked past and one of the kids spotted that we didn't have traditional mirrors on the car - and was suitably impressed when we explained what was actually going on here.",
    "So what is going on? Well, each stalk has a camera in it, which then relays what it sees to a small display on the inside of the door. Audi has shaped this display so it's similar to a traditional mirror, but the placement requires a slight change to your driving style.",
    "As the displays are set into the door panels, just below the glass on either side, you actually need to adjust your gaze downwards to view them. It's not a massive change in angle, but it's enough for it to feel unnatural during your first few drives.",
    "We were concerned about potential lag on the cameras, but that wasn't an issue with the virtual door mirrors able to keep pace with live traffic. The screens are also touch sensitive, allowing you to slightly adjust the camera's angle.",
    "Movement feels a little limited, and we felt like we wanted to 'zoom out' a little for a wider field of view, but again that was more because we weren't used to the digital mirror setup.",
    "After a number of drives, we became more accustomed to the virtual mirror setup and found that we naturally started looking in the right place when it came to checking them.",
    "The driver-side mirror is more of an adjustment, as the display is closer to you and thus requires a greater tilt of the head. The passenger-side screen falls more naturally into your eye line, thanks to it being further away.",
    "As well as getting a view either side of the e-tron Sportback, the mirrors can also warn you if there's a vehicle in your blind spot by employing a yellow border on the display, while a green highlight will blink on the corresponding display when you're indicating.",
    "If the e-tron Sportback detects you're driving on a multi-lane road, it'll add in a horizontal white line to denote the separation between the lane you're in and the one next to you, to give you a clearer indication of what else is around you.",
    "Another benefit of having virtual mirrors comes at night, as there's no physical mirror for headlights to reflect off - providing you with a clearer image of what's behind you and reducing the risk of your sight being impaired.",
    "While the cameras worked well on lit roads at night, they were less effective on unlit roads - with visuals not as crisp or clear as a traditional mirror.",
    "As we mentioned at the start, the Audi e-tron Sportback is a slightly more slick model of the standard e-tron SUV, with its sweeping rear profile providing a sportier look while reducing the amount of vertical space in the boot and over the rear seats.",
    "Adults can still comfortably sit in the rear seats, but those over six foot will find that the roofline will make contact with the top of the head - so long journeys here may become arduous.",
    "In general though, the cabin is bright and spacious - especially for those sitting in the front. There's plenty of legroom and a good level of storage. Front seat passengers have access to two USB ports, a wireless phone charger, two cup holders and heated seats.",
    "Meanwhile, for those in the back, there are dedicated climate control dials, plus a further two USB ports for charging devices.",
    "Thanks to the fully-electric engine and a premium level of sound protection, the cabin is also a quiet place to be, even at motorway speeds.",
    "Acceleration is good, with the e-tron Sportback 55 able to propel you from 0-62mph in 6.6 seconds and it'll comfortably continue to climb, with a top speed of 124mph if you can find somewhere legal to excel that quickly. Handling is responsive too, and the four wheel drive quattro system provides a high level of grip.",
    "Audi's in-car entertainment system is excellent with dual central touch screens plus a large digital cockpit display behind the steering wheel providing a buffet of options to both driver and passenger. Our only real gripe here is the dual screen setup in the middle is a bit of a fingerprint magnet.",
    "As this is an electric car we need to talk about range, and Audi says the e-tron Sportback can deliver up to 240 miles on a single charge. In real world use, with a mix of driving styles, we got around 180-190 miles - which means you may find yourself at the charger more frequently than you may like.",
    "Taking the car to a fast-charging pump, we were able to go from 30 miles of range to 180 miles in just under 50 minutes, with 120 miles in the tank after 30 minutes.",
    "What's nice about the e-tron and the e-tron Sportback is the fact Audi has fitted them with dual charging ports - one on the left, and one on the right, making it easier when it comes to charging the car, as you don’t have to think about the way you approach it.",
    "The standard e-tron is the better buy for most as it offers pretty much everything the Sportback does, for slightly less - but if you want sport styling to go with your premium SUV, then the Audi e-tron Sportback could well be what you're looking for.",
    "As for those digital door mirrors... they take some getting used to, but they work well and are a neat party trick - plus, they may just be one of the next major changes in our cars."
  ],
  "headers": {
    "4": "Virtual visibility",
    "18": "Audi e-tron Sportback design, drive and charging"
  },
  "links": {
    "e-tron": "https://www.techradar.com/news/audi-e-tron"
  }
}