{
  "source": "https://www.techradar.com/news/this-portable-nas-crams-in-a-huge-amount-of-space-for-all-your-data",
  "title": "This portable NAS crams in a huge amount of space for all your data",
  "category": "computing",
  "updated": "2021-10-20T19:00:32Z",
  "author": "anthony-spadafora",
  "summary": "QNAP's new portable NAS device can store up to 32TB of data",
  "article": [
    "QNAP has announced the launch of its new portable NAS device designed for mobile workers whose organizations have implemented hybrid work policies.",
    "The company's new TBS-464 NASbook can be equipped with up to four M.2 SSDs for storage and the device supports HybridMount which allows users to mount files from their cloud storage to enable local caching to provide the ability to work with online files as quickly as they do with local files.",
    "At the same time, the near-silent TBS-464 features two HDMI 2.0 4K 60Hz outputs, hardware-accelerated transcoding and streaming and includes QNAP's KoiMeeter for video conferencing and wireless presentations. The TBS-464 is also incredibly fast and with two 2.5GbE ports, the device can achieve speeds of up to 5 Gbps with Port Trunking.",
    "Product manager at QNAP, Joseph Ching provided further insight on the business use cases of the TB-464 in a press release, saying:",
    "“The TBS-464 NASbook packs serious performance and complete business applications into a tiny, portable frame. By seamlessly integrating cloud storage spaces, the TBS-464 provides the combined advantages of portability and storage flexibility to boost the abilities of modern offices and studios. With the ability to locally cache cloud-based files on the TBS-464, users can enjoy access speeds as if they were working within a LAN environment.”",
    "Under the hood, QNAP's TBS-464 is powered by an Intel Celeron N5105/N5095 (Jasper Lake) quad-core 4-thread processor that can burst up to 2.9 GHz with Intel AES-NI encryption engine, 8GB of DDR4 RAM and USB 3.2 Gen 1 ports for faster data transfers.",
    "The device runs the company's QTS 5 operating system which provides an optimized user interface and next-gen experience. Meanwhile, Hybrid Backup Sync (HBS) allows for efficient local, remote and cloud backup jobs while block-based snapshots make data protection and recovery easier to help organizations mitigate the threats of ransomware.",
    "The TBS-464 also supports media playback to either a TV or monitor through its two HDMI ports and the device is even capable of converting 4K videos to universal file formats which can be played smoothly on multiple devices. As a result, QNAP's portable NAS device is an ideal solution for media streaming using Plex. However, organizations can extend its functionality further by using QNAP KoiMeeter to build a high-quality video conferencing system or to enable wireless presentations.",
    "While QNAP has yet to announce the pricing and release date for the TBS-464, there is already a product page complete with support options available on its site which means it will likely be available quite soon."
  ],
  "headers": {
    "5": "QNAP TBS-464 NASbook"
  },
  "links": {
    "NAS device": "https://www.techradar.com/news/the-10-best-nas-devices-reviewed",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "M.2 SSDs": "https://www.techradar.com/best/best-m2-ssd",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "press release": "https://www.qnap.com/en/news/2021/qnap-introduces-the-tbs-464-nasbook-featuring-m-2-nvme-ssd-hdmi-2-0-output-two-2-5gbe-ports-and-ideal-for-meetings-and-multimedia",
    "Jasper Lake": "https://www.techradar.com/news/intel-jasper-lake-cpus-could-seriously-power-up-budget-laptops-in-early-2021",
    "QTS 5": "https://www.techradar.com/news/qnap-patches-another-load-of-major-nas-device-security-flaws",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "data protection": "https://www.techradar.com/best/best-data-loss-prevention-service",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "4K videos": "https://www.techradar.com/news/best-4k-camera",
    "Plex": "https://www.techradar.com/reviews/plex"
  }
}