{
  "source": "https://www.techradar.com/news/exclusive-electric-car-price-drop",
  "title": "Exclusive: Hoping to see electric car prices drop? Don't expect price parity any time soon",
  "category": "car-tech",
  "updated": "2021-09-06T18:11:09Z",
  "author": "john-mccann",
  "summary": "But you need to think about total cost of ownership",
  "article": [
    "It's no secret, electric cars cost more than their ICE (internal combustion engine) counterparts – but paying a premium for new technology isn't anything new.",
    "Trends over the years show prices drop once a new technology reaches a mass scale – the first 4K TVs were astronomical in price, now you can pick one up for less than a new iPhone - making its more attainable for consumers.",
    "Those considering buying an EV (electric vehicle) as their next car may be waiting for a similar price drop to happen, as we see an influx of new models entering the market from all major auto brands.",
    "But if you're waiting for that price drop, you may be waiting quite a while.",
    "TechRadar asked Markus Schäfer, COO at Mercedes-Benz, when we could expect to see cost parity between ICE and electric vehicles, and his answer may disappoint those wanting to jump into an EV in the near future.",
    "\"When will we reach cost parity of the two drivetrains? ... Not in the near future\" Schäfer told us. \"The battery power train will continue to be a couple of thousand Euros more than the ICE [equivalent model].\"",
    "A \"couple of thousand\" is an optimistic estimate on the premium you currently pay for an electrified drivetrain over a traditional gas guzzler, with several thousand a more realistic premium for many models.",
    "So when can we expect to see some form of parity? \"I don't see this in the mid 20s\" Schäfer explained, \"towards the end of this decade, when batteries are made in bigger scales and there's new chemistry, then [the] price might fall.\"",
    "That means we may be waiting until 2030 until we see electric car prices reach parity with what we're used to paying for traditional gasoline models.",
    "While that may feel a long way off - to be fair, it is - if you're considering an EV, you also need to think longer term, over the whole ownership of the vehicle, as it may still work out cheaper.",
    "While the upfront cost / monthly payment of an electric car is higher, there are significant savings to be had when it comes to fuel - especially if you do a lot of miles.",
    "\"If you look at total cost of ownership, you can argue an electric vehicle makes sense, even over short distances\" Schäfer said.",
    "Depending on where your live and the price you pay per kWh at home, you can recharge an EV for far less than topping up with fuel.",
    "Sure it takes much longer to charge, but if you're able to leave your vehicle to charge overnight and aren't doing over 100 miles a day, it's not that inconvenient.",
    "Schäfer does feel that more needs to be done to encourage drivers into EVs; \"the system needs some incentives to get [electric cars] into the mass market\".",
    "As charging infrastructure improves, with more charging points across countries and the continued increase in charging speeds, range anxiety will be lessened and consumers may feel comfortable paying more initially for an EV, with the knowledge there are savings to be had down the road.",
    "However, for those on a budget, the lower initial cost, reliability of the fueling station network and robust secondhand market means ICE vehicles will continue to be attractive propositions over the next five to 10 years."
  ],
  "headers": {
    "10": "The long play"
  },
  "links": {
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "new iPhone": "https://www.techradar.com/reviews/iphone-13"
  }
}