{
  "source": "https://www.techradar.com/news/amazon-has-renewed-invincible-for-two-more-seasons-but-will-it-get-more",
  "title": "Amazon has renewed Invincible for two more seasons – but will it get more?",
  "category": "entertainment",
  "updated": "2021-05-07T16:37:50Z",
  "author": "tom-power",
  "summary": "Invincible by name, invincible by nature?",
  "article": [
    "Invincible is currently one of Amazon Prime Video's most popular TV shows, and it's easy to see why. The series has gone from strength to strength since its first three episodes arrived in late March, which we praised at the time, and now there's only one more installment left for fans to enjoy.",
    "Well, that was the case before last night. Fans of the TV show and Robert Kirkman's graphic novels have called on Amazon to renew Invincible for season 2 for a few weeks now. Ahead of season one's finale (our thoughts on this are coming this weekend), fans' wishes were granted – and then some.",
    "In an announcement on the official Invincible Twitter account, it was revealed that the animated series had not only been renewed for season two, but a third season, too. Judging by the amount of likes and retweets that the reveal has received, it's been a popular decision by Amazon and Image comics.",
    "Check out the announcement below:",
    "That depends on how quickly seasons two and three get through the rest of the source material. If we had to guess, though, it's very likely that it will.",
    "In total, there are 144 comic book issues of Invincible to get through. Invincible season 1 more or less covers the first 23 issues, so there's plenty more story to be told. If the streamer's anime-esque adaptation continues on that kind of trajectory, it'll need either six or seven seasons to tell the complete tale of Mark Grayson/Invincible.",
    "That'll depend on how many episodes, and their length, there'll be in each season, too. Season one had eight 45-minute installments, but it's unclear if seasons two and three will follow a similar plan. One of our main critiques of the TV show is that some episodes feel drawn out, so breaking future seasons up into 10 episodes of 30 to 35 minutes may work better.",
    "This decision will hang on what makes a good stopping point for each season finale, though. We won't spoil Invincible season one's ending – or the comics – here, but it feels like a good place to stop given the events that play out. Seasons two and three, then, will work best if they employ a similar cliff hanger ending.",
    "Of course, future seasons will also depend on the series' popularity. Invincible has a sizable following at the moment, but it remains to be seen if it'll maintain its audience. The smart money says that it will, but we've seen other TV shows canceled before their time in recent years, so we'd be remiss to say it'll definitely receive more seasons.",
    "As for what seasons two and three will entail, fans of Kirkman's graphic novels will already know what's coming next. The season one finale also gives audiences a good indication of where its follow-up entries will go but, again, we won't spoil anything from Invincible episode 8 here.",
    "Instead, you can read our thoughts on the season one finale, and what we think needs to be improved in seasons two and three, in our Invincible wrap-up article. This'll go live this weekend, so make sure you check back for more Invincible coverage then.",
    "Invincible's season one finale is available to stream now on Amazon Prime Video"
  ],
  "headers": {
    "4": "Will Invincible get more seasons on Amazon Prime Video?"
  },
  "links": {
    "Invincible": "https://www.techradar.com/news/inside-invincible-on-amazon-prime-a-hyper-violent-spin-on-heroes-and-villains",
    "which we praised": "https://www.techradar.com/news/invincible-on-amazon-prime-video-is-a-violent-but-heartfelt-superhero-show",
    "Invincible for season 2": "https://www.techradar.com/news/invincible-season-2"
  }
}