{
  "source": "https://www.techradar.com/news/heres-another-reason-email-isnt-going-anywhere-any-time-soon",
  "title": "Here's another reason email isn't going anywhere any time soon",
  "category": "computing",
  "updated": "2021-08-19T16:00:25Z",
  "author": "mayank-sharma",
  "summary": "The demise of email has been greatly exaggerated",
  "article": [
    "A new survey conducted to understand the complexity of consumer expectations has revealed that email is still the preferred mode of communication between companies and their customers.",
    "Commissioned by customer-engagement SaaS solutions provider Freshworks, the survey covered over 11,000 adults from about a dozen countries around the world.",
    "Among many findings, the firm discovered that, despite the arrival of various other and more instant forms of communication, email still remains the medium of choice when customers need to engage with companies.",
    "According to the survey, 31% of the users prefer to use email to register their complaint with a company, topping all other means of communications.",
    "Besides sharing their grievances, consumers also prefer to use email to provide feedback, with 24% choosing to send their comments to an inbox over any other means. An almost similar percentage (22%) gather information about a company’s products or seek support using email.",
    "The area where the preference for email is most surprising is order tracking. While it might appear that other means would be a lot more convenient to track orders, email is the preferred mode of 28% of users.",
    "When quizzed about the communication this year, once again the use of email registered the highest growth as compared to the other channels.",
    "The use of email as a means of communication between companies and their consumers clocked an increase of 32%. While other means also registered double-digit growth, they still lagged behind email. For instance, the use of interactions using a company's app increased by 29%, while WhatsApp registered a 25% growth.",
    "So while the survey suggests that companies must offer their consumers multiple means of engagement, the majority still prefer interacting via old-fashioned email. This will be a rude shock to the experts who determined email was bound for the grave as a result of the adoption of other, more instant modes of digital communication."
  ],
  "headers": {
    "4": "Not dead yet"
  },
  "links": {
    "email": "https://www.techradar.com/news/best-email-provider",
    "Freshworks": "https://www.techradar.com/reviews/freshcaller",
    "According to the survey": "https://www.awin1.com/awclick.php?awinmid=18171&awinaffid=103504&clickref=trd-us-1954051587275122400&p=https%3A%2F%2Fwww.freshworks.com%2Fresources%2Freports%2Fdeconstructing-delight%2F",
    "WhatsApp": "https://www.techradar.com/best/whatsapp-alternatives"
  }
}