{
  "source": "https://www.techradar.com/news/how-to-watch-turner-and-hooch-online-stream-the-new-disney-plus-original-series-now",
  "title": "How to watch Turner and Hooch online: stream the new Disney Plus Original series now",
  "category": "computing",
  "updated": "2021-07-21T05:00:48Z",
  "author": "daniel-pateman",
  "summary": "The canine comedy from 1989 gets a Disney Plus reboot",
  "article": [
    "We’ll be doggone! Disney Plus has brought back our favorite buddy-cop duo, producing a 12-part continuation of the Tom Hanks comedy from 1989. Prepare for more canine carnage from the next generation of Dogue De Bordeaux as we explain how to watch Turner and Hooch online now with a Disney Plus subscription.",
    "Created by Matt Nix (Burn Notice, The Gifted), this legacy sequel focuses on US Marshall Scott Turner Jr (Josh Peck), the meticulously neat and uptight son of Tom Hanks’s now-deceased character.",
    "Living alone and too pre-occupied with work to date, his world is upended when he inherits his father’s French mastiff, rescued from an animal shelter by Turner Snr because it was the embodiment of the original Hooch.",
    "Despite the dog’s appetite for destruction – he totals Scott’s trendy apartment in seconds – he proves a boon for his owner’s love life, bringing him into contact with K-9 trainer Erica (Vanessa Lengies, Glee). He’s also an excellent law enforcement aide: sniffing out contraband, chasing down criminals, and, along with Scott’s sister Laura (Lyndsy Fonseca), helping to investigate the murky circumstances around their father’s death.",
    "Excitingly for fans of the original, Reginald VelJohnson returns to play former DI turned mayor of Cypress Beach. Meanwhile, Carra Patterson stars alongside Peck as work colleague Jessica, Anthony Ruivivar is US Marshall Chief James Mendez, Brandon Jay McLaren plays ex-marine Xavier, and Modern Family’s Jeremy Maguire features as Scott’s excitable nephew.",
    "Ready for a high-pedigree comedy? Then keep reading as we detail how to watch Turner and Hooch online from anywhere now.",
    "Disney Plus is already cheaper than competing streaming services like Netflix but you can save even more when you sign up for an annual subscription which gives you 15% off the monthly price. Obviously you have to splash the cash at the start, but with so much content to get stuck in to we very much doubt you'll run out of things to watch before the 12 months are up. You're looking at $79.99/£79.90/AU$119.99 for the year.",
    "Or if your interests are farther reaching (and you're in the US), then we'd seriously suggest looking at the fantastic value bundle package. It adds Hulu and ESPN+ to your subscription price. The Hulu element opens up a world of Hulu Originals such as The Great, Upload, Love Victor and Helstrom. While ESPN+ brings tonnes of exclusive live sport, highlights and documentaries. The combined bundle costs just $13.99 a month.",
    "Turner and Hooch is just the latest in a string of recent blockbuster releases exclusive to the platform, including Loki, Monsters at Work, Soul, Mulan, Hamilton, The Falcon and the Winter Soldier and much more.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "In addition, now that Disney has set the precedent of releasing movies like its live-action Mulan remake on the service instead of in theaters through its Disney Plus Premier Access program, expect the company to keep bringing more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021. More recently, it's an excellent way to watch Black Widow online , the first film in Phase 4 of the MCU.",
    "And finally, there's the new Star on Disney Plus that most global markets get to enjoy and sees the amount of content available through Disney Plus more than double, with a particular eye to shows grown-ups are going to enjoy.",
    "It's available in the UK, most of Europe, and other select markets like Australia and New Zealand - but not in the US, where the media giant's Hulu service already has very similar ground covered.",
    "Read more:"
  ],
  "headers": {
    "6": "How to save money on Disney+",
    "8": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1076818158628585200&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "$79.99/£79.90/AU$119.99 for the year": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-8881279119695077000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "ESPN+": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "costs just $13.99 a month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-7768680902691189000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fdisney-hulu-espn-bundle",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "watch Black Widow online": "https://www.techradar.com/news/what-time-is-black-widow-released-on-disney-plus-this-week",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}