{
  "source": "https://www.techradar.com/news/oneplus-presidents-day-sale-features-price-cuts-and-freebies-on-top-devices",
  "title": "OnePlus Presidents' Day sale features price cuts and freebies on top devices",
  "category": "phones",
  "updated": "2021-02-10T14:35:46Z",
  "author": "alex-whitelock",
  "summary": "Ongoing now until the 17th of February",
  "article": [
    "To celebrate the yearly Presidents' Day sales and Valentines Day deals, OnePlus has just posted a sitewide promotion that not only offers a ton of freebies with top Android devices, but also hefty discounts.",
    "The OnePlus 8, for example, the companies mainstream mid-level flagship is available for $699 (was $799) right now, and if you purchase from now until Feb 17th you'll get yourself 50% a second. With a great screen, sleek design, and tons of power, this device was a favorite of ours last year when we originally reviewed it and it's still a fantastic choice in 2021.",
    "For the best of the best, you'll want to check out the OnePlus 8 Pro for $799 (was $999). Alongside that $200 price cut, you can also score yourself a free OnePlus Urban Traveller backpack - which is worth $79 by itself.",
    "If you're on a budget, however, you can opt to go for the brand new OnePlus Nord N10 5G, which is retailing for $299. There's no outright saving here since it's a brand new device, but you will score yourself a choice of either a free screen protector or case if you purchase one by Feb 17th. While not quite as premium as the other devices, this one's a great choice if you want 5G connectivity on a budget, and its 90Hz screen and 64MP quad-camera are very competitive for the price.",
    "Not in the US? See the best OnePlus deals in your region just below.",
    "We're rounding up this week's best cell phone deals right here if you're interested in seeing the latest from not just OnePlus, but Apple, Samsung, and other leading brands too."
  ],
  "headers": {
    "5": "OnePlus Presidents' Day sale"
  },
  "links": {
    "a sitewide promotion": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-2616360446871948300&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2F",
    "for $699 (was $799)": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-9653502681202842000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-8%3Ffrom%3D8",
    "for $799 (was $999)": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-1869057824721515300&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-8-pro%3Ffrom%3D8pro",
    "for $299": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-7228612965716065000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-n10-5g",
    "best cell phone deals": "https://www.techradar.com/deals/mobile-phone-deals"
  }
}