{
  "source": "https://www.techradar.com/news/raspberry-pi-founder-dismisses-talk-of-public-float",
  "title": "Raspberry Pi founder dismisses talk of public float",
  "category": "computing",
  "updated": "2021-03-16T09:44:14Z",
  "author": "mayank-sharma",
  "summary": "Reports valued the Raspberry Pi organization at £300 million",
  "article": [
    "The Raspberry Pi Foundation has denied reports that it is gearing up for listing on the London Stock Exchange.",
    "The Raspberry Pi is Britain’s best-selling computer that was originally conceptualized as an affordable computer to lower the barrier of entry for computer education. However, it has also reinvigorated interest in do-it-yourself (DIY) computing and ushered in a whole generation of single-board computers (SBC).",
    "Speaking to The Register, Eben Upton, founder of the Raspberry Pi Foundation and CEO of its commercial subsidiary, Raspberry Pi (Trading), has shot down news of the listing saying “it's not something we're actively pursuing.\"",
    "The Raspberry Pi Foundation is a non-charitable organization that Upton founded in 2009 to promote computer education. In 2013, the foundation spun off a for-profit fully-owned subsidiary, Raspberry Pi (Trading), with the intention of pumping back profits to fund the work of the foundation.",
    "The miniscule computer, which now has several variants to cater to everyone from educationalists to the DIY community, including the recently launched Pico and Raspberry Pi 400, in addition to the famed Raspberry Pi line of SBCs that have nearly sold 40 million units worldwide.",
    "Over the weekend it was reported that the group was gearing up to go public with a valuation of £300 million. The organization was said to be actively combing through a list of bankers as it prepared for its debut on the bourse.",
    "\"We speak to advisors all the time about how we might fund the future growth of the business,\" said Upton, reasoning that this might have been misinterpreted.",
    "Via: The Register"
  ],
  "headers": {
    "3": "Not going public"
  },
  "links": {
    "Raspberry Pi": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "affordable computer": "https://www.techradar.com/news/best-raspberry-pi-distro",
    "education": "https://www.techradar.com/best/best-linux-distros-for-education",
    "Pico": "https://www.techradar.com/news/the-latest-board-from-raspberry-pi-costs-just-dollar4",
    "Raspberry Pi 400": "https://www.techradar.com/news/raspberry-pi-400-is-a-computer-inside-a-keyboard",
    "The Register": "https://www.theregister.com/2021/03/15/pi_not_listing/"
  }
}