{
  "source": "https://www.techradar.com/news/ipad-air-5",
  "title": "New iPad Air 5 release date, price, news and leaks",
  "category": "tablets",
  "updated": "2021-10-28T12:56:05Z",
  "author": "tom-bedford",
  "summary": "Plus, our wish-list for the new iPad",
  "article": [
    "While the Spring Apple Event brought the new iPad Pro 2021, we hope you weren't waiting on the iPad Air 5 - the chances of that mid-range tablet coming were close to zero.",
    "Why do we say that? Well, it's not been long since the iPad Air 4 came out - it's still fairly new as tablets go, so we wouldn't expect a new one for at least six, or maybe up to 18, months.",
    "The first three generations of iPad Air had all sported a fairly similar look, but the iPad Air 4 brought a design overhaul to the series, moving it from merely being a larger entry-level iPad into effectively an 'iPad Pro Lite' device. The 2020 iPad Air hit the shelves with a modern-looking design, generous processing power and a side-mounted fingerprint scanner, but without some of the premium features that make the iPad Pro the top-dog tablet.",
    "So what could the iPad Air 5 bring? Another design update? Improvements to the screen? An extra camera? We've heard that all of these and more might be in the works, and you can read full details of all the leaks and rumors below. We've also put forth a wish list of what we'd like Apple's next generation of tablet to look like.",
    "This includes fixes to some of the iPad Air 4's niggles, some new features missing from the current edition, and plenty more.",
    "Apple doesn't generally keep to a yearly release schedule for its iPad Air line, but we can at least assume that the release of a new model won't happen before October 2021, a year after the launch of the iPad Air 4.",
    "While October currently looks like the earliest we'll see the iPad Air 5, it could be launched even later than October, with one source talking about a new model in 2022, so if you're thinking of buying a new tablet now, then the iPad Air 4 will probably be the latest model in this line for some time to come.",
    "Price-wise, the iPad Air 4 costs $599/£579/AU$899 for a model with 64GB of storage, with prices going up for more storage or cellular connection. We could see prices for the iPad Air 5 in the same ballpark.",
    "We haven't heard much about the iPad Air 5 yet, but one source claims that an iPad Air model launching probably in early 2022 will have a 10.9-inch OLED screen.",
    "That size is the same as the iPad Air 4, but the technology is different, as current models use LCD. A move to OLED could lead to better contrast and colors, among other upgrades.",
    "However, more recent whispers about this Apple tablet suggest that OLED isn't working out as Apple wanted, so the iPad Air 5 is going to stick with LCD instead. That's come from not one but two reports now.",
    "One other source meanwhile didn't mention OLED but did say the iPad Air 5 will have a 10.9-inch screen, along with an A15 Bionic chipset (expected first in the iPhone 13 range), plus 5G, a dual-lens camera (with an ultra-wide joining the main one), four stereo speakers, and a design that's similar to the iPad Pro 11 (2021) - though still without Face ID.",
    "Here's what we want to see in the next iPad Air model.",
    "The iPad Air 4 is available with two storage options: 64GB, which is unlikely to be enough for most users; and 256GB, which is quite a bit more expensive.",
    "Most tablets come with 128GB, because it caters well to the majority, and would work well with iCloud (or your cloud storage tool of choice) for those who require extra storage still.",
    "We'd like to see the iPad Air 5 arrive with 128GB of storage, with Apple dropping the 64GB option entirely. The latter may be a suitable provision for entry-level iPads, but is unlikely to ever be sufficient for the types of power-users who would be investing in the iPad Air.",
    "We took issue with the iPad Air 4's selfie camera – a 7-megapixel unit, it wasn't great for video calling, taking selfies, or recording video of yourself.",
    "Bumping up those numbers to a 10- or 12-megapixel unit would make the selfie camera more useful. Better still would be the inclusion of iPhone selfie technology.",
    "We were pleased to see Apple offer the iPad Air 4 in a range of color options. In particular, we liked the addition of the pastel shades.",
    "We'd like to see more of the same with the iPad Air 5, with perhaps some new color options too. The iPhone XR and iPhone 12 are available in some great, vibrant colors, so let's see them used more!",
    "The iPad Air 4's battery lasted around 10 hours of use. This is similar to that offered by the majority of iPads; 9-12 hours is the quoted figure for general use. If you're using your iPad to watch movies in bed, or work in coffee shops from time-to-time, this is totally acceptable.",
    "However, if you're a creative using your iPad on a film shoot, a businessperson trying to work on a long-haul flight, or a parent looking to entertain your kids on a long car ride, then you may struggle with that amount.",
    "We'd like to see the iPad Air 5 boost battery life, or at least include software optimizations that keep the device ticking over for longer.",
    "This is more a problem with iPadOS 14 and Apple's software, than iPad hardware, but it's a change we'd welcome.",
    "One of the key features of iOS 14 is the ability to create widgets based on your apps, and leave them on the home screen for easy use. In iPadOS, you can only add these widgets to a carousel on the 'main' home page, making them difficult to find if you have lots of apps, and therefore much less useful.",
    "We'd like to see iPadOS 14 improved so you can add widgets to your home menu wherever you like, not just in the same position.",
    "The iPad Air 4 and iPad Pro designs don't sport the huge bezels of the entry-level iPad and iPad Mini, but there remains a pretty chunky border separating the screen from the edge of the tablet.",
    "A thinner bezel around the iPad Air 5 would offer an improvement to the design, making the tablet's body size more closely match its screen size. This isn't a deal-breaking demand, which is the reason it sits last on this, but thinner bezels always look better – and this is a wish-list, after all."
  ],
  "headers": {
    "5": "iPad Air 5 release date and price",
    "8": "News and rumors",
    "12": "What we want to see",
    "13": "1. Generous storage options",
    "16": "2. Improved selfie camera",
    "18": "3. Even more color choices",
    "20": "4. Longer-lasting battery",
    "23": "5. Better iPad widget handling",
    "26": "6. Thinner bezels"
  },
  "links": {
    "Spring Apple Event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "talking about a new model in 2022": "https://www.techradar.com/news/new-ipad-air-and-ipad-pro-models-could-both-get-oled-screens-next-year",
    "one source claims": "https://www.techradar.com/news/new-ipad-air-and-ipad-pro-models-could-both-get-oled-screens-next-year",
    "two": "https://www.techradar.com/news/dont-hold-your-breath-for-an-oled-ipad-any-time-soon",
    "reports": "https://www.techradar.com/news/the-ipad-air-with-oled-looks-increasingly-unlikely-to-happen-in-2022",
    "other source": "https://www.techradar.com/news/ipad-air-5-could-make-the-ipad-pro-11-2021-almost-irrelevant",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "stereo speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPadOS 14": "https://www.techradar.com/news/ipados-145",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news"
  }
}