{
  "source": "https://www.techradar.com/news/work-life-balance-vs-work-technology-balance",
  "title": "Work-life balance vs work-technology balance",
  "category": "computing",
  "updated": "2021-04-12T14:06:52Z",
  "author": "euan-davis",
  "summary": "How to reduce the ping of notifications and actually work",
  "article": [
    "Digital technology has never been more essential to our working lives than during the past 12 months when large portions of our society have been remote working, in many cases for the first time.",
    "Digital technology has allowed us to interact, collaborate, and access our work and the wider world at the push of a button. It has been essential for communicating with friends, family, colleagues and loved ones, for accessing our exercise classes, book clubs, live entertainment and, of course, the tools we need to do our work. As we have all adapted to changing circumstances, it has never been more possible to bring the office into our homes or to function as close to “normal” from anywhere. Now, we have to consider how and where we will work in the future.",
    "Expectations are that some remote working practices will remain in place for many of us even after offices are able to reopen safely, and this will lead to a rise in hybrid workforces. This will mean employees are split, with some staff in the office and others working from home on any given day. The remote working practices we have all adopted over the past year were by no means a pandemic-only response; they are here to stay, and will offer much-desired flexibility in the longer term, as well as the ability for buildings to balance safety requirements in the immediate future where full capacity may not be possible.",
    "At the same time, many cannot wait to get back to an actual workplace and be surrounded by their colleagues. The office is not dead, but it also will not be the only place for the future of work – leading to hybrid workforces becoming much more common.",
    "It is expected that hybrid work patterns will closely mirror those of remote working, with our connectivity being driven by technology rather than location. But this can be seen as a double-edged sword. For all the innumerable positives of the role of technology plays in our working lives, from the celebrated work-life benefits of avoiding the stress, time and expense of commuting, to the flexibility of working around other commitments such as the school run, the downside is the feeling or expectation of being constantly available.",
    "Whether it is emails, Teams or Slack notifications, or other similar connectivity tools, the non-stop ping of notifications has become the daily soundtrack of our working lives. Video calls have not only replaced regular meetings that would have happened face to face or via phone call, they have multiplied in a bid to compensate for the decline in direct contact. As a result, our days are spent communicating digitally, almost non-stop, about the work that needs to be done or that we are planning to do, which is actually impacting our ability to do the work in question.",
    "This is not just anecdotal, but quantifiable. A recent study explored the change in work behaviors and attitudes between 2016 and now. One eye-catching finding was the decline in respondents’ belief that digital technologies increase personal efficiency and productivity. Where five years ago 74% felt technology improved efficiency and 87% felt it improved productivity, these have now dropped considerably, to 48% and 46% respectively. Fewer than half of people now believe technology is helping them to do their jobs better, despite the fact that a lack of technology would have, in many cases, made work almost impossible during lockdown.",
    "This reflects the reality that most of us are currently experiencing: that we are working longer hours, working more intensely and juggling more demands, and that additional layers of technology – instant messaging, video conferencing, collaboration platforms, now all the norm in our immersive, work-from-home age – seem to be making many of us less efficient and less productive. We are so busy communicating, there is no time to do any work.",
    "The good news is that this is not an insurmountable issue. The past 12 months have in effect been a mass experiment on how we work and how we want to, and it is hugely beneficial in terms of how we now approach the future of work.",
    "Technology will continue to play an essential role in our work lives, whether we are in an office with colleagues or connecting remotely. In-built tools, such as muting notifications outside certain working windows and scheduling emails for the following day if working late, can help to reinstate some of the boundaries between work and life that have become eroded. Even when offices can safely welcome staff back, we are unlikely to see whole workforces under one roof at the same time ever again. Ongoing distancing requirements and health and safety measures are likely to mean portions of staff will be working remotely, perhaps in a rotating pattern based on individual appetites and schedules, as well as safe office capacity.",
    "As this flexibility becomes the norm and we begin to adopt hybrid working patterns, the next step is to refine working practices that only arose out of necessity and ensure the wealth of options, from locations to technologies, is used to improve how we work together, not hinder it."
  ],
  "headers": {
    "4": "Connected conundrums",
    "8": "The road ahead"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "office": "https://www.techradar.com/best/free-office-software",
    "employees": "https://www.techradar.com/best/best-employee-monitoring-software",
    "working from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "emails": "https://www.techradar.com/news/best-email-provider",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}