{
  "source": "https://www.techradar.com/news/animated-sitcom-king-of-the-hill-is-close-to-a-revival",
  "title": "Animated sitcom King of the Hill sounds close to a revival",
  "category": "entertainment",
  "updated": "2021-03-16T16:26:22Z",
  "author": "samuel-roberts",
  "summary": "And it's set 15 years later",
  "article": [
    "Animated sitcom King of the Hill sounds like it's close to coming back from the dead, according to writer Brent Forrester. In an AMA on Reddit, Forrester said that creators Greg Daniels and Mike Judge are in \"hot negotiations\" to bring the Fox series back, with all the characters ageing up by 15 years.",
    "\"I am sure Greg Daniels and Mike Judge will murder me for sharing this but... HELL YES,\" Forrester said when asked if he'd heard any updates about the show being revived. \"They are in hot negotiations to bring back King of the Hill. The Trump administration made it suddenly very relevant again. The characters have all aged 15 years. The project is sooooo good. Okay I've said too much :)\".",
    "In March 2020, co-creator Greg Daniels said that the Fox network in the US had previously rejected a reboot of King of the Hill, though he maintained his interest in making one. \"But we do have a plan for it and it's pretty funny,\" Daniels told Comic Book. \"So maybe one day.\" It sounds like a lot has changed since then, assuming Forrester isn't messing around in his AMA.",
    "Forrester was consulting producer on 22 episodes of King of the Hill, and wrote the episode 'Peggy's Turtle Song'. He later collaborated with Greg Daniels on The Office.",
    "King of the Hill ended after 13 seasons back in 2010, but its popularity has persisted thanks to its easy availability on Hulu in the US. The series is about the Hill family in the fictional town of Arlen, Texas. Unlike The Simpsons, the show's humor comes from its realism – particularly that of Hank Hill, the family's conservative patriarch, who's constantly faced with scenarios his values system is not equipped to deal with.",
    "The show did age up its characters over the course of its run – so the idea of making the characters 15 years older suits a revival of the series.",
    "In 2018, Hulu landed the exclusive rights to stream King of the Hill. If the show returns, we wouldn't be surprised to see it land there – it's already the home of another '90s animated revival, Animaniacs."
  ],
  "headers": {
    "4": "Why King of the Hill deserves to come back"
  },
  "links": {
    "Reddit": "https://www.reddit.com/r/Screenwriting/comments/m5wa0v/i_am_brent_forrester_tv_writer_the_office_the/",
    "Comic Book": "https://comicbook.com/tv-shows/news/king-of-the-hill-reboot-pitched-fox-tv-greg-daniels-mike-judge/"
  }
}