{
  "source": "https://www.techradar.com/news/star-trek-picard-season-2-is-learning-one-big-lesson-from-season-1",
  "title": "Star Trek: Picard season 2 is learning one big lesson from season 1",
  "category": "entertainment",
  "updated": "2021-04-13T09:46:10Z",
  "author": "samuel-roberts",
  "summary": "Planning is key",
  "article": [
    "Star Trek: Picard drew a mostly positive reception from critics during season 1, but fan opinion seems slightly more mixed, looking at the user ratings on sites like Rotten Tomatoes. Now, executive producer Akiva Goldsman has weighed in on what the producers learned from season 1 that they're taking into the now-filming Star Trek: Picard season 2.",
    "\"Figure out the end earlier,\" Goldsman tells THR. \"If you're going to do a serialized show, you have the whole story before you start shooting. It's more like a movie in that way – you better know the end of your third act before you start filming your first scene.\"",
    "Star Trek: Picard season 1 felt like it had a planned end point – certainly, by ending with the resurrection of Picard in synthetic form in episode 10, it felt like the writers had a plan for Jean-Luc, who was revealed to be dying over the preceding episodes.",
    "Goldsman was asked about fan feedback to the shows, and criticism that Picard and certain seasons of Discovery had been too complicated for fans. \"After season one, I started trying to excavate this Picard idea. But no, I think where our storytelling is complicated, if it is frustratingly so, it's just our own fault for not doing it well enough.\"",
    "Goldsman says that one choice made by the creative team is to ensure the shows are welcoming to fans, regardless of whether they have a history with Trek or not. \"We want to welcome somebody who knows Trek and make it even better because of the things we have, but we don't want to alienate those who don't.\" He notes that knowing the background of Star Trek: The Next Generation still makes watching Picard more fun, of course.",
    "Elsewhere, Goldsman was asked if the original plan to film Picard seasons 2 and 3 back to back was still intact after the pandemic – but he couldn't comment on that.",
    "The big news for Picard season 2, of course, is that actor John de Lancie is reprising his role as Q from TNG – which feels like a larger effort to tie the show back to its predecessor. \"We're now talking about the issues that come up in the last [stage] of your life,\" Goldsman tells THR about bringing Q back to the show. \"We wanted a Q that could play in that arena with Picard.\"",
    "Picard season 2 will apparently deal with themes of \"connectedness\", which is why bringing Q into the show makes sense.",
    "Star Trek: Picard season 2 is officially scheduled for 2022 on Paramount Plus, and is expected to release on Prime Video internationally."
  ],
  "headers": {
    "6": "Q joins Picard"
  },
  "links": {
    "Star Trek: Picard": "https://www.techradar.com/news/star-trek-picard-season-2",
    "Rotten Tomatoes": "https://www.rottentomatoes.com/tv/star_trek_picard/s01",
    "THR": "https://www.hollywoodreporter.com/heat-vision/star-trek-producer-reveals-strange-new-worlds-plan-evolving-q-for-picard",
    "John de Lancie is reprising his role as Q": "https://www.techradar.com/news/star-trek-picard-season-2-trailer-narrows-down-release-date",
    "Star Trek: Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch"
  }
}