{
  "source": "https://www.techradar.com/news/zoom-update-is-finally-adding-live-translation",
  "title": "Zoom update is finally adding live translation",
  "category": "computing",
  "updated": "2021-09-14T03:00:22Z",
  "author": "anthony-spadafora",
  "summary": "Zoom wants to kick off the next era of communication with new features and innovations",
  "article": [
    "At its annual Zoomtopia event, Zoom announced its plans to bring a number of innovations and new features to its video conferencing platform to help kick off the next era of communications.",
    "One such feature that users of the company's video conferencing software have been eagerly awaited is live translation and transcription. With the addition of real-time, automated translation as well as an expansion of Zoom's existing live transcription feature, Zoom meetings will become even more inclusive and the company also revealed that support for multiple languages will be coming next year.",
    "Hybrid and remote workforces rely on collaboration tools to be efficient and productive which is why Zoom plans to further expand access to Zoom Whiteboard. The company's whiteboard will act as a digital canvas that enables seamless, real-time and asynchronous collaboration. Zoom users will also have the ability to interact with the whiteboard in a way that is similar to an in-person experience to create more visually engaging and efficient meetings.",
    "Zoom also revealed new details on its hot desking solution that will be available later this year. Once this feature launches, employees will be able to reserve desks and spaces in their offices suing an interactive map and with easy authentication, they'll be able to bring their personal Zoom experience to any Zoom Room or Zoom Phone appliance.",
    "As part of its future plans, Zoom aims to ensure that Meetings, Chat, Webinars and Phone all work together as one unified communications solution with the ability to easily navigate between them.",
    "To accomplish this, Zoom Chat Huddle View has the potential to provide a visual layout of channels to give teams a sense of connectedness when working from home. Channel members will be able to choose a virtual background of their choice, chat, see who is in the channel and quickly identify if they are busy or available to bring teams together in a whole new way.",
    "Zoom also wants to put its own spin on voicemail with Zoom Phone Video Voicemails. This new feature is designed to provide a more personable alternative to standard voicemails with the ability to leave video messages for colleagues right in their voicemail inbox.",
    "Continuous collaboration is another new feature the company is working on to make it easier to collaborate across tools with tighter integrations across the Zoom platform and third parties. With these planned enhancements, users will be able to share files, recordings and chats from Zoom Meetings to Zoom Chat for easy reference and to collaborate on documents without having to leave the zoom client.",
    "Zoom has laid out its plans for the future but we'll have to wait and see if the company is able to deliver on them at a time when more employees have begun to forego video calls for in-person meetings in the office."
  ],
  "headers": {
    "4": "Video voicemails and continuous collaboration"
  },
  "links": {
    "Zoomtopia": "https://www.techradar.com/news/zoom-is-launching-an-app-store-and-standalone-events",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "transcription feature": "https://www.techradar.com/news/zoom-update-now-lets-you-transcribe-calls-in-real-time",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Zoom Whiteboard": "https://www.techradar.com/news/zoom-just-got-a-whole-host-of-funky-upgrades",
    "hot desking": "https://www.techradar.com/news/covid-has-changed-the-way-we-work-but-are-firms-listening-to-what-employees-want",
    "unified communications": "https://www.techradar.com/best/best-ucaas",
    "voicemail": "https://www.techradar.com/how-to/best-business-voicemail-greetings-how-to-record-a-professional-voicemail",
    "Zoom Chat": "https://www.techradar.com/news/zoom-is-getting-a-makeover-for-the-hybrid-working-future"
  }
}