{
  "source": "https://www.techradar.com/news/realme-gt-5g-is-a-new-android-phone-with-snapdragon-888-coming-next-month",
  "title": "Realme GT 5G is a new Android phone with Snapdragon 888 coming next month",
  "category": "phones",
  "updated": "2021-02-18T09:57:44Z",
  "author": "james-peckham",
  "summary": "It's no longer the Realme Race",
  "article": [
    "The Realme Race has been teased for a while by the Chinese smartphone maker, and the company has now confirmed that this handset will instead be called the Realme GT 5G and that it's being announced on March 4.",
    "Realme has confirmed the phone will launch in China next month, and we're then expecting to hear details of a worldwide release after that. Previously, Realme phones have been available in the UK so we may see it there.",
    "We've yet to see Realme release its smartphones in the US or Australia, so it's uncertain if those living in those countries will be able to get their hands on this new Realme flagship.",
    "Realme hasn't been shy about sharing details of its new flagship phone. The company previously said that its next flagship - which at the time we believed to be called the Realme Race - will feature the top-end Qualcomm Snapdragon 888 chipset.",
    "The company previously confirmed to TechRadar that the phone it set to sport a 6.8-inch 160Hz display with a 3200 x 1440 resolution. It is also said to have a 5,000mAh battery and 125W fast charging.",
    "It'll also come with 12GB of RAM, plus it'll have storage variants of 128GB, 256GB and 512GB. For the camera, you can expect a 64MP main shooter and two 13MP cameras (although we've yet to learn what they'll do).",
    "There will still be lots to learn on March 4, as long as the company doesn't keep revealing this teaser information ahead of its launch.",
    "Via Android Authority"
  ],
  "headers": {
    "3": "What is real?"
  },
  "links": {
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "confirmed to TechRadar": "https://www.techradar.com/news/realme-race-pro-specs-confirmed-and-it-beats-the-samsung-galaxy-s21-ultra",
    "Android Authority": "https://www.androidauthority.com/realme-gt-5g-1201934/"
  }
}