{
  "source": "https://www.techradar.com/news/nubia-red-magic-6-gaming-phone-launches-soon-and-some-features-have-been-teased",
  "title": "Nubia Red Magic 6 gaming phone launches soon, and some features have been teased",
  "category": "phones",
  "updated": "2021-02-22T10:40:46Z",
  "author": "david-nield",
  "summary": "The latest and greatest gaming phone",
  "article": [
    "We've been able to fill in a few more details about the Nubia Red Magic 6 gaming phone thanks to announcements from Nubia itself: first and foremost that the high-powered handset is going to get its official unveiling on March 4.",
    "The date was confirmed by a company exec on Chinese social network Weibo (via GSMArena). March 4 looks like being quite a busy date in the world of smartphones, as we're also expecting the Realme GT to break cover on that day.",
    "The posting also mentioned 'four fastest technologies' (according to a rough English translation), with an attached promo poster showing four separate icons underneath a racing car that's either about to explode or going really fast.",
    "Based on the icons and what we've heard so far about the Nubia Red Magic 6, it seems likely that the 'four fastest' features are the screen refresh rate, the touch response of the display, the battery charging rate, and an integrated cooling fan (enabling extended sessions of high performance from the processor without overheating).",
    "From the gaming phones that Nubia has pushed out so far, including the recent Nubia Red Magic 5G, we're expecting the next in the series to pack in as many high-end components and features as possible – something this new poster would seem to back up.",
    "From what Nubia has teased so far, it looks as though the 4,500 mAh battery on board the phone will come with 120W Gallium Nitride fast-charging support, although this feature is apparently going to be reserved for the Pro model of the phone (with 66W fast charging on the standard edition).",
    "We've also heard a few whispers around a revamped cooling system for the Nubia Red Magic 5G, but details are thin on the ground here. All will be revealed on March 4, and we will of course be covering everything that's announced on TechRadar.",
    "It looks as though 2021 is going to be another busy year for gaming phones. As well as the Nubia Red Magic 6, we're also expecting the Xiaomi Black Shark 4 to launch in the not-too-distant future, while the Asus ROG Phone 5 has been confirmed to be launching on March 10."
  ],
  "headers": {},
  "links": {
    "Nubia Red Magic 6": "https://www.techradar.com/news/key-specs-of-nubia-red-magic-6-officially-teased-ahead-of-the-launch",
    "gaming phone": "https://www.techradar.com/news/best-phone-for-gaming",
    "GSMArena": "https://www.gsmarena.com/nubia_red_magic_6_launch_date-news-47852.php",
    "Realme GT": "https://www.techradar.com/news/realme-gt-revealed-in-first-official-photos-ahead-of-launch",
    "Nubia Red Magic 5G": "https://www.techradar.com/reviews/nubia-red-magic-5g",
    "teased so far": "https://www.techradar.com/news/key-specs-of-nubia-red-magic-6-officially-teased-ahead-of-the-launch",
    "Xiaomi Black Shark 4": "https://www.techradar.com/news/xiaomi-black-shark-4-and-4-pro",
    "Asus ROG Phone 5": "https://www.techradar.com/reviews/asus-rog-phone-5"
  }
}