{
  "source": "https://www.techradar.com/news/when-netflix-cancels-a-tv-show-it-can-feel-unfair-why-is-that",
  "title": "Why it feels unfair when Netflix cancels your favorite TV show",
  "category": "entertainment",
  "updated": "2021-05-12T16:33:22Z",
  "author": "samuel-roberts",
  "summary": "It's hard to tell when Netflix has a hit or flop on its hands",
  "article": [
    "It's happened to so many of us: you get invested in a Netflix show, you binge every episode, and then it gets cancelled. My first taste of that was the peerless American Vandal – a show that ambushed me by being the best, freshest comedy I'd watched since It's Always Sunny in Philadelphia, before being cruelly struck down after two seasons.",
    "Still, if I was prepared to drop my standards and watch The Ranch with Ashton Kutcher, I had 80 whole episodes to enjoy.",
    "Despite being a global leader in TV production and distribution these days, then, Netflix's decision-making can seem as cruel as any traditional TV network. A show can find itself at the top of the most-watched lists in the UK or US and still end up on the scrapheap. In the case of GLOW, it can even get nominated for four Emmys, receive widespread acclaim and still go away.",
    "Last week, it was revealed that Sherlock Holmes-adjacent drama The Irregulars won't be coming back for a second season. At the end of April, Netflix confirmed that the fifth season of historical drama The Last Kingdom will be its last. In late April, too, Katherine Ryan's sitcom The Duchess was confirmed to be axed by its star after one season – despite Ryan explaining that around 10 million people had watched it in its first 28 days.",
    "These aren't really connected events, but they do ask the question of why Netflix cancels a show, and what it counts as a hit – or a failure. Below, we'll dig into how Netflix shares its data, what we can learn about why a show gets cancelled from other sources, and why it seems unfair when Netflix axes a series.",
    "From the outside looking in, Netflix's cancellations differ to those of traditional TV networks because of how it shares its data about individual shows. It doesn't, most of the time – unless it's boasting about the success of a new or returning series to shareholders. That's why in its most recent letter to investors, Netflix touted that Cobra Kai season 3 was watched by 45 million households in its first month, or that mother/daughter comedy Ginny & Georgia was checked out by 52 million households.",
    "You tend to learn about the successes, then, but not necessarily the failures. It means it's hard to grasp Netflix's internal criteria for whether a show has performed well or not – or indeed, what the reasons are when a series doesn't get renewed.",
    "Netflix notably changed its criteria of what counts as a household watching a show back in early 2020 to just two minutes. \"Chose to watch and did watch for at least 2 minutes – long enough to indicate the choice was intentional – is the precise definition,\" is how it describes this metric. So, 45 million households watched the third season of Cobra Kai for at least two minutes (and hopefully more, if they've got any taste in good TV).",
    "Traditional US TV networks, by comparison, use Nielsen ratings as a broadly-held industry standard. This basically means a sample size of American viewers is used to determine the overall success of a series, or its share of the total audience – as of October 2019, that sample was 40,000 households of around 100,000 viewers, according to The Hollywood Reporter (Nielsen's exact methodology is explained here).",
    "Not all decisions about the future of a TV show are made based on Nielsen ratings. Syndication or streaming deals might also be a factor, or how a show performs on a repeat viewing. But traditionally speaking, at least, you could understand the logic of a low-rated network show being cancelled – the data is publicly available for consumption and analysis. With Netflix, it's more of a mystery, and we end up looking elsewhere for insight.",
    "How we find out that these shows have been cancelled is also a point of frustration. Hollywood trade publications tend to get the news – Deadline revealed that The Irregulars was cancelled, for example, rather than Netflix's own (extremely active) social media channels. We're left to guess that the series' limited popularity was a factor, rather than knowing exactly why it went away.",
    "Sometimes we do learn the reason – for axed Netflix shows The Society and I Am Not Okay With This, escalating budget costs post-pandemic were reportedly a factor.",
    "The Irregulars' cancellation, though, is pretty light on details if you're a fan and you want to learn why it got the chop. The timeframe was arguably abrupt, too: The Irregulars debuted on March 26. By May 5, the news of its cancellation was widespread. There's no doubt Netflix has the data to understand why that was the right decision – but it basically means that the only window that mattered for that show to be renewed was its opening month.",
    "What happens if a show truly catches on a year or so down the line, or finds a cult audience over time? The message is, it doesn't seem to count, based on The Irregulars' axing. Still, quick cancellations are certainly not unique to Netflix, and long pre-date the existence of streaming services. But in theory, a streaming service has the power to keep a series in circulation forever, and the shelf life has the potential to be longer.",
    "The key question for The Irregulars is, could it be called a hit? Netflix itself didn't reveal how the show performed, but a number of third-party sources have. Nielsen, which only measures streaming in the US, says that The Irregulars was watched for 643 million minutes over the course of its second week, ending April 4. That was the top show of that week on all the streamers it measures.",
    "That's more than Disney Plus's high-profile Marvel show The Falcon and the Winter Soldier, which garnered 629 million minutes from US viewers – of course, that show is released weekly, whereas The Irregulars dropped with all eight rather long episodes at once.",
    "So that comparison isn't too useful. And since we don't know how it performed internationally, or what Netflix's criteria for a successful series is, we can't take Nielsen's data as evidence it was a hit, despite it being number one in this particular chart.",
    "Let's look at another source for info. Reelgood, which measures the viewing habits of 2 million registered US users, puts The Irregulars' popularity below recent Netflix hits like The Queen's Gambit and Bridgerton in its first four weeks of availability. On its first week, for example, Reelgood said The Irregulars had 3.7% 'streaming and engagement share' among its users, compared to 5.4% for The Queen's Gambit. By its fourth week, The Irregulars had dropped to only 1.2%. The Queen's Gambit, meanwhile, actually grew to 5.7% on week four. That suggests it didn't have a long tail with viewers.",
    "Again, that's just an audience sample from one country – but it shows that being number one on Netflix's charts at release doesn't necessarily make a series an automatic hit.",
    "Netflix's way of releasing shows is very satisfying – new seasons drop globally, at once, for everyone to enjoy simultaneously. This is a great thing in terms of access, and a far cry from the age of staggered global releases based on the whims of local broadcasters.",
    "It also means that disappointment is arguably amplified when a show gets axed. Netflix has a massive platform, with more than 207 million paid global subscribers – if a show reaches some level of popularity but still gets cancelled, that's still a lot of people who can potentially get upset at the same time.",
    "That sounds arbitrary, but it's pretty different to how traditional TV works, where you can't rely on everyone around the world to see the same thing at the same time.",
    "For example, I was quite excited about checking out the AMC series Lodge 49, starring The Falcon and the Winter Soldier's Wyatt Russell. The first season is streaming on Amazon Prime Video in the UK, but I can't watch the second on there. The show was cancelled back in 2019 after those two seasons – seemingly, only US viewers watching it on cable at the time it aired could affect the outcome.",
    "If Lodge 49 was a Netflix show, it would've released in the UK at the same time it landed in the US. There might be a British contingent of fans who liked the series. That might've mattered to Netflix, as a service that calculates popularity by 'member households' around the world.",
    "With Netflix being a global platform, I think the relationship to the shows we love feels slightly different. For one, you're paying directly for the service. When you watch something for multiple episodes, that counts as an endorsement – and TV shows are all about your investment as a viewer. If you commit the time to watching something that you're led to believe is the hot new thing, then it doesn't get the second season it might've needed to reach its full potential, it doesn't feel great.",
    "It might be a reality of business, but it's certainly made me more likely to commit to watching a limited series than an ongoing show.",
    "Ultimately, Netflix isn't really any more or less fair than other broadcasters when it comes to axing series – it's all about what its criteria and priorities are. The difference is, by scale, even a minor hit on Netflix feels like it has a greater cultural impact than a show on a more obscure streamer.",
    "It's simply the double-edged sword of how Netflix does things. At its best, we're all ingesting Tiger King at the same time. At its worst, it might mean it feels rough when your favorite series gets canned."
  ],
  "headers": {
    "5": "Netflix's way of sharing data is limited",
    "10": "The Irregulars as a case study for cancellation",
    "19": "Netflix's global reach is a factor in the fan reaction"
  },
  "links": {
    "GLOW": "https://www.techradar.com/news/netflix-cancels-glow-after-renewing-it-for-season-4-and-fans-are-not-happy",
    "The Irregulars won't be coming back": "https://www.techradar.com/news/netflix-has-cancelled-the-irregulars-so-what-went-wrong",
    "Cobra Kai": "https://www.techradar.com/news/cobra-kai-season-4",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-news/tv-ratings-explained-a-guide-what-data-all-means-1245591/",
    "here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9499658357541917000&xs=1&url=https%3A%2F%2Fwww.nielsen.com%2Fus%2Fen%2Fabout-us%2Fpanels%2Fratings-and-families%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhen-netflix-cancels-a-tv-show-it-can-feel-unfair-why-is-that",
    "Deadline": "https://deadline.com/2021/05/the-irregulars-sherlock-holmes-detective-drama-canceled-netflix-1234749852/",
    "The Society and I Am Not Okay With This": "https://www.techradar.com/news/netflix-cancels-one-of-its-best-shows-of-2020-for-a-surprising-reason",
    "says": "https://www.hollywoodreporter.com/tv/tv-news/irregulars-no-1-nielsen-streaming-march-29-april-4-4175935/",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place"
  }
}