{
  "source": "https://www.techradar.com/news/this-alienware-aurora-with-an-rtx-3070-is-just-dollar1499-surprisingly-good-value",
  "title": "This Alienware Aurora with an RTX 3070 is just $1,499 - surprisingly good value",
  "category": "computing",
  "updated": "2021-02-03T11:58:44Z",
  "author": "alex-whitelock",
  "summary": "Something you don't see every day with Alienware",
  "article": [
    "Alienware and value are two words that don't normally pair together, but hear us out - we've spotted a fantastic gaming PC deal in the form of this Aurora Ryzen Edition R10 for just $1,499.39.",
    "Not only is this premium machine rocking a $390 price cut, but it's coming with an RTX 3070, AMD Ryzen 7 3700X, 16GB of RAM, and a 512GB SSD - fantastic specs for enthusiast level gaming that'll get you maxing out those games at great frame rates.",
    "A few years ago, we'd always advocate building your own gaming PC for maximum value. Right now, however, the worldwide shortage of GPUs has meant that cheap graphics card deals are rare as hen's teeth these days, with some of the higher-end Nvidia and AMD cards fetching truly stratospheric levels.",
    "Seriously though, a quick scan on eBay and Amazon for these parts shows prices that will set you back $1,100 for the RTX 3070 and Ryzen 7 alone right now. In context, suddenly this Alienware gaming PC deal starts to look like great value - something that almost seems unbelievable considering how premium this brand is.",
    "Being a premium brand, you're also going to get a great case here with effective cooling and very neat and tidy cable management. These new Alienware cases also feature a modular tool-less design inside as well, so upgrading is extremely convenient down the line.",
    "Not that you'll need to upgrade for some time with this Alienware Aurora, however. That RTX 3070 alone should see you through for a few good years down the line and the Ryzen 7 is still a very capable CPU indeed. Subsequently, this Alienware gaming PC deal looks like a winner if you're looking to upgrade in early 2021.",
    "Not in the US? See the best Alienware deals in your region just below.",
    "For those looking for something a little more mobile, we've got a separate article on the best Alienware gaming laptop deals with prices across the entire range."
  ],
  "headers": {
    "7": "More great Alienware deals today"
  },
  "links": {
    "for just $1,499.39": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3461850533753357300/https://deals.dell.com/en-us/mpp/productdetail/7d7n",
    "cheap graphics card deals": "https://www.techradar.com/news/best-graphics-card-deals",
    "for these parts": "https://www.ebay.com/sch/i.html?_from=R40&_trksid=p2380057.m570.l1313&_nkw=RTX+3070&_sacat=0&mkevt=1&mkcid=1&mkrid=711-53200-19255-0&campid=5337827784&customid=trd-us-1277785523680683300",
    "Alienware gaming laptop deals": "https://www.techradar.com/deals/best-alienware-gaming-laptop-deals-prices"
  }
}