{
  "source": "https://www.techradar.com/news/samsung-the-wall-microled-tv",
  "title": "Samsung The Wall TV: what you need to know",
  "category": "televisions",
  "updated": "2021-01-07T16:45:42Z",
  "author": "nick-pino",
  "summary": "Samsung’s modular MicroLED TV promises to put OLED in its place",
  "article": [
    "Samsung's The Wall has been a titan of the tech expo circuit in the past few years. First debuted at Samsung's First Look event at CES 2017, and releasing in varying sizes and iterations in the years since, it's only now that Samsung's modular MicroLED display is starting to feel close to a reality for many home cinema enthusiasts.",
    "First releasing in a 146-inch size, and later in a 292-inch iteration, it's only now in 2021 that we're seeing the set come to more reasonable and commercial sizes. Ahead of CES 2021, Samsung announced a new version of The Wall that would be available in sizes as small as 88 inches – with a screen-splitting video feed feature to help viewers make use of the expansive display.",
    "MicroLED has been touted as a meaningful competitor for OLED, given both technologies are self-emissive – MicroLED having millions of self-emissive LEDs, and OLED having self-emissive pixels, which in both cases leads to exemplar brightness control and contrast.",
    "The technology isn't widely used, but Samsung is certainly making a case for bringing a MicroLED TV into your home with The Wall – with the freedom to create configurations and aspect ratios for your specific home and needs. Here's what we know about the exciting TV range so far.",
    "We're very interested in what Samsung will deign to sell its The Wall models for, given its been quite guarded about prices in the past.",
    "Estimates put the 146-inch model's cost at around $100,000 (around £73,500 / AU$129,000), but the personalized nature of MicroLED's modular design and the need for professional installation has muddied the waters around what shoppers can expect. We're hoping this increased standardization of sizes will lead to more clarity about pricing and the set configurations The Wall will be available in.",
    "Before we talk about the TV itself, we should first run through what, exactly, MicroLED stands for, and why it’s so crucial to this TV.",
    "MicroLED (also referred to as micro-LED, mLED, and µLED) is a technology that shrinks traditional LEDs to a smaller size, and gives them the ability to produce their own light. Think OLED (organic LED), but take out the organic part.",
    "MicroLED doesn’t require a discrete backlight, and there’s no need for LCD shutters. In turn, this creates a brighter, more contrast-rich television that can turn pixels off individually.",
    "When pressed about the differences between OLED and MicroLED, one Samsung spokesperson after another had the same response: MicroLED has all of the things you love about OLED with none of the tradeoffs.",
    "Specifically, what Samsung is trying to impress on journalists is that the TV has no Everything else problem with handling contrast or black levels, and yet retains the bright, high dynamic range-friendly whites of traditional LED screens.",
    "Of course, OLED's other issue – as with plasma TVs before it – is image burn-in. According to Samsung, because The Wall uses a non-organic substrate, it should never have that problem. Ever.",
    "But perhaps the neatest feature of MicroLED is that The Wall can be connected to other identical models to form ever-bigger screens. According to Samsung, there’s currently no limit to the size of the modular TV you can create, and although signal degradation will occur at a certain point, the spokespeople we talked to said they haven’t seen that happen yet.",
    "The Wall is one of the most fitting names for a TV we may have ever encountered. While most manufacturers might use a scrambled mess of numbers and letters, Samsung has hit the nail on the head with its name.",
    "The Wall, if you haven’t guessed already, is massive. In fact, after seeing it in person the first time, it was hard to imagine it fitting in anyone’s home – even if Samsung is learning how to make the technology more compact. It's still nowhere near a flagship 55-inch size, though.",
    "The Wall is bezel-free, too – it’s edge-to-edge glass. The design decision behind this, we were told, is that when the The Wall is set up next to other units it will look like one seamless image, rather than two TVs working in tandem with bezels interrupting the image.",
    "The modular design also means you can customize the exact shape of the television during installation – part of the reason Samsung has been reluctant to share pricing details in the past. If you're dying for a 4:3 aspect ratio, this is the way to do it – though we expect most buyers will still cleave close to a 16:9 or 21:9 display to cater to the most common forms of TV and film content made today.",
    "If you want to keep several channels on at the same time, too, you can even split the screen into two, three, or four video feeds – ideal for keeping an eye on a smart security camera while you binge Bridgerton, listening to match commentary while the football's on, or plugging in four games consoles and playing on every one simultaneously (this was in the 2021 promo video, yes). You can even adjust the volume for each section.",
    "We have cloud-gazing thoughts about modular TVs you can separate and move into different rooms, but issues with weight, portability and installation will likely keep that from being a reality for quite a while yet.",
    "You're getting 24 million self-emissive LEDs in the 110-model, too, which may not quite have the same precise control as the 33 million self-emissive pixels of a 4K OLED, but should be impressive just the same.",
    "In terms of audio, The Wall uses something Samsung calls Arena Sound – which makes use of center-speakers put behind the screen rather than beneath it, allowing for front-firing audio that Samsung says \"travels more freely\".",
    "Before we delve into performance, let’s discuss exactly how The Wall was set up. Because it was a showpiece when we saw it, it was dead-center on the floor, surrounded by security folks, and was stuck playing the same few clips on repeat. While other demos will allow you explore a bit when it comes to content, The Wall was showcasing only the most impressive content.",
    "When we first set our eyes on Samsung's The Wall back in 2017, it was a showpiece, surrounded by security folks, and was stuck playing the same few clips on repeat. Despite this, it was still easy to see the technology's potential.",
    "Just as Samsung promised, The Wall was (at that time) brighter than anything we had ever seen – even brighter than the 1,600-2,000 nit Samsung Q9F QLED TV that was shown off at CES the year before.",
    "Thankfully, it’s not just our eyes bugging out – at the time, Samsung’s VP of TV Marketing, Andrew Sivori, called The Wall “one of the brightest panels Samsung has ever made”. This additional brightness coupled with MicroLED’s ability to drop down to near absolute black made for some stunning images.",
    "It's obviously been a few years since then, but the basics of the technology were impressive even in 2017, and Samsung has only been honing The Wall in that time.",
    "While we need to hold off on making any definitive claims about this year's iteration of The Wall TV until we put one through our tests for a review, it's certainly getting hard to ignore MicroLED as an incoming panel technology, or The Wall as a display for those after a unique home cinema experience."
  ],
  "headers": {
    "4": "Samsung The Wall pricing",
    "6": "First off, what exactly is MicroLED?",
    "13": "The Wall: design and features",
    "21": "First impressions and early verdict"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "as small as 88 inches": "https://www.techradar.com/news/samsung-has-a-microled-tv-that-can-split-into-four-different-screens",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "OLED and MicroLED": "https://www.techradar.com/news/microled-vs-oled-the-battle-of-the-high-end-display-tech",
    "4:3 aspect ratio": "https://www.techradar.com/news/as-new-netflix-movies-stream-in-43-is-there-hope-yet-for-the-abandoned-aspect-ratio",
    "Bridgerton": "https://www.techradar.com/news/new-tv-shows-2021-what-to-watch-on-netflix-disney-plus-and-more-before-the-year-ends"
  }
}