{
  "source": "https://www.techradar.com/news/ubisoft-still-undecided-on-whether-itll-raise-ps5-and-xbox-series-x-game-prices",
  "title": "Ubisoft still 'undecided' on whether it'll raise PS5 and Xbox Series X game prices",
  "category": "gaming",
  "updated": "2021-02-10T17:22:39Z",
  "author": "vic-hood",
  "summary": "Will we see Ubisoft games costing $70 in the future?",
  "article": [
    "Ubisoft has revealed that it is still undecided on whether to raise the price of its PS5 and Xbox Series X games.",
    "During a recent third-quarter earnings call (via VGC), the publisher was asked whether it plans to increase the price of its AAA games to $70 during its next fiscal year (running April 2021 to March 2022).",
    "\"In terms of pricing, we’ve been analyzing the competitive dynamics of the past quarter and we are still looking at new opportunities, but we have not made any decision yet,” chief financial officer Frédérick Duguet said.",
    "The release of the PS5 and Xbox Series X has seen several game publishers hiking the prices of their games on these platforms to around $70/£60 – that's $10 /£10 more than their prices on PS4 and Xbox One.",
    "2K Games was the first to commit to this next-gen pricing, revealing in mid-2020 that NBA 2K21 would cost $70 on PS5 and Xbox Series X. We've seen other publishers follow suit, with Sony setting this RRP on new PS5 games Demon's Souls and Destruction AllStars.",
    "Ubisoft previously claimed in an earnings call in July 2020 that it wouldn't be raising the prices of its PS5 and Xbox Series X games released during the console launch period. However, according to Bloomberg's Jason Schreier, the publisher wouldn't commit to an answer on whether a price hike would occur after this period, saying: \"We are concentrating on the Christmas releases. We have decided those games will be launched at $60\".",
    "With Ubisoft still undecided on whether it will price hike it's future games, it remains to be seen how much upcoming games such as Beyond Good and Evil 2 and Skull & Bones will cost.",
    "However, Ubisoft's next big release Far Cry 6, which is due to release later this year, is still available for pre-order at $60/£50.",
    "While the price of the likes of GPUs, broadband and streaming services have increased over the years (often to correlate with inflation, rising costs and demand), the price of games has remained stagnant for years. Meanwhile, next-gen game production costs have increased between 200% and 300% (depending on factors like the studio and game).",
    "\"Even with the increase to $69.99 for next-gen, that price increase from 2005 to 2020 next-gen is only up 17%, far lower than the other comparisons,\" IDG President and CEO Yoshio Osaki told GamesIndustry.biz in 2020. \"While the cost of development and publishing have gone up, and pricing in other entertainment verticals has also gone up substantially, next-gen software pricing has not reflected these increases. $59.99 to $69.99 does not even cover these other cost increases completely, but does move it more in the proper direction.\"",
    "It remains to be seen whether Ubisoft will increase its AAA game prices in the next year, but it's likely this price hike wouldn't come in until the new fiscal year begins in April 2021."
  ],
  "headers": {
    "3": "A change of tune",
    "8": "Why the increase?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "VGC": "https://www.videogameschronicle.com/news/ubisoft-claims-its-undecided-if-it-will-raise-game-prices-to-70-in-2021/",
    "NBA 2K21 would cost $70": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-could-get-a-major-price-hike",
    "new PS5 games": "https://www.techradar.com/news/new-ps5-games",
    "Demon's Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Destruction AllStars": "https://www.techradar.com/news/ps5s-destruction-allstars-proves-the-dualsense-microphone-was-an-awful-idea",
    "Beyond Good and Evil 2": "https://www.techradar.com/news/beyond-good-and-evil-2",
    "Skull & Bones": "https://www.techradar.com/news/skull-and-bones-release-date-news-and-trailers",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "GamesIndustry.biz": "https://www.gamesindustry.biz/articles/2020-07-02-idg-other-publishers-are-considering-raising-game-prices-for-ps5-and-xbox-series-x"
  }
}