{
  "source": "https://www.techradar.com/news/psvr-2-could-overcome-its-biggest-hurdle-thanks-to-sonys-new-oled-display-tech",
  "title": "PSVR 2 could overcome its biggest hurdle thanks to Sony's new OLED display tech",
  "category": "gaming",
  "updated": "2021-12-09T10:44:18Z",
  "author": "adam-vjestica",
  "summary": "'The OLED microdisplay technology is expected to be used in the entertainment field'",
  "article": [
    "Sony Group has shown off a new head-mounted display (HMD) that uses OLED microdisplay technology to deliver more realistic visuals – and it might be used in the company's upcoming PSVR 2 headset.",
    "As part of its ‘Sony Technology Day’, the company revealed it’s been working on a low-latency HMD that can display a 3D space without any pixelation. Each lens features a 4K, OLED microdisplay, which promises to double the number of dots compared to smartphone OLEDs and is almost 20 times smaller in size.",
    "Sony’s new HMD also includes low-latency compensation, which means it should stop users from feeling motion sick, which is a common complaint about VR gaming in general. Comfort is another sticking point when it comes to virtual reality headsets, but thanks to its new OLED microdisplay technology, Sony should be able to produce smaller and lighter head-mounted displays in the future.",
    "One of the biggest criticisms of the original PSVR was that it suffered from poor image quality, meaning games looked extremely pixelated and ran at a low resolution. This would naturally pull players out of the experience, which when you’re trying to convince someone they’re in virtual reality, isn’t ideal.",
    "Users were also susceptible to motion sickness, which wasn’t helped by the PSVR’s low frame rates and rather bulky design.",
    "Even though the PSVR 2 might not include 4K displays for each eye due to cost, a high-end VR headset would certainly be appealing. Valve has shown that demand for premium VR experiences definitely exists, as the Valve Index has seemingly sold well, despite its high price tag.",
    "We’re expecting the PSVR 2 to deliver a superior experience to the original headset, particularly as VR technology has come a long way since the PS4 generation. The power of the PS5 will also help the PSVR 2 deliver more graphical fidelity and higher framerates than what was previously possible.",
    "There’s no official release date yet for the PSVR 2, which was confirmed to be in development earlier this year, but we suspect it might launch sometime in 2022 (perhaps in the lead-up to the holidays)."
  ],
  "headers": {
    "3": "Analysis: the PSVR 2 could be a high-end headset"
  },
  "links": {
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review"
  }
}