{
  "source": "https://www.techradar.com/news/2022-could-see-biggest-change-ever-for-android-smartphones-but-you-wont-even-notice-it",
  "title": "2022 could bring the biggest change ever for Android smartphones, but you won’t even notice it",
  "category": "pro",
  "updated": "2021-11-27T16:46:46Z",
  "author": "desire-athow",
  "summary": "A new breed of processors is expected to land inside Chinese smartphones",
  "article": [
    "You've probably never heard of RISC-V, but this is an exciting new hardware development fostered primarily by the Chinese government to reduce domestic reliance on CPUs and GPUs from Western technology companies.",
    "On the outside, end users won't notice anything, but RISC-V will almost certainly have an impact on the global smartphone market as early as 2022 as more vendors adopt the open hardware philosophy.",
    "At the forefront of RISC-V development is Chinese company Sipeed, which revealed earlier this month that it was already running Android 10 on an Alibaba/T-Head RISC-V platform, the open-sourced XuanTie C910.",
    "Before we get all excited, just bear in mind that the platform has only been shown running Android 10. Nothing yet on Android 12, which is already mainstream.",
    "What’s more, this is based on a dual-core processor, clocked at 1.2GHz, with a Vivante 3D GPU and 4GB LPDDR4, which means that it is probably going to target the entry level segment of the market (i.e. cheap smartphones).",
    "Still, Sipeed suggesting that a “RV64 phone will come next year” is good news in the spirit of competition. Tuxphones reports that the RISC-V phone should be more powerful than some quad-core A73 processors, which would put it directly against the Qualcomm Snapdragon 663 or 662, both launched in 2020.",
    "Two big questions remain, though: where will Sipeed get the IP to build the accompanying 5G or LTE radio technology and why would anyone choose to go for RISC-V rather than sticking with Arm? Much of it may be down to the increasing influence of the Chinese government on the domestic technology ecosystem.",
    "It was not long ago (well, almost 10 years) that a company called Ainovo released an RISC-V Android tablet with an unfortunate name, the Ainol Novo 7. It was reviewed back then on ITProPortal, and while it was half-baked, the prototype was promising.",
    "It ran Android 4.0 Ice Cream Sandwich, was expected to cost only $100, and was powered by an Ingenic Semiconductor JZ4770. Sadly, it never really caught up as ARM raced towards world domination."
  ],
  "headers": {
    "7": "A RISC-V tablet from yesteryear"
  },
  "links": {
    "RISC-V": "https://www.techradar.com/news/risc-v-breaks-into-the-mainstream-to-go-toe-to-toe-with-arm",
    "CPUs": "https://www.techradar.com/news/best-processors",
    "GPUs": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "XuanTie C910": "https://www.techradar.com/news/alibabas-new-16-core-cpu-will-challenge-intel-xeon-in-datacenters",
    "cheap smartphones": "https://www.techradar.com/best/best-cheap-phones",
    "RV64 phone will come next year": "https://twitter.com/SipeedIO/status/1457529282134089734",
    "Tuxphones": "https://tuxphones.com/sipeed-rv64-first-risc-v-rv64-phone-linux-2022-2023/",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "reviewed back": "https://www.itproportal.com/reviews/tablets/preview-ainovoainol-novo-7-basic-tablet/"
  }
}