{
  "source": "https://www.techradar.com/news/razers-latest-rgb-gaming-product-made-me-realize-im-out-of-touch",
  "title": "Razer's latest RGB gaming product made me realize I'm out of touch",
  "category": "gaming",
  "updated": "2021-12-08T16:10:49Z",
  "author": "jess-weatherbed",
  "summary": "Mobile gaming almost passed me by",
  "article": [
    "Razer has announced the Razer Phone Cooler Chroma, a small fan that can be connected to either iPhone or Android smartphones (dependant on the configuration you purchase) to keep your device at a reasonable temperature during intense gaming sessions. And of course, as it's a Razer product it's slathered in edgy RGB lighting.",
    "When I saw this myself I admit that I was initially very dismissive. The entire thing feels like a gimmick, something marketed to kids who just want something 'shiny' to attach to their phone. Clearly, I forgot that I was the target demographic as someone who plays games on my mobile device, albeit mostly with low-demand titles like Legends of Runterra and Pokémon Go.",
    "Mobile gaming is frequently dismissed despite being the most popular hardware platform for games - and not by a small margin. According to TechJury, there are 2.7 billion gamers worldwide in 2021, of which 2.4 billion are mobile game players, which means 88.9% of gamers use a mobile device either alongside or instead of a console or gaming PC. You can even get gaming phones these days that are better optimized for the job.",
    "Gaming hardware isn't cheap, and for many, a mobile phone is all you need to enjoy games. PUBG Mobile, Minecraft and Call of Duty: Mobile – Garena are all better known for their PC or console counterparts, but the incredibly high player numbers for these games show that folk are more than happy to play something other than low-demand puzzle games like Candy Crush.",
    "Mobile gamers are often excluded or even ridiculed for their platform choice, which just feels...crap. Buying dedicated gaming consoles, laptops or PC components is horrendously expensive, especially now in the midst of the global chip shortage which has seen elusive hardware snapped up by bots and scalpers to resell for an inflated price. While some might willingly choose to play mobile games for their convenience, there are also those in that 88.9% who simply can't afford to game on anything else.",
    "Gatekeeping what makes a 'gamer' isn't it for me, so I quickly re-evaluated myself and took another look at this Razer phone fan with a fresh perspective.",
    "I do occasionally play Genshin Impact on my aging Huawei Mate 20 Pro, and things can get a little toasty after around 30 minutes or so. That's actually one of the main reasons I started to play it on PC over my mobile phone, so I can immediately see why someone without access to other means to play games would want to keep their phone cool.",
    "Not only that, but it would feel hypocritical of me to mock a phone fan for having RGB lighting when I'm typing this on my Razer RGB keyboard, with my Razer RGB gaming mouse...If I, a PC gamer, get flashy peripherals then who was I to laugh at a cool-looking phone accessory?",
    "The Razer Phone Cooler Chroma is available in two models, a MagSafe version for supported iPhones and a universal Android model that uses an adjustable clamp. The Android one is unsurprisingly less attractive than the MagSafe model, but there's not much to be done about that. You can grab one for $60 (around £45 / AU$85), though it only appears to be available on the US store right now.",
    "In regards to the actual cooling performance, we're unable to test it right now but it features a single fan with seven blades that can spin up to 6400 RPM, a thermoelectric cooler, and an aluminum heat sink designed to pull heat from your phone. Knowing how toasty mobiles can get, and with more demanding games being released each year like League of Legends: Wild Rift, phone coolers could become more mainstream.",
    "That doesn't mean that Razer is entirely off the hook, as I can see a glaring issue with the Razer Phone Cooler Chroma – it needs to be plugged in to work. Yep, no battery power here, which is a real shame given one of the biggest perks of gaming on a mobile device is the, uh, mobility.",
    "It also looks very clunky so it's unlikely to be comfortable to use with your phone, and you're unlikely to be able to use it alongside other Razer mobile accessories like the Kishi or Raiju. It's a neat concept, but let's hope that better solutions are in development.",
    "Dependency on physical hardware could soon be a thing of the past, which will also push more people into playing games on their phones or tablet devices. Thanks to cloud gaming, you might be paying a monthly subscription to a streaming service rather than dropping a stack of cash on degradable consoles and gaming PCs, which would help to destigmatize mobile gaming.",
    "For the skeptics, we've tested a few of these services like Nvidia GeForce Now and were shocked at how far things have developed. I was able to stream The Witcher 3 to my phone with almost no noticeable delay, and it worked just as well for everything on my Steam library. Competitive titles like first-person shooters still need some development as you're at a disadvantage, but I doubt it will take long to close the gap.",
    "I fully expect that in ten years' time, providing public WiFi infrastructure has developed sufficiently, we could all be streaming our favorite games to our mobiles during a commute or on our lunch breaks. I expect that mobile gaming accessories will have also been better optimized by this point, but here's hoping that they still have RGB lighting so I can cling to the idea of being 'cool'."
  ],
  "headers": {
    "5": "Let's drop gamer gatekeeping",
    "12": "Times are changing"
  },
  "links": {
    "Razer Phone Cooler Chroma": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-1395127463200754200&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fmobile-accessories%2Frazer-phone-cooler-chroma%2FRC21-01790100-R3M1",
    "Pokémon Go": "https://www.techradar.com/news/gaming/pokemon-go-updates-everything-you-need-to-know-about-what-s-coming-next-1330140",
    "TechJury": "https://techjury.net/blog/mobile-gaming-demographics/#gref",
    "Call of Duty: Mobile – Garena": "https://www.techradar.com/news/call-of-duty-mobile-season-8",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "mobile games": "https://www.techradar.com/best/best-android-games",
    "Genshin Impact": "https://www.techradar.com/news/genshin-impact-on-iphone-is-getting-a-feature-it-doesnt-have-on-consoles-or-pc",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
    "League of Legends: Wild Rift": "https://www.techradar.com/news/league-of-legends-mobile",
    "Kishi": "https://www.techradar.com/reviews/razer-kishi",
    "Raiju": "https://www.techradar.com/reviews/razer-raiju-ultimate",
    "cloud gaming": "https://www.techradar.com/news/choosing-the-right-cloud-gaming-service-for-you",
    "Nvidia GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now"
  }
}