{
  "source": "https://www.techradar.com/news/bang-and-olufsens-new-wireless-speaker-looks-just-like-a-book",
  "title": "Bang & Olufsen's new wireless speaker looks just like a book",
  "category": "audio-visual",
  "updated": "2021-04-15T07:00:51Z",
  "author": "olivia-tambini",
  "summary": "A sound addition to your bookshelves",
  "article": [
    "If you want a wireless speaker that will tuck neatly away in your bookcase, the latest model from Bang & Olufsen should do the trick.",
    "The Beosound Emerge has been designed with a slim silhouette, \"taking inspiration from the compact form factor of a book\", which the company says allows it to \"integrate alongside books and other domestic objects\".",
    "Like the Beosound Balance, an architectural speaker that sits on a cylindrical base, the Emerge was created in collaboration with designer Benjamin Hubert.",
    "It features side panels that wrap around the speaker like \"the cover of a book\", while the front of the speaker is embellished with the Bang & Olufsen logo, much like a book's spine is emblazoned with the author's name.",
    "As with other Bang & Olufsen speakers, this latest model makes use of luxurious-looking, tactile materials, including oak wood, pearl-blasted aluminum, and woven textiles.",
    "The user interface can be found at the top of the speaker, with touch-sensitive buttons allowing you to adjust your music playback, while volume can be controlled by making a circular gesture around the control panel.",
    "In spite of its slim build, Bang & Olufsen says the Emerge delivers a \"full-range sound experience\".",
    "That's thanks to a 37mm midrange driver that's mounted at an angle, which emits sounds from the front of the speaker alongside the 14mm soft dome tweeter. Meanwhile, a 100m side-firing woofer allows sound to be \"guided\" to the back of the device, which should help to deliver a wide, room-filling audio performance.",
    "The speaker also comes with active room compensation technology that customizes the sound profile of the Emerge based on how it's placed inside your home – a little like Sonos speakers use Trueplay technology to calibrate their sound. In other words, the Beosound Emerge should sound great whether it's sat at the top of your bookcase, on your kitchen counter, or on your bedside table .",
    "If you want to bolster the sound even further, the Emerge can be paired wirelessly with other connected Bang & Olufsen speakers – or, you can pair two Emerge speakers for stereo sound.",
    "As for connectivity, the new wireless speaker supports Apple AirPlay 2, Chromecast, and will get support for Bang & Olufsen's Beolink multi room connectivity in late 2021. The speaker also has a built-in radio, as well as a microphone for hands-free voice control via Google Assistant.",
    "Aside from its bookish looks, what's interesting about the Beosound Emerge is that it should last you a really long time.",
    "That's because it's packing Bang & Olufsen's replaceable connectivity module, which was first introduced with the Beosound Level. According to the company, this module has been \"front-loaded with enough processing power and connectivity technology to receive new performance updates and features for years to come\".",
    "Bang & Olufsen says that, \"if the connectivity and streaming technology ever becomes outdated, the module can be replaced with the latest technology updates, future proofing the speaker\".",
    "It's an attractive prospect, especially when you consider the high price of the Beosound Emerge. Available in two colors, you can get it in Black Anthracite for $699 / £539 (about AU$900) or Gold Tone for $899 / £699 (about AU$1,150) – much more expensive that other wireless speakers like the Sonos One and the Apple HomePod mini."
  ],
  "headers": {
    "11": "Future-proof"
  },
  "links": {
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Beosound Balance": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1237808754832316200&xs=1&url=https%3A%2F%2Fwww.bang-olufsen.com%2Fen%2Fspeakers%2Fbeosound-balance&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fbang-and-olufsens-new-wireless-speaker-looks-just-like-a-book",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Apple HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini"
  }
}