{
  "source": "https://www.techradar.com/news/oneplus-9-pro-vs-iphone-12-pro",
  "title": "OnePlus 9 Pro vs iPhone 12 Pro: can OnePlus slay another smartphone giant?",
  "category": "phones",
  "updated": "2021-04-24T12:00:03Z",
  "author": "jon-mundy",
  "summary": "Apple and OnePlus send their Pros into battle",
  "article": [
    "Long gone is the time when Apple had the top end of the smartphone market to itself. Modern Android-powered rivals can go toe-to-toe with the latest iPhone on all fronts.",
    "That’s certainly the case with the OnePlus 9 Pro, which matches the mighty iPhone 12 Pro in several key ways, and rather embarrasses it in one or two others.",
    "These are two of the best and most powerful smartphones on the market right now. But which one should you buy?",
    "The OnePlus 9 Pro hit shops on March 30, 2021 with prices starting from $969 / £829 for 8GB of RAM and 128GB of storage. There’s also a 12GB/256GB model that will set you back $1069 / £929.",
    "Apple’s iPhone 12 Pro became available to buy on October 23, 2020. The 128GB model costs $999 / £999 / AU$1,699, with the 256GB model costing $1,099 / £1,099 / AU$1,899, and the 512GB version setting you back $1,299 / £1,299 / AU$2,219.",
    "Allow us to do the math for you: the iPhone 12 Pro is $30 / £170 more expensive than the OnePlus 9 Pro. And yes, that is a weird currency discrepancy, which seems to reflect the fact that OnePlus isn’t yet a fully established pan-global brand.",
    "Indeed, the first win for Apple is the fact that that the iPhone 12 Pro is far more widely available than the OnePlus 9 Pro. Not only will you struggle to find the 128GB model of the OnePlus 9 Pro in the US, but the phone hasn’t even launched in Australia.",
    "While these are two handsome, modern phones, we’d have to give the overall design win to Apple. And the reason for that comes down to freshness.",
    "The OnePlus 9 Pro's design is essentially a subtle rejig of the OnePlus 8 and OnePlus 7 template. You have a nice curved glass display and rear panel, a generic camera module, and a familiar aluminum frame.",
    "OnePlus has tried to mix things up with a new Morning Mist finish (it also comes in Pine Green), which looks a bit like a fogged up mirror. But it doesn’t inject a whole lot of life into a familiar design.",
    "The iPhone 12 Pro, on the other hand, is a considerable departure from the iPhone 11 Pro before it. Gone are Apple’s drab curves, and back in come the square edges and sharp corners of the iPhone 4 era. It comes in Silver, Graphite, Gold, and Pacific Blue.",
    "There’s also innovation on the completely flat front of the phone, with a nano-crystalline Ceramic Shield supposedly making it four times stronger. Too bad the back remains brittle - we contrived to crack it with a drop onto concrete.",
    "Both phones are IP68 certified, so will stand up to reasonable levels of water immersion.",
    "In terms of dimensions, the OnePlus 9 Pro is the bigger device in every way. It measures 163.2 x 73.6 x 8.7mm, whereas the iPhone 12 Pro comes in at 146.7 x 71.5 x 7.4mm. Apple’s phone is also lighter at 189g, as compared to the 197g OnePlus.",
    "It would be even lighter were it not for Apple’s use of a stainless steel frame, rather than the aluminum used in the OnePlus 9 Pro. This is a more premium touch, without a doubt, but it means that the iPhone 12 Pro feels quite dense.",
    "This is one occasion where the iPhone’s physical alert switch can’t be listed as an advantage. OnePlus is pretty much the only other manufacturer to have adopted this feature, and it even adds a third setting to its own switch for separate silent/vibrate options.",
    "Both of these phones have excellent OLED displays, but there’s an obvious front-runner. The OnePlus 9 Pro's screen is bigger, sharper, a tad brighter, and way more fluid.",
    "Despite these overwhelming facts, it’s difficult to fault the iPhone 12 Pro's screen when you actually use it. From its responsive feel to its excellent color calibration, it’s a polished and vibrant display that makes all forms of content look great.",
    "At 6.1-inches, it’s on the smaller end of the modern flagship phone spectrum. Combined with a 1170 x 2532 resolution, though, its picture is nice and sharp, producing 460 pixels per inch, and placing it above so-called FHD+ displays.",
    "Of course, the OnePlus 9 Pro’s screen isn’t one of those FHD+ displays. It goes the whole hog with a 1440 x 3216 (QHD+) resolution which, despite being allied to a larger 6.7-inch canvas, makes for an even denser 525 pixels per inch.",
    "Both phones can get nice and bright in strong sunlight, but again the OnePlus has the edge at 1300 nits compared to the iPhone 12 Pro’s 1200 nits. Both displays have great contrast levels, though, covering 100% of the DCI-P3 color gamut.",
    "The real differentiating factor here is fluidity. The OnePlus 9 Pro can alter its refresh rate from 1Hz to 120Hz using LTPO technology, with a super-fast 360Hz touch sampling rate for gamers. The iPhone 12 Pro is stuck with a deeply ordinary fixed 60Hz screen refresh rate and a 120Hz touch sampling rate.",
    "As we’ve already said, that’s the silkiest and most consistent 60Hz you’ll find in a phone. But it’s still noticeably less slick than the OnePlus 9 Pro.",
    "The biggest fight in any flagship phone face-off these days is for camera supremacy. And there’s an almighty scrap on the cards between these two phones.",
    "Apple has steadily climbed to the top of the photographic tree with its smart color science and consistent, balanced hardware. Sure enough, the iPhone 12 Pro takes awesome images in most scenarios.",
    "It packs a trio of 12MP cameras, covering wide, ultra-wide, and 2x telephoto lengths. It also features a LiDAR scanner for enhanced depth information and solid low light autofocus, not to mention some enhanced AR applications.",
    "The OnePlus 9 Pro employs four cameras: a 48MP wide, a 50MP ultra-wide, an 8MP 3.3x telephoto, and a largely pointless 2MP monochrome sensor.",
    "The iPhone’s main (wide) sensor is accompanied by a bright f/1.6 aperture, so it lets more light in than its f/1.8 OnePlus equivalent.",
    "Both phones have a bundle of distinct photographic tricks up their sleeves. The iPhone 12 Pro can take high quality ProRAW shots, which manage to retain more image data whilst simultaneously applying Apple’s computational enhancements. Apple’s Smart HDR 3 has improved its image processing significantly, too.",
    "The iPhone 12 Pro is also capable of shooting in Apple’s excellent Night mode across all four of its camera, including selfies. The OnePlus 9 Pro can only employ its Nightscape mode on its wide and ultra-wide cameras.",
    "On the other hand, the OnePlus 9 Pro can shoot 12-bit RAW shots through its manual mode. It also supports Digital Overlap HDR (DOL-HDR), which reduces HDR ghosting by shooting its constituent long and short exposure shots extremely close together.",
    "OnePlus also benefits from color tuning assistance by camera specialist Hasselblad. This results in cooler and more naturalistic tones, which you could almost call ‘Apple-esque’. Neither of these phones is for you if you like your photos in Samsung technicolor.",
    "There’s an abundance of photographic jargon here, but the simple truth is that both phones can take excellent shots in a variety of situations. The iPhone 12 Pro is arguably the better point and shoot camera, with more consistent and reliable shots across its entire camera range. It’s also an all-round better, more flexible night time shooter.",
    "The OnePlus 9 Pro whiffs more shots than its rival, but it still impressed us in full auto. And it does give you more manual control potential with its excellent Hasselblad-enhanced Pro mode.",
    "On the video front, Apple has long held an advantage over its rivals, and that continues with the iPhone 12 Pro. This time around it adds Dolby Vision video recording, which boosts the tone and dynamic range of your footage at 4K and 60 frames per second.",
    "In the opposite corner, the OnePlus 9 Pro swings back with 8K video at 30fps and 4K video at 120fps. But Apple retains the video crown for sheer quality.",
    "It’s tricky comparing performance levels between the latest iPhone and any modern flagship Android phone, because they run on operating systems that utilize resources very differently.",
    "What we can say is that both the iPhone 12 Pro and the OnePlus 9 Pro run on the very best hardware that’s available to them. The iPhone 12 Pro runs on Apple’s custom A14 Bionic chip, while the OnePlus 9 Pro uses Qualcomm’s Snapdragon 888. Both are speedy 5nm chips, but Apple’s ahead of the game on raw processing power.",
    "Yes, the OnePlus 9 Pro offers 8GB or 12GB of LPDDR5 RAM compared to the iPhone 12 Pro’s 6GB. But that’s negated by those OS differences we mentioned above.",
    "The difference can be seen in things like the Geekbench 5 benchmark tool, where the iPhone 12 Pro scores around 3,900 in multi-core and 1,600 in single-core. The OnePlus 9 Pro, by contrast, scores around 3,600 in multi-core and 1,100 in single-core.",
    "But it’s in the GPU category that Apple’s A14 Bionic really builds a lead, with benchmark results that tend to hammer its Snapdragon-driven opponent.",
    "How much will this actually mean to you in practical terms, though? Very little we suspect. Both phones can play all the latest high-end games at full pelt, and both fly through general tasks without a stutter.",
    "But we’d argue that Apple’s power advantage, in conjunction with its history of superior legacy support, means that the iPhone 12 Pro will stay feeling fast for longer.",
    "Apple also gives you more storage options. Both phones come in 128GB and 256GB flavors, but the iPhone 12 Pro can also be had in 512GB form. Neither has memory expansion.",
    "Both phones run on fast, fluid operating systems. Apple’s iOS is arguably more tightly integrated with its hardware, given its home-brewed status, while OnePlus has to utilize and modify Google’s Android.",
    "In practice, though, OxygenOS is one of the smoothest and most appealing Android skins in the business, and there’s barely a hint of friction whilst moving through the UI. We’ve been encountering the odd bug, but you’ll also find such things in the latest version of iOS. You’ll also find OxygenOS to be far more customizable than iOS.",
    "The OnePlus 9 Pro packs a 4,500mAh battery, which is significantly larger than the 2,815mAh battery of the iPhone 12 Pro.",
    "However, like those performance considerations, it’s impossible to draw conclusions based on a simple spec comparison. Android and iOS utilize their resources in a very different way, with iOS traditionally being the more frugal of the two.",
    "Then there’s the fact that the OnePlus 9 Pro has a bigger, sharper, higher refresh rate display, which is a much more power-hungry component than the iPhone 12 Pro equivalent.",
    "All of which means that these two phones have stamina that’s roughly comparable with each other, not to mention other flagship phones. You’ll get through a day of moderate usage without too much issue, but might need to plug in before bed time if you keep those displays in constant use and work the processors with games and video streaming.",
    "Neither phone will make it through a full two days of use, unless you’re spending a huge amount of time in standby, on a stable Wi-Fi connection, and only carrying out the lightest of tasks on them.",
    "That’s not to say that we can’t declare a winner here. The OnePlus 9 Pro wins the battery category based on its excellent charging provisions.",
    "You get a whopping 65W of charging power packaged into the box, which will get you from 1 to 100% in just 29 minutes. Compare that to the iPhone 12 Pro, which doesn’t even give you a charger in the box. And when you do come to buy one, you’ll only be able to go up to 20W, which will get you to 50% in 30 minutes.",
    "The OnePlus advantage continues with wireless charging, with support for up to 50W. The iPhone 12 Pro only gives you 15W.",
    "The iPhone 12 Pro and the OnePlus 9 Pro both thoroughly earn their Pro names, offering uniformly strong packages for a similar price.",
    "We prefer the iPhone 12 Pro’s sleek design, while it also packs superior performance and a more consistent camera setup, not to mention wider availability. But the OnePlus 9 Pro hits back with a much more impressive display and rapid charging - complete with an actual bundled-in charger - for a lower price tag.",
    "Ultimately, the winner is likely to come down to your own personal preference, particularly when it comes to iOS and Android. If you’re heavily invested in or wedded to either ecosystem, then one of these phones will be a brilliant upgrade for you."
  ],
  "headers": {
    "3": "OnePlus 9 Pro vs iPhone 12 Pro price and availability",
    "7": "Design",
    "16": "Display",
    "23": "Camera",
    "36": "Specs and performance",
    "46": "Battery",
    "54": "Takeaway"
  },
  "links": {
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review"
  }
}