{
  "source": "https://www.techradar.com/news/google-is-promising-better-quality-smartwatch-apps-with-wear-os-3",
  "title": "Google is promising better-quality smartwatch apps with Wear OS 3",
  "category": "wearables",
  "updated": "2021-09-03T11:06:06Z",
  "author": "david-nield",
  "summary": "Google is upping standards",
  "article": [
    "This year's launch of the new and improved Wear OS 3 shows that Google (and Samsung) are serious about giving the Apple Watch more competition to think about, and Google has now issued updated guidelines to raise the \"quality bar\" for apps on the platform.",
    "The guidelines (via 9to5Google) cover the look of apps, how they handle notifications, and even how they're listed on the Google Play Store. The aim is to give users a more reliable, intuitive experience across apps they install on their smartwatch.",
    "Google emphasizes how building apps for Wear OS is different to building apps for phones or tablets, and wants developers to put in the extra effort to get their apps looking and working in the way that they should.",
    "\"Similar to mobile, your store listing and the quality of your Wear OS app will influence your search ranking and opportunities for merchandising,\" says Google. In other words, if apps don't meet the recommendations, they might get buried in the Play Store.",
    "One of the points made by Google in its updated guidelines is around the interface that apps use: they need to be properly formatted for both rectangular and circular screens, and should have large, clear text that's easy to read at a glance.",
    "Where possible, apps should be able to run independently on Wear OS, according to the guidelines – for the best user experience, no part of the app (including the setup process) should be calling back to resources on a smartphone or tablet.",
    "If Google is going to get more Wear OS devices on people's wrists, it knows that it's going to need a lot of help along the way – look at the way it's been working closely with Samsung on Wear OS, for example. It's notable too that Samsung's newest smartwatches have ditched Tizen for Wear OS.",
    "While the existence of a Pixel Watch remains an unconfirmed rumor at this point, watch makers like Fossil are doing their best to put out hardware that matches the Apple Watch in terms of quality and style. It's important that the devices keep coming.",
    "And let's not forget Google's acquisition of Fitbit: so far, Fitbit devices have stuck with their own apps and software, but we know that a premium wearable is on the way that will have the Fitbit aesthetic in terms of its design but run Wear OS as its operating system.",
    "The updated app developer guidelines that Google has just published are an acknowledgement that third-party apps, and the quality of those apps, are important too: Wear OS is going to be a far more attractive proposition with a range of useful, well made apps to install on top of it."
  ],
  "headers": {
    "3": "Play by the rules",
    "6": "Analysis: Google knows it needs help with Wear OS"
  },
  "links": {
    "Wear OS 3": "https://www.techradar.com/news/wear-os-3-name-announced",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "The guidelines": "https://developer.android.com/docs/quality-guidelines/wear-app-quality",
    "9to5Google": "https://9to5google.com/2021/09/02/wear-os-3-app-quality/",
    "says Google": "https://android-developers.googleblog.com/2021/09/httpsandroid-developers.googleblog.com202109raising-quality-bar-with-wear-os-30.html",
    "newest smartwatches": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "doing their best": "https://www.techradar.com/news/fossil-gen-6-smartwatch-release-date-price-news-and-features",
    "is on the way": "https://www.techradar.com/news/google-is-building-a-premium-fitbit-smartwatch-running-wear-os"
  }
}