{
  "source": "https://www.techradar.com/news/twitters-new-business-professional-site-wants-to-kill-off-linkedin-for-good",
  "title": "Twitter's new business professional site wants to kill off LinkedIn for good",
  "category": "computing",
  "updated": "2021-07-14T11:03:45Z",
  "author": "balakumar-k",
  "summary": "\"Twitter for Professionals\" will target businesses and influencers alike",
  "article": [
    "Twitter is gearing up to launch its new business-focused social media network within the next few weeks following months of testing, reports have claimed.",
    "\"Twitter for Professionals\" has been undergoing testing with some handpicked businesses in the US, with the company now set to push it worldwide as it looks to expand its potential ecommerce reach.",
    "The news was revealed by leaker Alessandro Paluzzi, who uncovered settings and rules for users of the new service, suggesting it is close to being publicly available",
    "Paluzzi's screenshots of the new service show Twitter for Professionals being a toggled option in the usual Settings menu on both the mobile and desktop version of the site.",
    "Once users click on \"Get Started\", they are led to the next stage where they have to select a category of their area of business, which will be shown on their public profile.",
    "The categories include choices such as Automotive, Education, Event Venue, Entertainment & Recreation, and even Dance & Night Club, suggesting Twitter for Professionals will be targeting a wide range of businesses.",
    "Once users picked a category, the next choice was to \"Select an Account Type\" of either Business or Creator (described as the \"best fit for public figures, artists and influencers\") - although the service did say this can be changed later.",
    "When it first began testing the feature in the US, Twitter had described the new feature as a new tool that \"will allow businesses, non-profits, publishers, and creators — anyone who uses Twitter for work — to display specific information about their business directly on their profile.\"",
    "Allowing separate business or professional profiles, as Facebook and Instagram has done, could throw up a lot of opportunities for Twitter, and others who use the platform for their businesses and professions.",
    "Facebook recently revealed it would be boosting its ecommerce focus by adding Shops to WhatsApp along with Shop Ads listings within Facebook Marketplace. Across its social media platforms, the company says there are more than 1.2 million monthly active Shops plying their wares through its social outlets.",
    "Via Piunikaweb"
  ],
  "headers": {
    "3": "\"Twitter for Professionals\""
  },
  "links": {
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "Twitter for Professionals": "https://www.techradar.com/news/twitter-begins-testing-professional-profiles-we-tell-you-what-it-is",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Alessandro Paluzzi": "https://twitter.com/alex193a/status/1415101348652191747",
    "Piunikaweb": "https://piunikaweb.com/2021/07/14/twitter-for-professionals-allegedly-in-the-works-possibly-to-take-on-instagram-for-business/"
  }
}