{
  "source": "https://www.techradar.com/news/how-to-watch-search-party-season-4-online-stream-every-new-episode-on-hbo-max-today",
  "title": "How to watch Search Party season 4 online: stream every new episode on HBO Max",
  "category": "computing",
  "updated": "2021-03-10T12:43:26Z",
  "author": "kevin-lynch",
  "summary": "Dory's quest finds her in even deeper trouble than ever",
  "article": [
    "Creeping its way up from its early status as a cult show with a loyal following, to a bona fide overground must-watch, Search Party and its mix of thriller and satire returns this week for a fourth season. Read on as we explain how to watch Search Party season 4 online with HBO Max today.",
    "The new season once again centres around meandering millennial Dory Sief (Arrested Development's Alia Shawkat), who in a bid to find a purpose in life in season one, begins searching for an old college acquaintance who had gone missing That quest leads her and her friends into a whole host of trouble - with the group's misdeeds very much catching up with them by the end of season 3.",
    "Hitting the ground running from the previous season's cliffhanger ending, Dory begins the new series held prisoner by her psychotic stalker Chip (Cole Escola).",
    "Dory's actress best friend Portia (Meredith Hagner) meanwhile, is starring in a film about the search party, although not as herself, Elliott (John Early) has reinvented himself as a far-right conservative talk show host; while Drew (John Reynolds) is now earning a wage as a costumed cast member in a theme park.",
    "As it begins to dawn on her friends begin to realise that Dory might not be touring Europe as her fake social media posts have indicated, her friends must decide whether or not to put the traumatic events of the past behind them and once again become a search party – only this time, for Dory.",
    "After its loyal fanbase had an excruciating near three-year wait for season 3, this new series comes somewhat swifter with the previous season having only just finished last summer.",
    "Adding to the familiar cast member this time out will be a string of top-draw guests, including Hollywood royalty Susan Sarandon and Handmaid’s Tale star Ann Dowd. Keep reading for full details of how to watch Search Party season 4 online today.",
    "More from HBO Max:"
  ],
  "headers": {
    "7": "How to watch Search Party season 4 online in the US"
  },
  "links": {}
}