{
  "source": "https://www.techradar.com/news/fears-grow-apples-new-mail-privacy-protection-could-kill-off-email-newsletters-for-good",
  "title": "Fears grow Apple's new Mail Privacy Protection could kill off email newsletters for good",
  "category": "computing",
  "updated": "2021-06-09T11:06:42Z",
  "author": "mayank-sharma",
  "summary": "But others say there are plenty of other metrics for measuring success",
  "article": [
    "Apple’s new Mail Privacy Protection feature, that the company hopes can bolster the privacy of the default email app on iOS 15 and MacOS, may also inadvertently deliver a devastating blow to email newsletters.",
    "Introduced at the recent WWDC 2021, Mail Privacy Protection implements a host of features to prevent common email marketing ploys such as the use of invisible tracking pixels. Apple says the new feature will also mask users’ IP address to prevent it from being linked to other online activity or for determining their location.",
    "In essence, the new feature will restrict the amount of information that people who send you emails can collect about you.",
    "But some observers have argued that in addition to dissuading advertisers, the curbs will also effectively cripple email newsletters.",
    "Email newsletters have witnessed a sort of a resurgence of late. The growth of newsletter platforms such as SubStack has attracted the attention of traditional publications such as New York Times, along with Facebook and Twitter who have reportedly doubled-down on their newsletter strategies.",
    "Some journalists believe that with its Mail Privacy Protection update, Apple is now going after the digital ad business hook, line, and sinker, which wouldn’t end well for newsletter publishers.",
    "While Apple hasn’t yet shared details about the exact working of the feature, the company detailed its effectiveness at WWDC, and extended a “couched warning” to publishers believes Apple Insider.",
    "“This is another sign that Apple’s war against targeted advertising isn’t just about screwing Facebook — they’re also coming for your Substack,” wrote the co-founder of Nieman Lab Joshua Benton.",
    "Benton quotes recent market-share numbers from Litmus that show that for May 2021, 93.5% of all email opens on phones come in Apple Mail on iPhones or iPads, while on the desktop Apple Mail is responsible for 58.4% of all email opens.",
    "Notably though the new Mail Privacy Protection feature would only impact ad-based newsletters, and it might affect paid newsletters.",
    "\"Writers can triangulate reader engagement by plenty of metrics that are still available to them, including the views their stories get on the web, the overall growth of their mailing list, and — most meaningful of all — the growth of their revenue,\" Newton argues.",
    "Via Apple Insider"
  ],
  "headers": {
    "5": "Newsletter adverts"
  },
  "links": {
    "email app": "https://www.techradar.com/best/best-email-clients",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "SubStack": "https://www.techradar.com/news/substack-wants-to-help-liven-up-your-boring-newsletters",
    "Joshua Benton": "https://www.niemanlab.org/2021/06/a-packed-set-of-apple-announcements-could-have-big-impacts-on-news-publishers-for-good-and-for-ill/",
    "iPhones": "https://www.techradar.com/news/best-iphone",
    "iPads": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Apple Insider": "https://appleinsider.com/articles/21/06/09/newsletter-publishers-concerned-apples-mail-privacy-protection-will-crater-industry"
  }
}