{
  "source": "https://www.techradar.com/news/google-play-store-stuffed-with-fake-cryptomining-apps",
  "title": "Google Play Store stuffed with fake cryptomining apps",
  "category": "computing",
  "updated": "2021-08-19T16:37:16Z",
  "author": "mayank-sharma",
  "summary": "The lure of crypto is difficult to resist for both consumers and scammers",
  "article": [
    "Cybersecurity researchers have once again helped Google evict malicious apps from the official Play Store that falsely advertised themselves as cryptomining services.",
    "Security firm Trend Micro flagged eight such Android apps, which asked users to pay for cloud mining operations that didn’t exist.",
    "“Upon analysis, we discovered that these malicious apps only trick victims into watching ads, paying for subscription services that have an average monthly fee of $15, and paying for increased mining capabilities without getting anything in return,” wrote Cifer Fang, Mobile Threat Analyst at Trend Micro.",
    "According to Fang, all of the eight flagged apps were found to be infected with either the AndroidOS_FakeMinerPay or the AndroidOS_FakeMinerAd malware.",
    "This isn’t the first time researchers have found fraudulent apps in the Play Store that hope to cash in on the cryptocurrency craze.",
    "Just last month, the Lookout Threat Lab identified about 170 such apps, over two dozen of which were listed on the Play Store, and managed to fool thousands of users into paying for non-existent cloud mining operations.",
    "As before, Google acted swiftly to remove the eight malicious apps highlighted by Trend Micro. However, this is just the tip of the iceberg.",
    "“Based on Trend Micro Mobile App Reputation Service (MARS) data, more than 120 fake cryptocurrency mining apps are still available online. These apps, which do not have cryptocurrency mining capabilities and deceive users into watching in-app ads, have affected more than 4,500 users globally from July 2020 to July 2021,” reveals Fang.",
    "Although some malicious apps are able to make their way onto the Play Store, to shield against threats, users are advised to download applications from official apps stores exclusively, and to research new services online to verify their legitimacy."
  ],
  "headers": {
    "4": "Uphill battle"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "cryptomining": "https://www.techradar.com/best/mining-rigs",
    "Trend Micro": "https://www.techradar.com/reviews/trend-micro-2020-antivirus-solutions",
    "Android apps": "https://www.techradar.com/best/best-android-apps-2021",
    "wrote Cifer Fang": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1385168061430455600/https://www.trendmicro.com/en_us/research/21/h/fake-cryptocurrency-mining-apps-trick-victims-into-watching-ads-.html",
    "identified about 170 such apps": "https://www.techradar.com/news/android-users-scammed-in-their-thousands-by-fake-cryptomining-apps"
  }
}