{
  "source": "https://www.techradar.com/news/5-of-the-best-android-phones-you-cant-buy",
  "title": "5 of the best Android phones you can’t buy",
  "category": "phones",
  "updated": "2021-05-22T07:00:13Z",
  "author": "esat-dedezade",
  "summary": "Whether it's because of location or other problems",
  "article": [
    "If you wanted to, you could, right now, start binge watching an entire series while ordering food, power tools, and a Bob Ross waffle maker, simply by asking a smart speaker to do so. It’s safe that in this crazy modern world, we’re more than a little spoiled.",
    "To bring us back down to Earth, we’ve scoured far and wide to hunt for things we can’t actually buy — smartphones, to be more precise. We are even spoiled for choice when it comes to the best smartphones, so what Android phones are we missing out on?",
    "We’ve tracked down five of the best Android phones that aren’t actually on sale in the US, UK or Australia. From folding-screened wonders to eye-searing neon affairs, it’s a rather mixed bunch, but if you ever manage to snag one for yourself, you’ll definitely stand out from the crowd.",
    "Without further ado, let’s meet some of the more elusive smartphones out there…",
    "While we’re at a point where folding phones are no longer solely living in the realm of the impossible, they’re still a rare sight to behold in the wild. The likes of Samsung, Huawei and Motorola have all unleashed contorting handsets, and now it's Xiaomi’s turn.",
    "The Mi Mix Fold is the company’s first entry into the folding smartphone arena, and it’s a beauty. The top-spec model costs 11,000 yuan (around $1,700 / £1,220 / AU$2,190), which is kitted out with an impressive 13GB RAM and 512GB storage.",
    "The real story though, is the gigantic 8.01-inch 1860 x 2480 foldable display, which packs a 60Hz refresh rate, 900 nits of brightness, and HDR10+ and Dolby Vision to boot. It transforms the handset from a regular phone to a veritable tablet in an instant, and it looks like it can comfortably give the likes of the Samsung Galaxy Z Fold 2 a run for its money.",
    "When folded for protection the Mi Mix Fold serves up a separate flagship-worthy 6.5-inch 840 x 2520 display on the outside, complete with punch-hole camera for easier selfies.",
    "Throw in a groundbreaking liquid lens camera which changes shape to offer anywhere from 3x optical to 30x hybrid zoom, a massive 5,020mAh battery, and a beefy Snapdragon 888 processor, and we have ourselves one of the best phones on the planet. It’s a massive shame, then, that there are no confirmed plans for it to leave China. If you’re reading this Xiaomi — please? Pretty please?",
    "“Business at the front, Party at the back,” says the official marketing material for the Tecno Spark 7. It’s not wrong.",
    "From the front it resembles any other modern handset, with the only visible flair being the rather attractive centered selfie cam teardrop cutout. Flip it round though, and your eyes will be seared by a combination of bright, fluorescent, two-tone acid green and blue colors. It comes in more muted options of course, but where’s the fun in that?",
    "Specs-wise, we’re looking at a Helio G7 processor, 5,000mAh battery, 4GB RAM, up to 128GB of storage, and an AI-powered 16MP triple rear camera, with a 6.8-inch 90Hz display presenting the goods up front.",
    "Launching in select countries including India, Kenya and South Africa, it’s expected to be priced around Rs.11,600 (around $160 / £110 / AU$450). At this price it’s clearly not going toe-to-toe with the likes of iPhones, Galaxies and others, but it appears to offer superb bang for buck specs, in an eye-catching design that most other phones will be more than a little jealous of.",
    "At the time of its launch, the Vivo V20 Pro was said to be the thinnest 5G smartphone in the world. Measuring in a svelte 7.38mm thin, it practically disappears when viewed from the side. We’re not guaranteeing you could cut a cake with it of course, but in all honesty, you probably could, should you feel compelled to.",
    "Think profile aside, it’s not a bad-looking handset either, especially in the matte glass Sunset Melody finish, which rocks a rather Outrun-esque 80s blue/pink color combo. A mid-range affair, it has a Snapdragon 720G processor, 8GB of RAM, 128GB of storage, a 4,000mAh battery, and respectable (if not record-breaking) 33W charging.",
    "Round the front you’ll find a 6.44-inch Full HD+ screen, complete with a teardrop selfie cam cutout, which houses a pixel-packing 44MP camera with eye autofocus, that’s also capable of 4K selfie videos.",
    "Chuck in a 64MP rear camera which promises detailed night shots, along with 8MP wide-angle and 2MP macro affairs, and you’ve got a lot of phone for your money. Speaking of which, the jazzy Sunset Melody version can be snapped up in India for Rs. 25,990 (around $350 / £250 / AU$200).",
    "At first glance Sharp’s Aquos Sense 5G might not seem all that remarkable (beyond the fact that it’s only available in Japan, that is). Take a little longer to dive into things though, and it begins to reveal a few interesting quirks.",
    "Pastel fans, for starters, are likely to love the muted pink and blue color options, which are hues rarely seen on this side of the world. Understated design aside, the screen is probably the next most interesting thing about the Sense 5G. While its 5.8-inch size and 1080 x 2280 resolution might not seem like much, it’s the fact that it’s specially designed to work in the bath, that’s drawn our attention.",
    "While waterproof smartphones are a dime a dozen these days, we haven’t come across many that’ll accurately register swipes and touches in a downpour. Most of the time a wet screen causes everything to go haywire, forcing you to wipe it dry and try again.",
    "The Sense 5G, on the other hand, promises to not only shrug off water, but remain responsive, accurate and operational, even when the screen is wet. Bath lovers will be disappointed to hear that it’s only available in Japan, for 39600 JPY (around $360 / £260 / AU$470).",
    "From behind, the Infinix Zero 8 is one of the most attention-grabbing handsets you’re likely to see, thanks to its rear camera setup’s diamond formation, complete with matching two-tone angular paintjob.",
    "While you’d think the simple rotation of a square camera setup could have easily been achieved by any company, this is the first one we’ve seen actually do it, so bonus points for managing to breathe new life into a tried and tested (but generally boring) aspect of smartphone design.",
    "The rear camera setup has a 64MP+48MP Ultra Night camera, capable of capturing shots in RAW for in-depth tweaking. The front camera promises to impress too, consisting of a 48MP+8MP setup, enabling you to take Ultra Night and ultra-wide angle selfies in darker conditions.",
    "Powered by a Helio G90T processor, a 4,500mAh battery, liquid cooling for lower temperatures when gaming, and a generous 6.85-inch 90Hz screen, it’s not too shabby on the specs front either. It wins extra points for its bright color options, which make the rear stand out even more. It can be snapped up in Nigeria for ₦116,900.00 (around $300 / £220 / AU$395)."
  ],
  "headers": {
    "4": "Xiaomi Mi Mix Fold",
    "9": "Tecno Spark 7P",
    "13": "Vivo V20 Pro",
    "17": "Sharp Aquos Sense 5G",
    "21": "Infinix Zero 8"
  },
  "links": {
    "Bob Ross waffle maker": "https://www.youtube.com/watch?v=TyoUAyVTBxE",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "Mi Mix Fold": "https://www.techradar.com/news/xiaomi-mi-mix-fold-release-date-price-features-and-everything-you-need-to-know",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review"
  }
}