{
  "source": "https://www.techradar.com/news/heres-why-you-should-start-a-blog-for-your-business",
  "title": "Here's why you should start a blog for your business",
  "category": "computing",
  "updated": "2021-10-28T20:05:49Z",
  "author": "techradar-pro",
  "summary": "Marketing with a blog",
  "article": [
    "Developing a new website? Then make sure you don’t forget to build a blog into your marketing plan. It’s a powerful way to help visitors discover your website, it’s great at helping to build trust, and it makes keeping in touch with customers much easier.",
    "Getting found on Google is a top marketing priority. Blogging brings a number of SEO benefits and plays an essential part in the drive to get high search engine rankings. New blog posts being placed on your website make Google happy in its quest to find fresh content. The blog content tends to stick to a central theme, which means there is going to be topical keyword density and relevance.",
    "Blogs also tend to acquire links from other blogging websites, whether in the form of explicit links from other sites, trackbacks or links from blog directories. Of course, RSS feeds can ping Google the moment new content is published, triggering rapid-fire indexing of the content. One key benefit to a blog is the ability to keep in touch with your customers.",
    "Blog comments are a great two-way communication channel. And unlike other forms of social media, you can moderate and edit comments before they go live, which appeals to many businesses worried about negative or libelous comments. Do you want to ensure that your content can reach customers’ iPads? Then the Flipboard iPad app provides a fantastic interface to blog content just by providing the app with the address of your blog’s RSS feed.",
    "There is a new marketing trick up the collective sleeve of the blogger: the principle of authorship. Photographs of authors appearing in search results alongside the articles they have written create a more prominent and trustworthy search result. Google looks for good content from great authors, and it knows there is lots of that in blogs. By linking your social media profiles to your blog, you can gain the additional benefit of being highly visible in search results.",
    "A blog hosted on your own domain gives all of the key SEO benefits: content on your domain, inbound links to your blog posts, and a customer experience where visitors are right in the mix of your own site’s marketing messages. An externally-hosted blog loses that SEO power and gives visitors a less strong experience of your brand. Other development activities you should consider include integration with email marketing systems, with LinkedIn profiles for your staff, and connections to other social platforms.",
    "Name: Matt Davies",
    "Company: Fifteen Design",
    "Role: Creative Director (2018)",
    "What’s your top priority when creating a new blog?",
    "Each element of text needs to be styled in a legible way, which is easy on the eye and clearly differentiates each area of text. Think about using fonts, line spacing, sizes and colors effectively.",
    "How should developers work with designers to build a blog?",
    "My number one tip is for developers and designers to go through a wireframe process together before any designing or coding begins. After wireframes are in place, the designer can get creative on styling the elements and the developer can sit back and be content to know that what the designer comes back with will be possible.",
    "What’s the future for blog design?",
    "Technology is moving us onwards into live microblogging, which is like Twitter but through blogs, with users exchanging small snippets of information quickly. This new technology will mean that layouts will probably become more conversation-like as opposed to walls of text, which is the norm at the moment."
  ],
  "headers": {
    "6": "Expert insight: Matt Davies"
  },
  "links": {
    "new website": "https://www.techradar.com/news/the-best-website-builder",
    "SEO benefits": "https://www.techradar.com/news/10-essential-seo-tips-and-tricks-for-business-websites-and-how-they-benefit-you",
    "Flipboard": "https://www.techradar.com/reviews/pc-mac/software/home-and-reference-software",
    "Fifteen Design": "https://www.fifteendesign.co.uk/"
  }
}