{
  "source": "https://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support",
  "title": "PS5 and Xbox Series X games with 120fps support",
  "category": "gaming",
  "updated": "2021-12-08T10:30:12Z",
  "author": "adam-vjestica",
  "summary": "Enjoy higher framerates in these titles",
  "article": [
    "PS5 and Xbox Series X games with 120fps support are becoming increasingly common. From blockbuster hits to inventive platformers, more titles are taking advantage of 120fps support, which is fantastic news for gamers with compatible displays.",
    "We’ve previously been stuck in the doldrums of running games at a treacle-like 30fps on console, but with higher framerates now becoming more readily available, gamers can enjoy the benefits of reduced input latency, a smoother image, and significantly more responsive gameplay.",
    "120fps support used to be exclusively reserved for PC gamers with powerful enough hardware, but PS5, Xbox Series X, and Xbox Series S owners with a 120Hz, HDMI 2.1 compatible displays can hit the lofty heights of 4K / 120fps. Those who have 120Hz, HDMI 2.0 displays can also take advantage of 120fps, but only at 1080p (and sometimes 1440p).",
    "So which PS5 and Xbox Series X games offer 120fps support? And does the Xbox Series S also benefit? We’ve rounded up all the games below in an easy-to-read format so you can see which games take advantage of higher framerates on either system. We’ll also be updating this list in the future as more games receive 120fps support.",
    "Does having a higher framerate really matter? To put it simply, yes, but right now it’s a bit of a luxury for many. 120fps support is a huge plus in competitive games where a split-second action can make all the difference, and running games at a higher framerate also makes games look incredibly smooth in motion, which can help offset motion sickness and will generally make games look cleaner overall.",
    "But it’s also a graphically intensive feature, hence why it isn’t supported by every game out there and simply wasn’t possible on the last-gen consoles like the PS4 and Xbox One.",
    "While it’s always hard to showcase the benefits of 120fps fully without experiencing it for yourself, the video below shows Ori and the Will of the Wisps running at 60fps and 120fps. The difference between the two is stark, even though 60fps is still considered to be the sweet spot for framerates. Ori appears as though it’s more stop-start at 60fps, while at 120fps it’s noticeably more fluid in motion",
    "It’s easy to get the two confused, but it’s important to know the difference between them. Hertz (Hz) refers to the number of times your display refreshes per second. Most TVs are limited to 60Hz, but you may have seen some monitors that support 144Hz and even 360Hz. If your TV only has a 60Hz refresh rate, you won’t be able to play at 120fps as the maximum refreshes per second it can achieve is 60. For 120fps, you’d need a 120Hz capable display.",
    "Frames per second (fps) is the number of individual images generated by a console or a PC. Developers often lock a framerate to a set figure: either 30, 60 or 120, to provide a steady and consistent experience. If you’ve ever played a 30fps game that is unlocked, it’s often extremely unpleasant, as a game will widely fluctuate between different framerate values, which ultimately leads to a choppy, inconsistent experience.",
    "The main takeaway is this: if a display is capable of 120Hz, then it can run games at 120fps on PS5 and Xbox Series X/S providing it has a HDMI 2.0 or HDMI 2.1 port. Again, a HDMI 2.1 or 2.0 connection will affect what resolutions you are able to run at when hitting 120fps.",
    "While the PS5 doesn’t include 120fps support for quite as many games as Xbox Series X and Xbox Series S, its library of titles is growing slowly. Check out all the PS5 games with 120fps support below.",
    "Have you noticed any games missing from this list? Tweet @ItsMrProducts and let him know!",
    "The Xbox Series X has far more games with 120fps support compared to PS5, with Microsoft’s backwards compatibility feature, FPS Boost, also helping increase the framerate of older Xbox One games. Check out all the Xbox Series X games with 120fps support below.",
    "Did we miss any 120fps games on Xbox Series X? Tweet @ItsMrProducts and let him know!",
    "The Xbox Series S is fully capable of hitting 120fps, but not every game that hits 120 frames per second on Xbox Series X is doable on Microsoft’s cheaper Xbox. Still, there are plenty of games to choose from if you’re searching for 120fps games, and far more titles available than what you'll currently find on PS5. Check out all the Xbox Series S games with 120fps support below.",
    "Did we miss any 120fps games on Xbox Series S? Tweet @ItsMrProducts and let him know!",
    "Interested in playing at 120fps on PS5 or Xbox Series X, then? Check out the best 120Hz 4K TVs for Xbox Series X and PS5. These TVs will let you take full advantage of all the next-gen consoles' new features, and hit the silky-smooth heights of 120fps.",
    "You might also want to check out the capabilities of HDMI on PS5."
  ],
  "headers": {
    "4": "Why 120fps is better than 60fps",
    "7": "120Hz vs 120fps: what’s the difference?",
    "10": "PS5 games with 120fps support",
    "12": "Xbox Series X games with 120fps support",
    "14": "Xbox Series S games with 120fps support"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "360Hz": "https://www.techradar.com/news/nvidias-new-360hz-monitors-are-going-to-have-a-must-have-feature-for-esports-enthusiasts",
    "@ItsMrProducts": "https://twitter.com/ItsMrProducts",
    "backwards compatibility": "https://www.techradar.com/news/what-is-backwards-compatibility-the-key-ps5-and-xbox-series-x-feature-explained",
    "FPS Boost": "https://www.techradar.com/news/list-of-xbox-fps-boost-games-on-xbox-series-x-and-xbox-series-s",
    "Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "best 120Hz 4K TVs for Xbox Series X and PS5": "https://www.techradar.com/best/120hz-4k-tvs",
    "HDMI on PS5": "https://www.techradar.com/news/hdmi-on-ps5"
  }
}