{
  "source": "https://www.techradar.com/news/inside-marvels-what-if-the-disney-plus-animated-show-that-reshapes-the-mcu",
  "title": "Inside Marvel's What If...?, the Disney Plus animated show that reshapes the MCU",
  "category": "entertainment",
  "updated": "2021-08-07T14:00:00Z",
  "author": "tom-power",
  "summary": "‘How do we tell something different? Who are these characters without their suits?’",
  "article": [
    "Rebooting a TV show or movie series can be a sore subject for some fans. As the reaction to Netflix’s He-Man revival or recent Star Wars films can attest to, significant changes to a series’ source material can cause fans to revolt against the properties they revere.",
    "As relative newcomers to the movie franchise business, Marvel Studios doesn’t need to concern itself with such problems, even if the studio’s latest TV offering – a byproduct of the Marvel Cinematic Multiverse’s (MCM) recent arrival – can be viewed as a semi-revitalization of sorts.",
    "What If…?, the first canonical MCU animated anthology series, recreates infamous events from the franchise’s 13-year history in unusual, funny and at-times shocking ways.",
    "Revising iconic moments – particularly in a movie series that’s still in its infancy – might be seen as something of a gamble. However, with an established, supportive fanbase behind it, Marvel can afford to take such risks – and likely succeed with them.",
    "Ahead of What If…?’s Disney Plus premiere on August 11, TechRadar sat down with star Jeffrey Wright, head writer A.C. Bradley, director Bryan Andrews and executive producer Brad Winderbaum to find out how the show builds new futures from the MCU’s past. We also discuss the late Chadwick Boseman’s final appearance as T’Challa, and the prospects of the show running for multiple seasons.",
    "Based on the 1977 comic series of the same name, What If…? takes key events from Marvel movies, such as Steve Rogers becoming Captain America or the Avengers’ formation, and reimagines them in unpredictable ways. These moments, though, don’t occur on the MCU’s timeline – they play out in alternate realities, which were introduced alongside the multiverse in Loki’s season 1 finale.",
    "Announced in April 2019, What If…? is a project that Marvel has wanted to bring to life for a while but, until recently, the necessary pieces hadn’t fallen into place. Sure, the MCU was firmly established as a leading 21st century movie franchise long before What If…? was officially revealed, but the idea of making a TV show based on this particular comic series, and the multiverse’s introduction, had been a pipedream for some time.",
    "“Over the years, we’ve tried to figure out what to do,” Winderbaum explains. “We’ve been excited to explore animation at Marvel Studios, and now we’ve got such a rich cinematic history of over 10 years to draw from. People know these stories, so we have lots of opportunities to spin What If…? concepts out of projects that fans know very well.”",
    "What If…? won’t just tell tales that fans are accustomed to. As its official trailers and TV spots showcase, the series will also bring fan-favorite comic stories – such as Marvel Zombies – to life, as well as create brand-new narratives that MCU or comic fans haven’t seen before.",
    "Marvel’s existing and wholly original content, then, presents the studio with unlimited storytelling possibilities for its latest show – although as Bradley reveals, there was one directive that its creative team had to stick to during its development.",
    "“The only rule was it had to start with the MCU,” Bradley says. “So we had to pull from those characters. It’s easy to think ‘what would happen if this occurred?’, but the real challenge was ‘how do we tell something different?’ or ‘who are these characters without the suits?’ or ‘where’s the heart behind the hero?’. Once we answered those questions, we had so many different avenues to explore.”",
    "What If…? represents Marvel Studios’ first foray into animation, so finding the right aesthetic to depict its well-known characters and locations (albeit existing in different dimensions to the MCU) was vital.",
    "Choosing a specific art style was even more pertinent when Marvel outsourced the show’s animation to three other studios, with Canadian company Squeeze, Australian outfit Flying Bark Productions and French studio Blue Spirit working on five, three and one of What If…?’s episodes respectively.",
    "After much deliberation, including over whether to pursue 2D animation or a style inspired by legendary Marvel artists Jack Kirby and Steve Ditko, Marvel settled on a design influenced by classic US illustrators including J.C. Leyendecker and Tom Lovell.",
    "“As we’re riffing on the MCU, we didn’t want to go with something ‘super’ out there,” Andrews explains. “We looked back at art from the 20s and 30s because it has an idealised, almost heroic human form that’s chiselled, and lends itself as a subtle sidestep from our live-action projects. Ryan Meinerding [Marvel Studios’ Head of Visual Development] really sunk his teeth into that style and helped us achieve this signature look.”",
    "Leading viewers through What If...?’s various tales is Uatu the Watcher, an omnipotent celestial being who oversees the Marvel multiverse. However, while Uatu is an individual of immense power, he’s a passive observer who can’t intervene in events as they occur – much like the show’s audience.",
    "For Wright (Westworld, James Bond), who voices Uatu in What If…?, the all-powerful character acts as a stand-in for Marvel fans who, like him, are fascinated by this fictional universe and the superheroes (and supervillains) that inhabit it.",
    "“He’s the biggest fan out there,” Wright says. “He wants to get involved and maybe manipulate things in a different way, but there are limitations [to what he can do]. I think he’s drawn to these characters, their stories and the mythology in the same way that we’re drawn to water [to survive]; it defines him and gives him life. There’s a certain part of our humanness that we connect to through these characters and, while he isn’t human, I think Uatu does, too.”",
    "Wright isn’t the only big name attached to the series. Many of the MCU’s stars, including Chris Hemsworth, Benedict Cumberbatch, Paul Bettany, Tom Hiddleston, Hayley Atwell, Karen Gillan and Sebastien Stan have reprised their roles for What If…?, although some Marvel actors – Drax star Dave Bautista included – weren’t asked to voice their characters.",
    "Of all those who did return, Chadwick Boseman’s performances will prove to be the most emotional. The actor, who passed away in August 2020 after a four-year battle with colon cancer, reprises his iconic role as Wakanda’s T’Challa in four episodes.",
    "What If…?, then, represents Boseman’s final acting role – and in Bradley’s view, it’s fitting that one of the show’s earlier episodes, which explores what would have happened if Guardians of the Galaxy’s Ravagers had accidentally kidnapped T’Challa, is befitting of Boseman as much as the character that he embodied.",
    "“In the MCU and the comics, T’Challa doesn’t go through changes; he changes the world,” Bradley says. “When it came to creating this particular episode, the question wasn’t ‘how do we do Black Panther in space?’, it was ‘how does T’Challa, and Boseman by extension, change the galaxy and fix it for the better?’ Chadwick was a god among men who changed the people around him, so we wanted to play off that and honor him through it.”",
    "What If…?’s nine-episode run feels like it’s just the beginning for Marvel Studios’ inaugural animated show.",
    "Audiences may be pleased to hear, then, that production is already underway on a second season that also comprises nine episodes – but what about seasons after that? With the MCM’s arrival providing the opportunity to tell an infinite number of stories, there are bound to be multiple entries in Marvel’s latest TV series, right?",
    "Winderbaum declined to comment on such a possibility, but did tease the prospect that future instalments were something that the show’s chief creative team were keen to pursue.",
    "“We will never run out of ideas because there’s so many ways to spin out the universe and the stories that we love,” he says. “This season allows us to dig into each story and make them as rich as possible. Hopefully, we can go even wider [in the future] and tell as many as possible.”",
    "Much will depend on fans’ reactions to the series’ first season. What If…? represents a bold, new step for Marvel Studios, but it can afford to take this risk now that it’s established as one of the biggest entertainment companies around – and we suspect fans won’t need a second invitation to check it out."
  ],
  "headers": {
    "5": "There was an idea...",
    "15": "Cosmic observations and bittersweet reunions",
    "22": "A Marvel-ous future?"
  },
  "links": {
    "Netflix’s He-Man revival": "https://www.techradar.com/news/netflixs-he-man-reboot-has-been-panned-by-fans-and-its-creator-isnt-happy",
    "Star Wars films": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Loki’s season 1 finale": "https://www.techradar.com/news/loki-episode-6-ending-explained",
    "Drax star Dave Bautista included": "https://www.techradar.com/news/dave-bautista-was-never-asked-to-voice-drax-in-marvels-what-if-so-what-gives"
  }
}