{
  "source": "https://www.techradar.com/news/new-spider-verse-trailer-teases-not-one-but-more-spider-man-movies",
  "title": "New Spider-Verse trailer teases not one but two more Spider-Man movies",
  "category": "entertainment",
  "updated": "2021-12-06T10:11:01Z",
  "author": "henry-st-leger",
  "summary": "The sequel to the acclaimed animated Spider-Verse movie is almost here",
  "article": [
    "The first trailer for Spider-Man: Into The Spider-Verse's sequel has landed, showing off what the next chapter in Miles Morales' animated adventure might entail – and it's a tale that will be spread across two parts.",
    "Sony's sequel, which is officially titled Spider-Man: Across The Spider-Verse, will be releasing October 7 in 2022, meaning it's just under a year away. The end of the trailer, however, teases that this film is just 'Part One', meaning that the multiverse-hopping movie will be setting up a follow-up that's due to arrive in 2023.",
    "The rule of three dictates that any successful movie needs a full trilogy, and that logic applies especially firmly to the Spider-Man IP. We've seen three Tobey Maguire Spider-Man movies, as well as three Tom Holland flicks (including No Way Home), and another live-action Spider-Man trilogy is in the works at Marvel too.",
    "Check out the film's first teaser below:",
    "The trailer is only a couple of minutes long, but follows on directly from the end of 2018's Into The Spider-Verse, with Spider-Gwen dropping out of a portal into Miles' bedroom.",
    "Miles hurriedly tidies away the more childish toys strewn across the place, protesting that he's grounded and can't run off adventuring – all very high-octane action.",
    "The trailer picks up, though, as we see Miles soaring through a portal into another universe, where he's pursued by Oscar Isaac's Miguel O'Hara – also known as Spider-Man 2099, a different iteration of Spidey from the future.",
    "We saw this (rather muscular) character briefly in the end-credits scene from Into The Spider-Verse, conversing with an AI voiced by Greta Lee (Russian Doll, The Morning Show). In the scene, Miguel is given a \"gizmo\" that can help him make an \"autonomous multiverse jump\", seemingly to find and round up more versions of Spider-Man. And it looks like that's just what he says in the next film.",
    "2018 was really the year when Sony made it's mark on Spider-Man, with both the acclaimed Spider-Verse film and the release of Venom – which also got a sequel, Let There Be Carnage, this year. Given the dominance of the MCU in all things superhero, it's great to see some separate parties tackle beloved characters from a different angle.",
    "We already know some tidbits beyond what's revealed in the trailer. For one, we know that Jake Johnson's (New Girl) take on Peter B. Parker from the first film will return, while Issa Rae (Insecure) will be voicing an iteration of Spider-Woman. It'll be one big happy Spider-Family.",
    "The villain has, so far, been kept under wraps, though there are plenty of possibilities from across the multiverse that Sony could drawn from. There have been rumors of The Spot making an appearance – a villain yet to appear in any Spidey films, but who has a dimension-hopping origin story that would fit right in here."
  ],
  "headers": {
    "8": "Analysis: Sony's hold on Spider-Man tightens"
  },
  "links": {
    "No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "another live-action Spider-Man trilogy is in the works at Marvel too": "https://www.techradar.com/news/marvel-is-planning-a-new-spider-man-trilogy-after-no-way-home-says-sony-producer",
    "Let There Be Carnage": "https://www.techradar.com/news/venom-2-looks-absolutely-ridiculous-but-were-here-for-it",
    "rumors of The Spot making an appearance": "https://www.cinemablend.com/news/2562804/wait-has-spider-man-into-the-spider-verse-2s-new-villain-been-revealed"
  }
}