{
  "source": "https://www.techradar.com/news/far-cry-6-release-date-pushed-back-to-sometime-before-april-2022",
  "title": "Far Cry 6 release date pushed back to sometime before April 2022",
  "category": "gaming",
  "updated": "2021-05-11T17:42:04Z",
  "author": "samuel-tolbert",
  "summary": "Revolution waiting",
  "article": [
    "Many games have been delayed over the last year, including some Ubisoft titles like Far Cry 6. Once scheduled to arrive in February earlier this year, the next entry in the open-world shooter franchise still does not have an exact release date. Thanks to Ubisoft's latest financial results, we know that Far Cry 6 is set to be released by April 2022.",
    "Meanwhile, other games like Riders Republic, The Division: Heartland, and Tom Clancy's Rainbow Six Quarantine are also slated to arrive by April 2022. Ubisoft Singapore's upcoming seafaring title Skull and Bones has been pushed to the following fiscal year and will arrive after April 2022 but before April 2023.",
    "Ubisoft saw record player numbers over the past fiscal year, with over 141 million unique players across PC and consoles.",
    "Yves Guillemot, Co-Founder and CEO of Ubisoft, said that \"Our FY22 line-up will be the most diversified we have ever had, with ambitious post-launch plans as well as premium and F2P new releases. Our financial targets reflect these growth initiatives which are intended to generate significant value over the long term.”",
    "Far Cry 6 stars actor Giancarlo Esposito as Anton Castillo, a dictator who controls the island of Yara while raising his son Diego. The gameplay will similar to past Far Cry titles, with players operating a wide range of weapons and vehicles while recruiting freedom fighters to assist in taking down the regime.",
    "We may be learning more very soon, as Ubisoft is holding its E3 2021 conference, Ubisoft Forward, on June 12. Given the delays over the past year, it seems reasonable that Ubisoft will show gameplay and other details for games like Far Cry 6, in addition to yet-unrevealed titles. Far Cry 6 is set to be available on Xbox Series X, Xbox Series S, Xbox One, PS5, PS4 and PC."
  ],
  "headers": {
    "4": "Overthrowing a tropical tyrant"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "financial results": "https://staticctf.akamaized.net/8aefmxkxpxwl/6PPKXqYvN3egZulrVbn9QB/c09227c455d963f57849f85eb2ebea11/Ubisoft_FY21_Earnings_PR_English.pdf",
    "Tom Clancy's Rainbow Six Quarantine": "https://www.techradar.com/news/rainbow-six-extraction",
    "Skull and Bones": "https://www.techradar.com/news/skull-and-bones-release-date-news-and-trailers",
    "Ubisoft Forward": "https://www.techradar.com/news/ubisoft-confirms-e3-2021-conference-details",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}