{
  "source": "https://www.techradar.com/news/iphone-13-might-have-even-more-internal-storage-than-an-ipad",
  "title": "iPhone 13 might have even more internal storage than an iPad",
  "category": "phones",
  "updated": "2021-02-01T17:11:38Z",
  "author": "tom-bedford",
  "summary": "Double the iPhone 12 storage",
  "article": [
    "If you use your iPhone in a professional capacity, or just have loads of apps, you'll want lots of storage - while the iPhone 12 models cap out at 512GB, some iPhone 13s could double that to a huge 1TB.",
    "This rumor comes from YouTube channel FrontPageTech, which states in a video that the iPhone 13 Pro (and presumably also Pro Max) is being tested in 1TB configurations. The channel says these are just prototypes for now, so it's something Apple is testing, but it's not confirmed for the phones by any means.",
    "It's worth pointing out that Jon Prosser, the leaker for the YouTube channel, has a very mixed track record, so take the information with a fistful of salt.",
    "If the iPhone 13 Pro phones had 1TB of storage, they'd be even more useful for professionals who use their phones for their lines of work.",
    "For example photographers or videographers who use iPhones - such as for mobile journalism, adventure photography or other things - will be able to store twice as much footage or photos on their phone.",
    "Well, these users can currently use cloud storage or external storage drives to expand the memory, but some people might prefer an on-device solution.",
    "In fact, most iPads don't even reach 1TB, with the sole exception being the iPad Pro range, so it's curious that Apple is bringing this high storage to its smartphones instead of its mid-tier tablets. Presumably the company saw more demand for high storage on phones, than iPads.",
    "We're expecting the iPhone 13 series to launch in late 2021 and we'll have to wait until then to see if this 1TB storage rumor is correct - before then, though, we're hearing loads of leaks and rumors, so stay tuned for more.",
    "Via Pocketnow"
  ],
  "headers": {
    "3": "Great for professionals"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "FrontPageTech": "https://www.youtube.com/watch?v=MgeTioKF6mU",
    "Pocketnow": "https://pocketnow.com/iphone-13-pro-could-have-a-1tb-storage-variant"
  }
}