{
  "source": "https://www.techradar.com/news/pc-players-can-finally-play-god-of-war-thanks-to-playstation-now",
  "title": "PC players can finally play God of War thanks to PlayStation Now",
  "category": "gaming",
  "updated": "2021-07-06T11:26:22Z",
  "author": "hamish-hector",
  "summary": "Experience one of the best games ever made",
  "article": [
    "The whole internet may be in love with Xbox Game Pass Ultimate, but that doesn’t mean Sony’s own PlayStation Now subscription isn’t worth keeping your eye on. That’s especially true this month with blockbuster games like God of War and Red Dead Redemption hitting the service today, July 6.",
    "God of War launched exclusively on PlayStation 4 consoles in 2018 and was one of the best games released that year. Even a few years later this soft reboot of the franchise is a must-play, and thanks to PS Now’s streaming options PC players will finally be able to experience the game for themselves.",
    "Alternatively, you could try some other blockbusters that are new to the service. Nioh 2 is sure to challenge even the most hardcore gamer with its difficult, Dark Souls-like gameplay, and Red Dead Redemption 2 from Rockstar (the makers of Grand Theft Auto V) will help you live out your dreams of becoming a cowboy in all its gruesome realism.",
    "If these games or others interest you, subscriptions to PS Now cost just $9.99/£8.99 a month, with discounts available if you opt for a quarterly or yearly subscription instead ($24.99/£22.99 and $59.99/£49.99 respectively).",
    "However, even if you’ve already tried these hits out, you’ve got some slightly less mainstream options to play instead.",
    "If you love Yakuza you’ll probably enjoy Judgement, a detective story from the same team. This psychological thriller will have you flex your investigative brain by tracking down clues but pumps up the action with Yakuza-style fighting too.",
    "If you’re looking for something to play with others, Moving Out is a hilarious multiplayer game that’s sure to remind you of Overcooked. If you prefer to game alone, that’s no problem as you can also play this game solo.",
    "Finally, these last two games are sure to excite sports fans. If you’re excited to finally watch the Tokyo Olympic Games this summer, why not show off your own skills in Olympic Games Tokyo 2020?",
    "It includes over 15 events to take part in, and you’ll be competing in virtual recreations of the official Tokyo Olympic venues. What makes it better is that it doesn't include any of those annoying Sonic or Mario characters either. It’s not the best sports game out there but could be a laugh if you’re looking for something different to play using your PS Now subscription.",
    "Last but not least, Nascar Heat 5 will be bringing the heat as you are put behind the wheel of your own stock car to become the 2020 Nascar Cup Series champion. You can race solo or with a friend (both online and split-screen) across 39 authentic tracks. Fans of Nascar will want to check this one out."
  ],
  "headers": {
    "4": "Lesser known hits",
    "7": "Eat my sports!"
  },
  "links": {
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Red Dead Redemption 2": "https://www.techradar.com/news/games-of-the-generation-red-dead-redemption-2-is-so-real-youll-feel-the-saddle-sores"
  }
}