{
  "source": "https://www.techradar.com/news/doctor-strange-2-facing-major-reshoots-ahead-of-2022-release-but-why",
  "title": "Doctor Strange 2 facing major reshoots ahead of 2022 release – but why?",
  "category": "entertainment",
  "updated": "2021-11-15T10:38:57Z",
  "author": "axel-metz",
  "summary": "Will it make its May 2022 release date?",
  "article": [
    "Doctor Strange in the Multiverse of Madness is currently in the midst of “significant” reshoots ahead of its scheduled release on May 6, 2022.",
    "According to multiple reports, cast and crew on the upcoming Marvel sequel have been roped back in to work on both “reshoots” and “additional photography” six days a week until the end of the year.",
    "It’s not yet clear whether the additional filming schedule has been actioned to incorporate rewritten scenes from the movie, though most sources seem to agree that the reshoots are simply a consequence of limited actor availability during the initial filming period.",
    "Reports also suggest that Covid-19 restrictions in the UK have played a part in the need for additional photography on Doctor Strange in the Multiverse of Madness – restrictions that last month forced Marvel to rejig a large portion of its 2022 Phase 4 release roster.",
    "We do know that Spider-Man director Sam Raimi remains in charge of the movie’s reshoots, though, working from material penned by Loki writer Michael Waldron.",
    "Admittedly, the additional work required by Doctor Strange’s second solo outing doesn’t come as much of a surprise. The need for end-of-year reshoots was revealed earlier in 2021 by actor Benedict Wong, who told Collider: \"We're having a lot of fun [but] we're finishing [reshoots] off in September, so we're nearly there.\"",
    "Wong’s September expectations were a little ambitious, then, but we’re glad to see the wheels are once again moving on one of next year’s most anticipated Marvel movies.",
    "As for the plot of Doctor Strange in the Multiverse of Madness, we do know that the movie will primarily concern, well... the multiverse.",
    "Details are few and far between, but we’re expecting Stephen Strange to be forced to face the consequences of creating the multiverse in the first place – if Spider-Man: No Way Home's first teaser trailer is anything to go by, that is. We may find out more on that front when No Way Home's second trailer arrives in the very near future, too.",
    "We also know that Benedict Cumberbatch, Benedict Wong, Rachel McAdams and Chiwetel Ejiofor will all be reprising their roles from the first movie, while Xochitl Gomez is so far the only announced newcomer. She’ll be starring as America Chavez, who also goes by the pseudonym Miss America.",
    "In the comics, Chavez hails from the Utopian Parallel, a dimension that exists out of space and time to the Marvel multiverse. When the Utopian Parallel is threatened by black holes, which would pull it in different directions across the multiverse, Chavez's mothers Amalia and Elena sacrifice themselves to stop this from happening.",
    "The sole survivor of her race, Chavez uses her abilities to open an inter-dimensional portal to find a new home – leading her to Earth (and therefore, we presume, Stephen Strange).",
    "We don't know if Chavez's comic origins will carry over into Doctor Strange in the Multiverse of Madness, or if she'll be introduced in a different way. But it’ll nonetheless be exciting to see another of Marvel's popular heroes make her live-action debut.",
    "We may have had our first look at the sequel’s villain, too, thanks to some revealing merchandise – but we’ll avoid potential spoilers for now. If you’re interested in finding out who that villain may be, check out our report on the leak.",
    "Beyond those bits of information, though, we’re still relatively in the dark as to where Doctor Strange in the Multiverse of Madness will take the ever-expanding MCU. One thing, however, is certain – this movie will have major consequences for the future of the franchise.",
    "For more Marvel content, check out the newly announced slate of MCU Disney Plus shows, as well as the first footage from Marvel's She-Hulk and Moon Knight series."
  ],
  "headers": {
    "7": "What will Doctor Strange 2 be about?"
  },
  "links": {
    "Doctor Strange in the Multiverse of Madness": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "multiple": "https://collider.com/doctor-strange-in-the-multiverse-of-madness-reshoots/",
    "reports": "https://www.hollywoodreporter.com/movies/movie-news/doctor-strange-multiverse-madness-reshoots-1235045328/",
    "sources": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/qu10te/kc_walsh_got_some_info_on_these_reshoots_and_what/",
    "forced Marvel to rejig": "https://www.techradar.com/news/marvels-phase-4-plans-in-tatters-as-it-delays-thor-4-black-panther-2-and-more",
    "Phase 4": "https://www.techradar.com/news/marvel-phase-4",
    "Loki": "https://www.techradar.com/news/loki-season-2",
    "revealed earlier in 2021": "https://www.techradar.com/news/doctor-strange-2-is-facing-reshoots-so-will-it-be-delayed",
    "Collider": "https://collider.com/shang-chi-benedict-wong-asians-assemble-doctor-strange-2-improv/",
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "first teaser trailer": "https://www.techradar.com/news/5-things-you-might-have-missed-from-the-spider-man-no-way-home-trailer",
    "arrives in the very near future": "https://www.techradar.com/news/spider-man-no-way-homes-next-trailer-arrives-this-week-but-theres-a-catch",
    "report on the leak": "https://www.techradar.com/news/doctor-strange-2s-villain-has-been-leaked-by-a-jigsaw-puzzle",
    "MCU Disney Plus shows": "https://www.techradar.com/news/agatha-harkness-spin-off-leads-new-slate-of-marvel-disney-plus-shows",
    "She-Hulk and Moon Knight series": "https://www.techradar.com/news/disney-pluss-she-hulk-and-moon-knight-marvel-series-now-have-writers"
  }
}