{
  "source": "https://www.techradar.com/news/jenna-coleman-teases-potential-xenoblade-chronicles-3-plot",
  "title": "One of the biggest RPGs on Nintendo Switch sounds like it's getting a direct sequel",
  "category": "gaming",
  "updated": "2021-08-10T15:12:50Z",
  "author": "hamish-hector",
  "summary": "Jenna Coleman probably wishes she could still travel back in time",
  "article": [
    "In a recent interview, Jenna Coleman let slip that she may soon be returning to the Xenoblade Chronicles series in a new Switch game. The Doctor Who star voiced Melia, a key character in the first game, and her comments (and subsequent “I don’t know if I’m supposed to say that”) suggest Xenoblade Chronicles 3 could be in the works.",
    "However, Coleman’s potential return to Xenoblade tells us a lot more about Xenoblade Chronicles 3 than we might first realize - giving us key details about its story and setting. If she is indeed playing Melia again, this suggests that the next game in the series will follow on from the originals’ story rather than Xenoblade Chronicles 2 (or Chronicles X).",
    "We’ll have to wait for the game to release to know for sure, and unfortunately, it might not be coming anytime soon. Recording sessions, particularly for long games like Xenoblade Chronicles titles, can begin even while the game is still deep in development. If you were hoping Xenoblade Chronicles 3 would bulk out Nintendo’s 2021 lineup, you’ll probably be disappointed.",
    "Xenoblade Chronicles 2 isn’t really a sequel in the usual sense - in a similar way to how Final Fantasy games don’t usually follow on from each other either. You’ll see many of the same ideas, themes and races but no characters or locations carry over. Well, not until the end.",
    "It turns out the events of both games are happening simultaneously in alternative realities. As Rex and the XC2 party reach the Architect (the creator god of Alrest where they live) Shulk from XC1 begins his fight with Zanza (his game’s final boss). Though it turns out that the Architect and Zanza are two halves of the same person – trapped between realities – so when Shulk successfully vanquishes one, both perish. Rex even briefly hears Shulk while talking to the Architect.",
    "However, based on Coleman’s comments, it looks like we’ll be saying so long to Rex and Pyra and hello again to Shulk and Melia when Xenoblade Chronicles 3 releases. This would certainly make a lot of sense, as the original game was recently remastered for the Nintendo Switch and even came with a new epilogue story to continue on from the main game. Now that new fans are familiar with these classic characters, it could be time for Nintendo to give them another chance in the spotlight."
  ],
  "headers": {
    "3": "Analysis: A second Xenoblade sequel?"
  },
  "links": {
    "recent interview": "https://www.youtube.com/watch?v=AcVjf-DuygM",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}