{
  "source": "https://www.techradar.com/news/android-11-is-coming-to-chromebooks-but-which-ones",
  "title": "Android 11 is coming to Chromebooks – but which ones?",
  "category": "computing",
  "updated": "2021-04-06T15:52:21Z",
  "author": "axel-metz",
  "summary": "Quite a few, apparently",
  "article": [
    "An online code repository has hinted at the Chromebook models set to receive OS upgrades to Android 11 – and don’t worry, Chromebook-owners, there’s quite a few on the list.",
    "While all Chromebooks are primarily powered by Chrome OS and frequently updated by Google, they also run Android in the background, which is important for keeping apps ticking over alongside Chrome’s browser tabs.",
    "Most Chromebooks are currently running Android 9, and those expected to receive updates to Android 11 and Chrome version 90 will benefit from new features including dark mode and uniform app scaling.",
    "The codenames for the Chromebook devices receiving these updates were listed by online repository Chromium Gerrit, and have since been cross-referenced by Android Police to produce a comprehensive list of the laptops, tablets and desktops expected to benefit from the OS upgrade. Here’s a selection of a few models from various manufacturers:",
    "The full list of devices can be found here.",
    "As mentioned, the upgrade to Android 11 will see many Chromebook users granted access to both a dark mode and uniform app scaling – two much-requested features over the past few years.",
    "Dark modes have become popular color settings for those prone to eye strain when viewing a screen for a prolonged period of time. Upon testing the new mode in the Chrome OS beta, Android Police reported that Android apps on Chromebook now take on a sleek, near-black background color that fits nicely with the rest of the Chrome OS UI.",
    "The Android settings menu looks the most polished, apparently, sporting a dark title bar and a bright teal accent color. Notifications, too, use a dark theme, though it’s worth noting that this hasn’t always been consistent when tested.",
    "Uniform app scaling will also come as a welcome upgrade to Chromebooks users. Historically, Android app scaling has been poor on Chrome OS, despite several fix attempts with previous updates. This time, though, reports suggest the overall layout, font and interface of Android apps are all far cleaner than before, making them more readable and less frustrating to use.",
    "Since these upgrades are still subject to beta testing, it’s unclear when you can expect Android 11 to arrive on your Chromebook device. It’s safe to assume, though, that all new Chromebooks will arrive running Android 11 upon release.",
    "Via Android Police"
  ],
  "headers": {
    "5": "What's the big deal?"
  },
  "links": {
    "online code repository": "https://chromium-review.googlesource.com/c/chromiumos/platform/tast-tests/+/2766177/4/src/chromiumos/tast/local/bundles/cros/arc/build_properties.go",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android Police": "https://www.androidpolice.com/2021/04/05/these-are-the-chromebooks-getting-android-11/",
    "here": "https://www.androidpolice.com/2021/04/05/these-are-the-chromebooks-getting-android-11/"
  }
}