{
  "source": "https://www.techradar.com/news/nhl-on-espn-plus",
  "title": "NHL on ESPN Plus: what ice hockey can I watch and how much does it cost?",
  "category": "entertainment",
  "updated": "2021-10-28T13:40:53Z",
  "author": "kevin-lynch",
  "summary": "Your guide to streaming all the puck-smashing action",
  "article": [
    "Sending a bottle rocket into the world of ice hockey broadcasting, it's all change for the 2021/22 season with streaming service ESPN Plus making a play to NHL fans in the US.",
    "With the teams back to playing a full season for the first time since the pandemic, the à la carte streaming service's comprehensive coverage means ice hockey fans in the US are spoilt for live NHL on ESPN Plus.",
    "The dedicated sports streaming service has broadcast a massive range of sports - including baseball, UFC and NFL - since its launch, and now it's seeking to become an indispensable subscription for hockey fans in the USA. ESPN Plus's exclusive coverage NHL extends to more than 75 games over the course of the season and 1,000+ in total.",
    "Aside from a midseason break for the Winter Olympics, it's back to the familiar autumn-through-to-late-spring schedule for the league. Defending champs Tampa Bay will be looking to make it three titles in a row, while the addition of newcomers the Seattle Kraken means this is set to be the biggest season ever, with 32 teams each playing 82 regular season games.",
    "With so much action on the ice to watch, read on to find out the latest info on what ESPN Plus NHL coverage gives you. We'll explain the cheapest ways to subscribe, the devices you can watch and what else you can watch aside from the quest for the Stanley Cup.",
    "While regular linear TV coverage is shared out amongst ESPN, ABC, TNT, TBS and local regional stations, ESPN Plus's emergence as a hockey broadcaster coincides nicely with the demise of NHL.tv as a way to watch NHL live streams.",
    "The network is promising to stream 75 exclusive national games over the course of the season.",
    "This means there will be live matches on the service every Tuesday and Friday in 2021, and from January every Tuesday and Thursday, plus a number of limited games on Fridays.",
    "On top of all that, ESPN Plus is set to show over 1,000 out-of-market games, with the option to select either the home or away team’s broadcast, while also simulcasting matches that are being nationally televised on ABC.",
    "It's also worth mentioning that all national games being shown live on TNT, will be available for replay on ESPN Plus.",
    "ESPN Plus' free trial promotion is unfortunately no longer offered by the network, and there's currently nothing in the way of discounts or offers from ESPN directly or any partnering cable providers for the streaming service.",
    "But it's not the end of the world - a subscription which will currently set you back a pretty reasonable $6.99 a month or $69.99 yearly which will give you access to all the NHL coverage ESPN Plus provides.",
    "It's also worth noting that with ESPN jointly owned by Disney, the entertainment giant offers a bundle that lets you get ESPN Plus, Disney Plus and Hulu for a bargain monthly price of just $13.99. You can sign up for the bundle by visiting Disney Plus's website here.",
    "Sign up to that package and and you'll get all the sports action that ESPN Plus offers, plus access to a vault of Classic Disney Animations, Pixar movies, and documentaries from National Geographic, the entire Marvel and Star Wars film library via Disney Plus as well as having access to Hulu's films, TV shows and hot originals like Nine Perfect Strangers and Only Murders in the Building.",
    "Its a pretty substantial saving - subscribing to each service separately, would set you back $18.97 a month, or $24.97 if you opted for Hulu without ads, making the $13.99 monthly asking price for the bundle one of the best value streaming offers available right now.",
    "ESPN Plus is available on a multitude of devices, thanks to the service's wide support of different tablets, smartphones, games consoles, as well as PCS.",
    "You can also watch ESPN Plus on any modern web browser by heading to the service's website and signing up for the service.",
    "Gamers can now access ESPN Plus on the next generation of consoles with support for PS5, Xbox Series S and Series X as well as older machines such as all Xbox One models and the PS4,. The only current major gaming device that doesn't have its own dedicated ESPN Plus app for some reason is the Nintendo Switch.",
    "For those looking to watch NHL action on the go, you can download the ESPN app from either the Apple App Store or Google Play Store and sign up for the service there.",
    "For those looking to settle in and watch the ice hockey in their living rooms, ESPN Plus is available on Apple TV, Chromecast and the Amazon Fire TV platform - and is also now on the Roku platform as well.",
    "ESPN Plus' sporting riches extend far beyond their exclusive live ice hockey coverage, with the service also streaming top-tier live action from a wide array of other sports, including baseball, soccer, basketball, T20 cricket and American football.",
    "A subscription gives you access to PGA Tour coverage, a wealth of international soccer plus every out-of-market MLS match, as well as one NHL and MLB game per day during their respective regular seasons.",
    "Top of the pile for combat sports fans will be ESPN Plus' unmatched exclusive coverage of UFC live streams, with the service boasting the rights to all of the MMA promotion's events in the US.",
    "This means you'll be able to watch every Fight Night as well as numbered PPV event that are now shown on ESPN Plus (although the latter still requires viewers to pay a PPV fee for access).",
    "If that wasn't enough, you'll also have on-demand access to ESPN Plus' exclusive original sports programming, including the network's award-winning 30 for 30 documentaries, alongside must-see programmes like The Fantasy Show and the acclaimed sports analysis series Detail."
  ],
  "headers": {
    "5": "NHL on ESPN Plus: what can I watch?",
    "10": "How much does it cost to watch NHL on ESPN Plus?",
    "15": "What devices can I watch NHL on ESPN Plus with?",
    "20": "What other sport content can I watch on ESPN Plus?"
  },
  "links": {
    "ESPN Plus": "https://www.techradar.com/news/espn-plus-devices-apps-included-sports-costs-explained",
    "watch NHL live streams": "https://www.techradar.com/news/nhl-live-stream-202122-how-to-watch-every-hockey-game-online-from-anywhere",
    "ESPN Plus' free trial": "https://www.techradar.com/news/espn-plus-free-trial",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "visiting Disney Plus's website here": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1224277261628806000&sharedId=trd-us&u=http%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fbundle",
    "heading to the service's website": "https://watch.espnplus.com/",
    "Apple TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/apple-tv-1269228/review",
    "Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Amazon Fire TV": "https://www.techradar.com/reviews/amazon-fire-tv-2017-review",
    "UFC live streams": "https://www.techradar.com/news/ufc-live-stream-watch-fight-night-events-ppv-online-anywhere"
  }
}