{
  "source": "https://www.techradar.com/news/everwild-reportedly-rebooted-now-targeting-2024-release-date",
  "title": "Everwild reportedly rebooted, now targeting 2024 release date",
  "category": "gaming",
  "updated": "2021-06-14T21:20:53Z",
  "author": "samuel-tolbert",
  "summary": "Magic awaits years off",
  "article": [
    "Rare's Everwild has been \"completely rebooted\", and it's going to be a while before we get our hands on it, according to a new report.",
    "New IP Everwild was revealed by Rare at X019 but, following the release of two trailers for the title, the developer has been pretty tight-lipped about the Xbox exclusive since - with Everwild noticeably absent from the Xbox and Bethesda Games Showcase at E3 2021.",
    "According to a report from VGC, that's because Everwild has been rebooted with a new creative director and a tentative 2024 release window target, with the game's initial design having been \"started from scratch\".",
    "VGC reports that the team developing Everwild had been struggling with defining \"a clear direction for the title\". Following the departure of Creative Director Simon Woodroofe from the project last year, Rare veteran Gregg Mayles has since been brought in to lead Everwild's development.",
    "As a result of this leadership change, the game has reportedly been rebooted with a 2024 target in mind.",
    "“The team behind Everwild continue to shape a truly magical experience and remain focused and excited about creating a new game centered around a truly unique, new world,” said Rare executive producer Louise O'Connor, in a statement to VGC.",
    "“Gregg Mayles joined us, late last year as Creative Director, and the team has never been stronger. Since showing the world our Eternals trailer, we have been making progress on all aspects of Everwild.",
    "“The team continues to work hard to realize our vision and to bring the magic of nature in Everwild to life for players around the world.”",
    "While it seems like players won't be embarking on a journey into Everwild soon, it's not the only title Rare is currently working on. Pirate adventure Sea of Thieves continues to grow, having an ambitious crossover with Pirates of the Caribbean announced during the Xbox and Bethesda Games Showcase at E3 2021.",
    "Sea of Thieves crossed 20 million players earlier this year as the game reached its third anniversary since launching in March 2018.",
    "Rare hasn't officially confirmed that Everwild has been rebooted, but we're hoping that we'll get some sort of update on the Xbox exclusive's development in the near future."
  ],
  "headers": {
    "8": "Adventures on the seas in the meanwhile"
  },
  "links": {
    "Everwild": "https://www.techradar.com/news/everwild-release-date-trailers-news-rumors",
    "Xbox and Bethesda Games Showcase": "https://www.techradar.com/news/xbox-and-bethesda-at-e3-2021-five-huge-announcements-you-need-to-see",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "VGC": "https://www.videogameschronicle.com/news/why-wasnt-everwild-at-e3-its-been-completely-rebooted/",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
    "ambitious crossover": "https://www.techradar.com/news/sea-of-thieves-a-pirates-life-is-a-crossover-with-disneys-pirates-of-the-caribbean",
    "crossed 20 million players": "https://www.windowscentral.com/sea-of-thieves-20-million-players"
  }
}