{
  "source": "https://www.techradar.com/news/this-nvidia-rtx-3080-crypto-mining-rig-was-built-into-a-bmw-just-to-annoy-gamers",
  "title": "This Nvidia RTX 3080 crypto mining rig was built into a BMW 'just to annoy gamers'",
  "category": "computing",
  "updated": "2021-01-26T11:19:32Z",
  "author": "jess-weatherbed",
  "summary": "Driving us around the bend",
  "article": [
    "The Nvidia GeForce RTX 3080 is an absolute beast of a graphics card, and something many of us have been desperately trying to get our hands on the play the best PC games. It seems that trolls are happy to salt those wounds however, as an established crypto miner has created a portable mining farm in the trunk of a BMW i8 using six RTX 3080 GPUs. Stock issues have plagued the launch of Nvidia's Ampere-powered RTX 3000 series, with high demand and bots buying up stock to resell online at inflated prices. Crypto miners have also been partially responsible for the shortage of next-gen PC gaming hardware, and a few are really making a name for themselves.",
    "Some of you might remember Simon Byrne as the guy who created a huge mining rig with 78 PNY RTX 3080s (you can look at this monster for yourself at Techarp), which is 78 more RTX 3080s than most people are able to get their hands on right now. That's between $54,522 (retail price) and $93,522 (estimated cost after inflated stock hit sites like eBay) worth of hardware.",
    "Toms Hardware reached out to Byrne to verify that the images of the BMW mining rig were the real deal, which was met by not only a confirmation that the system was built himself, but was also created \"just to annoy gamers\". Byrne also doesn't appear to be mining for investment, or out of any interest in the money itself. His interest in crypto appears more societally focused, as despite allegedly building his BMW mining rig for the sole purpose of trolling the gaming community, he conveyed his opinion to Toms Hardware that \"Cryptocurrency is open-sourced & decentralized. It's trustless, and there isn't interference from a third party. No one owns or controls it, and it does not have a governing body. Crypto may be driven by code, but it's fueled by a passionate, altruistic, open-sourced community... I'm not in Crypto to make a fast buck, but I'll take the bonus; I'm in it because it's a vision of a utopian world where services are acquired through voluntary relationships.\"",
    "The BMW i8 is a perfect choice for this kind of bizarre novelty build, and more than powerful enough to run the miniature RTX 3080 farm. The mining rig consumes 1500W, but the hybrid car packs 369 horsepower and can output up to 3500W, with more than half of the car's power coming from electric motors. The main issue with the build is, unsurprisingly, airflow. The risk of overheating the mining rig means that the system can only be run when the trunk of the car is open, so Byrne will need to park up outside gaming conventions and events if he wants to grab the disgruntled attention of PC gamers in person. He won't be doing any slow drive-bys to show off his trollish mining rig, but at least the car can do 0-60mph in under 4.5 seconds, should he need to make a speedy escape from the folk he's actively trying to wind up.",
    "Back in November 2020, we heard from Nvidia CFO Colette Kress that it would take a few months for Nvidia Ampere availability to catch up with demand, but if we start seeing more crypto miners moving away from dedicated ASIC cards and back using GPUs intended for gaming then shortages may continue.",
    "For now, the Ampere-powered video cards are still scarce and will likely continue to be elusive for some time. Inventory updates are sporadic for existing models, but with the next generation of gaming laptops soon to hit the shelves, equipped with mobile RTX 3000 series GPUs, more of the gaming community should be able to get their hands on the latest ray tracing capable hardware in 2021.",
    "Via Toms Hardware"
  ],
  "headers": {
    "3": "Drivers and drive trains"
  },
  "links": {
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "mining rig": "https://www.techradar.com/best/mining-rigs",
    "Techarp": "https://www.techarp.com/computer/crypto-mining-78-rtx-3080/",
    "Toms Hardware": "https://www.tomshardware.com/news/the-fastest-rtx-3080-mining-rig-is-a-bmw-i8",
    "we heard from Nvidia CFO Colette Kress": "https://www.techradar.com/news/nvidia-rtx-3080-stock-woes-could-persist-well-into-2021",
    "crypto": "https://www.techradar.com/news/best-bitcoin-wallets",
    "dedicated ASIC cards": "https://www.techradar.com/best/asic-devices"
  }
}