{
  "source": "https://www.techradar.com/news/panasonic-gh6-will-likely-have-8k-video-powers-heres-why",
  "title": "Panasonic GH6 mirrorless camera will likely have 8K video powers – here's why",
  "category": "cameras",
  "updated": "2021-02-03T16:15:18Z",
  "author": "mark-wilson",
  "summary": "New rumor suggests 8K video is on the cards...",
  "article": [
    "The Panasonic GH6 rumors have gone very quiet since we saw last saw excited chat about the incoming hybrid camera in mid-2020 – but now some fresh speculation has revealed that the camera will likely be capable of shooting 8K video.",
    "According to 43Rumors, a source has confirmed that Sony will be launching a new Micro Four Thirds sensor in 2021 – and that this sensor \"will be able to record 8K video and have a 30+MP resolution\".",
    "The site, which has a pretty good track record with Panasonic and Olympus rumors, adds that it has \"little doubt this is the sensor that Panasonic will use on the GH6\".",
    "A new sensor would be an essential addition to the Panasonic GH6, given that its Panasonic GH5 predecessor launched over four years ago and is now dated in some respects, such as autofocus performance.",
    "But while rumors of a new sensor aren't a surprise, a move to 8K resolution certainly isn't straightforward for a Micro Four Thirds (MFT) camera like the rumored GH6.",
    "This is because MFT sensors are smaller than equivalents like APS-C and full-frame chips, which means cramming in the smaller pixels needed for 8K video resolution can cause knock-on effects like higher noise.",
    "Of course, Panasonic will have plans to combat any such issues, with previous rumors suggesting that the new Sony sensor has been adapted from security and surveillance cameras that are designed to cope well in low light.",
    "The Panasonic GH5, which the GH6 would succeed, was a groundbreaking video camera when it arrived in January 2017.",
    "It brought features like an ability to shoot 4K video with 10-bit 4:2:2 subsampling internally, which has only recently become more prevalent on cameras with larger sensors – so it's no surprise to hear rumors that the Panasonic GH6 could again raise the video bar again with 8K recording.",
    "It wouldn't be the first mirrorless camera that's capable of shooting 8K – both the Canon EOS R5 and Sony A1 can do that, albeit with various restrictions like recording limits – but the GH6 could well become the first genuinely practical 8K camera at its size and price point.",
    "This would be a natural evolution for the series, so the rumors certainly make sense. Right now, the Panasonic GH5S can shoot 4K/60p video, while the cheaper GH5 already has a 6K/30p mode, although this is effectively a tweak of its 6K burst stills mode.",
    "While very few filmmakers need to deliver videos or movies in 8K right now, this feature could both future-proof the camera and provide shooters with handy bonus options when shooting in 4K, such as cropping a scene to provide an extra, tighter shot from one take.",
    "That said, it seems unlikely that all cameras in the rumored Panasonic GH6 series will offer 8K resolution – so it remains to be seen which ones of the three rumored variants (GH6, GH6V and GH6X) will get the trick.",
    "While we're no closer to finding out a possible Panasonic GH6 release date, hopefully this rumor will be the start of a fresh run of speculation that will finally lead to the mirrorless camera's long-awaited launch in 2021."
  ],
  "headers": {
    "7": "Six pack"
  },
  "links": {
    "Panasonic GH6": "https://www.techradar.com/news/panasonic-gh6-release-date-price-specs-and-features",
    "43Rumors": "https://www.43rumors.com/ft5-confirmed-new-sony-mft-sensor-records-8k-video/",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1"
  }
}