{
  "source": "https://www.techradar.com/news/vivos-new-top-spec-android-phone-is-here-but-you-might-as-well-ignore-it",
  "title": "Vivo's new top-spec Android phone is here - but you might as well ignore it",
  "category": "phones",
  "updated": "2021-09-09T13:54:13Z",
  "author": "tom-bedford",
  "summary": "Vivo X70 isn't coming to Europe",
  "article": [
    "The Vivo X70 series is here - it's a new trio of flagship Android phones from Chinese tech company Vivo, launching just nine months after the Vivo X60 series debuted.",
    "Launched at an unveiling event in China, the Vivo X70 is joined by a Pro model, which is similar but with a few improvements, and the Pro Plus, which is an all-around better-sounding phone but comes as a pricier counterpart.",
    "Normally we'd be reporting on each of these devices, and bringing you their specs in case the handsets ever launched outside China - but there's no need, because we already know they won't come to the US or UK.",
    "Vivo has confirmed to TechRadar that it has \"no plans to launch the X70 series in Europe\". Furthermore, the company doesn't currently sell its phones in the US, meaning it won't launch there either.",
    "As a result, if you're reading this, you likely won't end up being able to buy the device - that's unless you import it, of course.",
    "Vivo is one of many Chinese tech companies that's started selling smartphones in Europe in recent years, but unlike rivals like Xiaomi, Realme and Oppo, it's been really tentative in its approach, only releasing a few phones each year.",
    "That makes sense for the X70, as it only launched the Vivo X60 Pro in the UK several months prior, but a disconnect between Chinese and global launches for products often means consumers have lost interest in a device by the time it becomes available to buy. Hopefully we'll see the Vivo X80 line at the same time around the world then."
  ],
  "headers": {
    "3": "Analysis: no global release"
  },
  "links": {
    "Vivo X70": "https://www.techradar.com/news/vivo-x70",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Vivo X60": "https://www.techradar.com/reviews/vivo-x60-india",
    "Vivo X60 Pro": "https://www.techradar.com/reviews/vivo-x60-pro"
  }
}