{
  "source": "https://www.techradar.com/news/ps-plus-free-games-for-july-include-a-gripping-ps5-adventure",
  "title": "PS Plus free games for July include a gripping PS5 adventure",
  "category": "gaming",
  "updated": "2021-06-30T16:42:14Z",
  "author": "vic-hood",
  "summary": "Sony has announced July's PS Plus free games",
  "article": [
    "Sony has announced its PS Plus free games offering for July - and it's another stellar line-up.",
    "In July 2021, PS Plus subscribers can pick up A Plague Tale: Innocence (PS5), Call of Duty: Black Ops 4 (PS4) and WWE 2K Battlegrounds (PS4).",
    "The critically acclaimed A Plague Tale: Innocence is a real standout here. The narrative-driven adventure follows the grim tale of Amica and her young brother, Hugo, as they are hunted by the Inquisition - all while the Black Death ravages the world around them.",
    "A Plague Tale has a gripping (and emotional) story that will keep you enthralled throughout. In addition, the PS5 version makes a bunch of improvements over the PS4 version, upgrading the title to 4K at 60fps, improving load times and audio enhancement, implementing DualSense features and allowing for cross progression.",
    "It's a great chance to play A Plague Tale: Innocence before its sequel, A Plague Tale: Requiem, releases next year.",
    "Also up for grabs is Call of Duty: Black Ops 4 on PS4. Released in 2018, Treyarch's multiplayer first-person shooter was the first Call of Duty title to lack a campaign, instead featuring a Solo Missions mode to let players get to know the game's Specialists better. In addition, Black Ops 4 features Multiplayer mode, Blackout mode and the iconic Zombies mode, giving you plenty of ways to play with friends online.",
    "Finally, PS Plus subscribers can pick up WWE 2K Battlegrounds. It's not your traditional WWE 2K game, instead featuring an arcade-style more in-tune with WWE Allstars.",
    "Remember, while Black Ops 4 and WWE 2K Battlegrounds are PS4 versions, you can also play any of these PS4 games on PS5 through backwards compatibility – though PS4 players won't be able to play A Plague Tale: Innocence, which is a native PS5 title.",
    "All these PS Plus free games are available to claim from July 6 through August 2. What's more, Virtua Fighter (from last month's offering) is still available until August 2.",
    "You need to be an active PlayStation Plus subscriber to pick up these free PS Plus games – and they're yours to play whenever you want as long as you remain a subscriber.",
    "Being a PS Plus subscriber means you can play online with friends, but also lets you take advantage of discounts and free games each month. It's a great way to try PlayStation games you might not otherwise have played, whether they're indie titles that slipped under your radar, or titles that were too expensive to buy at launch.",
    "Each month we see Sony offering a mix of PS4 and PS5 games, so it's worth getting even if you haven't upgraded yet."
  ],
  "headers": {
    "9": "Free PS4 and PS5 games each month"
  },
  "links": {
    "PS Plus free games": "https://www.techradar.com/news/playstation-plus-free-games",
    "Call of Duty: Black Ops 4": "https://www.techradar.com/news/call-of-duty-black-ops-4-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "backwards compatibility": "https://www.techradar.com/news/what-is-backwards-compatibility-the-key-ps5-and-xbox-series-x-feature-explained"
  }
}