{
  "source": "https://www.techradar.com/news/you-can-transfer-your-diablo-2-save-file-to-resurrected-even-if-its-decades-old",
  "title": "You can transfer your Diablo 2 save file to Resurrected – even if it's decades old",
  "category": "gaming",
  "updated": "2021-03-05T15:28:10Z",
  "author": "adam-vjestica",
  "summary": "Delightfully devilish",
  "article": [
    "Diablo 2 Resurrected will let you transfer your original save files from Blizzard’s iconic RPG, Diablo 2, even though it was released over two decades ago.",
    "Diablo 2 Resurrected producer Matthew Cederquist told IGN: “Yes, keep your old save files. Back when we were working on [the remaster], we wondered if the old save files would work, so we kind of shoved it in, and it worked! So yes, your local single-player save files will carry over.”",
    "The news will be welcome to those who have already sunk countless hours into Blizzard’s action RPG, or to anyone who may have dipped their toes into the world of Diablo 2 recently. It’s also rather rare that developers support the option to import older file saves into remasters or remakes.",
    "The long-awaited remaster of Diablo 2 was finally announced during BlizzCon 2021, much to the elation of fans. The game is still popular today thanks to its addictive loot system and randomized dungeon elements that helps give the title a near-infinite level of re-playability.",
    "Diablo 2’s DNA can be seen in many popular games today like Destiny 2 and Borderlands. The remaster will keep the feel of the original game, but add in Dolby 7.1 surround sound support and the ability to let players switch between the original sprite-based textures or updated graphics.",
    "The game will also take full advantage of modern PC hardware, allowing those who have the horsepower to run the title at 4K resolution and 144Hz.",
    "Diablo 2 Resurrected is set to release on PC, Xbox One, Xbox Series X/S, PS4, PS5 and Nintendo Switch sometime during 2021. It isn’t the only Diablo game in the works, though. Blizzard is also releasing Diablo Immortal, a mobile game, and is still working hard on Diablo 4."
  ],
  "headers": {
    "4": "Mark of the devil"
  },
  "links": {
    "Diablo 2 Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "IGN": "https://me.ign.com/en/pc/182380/interview/what-it-takes-to-remaster-a-cult-classic-like-diablo-ii",
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "4K resolution and 144Hz": "https://www.techradar.com/news/diablo-2-resurrected-is-a-4k144hz-remaster-of-diablo-2-for-pc-and-consoles",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Diablo Immortal": "https://www.techradar.com/news/diablo-immortal-release-date-news-trailers-phones",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors"
  }
}