{
  "source": "https://www.techradar.com/news/gta-5-enhanced-edition-looks-exactly-the-same-as-fans-slam-games-latest-trailer",
  "title": "GTA 5 Enhanced Edition looks ‘exactly the same’ as fans slam game's latest trailer",
  "category": "gaming",
  "updated": "2021-09-13T09:29:33Z",
  "author": "adam-vjestica",
  "summary": "Will you be returning to Los Santos?",
  "article": [
    "Rockstar’s GTA 5 Enhanced Edition’s latest trailer may have racked up over a million views on YouTube, but it’s also drawn the wrath of angry commenters who believe that the game looks “exactly the same” as the PS4 and Xbox One versions.",
    "The game was shown off at Sony’s PlayStation Showcase, with the latest trailer stating that the GTA 5 Enhanced Edition will feature “improved graphics, enhanced gameplay, and seamless character switching”.",
    "The problem is, though, it appears that people are unable to spot any improvements over what we’ve already seen – and Rockstar’s vague statements certainly haven’t helped. The trailer has currently amassed 90K dislikes and only 23K likes, which isn’t something you’d expect to see from a game as beloved as GTA 5.",
    "YouTube commenter Joey J wrote, \"they didn't even compare the 'enhanced' graphics to last gen because it would look exactly the same\", while TheProfessional said: \"Is this really expanded and enhanced? It looks no different then [sic] the PS4 version.\"",
    "The crux of the issue with GTA 5 Enhanced Edtion, of course, is that it was originally released in 2013 for PS3 and Xbox 360. The game was then upgraded for PS4 and Xbox One and later released on PC. Twitter user Lord Balvin summed up how a lot of people are feeling below when it comes to GTA 5. (Warning: contains strong language):",
    "Seeing the game release for a third time on consoles with no sign of GTA 6 on the horizon is obviously frustrating, but Rockstar has good reason for repackaging GTA 5. The game continues to sell millions of copies every year and GTA Online also is lucrative a money-spinner for the company.",
    "It’s safe to say that GTA 5 Enhanced Edition will run at 60fps on consoles for the first time and target a resolution of 4K. But other than that, it is difficult to spot any genuine and noticeable improvements over what we’ve seen before.",
    "It looks like a rather unambitious port on the face of things, which is a shame when you consider how the PC modding community has consistently managed to transform the game into something that looks truly next-gen. From adding ray tracing, more realistic cars, and textures, modders have injected new life into GTA 5 and it’s a shame that Rockstar hasn’t tried to do the same.",
    "With GTA 6 reported to be a number of years away, it's understandable that some fans are tired of playing the same game that was released in 2013, even if it has been improved in some way. A rumored remake of GTA 3, GTA Vice City, and GTA San Andreas could ease the wait somewhat, but again, these are still games that many of us have played countless times before.",
    "Curiously, despite being a port of a game from 2013, GTA 5 Enhanced Edition’s release date has slipped from November 11, 2021, to March 2022. The game is set to release on PS5 and Xbox Series X/S. We’ll have to wait and see if consumers will pick up the game for potentially the third time."
  ],
  "headers": {
    "6": "Analysis: what can we expect from GTA 5 Enhanced Edition?"
  },
  "links": {
    "GTA 5 Enhanced Edition": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Sony’s PlayStation Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "The trailer": "https://www.youtube.com/watch?v=xQT-O1nMSBU",
    "Xbox 360": "https://www.techradar.com/news/gaming/consoles/how-the-xbox-360-won-the-console-war-1196990",
    "GTA 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6",
    "GTA Online": "https://www.techradar.com/news/is-gta-online-actually-good-in-2021",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "GTA 6 reported to be a number of years away": "https://www.techradar.com/news/gta-6-release-date-might-have-just-been-discovered-and-its-bad-news",
    "GTA 3, GTA Vice City, and GTA San Andreas": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}