{
  "source": "https://www.techradar.com/news/this-new-cheap-nokia-phone-has-5g-and-an-absolutely-giant-screen",
  "title": "This new cheap Nokia phone has 5G and an absolutely giant screen",
  "category": "phones",
  "updated": "2021-09-22T12:42:15Z",
  "author": "tom-bedford",
  "summary": "Perfect for streaming",
  "article": [
    "There are few 5G phones that are as affordable as the best 4G cheap phones, but the new Nokia G50 is one of that select company. It's just been launched by HMD Global, ahead of an October event when people thought we'd be seeing the device.",
    "This is a supremely affordable phone, costing only £199 in the UK. That converts to just $270 or AU$380, though we don't have availability information outside the UK just yet – either way, that's one of the cheapest 5G phones we've ever seen.",
    "That's not all there is to like about it though, as it has a giant 6.82-inch screen, which makes it slightly bigger than the Samsung Galaxy S21 Ultra. It's a HD+ screen, so doesn't have as many pixels as a mid-range or top-end phone, but many people won't mind, especially when streaming videos over the internet.",
    "There are three rear cameras, with a 2MP depth-sensing and 5MP ultra-wide snapper joining a 48MP main. The chipset is a Snapdragon 480 which is a low-end processor and could be the main issue with the device.",
    "There's a 5,000mAh battery which promises to keep the phone ticking for days, as well as an 18W charger which will likely take several hours to power the phone up.",
    "When we've spent a long amount of time with the phone we'll bring you a full analysis, but for now we've written an initial Nokia G50 review.",
    "Take any form of public transport, whether it's a cross-country train or a small-town bus, and you'll probably see people watching TV or a movie on their smartphone.",
    "The Nokia G50 feels designed for that kind of user. Thanks to its 5G, you can easily and quickly download videos onto your chosen streaming app, or just stream them straight from the web if you want.",
    "With a big screen, you'll be able to see the video in good detail, and for something like this, it's better to have a big HD+ screen than a small FHD+ one, as you'll still be able to see more.",
    "Plus, the big battery ensures you'll be able to watch an episode of something on your way to work and still get a day of use from the phone, which is a useful extra perk. 5G and big screens can also be a big draw on power, so you could argue the 5,000mAh battery is necessary.",
    "Sure, some people might want a higher-res screen, a more powerful device so they can game too, or perhaps some other feature which costs a bit more. But HMD Global's whole strategy is aiming at the popular budget phone market, and the Nokia G50 promises to be an important and competitive device there."
  ],
  "headers": {
    "6": "Analysis: perfect for streaming fans"
  },
  "links": {
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "Nokia G50": "https://www.techradar.com/reviews/nokia-g50-review",
    "an October event": "https://www.techradar.com/news/nokia-sets-an-event-for-october-6-nokia-g50-smartphone-launch-expected",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "initial Nokia G50 review": "https://www.techradar.com/reviews/nokia-g50-review"
  }
}