{
  "source": "https://www.techradar.com/news/ericsson-and-samsung-settle-patent-dispute",
  "title": "Ericsson and Samsung settle patent dispute",
  "category": "phones",
  "updated": "2021-05-07T11:38:33Z",
  "author": "steve-mccaskill",
  "summary": "New agreement will boost patent income for Ericsson",
  "article": [
    "Ericsson and Samsung have settled their legal battle and signed a global cross-licensing patent agreement for their respective cellular technologies.",
    "Both companies had filed disputes in courts in the US and elsewhere after failing to reach a new royalty settlement.",
    "The finer details of the new agreement will remain confidential, but it is said to be a “multi-year” arrangement that covers all mobile standards, including 5G, across both network infrastructure and handsets.",
    "A fall in licensing income was the only real blot on the copybook of Ericsson’s Q1 results, which were boosted by demand for 5G equipment as operators around the world continue their rollouts. Patent royalties are becoming increasingly important sources of revenue for many companies, as more devices become connected and 5G enables entirely new types of application.",
    "Patent holders that contribute their innovations to industry standards, such as 5G, benefit from increased royalties from every device sold. However, these patents must be made available to other companies at fair, reasonable and non-discriminatory (FRAND) terms.",
    "In a bid to maximize patent income without risking litigation, many major 5G patent holders are imposing caps on royalties. Nokia, for example, expects to make €3 (£2.60) from every device sold, while Huawei has capped its royalties at $2.50 (£1.80).",
    "By reaching a new agreement with Samsung, Ericsson says it expects patent income to be between 2 billion (£171m) and 2.5 billion SEK (£214m) during Q2, although it warns other factors such as geopolitics and the shift from 4G to 5G could have an impact going forward.",
    "“We are delighted to sign a mutually beneficial agreement with Samsung. This important deal confirms the value of our patent portfolio and further illustrates Ericsson’s commitment to FRAND principles,” said Christina Petersson, Chief Intellectual Property Officer at Ericsson."
  ],
  "headers": {
    "3": "Ericsson Samsung patents"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}