{
  "source": "https://www.techradar.com/news/zoom-isnt-going-away-just-yet",
  "title": "Zoom is more popular than ever, despite the critics",
  "category": "computing",
  "updated": "2021-11-23T16:42:52Z",
  "author": "mike-moore",
  "summary": "More big customers and continued rise in revenue make for another successful quarter for Zoom",
  "article": [
    "The return to offices across the world has proven to be less of an issue for Zoom than previously expected, the company has revealed.",
    "The video conferencing service has issued its most recent quarterly financial results, revealing it is still expanding its customer base as hybrid working becomes more popular for businesses around the world.",
    "In its Q3 2021 results, Zoom recorded $1.0 billion in revenues, up 35% year-on-year, with a third quarter GAAP operating margin of 27.7%.",
    "Zoom says it has seen particular success in drawing in larger customers, with a total of 2,507 customers now contributing more than $100,000 each in trailing twelve months revenue, an increase of around 94% from the same quarter in its 2020 financial year.",
    "These customers represented nearly a quarter (22%) of all Zoom's revenue in its Q3 2021, up from 18% the previous year, with the company also boasting 512,100 customers with more than 10 employees, up from around 504,900 in its last quarter.",
    "“Through innovation and dedication, we will continue to deliver happiness to our customers,\" Zoom founder and CEO Eric Yuan said.",
    "\"We are well on our way to becoming an indispensable platform for enterprises, individuals, and developers to connect, collaborate, and build in the flexible hybrid world of work. We believe our global brand, innovative technologies, and large customer base position us well for the future.”",
    "Yuan added that Zoom was now on to close the year between $4.079 to $4.081 billion in total revenue, representing approximately 54% year-over-year growth.",
    "Zoom has been working hard to continue the amazing growth it enjoyed during the pandemic as it attempts to keep track with rivals such as Microsoft Teams.",
    "This includes recent updates such as live transcription, which is now available for all free Zoom accounts, after having only previously been offered to paid subscribers.",
    "The feature, which provides automatic captioning during a Zoom video call, is now available on all free Zoom Meetings accounts, alongside other accessibility features including keyboard accessibility, pinning or spotlighting interpreter video, screen reader support and voicemail transcription to make its video conferencing software accessible to even more users."
  ],
  "headers": {
    "3": "Zoom boost"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "said": "https://investors.zoom.us/news-releases/news-release-details/zoom-reports-financial-results-third-quarter-fiscal-year-2022",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "live transcription": "https://www.techradar.com/news/zoom-free-users-are-getting-this-super-helpful-feature-at-last"
  }
}