{
  "source": "https://www.techradar.com/news/you-can-now-play-valheim-in-vr",
  "title": "You can now play Valheim in VR",
  "category": "gaming",
  "updated": "2021-04-06T09:00:43Z",
  "author": "gerald-lynch",
  "summary": "VR Valhalla vibes",
  "article": [
    "Valheim is the surprise breakout hit of 2021 – and you can now play it in a surprise place. A Valheim VR mod allows you to don your virtual reality headset of choice and jump into the viking survival themed action from a first-person, axe-swinging perspective.",
    "It's a native VR mod, working with the retail version of the game, so you'll need the base Valheim game for starters. You'll then need to grab the BepInExPack for Valheim, which allows custom code to be inserted into the game, and then head over to the Nexus Mods portal where you can download and install the VHVR mod itself.",
    "Once in, it's a pretty full-featured VR experience, making every element of the main game accessible in virtual reality, complete with floating menus and full head tracking.",
    "Motion controllers aren't supported – you'll need to use a gamepad or mouse and keyboard still. And you'll need to remember that not only is the game not originally optimised by its Swedish developer Iron Gate Studios, but that it's still an early access title. So expect things to be more than a little rough around the edges, and perhaps more prone to crashes and unwanted VR side-effects than other VR mods, let alone native VR games. But it remains an exciting way to try this dark horse of a game, and one we'd like to see the developers explore themselves.",
    "The procedurally-generated VR game has already been bought more than five million times, despite not yet being a full-release title. For many gamers, it's solving lots of the problems that survival games are stuck with, such as crippling grinding, harsh death penalties and action-slowing resource management. It's well worth a try if you've been intrigued by the genre in the past, but been put off by some of its more rigid rule sets."
  ],
  "headers": {
    "2": "A worthy VR experiment"
  },
  "links": {
    "Valheim": "https://www.techradar.com/news/why-you-should-be-playing-valheim",
    "BepInExPack": "https://valheim.thunderstore.io/package/denikson/BepInExPack_Valheim/",
    "VHVR": "https://www.nexusmods.com/valheim/mods/847"
  }
}