{
  "source": "https://www.techradar.com/news/doctor-strange-2-filming-in-the-uk-has-been-delayed-says-elizabeth-olsen",
  "title": "Doctor Strange 2 filming in the UK has been delayed, says Elizabeth Olsen",
  "category": "entertainment",
  "updated": "2021-01-06T18:45:19Z",
  "author": "emma-boyle",
  "summary": "There's been a pause in production due to coronavirus surge",
  "article": [
    "Filming on Doctor Strange in the Multiverse of Madness has been forced to go on hold in the UK as the country goes into its third lockdown, Elizabeth Olsen has revealed.",
    "Olsen, who will play Scarlet Witch in the film alongside Benedict Cumberbatch's Stephen Strange, discussed the delay when she appeared on Jimmy Kimmel Live! from London.",
    "“Since the hospitals are overwhelmed here, we can’t go back to work until that calms down,” she said, adding, “I’m just safely hanging out here, and just really grateful I get to be working. Disney has kept me busy during quarantine!”.",
    "The sequel to 2016's Doctor Strange has been filming since late last year after a delay from summer but it’s not known how long the current pause in production will go on for, or whether it might have an impact on the film’s release date. Doctor Strange in the Multiverse of Madness isn’t actually scheduled to release until March 2022, which is still some time away.",
    "The film is, however, no stranger to delays and disruption having had a change in directors last year in addition to being moved twice from its original May 2021 release date. If it meant the safety of cast and crew it’s not impossible that Marvel would be willing to delay it again, particularly if there was a long disruption to filming.",
    "Olsen was primarily on Jimmy Kimmel Live to discuss her upcoming Marvel TV series WandaVision which will premiere on Disney Plus on January 15. The series is the first new Marvel show out of the gate this year and it’s been confirmed it will in some way tie into Doctor Strange 2.",
    "Doctor Strange in the Multiverse of Madness is expected to release on March 25 2022. Directed by Sam Raimi, it will see Benedict Cumberbatch reprise his role as Doctor Stephen Strange, with Elizabeth Olsen returning as Wanda Maximoff/Scarlet Witch.",
    "Via Collider"
  ],
  "headers": {
    "4": "Safety first"
  },
  "links": {
    "change in directors": "https://www.techradar.com/news/doctor-strange-2-sam-raimi",
    "original May 2021 release date": "https://www.techradar.com/news/what-do-all-the-delays-mean-for-the-marvel-cinematic-universe",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Collider": "https://collider.com/doctor-strange-2-release-date-delay-filming-elizabeth-olsen/"
  }
}