{
  "source": "https://www.techradar.com/news/microsoft-fixes-office-365-flaw-that-led-emails-to-end-up-in-junk-folder",
  "title": "Microsoft fixes Office 365 flaw that led emails to end up in junk folder",
  "category": "computing",
  "updated": "2021-05-27T18:04:58Z",
  "author": "anthony-spadafora",
  "summary": "Having trouble finding that important email? This may be why",
  "article": [
    "A flaw that caused the emails of Office 365 users to end up in their junk folders instead of their inboxes has been fixed by Microsoft.",
    "Users of the software giant's email service were likely frustrated and possibly annoyed by the issue but thankfully no lasting damage was done.",
    "Throughout the whole ordeal, Microsoft kept users informed regarding the situation through a series of tweets on the official Microsoft 365 Status account on Twitter. The account first outlined the situation in a tweet, saying:",
    "“We're investigating an issue in which email is being sent to the junk folder. We'll be providing updates under EX258373 in the admin center.”",
    "Just an hour after its first tweet, the official Microsoft 365 Status account on Twitter revealed that the issue was the result of a change it had made and that it would be fixed shortly.",
    "After reverting the change, Microsoft “observed successful email delivery” and the company then began working on “reprocessing any emails that were incorrectly delivered as junk”. This process took a few hours to complete though some Office 365 users took to Twitter themselves to voice their frustration.",
    "In a tweet posted several hours later, Microsoft explained that the issue was the result of a “recently deployed spam rule” and users should visit the admin center for additional details. Fighting spam in email clients has proven particularly difficult over the course of the past year as cybercriminals leveraged the pandemic to launch phishing campaigns and other cyberattacks against those working from home.",
    "Thankfully Microsoft has finished fixing this Office 365 issue and users' emails are now being labeled correctly and sent to the right folder.",
    "Via ZDNet"
  ],
  "headers": {
    "4": "Spam rule change"
  },
  "links": {
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Microsoft": "https://www.techradar.com/news/new-microsoft-outlook-update-looks-to-keep-all-your-mobile-emails-safe",
    "email service": "https://www.techradar.com/news/best-email-provider",
    "tweet": "https://twitter.com/MSFT365Status/status/1397664020828540930",
    "email clients": "https://www.techradar.com/best/best-email-clients",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "ZDNet": "https://www.zdnet.com/article/emails-landing-in-junk-due-to-microsoft-office-365-change/"
  }
}