{
  "source": "https://www.techradar.com/news/skagen-jorn-hr-hybrid-smartwatch-announced-with-two-weeks-of-life",
  "title": "Skagen Jorn HR hybrid smartwatch announced with two weeks of life",
  "category": "wearables",
  "updated": "2021-01-12T10:07:09Z",
  "author": "james-rogerson",
  "summary": "And an affordable price",
  "article": [
    "Fossil through its various brands perhaps launches more smartwatches than any other company, but there’s no sign of it slowing down, as it has just announced the Skagen Jorn HR – a hybrid smartwatch with two weeks of battery life.",
    "This wearable manages such a long life in part because it has a low power E-Ink display, and in part because it’s a hybrid rather than fully smart watch.",
    "That also means unlike, say, the Skagen Falster 3, it doesn’t run Wear OS, but – as the name suggests – the Jorn HR has a heart rate monitor, and it also has workout modes (including auto workout detection), plus sleep tracking, smartphone notifications, music controls, custom watch faces, and more.",
    "One thing the Skagen Jorn HR doesn’t have is GPS, but it can connect to your phone’s GPS signal to track workouts, and it has a 3ATM water resistance rating, meaning you can take it swimming.",
    "Charging the Skagen Jorn HR from zero to 80% can apparently be done in 50 minutes, and you can choose between a 42mm case size with a standard 22mm watch strap, or a 38mm case with a standard 18mm strap. On top of that there are five different styles to choose from, so you should be able to find a version of the Jorn HR that suits you.",
    "As yet we don’t know exactly when the Skagen Jorn HR will be available, but the US and UK should be among the countries it’s sold in, as we know it will start at $195 / £189 (around AU$255). Skagen wearables often also come to Australia, so there’s a good chance the Jorn HR will be widely available."
  ],
  "headers": {},
  "links": {
    "Skagen Falster 3": "https://www.techradar.com/reviews/skagen-falster-3"
  }
}