{
  "source": "https://www.techradar.com/news/star-wars-hunters-mobile-game-pits-sith-against-mandalorians-and-jawas",
  "title": "Star Wars: Hunters mobile game pits Sith against Mandalorians and Jawas",
  "category": "gaming",
  "updated": "2021-09-14T23:22:55Z",
  "author": "david-lumb",
  "summary": "Play as two Jawas, one on another's shoulders. Live the dream.",
  "article": [
    "During the iPhone 13 launch, Apple showed off the gaming power of the phone in a sizzle reel of top games – which included the first look at Star Wars: Hunters, an upcoming free-to-play game for the Nintendo Switch and smartphones (iOS and Android) coming in 2022.",
    "The game is developed by Zynga (yes, that Zynga of Farmville fame), which released the game’s first trailer shortly thereafter. While we didn’t see much gameplay, we sure got a sense of the tone, which seems like it will feature a lineup of new characters for players to play in team-versus-team matches.",
    "And what a line-up: players can pick between Mandalorians, Wookies, Sith, a robot with a lightsaber, and even a pair of Jawas standing on shoulders like kids in a trenchcoat. At first glance, this looks comical but action-packed enough not to feel silly – but we’ll have to wait for any gameplay to get a feel for how players may embrace this microtransaction-packed game set in a galaxy far, far away.",
    "While mobile gaming has certainly come a long way, Zynga has stuck to casual titles with simple gameplay, so Star Wars: Hunters feels like a much more serious and high-profile project for the venerable developer.",
    "The trailer seems to steer clear of the lighter, kid-friendly tone of the Star Wars LEGO games, and has a cast of unknowns, unlike prior mobile games full of the franchise’s most iconic characters like Star Wars: Galaxy of Heroes. Fans of the property should find plenty familiar about Star Wars: Hunter’s line-up, though, with bounty hunters, stormtroopers, smugglers, and lightsabers galore.",
    "It’s a great time for this particular take on Star Wars too – more MOBAs and hero-vs-hero arena combat games seem to launch every year, with League of Legends, Marvel: Contest of Champions, and Marvel Future Revolutions bringing more intense gameplay to smartphones. Like the others, Star Wars: Hunters will be free to play, giving fans little excuse not to try an arena shooter set in their favorite franchise when the game drops next year."
  ],
  "headers": {
    "3": "Analysis: Star Wars, Zynga, and a lot of mobile players eager for more"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13"
  }
}