{
  "source": "https://www.techradar.com/news/paypal-ramps-up-relationship-with-google-cloud",
  "title": "PayPal ramps up relationship with Google Cloud",
  "category": "computing",
  "updated": "2021-05-17T10:16:08Z",
  "author": "rob-clymo",
  "summary": "A business boost from Google Cloud infrastructure and SAP HANA databases",
  "article": [
    "PayPal has expanded its relationship with Google Cloud in order to offer its ecommerce customers better infrastructure and analytics capabilities.",
    "The payments giant has been cultivating its hybrid cloud computing strategy since it became an independent company back in 2015. The latest announcement means that PayPal can shift more of its core infrastructure and workloads to Google Cloud.",
    "PayPal hopes it will be better positioned to adapt to the growing rise in digital commerce and user traffic, as its customer account base has been expanding rapidly, seeing a 24% spike in its total active customer accounts, which now numbers 392 million active users recorded at the first quarter of 2021.",
    "According to PayPal, the biggest benefit of boosting its collaboration with Google Cloud is the scalable nature of the products and services. PayPal was able to meet growing demand by increasing the capacity of its infrastructure in a few hours, as opposed to a several months. Much of the transactional data used by the payment processing company sits in a highly efficient SAP S/4HANA database.",
    "The flexibility has enabled PayPal to use the database functionality and SAP’s Financial Products Subledger all while tapping into the ability of Google Cloud to deliver everything on a vast scale. This means it can rapidly process higher volumes of transactions with ease. An added benefit of the setup is the way that PayPal can analyze key purchasing trends at volume, but with low latency.",
    "To illustrate this high-efficiency processing strategy PayPal was able to process 1000 payments per second during key online shopping events, such as Black Friday and Cyber Monday. That marks an increase of 22% compared to what PayPal was capable of back in 2019. Google Cloud can stagger workloads and increase, or decrease computing resources too depending on peak or off-peak times, allowing PayPal to deliver a much more effective experience for its customers.",
    "“We can only develop fast, build fast, and deploy fast if we have infrastructure that’s as nimble as we are. By leveraging the power of the cloud, our teams can focus on providing the best products, capabilities and services to our customers,” said Wes Hummel, vice president, Site Reliability and Cloud Engineering, PayPal. “As a part of our strategic partnership, we’re working side-by-side with Google Cloud to scale and secure our infrastructure for the future.”",
    "“E-commerce has spiked during the pandemic, with people using less cash. As a result, payments providers have been in high demand, ” said Derek White, vice president of Global Financial Services, Google Cloud. “We're working with PayPal to leverage the power of the cloud to make shopping and e-commerce easier, faster, and more secure. And that's a win for businesses and consumers.”",
    "Boosting the overall efficiency picture is the news that Google has recently added PayPal as a payment method for both Google Ads and Google Workspace in a move that has been tailored to better service consumers and merchants. Available to users in the US and selected European countries the move further exploits the existing payment integration with Google Play and Buy on Google, which allows consumers and businesses to use PayPal at the checkout."
  ],
  "headers": {
    "3": "PayPal Google Cloud"
  },
  "links": {
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}