{
  "source": "https://www.techradar.com/news/the-dji-ronin-4d-is-a-next-gen-cinema-camera-with-a-surprisingly-low-price-tag",
  "title": "The DJI Ronin 4D is a unique cinema camera with a surprising price tag",
  "category": "cameras",
  "updated": "2021-10-20T23:22:56Z",
  "author": "mark-wilson",
  "summary": "Unique all-in-one camera system has 4-axis stabilization",
  "article": [
    "DJI might be best known for drones like the DJI Air 2S, but it's actually a filmmaking innovator in many areas – and to prove the point, it's just launched a completely unique, all-in-one cinematography system called the DJI Ronin 4D.",
    "The Ronin 4D is unlike any other pro cinema setup, because it combines a full-frame camera with a new four-axis stabilization system and LiDAR-based focusing, among other tech treats. In short, it's a new breed of all-in-one filmmaking setup for producing super-smooth, professional video.",
    "So what exactly do you get when buying a Ronin 4D? The system's camera is a new full-frame Zenmuse X9, which is available in either 6K or 8K versions. It's compatible with DJI's own DL Mount lenses and other lenses, including those made for the Leica M-mount.",
    "The 6K version of the camera (the X9-6K) can shoot 6K/60p and 4K/120p slo-mo video, while the 8K model (called the X9-8K) goes up to 8K/75p. Both cameras can internally shoot in the Apple ProRes and ProRes Raw formats (alongside compressed H.246 video), giving filmmakers lots of editing flexibility.",
    "The cameras are also packed with pro filmmaking features, including nine-stop physical ND (Neutral Density) filters to help preserve quality in changeable lighting conditions, Dual ISO and a claimed dynamic range of 14-stops.",
    "But even more interesting than the camera is what surrounds it. The Ronin 4D has the first 4-axis active stabilization system we've seen. Most of today's gimbals have 3-axis stabilization, which help smooth out movement across the pan, roll and tilt axes, but the Ronin 4D adds Z-axis stabilization to the equation. This compensates for the up-and-down movement of walking, making it ideal for floating shots that would otherwise need Hollywood Steadicams or dollies.",
    "The Ronin 4D has innovations elsewhere, too. Its new LiDAR Range Finder, based on similar tech to the iPhone 13 Pro's LiDAR scanner, claims to bring next-gen focusing speeds, because it can blast out 43,200 ranging points as far away as ten meters, regardless of the lighting conditions. You get the option of manual focus (complete with a LiDAR Waveform), autofocus and an Automated Manual Focus mode that combines both to let you step in while it tracks focus.",
    "DJI didn't stop there when bringing new tech to the Ronin 4D either. The camera system also has new O3 Pro transmission tech, which can push a 1080/60p video feed to remote monitors that are up to 20,000 feet away. This means a focus puller can tweak the focus without needing to run around next to the camera operator.",
    "On the top, there's also a 1,500-nit, 7-inch monitor that has a built-in gyro sensor, which turns the monitor into a motion controller if you fancy controlling the camera with movement. And to hoover up all of your footage, there's a 1TB SSD drive inside alongside a CFexpress Type-B slot.",
    "As you'd expect from this feast of tech, the DJI Ronin 4D isn't cheap – but it is impressively affordable considering what it can do without any extra equipment. The DJI Ronin 4D 6K Combo will cost $7,199 / £5,999 / AU$10,699 when it's available from December. That's not at all bad when you consider a Sony FX3 camera alone costs $3,899 / £4,200 / AU$6,699.",
    "The DJI Ronin 4D 8K Combo is naturally a bit pricier at $11,499 / £9,499 / AU$16,399, and it doesn't yet have a release date. But while neither are exactly affordable options for fledgling filmmakers, both versions of the DJI Ronin 4D will undoubtedly shake up a cinema camera industry that's dominated by the likes of Sony, Canon and Red.",
    "DJI is best-known for its drones and gimbals, but it's been a camera innovator for a many years now too – and it's combined all of its experience and ideas into one unique product with the DJI Ronin 4D.",
    "There is nothing else quite like the Ronin 4D out there. We've seen cinema cameras, gimbals and Steadicams before, but nothing that combines all of their tricks into one package like DJI's new trailblazer – and certainly not at this price.",
    "In many ways, the Ronin 4D is the ground-based equivalent of its professional drones like the Inspire series. Its an exciting combination of tech that promises to bring the Hollywood Steadicam effect – think those floating, single-take shots in movies like The Shining and Goodfellas – to a more approachable, affordable and less back-breaking rig.",
    "Of course, we'll have to see if the Ronin 4D lives up to its grand promises (we're in the process of testing one now) and it won't suit everyone. Many filmmakers will be perfectly happy with the quality produced by cameras from the likes of Red, Arri, Sony and Canon, and have been able to live without 4-axis active stabilization until now.",
    "Unlike many of DJI's more beginner-friendly products, the Ronin 4D will also likely require some considerable experience and skill to wring the best out of it. But its all-in-one talents will likely be coveted by many smaller studios, particularly as that $7,199 / £5,999 / AU$10,699 price tag (for the 6K version) is far lower than we expected. And who knows, like DJI's drones, perhaps one day we'll get an even more affordable version for indie filmmakers."
  ],
  "headers": {
    "11": "Analysis: A unique cinema camera with exciting tech"
  },
  "links": {
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "Apple ProRes": "https://www.techradar.com/news/what-is-apple-prores",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers"
  }
}