{
  "source": "https://www.techradar.com/news/pixel-5a-launch-means-the-end-of-the-road-for-the-pixel-5-and-pixel-4a-with-5g",
  "title": "Pixel 5a launch means the end of the road for the Pixel 5 and Pixel 4a with 5G",
  "category": "phones",
  "updated": "2021-12-02T11:42:29Z",
  "author": "david-nield",
  "summary": "Out with the old",
  "article": [
    "The Google Pixel 5a is out and available to buy – if you live in the US or Japan, at least – and Google has now confirmed that the older Pixel 5 and Pixel 4a with 5G handsets are being discontinued in the run up to the launch of the Pixel 6.",
    "\"With our current forecasts, we expect Google Store in the US to sell out of Pixel 4a (5G) and Pixel 5 in the coming weeks following the launch of Pixel 5a (5G),\" Google told The Verge in a statement. \"These products will continue to be available through some partners while supplies last.\"",
    "While it's not surprising to see the Pixel 4a with 5G phased out now that its successor is here, it's more unusual for Google to cancel the Pixel 5 – ostensibly its current flagship device – ahead of the Pixel 6 and the Pixel 6 Pro hitting shelves (Google hasn't said exactly when that will be).",
    "It's not fully clear what this means for countries outside the US and Japan. Without the Pixel 5a, smartphone buyers in these parts of the world are going to be left with only the Pixel 6 phones (when they eventually appear) and the Pixel 4a to pick from.",
    "The Pixel 4a is a year old now, and doesn't have the speed, the water resistance, or the 5G connectivity that the Pixel 5a offers. The good news is that you can pick up the Pixel 4a at some very decent prices now, so it is still worth considering.",
    "Google hasn't specifically said the Pixel 5 and the Pixel 4a with 5G will be discontinued outside of the US and Japan, but it looks very likely – according to Digital Trends, the UK is one country where you won't be able to buy these phones for very much longer.",
    "Google's decision making over the last 18 months or so has been somewhat erratic, but the company can point to extenuating circumstances – and in particular, the ongoing global chip shortage that's affecting everyone and everything in the electronics industry.",
    "As we've written before, the pressures of the global pandemic and various trade sanctions are the main reasons behind the shortage. Manufacturers have had to deal with lockdowns and a smaller number of workers, while consumers have been demanding more and more gadgets (including game consoles) to use at home.",
    "Google isn't isolated from all of this, hence the rather confusing Pixel 4a with 5G launch schedule (it appeared with the Pixel 5, not the Pixel 4a), and the restricted launch of the Pixel 5a, and now the older Pixels getting discontinued earlier than might be expected.",
    "It does look as though the Google Pixel 6 and Pixel 6 Pro will launch globally, and for the US and Japan markets, the Pixel 5a is a great mid-range alternative. For the rest of the world, the Pixel 4a isn't such an appealing option for those who don't want to spend big, but it'll have to do for now."
  ],
  "headers": {
    "3": "Around the world",
    "6": "Analysis: chips with everything"
  },
  "links": {
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Pixel 4a with 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "The Verge": "https://www.theverge.com/2021/8/20/22634926/google-pixel-5-discontinued",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Digital Trends": "https://www.digitaltrends.com/mobile/pixel-5-4a-5g-discontinued-after-5a-launch/",
    "written before": "https://www.techradar.com/news/why-the-google-pixel-5a-isnt-available-to-buy-in-most-countries",
    "game consoles": "https://www.techradar.com/reviews/ps5",
    "the Google Pixel 6 and Pixel 6 Pro": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-pro-officially-revealed-by-google"
  }
}