{
  "source": "https://www.techradar.com/news/a-new-halo-infinite-map-may-have-leaked-and-it-looks-legit",
  "title": "A new Halo Infinite map may have leaked – and it looks legit",
  "category": "gaming",
  "updated": "2021-08-18T09:39:11Z",
  "author": "adam-vjestica",
  "summary": "Go on, take a closer Locke",
  "article": [
    "A new Halo Infinite map has apparently leaked online, showing what could potentially be another Slayer arena for the game’s popular multiplayer mode.",
    "Twitter user @LeakyHalo, who you won't want to follow if you want to stay free of spoilers, posted a two minute tour of what they’re claiming is one of Halo Infinite’s new multiplayer maps – and it certainly looks convincing.",
    "Using a free-roaming camera, it appears the map takes place in a hangar facility, with rockets taking off in the distance against the backdrop of a shattered moon. We also see a Sabre, one of Halo’s iconic vehicles that was first seen in Halo Reach, though it doesn’t look like you’re able to commandeer it. The leaked map is clearly designed for Slayer and not Big Team Battle where vehicles come into play.",
    "This new Halo Infinite map isn’t a complete surprise, however. Screenshots have been out in the wild for some time, as they were discovered in Halo Infinite’s first big leak that occurred during the Halo Infinite technical preview. Details about the game’s campaign also leaked, along with a voice recording that could point to a battle royale mode in Halo Infinite. This is our closest look yet of the leaked map’s layout, though.",
    "We’ve seen five Halo Infinite multiplayer maps in total so far: Live Fire, Bazaar, Recharge, Behemoth and Fragmentation, with Live Fire, Recharge and Bazaar all being playable during the Halo Infinite technical preview.",
    "If the multiplayer map leaks tell us anything, it’s that Halo Infinite’s development is close to being complete. The question is: can 343 Industries keep some surprises under wraps in the run up to launch?",
    "While Halo Infinite still doesn’t have a confirmed release date outside of “Holiday 2021”, which falls between November and December, it feels like only a matter of time before Microsoft provides a definite launch date.",
    "Halo Infinite is set to release on Xbox Series X|S, Xbox One and PC, and will be available to Xbox Game Pass subscribers on day one. It marks a bumper year for Microsoft’s new console with the releases of Flight Simulator, Psychonauts 2, Back 4 Blood, Forza Horizon 5 and Halo Infinite all coming to Xbox before 2022 rolls around."
  ],
  "headers": {
    "5": "Analysis: will we get a Halo Infinite release date soon?"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Halo Reach": "https://www.techradar.com/news/halo-reach-pc-performance",
    "Halo Infinite technical preview": "https://www.techradar.com/news/halo-infinite-beta-is-finally-up-and-running-and-the-bots-are-hilarious",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Flight Simulator": "https://www.techradar.com/reviews/microsoft-flight-simulator/news/microsoft-flight-simulator-for-xbox-series-x-s-5-things-to-do-first",
    "Psychonauts 2": "https://www.techradar.com/news/always-be-kind-time-schafer-talks-psychonauts-2-and-mental-health",
    "Back 4 Blood": "https://www.techradar.com/news/back-4-blood-release-date-cross-play-beta-trailers-and-characters",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5"
  }
}