{
  "source": "https://www.techradar.com/news/this-italian-made-e-bike-could-keep-rolling-for-up-to-200km",
  "title": "This Italian-made e-bike could keep rolling for up to 200km",
  "category": "fitness",
  "updated": "2021-12-01T10:52:53Z",
  "author": "cat-ellis",
  "summary": "Long range, without the weight",
  "article": [
    "Italian company Noko has unveiled a trio of new e-bikes that it claims can keep running for up to 200km (or 124 miles). That's not the greatest range of any e-bike (the WAU Bike, for example, can run for up to 215 miles with its extra power pack fitted), but Noko's bikes will also be exceptionally light, making them far more practical for commuting and storage.",
    "While the WAU tips the scales at a hefty 22kg before you clip on its battery, Noko claims that its new bikes will weigh a mere 14.8kg.",
    "That would make them light for any e-bike, let alone a long range one. For context, our current top-rated bike, the Cowboy 4, has a top range of 43.5 miles and weighs between 18.9kg and 19.2kg. The lightest bike in our list, the Ribble Hybrid Al e, weighs a mere 13.1kg, and a maximum range of 60 miles.",
    "As eBikeTips reports, the three models in Noko's new lineup are the Forza, Tempo, and Vulcano.",
    "Much like the Cowboy 4, the Forza and Tempo are road bikes with a carbon drive belt rather than a chain (a handy way to reduce maintenance). The Forza has a step-over frame, while the Tempo is step-through. Both bikes start at €3,990 (about $4,500 / £3,400 / AU$6,300).",
    "The Vulcano is a slightly more rugged affair, with a drive chain and drop handlebars, not entirely dissimilar to the Ribble CGR Al E electric gravel bike. Its price starts at €4,350 (about $4,900 / £3,700 / AU$6,900).",
    "All bikes come in a choice of colors and three sizes; a welcome surprise since many e-bikes are only available with a single frame option that limits their accessibility. They are available to pre-order now for delivery next year.",
    "So will Noko's new bikes actually keep going for a full 200km? Probably not - but it depends on the conditions and how you ride them.",
    "In the US, riders are sometimes disappointed to find that the quoted maximum range is based on pedal assistance, and is much shorter than can be achieved using the throttle alone. Due to EU laws on e-bikes, the Forza, Tempo, and Vulcano will have no throttles, and their motors will only engage while you're pedaling. If you put in more work yourself, and use the lowest of the five assistance settings, you'll eke out a greater range.",
    "Environmental factors are important too, and the top range will only be achievable ideal conditions. Factors like road condition, wind, the combined weight of you and your luggage, and even your clothing choices can all have an impact on real world performance.",
    "You'll need to keep the tires optimally pressurized, too; flat tires mean more resistance on the road, which can be easily missed as the motor compensates for the decreased efficiency.",
    "However, unless a manufacturer goes out of its way to specify that its figures are based on real-world performance (as Juiced Bikes does), these same limitations will always apply. Even if you can't keep rolling for a full 200km on one of Noko's new bikes, range should still be much greater than others in the same weight category."
  ],
  "headers": {
    "3": "A light touch",
    "7": "Analysis: going the distance"
  },
  "links": {
    "WAU Bike": "https://www.techradar.com/reviews/wau-x",
    "Noko": "https://www.nokobike.com/",
    "top-rated bike": "https://www.techradar.com/best/electric-bike",
    "Cowboy 4": "https://www.techradar.com/reviews/cowboy-4",
    "Ribble Hybrid Al e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "eBikeTips": "https://ebiketips.road.cc/content/news/noko-launch-urban-e-bikes-claiming-200km-of-range-3477",
    "Forza": "https://www.nokobike.com/shop/noko-forza/",
    "Tempo": "https://www.nokobike.com/shop/noko_tempo/",
    "Vulcano": "https://www.nokobike.com/shop/noko_vulcano/",
    "Ribble CGR Al E": "https://www.techradar.com/reviews/ribble-cgr-al-e",
    "Juiced Bikes": "https://www.juicedbikes.com/pages/real-world-range-test"
  }
}