{
  "source": "https://www.techradar.com/news/whatsapp-instagram-facebook-messenger-down",
  "title": "WhatsApp, Instagram, and Facebook are recovering from major outage",
  "category": "phones",
  "updated": "2021-03-19T18:26:06Z",
  "author": "james-peckham",
  "summary": "Couldn't access WhatsApp, Facebook Messenger or Instagram today? Here's what was down in the major outage",
  "article": [
    "Instagram, WhatsApp Facebook and Facebook Messenger were down for millions of users today for approximately 30 minutes, with people complaining that they weren't able to access the suite of Facebook-owned social media platforms.",
    "\"We're sorry, but something went wrong. Please try again,\" said the Instagram app whenever we tried to access any part of the app. We're now able to refresh our feed of photos and videos, nor were we able to send messages.",
    "WhatsApp was similar, with a 'Connecting' and circular icon near the top, and we saw the same sort of problems in the Facebook Messenger app. Messages didn't go out to our contacts for about a half hour.",
    "Facebook has yet to comment on the issues, but there have been similar issues in the past that have seen all of these services suffer outages at the same time.",
    "TechRadar has asked Facebook for a comment on what's happening, but we've yet to hear back. Without Facebook commenting officially, we haven't gotten confirmation on why its services went down or how many of its billions of users were affected.",
    "We'll continue monitoring the four Facebook-owned services – which don't appear to be down any longer – in case your messages stop working again.",
    "we could confirm that services were disrupted in the US and and the UK, while we saw a very large spike in complaints across the globe on DownDetector from all countries including Spain, Saudi Arabia, Japan and Russia.",
    "Developing..."
  ],
  "headers": {},
  "links": {
    "DownDetector": "https://downdetector.co.uk/status/whatsapp/"
  }
}