{
  "source": "https://www.techradar.com/news/how-to-watch-hamilton-online-stream-the-hit-musical-on-disney-plus-today",
  "title": "How to watch Hamilton online: stream the spectacular musical on Disney Plus",
  "category": "computing",
  "updated": "2021-02-24T08:52:36Z",
  "author": "james-laird",
  "summary": "Your home can be the room where it happens",
  "article": [
    "The cinematic version of Lin-Manuel Miranda's groundbreaking musical, Hamilton, enjoyed the fastest of fast-track releases in 2020 and is now available to stream on Disney Plus. Everyone's home can be the room where it happens today, so don't throw away your shot - here's how how to watch Hamilton online and stream it with Disney Plus right now.",
    "The record breaking, Pulitzer Prize-winning show is a visionary take on the \"ten-dollar Founding Father without a father\" - and more cultural phenomenon than Broadway hit. Hamilton has now hit all of Disney Plus' markets - including the US, UK, Canada, Australia, and many more.",
    "The movie of the show was shot at New York's Richard Rodgers Theatre in 2016 and features the production's original cast, which is headlined by Miranda himself playing Alexander Hamilton. Scroll down for full details of the original Hamilton cast that won 11 Tony Awards - Broadway's equivalent of the Oscars.",
    "The film carries a PG-13 rating in the US, which is roughly equivalent to a 12A in the UK. This means it will muffle two of the three F-bombs that feature in the original song lyrics, to make it family-friendly and suitable for Disney Plus audiences.",
    "But even if you've seen the show performed live, as this writer has, you won't notice the difference. Popular numbers like My Shot, Yorktown (The World Turned Upside Down) and Satisfied are every bit as mesmerizing as they are in the flesh and the production carries all the same swagger and potency it does on the stage.",
    "Don't delay - your home is now officially the room where it happens, so here's how to watch Hamilton online and stream Lin-Manuel Miranda's epic musical on Disney Plus right now.",
    "As we've mentioned, the movie version of Hamilton now available for streaming exclusively on Disney Plus features the original cast of the show. Hamilton first debuted off-Broadway in 2015 before being moved to the Richard Rodgers Theatre - an iconic venue that was the perfect home for Miranda's masterpiece.",
    "Read more:"
  ],
  "headers": {
    "6": "Hamilton cast: who stars in the Disney Plus movie?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "on Disney Plus right now.": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-9862523800770337000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "streaming exclusively on Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1348637412455974100&sharedId=trd-us&u=https%3A%2F%2Fdisneyplus.com%2F"
  }
}