{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-renders-show-off-the-phone-in-full",
  "title": "Samsung Galaxy S21 FE renders show off the phone in full",
  "category": "phones",
  "updated": "2021-04-23T09:06:53Z",
  "author": "james-rogerson",
  "summary": "Every bit a member of the S21 family",
  "article": [
    "The Samsung Galaxy S21 FE is probably still months away from launch, but already we’ve had a close look at the likely design of the phone via unofficial renders.",
    "Shared by LetsGoDigital and created by Concept Creator, these are based on leaked information about the handset, and they paint a comprehensive picture.",
    "They show a plastic back with a rectangular camera block jutting out of the top left corner and housing three lenses, while around the front there’s a flat screen with a punch-hole camera in the top center, and slim bezels (though a slightly larger one below the display).",
    "The bottom edge is shown housing a speaker grille and USB-C port, and the right edge has volume and power buttons. It’s a design in all that’s a lot like the rest of the Samsung Galaxy S21 range, as we’d expect, as well as being more or less identical to previous renders.",
    "The Samsung Galaxy S21 FE is shown here in black, blue, green, pink and purple, though the source notes that these were chosen for the renders simply because they’re “high-profile.” In fact, rumors suggest the S21 FE will land in green, purple, pink, white, and grey.",
    "Some specs are also included on LetsGoDigital’s post, but the site appears to just be reiterating previous leaks, such as claims that the Galaxy S21 FE will have a 6.4-inch AMOLED screen, a 32MP front-facing camera, 6GB or 8GB of RAM, 128GB or 256GB of storage, and a Snapdragon 888 or Exynos 2100 chipset.",
    "While we’d take all of this with a pinch of salt for now – especially with the Samsung Galaxy S21 FE probably not landing until August – all these leaks sound believable, and the design shown here is basically exactly what we’d expect from an FE model in the Samsung Galaxy S21 range."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/samsung-s21-fan-edition/",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "previous renders": "https://www.techradar.com/news/samsung-galaxy-s21-fe-design-revealed-in-unofficial-renders",
    "rumors suggest": "https://www.techradar.com/news/samsung-galaxy-s21-fe-color-and-camera-details-leaked"
  }
}