{
  "source": "https://www.techradar.com/news/fcc-set-to-release-funding-for-huawei-ripouts-in-us",
  "title": "FCC set to release billions in funding for Huawei ripouts",
  "category": "computing",
  "updated": "2021-09-28T13:49:46Z",
  "author": "steve-mccaskill",
  "summary": "FCC has a $1.9bn pot available for US operators",
  "article": [
    "The US Federal Communications Commission (FCC) will start accepting applications from operators for funding to cover the cost of removing telecoms equipment made by Chinese vendors such as Huawei at the end of next month.",
    "Chinese vendors have largely been excluded from the US market due to ongoing concerns about security, with major carriers opting to use radio equipment from Ericsson, Nokia, and others.",
    "However, several smaller providers still use kit from the likes of Huawei and ZTE because it is relatively inexpensive. The Rural Wireless Association, which represents operators with fewer than 100,000 customers, estimates a quarter of its members have Chinese-made kit in their networks.",
    "The US government and the FCC have both taken steps to restrict both companies’ activities in the country. Federal agencies have long been banned from using equipment from Huawei and ZTE while last November both were declared to be national security risks.",
    "This meant that funding from a $8.3 billion pot to purchase telecoms equipment could not be used to source kit from the two companies, while existing operators were told to rip and replace any gear in place.",
    "However, the cost and logistical challenge of doing this is a barrier for many smaller operators with limited resources. To assist with the process, a $1.9 billion package of funding was approved earlier this year, and the threshold of eligibility was increased to companies with 10 million or fewer customers from the previous 2 million.",
    "Huawei has persistently denied any allegations of wrongdoing, while Washington has yet to provide any evidence to support its claims. The Chinese government considers the US’s actions to be politically motivated.",
    "Separately, Huawei is also banned from dealing with US suppliers without a licence, severely limiting its access to key technologies such as chips and the Android operating system. Recently, there were moves to make the licence system even more restrictive.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Huawei FCC"
  },
  "links": {
    "Huawei": "https://www.techradar.com/news/huawei-ban",
    "Reuters": "https://www.reuters.com/business/media-telecom/us-open-program-replace-huawei-equipment-us-networks-2021-09-27/"
  }
}