{
  "source": "https://www.techradar.com/news/what-is-f1-sprint-qualifying",
  "title": "What is F1 Sprint Qualifying?",
  "category": "entertainment",
  "updated": "2021-09-10T11:11:50Z",
  "author": "mo-harber-lamond",
  "summary": "F1's biggest change since 2016 is back at Monza",
  "article": [
    "F1 Sprint Qualifying – officially known as F1 Sprint is back as we head to the 2021 Italian Grand Prix at Monza – but for those not in the know it could come across as somewhat confusing.",
    "As the first change to the qualifying process since 2016’s short-lived and widely disliked Elimination Qualifying, Sprint Qualifying has been met with both excitement and trepidation in equal measure. But to decide which side of the fence you are, you're going to have to first fully understand what it is.",
    "So, if you’re not yet well-versed in this F1 update, here we’ll be explaining exactly what F1 Sprint Qualifying is, how it differs from the system we’re used to, and how to watch an F1 live stream to catch F1 Sprint on the day.",
    "Regular qualification for a Grand Prix works on a knockout basis over three rounds, all held on a Saturday.",
    "All drivers take part in the first session, and the slowest five take places 16-20 on the final grid. The remaining 15 drivers take part in the second session, with grid spots 11-15 again taken by the slowest five. The last session sees the fastest 10 drivers compete for pole position, and the subsequent grid spots 2-10.",
    "When Sprint Qualifying is on the cards, regular qualifying will still be held – although it will be moved back to Friday (in the place of Practice 2) and will determine the starting grid for Sprint Qualifying which takes place on the Saturday, in the place of regular quals.",
    "Sprint Qualifying will take place over a single session. All drivers will race for 100km around the circuit in question, and their finishing positions in this shorter race will determine their spot on the final grid. The short length is intended to provide a flat-out, exciting race for both drivers and spectators, in which teams won’t have to contend with pit stops for fuel or tyres.",
    "One of the biggest changes is the fact that the top three qualifiers in F1 Sprint will receive points for their achievement, regardless of their finishing position in the Grand Prix. However, the podium is reserved for the Grand Prix on Sunday.",
    "F1 Sprint Qualifying was launched at the 2021 British GP at Silverstone. As a trial run, the 2021 season will see just three instances of F1 Sprint, and only Silverstone and Monza have been confirmed.",
    "We expect to see F1 Sprint Qualifying used on open tracks that provide ample overtaking opportunities, so tight circuits like Monaco are out of the question.",
    "To watch the second ever run of F1 Sprint Qualifying, you’ll need to get yourself a live stream. To find out global viewing options, we highly recommend checking out our how to watch the Italian Grand Prx article, which outlines global viewing options.",
    "If you’re outside your home country when the Grand Prix is held, you may find that you can’t access your regular streaming service you use to watch the F1. However, there’s a neat trick to get around this – using a VPN.",
    "All you need to do is sign up to a quality VPN – our first choice is ExpressVPN – and then change your location to back home. So, for example, if you’re currently in the US and want to catch the coverage on Sky Sports, all you need to do is select a UK server on the VPN, head over to the website, and start watching.",
    "F1 Sprint will take place on Saturday, September 11 at Silverstone:",
    "It’s very unlikely that F1 Sprint Qualifying will appear at every GP, even if it does prove popular. Instead, it’ll be used at tracks where it’ll provide the most exciting experience, while regular qualifying will be used at others.",
    "So, races at circuits like Silverstone and Monza could become F1 Sprint events, while tracks that are trickier to overtake on like Monaco will be left alone."
  ],
  "headers": {
    "3": "What is F1 Sprint Qualifying?",
    "8": "Where is F1 Sprint Qualifying being held?",
    "10": "How to watch Sprint Qualifying",
    "13": "When will F1 Sprint Qualifying take place?",
    "14": "Which events will have F1 Sprint Qualifying?"
  },
  "links": {
    "2021 Italian Grand Prix": "https://www.techradar.com/news/f1-live-stream-2021-how-to-watch-every-grand-prix-online",
    "how to watch an F1 live stream": "https://www.techradar.com/news/f1-live-stream-2021-how-to-watch-every-grand-prix-online",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "our first choice is ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1033208120791691500"
  }
}