{
  "source": "https://www.techradar.com/news/sony-wh-1000xm4-deals-are-at-record-price-lows-but-so-are-the-xm3s",
  "title": "Sony WH-1000XM4 deals are at record price lows, but so are the XM3s",
  "category": "audio-visual",
  "updated": "2021-03-23T13:31:45Z",
  "author": "tabitha-baker",
  "summary": "Big savings on both new and old",
  "article": [
    "Sony WH-1000XM4 deals have returned this month, with an excellent record low price available at a number of retailers. However, for those looking to spend even less on Sony's premium range of noise-canceling headphones, the previous generation is also looking pretty enticing right now as well.",
    "The latest model boasts industry-leading noise-cancellation, incredibly smart quality of life features, and Bluetooth 5. Usually coming in at $349.99, you'll find them down at a record low $278 with a free Mophie Power Boost powerbank (worth $39.99) included at Adorama (or $278 by themselves at Amazon). That's an incredible saving, and one we don't see from everyday Sony WH-1000XM4 deals - but you can go even cheaper.",
    "The Sony WH-1000XM3s offer the same touch gesture controls and outstanding audio quality, but you'll find the older model available for a record low price of $199.99 at Newegg right now. The MSRP is still $349.99, but we've been seeing them on sale for between $219 and $279 over the last few months, which makes this offer all the more impressive.",
    "Not in the US? Scroll down for more Sony WH-1000XM4 deals and Sony WH-1000XM3 sales.",
    "You'll find plenty more Sony WH-1000XM4 deals just below, with the lowest prices from all around the web in one place.",
    "The Sony WH-1000XM3s are still widely available even though the XM4s have firmly settled onto the shelves. That's because they not only offer similar levels of audio and noise-cancellation power, but also Bluetooth 4.2 which does support more codecs (making that audio sound a little better on Android). Not only that, but you're getting a strong 30 hours of battery life here, more than the XM4s. You'll find more Sony WH-1000XM3 deals just below.",
    "We're rounding up all the latest noise cancelling headphone deals and cheap wireless headphone sales as well. However, if you want to check out the competition head over to our guide to the best Bose headphone deals as well."
  ],
  "headers": {
    "4": "More Sony WH-1000XM4 deals",
    "5": "More Sony WH-1000XM3 deals"
  },
  "links": {
    "down at a record low $278": "https://adorama.evyy.net/c/221109/51926/1036?subId1=trd-us-4232501083980525600&sharedId=trd-us&u=https%3A%2F%2Fwww.adorama.com%2Fsowh100xm4ba.html",
    "(or $278 by themselves at Amazon)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSony-WH-1000XM4-Canceling-Headphones-phone-call%2Fdp%2FB0863TXGM3%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3027284846144116000-20",
    "available for a record low price of $199.99 at Newegg": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-8916501521577793000&murl=https%3A%2F%2Fwww.newegg.com%2Fblack-sony-wh-1000xm3-b-headphone%2Fp%2F0TH-000U-008U8",
    "Sony WH-1000XM4 deals": "https://www.techradar.com/deals/best-sony-wh-1000xm4-sales-deals-and-prices",
    "Sony WH-1000XM3 sales": "https://www.techradar.com/deals/the-best-sony-wh-1000xm3-sales-prices-and-deals",
    "noise cancelling headphone deals": "https://www.techradar.com/deals/cheap-noise-canceling-headphone-deals",
    "cheap wireless headphone sales": "https://www.techradar.com/deals/the-best-cheap-wireless-headphone-deals",
    "best Bose headphone deals": "https://www.techradar.com/deals/the-best-cheap-bose-headphone-deals"
  }
}