{
  "source": "https://www.techradar.com/news/why-soft-skills-are-critical-to-digital-transformation",
  "title": "Why soft skills are critical to digital transformation",
  "category": "computing",
  "updated": "2021-08-02T14:10:12Z",
  "author": "geoff-smith",
  "summary": "Technical knowledge is not the be-all and end-all",
  "article": [
    "The pandemic caused a seismic shift in how businesses operate, with more focus on digitization than ever before. Demand for tech talent was already at an all-time high – research recently published by the Learning & Work Institute revealed that 60% of UK businesses believe their reliance on advanced digital skills will increase over the next five years. Yet, this pivot to virtual remote working and the need to digitize operations has driven this demand even higher. Businesses we deal with daily – our banks, supermarkets and healthcare systems – were all disrupted by new technologies and the need for automation. And, as businesses across all sectors and regions responded to the global health crisis and shifted to online working models, the adoption of digital technologies was accelerated by several years, according to a study by McKinsey.",
    "Against this backdrop, one may think that organizations are in dire need of an injection of tech talent. However, rather than focusing solely on developing more technical capabilities within their organizations, employers should instead place as much emphasis on developing a diverse range of soft skills. Why? To ensure they can adapt to meet future skills requirements and remain competitive in the digital age. Let me explain my rationale.",
    "The UK has been facing a growing digital skills crisis for years, with demand for skilled professionals in areas such as software development, testing and information security exceeding supply. At the same time, however, we hear increasing reports of talented graduates being out of work, a demographic of the workforce that should be primed and able to keep up with fast-paced technological change. Figures from the ONS’ ‘Graduates’ Labour Market’ report in March of this year showed that one in eight graduates are currently out of work, and over a quarter (25.5%) of those who are employed are in unskilled or low-skilled roles. These stats are shocking and present a dark cloud for the thousands of career-hungry young people graduating this summer. After paying tens of thousands for their education, these groups rightfully deserve the high-skilled, well-paid graduate jobs they have studied for.",
    "It’s clear that there is not an issue with the actual supply of available individuals. So why do so many graduates remain unemployable for organizations in need of tech talent? According to the Learning & Work Institute’s research, under half (48%) of UK employers believe that young people leave full-time education with sufficient advanced digital skills, pointing to a fundamental disconnect between our country’s education system and the needs of British businesses today.",
    "Of course, if we’re to remain competitive as a tech nation, it’s critical that we can continue to encourage more young people to take STEM subjects at GCSE, A-Level and in further education (with numbers at all levels declining) to ensure a steady flow of tech professionals entering the workforce. And universities need to show they can adapt to future workforce skill demands to help bridge the divide. But to truly drive the transformative change needed in business today and avoid becoming the next Woolworths, Blockbuster or Kodak, organizations must not neglect to develop soft skills within their teams too.",
    "Here are some of those skills that will be essential to develop in the post-pandemic world:",
    "Curiosity",
    "Possibly the most important soft skill to nurture because in-demand skills change all the time. Expertise in a particular software or programming language can be extremely beneficial, but the half-life of a technical skill is currently two and a half years. Those that therefore show a curiosity and willingness to learn have a better chance of remaining relevant and helping their organizations embed the latest technologies into their operations.",
    "Communication",
    "Continuous digitization involves the whole organization. It isn’t just about technology, but about people and cultural change. That’s why it’s vital to ensure people have strong communication skills. From Managing Directors to CFOs, teams need to be able to explain complex processes to stakeholders across the business with ease and confidence to drive real, lasting change.",
    "Critical thinking",
    "Since the start of the pandemic, organizations have had to overcome a whole host of new challenges. The success here is down to critical thinking and decision making. Critical thinkers will identify, analyze and solve problems systematically. A team of diverse critical thinkers, with different perspectives and experiences, look at problems from a range of angles and find truly innovative solutions.",
    "Creativity",
    "Creativity is often assumed to only be a key skill for the likes of designers and writers. But a creative Data Analyst, for example, can create narratives and tell stories with data that translate their findings into a digestible format for a range of stakeholders. Being creative means thinking outside of the box, going beyond traditional processes to imagine new solutions to organizations' challenges. Most of us have had to think creatively during the pandemic to shape new ways to work effectively whilst at home or to pivot sales approaches. Creative thinkers will keep pushing operations and projects forward by providing new insights and drawing inspiration from current digital trends.",
    "Collaboration",
    "No one can deliver successful change on their own. And even an excellent idea cannot be executed without a strong team. People that take a collaborative approach will be able to communicate their ideas to a range of stakeholders, ensuring the whole team is onboard with transformation projects.",
    "The impact of the Covid-19 crisis has changed the world as we know it and in these challenging circumstances, businesses have quickly adapted to new ways of working, embraced remote working and, in many cases, accelerated their digital transformation efforts. Tech savviness will, of course, continue to be one of the most coveted skills in business, but while the digital skills mismatch still exists, employers should always look for individuals who are committed to continuous learning and development. As digital services and technologies evolve, organizations need talented people who are ready to adapt their skill set along with this. Harnessing this talent is absolutely vital if they’re to maintain the furious pace of digital change we’ve seen during the pandemic."
  ],
  "headers": {
    "2": "The digital skills mismatch",
    "5": "Essential skills",
    "16": "Harnessing talent"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "automation": "https://www.techradar.com/news/what-is-digital-business-automation",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "learning": "https://www.techradar.com/best/best-online-learning-platforms"
  }
}