{
  "source": "https://www.techradar.com/news/huawei-p50-release-date-might-be-delayed-until-may",
  "title": "Huawei P50 release date might be delayed until May",
  "category": "phones",
  "updated": "2021-03-22T10:06:33Z",
  "author": "james-rogerson",
  "summary": "Operating system issues",
  "article": [
    "The Huawei P50 might be launching imminently, as we’d previously heard rumors it would land around the end of March. Then again, it might not, as another source now suggests it will land much later.",
    "According to Zol.com (a Chinese tech news site), the Huawei P50 has been delayed until May. The reason for the delay isn’t entirely clear from the report (or at least our machine-translated version of it), but Huawei Central suggests that the delay is down to issues with HarmonyOS, which – at least in some regions – might come pre-installed on the phone instead of Android.",
    "Beyond that, the site also reiterates some things that we’ve heard previously, like that there will apparently be three models – the Huawei P50, Huawei P50 Pro, and Huawei P50 Pro Plus, and that the phones will use the Sony IMX800 camera sensor, which would be the biggest yet found in a phone.",
    "The Huawei P50 range will also apparently be equipped with a Kirin 9000L chipset, which is said to be similar to the Kirin 9000 and Kirin 9000E found in the Huawei Mate 40 range. We were expecting the Kirin 9000 or some variant of it, so this isn’t surprising.",
    "It’s only the release window that’s at all surprising. With the end of March fast approaching and no imminent sign of the Huawei P50 range, claims of a March launch are looking ever more unlikely even without this new rumor, and a launch in May is entirely possible. That said, given that it’s not clear where this site got the information we’d take it with a pinch of salt.",
    "In any case, we’ll let you know as soon as we hear more, and in the meantime, there are plenty of other phones to get excited about, including the OnePlus 9 range, which is landing on March 23.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "A likely claim"
  },
  "links": {
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "around the end of March": "https://www.techradar.com/news/huawei-p50-release-date-leaked-and-its-exactly-when-we-expected",
    "Zol.com": "https://mobile.zol.com.cn/764/7647392.html",
    "Huawei Central": "https://www.huaweicentral.com/huawei-p50-internally-testing-harmonyos-will-come-with-pre-installed-hongmeng-os-tipster-updated-1/",
    "might come pre-installed on the phone": "https://www.techradar.com/news/huawei-p50-series-could-mark-the-phone-debut-of-huaweis-android-alternative",
    "will use the Sony IMX800 camera sensor": "https://www.techradar.com/news/huawei-p50-could-be-one-of-the-best-camera-phones-if-this-leak-is-correct",
    "Huawei Mate 40": "https://www.techradar.com/news/huawei-mate-40-news",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Phone Arena": "https://www.phonearena.com/news/huawei-p50-launch-delayed-until-may_id130895"
  }
}