{
  "source": "https://www.techradar.com/news/microsoft-teams-will-make-it-easier-to-learn-new-skills-at-work",
  "title": "Microsoft Teams will make it easier to learn new skills at work",
  "category": "computing",
  "updated": "2021-09-30T10:28:23Z",
  "author": "mike-moore",
  "summary": "Viva Learning platform set to launch soon",
  "article": [
    "Learning a new workplace skill or attribute will soon be offered through Microsoft Teams, the company has confirmed.",
    "The release of Microsoft Viva Learning will bring online skills education to the company's video conferencing service as it looks to expand its online employee experience program.",
    "Available to most customers in mid-November 2021, Viva Learning looks to offer businesses a single platform where employees can learn, share and discover a range of online content libraries designed to help enrich their knowledge.",
    "Viva Learning was first revealed back in February 2021 as part of Microsoft's aim to improve remote working offerings for organizations pivoting to remote work.",
    "Microsoft Viva integrates with Teams as a kind of intranet that brings together knowledge, learning, and communication tools within a business, even when workers are spread around outside of the office.",
    "Viva Learning is geared towards employee development and allows members of staff to share, assign, and learn from an organization’s training material, as well as helping speed up the onboarding process.",
    "The service brings together not just in-house content from Microsoft Learn and LinkedIn Learning, but also third-party providers such as Coursera, PluralSight and edX, with organizations also able to upload and share their own content.",
    "Users will see Viva Learning pre-installed into their existing Teams software, with the content displayed via the Teams and Learning tabs.",
    "Viva Learning will be available to all organizations with a paid Microsoft Teams subscription, with the exception of Education or Government customers, with rollout beginning at the end of October 2021.",
    "There will be a free basic level of Viva Learning included with all Microsoft 365 licenses, which includes full access to the Microsoft Learn and Microsoft 365 Trainings content libraries. Users will need to upgrade to Viva Learning Premium to unlock all the services, including third-party integration.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Viva Learning launch"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Microsoft Viva": "https://www.techradar.com/news/microsoft-viva-wants-to-shake-up-the-future-of-remote-work-for-good",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "MSPowerUser": "https://mspoweruser.com/microsoft-announce-the-launch-date-of-viva-learning/"
  }
}