{
  "source": "https://www.techradar.com/news/oculus-quest-vr-headsets-are-now-blighted-by-facebook-ads",
  "title": "Oculus Quest VR headsets are now blighted by Facebook ads",
  "category": "gaming",
  "updated": "2021-06-17T08:45:59Z",
  "author": "henry-st-leger",
  "summary": "Facebook is testing ads in Oculus Quest VR headsets",
  "article": [
    "The Oculus Quest 2 may be the bestselling VR headset to date, but all those users are now going to have to reckon with Facebook ads within their VR games.",
    "The social media giant has announced that ads are being tested in a number of VR applications on its Quest and Quest 2 headsets. It's an unsurprising move for a company whose business model is largely based on targeted advertising across its many platforms (whether Facebook, Instagram, or otherwise) though one that is sure to irk some VR enthusiasts.",
    "A blog post by Oculus confirms that \"a small test of in-headset ads\" is beginning in select VR titles, including area shooter Blaston. While the Facebook-owned company did start testing ads in Oculus mobile apps back in June, it's only now that we're seeing \"the next phase of that exploration\".",
    "The announcement is very much spun as a good thing for both VR headsets owners and the developers making them content, allowing for \"new ways for developers to generate revenue\" in the aim of \"creating a self-sustaining platform\".",
    "Given the nascent nature of VR, monetisation is still something the industry is figuring out. However, given that the Oculus Quest 2 starts at £299 / $299 / AU$479 for a 64GB model, and goes up to £399 / $399 / AU$639 for a 256GB version, you'd be forgiven for assuming you wouldn't need to stare at advertisements while within your pricey virtual reality hardware.",
    "It's worth noting that Oculus isn't the first to the party, though, as back in 2017 Viveport – the VR platform for the HTC Vive – gave devs the option to place video ads, banner ads 360° video and cinema-scale ads into their creations.",
    "As you can see in the gif above, the ads seem relatively discreet. You won't be blasting your way through Coca Cola-branded zombies yet, at least, or facing numerous pop ups while trying to navigate a menu. The ads are instead integrated into specific spaces, much like the ads running along the side of a football pitch.",
    "There are, just as on the Facebook platform, options to click on, hide, or report the ad in question, depending on what's being shown. \"Users can also access more detailed Ad Preferences from any ad via our 'Why am I seeing this ad?' interface,\" we're told.",
    "There may yet be a chance to shape the future of ads on Oculus, though. The blog posts says that \"We’re eager to hear what you think, so please feel free to reach out to Oculus Support to share your feedback\" – and we recommend doing so if you feel strongly about the ad integration, or have any issues to report."
  ],
  "headers": {
    "6": "How bad are these ads?"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "VR games": "https://www.techradar.com/best/the-best-vr-games",
    "Oculus": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-5097732931138101000&murl=https%3A%2F%2Fwww.oculus.com%2Fblog%2Ftesting-in-headset-vr-ads%2F",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "to place video ads, banner ads 360° video and cinema-scale ads into their creations": "https://www.techradar.com/news/get-ready-for-ads-to-invade-your-htc-vive-virtual-reality-experiences",
    "Oculus Support": "https://tickets.oculusvr.com/hc/en-us/requests/new?intern_source=blog&intern_content=testing-in-headset-vr-ads"
  }
}