{
  "source": "https://www.techradar.com/news/what-could-an-xbox-streaming-stick-look-like",
  "title": "What could an Xbox streaming stick look like?",
  "category": "audio-visual",
  "updated": "2021-06-12T10:00:34Z",
  "author": "henry-st-leger",
  "summary": "Cloud gaming is getting a new plug-in streamer from Xbox",
  "article": [
    "On the cusp of E3 2021, Microsoft has been making some fascinating announcements. Alongside news of an Xbox Game Pass app coming to smart TVs in the near future, it also confirmed that streaming devices were in development to bring the game subscription service and its cloud gaming capabilities to TVs or monitors that lacked native support.",
    "By the sounds of it, then, we’ll soon be able to plug and stream Xbox Game Pass titles on a TV without a dedicated Xbox Series X console – using a more compact streamer at even less cost than the entry-level, discless Xbox Series S.",
    "Many questions remain though, such as what this streaming stick will look like, what it’ll cost, and what features will actually come baked into the device. Here are all our predictions for the prospective Xbox streaming device.",
    "Streaming sticks are ten-a-penny these days, and many of them cost about as much too. You can buy a budget HD streamer for as little as $25 / £25, with 4K HDR models sitting around $50 / £50 instead.",
    "We’d expect an Xbox streamer to sit near the latter price point, but not too much higher – though a $100 / £100 RRP isn’t impossible. That’s still far cheaper than a new console, or a refurbished last-gen Xbox One, so there’s a clear saving to be had for those who can’t afford a proper gaming machine.",
    "Of course, there are plenty of premium streamers that jump into three-figure sums, like the Apple TV 4K 2021 or Amazon Fire TV Cube, which offer a more multifaceted AV experience.",
    "The Apple TV 4K comes with Siri voice commands, a fancy Apple remote, HFR support, and an A12 processor that can comfortably outperform the value Roku Express streaming stick. The Fire TV Cube, meanwhile, doubles as an Alexa speaker and can act as a hub for other AV equipment. But an Xbox streaming stick likely wouldn’t need many fancy features beyond support for the Xbox Game Pass app.",
    "There’d be no need for it to connect with other Xbox hardware, for one, given the Xbox Series and Xbox One consoles come with the Game Pass app from the get-go. We’d love to see some localized co-op capability, with an Xbox streamer on one TV or monitor connecting to a console elsewhere in the house over Wi-Fi, but we don’t necessarily expect it from an initial streamer.",
    "We’ve seen in the Xbox Cloud Gaming beta, as well as the gradual rollout of Google Stadia, how even low-spec devices can sustain streams of AAA games when the bulk of the processing is done on an Xbox server instead of a local device – and that means you won’t need a mini Xbox plugged into your TV’s HDMI port to cope with sizeable games.",
    "However, you won’t be getting the processing needed to play demanding games offline – probably any games offline. While Xbox Game Pass traditionally lets you download games for later play, this wouldn’t make sense on a streaming stick that didn’t have the full power of an Xbox console.",
    "The streamer would need compatibility with Xbox controllers, as well as third-party gamepads, of course – and it’s possible that Microsoft would include some other software, such as an Edge browser or Skype, to round out the package. But it might be simplest, and cheapest, to focus the hardware entirely on the Game Pass app and its Cloud Gaming capabilities, especially as users will need an Xbox Game Pass Ultimate subscription to make use of them.",
    "The arrival of the PS5 and Xbox Series X has brought with it greater demand for 120Hz 4K TVs with HDMI 2.1 inputs, to futureproof for games that can truly make the most of these consoles’ many teraflops. But streaming devices rarely support 120Hz video, given how little content is available in that frame rate – especially outside the world of gaming – and it may jack up the price and complexity of this Xbox streamer to ensure it can support it. (It’s worth noting that Google Stadia is planning on introducing 120fps support soon, too.)",
    "This won’t be a huge problem for the first iteration of an Xbox cloud streamer, as most players will be making do with 60Hz displays still, and Xbox Series X games are still getting to grips with a desired 4K/60Hz benchmark. But in the long run – depending on how soon Microsoft plans on releasing this streamer – we would expect this capability to emerge.",
    "Lastly, when considering the form factor, we expect a similar design mentality to the Xbox Series X and Xbox Series S consoles.",
    "That means straight lines and rectangular shapes, with a recognizable Xbox logo – possibly like an Xbox console in miniature, just with an HDMI connector at the end of it. (The Xbox Series S looks a little like a thumb drive, after all.)",
    "Streaming sticks tend to be rather discreet on the whole. Roku and Amazon Fire TV streamers alike tend to be jet black and plug in at the rear of the television – though if Microsoft ends up releasing more of an ‘under the TV’ streaming device, like the Apple TV 4K 2021 or Nvidia Shield TV Pro, it might need to make its presence known a bit more confidently.",
    "Everything in the article above is just speculation for now, but with Microsoft confirming the development of its cloud streaming device, it can’t be too far off. Now just to see what’s announced at its E3 conference with Bethesda..."
  ],
  "headers": {
    "3": "Nicely priced",
    "8": "Limited power, but enough to get by on",
    "13": "Simple, flashy, recognisable"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "smart TVs": "https://www.techradar.com/news/best-tv",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Apple TV 4K 2021": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Amazon Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "fancy Apple remote": "https://www.techradar.com/news/the-new-apple-tv-4k-finally-fixes-its-biggest-problem",
    "Roku Express streaming stick": "https://www.techradar.com/reviews/roku-express",
    "Xbox Cloud Gaming": "https://www.techradar.com/how-to/how-to-stream-xbox-games-on-your-phone-or-tablet",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Xbox controllers": "https://www.techradar.com/news/xbox-one-controller-deals-cheap-xbox-wireless-gamepad-prices",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "PS5 and Xbox Series X": "https://www.techradar.com/news/ps5-vs-xbox-series-x-which-next-gen-console-should-you-buy",
    "120Hz 4K TVs": "https://www.techradar.com/best/120hz-4k-tvs",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "Xbox Series X games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Xbox Series X and Xbox Series S": "https://www.techradar.com/news/xbox-series-x-vs-xbox-series-s-which-xbox-will-be-right-for-you",
    "Nvidia Shield TV Pro": "https://www.techradar.com/reviews/nvidia-shield-tv-pro",
    "E3 conference with Bethesda": "https://www.techradar.com/news/e3-2021-microsoft-and-bethesda-confirmed-to-hold-a-joint-conference"
  }
}