{
  "source": "https://www.techradar.com/news/amazons-app-store-appears-in-windows-11-but-it-doesnt-work-yet",
  "title": "Amazon's app store appears in Windows 11, but it doesn’t work (yet)",
  "category": "computing",
  "updated": "2021-09-20T13:22:50Z",
  "author": "daryl-baxter",
  "summary": "The app gates are closed for now",
  "article": [
    "Amazon has finally brought its Android App Store to the redesigned Microsoft Store in Windows 11, but don’t get too excited, as it’s not accessible just yet.",
    "Microsoft made sure to showcase the redesigned store when Windows 11 was announced in June, however, Amazon’s App Store has been noticeably absent from the test builds of Windows 11, with Microsoft confirming that it wouldn’t see an appearance until 2022. But there are signs that it could be coming to the Insider Channels soon, allowing some users to test it out.",
    "From Windows 11 Build 22000, you’ll be able to see Amazon’s App Store displayed in the new Microsoft Store, but selecting it will bring you to a dead link. However, Amazon is also planning on launching a separate app for the Store once Windows 11 launches on October 5, so it could give users two different ways to access Android apps in Windows 11.",
    "While this partnership was confirmed back in June, the subsequent Insider Builds have been showcasing the redesigned Microsoft Store with fixes and new features, but Amazon’s App Store had been missing in action.",
    "While Microsoft confirmed that this would be appearing in 2022, it looks as though the next major update for Windows 11 will indeed include apps from Amazon.",
    "Since 2012, Apple has had an App Store just for the Mac, allowing users to buy and update apps for their Mac desktops and laptops. But with the change to Apple Silicon from Intel chips, you can now use iOS apps on macOS.",
    "In comparison, Microsoft has had it rough with the Windows Store, with subpar search features and an app library that was mostly junk, resulting in users downloading and updating their apps through the web or the apps themselves, and bypassing the store.",
    "But the redesigned Microsoft Store in Windows 11 is the first sign that the company is going all in with making sure that it’s a storefront that looks good, but also works well for both users and developers.",
    "Having Amazon apps available and ready to be used on laptops, desktops and Surface Pro devices could help entice more customers to upgrade to Windows 11, while being able to use Android apps from Amazon that they’ve been using on their smartphones for years.",
    "While we spoke of this move being something of a masterstroke, time will tell whether the combined efforts of the new Microsoft Store and Amazon’s App Store will be a tempting feature for users.",
    "Via Windows Latest"
  ],
  "headers": {
    "2": "When could Amazon’s App Store be live?",
    "5": "Analysis: the desktop App Store wars are just beginning"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Microsoft confirming": "https://www.techradar.com/news/one-of-windows-11s-most-exciting-features-wont-arrive-until-2022",
    "launching a separate app": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5093743404111819000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Famazon-appstore%2F9njhk44ttksx%3F%26activetab%3Dpivot%3Aoverviewtab",
    "we spoke of this move": "https://www.techradar.com/news/why-windows-11-going-with-amazon-for-its-android-apps-and-not-google-is-a-masterstroke",
    "Windows Latest": "https://www.windowslatest.com/2021/09/17/windows-11-amazons-android-store-shows-up-in-the-microsoft-store/"
  }
}