{
  "source": "https://www.techradar.com/news/game-of-thrones-spin-off-house-of-the-dragon-gets-an-ominous-first-trailer",
  "title": "Game of Thrones spin-off House of the Dragon gets an ominous first trailer",
  "category": "entertainment",
  "updated": "2021-10-05T10:51:18Z",
  "author": "axel-metz",
  "summary": "Gods. Kings. Fire. Blood.",
  "article": [
    "It’s official: Game of Thrones spin-off show House of the Dragon has got its first teaser trailer, and it’s every bit as ominous as you’d expect.",
    "“Gods. Kings. Fire. Blood,” says a sinister Matt Smith as the minute-long clip shows off battles, banquets and, of course, lots of flames. “Dreams didn’t make us kings. Dragons did.”",
    "You can check out the trailer below.",
    "Smith will star as prince Daemon Targaryen in the highly anticipated series, which is based on George R.R. Martin’s 2018 novel, Fire and Blood, and set 200 years before the events of Game of Thrones.",
    "House of the Dragon will chart the background of the Targaryen dynasty and the events leading up to the Targaryen civil war, known as the ‘Dance of the Dragons’. It’ll take place after a new king of Westeros, Viserys Targaryen (played by Paddy Considine), has taken the Iron Throne.",
    "We actually know a fair bit about the HBO show already – the studio released information surrounding its main cast of characters and actors ahead of leaks. But this first teaser trailer, as well as featuring previously announced cast members like Smith and Olivia Cooke, revealed several new cast members, too.",
    "HBO has since confirmed that Wil Johnson will star as Ser Vaemond Velaryon, younger brother to Coryls Velaryon (Steve Toussaint) and commander in the Velaryon navy, while John Macmillan will play Ser Laenor Velaryon, son of Corlys Velaryon and Rhaenys Targaryen (and therefore nephew of Ser Vaemond).",
    "Confused yet? Savannah Steyn has signed on to star as Ser Laenor’s sister, Lady Laena Velayron, and Theo Nate, interestingly, is listed as also playing Ser Laenor Velaryon, which we presume to mean a younger version of the character will feature in the show – perhaps through flashback sequences.",
    "It doesn’t look like Nate will be the only actor starring in the same role as another, either. He was recently pictured in costume alongside Milly Alcock, who is playing a younger version of Rhaenyra Targaryen – a character also set to be played by Emma D'Arcy.",
    "Admittedly, that’s a lot of Targaryens, but the original Game of Thrones series was famed for its incenstuous inter-familial politics, and it doesn’t seem like House of the Dragon will be departing from that mould.",
    "Author George R.R. Martin will be on hand as Executive Producer, too, so we’re anticipating a faithful re-telling of his latest published work.",
    "You can check out everything else we know about the show via our hub, which includes detailed rundowns of every character confirmed to appear so far, as well as our current understanding of its story.",
    "As for a release date? We already knew the 10-episode first season was scheduled to air on HBO and HBO Max sometime in 2022, and this first teaser trailer does little to add more detail – though we’d anticipate an arrival during the second half of the year."
  ],
  "headers": {
    "6": "A family affair"
  },
  "links": {
    "House of the Dragon": "https://www.techradar.com/news/house-of-the-dragon",
    "recently pictured": "https://www.dailymail.co.uk/tvshowbiz/article-9997123/House-Dragon-star-Milly-Alcock-seen-character-time-Game-Thrones-prequel.html",
    "hub": "https://www.techradar.com/news/house-of-the-dragon#section-house-of-the-dragon-cast"
  }
}