{
  "source": "https://www.techradar.com/news/spacexs-inspiration4-launch-window-pushed-back-24-hours",
  "title": "SpaceX's Inspiration4 launch window pushed back 24 hours",
  "category": "appliances",
  "updated": "2021-09-10T21:28:19Z",
  "author": "john-loeffler",
  "summary": "The earliest launch time is now September 15, 8PM EDT",
  "article": [
    "SpaceX's upcoming all-civilian space flight, Inspiration4, will launch at least 24 hours later than initially planned.",
    "In a statement on the its website, Inspiration4 said that during an initial weather briefing in Florida between SpaceX and Inspiration4, the two agreed to set a new target date no earlier than 8PM EDT on September 15.",
    "\"After evaluating the readiness of the Falcon 9 rocket, Dragon spacecraft, associated ground systems, recovery assets and other key elements of SpaceX’s human spaceflight system, and the current weather forecasts of conditions at the launch site, along the ascent corridor, and at the landing locations off the coasts of Florida for a safe return of the crew a few days later, teams agreed to now target no earlier than 8:00 p.m. ET on Wednesday, September 15 for liftoff,\" the statement says.",
    "\"This will allow additional time for final preparations, vehicle checkouts and data reviews. SpaceX and Inspiration4 will narrow down the launch window to five hours approximately three days before liftoff.\"",
    "While crewed spaceflights are generally exciting on the merits, this flight is especially notable in that it will be the first orbital space flight by an entirely civilian crew, a historic first.",
    "The crew is comprised of billionaire entrepreneur Jared Isaacman, geoscientist and science communicator Sian Proctor, physician Hayley Arceneaux, and data scientist Chris Sembroski. The purpose of the flight is to help raise money and awareness for St. Jude's Children's Research Hospital, as well as being a major space flight milestone.",
    "When it comes to rocket launches, weather is a major factor in whether a rocket can safely launch, so this far out from a preliminary launch date, there is naturally going to be a lot of movement, which is why we mostly talk about these things in terms of launch windows, rather than set times, at least this far out.",
    "As the launch gets nearer though, the final liftoff time will settle into a rough approximation, usually in the 24 hours before the launch.",
    "In this case, the best way to look at this is not that Inspiration4 was delayed, but that the historic spaceflight is finally here after months of anticipation. The fact that we're even talking about launch windows in terms of a day or even a few hours means that a launch is imminent, and we can't be more excited for it."
  ],
  "headers": {
    "6": "Analysis: a moving target isn't the same thing as a delay"
  },
  "links": {
    "Inspiration4": "https://www.techradar.com/how-to/how-to-watch-inspiration4-launch-into-history-aboard-a-spacex-rocket",
    "statement": "https://inspiration4.com/press/inspiration4-crew-arrives-in-florida-targeting-september"
  }
}