{
  "source": "https://www.techradar.com/news/star-wars-the-bad-batch-season-2",
  "title": "The Bad Batch season 2: everything we know so far",
  "category": "entertainment",
  "updated": "2021-08-31T10:45:31Z",
  "author": "richard-edwards",
  "summary": "What does The Clone Wars spin-off have in store for Hunter, Wrecker, Tech, Echo and Crosshair?",
  "article": [
    "The Clone Wars may be over but Clone Troopers still have a major role to play in that galaxy far, far away. The Bad Batch season 2 will continue the adventures of Clone Force 99, a ragtag group of unique troopers genetically engineered to possess traits that make them superior soldiers.",
    "While the first run of 16 episodes took a while finding its reason to exist, the show eventually carved out its niche in Star Wars canon, with potentially significant implications for The Mandalorian. The Bad Batch season 2 seems set to expand the mythology further, as Hunter, Tech, Wrecker, Echo, Crosshair and their young sidekick Omega try to find their place in a universe where the newly formed Empire is starting to throw its weight around.",
    "So, with the show’s return confirmed for 2022, we’ve sent our troopers on a covert mission to tell you everything you need to know about The Bad Batch season 2 release date, story, cast and more. Spoilers follow for season 1.",
    "Release date: The show’s been confirmed for a 2022 return. If we were gamblers like Lando Calrissian, we’d bet on a May debut.",
    "Cast: Dee Bradley Baker will return to voice the main cast of characters Hunter, Tech, Wrecker, Echo, Crosshair and any other clones they might encounter. We wouldn't bet against seeing the return of Ming-Na Wen as Fennec Shand – and maybe some other deep cuts from Star Wars lore will turn up.",
    "Story: With the Clones being phased out by the end of season 1, we expect to see the galaxy changing further around our characters in season 2. What happens to the dispossessed Clones is likely to come up more in future seasons, too.",
    "On August 5, just ahead of the two-part season 1 finale, Disney Plus confirmed confirmed (via StarWars.com) that the show will return. All we know for sure about The Bad Batch season 2 release date is that it will be some time in 2022. But, seeing as the first run kicked off (rather appropriately) on May 4 (aka Star Wars Day), we wouldn’t be surprised if season 2 debuts on the same date – not least because it falls on a Wednesday in 2022, which (after Loki and What If…?) now appears to be Disney Plus’s new favorite day for original launches.",
    "It’s still early days for a proper Bad Batch season 2 trailer. The first season 1 teaser didn’t appear until late March, just over a month before the show’s debut, and we’d expect to see a similar pattern for the follow-up. In the meantime, you can enjoy the announcement teaser that debuted on Instagram in August 2021.",
    "Spoilers follow for The Bad Batch season 1. If you're yet to watch it on Disney Plus, proceed with caution.",
    "Like its counterparts at Marvel, Lucasfilm isn’t in the habit of giving away major story details ahead of a Star Wars movie or TV show’s release. It would be a massive surprise, however, if The Bad Batch season 2 didn’t pick up where its predecessor left off.",
    "Following the Imperial fleet’s brutal destruction of Tipoca City and the cloning facilities on Kamino, Hunter, Tech, Wrecker, Echo and Omega parted ways with ex-Clone Force 99 member Crosshair. Even though Crosshair told the Bad Batch that his Order 66-initiated inhibitor chip had been removed – a fact confirmed by head writer Jennifer Corbett in an interview with StarWars.com – his allegiance remains with the Empire.",
    "As he’s so fond of reminding his brothers, “good soldiers follow orders”, but the question remains: will the Empire value his services now that Clones are being phased out in favour of conscripted TK Troopers, the forerunners of Imperial Stormtroopers?",
    "The Bad Batch, meanwhile, are likely to have some big decisions to make after they’ve departed Kamino in their ship, the Havoc Marauder. “We didn’t want to have everyone’s purpose locked in at the end of season 1,” supervising director Brad Rau told StarWars.com. “It’s something that they deal with in a big way as we move into season 2. What is their purpose from all of their different points of view? It’s going to be a big deal, something we really wanted to dig into.”",
    "Although the Bad Batch are on the run from Imperial forces, they’re yet to take up arms in earnest against the Emperor’s totalitarian regime. As they see more and more of the oppressive tactics employed against the populace, however, it seems unlikely they’ll continue doing odd jobs for former Jedi informant/information broker Cid when they could be joining the fight.",
    "So will Clone Force 99 have a role to play in establishing the Rebellion against the Empire?",
    "The Martez sisters’ appearance in season 1 strongly hinted the duo are involved in some kind of resistance movement, and their contact looked a lot like Rebel Alliance bigwig (and Leia’s adopted dad) Bail Organa. (That said, we know from Star Wars Rebels that the Alliance won’t come together for over a decade, so there’s a limit to how pivotal the Bad Batch can be in its formation.)",
    "We also expect The Bad Batch season 2 to tell us more about the backstory of Omega, the unique female clone of Jango Fett who’s become Hunter, Tech, Wrecker and Echo’s travelling companion. Although still a child, she’s actually older than the members of Clone Force 99 who – like their Clone brothers – had their growth rate accelerated by the Kaminoans. Omega knows that the Batch were created with “desirable” genetic mutations to make them into superior soldiers – and there’s surely more to learn about her own origins.",
    "We can also expect to learn more about the Clones spread throughout the galaxy in the wake of the Clone Wars. “We will not let that storyline go undiscussed, for sure,” confirmed Rau. It remains to be seen, however, whether that means Clone Wars veteran Rex and his future Rebels sidekick Gregor will see more action, or the introduction of new Clones.",
    "The Bad Batch may be animated but it’s just as important to Star Wars canon as its live-action counterparts. As the first TV show or movie to dive into the early days of the Galactic Empire, it’s travelling to previously unexplored regions of the Star Wars timeline – and has surprisingly major implications for The Mandalorian season 3.",
    "The final scene of The Bad Batch’s first season saw chief Kaminoan scientist Nala Se arriving at an Imperial outpost – concept art suggests this is Mount Tantiss on Wayland, a planet that appeared in the (now non-canonical) expanded universe. Intriguingly, the Imperial scientist who greets Nala Se is wearing the same uniform as Dr Pershing, the geneticist who used Grogu (aka Baby Yoda) as a test subject in The Mandalorian.",
    "It’s long been speculated that Pershing’s experiments are part of Palpatine’s long-standing plan to clone himself – a project that came to fruition in The Rise of Skywalker – so there’s a good chance Nala Se will be laying the groundwork for the Emperor’s nefarious schemes. “Where Nala Se is, what Nala Se is doing, should be a mystery to the audience,” Corbett told StarWars.com, “and we hope to explore that in the upcoming season.”",
    "Bounty hunters – always integral to the Star Wars mix – also help to tie The Bad Batch season 2 into existing canon.",
    "In the first season, Kaminoan prime minister Lama Su hired The Clone Wars’ biggest Clint Eastwood fan, Cad Bane, to track down Omega, prompting Nala Se to dispatch Fennec Shand to protect her. Shand’s presence is unlikely to be a coincidence.",
    "The infamous Boba Fett saved her from death by on the surface of Tatooine in the first season of The Mandalorian, and the bounty hunting duo subsequently became associates – to the point that they’re the two leads in spin-off show The Book of Boba Fett. Could The Bad Batch – set more than 20 years earlier – detail the beginnings of their friendship?",
    "With Fett still in his teens at this point in the Star Wars timeline, they’ll both be young bounty hunters making their way in the universe. We also know from The Clone Wars that the young Fett had associations with other representatives of the trade, including Dengar, Bossk and Aurra Sing.",
    "Assuming he does turn up in The Bad Batch season 2 (Fennec Shand actor Ming-Na Wen was cagey when TechRadar asked her about his return back in June), Fett is likely to have a particular interest in Omega. After all, like him, she’s an unaltered clone of their father, Jango.",
    "With the show set between the prequel trilogy and the original trilogy, most of the major characters in the franchise are potentially in play. While it’s unlikely Han Solo, Luke and Leia will make an appearance (the twins are just infants at this point in the timeline), the cargo bay doors are open for the likes of Darth Maul, Grand Admiral Thrawn and even Darth Vader to cross paths with Clone Force 99.",
    "Official confirmation of The Bad Batch season 2 cast is yet to emerge, but it would be a surprise of Death Star-shattering proportions if the headliners don’t look something like this:",
    "Put simply, there would be no Bad Batch without Dee Bradley Baker. Having voiced legions of Clone Troopers throughout The Clone Wars, the actor plays the five lead roles in the show, giving unique personalities to Hunter, Tech, Wrecker, Echo and Crosshair. He also voiced additional Clones in season one, including a couple of veterans of The Clone Wars and Rebels, Rex and Gregor.",
    "Michelle Ang is likely to be back as the Bad Batch’s ‘sister’ Omega, and we’d be surprised if Cheers’ Rhea Perlman doesn’t return as Cid. With Kaminoan scientist Nala Se now working at an Imperial facility, we’d expect to hear more from Gwendoline Yeo, while Noshir Dalal is likely to lead the Empire’s pursuit of Clone Force 99 as Vice Admiral Rampart.",
    "Beyond those regulars, we’re into less predictable guest star territory.",
    "On the bounty hunter front, we’re predicting returns for Ming-Na Wen and Corey Burton as Fennec Shand and Cad Bane, respectively. And if Boba Fett does make an appearance in The Bad Batch season 2, that could mean a return for Daniel Logan, who played the young version of the bounty hunter in both Attack of the Clones and The Clone Wars.",
    "As for the Imperials, it’s likely Stephen Stanton will crop up again as future Grand Moff Tarkin. A Palpatine cameo, meanwhile, would probably prompt the return of Sam Witwer, who voiced the character in Rebels and later episodes of The Clone Wars – as well as playing Darth Maul. (While Ian McDiarmid reprised his live-action role as Palpatine in the first episode of The Bad Batch, the scene was lifted from his performance in Revenge of the Sith.)",
    "Part of the fun with any of the Star Wars animated shows, however, is listening out for big-name actors cropping up in the soundtrack, whether they’re Star Wars legends (Billy Dee Williams appeared as Lando in Star Wars Rebels), or simply fans of the franchise (Simon Pegg cropped up as bounty hunter Dengar in The Clone Wars). The Bad Batch’s first season featured a cameo from Fleabag’s Sian Clifford as a protocol droid.",
    "Behind the camera, the principal production team remains largely unchanged, with Jennifer Corbett as lead writer, Brad Rau as supervising director, and Dave Filoni (a veteran of The Clone Wars and Rebels, the creator of The Bad Batch, and Lucasfilm’s executive creative director) serving as executive producer."
  ],
  "headers": {
    "6": "The Bad Batch season 2: release date",
    "7": "The Bad Batch season 2 trailer",
    "8": "The Bad Batch season 2 story: what do we know about the plot?",
    "27": "The Bad Batch season 2 cast: whose voices will we hear?"
  },
  "links": {
    "took a while finding its reason to exist": "https://www.techradar.com/news/star-wars-the-bad-batch-is-still-searching-for-its-reason-to-exist",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "StarWars.com": "https://www.starwars.com/news/brad-rau-jennifer-corbett-interview-the-bad-batch",
    "Loki": "https://www.techradar.com/news/loki-season-2",
    "What If…?)": "https://www.techradar.com/news/inside-marvels-what-if-the-disney-plus-animated-show-that-reshapes-the-mcu",
    "Instagram": "https://www.instagram.com/p/CSMZG84Lo20/",
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "Ming-Na Wen": "https://www.techradar.com/news/star-wars-the-bad-batchs-ming-na-wen-on-the-return-of-the-mandalorians-fennec-shand"
  }
}