{
  "source": "https://www.techradar.com/news/microsoft-edge-now-stops-you-from-downloading-dodgy-files",
  "title": "Microsoft Edge now stops you from downloading dodgy files",
  "category": "computing",
  "updated": "2021-09-27T11:44:14Z",
  "author": "mike-moore",
  "summary": "Mixed content downloads and more blocked in Edge 94",
  "article": [
    "Downloading files using Microsoft Edge should soon be safer than ever thanks to a new update.",
    "The company has announced that the newest build of its web browser will feature some improved security tools as it looks to ensure users stay safe online.",
    "This includes upgrades for how certain file types are monitored and secured, as Microsoft continues to make Edge a more attractive proposal for users around the world ahead of the release of Windows 11.",
    "Among the new features for Edge 94 is a block on mixed content downloads, hopefully helping secure users from malware or other malicious files lurking online.",
    "The company says that going forward, secure pages will only download files hosted on other secure pages. Downloads hosted on \"non-secure\" (aka non-HTTPS) pages will be blocked if the user initiates the process from a secure page.",
    "Edge 94 will also restrict private network requests to secure contexts, with access to resources on local (intranet) networks from pages on the internet now requiring that those pages be delivered over HTTPS.",
    "Microsoft says it will also now be offering a new extended Stable option to our managed Enterprise customers. This will be updated every eight weeks, with a biweekly security update included, helping Edge users stay protected from all the latest threats.",
    "Edge 94.0.992.31 is available to download on the Stable channel now, with the release coming shortly after Microsoft announced it has now seen a thousand builds pass through its Dev and Canary Insider channels.",
    "This number is only set to rise as Edge is set to play a central role in Windows 11, set for release very soon.",
    "Edge, which will ship as the pre-installed browser on the platform, could well see its user numbers rise to greater numbers than ever before, with a major makeover scheduled for the launch of Windows 11, with a redesigned interface bringing it into line with the new software's stripped-back design.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Edge protection"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/how-to/microsoft-edge",
    "web browser": "https://www.techradar.com/best/browser",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Edge is set to play a central role in Windows 11": "https://www.techradar.com/news/microsoft-edge-is-getting-a-windows-11-flavored-visual-refresh",
    "MSPowerUser": "https://mspoweruser.com/microsoft-edge-94-released-to-the-stable-channel-changelog/"
  }
}