{
  "source": "https://www.techradar.com/news/battlefield-2042-cheaters-wont-have-anywhere-to-hide-thanks-to-new-tool",
  "title": "Battlefield 2042 cheaters won't have anywhere to hide thanks to new tool",
  "category": "gaming",
  "updated": "2021-09-30T15:00:34Z",
  "author": "vic-hood",
  "summary": "'If you don't play by the rules, you're out'",
  "article": [
    "Battlefield 2042 developer EA Dice has revealed its new player reporting system alongside its plans to combat cheaters in the upcoming FPS.",
    "In a blog post, EA Dice laid out Battlefield 2042's \"Positive Play\" features, Community Charter, and Reporting tools, as well as the \"Fair Play measures\" the developer has implemented to \"ensure a level playing field\".",
    "In the post, EA Dice revealed that it will be using the Easy-Anti Cheat (EAC) tool to identify Battlefield 2042 cheaters, both in the Battlefield 2042 beta and full release.",
    "This is the same anti-cheat tool used in the likes of Apex Legends and Star Wars: Squadrons, with EA Dice also assuring players that it is \"effective in ensuring your privacy, and security\".",
    "Another new anti-cheat feature in Battlefield 2042 is, due to the game's cross-play functionality, those who are found to be cheating on one platform will be \"instantly disconnected mid-match and permanently banned across all platforms\".",
    "EA Dice also warned that it has the ability to apply IP and hardware bans. In addition, cheaters won't be given any warning or suspension, instead \"if you don't play by the rules, you're out\".",
    "\"Ensuring Fair Play and combating modern cheating solutions is an ongoing commitment that doesn't end at launch,\" the blog post reads.",
    "\"While not always visible to you as a player, this means that post launch we'll continue to invest in developing internal capabilities and technologies that augment 3rd party anti-cheat solutions, provide multiple layers of defense, and ensure our games are fair and fun for everyone.\"",
    "But it's not just anti-cheating tools that are improving in Battlefield 2042, EA Dice has also made reporting players that break the rules laid out in the Community Charter \"faster than in previous Battlefield titles\".",
    "Battlefield 2042 will finally let you report players directly in-game, with players able to select the player they want to report from the Social Menu and selecting what offence they wish to report them for.",
    "What's more, players will also have more transparency on their reports, with a message appearing in-game confirming your report and a follow-up email letting you know its outcome.",
    "However, EA Dice has encouraged players who receive abusive messages in a chat or voice on Xbox or PlayStation to report these issues directly to PlayStation and Xbox.",
    "In addition to improved reporting and anti-cheating tools, Battlefield 2042 also boasts \"Positive Play\" features such as the ability to block or unblock players in-game, a constant in-game text profanity filter, the ability to mute players, and admin tools within Battlefield Portal allowing you to apply persistent bans across your creations.",
    "\"If you have repeat or severe instances, we may permanently terminate your account,\" the blog post reads. \"This includes all of your EA Accounts if you have more than one account.\"",
    "You can check out the full Battlefield Community Charter here.",
    "It looks like EA Dice is laying down the law when it comes to creating a positive play environment in Battlefield 2042, but how successful that will be remains to be seen.",
    "When it comes to reporting, it's welcome news to see EA Dice making reporting players easier than it was in previous titles, however, we doubt the Community Charter will offset would-be \"bad actors\", as the developer calls them.",
    "While reporting looks to have improved, whether Battlefield 2042 will really be able to combat cheaters is something we're a bit more skeptical about.",
    "As reported by our friends at PCGamer, Battlefield 2042 cheats are already on the market and cheaters are always finding ways around anti-cheat tools.",
    "What's more, Apex Legends may not have as many cheats as the likes of Warzone, but it's certainly had its fair share. If the developer can't get a handle on cheaters early, it risks losing players.",
    "The Battlefield 2042 beta kicking off next week will be the first test of EA Dice's new measures ahead of the game's release on November 19, 2021."
  ],
  "headers": {
    "8": "Improved reporting",
    "15": "Analysis: but how effective will it actually be?"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "blog post": "https://www.ea.com/games/battlefield/battlefield-2042/battlefield-community-charter",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "here": "https://docs.google.com/document/d/1sEFVzjA3V16n9T1xmvqLYAe0bbNuxYep/",
    "PCGamer": "https://www.pcgamer.com/uk/battlefield-2042-cheats-are-already-being-sold-two-months-before-launch/",
    "fair share": "https://www.gamesradar.com/apex-legends-bans-2000-dashboarding-cheaters/#:~:text=Apex%20Legends%20has%20banned%20over,were%20seemingly%20cheating%20on%20PS4."
  }
}