{
  "source": "https://www.techradar.com/news/apples-new-macbook-pro-will-lure-people-to-upgrade-heres-how-many-will-bite",
  "title": "Apple’s new MacBook Pro will lure people to upgrade – here’s how many will bite",
  "category": "computing",
  "updated": "2021-10-15T18:16:29Z",
  "author": "allisa-james",
  "summary": "Plenty of current users are ready to take the plunge",
  "article": [
    "Ahead of Apple’s Unleased event premiering this Monday, an analyst made a surprising prediction: that the two M1X- powered 14-inch and 16-inch MacBook Pro models expected to be announced will motivate almost a third of current MacBook Pro owners to open their wallets and splurge on the upgrade.",
    "“The proprietary M1X processor is the foundational part of this MacBook and ultimately we believe will be a game changer that will convert 30%+ of current MacBook users to upgrade over the next year catalyzing growth on this hardware segment,” according to Wedbush analyst Daniel Ives.",
    "And though there’s no confirmation on the third generation of AirPods, Ives is confident that they will be making an appearance at the event as well. He states that, according to his supply chain checks, AirPods 3 have already been manufactured and are awaiting a global shipment.",
    "News of the MacBook Pro 14-inch and 16-inch have been circulating for some time now. Though the 16-inch version didn’t premiere during the WWDC 2021 event as previously hoped, both are expected to show up for the Apple event on Monday, October 18.",
    "In his prediction, Ives detailed the new models’ specs, which aligns with information from the widely circulated rumors. He says the upgraded versions will come with a new 10-core version of the M1 Apple silicon CPU, which includes eight high performance and two energy-efficiency ones, as well as up to 64GB of RAM.",
    "However, another rumor seems to fly in the face of that last spec and instead purports that the new models will cap out at 32GB of RAM instead. They will also feature a mini-LED display, an HDMI port, MagSafe charging, and more.",
    "There’s also another rumor spreading around concerning the Touch Bar: Apple seems to be considering scrapping the feature altogether. This move is daring to say the least but would reduce the price of the laptops if done away with. According to a Bloomberg report, Apple has already been testing models without the controversial feature.",
    "Naturally, these are all speculation as the notoriously tight-lipped Apple has not said a word about what it intends to reveal at the Unleashed event, so make sure to take everything with a grain of salt.",
    "Via 9to5Mac"
  ],
  "headers": {
    "3": "Analysis: Rumors abound"
  },
  "links": {
    "Unleased event": "https://www.techradar.com/news/hyperspeed-macbook-pro-2021-coming-next-week-apple-hints-with-invite",
    "14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "Wedbush": "https://wedbush.bluematrix.com/sellside/EmailDocViewer?encrypt=2bac889e-3aa0-434a-82ea-a6fde5c7399d&mime=pdf&co=wedbush&id=equityresearchdistribution@wedbush.com&source=9to5mac",
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "didn’t premiere": "https://www.techradar.com/news/is-apple-set-to-reveal-new-macbook-pro-at-wwdc-2021",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "another rumor": "https://www.techradar.com/news/new-macbook-pro-2021-rumor-delivers-both-good-and-bad-news",
    "Bloomberg report": "https://www.techradar.com/news/apple-could-be-killing-off-one-of-the-macbook-pro-16-inchs-most-controversial-features",
    "9to5Mac": "https://9to5mac.com/2021/10/15/2021-macbook-pro-upgrade/"
  }
}