{
  "source": "https://www.techradar.com/news/nokia-warns-of-transitional-2021-as-it-steps-up-5g-fight",
  "title": "Nokia warns of transitional 2021 as it steps up 5G fight",
  "category": "phones",
  "updated": "2021-02-05T12:06:32Z",
  "author": "steve-mccaskill",
  "summary": "Nokia warns of short term pain despite better than expected Q4",
  "article": [
    "Nokia has reiterated that it plans to do “whatever it takes” to be the market leader in 5G, even if that means sacrificing short-term profitability.",
    "The Finnish telecoms equipment manufacturer posted better than expected Q4 results with net sales down 5% to £6.6 billion.",
    "It attributed the performance to demand for its 5G equipment, particularly in the higher margin North American market, which were offset by declines in its legacy portfolio.",
    "However, this strong finish to the year was accompanied by a warning of lower forecasts in 2021 due to fierce competition in the 5G and a promise to increase R&D investments to increase its technical capabilities.",
    "The Finnish networking giant is locked in a fiercely contested battle with other Network Equipment Providers (NEPs) such a Ericsson and Huawei and had pitched itself as the only vendor to have a portfolio that extends across the radio, transport and core layers of the network.",
    "However, the company was surprised by the earlier-than-expected shift to 5G and has struggled with the high cost of developing 5G technologies. There has also been criticism that it has failed to fully capitalise on Huawei’s well-documented struggles, with Ericsson generating significant momentum in North America and also winning contracts in China.",
    "Pekka Lundmark was appointed as CEO last summer to remedy the situation and he initiated a major internal restructure that abandoned the ‘end-to-end’ strategy. He told investors that despite a “solid Q4”, it expects revenues to drop in 2021.",
    "“The healthy close to the year does not change our earlier communicated view for Nokia-level operating margin expected in 2021,” he said.",
    "“We will invest whatever it takes to win in 5G. Completing the turnaround in Mobile Networks remains our top priority for 2021, and these visible signs of progress give me confidence that we are on the right track but there is still work to be done.",
    "“We expect 2021 to be challenging, a year of transition, with meaningful headwinds due to market share loss and price erosion in North America.",
    "“Delivering on our new operating model for a strong and sustainable long-term business requires us to make further 5G R&D investments in 2021, meaning we will sacrifice some short-term margin to ensure leadership in 5G.”"
  ],
  "headers": {
    "3": "Nokia 5G"
  },
  "links": {
    "5G": "https://www.techradar.com/best/best-5g-phones"
  }
}