{
  "source": "https://www.techradar.com/news/twitter-is-going-all-in-on-security-keys",
  "title": "Twitter is going all-in on security keys",
  "category": "computing",
  "updated": "2021-03-16T17:00:24Z",
  "author": "anthony-spadafora",
  "summary": "You can now use multiple security keys to secure your Twitter account",
  "article": [
    "After adding support for security keys last December, the social network Twitter has announced that it will soon allow accounts with two-factor authentication (2FA) enabled to use security keys as their only authentication method.",
    "As it stands now though, users can use a security key to sign in to their Twitter account but they will also need to have another 2FA method such as an authenticator app or SMS codes enabled as a backup.",
    "Although authentication apps such as Google Authenticator or Microsoft Authenticator are more secure than using SMS codes, physical security keys offer the most secure way to protect your online accounts. This is because you don't need to type in a code that could potentially be intercepted by a malicious third party.",
    "One of the other benefits of using a security key to login in to Twitter is the fact that users don't need to provide the social network with any additional personal information such as their telephone number in order to be able to login to their accounts.",
    "As security keys are becoming increasingly popular at enterprise organizations such as Google which used them to stop phishing attacks completely, more users are now using multiple security keys to secure their online accounts. For instance, you may have one security key for your work accounts and another for your personal accounts.",
    "For this reason, Twitter Support revealed in a recent tweet that the social network now support multiples security keys, saying:",
    "“Secure your account (and that alt) with multiple security keys. Now you can enroll and log in with more than one physical key on both mobile and web. And coming soon: the option to add and use security keys as your only authentication method, without any other methods turned on.”",
    "Users can begin using multiple security keys with their Twitter accounts now though the company has not revealed when security key-only 2FA will be coming to the platform.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Multiple security keys"
  },
  "links": {
    "security keys": "https://www.techradar.com/best/best-security-key",
    "Twitter": "https://www.techradar.com/news/twitter-is-moving-more-of-its-platform-on-to-google-cloud",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "Google Authenticator": "https://www.techradar.com/news/google-2fa-authentication-could-be-less-secure-than-thought",
    "Microsoft Authenticator": "https://www.techradar.com/news/microsoft-authenticator-is-getting-its-own-password-manager",
    "personal information": "https://www.techradar.com/news/keeping-personal-information-secure",
    "stop phishing attacks completely": "https://www.techradar.com/news/google-reveals-how-it-has-stopped-phishing-attacks-for-good",
    "recent tweet": "https://twitter.com/TwitterSupport/status/1371510300973875201?s=20",
    "The Verge": "https://www.theverge.com/2021/3/15/22332234/twitter-security-key-2fa-authenticator-privacy"
  }
}