{
  "source": "https://www.techradar.com/news/2021-ipad-pro-drops-back-down-to-lowest-price-ever-in-amazon-ipad-deals",
  "title": "2021 iPad Pro drops back down to lowest price ever in Amazon iPad deals",
  "category": "tablets",
  "updated": "2021-07-15T11:28:06Z",
  "author": "tabitha-baker",
  "summary": "Excellent savings on a recent release",
  "article": [
    "While iPad deals on the brand new 2021 iPad Pro have offered some impressive discounts since release, those sales haven't been too frequent. Today, however, Amazon is offering the 11-inch device with 128GB of storage for just $749, that's $50 off the $799 MSRP.",
    "We've seen this price from a couple of retailers before - Walmart, most notably, was offering this record low cost to compete with Amazon's Prime Day offerings in June. However, this offer does run out of stock quickly so if you've had your eye on the latest release we wouldn't wait too long to take advantage of the discount here.",
    "In fact, it's rare that iPad deals would hit such a new iPad Pro so soon after its release date. The previous generation only saw a comparable discount after four months on the market, whereas the 2021 model was only released on May 21. That makes Amazon's offer all the more impressive this week - a rare chance to save a good chunk of cash on a premium Apple device.",
    "Not in the US? Scroll down for more iPad deals in your region.",
    "If you're after something much cheaper, you'll find a range of Android tablet deals up for grabs right now. Or to check out the competition, take a look at the latest Samsung Galaxy tablet prices. We're also rounding up all the latest Apple Pencil deals and Magic Keyboard sales as well."
  ],
  "headers": {
    "4": "More iPad deals"
  },
  "links": {
    "for just $749, that's $50 off the $799 MSRP": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0932B5NVD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1385631404522442800-20",
    "iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "Android tablet deals": "https://www.techradar.com/deals/the-best-cheap-android-tablet-deals",
    "Samsung Galaxy tablet prices": "https://www.techradar.com/news/mobile-computing/tablets/samsung-galaxy-tab-deals-1295910",
    "Apple Pencil deals": "https://www.techradar.com/deals/the-best-cheap-apple-pencil-prices-sales-and-deals",
    "Magic Keyboard sales": "https://www.techradar.com/deals/ipad-pro-cheap-magic-keyboard-price-deals-sales"
  }
}