{
  "source": "https://www.techradar.com/news/firefox-relay-wants-to-use-email-aliases-to-keep-your-details-safe-online",
  "title": "Firefox Relay wants to use email aliases to keep your details safe online",
  "category": "computing",
  "updated": "2021-11-16T19:00:04Z",
  "author": "anthony-spadafora",
  "summary": "Sign up for new online accounts without giving away your real email address to third parties",
  "article": [
    "When you use your real email address while shopping for Black Friday and Cyber Monday deals online, hundreds if not thousands of third parties will then have access to it which is why Mozilla has launched a new free service to provide users with email aliases instead.",
    "Firefox Relay (formerly known as Firefox Private Relay) is a privacy-first and free product that hides your real email address to help further protect your identity online. By pointing your browser to relay.firefox.com and configuring the service, you'll get five email aliases that you can use whenever you sign-up for an online account.",
    "Mozilla has designed Firefox Relay to send and forward incoming emails from your alias email addresses to your primary email address and the company doesn't' read or keep any of the content in your messages. All email messages are also deleted from its servers after they've been sent and delivered to users.",
    "In addition to providing users with five free email aliases and up to 150kb attachments, Mozilla has even added labels to Firefox Relay that can be used to add information like an account name or a description so users know which sites they are using a particular alias for. These labels can also be synced across devices so you can keep track of your alias email address on your smartphone as well as on your computer.",
    "To get started using Firefox Relay, you'll first have to head to relay.firefox.com and sign in with your Firefox Account or create one if you don't have one yet. From here, you can generate up to five free random email aliases to use when signing up for new online accounts.",
    "Those that want even more email aliases can sign up for Firefox Relay Premium which Mozilla decided to offer after receiving feedback from users during the service's beta testing phase. The premium version of the service provides users with one subdomain from which they can create unlimited email aliases.",
    "Firefox Relay Premium also includes other features such as a summary dashboard of a user's email aliases, the option to use their email aliases to reply to emails directly and customer support though a convenient contact form.",
    "To commemorate the official launch of Firefox Relay, Mozilla is running a promotion where users in Canada, the US, the UK, Malaysia, Singapore, New Zealand, Austria, Belgium, France, Germany, Ireland, the Netherlands, Spain and Switzerland can get Firefox Relay Premium for the low introductory price of just $0.99 a month.",
    "Looking to further protect yourself online? Check out our roundups of the best endpoint protection software, best firewall and best identity theft protection"
  ],
  "headers": {
    "4": "Firefox Relay Premium"
  },
  "links": {
    "email address": "https://www.techradar.com/news/best-email-provider",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Firefox Private Relay": "https://www.techradar.com/news/new-browser-plugin-generates-burner-email-addresses-to-protect-you-from-spam",
    "protect your identity": "https://www.techradar.com/best/best-identity-theft-protection",
    "browser": "https://www.techradar.com/best/browser",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "computer": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Firefox Account": "https://www.techradar.com/news/firefox-on-android-is-getting-a-super-useful-time-saver-update",
    "Firefox Relay Premium": "https://relay.firefox.com/",
    "best endpoint protection software": "https://www.techradar.com/news/best-endpoint-security-software",
    "best firewall": "https://www.techradar.com/best/firewall",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}