{
  "source": "https://www.techradar.com/news/everwild-update-suggests-xbox-exclusive-might-be-re-revealed-soon",
  "title": "Everwild update suggests Xbox exclusive might be re-revealed soon",
  "category": "gaming",
  "updated": "2021-10-21T09:14:14Z",
  "author": "gerald-lynch",
  "summary": "Everwild might be further along than first thought",
  "article": [
    "Everwild, the new Xbox-exclusive game from Rare, makers of Donkey Kong Country and Sea of Thieves, may be further along in development than first thought.",
    "A report earlier this year suggested that the mysterious game, absent from Microsoft’s Xbox showcases since a teaser trailer was revealed back in November 2019, had seen its development restart from scratch following the departure of Everwild's creative director Simon Woodroffe in 2020.",
    "But according to Xbox Game Studios head Matt Booty, speaking with Kinda Funny, those reports were \"more definite and a little more extreme\" than reality. With Gregg Mayles at the helm (whose previous credits include Banjo-Kazooie and Sea of Thieves), Everwild is back on track.",
    "\"What is Rare known for?\" Booty said. \"They're known for creating new IP and creating worlds. I'll say when you look at it from the outside, when you hear words like 'reset' and maybe 'restructure,' those are probably a little more definite and a little more extreme than what really happens as a game comes to life.\"",
    "Booty compared the development cycle to his time working with NBA Jam developer Mark Trammell.",
    "\"He used to say that a game gets made a thousand small decisions at a time,\" Booty said. \"Every day you're making hundreds of small decisions and at the end of however long you work on the game, they all add up. I think that's where the Everwild team is right now. They're just trying to make sure that they've got something special.\"",
    "\"There's some days where you're just terrified,\" Booty added. \"'What are they making? How is this ever going to come together?' Then you balance that out with a day later, this build comes together and you're like 'this is magic.'\"",
    "Little is known about Everwild beyond its evocative first trailer. It showed a fantasy-like world with pastoral elements, mystical creatures and elf-like folk wandering magical forests. The game was said to incorporate both adventure and ‘god-sim’ elements according to rumors, but with the game’s redirection having taken place, who knows how accurate that now is, or indeed ever was.",
    "But the wait to find out more may not be too protracted. Booty stated that the team at Rare \"don't want to keep things hidden for too long.\" So hopefully some concrete info on the game will appear sooner rather than later."
  ],
  "headers": {
    "3": "A thousand small decisions"
  },
  "links": {
    "Everwild": "https://www.techradar.com/news/everwild-release-date-trailers-news-rumors",
    "had seen its development restart from scratch": "https://www.techradar.com/news/everwild-reportedly-rebooted-now-targeting-2024-release-date",
    "Kinda Funny": "https://www.youtube.com/watch?v=9yAxx4DaDmY"
  }
}