{
  "source": "https://www.techradar.com/news/amd-big-navi",
  "title": "AMD Big Navi release date, price and specs: everything we know about RDNA 2",
  "category": "computing",
  "updated": "2021-03-26T17:22:31Z",
  "author": "jackie-thomas",
  "summary": "AMD is getting ready to take Nvidia out",
  "article": [
    "Thanks to AMD Big Navi, Team Red is all geared up to take on Nvidia and it’s RTX graphics cards. GPUs like the RTX 3080, RTX 3090, and RTX 3070 has taken the gaming world by storm with all that power at more affordable price points (in Nvidia standards, that is). Luckily, AMD has gone on the offensive and finally made a comeback in the high-end GPU market.",
    "With the RDNA 2 graphics architecture behind the Xbox Series X and PlayStation 5, Big Navi has certainly met expectations with offerings like the Radeon RX 6800 XT, Radeon RX 6800 and the mighty Radeon RX 6900 XT. Out now and unveiled in all its full glory, it’s giving AMD fans a reason to upgrade and non-AMD fans a reason to switch. Even the more affordable AMD Radeon RX 6700 XT have proven to be excellent propositions despite their slightly higher price of entry.",
    "That isn’t to say that AMD is now only focusing on the high-end market with its Big Navi cards. There are mid-range options in the series as well. So, whether you’re looking for a big-budget purchase in the GPU market or need something more affordably priced, there’s certainly something for you in the AMD Big Navi series.",
    "It seems like AMD Big Navi release date rumors have been everywhere since the very beginning of time – or at least since Navi rumors first started appearing in late 2018. Initially, we had heard that Big Navi would be launching at Computex – but Computex didn’t even happen.",
    "Days after Nvidia’s announcement of the RTX 3080 however, AMD teased the launch of both its Zen 3 desktop processors and RDNA 2 graphics cards, with the latter expected to come in right before Halloween on October 28 at 12pm EST – just a couple weeks before the November 10 launch of the Xbox Series X that the graphics architecture will be powering.",
    "The AMD Radeon RX 6800 and Radeon RX 6800 XT officially launched on November 18 while the Radeon RX 6900 XT arrived a little later on December 8. The latest addition to the series, the AMD Radeon RX 6700 XT, hit the streets on March 18, 2021.",
    "AMD has traditionally enjoyed a reputation for providing more affordable products than their competition.",
    "And to back this up, we'd like to point to the AMD Radeon VII. With this graphics card, AMD genuinely provided performance that was pretty close to what the Nvidia GeForce RTX 2080 provided at the time, while sitting with a price tag of $679 (about £540, AU$970), which was very close to the RTX 2080's $699 (£649, AU$1,119) price tag at the time.",
    "Now, since launching its Navi lineup, AMD has put some price pressure on Nvidia's mid-range offerings, most notably baiting Nvidia into lowering its prices on its Super cards at the last minute. So, we might see something that challenges the RTX 2080 Ti for maybe $200 (£200, AU$300) less than that card's MSRP, but don't expect graphics card prices to drop to where they were before Nvidia Turing made everything more expensive.",
    "So, AMD's Big Navi lineup starts at $479 (£419.99, about AU$620). That’s for the Radeon RX 6700 XT. The Radeon RX 6800 costs $579 (around £440, AU$820) while the AMD Radeon RX 6800 XT costs $649 (around £500, AU$1,000). The priciest offering is the AMD Radeon RX 6900 XT, which sets you back a whopping $999 (£770, about AU$1,400).",
    "With the AMD Radeon RX 6800 XT and the AMD Radeon RX 6900 XT, AMD has undercut Nvidia's rival RTX 3080 and RTX 3090 cards, respectively.",
    "A big thing for Big Navi is taking on Nvidia's strongest graphics cards, which requires a lot of muscle, especially for the RX 6900 XT, which is directly targeting the RTX 3090. While we haven't got our hands on these graphics cards yet, the on-paper specs are incredibly impressive.",
    "Right off the bat, the Radeon RX 6800 XT is looking like it's going to be the headline graphics card here, even if it's not quite in the same league as the Radeon RX 6900 XT – it's also much less expensive. AMD is claiming that this RTX 3080 competitor will be twice as powerful as the AMD Radeon RX 5700 XT.",
    "That first-generation RDNA graphics card is packed with 40 compute units, with 2,560 Stream Processors (SPs), backed with a game frequency of 1,755 MHz. The Radeon RX 6800 XT, on the other hand, is packed with 72 Compute Units, with a game frequency of 2,015MHz. Assuming each RDNA 2 Compute Unit has the same amount of Stream Processors as RDNA, we're looking at about 4,608 SPs. When that's combined with the higher power budget and the 50% performance-per-watt goal that AMD claims, it isn't hard to believe that AMD will actually hit that number.",
    "But do you know what other graphics card is around twice as fast as the RX 5700 XT? The Nvidia GeForce RTX 3080. Even according to the graphs AMD itself provides, the RX 6800 XT and the RTX 3080 are going to be trading blows, with neither card pulling definitively ahead across the board – this may be why Nvidia is rumored to be readying a GeForce RTX 3080 Ti.",
    "What's perhaps even more interesting, however, is that the Radeon RX 6800 cuts the GPU down to 60 Compute Units, power down by 50W and brings the game clock down by 200MHz. This graphics card looks to be a pretty sizable increase in performance over the RTX 2080 Ti – which is about the same level as the newly-launched RTX 3070. However, the benchmarks shown off here are with Smart Access Memory enabled.",
    "This is a feature that gives your CPU direct access to GPU memory, which takes a lot of latency out of the render pipeline. There's a catch, though – this feature will be exclusively available with AMD Ryzen 5000 processors on 500-series motherboards (including X570, B550 and A520). When AMD spoke on this feature it suggested that enabling this feature in addition to Rage Mode, which is essentially an AMD-supported overclock, can boost performance up to 13%. So, if you're using an older AMD processor or even an Intel chip, you could experience much less performance.",
    "With RX 6800 on the shelves, AMD can now allow its fans to enjoy the advantages of ray tracing. However, ray tracing is a wash at 4K. In that same way, the more affordable Radeon RX 6700 XT starts to seriously struggle when you enable ray tracing at 1440p, its target resolution. Still, if you’re after 1440p gaming, the Radeon RX 6700 XT gets the job done as it was able to beat an average 60 fps in all but two of the games in our test suite.",
    "The biggest surprise, however, came at the end of AMD's presentation, when CEO Lisa Su revealed the Radeon RX 6900 XT. With this GPU, power consumption remains shockingly the same as the Radeon RX 6800 XT, but because it gets bumped up to 80 Compute Units, along with the same 2,015MHz Game Clock, performance gets a pretty massive boost.",
    "Again, AMD showed off performance claims both with Rage Mode and Smart Access Memory enabled, which is a bit on the shady side, but it looks like it will be within the same ballpark as the Nvidia GeForce RTX 3090. And, again, this is while costing much less at $999 (about £770, AU$1,415) compared to the RTX 3090's $1,499 (£1,399, around AU$2,030) price tag.",
    "At the end of the day, however, it's important to take all of AMD's performance claims with a grain of salt. Team Red is trying to sell a product, so it's going to pick the absolute best-possible results to share. AMD Big Navi performance seems incredible, but we're going to have to wait until we get these graphics cards in our lab to see just how powerful they actually are.",
    "Until then, we can still sit and revel in the fact that AMD is finally taking Nvidia on at the high end. We can't stop thinking about the trajectory AMD took with Ryzen starting in 2017, and we certainly hope it takes a similar path with its RDNA graphics cards. The most interesting question is: will Nvidia take AMD's attacks lying down like Intel has? Or will it hit back with strong innovation and pricing? We're definitely hoping for the latter, but we'll settle for the graphics card market being exciting again.",
    "We've also included all the publicly available AMD Big Navi specs down below, for your reference:",
    "AMD Radeon RX 6700 XT specs:",
    "AMD Radeon RX 6800 specs:",
    "AMD Radeon RX 6800 XT specs:",
    "AMD Radeon RX 6900 XT specs:",
    "These Big Navi GPUs will feature \"Rage Mode\" for one-click overclocking, along with AMD Smart Access Memory, and when paired with an AMD Ryzen 5000 processor, these features are, AMD promises, able to give some serious boosts to game performance."
  ],
  "headers": {
    "3": "AMD Big Navi release date",
    "6": "AMD Big Navi price",
    "11": "AMD Big Navi specs and features"
  },
  "links": {
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "Radeon RX 6900 XT": "https://www.techradar.com/news/amd-radeon-rx-6900-xt",
    "AMD Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "Big Navi would be launching at Computex": "https://www.techradar.com/news/amds-big-navi-graphics-card-could-arrive-at-computex-2020",
    "Zen 3": "https://www.techradar.com/news/amd-zen-3",
    "RDNA 2": "https://www.techradar.com/news/amd-big-navi",
    "AMD Radeon VII.": "https://www.techradar.com/reviews/amd-radeon-vii",
    "Nvidia GeForce RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080",
    "Nvidia Turing": "https://www.techradar.com/news/nvidia-turing",
    "AMD Radeon RX 5700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5700-xt",
    "readying a GeForce RTX 3080 Ti": "https://www.techradar.com/news/nvidia-might-be-preparing-to-fight-amd-big-navi-with-the-rtx-3080-ti"
  }
}