{
  "source": "https://www.techradar.com/news/she-hulk-tv-show-has-cast-its-villain-and-its-a-smashing-choice",
  "title": "She-Hulk TV show has cast its villain – and it's a smashing choice",
  "category": "entertainment",
  "updated": "2021-07-21T12:07:29Z",
  "author": "tom-power",
  "summary": "Marvel's She-Hulk lands its Titania",
  "article": [
    "With Loki season 1's run having ended on Disney Plus, Marvel fans are beginning to turn their attentions to the studio's forthcoming TV shows.",
    "Marvel's What If...?, Hawkeye and Ms. Marvel are all set to land on the streamer sometime in 2021, while three other TV series are due to arrive next year.",
    "One of those 2022=scheduled shows is She-Hulk, which will star Titania Maslany as the titular character. Now, after last month's rumors, She-Hulk finally knows who her adversary will be – and it's a smashing choice in our view.",
    "In June, various outlets (TechRadar included) reported that Jameela Jamil (The Good Place, Duck Tales) had been hired to play Titania in Marvel's She-Hulk.",
    "Initially, Jamil and Marvel stayed silent on the subject, but now the actress has confirmed her involvement in the Disney Plus show.",
    "Taking to her official TikTok account (the video was also posted on her Twitter account), Jamil revealed that she would portray Titania in Marvel's She-Hulk.",
    "In footage set to Survivor's Eye of the Tiger, Jamil can be seen training for the role with some stunt coordinators. At the end of the video, Jamil confirms that she'll \"fight her way through the MCU, coming to you in 2022!\" alongside the hashtag #SheHulk.",
    "Check out the footage below:",
    "While Jamil expressed her joy at joining the MCU, fans will know that Marvel's Phase 4 slate (and potentially beyond) will explore the Marvel Cinematic Multiverse (MCM) as a result of Loki season 1's ending.",
    "The arrival of the MCM will make for intriguing viewing. We already know that upcoming Marvel movies, such as Spider-Man: No Way Home and Doctor Strange 2, will explore the multiverse in more detail, but it's likely that the multiverse will also affect Marvel's forthcoming TV slate.",
    "Marvel's She-Hulk could be one of those series that feels the effects of the multiverse's arrival. We're aware that Mark Ruffalo's Hulk and Tim Roth's Abomination will be part of She-Hulk's supporting cast and, given that we've seen them in the MCU already, it isn't surprising that they'll feature, particularly with the duo having comic book ties to She-Hulk.",
    "However, Titania's arrival may differ from her fellow gamma-infused superheroes and supervillains.",
    "While Titania – real name Mary MacPherran – exists in the same universe as She-Hulk in the comics, Marvel Studios could introduce her as a villain from another dimension in the multiverse, just like Spider-Man: No Way Home's Doc Ock and Electro will reportedly be.",
    "This is speculation on our part, but Titania's arrival from another universe would allow the multiverse to impact Marvel's TV show lineup just as much as its upcoming films.",
    "Marvel can't expect fans to watch the multiverse unfold in its movies but not its TV series – it can't separate the two from one another, especially when the events of its films and TV shows will be intrinsically linked.",
    "Our opinion? Titania is a villain from another universe who, after being transported to the MCU and learning of She-Hulk's superhuman abilities, sees herself as the individual to a potentially worthy foe in She-Hulk.",
    "It'll be a while before we find out if our prediction is correct. She-Hulk is currently filming and isn't slated to arrive until some time in 2022. What we do know is that the series will consist of 10 episodes of 30 minutes each, and that it'll be a legal drama series with plenty of comedy elements."
  ],
  "headers": {
    "8": "Analysis: how will Titania fit into the Marvel Cinematic Multiverse?"
  },
  "links": {
    "Loki season 1": "https://www.techradar.com/news/after-loki-marvel-has-started-setting-firm-rules-for-its-multiverse",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "TechRadar included": "https://www.techradar.com/news/she-hulk-on-disney-plus-has-cast-its-villain-and-its-not-abomination",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "will reportedly be": "https://www.techradar.com/news/spider-man-no-way-home-4-theories-on-what-the-movies-official-title-could-mean"
  }
}