{
  "source": "https://www.techradar.com/news/whoops-intel-core-i9-12900k-cpus-have-already-been-sold-somehow",
  "title": "Whoops! Intel Core i9-12900K CPUs have already been sold somehow",
  "category": "computing",
  "updated": "2021-10-22T16:04:29Z",
  "author": "darren-allan",
  "summary": "All chipped up and nowhere to go socket-wise",
  "article": [
    "Intel’s Core i9-12900K, the Alder Lake flagship which has still yet to be officially revealed (that might happen next week), has actually been purchased by one lucky punter.",
    "Well, we say lucky, but US-based Redditor Seby9123 would be upgrading their Core i9-10900K (with RTX 3090, incidentally) right now, but for the fact that they don’t have a corresponding Alder Lake (Z690) motherboard, which is required for the 12th-gen chips (as they use a different socket to Rocket Lake).",
    "Techspot highlighted this, and in actual fact, Seby9123 claims to have bought two of the flagship processors, with (convincingly real) photos provided to illustrate this. Apparently the asking price was $610 (around £440, AU$815) before tax for a single CPU from an unspecified retailer.",
    "The provided photos fall in line with a previously seen packaging leak (from VideoCardz), and they show a nifty looking box, with a very different touch being the inclusion of a mock-up of a thick gold wafer, which is actually a very fancy container for the CPU itself (the wafer opens up).",
    "If you were hoping for confirmation of the spec of the 12900K, sadly there are no details of clock speeds, or even the core and thread count, anywhere on the box (or accompanying manual for that matter). Mysterious. Perhaps there’s no need to dazzle people with beefy specs, when you can dazzle them with a big glittery gold circle instead.",
    "Incidentally, you may recall that with the most recent 11th-gen launch, Rocket Lake processors were accidentally sold early by German retailer Mindfactory, although in that case, not the flagship, but Core i7-11700K chips. So this isn’t the first time we’ve had these false starts from retailers.",
    "Let’s tackle the big question that everyone’s now asking: What is that mock golden wafer made out of? Come on, you want to know, don’t you? Well, it’s not real gold, or even gold-plated (shockingly), although the Redditor does say that it sort of feels like metal. It is, as you might expect, plastic, but convincingly solid, with a “small rotating mechanism to lock it closed”, and the 12900K chip nestling inside.",
    "Depending on your viewpoint, this either looks pretty cool – it’s certainly something different for a flagship product – or a waste of plastic and resources in general. But as we’ve said before, it will certainly help Intel’s top dog Alder Lake chip stand out from the CPU crowd.",
    "As for the pricing, interestingly, the purported sale price of $610 (around £440, AU$815) matches a previous leak from another US retailer bang-on, which is quite spooky. Is this what we could be looking at for the actual retail asking price?",
    "In the US, the Core i9-11900K comes with a suggested price of $549 (around £400, AU$735), so the rumored figure probably would roughly fit with the kind of modest hike Intel might be mulling for a premium CPU, if the processor is indeed as promising an advance as some of the leaked benchmarks suggest. Remember, the Ryzen 9 5950X – which leaks show the 12900K outclassing, even in multi-threaded (just) – sells for about $750 in the US (around £545, AU$1,000).",
    "That said, the recommended price and the actual price when retailers are struggling to get stock, and 12900K units are perhaps flying off the shelves, could end up being very different, as we’re seeing all too much these days with the inflated price tags on PC components. Sadly, scalpers may indeed already be viewing the 12900K as worth its weight in gold for marking up on eBay."
  ],
  "headers": {
    "6": "Analysis: Worth its weight in gold?"
  },
  "links": {
    "Intel’s Core i9-12900K": "https://www.techradar.com/news/intel-core-i9-12900k-leak-shows-an-overclocked-cpu-that-could-seriously-worry-amd",
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "that might happen next week": "https://www.techradar.com/news/new-intel-alder-lake-rumor-suggests-cpu-launch-is-imminent",
    "US-based Redditor Seby9123": "https://www.reddit.com/r/intel/comments/qcszo9/so_i_somehow_got_one_of_these/",
    "Techspot": "https://www.techspot.com/news/91884-intel-core-i9-12900k-spotted-unique-retail-packaging.html",
    "previously seen packaging leak (from VideoCardz)": "https://www.techradar.com/news/intel-alder-lake-leak-shows-retail-boxes-with-a-surprise-for-core-i9-12900k-buyers",
    "previous leak from another US retailer bang-on": "https://www.techradar.com/news/intel-core-i9-12900k-price-leak-suggests-alder-lake-launch-is-around-the-corner",
    "Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "promising an advance as some of the leaked benchmarks suggest": "https://www.techradar.com/news/intel-core-i9-12900k-benchmark-could-be-most-worrying-alder-lake-leak-for-amd-yet",
    "leaks show the 12900K outclassing": "https://www.techradar.com/news/intel-core-i9-12900k-benchmark-could-be-most-worrying-alder-lake-leak-for-amd-yet",
    "struggling to get stock": "https://www.techradar.com/news/global-chip-shortage-could-drag-on-until-2023"
  }
}