{
  "source": "https://www.techradar.com/news/intelligent-industry-good-for-the-planet",
  "title": "Intelligent industry: good for the plan(e)t",
  "category": "computing",
  "updated": "2021-10-19T10:48:57Z",
  "author": "mike-dwyer",
  "summary": "AI and robotics are the key to sustainable manufacturing",
  "article": [
    "There is a growing prevalence across the manufacturing industry to harness the benefits of AI and robotics to unlock efficiencies, reduce energy consumption and improve speed to market. This is driven in part by the need for businesses to be more efficient with the (limited) resources and budgets they have available, but also by the fact that customers are now demanding both shorter lead times and greater transparency in how their products are sourced and manufactured.",
    "Faced with ever shifting demands and unpredictable events (such as a global pandemic) impacting supply and production, advanced AI and robotics technologies are playing a growing role in helping manufacturing businesses to adapt to new ways of doing things.",
    "You would be mistaken, however, in thinking that the use of robots in manufacturing stops at small silver machines sorting on the factory floor. In fact, the role of RPA (robotic processing automation) extends much more broadly across the manufacturing process and has become integral to building greater resilience and sustainability across the whole ecosystem.",
    "At a time when the need to be more environmentally friendly is becoming a fundamental focus for businesses, smart technology can help streamline manufacturing from start to finish to lower overall emissions. But to do this, businesses must have a 360° view of their product journeys in their entirety – something that can only be achieved by capturing, processing and analyzing data effectively with the aid of advanced technologies.",
    "When harnessed quickly and effectively, this data goes a long way to ensure minimal usage of raw materials, help ramp production up and down as needed to reduce things like hot water usage and CO2 emissions, and optimize design processes to shorten production times.",
    "But given that the efficient use of material is inherent to the manufacturing process, what more should manufacturers be doing with their sustainability efforts to ensure they are considering the issue beyond just analyzing and acting on data insights. As more and more pressure builds around sustainability and the trend towards greater automation takes hold, how else can manufacturers employ intelligent industry to balance better business operations with protecting our planet?",
    "Manufacturers need to go through a fundamental shift to become leaner in their resource consumption and a good place to start is to use less paper. In much the same way the financial services industry shifted to paperless mortgages, paperless manufacturing should soon be a given. Moreover, the packaging and transportation of these products and goods must also be considered to ensure sustainability is ingrained into the supply chain in its entirety. Through AI, greener alternative solutions can be identified, enabling manufacturers to make data-driven decisions which are not only innovative, but sustainable.",
    "Another resource area that is likely to come under growing scrutiny from customers, is the management and sourcing of raw materials, particularly rare earth materials – with the expectation that businesses should be able to track and coordinate the journey of such materials from origin to plant, as well as ensure they are ethically sourced and transported.",
    "Now is also the time for manufacturers to innovate beyond the production line – looking at how technology can help reduce our reliance on raw materials in the first place by coming up with environmentally sensible alternatives. This could be anything from deepening their commitment to R&D, or relying more on prismatic AI designs, which use less raw material to begin with.",
    "The events of the past 18+ months ruptured supply chains across the globe, spurring a major rethink around resilience. For some sectors such as life sciences, the pressure to ramp up facilities to produce unprecedented amounts of vaccines would not have been possible without the support of advanced AI technologies.",
    "But now that demand has subsided, the same companies find themselves faced with the challenge of how to scale back without losing the agility to respond to future influxes i.e. if booster shots become widespread. And all this must be done with the least possible impact on the environment.",
    "To scale up on sustainability, manufacturers need to be careful that by protecting one aspect of the supply chain they are not impacting another. To do this, they will need to look a layer deeper in terms of what the data is telling them about their overall sustainability footprint. It’s no use building a production factory nearer your end customers, for example, if you are forced to transport your raw materials from afar – what matters is how you plan to lower emissions at each and every step of the journey.",
    "Moving forward, AI and robotics will be central to helping manufacturing companies match trends driving customer demand directly to the production line. But this will mean interrogating every aspect of the life cycle of a product to ultimately search for better, and cleaner, ways of doing things that can not only be implemented but also communicated to end audiences to show they are doing all they possibly can to play their part in protecting the environment."
  ],
  "headers": {
    "3": "360 product visibility",
    "6": "Material basics and beyond",
    "9": "Scaling for sustainability",
    "12": "Full spectrum sustainability"
  },
  "links": {
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "businesses": "https://www.techradar.com/best/best-small-business-software",
    "smart technology": "https://www.techradar.com/news/smart-home-devices",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "management": "https://www.techradar.com/best/best-project-management-software"
  }
}