{
  "source": "https://www.techradar.com/news/qualcomm-reveals-randd-efforts-to-accelerate-speed-of-5g",
  "title": "Qualcomm reveals R&D efforts to accelerate speed of 5G",
  "category": "computing",
  "updated": "2021-06-29T13:16:37Z",
  "author": "mayank-sharma",
  "summary": "Mobile communications companies from around the world rally behind mmWave",
  "article": [
    "Qualcomm has shared details about its latest research milestones and innovations, which the company hopes will help accelerate the development and adoption of 5G technology.",
    "The wireless technology giant showcased its over-the-air (OTA) R&D testbeds at MWC 2021 in Barcelona, with the goal of bringing more capacity, wider coverage, and lower latency to mobile operators and devices around the world.",
    "“Our new 5G R&D technology OTA testbeds and system simulations build on more than 30 years of deep wireless technology expertise, end-to-end system knowledge, global experience, and exemplify our leadership in advancing 5G for the next decade,” said John Smee, VP Engineering at Qualcomm.",
    "The new OTA prototypes include a series of 5G mmWave (multimeter wave spectrum) devices, including 5G mmWave repeaters, highlighting how Qualcomm is polishing its mmWave expertize to push for new use cases.",
    "Pioneered by Qualcomm, 5G mmWave is one of the two 5G spectrums that make up current 5G deployments. Unlike the other more widespread technology, called sub-6, which works best over long distances, mmWave offers far greater speed.",
    "In addition to R&D efforts, Qualcomm also took the opportunity to announce that several dozen mobile communication companies from around the world have committed to using 5G mmWave in some form.",
    "The list includes companies from China, Europe, India, Japan, Korea, North America, and South East Asia.",
    "“Support from companies across the ecosystem further demonstrates the global scale and maturity of 5G mmWave. We are proud of our industry leadership in the development, standardization and commercialization of 5G mmWave and honored to work with major mobile industry leaders to accelerate its deployment worldwide,” remarked Qualcomm’s incoming CEO, Cristiano Amon."
  ],
  "headers": {
    "4": "The mmWave tsunami"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "incoming CEO": "https://www.techradar.com/news/qualcomm-appoints-cristiano-amon-as-ceo"
  }
}