{
  "source": "https://www.techradar.com/news/new-god-of-war-ragnarok-trailer-could-be-shown-off-very-soon",
  "title": "New God of War: Ragnarok trailer could be shown off very soon",
  "category": "gaming",
  "updated": "2021-07-12T13:45:49Z",
  "author": "rhys-wood",
  "summary": "God of War’s PS5 sequel looms",
  "article": [
    "Hungry for more God of War Ragnarok news? You might be in luck, as a new God of War: Ragnarok trailer is rumored to debut in just a few short weeks, potentially as part of a future Sony State of Play presentation showcasing upcoming PS5 titles.",
    "Reported by The Gamer, gaming leaker QuimSix shared on Reddit that “there will be a new God of War: Ragnarok trailer in August,” and while any and all rumors should be taken with a pinch of salt, QuimSix has a solid track record. The leaker correctly predicted the date of Sony’s last State of Play showcase, and has also accurately shared details on the upcoming Far Cry 6.",
    "QuimSix also suggested that a God of War Ragnarok trailer won’t be the only thing to look forward to, predicting that Horizon Forbidden West could also get a new trailer as well as a release date. Additionally, they state they “wouldn’t be surprised” to see a new trailer for GTA 5 on PS5 and Xbox Series X/S consoles.",
    "Having skipped E3 entirely, Sony has been keeping its cards quite close to its chest on news for many of its upcoming first-party titles, God of War: Ragnarok included. QuimSix’s prediction has some merit at least, in that Sony will likely host a more robust State of Play presentation in the near future to supplement its noticeable E3 absence - though this hasn’t been confirmed.",
    "The wait for God of War: Ragnarok has been trying for many fans, to say the least. Originally slated for release this year, the game was delayed into 2022, with the only scrap of detail on the game so far being the title and the initial announcement teaser.",
    "Whether we get to see a new God of War: Ragnarok trailer in a few weeks or not, hype for the PS5 sequel is undoubtedly high. 2018’s God of War successfully rebooted the series, exploring a kinder side to Kratos seldom seen in the original trilogy. As such, we’re eager to see how he and his son Atreus continue to grow in the upcoming sequel."
  ],
  "headers": {
    "3": "By Thor's hammer"
  },
  "links": {
    "God of War Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "The Gamer": "https://www.thegamer.com/new-god-of-war-trailer-rumored-to-release-next-month/",
    "Reddit": "https://www.reddit.com/user/QuimSix/comments/oewnz4/gow_ragnarok_and_horizon_forbidden_west_trailers/",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "GTA 5": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "delayed into 2022": "https://www.techradar.com/news/god-of-war-ragnarok-delayed-to-2022-and-it-could-be-coming-to-ps4"
  }
}