{
  "source": "https://www.techradar.com/news/windows-11-could-finally-solve-one-of-the-most-common-video-call-problems",
  "title": "Windows 11 could finally solve one of the most common video call problems",
  "category": "pro",
  "updated": "2021-11-30T16:36:25Z",
  "author": "sead-fadilpasic",
  "summary": "Muting the microphone is finally set to get easier in Windows 11",
  "article": [
    "Microsoft is looking to solve a major annoyance for video conferencing users with a new preview update for Windows 11.",
    "The Windows 11 Insider Preview Build 22494, which was released to the Dev Channel in early November, is getting a new way to mute and unmute the microphone, straight from the taskbar.",
    "The feature will initally be limited to Microsoft Teams, the company's online collaboration app, but the company is expecting developers to pick it up and add the functionality to other applications, as well.",
    "“We are beginning to roll this experience out to a subset of Windows Insiders with Microsoft Teams for work or school installed and ramp it up over time,” Microsoft said in its announcement. “This means not everyone will see this right away with their Teams calls.”",
    "As soon as a user enters a Teams call, Windows 11 will add a microphone icon to the bottom right part of the screen, next to the volume, battery and Wi-Fi icons. By simply tapping/clicking the icon, the user can quickly toggle between mute and unmute states. The capability only applies to the current call, the company added.",
    "Right now, the feature is limited to Microsoft Teams, but the company’s plan is to bring it to Chat from Microsoft Teams (Microsoft Teams for home) as well. It also said other communications applications can add this capability, meaning it’s up to individual companies or users to see if adding it makes sense.",
    "“You can see your call audio status, what app is accessing your microphone, and quickly mute and unmute your call at any time,” Microsoft further explained.",
    "There is also a keyboard shortcut to mute/unmute the microphone: Win + Alt + K. This, too, works only in Microsoft Teams, for the time being."
  ],
  "headers": {
    "3": "Microsoft Teams muting"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}