{
  "source": "https://www.techradar.com/news/windows-11-will-bring-native-android-apps-to-the-microsoft-os",
  "title": "Windows 11 is getting Android apps - but not from Google",
  "category": "computing",
  "updated": "2021-06-25T11:59:26Z",
  "author": "jess-weatherbed",
  "summary": "Instead, you can thank...Amazon?",
  "article": [
    "When Microsoft officially revealed Windows 11 during its keynote on June 24, a surprise announcement was included – Android apps are finally coming to Windows, though through an unlikely source. The apps will be supported via the Amazon App Store rather than Google and discoverable through the revamped Microsoft Store, allowing your favorite apps to be locally installed so you can integrate them into the start menu or taskbar. This could mean that you're not actually getting access to all of your favorites given the Amazon store only offers approximately 460,000 Android apps, rather than the more impressive 3.04 million that Google could supply. There wasn't much information given about this surprise addition to Windows 11, but further information will likely appear in the coming days. What we've seen so far is that apps can be tiled as part of the new application placement UI, with a demonstration showing TikTok running in its own dedicated window on the desktop.",
    "Given this was such a quick announcement, we're unsure of how many android apps will actually be made available when Windows 11 goes live to the public, but it's exciting given the often subpar desktop equivalents to many popular mobile applications like Instagram or Snapchat. Having seen the web version of TikTok, it's probably clear why they chose to use that specific application in the teaser video. This isn't the first time we've had Microsoft attempt to bring Android apps to the Windows Os though. Some of you may remember 'Project Astoria', or Windows Bridge For Android as it was officially known, that was axed back in 2016, planned originally as a tool for turning Android apps into universal Windows apps that could run on all Windows-powered devices. It only lasted a year before vanishing into the void sadly, but this latest announcement clearly shows the demand for running Android applications on PCs didn't die with it.",
    "As with most Windows releases and updates, Windows 11 will first be rolled out to members of the Insider Program. There is also that leaked version that circulated the web last week, though we can't recommend downloading this to try for yourself, especially as it's looking likely that Windows 11 will actually be a free upgrade."
  ],
  "headers": {},
  "links": {
    "Insider Program": "https://insider.windows.com/en-us/"
  }
}