{
  "source": "https://www.techradar.com/news/tiktok-launches-range-of-new-e-commerce-tools",
  "title": "TikTok wants to supercharge the e-commerce market",
  "category": "computing",
  "updated": "2021-02-08T13:01:24Z",
  "author": "barclay-ballard",
  "summary": "New features look to help ramp up competition with Facebook",
  "article": [
    "It looks like TikTok is about to formally enter the e-commerce space, mirroring a number of other social media platforms that have looked to ramp up their monetization efforts.",
    "According to those familiar with the matter, the ByteDance-owned app has informed advertisers that it will launch a feature that allows popular users to share products and earn commission at some point later this year.",
    "Although no official word on the new advertising model has been released, reports indicate that video makers would be allowed to advertise any products they liked, regardless of whether they had a formal sponsorship deal in place or not. It’s also been suggested that TikTok will allow brands to showcase their goods on the platform.",
    "Interestingly, there are also reports that TikTok is working on launching live-streamed shopping where users can buy products after seeing them advertised by some of the platform’s biggest names. The feature would mimic television shopping channels but probably with much greater appeal for younger customers.",
    "TikTok is far from the only digital platform with plenty of users but little way of monetizing them. Late last year, WhatsApp launched Carts in an effort to turn the messaging app into more of an e-commerce hub, while Instagram and Facebook have both made it easier for users to carry out online shopping without having to leave their platforms.",
    "TikTok’s major advantage, however, is the buzz around the app, particularly among younger age groups. The app has around 1 billion monthly active users, with those aged between 18 and 24 representing the largest age group.",
    "TikTok did launch a live stream shopping event in partnership with Walmart late last year – an early sign of its e-commerce ambitions. However, the app may need the political situation between China and the US to improve if it is to go ahead with its other plans – something that will depend largely on the policies put forward by the new Biden administration.",
    "Via The Financial Times"
  ],
  "headers": {
    "4": "Big plans"
  },
  "links": {
    "TikTok": "https://www.techradar.com/news/tiktok-influencers-exposing-millions-to-misleading-stock-tips-and-financial-advice",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Carts": "https://www.techradar.com/news/facebook-now-lets-you-do-all-your-shopping-via-whatsapp",
    "The Financial Times": "https://www.ft.com/content/629c1c17-3daa-46af-8177-1814baaa2bed"
  }
}