{
  "source": "https://www.techradar.com/news/godzilla-vs-kong-first-reactions-heres-what-the-critics-thought",
  "title": "Godzilla vs Kong first reactions: here's what the critics thought",
  "category": "entertainment",
  "updated": "2021-03-23T14:19:59Z",
  "author": "tom-power",
  "summary": "Is it a monster smash?",
  "article": [
    "Warner Bros. won't be resting on its laurels any time soon. Zack Snyder's Justice League may have only launched on HBO Max on March 18, but the studio's streaming service is already ramping up for its next release – Godzilla vs Kong – on March 31.",
    "Fans of the MonsterVerse are eagerly anticipating the colossal battle between the two titans, and that hype has likely increased in the wake of the movie's social embargo being lifted. Judging by the reactions of those lucky enough to view the film ahead of release, Godzilla vs Kong will be one to check out.",
    "Phase Zero podcast host Brandon Davis described it as \"Fast & Furious but with giant monsters\" which, from an action standpoint, sounds like the kind of film we can get behind:",
    "Fandango managing editor Erik Davis backed up his namesake's opinion, calling Godzilla vs Kong a \"true Midnight Monster movie\" and the best of the four latest monster flicks:",
    "Beyond the Trailer's Grace Randolph humorously stated that Adam Wingard's film made it look like Godzilla and Kong \"were in a bar fight\" and praised its brilliant CGI work:",
    "While he lauded the movie's IMAX feel and style, Collider's Steve Weintraub stated that scenes with humans in weren't anything special and \"exactly what you'd expect\":",
    "Not everyone was full of praise for the film though. Forbes' Scott Mendelson said the movie's effects were \"terrific\", but ultimately that Godzilla vs Kong was \"pared down for the masses\" and that there was \"little reason for its existence beyond preemptive promises\":",
    "Godzilla vs Kong will launch simultaneously on HBO Max and in theaters in the US on March 31.",
    "The movie is also expected to be released via Video on Demand platforms on April 1 in the UK, but there's no word on which services it'll be available on yet."
  ],
  "headers": {},
  "links": {
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-4746806446236882000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fgodzilla-vs-kong-first-reactions-heres-what-the-critics-thought"
  }
}