{
  "source": "https://www.techradar.com/news/netflix-lands-deal-with-steven-spielberg-for-new-movies",
  "title": "Netflix lands deal with Steven Spielberg for new movies",
  "category": "entertainment",
  "updated": "2021-06-21T20:30:52Z",
  "author": "axel-metz",
  "summary": "Netflix bags the best in the business",
  "article": [
    "Netflix has partnered with Steven Spielberg’s movie studio, Amblin Partners, to produce several new feature films for the streaming service every year.",
    "As per the terms of the deal, Amblin is expected to produce at least two films a year for Netflix, though the length of the partnership is unspecified. It’s also a possibility that Spielberg himself may direct some of the projects.",
    "These new movies are not yet associated with any budgetary or genre requirements, so it’s likely the streamer will benefit from more high-profile, big-budget productions like Michael Bay's 6 Underground or Martin Scorcese’s The Irishman in the near future.",
    "According to reports, Spielberg had previously been sceptical about streamer-first projects, even going as far as to claim that they shouldn’t be eligible for awards – though the legendary director later defused tensions between himself and Netflix.",
    "“At Amblin, storytelling will forever be at the center of everything we do, and from the minute [Netflix CEO] Ted and I started discussing a partnership, it was abundantly clear that we had an amazing opportunity to tell new stories together and reach audiences in new ways,” Spielberg said in a statement.",
    "The studio will, however, continue to produce films for long-time partner Universal, and neither of the director’s upcoming projects – a remake of West Side Story and the Seth Rogen-starring The Fabelmans – will hit the streamer.",
    "“This new avenue for our films, alongside the stories we continue to tell with our longtime family at Universal and our other partners, will be incredibly fulfilling for me personally,” the Indiana Jones director added.",
    "The new partnership announcement arrives as Netflix’s biggest rivals continue to establish their footprint in the streaming game.",
    "Disney Plus, for instance, has grown exponentially in the year-and-a-half since its initial launch, with Disney CEO Bob Chapek recently praising the quality of the streamer’s original content, as well as its capacity to generate profit for the entertainment giant.",
    "The likes of HBO Max and Amazon Prime Video have also enjoyed several high-profile content wins of late, while even Apple TV Plus looks to be gaining a foothold in the industry thanks to upcoming projects like Invasion and The Shrink Next Door.",
    "The point being, Netflix is no longer the only option to consumers seeking high-quality original content from the comfort of their homes. This new partnership with Steven Spielberg’s movie studio, then, evidently represents an attempt to claw back some of that lost market share.",
    "And if the deal means the streamer is set to benefit from more award-chasing features like Marriage Story, Mank and Ma Rainey's Black Bottom, it can only be a win for Netflix-subscribing audiences.",
    "Via Variety"
  ],
  "headers": {
    "7": "Check your six"
  },
  "links": {
    "reports": "https://www.ign.com/articles/2018/03/23/steven-spielberg-doesnt-think-netflix-movies-should-get-oscars",
    "later defused": "https://www.nytimes.com/2019/04/23/business/media/steven-spielberg-netflix-academy-awards.html",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "recently praising": "https://www.techradar.com/news/disney-plus-boss-weighs-in-on-the-chances-of-a-cheaper-ad-supported-tier",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "The Shrink Next Door": "https://www.techradar.com/news/apple-tv-plus-big-will-ferrell-and-paul-rudd-comedy-gets-a-first-trailer",
    "Variety": "https://variety.com/2021/film/news/steven-spielberg-netflix-amblin-deal-1235001513/"
  }
}