{
  "source": "https://www.techradar.com/news/microsoft-isnt-removing-the-control-panel-but-it-is-making-it-obsolete",
  "title": "Microsoft isn't removing the control panel... but it is making it obsolete",
  "category": "computing",
  "updated": "2021-01-11T10:37:04Z",
  "author": "jess-weatherbed",
  "summary": "Control Panel is being slowly replaced",
  "article": [
    "Microsoft has been slowly redirecting pages from the Control Panel to the Settings app since October 2020, and additional changes have now been spotted in the latest preview build, released in January 2021, with the Storage Spaces tool now also located in the Settings app. The Control Panel has had a very dedicated fanbase over the years due to the lack of key features present in the Settings app, despite Microsoft's best efforts to push its users towards the more modern application, with the Control Panel being a part of Windows builds since 1985.",
    "Storage Spaces is a feature that allows you to connect your storage devices into one collective 'storage pool', especially useful for anyone with several hard drives or SSD's in their computers who is looking for ways to optimize their available hardware. It's important to note that the Control Panel isn't being removed from systems, and there has been no confirmation that this is something planned for the future. That being said, Microsoft is making it extremely difficult to gain access to the old Control Panel pages for features that have been redirected and is currently blocking properties shortcuts and third-party applications that could have been used as a workaround to access the retired System page.",
    "We wouldn't be surprised if these redirects continue to the point of rendering the Control Panel obsolete in favor of the more user-friendly Settings app. If you wanted to check the latest updates planned for the Microsoft OS (operating system) yourself, then you can join the Windows Insider Program to give feedback on features and preview changes to Windows 10. The current move from Control Panel to the Settings app for Storage Spaces can be seen currently live in the latest preview build, but it's likely to be rolled out to the general public later this year.",
    "Via Windows Latest"
  ],
  "headers": {
    "1": "Storage wars"
  },
  "links": {
    "since October 2020": "https://www.techradar.com/news/microsoft-begins-killing-off-the-control-panel-in-windows-10",
    "Windows Insider Program": "https://insider.windows.com/en-us/",
    "Windows Latest": "https://www.windowslatest.com/2021/01/10/microsoft-is-redesigning-another-control-panel-feature-in-windows-10/"
  }
}