{
  "source": "https://www.techradar.com/news/waiting-for-breath-of-the-wild-2-then-you-should-pick-up-skyward-sword-hd",
  "title": "Waiting for Breath of the Wild 2? Then you should pick up Skyward Sword HD",
  "category": "gaming",
  "updated": "2021-07-17T12:00:29Z",
  "author": "matthew-forde",
  "summary": "Once a hero, always a hero",
  "article": [
    "The Legend of Zelda: Breath of the Wild and The Legend of Zelda: Skyward Sword. One is considered a masterpiece, a revolution, and arguably one of the greatest games of recent times. The latter has garnered much more of a mixed reception, with some aspects fondly remembered, yet not the complete package that the Zelda series is known for consistently delivering.",
    "That said, these two titles look to be more intrinsically entwined than many originally thought. The latest trailer for Breath of the Wild 2, shown off during the E3 2021 Nintendo Direct, all but confirms that the game is set to build upon the legacy that was established in Skyward Sword.",
    "From the mechanics and characters to the locations and narrative, both Skyward Sword and Breath of the Wild 2 share a surprising amount of commonality. Many Zelda fans are catching on to Skyward Sword’s importance to the overall series lore, being placed at the very beginning of the timeline.",
    "It becomes clear, then, why Nintendo would decide to remaster Skyward Sword instead of just porting the Wii U’s Twilight Princess HD and Wind Waker HD to the Switch. And it’s not just because 2021 is Skyward Sword’s 10th anniversary.",
    "Thematic elements and mechanics introduced in Skyward Sword were eventually expanded upon six years later in Breath of the Wild, and this also looks to be the case in the long-awaited Breath of the Wild sequel. Here’s how it all fits together and why Skyward Sword HD is worth your time.",
    "Warning: Spoilers for Skyward Sword and Breath of the Wild ahead",
    "Let's start with the floating city of Skyloft (or, as it's also known, the Isle of the Goddess), which first appeared in Skyward Sword (or if you want to get technical, the opening cutscene of A Link to the Past). These floating islands way above the clouds are home to the earliest incarnations of Link and Princess Zelda. It's here we get to see how the two live out their daily lives and how their friendships blossom, giving one of the most well-rounded depictions of the characters to date.",
    "Knowing all about Skyloft and its surrounding areas will only help players to better understand (and potentially enhance) what's actually happening in Breath of the Wild 2, with floating islands and cities in the sky making a return in the latest trailer. There's also Link's lovable rival Groose, a character you absolutely need to know. We love Groose, so much so that we hope he has an equivalent character in the Switch sequel. If Beedle did, then why can’t Groose?",
    "Skyward Sword walked so Breath of the Wild could run. That's something you can definitely apply to the game’s mechanics. Whether that be the stamina meter, scaling walls, sprinting, weapon degradation, or the sailcloth that essentially became the paraglider. It all started with the critically divisive Skyward Sword.",
    "Going back to see the evolution of these mechanics and how they are all utilized is a really cool experience. Not to mention, Breath of the Wild 2 looks to be pulling even more from Skyward Sword by bringing back skydiving. We may even see a Loftwing at this point.",
    "With the HD remaster of Skyward Sword out now, Nintendo is set to tone down sidekick Fi's presence to being more optional. A good move that will hopefully prevent the character interrupting gameplay every five minutes to make us aware that our batteries are running low.",
    "While Fi may be ranked on the lower end of the companions list across the Zelda series, the humanoid spirit is essential to the lore, plays a vital role in the creation of the Master Sword, and does have several heartwarming moments. Let's be honest: It's hard not to be moved by Fi losing her consciousness and leaving Link to reside within the Master Sword forever following upwards of 35 hours of gameplay.",
    "That's why when Zelda references a voice in the Master Sword in Breath of the Wild, it hits a lot harder knowing the adventures you've had together. Additionally, there's a nice cameo in the form of a sound effect once Link completes the Trial of the Sword. How much of a part Fi will play in the sequel is still unknown but another cameo or two seems more likely than not at this point.",
    "Since the first Breath of the Wild 2 trailer debuted at E3 2019, there has been rife speculation about the return of Demise, to the point where you might be wondering who he is. Demise the Demon King is the main antagonist in Skyward Sword and the embodiment of all evil that has ever threatened Hyrule. This was the first introduction of the eternal entity, but seemingly not the last.",
    "At the end of Skyward Sword, Demise vows that his hatred (or Malice as it's known in BOTW) will be reincarnated time and time again, only to follow the hero and princess relentlessly.",
    "\"Those who share the blood of the goddess and the spirit of the hero… They are eternally bound to this curse. An incarnation of my hatred shall ever follow your kind, dooming them to wander a blood-soaked sea of darkness for all of time,\" the full quote reads.",
    "We get a brief glimpse of a figure's shadow in the original BOTW 2 trailer, whose outline resembles Demise a lot more than any of the incarnations of Ganon or Ganondorf throughout the years. While this in no way confirms that Demise is in the game, you do have to wonder once again whether Nintendo has remastered Skyward Sword to introduce the character to as many people as possible before the sequel hits.",
    "Once you seek out Impa in Breath of the Wild, she will regale you with the events that took place 10,000 years ago. This tells of an evil that was turned back time and again by a warrior wielding the soul of a hero, and a princess who carries the blood of the Goddess.",
    "Now what is most interesting here is that the tapestry used to relay the information depicts the hero with the Master Sword and a green tunic, but not Link's typical blonde hair. That famed blonde hair that first appeared (chronologically) in Skyward Sword has been an iconic mainstay of the entire timeline. But this particular hero has red hair - leading many to believe that the original hero from 10,000 years ago was actually Ganondorf.",
    "Think about it. Ganondorf has been known as the incarnation of Demise's hatred since Skyward Sword, yet what if in Breath of the Wild's timeline he was simply just the Gerudo King that went to war alongside the princess to stop the beast, only to be consumed by the hatred (Malice). This would link (no pun intended) Demise to Ganondorf directly, filling in a major blank spot in the Zelda timeline and providing an almighty twist on the narrative that we've come to expect for 35 years. As such, Breath of the Wild 2 could drop some truly mind blowing lore bombs - and it’s all thanks to Skyward Sword."
  ],
  "headers": {
    "6": "Skyloft",
    "8": "Returning mechanics",
    "10": "Fi and the Master Sword",
    "13": "Demise",
    "17": "The hero 10,000 years ago"
  },
  "links": {
    "The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "he Legend of Zelda: Skyward Sword": "https://www.techradar.com/news/the-legend-of-zelda-skyward-sword-hd-for-nintendo-switch-everything-you-need-to-know",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "E3 2021": "https://www.techradar.com/news/e3-2021"
  }
}