{
  "source": "https://www.techradar.com/news/what-is-cpanel",
  "title": "What is cPanel?",
  "category": "computing",
  "updated": "2021-04-13T14:14:26.587Z",
  "author": "desire-athow",
  "summary": "Simplifying website management since 1996",
  "article": [
    "In the past couple of decades, building and operating your own website has become an increasingly accessible process. A big part of that is due to the role of web hosting providers simplifying the most daunting and time-consuming management tasks. Enter control panels.",
    "A control panel is a web-based interface we employ when managing our hosting account and its associated services - domain names, emails, files, databases, etc. There is a wide range of solutions in that aspect, and cPanel is by far the most popular among Linux web hosts.",
    "cPanel was first released in 1996 from a group of developers under the cPanel LLC brand. The platform included a set of automation tools neatly stacked in an intuitive graphical interface (GUI).",
    "The user-friendliness and low learning curve helped cPanel quickly gain traction. Latest statistics from W3Techs reveal the control panel now holds over 12.7% of the global market.",
    "The growing popularity caught the attention of Oakley Capital, which acquired the company in 2018.",
    "Oakley had also purchased the rights to Plesk, cPanel’s largest control panel competitor, the year before, and consolidated both businesses into a market leading SaaS hosting platform called WebPros. A majority stake in WebPros was subsequently sold to CVC in late 2019.",
    "cPanel is a great account management tool in itself, but it can also integrate with various other tools through its API to extend functionalities even further. Many of the best VPS hosting providers combine cPanel with WHM (WebHost Manager) - a solution that allows them to easily operate an entire server.",
    "cPanel’s worldwide acclaim is by no means unmerited. The platform is very versatile and offers lucrative benefits for a wide range of webmasters. These include:",
    "cPanel’s UI helps users get to the most essential parts of their hosting service. Once you log into the dashboard, on the right-hand side, you will see basic server information plus some useful resource usage analytics.",
    "Even the default cPanel installation comes with loads of features, neatly stacked under general categories. Some of the most notable options here are:",
    "Additionally, cPanel supports tons of third-party integrations, like a WP Toolkit, CDN, backups, and more.",
    "For years, cPanel developers managed to keep a fine balance between features and price. The platform was affordable enough, so even a startup hosting company could easily take advantage.",
    "Shortly after the Oakley Capital acquisition, however, licensing fees for cPanel increased. The company changed its entire business model, switching to a per-account pricing model. The whole web hosting industry took a hit, with bigger hosts suffering the most damage.",
    "As if that wasn’t enough, while many were still adjusting to the new policies, under CVC’s ownership cPanel has increased the prices again. Naturally, many companies have started to look for alternatives…",
    "Тhe web hosting control panel market gives users enough options if they decide to stray away from the typical cPanel route. While similar in functionalities, each of those platforms has some nice competitive advantages:",
    "Whether you are fully content with your current cPanel hosting infrastructure or consider making a move to another platform - you do not lack the options. As technology is still rapidly evolving, we expect more and more control panel solutions to try and change the status quo.",
    "Would they succeed? Only time will tell."
  ],
  "headers": {
    "2": "What is cPanel?",
    "7": "cPanel benefits",
    "8": "cPanel main features",
    "11": "cPanel pricing",
    "14": "cPanel alternatives",
    "15": "Control panel solutions"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Linux web hosts": "https://www.techradar.com/web-hosting/best-linux-web-hosting",
    "best VPS hosting providers": "https://www.techradar.com/news/best-vps-hosting",
    "WP Toolkit": "https://www.techradar.com/news/managing-your-wordpress-sites-just-got-a-lot-less-stressful",
    "licensing fees for cPanel": "https://www.techradar.com/news/web-hosting-prices-could-be-set-for-a-major-rise"
  }
}