{
  "source": "https://www.techradar.com/news/god-of-war-ps5-update-makes-one-of-the-best-ps4-games-even-better",
  "title": "God of War PS5 update makes one of the best PS4 games even better",
  "category": "gaming",
  "updated": "2021-02-03T16:12:18Z",
  "author": "adam-vjestica",
  "summary": "Oh, boy!",
  "article": [
    "PS4 classic God of War (2018) now looks better than ever thanks to a surprise new PS5 update – and it's available now.",
    "God of War previously took advantage of Sony's new hardware to deliver a locked 60 frames per second experience when using performance mode, something which wasn't possible on PS4 Pro as it would fluctuate around the 40-50fps mark. The only caveat of using performance mode was that the game's resolution dropped to 1080p, taking some of the shine off the game's gorgeous graphics.",
    "However, that's no longer the case. In an announcement which probably no one saw coming, developer Sony Santa Monica revealed via Twitter that God of War will now be able to run at 60fps and a checkerboard 4K resolution (2160p).",
    "Previously, the only way to play God of War at 60fps and at a higher resolution than 1080p was to run an unpatched disc copy of the game. But thankfully, that work around isn't necessary.",
    "Despite concerns over Sony's commitment to backwards compatibility, God of War joins a growing list of PS4 games that have been updated to run or look better than ever on PS5. Days Gone and Ghost of Tsushima were both updated to enable 60fps gameplay, while even games that haven't received specific patches but targeted 60fps have benefited from the PS5's more powerful hardware.",
    "God of War is available as part of the PS5's PS Plus Collection, which includes 20 top PS4 games for subscribers to download. If you haven't experienced what is arguably one of the best games of the PS4 generation, then there's never been a better time to do so.",
    "It should also make the wait for God of War: Ragnarok a little easier to bear, which is scheduled for a 2021 release. Details remain incredibly thin on the ground, though, but we're hoping to hear more about Kratos' next adventure very soon."
  ],
  "headers": {
    "4": "Perfecting the past"
  },
  "links": {
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "Days Gone": "https://www.techradar.com/news/the-ps5-will-give-ps4-exclusive-days-gone-a-serious-backwards-compatibility-boost",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel"
  }
}