{
  "source": "https://www.techradar.com/news/watch-out-nintendo-steam-deck-wont-be-valves-only-handheld-games-machine",
  "title": "Watch out Nintendo – Steam Deck won’t be Valve’s only handheld games machine",
  "category": "gaming",
  "updated": "2021-08-09T13:32:00Z",
  "author": "matt-hanson",
  "summary": "Valve is serious about its handheld ambitions",
  "article": [
    "Even though the Steam Deck hasn’t even launched yet, Valve appears to have big ambitions for future handheld gaming devices, and Nintendo, the company that’s dominated that market in the past, should be worried.",
    "While Valve CEO Gabe Newell has already said that the Steam Deck is designed to establish “a product category that ourselves and other PC manufacturers are going to be able to participate in,” and which is “going to have long-term benefits for us,” Greg Coomer, a designer involved with the Steam Deck, has shed more light on Valve’s handheld plans.",
    "As PC Gamer reports, Coomer reveals that Valve will “continue making devices in this product line.” So, it’s likely we’ll see hardware refreshes and other variations. Whether this is a Steam Deck 2, Steam Deck Pro or something else entirely isn’t obvious at the moment.",
    "What is clear, however, is that Nintendo should be worried.",
    "Ever since the iconic Game Boy, Nintendo has been the market leader in handheld consoles, easily seeing off the threats from its competitors like Sega and Sony. While it’s unlikely that Sony will release a new PlayStation Portable console, and Microsoft doesn’t seem interested in a handheld Xbox (and why should it, if the Steam Deck can be made to run Windows 11 and play Xbox games?), Nintendo’s Switch console is immensely popular.",
    "This proves there’s a desire for handheld consoles, but up until now, Nintendo has largely been unchallenged. This could all change with the Steam Deck.",
    "For a start, its hardware is a lot more ambitious than the Switch, which should mean it’s more capable of playing modern games with impressive visuals. There were rumors that Nintendo was working on a more powerful ‘Switch Pro’ console, but that ended up just being the Switch OLED refresh, which comes with a better, larger, screen, but no hardware upgrades. And anyone disappointed by this could now be eying up the Steam Deck.",
    "There’s also the fact that the Steam Deck appears to be much more open. While it runs Linux-based SteamOS software, it can run Windows games thanks to Valve’s Proton compatibility software. If you already have a packed Steam library, then you’ll have a huge amount of games ready to play when you get the Steam Deck.",
    "And, if you really can run Windows 11 on the Steam Deck (Valve isn’t prohibiting you from installing your own operating system), then you’ll be able to run games from other launchers, such as Ubisoft Connect and Epic Games Store – again giving you access to a library of games that other handheld consoles can only dream of.",
    "Coomer also suggested that we could see more Steam Deck-like consoles – but not from Valve.",
    "Of course, as we saw with the Sega Game Gear and PlayStation Portable, no matter how good the offering is, it’s no easy feat to beat Nintendo in the handheld market. There’s no guarantee that the Steam Deck will be a hit to rival the Switch.",
    "For a start, Valve has been here before, when it tried to launch Steam Machines a few years ago. These were compact gaming PCs that were aimed at taking on consoles – and they didn’t take off.",
    "The Steam Deck’s openness and customisability may also be a plus to PC gamers who are used to that, but for console gamers who want something more user friendly, they may not be interested.",
    "And while the Steam Deck will be able to play a wide range of games, including Xbox and some PlayStation games, there’s one company that will keep its games off the Steam Deck (officially, at least): Nintendo. So if you want to play Breath of the Wild 2 or the next Mario game, you’re going to need to stick with Nintendo."
  ],
  "headers": {
    "4": "Analysis: Valve does what Nintendon’t"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "PC Gamer reports": "https://www.pcgamer.com/valve-intends-to-make-more-steam-decks/",
    "Steam Deck can be made to run Windows 11": "https://www.techradar.com/news/steam-deck-windows-11-support-could-be-great-news-for-gamers",
    "Xbox games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Nintendo’s Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}