{
  "source": "https://www.techradar.com/news/the-video-game-industry-just-won-its-first-oscar",
  "title": "The video game industry just won its first Oscar",
  "category": "gaming",
  "updated": "2021-04-26T09:14:48Z",
  "author": "gerald-lynch",
  "summary": "A significant achievement for gaming's cinematic ambitions",
  "article": [
    "The 2021 Oscar awards ceremony has brought home an unexpected win for the video game industry.",
    "This years Oscar for Short Documentary went to Anthony Giacchino's Colette, which documents the journey of one of the last surviving members of World War II's French Resistance to the concentration camp where her brother was killed.",
    "The documentary's journey to Oscar success would not have been possible without the support and distribution of a number of key game studios, including Oculus VR, EA and Respawn Entertainment.",
    "Colette features in the Medal of Honor: Above and Beyond virtual reality game, and in partnership with Respawn Entertainment, Electronic Arts, and Oculus Studios, Colette was distributed by The Guardian documentaries, where it’s streaming worldwide now.",
    "“At its core, the Medal of Honor franchise is about authenticity—using both the interactive and cinematic nature of video games to make history come alive in some small way,” says Peter Hirschmann, who wrote and directed the original Medal of Honor and returned to write and direct Above and Beyond.",
    "“These were real people, thrust into extraordinary circumstances. It’s an honor and a privilege to help preserve their stories and our shared historical legacy for future generations.”",
    "\"Ever since I was a kid, I’ve known that video games were special,\" added Mike Doran, Oculus Studios Director of Production upon the announcement of the win.",
    "\"From constantly evolving game mechanics, art styles that challenge technical constraints, immersive sound design, and emotionally engaging narratives that capture your imagination and completely immerse you in the experience, games offer up some of the best writing, acting, music, and animation around. They’re works of art. And at arguably no point was that more abundantly clear than tonight when the video game industry took home its very first Oscar.\"",
    "Games are continually chasing cinematic standards, and it's great to see the industry supporting independent film makers telling important stories, and being rightly praised for doing so. Oculus's involvement is particularly interesting – pioneering virtual reality film making, and already racking up awards in the space with the Emmy award winning Henry, perhaps one day we'll see a full virtual reality movie nominated for an award, too."
  ],
  "headers": {},
  "links": {}
}