{
  "source": "https://www.techradar.com/news/this-us-startup-is-working-on-a-universal-cpu-that-could-threaten-intel-amd-and-nvidia",
  "title": "This US startup is about to release a universal CPU that could threaten Intel, AMD, and Nvidia",
  "category": "computing",
  "updated": "2021-03-24T15:29:42Z",
  "author": "mayank-sharma",
  "summary": "Tachyum universal processor is tipped to revolutionize large-scale computing",
  "article": [
    "Chip company Tachyum is about to make a prototype of its much anticipated Prodigy Universal Processor available to early adopters.",
    "Built using field-programmable gate array (FPGA) emulation boards, Tachyum has said Prodigy will deliver a significantly improved performance while lowering energy consumption.",
    "Prodigy’s real appeal though is its reported ability to efficiently run all kinds of workloads, from high-performance computing and Artificial Intelligence (AI) to web servers, which Tachyum anticipates will, “translate to billions of dollars in annual savings to hyperscalers, such as Google, Facebook, Alibaba and Amazon.”",
    "Not only is the universal processor pitched to eliminate the use of a heterogeneous combination of hardware to suit different workloads, it isn’t a slouch either.",
    "Tachyum claims Prodigy can outperform Nvidia’s fastest GPUs in supercomputer systems as well as in AI training and inference. It further claims that a rack of 125 HPC Prodigy processors can deliver 32 tensor exaFLOPs.",
    "At the core of the processor is Tachyum’s software emulation technology, which it says helps run the different kinds of workloads without the typical overheads associated with emulation. In fact, the company asserts that it can run Arm and RISC-V code better than modern processors based on these architectures.",
    "“Tachyum’s Prodigy emulation system has been developed in house to enable customers to begin benchmarking and porting their own application software to native Prodigy code. Prodigy FPGA hardware prototypes, composed of multiple boards, can be configured to deliver full-chip or half-chip emulation. A small, two-board version of the Prodigy prototype will also be offered and is ideal for native Prodigy software development,” shares the company.",
    "Tachyum reports that the hardware prototypes of the chip are currently completing in-house testing before being shipped to its first customers. With a final release later this year, it’ll be interesting to note how much of Tachyum’s claims translate into real-world performance."
  ],
  "headers": {
    "3": "One step closer"
  },
  "links": {
    "Processor": "https://www.techradar.com/news/best-processors",
    "all kinds of workloads": "https://www.techradar.com/news/this-intel-and-nvidia-rival-can-run-everything-from-hyperscale-data-centers-to-your-web-hosting",
    "Nvidia’s": "https://www.techradar.com/news/nvidia-geforce",
    "GPUs": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "asserts": "https://www.techradar.com/news/this-processor-can-run-any-code-you-need-faster-than-intel-and-nvidia",
    "software development": "https://www.techradar.com/news/best-laptop-for-programming"
  }
}