{
  "source": "https://www.techradar.com/news/nokia-resumes-work-with-the-o-ran-alliance",
  "title": "Nokia resumes work with the O-RAN Alliance",
  "category": "phones",
  "updated": "2021-09-14T16:01:25Z",
  "author": "steve-mccaskill",
  "summary": "Nokia had paused activity over concerns about US sanctions",
  "article": [
    "Nokia has resumed its work with O-RAN Alliance after the organisation changed its documents and procedures to ensure participants could continue with technical activities without breaking US law.",
    "The GSMA-affiliated O-RAN Alliance is one of the industry’s largest working groups devoted to Open RAN technology - a vendor-neutral approach to Radio Access Network (RAN) technologies such as antennas, masts, and small cells.",
    "This approach contrasts with traditional methods of procurement which have seen operators deploy integrated cell sites comprising radio, hardware, and software from a single supplier. This approach makes it difficult to mix and match innovations and poses a significant barrier to entry for other vendors.",
    "Although Nokia, along with Ericsson and Huawei, has been one of the major players in the RAN market, it acknowledges that operators want to be able to mix and match innovations in the 5G era.",
    "However last month, Nokia paused its work with the group amid concerns that the involvement of Chinese firms on the US non-entity list could expose the company to potential penalties. The O-RAN Alliance’s changes mean the suspension has been lifted.",
    "The Finnish networking giant says it is committed to the development of open and interoperable networking technologies and that its customers expect it. Indeed, it notes that 26 of the 29 operator members of the O-RAN Alliance use Nokia equipment.",
    "“In recent weeks, O-RAN and the O-RAN Alliance have been top of the telecom news agenda – and, alongside them, Nokia has been in the news too,” said Tommi Uitto, President of Mobile Networks at Nokia. “For a short time, we had to pause our technical activity with the alliance while important legal issues were ironed out.",
    "While much has been written in recent days about that decision, I want to re-iterate something that has not – and will not – change: Nokia is fully committed to O-RAN and a believer in the potential of O-RAN.",
    "“The speed with which the O-RAN Alliance has been able to resolve recent issues speaks to the spirit of community and co-operation on which it was founded. Rest assured that Nokia will continue to play a leading role in shaping its exciting future.”"
  ],
  "headers": {
    "3": "Nokia OpenRAN"
  },
  "links": {
    "paused its work with the group": "https://www.techradar.com/news/nokia-suspends-o-ran-alliance-work"
  }
}