{
  "source": "https://www.techradar.com/news/soulstorms-messy-start-nearly-made-me-give-up-im-glad-i-didnt",
  "title": "Soulstorm’s messy start nearly made me give up - I’m glad I didn’t",
  "category": "gaming",
  "updated": "2021-04-10T13:00:13Z",
  "author": "vic-hood",
  "summary": "Opinion: Soulstorm is worth sticking with, even if the start is a mess",
  "article": [
    "“Not again,” I mutter as yet another of my Mudoken followers meets its untimely death at the jaws of a ravenous Fleech. While I could simply choose to forget about this particular overall-wearing, smartmouthed lackey – after all, all the Mudoken followers look the same – I still choose to restart from the checkpoint and make an effort to save him from his unfortunate demise. After all, ‘Raymond’ as I call him, maybe has a Mudoken partner at home, waiting for him to come home after a long day of following around his savior Abe. Yes, it’s worth restarting.",
    "I never expected to care for Raymond. In fact, as I started Oddworld: Soulstorm, I played through gritted teeth and tirades of swear words. Rather than choosing to restart at each checkpoint, I grimaced each time I was forced back to another – more time I had to spend trying to get through this clumsy game with its awkward platforming and fiddly controls.",
    "And my gripes about those things haven’t changed, Soulstorm is a pain to get to grips with and has its fair share of issues... but I can’t stop playing it. While the game’s issues could keep some players from reaching the Odd promised land, persistence pays off and, when Soulstorm finally gets some room to breathe, the pain becomes more of a dull throbbing.",
    "Like many other Oddworld fans, I’ve been waiting a long time for Soulstorm. I remember watching Oddworld creative director (and co-founder) Lorne Lanning revealing the Soulstorm trailer at EGX 2017 and shivers went down my spine – the same shivers I got when I watched Abe stumble upon the Mudokon’s devious plan in Abe’s Oddysee. This was going to be good.",
    "But four years later, when I finally got my hands on Soulstorm for the first time, that prediction fell flat. While classic Oddworld games, particularly Abe’s Oddysey, had infamously frustrating platforming, the first few levels of Soulstorm were proving to be worse than that.",
    "For one, Abe’s jumping is a nightmare. While the reluctant hero can now double-jump (which you assume would make reaching platforms easier), I had countless instances where I simply couldn’t climb up a ledge because Abe needed to be exactly positioned to be able to grab on. In one of the game’s early levels, this makes things particularly difficult as you’re trying to escape from a Molluck airship that’s firing consistently in your direction. While I didn’t experience any of the bugs others have reported, I did find myself dying again and again while trying to perform tasks as simple as jumping and grabbing a ledge.",
    "What made these early game experiences worse was trying to get to grips with the sheer amount of new features Soulstorm packs in and how awkwardly it feels some of these have been implemented.",
    "Take throwing for example. Abe can throw a variety of objects including flares, stun mines, water and Soulstorm brew, but the process of throwing feels completely unnatural– and unnecessary. To throw, say, water at fire, you need to hold Triangle on PS5, select it from the wheel and then use the right analog stick to direct where you’re throwing – a dotted arch shows the trajectory – and then press the right trigger to throw. It’s a minor process that I found particularly fiddly to get to grips with given the button-stick-trigger sequence especially when you have to do it a lot.",
    "Throwing is one of many features Soulstorm has, which just seem to pile on the complexity. There’s also the ability to tie and pickpocket Sligs (which is pretty good), hiding in lockers, crafting, collecting badges for challenges, secret areas and chanting, not to mention the Mudokon follower management feature. It arguably feels like there’s too much to wrangle, and I would like to have seen the platforming itself excel more while these features took a bit more of a backseat. Instead, it feels almost like ideas kept being packed in while focus on simply making the platforming feel challenging but good to play fell to the wayside a bit. Basics first.",
    "What I did find as I progressed, however, was that these issues were most prevalent in the game’s first two missions. After I dragged myself through those, intent on not playing anymore for the sake of my blood pressure, I actually found that Soulstorm became pretty enjoyable.",
    "Rather than the bombardment that the first few missions throw at you, the game is given more room to breathe. There’s room for Abe to explore, he (mostly) has the choice to save Mudokons or leave them behind, there are caves to investigate and puzzles to solve. I was enjoying it so much more that I kept asking myself: why wasn’t this upfront?",
    "It’s at this point I could soak in just how stunning Soulstorm is on PS5, how beautifully realized its world is and the detail that’s gone into every molecule of its characters. Yes, the platforming still infuriates me and it needs serious fine-tuning, but it becomes more tolerable when you’re not forced into a corner off the bat and relying on that clumsy jump to progress.",
    "Soulstorm is by no means perfect and, for some Oddworld fans, the new features and setting may be a bit too much. But my advice would be to get through the first few levels before you make a decision – it made all the difference for me."
  ],
  "headers": {
    "3": "Awkward platforming",
    "9": "A lot to love"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}