{
  "source": "https://www.techradar.com/news/ios-145-will-bring-a-big-privacy-feature-to-iphone",
  "title": "iOS 14.5 will bring a big privacy feature to iPhone",
  "category": "phones",
  "updated": "2021-01-28T09:56:00Z",
  "author": "james-rogerson",
  "summary": "App Tracking Transparency is on the way",
  "article": [
    "We’re not expecting iOS 15 to launch until September, but that doesn’t mean you’ll have to do without new software features between now and then, as Apple has confirmed that a major new privacy feature is coming soon.",
    "In a post on its newsroom, the company revealed that App Tracking Transparency will be available in Apple’s next beta update – and given that iOS 14.4 is now available, that beta is presumably for iOS 14.5.",
    "This feature, which will apparently roll out broadly in ‘early spring’ (likely meaning March), requires apps to get your permission before tracking your activity and data across apps and websites owned by other companies.",
    "Once the feature launches, you’ll be asked whether you give your permission for this when you launch an app that would usually share your data – so you have to specifically opt in. And Apple will require apps to allow you full access to their functionality even if you opt out.",
    "This change will particularly affect services like Facebook, which shares your data with businesses to allow for personalized adverts. Indeed, Facebook has already argued against the change, claiming that it will hurt small businesses.",
    "But it certainly sounds like it will give users more control over their data and privacy, which sounds like a good thing to us. The App Tracking Transparency feature will be launching for iPadOS 14 and tvOS 14 too, and Apple’s own apps and services will also sport it."
  ],
  "headers": {},
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "newsroom": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2225644744345797600&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fuk%2Fnewsroom%2F2021%2F01%2Fdata-privacy-day-at-apple-improving-transparency-and-empowering-users%2F",
    "iOS 14.4": "https://www.techradar.com/news/ios-145-full-news",
    "claiming that it will hurt small businesses": "https://about.fb.com/news/2020/12/speaking-up-for-small-businesses/",
    "iPadOS 14": "https://www.techradar.com/news/ipados-145",
    "tvOS 14": "https://www.techradar.com/news/tvos-15"
  }
}