{
  "source": "https://www.techradar.com/news/battlefield-6-will-feature-massive-immersive-battles-on-ps5-and-xbox-series-x",
  "title": "Battlefield 6 on PS5 and Xbox Series X will include 'more players than ever'",
  "category": "gaming",
  "updated": "2021-02-03T12:42:07Z",
  "author": "adam-vjestica",
  "summary": "Back to the front",
  "article": [
    "EA has said that Battlefield 6 “takes full advantage of the power of next-generation platforms”, and that the game is on track for an early 2021 reveal, with a release towards the end of the year.",
    "EA CEO Andrew Wilson shared more details about Battlefield 6 in an earnings call with investors. Wilson said that Battlefield 6 will tap into the horsepower of both the PS5 and Xbox Series X, which should “bring massive and immersive battles to life with more players than ever”. The series is known for pitting 64 players against each other.",
    "Wilson also added that Battlefield 6 will feature maps “with unprecedented scale” and that “the next vision of Battlefield takes all the destruction, player agency, and vehicle and weapon combat that the franchise is known for and elevates it to another level.”",
    "Battlefield 6 has been tipped for a \"holiday 2021\" release date, which falls between early November and December. Wilson reaffirmed that the game will arrive during this time, and that we'll find out more about the game soon.",
    "\"We will reveal the game in the spring [so March-May] and deliver the defining Battlefield experience for our players in the 2021 holiday season,\" Wilson said.",
    "While Battlefield is still one of the biggest games of the year, it’s fair to say that the latest iteration, Battlefield 5, didn’t quite resonate as strongly with the game’s player base as previous titles.",
    "Much like Call of Duty, there’s always a back and forth over the direction and setting of each title, with some players preferring a more military-focused game, while others would like to see a more modern, futuristic depiction.",
    "For those in the more traditional camp, Wilson has said the next Battlefield game will \"mark a return to all-out military warfare”, which should please the purists."
  ],
  "headers": {
    "5": "Wargames"
  },
  "links": {
    "Battlefield 6": "https://www.techradar.com/reviews/battlefield-2042",
    "earnings call": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4922546161181093000&xs=1&url=https%3A%2F%2Fwww.fool.com%2Fearnings%2Fcall-transcripts%2F2021%2F02%2F02%2Felectronic-arts-ea-q3-2021-earnings-call-transcrip%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fbattlefield-6-will-feature-massive-immersive-battles-on-ps5-and-xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "Call of Duty": "https://www.techradar.com/reviews/call-of-duty-black-ops-cold-war"
  }
}