{
  "source": "https://www.techradar.com/news/huge-deal-the-apple-watch-6-just-hit-lowest-sale-price-ever-at-amazon",
  "title": "Hurry – the Apple Watch 6 just hit lowest sale price ever at Amazon",
  "category": "wearables",
  "updated": "2021-04-29T14:02:27Z",
  "author": "mackenzie-frazier",
  "summary": "The Apple Watch 6 just dropped to $249 for the first time",
  "article": [
    "Earlier this week Amazon dropped the Apple Watch 6 to a record-low price of $299 - the best deal we've seen for Apple's latest smartwatch. Today, the retail giant has a further $50 discount which brings the price of the Apple Watch 6 down to just $249 (was $399). That's a massive $150 discount and an incredible price for the feature-packed smartwatch.",
    "The feature-rich Apple Watch 6 tracks activity, workouts, and calories and now includes a sleep app that helps you establish a regular bedtime routine to get a better night's rest. The Series 6 includes new health features such as blood oxygen monitoring and an ECG app that alerts you when an irregular heart rate is detected. The waterproof smartwatch also helps you stay connected with the ability to take calls and reply to texts directly from your wrist. As we've mentioned above, this is the best deal we've found for the Apple Watch 6 and $80 less than the Black Friday record-low price. We predict this incredible offer will go fast, so you should snag this bargain now before it's too late.",
    "Shop more offers with our roundup of the best cheap Apple Watch deals and sales that are happening now. You can also shop for more bargains with our roundup of the best Memorial Day sales: deals from Best Buy, Home Depot, Walmart, and more."
  ],
  "headers": {
    "1": "Apple Watch 6 deal",
    "2": "More Apple Watch deals"
  },
  "links": {
    "down to just $249": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J5RBMRN%2Fref%3Dfs_a_wt2_us1%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4533584377751656000-20",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "cheap Apple Watch deals and sales": "https://www.techradar.com/news/cheap-apple-watch-deals",
    "best Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021"
  }
}