{
  "source": "https://www.techradar.com/news/red-hat-openshift-has-arrived-on-aws",
  "title": "Red Hat OpenShift has arrived on AWS",
  "category": "computing",
  "updated": "2021-03-25T22:45:46Z",
  "author": "anthony-spadafora",
  "summary": "Red Hat OpenShift Service on AWS is now generally available",
  "article": [
    "AWS customers now have a new option when it comes to deploying containers using the cloud computing service as the company has announced that Red Hat Open Shift Service on AWS (ROSA) is now available.",
    "ROSA provides customers with a fully managed OpenShift service with joint support from both AWS and Red Hat. The service also has an AWS integrated experience for cluster creation, a consumption-based billing model and a single invoice for AWS deployments.",
    "AWS built its new service in partnership with Red Hat to ensure that its customers have a fast and straightforward way to move either some or all of their existing deployments over to AWS.",
    "For those who are already familiar with Red Hat OpenShift, they can accelerate their application development process using standard APIs and existing Red Hat OpenShift tools for their AWS deployments. At the same time though, they'll also be able to take advantage of AWS compute, database, analytics, machine learning, networking, mobile and other services to improve agility and scalability.",
    "Since 2008, Red Hat and AWS have worked together to make it easy for organizations to run Red Hat Enterprise Linux on AWS. Now though, customers will be able to acquire Red Hat OpenShift licensing through AWS and deploy managed OpenShift clusters from their accounts.",
    "By leveraging the OpenShift Service Catalog and AWS Service Broker, developers can easily deploy applications that depend on other AWS services. The AWS Service Broker provides an intermediate layer that allows users to deploy services using native manifests and the OpenShift Console and it also supports a subset of AWS services such as Amazon Relational Database Service (Amazon RDS), Amazon EMR, Amazon DynamoDB, Amazon Simple Storage Service (Amazon S3), and Amazon Simple Queue Service (Amazon SQS).",
    "ROSA customers can choose from both an hourly, pay-as-you-go model or annual commitments and you can find out more on the service's pricing page.",
    "Red Hat Open Shift Service on AWS is now available in a number of AWS regions including Asia Pacific (Tokyo), Asia Pacific (Seoul), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Canada (Central), Europe (Frankfurt), Europe (Stockholm), Europe (Ireland), Europe (London), Europe (Paris), South America (São Paulo), US East (N. Virginia), US East (Ohio), US West (N. California), and US West (Oregon)."
  ],
  "headers": {
    "4": "Red Hat OpenShift Service on AWS"
  },
  "links": {
    "AWS": "https://www.techradar.com/news/aws",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "OpenShift": "https://www.techradar.com/news/you-can-now-deploy-windows-containers-with-openshift",
    "Red Hat": "https://www.techradar.com/news/red-hat-and-ibm-launch-hybrid-cloud-software-marketplace",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "Red Hat Enterprise Linux": "https://www.techradar.com/news/rhel-is-now-free-for-small-production-workloads",
    "Amazon RDS": "https://www.techradar.com/news/what-is-amazon-rds",
    "Amazon EMR": "https://www.techradar.com/news/what-is-amazon-emr",
    "Amazon DynamoDB": "https://www.techradar.com/news/what-is-amazon-dynamodb",
    "Amazon S3": "https://www.techradar.com/news/what-is-amazon-s3",
    "Amazon SQS": "https://www.techradar.com/news/what-is-amazon-sqs",
    "pricing page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7217938973860431000&xs=1&url=https%3A%2F%2Faws.amazon.com%2Frosa%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fred-hat-openshift-has-arrived-on-aws"
  }
}