{
  "source": "https://www.techradar.com/news/samsung-confirms-that-rollable-and-slidable-displays-are-on-the-way",
  "title": "Samsung confirms that rollable and slidable displays are on the way",
  "category": "phones",
  "updated": "2021-01-30T16:00:18Z",
  "author": "david-nield",
  "summary": "It plans to keep on innovating",
  "article": [
    "We've seen a few hints that Samsung wants to go beyond foldables into rollable displays for its smartphones, and now the company's display division has confirmed that it's exploring alternative form factors in an earnings call with investors.",
    "Company executives went on the record saying that both rollable and slidable displays were on the way in the future, as The Elec reports – which are presumably two different approaches to expandable screens, even if the end results would look very similar.",
    "It's worth pointing out that these were comments from Samsung Display, so it's possible that these screens are being produced for televisions or other gadgets besides smartphones. Samsung might also be making panels for other companies to use.",
    "However, given all the other signs we've seen that rollables and other innovations are on the way, we think it's a good bet that Samsung is going to introduce a rollable and perhaps even a slidable smartphone before too long – so watch this space.",
    "Samsung is by no means the only smartphone maker working on rollable handsets. The LG Rollable was teased earlier this month in a brief video clip, though it's not clear exactly when the handset might be out and available for consumers to buy.",
    "We've also seen a phone with a rollable screen demoed by TCL – and TCL has promised to have a handset with some kind of flexible display on the market at some point during 2021, even if details on what that might involve are still thin on the ground.",
    "Now we can look forward to Samsung getting involved too. This doesn't mean that the Samsung foldable phones – the Galaxy Z Fold and the Galaxy Z Flip – are going anywhere though, and upgrades to these handsets are almost definitely on the cards too.",
    "It wasn't so long ago that foldable phones seemed like the stuff of science fiction, but as manufacturing processes and materials improve, these handsets are becoming more commonplace – and getting cheaper over time as well.",
    "Via XDA Developers"
  ],
  "headers": {
    "4": "Roll with it"
  },
  "links": {
    "into rollable displays": "https://www.techradar.com/news/samsungs-next-foldable-phone-could-slide-like-the-lg-rollable",
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=2267",
    "other signs": "https://www.techradar.com/news/samsung-teases-a-couple-of-futuristic-foldable-phone-designs",
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "demoed by TCL": "https://www.techradar.com/news/tcl-confirms-it-will-launch-a-rollable-or-foldable-phone-this-year",
    "Galaxy Z Fold": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "XDA Developers": "https://www.xda-developers.com/samsung-slidable-display-2021/"
  }
}