{
  "source": "https://www.techradar.com/news/donald-trumps-new-site-wants-to-take-on-aws-as-well-as-facebook",
  "title": "Donald Trump's new site wants to take on AWS as well as Facebook",
  "category": "computing",
  "updated": "2021-12-06T16:24:38Z",
  "author": "mike-moore",
  "summary": "\"Truth Social\" wants to shake up tech world, claims $1bn fundraising",
  "article": [
    "The social media firm founded by former US President Donald Trump is looking to shake up large areas of the technology sector, it has claimed.",
    "As reported by the BBC, a slide deck on the website of \"Truth Social\" (pictured below) sees the company eventually competing against the likes of Amazon Web Services (AWS), Google Cloud and Microsoft Azure.",
    "It is represented as part of a \"long-term opportunity\" for an as-yet-unnamed part of the business that would not only look to topple the cloud giants, but payment firm Stripe.",
    "Truth Social is set to launch in early 2022, with a subscription-based video-on-demand service called TMTG+ set to follow soon after. The company says the platform, which would offer \"non-woke\" entertainment, would take on the likes of Netflix, Disney+, and Hulu.",
    "The future launches come alongside Truth Social's initial aims of providing a social media app that looks to end what it calls \"censorship and political discrimination\".",
    "First revealed by Mr Trump earlier this year, Truth Social now claims to have secured agreements that will see it raise $1bn for its as-yet-unscheduled launch.",
    "The firm has yet to reveal who any of these supposed investors actually are, but parent company Trump Media & Technology Group says it has partnered on the project with SPAC Digital World Acquisition.",
    "\"$1bn sends an important message to Big Tech that censorship and political discrimination must end,\" Mr Trump said.",
    "\"As our balance sheet expands, Trump Media & Technology Group will be in a stronger position to fight back against the tyranny of Big Tech.\"",
    "Mr Trump has been banned from the world's top social media networks, including Twitter, Facebook and Instagram, since using his profiles to whip up supporters to carry out the storming of the US Capitol in January 2021.",
    "Trump had claimed, without offering any actual evidence, that the US presidential election won by current President Joe Biden had been tampered with to prevent his re-election."
  ],
  "headers": {
    "3": "Truth Social"
  },
  "links": {
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "BBC": "https://www.bbc.co.uk/news/business-59538590",
    "Truth Social": "https://www.tmtgcorp.com/company-overview",
    "AWS": "https://www.techradar.com/news/live/aws-reinvent-2021-keynote-live-blog"
  }
}