{
  "source": "https://www.techradar.com/news/olympus-pen-f-ii-camera-is-possible-according-to-om-digital-solutions",
  "title": "Olympus Pen-F II camera is 'possible' according to OM Digital Solutions",
  "category": "cameras",
  "updated": "2021-02-08T11:42:48Z",
  "author": "mark-wilson",
  "summary": "New home of Olympus cameras promises launches this year",
  "article": [
    "Ever since Olympus cameras started a new life under fresh owners, OM Digital Solutions, earlier this year, fans have been waiting for hints about the new launches that might follow – and now an interview has given us a few insights, including the fact that an Olympus Pen F II is a \"possible\" arrival.",
    "An interview from the Japanese news site AERA dot with OM Digital Solutions' Chief Technology Officer, Setsuya Kataoka, contains a few interesting hints about where the new company is headed and how it plans to negotiate the rough waters of a shrinking camera market and pandemic.",
    "Commenting on the future of the Olympus brand, Mr. Kataoka said that \"at least for the time being, we will continue to use 'Olympus'\", which should please fans of the classic imaging brand that had, until its recent sale to a Japanese investment fund, been making cameras and lenses since 1936.",
    "But how exactly will OM Digital Solutions give Olympus cameras a new lease of life in such difficult circumstances? Aside from reducing the number of employees \"by about a half compared to the previous imaging division\", the key is apparently to avoid treading water by developing \"new products\" – including new lenses and even the odd camera body.",
    "When asked if producing a camera like the Olympus PEN-F, which was something of a cult classic, could be a hit, Mr. Kataoka said \"I think it is possible\" and added that if there is proven, small-scale demand for hobbyist cameras in that vein, then \"I think there is a possibility that we can produce it\".",
    "Of course, that's some way short of confirmation that a PEN-F II is in the works, but it's better than an outright declaration that the focus is solely on new lenses. On that theme, Mr. Kataoka added that new products would arrive \"within the year\" and that \"some of these are products that include such special features that you'll say \"ooh\" and \"ahh\" over them.\"",
    "Any hopes that this is referring to a new PEN camera, though, should be tempered by the fact that it seems lenses will have at least equal focus. On this subject, Mr. Kataoka said: \"I think that lenses are what will differentiate camera systems in the future. If you compete only on the basis of the size of the body alone, there won't be much difference,\" he said. \"On this basis, we want to produce lenses that will convince our customers that Micro Four Thirds lenses can do this,\" he added.",
    "So how does these quotes tally with previous ones we've seen from the President of OM Digital Solutions and Olympus Image Processing engineer Hiroshi Suzuki in January?",
    "Although specific announcements might have to wait until camera shows like CP+, which takes place from February 25, the interview does seem to confirm that OM Digital Solutions is planning new launches across most of Olympus' sub-brands, including OM-D, PEN and Zuiko.",
    "The fear for Olympus fans when its imaging division was sold to an investment fund was that new product development might all but cease, with the classic brand's heritage used as a front to sell inferior cameras and bodies containing old tech.",
    "But thanks to the huge cost-cutting measures described by Setsuya Kataoka, it seems that OM Digital Solutions has the company on enough of level footing to consider new launches in targeted areas.",
    "Perhaps the most likely of these is lenses rather than bodies, with Mr. Kataoka describing how the Micro Four Thirds system used by Olympus cameras can create unique glass \"that would not be possible if we tried to do so with full-frame lenses\". For example, the new M.Zuiko Digital ED 150-400mm f/4.5 TC1.25x IS PRO telephoto zoom lens (above) combines handheld telephoto shooting with a form factor that simply wouldn't be possible on full-frame cameras.",
    "Still, we're hoping that OM Digital Solutions' confirmed new products aren't just aimed at the pro end and include some treats like an Olympus PEN-F II for photographers a little further down the chain.",
    "And with Mr. Kataoka concluding that he believes hobbyist photography will \"continue to have value\" and that \"it is the camera, not the smart phone, that will take care of this\", the signs are promising that the new Olympus-branded cameras will continue to arrive for all kinds of photographer over the next year."
  ],
  "headers": {
    "7": "Lens of direction"
  },
  "links": {
    "AERA dot": "https://dot.asahi.com/dot/2021020300092.html?page=1",
    "Olympus PEN-F": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/olympus-pen-f-1313803/review"
  }
}