{
  "source": "https://www.techradar.com/news/iphone-13-model-leak-shows-the-likely-design-of-apples-2021-phones",
  "title": "iPhone 13 model leak shows the likely design of Apple’s 2021 phones",
  "category": "phones",
  "updated": "2021-07-09T14:29:54Z",
  "author": "james-rogerson",
  "summary": "Believed by case makers",
  "article": [
    "This year, like most years, the upcoming iPhones are perhaps the most frequently leaked handsets, but while we’re used to seeing renders and dummy units of the iPhone 13 range, the latest leak is something a bit different.",
    "Benks – a Chinese smartphone case maker – has shared photos of iPhone 13 chassis models on Weibo (a Chinese social network). These are a bit like the non-functioning dummy units we’ve seen elsewhere, except they just show the supposed shapes of the iPhone 13 range, not the complete finished appearance.",
    "That might make them sound less interesting, but they’re used by the case maker to craft cases for the phones, and according to leaker DuanRui (who spotted these images), this company has already made cases based on these designs, so it must be confident in them.",
    "Unsurprisingly though there’s nothing particularly new here – the iPhone 13 and its siblings have been leaked extensively at this point, and the vast majority of these leaks line up with each other.",
    "You can see from these chassis models that the design is very similar to the iPhone 12 range, and that there are seemingly four upcoming models – presumably the iPhone 13, iPhone 13 Pro, iPhone 13 Pro Max and iPhone 13 mini.",
    "We can only see the back of the chassis models here, and the biggest visual difference from the iPhone 12 range is the camera block, which on the two cheaper phones has differently arranged lenses here, while on the Pro models the camera blocks look a bit bigger than their predecessors.",
    "With these designs appearing time and time again we’re very confident that this is accurate, but we’d still take this with a pinch of salt until Apple makes the phones official – probably in September.",
    "Via MacRumors"
  ],
  "headers": {},
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "dummy units we’ve seen elsewhere": "https://www.techradar.com/news/iphone-13-dummy-unit-shows-off-smaller-notch-larger-cameras",
    "DuanRui": "https://twitter.com/duanrui1205/status/1413421547948150791",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "MacRumors": "https://www.macrumors.com/2021/07/09/iphone-13-models-shared-on-weibo/"
  }
}