{
  "source": "https://www.techradar.com/news/new-indiana-jones-game",
  "title": "New Indiana Jones game: everything we know so far",
  "category": "gaming",
  "updated": "2021-09-22T16:57:42Z",
  "author": "vic-hood",
  "summary": "Indy is back in this new Indiana Jones game",
  "article": [
    "Lucasfilm Games has officially announced that a new Indiana Jones game is in the works at Wolfenstein developer MachineGames, with Bethesda Game Studios head Todd Howard set to be executive producer of the project.",
    "At the moment, we know very little about the new Indiana Jones game; even its official title is a mystery. Nor do we have any confirmation on what the story will be, when we'll get to play it, or which platforms it will release on, now that Microsoft has acquired Bethesda's parent company ZeniMax Media. However, StarWars.com, Lucasfilm's official news outlet, has thrown us a bone, revealing that the game is an \"original, standalone tale set at the height of the career of the famed adventurer\".",
    "It may not be much, but it's enough to get us excited. Want to know more? Then read on for everything we know about the new Indiana Jones game.",
    "[Update: The new Indiana Jones game is still in its very early stages of development but could it be an Xbox exclusive? Read on to find out more.]",
    "Unfortunately, there's no word on when we'll get our hands on the new Indiana Jones game, but we're expecting it'll be a few years yet.",
    "Bethesda has already said \"it'll be some time before we have more to reveal,\" which isn't particularly surprising given that the company is also working on both Starfield and Elder Scrolls 6 currently. We wouldn't expect the game to release until at least 2022, though we're hoping to hear something more about it before the year is out.",
    "With Bethesda's parent company, Zenimax, now owned by Microsoft, we expect to see the new Indiana Jones game coming to PC and Xbox Series X/S – however, platforms have not yet been confirmed.",
    "Teaser trailer Bethesda shared a teaser trailer on Twitter in January 2021 that officially announced the new Indiana Jones, though it had more Easter Eggs than game details. The trailer pans across a desk covered with books, a camera and papers, before landing on the iconic fedora and whip of Dr Henry 'Indiana' Jones, Jr. It's not much to go on, but it's enough to get us excited (and there does seem to be some clues littered in it). Check it out for yourself:",
    "New rumors point to Xbox exclusivity",
    "There are more rumors that Bethesda’s upcoming Indiana Jones game could be an Xbox exclusive. This comes from XboxEra podcast co-host Nick Baker who recently posted a tweet suggesting that the game will be an Xbox exclusive.",
    "This hasn’t, of course, been confirmed through any official channels tied with the game so it’s not certain what platforms the Indiana Jones game will launch on, but it wouldn’t be entirely surprising if it was an Xbox exclusive. After Bethesda’s acquisition by Microsoft, it’s been confirmed that Bethesda’s upcoming game Starfield is going to be an Xbox exclusive and there are reports that Elder Scrolls 6 will go the same way.",
    "This Indiana Jones game looks to be in its early stages and is almost certainly a while off. If there aren't any previous contractual obligations bringing the game to PlayStation we wouldn't be surprised if it was among the \"new titles in the future that will be exclusive to Xbox and PC players” that Phil Spencer has previously mentioned.",
    "In the “very, very, very early stages of development”",
    "It’ll be a while before we get our hands on MachineGames’ Indiana Jones game as senior vice president of global marketing and communications, Pete Hines, has said that the game is still in the “very, very, very early stages of development”.",
    "Speaking in an interview as part of GameSpot’s Play For All event in June 2021, Hines said, “They're working on the Indiana Jones games which we just talked about earlier this year. Obviously we literally just announced that deal, so you can make your own guesses about how far along that is.”",
    "PS5 will miss out on some Bethesda games but is Indiana Jones one of them? In March 2021, Microsoft completed its acquisition of Bethesda’s parent company ZeniMax media and in a blog post on Xbox Wire, head of Xbox Phil Spencer didn’t completely rule out that Bethesda’s games won’t release on Sony’s PS5 in the future, but he did stress that “gamers should know that Xbox consoles, PC, and Game Pass will be the best place to experience new Bethesda games, including some new titles in the future that will be exclusive to Xbox and PC players.”",
    "During the “Bethesda Joins Xbox” roundtable on March 11, Spencer addressed this further, saying “If you’re an Xbox customer, the thing I want you to know is that this is about delivering great exclusive games for you that ship on platforms where Game Pass exists,” Spencer explained. “That’s our goal, that’s why we’re doing this, that’s the root of this partnership that we’re building.”",
    "It’s worth noting that Spencer also said, “Obviously I can’t sit here and say every Bethesda game is exclusive, because we know that’s not true,” due to contractual obligations that will have to be seen through.",
    "We don’t know whether or not there are any contractual obligations around the Indiana Jones game but based on Spencer’s words it seems like there’s a good chance the new Indiana Jones game will, at the very least, be a Game Pass title, if not an outright Xbox exclusive. Spencer didn’t explicitly name the game so we can’t be certain just yet.",
    "It’ll be a completely original story It looks like we won’t be able to glean any story details about the new Indiana Jones game from existing media as Bethesda has confirmed that the game is to be an entirely “original story” in an announcement tweet. That hasn’t stopped us trying to pick apart the brief announcement trailer, though, as you can see below.",
    "Announcement trailer hints The announcement teaser trailer for the new Indiana Jones game was pretty brief, but there may have been some hidden clues in it which eagle-eyed fans have spotted may point to the game's setting.",
    "It looks like the game could be set (at least partly) in 1937, and see Indy adventuring to Rome given the trailer shows a map of Vatican City as well as a note from Indy that partly says \"I will be arriving in Rome.\""
  ],
  "headers": {
    "4": "New Indiana Jones game: cut to the chase"
  },
  "links": {
    "Microsoft has acquired": "https://www.techradar.com/news/xbox-will-be-home-to-new-and-exclusive-bethesda-games",
    "StarWars.com": "https://www.starwars.com/news/indiana-jones-game",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "shared": "https://twitter.com/bethesda/status/1349023307228704770",
    "confirmed": "https://www.techradar.com/news/starfield-really-is-an-xbox-exclusive-no-seriously",
    "an interview as part of GameSpot’s Play For All": "https://www.youtube.com/watch?v=ebNlaSEfc5w&t=4s",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Bethesda Joins Xbox": "https://youtu.be/YJneU_qBMPM",
    "addressed": "https://www.techradar.com/news/ps5-players-wont-get-future-bethesda-games",
    "announcement": "https://twitter.com/bethesda/status/1349024654611120130?s=20"
  }
}