{
  "source": "https://www.techradar.com/news/5-things-you-need-to-know-before-buying-a-gaming-monitor",
  "title": "5 things you need to know before buying a gaming monitor",
  "category": "computing",
  "updated": "",
  "author": "daryl-baxter",
  "summary": "Play Deathloop in full 1440p style",
  "article": [
    "Looking for the right gaming monitor can be a monotonous task, but with the right research you can end up with the monitor that you want, and within budget.",
    "There’s a sea of monitors to choose from, which can feel overwhelming. Some gamers use a PC for both work and gaming, while others use a PC exclusively for gaming, and there are monitors for both these needs.",
    "For gaming, the right monitor could showcase your game in the right light with the best resolution and a great ergonomic design, but there are a few hoops to jump through before you decide to spend on one.",
    "With this in mind, here are the important points to consider when buying a gaming monitor and what to look out for so you don’t end up with an overpriced paperweight.",
    "Size can be crucial for a gaming monitor. You want a size that’s big enough to emphasize every game you play, but that is also still able to fit on your desk regardless.",
    "Try to go for a monitor with a minimum display of 24 inches, which is an ample size to render a game at a 1920x1080 resolution. There’s also the design of the monitor to consider; you want to have a thin bezel around the monitor that doesn’t distract the game, and if speakers are built-in, look to see if they’re at the side of the monitor or placed towards the bottom.",
    "Another factor is seeing if it can be adjusted to meet your eyeline. From the angle to the height, it’s important to have a monitor that can adapt to whichever desk or chair you're using, in casee you decide to upgrade these as well.",
    "While some games and graphics cards can render at 4K, which is four times the resolution of 1080, it can be a big hit on performance overall, so look for a monitor that aims for 1440P.",
    "It’s a great go-between 1080 and 4K, where it’s not too much of a strain on a PC, while showcasing a game in a 2K resolution. If you have a PlayStation 5 or Xbox Series console, they’re designed to work in 1440P and 4K, so you could use your new gaming monitor for these as well.",
    "If your budget allows, try to look for a monitor that can go up to 1440p, which is a 2560x1440 resolution, but if you’re also looking for a gaming monitor for your new console, look for a 4K-compatible monitor for the games that can run at that resolution.",
    "Have a set amount in mind. Depending on where you’re buying a monitor from, it’s good to start from $500 / £300 / AUS$300 and work from there. We recommend starting with a budget after you’ve decided on the size and resolution of a monitor.",
    "This way, you can have a greater idea of which monitors suit you best for your budget, while giving you the resolution and size that you want.",
    "However, if you have a greater budget of around $800 / £600 / AUS$600, look for a premium monitor that features other integrated additions, such as sound, webcam and bluetooth to make it easier to connect your headphones and speakers to cut the clutter on your desk.",
    "As monitors become more sophisticated, the refresh rate has become a contentious factor that is as important as resolution.",
    "This is how often an image appears on a monitor every second. The higher the refresh rate that’s stated, the smoother the game will look. So if you see a 120Hz display, as long as the game supports this, you will be able to play at 120 frames per second.",
    "While the PlayStation 5 and Xbox Series consoles support 120Hz, other gaming monitors can go even higher to 240Hz or 320Hz for a PC. Of course, this depends on whether your graphics card supports this and if it can run at these high frame rates, but these will result in a smoother gaming experience.",
    "If your budget allows, look for a 120Hz display, but there are others that offer a 75Hz refresh rate, slightly higher than the standard 60Hz that many monitors have supported for years, but you’ll still gain the benefit of a smoother game, no matter how minor.",
    "Looking at how many ports there are in a monitor should always depend on what your PC supports as well. It’s no use looking for a monitor that only has one DVI port if your PC doesn’t even feature this, so make sure to look for a monitor that has multiple inputs to display the image.",
    "Making sure that the monitor supports a wide range of inputs is crucial, so HDMI and DisplayPort should be looked for at a minimum, and even a headphone jack to connect your headphones to minimize the latency compared to a bluetooth connection.",
    "However, if your budget is factoring in two monitors or more, look for DisplayPort 1.2. This updated version of DisplayPort can support the bandwidth of two monitors at 1440p, or five monitors at 1080p at a 60 frame per second bandwidth."
  ],
  "headers": {
    "4": "1. Ergonomics",
    "7": "2. Resolution",
    "10": "3. Budget",
    "13": "4. Refresh rate",
    "17": "5. Ports"
  },
  "links": {}
}