{
  "source": "https://www.techradar.com/news/windows-10-update-toughens-security-around-point-and-print",
  "title": "Windows 10 update toughens security around Point and Print",
  "category": "computing",
  "updated": "2021-08-11T09:35:37Z",
  "author": "mayank-sharma",
  "summary": "It can still be overridden by a registry tweak",
  "article": [
    "Microsoft has fine tuned the default printer driver installation and update behavior to mitigate vulnerabilities in the Windows Print Spooler service that came to the fore with the PrintNightmare vulnerability.",
    "The security update is designed to change the default Windows behavior, which debuted with Windows 2000 to enable users to connect to a print server to download and install necessary printer drivers.",
    "Known as Point and Print, cybersecurity researchers recently demonstrated that the feature could be used to run a malicious print server and force Windows systems to download and install malicious drivers.",
    "“Our investigation into several vulnerabilities collectively referred to as “PrintNightmare” has determined that the default behavior of Point and Print does not provide customers with the level of security required to protect against potential attacks. Today, we are addressing this risk by changing the default Point and Print driver installation and update behavior to require administrator privileges,” shared the Microsoft Security Response Center (MSRC) team.",
    "Following the disclosure of the vulnerability, tracked as CVE-2021-34481, Microsoft’s initial attempts to fix it were “deemed incomplete.”",
    "Acknowledging that the vulnerability takes advantage of what can be described as a design flaw, Microsoft has now tweaked the default behavior to prevent users without administrator privileges from adding or updating printers.",
    "Microsoft says that the change in policy will impact use cases that relied on regular Windows users to add and modify printers. However, in light of the fact that this vulnerability can be exploited Microsoft stresses that the “security risk justifies this change” despite the inconvenience it may cause.",
    "That said, Microsoft has given users the option to manually override the new security policy with a registry key.",
    "Via The Record"
  ],
  "headers": {
    "4": "Fixing privileges"
  },
  "links": {
    "printer": "https://www.techradar.com/best/best-small-business-printers",
    "Windows": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "PrintNightmare": "https://www.techradar.com/news/microsoft-issues-official-printnightmare-fix-in-latest-patch-tuesday-blast",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "shared": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1404731482783594500&xs=1&url=https%3A%2F%2Fmsrc-blog.microsoft.com%2F2021%2F08%2F10%2Fpoint-and-print-default-behavior-change%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-10-update-toughens-security-around-point-and-print",
    "disclosure of the vulnerability": "https://www.techradar.com/news/windows-print-spooler-has-yet-another-security-flaw",
    "manually override": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1156629379081023700&xs=1&url=https%3A%2F%2Fsupport.microsoft.com%2Ftopic%2F873642bf-2634-49c5-a23b-6d8e9a302872&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-10-update-toughens-security-around-point-and-print",
    "The Record": "https://therecord.media/microsoft-to-require-admin-rights-before-using-windows-point-and-print-feature/"
  }
}