{
  "source": "https://www.techradar.com/news/iphone-12-pro-vs-samsung-galaxy-note-20-ultra-compact-versus-phablet",
  "title": "iPhone 12 Pro vs Samsung Galaxy Note 20 Ultra: compact versus phablet",
  "category": "phones",
  "updated": "2021-07-10T12:00:41Z",
  "author": "jon-mundy",
  "summary": "A compact super-phone versus a classy phablet",
  "article": [
    "The top end of the smartphone market is ruthlessly fast-moving. Today’s hot handset can start to look decidedly off the pace in just six months.",
    "That’s not the case with our two featured handsets for today. Both the iPhone 12 Pro and the Samsung Galaxy Note 20 Ultra launched in late 2020, yet they remain thoroughly relevant in the second half of 2021.",
    "But which of these premium phones holds up better? Which one would we rather slap our own money down on today? Let’s get into it.",
    "Apple’s iPhone 12 Pro arrived on October 23, 2020, with prices starting from $999 / £999 / AU$1,699 for the 128GB model. Upping that fee to $1,099 / £1,099 / AU$1,899 gets you 256GB, while $1,299 / £1,299 / AU$2,219 gives you the range-topping 512GB model.",
    "The Samsung Galaxy Note 20 Ultra came to us a little earlier in the year on August 21, 2020. Over in the US, prices started from $1,299 for the 128GB model, while UK and Australia customers had to stump up £1,179 / AU$1,849 for a model with 256GB. The top 512GB model set you back $1,449 / £1,279 / AU$2,199 at the time.",
    "You’ll find the same pricing holds true today for Apple’s phone, but you might just find a discount on Samsung’s if you’re lucky. It’s held its price pretty well for an older Android phone, though, which reflects its enduring appeal.",
    "You’ll struggle to find two more distinctively handsome phones than the iPhone 12 Pro and the Samsung Galaxy Note 20 Ultra. Despite that, they could scarcely be more different.",
    "Samsung’s phone is bigger than Apple’s at 164.8 x 77.2 x 8.1mm and 208g. The iPhone 12 Pro measures 146.7 x 71.5 x 7.4mm and 189g. This size difference isn’t a massive surprise, and the iPhone 12 Pro Max is really more of a direct competitor, but we’ve handled that elsewhere.",
    "In terms of looks, the Galaxy Note 20 Ultra is far curvier, with a display and a rear section that appear to melt into an almost non-existent side frame. That frame expands into a flat top and bottom.",
    "Apple does a lot more than hint at flatness with the iPhone 12 Pro. Everywhere you look there are angles and perfectly symmetrical surfaces. It’s a welcome return to the days of the iPhone 5, though it does make the iPhone 12 Pro a little less comfortable to hold in the hand than the Samsung Galaxy Note 20 Ultra.",
    "Samsung’s phone looks particularly stunning in its Mystic Bronze variant, which continues to be the best take on gold(ish) we’ve seen in a phone - probably because it’s more bronze than gold. Conversely, the iPhone 12 Pro’s Silver, Graphite, Gold, and Pacific Blue lack the same iconic appeal.",
    "One rare common point here is that both phones use shiny stainless steel for their frames, which is much more premium (not to mention tough) than the usual aluminum.",
    "The iPhone 12 Pro fits a unique Ceramic Shield to its flat front, which purportedly adds a four-fold increase in drop protection over your typical display glass. The Galaxy Note 20 Ultra goes with the more off-the-shelf (but still very tough) option of Gorilla Glass Victus.",
    "There’s no getting away from it - the Samsung Galaxy Note 20’s huge camera module sticks out an awful lot. But while this leads to more snaggages and table wobbles than the iPhone 12 Pro’s relatively petite module, Samsung has successfully made a feature of it.",
    "We should also mention the two distinct approaches to selfie cameras. While Apple goes all in with a widow’s peak-shaped notch, Samsung’s central hole punch camera is far more discreet. Of course, that’s because Apple has implemented Face ID for properly secure facial recognition.",
    "Samsung, on the other hand, gives you a more COVID-friendly, but also more sluggish ultrasonic in-display fingerprint sensor. Apple’s is more convenient and reliable, right up until you go out with a mask on.",
    "It’s no secret that Samsung supplies most of the AMOLED displays to the smartphone industry - including to Apple itself.",
    "You shouldn’t be remotely surprised, then, when we state unequivocally that the Samsung Galaxy Note 20 wins the display round. It’s bigger, sharper, brighter, and potentially faster.",
    "Let’s break that last sentence down. The Galaxy Note 20 Ultra has a 6.9-inch OLED compared to the iPhone 12 Pro’s 6.1-inch OLED.",
    "The larger display can go up to a 1440 x 3088 (aka QHD) resolution compared to the iPhone’s 1170 x 2532. And peak brightness is 1,200 nits for the iPhone 12 Pro and 1,500 nits for the Samsung Galaxy Note 20 Ultra.",
    "It’s on refresh rate that real damage is done here. While the Galaxy Note 20 Ultra can go all the way up to 120Hz, the iPhone 12 Pro is stuck at a none-too-pro 60Hz.",
    "There’s a caveat here, in that the Samsung can’t maintain 120Hz and a QHD resolution simultaneously. But at least it offers you the option.",
    "We do appreciate the fact that the iPhone 12 Pro’s screen (which, let’s be clear, is still excellent) is perfectly flat. Samsung has lessened the curvature of its own displays in recent years, but there’s still a slightly distorted effect to the left and right edges of the Galaxy Note 20 Ultra, meaning you don’t get a perfect picture with landscape video content and the like.",
    "Both of these phones made our recently-revised list of the best camera phones on the market, which tells you a lot about their enduring quality. But not everything.",
    "Both are triple camera offerings that eschew gimmicky stat-bolstering sensors for the holy trinity of wide, ultra-wide, and telephoto. But that’s just about where the similarities end.",
    "The Samsung Galaxy Note 20 Ultra (number four in the rankings, since you’re asking) offers a huge 1/1.33\" 108MP wide sensor that’s capable of capturing suitably crisp, bright shots.",
    "But it’s the 12MP telephoto sensor that really sings here. This includes a periscope lens that can produce 5x optically zoomed shots, and up to 50x hybrid zoom shots. Ignore that fanciful claim though, as such shots are unusable. What’s really impressive is the potential for decent 10x hybrid shots.",
    "The iPhone 12 Pro (number seven on the list) can’t get close on the telephoto front, with a rather underwhelming (though still crisp) 12MP 2x telephoto.",
    "But we’d possibly take the iPhone’s main sensor for general shooting. It’s ‘only’ 12MP, and it’s physically much smaller than the Galaxy Note 20 Ultra’s. But Apple’s algorithms are much more advanced than Samsung’s and its color science is more natural-looking.",
    "Apple’s software is the most advanced in the business, and this time around it adds the likes of Smart HDR 3 and Deep Fusion for better shot selection and superior contrast. The ProRAW function, meanwhile, takes the info-dense RAW format that pros use and applies the computational benefits of the JPEG format.",
    "Apple’s still the video king, too. While the iPhone 12 Pro only supports up to 4K video at 60fps next to the Galaxy Note 20 Ultra’s 8K/24fps, Apple’s footage still looks better.",
    "Overall we’d give the Galaxy Note 20 Ultra camera the edge for its greater flexibility - that telephoto really adds something unique to the package - but there’s a case to be made for the iPhone 12 Pro as the superior point and shoot machine.",
    "Samsung has eked out a lead in a few areas at this point. But the iPhone 12 Pro absolutely hammers the Samsung Galaxy Note 20 Ultra when it comes to raw performance.",
    "Apple is simply streets ahead of the competition with its own A-series of mobile processors, and the A14 Bionic that powers the iPhone 12 Pro is its current champ.",
    "Samsung, by contrast, is slightly behind the packs with its own custom Exynos chips. And it’s one of these that powers most Samsung Galaxy Note 20 Ultra models.",
    "The Exynos 990 is the chip of choice for the global model, with only US and China models getting the superior Qualcomm Snapdragon 865 Plus. The Samsung would appear to hit back with double the RAM (12GB vs 6GB), but that really doesn’t mean an awful lot considering the core differences between iOS and Android.",
    "Ultimately, the A14 Bionic scores much higher on all the benchmarks. In the CPU-focused Geekbench 5, the iPhone 12 Pro attain around 4100 for multi-core and 1600 for single-core.",
    "Contrast that with the global Galaxy Note 20 Ultra, which scores around 2748 and 900 respectively, and it’s not even close. The Snapdragon 865 Plus model does better, but still nowhere near as well as the iPhone 12 Pro.",
    "It’s a similar story on the GPU front, where’s Apple’s silicon is far more adept at chucking about polygons and fancy lighting effects than either Samsung’s or Qualcomm’s.",
    "In practice, this huge performance gap doesn’t manifest itself all that much, if at all. No current app or game will test either device, and general tasks like app switching and jumping into the camera from sleep are super fluid on both. Indeed, the Galaxy Note 20 Ultra may actually feel faster in some respects, thanks to that 120Hz refresh rate.",
    "But this is still a big win for the iPhone 12 Pro, because it’s a far more future-proof device. If history teaches us anything, it’s that Apple’s current champ will feel faster for longer - partly due to that hardware advantage, and partly because Apple supports its older devices much better than Samsung does.",
    "Indeed, software in general is another area in which Apple has a number of advantages. You’re getting the full unified Apple experience here, whereas the Galaxy Note 20 Ultra gives you Samsung’s take on Google’s core Android software.",
    "That custom OneUI interface is way more customizable than iOS 14, but it’s also more cluttered and full of bloatware.",
    "Going back to hardware, both phones give you a choice of 128GB, 256GB, or 512GB of storage. But only the Galaxy Note 20 Ultra will give you the potential of microSD expansion on top of that.",
    "Another hardware advantage of the Samsung is its built-in S Pen stylus. This is very much down to personal preference, but if you prefer to use a finely tuned digital pen to jot notes down, navigate, or even draw pictures with, then there’s only one choice.",
    "Both phones support 15W wireless charging.",
    "If we were purely rating this section on the size of the batteries, then the Samsung Galaxy Note 20 Ultra would win hands down. Its 4500 mAh cell dwarfs the iPhone 12 Pro’s 2815 mAh equivalent.",
    "But the iPhone 12 Pro’s hardware is much less demanding, with a smaller, dimmer, less sharp and less fluid display and a superior processor. And iOS is generally more energy efficient than Android too.",
    "Sure enough, with light use, we could easily get the iPhone 12 Pro through to midnight with more than half the battery remaining. It’s a potential two-dayer if your usage is light and you remain on a stable Wi-Fi connection.",
    "Not that its battery life is particularly good. It’s just good at being on standby. Crank up for screen on time and move between mobile networks (including 5G), and that percentage will plummet. When out and about, you can expect to lose between 10–15% per hour, even if the phone isn’t in constant use.",
    "The Samsung Galaxy Note 20 Ultra isn’t too hot either, though. It’ll still get you through a full day of moderate to heavy usage, but will leave you with only about 20% in the tank. Given the size of the phone, we’d hope for more.",
    "Recharging is equally underwhelming for both phones. The iPhone doesn’t even give you a power brick - you’ll need to buy your own, and even then it’ll only support up to 20W wired. The Galaxy Note 20 Ultra actually includes a 25W wired charging, but it lags well behind other competitors.",
    "While we scored the Galaxy Note 20 Ultra higher than the iPhone 12 Pro in our initial review, the gap has arguably narrowed in the intervening months.",
    "Both of these phones have aged well, and both are currently the second-tier flagship offerings within their respective ranges. We wouldn’t have any hesitation in recommending a purchase aside from the fact that both will be directly replaced in the latter half of 2021.",
    "But on that latter front, the iPhone 12 Pro takes a slight edge in terms of ongoing software support. Apple is much better than Samsung at this, and the iPhone’s superior performance also pays into this forward-looking.",
    "Aside from performance, though, the Galaxy S20 Ultra wins in a couple of key areas. It’s display is much better in virtually every way, and its camera proves more flexible thanks to an excellent zoom facility - even though the iPhone 12 Pro remains formidable in point and shoot and video capture scenarios.",
    "We’d give the Galaxy Note 20 Ultra the edge here, but ultimately it could come down to matters of personal preference in terms of ecosystem loyalty, device size, and even Samsung’s S Pen stylus."
  ],
  "headers": {
    "3": "iPhone 12 Pro vs Samsung Galaxy Note 20 Ultra price and availability",
    "6": "Design",
    "16": "Display",
    "23": "Cameras",
    "32": "Specs and performance",
    "45": "Battery life",
    "52": "Takeaway"
  },
  "links": {
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Samsung Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 5": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5-1096004/review",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone"
  }
}