{
  "source": "https://www.techradar.com/news/nikon-denies-its-z-mount-lenses-have-been-hit-by-major-delays",
  "title": "Nikon denies its Z-mount lenses have been hit by major delays",
  "category": "cameras",
  "updated": "2021-05-11T16:57:37Z",
  "author": "mark-wilson",
  "summary": "Mirrorless lenses still on track, Nikon reassures fans",
  "article": [
    "It's been an extremely quiet start to the year for Nikon, but the camera giant has hit back at growing rumors that its new Z-mount lenses have been delayed.",
    "So far in 2021, Nikon has only made a single development announcement for its Nikon Z9 mirrorless flagship – with no news at all on the several long-awaited lenses in its Z-mount roadmap.",
    "This had led to growing speculation, from the likes of Nikon Rumors, that a planned launch for some of these lenses has been pushed back. The site claims that \"Nikon was supposed to release several new Nikkor Z lenses in April, but the announcement was postponed\", with the reason apparently being that \"Nikon is now concentrated mainly on the Z9\".",
    "We asked Nikon if it's true that there have been delays to its Z-mount release schedule, and it told us in no uncertain terms that \"there is no such delay\".",
    "We then followed up by asking Nikon if, as reported by the Japanese website Nikkei last month, it was still planning to release 12 new Z-mount lenses by the end of this financial year (which ends in March 2022).",
    "It confirmed to us: \"We are planning on expanding the Nikkor Z lens lineup to approximately 30 lenses by the end of the fiscal year 2021\".",
    "Despite that \"approximately\" qualifier, this will offer some mild reassurance to owners of Nikon mirrorless cameras, who last saw a new lens announced almost exactly eight months ago in September 2020.",
    "But Nikon will need to get a move on and it seems likely that, at some point, we're going to see a big splash of new Z-mount lens announcements – possibly to tie in with the full announcement of the Nikon Z9.",
    "To be fair to Nikon, it hasn't reneged on any promises for its Nikon Z lens roadmap yet. The most recent version of the roadmap targets \"a total of 27 amazing lenses and two teleconverters\" being available by the end of 2022.",
    "The frustration for Nikon mirrorless camera owners is the speed of that rollout, particularly compared to Canon and Sony. Canon recently announced two pro-level RF telephoto lenses for its mirrorless cameras, alongside the system's first true macro lens.",
    "Sony, meanwhile, has by far the largest collection of native lenses for its full-frame mirrorless cameras, having had a significant headstart, and has recently been on a spree of announcing exciting primes that aren't even in Nikon's roadmap yet.",
    "But the picture also isn't quite as simple as a race to big numbers. Nikon owners have long been prepared to trade lightning-fast development for the sheer quality of its lenses. Also, there is a difference between a company announcing lenses and being able to buy them.",
    "For example, if we compare the availability of mirrorless lenses for the Canon RF mount and Nikon's Z mount in their official UK stores, there isn't much difference. In Canon's store, from a total of 20 RF lenses, only ten are in stock. Likewise, from a total of 16 Z-mount lenses in the Nikon store, you can again only buy ten of them.",
    "Your level of frustration with Nikon is likely to vary depending on the kind of photographer you are – and the recent spike in rumors and concern around Nikon's Z-mount is likely borne out of the lack of news around its pro-level offerings.",
    "Right now, the Nikon Z system doesn't have any native lenses with a focal length over 200mm or any macro options. These options are prized by wildlife and landscape photographers, who will currently need to use the FTZ adaptor to use Nikon's older F-mount lenses for cameras like the Nikon Z7 II.",
    "That's perfectly acceptable as a stop-gap, but the promise of the new Z-mount – and the reason many have moved from Nikon DSLRs to mirrorless cameras – is the promise of next-level optics, thanks to the new mount's design.",
    "Photographers also tend to see lens announcements as a marker of the health and longevity of the system they've bought into – even if they don't ultimately end up buying those higher-end jewels in the Z-mount's crown.",
    "Nikon insists that much-anticipated offerings like the Nikon Z 100-400mm and 200-400mm are en route and haven't been delayed, but it looks increasingly like they won't be available to buy until later this year. Still, if Nikon fans can hold on a little longer – or if Nikon can sate them with a 'development announcement' – they may well find they're worth the wait."
  ],
  "headers": {
    "8": "Analysis: Pro Nikon shooters hungry for lens news"
  },
  "links": {
    "Nikon Z9": "https://www.techradar.com/reviews/nikon-z9",
    "Nikon Rumors": "https://nikonrumors.com/2021/05/02/nikon-is-asleep-again.aspx/",
    "Nikkei": "https://www.nikkei.com/article/DGXZQOGD16CGP0W1A310C2000000/",
    "first true macro lens": "https://www.techradar.com/news/canons-eos-r-mirrorless-camera-range-gets-its-first-true-macro-lens",
    "spree of announcing exciting primes": "https://www.techradar.com/news/sony-launches-widest-ever-prime-lens-for-its-full-frame-cameras",
    "Nikon Z7 II": "https://www.techradar.com/reviews/nikon-z7-ii"
  }
}