{
  "source": "https://www.techradar.com/news/iphone-13-sounds-likely-to-bring-back-magsafe-and-hopefully-with-few-changes",
  "title": "iPhone 13 sounds likely to bring back MagSafe, and hopefully with few changes",
  "category": "phones",
  "updated": "2021-09-07T09:00:43Z",
  "author": "tom-bedford",
  "summary": "iPhone 12's feature is back",
  "article": [
    "One of the big new features of the iPhone 12 range was MagSafe, which let you clip wireless chargers and other accessories to the back of the phone using magnets, and it sounds like the iPhone 13 could use this feature too.",
    "We say this because, as spotted by Twitter user Dave Zatz, certification for a new MagSafe charger has been found in the database of the US' Federal Communications Commission. We often see new tech certified here just before launch.",
    "This charger is presumably the cable that would connect the MagSafe pad to a charging block - the listing doesn't present much new information, but its presence here at all is the interesting point.",
    "The fact that Apple is certifying a new version of its MagSafe cable, this close to the iPhone 13 launch, suggests this is an updated iteration of the tech with some improvements. Perhaps it's faster, allowing MagSafe to power the iPhone 13 at a greater speed - at the very least, the company presumably wouldn't be certifying new MagSafe products if the tech wasn't coming to the newer iPhones.",
    "While the FCC certification doesn't include much information on the iPhone 13's MagSafe, it seems very likely that it'll operate in a similar way to the iPhone 12's. In fact, we'd imagine it works exactly the same way.",
    "It would make sense for Apple to use the same MagSafe, as it would stop the company having to make specific products for each iPhone - if it could make one wireless charger that works on both phones, it would save it having to produce marginally-different gadgets.",
    "This would also be great for iPhone fans, as anyone upgrading from an iPhone 12 to an iPhone 13 will be able to hang onto their magnet peripherals.",
    "There might be new, iPhone 13-specific MagSafe accessories of course. Zatz notes in a follow-up tweet that, according to another listing, it seems the AirPods could get a MagSafe case so you can wirelessly charge them from your phone.",
    "Either way, it's good to see Apple isn't abandoning this tech after one use - especially since Android manufacturers like Realme and Oppo are starting to use similar alternatives - especially if the accessories can be used on all phones."
  ],
  "headers": {
    "4": "Analysis: probably no MagSafe changes"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Dave Zatz": "https://twitter.com/davezatz/status/1434920116551131147",
    "tweet": "https://twitter.com/davezatz/status/1434955211055972355"
  }
}