{
  "source": "https://www.techradar.com/news/cheap-sonos-deals",
  "title": "The cheapest Sonos deals and sales for December 2021",
  "category": "audio-visual",
  "updated": "2021-12-01T14:09:31Z",
  "author": "mackenzie-frazier",
  "summary": "Here are the best cheap Sonos deals today",
  "article": [
    "Building a Sonos multi-room music system for your home could be very pricey, so to help you and your wallet, we've rounded up the best Sonos deals and sales that are available online.",
    "Sonos speaker systems offer a broad range of wireless connectivity options to get your music pumping throughout your home, tapping into your personal collection of MP3s as well as streaming services like Spotify and Apple Music. From soundbars to subwoofers, there are Sonos speakers for all occasions – though if you don't pick them up within sales seasons, be prepared for premium pricing.",
    "We have hot deals for the whole line-up, including not just the Sonos One, Play:3, and Play:5 but also the Sonos Playbar, Sub, Sonos Beam, Sonos Playbase and Connect as well.",
    "Good deals are subjective, obviously. But if we were in your shoes, we’d wait for at least a $50/£35/AU$75-off sale. These happen around the holidays, mostly, but do happen sporadically throughout the year as well.",
    "If you’re looking for a recommendation, your best bet is to start your Sonos system with a Play:5, the big brother of the bunch, and work your way down. We also have a soft spot in our heart for the Playbar (it’s on our best soundbar list, after all) and a Play One is a great pick for kitchens, bedrooms and studies.",
    "If you want the latest and greatest from Sonos, check out the brand-new Sonos Playbase – it's a speaker and TV stand all in one package. OK, without further ado, here are the best Sonos deals we’ve found today.",
    "Sonos and Alexa, Amazon's smart personal assistant, are a perfect match for one another - it's almost a wonder it's taken this long for the two of them to meet. Regardless, the Sonos One is here now and it combines the best of both worlds. The One is able to call upon Alexa to answer basic inquiries, adjust appointments on your calendar and, for Amazon Prime members, voice access to Amazon's expansive Music Unlimited library.",
    "Read our full review: Sonos One",
    "It was a long time coming, but the Sonos Beam was finally a Sonos soundbar worth waiting for. With a design small enough to match most TVs, it's equipped with smart features, innovation and exquisite sound that impresses. There are a few issues worth pointing out (the lack of Dolby Atmos at the price disappoints), but the way the speaker fits in with the rest of the Sonos eco-system makes it a must-have for those that have invested in other Sonos devices.",
    "Providing you've got a HDMI-ARC compatible TV (which most modern ones are) it's easy to set-up and, if you've got other compatible Sonos speakers, it's a simple way to get wireless surround sound for your movies, too.",
    "Read our review: Sonos Beam",
    "The Sonos Play:1 is the alpha in Sonos' alphabet. It's not the most powerful of the bunch, but it definitely knows how to get the job done. It's 6.36 x 4.69 x 4.69 inches (161.45 x 119.7 x 119.7 mm) and 4.08 lbs (1.85 kg) but it can really kick. It comes in two colors – white with light metallic grille and black with graphite grille – and works with standard wall mounts and speaker stands. We love how easy it is to setup and its awesome sound quality, but thought that its low end could use a bit of oomph. Still, if you're looking to start a Sonos system without spending a lot, the Sonos Play:1 is the place to start.",
    "Read our review: Sonos Play:1",
    "The Sonos Play:3 is the middle child of the bunch. It's more powerful than the puny Play:1, but doesn't have the same room-filling audio that you get from the Play:5. For some people, though, it's just right. So how big is it? The Play:3 is 5.2 x 10.6 x 6.3 inches (132 x 268 x 160 mm) and weighs 5.71 lbs. (2.6 kg). It comes in two colors – white with light metallic grille and black with graphite grille – and works with standard wall mounts and speaker stands. It has three Class-D amplifiers, one tweeter, two mid-woofers and a bass radiator. Again, here you'll find great audio quality and a pretty easy setup.",
    "Read our review: Sonos Play: 3",
    "Here it is, the grand kahuna of the Sonos systems. The Sonos Play:5 is everything you can want in a network speaker. It gets loud, but also sounds crystal clear at top volumes. It's obviously a bigger than its brethren, however, so keep that in mind before you try stuffing one into a one-room apartment. So how big is it? It's 8.03 x 14.33 x 6.06 inches (203 x 364 x 154 mm) and weighs 14 lbs. (6.36 kg). It comes in two colors – white or black matte enclosure with graphite grille – and contains two built-in microphones that can tune it for your space. Unlike the Play:3 it has five Class-D amplifiers, three tweeters, three mid-woofers and a phased speaker array that separates sound into its three channels – left, right and center. Good sound doesn't come cheap, but once you hear a Sonos Play:5 speaker you won't want anything else.",
    "Read our review: Sonos Play:5",
    "TVs might look great, but most of them definitely don't sound all that good. That's why Sonos made the Playbar, a soundbar that can produce top-tier audio quality while simultaneously syncing up to your other multi-room speakers. It's definitely expensive, no doubt about it, but there's no other soundbar this well-connected. Here are some specs: First off, it's 3.35 x 35.43 x 5.51 inches (85 x 900 x 140 mm) and weighs 11.9 lbs. (5.4kg). It only comes in one color and requires a separate mounting kit if you want to mount it beneath your screen. Unlike the Play:5, it has nine Class-D amplifiers, three tweeters and six mid-woofers – that can put out a ton of noise.",
    "Read our review: Sonos Playbar",
    "Three years after the company released its first ever soundbar, the Playbar, Sonos has created the Playbase, a unique form factor sound system that combines a stable pedestal for your TV with an audio cabinet.",
    "Why did Sonos create a second home entertainment device? The team did extensive research into how people used their Playbar at home and found that most people didn’t wall mount their televisions or Playbars. To that end, the Playbase was created to allow people to set their televisions right on top of the speaker, allowing for a compact home theater solution.",
    "Overall, the Sonos Playbase is a good-sounding speaker for those who don’t want to fumble with a surround sound system or simply don’t have the room for one. There’s no need for a receiver, making it truly plug-and-play. Sonos’ philosophy of making music enjoyment as frictionless as possible continues with the Playbase – the Sonos app is easy to use and the integrated universal search across music services is something we wished every speaker had.",
    "Read our review: Sonos Playbase",
    "Sonos systems are great. Like seriously great. We want to call them perfect, and yet without some sort of low-end support they just aren't. For that you need the Sonos Sub, the additional audio piece that adds a hefty amount of bass to your favorite music genres. The design here is a bit funky, we'll admit, but hey, if you were looking for a conversation starter (and ender) at your next house party, this is it. That said, it's 15.3 x 15.8 x 6.2 inches (389 x 402 x 158 mm) and weighs 36.3 lbs (16 kg). It's available in two colors – premium white gloss and premium black gloss – that can match either your Playbar or Play:5 speaker. Inside you'll find two Class-D amplifiers, two force-cancelling speaker drivers and dual acoustic ports that help the Sub reach a low frequency of about 25Hz.",
    "Read our hands on review: Sonos Sub",
    "There's nothing wrong with your old audio equipment. You've invested years in setting up and tuning your system, and there's no reason to let any of that go to waste. For anyone interested in keeping the equipment they already own but add on a streaming or mutil-room audio component, Sonos Connect is your solution. While it's not exactly a player in its own right, Sonos Connect allows you to send or receive audio streams. That means you can hook it up to your receiver to send out your favorite CD over the airwaves in your home, or set it up with your old floor speakers to bring them into the 21st century."
  ],
  "headers": {
    "3": "So what’s a good deal for Sonos speakers?"
  },
  "links": {
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Sonos Playbar": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-playbar-1130807/review",
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Sonos Playbase": "https://www.techradar.com/reviews/sonos-playbase",
    "other compatible Sonos speakers": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2124299045682759700&xs=1&url=https%3A%2F%2Fsupport.sonos.com%2Fs%2Farticle%2F2927%3Flanguage%3Den_US&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcheap-sonos-deals",
    "Sonos Play:1": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-play1-1189345/review",
    "Sonos Play: 3": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/sonos-play3-985120/review",
    "Sonos Play:5": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/sonos-play5-657133/review",
    "Sonos Sub": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-sub-1082735/review"
  }
}