{
  "source": "https://www.techradar.com/news/intel-rocket-lake-leak-suggests-core-i9-11900k-could-get-a-price-cut-to-compete-with-amd",
  "title": "Intel Rocket Lake leak suggests Core i9-11900K could get a price cut to compete with AMD",
  "category": "computing",
  "updated": "2021-01-18T11:17:24Z",
  "author": "darren-allan",
  "summary": "The 11900K could be cheaper than Intel’s Comet Lake flagship",
  "article": [
    "Intel’s next-generation Rocket Lake processors are likely to arrive in March, with pricing for the range just having been leaked by a European retailer.",
    "Now, we should make it clear upfront that we need a major helping of condiments with this one, as the retailer in question from Belgium isn’t one we’re familiar with.",
    "Still, with Rocket Lake now close, and other price leakage having popped up in recent times as Notebookcheck highlights, it’s certainly worth a glance at how the purported pricing is shaping up – particularly in this latest case with the product listings from 2compute.",
    "The interesting point here is that the flagship 8-core Rocket Lake CPU, the Core i9-11900K, will supposedly be cheaper than the 10900K, the existing (Comet Lake) flagship.",
    "According to 2compute, the 11900K will be priced at €605, compared to €664 for the 10900K. There is little point converting those prices into dollars or pounds, especially as this is just rumored pricing anyway, but the gist of it is that the 11900K could theoretically pitch up at around 10% cheaper. Major dose of salt here, as mentioned, of course…",
    "Could Intel actually make the new flagship more affordable in reality? Well, it would certainly give the company another point of attack against AMD Ryzen 5000 chips. And you could argue that it’s an 8-core chip compared to a 10-core Comet Lake flagship, too; so it’s not going to threaten the latter’s multi-core performance.",
    "However, Intel isn’t exactly known for making its premium CPUs more affordable…",
    "Another way of looking at this is that the 11900K is priced at almost exactly the same level as the Ryzen 5800X going by the Belgian retailer’s listings, AMD’s strong 8-core offering which has a recommended price of $449. For reference, the 10900K can be had for around $520 in the US right now, by the way (the recommended price, though, is $499).",
    "Of course, don’t read too much into all this, but it’s certainly interesting to get indications of where Intel might be pitching things. Some other European price leaks, as the Notebookcheck report points out, have suggested that the 11900K will be around 10% more expensive than 2compute believes – so that would indicate pricing being roughly maintained from the last-generation flagship.",
    "The general consensus, then, seems to be either keeping the pricing status quo, or notching things down slightly – at least with the Rocket Lake flagship.",
    "As to the rest of the 11th-gen range, going by 2compute’s leaked pricing, the 11700K could theoretically be pitched at around 10% more expensive than the 10700K, so is heading in the other direction than the flagship. The Core i5-11400 will also seemingly be a bit more expensive than the 10400, although by slightly less (more like 6%).",
    "It’s something of a varied picture when it comes to price movements within the overall range, then, but again, it’s worth underlining that we must obviously be very cautious around any leaked pre-release pricing."
  ],
  "headers": {
    "8": "Varied picture"
  },
  "links": {
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "likely to arrive in March": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "Notebookcheck": "https://www.notebookcheck.net/Intel-Rocket-Lake-S-price-leak-indicates-Core-i9-11900K-to-be-10-cheaper-than-Core-i9-10900K-and-close-to-Ryzen-7-5800X-but-lack-of-MSRP-info-makes-pricing-comparisons-difficult.515478.0.html",
    "AMD Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "strong 8-core offering": "https://www.techradar.com/reviews/amd-ryzen-7-5800x"
  }
}