{
  "source": "https://www.techradar.com/news/death-stranding-developer-hideo-kojima-reportedly-working-on-new-xbox-game",
  "title": "Death Stranding developer Hideo Kojima reportedly working on new Xbox game",
  "category": "gaming",
  "updated": "2021-04-08T18:27:36Z",
  "author": "samuel-tolbert",
  "summary": "The deal has been in discussion for weeks, apparently",
  "article": [
    "Hideo Kojima is an incredibly well-known name in gaming. He's been responsible for the Metal Gear franchise and after splitting from Konami in 2015, working on Death Stranding in collaboration with Sony and PlayStation. Now, it seems like he might be working on an Xbox title.",
    "Jeff Grubb at VentureBeat reports that Microsoft is currently in discussions with Kojima to publish his next game. Grubb elaborates that he's not sure if this deal has yet been signed but that discussions are absolutely taking place.",
    "If this is the case, it seems like it would be an Xbox Global Publishing deal, meaning Kojima's next game might be exclusive to Xbox Series X, Xbox Series S and PC. It would also almost certainly be a new IP, since Sony and Konami own Death Stranding and Metal Gear Solid, respectively.",
    "The timing of this is interesting, as Kojima Productions studio art director Yoji Shinkawa recently hinted that the studio's next game would be announced in the near future. “Well yeah, I am doing something, for sure, and I could tell you probably that we can announce it quite soon,” he said.",
    "If this game really is Xbox exclusive, it'll be interesting to see what genre Kojima Productions is going for, whether it's survival-horror or building on the social online connection aspects explored in Death Stranding.",
    "Compounding this situation is a conspiracy theory that erupted yesterday with the reveal of the PS5 exclusive survival game Abandoned. People on Twitter and forums like Resetera noted a lack of information about the studio and became convinced it was secretly a Kojima game, to the point the developers at Blue Box Game Studios put out a statement squashing the rumors."
  ],
  "headers": {
    "3": "Just what could it be?"
  },
  "links": {
    "Death Stranding": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "VentureBeat": "https://venturebeat.com/2021/04/07/abandoned-for-ps5-is-not-a-secret-hideo-kojima-game/",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "recently hinted": "https://www.techradar.com/news/death-stranding-developer-teases-new-game-announcement",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "statement": "https://www.blueboxgamestudios.com/hideokojimarumors.html"
  }
}