{
  "source": "https://www.techradar.com/news/the-next-google-pixelbook-could-be-a-long-time-coming",
  "title": "The next Google Pixelbook could be a long time coming",
  "category": "computing",
  "updated": "2021-11-14T17:00:32Z",
  "author": "david-nield",
  "summary": "No launches planned for 2022",
  "article": [
    "Pixelbooks are to laptops what Pixels are to phones: flagship devices made by Google to show off its software (in the case of the Pixelbook, Chrome OS). However, it doesn't look as though we're going to get a successor to the 2019 Pixelbook Go anytime soon.",
    "As reported by Trusted Reviews, the Retail Partner Manager for Chromebooks at Google, Chrys Tsolaki, said the following in response to a question about a new Pixelbook laptop: \"Next year [2022] there won't be anything coming. In the future, I don't know.\"",
    "That doesn't sound overly promising to our ears – you would think Tsolaki knows how the land lies in the Pixelbook division at Google, and it seems we're not going to get any more Chromebooks from Google until 2023 at the earliest.",
    "Google has put its own Tensor chipset in the latest Pixel 6 and Pixel 6 Pro smartphones, and the rumor was that a similar sort of processor was being developed for an upcoming Chromebook as well – which sounds plausible enough.",
    "Indeed, one leaker posted Pixelbook 2 renders back in September, revealing a colorful Chromebook that was slated to replace the Pixelbook 2 (and come running the Tensor chip). It would seem that the device, if it was ever real, has either been ditched or pushed back until 2023.",
    "Last year code spotted in Chrome OS hinted that another Pixelbook is in the pipeline as well, one with support for a 4K screen and USB 4. If that Chromebook is still going to be unveiled at some point, it sounds as though it's going to be a premium-level product.",
    "Google got the ball rolling with its own-brand Chromebooks in 2013 with the ultra-premium Chromebook Pixel. That was followed by the Chromebook Pixel 2, which was similar to its predecessor in terms of design and price.",
    "The first Google Pixelbook showed up in 2017, offering something that was a bit more affordable and a bit more rudimentary in terms of its design compared to the Chromebook Pixels. It earned a lot of admiring reviews, but the laptop was still expensive relative to other Chromebooks on the market.",
    "With the Pixelbook Go in 2019, Google managed to blend excellent build quality and decent specs with a significantly cheaper price than the 2017 model – and again the reviews were very favorable. The Pixelbook Go is still on sale, but it's starting to show its age in terms of its design and specs.",
    "We've been huge fans of these devices down the years – and while there are plenty of other very good Chromebooks from other manufacturers – we're hoping that Google gets around to making another Pixelbook sooner rather than later."
  ],
  "headers": {
    "3": "The rumors so far",
    "6": "Opinion: we need another Pixelbook please"
  },
  "links": {
    "Pixelbook Go": "https://www.techradar.com/reviews/google-pixelbook-go-review",
    "Trusted Reviews": "https://www.trustedreviews.com/news/google-confirms-it-wont-launch-a-new-pixelbook-in-2022-4178747",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "posted Pixelbook 2 renders": "https://twitter.com/AppleLe257/status/1441247534282797061",
    "code spotted": "https://www.techradar.com/news/another-google-pixelbook-could-be-on-the-way-very-soon",
    "Chromebook Pixel": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/chromebook-pixel-1132911/review",
    "Chromebook Pixel 2": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/chromebook-pixel-2015-1289817/review",
    "Google Pixelbook": "https://www.techradar.com/reviews/google-pixelbook",
    "other very good Chromebooks": "https://www.techradar.com/reviews/samsung-galaxy-chromebook-2"
  }
}