{
  "source": "https://www.techradar.com/news/amazon-is-buying-james-bond-studio-mgm",
  "title": "Amazon has bought James Bond studio MGM",
  "category": "entertainment",
  "updated": "2021-05-26T13:46:09Z",
  "author": "samuel-roberts",
  "summary": "Amazon Prime is set to get a major content boost",
  "article": [
    "Amazon has confirmed its acquisition of MGM – the parent company of the James Bond series – for a fee thought to be in the region of $8.45 billion. The studio, which has a long and storied history in the world of cinema, also owns franchises including the Rocky movies.",
    "That's per Variety, and a deal has been rumored for a little while now. In total, THR reports that MGM has a library of more than 4,000 movies and 17,000 hours of TV, so the acquisition should offer a massive boost to Amazon Prime's library of content.",
    "MGM shares the rights to James Bond with Eon Productions, and Variety notes that this means it's unlikely Amazon will be able to do anything as bold as launch the next Bond movie on its streaming service in lieu of a theatrical release. Still, in terms of a back catalog of content and properties, it's a big deal for Amazon.",
    "\"The real financial value behind this deal is the treasure trove of [intellectual property] in the deep catalog that we plan to reimagine and develop together with MGM’s talented team,\" says Amazon's Mike Hopkins.",
    "Movies mentioned by Amazon in the announcement reportedly include Rocky, Poltergeist, Silence of the Lambs, Robocop and The Magnificent Seven – giving you an idea of the sort of content you're likely to see get a permanent home on the streamer. MGM also makes shows including Fargo, The Handmaid's Tale and Vikings.",
    "James Bond is a key part of this, too – Variety notes that Amazon is \"anticipating\" being able to use properties like Bond, Pink Panther and Rocky for new originals.",
    "Amazon is committed to preserving MGM's history and making its catalog of titles available to customers, which seems like a good thing. While Amazon Prime has made some big swings when it comes to originals, creating popular series like The Boys and The Marvelous Mrs Maisel that show it's a major player in streaming, this deal gives it the kind of scale it needs to compete with Netflix – not to mention a library of content that can tempt potential subscribers.",
    "Media consolidation is hardly something to get excited about generally. But in this case, Amazon Prime Video is already a decent-value service considering that it's combined with a number of other benefits for members – this should only result in more and better content on the platform, and perhaps a faster turnaround for movies from their theatrical releases to their streaming debut."
  ],
  "headers": {
    "6": "Analysis: Amazon Prime now has a war chest to take on Netflix"
  },
  "links": {
    "Variety": "https://variety.com/2021/digital/news/amazon-buys-mgm-studio-behind-james-bond-for-8-45-billion-1234980526/",
    "THR": "https://www.hollywoodreporter.com/business/business-news/mgm-sold-to-amazon-deal-4075596/",
    "James Bond": "https://www.techradar.com/how-to/how-to-watch-the-james-bond-movies-in-order",
    "The Boys": "https://www.techradar.com/news/the-boys-season-3"
  }
}