{
  "source": "https://www.techradar.com/news/iphone-13-pro-max-can-charge-faster-than-apple-says-it-can",
  "title": "iPhone 13 Pro Max can charge faster than Apple says it can",
  "category": "phones",
  "updated": "2021-10-04T09:57:54Z",
  "author": "james-peckham",
  "summary": "Higher than 20W",
  "article": [
    "Apple advertises its new iPhone 13 series with 20W fast charging, but a new report has shown some models can hit higher speeds of up to 27W if you're using a different charger than the one Apple readily recommends.",
    "Testing undertaken by ChargerLAB shows that if you're using a 30W or higher charger the iPhone 13 Pro Max can hit maximum speeds of 27W. It also found the iPhone 13 Pro can hit a peak of 23W.",
    "ChargerLAB hasn't undertaken any research on the standard iPhone 13 or iPhone 13 mini, but a report on Chinese social network Weibo that ran a similar test found it was able to hit 21W on the standard iPhone 13.",
    "These handsets don't sustain that high speed charging for the entire cycle though, and you'll find each phone will both rise and dip over the period where you have it on charge.",
    "Previous iPhones have also broken the 20W charging, with the iPhone 12 Pro Max able to hit a high of 22W. Something has clearly changed here for the iPhone 13 Pro Max to hit a much higher speed as its maximum power.",
    "Apple does sell a 30W charger, or there are third-party alternatives, if you want to hit this maximum charging speed on your iPhone 13 Pro or iPhone 13 Pro Max. This may have an impact on your smartphone's battery life over its lifespan, though.",
    "Apple is behind the curve when it comes to fast-charging. We've seen some Android phones hit the heights of 120W charging, but iPhones are only officially capable of 20W.",
    "While we wouldn't expect Apple to embrace such a lofty number on the iPhone 14, this shows there is room for improvement by the time of the company's next flagship phone series.",
    "Apple has made big improvements to its battery features for the iPhone 13 series. Battery life is better than ever on its smartphones, and some improvements to fast charging would make for an even better battery experience.",
    "Via MacRumors"
  ],
  "headers": {
    "6": "Analysis: Apple could push higher"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "ChargerLAB": "https://www.youtube.com/watch?v=byIt3SmVfyg",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "report on Chinese social network Weibo": "https://m.weibo.cn/status/4685377044482203",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "iPhone 14": "https://www.techradar.com/news/iphone-14",
    "MacRumors": "https://www.macrumors.com/2021/09/29/iphone-13-pro-max-charges-up-to-27w-speeds/"
  }
}