{
  "source": "https://www.techradar.com/news/funimation-app",
  "title": "How to install the Funimation app on iOS and Android",
  "category": "entertainment",
  "updated": "2021-08-26T14:37:54Z",
  "author": "georgia-silcox",
  "summary": "Stream anime anywhere, anytime with the Funimation app",
  "article": [
    "Over 2.5 million users are subscribed to the online anime streaming service, Funimation, which is home to some of the best anime series you can watch. Users can access over 15,000 hours of anime and, with the Funimation app, it doesn't matter where you are either with the ability to stream straight to your smartphone.",
    "The Funimation app was launched alongside Funimation's website, and has had over 10 million downloads across the Google Play and the App Store. With its huge range of anime shows and movies, if you want to watch anime anytime, anywhere, the Funimation app is a great option, available for both iOS and Android users.",
    "So if the Funimation app is what you're after, keep reading to find out how to download the Funimation app on Android and iPhone devices. We'll also detail other compatible devices, and everything you'll be able to watch on the go through the Funimation app.",
    "Yes, it does! The online streaming service for anime launched its app in 2016 and with over 600 shows available to watch, it's no wonder it's in the top ten apps for streaming anime. However, it did take two years for Funimation to introduce Download To Go in 2018, which finally let users watch offline.",
    "You can download the Funimation app to your iOS device from the App Store, but you'll need iOS 13.5 or later on your iPhone or iPad.",
    "The same goes for Android devices, where this time you'll need to head to the Google Play Store and have the 6.0 Marshmallow operating system or later.",
    "The Funimation app will let you watch all your favorite anime on the go anytime, so you could watch Attack on Titan on your commute, or catch up with the latest Naruto episode while you're waiting for the train. What's more, you'll be able to download and watch some of your favorite episodes on your device offline, meaning it won't eat into your mobile data.",
    "If you've got an iPhone or iPad, follow these steps to download the Funimation app:",
    "If you've already got a Funimation membership, just log in with your existing details to start streaming. If not, you can head to the website to sign up.",
    "If you want to download Funimation to an Android device, the process is pretty similar - follow the steps below:",
    "As with the process for iPhone, if you don't already have a Funimation account you can pick either the monthly, annual, or free membership option.",
    "For a free account, you'll need to look for the small print at the bottom of the page. Start your 14-day Funimation free trial immediately after you've completed this process and then payment will be taken using your Google Play Store payment details once the free trial has finished.",
    "The anime streaming app hosts thousands of hours of content, so there will be something for everyone to watch. If you're new to anime you might want to check out Funimation's recommended tab, which has titles such as Toradora! and Naruto. For those more seasoned anime fans, Attack on Titan, My Hero Academia, and One Piece are all in the top 10 best shows on Funimation. However, what shows you can watch will depend on the Funimation membership that you have.",
    "The free membership option allows you to stream some older titles on one screen at a time but for newer shows, you'll probably want to upgrade your subscription. Not only will you be getting limited access to Funimation's extension library, but viewers that opt for the free option will have to put up with some ad breaks too.",
    "For those that have paid for the Premium Plus membership, you'll have ad-free access to the entire Funimation library of subs and dubs - that's over 600 different shows. And, instead of just one screen, you'll be able to stream on five different screens at one time.",
    "With a paid for membership, you'll be able to download certain titles to your device and watch offline. Those shows that are available for download have a Digital Copy code, so once you've redeemed this you'll be ready to watch without an internet connection. (Note: in the US you'll need the Premium Plus or Premium Plus Ultra plan to get offline streaming.)",
    "If you don't have an iOS or Android device, or simply want to download the Funimation app on a different device, then the following are also compatible:"
  ],
  "headers": {
    "3": "Does Funimation have an app?",
    "7": "How do I download the Funimation app?",
    "12": "What can I watch on the Funimation app?",
    "16": "What other devices can I watch Funimation on?"
  },
  "links": {
    "Funimation": "https://www.techradar.com/news/funimation-explained-subscriptions-sign-up-free-account",
    "best anime series": "https://www.techradar.com/best/best-anime",
    "streaming service for anime": "https://www.techradar.com/best/best-streaming-service-for-anime",
    "head to the website to sign up": "https://funimation.8u86.net/c/221109/302280/4688?subId1=trd-us-3670331739447219700&sharedId=trd-us&u=https%3A%2F%2Fwww.funimation.com%2Fsubscribe%2F",
    "Funimation free trial": "https://www.techradar.com/news/funimation-free-trial"
  }
}