{
  "source": "https://www.techradar.com/news/why-the-samsung-galaxy-z-flip-3-is-the-most-exciting-foldable-of-2021",
  "title": "Why the Samsung Galaxy Z Flip 3 is the most exciting foldable of 2021",
  "category": "phones",
  "updated": "2021-08-12T13:39:57Z",
  "author": "david-lumb",
  "summary": "Buy a Z Flip 3 or a flagship phone – now they're the same price",
  "article": [
    "Samsung has done it: the phonemaker has finally made a foldable that costs the same as a ‘flat’ flagship phone. Finally, consumers really can pick between a Samsung Galaxy Z Flip 3 and a Samsung Galaxy S21 Plus at the same cost. There’s no longer a tax for novelty.",
    "Or rather, not a very big one: you’ll still give up photo range (the Z Flip 3 doesn’t have the impressive telephoto lens of the Samsung Galaxy S21 range nor its 50x Space Zoom), and its specs are just a bit less impressive. But with a Snapdragon 888 chipset, 8GB of RAM, and either 128GB or 256GB of storage, it’s powerful enough to deserve its price with all its features intact, making the Z Flip 3 the most exciting foldable of 2021.",
    "At the same price as the best phones on the market, customers can opt for a Z Flip 3 and not feel like they’re compromising. And for that, they can finally enjoy the real benefit of a foldable: shifting it around to a form that’s more convenient for whatever you’re doing.",
    "For clamshell foldables, that’s unfolding it for most typical phone uses like using apps and browsing the web, then folding it back up to a compact size to slip in a pocket or a bag. The Z Flip 3 does all this, and even minimizes its predecessor’s greatest weakness: instead of the Z Flip’s pinkie finger-sized 1.1-inch external screen, the Z Flip 3’s 1.9-inch outer display is nearly four times larger, making it big enough to have some app functionality like audio playback controls.",
    "The Z Flip 3 is the best clamshell foldable on the market, achieving what the Motorola Razr was building to but couldn’t quite accomplish – and that is its own bittersweet recognition.",
    "We don’t know exactly why Motorola was beaten to the punch by Samsung to release a phone at a flagship price, but Motorola was certainly first to release a clamshell foldable: as we reported, when the original Motorola Razr was revealed in November 2019, we were excited for the possibilities.",
    "The Razr still had the sleek design and stylistic je ne sais quoi of its flip phone originator, preserving the tactile satisfaction of flipping open the phone and flipping it closed again, but with a smartphone display within. There were issues, though, including concerns about particles invading the gap between display and hinge as well as reports of frigid temperatures affecting the screen’s durability.",
    "Months after the Razr was released, the first Samsung Galaxy Z Fip came out, and it trumped Motorola’s foldable in nearly every way – better cameras, superior display, fewer screen and hinge concerns, and it could be opened to any angle. Both devices were surpassed by slightly-refined versions in 2020, though they didn’t make big changes, meaning the Z Flip’s aforementioned 1.1-inch display still couldn’t compete with the Razr’s 2.6-inch screen, which was great for previews while taking selfies and limited screen functionality,",
    "The Z Flip 3 would seem to trim the Razr’s advantage in a big way with its 1.9-inch display, but the real victory is in getting to price parity with flagship phones. That is what foldables needed most: a model that would compete with some of the best-selling phones on the market.",
    "The Samsung Galaxy Z Fold 3 is clearly the dominant foldable of the two announced at Samsung Unpacked, but it also retains its predecessor’s premium pricetag, with a starting cost of $999 / £949 / AU$1,499. Its S Pen stylus compatibility marks it as a device for the productivity-minded consumers, especially since the Samsung Galaxy Note 21 was canceled.",
    "Given the Z Flip 3 is priced competitively with other flagship phones – including Samsung’s own Galaxy S21 Plus – but in briefings, Samsung assured TechRadar that the foldable won’t displace other phones in its lineup, and instead be complementary to its ‘flat’ handsets.",
    "Obviously, consumers will need time to weigh a competitively-priced foldable against traditional phones and decide whether the folding novelty is worth it.",
    "It’s also clear that Samsung is thinking a lot about how people use clamshell foldables – or, in the year-plus since the original Z Flip came out, saw what a lot of case makers were doing. Samsung will sell cases with a circular ring – great for hanging off a necklace or to slip a finger through – and a wide ringlet to feed a strap into.",
    "The consumer debate over whether to embrace foldables as more than a niche choice starts with the Z Flip 3, which could be the onramp for many to consider a Z Fold 3 or other device. If we one day think about whether to pick between ‘flats’ or ‘folds’ when shopping for phones, it’s because the Z Flip 3 went on sale at the right time with the right price."
  ],
  "headers": {
    "5": "Motorola Razr’s crown to lose",
    "9": "Samsung: foldables complementing, not replacing 'flats'"
  },
  "links": {
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Motorola Razr": "https://www.techradar.com/reviews/motorola-razr",
    "reports": "https://mashable.com/review/motorola-razr-review"
  }
}