{
  "source": "https://www.techradar.com/news/the-latest-mercedes-amg-performance-car-isnt-like-any-of-its-predecessors",
  "title": "The latest Mercedes-AMG performance car isn't like any of its predecessors",
  "category": "car-tech",
  "updated": "2021-09-01T15:13:26Z",
  "author": "chris-teague",
  "summary": "It's a plug-in hybrid, but it still has a V8",
  "article": [
    "Mercedes-AMG is a legendary name in the world of performance cars. With models that range from the somewhat affordable to the priceless cars that line up on the grid in Formula 1, AMG's vehicles are some of the most exciting on the roads today.",
    "With parent company Mercedes-Benz's shift to a focus on electrification, AMG has released its first performance hybrid model, and the numbers are truly awe-inspiring.",
    "The Mercedes-AMG GT 63 S E Performance concept debuted today, and while it still features the raucous V8 we've come to expect from the brand, the electrified side of its powertrain is what makes it such a marvel.",
    "The GT 63 S E Performance draws heavy inspiration from the Mercedes-AMG Formula 1 car. It's powered by a twin-turbo 4.0-liter engine, an electric motor, and a high-performance battery that was developed in-house at the automaker's home base in Affalterbach.",
    "System output lands at a staggering 843 horsepower and over 1,000 pound-feet of torque. Combined with an AMG Performance 4MATIC+ all-wheel drive system, the powertrain can push the heavy Merc from 0 to 62 mph in 2.9 seconds. The ferocity continues until the car reaches 196 mph.",
    "Similar to the systems featured in modern F1 cars, the AMG's hybrid system is capable of generating boosts of power when the car needs it most and regenerates power at other times.",
    "Mercedes-AMG says that the battery is lightweight and carries a high energy density, and a capacity of 6.1 kWh. It's capable of 70 kW of continuous output and 150 kW of peak output for up to ten seconds at a time.",
    "The battery weighs just 89 kilograms (just over 196 pounds), and can be charged at a station, at home, or through a standard power outlet.",
    "It's worth noting that the battery is designed to provide supplemental power to the car and to do so with as quick a power delivery as possible, so range is not the focus here.",
    "That's just as well, as Mercedes says the AMG GT 63 offers 12km (around 7 miles) of EV driving - way behind most plug-in hybrids on the market which tend to triple that figure at a minimum.",
    "To help the car take advantage of all that mechanical trickery, AMG has outfitted it with seven driving modes: Electric, Comfort, Sport, Sport + Race, Slippery, and Individual.",
    "The car's hybrid system delivers more or less power, and its exhaust volume adjusts, depending on the selected mode. Electric power regeneration can also be adjusted to one of four levels using the AMG steering wheel button.",
    "As we mentioned at the start, the GT 63 S E Performance is only a concept car, so it's not something you're going to be able to buy - but it does give you a glimpse of AMG's electrification plans going forward.",
    "We already know there will be an AMG model of the super-premium Mercedes EQS electric car, so the arrival of hybrid options is not a surprise."
  ],
  "headers": {
    "5": "Formula 1 technology in a road car"
  },
  "links": {}
}