{
  "source": "https://www.techradar.com/news/microsofts-adaptive-kit-for-making-surface-devices-more-accessible-is-now-out",
  "title": "Microsoft’s Adaptive Kit for making Surface devices more accessible is now out",
  "category": "computing",
  "updated": "2021-12-01T17:49:31Z",
  "author": "darren-allan",
  "summary": "Surface Adaptive Kit works with a wide range of Microsoft’s devices",
  "article": [
    "Microsoft’s Surface Adaptive Kit, which is designed to make Surface devices more accessible to everyone, is now available to purchase at the company’s online store.",
    "The kit is a bunch of tools which make the Surface more easily usable for people with disabilities, and it includes translucent labels for keycaps which highlight keys visually and have tactile indicators to find them by touch. Plus there are port indicators with raised textures and different colors – and matching ties to go around the cable which is used with the corresponding port, using the same texture and color – to aid with plugging in peripherals to device ports.",
    "There are also miscellaneous ‘bump’ labels which consist of different colored symbols that can be applied anywhere on the Surface device, so for example a dot label could be placed next to the audio jack.",
    "Furthermore, the Surface Adaptive Kit comes with a pair of opener supports, which as the name suggests help to make it easier to open the Surface. One is designed for the lid (with a large loop), and the other for pulling out the Surface Pro’s kickstand (using an attached lanyard or wrist strap).",
    "The kit can be purchased direct from Microsoft’s online store and is priced at $14.99 (£14.99 in the UK, or AU$24.95 in Australia).",
    "The Surface Adaptive Kit was announced back in September, and is a thoughtful addition to Microsoft’s range of accessories. It’s great to see that it’s now available to buy, and the various labels will doubtless come in handy for locating ports and keys with a lot more ease.",
    "A whole host of Surface devices are supported by the kit, namely the Surface Laptop 3 and 4, Surface Pro 7 and 8, Surface Laptop Studio, Surface Book 3, Surface Go and Go 2 plus Go 3, and the Surface Laptop Go (but keycap labels will be a little trickier to apply with the latter and the Go Type Cover due to the smaller key sizes).",
    "And of course there’s nothing stopping you applying some of these labels to another non-Surface device (not in theory, anyway, aside from issues around things like key size perhaps).",
    "Microsoft has been pushing forward on the accessibility front for quite some time now, and commendably so, making moves in the early days of Windows 10 to introduce eye tracking functionality for example (that was back in 2017)."
  ],
  "headers": {
    "5": "Analysis: Microsoft has made some impressive strides forward with accessibility"
  },
  "links": {
    "Surface devices": "https://www.techradar.com/deals/surface-pro-deals-bundles",
    "$14.99": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1131439739556782000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fd%2Fsurface-adaptive-kit%2F8rdmhd3kfc3r%3Factivetab%3Dpivot%253aoverviewtab",
    "£14.99": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-3064576091669142000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fd%2Fsurface-adaptive-kit%2F8rdmhd3kfc3r",
    "AU$24.95": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-1126587378361934800&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-au%2Fd%2Fsurface-adaptive-kit%2F8rdmhd3kfc3r",
    "Surface Adaptive Kit was announced back in September": "https://www.techradar.com/news/microsoft-surface-adaptive-kit-will-help-people-with-disabilities-use-their-devices",
    "Surface Book 3": "https://www.techradar.com/reviews/surface-book-3",
    "pushing forward on the accessibility front for quite some time": "https://www.techradar.com/news/fall-creators-update-aims-to-make-windows-10-more-accessible",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "introduce eye tracking functionality": "https://www.techradar.com/news/windows-10-preview-gives-edge-browser-a-facelift-and-debuts-eye-control"
  }
}