{
  "source": "https://www.techradar.com/news/running-helped-me-discover-the-best-use-of-a-5g-phone",
  "title": "Running helped me discover the best use of a 5G phone",
  "category": "phones",
  "updated": "2021-04-04T14:00:33Z",
  "author": "tom-bedford",
  "summary": "5Groovin'",
  "article": [
    "When 5G phones first started coming out, different carriers and phone brands sung its praises - its fast connection makes it great for downloading movies, its reliability makes it perfect for gaming on the go, and so on and so forth.",
    "After testing various 5G phones for well over a year, I've tried out all the various use cases you can think of - I've played Call of Duty: Mobile in the park, downloaded an entire collection of movies on my walk to the underground station (I can be picky), and tuned into video calls while out and about.",
    "But after doing all this, I've found my favorite benefit of 5G is none of those things, despite them being useful. It's actually something pretty mundane: the ability to seamlessly stream music while I'm out on a run.",
    "I'm currently in the midst of a running challenge in which, using tech to track the distance, I have to run the entirety of Route 66 in two years - you can read more about this challenge here. It's helped me notice new things about the tech I use every day, and this musical function of 5G is one of them.",
    "Some may have read my statement that 'music streaming is my favorite use of 5G' and thought - 'but you can stream music on 4G!'. While that's technically true, it's not the whole story.",
    "When you're trying to play from an app like Spotify (which is my go-to music streaming service, despite its issues), you actually need quite a good connection - otherwise, a song might take a few seconds to load, will keep cutting out, or won't be playable depending on how strong your connection is.",
    "That's not even factoring in the fact you can stream music at different qualities which, naturally, requires better connection the higher you go. I won't factor this in, though, because I own the cheapest pair of running headphones ever made (probably), so high-quality music is redundant.",
    "I can be quite musically picky at the best of times, but when I'm running that's doubly so - I need a song that reflects my pace, that I haven't burned out on, that'll distract me from the actual process of running and help me tune out the world.",
    "As a result, I skip more songs than I play - even on my go-to running playlists, I often find I'm not in the mood for certain tracks or need a certain beat to motivate me. When I'm on 4G, each skip is prefaced by a few seconds waiting for the song to load, but on 5G, I can easily jump ahead as many times as I want, or wade through various playlists to find something perfect.",
    "You need to be in a particular mindset to run, and music gets me there - if my music stops, it threatens to hurt my rhythm.",
    "If you run while listening to music, you'll probably have a few songs that are running anthems for you - I've got a playlist of six or seven songs like that. And if the only thing that'll get me through the last kilometer is Livin' La Vida Loca, I don't want to be waiting for that track to load.",
    "Sure, 'music streaming is the best part of 5G' could be seen as a controversial statement, and that statement comes from my personal experiences and preferences. But most of the use cases of 5G involved things I never used to do, and don't really have much of an inclination to do - I'd rather drink a beer in the park than play Call of Duty: Mobile, and 'the streets of central London' isn't the best place for a video call. But with music streaming, 5G is improving something I already used every day."
  ],
  "headers": {
    "4": "Why I can't connect with 4G",
    "7": "Running makes it different"
  },
  "links": {
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "you can read more about this challenge here": "https://www.techradar.com/news/im-running-across-the-entirety-of-america-and-i-cant-do-it-without-technology"
  }
}