{
  "source": "https://www.techradar.com/news/hackers-are-hiring-more-english-speakers-to-write-believable-email-scams",
  "title": "Hackers are hiring more English speakers to write believable email scams",
  "category": "computing",
  "updated": "2021-09-02T10:53:31Z",
  "author": "mayank-sharma",
  "summary": "Scammers are seeking help to ensure language mistakes are no longer a giveaway",
  "article": [
    "Criminals are actively recruiting native English speakers, in order to craft more believable business email compromise (BEC) campaigns, according to cybersecurity researchers.",
    "While BEC scamsters are finding innovative ways to circumvent security checks and make their way to your inbox, quite a few fall flat on their face thanks to their poorly worded message, which foils their plans.",
    "Researchers at threat intelligence company Intel 471 have now flagged that cybercriminals are posting recruitment messages on underground forums looking for native English speakers to help them draft grammatically correct scams.",
    "“The use of proper English is very important to these actors, as they want to ensure the messages they send to their victims — mainly high-level employees of an organization — do not raise any red flags,” note the researchers in a blog post.",
    "According to estimates, BEC scams cost US businesses almost $2 billion in losses in 2020, accounting for 43% of all cybercrime losses in the year.",
    "In the past Intel 471 has observed a number of actors using popular cybercrime forums to recruit or outsource functions related to BEC scams.",
    "However, earlier this year in February, an actor on a popular Russian-language cybercrime forum posted a message to hire a team of native English speakers to help them refine the social engineering elements of their BEC campaign, followed by an almost identical request by another actor on a different forum later in the year in June."
  ],
  "headers": {
    "4": "Prose and cons"
  },
  "links": {
    "business email": "https://www.techradar.com/news/best-email-provider",
    "BEC": "https://www.techradar.com/news/protecting-your-business-from-email-compromise-attacks",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "finding innovative ways": "https://www.techradar.com/news/even-captchas-arent-safe-from-hackers-any-more",
    "blog post": "https://intel471.com/blog/bec-cybercrime-underground",
    "BEC campaign": "https://www.techradar.com/news/microsoft-sinks-massive-office-365-email-hijacking-campaign"
  }
}