{
  "source": "https://www.techradar.com/news/linux-foundation-launches-randd-division-to-investigate-open-source-opportunities",
  "title": "Linux Foundation launches R&D division to investigate open source opportunities",
  "category": "computing",
  "updated": "2021-04-14T16:00:26Z",
  "author": "mayank-sharma",
  "summary": "New division's first study is already underway",
  "article": [
    "The Linux Foundation (LF) has announced the launch of a new research division to investigate the impact of open source collaboration in solving the most pressing challenges in the world today.",
    "LP argues that Linux Foundation Research will help broaden the understanding of open source projects, the dynamics of the ecosystem, and its impact, in order to quantify the efficacy of open source collaboration.",
    "“With a dedicated research organization, the Linux Foundation will be better equipped to draw out insights, trends, and context that will inform discussions and decisions around open collaboration,” noted Jim Zemlin, executive director at the Linux Foundation.",
    "LF has researched the impact of open source in the past, and now consider it to be one of the pivotal aspects of the organization.",
    "Zemlin acknowledges research to be an important way to measure the progress of both open source ecosystems and contributor trends.",
    "The new research division will spearhead a series of research projects as it looks to apply quantitative and qualitative techniques to create what it dubs a “knowledge network” that’ll be of use not just to open source communities around the world, but also to the wider tech industry.",
    "LF has roped in Hilary Carter, as VP Research, to lead this initiative. In her previous role at the Blockchain Research Institute, Carter led the development and publication of more than a hundred enterprise-focused technology research projects.",
    "“Whether we’re exploring the security of digital supply chains or new initiatives to better report on climate risk, the goal of LF Research is to enhance decision-making and encourage collaboration in a vast array of open source projects,” explains Carter.",
    "One of the first projects of the new research division is to study the use of open source to strengthen and secure software supply chains."
  ],
  "headers": {
    "3": "Researching collaboration"
  },
  "links": {
    "Linux Foundation": "https://www.techradar.com/news/linux-foundation-is-making-it-easier-to-verify-the-authenticity-of-software",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}