{
  "source": "https://www.techradar.com/news/heres-the-hololens-headset-microsoft-is-building-for-the-us-army",
  "title": "Here's the HoloLens headset Microsoft is building for the US Army",
  "category": "computing",
  "updated": "2021-04-01T11:01:46Z",
  "author": "mike-moore",
  "summary": "Microsoft HoloLens US Army headset revealed",
  "article": [
    "Microsoft has revealed more details on the wearable technology based on its HoloLens headsets that it will be delivering to the US Army.",
    "The computing giant will supply up to 120,000 headsets over 10 years in a deal thought to be worth around $21.88 billion, according to CNBC.",
    "The Integrated Visual Augmentation System (IVAS) headsets will be based on HoloLens and augmented by Microsoft Azure cloud services, offering a heads-up display that is able to offer high-resolution night, thermal, and soldier-borne sensor data.",
    "In a blog post, Microsoft said that the IVAS devices will provide, \"a platform that will keep Soldiers safer and make them more effective.\"",
    "\"The program delivers enhanced situational awareness, enabling information sharing and decision-making in a variety of scenarios,\" the company added.",
    "\"Microsoft has worked closely with the U.S. Army over the past two years, and together we pioneered Soldier Centered Design to enable rapid prototyping for a product to provide Soldiers with the tools and capabilities necessary to achieve their mission.\"",
    "“The system also leverages augmented reality and machine learning to enable a life-like mixed reality training environment so the Close Combat Force (CCF) can rehearse before engaging any adversaries,” a US Army statement added.",
    "Microsoft has been working with the US Army since 2018 after it signed an initial $479m contract to develop Hololens-based headsets, although the news was greeted with criticism by company employees.",
    "The company also won the $10 billion Joint Enterprise Defense Infrastructure (JEDI) contract to reinvigorate the cloud network at the Pentagon late in 2020, although this victory has faced multiple legal challenges.",
    "HoloLens itself has not seen any major evolution since the release of the second-generation headset in 2019 - although a new HoloLens 2 Industrial Edition was announced in February 2021 and is set to begin shipping soon.",
    "At the time, Microsoft said this new headset could be used by enterprises to deliver remote expert advice, provide interactive 3D guides to aid task completion, and streamline employee training - use cases which could carry over to the US Army too.",
    "Via CNBC"
  ],
  "headers": {},
  "links": {
    "HoloLens": "https://www.techradar.com/reviews/microsoft-hololens-2",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5662368595516376000&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fblog%2F2021%2F03%2F31%2Farmy-moves-microsoft-hololens-based-headset-from-prototyping-to-production-phase%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fheres-the-hololens-headset-microsoft-is-building-for-the-us-army",
    "statement": "https://www.peosoldier.army.mil/News/Article-Display/Article/2556870/ivas-production-contract-award/",
    "(JEDI) contract": "https://www.techradar.com/news/pentagon-may-cancel-jedi-contract-and-start-over",
    "HoloLens 2 Industrial Edition": "https://www.techradar.com/news/microsoft-hololens-2-is-getting-an-industrial-edition-for-hardcore-environments",
    "CNBC": "https://www.cnbc.com/2021/03/31/microsoft-wins-contract-to-make-modified-hololens-for-us-army.html"
  }
}