{
  "source": "https://www.techradar.com/news/ps5-digital-edition-owners-can-now-deck-out-their-console-with-darkplates",
  "title": "PS5 Digital Edition owners can now deck out their console with Darkplates",
  "category": "gaming",
  "updated": "2021-02-18T12:33:57Z",
  "author": "rhys-wood",
  "summary": "I think it's getting...dark",
  "article": [
    "It looks like dbrand won’t stop trying to be a thorn in Sony’s side anytime soon as the skin company has added its controversial Darkplates to the PlayStation 5 Digital Edition to the tune of $60.95 (around £43.71 and AU$78.37), with the first shipment being prepared for May.",
    "The company rocked Sony’s boat last week when it launched its Darkplate skin for the base PlayStation 5 model. The plastic plates offer a matte black makeover as an alternative to the console’s pure white aesthetic.",
    "The 3D-textured black sheets mask the PS5’s white faceplates, and dbrand has emblazoned the design with edgy variations on PlayStation’s button iconography. A robot head instead of a square, a skull and crossbones in place of the familiar “X” a hazardous material sign for the circle, and what looks to be an Illuminati-esque symbol in place of the triangle.",
    "So far, dbrand’s marketing strategy has been, in a word, aggressive. The store page for the matte black PS5 faceplates is practically begging for Sony to take (legal?) action, highlighting that its own design is just “legal” enough to skirt any kind of lawsuit. Its messaging is accompanied by dbrand’s goading slogan: “Go ahead, sue us.”",
    "There’s clearly a market for changeable faceplates for the PS5. Its white finish is a departure from previous consoles in the PlayStation family, and the lack of official faceplate alternatives means that owners are otherwise stuck with an admittedly divisive design.",
    "Regardless of what we might think of dbrand’s bold and brash marketing strategy, it’s very clearly worked. The Darkplates and their accompanying sales pitch sparked conversation across the internet, and all previous waves of shipments thus far have sold out. So if you want to jump on the bandwagon, too, you’d best be quick."
  ],
  "headers": {
    "3": "None more black"
  },
  "links": {
    "Darkplates": "https://www.techradar.com/news/black-ps5-finally-becomes-a-reality-as-faceplates-go-on-sale-but-not-from-sony",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "store page": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7305003639516732000/https://dbrand.com/shop/special-edition/ps5"
  }
}