{
  "source": "https://www.techradar.com/news/microsoft-teams-update-could-soon-give-you-a-whole-new-view-on-your-calls",
  "title": "Microsoft Teams update could soon give you a whole new view on your calls",
  "category": "computing",
  "updated": "2021-03-09T10:57:26Z",
  "author": "mike-moore",
  "summary": "New view switcher feature provides a different outlook on Microsoft Teams",
  "article": [
    "Users of Microsoft Teams might be able to get a new outlook on their video conferencing calls thanks to a new feature for the platform.",
    "The view switcher tool will allow Microsoft Teams participants to switch between a number of different views for the content within their online collaboration calls.",
    "Multiple options will be available for the view switcher tool, including Together mode, Focus, Gallery at top, and Full Screen.",
    "Microsoft says that the new view options all correspond to different use cases it has spotted from users when using Teams.",
    "For example, those users looking to interact naturally with colleagues and without visual distractions can toggle the 'Together' mode, bringing all participant windows front and centre.",
    "The 'Gallery at top' option means all video feeds are moved to the top of your meeting window, making it easier to have a more natural eye gaze with others. 'Focus' hides all video feeds and puts the attention fully on the shared content, and 'Full screen' does just that, allowing the call to take over the entire display, removing any possible desktop distractions.",
    "The view switcher will be situated in the top bar of your Teams meeting, allows users to control how you see the meeting content and change views quickly and easily.",
    "The new feature is currently still in the works, but given Microsoft's record of rapid innovation and improvement, should be live soon.",
    "The news is the latest in a series of recent upgrades for Microsoft Teams as the company looks to ensure the platform remains useful even as workers slowly begin to return to the office.",
    "Other recent updates include a new Progressive Web App (PWA) version of Microsoft Teams that will allow users with lower-end devices to run the platform without suffering major hits to their performance, and a tweak that will push meeting attendees off-screen if they have not activated their webcam.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "View switcher"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "currently still in the works": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8643411412805376000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-teams-blog%2Fwhat-s-new-in-microsoft-teams-microsoft-ignite-2021%2Fba-p%2F2118226&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-teams-update-could-soon-give-you-a-whole-new-view-on-your-calls",
    "users with lower-end devices": "https://www.techradar.com/news/microsoft-teams-is-getting-a-new-slimline-makeover",
    "MSPowerUser": "https://mspoweruser.com/view-switcher-microsoft-teams-meeting-content/"
  }
}