{
  "source": "https://www.techradar.com/news/lady-dimistrecu-explained-what-to-know-about-resident-evil-villages-mistress",
  "title": "Lady Dimistrecu explained: what to know about Resident Evil Village's mistress",
  "category": "gaming",
  "updated": "2021-05-20T13:34:22Z",
  "author": "samuel-tolbert",
  "summary": "The origins of this bewitching stunner",
  "article": [
    "Ah, the Lady Alcina Dimitrescu. Since Resident Evil Village was first revealed, this towering character has dominated the thoughts of long-time fans and newcomers to the series alike. So, just who is she and how did she come about in-game? What are the origins of her and her mysterious daughters? Is there an explanation for her appearance and unique abilities?",
    "Pulling from in-game documents found throughout Resident Evil Village, we have the answers though, in typical Resident Evil style, some handwaving for the scientific aspects is required. We've put together the following explainer to answer all your questions.",
    "Do note that obviously the following contains major story spoilers for Resident Evil Village. If you haven't played the game yet, we recommend going through it first, then coming back here and reading this.",
    "Alcina Dimitrescu, also known in memes and gaming culture as the Tall Vampire Lady, was born in the Resident Evil universe at some point prior to 1914 and grew up as a noblewoman in the Dimitrescu family. At the age of 44, she was infected by Mother Miranda with the Cadou parasite. The Cadou was developed by Mother Miranda and interacts with its host and the Mold in strange ways.",
    "Dimitrescu took to the Cadou well, as it granted her incredible regenerative powers, the ability the heal from any wound in seconds and preserving her appearance. She also gained razor-sharp retractable talons and the ability to turn into a dragon-esque monster. A side effect of this caused her to keep growing: she's 9'6\", or 2.89 meters tall, as of the events of Resident Evil Village.",
    "The downside of this Cadou implementation affected her diet. Due to an unspecified blood disease, she now thirsts for blood and has to drink it somewhat regularly to stay alive.",
    "She viewed herself as the best of the Four Lords and was overall loyal to Mother Miranda, being properly suspicious of Heisenberg, with whom she argued on a frequent basis, though she incorrectly dismissed him as a \"fool.\"",
    "For reasons not made clear in the story, she viewed men as contemptable as best, referring to Ethan Winters as a \"stupid manthing\" and happily draining the blood of any man that entered the castle. Young women did also have their blood drained specifically for Sanguis Virginis, the Maiden's Blood wine.",
    "Lady Dimitrescu has three \"daughters\" named Daniela, Bela and Cassandra. Though all three act giddy and playful when chasing down Ethan, they do have distinct personalities.",
    "Bela, the blonde, is the most rational and the eldest. Cassandra, the brunette, is the most sadistic. Finally, Daniela the redhead is the youngest and the most reckless of the three. Each of the daughters actually have small, unique animations reflecting these traits.",
    "These daughters were \"born\" when Dimitrescu experimented with Mother Miranda, implanting Cadou in the bodies of young women. Eggs laid in the bodies by the Cadou produced fly-like creatures that were extremely sensitive to the cold. These creatures consumed the bodies, then appeared to settle into the form of the young women.",
    "The result was that these newborns bonded with Dimitrescu, viewing her as a mother and retaining the ability to shift into a swarm of insects, while also developing a taste for blood like their mother."
  ],
  "headers": {
    "3": "Resident Evil Village: Who is Lady Dimitrescu?",
    "8": "Resident Evil Village: Who are Lady Dimitrescu's daughters?"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Tall Vampire Lady": "https://www.androidcentral.com/tall-vampire-lady-stole-show-during-todays-resident-evil-village-showcase"
  }
}