{
  "source": "https://www.techradar.com/news/oneplus-8-pro-is-now-dollar400-off-at-the-official-store-plus-free-earbuds",
  "title": "OnePlus 8 Pro is now $400 off at the official store - plus free earbuds",
  "category": "phones",
  "updated": "2021-04-21T11:35:18Z",
  "author": "alex-whitelock",
  "summary": "Still a great choice for 2021",
  "article": [
    "The OnePlus 8 Pro, one of last year's top Android flagships, can be picked up for as little as $599 right now with the code SPRING8PRO100 at checkout.",
    "This huge $400 price cut is currently available on the 256GB / 12GB RAM models (128GB has sold out), and in both the Onyx Black and Ultramarine Blue colors. In addition to this discount, customers buying the blue color will also bag a free pair of OnePlus Buds Z in white - wireless earbuds worth $50 by themselves.",
    "This is easily one of the best cell phone deals we've spotted this week - especially since this latest discount brings the OnePlus 8 Pro down to a price that's even cheaper than the standard OnePlus 9 (retailing for $729). While some may prefer to opt for the latest OnePlus range, the gorgeous glass back design and 6.78 inch curved 4K AMOLED display makes the OnePlus 8 Pro a very, very compelling choice indeed.",
    "We reviewed the OnePlus 8 Pro last year and particularly liked its powerful spec, screen, and excellent wireless charging. Our main criticism was of course the launch price, which makes this latest round of OnePlus deals at the official site a very welcome sight indeed.",
    "Outside the US? See the best OnePlus cell phone deals in your region just below.",
    "See how these OnePlus 8 Pro deals shape up against the latest devices with our OnePlus 9 deals and OnePlus 9 Pro deals page."
  ],
  "headers": {
    "5": "OnePlus 8 Pro deals at the official OnePlus store"
  },
  "links": {
    "for as little as $599 right now": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-8714969841907485000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-8-pro%3Ffrom%3D8pro",
    "best cell phone deals": "https://www.techradar.com/deals/mobile-phone-deals",
    "for $729": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-3052818974147881500&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-9",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "OnePlus 9 deals and OnePlus 9 Pro deals": "https://www.techradar.com/deals/best-oneplus-9-deals"
  }
}