{
  "source": "https://www.techradar.com/news/photoshop-just-got-its-own-portrait-mode-for-blurring-backgrounds",
  "title": "Photoshop just got its own Portrait Mode for blurring backgrounds",
  "category": "cameras",
  "updated": "2021-05-21T10:30:28Z",
  "author": "mark-wilson",
  "summary": "Warning: Depth Blur is very much a beta feature",
  "article": [
    "The latest Photoshop update has delivered a new beta tool called Depth Blur, which lets you choose different focal points and blur the background of photos after they've been taken.",
    "Like a Photoshop equivalent of your smartphone's Portrait Mode, or apps like Focos, it works by creating a depth map of your photo that then allows you to play with artificial depth of field to give the impression of a photo taken with a super-bright prime lens.",
    "The feature has arrived as part of Photoshop 2021's May update, so you'll need to install the update to access the new tool. Once you're updated, you'll find Depth Blur via the Filter > Neural Filters menu, under Photoshop's growing list of Beta filters.",
    "That 'Beta' billing certainly seems justified going on the early results we've seen produced by Depth Blur, which seems to struggle to fully identify objects in the frame and can make mistakes with the focal plane.",
    "Still, there are at least plenty of ways to edit the effect, with the tool providing sliders for Blur Strength, Focal Range and Focal Distance, alongside the ability to adjust Haze, Warmth and Brightness.",
    "A small preview of your photo also lets you click anywhere in the image to add a focal point (for example, on someone's face), which means you can then adjust the virtual depth of field around that point.",
    "Click the 'Output depth map' check box and you can also load a depth map layer, which you can then use to apply other effects like lens blur. To see all of this in action, check out the excellent overview from PiXimperfect below.",
    "It's certainly early days for the Depth Blur tool and, as it's a cloud-based filter, it can also take a while to apply the effects. But there's no doubt that it should improve quickly and become a handy time-saver for some edits.",
    "You can create the same effects already in Photoshop using layer masks and filters like Gaussian Blur, but this can take time if your subject has a detailed outline (for example, if it has feathers or hair). So having an automated tool like this could certainly prove to be quick starting point for edits, and might ultimately prove good enough to do the whole job for you.",
    "Photographers usually prefer to nail their depth of field at the point of capture by adjusting their lens' aperture, but there are times when this isn't possible, or you don't have the lens needed to produce that lovely bokeh.",
    "The Depth Blur tool also shows how rapidly Photoshop is embracing the kind of AI photo-editing techniques that have seen smartphones become increasingly powerful photography tools in recent years.",
    "Applying these computational effects to the much larger files captured by DSLRs or mirrorless cameras requires a hefty amount of processing (hence why your Canon or Nikon body doesn't have an in-camera Portrait Mode), so it makes sense for Photoshop to offer them at the post-processing stage.",
    "And while most photographers would still rather use the slower, but more accurate, manual editing techniques, there's no doubt that tools like Depth Blur could become second-nature once they've come out of beta and reached the levels demanded by pros."
  ],
  "headers": {
    "7": "For beta or worse"
  },
  "links": {
    "Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021"
  }
}