{
  "source": "https://www.techradar.com/news/playing-non-steam-games-could-be-a-dollar139-add-on-for-steam-deck",
  "title": "Playing non-Steam games could be a $139 add-on for Steam Deck",
  "category": "gaming",
  "updated": "2021-07-16T16:09:57Z",
  "author": "hamish-hector",
  "summary": "Get ready to buy a Windows 10 license",
  "article": [
    "Valve’s recently-announced handheld console the Steam Deck has a lot of gamers excited, but you might want to start tempering your expectations. That’s because some of the most popular PC games might not be playable on the platform unless you’re willing to put in a lot of effort and pay extra for the privilege.",
    "While Valve is selling the Steam Deck as a handheld gaming PC, it won’t be what a lot of us are used to. We don’t just mean because of its Nintendo Switch-like form factor, but because the Stream Deck runs using a Linux-based operating system rather than Windows.",
    "This won’t be a problem for Valve’s own Steam storefront, but for pretty much every other digital platform you’ll likely need to put in a bit of effort to get them working. Specifically, you’re going to need to buy and install Windows 10 on your Steam Deck.",
    "Unless you happen to have a spare Windows 10 Home license lying around or can snag a good deal, this means you'll have to shell out $139 / £119.99 / AU$225 if you want to play non-Steam games like Fortnite, League of Legends and World of Warcraft.",
    "Thankfully, Valve promises that this kind of customization will be possible on the Steam Deck, but we can't imagine everything will run as smoothly as the specially designed SteamOS. We'll have to wait and see how this shapes out but we could be headed for another handheld disappointment.",
    "The trouble doesn’t stop with games that aren’t on Steam though, even titles on the Valve platform might not work on their own handheld. We’ll have to get the device in our own hands to know for sure, but four of Steam’s most popular games (Destiny 2, Apex Legends, PUBG, and Rainbow Six Siege) might be blocked off, as well as others.",
    "Once again it would be down to the Steam Deck’s Linux operating system, but for slightly different reasons than before. All of these games use anti-cheat software that is required to be able to play in their multiplayer servers, software that might not work on SteamOS.",
    "Valve has since said that it is currently \"improving Proton's game compatibility and support for anti-cheat solutions by working directly with the vendors\" but when and if these solutions will be implemented is yet to be seen."
  ],
  "headers": {
    "5": "Not quite full Steam ahead"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Steam": "https://www.techradar.com/news/the-best-free-to-play-steam-games",
    "Windows 10 Home license": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "League of Legends": "https://www.techradar.com/how-to/league-of-legends-a-beginners-guide",
    "World of Warcraft": "https://www.techradar.com/reviews/world-of-warcraft",
    "handheld disappointment": "https://www.techradar.com/news/who-is-the-nintendo-switch-oled-really-for",
    "Destiny 2": "https://www.techradar.com/news/destiny-2-review",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Valve": "https://www.steamdeck.com/en/software"
  }
}