{
  "source": "https://www.techradar.com/news/7-new-movies-and-tv-shows-on-netflix-amazon-prime-hbo-max-and-more-this-weekend-december-03-2021",
  "title": "7 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-12-03T15:00:08Z",
  "author": "axel-metz",
  "summary": "What’s new on Netflix and other streamers this weekend",
  "article": [
    "We’ve been warning you all for the past few weeks, but Christmas has well and truly arrived on streamers in 2021. This weekend will see several new festive movies and TV shows landing on the likes of Netflix, HBO Max and Prime Video – but we’ve made a conscious effort to also highlight those that aren’t designed to extract every last ounce of joy from your wintery bones.",
    "Alongside the latest holiday adventures, you can expect to enjoy Jane Campion’s awards-touted The Power of the Dog and the second part of Money Heist’s fifth and final season over the next few days – both of which are now available to stream on Netflix.",
    "There’s plenty more great content to dig into, though, and below you’ll find our pick of the best new movies and TV shows worth paying attention to this weekend.",
    "Money Heist (or La Casa De Papel, if we’re being specific) returns to Netflix for the second part of its fifth and final season this weekend to bid farewell to Spain’s most famous crew of bank robbers.",
    "Speaking ahead of part one’s release earlier in the year, the show’s creator, Álex Pina, said part 2 will “focus more on the emotional situation of the characters” and act as “a journey across their sentimental map that connects us directly to their departure.”",
    "As such, we're assuming new episodes will contain more tears than tear gas, though being Money Heist, we’re not ruling out further explosive set-pieces, shouty soldiers and shocking deaths.",
    "Now available to stream on Netflix",
    "It’s safe to say that Jane Campion’s The Power of the Dog has been the critical hit of the year so far – and with just a few weeks to go until 2022, it wouldn’t be premature to describe this one as the best movie of 2021.",
    "Widely praised for its slow-burning psychological drama, The Power of the Dog follows the story of a menacing rancher (Benedict Cumberbatch) who doesn’t take kindly to the arrival of his brother’s new wife (Kirsten Dunst) and her son (Kodi Smit-McPhee).",
    "To say more would hinder the film’s suspense, but just know that it’s being touted as one of the best Netflix movies to date. It helps, too, that Cumberbatch gives a career-best performance as the volatile Phil Burbank in this one – which should make interesting prep for next year’s Doctor Strange 2.",
    "Now available to stream on Netflix",
    "From the mind of Girls Trip creator Tracy Oliver comes Harlem, Prime Video’s latest comedy series following the misadventures of a group of stylish and ambitious girlfriends in the eponymous New York City neighbourhood.",
    "Megan Good, Grace Byers, Shoniqua Shandai, Jerrie Johnson and Tyler LePley star alongside guests like Whoopi Goldberg and Andrea Martin in this 10-episode first season, which looks set to reinvent the Sex and the City formula in interesting ways.",
    "What’s more, as part of Harlem’s premiere, Prime Video has made a concerted effort to promote Black female entrepreneurs based in Harlem and other neighboring New York City communities, so keep your eyes peeled for references to real-life businesses throughout.",
    "Now available to stream on Amazon Prime Video",
    "The It’s Always Sunny crew return to Hulu for season 15 of the hit show this week to make it the longest-running live-action comedy series in American television history (hurdling the 1960s show The Adventures of Ozzie and Harriet).",
    "This time around, The Gang stands at a crossroads in the wake of everything that went awry in 2020 – so expect the likes of Covid-19, Trump and the Epstein scandal to play a lead role in the ensuing mayhem.",
    "The usual suspects return, with Mac (Rob McElhenney), Charlie (Charlie Day), Dennis (Glenn Howerton), Dee (Kaitlin Olson) and Frank (Danny DeVito) primed to deliver more of the show’s trademark – and extremely popular – brand of humor.",
    "Now available to stream on Hulu in the US",
    "Sticking with the comedy theme, Santa Inc lands on HBO Max to subvert everything you thought you knew about innocent animated Christmas adventures. In this stop-motion series, Sarah Silverman stars as a foul-mouthed elf who hopes to someday become the first female Santa Claus.",
    "Seth Rogen offers his distinctive voice as the big man himself, while the likes of Maria Bamford, Nicholas Braun, Craig Robinson, Gabourey Sidibe and Leslie Grossman also feature in this eight-episode debut season.",
    "Santa Inc comes from the creators of Sausage Party, so if deliberately controversial gags are your calling, this one is an easy recommendation.",
    "Now available to stream on HBO Max",
    "Those that watched the debut season of Alex Rider will know that the Sony-produced spy show was something of a sleeper hit in 2020. Based on the best-selling novel series by Anthony Horowitz, it followed the book one adventures of the eponymous British teenager.",
    "It’s no surprise, then, that season 2 dramatizes the events of Horowitz’s second book in the series, Eagle Strike, which sees Alex do battle against a megalomaniac intent on using nuclear weapons to destroy the drug-making countries of the world.",
    "If that all sounds a bit silly, that’s because it is, but Alex Rider will undoubtedly prove an enjoyable, care-free watch to anyone looking to scratch a James Bond-sized itch. Season 2 is available to stream on Prime Video now via the free IMDB TV channel.",
    "Now available to stream on Prime Video (via IMDB TV)",
    "It wouldn’t be a December streaming roundup without the inclusion of a bona fide Christmas movie, and Single All the Way looks to have more than a few festive feels up its sleeve.",
    "In this Netflix original, frustrated singleton Peter (Michael Urie) convinces his best friend Nick (Philemon Chambers) to join him for the holidays and pretend the pair are in a relationship. Why, you ask? It’s all an elaborate ruse to avoid his family’s judgement towards his solitary status.",
    "Now, we’re not saying Single All the Way will turn out to be the most intellectually stimulating film of all time, but if you’re after a heartfelt – and maybe slightly trashy – Christmas movie this December, look no further than Netflix’s latest effort.",
    "Now available to stream on Netflix"
  ],
  "headers": {
    "3": "Money Heist season 5 part 2 (Netflix)",
    "7": "The Power of the Dog (Netflix)",
    "11": "Harlem (Prime Video)",
    "15": "It's Always Sunny in Philadelphia season 15 (Hulu)",
    "19": "Santa Inc (HBO Max)",
    "23": "Alex Rider season 2 (Prime Video)",
    "27": "Single All the Way (Netflix)"
  },
  "links": {
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "best Netflix movies": "https://www.techradar.com/best/best-netflix-movies",
    "Doctor Strange 2": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more"
  }
}