{
  "source": "https://www.techradar.com/news/googles-new-submarine-web-cable-will-carry-millions-of-4k-videos-simultaneously",
  "title": "Google's new submarine web cable will carry millions of 4K videos simultaneously",
  "category": "computing",
  "updated": "2021-09-15T10:34:25Z",
  "author": "joel-khalili",
  "summary": "The Grace Hopper cable will deliver record-breaking capacity",
  "article": [
    "Google has revealed its latest submarine web cable will soon be open for business, having docked successfully in the UK.",
    "Announced in July 2020, the Grace Hopper cable (named after the creator of COBOL) connects the UK, US and Spain and will provide additional capacity and resilience across these communications corridors.",
    "As per a Google blog post, the cable will be the first to connect the UK and US since 2003, and will play a major role in supporting collaboration between businesses across the Atlantic.",
    "“Many people around the world use Google products every day to stay in touch with friends and family, travel from point A to point B, find new customers or export products to new markets,” noted Google.",
    "“As our first Google-funded cable to the UK, Grace Bopper is part of our ongoing investment in the country, supporting users who rely on our products and customers using our tools to grow their business.”",
    "The project also marks Google’s first investment in a submarine cable docking in Spain and will serve to knit the Google Cloud region in Madrid with the company’s wider global infrastructure.",
    "Courtesy of a whopping 16 fiber pairs, the Grace Hopper Cable will boast a record-breaking capacity of 340 Tbps, which Google says is equivalent to roughly 17.5 million people streaming 4K videos at once. The current record is held by Google’s Dunant cable, which delivers 250 Tbps.",
    "The new cable also benefits from a new “fibre switching” technique that is said to minimize the likelihood of blackouts.",
    "“Grace Hopper will use this new switching architecture to provide optimum levels of network flexibility and resilience to adjust to unforeseen failures or traffic patterns. This multi-directional switching architecture is a significant breakthrough for uncertain times,” explained Jayne Stowell, who works on the project at Google Cloud.",
    "According to Stowell, the new cable will carry traffic “quickly and securely” across the Atlantic Ocean, propping up popular Google services, like Gmail and Meet.",
    "Over the last year, Google has announced a slew of new undersea web cables as it looks to meet global demand, including Firmina, Dunant, Apricot, Blue and Raman. In total, the company now holds at least a share in nineteen different cable networks."
  ],
  "headers": {
    "6": "Record-breaking capacity"
  },
  "links": {
    "submarine web cable": "https://www.techradar.com/news/internet-access-hangs-by-a-thread-for-hundreds-of-millions",
    "COBOL": "https://www.techradar.com/news/the-programming-language-that-doesnt-want-to-die",
    "blog post": "https://blog.google/around-the-globe/google-europe/united-kingdom/our-grace-hopper-subsea-cable-has-landed-uk/",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Firmina": "https://www.techradar.com/news/google-is-running-a-new-undersea-web-cable-between-the-us-and-south-america",
    "Dunant": "https://www.techradar.com/news/google-connects-subsea-cable-between-us-and-europe",
    "Apricot": "https://www.techradar.com/news/google-facebook-join-forces-on-new-submarine-internet-cable",
    "Blue and Raman": "https://www.techradar.com/news/google-is-build-two-more-whopping-submarine-internet-cables"
  }
}