{
  "source": "https://www.techradar.com/news/xbox-series-x-just-got-another-120hz-compatible-game-and-its-free-with-xbox-game-pass",
  "title": "Xbox Series X just got another 120Hz-compatible game – and it's free with Xbox Game Pass",
  "category": "gaming",
  "updated": "2021-02-01T17:13:32Z",
  "author": "nick-pino",
  "summary": "Sea of Thieves now has a Performance Mode upgrade for 120fps at 1080p gameplay",
  "article": [
    "Your days of motion-induced sea sickness are over: Sea of Thieves will now run at a buttery-smooth 120 frames per second on Xbox Series X.",
    "The visual upgrade was announced in a post on Xbox Wire, where it detailed some of the big changes coming to Rare’s pirate epic. These changes include a whole slew of brand-new Lost Shipment Voyages and 100 levels of premium rewards. The update will be free for all players with Xbox Game Pass and across Xbox Series X, Xbox Series S, Xbox One, Windows 10 PC and Steam.",
    "The catch here is that the game will only run at 120 frames per second on Xbox Series X in 1080p – not full 4K – and in an extended FAQ Microsoft says that some TVs might not support both HDR and Performance Mode simultaneously, which means you might have to manually disable HDR.",
    "That being said, if you want to see the seas in all their glory, 4K/60 with HDR is still an option if you so choose thanks to the update that came to the game back in November when Xbox Series X and Xbox Series S first launched.",
    "Since the consoles’ launch a few months ago, we haven’t seen many 120fps Performance Mode games – at least, not as many as we thought there’d be considering that Microsoft made 4K/120 such a selling point for the console.",
    "Adding a Performance Mode for Sea of Thieves doesn’t completely remedy the situation, but it certainly is a push in the right direction, especially considering that the game is so widely available via Xbox Game Pass.",
    "Microsoft’s next big first-party high-framerate game, Halo Infinite, isn't due out until much later this year, so be sure to pace yourself on your smooth-sailing adventure and don't breeze right through it."
  ],
  "headers": {
    "4": "Expanding the horizon for higher frame rate console games"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "post on Xbox Wire": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1323799280700694300&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F01%2F28%2Fsea-of-thieves-season-one-available-now%2F",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite"
  }
}