{
  "source": "https://www.techradar.com/news/oculus-gaming-showcase-heres-every-new-vr-game-heading-to-oculus-quest-2",
  "title": "Oculus Gaming Showcase: here's every new VR game heading to Oculus Quest 2",
  "category": "gaming",
  "updated": "2021-04-22T09:18:22Z",
  "author": "gerald-lynch",
  "summary": "The complete rundown on Oculus VR’s first gaming-focussed show",
  "article": [
    "The Oculus VR platform is going from strength to strength at the moment, and the virtual reality leader was out in full force for first ever Oculus Gaming Showcase on April 21.",
    "Focussing purely on the gaming software heading to the range of virtual reality headsets, it featured all-new games like Pistol Whip: Smoke and Thunder, new episodes of existing Star Wars VR title Tales from the Galaxy’s Edge, and a better look at most-wanted games like Lone Echo II and After the Fall.",
    "Here’s everything to get excited about, heading to Oculus Quest, Oculus Quest 2 and Oculus Rift headsets soon.",
    "One of the best VR games out there, Pistol Whip, is adding new Wild West-themed levels for its players. The Smoke and Thunder expansion will let you experience life as a gunslinging cowboy, adding to the John Wick-esque and Cyberpunk-themed levels that were already available.",
    "If that wasn’t enough, another add-on called The Concierge will give Pistol Whip players complete customisation options for levels. Whether you want to blast through enemies with endless ammo or leave your weapon behind on a pacifist run, there’s a load of brand new modifiers that will let you play however you want.",
    "We don’t have much to go on with a release date, but Pistol Whip: Smoke and Thunder + The Concierge should release this “Summer” (June, July or August, globally) on Oculus Quest and Rift headsets.",
    "Finally confirmed, we recently received confirmation that Resident Evil 4 was making the jump to VR. And during today's showcase, we got a much better look at how the game is going to feel when translated to an in-headset gameplay style.",
    "Port developers Armature have made lots of adjustments to make Resident Evil 4 work in VR. According to Oculus, \"Weapons and items have been re-engineered as physical objects you can pick up and interact with. You’ll also be able to switch weapons by grabbing them off your body instead of going into a menu, and you can wield separate weapons with each hand.",
    "\"You’ll still move in first-person by using the analog stick, but Armature has added a full upper-body rig on top of Leon’s character to combine his movement with the dual-handed interactivity achieved with Touch controllers. They’ve even added support for teleportation and room-scale movement, so you can explore the environment however you choose.\"",
    "It'll be hitting Quest 2 headsets, and only Quest 2 headsets, later in 2021.",
    "As a follow up to the recent Last Bastion update for Warhammer 40,000: Battle Sister, from today you and a friend will be able to shred through the horde mode together on two brand new maps.",
    "A chunky shooter that feels like a mash-up of Warhammer lore with a first-person take on Gears of War gameplay, it’s a fun-first step into VR for Warhammer, and looks impressive on the standalone Quest headset.",
    "Warhammer 40,000: Battle Sister is currently only on Quest – it was incorrectly said to be coming to Rift devices today – though it will be arriving on the Rift devices too \"soon\".",
    "The original Lone Echo remains one the absolute best virtual reality experiences out there, with its incredibly intuitive momentum-based movement system. Taking advantage of zero-gravity effects, you simply grab hold of a virtual surface and launch yourself off to navigate its space-bound mysteries.",
    "Lone Echo II then is one of the most eagerly anticipated of all Oculus titles in development. And while we didn’t get a launch date beyond “Summer 2021” (between June and August) at the Oculus event, we did get a great look at the zero-G return to the rings of Saturn. Get this one on your wishlist, folks.",
    "Can’t get enough of that galaxy far, far away? Oculus owners can return to ILMxLAB’s take on the Star Wars universe as Tales From the Galaxy’s Edge returns for its second installment.",
    "The new concept art for the upcoming Star Wars VR adventure introduces players to Dok-Ondar, one of those mysterious hammerhead-looking aliens that always seem to be knocking around the cantinas of Tatooine. Still no official release date for this installment, though, beyond a “2021” window.",
    "Inspired by the classic James Bond line, I Expect You To Die is getting a sequel, offering you even more spy-themed missions to take on – should you choose to accept them.",
    "The original is a hilarious VR puzzle game that puts you in the shoes of an elite super spy as you contend with deadly traps and faulty gadgets. I Expect You To Die 2 looks set to deliver more of the same, and given that what we had was some of the best gameplay VR has to offer we aren’t disappointed.",
    "There’s no official release date yet, but I Expect You To Die 2 is set to release sometime later this year on both Rift and Quest devices.",
    "1080 Snowboarding on the Nintendo 64 was a much-loved extreme sports title from the early days of 3D gaming. Its creator, Giles Goddard, is returning to the snowy slopes to give you a first-person view of the snowboarding action.",
    "Chuhai Labs is the development team behind the game, having previously worked on Halloween Forever, Tinker Trains and an upcoming PlayDate title. It’ll be its first full VR title, so we’re hoping it’s up to the task of translating what’s already a stomach-turning sport in real life into a comfortable virtual reality experience. Note that yes, you can pet the dog in the log cabin, too.",
    "Vertigo Games is following up its hit game Arizona Sunshine with yet another zombie apocalypse survival experience. After the Fall will pit you and up to three other players against scores of icy undead monsters in a snow-covered post-apocalyptic LA.",
    "We’ve seen a bit of After the Fall before, but the Oculus Games Showcase has given us an exclusive new look at what the game has in store. It's looking a little Left 4 Dead with its multiplayer, and a little The Last of Us with its setting, with a really impressive number of baddies onscreen at once.",
    "After the Fall will be hitting Quest and Rift devices this “Summer” – that’s some time over the coming June, July and August months. We’ll keep you posted on its final release date as we find out more.",
    "Get ready to explore the horrifying mysteries of Barclay Mansion in Wraith: The Oblivion – Afterlife. Set in a universe of stories known as World of Darkness, this VR adventure will release on Quest and Rift platforms on April 22, 2021 (at the time of writing, only a few hours away!)",
    "Trapped between life and death, you’ll play as Ed Miller as he tries to uncover the truth behind his untimely death, using new-found spectral abilities. Wraith: The Oblivion – Afterlife looks like it’ll prove even ghosts have a reason to fear the creatures that go bump in the night.",
    "If you want to get more out of the VR games you already love, The Climb 2 and The Walking Dead Saints & Sinners are getting free updates and new content drops.",
    "The Climb 2 will launch the first half of its Freestyle Expansion Pack tomorrow, consisting of six new levels with both casual and professional difficulty levels. For those looking for even more of a challenge, new rhythm-based climbs will see climbing routes altered by the beat of background tracks.",
    "The Walking Dead: Saints & Sinners on the other hand is getting the Aftershocks update, with the creeps from The Reserve looking to steal your supplies and turn human-against-human in the zombie-filled world..."
  ],
  "headers": {
    "3": "Pistol Whip is heading to the Wild West",
    "6": "A better look at Resident Evil 4 VR",
    "10": "Warhammer 40,000: Battle Sister gets multiplayer update",
    "13": "Lone Echo II gets a zero-G launch window",
    "15": "Part II of Star Wars: Tales From the Galaxy’s Edge incoming",
    "17": "I Expect You To Die 2 will let you live all new James Bond VR fantasies",
    "20": "Carve Snowboarding reimagines an N64 classic for VR",
    "22": "After the Fall is a chilling VR shooter from the Arizona Sunshine team",
    "25": "Wraith: The Oblivion – Afterlife is still looking horrifyingly good",
    "27": "Big updates coming to The Climb 2 and The Walking Dead Saints & Sinners"
  },
  "links": {
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Rift": "https://www.techradar.com/reviews/oculus-rift-s-review"
  }
}