{
  "source": "https://www.techradar.com/news/forget-black-friday-the-airpods-pro-just-dropped-to-169-the-lowest-price-ever",
  "title": "Forget Black Friday, the AirPods Pro just dropped to $169.99 - the lowest price ever",
  "category": "audio-visual",
  "updated": "2021-11-22T16:52:09Z",
  "author": "mackenzie-frazier",
  "summary": "The all-new AirPods Pro drop to record-low ahead of Black Friday",
  "article": [
    "We're just days away from the official Black Friday deals event, and Amazon just dropped an incredible offer on Apple's all-new AirPods Pro. Right now, you can get the best-selling AirPods Pro on sale for a new record-low price of $169.99 (was $249). That's a massive $79 discount and $30 less than last week's price. Black Friday AirPods deals are always the hottest bargains come November, which is why we were so delighted to see Amazon drop the AirPods Pro to a record-low price today.",
    "Something to keep in mind, Walmart will have the earbuds on sale for $159 during its Black Friday sale, which kicks off tonight at 7 PM ET. We have a feeling that availability will be short-lived, and grabbing them at that price might be rather tricky. If you want to get your hands on the AirPods Pro right now, then grab this epic Black Friday deal while you can.",
    "Apple's all-new AirPods Pro now come with a Magsafe Charging Case which provides more than 24-hours of total listening time and can be charged using a Qi-compatible charging mat or using a Lightning connector. The wireless earbuds feature Apple's powerful H1 Chip and include Active Noise Cancellation to block out unwanted noise. The sweat-resistant AirPods also come with new silicon tips in three different sizes to provide a more comfortable and secure fit.",
    "You can also see our guide to the best Black Friday AirPods deals and shop for more bargains with our Amazon Black Friday deals guide."
  ],
  "headers": {
    "2": "Black Friday AirPods Pro deal",
    "3": "More Black Friday AirPods deals"
  },
  "links": {
    "a new record-low price of $169.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MLWK3AM-A-New-AirPods%2Fdp%2FB09JQMJHXY%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1017626946686512800-20",
    "on sale for $159": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-1062649308626949900&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fstore%2F2648-san-leandro-ca%2Fweekly-ads",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Black Friday AirPods deals": "https://www.techradar.com/black-friday/apple-airpods-black-friday-deals-2021-what-to-expect-this-year",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals"
  }
}