{
  "source": "https://www.techradar.com/news/the-google-pixel-6-price-is-all-over-the-place-heres-what-youll-be-paying",
  "title": "The Google Pixel 6 price is all over the place – here’s what you’ll be paying",
  "category": "phones",
  "updated": "2021-10-20T13:17:06Z",
  "author": "david-lumb",
  "summary": "Know what you’re paying for the Google Pixel 6",
  "article": [
    "The Google Pixel 6 and Google Pixel 6 Pro have launched, and they have pretty attractive list prices. But if you’re looking across carriers and at online retailers, you might see different pricetags. Here’s why the price of Google Pixel 6 deals is all over the place – and what you’ll be paying.",
    "Google set a baseline price for each of its phones at the starting 128GB of storage level: $599 / £599 / AU$999 for the Pixel 6, and $899 / £849 / AU$1,299 for the Pixel 6 Pro. Interestingly, the latter’s price doesn’t seem to vary much on the market – it’s the Pixel 6 that’s showing different pricetags among carriers and retailers.",
    "The long and short of it: Google has released different versions of the Pixel 6 which vary between the model sold in the company’s online store and those provided by carriers that work with their own networks. What’s different? 5G capability – and support for more bands means higher prices.",
    "For instance, the version of the Pixel 6 sold by Google itself only supports sub-6 5G (2.4G/5GHz/6GHz bands) for that $599 price, and the Pixel 6 model T-Mobile sells also comes in at that $599 level with sub-6 5G only.",
    "The other two US mega-carriers, Verizon and AT&T, both confirmed to TechRadar that the Pixel 6 models they sell connect to their respective sub-6 and mmWave networks. These versions are pricier as a result: The Verizon Pixel 6 starts at $699, while AT&T’s Pixel 6 pricetag is $739.",
    "These pricetags are all broken down by installment agreements and can be hard to parse, but the prices can be defrayed, as each provider (even Google) offers different trade-in deals – Verizon, for instance, is offering up to $700 off either Pixel model if the buyer trades in their current phone. There are some caveats (older phones grant less trade-in value, and these deals require users to sign up for 5G-enabled plans), but it’s still some method to save money on a brand-new phone.",
    "To preempt one worry – yes, every version of the Pixel 6 has the same specs, cameras and features. The only difference is in 5G capability and cost.",
    "The confusion started when mobile analyst Anshel Sag tweeted about an official Google support post that laid out several Pixel 6 and Pixel 6 Pro models with varying 5G capabilities, along with which countries they’d be available in. Most confusing were multiple US versions that implied the Pixel 6 would be mmWave-only – the models sold by AT&T and Verizon.",
    "Both AT&T and Verizon confirmed to TechRadar that their Pixel 6 versions work with mmWave and sub-6 5G, so it may be a case of launch day confusion or errors in the support post.",
    "Regardless, the confusion over the versions and the differences in price are worth exploring to understand which version you'll want to buy from different carriers and providers."
  ],
  "headers": {
    "6": "Wait, which Google Pixel 6 do I have?"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "Google Pixel 6 deals": "https://www.techradar.com/deals/best-google-pixel-6-deals-and-google-pixel-6-pro-deals-to-pre-order",
    "sold by Google itself": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-3118333616398814700/https://store.google.com/us/product/pixel_6_specs?hl=en-US",
    "T-Mobile": "https://www.t-mobile.com/cell-phone/google-pixel-6?sku=810029932646",
    "Verizon": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9857803471867510000/https://www.verizon.com/smartphones/google-pixel-6/",
    "AT&T": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1155940005118403800/https://www.att.com/buy/phones/google-pixel-6-128gb-stormy-black.html",
    "Google support post": "https://support.google.com/pixelphone/answer/10082009?p=networkinfo&visit_id=637702654433294655-1347832788&rd=1#certified_carriers_table"
  }
}