{
  "source": "https://www.techradar.com/news/amazon-echo-buds-2nd-gen-vs-amazon-echo-buds-whats-new-with-the-true-wireless-earbuds",
  "title": "Amazon Echo Buds (2nd Gen) vs Amazon Echo Buds: what’s new with the true wireless earbuds?",
  "category": "audio-visual",
  "updated": "2021-07-15T15:54:34Z",
  "author": "olivia-tambini",
  "summary": "The Amazon Echo Buds 2 are here",
  "article": [
    "The Amazon Echo Buds were the tech giant’s first foray into the world of true wireless earbuds, and now the company has launched the next generation of the in-ear headphones.",
    "With the Echo Buds (2nd Gen), Amazon has made some substantial improvements on the original wireless earbuds, including swapping noise reduction technology for full-blown active noise cancellation.",
    "The original Amazon Echo Buds may have offered an affordable alternative to the Apple AirPods, but they left a lot to be desired when it came down to audio quality and battery life.",
    "To improve upon their predecessors, Amazon made the new Amazon Echo Buds 2’s case even smaller (by around 40%), and has taken a serious look at both its noise-cancelling technology and overall audio performance. The result is true wireless earbuds that cancel even more ambient noise than before and sound better, too – plus they’re easier to carry around.",
    "So, which Echo Buds should you buy? We've taken an in depth look at both models to help you make the right decision – and with Prime Day 2021 coming up soon, it's a great time to arm yourself with the knowledge you need.",
    "The new Amazon Echo Buds (2nd Gen) are available to buy now in the US for an introductory price of $100, and while global availability is still to be confirmed, that works out at around £70 / AU$130.",
    "That makes the new earbuds around $30 less than the original Echo Buds, so it’s a no-brainer as to which model you should go for if you’re looking to save money (though it’s entirely possible the first-gen Echo Buds will be discounted heavily in the near future).",
    "However, that introductory price will come to an end – when, we don’t know – and you’ll be looking at paying $120 for the Echo Buds 2.",
    "You’ll also have to pay more with the Echo Buds (2nd Gen) with the wireless charging case. During the introductory period, you can get this model for $120, with the price set to rise to $140 (about £100 / AU$180).",
    "It's worth bearing in mind that both models are likely to be discounted in the upcoming Prime Day deals – so it might be worth holding off until then to buy them, particularly if you're interested in the first-gen Echo Buds.",
    "The new Amazon Echo Buds (2nd Gen) don’t look wildly different from their predecessors, retaining the rounded housings and touch controls – but there are a few key differences between the two models.",
    "Firstly, they’re smaller and lighter. Amazon says that the earbuds themselves are 20% smaller than the previous generation, while the charging case is 40% smaller.",
    "The charging case has also been redesigned, eschewing the flat build and large lid for a deeper, more compact form.",
    "Another difference between the generations is a new laser-drilled vent inside the earbuds themselves, which is designed to relieve pressure build up, as with the Powerbeats Pro.",
    "In the time we’ve spent with the new Echo buds, we found them to be more comfortable than their predecessors, though they did stick out of our ears a little, which can be awkward if you’re wearing a hood or using them while lying down on your side.",
    "Like the original Echo Buds, the new model comes with an IPX4 water-resistance rating, making them suitable for use while working out, as well as a selection of eartips and wings that should help you to find a secure fit.",
    "To enhance that fit even further, Amazon has made use of the earbuds’ built-in microphones. During setup, the Alexa app will tell you whether you have achieved a good seal by playing a few tones and analyzing how much sound leaks through to those external mics – and as achieving a great seal is crucial if you want the best sound quality and noise cancellation, it’s a feature we appreciate.",
    "The Amazon Echo Buds (2nd Gen) offer a big improvement in sound quality compared to the original Echo Buds, which we found delivered muddy bass and the mids lacked fidelity. By comparison, the 2nd Gen Echo Buds deliver far more detail, with great left/right separation and a rich tone.",
    "No song we tested had as wide of a soundstage as you’d expect from a pair of open-back over-ear headphones, but there’s definitely a higher level of clarity than before.",
    "Still, neither model comes with support for hi-res audio, nor spatial audio formats like the Sony WF-SP800N and Apple AirPods Pro do.",
    "Unlike the original Echo Buds, the new version comes with full active noise cancellation. We found that the ANC technology is fine for blocking out regular household noise with your music on, but we think they’d struggle to make a dent in the rumbling sound of an airplane cabin or a subway carriage.",
    "Even so, there’s been a significant improvement to the way the Buds cancel sound – Amazon claims that the new Echo Buds block out about twice as much sound as their predecessors. That makes sense considering the original Amazon Echo Buds featured noise reduction technology rather than outright active noise cancellation, and it’s certainly a welcome upgrade.",
    "According to Amazon, the new Echo Buds should last about five hours with ANC and voice detection enabled, with the case providing another 10 hours of juice. That number seems accurate to us based on our usage, though you can eke out a little more from the earbuds with those features switched off (about 6.5 hours).",
    "That’s actually not as impressive as the original Echo Buds, which offered five hours of charge from the earbuds, and a further 15 from the charging case. It’s a shame that Amazon hasn’t made an improvement here, with the best noise-cancelling earbuds offering much longer playback times.",
    "Both Echo Buds generations come with (surprise, surprise) Alexa integration. That means that the earbuds are always listening for an Alexa command (unless you turn this feature off), allowing you to control your music playback hands free, as well as asking the assistant to carry out tasks, tell you the news, and create calendar events. It’s a great feature, as long as you’re an Alexa devotee.",
    "While having Alexa built into the earbuds is nice and can be a real time-saver, we wish there was a faster way to access our default voice assistant without having to go into the settings and set that up. Thankfully, Amazon makes the option available through Alexa app, so it's not a huge hassle to setup.",
    "Connectivity seems to be unchanged between the two models; both use Bluetooth 5, which should offer a stable connection to your device.",
    "If you're looking for the best Amazon earbuds you can buy today, the Echo Buds (2nd Gen) are the clear winner.",
    "They’re smaller and lighter, and come with the option of wireless charging thanks to a redesigned case. We think they sound better too, with a more refined audio performance that reveals plenty of detail in your music.",
    "And, with the addition of true noise cancellation as opposed to noise reduction, the Echo Buds (2nd Gen) can finally stand up against the likes of the AirPods Pro and the Sony WF-1000XM3 (even if they’re not quite as effective). It’s not all good news though; the battery life has inexplicably been reduced, bringing it down to levels we wouldn’t expect from a pair of class-leading true wireless earbuds.",
    "In short, they’re superior to the original buds in (nearly) every way. However, the original Echo Buds are likely to be heavily discounted now that they've been usurped. So, if you're looking for a bargain and don't mind eschewing noise cancellation or the superior sound quality offered by the second-gen buds, you may still want to opt for the older Echo Buds."
  ],
  "headers": {
    "5": "Amazon Echo Buds (2nd Gen) vs Amazon Echo Buds: price and availability",
    "10": "Amazon Echo Buds (2nd Gen) vs Amazon Echo Buds: design",
    "17": "Amazon Echo Buds (2nd Gen) vs Amazon Echo Buds: audio performance",
    "20": "Amazon Echo Buds (2nd Gen) vs Amazon Echo Buds: noise cancellation",
    "22": "Amazon Echo Buds (2nd Gen) vs Amazon Echo Buds: battery life and connectivity",
    "27": "Takeaway"
  },
  "links": {
    "Amazon Echo Buds": "https://www.techradar.com/reviews/amazon-echo-buds",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Echo Buds (2nd Gen)": "https://www.techradar.com/reviews/amazon-echo-buds-2nd-gen",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "over-ear headphone": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Sony WF-SP800N": "https://www.techradar.com/reviews/sony-wf-sp800n",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}