{
  "source": "https://www.techradar.com/news/everyone-takes-time-out-so-running-watches-need-injury-recovery-modes",
  "title": "Everyone takes time out, so running watches need injury recovery modes",
  "category": "wearables",
  "updated": "2021-08-01T09:59:59Z",
  "author": "tom-bedford",
  "summary": "Rest and recover",
  "article": [
    "If you've been keeping up with my columns about my journey to digitally run Route 66 – firstly, thank you sincerely for that! – then you might also have been following the figures I share about the distance I have achieved. If that's the case, then you may well have noticed that, since my last column, I've barely traveled anywhere.",
    "As a result of two foot injuries, I've had to take time out from my usual schedule of running and walking, which has meant I've only managed a pitiful 16.37 miles in two weeks. This is way short of the weekly minimum average of 21.91 miles per week required to complete this challenge – and far short of my previous average of just over 30 miles journeyed weekly.",
    "Luckily, I was way ahead of schedule. As such, a couple of weeks off is unlikely to ruin my chances of completing the challenge of traveling Route 66's 2,278 miles in the required two years.",
    "In fact, just as I'd adjusted to the thought of putting my feet up for several weeks while I recovered, eating homemade cookies and watching some movies, I noticed a single word on my running watch that ruined all that.",
    "I've been using the Polar Vantage M2 to track the distance I've been covering, and overall I've been pretty impressed by it. Like many running watches and smartwatches, it has a feature that charts your changing fitness over time, to give you a greater sense of accomplishment or context.",
    "However, when I looked at the watch a few days after my injury, it had the word 'Detraining' plastered along the main watch face. Yep, the device was shaming me for my lack of exercise.",
    "You can change the Vantage M2 watch face, but each option is a different fitness metric, and each is critical. 'This week 0h 54m' (of exercising) one said; 'Last training session a week ago' another told me. In fact, most of the watch faces were giving me bad news about the state of my fitness (and others gave me negative forecasts about the state of the weather).",
    "In other words, my watch wasn't exactly showing any sympathy about my inability to exercise.",
    "The issue isn't exclusive to the Polar Vantage M2, of course. A co-worker shared a screenshot from the Adidas Running App they use, which awarded them a big red cross on their workout record when they were unable to work out.",
    "Obviously, it isn't fun to view these wrist-mounted reminders that you're not getting the exercise you need to. They were compounding the anxiety I was already feeling about letting my body down. But the issues run deeper than that.",
    "Following a few days of 'Detraining', I decided to show my watch that it isn't the boss of me, and went on a walk. It wasn't a particularly long one – just a couple of kilometers – but lengthy enough to justify tracking it with the device. I didn't want to be 'Detraining' anymore.",
    "As you can imagine, this was an awful idea – it set me back on my road to recovery by quite some way.",
    "I've written before about how the language of fitness trackers can affect performance, so those of you who read that column will know that I'm not crazy about being pressured by my watch. I've also covered how it's very easy to get turned away from using a wearable for workouts, too.",
    "By reminding me of my fitness failures, the watch had shamed – or pressured – me into working out before my body was ready to do so. Other folk in this position may have reacted in the same way – or maybe I'm just more easily led by peer pressure.",
    "So what's the solution? Because you can't just remove health information from running – that's basically the point of them. In my opinion it's as easy as introducing injury modes.",
    "Smartwatches and fitness trackers provide all manner of metrics to monitor your health and fitness. They can keep tabs on your sleep and circadian rhythm, menstrual cycle, heart rate, stress, food intake and calories, sedentary time and, of course, overall fitness (depending on your device, of course – not all watches do everything).",
    "Injury time, then, would be a natural addition to the suite. Perhaps you could tap in information about the type of injury you had sustained, so that the device would calm down on the workout reminders for a little while.",
    "Not only that, but the watch could advise you on recommended behaviors during the injury time – reminding you to rest up, if necessary, and to get enough sleep, or let you know when you'd be able to exercise again. The device could even help you build up your strength after the fact, by recommending certain courses and tasks that'd be suitable depending on your injury.",
    "Obviously, these are all just pie-in-the-sky ideas, which have come to mind from as a result of my current troubles.",
    "But with running watches and smartwatches increasingly part of many people's day-to-day health routines, not just a part of their actual workouts, this type of mode would totally make sense.",
    "A workout injury mode wouldn't stop me from getting hurt in the first place, nor impact my pace on the Route 66 challenge (not that the latter matters too much, since I'm 150 miles ahead of where I need to be – it's my marathon training that's been most affected). However, it would certainly stop the constant shame I've been receiving from my gadget – and make the road to recovery (and long-distance running) that little bit easier."
  ],
  "headers": {
    "4": "Detraining",
    "9": "Pressure to run",
    "15": "Time's up for time out"
  },
  "links": {
    "my journey to digitally run Route 66": "https://www.techradar.com/news/im-running-across-the-entirety-of-america-and-i-cant-do-it-without-technology",
    "the language of fitness trackers can affect performance": "https://www.techradar.com/news/this-trivial-smartwatch-feature-helped-me-improve-my-running",
    "it's very easy to get turned away from using a wearable for workouts": "https://www.techradar.com/news/running-across-the-us-has-me-using-my-smartwatch-completely-differently"
  }
}