{
  "source": "https://www.techradar.com/news/adobe-photoshop-and-illustrator-are-coming-to-your-web-browser",
  "title": "Adobe Photoshop and Illustrator are coming to your web browser",
  "category": "computing",
  "updated": "2021-10-27T18:00:48Z",
  "author": "anthony-spadafora",
  "summary": "Adobe is extending Photoshop and Illustrator to the web",
  "article": [
    "Collaborating with others using Adobe's graphic design software will soon be even easier as the company has announced that two of the most popular products from Creative Cloud will soon be available on the web.",
    "At Adobe MAX 2021, the company revealed that Photoshop and Illustrator are coming to your browser to help give others a voice in the creative process.",
    "Up until now, creative teams had to rely on other online collaboration tools to give feedback and work together online. By extending Photoshop and Illustrator to the web, even those who don't have access to Adobe's photo editor and graphic design software will be able to contribute.",
    "Now when a user shares cloud documents from Adobe's software, collaborators will be able to review their creative work and add comments right from their browser without having to download any apps or subscribe to Creative Cloud. At the same time, their comments will show up in the Photoshop and Illustrator desktop and iPad apps so users don't have to break their creative flow as collaboration happens.",
    "In addition to comments and feedback, Adobe is also previewing some basic editing tools in the browser to allow collaborators to make minor tweaks and quick edits without having to launch the full versions of its software.",
    "In order to start sharing Photoshop and Illustrator documents to the web for commenting and feedback, users of Adobe's software will first need to update to the latest versions of the apps.",
    "Photoshop on the web is currently in public beta with basic editing capabilities. To access the beta, users need to click on the “Open in Photoshop on the web beta” in the header when viewing a Photoshop file in their browser.",
    "Illustrator on the web meanwhile also features basic editing capabilities but is only currently available in a private beta. Interested users can head to this website to request access to join the beta program.",
    "Now that Photoshop and Illustrator will soon be available via a browser, we'll have to wait and see if Adobe decides to bring InDesign, Lightroom or other Creative Cloud apps to the web as well.",
    "We've also featured the best graphic design software and best photo editors"
  ],
  "headers": {
    "5": "Photoshop and Illustrator on the web"
  },
  "links": {
    "graphic design software": "https://www.techradar.com/best/best-graphic-design-software",
    "Creative Cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "Adobe MAX 2021": "https://www.techradar.com/news/adobe-max-2021-the-5-best-new-features-coming-to-lightroom",
    "browser": "https://www.techradar.com/best/browser",
    "online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "photo editor": "https://www.techradar.com/news/best-photo-editor",
    "Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021",
    "Illustrator": "https://www.techradar.com/how-to/try-adobe-illustrator-for-free-or-with-creative-cloud",
    "head to this website": "https://asurveys.decipherinc.com/survey/selfserve/9d5/g013/211012?list=1#?",
    "InDesign": "https://www.techradar.com/how-to/try-adobe-indesign-for-free-or-with-creative-cloud",
    "Lightroom": "https://www.techradar.com/reviews/adobe-photoshop-lightroom-cc",
    "best graphic design software": "https://www.techradar.com/best/best-graphic-design-software",
    "best photo editors": "https://www.techradar.com/news/best-photo-editor"
  }
}