{
  "source": "https://www.techradar.com/news/is-the-force-strong-enough-at-quantic-dream-to-handle-a-star-wars-game",
  "title": "Is the Force strong enough at Quantic Dream to handle a Star Wars game?",
  "category": "gaming",
  "updated": "2021-09-20T09:05:43Z",
  "author": "gerald-lynch",
  "summary": "From Heavy Rain to heavy blasters",
  "article": [
    "Is the Force strong with Quantic Dream? New rumors point to the French studio, responsible for games like Heavy Rain, Beyond: Two Souls and Detroit: Become Human, becoming the next developer to try its hand at a Star Wars game.",
    "Now, take what follows with a pinch of salt, as the rumor originates from YouTuber Gautoz rather than our own source. The French gaming commentator stated that \"[Quantic Dream have] now finished their contract with Sony and will be signing with Disney.”",
    "They also claim that the studio’s recent clampdown on its alleged hostile working environment was in part in order to secure the Star Wars license with Disney.",
    "The rumor was further elevated by DualShockers’ Tom Henderson, who tweeted an image from Detroit: Become Human that had been doctored to appear to include lightsabers, suggesting that they too had heard similar rumours.",
    "It’s not much to go on at the moment, but with the Star Wars license now free from the clutches of exclusivity at EA, and Quantic Dream cut loose from its Sony ties, it’s not impossible by any stretch. And it definitely suggests intriguing gaming possibilities.",
    "So, imagining that the current rumours prove true, what would a Quantic Dream game look like?",
    "From Farenheit (Indigo Prophecy) up to the impressive recent effort of Detroit: Become Human, Quantic Dream has always worked on narrative-focused games rather than action-oriented titles. You’d imagine that commitment to storytelling is what would have attracted Disney, if the rumors are true, and could lead to a different take on Star Wars in games, focusing less on lightsabers and blasters and more on mystery, intrigue and branching dialogue.",
    "The studio has always paired its cinematic ambitions with visual flair, too. Under the Sony partnership, the studio become something of a showpiece for the graphical capabilities of the last two PlayStation consoles.You’d imagine its eye for detail would continue into the rich Star Wars universe.",
    "It’s worth noting that Quantic Dream has been able to attract familiar Hollywood stars to its work previously. Beyond: Two Souls, for all its faults, offered two stellar performances from Elliot Page and Willem Defoe. The late David Bowie played two characters in the studio’s first game, The Nomad Soul, and offered ten original songs for its soundtrack. Could the stars of stage and screen be coaxed towards Quantic Dream’s cinematic storytelling style, or even some actors already seen popping up elsewhere in the Star Wars franchise?",
    "Having the restrictions of the Lucasfilm quality control team behind Quantic Dream could be beneficial too. Its titles, under the directorship of David Cage, are often conceptually magnificent, and rarely like anything else you find on consoles. But they can become a bit overblown, and buckle under the weight of their own ambition. Being tied into the stricter rules of the Star Wars universe could help deliver a more concise, direct game than the developer has managed before."
  ],
  "headers": {
    "5": "Analysis: a Quantic Dream Star Wars game blueprint"
  },
  "links": {
    "tweeted an image from Detroit: Become Human": "https://twitter.com/_Tom_Henderson_/status/1439237521347682305?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1439455870962839553%7Ctwgr%5E%7Ctwcon%5Es2_&ref_url=https%3A%2F%2Fwww.eurogamer.net%2Farticles%2F2021-09-19-new-rumours-reckon-quantic-dream-is-making-a-star-wars-game"
  }
}