{
  "source": "https://www.techradar.com/news/new-amd-radeon-pro-gpus-provide-the-ideal-platform-for-creatives",
  "title": "New AMD Radeon PRO GPUs provide the ideal platform for creatives",
  "category": "computing",
  "updated": "2021-08-05T18:01:02Z",
  "author": "anthony-spadafora",
  "summary": "New workstation GPUs bring AMD RDNA 2 to Mac Pro",
  "article": [
    "Mac Pro users looking to boost the graphical performance of their systems are in luck as AMD has announced a new GPU product line designed specifically for Apple's top-of-the-line workstation.",
    "The new AMD Radeon Pro W6000X series GPUs for Mac Pro deliver exceptional performance and incredible visual fidelity for a wide variety of professional applications and workloads including 3D rendering, 8K video compositing, color correction and more.",
    "Corporate VP and general manager of AMD's graphics business unit, Scott Herkelman explained in a press release that the company designed its new line of GPUs to help boost the productivity of creative professionals, saying:",
    "“We developed the AMD Radeon PRO W6000X series GPUs to unleash professionals’ creativity and help them bring more complex and compute-intensive projects to life, from animating 3D film assets to compositing 8K scenes to game development. The new AMD Radeon PRO W6000X series is packed with remarkable energy efficiency, enhanced compute units and a new visual pipeline, enabling Mac Pro users to do more in less time across a broad range of pro applications.”",
    "AMD's new Radeon Pro W6000X GPUs are built on the company's RDNA 2 architecture, AMD Infinity Cache and other advanced technologies to deliver the best graphics performance.",
    "The new workstation GPU line includes the AMD Radeon Pro W6900X and the AMD Radeon Pro W6800X which both feature 32GB of GDDR6 memory and only require 300W of power. However, Mac Pro users can also choose the AMD Radeon Pro W6800X Duo and this card has a dual-GPU configuration that leverages high-speed AMD Infinity Fabric interconnect technology for additional compute performance.",
    "Another thing that sets the AMD Radeon Pro W6800X apart from the other workstation GPUs in AMD's new line is the fact that it ships with 64GB of GDDR6 RAM along with 120 compute units and 7,680 stream processors.",
    "When Apple's Mac Pro launched back in 2019, it was already a powerhouse but now with the addition of AMD's new line of GPUs, the workstation will be even better equipped to handle the most demanding creative workloads."
  ],
  "headers": {
    "4": "AMD Radeon Pro W6000X series"
  },
  "links": {
    "Mac Pro": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/apple-mac-pro-1191682/review",
    "AMD": "https://www.techradar.com/news/amd-graphics-cards",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "press release": "https://www.amd.com/en/press-releases/2021-08-03-new-amd-radeon-pro-w6000x-series-gpus-bring-groundbreaking-high",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "RDNA 2": "https://www.techradar.com/news/amds-budget-friendly-rdna-2-gpus-could-be-on-the-way",
    "AMD Infinity Cache": "https://www.techradar.com/news/amds-infinity-cache-could-be-big-navis-secret-weapon-to-beat-nvidias-rtx-3000-gpus",
    "Infinity Fabric": "https://www.techradar.com/news/amd-threatens-to-wreck-nvidias-launch-party-with-monster-graphics-card-release",
    "creative workloads": "https://www.techradar.com/news/how-good-is-the-nvidia-geforce-rtx-3080-ti-for-creatives"
  }
}