{
  "source": "https://www.techradar.com/news/switching-to-cloud-security-is-already-paying-off-for-many-companies",
  "title": "Switching to cloud security is already paying off for many companies",
  "category": "computing",
  "updated": "2021-11-26T10:35:52Z",
  "author": "sead-fadilpasic",
  "summary": "Businesses are saving on hardware and appliance replacement",
  "article": [
    "The majority of businesses that have swapped from legacy to cloud security solutions have saved money as a result, new research suggests.",
    "SASE provider Netskope recently polled 700 IT professionals in Germany and the UK on their intentions and practices as the world shifts to a remote-first approach. It found that nearly four in five European businesses have saved on hardware and appliance replacement as a result of the shift to the cloud.",
    "Netskope says replacing “costly firewalls” (with Firewall-as-a-Service), in particular, produced savings for a fifth (21%) of IT teams, while many other businesses saved on VPN and bandwidth costs. Vendor consolidation has also created saving opportunities for a large proportion of firms (21%).",
    "These are not just a handful of early adopters, either. Netskope says 99.5% of research respondents are “undertaking network and security transformation projects in the next five years”, with more than half already underway or lined up for the next twelve months.",
    "However, challenges lie ahead. First, it’s not yet clear who should take responsibility for key transformation projects, nor who should pay. A quarter of IT leaders (27%) are leaving it up to the security team to fund both SASE and zero trust, while the same percentage lean on network and infrastructure teams.",
    "Most CIOs don’t plan on converging network and security budgets, despite many considering merging the teams. Furthermore, some respondents claim SASE is owned by networking teams, while a third (31%) said the responsibility was shared.",
    "This “inconsistency” in the market, Netskope concludes, will result in CISOs and CIOs continuing to fight over ownership of projects.",
    "Migrating to the cloud often means expanding the headcount and transforming organizational structure, as well. Many respondents expect to grow their security team, while others have already made changes to the structure or staffing of their networking team. Finally, almost half (46%) are struggling to find suitable candidates for their security roles.",
    "You might also want to check out our list of the best endpoint protection solutions"
  ],
  "headers": {
    "4": "Organizational challenges"
  },
  "links": {
    "cloud": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "firewalls": "https://www.techradar.com/best/firewall",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best endpoint protection": "https://www.techradar.com/news/best-endpoint-security-software"
  }
}