{
  "source": "https://www.techradar.com/news/apple-and-google-reportedly-remove-opposition-election-app-from-russian-app-stores",
  "title": "Apple and Google reportedly remove opposition election app from Russian app stores",
  "category": "phones",
  "updated": "2021-09-18T02:14:09Z",
  "author": "david-lumb",
  "summary": "Apple and Google reportedly comply with Russian authorities to take an election app offline",
  "article": [
    "Apple and Google have reportedly pulled a vote-assisting smartphone app from Russian app stores ahead of the country’s parliamentary election, according to Reuters.",
    "The ‘Smart Voting’ app was created by supporters of Alexei Navalny, imprisoned critic of the Russian government and President Vladimir Putin. Those supporters intended to use the mobile app to coordinate a tactical voting campaign to oppose the United Russia party, which is favored to win.",
    "Earlier in the month, the Russian government demanded Google and Apple remove the app from their respective app stores – failure to do so would be considered meddling in the election.",
    "Apple and Google each have complex histories dealing with the demands of governments while offering services in their countries. In 2020, Apple complied with Chinese authorities in suspending updates to apps that hadn’t been officially approved, while earlier in 2021, the company conceded to storing customer data from users in the country on Chinese soil.",
    "More recently, Russia blocked VPNs ahead of the parliamentary elections and fined Google and Facebook for not removing content violating the country’s laws – and specifically demanded Google and Apple remove the ‘Smart Voting’ app.",
    "After the app was removed, critics fired back, with Ivan Zhdanov, Executive Director of Navalny’s Team, tweeting that the move was “a mockery of common sense”:",
    "He also embedded a supposed screenshot of Apple’s notification that the ‘Smart Voting’ app had been taken down, which explained it was “because it includes content that is illegal in Russia, which is not in compliance with the App Store Review Guidelines.”",
    "Via AppleInsider"
  ],
  "headers": {
    "3": "Analysis: politics draw Apple and Google out of neutrality"
  },
  "links": {
    "Reuters": "https://www.reuters.com/world/europe/google-apple-remove-navalny-app-stores-russian-elections-begin-2021-09-17/",
    "demanded": "https://www.techradar.com/news/russia-blocks-top-vpn-services",
    "complied": "https://www.techradar.com/news/apple-could-pull-thousands-of-mobile-games-from-its-china-app-store",
    "conceded": "https://www.techradar.com/news/apple-will-keep-all-its-chinese-customer-data-stored-in-china",
    "blocked": "https://www.techradar.com/news/russia-blocks-top-vpn-services",
    "AppleInsider": "https://appleinsider.com/articles/21/09/17/apple-google-drop-russian-opposition-app-ahead-of-election?utm_source=&utm_medium=&utm_campaign=RSS"
  }
}