{
  "source": "https://www.techradar.com/news/apple-knowingly-sold-defective-macbooks-judge-rules",
  "title": "Apple knowingly sold defective MacBooks, judge rules",
  "category": "computing",
  "updated": "2021-04-02T17:58:27Z",
  "author": "mayank-sharma",
  "summary": "Judge agrees that Apple had knowledge of the alleged defects",
  "article": [
    "A US federal judge has found merit in a lawsuit alleging that Apple sold defective MacBook Pro laptops despite being aware of the quality issues.",
    "Referred to in some circles as flexgate, the issue centers on MacBook Pro machines sold since 2016 that have notoriously flimsy flex display cables that apparently begin to wear out after a short period of use. This results in weird display anomalies, most notably the \"stage light\" effect, when too much backlight bleeds through the bottom bezel of the panel.",
    "In the lawsuit, the complainants allege that Apple’s extensive pre-release testing, which would have included stress tests, must surely have brought the issue with the cables to the company's attention.",
    "“The court finds that the allegations of pre-release testing in combination with the allegations of substantial customer complaints are sufficient to show that Apple had exclusive knowledge of the alleged defect,” wrote Judge Edward Davila in his order.",
    "Apple’s response to the issue when it first came to light didn’t help matters either. The complainants assert that not only did Apple silently replace the cables in newer MacBooks, but also that the firm deleted forum posts about the issue.",
    "The company is also said to have refused to replace the defective components, until thousands of users signed an online petition.",
    "Notably, flexgate has already led to one class action lawsuit based around the MacBook keyboard.",
    "However, according to Law360, although Judge Davila has allowed the flex cable lawsuit to proceed, he has narrowed its scope. A class-action lawsuit has not yet been certified, but the judge has invited the nine plaintiffs to submit a new amended complaint.",
    "Via The Verge"
  ],
  "headers": {
    "4": "In the know"
  },
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-13-inch-2020",
    "display": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "Apple silently replace the cables": "https://www.techradar.com/news/apple-quietly-addressed-macbook-pro-flexgate-in-2018-models-ifixit-claims",
    "keyboard": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011",
    "Law360": "https://www.law360.com/articles/1370714/apple-must-face-trimmed-defective-laptop-display-suit",
    "The Verge": "https://www.theverge.com/2021/4/1/22360781/apple-flexgate-stage-light-class-action-lawsuit-defective-cable"
  }
}