{
  "source": "https://www.techradar.com/news/the-matrixs-old-website-is-back-is-a-matrix-4-trailer-next",
  "title": "The Matrix 4 trailer is coming this week, as the old Matrix site is revived (updated)",
  "category": "entertainment",
  "updated": "2021-09-07T20:31:39Z",
  "author": "samuel-roberts",
  "summary": "The Matrix Resurrections trailer lands this Thursday",
  "article": [
    "Update: The official Matrix website's relaunch is indeed teasing a trailer. According to the teaser below, The Matrix 4 trailer will arrive at 6AM PDT on Thursday, September 9. It simply asks whether you want to take the red pill, or the blue pill.",
    "Heading to this website and clicking the blue pill unveils some brief shots of the movie ahead of the trailer drop – apparently there are thousands of combinations of images that it can show you from the movie, which is a nice touch. You'll see shots of Keanu Reeves and the other members of the cast, along with a few stunts from the movie.",
    "Original story: If you surfed the internet in the early part of the 2000s, you almost certainly visited WhatistheMatrix.com, one of the most notable early efforts to build a movie website that reflected the subject it was promoting.",
    "Now, that website has just been updated for the first time in a while – and it likely means we're about to learn more about The Matrix Resurrections, which is The Matrix 4's official title. While the website offers little more than a wall of Matrix code as it stands, and nothing is revealed by digging into the HTML, we'd expect that to change very soon.",
    "After all, we know a trailer for The Matrix Resurrections already exists. It was shown to exhibitors at CinemaCon late last month, behind closed doors – and considering the movie's release date is on December 22, it's probably time to start getting the public hyped up for it.",
    "We'd almost certainly expect to see a trailer in circulation by the time Warner's other big sci-fi movie for 2021, Dune, hits the big screen on October 22.",
    "In the US, The Matrix Resurrections is being released simultaneously in theaters and on the HBO Max streaming service. If you live in the UK and Australia, you'll have to watch it on the big screen.",
    "It's also worth noting that an official Twitter account now exists for The Matrix, though it's currently locked with only a single follower.",
    "As noted on Reddit, the official Matrix site was previously just used to promote home video releases of the old movies, as of late August 2021 (thanks, IGN). So this change has seemingly happened in the last couple of weeks.",
    "The 'What is the Matrix?' site was a densely detailed offering for something that existed just to sell a movie. It arrived around the time that studios were throwing extra effort into making a website part of a wider cross-media experience, something you also saw with some of The Matrix's contemporaries, like Donnie Darko.",
    "You could type in codes, play a 'Red pill' game, read comics and discover extras, with Warner Bros expanding it over time as the three original movies in The Matrix series released.",
    "Now, of course, we live in a more miserable age of five-second trailers before the trailers – but back then, it seemed pretty cool that so much imagination had gone in to this creation that reflected the subject matter of the movies so well.",
    "The website was apparently taken down in 2009, which is around the time the films' reputation was at an all-time low following the disappointing sequels. Now, though, nostalgia for early 2000s media is arguably pretty high, and giving it an update seems like a savvy move. This new sequel, from director Lana Wachowski and starring Keanu Reeves and Carrie-Ann Moss, among a roster of exciting new cast members, has a lot of potential to impress.",
    "So, while a promotional website for some old movies might sound like Millennial trash on paper, it is, in fact, gold to us.",
    "Some semblance of the old Flash site is available via the Wayback Machine."
  ],
  "headers": {
    "9": "What was the original site for The Matrix like?"
  },
  "links": {
    "this website": "https://thechoiceisyours.whatisthematrix.com/uk/",
    "WhatistheMatrix.com": "https://www.whatisthematrix.com/",
    "The Matrix Resurrections": "https://www.techradar.com/news/the-matrix-4-finally-gets-a-title-and-a-first-trailer-sort-of",
    "official Twitter account": "https://twitter.com/thematrixmovie",
    "Reddit": "https://www.reddit.com/r/matrix/comments/pjat2j/thematrixcom_whatisthematrixcom_have_just_been/hbwlrid/?utm_term=37725190789&context=3&utm_medium=comment_embed&utm_source=embed&utm_name=",
    "IGN": "https://www.ign.com/articles/hideo-kojima-teasing-matrix-4-resurrections",
    "via the Wayback Machine": "https://web.archive.org/web/20091027130805/http://whatisthematrix.warnerbros.com/"
  }
}