{
  "source": "https://www.techradar.com/news/how-to-run-safely-in-the-heat-top-athletes-share-their-tips",
  "title": "How to run safely in the heat – top athletes share their tips",
  "category": "fitness",
  "updated": "2021-07-20T12:05:17Z",
  "author": "cat-ellis",
  "summary": "Stay cool and safe when the mercury rises",
  "article": [
    "Many countries are experiencing record high temperatures right now, with a heatwave rolling over Canada and the US, and an extreme heat warning issued for the UK. That's bad news if you want to keep up your running, whether you're training for an event or just maintaining your fitness.",
    "To find out how you can stay safe and comfortable while running in hot weather, TechRadar spoke to two professional athletes who are used to staying active when the temperatures rise.",
    "Swiftwick athlete Amanda Foland is a certified personal trainer with the American College of Sports Medicine, and a sports nutrition specialist with the International Sports Sciences Association.",
    "\"Working out in the heat can be tricky,\" she says, \"Many times athletes go into their workouts with the intention of hitting a goal, but if not well hydrated and fueled beforehand, those goals may be saturated by the heat.",
    "\"As a coach and athlete myself, I mindfully take in plenty of water throughout the day, a salt tablet before my workout and if longer than 45 minutes another one to be sure my body is getting in sodium to adhere to the sodium/potassium pump that is in our heart.\"",
    "Foland explains that your choice of clothing is important as well. \"Other tips I live by [are] wearing light, looser, wicking gear that is comfortable, taking a water bottle during workouts, and spraying your head with water as needed to keep your body temperature lower.\"",
    "Earlier this year, Under Armor released a new line of Iso-Chill sportswear made from flattened acrylic fibers with a titanium dioxide coating. Having tested several garments ourselves, we can say that it definitely makes a difference, but works best to cool you off once your run is finished. The fabric is especially effective when saturated, either with sweat or some extra water from your bottle.",
    "Foland also encourages her athletes to keep sweat logs. \"This entails weighting pre/post workouts to address how much water is needed in a workout based off weight that is lost during that session,\" she says.",
    "\"Being mindful of how much time is spent in the heat is also important. Just like increasing mileage, increasing heat duration takes time, slow and steady with mindfulness of lower intensity and being aware of the signals your body is sending you.\"",
    "TechRadar also spoke to endurance runner and Nathan athlete Mike Wardian, winner of the US 50km championships in 2008, 2009 and 2010. He also won the US 50 mile championship in 2011, and the US National 100km championship in 2008. Here, he shares his advice for staying safe and comfortable when the weather heats up...",
    "Wear a hat I find even a visor can make a big difference in keeping cool in the summer heat. Something to block the sun really helps and lets you hide in the shadow, and just that little bit of shade can really help.",
    "Wet your body I like to put water from my Nathan hydration vest on my neck and the inside of my wrists and that I feel like can really cool you down and drop my heart rate, for me as much as 10 beats.",
    "Find the shade If you can look for every bit of shade or shadow you can find. Run close to buildings, under trees, or even over passes to get a break from the sun.",
    "Choose the time of day to run Unless you are training for a very hot race, you can time your runs at the coolest times of day or after a rain shower or in the evening after the sun goes down.",
    "Ice in your vest/pack/bottles Ice in the summer is your best friend – use it. I used to put ice in my Nathan handhelds and gripping an icy bottle really helps keep you cool.",
    "You can also use your fitness tracker or running watch to help you train when the weather heats up. Running in hot weather increases the load on your cardiovascular system, making your heart and lungs work harder than usual, so it's a good idea to keep the pace down Keep an eye on your watch during your run; if your heart rate is noticeably higher than you'd expect, try easing off.",
    "Some devices, including Garmin watches, allow you to set custom alerts that warn you if your heart rate dips below or rises above a certain rate. This can help you stick within a sensible heart rate zone during training.",
    "It's also a good idea to use a chest-strap heart rate monitor if you have one. It will respond more quickly to changes than a watch, and the sweat provides conductivity between your skin and the sensors.",
    "A smart scale can be a useful tool if you're keeping a sweat log. Many, including the Withings Body Cardio and Garmin Index S2, not only measure your weight, but use bioelectric impedance to estimate the volume of water in your body so you can more accurately track the amount of water you've lost as sweat."
  ],
  "headers": {
    "9": "Staying cool on long runs",
    "15": "Use your tech"
  },
  "links": {
    "Swiftwick": "https://classic.avantlink.com/click.php?tt=cl&mi=13814&pw=27131&ctc=trd-us-5612768563050723000&url=http%3A%2F%2Fswiftwick.com%2F",
    "Amanda Foland": "http://www.fitstudiotn.com/amanda-foland/",
    "Iso-Chill sportswear": "https://www.techradar.com/news/under-armours-new-smart-fabric-wicks-away-more-than-just-sweat",
    "Mike Wardian": "https://www.instagram.com/mikewardian/?hl=en",
    "Nathan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3330445077371671600&xs=1&url=http%3A%2F%2Fnathansports.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-run-safely-in-the-heat-top-athletes-share-their-tips",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "running watch": "https://www.techradar.com/best/running-watches",
    "increases the load on your cardiovascular system": "https://www.runnersworld.com/training/a20787851/what-pace-should-i-run-in-the-heat/",
    "Garmin watches": "https://www.techradar.com/best/garmin-watch",
    "heart rate monitor": "https://www.techradar.com/best/best-heart-rate-monitor",
    "smart scale": "https://www.techradar.com/best/best-smart-scales",
    "Withings Body Cardio": "https://www.techradar.com/reviews/withings-body-cardio",
    "Garmin Index S2": "https://www.techradar.com/reviews/garmin-index-s2"
  }
}