{
  "source": "https://www.techradar.com/news/tech-priorities-the-government-needs-to-take-seriously",
  "title": "Tech priorities the Government needs to take seriously",
  "category": "computing",
  "updated": "2021-04-13T14:08:21Z",
  "author": "clay-van-doren",
  "summary": "Do the Government's ten tech priorities go far enough?",
  "article": [
    "The challenge of building a future-oriented economy must start with technology. Only by using the right tools and unlocking the power of data will we be able to fuel economic growth, upskill our workforce and achieve our decarbonization goals.",
    "The Government’s announcement of its 10 Tech Priorities last week was a welcome acknowledgement of the role the tech sector will play in supporting the recovery from Covid-19. But despite this good start, there is much more to be done before the UK’s comprehensive Digital Strategy is finalized later this year.",
    "Three areas are particularly worthy of extra focus: the investment in the development of digital skills, an acceleration of the tech sector’s drive towards decarbonization, and the expansion of supply chains to support SMEs. With the right policy solutions, the UK can unlock the significant opportunities that exist in these areas.",
    "Firstly, crucial to building back better from the pandemic will be equipping workers with the necessary skills to thrive in this new economy. Taking its cue from the Government’s Lifetime Skills Guarantee, the Digital Strategy should place a particular emphasis on digital skills development.",
    "A digital skills gap can make workforce planning a profound challenge, one that could jeopardize the future of many enterprises. As an economy we must therefore focus on elevating and facilitating the digital skills of employees. In many ways, Covid-19 has accelerated this process by encouraging the adoption of processes which allow staff to upskill themselves digitally. By investing in the reskilling and upskilling of workforces, via online training and equipment provision, employers can close the digital divide within their own working environment.",
    "As well as looking within our own organizations for digital skills development, we as technology leaders must also equip other businesses with the technologies they need to keep pace with the rate of change, as these will play a vital role in helping UK businesses recover and thrive in a post-Covid world. That’s why we are investing €2bn over the next five years in our Atos OneCloud initiative, to help businesses adopt more agile, data-driven approaches.",
    "As we transition towards a digital economy, businesses should be looking at ways to modernize and become agile through digital transformation, embracing technologies such as cloud computing solutions, so that they flourish in this digital-first environment. We also welcome major investment in digital skills and graduate jobs, and hope that initiatives across the country ensure access to the best expertise now and in the future.",
    "Secondly, we know that new technologies will be critical in decarbonization efforts. Both Government and industry should be constantly searching for new solutions that not only increase productivity and growth but do so in a way that reduces the burden we place on our natural resources.",
    "The Government has set ambitious targets for achieving net zero, and as the UK prepares to host COP26 this November, it’s important that businesses consider how they can meet this challenge. Increased use of digital solutions such as cloud infrastructure, cloud data and cloud applications will directly lead to year-on-year carbon footprint reductions, meaning real change is genuinely achievable: helping Atos, for example, bring forward our net zero commitment to 2028.",
    "Finally, supply chain diversification is vital for businesses in the tech sector. It has been encouraging to see the Government acknowledge this in the telecommunications space – and we look forward to seeing further measures to support this across the wider digital economy in the Digital Strategy.",
    "If we are asking our digital entrepreneurs, start-ups and SMEs to play a vital role in building our future economy, we need to provide them with the tools to grow and to create new jobs and opportunities. Partnerships between the technology services industry and SMEs are a good step in driving the SME community’s success. The Government’s Digital Strategy needs to encourage more businesses to adopt a partnership model where SMEs can become incorporated in our supply chains, so that we build a world class digital economy in the UK.",
    "It was heartening to see the DCMS Secretary of State reference close collaboration between government and industry in his announcement on Thursday. This spirit of partnership and collaboration has defined businesses of all sectors and sizes throughout the pandemic and it is something we must not lose going forward.",
    "2021 is a momentous year for the tech sector. We hope to see the Government deliver on its 10 Tech Priorities, to support not only the UK economy, but to position the technology industry as a major player in economic recovery on a global scale. We look forward to the development of a Digital Strategy which will help position UK businesses at the forefront of the new digital economy and beyond."
  ],
  "headers": {
    "3": "Digital skills development",
    "7": "Decarbonization",
    "9": "Supply chain diversification"
  },
  "links": {
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "training": "https://www.techradar.com/best/online-class-sites-do-these-online-courses-from-the-comfort-of-home",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "productivity": "https://www.techradar.com/best/best-productivity-apps"
  }
}