{
  "source": "https://www.techradar.com/news/icloud-mail-on-web-finally-gets-modern-ios-15-makeover-heres-how-to-get-it",
  "title": "iCloud Mail on web finally gets modern iOS 15 makeover - here’s how to get it",
  "category": "computing",
  "updated": "2021-06-11T11:00:57Z",
  "author": "daryl-baxter",
  "summary": "No longer iOS 7 on the web",
  "article": [
    "The web version of iCloud Mail is finally seeing a visual update after being stuck on its iOS 7 look for the last several years.",
    "With more features being uncovered in the developer betas of iOS 15, macOS Monterey and more, we’re also seeing tweaks and updates to some of Apple’s other services, with iCloud on the web also getting improvements.",
    "For whatever reason, the user interface of iCloud Mail on the web has been stuck with the same appearance as Mail in iOS 7 once looked, but there’s finally a visual refresh that can be tried out right now.",
    "It’s a feature that’s rarely highlighted by Apple, but if you find yourself in a situation where you can’t access your email in the Mail app, you can visit icloud.com to access it instead.",
    "It’s not just Mail that you can access, but Photos, Find My, and even the iWork suite of Pages, Keynote and Numbers, all of which will have your documents ready to use.",
    "However, it’s an area of iCloud that’s been left to linger without any major updates in recent years, with Apple focusing more on iCloud on its devices instead. Recent iCloud+ and Mail improvements are a good example of this, with an even bigger focus on privacy here.",
    "Now though, iCloud on the web is finally seeing a visual refresh, getting rid of the remnants of iOS 7 and updating it to be better aligned with Mail on iPhone, iPad and Mac.",
    "You only need to go to beta.icloud.com, sign in with your AppleID as usual, and after selecting Mail, you will see the new updated interface, ready to use.",
    "While Apple hasn't given a release date for this visual refresh on the web, it’s likely that we will see it appear towards the end of the year once iOS 15, macOS 12 Monterey and other updates announced at WWDC 2021 are released to everyone.",
    "Via 9to5Mac"
  ],
  "headers": {
    "3": "What is iCloud on the Web?",
    "7": "How can I access the new iCloud Mail?"
  },
  "links": {
    "icloud.com": "http://icloud.com/",
    "beta.icloud.com": "https://beta.icloud.com/",
    "9to5Mac": "https://9to5mac.com/2021/06/10/icloud-mail-gets-redesigned-interface-on-the-web-currently-available-in-beta/"
  }
}