{
  "source": "https://www.techradar.com/news/white-house-set-to-host-quantum-computing-summit",
  "title": "White House set to host quantum computing summit",
  "category": "computing",
  "updated": "2021-10-05T11:31:30Z",
  "author": "sead-fadilpasic",
  "summary": "Some of the greatest tech minds are invited to talk quantum",
  "article": [
    "Some of the biggest names in the IT industry are headed to the White House to discuss quantum computing with the Biden administration.",
    "As reported by Reuters, the White House Office of Science and Technology Policy (OSTP) will host an event in which the participants will discuss not only all the good, but also potential cyber-risks associated with computers infinitely faster than the ones around today.",
    "Among the reported participants are Microsoft, Amazon, Google, Boeing, Honeywell, IBM, Intel, and Northrop Grumman, as well as ColdQuanta, D-Wave, IonQ, QC Ware, Quantum Economic Development-Consortium, Rigetti Computing, Vector Atomic and Zapata.",
    "\"There's a lot of excitement about quantum computers and quantum sensors, and there's some hype associated with that,\" Charlie Tahan, assistant director for quantum information science at OSTP, told Reuters. \"But what we really want to get down to: what are the applications that a future quantum computer could run that could really benefit our society.\"",
    "According to the report, the Biden administration seems to be particularly interested in the cybersecurity implications of quantum computing. Word on the street is that quantum computing could easily crack even the strongest encryptions today, and with China making strides in quantum computing, the US does not want to play catch-up.",
    "The US government also wants to learn how to motivate more students to enter the field, as well.",
    "A classical computer is written in binary code (zeros and ones), and that code is translated into electricity (low voltage are zeros, high voltage are ones). So, in a classical computer, there are only two states in which the elements can be.",
    "For quantum computers, the basic unit (called qubit) can take multiple forms - they can be, for example, ones, zeroes, or ones *and* zeroes, at the same time. This change allows these computers to perform calculations at speeds inconceivable to classical computers.",
    "Via: Reuters"
  ],
  "headers": {
    "4": "Keeping up with China"
  },
  "links": {
    "quantum computing": "https://www.techradar.com/news/quantum-computing-new-breakthrough-could-set-the-stage-for-massive-speed-boost",
    "Reuters": "https://www.reuters.com/technology/amazon-google-set-attend-white-house-forum-quantum-technology-2021-10-05/"
  }
}