{
  "source": "https://www.techradar.com/news/nikon-launches-first-macro-lenses-for-z-series-cameras",
  "title": "Nikon launches first macro lenses for Z series cameras",
  "category": "cameras",
  "updated": "2021-06-02T10:15:11Z",
  "author": "mark-wilson",
  "summary": "And it's also updated the lens roadmap, kind of",
  "article": [
    "Nikon has announced the first macro lenses for mirrorless Z-series cameras like the Nikon Z7 II – and also teased the development of two more primes for the system.",
    "It's been a quiet year for Nikon so far, but it's sprung into life with the launch of the compact Nikkor Z MC 50mm f/2.8 and more versatile, mid-telephoto Nikkor Z MC 105mm f/2.8 VR S.",
    "The MC 105mm will, in particular, be a tempting new option for Nikon photographers who want a lens that can double up as a macro option and also a bright, portrait photography workhorse. It offers a short minimum focusing distance of 29cm and promises silent and smooth autofocus, thanks to its multi-focus STM (Stepper Motor).",
    "If you've been waiting for a small, compact macro lens for shooting flowers, insects or food, though, then the MC 50mm f/2.8 could be up your street. It has an even shorter minimum focusing distance of 16cm and comes with a focus limiter switch, which lets you restrict the range of distances your camera will focus at, in order to help boost speed and accuracy.",
    "The two lenses haven't come out of the blue, as they were on Nikon's previous Z-mount roadmap. But their arrival is very welcome, as Nikon's only product announcement this year had previously been the development of the Nikon Z9. This had led to rumors that its new Z-mount lenses had been delayed, but today's news will help calm the concerns of Nikon fans.",
    "Another bonus is that the two new lenses are both pretty reasonably priced, particularly the versatile mid-telephoto macro. You'll be able to buy the Nikkor Z MC 105mm f/2.8 VR S from late June for $999 / £999 (around AU$1,830, while the Nikkor Z MC 50mm f/2.8 will cost $649 / £649 (AU$1,190) and is expected to have the same availability. In further good news for owners of Nikon mirrorless cameras, they weren't the only new lenses the camera giant revealed today either.",
    "Alongside its two new macro lenses, Nikon has also announced the development of two new primes for its full-frame mirrorless cameras: the Nikkor Z 28mm f/2.8 and Nikkor Z 40mm f/2.",
    "There isn't a huge amount of information available for these two yet, other than the fact that the former is a wide-angle lens for everyday shooting, while the 40mm f/2 is another high-quality alternative to using Nikon's compact, but limited, 24-50mm f/4-6.3 zoom lens.",
    "They certainly promise to be solid options for hobbyist shooters or anyone new to full-frame mirrorless cameras. But Nikon's updated Z-mount lens lineup still contains some glaring omissions at the more professional end.",
    "In particular, the Nikon Z system still doesn't have any native lenses with a focal length over 200mm, which means wildlife photographers will need to continue adapting older F-mount lenses for a while yet.",
    "Despite the arrival of four new lens announcements, the new Z-mount lens roadmap also hasn't changed a great deal over the past year, with today's announcements simply bringing some long-expected lenses out of the shadows.",
    "Still, the addition of two new macro lenses is a big boost for the system and, overall, the Z-mount lens lineup is looking pretty strong in most areas. With Nikon also recently confirming to us that \"we are planning on expanding the Nikkor Z lens lineup to approximately 30 lenses by the end of the fiscal year 2021\", there's plenty for owners of cameras like the Nikon Z6 II and Nikon Z7 II to look forward to."
  ],
  "headers": {
    "6": "Prime cuts"
  },
  "links": {
    "Nikon Z7 II": "https://www.techradar.com/reviews/nikon-z7-ii",
    "Nikon Z9": "https://www.techradar.com/reviews/nikon-z9",
    "its new Z-mount lenses had been delayed": "https://www.techradar.com/news/nikon-denies-its-z-mount-lenses-have-been-hit-by-major-delays",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii"
  }
}