{
  "source": "https://www.techradar.com/news/venmo-will-let-users-hide-friends-list-after-biden-security-blunder",
  "title": "Venmo will let users hide friends list after Biden security blunder",
  "category": "computing",
  "updated": "2021-05-31T13:01:38Z",
  "author": "sead-fadilpasic",
  "summary": "It took a US President to force Venmo into action.",
  "article": [
    "It took a US president to convince Venmo to finally update the privacy settings in its payment app and allow people to remain hidden if they so choose.",
    "As reported by Engadget, Venmo started rolling out a new feature that allows users to hide their friends list from other people. The new feature enables users to set their friends list as visible to their friends only, or to no one but themselves.",
    "The Public (visible to everyone) setting will most likely remain the default one, it was said. That means all Venmo users will still be able to see everyone else’s friend list, unless people go into their settings and change it.",
    "Besides that, Venmo has also added an option allowing people to choose whether or not they appear in other people’s friends lists. This is also turned off by default.",
    "Confirming the news to BuzzFeed News, Venmo said it wanted to improve \"in-app controls providing customers an option to select a public, friends-only, or private setting for their friends list.”",
    "The feature is slowly rolling out, so if you’re not yet seeing it, you might need to wait a tad bit longer.",
    "This setting is something privacy advocates have been quite vocal about for some time now. However, Venmo was mostly indifferent to the calls to action, until BuzzFeed managed to find the accounts of US President Biden, his wife, as well as other members of his family simply by moving through different people's friends lists.",
    "Venmo is a mobile payment service, which allows US citizens to transfer funds to one another using a mobile app. According to figures from Balancing Everything, Venmo processed nearly $160 billion in total payment volume in 2020. It had more than 50 million active accounts in 2019.",
    "Via: Engadget"
  ],
  "headers": {
    "4": "Steady rollout"
  },
  "links": {
    "payment app": "https://www.techradar.com/best/best-money-transfer-apps",
    "Balancing Everything": "https://balancingeverything.com/venmo-statistics/",
    "Engadget": "https://www.engadget.com/venmo-hide-friends-lists-154600508.html"
  }
}