{
  "source": "https://www.techradar.com/news/the-nvidia-rtx-3070-ti-might-actually-release-after-cancellation-rumor",
  "title": "The Nvidia RTX 3070 Ti might actually release after cancellation rumor",
  "category": "computing",
  "updated": "2021-02-16T18:31:26Z",
  "author": "bill-thomas",
  "summary": "Could the 20GB RTX 3080 and 16GB RTX 3070 be real?",
  "article": [
    "The Nvidia GeForce RTX 3070 Ti has surfaced in rumors occasionally since the launch of Ampere in September 2020, but the mid-range graphics card may have got its juiciest leak yet.",
    "This latest leak was spotted by German game outlet GameStar, where it pointed out a store listing for a Lenovo Legion T7 gaming PC equipped with an Nvidia GeForce RTX 3070 Ti – with 16GB of VRAM, double that found on the existing RTX 3070.",
    "The bump up to 16GB of GDDR6 is new, but not necessarily surprising. Yeah, it's more than all the other Ampere GPUs, save for the RTX 3090, but Team Green took a similar approach when it announced the RTX 3060 back at CES 2021. That card was announced with 12GB of GDDR6 VRAM, citing the limitations of the 192-bit memory bus with that decision.",
    "When word of the RTX 3070 Ti first cropped up in October 2020, it seemed like Nvidia was reacting to the AMD Radeon RX 6800. It was initially going to have 10GB of VRAM with a 320W TGP (total graphics power). Plans seem to have changed.",
    "It's best to take this leak with a grain of salt, however, as this store listing could just be a typo. Until Nvidia actually announces the graphics card, there's a chance it all goes up in smoke.",
    "Via PCGamesN",
    "If the Nvidia GeForce RTX 3070 Ti does launch with a 16GB pool of GDDR6 memory, it could mark Nvidia changing its direction on how it specs out new graphics cards. The Nvidia GeForce RTX 3080, for example, shipped with what could be seen as the minimum VRAM for its 320-bit memory bus.",
    "We had heard back in October that the then-rumored 16GB RTX 3070 and 20GB version of the RTX 3080 had been cancelled, but this fresh rumor breathes a bit of life into it. And, honestly, given how confusing Nvidia's graphics card lineup is with the RTX 3060's 12GB memory pool, these new cards should exist.",
    "When you look at Nvidia's lineup right now, it's a bit odd that the flagship gaming GPU has less VRAM than the weakest GPU in the lineup. We obviously haven't tested the RTX 3060 yet, but it's pretty much assured that the RTX 3080 is going to wipe the floor with it – even with that higher memory buffer.",
    "But from a pure product angle, having the GeForce RTX 3080 with less VRAM than a graphics card that costs half as much makes it feel a bit less premium. This is pure speculation on our part, but if the Nvidia GeForce RTX 3070 Ti is actually real, we wouldn't be surprised if the 20GB RTX 3080 was revived.",
    "Then again, Nvidia doesn't seem to have any problem selling out of all of its graphics cards right now, so it might be a while before these new GPUs actually hit the street – if they ever do."
  ],
  "headers": {
    "6": "RAM more memory in these cards"
  },
  "links": {
    "Nvidia GeForce RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "GameStar": "https://www.gamestar.de/artikel/nvidia-rtx-3070-ti-komplett-pc,3367008.html",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "AMD Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "PCGamesN": "https://www.pcgamesn.com/nvidia/rtx-3070-ti-release-date-price-specs",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "16GB RTX 3070 and 20GB version of the RTX 3080 had been cancelled": "https://www.techradar.com/news/nvidia-rtx-3070-16gb-and-3080-20gb-graphics-cards-killed-off-rumor-has-it",
    "selling out of all of its graphics cards": "https://www.techradar.com/news/nvidia-rtx-3080-stock-shortage-is-set-to-worsen-and-it-could-cause-prices-to-rise"
  }
}