{
  "source": "https://www.techradar.com/news/samsung-8k-tv-vs-sony-8k-tv-who-does-it-better",
  "title": "Samsung 8K TV vs Sony 8K TV: who does it better?",
  "category": "televisions",
  "updated": "2021-08-30T09:00:00Z",
  "author": "axel-metz",
  "summary": "When it comes to 8K TVs, Samsung or Sony?",
  "article": [
    "Among the very best 8K TVs available to buy right now, there are only really three names in the conversation: Samsung, LG and Sony. Choosing which of those manufacturers to buy from, though, is an altogether larger question.",
    "In this guide, we compare the 8K TV lineups of Samsung and Sony, pitting their display offerings against one another by breaking down their features, app support and, of course, price.",
    "But what’s the deal with 8K resolution, anyway? Essentially, it’s the sharpest resolution available on a TV set today. Often confused as being twice as sharp as a 4K, 8K TVs actually boast resolutions of 7,680 x 4,320 pixels to create whopping 33-megapixel images – which is more than four times sharper than their 4K counterparts.",
    "For those looking for the highest quality home viewing experience, then, the 8K TVs offered by Samsung and Sony are a great place to start. So, which brand should you side with?",
    "It’s worth starting out by clarifying that Samsung is a lot more invested in 8K than Sony. While the former has a broad lineup of 8K TVs ranging from reasonably-priced displays (relatively speaking) to eye-wateringly expensive sets, the latter only releases around one 8K TV per year.",
    "In fact, given that Sony’s first 8K TV, the Sony Master Series Z9G, was only available in 85-inch and 98-inch sizes (at a price of either $13,000 / £14,000 or $70,000 / £85,000), it’s safe to say that the brand’s 2020 offering, the Sony Z8H/ZH8, marked the first mainstream 8K TV from the Japanese manufacturer.",
    "We’re still waiting on the release of Sony’s 2021 8K TV, though we anticipate it being the Sony Master series Z9J, an LED TV that will be available in 75 and 85-inch sizes. Since that isn’t out yet, though, Sony’s 8K ‘lineup’ really only consists of one display, the aforementioned Sony Z8H/ZH8.",
    "Luckily, the Z8H/ZH8 is a great TV. Combining rich contrast, gorgeously saturated colors, outstanding video processing and extreme HDR-friendly brightness, it offered one of the best LCD TV pictures of 2020 and a refreshingly-accessible alternative to the bombastic nature of the giant Sony Master Series Z9G. It can only take 8K sources over HDMI, mind, but as Sony’s first foray into mainstream 8K technology, it remains a fantastic TV.",
    "As for how Sony’s 8K range lines up against Samsung’s, though, there’s really no comparison. The South Korean brand has long been a leader in the TV market, seizing on the latest technological trends (3D, 4K, 8K etc.) to deliver some of the best displays money can buy.",
    "When it comes to its 8K lineup, half of our best 8K TVs ranking is made up of Samsung displays, namely the excellent Samsung Q800T 8K QLED and even better Samsung QN900A Neo QLED (which we gave five stars in our review).",
    "The latter, for our money, is the best 8K TV you can buy today, and though Sony’s Z8H/ZH8 sits just below it as the second best, the superior number of Samsung’s 8K offerings means that when it comes to a comparison between the brands’ lineups, Samsung takes the crown.",
    "Of course, the price of these high-end displays is the most important differentiator for many prospective 8K TV buyers.",
    "It’s no surprise that 8K TVs outprice their 4K counterparts significantly, especially with far less choice available given the technology is still in relative infancy. That doesn’t mean these high-end displays are out of reach, though.",
    "Sure, the top-end models from Samsung and Sony demand the big bucks – at launch, you couldn’t get a Sony Master Series Z9G, for instance, for less than $13,000 / £14,000, nor a Samsung Q950TS for similar money – but the brands’ entry-level sets are comparable when it comes to price.",
    "Take the Samsung Q800T QLED, which we named as the cheapest 8K TV around. Offering 8K resolution at a 4K price, the display now sits at around $2,500 / £2000 / AU$3,500 (from a $3,199 / £3,799 / AU$4,999 launch figure), which is in the same region as Sony’s only mainstream 8K TV, the Z8H/ZH8 (now around $4,100 / £3000 / AU$5,500).",
    "When it comes to price, then, both Sony and Samsung have displays on either end of the spectrum. Naturally, given Samsung’s broader product range, you’ll find more 8K TVs at different prices – rising all the way up to the lofty figures boasted by its most prestigious displays – but both brands offer 8K TV options for budgets beginning in the early thousands.",
    "It’s also worth noting that the most expensive displays from both Sony and Samsung depreciate hugely. The aforementioned Sony Master Series Z9G and Samsung Q950TS, for example, are now a fraction of their launch price – so it’s worth shopping for models from a year or two prior if you’re intent on grabbing the best value.",
    "The question of app support on each brand’s 8K TVs widens the gap a little more. However, long story short: Sony’s displays use Android TV, while Samsung’s use the superior Tizen platform.",
    "Sure, Android TV has a vast amount of content and apps – Netflix, Amazon Prime Video, YouTube, Google Play Movies, Rakuten, BT Sport (in the UK) and Disney Plus among them – but it doesn’t provide all of the key catch-up apps (no BBC iPlayer or ITV Hub in the UK, for instance), while Apple TV isn’t available globally. The interface is also overwhelming, taking over the entire screen rather than letting you continue watching TV while you browse.",
    "These might be trivial concerns, but when comparing Android TV to an operating system like Tizen, its shortcomings are laid bare. The latter, in contrast, boasts a far superior interface and all of the most popular apps and services (including Apple TV).",
    "A press of the home button on your remote will see your favorite apps and sources pop up from the bottom edge of the display in a horizontal line – not occupying the entire screen like Android TV – and cycling through these tiles also sees additional information spring up above the initial row of apps. For instance, hovering over a streaming service like Netflix will present you with a view of your recently viewed shows and movies, allowing you to continue directly from your home screen.",
    "It’s small features like this that make the app support – and app experience – on Samsung TVs far better than that of Sony’s equivalent displays. The latter are by no means lacking in apps and services, nor is their interface entirely un-usable, but Samsung’s Tizen platform is objectively superior.",
    "As well as picture quality and app support, the 8K TVs from Sony and Samsung pack several other neat features, too.",
    "For instance, although we’re critical of Android TV on Sony’s 8K sets, the platform does open its displays up to some useful, wider Android-related features, like built-in Google Assistant voice control, initial set up assistance if you have an Android phone and Chromecast Built-in support.",
    "Sony’s 8K audio support is pretty great, too. The Z8H/ZH8’s so-called Acoustic Multi-Audio set up is almost as much of a feature as its 8K pictures, and works via tweeters tucked behind the top left and right corners of the TV to give sound details a forward ‘push’, ensuring that audio seems to come from the whole screen area, rather than just from the bottom.",
    "Essentially, that reduces the need for a separate audio system, since the Z8H/ZH8’s Multi-Audio design delivers an exceptionally detailed, open and powerful audio performance all on its own.",
    "But Samsung’s 8K TV audio options are no slouch, either. Displays like the Q800T feature the brand’s OTS (Object Tracking Sound) technology, which does a great job of bringing depth to whatever you’re watching by making it easy to track noises moving from left to right.",
    "For a more detailed comparison between the manufacturers' 8K TV audio features, check out our Sony Acoustic Surface Audio vs Samsung OTS feature.",
    "When it comes to other bells and whistles, as mentioned earlier, Sony’s Z8H/ZH8 8K TV can only take 8K sources over HDMI, not streaming or USB. This limits your 8K sources to high-end PCs and next-gen consoles like the PS5 and Xbox Series X, though its upscaling of 4K and HD content still produces super-sharp results.",
    "In terms of who does 8K TVs better, though, the answer is still Samsung. Sony remains relatively limited in its 8K offerings, with one bona fide consumer screen, while Samsung’s larger range of products means far more options are available to prospective TV buyers looking for certain features over others.",
    "That’s not to say Sony won’t catch up to its competitor in the future. As mentioned, we’re anticipating the arrival of a brand new Sony Master series 8K TV in the coming months, which could combine the feature-based successes of the Z8H/ZH8 with the impressive display of the Z9G.",
    "The Z8H/ZH8 on its own, too, means Sony’s current 8K TV lineup remains a great one – it's just not as great as Samsung’s right now."
  ],
  "headers": {
    "4": "Lineups",
    "11": "Prices",
    "17": "App support",
    "22": "Other features",
    "29": "So which 8K TV manufacturer is the best?"
  },
  "links": {
    "best 8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Sony Master Series Z9G": "https://www.techradar.com/reviews/sony-bravia-master-series-z9g-8k-hdr-tv",
    "Sony Z8H/ZH8": "https://www.techradar.com/reviews/sony-z8hzh8-8k-tv",
    "Samsung Q800T 8K QLED": "https://www.techradar.com/reviews/samsung-q800t-8k-qled-tv",
    "Samsung QN900A Neo QLED": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "Samsung Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Sony Acoustic Surface Audio vs Samsung OTS": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}