{
  "source": "https://www.techradar.com/news/hootsuite-snaps-up-saas-specialist-sparkcentral",
  "title": "Hootsuite snaps up SaaS specialist Sparkcentral",
  "category": "computing",
  "updated": "2021-01-06T09:52:51.011Z",
  "author": "barclay-ballard",
  "summary": "Tie-up should help brands boost customer engagement",
  "article": [
    "Social media management platform Hootsuite has acquired SaaS provider Sparkcentral for an undisclosed fee.",
    "The purchase should enable the two companies to provide better levels of customer care for brands, as over half of the world’s population is now present on at least one social media platform, providing an essential route to customer engagement.",
    "Hootsuite says it can allow businesses to manage all their social media content from a single platform – and now with the company’s new acquisition, this will now include Sparkcentral’s automated message distribution platform.",
    "Sparkcentral promises brands effortless conversations with their customers by providing them with one-to-one messaging channels through social networks including Facebook Messenger, Twitter, WhatsApp, WeChat, and more.",
    "The digital customer engagement arena has only become more competitive as businesses shift their processes online. Although shoppers may be carrying out fewer in-person transactions, they still expect a high level of customer care, which presents a challenge for some brands.",
    "In addition, the coronavirus pandemic has accelerated digital transformation efforts, driving more customer interactions online. With this trend likely to continue, the need for brands to deliver good customer care digitally is only set to increase.",
    "“Our customers have been asking for more capabilities in the area of social customer care and we’re excited to expand our offering with this new acquisition,” Tom Keiser, CEO of Hootsuite, explained.",
    "“Brands and organizations must grow their digital capabilities to connect with their customers on the social and messaging platforms their customers use, not the other way around. These customer engagements need to seamlessly connect into the brand and organization’s workflow across all customer-facing departments—marketing, sales, customer support, finance, etc. With Sparkcentral joining Hootsuite, we enable brands of all sizes to create a holistic, agile, and effective experience for their customers.”"
  ],
  "headers": {
    "3": "A platform partnership"
  },
  "links": {
    "Hootsuite": "https://www.techradar.com/how-to/internet/how-to-use-hootsuite-and-conquer-twitter-1308922"
  }
}