{
  "source": "https://www.techradar.com/news/lenovos-new-gaming-phone-makes-the-samsung-galaxy-s21-ultra-look-small",
  "title": "Lenovo's new gaming phone makes the Samsung Galaxy S21 Ultra look small",
  "category": "phones",
  "updated": "2021-04-08T12:00:31Z",
  "author": "tom-bedford",
  "summary": "A mammoth mobile",
  "article": [
    "Even if you're aware that gaming phones tend to be pretty massive mobiles, the new Lenovo Legion Phone Duel 2 will still surprise you with its size. It's the newest smartphone from the Lenovo Legion gaming hardware brand, following on from the original Phone Duel, which was once our top-ranked gaming phone.",
    "This new phone takes some of its predecessor's features - it has a camera pop-up on its side, 90W fast charging from multiple USB-C ports, and multiple front speakers - and brings a few important changes too.",
    "For one, the Lenovo Legion Phone Duel 2 is huge - its display is 6.92 inches across, even bigger than the giant Samsung Galaxy S21 Ultra with its 6.8-inch screen. The refresh ratio is 144Hz, which is a competitive rate, but another wild spec is its touch input rate at 720Hz, which is higher than any other phone. This means the display scans for your touch 720 times per second, making snap reactions in mobile games much more responsive.",
    "The original Phone Duel, and a few other gaming phones, had physical triggers that you could map to improve gaming - not wanting to be beaten, the Phone Duel 2 has eight. There's four along the edge of the phone - two for each hand - as well as two on the back, and two on the screen. You can activate each by pressing, long-pressing or sliding, resulting in a huge number of combinations and buttons mapped.",
    "There's also a built-in fan on the Legion Phone Duel 2, so the phone keeps itself cool while gaming, which uses twin fans.",
    "As well as all those top gaming features, the Lenovo Legion Phone Duel 2 has all the other specs of top mobile phones. It has the Snapdragon 888 chipset, 12GB or 16GB RAM, a 5,500mAh battery, 90W charging, a 64MP main camera, a 44MP front-facing camera, 5G connectivity and Wi-Fi 6 compatibility.",
    "While Lenovo is still a relatively new player in the mobile gaming hardware market, it's starting to get a reputation for premium gaming phones, with top specs across the board... and a high price to match.",
    "We know the phone's price in the UK, and it'll cost £699 for 12GB RAM and 256GB storage - that converts to around $950 / AU$1,240. There's also a 16GB RAM and 512GB storage model for £899, or roughly $1,180 / AU$1,550.",
    "In other words this is a high-cost phone for the most dedicate mobile gamer, one which outstrips the competition in terms of spec and cost. We've briefly tested out the phone, and you can read about it in our hands-on Lenovo Legion Phone Duel 2 review."
  ],
  "headers": {
    "5": "Aim to game"
  },
  "links": {
    "gaming phones": "https://www.techradar.com/news/best-phone-for-gaming",
    "Lenovo Legion Phone Duel 2": "https://www.techradar.com/reviews/lenovo-legion-phone-2-duel",
    "Phone Duel": "https://www.techradar.com/reviews/lenovo-legion-phone-duel-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "hands-on Lenovo Legion Phone Duel 2 review": "https://www.techradar.com/reviews/lenovo-legion-phone-2-duel"
  }
}