{
  "source": "https://www.techradar.com/news/hurry-the-apple-airpods-max-hit-lowest-sale-price-ever-at-amazon",
  "title": "Hurry - the Apple AirPods Max hit lowest sale price ever at Amazon",
  "category": "audio-visual",
  "updated": "2021-06-02T16:17:21Z",
  "author": "mackenzie-frazier",
  "summary": "Snag a rare price cut on Apple's AirPods Max headphones",
  "article": [
    "Apple fans will be delighted to hear that we've spotted a rare deal on the pricey AirPods Max at Amazon. For a limited time, you can get the AirPods Max on sale for $519.99 (was $549). That's a $29 discount and the lowest price we've found for Apple's powerful over-ear headphones.",
    "The AirPods Max were released in December of last year and feature an over-the-ear design, which is a first from the AirPods line. The AirPods Max deliver an enhanced audio experience with immersive sound and feature active noise cancellation, Apple's powerful H1 Chips, and up to 20-hours of battery life. The AirPods Max also feature a unique design with a breathable knit mesh headband and a stainless steel frame with memory foam earcups for ultimate comfort. While the $29 discount might not seem like much, this is the lowest price we've found for AirPods Max, and as of right now, the headphones are in stock and ready to ship. Discounts on Apple's luxury headphones are rare, so we'd snag this bargain now before it's too late.",
    "You can also shop for more offers with the best AirPod deals and sales and see the best AirPods Pro deals and sales that are happening now. See early offers and learn more about the upcoming Amazon Prime Day deals event."
  ],
  "headers": {
    "1": "AirPods Max deal",
    "2": "More AirPods deals"
  },
  "links": {
    "on sale for $519.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08PZD76NP%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4567067131262002000-20",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "best AirPod deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "best AirPods Pro deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}