{
  "source": "https://www.techradar.com/news/monster-hunter-stories-2-is-delightfully-different-and-ideal-for-series-newcomers",
  "title": "Monster Hunter Stories 2 is delightfully different – and ideal for series newcomers",
  "category": "gaming",
  "updated": "2021-07-07T15:00:00Z",
  "author": "rhys-wood",
  "summary": "Opinion: Monster Hunter Stories 2 is a take on the series I don’t want to fade away",
  "article": [
    "Monster Hunter Stories 2 is the latest entry in the long-running Capcom series. Whereas mainline Monster Hunter games pit you against ferocious creatures in an action-oriented fight to the death, Stories 2 takes a more laid-back but still wonderfully enjoyable approach.",
    "Monster Hunter Stories 2 differs greatly from other entries in that you engage monsters entirely in turn-based battles. While I was initially concerned about the game losing the high-stakes edge of the real-time main series, I was quick to realize that Stories 2 is opting for something else entirely, and it’s all the better for that reason.",
    "The more I played Monster Hunter Stories 2, the more I started to see it as an equal to the brilliant Monster Hunter Rise. The two games complement each other remarkably well; Stories 2 not only provides a welcome break from the high-octane monster slaying of Rise, I would argue it’s a brilliant entry point into both the Monster Hunter series and JRPGs as a whole.",
    "There’s no denying that Monster Hunter Stories 2 adopts a more kid-friendly approach to the series. But that’s by no means a bad thing. The game’s color palette is much more vibrant than other recent Monster Hunter titles, and characters are rendered in beautiful cel-shading - a perfect fit for the Nintendo Switch’s limited power, and an eye-catching sight on PC with a 4K HDR monitor.",
    "Monster Hunter Stories 2 also takes a plethora of the series’ iconic monsters and successfully transforms them from enemies into friends. Battling and bonding with your Monsties - as the game so adorably refers to them - is the core mechanic of Stories 2. You’ll be doing a lot of collecting monster eggs and hatching them into potential warrior beasts for your party.",
    "As you use them more, Monsties level up and thus learn new abilities and grow closer to you as their Rider. Riders being pointedly distinguished from other hunters in-game in that their primary objective isn’t to slay or capture monsters. Rather, as a Rider, you will seek to hatch monsters from eggs and raise them as allies.",
    "While your starting Velocidrome (a raptor-like monster that finds itself lower down in the pecking order in other Monster Hunter games) will eventually be replaced by more powerful monsters like the draconic Rathalos, I found their partnership to be invaluable in battle and - believe it or not - actually found myself caring greatly about my stable of Monsties.",
    "One really cool aspect about Monsties is that they all have skill directly tied to exploration. There are aspects of the environment - such as jumping platforms, rivers and climbable vines - that can only be traversed by certain Monsties. Your Velocidrome, for example, can use those jumping platforms, but isn’t able to swim. This encourages players to adopt a variety of Monsties in their party to overcome a wider range of traversal options.",
    "It’s really quite bizarre to see monsters you’ve slain hundreds of times over now become your most trusted allies. Monster Hunter Stories 2 does such an excellent job of adding depth to monsters beyond just “this is what you need to kill, don’t ask questions,” particularly the ones directly related to the game’s story. In hindsight, it’s made me feel a little bad for the countless wyverns, beasts and birds I’ve had to put down over the years in other Monster Hunter games.",
    "It wouldn’t be a Monster Hunter game without the, erm, monster hunting aspect, and rest assured you will find plenty of that in Stories 2. While you’ll often be tasked with tracking down individual monsters in both the story and side content, monsters will also roam the large overworld maps you’ll be exploring. These will be one of your largest sources of experience, and monsters are worth fighting consistently for when you want to craft better weapons and armor for your player-created Rider.",
    "Even this process of improving your gear has been greatly streamlined for newcomers. You no longer need to craft individual pieces of armor. Got enough materials? You’ll craft the whole set as an individual piece. While this does diminish the customization of armor builds in the mainline series, it’s easy to understand for newbies and actually serves to help Monster Hunter Stories 2’s pacing. It is, after all, a story-driven JRPG first and foremost.",
    "That’s not to say depth doesn’t exist in Monster Hunter Stories 2. On the topic of your Rider, the weapons and armor you choose to bring into battle, as well as which Monsties you pack into your party, can have a significant impact on your results.",
    "Just like the main series, if you go into a major monster fight with suboptimal gear - or gear that hasn’t been upgraded, Stories 2 can still give you a tough time. It isn’t so newbie friendly that it will hold your hand throughout. Instead, it effectively delivers short tutorials that are easy to understand and adequately prime new players for the challenges ahead.",
    "Another aspect that makes Monster Hunter Stories 2 so welcoming for new players is the buddy system. Buddies, essentially, act as an extra party member to give you a helping hand while you’re out fighting monsters. They’ll even have their own Monstie with them, effectively doubling the size of your party.",
    "This is probably the most traditional aspect of Monster Hunter Stories 2’s turn-based battle system. It’s not uncommon for RPGs to feature robust party systems, and Stories 2 keeps it simple, but trims much of the fat to keep the focus, first and foremost, on fighting monsters.",
    "Your chosen Buddy will obviously bring a helping of extra damage to your battles, both from themselves and their Monstie partner. But they can also heal you in a pinch, or provide various buffs to make hunting certain monsters that little bit more manageable.",
    "I would argue that for RPG veterans, the Buddy system could make progressing through Monster Hunter Stories 2 a tad easy. But they can provide an essential early game crutch if you’re an especially young player - or just entirely new to the series - and need some help progressing through the story content.",
    "My time with Monster Hunter Stories 2 surprised me with just how enjoyable and accessible the series can be when it deviates from the tried and tested gameplay style of previous entries. It presents a relatively slower paced, easy to pick up turn-based battle system, while also making more advanced Monster Hunter concepts - like combining items and armor skills - much easier to digest.",
    "It also helps that Monster Hunter Stories 2 is the best game in the series from a narrative standpoint, telling a well-paced and surprisingly high-stakes story full of fun characters and an uplifting sense of camaraderie.",
    "Monster Hunter Stories 2 is far from a dumbed down rendition of the mainline series. It’s entirely doing its own thing, and offers an experience that’s a perfect entry point for Monster Hunter newcomers, an enjoyable robust game for younger players as well as an all-round solid JRPG for fans of the genre. Here’s hoping the Stories series is here to stay, because it could well become a vital cornerstone of the Monster Hunter franchise as a whole."
  ],
  "headers": {
    "3": "\"Monstie\" madness",
    "9": "A hunter must hunt",
    "13": "Buddying up",
    "17": "Another successful hunt"
  },
  "links": {
    "Monster Hunter Rise": "https://www.techradar.com/reviews/monster-hunter-rise",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc"
  }
}