{
  "source": "https://www.techradar.com/news/how-the-apple-watch-6-blood-oxygen-app-helps-me-monitor-my-health-every-day",
  "title": "How the Apple Watch 6 blood oxygen app helps me monitor my health every day",
  "category": "wearables",
  "updated": "2021-08-08T07:00:41Z",
  "author": "jennifer-allen",
  "summary": "One major reason to own a smartwatch",
  "article": [
    "\"Easy come, easy go\" - that's how a friend once described one's health to me, and that sounds about right looking at the past 18 months of my life. Once an avid gym goer and keen jogger, my health has gradually plummeted amongst the chaos of the Covid-19 pandemic.",
    "Not to Covid-19 specifically, but to the ravages of an auto-immune disease and another condition that causes extensive inflammation. Why have one chronic complaint when you can have two, right?",
    "With plenty of things that now need monitoring by both medical professionals and me alike, things have changed pretty rapidly in my daily life. In typical technology journalist style, I've found a silver lining in the Apple Watch Series 6 making me feel a bit better mentally if not physically.",
    "Before we get into how the Apple Watch 6 helps, let's take a quick look at my blood. I've never really thought about my blood massively. It works, so I haven't typically questioned it. It turns out it now works less efficiently than it used to. With high platelets, blood oxygen levels that aren't quite where they should be thanks to poor iron stores, and some high inflammatory markers, my blood is a bit sluggish. That means fatigue, a higher heart rate, and lots of worries about my blood being a bit overly sticky on the whole.",
    "There was talk of blood thinners. I'm successfully dodging them for now but anyone who's seen me embark on an 'ambitious' walk of not very far at all will tell you how quickly I get out of breath. It's a bit pathetic. Hopefully things will improve now I know what the problem is and have a medication plan worked out but right now, it all needs some careful monitoring too so that nothing worse happens along the way.",
    "That's how I ended up with an Apple Watch 6. Being told a few times a week how I needed to be careful, to not overdo it physically, and to keep an eye on if my heart rate soars or I feel really out of breath is unsettling to hear. Regular blood tests can monitor things, of course, but how convenient is that when you need to wait for results? Similarly, ECGs are good for checking your heart along with a multitude of other tests but again, that's not much use when you're at home.",
    "Ultimately, you need peace of mind. A sense that you're still in control even if that control is a little tenuous right now.",
    "Reading up on the Apple Watch Series 6, I realized it could be the solution. I already owned an ageing Apple Watch 4 but the 6 looked tempting. Promising the ability to measure your blood oxygen levels while monitoring all the other things you might need, how could I resist? After all, I was going through a terrifying time so my urge for retail therapy was very high too.",
    "The Apple Watch 6 isn't the only watch to offer blood oxygen tracking, of course. Much of the Garmin range provides similar and I was tempted by a Forerunner model.",
    "But, ultimately, the aesthetic of the Apple Watch 6 tempted me in. Already quite the convert to all things Apple, it looked nice. It looked like the kind of thing I could wear on my wrist all day and feel like I had a nice fashion piece to show off as well as a useful form of medical aid. Even more so once I took a look at the straps I could add to the existing setup. it's good to feel good, after all.",
    "There's precious little out there explaining just how accurate the Apple Watch 6 is at tracking your blood oxygen levels. The main thing to note is that Apple itself points out it's not intended for medical use. That makes sense. As a wrist-facing device, it has a big disadvantage.",
    "Unlike pulse oximeters - the more traditional method after arterial blood tests - it's not using your fingertips to monitor your blood oxygen. Crucially, blood doesn't gather quite as densely in your wrist as it does in your fingertips. A pulse oximeter is the better option here because it clips onto your finger, near instantly reporting back on your blood oxygen levels along with your heart rate.",
    "That's why I own one of those too. A simple device and very inexpensive, it's definitely worth owning one if you're like me, but it's a lot less fun than the Apple Watch Series 6. Also, it's not quite as convenient as a watch you're wearing all day anyway.",
    "Stories like the paramedic's guide to blood oxygen and the Apple Watch are reassuring. Sure, it's anecdotal to an extent but grounded in a lot of logic too. In my experience, it's accurate too.",
    "I've spent the past week somewhat obsessively comparing the oximeter's readings with my Apple Watch's readings and they match up. The difference here is that I need to take my pulse oximeter with me wherever I go while the Apple Watch is simply on my wrist at all times.",
    "Crucially, the oximeter makes me feel like a bit of a victim. It feels like a medical device that reminds me I’m not very well, while the Apple Watch is a fun smartwatch that also happens to look out for my well being. Looking out for your mental health at a time like this is important too.",
    "Neither an Apple Watch or an oximeter are as good as genuine medical equipment, of course. It's vital you have regular check ups with your doctor and that you do whatever they advise. However, it's surprisingly solid peace of mind which makes the ‘regular’ days feel easier.",
    "When I embark on a short walk, I run my body through some checks. I use the ECG app and the blood oxygen app just to see where I'm at before I begin, then I monitor it on my regular bench breaks to see if anything has changed too drastically.",
    "Effectively, for now at least, my body requires a different manual so it's useful to see where I’m at. And, of course, the Apple Watch is eager to tell me if something is looking a bit high so I know when it’s time to head home or to give myself a break.",
    "Does it do so as accurately as an ECG or blood test? Nope. But how on earth am I going to get one of those before every single walk? Instead, I can feel a teensy bit better knowing that my Apple Watch is keeping a watchful eye.",
    "It might not be perfect but if it makes me feel a bit more relaxed, it just might help the rest of me heal too. Hopefully one day it'll even be able to monitor some runs again. Just maybe."
  ],
  "headers": {
    "7": "Peace of mind on your wrist",
    "15": "Feeling more normal with a watch"
  },
  "links": {
    "Apple Watch Series 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "paramedic's guide to blood oxygen and the Apple Watch": "https://tidbits.com/2020/10/22/the-paramedics-guide-to-blood-oxygen-and-the-apple-watch-series-6/"
  }
}