{
  "source": "https://www.techradar.com/news/6-new-movies-and-tv-shows-on-netflix-disney-plus-hbo-max-and-more-this-weekend-march-20",
  "title": "6 new movies and TV shows on Netflix, Disney Plus, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-03-19T16:44:49Z",
  "author": "axel-metz",
  "summary": "What's worth streaming this weekend",
  "article": [
    "Just when we thought the season of superhero mania was taking a drinks break after WandaVision reached its conclusion on Disney Plus, the world’s biggest streaming services have seen fit to blow the whistle on not one, but two major alien-bashing CGI fests this weekend.",
    "If capes and shields aren’t your thing, though, there’s plenty to keep you busy elsewhere, from new sports documentaries to acclaimed foreign dramas.",
    "Below, we round up six of the biggest highlights coming to Netflix, HBO Max and Disney Plus this weekend.",
    "After years of speculation and expectation in equal measure, Zack Snyder’s Justice League has finally arrived on HBO Max (or Sky and Now in the UK). Well, it actually leaked ahead of schedule for a short while through a Tom and Jerry-related error, but that’s another story.",
    "Batman, Wonder Woman and company once again do battle with a load of evil aliens, except this time they do it for an extra couple of hours and in a 4:3 aspect ratio. Our review was less-than complimentary, but we’ll leave you to decide whether it’s worth a watch just to see how radically different it is to the 2017 theatrical cut.",
    "Now available to stream on HBO Max in the US and Sky/Now in the UK",
    "Sticking with the superhero theme, The Falcon and the Winter Soldier has dropped on Disney Plus to counter those WandaVision withdrawal symptoms.",
    "Set after the events of Avengers: Endgame, TFATWS (can we make this a thing?) sees Sam and Bucky unite to try and live up to the legacy left behind by Captain America. Unlike WandaVision, this show goes big on the spectacle early on – MCU fans won't be disappointed by the movie-level set pieces on display here.",
    "Now available to stream on Disney Plus",
    "The world’s favorite F1-focused sports documentary returns for a third season this weekend to reignite those yearnings for burning rubber and aggressively-shaken champagne.",
    "After the tumultuous year that was 2020, even the money-laden world of F1 saw itself affected by restrictions imposed by the global pandemic, and this new season explores the trials and tribulations of all 10 teams on the grid. Expect clashes and crashes.",
    "Now available to stream on Netflix",
    "From executive producer Adam McKay (The Big Short, Vice) comes this HBO original documentary series exploring the origins of American far-right conspiracy group QAnon.",
    "Spanning over three years and traversing the globe, Q: Into the Storm follows filmmaker Cullen Hoback on a labyrinthine journey to uncover the forces behind QAnon in the build up to the group’s involvement in the US Capitol riots of January 2021.",
    "Available to stream on HBO Max from Sunday",
    "In what might be described as Thelma & Louise meets Money Heist, this new Spanish drama series follows three women on the run from their pimp on a cross-country adventure in search of freedom.",
    "Sky Rojo has received generally positive reviews and is the brainchild of Spanish TV mega-producer Álex Pina (of Money Heist fame), so it seems like a good pick to quench that bank-robbing thirst.",
    "Now available to stream on Netflix",
    "Although not technically arriving until this coming Monday, Navillera looks set to be another foreign drama series worth keeping an eye out for. A ballet prodigy close to giving up finds inspiration when he takes on his oldest student yet – a 70-year-old retiree who finally decides to pick up his own dancing shoes and chase his dreams.",
    "It all sounds a little saccharine, but we’ve learnt to withhold judgement when it comes to understated character dramas – especially when they’re Korean.",
    "Available to stream on Netflix from Monday"
  ],
  "headers": {
    "3": "Zack Snyder's Justice League (HBO Max/Sky)",
    "6": "The Falcon and the Winter Soldier (Disney Plus)",
    "9": "Formula 1: Drive to Survive (Netflix)",
    "12": "Q: Into the Storm (HBO Max)",
    "15": "Sky Rojo (Netflix)",
    "18": "Navillera (Netflix)"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/when-is-wandavision-set-in-the-marvel-cinematic-universe-timeline",
    "conclusion": "https://www.techradar.com/news/wandavision-episode-8-recap-review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Zack Snyder’s Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "leaked ahead of schedule": "https://www.techradar.com/news/zack-snyders-justice-league-leaked-overnight-by-mistake",
    "review": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place"
  }
}