{
  "source": "https://www.techradar.com/news/alfa-romeo-tonale-confirmed-as-a-plug-in-hybrid-but-will-space-age-interior-be-tamed",
  "title": "Alfa Romeo Tonale confirmed as a plug-in hybrid, but will space-age interior be tamed?",
  "category": "car-tech",
  "updated": "2021-07-19T14:15:13Z",
  "author": "chris-teague",
  "summary": "The Tonale's exterior looks like it'll follow its concept namesake",
  "article": [
    "After months of rumors and speculation, we finally have confirmation that Alfa Romeo's upcoming Tonale crossover will leave the automaker's Italian factory with a plug-in hybrid powertrain.",
    "Alfa Romeo's CEO publicly verified the vehicle in a recent meeting between senior management and company suppliers.",
    "Alfa debuted the Tonale concept vehicle at the 2019 Geneva Auto Show and immediately drew attention for its futuristic and dramatic style.",
    "Spy photos of pre-production models obtained by Motor1 have shown a strikingly similar shape to that of the concept vehicle, but the interior remains a mystery. The concept's cockpit is over-the-top and will likely be tamed down a bit before the Tonale is ready for showtime.",
    "Vehicle launches have been delayed several times over the past year for various reasons, ranging from a global pandemic to an ongoing microchip shortage, but Alfa delayed the Tonale for a different purpose.",
    "Recently installed CEO Jean-Phillipe Imparato pushed for better performance from the crossover's PHEV powertrain, which extended its development and testing timeline.",
    "When it is eventually released, the Tonale will slot into the Alfa Romeo catalog beneath the larger and more expensive Stelvio crossover.",
    "The automaker's lineup is otherwise tiny, at least in the United States, with only the Giulia on offer. There is no word on Alfa's plans for future models and whether or not it will offer a plug-in option for its other vehicles.",
    "The Tonale is Alfa's first PHEV and comes as the brand's corporate parent advertises its overall plans for electrification in the coming years.",
    "Earlier this month, parent company Stellantis announced that all 14 of its brands would offer BEVs or PHEVs in the coming years and notes that it is targeting over 70 percent of its sales in Europe and over 40 percent in the United States for low-emission vehicles by 2030.",
    "Via Motor1"
  ],
  "headers": {
    "5": "More power required"
  },
  "links": {
    "obtained by Motor1": "https://www.motor1.com/news/512789/alfa-romeo-tonale-spy-shots/",
    "different purpose": "https://europe.autonews.com/latest-launches/alfa-romeo-tonale-launch-delayed-after-new-ceo-demands-better-performance",
    "Motor1": "https://www.motor1.com/news/520144/alfa-romeo-tonale-phev-confirmed/"
  }
}