{
  "source": "https://www.techradar.com/news/sony-suspends-orders-for-its-new-mirrorless-camera-amid-chip-shortage",
  "title": "Chip shortage forces Sony to suspend orders for new mirrorless camera",
  "category": "cameras",
  "updated": "2021-12-07T11:11:29Z",
  "author": "mark-wilson",
  "summary": "New Sony cameras are seeing major shortages",
  "article": [
    "Sony has suspended orders for one its latest mirrorless cameras, in a move that shows how big a problem the global chip shortage continues to be for tech companies.",
    "The Sony ZV-E10, which was only announced in July, is the subject of another \"temporary suspension\", according to a new notice and apology from Sony Japan. Sony says it will \"suspend the acceptance of orders from our distributors and customers at the Sony store\" due to \"tight supply.\"",
    "There's no suggestion that the ZV-E10, which we rate as one of the best vlogging cameras, has been discontinued. But it's the latest in a succession of suspensions for Sony's more affordable cameras, with the company making an almost identical announcement for the Sony A6400, Sony A6100 and older full-frame Sony A7 II camera just over two weeks ago.",
    "A quick check of online retailers shows that, while it's still possible to buy the Sony ZV-E10 directly from Sony in the UK, retailers in many territories are already showing that model and many other Sony cameras as backordered or unavailable.",
    "The news comes only a few days after Canon dropped the bombshell that its new mirrorless flagship, the Canon EOS R3, likely won't be available until mid-2022 for fresh orders, with the company stating that \"it may take more than half a year to deliver when you place a new order.\"",
    "So while Sony is far from the only camera company suffering from the global chip shortage, its issues are affecting almost an entire range of its cameras, rather than just a specific model. Very few of its APS-C cameras are now widely available, with the company clearly prioritizing its pricier full-frame models like the new Sony A7 IV.",
    "There had been hopes that the chip shortage's effects would mainly be restricted to 2021, but this news suggests that the camera woes will likely continue well into next year.",
    "The latest CIPA figures for October show that total shipments for cameras are well down on last year, and that's at least in part due to parts shortages. This has meant companies like Sony have had decide which parts of their lineups to prioritize – and, in the case of the Sony ZV-E10, Sony A6100 and Sony A6400, which ones to suspend global orders for.",
    "This is a shame for anyone who's been looking to buy a mid-range camera, particularly for vlogging, as the ZV-E10 is one of the better ones around, alongside its smaller Sony ZV-1 sibling.",
    "But Sony's statement suggests that this is far from a premature end for its ZV-E10 camera, with the company adding that it \"will consider\" resuming orders \"while observing the status of parts supply.\" So while the company's focus is undoubtedly on full-frame mirrorless cameras, its 'one mount' strategy will continue to incorporate models with smaller APS-C sensors – you just might not be able to buy them until well into 2022."
  ],
  "headers": {
    "6": "Analysis: a bad sign for cameras in 2022?"
  },
  "links": {
    "Sony ZV-E10": "https://www.techradar.com/reviews/sony-zv-e10",
    "notice and apology from Sony Japan": "https://www.sony.jp/ichigan/info2/20211203.html",
    "best vlogging cameras": "https://www.techradar.com/news/best-vlogging-camera",
    "Sony A6400": "https://www.techradar.com/reviews/sony-alpha-a6400-review",
    "Sony A6100": "https://www.techradar.com/reviews/sony-a6100",
    "Sony A7 II": "https://www.techradar.com/reviews/sony-alpha-a7-ii-review",
    "Canon dropped the bombshell": "https://www.techradar.com/news/canon-eos-r3-might-not-be-available-until-mid-2022-says-the-camera-giant",
    "Sony A7 IV": "https://www.techradar.com/reviews/sony-a7-iv",
    "CIPA figures for October": "https://www.cipa.jp/stats/documents/e/dw-202110_e.pdf",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1"
  }
}