{
  "source": "https://www.techradar.com/news/psychonauts-2-finally-revives-the-collectathon-and-i-couldnt-be-happier",
  "title": "Psychonauts 2 finally revives the collectathon and I couldn't be happier",
  "category": "gaming",
  "updated": "2021-09-05T12:00:00Z",
  "author": "hamish-hector",
  "summary": "A classic game genre returns from the dead",
  "article": [
    "The year is 2005, a seven-year-old me is hidden away in his room sneaking a few precious minutes more on the greatest game ever made: Scooby-Doo! Night of 100 Frights. Taking on the role of the Great Dane himself, my task was to rescue the various Mystery Inc members from traps spread across the grounds of a spooky mansion filled with familiar monsters from the show’s history.",
    "To succeed I had to gather keys, find upgrades, and gorge on an overindulgent supply of Scooby Snacks. Scooby-Doo! Night of 100 Frights was not my first foray into the world of collectathons, but it’s the one I look back on most fondly. However, when I dusted off my PS2 a few years ago to experience the joy all over again, I gave up after only an hour or two.",
    "Compared with what I expect from 3D games today, the collecting-focused gameplay was stale and I wasn’t the only player who felt that way. Around the same time, and despite an incredibly successful Kickstarter campaign, Yooka-Laylee failed to invigorate players despite the involvement of creatives behind collectathon classics like Banjo-Kazooie and Donkey Kong Country.",
    "The collectathon was declared dead by many and until 2021 it felt like it was. But this year, just a week or so ago, Psychonauts 2 came to consoles to prove there’s still life in the collectathon genre, and I couldn't be happier with what it delivers.",
    "Even if you haven’t heard the genre’s name before, you’re probably familiar with at least one game that falls into it. Collectathons were the form many early 3D games adopted to highlight the novelty of traversing a new virtual dimension. As a reward for exploring and completing platforming challenges, players would receive resources that would help them progress through the story.",
    "Popular examples of collectathons include Spyro the Dragon, Super Mario 64, and the aforementioned Banjo-Kazooie. The genre was so prevalent and popular that many of its mascots are still recognizable to this day, even if they haven’t appeared in a new title for years.",
    "Unfortunately, the genre fell out of favor as 3D games gradually became more commonplace. Gameplay that once catapulted franchises into the cultural zeitgeist soon became the most detested aspect of modern games; I'm looking at you, feathers hidden in Assassin’s Creed 2.",
    "Once the novelty of 3D wore away collectathon gameplay felt stale and gathering collectibles felt like just a ploy for games to expand their playtime rather than offer meaningful entertainment. So after years of getting it wrong, how did Psychonauts 2 finally get it right?",
    "At its core, Psychonauts 2 succeeds at being a collectathon because it creates a world you want to explore that just happens to be sprinkled with collectibles to find. In one area of Psychonauts 2 you can explore a theme park with an attraction called the Sassclops’ Cave. I was just as interested in examining the weird details and read the fake myths inside as I was to pick up the hidden objects I collected.",
    "This is true of every other in-game location, too, thanks to the puzzles and challenging platforming segments – on top of the quirky environments and characters you encounter – Psychonauts 2 ensures its gameplay is enjoyable far beyond the simple satisfaction of ticking off a box in a needlessly long checklist.",
    "On top of that, unlike many other collectathons, there are no required pickups in Psychonauts 2. You’ll never reach a roadblock because you haven’t located enough PSI cards or Figments and be forced to backtrack if you want to keep progressing to new areas. Collecting is optional and doesn’t feel overbearing.",
    "While hundreds of Figments litter the minds you explore – as long as you pay attention – you’ll collect around 90% of them just by following the main story’s path. The missing Figments that remain are likely congregated around other more immediately useful finds that you also missed like Nuggets of Wisdom or Half-A-Minds (upgrades that instantly power up your abilities and give you more health) meaning that going back to get them feels worthwhile.",
    "You don’t have to just take our word on it, multiple other publications are already calling Psychonauts 2 an easy contender in this year’s Game of the Year race thanks to its gameplay and its handling of mental health-related subjects.",
    "This success doesn't just bode well for the future of the Psychonauts franchise but the collectathon genre as a whole; Psychonauts 2 might finally reignite the collectathon's glory days. I certainly hope that's the case as there's at least one game I'd love to see get a sequel; Scooby-Doo! Night of 200 Frights anyone?"
  ],
  "headers": {
    "4": "What is a Collectathon?",
    "8": "Psychonauts 2 succeeds where others have failed"
  },
  "links": {
    "Yooka-Laylee": "https://www.techradar.com/news/gaming/yooka-laylee-is-the-spiritual-successor-to-banjoe-kazooie-we-ve-all-been-waiting-for-1329214",
    "Psychonauts 2": "https://www.techradar.com/news/psychonauts-2-proves-that-mental-health-awareness-can-be-funny",
    "Super Mario 64": "https://www.techradar.com/reviews/super-mario-3d-all-stars"
  }
}