{
  "source": "https://www.techradar.com/news/inside-invincible-on-amazon-prime-a-hyper-violent-spin-on-heroes-and-villains",
  "title": "How Invincible on Amazon Prime mirrors The Boys and Batman: The Animated Series",
  "category": "entertainment",
  "updated": "2021-05-07T16:38:14Z",
  "author": "tom-power",
  "summary": "Switching up the superhero formula",
  "article": [
    "It’s been 18 years since Invincible subverted expectations of what superhero comics could be. Robert Kirkman and Cory Walker’s iconic graphic novels, which predated his other successful series - The Walking Dead - by nine months, rewrote the rulebook for many comics fans. Invincible is many things, but its violent nature, coupled with its subversive and thematically rich subject matter, means that it retains a loyal following despite The Walking Dead becoming Kirkman’s major hit.",
    "Now, almost two decades on from its initial launch, Invincible is primed to shock and delight 21st century audiences. Kirkman and Walker’s comics have arrived on Amazon Prime Video as an animated series, and Kirkman is excited to see how viewers react to its savagery and timely topics.",
    "“It’s one of the few superhero comics that has a definitive beginning, middle and end,” Kirkman tells us. “You see the main character go on a defined journey that changes them by its conclusion. Through the lens of superheroes, we can make [the violence] a much more dangerous and traumatic prospect. To be able to tell that journey again in animated form is exciting because you get to tinker with things and make them better.”",
    "Invincible tells the tale of Mark Grayson, a seemingly ordinary teenager save for one small detail - his father, Nolan Grayson, is Omni-Man, the world’s most powerful superhero. After he turns 17 years old, Mark begins to develop his own powers, and Nolan takes him under his wing to help Mark master his newfound abilities under the pseudonym Invincible.",
    "This father-son relationship is an integral part of the comics, not least for the fact Mark eventually learns that Nolan’s legacy isn’t as heroic as he thinks. Finding the right voice actors for each role, then, was vital if Amazon’s adaptation was to carry the same emotional weight that the source material does.",
    "In January 2019, Amazon revealed that J.K. Simmons would portray Nolan/Omni-Man as part of an all-star cast including Mark Hamill, Sandra Oh, Seth Rogen, Zachary Quinto, and Lauren Cohan. Steven Yeun, who Kirkman worked with on AMC’s Walking Dead TV series, was also hired to play Mark, and it’s a role that Kirkman believes was tailor made for the Minari star.",
    "“Steven is one of the hardest workers I know,” he explains. “I think he’s embodying Mark in a really compelling way, and he’s very familiar with the comics. He’s aware of the journey his character is going on all the way down to the smallest line of dialogue. He kept pulling me aside and saying ‘Okay, I’m saying this naïve because I know of this later, and then season 2 I’ll be like this’, so seeing someone planning for his character’s journey was great.”",
    "Invincible may resonate with viewers with its real life struggles and themes, but obviously it isn’t a family-friendly comic. The source material is full of barbaric brawls, death and destruction, and those moments are even more shocking and visceral when they're brought to life in the animated series. Some viewers may wonder if such gratuitously violent content is necessary, but Kirkman believes it’s imperative to Invincible’s story and subject matter.",
    "“Invincible is very serious and dramatic,” he says. “All of our drama has weight and it doesn’t shy away from the ramifications of violence. Most stories told in this medium shy away from those consequences. There’s an unending well of drama that comes from showing the myriad of consequences of realistically portrayed superhero battles.",
    "\"You want to hear superheroes say ‘Our tactics led to this bridge collapse that killed 13 people. We have to get better as a team’. We can have the more classical elements of superheroes that make them so fun and exciting and different, but also have the dramatic weight, and I think that’s something that’s going to make Invincible really stand apart.”",
    "In that respect, Invincible isn’t too dissimilar from another Amazon superhero adaptation: The Boys. This show has earned a huge following since it debuted in July 2019, with its unapologetic depictions of violence being key to its success. Invincible walks a comparable path. Zazie Beetz, who plays Mark’s love interest Amber Bennet, believes that audiences want superhero productions to be grounded in reality despite their fictional characters and worlds.",
    "“I think the emotions, family dynamic and even how the violence is depicted in Invincible is very real,” she stated. “What these characters sacrifice, and the trauma they suffer from having the responsibility of having to save the world, is a lot and I think people are interested in engaging what the reality of that would be. I get annoyed with films where a lot of death is happening, but I like that Invincible reckons with it. It adds a lot of layers and complexities, and speaks to broader themes happening in the story.”",
    "While Amazon’s adaptation sticks closely to Invincible’s source material, there are certain changes that have been made. Amber’s ethnicity has been altered from Caucasian to African-American, while Invincible’s female characters have generally been given more agency than their comic counterparts.",
    "The comics’ story, too, plays out differently in the animated series. Switching up the plot’s order, Kirkman believes, freshens things up and ensures that even long-time Invincible fans won’t know the story’s twists and turns to come - including the series’ most memorable moments.",
    "“There are very consequential events that happen - big tentpole moments - across the series that I think keeps things exciting,” Kirkman admits. “I’m eager to get to them, and there are more than a couple every season. Invincible is famous for all of its pivots away from what you expect a normal superhero story to do. We’re in the best of times to be able to come in and say ‘you guys think you know what you’re getting, but we’re going to give you something completely different’.”",
    "What won’t change is the exact nature of those major plot points. Fans of the comics will know which moments we’re alluding to, here, and Kirkman and Amazon were determined to retain the core structure, emotional beats, and distressing elements of these sequences in order to adapt them as closely as possible. It’s a sentiment that Gillian Jacobs, who portrays Samantha Wilkins/Atom Eve, agrees with, and one that she thinks stems from Kirkman’s desire for Invincible to be a meta exploration of superhero comics that have recently exploded into the mainstream.",
    "“I think, in the same way that when this came out as a comic, it felt like a response to other ones and the way they depicted superheroes,” she said. “That’s why people really gravitated towards it and it’s got such a devoted fan base. I hope, in a similar way, that the animated series will feel similar to those fans.”",
    "Invincible’s comic run may have ended in March 2018, but its legacy lives on. The series has already been turned into a motion comic, and a live-action adaptation from Seth Rogen and Evan Goldberg - a movie Kirkman will also executively produce - is in the works. For now, Kirkman’s full attention is on Amazon’s animated adaptation.",
    "The streamer hasn’t greenlit future seasons yet but, if Invincible’s TV show is as well received as its comics were, it could run for many years. There are many more arcs to adapt, and Invincible has the potential to sit alongside the elite tier of animated superhero shows.",
    "“I hope it would honor Batman: The Animated Series,” Kirkman admits when we poke at the subject. “That would be amazing, and I hope that we can live up to the amazing gravitas that that series accomplished. I think, by being animated, we’re able to embrace the inherent silliness of the superhero genre while providing something new, dramatic and unexpected. I think it couldn’t come at a better time because superhero media is so prevalent, and I’m really excited to have the chance to do that.”",
    "Invincible’s first three episodes are available to watch now exclusively on Amazon Prime Video. Future instalments will be released weekly."
  ],
  "headers": {
    "3": "Making a mark",
    "7": "A history of violence",
    "12": "Animated alterations and lasting legacies"
  },
  "links": {
    "Invincible": "https://www.techradar.com/news/invincible-on-amazon-prime-video-is-a-violent-but-heartfelt-superhero-show",
    "Amazon Prime Video": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAmazon-Video%2Fb%3Fie%3DUTF8%26node%3D3010085031%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-6438082110801257000-21",
    "The Boys": "https://www.techradar.com/news/the-boys-season-3"
  }
}