{
  "source": "https://www.techradar.com/news/data-breaches-are-costing-businesses-more-than-ever",
  "title": "Data breaches are costing businesses more than ever",
  "category": "computing",
  "updated": "2021-07-28T09:36:58Z",
  "author": "mayank-sharma",
  "summary": "IBM Research finds remote working complicated data security",
  "article": [
    "Data breach incidents hit unprecedented levels over the last year as businesses were forced to rapidly transition to a remote-first work environment, according to a new report.",
    "The latest edition of IBM’s annual Cost of Data Breach report estimates that data breaches now cost companies an average of $4.24 million per incident, which is the highest figure in the report’s 17-year history,",
    "The report suggests that the move to work-from-home environments had an adverse impact on data security, with incidents becoming more costly and harder to contain.",
    "The findings in the report are based on analysis of data breaches experienced by over 500 organizations between May 2020 and March 2021, from around the world.",
    "The report squarely blames the shift to remote work as the leading cause for increasing the cost of data breaches, suggesting that breaches cost over $1 million more on average when remote work was indicated as a factor in the incidents.",
    "The new normal hybrid work environment also affected the time it takes to respond to data breaches. It took an average of 212 days for a company to detect a data leak and another 75 to contain it, finds the report.",
    "Perhaps unsurprisingly, compromised user credentials were the most common root cause of data breaches, while personal data of customers, such as their names, emails and passwords, were the most common type of information leaked.",
    "On a positive note, the report suggests that businesses that employed modern security solutions that employed artificial intelligence (AI), analytics, and encryption, helped save between $1.25 million and $1.49 million on average.",
    "“While data breach costs reached a record high over the past year, the report also showed positive signs about the impact of modern security tactics, such as AI, automation and the adoption of a zero trust approach – which may pay off in reducing the cost of these incidents further down the line,” said Chris McCurdy, Vice President and General Manager, IBM Security."
  ],
  "headers": {
    "4": "Haste makes waste"
  },
  "links": {
    "remote-first work environment": "https://www.techradar.com/news/why-businesses-need-to-opt-for-remote-first",
    "work-from-home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "said": "https://newsroom.ibm.com/2021-07-28-IBM-Report-Cost-of-a-Data-Breach-Hits-Record-High-During-Pandemic"
  }
}