{
  "source": "https://www.techradar.com/news/diablo-2-resurrected-cant-handle-219-ultrawide-monitors-heres-why",
  "title": "Diablo 2: Resurrected can't handle 21:9 ultrawide monitors - here's why",
  "category": "gaming",
  "updated": "2021-09-08T09:14:30Z",
  "author": "gerald-lynch",
  "summary": "Blizzard also offers an explanation as to the lack of TCP / IP support",
  "article": [
    "The gates of hell are about to re-open as Diablo 2: Resurrected, a remaster of the 2000 classic, prepares to return to PC in a flashy revamped form on September 24, as well as coming to consoles for the first time. But at least one modern convenience hasn’t made the jump to the latest version of the game.",
    "While plenty of PC gamers enjoy the expanded screen real-estate and field of view of ultrawide resolutions on a 21:9 monitor, it’s an option that won’t feature in Diablo 2: Resurrected. Why? Quite simply, it breaks the game.",
    "As revealed in a new Blizzard forum blog post, “Ultrawide monitor support being modified was a subject [Blizzard] saw heavily discussed across our channels following the Beta.”",
    "“In the Technical Alpha, players with Ultrawide hardware saw their full 21:9 screens utilized during that test. However, during that test we identified limitations affecting those players and others.",
    "For example, the AI failed to sense the player and trigger attacks. Furthermore, players with 21:9 monitors were able to pull many more monsters into battle at a range limit beyond the original game’s intention. In a scenario where players (for example: playing a ranged class) were attacking monsters, players with 21:9 monitors could hit enemies with that extra screen space, but the monsters would not pull or react, but could still be defeated. Ultimately, the AI doesn’t register getting hit from that additional distance a 21:9 monitor provides. That’s not intended, especially if you’re sharing a game with a 16:9 user.”",
    "A compromise has instead been reached where 19:9 resolutions can be used – though 21:9 gamers will still have to put up with black bars on the edges of their screens.",
    "Another missing feature is TCP / IP support which allowed for a peer-to-peer connection to other players rather than using Blizzard's server, present in the original game but pulled from the Diablo 2: Resurrected remaster. Blizzard has now moved to clarify why that decision was made.",
    "“Following the Technical Alpha, we learned that this functionality was enabling significant security-related issues to our game,” continues the post.",
    "“We’re aware that removing this feature adds a large hurdle for talented multiplayer modders in our community. Still, our priority is to keep this game’s ecosystem as secure as possible for all of our players.”",
    "That’s not to say multiplayer modding of every form has been removed, nor that existing mods for the original version of the game are going anywhere.",
    "“Despite this change, a form of modding will still be possible. Players will have the ability to modify specific files which include adjusting values of skills, items, and more. However, keep in mind the Classic client of Diablo II will still exist and that is not going away. Multiplayer mods will still be able to exist and thrive on that platform by our community there.”",
    "With launch fast approaching, Diablo 2: Resurrected represents an important release for Blizzard Activision. It’s the company’s first major release since a culture of widespread workplace misconduct was alleged by current and former employees, leading to an ongoing legal case. It’s a title meant to sate the appetites of those enduring a long wait for Diablo 4, and its performance will be an interesting insight into the general public’s reaction to the legal proceedings now ongoing."
  ],
  "headers": {
    "6": "Chasing the cheats"
  },
  "links": {
    "Diablo 2: Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "ultrawide resolutions": "https://www.techradar.com/news/is-an-ultrawide-monitor-actually-worth-it",
    "21:9 monitor": "https://www.techradar.com/news/ultrawide-monitor",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors"
  }
}