{
  "source": "https://www.techradar.com/news/star-trek-strange-new-worlds-has-one-big-change-from-other-trek-shows",
  "title": "Star Trek: Strange New Worlds has one big change from other Trek shows",
  "category": "entertainment",
  "updated": "2021-04-13T08:52:45Z",
  "author": "samuel-roberts",
  "summary": "Get hyped for a more traditional-style Trek series",
  "article": [
    "Star Trek: Strange New Worlds has almost finished filming its pilot for Paramount Plus, and now executive producer and director Akiva Goldsman has revealed a lot more about the writers' approach to the show.",
    "Basically, if the original 1960s series' approach to storytelling was more to your tastes than the current crop of serialized Trek shows like Discovery and Picard, this show will be for you. Strange New Worlds had previously been teased as a more traditional-style Trek show, but now Goldsman has gotten more specific about how that will be manifested on-screen.",
    "\"Like sometimes Robert Bloch would write a horror episode [for The Original Series],\" he tells THR. \"Or Harlan Ellison would have 'City on the Edge of Forever,' which is hard sci-fi. Then there would be comedic episodes, like 'Shore Leave' or 'The Trouble With Tribbles'. So [co-showrunner] Henry Alonso Myers and myself are trying to serve that.\"",
    "Goldsman says to expect adventure-of-the-week episodes, but with serialized character arcs. \"When you close your eyes and think of the key sets and situations that you think of The Original Series, that's what we're looking to do.\"",
    "Star Trek: Strange New Worlds will be about the further adventures of the Enterprise under Captain Pike (Anson Mount), and will feature Discovery's versions of Spock (Ethan Peck) and Number One (Rebecca Romijn).",
    "Some tweaks have been made to the uniforms and look of the Enterprise since Discovery season 2, which is when these versions of the characters were introduced.",
    "No release date has been set for Star Trek: Strange New Worlds, yet, but we're expecting to see it either at the end of 2021, or towards the beginning of 2022. The show will release on Paramount Plus in the US, with other territories to be announced.",
    "Even when it comes to newer Trek shows, episodic storytelling often works best – and sometimes serialized storytelling ends up creating pacing problems, where a series can move with too much momentum (Star Trek: Discovery) or not enough (Star Trek: Picard).",
    "Indeed, Discovery season 1's time loop episode 'Magic to Make the Sanest Man Go Mad' is still one of its best to date – if Strange New Worlds can give us anything close to that level each week, we'll be in for a treat.",
    "Hollywood's overall obsession with serialized prestige TV over the past couple of decades has yielded many successes and failures, and it's actually refreshing now when we get to enjoy a high-end show where the episodes are self-contained. Hence why The Mandalorian was able to win our affections on Disney Plus."
  ],
  "headers": {
    "7": "The right move for Star Trek"
  },
  "links": {
    "Star Trek: Strange New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Discovery": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Picard": "https://www.techradar.com/news/star-trek-picard-season-2",
    "THR": "https://www.hollywoodreporter.com/heat-vision/star-trek-producer-reveals-strange-new-worlds-plan-evolving-q-for-picard",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}