{
  "source": "https://www.techradar.com/news/tiktok-influencers-are-being-targeted-by-new-phishing-threats",
  "title": "TikTok influencers are being targeted by this dangerous new phishing threat",
  "category": "computing",
  "updated": "2021-11-18T16:08:48Z",
  "author": "mayank-sharma",
  "summary": "Phishing campaign targets TikTok content creators",
  "article": [
    "Cybersecurity researchers have chanced upon a new phishing campaign that targets high-profile content creators on TikTok in order to wrest control of their account for nefarious purposes.",
    "Discovered by Abnormal Security, the scam involves two ploys. In one the scammers impersonate TikTok employees, and threaten the recipient with imminent account deletion due to an alleged violation of the platform's terms.",
    "In the other scam, the attackers bait the TikTok users with the offer of a Verified badge, which brings with it additional credibility and increased exposure.",
    "According to Abnormal, irrespective of the bait, the scammers invite recipients to click a link to proceed further.",
    "The link redirects them to a WhatsApp chat room, where the scammer, impersonating as a TikTok employee, asks the content creators for details to log into their account, including the one-time password (OTP) to bypass the platform’s multi-factor authentication (MFA).",
    "In their breakdown of the scam, Abnormal notes that they’ve spotted two activity peaks while monitoring the distribution of emails in this campaign, one on October 2, 2021, and the other on November 1, 2021.",
    "Since the researchers could get the scammer to take over their account, they are unclear as to the end goal of the scammers. Based on similar phishing campaigns on other social networking platforms, the researchers believe that the attackers could perhaps take over the account to force the owners to pay a ransom.",
    "“Social media platforms explicitly state in their terms of service that they bear no responsibility for any data loss and advise users to store all account material externally….And so even if the ransom payment is paid, there may be no regaining access to your social media accounts—costing those who depend on it for their income to lose their entire livelihood in one swoop,” warns Abnormals’ Threat Intelligence Analyst, Rachelle Chouinard.",
    "Make sure you protect yourself online with these best identity theft protection services and use these best security keys to add another layer to safeguard your accounts"
  ],
  "headers": {
    "3": "Takeover or extortion?"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "TikTok": "https://www.techradar.com/news/tiktok-could-soon-add-in-app-shopping",
    "WhatsApp": "https://www.techradar.com/reviews/whatsapp-encrypted-messaging",
    "MFA": "https://www.techradar.com/news/mfa-could-be-the-future-of-workplace-security",
    "warns": "https://abnormalsecurity.com/blog/tiktok-credential-phishing",
    "best identity theft protection services": "https://www.techradar.com/best/best-identity-theft-protection",
    "best security keys": "https://www.techradar.com/best/best-security-key"
  }
}