{
  "source": "https://www.techradar.com/news/amazon-echo-show-15-everything-we-know-about-the-wall-mounted-alexa-device",
  "title": "Amazon Echo Show 15: everything we know about the wall-mounted Alexa device",
  "category": "smart-home",
  "updated": "2021-09-28T23:14:04Z",
  "author": "hamish-hector",
  "summary": "The all-new wall-mounted Echo Show",
  "article": [
    "Picture this: The brand new Amazon Echo Show 15 is a wall-hung smart screen that’s as much a picture frame as it is a connected gadget -- and yes, you talk to Alexa with it. The device was shown off Tuesday afternoon during Amazon's 2021 hardware refresh event in the US.",
    "True to its name, the Echo Show 15 will feature a 15.6-inch touchscreen (or it can be table-mounted with a stand, if you'd prefer). Using the power of the AZ2 Neural Edge processor - custom silicon designed for the shopping giant specifically to process voice commands - Amazon's latest Echo product acts as a family hub as well as an entertainment device.",
    "The Echo Show 15 will collate calendars, notes, shopping lists, and picture-in-picture security cam features, as well as offering an alternative to your kitchen TV with its 1080p Full HD display and apps like Netflix and Prime Video.",
    "Here's everything we know about the Amazon Echo Show 15, including its price, features, and release date.",
    "The Amazon Echo Show 15 will be released in the US later this year priced at $249.99, £239.99 in the UK and AU$399 in Australia. That price includes the Echo Show 15 as well as a wall mount to use the device in landscape or portrait orientation.",
    "If you want to instead place the Echo Show 15 on a stand or use an under-cabinet mount, you'll need to purchase those separately; currently, prices aren't available for these mounts but we'll update this page as we learn more.",
    "We imagine the Amazon Echo Show 15 will come to other regions in the near future. For the time being Amazon is sticking to its usual America-first approach, wherein all its products and services launch in that region ahead of everywhere else. The release of UK and Australian pricing suggests a small tweak to that practice, of course.",
    "As with all other Echo devices, you'll be able to ask the Echo Show 15 questions, make jukebox requests and manage your other smart home devices using the “Alexa” wake-up word.",
    "On top of that, you'll be able to use the Echo Show's 15.6-inch full HD screen to enjoy shows and films from Prime Video, Netflix, and Hulu. Alternatively, you can use the cloud-based Amazon Photos service to turn the Echo Show 15 into a picture frame featuring a slide show of your favorite snaps and art.",
    "That's not all, though. Using a new visual ID feature, the Echo Show 15 can recognize who is using it and personalize on-screen information accordingly, Amazon claims. This includes a custom greeting, calendar events, reminders, and notes. If you set visual ID up for a child, the Echo Show can automatically shift to show only age-appropriate content for the young ones.",
    "If you're worried about privacy, the Echo Show 15 offers several microphone and camera controls to give you more peace of mind. You'll have the ability to view and delete voice recordings, delete your visual ID profile at any time and turn on a built-in shutter to cover the camera.",
    "Last but not least, new accessibility features will let users on the Echo Show 15 access all the benefits of Alexa through touch controls without the need for voice commands."
  ],
  "headers": {},
  "links": {
    "Amazon's 2021 hardware refresh event": "https://www.techradar.com/news/everything-from-the-amazon-2020-event-new-echo-speakers-flying-ring-security-cameras-and-amazon-luna",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "Hulu": "https://www.techradar.com/reviews/hulu"
  }
}