{
  "source": "https://www.techradar.com/news/microsoft-is-launching-a-free-website-builder",
  "title": "Microsoft is launching a free website builder",
  "category": "computing",
  "updated": "2021-02-25T12:12:35.558Z",
  "author": "mayank-sharma",
  "summary": "New service can import content from Facebook to build a website quickly",
  "article": [
    "Microsoft is foraying into the website builder business with an all-new website creation service.",
    "The tool will form part of Microsoft's Digital Marketing Center, with the company noting in a blog post announcing the service that it hopes to, “remove the barriers of cost and lack of time by providing a free and simple solution small businesses can leverage to get started with a website.”",
    "The Redmond-based software company follows WordPress, which launched the Built By WordPress.com service last month in January. However, unlike the WordPress service, Microsoft’s offering is completely free of cost.",
    "Microsoft added that the new service can automatically import a majority of the content either from a business’ Facebook page or from an existing advertising campaign.",
    "It will then use this information to fabricate a website complete with a relevant layout. You can ofcourse modify any of the content and choose another template to customize your website, before publishing it.",
    "While Microsoft hasn’t specified how it aims to monetize the service, the fact that it operates under the Digital Marketing Center umbrella could be telling.",
    "The Digital Marketing Center is Microsoft’s ad platform that helps create, execute, and manage advertising campaigns across social media platforms and search engines. It appears Microsoft hopes to rake in on the advertising dollars, when these small businesses feel the need to advertise their new websites.",
    "That said, while the ability to create free websites is available to users all over the world, the Digital Marketing Center currently only supports US businesses that advertise within the US, according to a FAQ on its website."
  ],
  "headers": {
    "3": "Advertising dollars"
  },
  "links": {
    "Microsoft": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4583537287931922000&murl=https%3A%2F%2Fabout.ads.microsoft.com%2Fen-us%2Fblog%2Fpost%2Ffebruary-2021%2Fbuild-a-free-website-for-your-business-in-digital-marketing-center",
    "WordPress": "https://www.techradar.com/best/best-wordpress-plugins",
    "Built By WordPress.com": "https://www.techradar.com/news/wordpress-is-launching-its-own-website-builder"
  }
}