{
  "source": "https://www.techradar.com/news/webex-is-about-to-get-a-lot-more-collaborative",
  "title": "Webex is about to get a lot more collaborative",
  "category": "computing",
  "updated": "2021-02-04T00:10:30Z",
  "author": "anthony-spadafora",
  "summary": "Webex users can now share up to four different video screens at once",
  "article": [
    "The future of work will involve both remote work and a new hybrid work environment which is why Cisco has announced a number of new updates to its Webex video conferencing software that will make it easier to collaborate using the platform.",
    "After unveiling its new line of desk devices at its WebexOne event back in December, the company's new Webex Desk Camera is now available to purchase. The AI-powered device offers 4k resolution, facial recognition, background noise removal and vibrant color regardless of a room's lighting conditions.",
    "In certain use cases, one video feed simply isn't enough for meeting participants to understand what's going on. For this reason, Cisco has created a new Webex multi-content video solution that allows users to share up to four different video screens at once. This solution is perfect for organizations in the healthcare, engineering and legal industries where remote experts often have to review data from a variety of sources to make quick decisions.",
    "Cisco has also updated Webex Assistant to make it easier to view and share details from Webex meetings. Now hosts will receive a pop-up once a meeting ends containing highlights, action items and transcripts that can be easily shared with attendees with just one click.",
    "To allow IT admins to get the real-time insights they need, Cisco has completely redesigned the analytics suite in Webex Control Hub.",
    "One of the biggest features of the redesigned hub is the fact the company has replaced its previous 24-hour data refresh cycle with a new 10-minute refresh cycle. While 24 hours has long been the industry standard, Cisco's shortened refresh cycle will provides IT admins with real-time insights that are even more relevant.",
    "The redesigned Webex Control Hub also includes a more modern and user friendly interface with contextual filtering options to help find the data that is most important more easily. Troubleshooting network quality issues will be easier as well for IT admins who can now use the combined power of enhanced analytics, real-time diagnostics and troubleshooting tools.",
    "Cisco's new Webex features are available now and bring the company one step closer to delivering on its goal of delivering 10x better experiences than in-person interactions when video conferencing."
  ],
  "headers": {
    "4": "Webex Control Hub"
  },
  "links": {
    "Webex": "https://www.techradar.com/reviews/cisco-webex-meetings",
    "WebexOne": "https://www.techradar.com/news/webex-could-finally-be-catching-up-to-zoom-and-microsoft-teams",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "Webex Assistant": "https://www.techradar.com/news/cisco-is-making-webex-even-smarter-with-ai",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}