{
  "source": "https://www.techradar.com/news/huawei-nova-9-announced-as-a-pixel-6-rival-with-two-big-issues",
  "title": "Huawei Nova 9 announced as a Pixel 6 rival with two big issues",
  "category": "phones",
  "updated": "2021-10-21T15:00:19Z",
  "author": "james-rogerson",
  "summary": "Good specs with two problems",
  "article": [
    "The Google Pixel 6 range unsurprisingly has all the attention right now, but these aren’t the only new phones on the block, as the Huawei Nova 9 has also just been unveiled.",
    "Technically this was actually unveiled in September, but back then it was only announced for China, whereas now it’s getting a wider launch. That said, while we’ll likely see it in the UK and possibly Australia, a US launch won’t be on the cards.",
    "For those who can buy it though, the Huawei Nova 9 has a lot of tempting tech inside – enough that it could even sway some buyers away from the Google Pixel 6. The Huawei Nova 9 has a 6.57-inch 1080 x 2340 OLED screen with a 120Hz refresh rate, a mid-range Snapdragon 778G chipset, 8GB of RAM, and a choice of 128GB or 256GB of storage.",
    "The phone also has a 4,300mAh battery with 66W fast charging, and there’s a quad-lens rear snapper, with a 50MP f/1.9 main sensor, an 8MP f/2.2 ultra-wide camera, a 2MP f/2.4 macro one and a 2MP f/2.4 depth sensor. Then on the front there’s a 32MP f/2.0 camera.",
    "Those rear cameras are housed in a distinctive oval camera block with two big circles – a design that’s similar to what we’ve seen on the Huawei P50. The rest of the design here includes a glossy back in Starry Blue, Crush Green or Black, and an all-screen front with a punch-hole camera.",
    "They’re promising specs – if the price is right, but sadly that detail hasn’t been revealed yet, and nor has the release date or availability, though as noted we wouldn’t expect this in the US given the Huawei ban.",
    "Looking at these specs, the Huawei Nova 9 could stand up well to the Pixel 6 in many ways. It has a larger screen with a higher refresh rate, more cameras and faster charging – though its chipset is likely lesser, and it has a slightly smaller battery.",
    "The real problems the Huawei Nova 9 face though are firstly that it doesn’t include 5G, which at this point is basically a standard feature in mid-range and above phones.",
    "An even bigger problem though is that while the Nova 9 runs Android (with Huawei’s EMUI 12 overlay), it lacks access to the Google Play Store or Google’s apps.",
    "This is a problem Huawei phones have been facing for years now, and it makes them harder to recommend – though there are alternative app stores where many apps can be found."
  ],
  "headers": {
    "6": "Analysis: a Pixel 6 rival with two big problems"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban"
  }
}