{
  "source": "https://www.techradar.com/news/this-dollar400-off-dell-g15-is-the-best-cheap-black-friday-gaming-laptop-deal-right-now",
  "title": "This $400 off Dell G15 is the best cheap Black Friday gaming laptop deal right now",
  "category": "computing",
  "updated": "2021-11-11T21:28:02Z",
  "author": "alex-whitelock",
  "summary": "On a budget? This is one of the better options this November",
  "article": [
    "If you're shopping for early Black Friday gaming laptop deals then we definitely recommend checking out this 15.6-inch Dell G15 for $813.39 ($1,218).",
    "A mammoth $406 saving makes this one of the better lower to mid-range options out there considering it packs in an RTX 3050 Ti graphics card, 512GB SSD, 8GB of RAM, and Intel Core i5-11400H processor - very respectable specs indeed.",
    "These components aren't super beefy, but for the price - they're absolutely stellar. While the upper flights of graphical settings might be slightly out of your reach on some resolutions, at 1080p you'll be able to max out a surprisingly large library of titles. Most importantly, you'll also get a fairly cheap way to unlock those Ray-Tracing and DLSS features where applicable.",
    "So far, Black Friday deals on mid-range machines like this have been surprisingly rare too. We've seen plenty of early Black Friday gaming laptop deals on machines with RTX 3070's or RTX 3080's, but not much for those gamers on a budget. Subsequently, this is a good option if you're looking for something with a bit of power but don't want to spend too extravagantly this November.",
    "Outside the US? Check out today's best gaming laptop deals in your region just below.",
    "And, if you want to see more reasonably-priced options, check out our main page on this week's best cheap gaming laptop deals."
  ],
  "headers": {
    "5": "Early Black Friday gaming laptop deals at Dell"
  },
  "links": {
    "for $813.39 ($1,218)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2759528148829991400/https://deals.dell.com/en-us/member/productdetail/bcde",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday gaming laptop deals": "https://www.techradar.com/black-friday/black-friday-gaming-laptop-deals",
    "cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000"
  }
}