{
  "source": "https://www.techradar.com/news/why-harry-potter-and-lord-of-the-rings-are-still-casting-a-spell-over-us-20-years-on",
  "title": "Why Harry Potter and Lord of the Rings are still casting a spell over us 20 years on",
  "category": "entertainment",
  "updated": "2021-11-28T19:38:28Z",
  "author": "richard-edwards",
  "summary": "Opinion: 2001 was a magical year...",
  "article": [
    "There must have been magic in the air. In November and December 2001, two fantasy movies cast a spell so powerful they changed Hollywood forever.",
    "Both were based on an epic series of novels – one nearly half a century old, the other yet to be completed – and went on to become two of the biggest movie franchises in history. And, looking back, you could make a strong argument that the period, 20 years ago, was among the most pivotal in 21st century cinema.",
    "Two decades on from their original releases, the Harry Potter and Lord of the Rings movies are so enshrined in the collective pop culture repository – for many, the definitive visions of the stories – that they seem the ultimate no-brainer. After all, Tolkien’s tales had long been the accepted blueprint for epic fantasy, while JK Rowling’s Wizarding World was well on its way to becoming the most successful book series of all-time.",
    "But point your Time-Turner towards the start of the 21st century, and Harry Potter and the Sorcerer’s Stone (Philosopher’s Stone in the UK) and The Fellowship of the Ring were much more of a gamble.",
    "Fantasy had rarely troubled the box office in the 1990s. Eighties swords-and-sorcery outings like Krull, Dragonslayer, Beastmaster and Ladyhawke were a distant memory. Meanwhile, Ghost, The Sixth Sense, Aladdin, and Beauty and the Beast were the supernatural genre’s only representatives among the 50 highest grossing movies of the decade. The age of the franchise was yet to begin in earnest, so this was a time when original films were still able to rule supreme – that same top 50 of the ’90s features a mere 10 sequels, and three of those are James Bond movies.",
    "But Potter and The Lord of the Rings had to be franchises. Calling it a day after adapting the first books wasn’t a serious option because they were never designed to tell a complete story.",
    "Neither The Sorcerer’s Stone or The Fellowship of the Ring were the first movies to leave a story unresolved – indeed, Ralph Bakshi’s animated 1978 adaptation of The Lord of the Rings ended at the halfway point, its sequel unmade – but to do so on a first outing was an incredibly bold move. George Lucas could only end The Empire Strikes Back on a cliffhanger after the original Star Wars had already broken box office records. Even the biggest genre blockbusters of the ’90s – Jurassic Park, Men In Black, Independence Day – were originally made as standalones, with their subsequent follow-ups afterthoughts following their respective successes.",
    "For Harry Potter and Lord of the Rings, however, their production studios (Warner Bros and New Line Cinema) played the long game from day one. The second Potter film was in front of the cameras within days of the first landing in theaters, while The Lord of The Rings was even more ambitious. Director Peter Jackson was given licence to shoot all three movies of the trilogy back-to-back in New Zealand – in hindsight a smart money-saving move, but it would have been a financial disaster had The Fellowship of the Ring flopped.",
    "Fast forward to the present day and Christopher Nolan is arguably the only director making blockbuster movies that don’t have ‘franchise’ on their mind. Potter, in particular, showed that fans will happily stay hooked on a story told across eight movies over an entire decade. In fact, we'd go as far as to say that the infinitely growing Marvel Cinematic Universe may not have seemed a viable option if the Boy Wizard hadn't test-driven the terrain first.",
    "That 2001 double-whammy also shifted accepted wisdom that the only time to release a blockbuster was the summer months. Fall and winter have now become the box office’s prime battleground, with The Fellowship of the Rings’ pre-Christmas berth now so coveted that it’s hosted Avatar, Aquaman and four Star Wars movies. And would we have seen so many franchises releasing movies just a year apart – see also The Matrix, Star Wars and the Avengers – if Harry Potter and The Lord of the Rings not proved the strategy can deliver lucrative results? Not in our minds.",
    "If there’s one certainty in Hollywood, it’s that rival studios will be quick to jump on the next big thing. And so, as soon as the first movies became smash hits, the search for the next Harry Potter and The Lord of the Rings was on.",
    "Adaptations of Young Adult (YA) book sagas soon became all the rage – The Hunger Games and Twilight were big hits, The Golden Compass and The Mortal Instruments not so much – while epic fantasy eventually became commonplace on our screens. It’s extremely unlikely HBO would have taken a punt on Game of Thrones without Jackson’s Middle-earth movies, and without Westeros, there’d probably be no Netflix's The Witcher and no Amazon's The Wheel of Time. Whether any of the Potter or Rings imitators have captured the zeitgeist in quite the same way, however, is debatable.",
    "There’s no doubt both the Harry Potter and The Lord of the Rings series were perfectly timed to take advantage of technological advances. As well as helping to power the DVD boom – the Extended Editions of The Lord of the Rings were soon regarded as the definitive versions – they were key series in pushing the boundaries of visual effects.",
    "With the exception of some duff visuals in The Sorcerer’s Stone, both franchises exploited the potential of the technology, as effects merged so seamlessly with live-action we forgot they weren’t actually there. And if the much-maligned Jar Jar Binks was at the vanguard of digital characters, it was the performance-captured Gollum who made everyone sit up and take notice – no one was really sure if the brilliant Andy Serkis should be mentioned in conversations about awards or not. Two decades on, big-name actors hiding behind a digital facade is commonplace.",
    "But perhaps the biggest legacy of the two franchises is the way they shifted the world’s perceptions of fantasy, bringing epic tales of heroism and magic well and truly into the mainstream. Both sagas were made with complete respect for the source material, as Potter producer David Heyman and Middle-earth director Peter Jackson oversaw their respective domains with an unashamed love for the worlds they were realizing.",
    "It’s an approach that kept (most) fans on board for the duration, and is now serving Marvel well into its Phase 4 slate, Star Trek and numerous other franchises well. Bona fide fans are now telling the biggest stories on screen – and genre movies and TV are thriving because of it.",
    "Harry Potter and The Lord of the Rings are both available to stream now on HBO Max in the US, and Amazon Prime in the UK. The Harry Potter 20th Anniversary: Return to Hogwarts Special premieres on HBO Max on New Year’s Day."
  ],
  "headers": {
    "5": "Playing the long game",
    "10": "A matter of timing"
  },
  "links": {
    "Harry Potter": "https://www.techradar.com/how-to/how-to-watch-the-harry-potter-movies-in-order",
    "James Bond movies": "https://www.techradar.com/how-to/how-to-watch-the-james-bond-movies-in-order",
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Avatar": "https://www.techradar.com/news/avatar-2-release-date",
    "Aquaman": "https://www.techradar.com/news/aquaman-2-release-date-cast-and-what-else-we-know-about-dcs-return-to-atlantis",
    "The Matrix": "https://www.techradar.com/news/the-matrix-4-trailer-breakdown-11-things-we-noticed-in-the-resurrections-teaser",
    "Game of Thrones": "https://www.techradar.com/news/where-to-watch-game-of-thrones-online",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Amazon's The Wheel of Time": "https://www.techradar.com/news/the-wheel-of-time-is-amazon-primes-big-budget-fantasy-show-that-cant-afford-to-fail",
    "Phase 4 slate": "https://www.techradar.com/news/marvel-phase-4",
    "Star Trek": "https://www.techradar.com/news/star-trek-strange-new-worlds"
  }
}