{
  "source": "https://www.techradar.com/news/instagram-is-introducing-an-incredible-new-way-to-get-nostalgic",
  "title": "Instagram is introducing an incredible new way to get nostalgic",
  "category": "computing",
  "updated": "2021-12-09T20:30:30Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Share your 2021 highlights while you can",
  "article": [
    "As we approach a new year, it is only natural that we start to think back to what the previous one has been like. If you're the sort of person who likes to feel the wave of nostalgia that Facebook's Memories feature can bring each day, you're going to love the new feature that Instagram is introducing.",
    "Building on the idea of the Stories archive that was introduced a few years back, Instagram is adding a new, time-limited way to share your 2021 highlights with your friends.",
    "The new feature is called Playback, which gives you a way to create a customized journey through your year by selecting your favorite moments from your Stories archive. It is a more personal option than many of the \"look back over the previous\" year features that the likes of Facebook create as you are placed in control of what is included.",
    "While there is a lot to be said for automated \"year in review\" posts, what is algorithmically selected for inclusion may not match what you would have chosen yourself. And this is why Instagram's approach is so great.",
    "The new feature lets you select up to ten Stories from your archive, and if you would like to post an upbeat Playback, you can select all of the positive Stories you have posted across the year.",
    "Equally, you might be feeling more melancholy, in which case you can opt for the slightly sadder posts. Or, of course, you can mix it up to give a fair representation of the ups and downs that 2021 has probably involved for you.",
    "The Playback feature launches today and will be available for \"A few weeks\". You will see a message pop up within the app inviting you to create your Playback. You can then nostalgically sift through your Stories and select the ones that you think best sum up the year.",
    "Instagram also says that if you see a 2021 Story posted by somebody else, you just need to click on the 2021 sticker contained within that Story in order to create your own Playback.",
    "So take a browse through your Stories archive and share your 2021 highlights with your friends and family."
  ],
  "headers": {
    "4": "Get reflective on Instagram"
  },
  "links": {}
}