{
  "source": "https://www.techradar.com/news/astronomers-catch-a-white-dwarf-turning-itself-on-and-off-for-the-first-time",
  "title": "Astronomers catch a white dwarf turning itself on and off for the first time",
  "category": "appliances",
  "updated": "2021-10-18T15:00:00Z",
  "author": "john-loeffler",
  "summary": "A rotating magnetic field could be causing this novel phenomenon",
  "article": [
    "White dwarfs are among the most studied and understood celestial objects in the universe, but they are still capable of surprising us when we least expect it.",
    "Astronomers using NASA's Transiting Exoplanet Survey Satellite (TESS) were studying a white dwarf in a binary star system when they suddenly caught it turning itself \"on and off\" over the course of as few as 30 minutes.",
    "The researchers, lead by Dr. Simone Scaringi at the Centre for Extragalactic Astronomy, at Durham University, UK, were studying how the white dwarf accreted material – a fancy way of saying gobbling up – from its stellar partner when they observed the brightness of the white dwarf suddenly plummet. The observations were published this week in the journal Nature Astronomy.",
    "\"To see the brightness of TW Pictoris plummet in 30 minutes is in itself extraordinary as it has never been seen in other accreting white dwarfs and is totally unexpected from our understanding of how these systems are supposed to feed through the accretion disc,\" Scaringi said. \"It appears to be switching on and off.\"",
    "This kind of shift isn't unusual in other objects like neutron stars, but it is the first time it has been observed in a white dwarf, which makes it especially interesting to astronomers studying the physics of 'accretion'.",
    "Accretion is the process by which vast amounts of material accumulates from a source into a rotating disc around a center of gravity that slowly absorbs the material. Most famously, Saturn's rings are a form of accretion disk, as is the disk surrounding the supermassive black hole in the heart of the galaxy M87, which was the first black hole ever directly imaged back in 2019.",
    "Much like the accretion disk around M87's supermassive black hole, the accretion disk around a white dwarf star also causes it to shine brightly as the rapidly accelerating material on the inner edge of the disk generates radio waves that astronomers are able to detect. It is these radio waves that Scaringi has been studying in order to understand the physics behind this process as it plays out throughout the universe.",
    "\"In general the accretion process does not have any short-term 'gaps',\" Dr. Scaringi told TechRadar in an email. \"What generally happens in these types of systems is that the donor star in orbit around the white dwarf keeps feeding the accretion disk. As the accretion disk material slowly sinks closer towards the white dwarf it generally becomes brighter, and eventually makes it onto the white dwarf surface.\"",
    "\"It is known that in some systems the donor stars stops feeding the disk (for yet unclear reasons),\" Dr. Scaringi told us. \"When this happens the disk is still bright as it 'drains' material that was previously still there. It then takes the disk about one to two months to drain most of the material, something we saw happen in different accreting white dwarfs.",
    "\"Once the amount of material has nearly drained out entirely, this is when so-called 'magnetic-gating' acts: the spinning magnetospheric barrier of the white dwarf prevents left-over disk material from simply accreting smoothly, but instead regulates the amount that lands onto the white dwarf in 'fits and starts'.",
    "\"As it takes months to drain a disk out, seeing TW Pictoris drop in brightness in 30 minutes was totally unexpected,\" Scaringi told us. \"What we think may be happening in TW Pictoris is that instead of the disk being drained out so fast, we are seeing some sort of reconfiguration of the white dwarf magnetic field, which promptly pushes the inner-disk edge outwards, and thus makes it fainter.\"",
    "These observations may turn out to be a critical step in our understanding of accretion behavior, since white dwarfs are far more common in the universe than neutron stars or black holes, which are also well know but little understood accretors.",
    "This phenomenon should thus be easier to study around white dwarfs, and since the physics behind accretion are essentially the same as it is with neutron stars and black holes, we should be able to extrapolate what happens around a white dwarf to these more exotic accretors.",
    "\"This really is a previously unrecognized phenomenon\" Scaringi said, \"and because we can draw comparisons with similar behavior in the much smaller neutron stars it could be an important step in helping us to better understand the process of how other accreting objects feed on the material that surrounds them and the important role of magnetic fields in this process.\"",
    "White dwarfs are some of the most common objects in the night sky, even if they are among the tiniest. Usually found at the center of so-called planetary nebulae – a type of smaller nebula that doesn't result from a supernova but rather a gradual shedding of outer material from a dying star – these kinds of stellar corpses are easier to spot and thus study than more elusive neutron stars or black holes.",
    "As such, we know a lot about white dwarfs, but clearly there is even more to learn about them. The processes at work in these remnant cores of dead stars are the product of forces beyond anything we've ever encountered in our own solar system – thankfully – so objects like TW Pictoris are especially interesting for us.",
    "Studying their environment and how they interact with the space around them can give us real insight into their inner workings, with implications for our own sun, which is one day destined to become a white dwarf some five to eight billion years from now.",
    "How this magnetic gating mechanism works is still a matter of study, but clearly we aren't even close to fully understanding these remarkable objects."
  ],
  "headers": {
    "14": "Analysis: White dwarfs still have secrets to share"
  },
  "links": {
    "Nature Astronomy": "http://dx.doi.org/10.1038/s41550-021-01494-x",
    "first black hole ever directly imaged": "https://www.techradar.com/news/see-the-first-real-pictures-of-a-black-hole-revealed-live"
  }
}