{
  "source": "https://www.techradar.com/news/disney-is-already-making-a-cruella-sequel",
  "title": "Is Cruella 2 already in the works for Disney Plus?",
  "category": "entertainment",
  "updated": "2021-06-07T13:17:33Z",
  "author": "henry-st-leger",
  "summary": "Cruella 2 (2ella?) seems to be in the early stages of planning",
  "article": [
    "Disney is already working on a Cruella sequel after the success of its 101 Dalmatians ‘premake’ on Disney Plus, according to Deadline.",
    "The Cruella origin story, which reimagines the Disney villainess as a punk fashion designer in the 1970s, has already been a hit with viewers, reportedly being watched in almost 700,000 households through Disney Plus Premier Access – meaning quite a lot of people were willing to pay several months worth of their subscription to see it.",
    "Despite the film having only been on the streaming service for a week or so, Deadline reports that a sequel is already underway, with Cruella’s lead writer (Tony McNamara) and director (Craig Gillespie) set to return for Cruella 2.0.",
    "We previously speculated about a possible Cruella sequel, fuelled by the film’s leads – Emma Stone and Emma Thompson – confirming they’d be open to returning to the IP.",
    "Speaking to Rotten Tomatoes, the actresses hinted that a spinoff could act as both prequel and a sequel, in a similar way to Francis Ford Coppola’s The Godfather Part II, jumping back and forth between time periods. Given the heist-movie leanings of Cruella, it’s possible that we could veer into Godfather territory, possibly with Cruella embracing a role of crime boss from her Hell Hall manor.",
    "Of course, the end of Cruella sets up the events of 101 Dalmatians quite neatly, though we’d expect a spinoff to focus more on Cruella and her burglar friends, Horace and Jasper, rather than retreading the events of the 1961 animated film.",
    "In our Cruella review, we wrote that “Cruella is truly notable as a ‘premake’ that does a notorious Disney villain justice, while coming packed with fresh and outlandish ideas to prevent it feeling like a box-ticking origin story.”",
    "As one of the most imaginative retellings of a Disney classic in some time, we only hope that Disney can manage to bottle lightning for a second time in a now-inevitable sequel."
  ],
  "headers": {
    "3": "Second time lucky?"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/06/cruella-sequel-in-early-development-director-craig-gillespie-writer-tony-mcnamara-expected-to-return-1234769847/",
    "Disney Plus Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "We previously speculated about a possible Cruella sequel": "https://www.techradar.com/news/cruella-end-credits-scene-explained-how-disneys-prequel-ties-into-101-dalmatians"
  }
}