{
  "source": "https://www.techradar.com/news/should-i-buy-an-ultra-short-throw-projector",
  "title": "Should I buy an ultra short throw projector?",
  "category": "audio-visual",
  "updated": "2021-05-07T10:42:21Z",
  "author": "henry-st-leger",
  "summary": "A guide to the ultra-convenient projection technology",
  "article": [
    "Should you buy an ultra-short throw projector? The high-end projection technology has been making waves in the home cinema space for a few years now, with everyone from LG, Samsung and Vava getting in on the action – and it's clear that the conveniences of minimal projection distances offer a lot for many a cinephile out there.",
    "Ultra-short throw projectors are certainly more expensive than other, regular short-throw (or even long-throw) models a lot of the time, given the laser technology used to display images at such a sharp and sudden angle against a wall or screen. And if you plan on setting up a 4K projector on a coffee table halfway across the room – or a shelf some distance behind you – suffice to say that they won't work with your setup.",
    "Thankfully, though, you shouldn't have to choose between form and function, as ultra short throw models largely offer great picture quality (thanks to their laser projection) as well as a convenient form factor, sitting on a counter much as a TV would, but taking up a fraction of the wall space when not in use.",
    "So, should you buy an ultra-throw projector? And how much would it even cost you? In this guide we'll run you through the underlying technology at work, what specific models to keep an eye out for, and why an ultra-short throw projector may (or may not) work for you.",
    "Ultra short throw projectors are an evolution of existing 'short throw' beamers. Whereas regular short throw projectors can project (or 'throw') an image from only a few feet away (as little as three, or as many as eight), ultra short throw cuts down the distance to a matter of inches.",
    "That means they can be placed as close to a wall as you would a television, and is an easy upgrade if your living room is already setup in that manner – though it won't quite sit flush against the wall.",
    "You can choose to project direct onto the wall or onto a dedicated screen, though the former allows the arrangement to take up much less space when not in use – ideal for those who opting for a projector to avoid having a big, black rectangle in their living room at all times.",
    "This ultra short throw distance is made possible by laser projection, with wide-angle lenses and mirrors to display at a steep angle without distorting the image. The laser tech also means that these models are quite bright, and should be capable even in moderately bright surroundings, even if a darkened room will still be best for allowing the picture to shine. They tend to be coupled with 4K resolution too.",
    "Another benefit is built-in audio, which you'll get with most UST models, and will ensure that the sound is coming from the same direction as the picture (something you won't get with short-throw projectors, which may have speakers that are stuck a few feet away from the actual projection).",
    "They cost far more than LCD or DLP projectors, though opting for these alternatives will mean you have to ditch a lot of the perks of laser technology.",
    "Ultra short throw projectors currently sit at the high-end of home cinema projectors, meaning you're going to have to shell out a few thousand dollars or pounds for the privilege of owning one. (If that puts you off, check out our projector deals guide for something on the cheaper side.)",
    "The cheapest models we'd recommend sit at around the $3,000 / £3,000 / AU$5,000 mark, such as the Optoma CinemaX P2 (max 120-inch projection), and the Vava 4K laser projector (max 150-inch) – though you are making some sacrifices at this price point. The Optoma model has quite a basic smart offering, even while it offers some capable audio, while the Vava isn't the best for processing dark scenes, though both offer a great entry point to the technology.",
    "Above that, you're looking at around $4,000 / £4,000 for a cinephile offering like the LG HU85LA CineBeam (90-120 inch projection), or the single-laser Samsung LSP7T that makes use of the excellent Tizen smart platform and even throws in HDR10+ support. The top-range, triple-laser Samsung LSP9T (note that '9', rather than the '7' of the step-down model) will cost you £6,999 / $6,490 / AU$10,999 for a truly flagship experience though.",
    "It's worth noting, too, that some long-throw projectors can end up costing tens of thousands of dollars or pounds, such as the Sony VPL-GTZ380 that boasts a 10,000 lumens brightness (rather then the 2,500-3,000 brightness of most models listed above) and uses Sony's proprietary SXRD (Silicon X-tal Reflective Display) technology.",
    "Ultra short throw (or 'UST') projectors are a boon for those looking for bright pictures, great image quality, and the convenience of a projection that can be summoned and banished at your whim without taking up the space of a large television – all without the inconveniences of a long-throw projector that needs to be placed in a specific place elsewhere in the room.",
    "UST models are expensive, though, and you may get comparable image quality with a decent lamp model at two-thirds of the price.",
    "If you're planning on placing a projector on a counter, too, you may want to consider opting for a television, as the price point for an ultra short throw projector would net you a pretty fantastic TV (like the LG G1 OLED, for one). Of course, you'd be hard pressed to find a 4K TV with a 120-inch or even 150-inch image, so that might mean settling for a 65-inch 4K TV or 75-inch 4K TV instead."
  ],
  "headers": {
    "4": "Ultra short throw projector: what is it?",
    "10": "How much do ultra short throw projectors cost?",
    "14": "Should I buy an ultra short throw projector?"
  },
  "links": {
    "4K projector": "https://www.techradar.com/best/4k-projector",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "projector deals": "https://www.techradar.com/news/cheap-projectors",
    "Optoma CinemaX P2": "https://www.techradar.com/reviews/optoma-cinemax-p2-4k-projector",
    "Vava 4K laser projector": "https://www.techradar.com/reviews/vava-4k-laser-projector",
    "LG HU85LA CineBeam": "https://www.techradar.com/reviews/lg-hu85la-cinebeam-projector",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Samsung LSP9T": "https://www.techradar.com/reviews/samsung-premiere-lsp9t-projector",
    "Sony VPL-GTZ380 that boasts a 10,000 lumens brightness": "https://www.techradar.com/news/new-sony-4k-projector-hits-10000-lumens-for-oled-like-hdr",
    "LG G1 OLED": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "65-inch 4K TV": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "75-inch 4K TV": "https://www.techradar.com/news/best-75-inch-4k-tvs"
  }
}