{
  "source": "https://www.techradar.com/news/horizon-forbidden-west-reportedly-delayed-until-early-2022",
  "title": "Horizon Forbidden West reportedly delayed until early 2022",
  "category": "gaming",
  "updated": "2021-07-30T18:50:25Z",
  "author": "david-lumb",
  "summary": "The next big PS5 game Horizon Zero Dawn has reportedly been delayed",
  "article": [
    "Horizon Forbidden West has reportedly been delayed until the first quarter of 2022, according to a new Bloomberg report.",
    "This would push the Horizon Forbidden West release date back from its previous window in late 2021, delaying another of the games Sony showcased for the PS5. While developer Guerrilla Games never gave a specific release date for the game, its executives previously suggested the game would come out this year, and the company tweeted in May that ‘development is on track.’",
    "While GamesBeat’s Jeff Grubb reported that Sony was deliberating on whether to delay the game, Bloomberg’s source affirms that the publisher has indeed delayed it.",
    "The Bloomberg report didn’t state why the game’s release date was delayed, but it would be the latest in a series of AAA game launches that have been pushed back to give studios more time – most recently in June after God of War: Ragnarok was delayed until 2022.",
    "It’s tough to determine whether these upcoming games were pushed back specifically due to Covid-related development delays or if they’re just run-of-the-mill release date delays that are typical of the video game industry. It’s easy to imagine why the lockdown and remote work would slow down game development, but studios have suddenly become coy about naming Covid as a cause for delays.",
    "In April 2020, for instance, announcements openly cited the pandemic as reason why The Last of Us 2 and Death Stranding were both pushed back to July releases, while in August both Deathloop and Halo Infinite were confirmed delayed until 2022. But by early 2021, studios and publishers returned to general and vague reasons for delays, like with Sony’s Outriders and the open-world Gotham Knights.",
    "What changed? It’s possible that the video game industry felt gamer sympathies around Covid delays may have waned, but there could be a bigger reason: Cyberpunk 2077, which launched in December 2020 with so many game-breaking bugs that it was taken off the Sony PS4 store and, even by June 2021, developer CD Projekt Red’s CEO promised that the game’s team would continue to fix issues until the game would “live up to what was promised.”",
    "In other words, delaying months or a year and irritating gamers is worth it to avoid launching a buggy game that still hasn’t lived up to expectations half a year later."
  ],
  "headers": {
    "3": "Analysis: AAA game delays: commonplace or Covid-related?"
  },
  "links": {
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-07-30/playstation-video-game-horizon-forbidden-west-delayed-to-2022",
    "tweeted": "https://twitter.com/Guerrilla/status/1398027526505603077",
    "reported": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9036752344464901000&xs=1&url=https%3A%2F%2Fwww.giantbomb.com%2Fshows%2Fgrubbsnax-ep-05-thats-no-moon-ps5-ssds-and%2F2970-21150%2Fpremium-video&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhorizon-forbidden-west-reportedly-delayed-until-early-2022",
    "delayed": "https://www.techradar.com/news/god-of-war-ragnarok-delayed-to-2022-and-it-could-be-coming-to-ps4",
    "The Last of Us 2": "https://www.techradar.com/news/what-the-last-of-us-2s-delay-means-for-this-years-other-game-releases",
    "Death Stranding": "https://www.techradar.com/news/death-stranding-on-pc-is-delayed-to-july-due-to-covid-19-disruption",
    "Deathloop": "https://www.techradar.com/news/a-major-ps5-exclusive-game-has-been-delayed-are-developers-ready-for-next-gen",
    "Halo Infinite": "https://www.techradar.com/news/halo-infinite-delayed-until-2021-because-it-is-not-sustainable-to-release-this-year",
    "Outriders": "https://www.techradar.com/news/outriders-has-been-delayed-again-but-you-can-play-the-free-demo-next-month",
    "Gotham Knights": "https://www.techradar.com/news/gotham-knights-has-been-delayed",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "promised": "https://www.techradar.com/news/cyberpunk-2077-can-live-up-to-what-we-promised-according-to-cd-projekt-ceo"
  }
}