{
  "source": "https://www.techradar.com/news/critical-role-campaign-3",
  "title": "How to watch Critical Role campaign 3",
  "category": "entertainment",
  "updated": "2021-10-21T16:15:47Z",
  "author": "henry-st-leger",
  "summary": "Critical Role campaign 3 is here",
  "article": [
    "Critical Role campaign 3 has arrived! Anyone who's been waiting and sighing by the internet for Critical Role to come back with a new long-form campaign can now enjoy the hooting and hollering of its voice actor stars crying out \"dungeons and dragons\" at the start of each stream.",
    "The Critical Role campaign 3 release date has been confirmed for some time as October 21, which is when the first episode of the hit D&D podcast and web series airs – or has aired, depending on when you're reading this.",
    "You can see the State of the Role broadcast below for all the tidbits, or read on below for the date and time each episode airs, what to expect from campaign 3, and the location of the next campaign setting too.",
    "The first episode of Critical Role campaign 3 airs on October 21. Episodes air at 7pm PT / 10pm ET / 2am GMT (that last time pushing into the following Friday morning).",
    "There'll be a new episode every Thursday, except the last Thursday of every month – as DM Matthew Mercer says the last Thursday of every month will let the cast take a break and do storytelling preparation, as well as broadcast other one-shots or spin-off programming around the main show.",
    "If you can't catch it, live rebroadcasts will air the following Monday at 12am PT and 9am PT on Twitch, with a VOD also available from that day on Twitch and YouTube. Special screenings of the premieres will also be available to watch in select cinemas across the US; more details can be found on Cinemark's website.",
    "Matt Mercer will return as DM when the new campaign kicks off; however, Critical Role promises there will be some surprises in store and \"new storytellers\" as campaign three progresses – possibly inspired by Exandria Unlimited, the Critical Role mini-series hosted by Game Master Aabria Iyengar and which ran between campaign 2 and 3.",
    "Warning: there are some spoilers ahead for Critical Role campaign 2.",
    "There was a significant time jump between the first and second campaigns, with the latter taking place around 20 years after the events of the former. The Exandria Unlimited mini series also took place 10 years after the end of campaign 2.",
    "It makes much more sense for each campaign to take place after the events of a previous one, to ensure continuity, prevent ‘prequel’ campaigns from messing up the timeline of later ones, and also allow player actions in early campaigns to have considered, long-term effects in successive stories.",
    "Given the close of campaign 2, in which Matthew Mercer confirmed that the Mighty Nein managed to reintroduce the Warforged (‘Aeormaton’) race into the world of Exandria, we’re expecting campaign 3 will be set long enough afterwards that we can see the impact of that on the wider world – possibly even with a Warforged player character in the mix.",
    "We know the new campaign is set on the continent of Marquet, which is southwest of campaign one setting Tal'Dorei. It's a place of deserts and mountains rather than the icy plains (and Astral Sea) that campaign 2 ended on. However, we will likely see some returning locations and characters too.",
    "Talks Machina has been Critical Role's way of discussing the events of their actual-play D&D game during the last two campaigns. An aftershow is set to make a return for campaign 3, we're told, but it likely won't involve Brian Foster, the host of the show in previous iterations.",
    "Foster stepped away from Critical Role to focus on his own projects after campaign 2, so it's likely there'll be a new host. Our money's on a previous guest star on Critical Role like Mica Burton, or even Aabria Iyengar, who DM's the Exandria Unlimited mini series.",
    "The cast of the Mighty Nein end on some curious notes, and it’ll be fascinating the see where they end up, if they do appear in campaign 3. Given hints about Jester traveling to the Feywild with the Traveler, she’d be an interesting character to meet there – while Kingsley Tealeaf’s journey to join the Revelry is a perfect opportunity to make him a future Plank King, if the campaign 3 cast end up in Darktow somehow.",
    "However, we heard relatively little about Vox Machina in the second campaign, other than some indirect mentions or family member NPCs – and, at the very end, confirmation that Laura Bailey's Vex ends up as Coinmistress of the Tal’Dorei council – and we get the sense Mercer prefers to give the limelight fully to the new cast of characters in each campaign."
  ],
  "headers": {
    "3": "How to watch Critical Role campaign 3",
    "7": "When will Critical Role campaign 3 be set?",
    "12": "Will Talks Machina return?",
    "14": "What will happen to the Mighty Nein in campaign 3?"
  },
  "links": {
    "D&D podcast": "https://www.techradar.com/news/best-dandd-podcasts-and-web-series-from-critical-role-to-high-rollers",
    "Twitch": "https://www.twitch.tv/criticalrole",
    "YouTube": "https://www.youtube.com/youtube.com/criticalrole",
    "Cinemark's website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8237542420769861000&xs=1&url=https%3A%2F%2Fwww.cinemark.com%2Fmovies%2Fcritical-role&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcritical-role-campaign-3"
  }
}