{
  "source": "https://www.techradar.com/news/moto-g-stylus-2021-renders-offer-an-early-look-at-the-phones-design",
  "title": "Moto G Stylus 2021 renders offer an early look at the phone's design",
  "category": "phones",
  "updated": "2021-01-03T12:06:18Z",
  "author": "david-nield",
  "summary": "And a few specs too",
  "article": [
    "The Moto G Stylus (also known as the Moto G Pro outside the US) offers a budget option to the Galaxy Note series for those who want a stylus with their smartphone – and it looks very much like an updated version of the handset is on the way for 2021.",
    "The Moto G Stylus 2021, as we'll call it, has been revealed in some unofficial renders put together by well-known tipster @OnLeaks, based on inside information about the design and dimensions of the upcoming smartphone.",
    "Apparently the new Moto G Stylus 2021 will boast a flat 6.8-inch display, and come with dimensions of 169.6 mm x 73.7 mm x 8.8 mm (that's 6.7 inches x 2.9 inches x 0.35 inches), with the camera bump adding a couple of extra millimeters.",
    "That means the 2021 version of the phone is set to be even bigger than the 2020 edition, if these leaks are to be believed. It's also set to be taller, with a larger screen, than the Samsung Galaxy Note 20 handset that was unveiled back in August.",
    "The back of the phone is getting a redesign, with a square quad-camera array that follows the lead of the recent Moto G9 Power. According to @OnLeaks, we'll have a 48MP wide camera, an 8MP ultrawide camera, a 5MP macro camera, and a 2MP depth camera.",
    "As well as the stylus that defines the device, it sounds as though we're also going to get a headphone jack on the Moto G Stylus 2021 – something that was also included on the previous edition of the device, and means older wired headphones can still be used.",
    "These specs mostly match up with rumors posted online back in November by another well-respected tipster. The internal specs of the phone are said to be a Snapdragon 675 processor paired with 4GB of RAM and 128GB of internal storage, which wouldn't be a huge jump forward from what we saw in 2020.",
    "And when are you going to be able to get your hands on this affordable, stylus-equipped slab of a smartphone? Considering the original Moto G Stylus / Moto G Pro arrived in February 2020, it seems like a good bet that the new one will launch in February 2021.",
    "Via Android Police"
  ],
  "headers": {
    "4": "Cameras and specs"
  },
  "links": {
    "Moto G Stylus": "https://www.techradar.com/reviews/moto-g-pro-review",
    "@OnLeaks": "https://www.voice.com/post/@onleaks/exclusive-first-look-at-the-motorola-moto-g-stylus-2021-1609594463-49911903",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Moto G9 Power": "https://www.techradar.com/news/moto-g9-power-has-a-bigger-battery-than-any-other-smartphone-youd-buy",
    "back in November": "https://www.techradar.com/news/the-moto-g-stylus-2021-is-tipped-to-be-a-minor-upgrade",
    "arrived in February 2020": "https://www.techradar.com/reviews/moto-g-pro-review",
    "Android Police": "https://www.androidpolice.com/2021/01/02/moto-g-stylus-sequel-appears-in-new-renders-with-supersized-design/"
  }
}