{
  "source": "https://www.techradar.com/news/intel-claims-its-not-scared-of-nvidias-new-grace-processor",
  "title": "Intel claims it’s not scared of Nvidia’s new Grace processor",
  "category": "computing",
  "updated": "2021-04-14T11:15:04Z",
  "author": "rhys-wood",
  "summary": "The gloves are coming off",
  "article": [
    "In the wake of Nvidia announcing its Grace CPU, its first processor aimed at improving AI functionality for servers, Intel CEO Pat Gelsinger has claimed that his company remains unfazed, and insists that Intel will remain the CPU market leader going forward.",
    "Intel’s recent Ice Lake processors are similarly designed to enhance AI functionality for data centers and servers, meaning Nvidia is - unavoidably - competing with the CPU giant.",
    "Gelsinger commented on Nvidia entering the ARM CPU market in a response to Yahoo Finance, saying: “It's not us responding to them. Clearly this idea of CPUs that are A.I.-enhanced is the domain where Intel is a dramatic leader. [...] So clearly, I'd say the idea of CPUs is Intel's provenance. We're now building A.I. into that and we expect this to be an area where we are on the offense, not the defense going forward.”",
    "Gelsinger isn’t wrong when he says CPUs are Intel’s bread and butter. The tech giant’s market share is astronomical, holding over 80% of desktop CPU share and over 90% in server CPU share. However, those numbers continue to fluctuate as Intel’s closest competitor, AMD, continues to nip at its heels with its Ryzen desktop CPUs and Epyc server processors.",
    "Nvidia throwing its hat into the ring with its Grace server CPUs could make for welcome competition in the field, with both Intel and AMD now having another major competitor to prove themselves against.",
    "Nvidia has already made strides by attracting two supercomputer customers, those being the Swiss National Supercomputing Centre and Los Alamos National Laboratory. Both supercomputers are set to debut in 2023 powered by Nvidia Grace technology.",
    "Intel itself is set to provide chips for the Aurora supercomputer sponsored by the US Department of Energy. Aurora had just missed out on the achievement of being the US’ first exascale supercomputer due to a delay, with that accolade now expected to go to Frontier, powered by AMD Epyc CPUs."
  ],
  "headers": {
    "3": "Intel vs Nvidia"
  },
  "links": {
    "market share is astronomical": "https://hexus.net/business/news/components/147376-mercury-research-sees-resurgent-intel-cpu-market-share/",
    "two supercomputer customers": "https://www.anandtech.com/show/16610/nvidia-unveils-grace-a-highperformance-arm-server-cpu-for-use-in-ai-systems"
  }
}