{
  "source": "https://www.techradar.com/news/ajit-pai-issues-china-warning-as-he-leaves-fcc",
  "title": "Ajit Pai issues China warning as he leaves FCC",
  "category": "computing",
  "updated": "2021-01-21T12:31:05Z",
  "author": "steve-mccaskill",
  "summary": "Pai had held FCC top job since 2017",
  "article": [
    "Ajit Pai, the former chairman of the US Federal Communications Commission (FCC), has warned that China and potential threats to the integrity and security of American telecommunications networks are the biggest challenges facing the industry over the next four years.",
    "Speaking to Reuters, Pai said there was a “wide array” of Chinese activity that was cause for concern for regulators, such as potential surveillance programmes and the injection of malware into network infrastructure.",
    "“The Chinese Communist Party has a very determined world view. They want to dominate this space and exert their will -- even beyond their own borders,” Pai said. “That is a serious threat not just to internet freedom but to national security for us and for many of our allies.”",
    "His comments were one of Pai's last acts as Chairman. Like many other government institutions in the US, commissioners are nominated and appointed on party lines and Pai was the choice of former President Donald Trump back in 2017.",
    "Pai quickly garnered controversy for his opposition to net neutrality despite his protestations that his approach to broadband was “practical not ideological.”",
    "His tenure has also seen the FCC take a strong stance on China. Huawei and ZTE have been designated threats to national security, while government funding has been issued to help smaller, rural carriers remove equipment from the two companies. The FCC has also announced its intention to take action against China’s three main state-owned telcos.",
    "A month after Trump was defeated in the 2020 US Presidential Election, Pai announced that he would step down on 20 January 2021 – the same day as President Joe Biden’s inauguration.",
    "The balance of the FCC is set to tip towards the Democrats, with Pai’s departure leaving an even split among the four remaining commissioners’ political persuasions. It is expected that President Biden will appoint a member from his own party and will also name a new Chairman.",
    "Via Reuters"
  ],
  "headers": {
    "3": "US FCC"
  },
  "links": {
    "Huawei and ZTE": "https://www.techradar.com/news/huawei-ban",
    "Reuters": "https://www.reuters.com/article/us-usa-china-fcc-idUSKBN29P2TS"
  }
}