{
  "source": "https://www.techradar.com/news/oscars-2021-winners-the-full-list-from-nomadland-to-mank",
  "title": "Oscars 2021 winners: the full list, from Nomadland to Mank",
  "category": "entertainment",
  "updated": "2021-04-26T08:34:02Z",
  "author": "tom-power",
  "summary": "Why wasn't Sir Anthony Hopkins in attendance?",
  "article": [
    "The 2021 Oscars winners have been announced and, perhaps unsurprisingly, Nomadland was the big winner on the night with three Academy Awards attained.",
    "Chloe Zhao's drama film scooped awards in the Best Film, Best Director (Zhao) and Best Actress (Frances McDormand), and there were dual wins for a number of other movies during Sunday's Los Angeles-based ceremony.",
    "Judas and the Black Messiah, Mank, Sound of Metal, Ma Rainey's Black Bottom, Soul, and The Father all snapped up two gongs apiece, and it was the last of those flicks that – like the BAFTAs before it – threw up the evening's biggest surprise winner.",
    "Sir Anthony Hopkins, who wasn't even present at the ceremony in Downtown L.A's Union Station, saw off competition from Steven Yeun and the late Chadwick Boseman to secure the Oscar for Best Actor. The 82-year-old, who now sports two Academy Awards to his name, landed the prize for his portrayal of a father suffering dementia in the Lionsgate-distributed drama.",
    "Glenn Close's Oscars drought continued after Sunday's ceremony, too. The Hillbilly Elegy star has been nominated for eight Academy Awards throughout her career, but once again lost out. Minari's Youn Yuh-Jung beat her to the Best Actress in a Supporting Role award.",
    "Check out the full list of winners below:"
  ],
  "headers": {
    "6": "Makeup and Hairstyling"
  },
  "links": {
    "Nomadland": "https://www.techradar.com/news/how-to-watch-nomadland-online-stream-the-new-frances-mcdormand-movie-on-hulu-today",
    "Judas and the Black Messiah": "https://www.techradar.com/news/how-to-watch-judas-and-the-black-messiah-online-stream-the-new-movie-on-hbo-max-now",
    "Sound of Metal": "https://www.techradar.com/news/how-to-watch-sound-of-metal-online-stream-the-award-winning-movie-from-anywhere",
    "Soul": "https://www.techradar.com/news/how-to-watch-soul-online-stream-the-new-pixar-movie-on-disney-plus-today"
  }
}