{
  "source": "https://www.techradar.com/news/fitbit-down-app-outage-affecting-users-worldwide",
  "title": "Fitbit down: services are back online, and fitness data is syncing as normal",
  "category": "fitness",
  "updated": "2021-03-08T09:35:14Z",
  "author": "cat-ellis",
  "summary": "Fitbit outage caused frustration for many hours",
  "article": [
    "Update: Fitbit's servers now appear to be completely back to normal, and according to DownDetector, user reports suggest that there are currently no problems with the company's services. Original story follows.",
    "If your Fitbit won't sync correctly, you're not alone. The company's servers experienced a fault on March 3 that meant users around the world were unable to sync their sleep and fitness data with the app. Fitbit says the problem is now fixed, but there are some 'hiccups' that are causing issues.",
    "Over 24 hours since the problem first arose, some people are reporting that the app isn't syncing information like calories burned, while others have found that their data isn't being sent to third-party services including Strava and WeightWatchers.",
    "If you're still having trouble, the company advises contacting its customer support department at help.fitbit.com.",
    "According to DownDetector, Fitbit users started reporting problems on March 3 at about 12pm GMT (7am EST), when the app began failing to connect to the company's servers.",
    "Many users found that although the app interface loaded, modules fail to appear and data isn't synced from their devices. Widgets for step count, calories, Active Zone Minutes and floors climbed all remain blank.",
    "Others were unable to log in at all. Instead, they received an error message 'Fitbit.com is unavailable. Please try again later'.",
    "Without the app, it was impossible to review sleep scores, activity trends and SpO2 readings. Fitbit Premium users will be unable to access their catalog of workouts, including the new meditation sessions from Deepak Chopra added last week.",
    "Fitbit acknowledged the outage on its Twitter account, and about six hours after the problem began, it posted an update confirming that the issue had been resolved.",
    "\"A software issue was causing some issues for the Fitbit app yesterday,\" the company told TechRadar. \"Service has now returned to normal. Any users still experiencing issues should contact Customer Support at help.fitbit.com\"",
    "For some Fitbit users, however, the problems appear to be ongoing, with many people reporting that although they can now log into the app, they are still unable to sync data from their devices. Others claim that stats only synchronize with the app when they restart their device.",
    "If you're having trouble, the company advises contacting its customer support department. You can also contact Fitbit Support on Twitter, and a customer service rep should get in touch with you via DM.",
    "If the Fitbit app is refusing to sync with third-party services like Strava, you can try revoking access through the Fitbit dashboard, then re-integrating your accounts."
  ],
  "headers": {
    "4": "Fitbit outage: what happened",
    "10": "Ongoing issues"
  },
  "links": {
    "help.fitbit.com": "https://urldefense.com/v3/__http:/help.fitbit.com__;!!HhhKMSGjjQV-!uNqnfCsZRSvlg194Wl9ZdzfeyX3nJdn-emWS7EMRMb9Ue7PJBxptzt87X8H63Q2N9PdWWw%24",
    "DownDetector": "https://downdetector.co.uk/status/fitbit/",
    "added last week": "https://www.techradar.com/news/fitbit-launches-new-stress-busting-meditation-tools",
    "contacting its customer support department": "http://help.fitbit.com__;!!HhhKMSGjjQV-!uNqnfCsZRSvlg194Wl9ZdzfeyX3nJdn-emWS7EMRMb9Ue7PJBxptzt87X8H63Q2N9PdWWw%24",
    "contact Fitbit Support on Twitter": "https://twitter.com/FitbitSupport",
    "through the Fitbit dashboard": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2228133439731457800/https://www.fitbit.com/settings/applications",
    "re-integrating your accounts": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1183719701790765800/https://help.fitbit.com/articles/en_US/Help_article/1742.htm"
  }
}