{
  "source": "https://www.techradar.com/news/amd-cpu-stock-rumor-is-bad-news-for-would-be-ryzen-5950x-and-5900x-buyers",
  "title": "AMD CPU stock rumor is bad news for would-be Ryzen 5950X and 5900X buyers",
  "category": "computing",
  "updated": "2021-01-25T09:58:51Z",
  "author": "darren-allan",
  "summary": "But there’s better news elsewhere, as 5800X and 5600X availability should improve",
  "article": [
    "AMD’s new Ryzen 5000 processors have been hit by some frustrating stock issues since launch, and rumor has it that this will continue to be the case for the higher-end CPUs – although there’s more positive news for the rest of the range.",
    "Wccftech claims that its sources have provided word on AMD’s CPU allocation in the near-term – the initial quarter of 2021 – but obviously take this with a sizeable helping of condiments, as ever with news from the grapevine.",
    "And as mentioned, the news isn’t good, at least when it comes to the more expensive Ryzen 5950X and 5900X, because supply levels of these chips will remain ‘very low’.",
    "That sounds ominous, but it’s nothing new though: since the new Zen 3-powered range was launched, folks have been struggling to buy both of these CPUs, and we’ve heard tales of stock shortages from retailers.",
    "Indeed, you only need to look at major online retailers right now to see that these models are vanishingly thin on the ground, and if you can find one somewhere, it’ll inevitably be for sale on an auction site or by a third-party marketplace seller for a massively inflated margin (which is, of course, very much part of the problem – for these chips, and both AMD’s and Nvidia’s new graphics cards).",
    "Sadly, it seems that this picture may not change for those hunting for a Ryzen 5950X or 5900X, but there’s better news from the rumor mill if you want one of the models further down the range from these.",
    "The Ryzen 5800X and 5600X are supposedly going to be available in a ‘decent’ quantity, again continuing the theme we’ve seen since 2021 began, with stock levels of the CPUs appearing to improve.",
    "According to the unspecified sources, there will be similarly robust stock of the last-gen Ryzen 3600, for those who might prefer to get a cheaper model, rather than going for the cutting-edge chips. And the Ryzen 3900X, 3700X and 3600X will also be available in ‘some quantity’, so there should be no struggle to buy these either, with AMD seemingly making an effort to keep these models going so people have options if they can’t get a Ryzen 5000 processor (or if they find price premiums off-putting).",
    "The Ryzen 3800X will remain available, too, but with ‘very low’ stock quantities, and the same is true of the 3300X and 3100 – so it could be a struggle to grab these chips for those hunting among the previous-gen range.",
    "If you’re gunning for a Ryzen 5000 chip, remember that we have some guides which keep an eye on current stock levels, doing the hard work for you in that respect. Check out our articles on where to buy an AMD Ryzen 5 5600X, along with the AMD Ryzen 7 5800X and AMD Ryzen 9 5900X and 5950X."
  ],
  "headers": {
    "6": "Improving inventory"
  },
  "links": {
    "AMD’s new Ryzen 5000 processors": "https://www.techradar.com/news/amd-ryzen-5000",
    "Wccftech": "https://wccftech.com/amd-ryzen-cpu-availability-allocation-q1-2021/",
    "AMD’s CPU": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "we’ve heard tales of stock shortages from retailers": "https://www.techradar.com/news/amd-cpu-sales-get-even-stronger-as-ryzen-5000-stock-issues-ease",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "stock levels of the CPUs appearing to improve": "https://www.techradar.com/news/amd-cpu-sales-get-even-stronger-as-ryzen-5000-stock-issues-ease",
    "where to buy an AMD Ryzen 5 5600X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-5-5600x-find-stock-here",
    "AMD Ryzen 7 5800X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-7-5800x-find-stock-here",
    "AMD Ryzen 9 5900X and 5950X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-9-5900x-and-5950x-find-stock-here"
  }
}