{
  "source": "https://www.techradar.com/news/the-new-roku-streaming-stick-4k-is-an-affordable-dolby-vision-dream",
  "title": "4K Dolby Vision comes to the cheapest Roku streaming stick so far",
  "category": "televisions",
  "updated": "2021-09-20T13:00:36Z",
  "author": "henry-st-leger",
  "summary": "Dolby Vision comes to another Roku streaming device",
  "article": [
    "There's a new Roku in town. The streaming stick manufacturer has just unveiled the Roku Streaming Stick 4K – a mid-price streamer that packs in 4K resolution, HDR, and even Dolby Vision for the reasonable price of $49.99 / £49.99.",
    "Available in October in both the US and UK, this ramped-up dongle is an upgrade of the Roku Streaming Stick+ that released in 2019. It's due an upgrade, then, and boasts \"30% faster streaming\" thanks to improved hardware and \"2x faster Wi-Fi speed\" through its long-range wireless receiver.",
    "You'll also get the usual suite of Alexa and Google Assistant compatibility, AirPlay 2 and Apple HomeKit, as well as a practical remote and discreet, 'clutter-free' dongle solution – as well as the egalitarian Roku platform, which uses a tile menu system to easily manage and arrange your favorite streaming apps.",
    "The launch will coincide with a Roku OS 10.5 system update that reportedly improves the quality of voice search through the Roku voice remote, and the Roku mobile app interface.",
    "By far the most significant part of this update, though, is the addition of Dolby Vision – a feature previously only available on the company’s most expensive offering, the 4K HDR Roku Ultra – as well as HDR10+.",
    "Roku has long been one of the best smart TV platforms out there, and the ease of its interface and affordability of its cheapest streaming devices has made it exceedingly simple to get Roku loaded up on a home television.",
    "Anyone with an older TV screen, or a cheap set with an awkward interface, would do well to get a Roku facelift for their display – though things get a little trickier when the Roku device in question can't match up with a TV's capabilities.",
    "These dynamic HDR formats – which offer scene-by-scene metadata that helps to calibrate picture settings on your TV – are increasingly found on even mid-priced televisions. But if your TV screen supports Dolby Vision or HDR10+, but your Roku Express doesn't, then you can't make the most of the content streaming through that specific dongle.",
    "Previously, Dolby Vision was only available on high-end TVs (and similarly high-end streaming sticks), so this wasn't much of a problem. Now, though, even mid-tier Hisense TVs can pack in Dolby Vision, while the brilliantly-priced Panasonic JX800 series (like last year's HX800), and streaming devices are having to catch up with the willingness of TV makers to support the format on cheaper screens.",
    "That's great news for anyone who wants a streaming stick, but has a budget that caps out at $50 / £50 – with the Roku Streaming Stick 4K offering a meaningful upgrade, at least for those with a Dolby Vision-ready TV.",
    "These dynamic HDR formats will only get more standardised over time. Indeed, Roku may have leaked their own plans to bring Dolby Vision to the Roku Premiere range earlier this year. So if you're upgrading your streamer, or your TV, Roku's new entry is certainly worth checking out."
  ],
  "headers": {
    "5": "Analysis: Is Dolby Vision no longer only a premium format?"
  },
  "links": {
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Roku Ultra": "https://www.techradar.com/reviews/roku-ultra-2020",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "best smart TV": "https://www.techradar.com/news/best-tv",
    "streaming devices": "https://www.techradar.com/best/streaming-device",
    "HX800": "https://www.techradar.com/reviews/panasonic-hx800-tv",
    "leaked their own plans": "https://www.techradar.com/news/after-the-roku-express-4k-is-a-big-dolby-vision-upgrade-coming"
  }
}