{
  "source": "https://www.techradar.com/news/new-qualcomm-snapdragon-7c-could-be-apple-m1-for-windows-10",
  "title": "New Qualcomm Snapdragon 7c could be Apple M1 for Windows 10",
  "category": "computing",
  "updated": "2021-05-24T15:00:27Z",
  "author": "darren-allan",
  "summary": "Snapdragon 7c Gen 2 promises to pep up Windows 10 on ARM performance",
  "article": [
    "Qualcomm has announced its Snapdragon 7c Gen 2 chip which, as the name makes plain enough, is a refresh of the Snapdragon 7c (from last year), and aims to seriously pep up affordable ‘always connected’ Windows 10 on ARM laptops (and indeed Chromebooks).",
    "The idea, as ever with these portables, which use Qualcomm Snapdragon chips (more commonly found in mobiles) is to provide LTE connectivity on the go, instant-on functionality like a phone, and copious amounts of battery life.",
    "This Snapdragon 7c sequel pushes things further, and could be a much-needed shot in the ARM (ahem) for Windows 10 devices, aiming to help them follow in the footsteps of the fresh competition from Apple. Of course, Apple has the very well-received M1 (ARM-based) silicon it’s now using to power some of its MacBooks (and more in the future).",
    "So, with the launch of Snapdragon 7c Gen 2, what exactly is Qualcomm offering up for us? An octa-core SoC clocked at up to 2.55GHz which promises to provide 10% better system performance “than competitive platforms”, Qualcomm boasts. And it does this while delivering a battery life of 19+ hours of continuous use, with internet connectivity delivered by a Snapdragon X15 4G LTE modem.",
    "A bunch of additional features are bundled in with all this, including an AI engine to speed up certain tasks, such as security functions and voice recognition. Plus there’s a Qualcomm Spectra image signal processor (to improve picture quality) and audio enhancement tech to deliver more when using your camera for video chatting, or simply when watching videos.",
    "Qualcomm notes: “With virtual surround sound, and echo cancellation and noise suppression, the [Snapdragon 7c Gen 2] platform enhances remote productivity and entertainment experiences.”",
    "In a world still revolving around working from home for many, complete with lengthy videoconferences, these new image and audio processing chops will be very welcome.",
    "Enterprise-grade security features are also built into Qualcomm’s new platform, with a secure boot process and of course that LTE connectivity meaning better, easier management for admins in terms of remotely keeping devices up-to-date.",
    "Qualcomm says that the first laptop to use Snapdragon 7c Gen 2 should be out at some point in the next few months. As this builds on the entry-level Snapdragon 7c platform, that notebook – and hopefully more which will follow soon enough – should land on the affordable side of the laptop spectrum.",
    "That more tempting price proposition, combined with the obvious battery life and always-connected internet benefits, plus the additional performance on offer, should help Windows 10 on ARM machines take a considerable – and let’s face it, much-needed – stride forward.",
    "How well these new 7c Gen 2-powered machines actually perform is something we’ll only know when we actually get one in for testing."
  ],
  "headers": {
    "7": "Safe and secure"
  },
  "links": {
    "Snapdragon 7c": "https://www.techradar.com/news/acer-just-announced-a-gaming-capable-laptop-that-can-last-nearly-18-hours",
    "Windows 10 on ARM laptops": "https://www.techradar.com/news/a-closer-look-at-windows-10-s-windows-10-on-arm-and-windows-10-iot",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "M1 (ARM-based) silicon": "https://www.techradar.com/news/apple-m1-chip",
    "MacBooks": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "more in the future": "https://www.techradar.com/news/rumored-macbook-pros-could-use-m1x-chip-this-year-with-m2-coming-in-2022"
  }
}