{
  "source": "https://www.techradar.com/news/microsoft-wants-the-us-to-adopt-australias-controversial-media-code",
  "title": "Microsoft wants the US to adopt Australia's controversial media code",
  "category": "computing",
  "updated": "2021-02-12T05:51:16Z",
  "author": "jasmine-gearie",
  "summary": "Claims it's necessary to 'strengthen democracy'",
  "article": [
    "Across the globe, people generally seem to agree that companies like Google and Facebook have vastly disrupted the way news organizations and news dissemination works, but governments have been slow to respond.",
    "The Australian government is one of the first to directly take on the tech giants, and its solution has been to draft legislation which it claims will help level the playing field by requiring the big tech players to compensate news media for the use of their content.",
    "In response, Google has recently made vague statements that it may have to remove its search engine from Australia, however Microsoft has taken a different tack, publicly throwing its support behind the Australian government’s draft laws – and it now wants the US to consider something similar.",
    "In an extensive blog post, President of Microsoft Brad Smith wrote that Australia’s proposed media bargaining code, “strengthens democracy by requiring tech companies to support a free press”.",
    "Rather than rejecting such a proposal in the United States, Smith said the US government, “should copy it instead”.",
    "Much of the debate around the Australian media code so far has focused on the financials – who has the final say in pay negotiations, and if paying news publishers for links fundamentally undermines how search engines (and the web in general) are supposed to work.",
    "But Microsoft also wants governments to consider how “tech gatekeepers” such as Facebook and Google are influencing democracy, both positively and negatively.",
    "Smith points to the internet and social media becoming powerful tools for the spreading of misinformation. The most remarkable example, he says, is, “not that Americans disagreed in 2020 about who to elect as president; it’s the fact that, after the election, so many disagreed about who had actually won”.",
    "Smith later writes that Australia’s proposed legislation can help address this issue by looking at, “the competitive imbalance between the tech sector and an independent press”.",
    "Microsoft is not currently subject to the proposed legislation in Australia because its own search engine, Bing, has a less than 5% market share in the country.",
    "But in his statement, Smith said that, “if we can grow, we are prepared to sign up for the new law’s obligations, including sharing revenue as proposed with news organizations”.",
    "He also made it clear that Microsoft was willing to invest in its Bing service, and would accept doing so at, “lower economic margins than Google and with more economic returns for the press”.",
    "At any rate, we’ll soon find out if Bing will replace Google Search in Australia. The country’s parliament is set to begin debate on the media code next week, beginning February 15."
  ],
  "headers": {
    "9": "Could Bing replace Google?"
  },
  "links": {
    "Microsoft has taken a different tack, publicly throwing its support": "https://www.techradar.com/news/microsoft-sides-with-australian-gov-in-digital-news-fight-suggests-bing-to-replace-google",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1421282928620938800&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fon-the-issues%2F2021%2F02%2F11%2Fendorsement-australias-proposal-technology-news%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-wants-the-us-to-adopt-australias-controversial-media-code"
  }
}