{
  "source": "https://www.techradar.com/news/ipad-pro-m1-what-app-developers-can-do-with-apples-new-chipset",
  "title": "iPad Pro M1: what app developers can do with Apple’s new chipset",
  "category": "tablets",
  "updated": "2021-05-28T22:29:42Z",
  "author": "david-lumb",
  "summary": "The iPad Pro 2021's new M1 chipset promises much for app developers",
  "article": [
    "The iPad Pro 2021 augments the already niche-dominating iPad Pro 2020 in several ways, including expanding the RAM up to 16GB and the storage up to 2TB, both likely attractive to the tablet power users who had favored the top-tier devices. But implementing the M1 chipset – quite literally the same silicon powering the latest MacBook Pro, Mac Mini, and iMac models – could dramatically expand what the newest iPad Pros are capable of.",
    "We haven’t heard anything official about what the silicon can do for first-party apps, let alone any changes coming to iPadOS. But we have talked to third-party developers of big apps to discuss what doors the M1 chipset opens up for them – and by extension, how they’ll take the iPad Pro 2021 beyond the capabilities of its predecessors.",
    "Plugging a desktop chipset into a tablet raises big questions: how much does that bring software built for the latter closer to parity with the former? How many more features can you include? What can users do that they couldn’t before?",
    "As expected, app developers are still limited by tablet interfaces and operating systems, but those seem like the only obstacles – the desktop computer silicon and bumped-up specs may have quietly eliminated the performance limitations that have kept iPad Pro apps from being abbreviated versions of their desktop counterparts.",
    "Read on for what app developers predict they’ll be able to do thanks to the Apple-built M1.",
    "It’s no secret that Adobe has a close relationship with Apple. Product launch events often name-check the former’s apps and software, teasing how much more capable new devices and computers are at handling Adobe’s performance-hungry suite of creative and editing programs.",
    "Naturally, Adobe is excited about what the M1 chipset has to offer the tablet versions of its software. To put it simply: they’re approaching parity with the desktop versions and reaching a ceiling of what iPadOS and the touch interface can allow.",
    "“Let’s use Lightroom as an example: Lightroom on the iPad is capable of doing about 95%-plus of the things you could do on a desktop,” Adobe Director of Product Management Bryan O’Neil Hughes told TechRadar in a video interview. “What it really differs in is the form factor fits in your camera bag.”",
    "Adobe has been making mobile apps on Apple’s devices for a decade, which ramped up with the release of the first iPad Pro in 2015 – a higher-performance tablet capable of enhanced on-the-go media editing using Adobe’s suite, which has come to define a segment of the tablet’s userbase. But the M1-powered iPad Pro 2021 is just as much of a seismic shift according to Hughes.",
    "“Faster input is going to mean that your files from Lightroom or going into Photoshop, they’re going to transfer faster, to move into the device faster,” Hughes said. Given his background in photography, moving images around is one of the pitfalls of working on multiple platforms. Or, as he puts it: “Being able to move my images into an iPad, that’s awesome. Having to think about moving my images out of an iPad, that’s not so awesome.”",
    "The new iPad Pro’s higher specs ceiling helps here, too, with a 2TB storage cap (available for a pricey upgrade) simply reducing the need to move media around so much. But importing or exporting or uploading media to the cloud while on the go is faster with the iPad Pro’s 5G connectivity (when you can get a signal). The Super Retina XDR display packed with miniLEDs, only available on the 12.9-inch model, is obviously great for visual creatives and project editing with its broader color and brightness range.",
    "But the M1 chip is the cornerstone. Adobe software was showcased during Apple’s Spring Forward event in April, showcasing the chipset’s effect in making the company’s editing tools faster at every step.",
    "“The software is just getting out of the way, and I think the last piece of that is the Apple neural engine which of course is unique to the M1 chipset, and we’re starting to really leverage that to do local machine learning operations like ‘select subject’ in Photoshop which historically was a very manual operation.”",
    "The machine learning on the M1 also refines selections, masking, and compositing – what Photoshop classically does better than other software, per Hughes – with a fidelity that rivals what can be done on the desktop Photoshop thanks to the new Apple silicon. Unlike on older iPad Pros, using Photoshop on the new tablets removes layer limits and dramatically speeds up operations; and in an unprecedented improvement on the desktop version, the iPad Pro 2021 Photoshop doesn’t have modal dialogues – you’re always live.",
    "The biggest issue restraining Adobe apps is that iPadOS’ memory access permissions are more restrictive than on desktop, meaning while the iPad Pro 2021 can rival PCs with up to 16GB of RAM, tablet apps can’t use the RAM as effectively. Adobe is continually advocating to pry away more RAM for foreground and background operations – currently their software can ‘soak up’ 3.5 to 5GB of RAM, Hughes said, but unlike desktop computing, apps aren’t allowed nearly as much ‘background’ processing.",
    "The built-in advantages over desktop software, of course, are that the iPad Pro is portable and gives access to the Apple Pencil and other peripherals, and empowering it with the M1 chipset brings the tablet apps more up to par. This isn’t to say Adobe is done finding new ways to harness the new M1-powered iPad Pro 2021 – the company is working on bringing more native support for the 12.9-inch Super Retina XDR display, for instance, and there are updates planned that bring another M1-specific feature to the tablet and more for drawing and painting app Fresco.",
    "“Here’s the goal: for [the apps] to be so fast and so fluid that the software gets out of the way so if you watch a creative that’s really in their flow, they’re not getting mired in progress bars and spinning beach balls and all that stuff,” Hughes said. “They’re just moving. In the benchmark data, these machines and these chips are so fast that things that we use to have to wait for we’re just not waiting or them anymore.”",
    "Recently, Larian – makers of Baldur’s Gate 3, which is still in early access – launched an iPad Pro version of its award-winning game, Divinity: Original Sin 2. The game isn’t an abridged port – all of its 100-hour story, gameplay, lauded writing, and mechanics made the jump to the tablet version thanks to years of development.",
    "Larian only learned about the M1 chip-packing iPad Pro 2021 models weeks before the new tablets launched in April (the studio was building the game for the iPad Pro 2018 and 2020), according to Director of Publishing Michael Douse, but they were able to ramp up the existing game’s 30fps running speed to a smooth 60fps. That’s the only benefit to playing the game on the new tablet, but the future is promising now that the studio can build games for Mac and iPad Pro with essentially the same hardware.",
    "“We now know that there is a mobile chip that matches our ambitions,” Douse told TechRadar over the phone. “We can take these 100-hour RPGs on the go without having to nerf textures or shadows; we literally didn’t have to nerf anything at all.”",
    "Larian has converted their four-year-old game to a tablet version with all content intact and visuals that are nearly on par with the desktop version’s maximum graphics settings. Divinity: Original Sin 2 on iPad Pro is a feat – Douse doesn’t think any other game of its length or visual complexity has made it to tablets – and with the M1 chipset, he believes the tablet can push pixels to get graphics and performance somewhere between last-gen (Xbox One, PS4) and latest-gen (Xbox Series X, PS5) consoles.",
    "The question, then, isn’t whether Larian can bring its games to the iPad Pro, but if consumers will make it worth their while. Douse admits this is an experiment: “Do players want this experience? Because generally these things are driven by player demand. It’s not ‘if you build it they will come,’ but more ‘if you build it will they come?”",
    "Sales and player demand will determine whether Baldur’s Gate 3 comes to iPad Pro in the same way, but a lot of the hard work transferring the game’s engine and understanding the tablet’s GPU-harnessing Metal architecture was done in developing Divinity: Original Sin 2’s iPad version. Larian worked with Saint Petersburg-based studio Elverils, which built the MacBook version of Baldur’s Gate 3, to transition Divinity: Original Sin 2 to iPad Pro, and received guidance from Apple engineers as well, so it has all the pieces in place to release another console quality-level tablet game.",
    "Part of the work is simply convincing gamers that the iPad Pro versions are on parity with their console and desktop counterparts, which takes fighting the prevailing narrative that games are ported to mobile in often compromised state at the end of their lifespans to eke out more sales. While we found the iPad Pro version of Divinity: Original Sin 2’s touch interface to be serviceable but cumbersome (controller and mouse + keyboard alternatives bypass this entirely), the game itself is perfectly preserved from the original desktop version.",
    "To Douse, this opens the door to a new gaming experience that hasn’t been possible before the M1 chipset – and it’s more exciting than streaming a top-tier gaming experience through your tablet, say.",
    "“I think that ARM technology [like in the M1 chipset] is far more exciting than cloud technology right now,” Douse said. “Because if I can take an offline experience that looks like a PS4 game on a plane, on a device that has a 20-hour battery with a sharp HDR 1000-nit brightness screen, that’s a lot better to me than being tied down to something else offline. It’s really interesting watching this technology grow and how it kind of shapes the way not only what games people play, but what games they demand on these devices.”",
    "How many consumers will actually benefit from the M1 chipset is another question. The iPad Pro line has been traditionally pricey – as expensive as some mid-range laptops – and the same is true with the 2021 model. The 11-inch model starts at $799 / £749 / AU$1,199 for 8GB of RAM and 128GB of storage, the most affordable model. The 12.9-inch version starts at $1,099 / £999 / AU$1,649 for 8GB of RAM and 128GB of storage, while at its absolute highest spec (16GB of RAM and 2TB storage), the tablet costs $2,199 / £1,999 / AU$3,299 (or higher with the cellular version) – as much as a speedy gaming laptop or a reasonably kitted-out desktop computer.",
    "Granted, even the lowest-priced iPad Pro 2021 configuration packs an M1 chipset, meaning consumers picking up any of this year’s top-tier tablets will get to experience how developers are retooling their apps to harness Apple’s new silicon. Given how much pricier all of these slates are than the still-powerful iPad Air 2020 or basic iPads, these will still be the tools of specialist creators, and developers will have to weigh their efforts against the minimal population of M1-powered iPad Pro units in the wild – which is effectively starting from zero.",
    "That population will ramp up over the years, and while iPads are reportedly impacted by persisting chip shortages across the hardware industry, one in ten iPads shipped this year will be an M1-series iPad Pro, predicts analyst firm Counterpoint Research. By next year, that rate is expected to improve to one in five.",
    "To appeal to the new iPad Pro buyers – a mix of creatives using Adobe (and Adobe-like) apps, media editors on the go needing powerful portable equipment, and executives giving presentations with its 5G capabilities – app developers will likely focus on harnessing the M1 chipset’s expanded artificial intelligence capabilities, Counterpoint Research Associate Director Brady Wang told TechRadar over email.",
    "“In addition, developers will be more interested in building and creating apps that work with both iPadOS and MacOS,” Wang said. “This is not a lot of extra effort for developers, but it will profit from increasing sales of the New Mac.”",
    "Ultimately, there’s a lot that the M1 chipsets promise, and given the lack of notice given to app developers about its existence – Larian was told about the chipset around two weeks before it was publicly unveiled in late April, according to Douse – it might take awhile for app developers to intuit ways in which the silicon can empower their apps. We’re most looking forward to WWDC 2021, when Apple may lift the curtain on what’s possible with the iPad Pro 2021 in its keynote on June 7 and developer sessions thereafter."
  ],
  "headers": {
    "5": "Adobe: a whole suite to improve",
    "17": "Larian: gaming on console quality and beyond with Divinity: Original Sin 2",
    "26": "iPad Pro M1 advantages...for those who can buy it"
  },
  "links": {
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Mac Mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "Metal": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5252761771762074000&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fmetal%2F",
    "serviceable but cumbersome": "https://www.techradar.com/news/divinity-original-sin-2-is-now-on-ipad-pro-heres-what-its-like-to-play",
    "impacted": "https://www.techradar.com/news/new-apple-macbooks-and-ipads-could-get-delayed-due-to-chip-shortages",
    "Counterpoint Research": "https://www.counterpointresearch.com/one-in-five-ipads-sold-in-2022-to-have-apples-m-series-soc/"
  }
}