{
  "source": "https://www.techradar.com/news/true-wireless-earbuds-that-convert-to-wired-earphones-sign-us-up",
  "title": "True wireless earbuds that convert to wired earphones? Sign us up",
  "category": "audio-visual",
  "updated": "2021-09-08T09:43:49Z",
  "author": "olivia-tambini",
  "summary": "The Shure Aonic 215 2nd Gen can do both",
  "article": [
    "True wireless earbuds are one of the most convenient ways you can listen to music on the go - but a wired connection is still the best way to eke out lots of detail from hi-res audio files.",
    "That's why we're excited by a pair of in-ear headphones that can do both, like the Shure Aonic 215. And now, there's a new generation of the modular earbuds on the scene, with the Shure Aonic 215 2nd Gen, which come with a host of improvements such as IPX4 water resistance, the ability to customize the EQ settings, and improved call audio.",
    "Otherwise, the true wireless earbuds feature the same Qualcomm aptX, AAC, and SBC support, Bluetooth 5 connectivity, and sound isolation. According to Shure, you can also expect the same \"high-fidelity audio with clear sound and deep bass\" as the original buds.",
    "Most importantly, the Shure Aonic 215 2nd Gen continue the modular design of their predecessors, which means you can switch between true wireless and wired listening with the right accessories.",
    "While it may seem annoying to have to fork out $29 / £31 (about AU$40) for the universal cable for Shure's sound isolating earbuds (and that's on top of the $229 /£209 / about AU$310 you're paying for the earbuds themselves), we love the idea of convertible earphones that you can customize to suit your needs.",
    "When you're travelling on a busy subway or working out, cables can be an annoying distraction that detract from the convenient and compact form factor that in-ear headphones offer.",
    "Equally, there are plenty of times where we would prefer to use a wired connection. Sitting at our desk, for instance, where we could hook them up to a portable DAC, and listen to hi-res audio files of our favorite songs.",
    "While many true wireless earbuds do support hi-res audio files thanks to codecs like aptX and aptX HD, truly lossless audio is still out of reach for earbuds without a cable.",
    "That's all about to change, though. CD-quality lossless audio is finally coming to wireless headphones, as Qualcomm recently announced the aptX Lossless codec, which the company says is capable of delivering 16-bit.44.1kHz audio over Bluetooth.",
    "Qualcomm says the audio will be \"mathematically bit-for-bit exact\", which means you won't be losing any data over a wireless connection. Until now, the necessary bit rate to deliver this kind of high quality audio hasn't been available over Bluetooth.",
    "Unfortunately, the technology won't be coming to existing headphones, as it requires specific hardware. Devices that do support aptX Lossless aren't expected to hit shelves until 2021.",
    "So, until then, modular earbuds like the Shure Aonic 215 2nd Gen could be the perfect solution for audiophiles that want the convenience of the true wireless form factor as well as the lossless audio afforded by a wired connection."
  ],
  "headers": {
    "4": "A modular solution"
  },
  "links": {
    "True wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "portable DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Qualcomm recently announced the aptX Lossless codec": "https://www.techradar.com/news/qualcomms-aptx-lossless-could-transform-the-way-wireless-headphones-sound",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340"
  }
}