{
  "source": "https://www.techradar.com/news/vw-id4-awd-first-drive",
  "title": "The VW ID.4 AWD is comfortable, confident and definitely outclasses its hybrid rivals",
  "category": "car-tech",
  "updated": "2021-11-08T12:36:41Z",
  "author": "myriam-joire",
  "summary": "Our first drive of the all-electric VW ID.4",
  "article": [
    "Volkswagen has a lot riding on the ID.4 battery-electric crossover. It's the centerpiece of VW's electrification strategy, and while it competes directly with the Ford Mustang Mach-E and Tesla Model Y, it's really aimed at stealing hybrid and ICE (internal combustion engine) buyers away from Honda's CR-V and Toyota's RAV4 - with aggressive pricing to match (starting at $39,995 / £31,465 before incentives).",
    "But until now, the ID.4 was only available as an RWD model, and as we mentioned in our video review, the RWD version (201hp, 228ft-lb, 0-60mph in 7.6s) didn't really deliver the kind of performance usually associated with EVs.",
    "While this likely didn't matter for the intended audience, it didn't fully legitimize the ID.4 as a competitive EV.",
    "Thankfully, Volkswagen has now remedied this with the ID.4 AWD, which we recently took for a spin.",
    "The ID.4 AWD is available in two trim levels in the US; the Pro and Pro S ($43,675 and $48,175 before incentives), and the Pro S comes with an optional Gradient cosmetic package ($1500).",
    "In the UK, you get the GTX and GTX Max (£48,525 and £55,555 before incentives). Regardless of trim, the ID.4 AWD offers 291hp and 331ft-lb of torque and accelerates from 0 to 60mph in 5.4 seconds (0.62mph in 6.2s).",
    "Compared to the RWD version, the ID.4 AWD boasts an extra motor in front (107hp, 119ft-lb), 0.6-inches (15mm) more ground clearance, and a towing capacity of 2700lbs (1225kg).",
    "Trims in the US are basically identical between the RWD and AWD ID.4 models, so it's best to think of AWD as a $3,680 option that adds an extra motor, tow hitch, and heated windshield. AWD trims in the UK are marketed as sportier versions of the ID.4.",
    "For example, in the UK both GTX trims come with 20-inch wheels, a 12-inch navigation screen, and a HUD (head-up display) as standard.",
    "The HUD isn't available in the US, and you have to buy the Pro S trim to get the 12-inch navigation display (vs 10-inch), and the Gradient package to get the 20-inch wheels (vs 19-inch).",
    "We spent time with the ID.4 AWD in Pro S trim with the Gradient package, so keep that in mind as we move along.",
    "The ID.4 comes with the same 82kWh battery pack in every AWD model, of which 77kWh is usable. In the US, the ID.4 AWD delivers an EPA range of 240-249 miles (386-400km), while in the UK, its WLTP range is 291-301 miles (468-484km).",
    "The same 82kWh battery pack, which is standard on the RWD version in the US, provides an EPA range of 250-260 miles (402-418km). As such, the AWD range penalty is only about 4%.",
    "When it's time to fill up, the ID.4 supports 125kW DC fast charging (CCS Combo 1 in the US, and CCS Combo 2 abroad) resulting in a 5-80% charge in about 38 minutes, plus 11kW AC charging for a full charge in about 7.5 hours.",
    "In the US, Volkswagen offers 3 years of free DC fast charging for the ID.4 on its Electrify America network, along with 2 years of free maintenance and 3 years of free roadside assistance.",
    "The ID.4 AWD we drove - Pro S trim with the Gradient package ($49,675) - came with a plethora of features, including a power liftgate, panoramic glass roof with power sunshade, front and rear parking sensors, adaptive LED headlights, keyless entry, automatic wipers and high-beams, heated power-folding mirrors, auto-dimming rearview mirror, dual-zone climate control, heated steering wheel, and heated 12-way memory power seats.",
    "As you'd expect from a modern EV, the ID.4 also comes packed with technology. Our test car (Pro S trim with Gradient package) included a 5.3-inch instrument display mounted on the steering column and a 12-inch touchscreen located in the middle of the dashboard, though some trims use a 10-inch center panel instead.",
    "Thankfully, the ID.4 still uses physical buttons for several controls - more on this later.",
    "The infotainment system, which has been criticized for being laggy and buggy by both reviewers and owners alike, recently received an over-the-air (OTA) software update, and was reasonably responsive during our stint with the car.",
    "Our experience was superficial, however - since we spent most of our time driving and photographing the ID.4 for this article, we didn't explore the infotainment system in depth.",
    "Other tech features include LTE connectivity via VW's Car-Net (for OTA software updates, WiFi hotspot, and remote control via the Car-Net app), Apple CarPlay / Android Auto support (both wired and wireless), Qi wireless phone charging, four USB Type-C ports (two in front, two in the back), Bluetooth audio support, and Sirius-XM satellite radio.",
    "While there's a backup camera (it's mandatory), there's no 360-degree view on US trims.",
    "Driver assistance and safety features consist of Front Assist (forward collision warning and automatic emergency braking), Side Assist (blind spot warning and rear traffic alert), Travel Assist (adaptive cruise control), Lane Assist (lane keeping assist and lane departure warning), and Emergency Assist.",
    "VW calls this suite of features IQ.DRIVE. It's similar to other basic Level 2 ADAS (Advanced Driving Support System) we've tried, and works as advertised.",
    "The ID.4 also offers the Hello ID voice assistant and ID.Light, a thin light bar at the bottom of the windshield that spans the width of the dashboard and provides visual cues in the form of colored animations.",
    "Red for forward collision warning, blue on the left or right for upcoming navigation turns, flashing green in the center for incoming calls, white when talking with the assistant and pulsing green when charging (progress bar).",
    "All that's really missing here is seamless integration between the ID.4 and Volkswagen's own Electrify America DC fast charging network.",
    "Right now, you can't simply plug in your ID.4 and expect it to charge and bill you automatically, which is how Tesla's Superchargers work.",
    "It's a strange omission considering Ford already supports this plug-and-charge functionality with Electrify America via its FordPass Charging Network.",
    "Despite being yet another crossover, the ID.4 looks a lot better in person than it does in pictures. It's sleek and refined, without being pretentious. As such, it really is the people's EV.",
    "We like the silver roofline accents from the Gradient package, and the illuminated grille and VW logo from the Pro S trim. There are other friendly design touches here and there, like the embossed Volkswagen script on the B pillar.",
    "Strangely, the ID.4 lacks a frunk, and you know TechRadar's rules by now: all battery EVs must have a frunk. This is the way.",
    "At least the trunk is large, with 30.3 cubic feet (543 liters) of storage with the 60/40 folding rear seats up, and 64.2 cubic feet (1,575 liters) with the rear seats down.",
    "There's also about 2 inches of space under the trunk floor, plus a large storage cubby for the included 110V charging cable in lieu of a spare tire.",
    "The theme continues inside, with a spacious cabin that's both modern and familiar. Materials and build quality are up to VW's usual high standards. The ID.4 makes strategic use of hard plastics in less touched areas, but everything else feels premium.",
    "We're particularly fond of the two-tone Galaxy black and Florence brown interior, but less keen on the many piano black surfaces, which are fingerprint magnets.",
    "While there are several dedicated buttons for various controls (like the headlights, volume, and climate), most of them are capacitive and only use audible feedback.",
    "This also applies to the buttons on the steering wheel, but those also provide haptic feedback (vibration).",
    "Regardless, we're not fans of these capacitive buttons, as it's way too easy to accidentally brush a steering wheel button with your fingers while maneuvering.",
    "At least the window and seat controls use real switches, though VW only put two window switches on the driver side, with a capacitive button to toggle between the front and rear windows, which is annoying.",
    "The dual rectangular cupholders in the center console are removable, turning the area into a storage cubby, and the folding armrests are integrated into the seats instead of the center console.",
    "The legroom is plentiful in the back seat, and the front seats are comfortable and easy to adjust.",
    "The same goes for the steering wheel, which tilts and telescopes, but also brings the steering column-mounted 5.3-inch instrument display and BMW i3-like gear selector along for the ride. It’s clever.",
    "Visibility is excellent overall, but the side mirrors are quite large and might obstruct the field of view for some drivers.",
    "Once you're settled in, driving the ID.4 is as easy as pressing the brake pedal and shifting into drive or reverse with the BMW i3-like gear selector attached to the side of the 5.3-inch instrument display.",
    "Volkswagen copied Tesla here, and that's just great.",
    "There's still a start/stop button on the steering column, but it's optional for driving. Instead, it lets you power up the car to use the infotainment system.",
    "In addition to the drive and reverse gears, the ID.4 also features a brake gear (B), which significantly increases regen braking when lifting off the throttle.",
    "This almost enables one-pedal driving like some other EVs - we write \"almost\" because the ID.4 still creeps forward when no pedals are pressed, and lacks the auto-hold feature found on some other cars. We used the brake gear (B) for most of our 3-hour drive.",
    "Speaking of the brakes, Volkswagen is blending regen and hydraulic braking on the ID.4, and while it's generally seamless, there's a tiny delay between pressing the brake pedal and the car reacting.",
    "It's slightly unsettling, especially during low-speed maneuvers, and while it's very subtle, it's there. Basically, you'll only notice if you're used to a decent hydraulic-only braking setup. In reality, most people likely won't care.",
    "There's also a slight delay between pressing hard on the throttle and experiencing that magical wallop of electric torque. It's not something we've experienced with other EVs that share similar performance numbers.",
    "Perhaps VW is trying to be gentle with the drivetrain and tires for the sake of longevity? Still, the ID.4 AWD is plenty fast and quickly builds up speed. Just expect less of that familiar EV punch when you stomp on the throttle.",
    "Again, anyone coming from a hybrid or ICE vehicle won't notice this, and will be impressed with the ID.4 AWD's acceleration. The ID.4 offers five drive modes; eco; comfort; sport; traction; and custom, which are pretty much self-explanatory.",
    "While DCC (dynamic chassis control) is an option on some UK trims, it's not available on US trims. As a result, these drive modes only change regen, steering weight, and throttle response.",
    "We spent most of our 3-hour drive in sport mode, which is the only drive mode that's noticeably different from the others. It's more engaging thanks to more regen, heavier steering, and a quicker throttle response.",
    "By default, the ID.4's steering doesn't provide much feedback and is rather light. Sport mode improves the steering just enough to make it acceptable. The 36.4ft (11m) turning radius is fantastic, though.",
    "As you'd expect from an electric car with a heavy battery pack located under the floor between the axles, the ID.4 rides and handles quite well. The suspension is well tuned and body roll is minimal.",
    "The ID.4 is both comfortable and confident in the twisties, and definitely outclasses hybrid and ICE crossovers.",
    "Take a look at the Volkswagen ID.4 AWD from all angles in our photo gallery below.",
    "While we can't say the ID.4 AWD is fun to drive, it's certainly pleasant to drive - especially in sport mode.",
    "Overall, we think the ID.4 AWD is a very good crossover. At just $43,675 before incentives, it's currently the most affordable AWD EV available in the US.",
    "While Ford's Mustang Mach-E and Tesla's Model Y are better EVs overall, the ID.4 AWD beats them on value while still being competitive, putting VW in a better position to bring hybrid and ICE crossover buyers over to EV land. And that's no small feat."
  ],
  "headers": {
    "4": "VW ID.4 AWD price, specs and features",
    "16": "VW ID.4 AWD tech",
    "29": "VW ID.4 AWD design",
    "44": "VW ID.4 AWD driving impressions",
    "60": "Takeaway"
  },
  "links": {
    "Ford Mustang Mach-E": "https://www.techradar.com/news/ford-mustang-mach-e",
    "Tesla Model Y": "https://www.techradar.com/news/tesla-model-y",
    "our video review": "https://www.youtube.com/watch?v=6GzQkxf-Esk",
    "recently received an over-the-air (OTA) software update": "https://www.techradar.com/news/good-news-for-vw-id3-and-id4-owners-as-free-updates-roll-out-to-the-electric-cars",
    "Emergency Assist": "https://en.wikipedia.org/wiki/Emergency_driver_assistant",
    "Volkswagen copied Tesla here": "https://www.techradar.com/news/tesla-model-3-long-range-2021-review"
  }
}