{
  "source": "https://www.techradar.com/news/gskill-is-getting-ready-to-release-ddr5-ram",
  "title": "G.Skill is getting ready to release DDR5 RAM",
  "category": "computing",
  "updated": "2021-09-23T09:57:10Z",
  "author": "jess-weatherbed",
  "summary": "Flashy new memory kits",
  "article": [
    "G.Skill is one of the most recognizable computer memory producers on the market, so it's little wonder that it's preparing for the next generation of RAM (random-access memory).",
    "DDR5 is predicted to become the new standard of RAM by as early as 2023, but previously announced kits from the likes of Samsung and TeamGroup haven't had the most inspiring designs for memory.",
    "As G.Skill is especially favored by PC gamers owing to its creative designs, it's unsurprising to see what looks to be the familiar RGB lighting that features on popular products like the Trident Z range, with the video teaser even displaying the light in a 'Z' formation.",
    "Given the video teaser is only 15 seconds long, we don't have much information specific to the G.Skill release to go on (including a lack of release date, price or other specifications), but we're going to assume a few things based on the wider market information we already have.",
    "Firstly, given the letter 'Z' features in the video, and that the DDR4 Trident Z RGB series is easily one of the most recognizable products on the market (alongside other G.Skill memory kits like the Trident Z Royal), we're willing to bet the overall design will remain unchanged, or receive a minimal refresh to update the look along the same lines as the G.Skill Trident Royal Elite.",
    "We also don't know the price, but TeamGroup suggests that 16GB will become the new standard for memory modules, pricing its own 32GB, 4,800 MHz kit at $399.99 (around £300, AU$550). As pricing for DDR4 4,000 MHz (32 GB) kits currently sits at around $299-$399, the cost of TeamGroup's kit feels rather reasonable for the going market rate, but there's nothing to say that G.Skill will follow suit.",
    "In fact, it was also suggested by TeamGroup that DDR5 will be more expensive than the current DDR4 standard, but until we see more manufacturers list a variety of different kits, we can't get an accurate estimate for what the average market price will be.",
    "It's early days for DDR5, despite the new generation of memory already having a number of advantages over DDR4. DDR5 can register speeds of up to 6.4Gbps, smashing DDR4’s potential rate of 3.2Gbps. You'll also be using less power, which is a great advantage for anyone looking to save on their energy bill. Thing is, these kits are essentially unusable until DDR5-compatible motherboards are also released, so buying one will mean it has to sit in a box until other technology catches up.",
    "That said, looking at the current DIY PC building market is a little tragic, with graphics cards and processors still being a pain to locate at MSRP. Coveted products like the AMD Ryzen 5000 series CPUs have suffered from high demand and low stock, while graphics cards like the Nvidia GeForce RTX 3080 and the AMD Radeon RX 6800 XT have appeared on third-party marketplaces like eBay for up to three times their standard price, and it looks like things are only going to get worse.",
    "It's possible that, as so few DDR5 kits will be available in the first few months after the release of compatible motherboards and processors, we could see similar high demand and low availability. Both AMD and Intel aren't expected to launch DDR5 supporting ranges until sometime in 2022, but if you want to guarantee you'll get your hands on some, it might be best to buy yourself a kit early and just look at it lovingly until the rest of your build hits the market."
  ],
  "headers": {
    "3": "What to expect",
    "7": "Analysis: Should you buy DDR5 early?"
  },
  "links": {
    "DDR5": "https://www.techradar.com/news/ddr5-ram-has-officially-hit-the-shelves-but-you-shouldnt-buy-them",
    "Trident Z": "https://www.gskill.com/products/1/165/166/Trident-Z-RGB",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "processors": "https://www.techradar.com/news/best-processors",
    "AMD Ryzen 5000 series": "https://www.techradar.com/news/amd-ryzen-5000-restock-should-improve-soon-heres-when",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "three times their standard price": "https://www.techradar.com/news/current-nvidia-rtx-3000-gpu-prices-are-so-much-worse-than-we-thought",
    "DDR5 supporting ranges": "https://www.techradar.com/news/intels-12th-generation-desktop-processors-could-support-ddr5-ram-before-amd"
  }
}