{
  "source": "https://www.techradar.com/news/the-wheel-of-time-first-trailer-shows-its-ready-to-rival-the-witcher",
  "title": "The Wheel of Time first trailer shows Amazon is ready to rival The Witcher",
  "category": "entertainment",
  "updated": "2021-09-02T15:38:34Z",
  "author": "tom-power",
  "summary": "Analysis: Can The Wheel of Time usurp Netflix's Witcher series?",
  "article": [
    "After months of waiting, The Wheel of Time's first trailer has arrived online – and it looks like it could be a big rival for The Witcher's fantasy crown.",
    "Posted on the TV show's social media channels on September 2, the first official footage for Amazon Prime's upcoming series has given us our best look at its Wheel of Time adaptation. The trailer contains plenty of fantasy action, sweeping shots and some humorous moments, too, while we're also provided with a better idea of what the plot will entail.",
    "Check out The Wheel of Time's first teaser below, which also revealed when the show will arrive: November 19, 2021.",
    "The show's first footage comes almost three years after Amazon greenlit a TV adaptation of Robert Jordan's fantasy novel series, and nearly two years after production began.",
    "Set in an unnamed land, The Wheel of Time follows Moiraine Damodred (Rosamund Pike), a member of a powerful, all-female magical guild called the Aes Sedai.",
    "Moiraine is tasked with finding the Dragon Reborn – a prophesized individual who can prevent the world's destruction at the hands of the villainous Dark One. Leading a group of five young people, including Rand al'Thor (Josha Stradowski), on a globetrotting journey, Moiraine must determine which of the quintet is the true reincarnation of the world's supposed savior.",
    "Comprising six one-hour episodes, The Wheel of Time season 1 will launch exclusively on Amazon Prime Video.",
    "Like many movie and TV projects, The Wheel of Time's first season was affected by the Covid-19 pandemic. With filming concluding in May 2021, though, Amazon has moved quickly to finish post-production on the show so it can be released this year.",
    "Curiously, The Wheel of Time's release date puts it on a collision course with the second season of Netflix's Witcher series. Unsurprisingly, that means that there will be two heavyweight fantasy shows going head to head in the final month of the year.",
    "On the surface, The Wheel of Time season 1's November 19 launch date ensures that there'll be enough room for each show to breathe. However, a closer inspection of each series' release schedules shows the two series will clash at some point in December.",
    "Amazon's Wheel of Time may premiere in mid-November, but new episodes are set to be released weekly. That means that its fifth and sixth instalments will arrive on December 17 and 24 respectively.",
    "All 10 episodes of The Witcher season 2, meanwhile, will arrive on Netflix on the same date: December 17.",
    "So The Wheel of Time and The Witcher will cross paths at some point. The former will have a few weeks before its competitor arrives but, as mid-December rolls around, it's inevitable that these two fantasy titans will vie for viewers.",
    "It'll be very interesting, then, to see who comes out on top. Despite mixed reviews for season 1, The Witcher still pulled in huge numbers in December 2019. With The Wheel of Time looking to usurp it, The Witcher season 2 has fierce competition for its fantasy crown.",
    "Add in the fact that two of the biggest streamers are going head to head in the fantasy genre, and this particular battle could be a very tantalizing one to keep tabs on at the end of this year."
  ],
  "headers": {
    "7": "Analysis: can The Wheel of Time truly rival The Witcher?"
  },
  "links": {}
}