{
  "source": "https://www.techradar.com/news/oneplus-watch-certification-suggests-its-coming-very-soon-in-two-versions",
  "title": "OnePlus Watch certification suggests it’s coming very soon in two versions",
  "category": "wearables",
  "updated": "2021-01-25T09:41:59Z",
  "author": "james-rogerson",
  "summary": "To LTE or Wi-Fi-only",
  "article": [
    "OnePlus itself has already confirmed that the OnePlus Watch is coming early this year, and it seems the company is on schedule, as its wearable has been spotted on the BIS (Bureau of Indian Standards) certification database – something which typically would only happen close to launch.",
    "Leaker Mukul Sharma spotted the listing, and it includes two different variants of the OnePlus Watch, one with the model number W501GB, and the other called W301GB.",
    "The listing doesn’t reveal anything else, not even how these two models differ, but it’s likely that one includes LTE connectivity while the other is Wi-Fi-only, as that’s often the reason for multiple model numbers on wearables.",
    "Despite it seemingly launching soon, we actually don’t know all that much about the OnePlus Watch yet. In fact, we’re not even sure it will be called the OnePlus Watch.",
    "Leaks suggest it will have a circular screen, and we’d expect it will run Wear OS (though not all sources agree even on that), but beyond that the wearable is a bit of a mystery.",
    "Still, it’s an exciting mystery, as coming from OnePlus it has the potential to shake up the smartwatch market, much as the company did with smartphones, and if it does run Wear OS it could even breathe some life into that struggling operating system.",
    "With any luck we’ll find out soon. TechRadar will bring you all the news, leaks and announcements surrounding the OnePlus Watch, so stay tuned for updates.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "early this year": "https://www.techradar.com/news/oneplus-watch-will-be-released-early-next-year-according-to-ceo",
    "Mukul Sharma": "https://twitter.com/stufflistings/status/1352110997243265024",
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "not all sources agree": "https://www.techradar.com/news/the-oneplus-watch-might-not-come-running-wear-os",
    "GSMArena": "https://www.gsmarena.com/oneplus_watch_gets_certified_launch_imminent-news-47371.php"
  }
}