{
  "source": "https://www.techradar.com/news/this-cheap-soundbar-has-plummeted-to-its-lowest-ever-price-ahead-of-prime-day",
  "title": "This cheap soundbar has plummeted to its lowest ever price ahead of Prime Day",
  "category": "audio-visual",
  "updated": "2021-06-16T09:43:24Z",
  "author": "olivia-tambini",
  "summary": "Grab the Polk Audio React for less in this early Prime Day deal",
  "article": [
    "Looking for a cheap soundbar to deck out your home cinema setup? This early Prime Day deal could be right up your street.",
    "Amazon has slashed the price of the Polk Audio React soundbar from $249 to $199, a return to the lowest price we've ever seen. (Not in the US? Scroll down for the best soundbar deals in your region.)",
    "While it's possible that the price of this Alexa soundbar could drop even lower during the Prime Day sales, we don't think it's super likely – so we'd recommend snapping it up now.",
    "If you want to go all out, Amazon has also reduced the rear speakers and wireless subwoofer that work with the React soundbar, reducing both by $20.",
    "While we haven't tested the Polk Audio React soundbar for ourselves, the specs are impressive – especially at this low price.",
    "It's capable of delivering virtual surround sound with support for Dolby Digital and DTS 5.1, which is handy if you don't have the space or the budget to deck out your home with rear speakers.",
    "If you do want to go big on your home cinema setup, however, you can purchase the new Polk SR2 wireless surround speakers and the Polk Audio React Sub 1, which features a seven-inch long-throw woofer to boost the bass frequencies.",
    "The soundbar comes with Polk Audio's Voice Adjust technology, which the company says allows you to precisely tweak voice levels and make dialogue \"crystal clear\", without needing to crank up the volume.",
    "There are also preset sound modes including Movie Mode, Music Mode, and Night Mode, with the latter preventing the sound of your films and music from disturbing your neighbors by reducing bass levels and enhancing the dialogue.",
    "HDMI ARC means the Polk React should be easy to install with nearly any TV, while Bluetooth connectivity allows you to stream music wirelessly.",
    "Alexa Multi-room Music integration also means you can pair multiple Alexa speakers with the soundbar to bring sound into your entire home.",
    "Using voice commands with the Polk React should be simple, with four far-field microphones built-in and echo cancellation software designed to pick up your commands clearly.",
    "Not in the US? Check out the best soundbar deals in your region below:",
    "TechRadar is rounding up all the top deals in the run up to the Amazon Prime Day 2021 sales period, and we’ve put together a hub of all the Amazon Prime Day 2021 news you'll need to prepare yourself for the discount period."
  ],
  "headers": {
    "4": "Today's best cheap soundbar deal"
  },
  "links": {
    "Prime Day deal": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "from $249 to $199": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FPolk-Audio-React-Surround-Messaging%2Fdp%2FB08M16HKV9%2Fref%3Dlp_23522551011_1_1%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2575603205163839500-20",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "HDMI ARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "Alexa speakers": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}