{
  "source": "https://www.techradar.com/news/norton-360-deluxe",
  "title": "Norton 360 Deluxe: what is it and what’s included?",
  "category": "computing",
  "updated": "2021-04-11T09:19:13Z",
  "author": "liam-barker",
  "summary": "Will the Norton 360 Deluxe plan meet your online security needs?",
  "article": [
    "Providing your devices and online activity with some of the top antivirus protection currently available, Norton 360 Deluxe leads the way in the range offered by world-renowned Norton AntiVirus.",
    "In this article, we discuss that premium package. We give you a clear sense of what Norton 360 Deluxe offers, from its features to its overall performance, so you can decide if it suits your cybersecurity needs.",
    "Norton 360 Deluxe is the second smallest (and second best priced) antivirus plan in the 360 range, sitting directly ahead of the Standard plan. You can go even more basic still if you're happy to drop down to the Norton AntiVirus Plus plan.",
    "For customers in the USA, Deluxe is followed by three progressively bigger Norton 360 plans: LifeLock Select, LifeLock Advantage, and LifeLock Ultimate Plus. For customers outside the USA, Deluxe is the middle of three plans, sitting ahead of Standard and followed only by Premium.",
    "Our dedicated guide on Norton plans will help you choose between the three.",
    "As with all other Norton 360 plans, Deluxe can be used on Windows, Mac, iOS, and Android operating systems. This means you can protect all types of devices, including smartphones and tablets.",
    "One of the key differences between Standard and Deluxe is that the latter package offers protection for up to five devices per subscription, as opposed to just one.",
    "In the context of the entire Norton 360 range, the Deluxe package offers a small to mid-size array of security/privacy features that build on what you get with the Standard plan.",
    "Baseline security and privacy features",
    "- Online threat protection utilizes AI-enhanced security technology to tackle various kinds of malware.",
    "- 50GB worth of cloud storage (only available on Windows PC) automatically backs up your files/data.",
    "- Norton Password Manager helps you create and store complex passwords for your accounts.",
    "- Norton Smart Firewall (only available for Windows PC and Mac devices) actively checks your network connections for threats.",
    "- Unlimited use of Norton Secure VPN safeguards your online anonymity and gives VPN functionality for up to five devices across Windows PC, Mac, iOS, and Android operating systems.",
    "- SafeCam (only available on Windows PC) prevents hackers from gaining access to your device’s webcam.",
    "- Dark Web Monitoring protects you from identity theft by monitoring dark web marketplaces.",
    "Additional features",
    "Unlike Norton 360 Standard, the Deluxe package also includes a Privacy Monitor feature and a Parental Control system.",
    "The Privacy Monitor feature means you can make any of your personal information held online - like date of birth or address - unavailable to data brokers. These are companies that collect information about you through various sources, such as social media sites and web browsing histories.",
    "The Parental Control system enables parents to effectively supervise their children’s internet usage via various features, such as screen-time management and web supervision. You can monitor your child’s activities from any type of device/operating system, and Parental Control can even be installed onto your child’s device (unless it’s a Mac).",
    "Norton 360 Deluxe is a tangible step-up from the Standard plan, namely because it extends protection for up to five devices per subscription, increases cloud storage by 40GB, and includes an appealing Parental Control system that contains many useful tools.",
    "With all these features in mind, the first-year subscription price for Norton 360 Deluxe is quite reasonable. It poses convincing competition to rival plans from other leading antivirus software companies, such as Bitdefender with its Total Security 2021 package.",
    "Norton’s Secure VPN has a few issues: it doesn’t have a kill switch, doesn’t always satisfactorily notify you about connection issues, and can’t consistently unblock some region-restricted content (e.g., US Netflix). Overall, though, you can rely on Norton 360 Deluxe for dependable functionality and easy use."
  ],
  "headers": {
    "2": "What is Norton 360 Deluxe?",
    "5": "What devices can I use Norton 360 Deluxe on?",
    "7": "Norton 360 Deluxe: What features does it have?",
    "20": "How good is Norton 360 Deluxe?"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Norton AntiVirus": "https://www.techradar.com/reviews/norton-2020-antivirus-solutions",
    "Norton AntiVirus Plus": "https://www.techradar.com/news/norton-antivirus-plus-what-is-it-and-whats-included",
    "Norton plans": "https://www.techradar.com/news/which-norton-antivirus-plan-should-i-get",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Norton Secure VPN": "https://www.techradar.com/reviews/norton-secure-vpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Bitdefender": "https://www.techradar.com/reviews/bitdefender-antivirus"
  }
}