{
  "source": "https://www.techradar.com/news/realme-is-making-a-play-for-the-best-camera-phone-trophy-with-the-realme-8",
  "title": "Realme is making a play for the best camera phone trophy with the Realme 8",
  "category": "phones",
  "updated": "2021-03-02T12:13:10Z",
  "author": "tom-bedford",
  "summary": "With a 108MP sensor",
  "article": [
    "Only Samsung, Motorola and Xiaomi use 108MP camera sensors in their smartphones, but up-and-comer Realme has just announced it is the next brand to use such a high-res main snapper. It'll be in the upcoming the Realme 8 series.",
    "This announcement happened at a 'Camera Innovation Event' hosted by Realme on March 2 - it mirrors a similar event hosted in 2019 where the brand showed off its use of a 64MP camera, which has seen use in many of its phones since.",
    "The 108MP sensor at use here is Samsung's HM2, which is a different sensor than Samsung used in the Galaxy S20 Ultra, and it's not the same one used in the Xiaomi Mi 10 or Mi 11 either.",
    "This sensor is slightly newer, and its main advantage over the HMX and HM1 used varyingly in those phones is that it records video at a higher resolution. The Samsung Galaxy S21 Ultra's HM2 sensor beats it though, recording in that same higher resolution but at an improved frame rate, and capturing 12-bit color instead of 10-bit like the other 108MP sensors.",
    "Still, the use of a 108MP sensor shows Realme is getting serious about its smartphone photography.",
    "The title of 'best camera phone' isn't handed out to every phone, and it'll take more than a good main sensor for the Realme 8 series to win the crown - it'll need a cohort of great snappers including a telephoto, ultra-wide-angle and a selfie camera that match.",
    "While high spec cameras can be great, they're not necessarily a shoe-in for the title either, as they typically have smaller pixel sizes which results in them 'seeing' less light, resulting in a dimmer or less vibrant photo. No phones released globally have used this new sensor yet, so we don't know how well it works.",
    "Realme did share some photo samples from the Realme 8 Pro, but it's not clear if these are from the 108MP main camera or not.",
    "The company also detailed some modes that made the most of the phone's camera prowess. There's a tilt-shift time-lapse mode, starry-sky mode and arious portrait options.",
    "Realme did go into detail on the 108MP camera's digital zoom, showing how 3x zoom results in 12MP photos. This does imply there won't be a telephoto or periscope camera for optical zoom, but it's not quite confirmed.",
    "Either way, Realme's photography event has us intrigued to get our hands on the Realme 8 series, to see how good they are for photography and if they compare to the iPhone 12 Pro, Huawei P40 Pro, Samsung Galaxy S21 Ultra and other top camera phones."
  ],
  "headers": {
    "5": "Will this be the best camera phone?"
  },
  "links": {
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Huawei P40 Pro": "https://www.techradar.com/reviews/huawei-p40-pro-review"
  }
}