{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-looking-ever-more-likely-to-run-wear-os-rather-than-tizen",
  "title": "Samsung Galaxy Watch 4 looking ever more likely to run Wear OS rather than Tizen",
  "category": "wearables",
  "updated": "2021-03-03T15:02:01Z",
  "author": "james-rogerson",
  "summary": "But we're not sure why",
  "article": [
    "Not long ago a leaker claimed that an upcoming Samsung smartwatch would run Android (presumably meaning Wear OS), and now we've seen evidence that this may well be true.",
    "Twitter user Ivan_Meler (who shared the data with XDA Developers) found reference to a device codenamed 'Merlot' in some source code for the Samsung Galaxy S20, and alongside it there was mention of Wear OS.",
    "That therefore suggests both that this is a wearable, and more importantly that it's one that runs Google's smartwatch operating system.",
    "That said, there's no indication here of exactly which smartwatch 'Merlot' is, so we can't definitively say that it's the Samsung Galaxy Watch 4. It could alternatively be the Samsung Galaxy Watch Active 3 or something else altogether. Perhaps even the first in a new line of Wear OS wearables from Samsung.",
    "Whatever it is though, this seems close to a confirmation that Samsung has a Wear OS wearable in the works, and even with a previous leak backing it up, that surprises us slightly, as in many ways Tizen (which current Samsung smartwatches use) is a superior smartwatch operating system.",
    "Still, a Samsung wearable powered by Wear OS could be just what's needed to reinvigorate Google's struggling operating system, so we're certainly intrigued to see how it will turn out.",
    "It's not clear right now when this wearable will land (assuming it exists), but as soon as it does you can be sure that TechRadar will test it in full, and tell you whether the switch to Wear OS was a smart one."
  ],
  "headers": {},
  "links": {
    "would run Android": "https://www.techradar.com/news/samsung-galaxy-watch-4-could-switch-back-to-wear-os",
    "Ivan_Meler": "https://twitter.com/Ivan_Meler",
    "XDA Developers": "https://www.xda-developers.com/samsung-galaxy-watch-android-wear-os/#update1",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch Active 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "that surprises us": "https://www.techradar.com/news/samsungs-galaxy-watch-4-switching-to-wear-os-doesnt-make-sense-right-now"
  }
}