{
  "source": "https://www.techradar.com/news/googles-latest-chrome-update-brings-some-great-new-features-especially-for-linux-users",
  "title": "Google's latest Chrome update brings some great new features - especially for Linux users",
  "category": "computing",
  "updated": "2021-05-26T10:52:21Z",
  "author": "daryl-baxter",
  "summary": "ChromeOS finally leaves the beta train on Linux",
  "article": [
    "Google’s Chrome browser and operating system has been updated to version 91, bringing with it a wide variety of features, mainly announcing that Linux support is now official for ChromeOS, alongside being able to copy and paste a file onto a web page and much more.",
    "Announced to little fanfare, Google has detailed a bunch of security fixes that plug the holes to vulnerabilities, and is now available on all platforms, such as Windows, macOS, Linux, and Chromebooks.",
    "There’s much more front-facing improvements in this release than before, some of which can help improve your workflow, especially with web apps.",
    "This release marks an improvement to Google’s web browser and its operating system, which you can find on Chromebooks. However, these new features can be found on both ChromeOS and the web browser you use on your chosen platform.",
    "Google is already looking into how web apps can be more useful to users, and it looks as though they’re already bringing these improvements into the release channels. For Chrome 91, web apps can now start up automatically once you sign in to your account on the browser by right-clicking the app icon.",
    "Another useful feature is being able to copy and paste local files into a web page. If you need to attach your resume to an email, you can copy the file from your PC, and paste it into the message in Chrome 91. This is behind a flag for now, but the feature can be enabled by going to ‘chrome://flags/#clipboard-filenames’ in the address bar.",
    "Finally, Chrome 91 is bringing back a feature similar to the RSS Google Reader platform. An option in the menu now allows you to follow a website, so any new content will show in a ‘Following’ section when a new tab is opened.",
    "Alongside searching for closed tabs in the Tab Search icon and the Android version displaying web pages as a desktop site by default, there are plenty of features in this release that many will find useful.",
    "If you’re running on Windows, macOS or ChromeOS, go to the three dots on the browser, Help > About Google Chrome, and it should list version 91.0.4472.77 for download.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "What’s new in Chrome 91?",
    "8": "How can I update?"
  },
  "links": {
    "has detailed": "https://chromereleases.googleblog.com/2021/05/stable-channel-update-for-desktop_25.html",
    "flag": "https://www.techradar.com/how-to/chrome-flags-what-they-are-and-how-to-use-them-for-better-web-browsing",
    "9to5Google": "https://9to5google.com/2021/05/25/chrome-91-mac-windows-stable/"
  }
}