{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
  "title": "Samsung Galaxy Note 9 review",
  "category": "phones",
  "updated": "2019-08-08T11:41:11Z",
  "author": "matt-swider",
  "summary": "Still a solid, speedy, big-screened phone with a stylus",
  "verdict": "Bigger than previous Note phones in every way, the Samsung Galaxy Note 9 has a larger 6.4-inch screen, heftier 4,000mAh battery, and a massive 1TB of storage option. The already good camera is slightly better, the stereo speakers are a first for the Note, and the Bluetooth-connected S Pen can activate fun customizable shortcuts remotely. But its price matches what you’ll pay for an iPhone XS Max.",
  "pros": [
    "Beautiful 6.4-inch Infinity Display",
    "Superb camera, even in low light",
    "Battery and storage last and last",
    "Bluetooth S Pen shortcuts are fun"
  ],
  "cons": [
    "Expensive",
    "A lot of small upgrades",
    "No HDR video recording",
    "We hate the Bixby button"
  ],
  "article": [
    "When the Samsung Galaxy Note 9 launched it was a little bigger, slightly more colorful, a bit more powerful and pricier than prior Note phones, but be warned: it’s no longer the latest Note on the market.",
    "It's been superseded by the Samsung Galaxy Note 10 and Galaxy Note 10 Plus, but if your budget can't quite stretch to the new Note asking prices and you're desperate for an S Pen stylus with your smartphone, the Galaxy Note 9 is still a top handset.",
    "The Galaxy Note 9 has a sizable 6.4-inch AMOLED display, huge 4,000mAh battery and up to 512GB of internal storage and 8GB of RAM. Sure, that's been met and slightly exceeded by the Samsung Galaxy S10 Plus, but the Note 9 is still a serious contender in 2019.",
    "Slide in a 512GB microSD card (which Samsung will gladly sell you), and you can get one of the first mainstream 1TB phones in your hands to save all your photos, videos, and music. That's more space than a lot of the best laptops on the market.",
    "Good news – the Note 9 doesn’t really feel any larger than the 6.3-inch Note 8, and it inherits a bunch of features from the 5.8-inch Galaxy S9 and 6.2-inch Galaxy S9 Plus, including camera specs. It takes great photos, only outpaced by the Google Pixel 3, Google Pixel 3 XL, the Huawei P30 Pro, and the newer Samsung Galaxy S10 and Note 10 lines.",
    "The camera here is noticeably better than the Note 8, with a dual 12MP rear setup that has dual-aperture technology, and can record Super Slow Mo videos.",
    "There are stereo speakers, and the less-than-impressive AR Emoji mode is back with some finer avatar customization. Rest assured, AR Emoji will still look nothing like you. it's the black sheep on the Galaxy features list.",
    "Exclusive to the Note 9 camera are automatic scene optimizer and flaw detection features that enhance photos (though, Samsung has a habit of rolling these features out to older phones later on, so hang tight if you have an S9 or S9 Plus).",
    "The S Pen is still a handy tool for jotting down notes, but it now has Bluetooth for remote-controlled shortcuts that are customizable (unlike the annoying Bixby button that you can't even turn off anymore).",
    "Want to pose for a photo 30 feet away? This S Pen can help you do that and more. It works great, but you may have trouble finding a spot to rest your precious and expensive Note 9 for full-body snapshots. We ended up with a lot of shots at bad camera angles, so it's a good idea on paper, but doesn't always work out like we first envisioned.",
    "Bad news – the price feels much bigger. Get ready to pay iPhone XS-level prices for the entry-level 128GB and 6GB model. Ouch. It's meant for power users, according to Samsung – the physical size, storage size, price, and battery capacity all tell us that. It sees Note 9 buyers as people who spend a lot of time on their phone and want the best of the best – they buy the best AV receiver, the best TV, and so forth.",
    "The Note 9 is our top smartphone recommendation – that is, if you want to own a giant, feature-filled phone with a stylus and hate saving money. Ongoing Samsung Galaxy Note 8 deals are the biggest threat to this upgrade that, ironically, is all about going big in a variety of small ways.",
    "Check out our hands-on video below to see the Galaxy Note 9 in action:",
    "The Samsung Galaxy Note 9 released on Friday, August 24, 2018, sooner than anyone had expected a year prior.",
    "Why the early Note 9 release date? The theory is that Samsung wanted to rush it out to beat the iPhone XS and iPhone XS Max that Apple announced on September 12.",
    "Talking of Samsung's chief competition, the Note 9 price now rivals that of Apple’s flagship handsets, rather than undercutting it as we'd hoped from an Android phone.",
    "The Note 9 price at launch was $1,000 (£899 / AU$1,499 / AED 3,699) with 128GB of internal storage and 6GB of RAM, and $1,250 (£1,099 / $AU1,799 / AED 4,599) for 512GB and 8GB of RAM.",
    "Yes, that entry-level 128GB configuration does double the iPhone X's 64GB of storage for the same price, and is therefore a better value. But it's also a hike of $70 (£30) over the Note 8 launch price and $150 (£30, AU$150) more than the launch price of the Galaxy S9 Plus, a very similar smartphone. So it depends on how you look at it, and where you live.",
    "Of course, this is just launch prices we're talking. We've more recently seen the Samsung Galaxy Note 9 price around $600 / £589 / AU$950. That makes the Note 9 a more affordable option, and while it's not cheap, it's a healthy discount of the launch price.",
    "Note 9 colors in the US are Ocean Blue with a yellow S Pen (it also writes in yellow for the ultimate color contrast) and Lavender Purple with a purple pen (which writes in purple digital ink).",
    "In the UK it's available in those two colors plus Midnight Black, while the colors for Australia have been confirmed as Ocean Blue and Midnight Black. Other regions may get a Copper color, we were told by Samsung – colors are region-dependent.",
    "The new S Pen is this year's big gimmick for the Note, and it's capable of performing Bluetooth-connected magic tricks from up to 30 feet away. Samsung's engineers managed to squeeze a small supercapacitor and tiny Bluetooth Low-Energy antenna into the otherwise unchanged stylus so that it can perform various remote functions. It’s the type of gimmick we ended up liking – sometimes.",
    "What can you do exactly? The best feature is being able to remotely launch the camera app with a long press of the S Pen button, flip the camera to selfie mode with a single short press, and snap a group photo with two presses.",
    "It’s much easier than setting the camera timer, which Samsung hid in the camera settings menu last year, and less awkward than waving your hand in front of the lens to trigger the gesture-initiated camera timer.",
    "Samsung is making S Pen shortcuts customizable. Here are the ideas mentioned:",
    "Samsung put a software development kit (SDK) out there for non-core third-party apps to take advantage of this shortcut tool, so you'll see more customization as long as app developers support the functionality.",
    "The S Pen does need to be charged, but it requires only 40 seconds of charge time for 30 minutes of standby battery life or 200 button clicks, according to our testing.",
    "There's also a helpful S Pen battery indicator in the notification shade at the top of the display, so you won't be kept guessing as to how much power you have left. And we found that keeping the S Pen topped up was much easier than charging the iPad's Apple Pencil.",
    "Simply embedding the S Pen inside the phone charges it, and when it’s not in use that’s where you typically put it. The Apple Pencil has nowhere to hide, and walking around with it in the Lighting port is rather dangerous. Samsung’s years of stylus-making experience are obvious here.",
    "The Ocean Blue Note 9 has the more dynamic yellow S Pen for a nice contrast. It writes in yellow digital ink, while the Lavender Purple phone has a purple pen and purple digital ink.",
    "All colors support the same Air Command functionality. You can draw, jot down notes, annotate screenshots, translate foreign text, and send Live Messages (last year's S Pen gimmick), and you can do these actions whether or not the S Pen is charged.",
    "Samsung says the Bluetooth functionality allows for the evolution of the S Pen, but we can’t help wondering if all of this evolution is strictly necessary in this phone.",
    "Shortcuts like snapping selfies remotely can ‘unlock a whole different level of photography’, according to Samsung, and while that sounds useful for dramatic selfies (the example given is laying tired on the couch and taking a hands-free photo), the business-class Note 9 may not be the right audience for that.",
    "It's fun to be able to get both hands in a shot and strike a full-body pose. But we found it hard to rest the phone and snap a selfie when in front of iconic New York City landmarks. Then we thought back to Samsung's examples. They used a tripod for a group shot, and mimed laying on the couch with a dramatic two-handed pose, without actually taking a photo – something that would be difficult without a tripod, too.",
    "Enterprise users will find one use case for the new S Pen: running a PowerPoint presentation without having to fetch and pair a Bluetooth remote. Those things are one-trick ponies, so if an S Pen can replace this for you, that alone may be worth it.",
    "Everyone can benefit from the Galaxy Note 9 screen-off memo feature. It's not a Bluetooth functionality or even new (it appeared on the ill-fated Note 7), but it deserves a mention. Pop the S Pen out of the Note 9 when the screen is off and it'll automatically launch a note-taking interface against a black background.",
    "Screen-off memo allows you to jot down notes without the need to unlock the Note 9 and launch a specific app. It makes noting taking much quicker and easier, and while it may be a simple offering we've used it frequently.",
    "We're thankful that all screen-off memos save automatically, but we found a bug (or at least an oversight) with the yellow ink exclusive to the Blue Ocean phone: our notes look fine against the black lock screen background, but save to S Notes, which uses a white background when you open up the app and retrieve your notes, and the text is hard to make out – black would be a lot clearer here.",
    "Samsung Galaxy Note 9 S Pen hands-on gallery"
  ],
  "headers": {
    "13": "Samsung Galaxy Note 9 release date and price",
    "21": "New S Pen magic tricks"
  },
  "links": {
    "Samsung Galaxy Note 10": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs",
    "Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs",
    "Samsung Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Note 8": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Galaxy S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Google Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Samsung Galaxy Note 8": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review"
  }
}