{
  "source": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
  "title": "Google Pixel 3a XL review",
  "category": "phones",
  "updated": "2019-10-17T09:16:26Z",
  "author": "james-peckham",
  "summary": "A cheaper way to get a large Pixel",
  "verdict": "Its design may not be head-turning, but the Google Pixel 3a XL packs a punch internally and has a great camera for the price. It's some of the best of Google in a phone, at a lower price tag than previous Pixel handsets. You won’t get the best processing power or lots of storage, but when you’re paying a lot less that shouldn’t be so much of an issue.",
  "pros": [
    "Headphone jack returns",
    "Fantastic camera",
    "Slick, stock Android"
  ],
  "cons": [
    "Limited storage",
    "Not fully premium design",
    "Not waterproof"
  ],
  "article": [
    "The Google Pixel 3a XL is the larger sibling to the new Google Pixel 3a, and was announced alongside it at Google IO 2019. Both phones offer Google's core experiences at a more affordable price, and each offers an interesting alternative to the original Pixel 3 or Pixel 3 XL.",
    "At the heart of the two new Pixel handsets are the camera experience, access to Google's suite of apps and voice assistant, and the latest software and security updates guaranteed for three years.",
    "In short though, the reason the Google Pixel 3a XL and 3a exist is to make the Pixel range accessible to more people by lowering the entry-level price.",
    "They are far more affordable than Google's newest XL handset, the Pixel 4 XL, so if you're looking for a big Pixel phone, you're in the right place. However the Pixel 4 XL will likely show us some key features of the anticipated (though not confirmed) Pixel 4a XL, so it's worth checking out.",
    "As smartphones get increasingly expensive, it’s interesting to see Google undercut itself here, with a more affordable phone that still has the camera prowess of one of the best smartphones for photography on the market.",
    "You can buy the Google Pixel 3a XL now around the world, including in the US, UK and Australia. The phone was launched on May 7 2019.",
    "As for the Google Pixel 3a XL price, it's set at $479 / £469 / AU$799, which is much cheaper than the $899 (£869, AU$1,349) launch price of the Pixel 3 XL, although that phone can now be picked up for $720 (around £620, AU$1,080) at some retailers, narrowing the price gap.",
    "The Pixel 3a XL price puts it up against phones including the OnePlus 6T, OnePlus 7, Honor 20, Honor View 20, Xiaomi Mi Mix 3 and Oppo RX17 Pro – so there’s plenty of competition vying for the attention of price-savvy consumers.",
    "In the UK, you’re able to buy the Google Pixel 3a XL from the Google Store, Carphone Warehouse, EE, Argos, Mobile Phones Direct and A1 Comms, among other retailers.",
    "When you first look at the Pixel 3a XL you may find it difficult to spot any differences between it and the Pixel 3 XL. There is, however, one clear design difference between the two XL handsets, as the Pixel 3a XL doesn’t have a notch at the top of its screen.",
    "Instead you get a small block of bezel above and below the screen, for an aesthetic that matches the smaller Pixel 3. It’s a familiar look, but also one that’s increasingly rare on new phones as all-screen displays with notches or punch-holes become the norm.",
    "We think it looks understated, and it shouldn’t really be an issue if you’re not looking specifically for a notch. You don’t get as much screen here as you would on a device with a notch, but we quite enjoy the overall look.",
    "Flip the Pixel 3a XL over and you’ll find a rear design which differs from the flagship pair in just one respect: there’s no hole for the spectral and flicker sensor on the Pixel 3a XL between the camera and the flash. That likely means shooting light sources will be more difficult than if you had one.",
    "It’s a minor difference, but for the eagle-eyed among you it’s one of the few ways you’ll be able to tell the new 3a series apart from the 3 series. There is another difference that will give you a stronger clue though – the return of the headphone jack.",
    "While Google has opted not to include the port its recent top-end phones, it’s reinstated if for the 3a series, and it can be found on the top edge of the phone. It’s a welcome inclusion for anyone who wants to use wired headsets.",
    "That headphone jack is also, however, part of the reason you won’t be able to take this phone in the bath and feel confident it’ll survive – there’s no clear water-resistance rating on this phone, and for some that may be an issue.",
    "That said, the Pixel 3 XL isn’t specifically waterproof in Google’s eyes either, so it isn’t exactly a top-end feature that you lose by opting for its ‘a’ counterpart.",
    "The Google Pixel 3a XL is available in three colors: Just Black, Clearly White and the new Purple-ish hues, with the latter being an extremely subtle shade of purple – so much so that you may be hard pushed to tell it’s purple at all, depending on lighting conditions, with it sometimes looking more like off-white.",
    "While on the black version the power/lock key on the right side is the same color as the rest of the phone, the white and purple variants have orange and lime green keys respectively, adding a pleasant splash of color to proceedings.",
    "That was something that stood out to those who noticed the phone when we were using it, and it often earned compliments. It won’t be for everyone, but it’s a nice touch that we enjoyed.",
    "There’s a fingerprint scanner on the rear of the phone that’s easy to hit with your forefinger, providing you with added security both when unlocking your phone and when you use banking apps or pay for something with Google Pay.",
    "That means there’s no in-screen fingerprint scanning tech here, but we didn’t find we missed this feature, which is mostly only available on top-end phones at the moment anyway.",
    "The Google Pixel 3a XL measures 160.1 x 76.1 x 8.2mm, making it taller and thicker than the Pixel 3 XL, which actually has a bigger screen, but smaller bezels.",
    "It sits well in the hand, although the polycarbonate unibody doesn’t feel overly premium, and at 167g it isn’t too heavy. One-handed use is possible, although those with smaller hands will likely find that both are required to comfortably tap away at the screen.",
    "The screen itself is a bright, colorful 6-inch OLED panel with a Full HD+ (2160 x 1080) resolution, 402ppi pixel density and 18:9 aspect ratio.",
    "It may look a little basic compared to phones with notches, but we didn’t mind the more traditional look. In fact, we enjoyed the screen a lot.",
    "Full HD+ is a solid enough resolution to provide good detail no matter what you’re doing, and we found it fine for watching films and cycling through apps. The maximum brightness was also impressive, allowing us to see the phone’s interface clearly even in bright sunlight.",
    "Another nice touch is Google’s always-on display mode, which is available on a variety of Pixel handsets but is well implemented on the Google Pixel 3a XL. You can choose to have the time, date and a variety of other details, including your notifications, displayed on the screen when it’s in sleep mode.",
    "We didn’t find that this noticeably impacted battery life either, so we'd recommend enabling the feature. You’ll also get added extras in this mode – for example the phone listens out for music that’s playing nearby you and will tell you the track at the bottom of the display.",
    "It’s like having Shazam on your phone, but it’s always prepped and ready to recommend that song to you immediately.",
    "One annoyance with the screen is there’s no tap-to-wake function. So while you do have the always-on functionality, you can’t just tap the display to wake the phone properly, and instead you’ll have to use the fingerprint scanner or the power button.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "5": "Google Pixel 3a XL release date and price",
    "9": "Design and display"
  },
  "links": {
    "Google Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Google IO 2019": "https://www.techradar.com/news/google-io-2019-keynote",
    "Pixel 4 XL": "https://www.techradar.com/reviews/google-pixel-4-xl-review",
    "Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review",
    "Honor View 20": "https://www.techradar.com/reviews/honor-view-20-review",
    "Xiaomi Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "Oppo RX17 Pro": "https://www.techradar.com/reviews/oppo-r17-pro"
  }
}