{
  "source": "https://www.techradar.com/reviews/canon-eos-90d",
  "title": "Canon EOS 90D review",
  "category": "cameras",
  "updated": "2020-03-17T23:27:23.700Z",
  "author": "sharmishta-sarkar",
  "summary": "Canon proves that DSLRs still have a place in a mirrorless age",
  "verdict": "If you still prefer DSLRs to mirrorless cameras, there's a lot to like about the Canon EOS 90D – it's a feature-packed DSLR with a high-resolution sensor and speedy, smooth performance. Its deeper grip, another benefit over mirrorless rivals, makes it comfortable to use for long periods, while the impressive battery life is a boon too. For those who already have Canon glass or are unwilling to make the move to the mirrorless, this snapper is a formidable all-round option.",
  "pros": [
    "High resolution image sensor",
    "Uncropped 4K/30p video",
    "Ergonomic grip",
    "Joystick control"
  ],
  "cons": [
    "No image stabilization",
    "Default JPEG noise reduction level insufficient"
  ],
  "article": [
    "A few years ago, the Canon EOS 80D was one of the best cameras around for anyone who needed a mid-range snapper that could go beyond basic shooting without adding pro-level complexity. In fact, it's still a perfectly solid DSLR even today, but in order to make the series relevant in the age of mirrorless cameras, Canon has built something more modern to fill its considerable shoes. That camera is the Canon EOS 90D, perhaps the last enthusiast-level DSLR the company will ever make.",
    "Launched alongside the Canon EOS M6 Mark II, the 90D plays the traditional strengths of DSLRs – good handling, long battery life, optical viewfinder – but adds some pretty cutting-edge specs. This includes a new sensor that brings a lot more megapixels than the 80D (32.5MP, compared to 24.2MP), which is helpful for cropping images, plus Canon's latest imaging engine.",
    "Like its predecessor, the new camera is user-friendly, with a price tag that's also pocket-friendly – it’s on shelves for $1,199 / £1,210 / AU$1,959 (matching the launch price of the 80D in the US). This makes it a tempting all-rounder for ambitious beginners and experienced enthusiasts who need a camera that can handle a variety of shooting situations.",
    "In short, with the 90D, Canon has proven that DSLRs aren’t quite ready to kick the bucket yet.",
    "At first glance, there’s not much physical difference between the EOS 80D and its successor. The innards, however, are brand-spanking new, with a 32.5MP APS-C CMOS sensor taking centerstage. Historically, the sensor resolution of most APS-C cameras has topped out at about 24MP – meaning the 90D (and the EOS M6 Mark II with the same sensor) offers the highest resolution found in the crop-sensor class of cameras.",
    "The advantage of having this kind of resolution means you’ll be able to capture more details while giving you the flexibility to crop an image during post processing, allowing you to zoom in closer to your subject without compromising image quality. While the higher resolution is a welcome boost, it can result in more noise in images shot at higher ISOs compared to cameras in the same sensor class but lower resolutions. This happens because individual pixels have to be shrunk to fit a higher number of them in a limited space.",
    "However, it’s Canon’s latest Digic 8 image processor that gives the 90D a major performance boost over the 80D and its Digic 6 engine. The latest processor, which has yet to be succeeded in 2019, gives the new snapper the ability to shoot 4K video, where the 80D topped out at just 1080p (aka Full HD) resolution. And, unlike all other Canon cameras, the new EOS R and EOS RP included, video capture uses the entire width of the 90D’s sensor – a long-awaited first for the company. Videos themselves are captured in MP4 file format in either 4K UHD (3840 x 2160) quality to a maximum 30fps, in Full HD (1920 x 1080) at up to 60fps or Standard HD (1280 x 720) at 60fps, and with a maximum duration of 30 minutes.",
    "The Digic 8 processor also ups the ante when it comes to maximum burst speed and native ISO range. The former sees a jump from the 80D’s 7fps to a faster 10fps with continuous autofocus (or 11fps when using Live View), while the 90D has a native ISO range of 100 to 25,600, expandable to 51,200 (unlike the 80D’s native high ISO of 16,000 and maximum expansion value of 25,600).",
    "When it comes to focus points, the new camera shares the 80D’s 45-point cross-type AF system. However, a new 220,000-pixel RGB+IR metering sensor (the 80D has a 7,560-pixel one) adds face detection when using the camera’s viewfinder, and can be called upon for both stills and video. Face Detect is available automatically when using the 90D’s Intelligent Tracking and Recognition Autofocus (iTR AF) feature.",
    "Canon’s superb Dual Pixel CMOS AF is available when using Live View and covers about 100% of the frame vertically and 88% horizontally, with a staggering 5,481 AF points to choose from manually. And what makes this system a pleasure to use is the joystick found on the right of the display, giving greater precision when choosing a focus point. With a working range of -3EV to 18, the camera doesn't quite match the low-light performance of Canon’s full-frame mirrorless cameras, but will work well in all but the most extreme lighting conditions.",
    "Taking a leaf out of the Canon EOS RP’s book, the 90D shares its full-frame mirrorless cousin’s eye detection when using Live View, which can be switched on or off if using Face+Tracking in AF mode.",
    "Also on board, like most modern cameras, is Wi-Fi and Bluetooth connectivity to connect the camera to a smartphone for quick and easy download of images directly to the device for sharing on social media, or for using the phone as a remote shutter release. For wired data transfer to a computer, the 90D uses a USB Type-C connector but it’s the older 2.0 standard. So if you want files to transfer at lightning speed, you’ll need to look elsewhere, perhaps are newer mirrorless snappers like the EOS R, Nikon Z7 or even Fujifilm's X-T3.",
    "The 90D uses the LP-E6N battery found in some of Canon’s other DSLRs and it comes with a CIPA certification (which is the industry standard) of 1,300 shots when using the viewfinder. That means the battery life is a little lower at 450 shots when using Live View (or the rear display), though that's still pretty good compared to most mirrorless cameras.",
    "For those looking for the security of plenty more battery life, Canon offers the BG-E14 grip to be used with the 90D."
  ],
  "headers": {
    "4": "Features"
  },
  "links": {
    "Canon EOS 80D": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/canon-eos-80d-1315060/review",
    "Canon EOS M6 Mark II": "https://www.techradar.com/reviews/canon-eos-m6-mark-ii-review",
    "EOS M6 Mark II": "https://www.techradar.com/reviews/canon-eos-6d-mark-ii-review",
    "EOS R": "https://www.techradar.com/reviews/canon-eos-r-review",
    "EOS RP": "https://www.techradar.com/reviews/canon-eos-rp-review",
    "Nikon Z7": "https://www.techradar.com/reviews/nikon-z7-review",
    "Fujifilm's X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3"
  }
}