{
  "source": "https://www.techradar.com/reviews/dji-ronin-sc",
  "title": "Hands on: DJI Ronin-SC review",
  "category": "cameras",
  "updated": "2019-07-17T12:59:34Z",
  "author": "matt-swider",
  "summary": "The lightweight gimbal your mirrorless cameras has been waiting for",
  "verdict": "The DJI Ronin-SC is like an old-school Hollywood crane that fits into one hand. It's the gimbal for everyone who wants smooth, professional-looking stabilized video from their mirrorless camera and doesn't want to carry around something like the Ronin-S that feels like overkill for today's compact camera. We haven't played with it for very long, but we'll be testing the Ronin-SC against the Zhiyun Crane 2 to see which is easiest to setup and provides the most stabilized video for all of the YouTube vloggers and video creatives out there.",
  "pros": [
    "Like the Ronin-S but smaller",
    "Smooth stabilized tracking shots",
    "3-axis locks make setup easier",
    "Advanced smartphone features"
  ],
  "cons": [
    "Won't fit the Peak Design Capture plate",
    "Hard to put back in the case"
  ],
  "article": [
    "Prepare your mirrorless camera for fluid, old-school Hollywood-crane-like tracking shots. The DJI Ronin-SC, officially announced today, is designed to stabilize video of compact cameras replacing DSLRs and surging in popularity among video creatives.",
    "We got to go hands-on with the Ronin-SC, and it reminded us of a miniature version of its heavy-duty DJI gimbal counterpart, the Ronin-S. The larger version remains a popular choice for commercial-level production (like wedding videographers), while the new SC version is a single-handed gimbal that's smaller, lighter and won't require you to go the the gym to lift it for long periods of time. In short, YouTube vloggers and video creatives will love it.",
    "DJI Ronin-SC is available to order today and DJI says that, like a lot of its products, it's priced competitively compared to what's out there in the market. The base model costs $439 (that's about £354 / AU$626 using direction conversion rates).",
    "There's a Ronin-SC Pro Combo model that costs $539 (about £435 / AU$769), which adds the focus wheel along with the external focus motor and the Remote Start Stop (RSS) Splitter – things you probably want if you're investing in quality video.",
    "To compare, the much smaller DJI Osmo Pocket costs $349 (£329, AU$599), although that palm-sized gimbal comes with a built-in 4K camera. The quality of the Ronin-SC is going to be better – if you invest in a good mirrorless camera of your own.",
    "The Ronin-SC is 41% lighter than the Ronin-S, weighing only 2.4 lbs. (1.09kg). It uses a mix of magnesium, steel, aluminum and composite plastic, and, thankfully, it doesn't feel cheap, according to our hands-on time with it.",
    "DJI has engineered its new gimbal to support a 4.4 lbs. (1.99kg), touting its \"powerful high-grade motors.\" The company said it'll go into more detail about which cameras support the gimbal, given all of the different camera configurations out there. Weight can vary due to lenses and batteries attached.",
    "The Ronin-SC has a built-in battery that offers up to 11 hours of operation, according to DJI, with USB-C onboard to easily recharge the gimbal from the base. That's going to be more than enough for more people, if it truly lasts that long. More tests to come in an updated full DJI Ronin-SC review.",
    "DJI has also incorporated feedback of users from its prior gimbal designs, making the Ronin-SC better than its pro-level counterparts in some ways. For example, it now has 3-axis locks on the pan, tilt and roll axis.",
    "The locks makes it easier to balance the camera when you're setting things up, get ideal single-axis or dual-axis tracking shots when you want to isolate an axis or two, and quickly lift and move the gimbal without the loose camera flopping all over the place. Sometimes you just don't want to break it down.",
    "Also all-new to the Ronin line thanks to the Ronin-SC is Force Mobile and ActiveTrack 3.0. With Force Mobile, we were able to operate the gimbal remotely from a phone – DJI says it'll work at a max distance of 82ft (25m) thanks to a Bluetooth 5.0. That's great for when you're out in the field alone and need to shoot a video.",
    "We even got to toy around with a 1:1 tracking mode that allowed the gimbal to follow the movement of a phone. That's really putting 'the Force' into Force Mobile. And, yes, that's definitely going in our DJI Ronin-SC video review.",
    "ActiveTrack 3.0 tracks subjects using your phone's camera (with an included phone holder mount that fits on top of a mirrorless camera in the hotshoe). DJI says that its algorithms use deep learning and optimized calculations to track human subjects. It has been perfecting its ActiveTrack tech in drones like the DJI Mavic Air, and this seems like more of that technology in its gimbal line.",
    "Returning modes include 360-degree rolls (do a barrel roll!), timelapse, motion lapse (with 10 points of different points in which it can pivot its pathway) and panorama. They give you the best new way to create sweeping vista photo and video shots using your existing mirrorless camera. I've toyed with the tiny DJI Osmo Pocket and its awesome motion lapse capabilities for a few months now, but the Ronin-SC could prove to be next-level with the power of a larger sensor or a mirrorless camera.",
    "\"I love the Ronin-S, but...\" was basically the thought I and every other video creator had when taking the larger gimbal for a spin. The Ronin-SC answers our desire for a more compact, lightweight gimbal, one meant for mirrorless cameras.",
    "The Ronin-S has its place – it's a tempting gimbal that supports big-and-heavy rigs, like the monster-sized Canon 1DX Mark II. But if you have a much more compact mirrorless camera like the Canon EOS M50 or Canon EOS RP, you're carrying gear that's bigger than it really needs to be. Your arms will hate you for owning a gimbal that supports up 8 lbs. (3.6 kg) of weight. This version maxes out at a 4.4 lbs payload, which means vloggers and video creators everywhere will want one.",
    "Outside of our demo time with the Ronin-SC, we haven't been able to fully power up the review model we received simply because DJI is issuing a re-tooled Ronin app today. That means we were able to unbox it, put it together, examine the solid construction of the gimbal and power it up in an uninitialized state. We'll have to wait for the final software to give it a true test against its main competitor, the Zhiyun Crane 2 gimbal."
  ],
  "headers": {
    "2": "DJI Ronin-SC price and release date",
    "5": "DJI Ronion-SC specs and weight",
    "14": "Early verdict"
  },
  "links": {
    "mirrorless camera": "https://www.techradar.com/news/best-mirrorless-camera",
    "Ronin-S": "https://www.techradar.com/news/djis-new-ronin-s-promises-to-deliver-silky-smooth-shake-free-video",
    "DJI Osmo Pocket": "https://www.techradar.com/reviews/dji-osmo-pocket",
    "DJI Mavic Air": "https://www.techradar.com/reviews/dji-mavic-air",
    "awesome motion lapse capabilities": "https://www.instagram.com/p/Bzb_eCIAFMU/",
    "Canon 1DX Mark II": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/canon-eos-1d-x-mk-ii-1314141/review",
    "Canon EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "Canon EOS RP": "https://www.techradar.com/reviews/canon-eos-rp-review"
  }
}