{
  "source": "https://www.techradar.com/reviews/urbanears-pampas",
  "title": "Urbanears Pampas review",
  "category": "audio-visual",
  "updated": "2019-05-08T17:36:09Z",
  "author": "olivia-tambini",
  "summary": "Scandi-chic design for your ears",
  "verdict": "They may look great, but the Urbanears Pampas wireless headphones don’t sound good enough to recommend.",
  "pros": [
    "Chic, minimalist design",
    "Relatively cheap",
    "Intuitive controls"
  ],
  "cons": [
    "Muffled sound",
    "Flimsy feel"
  ],
  "article": [
    "Swedish audio brand Urbanears is known for creating simply-designed headphones in chic colorways, and its latest, the Urbanears Pampas, are no exception.",
    "Its first over-ear model, the Pampas are “designed for extra-long listening sessions” with the convenience of wireless connectivity, 30 hours of battery life, and a fully-collapsible design.",
    "But, do they sound as good as they look? We put the Scandi cans to the test.",
    "The Urbanears Pampas wireless headphones will be available to buy from May 6 for $149 / £130 / AU$259, which puts them at the cheaper end of the price scale, around $50 cheaper than the Audio-Technica ATH-M50xBT. Our current favorites, the Sony WH-1000XM3 are over double the price, but in fairness, they do provide fantastic noise-cancelation, which isn't on offer here.",
    "That doesn’t mean that you can’t get high-performing wireless headphones for a low price though; the Jabra Move Wireless headphones are only $99 / £79 / AU$126, and took a spot in our roundup of the best wireless headphones.",
    "True to Urbanears’ characteristic minimalist aesthetic, the Pampas wireless headphones sport a chic, understated design, with mesh-style fabric covered ear cups and headband.",
    "We tested them out in a cool matte black color scheme, but they also come in beige and dark green.",
    "While the earcups feel soft and generously padded, we found that they felt quite tightly clamped around our head after long listening sessions – and with an impressive 30 hour battery life, you could find yourself using the Pampas wireless headphones for long periods of time.",
    "The ergonomic headband felt comfortable on our head, but slightly flimsy in our hand. This may be due to the headphones’ fully collapsible design, which allows you to stow them snugly away in your bag while not in use.",
    "That collapsible design will likely appeal if you’re looking for a good pair of traveling or commuting headphones that won’t take up lots of space in your luggage, but if you require something a bit sturdier, we’d recommend opting for a non-folding pair of headphones.",
    "On the right outer housing, you’ll find a multipurpose control knob, a USB-C charging port, and a subtle LED that indicates the headphones’ battery status.",
    "On the left housing, there’s a 3.5mm jack – but Urbanears don’t provide you with an AUX cable in the box. This input is actually designed to let you share music with a friend by plugging in their headphones to yours; you can then stream your music from your device over Bluetooth, and they should be able to hear it in their own headphones.",
    "It's nice touch if you often travel with a partner but don’t want to buy a headphone splitter, although we would've expected Urbanears to include at least one AUX cable in the box in case you'd like to listen with a wired connection.",
    "One of our favorite things about these headphones is how well they function, thanks to the control knob that can be used to control your music playback.",
    "The controls generally feel really intuitive; you can push the knob up and down to change the volume and push it right and left to skip forwards and backwards.",
    "If you hold the control knob down while pushing it to the right or left, you can also fast forward or rewind your music, which is an unusual, but welcome feature of these headphones. We saw the same controls in the company's previous wireless model, the Urbanears Plattan 2, so we're pleased to see them make a return.",
    "Pairing the Pampas headphones with our device was totally seamless, and we didn’t experience any connection dropouts while testing them. You can also handle calls and activate Siri – as long as you’re paired with an iOS device.",
    "Now onto the audio performance; overall, these headphones provide a decent level of volume – but audiophile headphones, they are not. We listened to The Fat White Family’s new single Feet, and felt that the overall sound was very muffled, with sibilant treble frequencies, muddy bass lines, and recessed mids.",
    "Listening to the same track with the ATH-M50xBT for example, is a completely different story.",
    "In comparison, the Pampas’ sound somewhat boxy, as though you have your hands cupped over you ears as you listen. The presentation also sounds quite subdued, and they certainly aren’t as lively as the Audio-Technica model.",
    "This is to be expected, considering the Pampas’ contain smaller drivers, which displace less air, than the ATH-M50xBTs, and therefore are less bass-heavy. Whether you consider this to be a positive or a negative largely depends on the kind of music you listen to; if you’re into your hip hop, R&B, and electronica, you’ll probably want headphones that can do fuzzy sub-bass riffs justice without overpowering the mid and treble frequencies.",
    "With that in mind, we tried the Pampas’ out on something less bass-heavy: Bon Iver’s For Emma. We found that these headphones fared far better with acoustic sound, and we liked their warm, textural presentation of the strummed guitar in this track, as well as the smooth sound of Justin Vernon’s falsetto vocals.",
    "That boxy feeling is still there, but without heavy bass lines, the soundstage doesn’t feel too narrow to be enjoyable – it’s just a shame that they don’t perform as well with other music genres.",
    "There’s a lot we liked about the Urbanears Pampas: they look good, they work well, and they’re relatively cheap compared to other over-ear headphones on the market.",
    "However, with an underwhelming level of sound quality, we can’t recommend that you buy them over audiophile headphones like the Audio-Technica ATH-M50xBT – they just don’t measure up in terms of audio prowess, and we think it’s worth spending a bit more for superior sound.",
    "Still, they could still be worth a look if you need a pair of headphones for commuting that you can stow away safely in your bag, thanks to that fully collapsible design and impressive 30-hour battery life – and if you mainly listen to acoustic music, you may even find the audio quality to be sufficient."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "13": "Performance",
    "23": "Final verdict"
  },
  "links": {
    "Audio-Technica ATH-M50xBT": "https://www.techradar.com/reviews/audio-technica-ath-m50xbt-headphones",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Jabra Move Wireless": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/jabra-move-wireless-1285962/review",
    "best wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Urbanears Plattan 2": "https://www.techradar.com/reviews/urbanears-plattan-2-bluetooth-headphones"
  }
}