{
  "source": "https://www.techradar.com/reviews/luigis-mansion-3",
  "title": "Hands on: Luigi's Mansion 3 review",
  "category": "gaming",
  "updated": "2019-08-21T14:25:16Z",
  "author": "vic-hood",
  "summary": "Hotel hell",
  "verdict": "Luigi's Mansion 3 is a light-hearted romp that sees the shadowed Mario brother step into the spotlight. It's the perfect title for those who want some wholesome fun at home or on-the-go.",
  "pros": [
    "Slick new combat moves",
    "Plenty of rooms to explore",
    "Good, wholesome fun"
  ],
  "cons": [
    "Not for those who want a serious challenge"
  ],
  "article": [
    "It's been six years since we've seen a new addition to the Luigi's Mansion franchise, so when Nintendo revealed last year that Luigi's Mansion 3 was coming to Nintendo Switch it was very welcome news indeed.",
    "While it's been a long wait, and we were beginning to give up hope, we now know that Luigi's Mansion 3 will officially release for the Switch on the suitably spooky date of October 31, 2019 – Halloween.",
    "We got our hands on Luigi's Mansion 3 for around 15 minutes at Gamescom 2019. It may not have been long, but it was enough to give us a taste of what the game has in store for us later this year.",
    "The premise of Luigi's Mansion 3 is pretty straightforward: anxious Luigi and his pals check into a hotel for a nice break away from maiming goombas, but it turns out the hotel isn't quite as described in the brochure. Things take a dark turn, and Luigi's pals disappear, so it's obviously your job (as the jumpy green plumber) to wander around the creepy hotel, fight off the ghostly residents and find Mario and co.",
    "Simple? Well, it probably would be more so if Luigi had packed some sort of badass ghostbusting technology to put those ghouls back in the ground. Instead, in classic Luigi fashion, you only have your trusty Poltergust vacuum cleaner to stun and suck up enemies. But Luigi's got a brand-new bag this time, and by bag we mean vacuum cleaner: the Poltergust G-00.",
    "This new and improved ghost-sucking device not only stuns enemies and sucks them up, but also has the ability to fire plungers and use jet propulsion to increase jumping. These plungers come in handy for opening secret doors and solving puzzles. The rope which hangs off the end of the plunger can be sucked up with the Poltergust, allowing you to pull objects when needed. For example, we stuck a plunger to some barrels in the basement and used our suction to pull them off their perch, breaking them and revealing a hidden key (plus some rats).",
    "Alongside a new Poltergust, Luigi also has some slick new moves. Slam allows you to slam ghosts you're sucking up on the floor like a frustrated toddler, while burst causes an air pressure group attack – giving you a bit of space when the ghoulies are getting a bit close for comfort. But the best new feature is definitely the aptly named Gooigi, a green flubber-like version of Luigi who can slip through bars and wander over spikes without damage – just don't expose him to water.",
    "Gooigi is key to solving many of the hotel's puzzles, with a simple click of the right toggle allowing you to seamlessly change between Luigi and his gooey companion. We played solo, but if you play with a friend then they can take control of the slippery sidekick.",
    "It's worth noting that the hotel is pretty big – the Hilton of haunted hotels – so there are lots of rooms to explore, and a few secrets too. During our playtime we wandered through the lobby, wine cellar and a few dungeons, among other destinations, and that was only in 15 minutes; Nintendo has previously shown footage of a greenhouse, a film studio, and even a theater stage. Like we said, it's a big hotel.",
    "Each room is simply but beautifully crafted, with the kooky Nintendo nature that means Luig's Mansion, while a spooky game in terms of its premise, is just a fun-filled family game.",
    "Luigi's Mansion seems to have truly found its home on the Switch – it's just the kind of light-hearted romp the hybrid console was made for.",
    "While more content and features have been added to modernize the franchise, the heart of Luigi's Mansion remains the same, and it's a pleasure to see Mario's often-overlooked brother stepping into the limelight."
  ],
  "headers": {
    "3": "Hotel from hell",
    "10": "Early verdict"
  },
  "links": {
    "Luigi's Mansion 3": "https://www.techradar.com/news/luigis-mansion-3-release-date",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Gamescom 2019": "https://www.techradar.com/news/gamescom-2019-schedule-date-predictions-news-and-rumors"
  }
}