{
  "source": "https://www.techradar.com/reviews/wilko-4l-air-fryer-review",
  "title": "Wilko 4L air fryer review",
  "category": "appliances",
  "updated": "2019-10-30T13:31:16Z",
  "author": "vicky-woollaston",
  "summary": "Wilko proves great-tasting food on a budget is possible",
  "verdict": "Wilko’s air fryer proves you don’t need to pay over the odds for attractive kitchen appliances that consistently make great food.",
  "pros": [
    "Easy to use",
    "Bargain price",
    "Makes great-tasting chips"
  ],
  "cons": [
    "Loud fan",
    "Gets hot to the touch",
    "Low cooking times"
  ],
  "article": [
    "Wilko has emerged as an unsung hero in the world of kitchen appliances. Its slow cooker is superb, its blender ranks highly and now its air fryer has cemented this status.",
    "What’s even more impressive is that the UK high-street brand does all this at a bargain price. Read on for our full review of the Wilko 4L air fryer.",
    "At just £40 (about $50), the Wilko 4L air fryer outperforms rival models almost eight times the price. It looks the part and creates hassle-free, crispy and delicious food that rivals even far more expensive competition.",
    "Air fryers, generally, are not the most attractive of kitchen appliances. They’re effectively mini ovens so to house the controls, the fans, and enough capacity to cook meals for your family, they need to err on the chunky side. That said, many take this to the extreme. Thankfully, Wilko is an exception.",
    "Its compact shape houses a 4L bowl with removable basket below two black control dials that come with a chrome-style finish. The top dial controls the time, the bottom dial sets the temperature up to a maximum of 200 degrees Celsius. There are then two LEDs – the left-hand light to tell you it’s on and a “Heating” light on the right-hand side that lets you know when the air fryer is at the correct temperature. You’d be surprised how few air dryers have this latter, highly useful feature.",
    "Because Wilko’s air fryer uses manual, rather than digital controls, it doesn’t need internal space or the mechanics for a display, and this cuts down its size. It also means it’s an absolute doddle to use, with its controls resembling the dials on a regular oven and labelled as such.",
    "The downside to these manual controls is that the WIlko air fryer doesn’t come with pre-programmed settings like the majority of its rivals. It doesn’t make it any less versatile, it just requires setting the temperature and time manually, but it is worth noting. As is the fact its timer maxes out at 30 minutes, while the standard is an hour. This isn’t an issue when cooking chips, individual portions of meat, and cakes, yet if you’re using it to roast a small chicken, you will need to remember to reset the time halfway through.",
    "Chips are the go-to food item for cooking in an air fryer but the appliance can be used to bake, roast and cook just about anything you can make in a regular oven, space permitting. We tested the Wilko air fryer with chips as well as chicken wings and could barely fault its performance.",
    "The chips were crispy on the outside, fluffy in the center and tasty. Some air fryers sacrifice this fluffy center to make sure the skin has bite, yet Wilko managed to tick both boxes. This was despite the basket being full and without us shaking the basket mid-fry. The vast amount of chips were consistently cooked proving the heat is evenly distributed. Its chicken wings equally had a crispy skin with a decent bite without overly drying out the meat.",
    "The timer ticks, akin to the sound of an egg timer, as the air fryer’s cooking time counts down and a bell sounds when the cooking has finished. There’s something reassuring and familiar about the two sounds, and they’re less jarring than the repetitive beeping of its rivals.",
    "The design of the air fryer means you can’t see inside it while it’s cooking; you’d have to expose the bowl/basket to cold air to check on your food, but this is a minor inconvenience if you’re only opening it briefly. It’s also not the quietest of air fryers and has a tendency to get hot to the touch during cooking so is worth keeping out of reach of children.",
    "Wilko’s air fryer isn’t perfect, but it comes close. Plus, at this price the sacrifices you make for the short timer and how hot it gets during cooking almost pale into insignificance. Some people will prefer digital controls, but if you can get past that, you’ll get a space-saving, attractive, and easy-to-use air fryer that consistently makes great-tasting food."
  ],
  "headers": {
    "2": "Price and availability",
    "3": "Design",
    "7": "Performance",
    "11": "Verdict"
  },
  "links": {}
}