{
  "source": "https://www.techradar.com/reviews/tefal-actifry-genius-xl-review",
  "title": "Tefal ActiFry Genius XL review",
  "category": "appliances",
  "updated": "2021-12-02T14:40:31Z",
  "author": "vicky-woollaston",
  "summary": "Great tasting food comes at a price",
  "verdict": "Tefal’s ActiFry is large, loud and expensive machine but its superb cooking skills largely outweigh these negatives.",
  "pros": [
    "Makes delicious, evenly cooked food",
    "Easy to use controls",
    "Wide range of settings"
  ],
  "cons": [
    "Large, bulky design",
    "Loud fan",
    "Expensive"
  ],
  "article": [
    "Breaking the mould in terms of design, when compared to the majority of air fryers on the market, the Tefal ActiFry Genius XL is shorter, and deeper than these rivals. It comes with a paddle, a 3.5L bowl design, as well as a “window” that lets you peer at your food as it cooks.",
    "This design means food is evenly cooked and tastes great, and its controls are surprisingly easy to use despite looking complicated due to the wide range of options on offer.",
    "Sadly, this shape means it's not well suited to small kitchens and the paddle design means you end up sacrificing some of the health benefits of using an air fryer for better-tasting food.",
    "Overall, the Tefal ActiFry Genius XL is a mixed bag. It offers a number of pros, but is let down by almost as many cons, while costing more than many of its competitors. Its appeal, or not, will be based on what you want an air fryer to do.",
    "The Tefal ActiFry Genius XL has an RRP of £269.99 (about $350), but can now regularly be picked up for closer to £180 ($230).",
    "It's much more tempting at that lower price, and its wide range of functionality helps to justify that cost. However, you can get similar cooking results from products a fraction of that price – just take a look at the Wilko 4L Air Fryer, for instance.",
    "Air fryers largely look the same; a detachable bowl – often with a separate basket that sits inside – hides in a tall, round design below either a set of manual or digital controls. Not Tefal’s ActiFry, though. It swaps this traditional shape for a flatter, deeper one. It does away with the basket, instead adding a paddle, and its digital controls sit at the rear of the fryer, rather than the top.",
    "The major drawback to this is that the Tefal ActiFry Genius XL takes up a fair amount of worktop space. It can’t be easily tucked into a corner, or a cupboard, and this is made worse by the fact the large lid lifts up, meaning you can’t have anything above it.",
    "Its plastic design and curved edges aren’t particularly stylish, either, making the Tefal ActiFry Genius XL look cheaper than its expensive price tag.",
    "A pro is that it comes with a “window” that lets you check on your food without opening the fryer and letting in cold air. Chips are programmed to take 25 minutes at 200-degrees Celsius but we’ve found thinner fries cook much quicker. This window lets us check their progress and remove them before they get too crispy and overcooked. This bowl’s 3.5L size is also more than adequate to cook chips or meat for a family of four.",
    "Elsewhere, Tefal’s bowl and paddle means food is cooked evenly, being rotated slowly through blasts of hot air. Although this mechanism makes the ActiFry a disappointingly loud machine.",
    "We’ve tested a fair number of air fryers – see our best air fryer group test for more details – and none have been able to compete with Tefal’s Actfiry Genius XL when it comes to the quality of the food it produces.",
    "The chips taste so good, and have such a great texture, we could have been convinced they were from a chip shop or fried in fat. The skin was crispy and flavourful, without being overcooked, and the potato inside was soft and fluffy. Similarly, we cooked a batch of chicken wings marinated in Chinese five spice and we couldn’t fault them. The meat was extremely moist and succulent, while the skin on every wing was crispy and retained loads of flavour.",
    "This is due to Tefal’s paddle and bowl design. Aerated basket air fryers use fans to blast food with hot air from a number of angles. This can cause chips in the centre of a fryer, for example, to cook differently than the chips on the outside and typically results in you having to open the fryer and give the basket a shake to ensure consistency, letting cold air in, in the process.",
    "Tefal’s paddle, instead, slowly moves the food through the blasts of hot air, ensuring that every side is cooked as evenly as possible.",
    "The bowl design additionally means that any fat or juices that come out of the food remain in contact with it, rather than being funnelled away like on basket dryers. This fat retains the taste but does mean the Tefal ActiFry Genius XL is less healthy than its rivals. Of course, both bowl and basket air fryers are much healthier than deep-fat frying, but it’s worth noting.",
    "Beyond its cooking performance, the Tefal ActiFry Genius XL is surprisingly simple to use, despite offering nine pre-programmed settings. The digital controls are well labelled and are intuitive. It also offers the highest temperature of any air fryer we’ve tested, at 210-degrees Celsius; and comes with an hour-long timer.",
    "If you’re not restricted by budget and making delicious food is the reason you’re in the market for an air fryer, the Tefal ActiFry Genius XL is a great buy. It helps if you’ve also got a large kitchen to accommodate it.",
    "If you can’t stretch to its high price tag, but still want good-tasting food/are less interested in the full health benefits promised by air fryers, Tefal’s smaller, original ActiFry air fryer is almost half the price and slightly more compact, but features the same paddle design and fan technology."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "11": "Performance",
    "17": "Verdict"
  },
  "links": {
    "Wilko 4L Air Fryer": "https://www.techradar.com/reviews/wilko-4l-air-fryer-review",
    "best air fryer group test": "https://www.techradar.com/news/best-air-fryer"
  }
}