{
  "source": "https://www.techradar.com/reviews/liquid-planner",
  "title": "Liquid Planner review",
  "category": "computing",
  "updated": "2019-11-28T12:16:15Z",
  "author": "michael-graw",
  "summary": "A complex task management tool with resource-workload reporting",
  "verdict": "Liquid Planner is a versatile project management platform for large businesses. It’s expensive and complex but offers helpful tools for redistributing work among team members.",
  "pros": [
    "Gantt charts with “baseline” view",
    "Resource-workload reports for task allocation",
    "Plenty of custom fields for tasks"
  ],
  "cons": [
    "Expensive with five-user minimum",
    "Interface is complicated and slightly outdated",
    "App integration can be complicated"
  ],
  "article": [
    "Liquid Planner is extremely powerful project management software for large businesses with a lot of team members. The platform has everything teams need to track projects, but it also goes one step further by helping organizations to manage their human resources. In particular, Liquid Planner reports make it easy to see how to optimally shift workloads around when a new project comes online.",
    "The software is primarily suited for medium-to-large organizations. It’s a complex platform that takes a lot of time to learn, and plans are very expensive.",
    "Liquid Planner offers two pricing tiers, each with a five-user minimum and annual subscriptions only.",
    "A Professional plan costs $540 per person per year and includes up to 2,000 active tasks, 100 GB of document storage, 20 custom fields, and 100 clients. However, this plan does not come with the ability to record billable vs. non-billable time or workload reports.",
    "The Enterprise plan costs $828 per user per year and includes all of Liquid Planner’s features. In addition, your team can have an unlimited number of active tasks, external dashboards, and clients, as well as up to 50 custom fields.",
    "These plan prices are steep compared to competing project management software. But, the resource allocation functions of Liquid Planner are much more robust than what you’ll find in other platforms.",
    "Liquid Planner has an extremely rich feature set that helps to justify the high cost of this platform for larger businesses.",
    "Liquid Planner offers a few different ways to look at projects and tasks. The default view is a Gantt chart, although kanban cards are also included. One of the useful features built into the Gantt charts is a “baseline view,” which allows managers to compare a project’s actual task completion timeline to the original estimated timeline. This makes it relatively easy to see when and why a project moves ahead of or behind schedule.",
    "Tasks themselves are very full-featured. It’s simple to add team members as well as deadlines and milestones. Plus, custom fields allow for plenty of leeway in defining the properties that matter for your business’s workflows. The only shortcoming is that you can’t add sub-tasks in Liquid Planner—checklists let you keep track of sub-tasks, but don’t support deadlines or specific team member assignments.",
    "What sets Liquid Planner apart is its built-in functionality for managing users’ time. Employees can input vacation right into the software, and Liquid Planner offers report views to help managers view what tasks will be affected while team members are away. This function is particularly helpful when a new one-off task comes in and a team member is pulled away from an existing project. The software will help you identify which employees have a similar skill set and aren’t tied up on existing tasks.",
    "One nice outcome of Liquid Planner’s resource management tools is that it becomes easy for teams to predict how long projects will take. Users can input the minimum and maximum amounts of time they expect a task to take, and the system will track how long it actually takes. Of course, this same time-tracking tool can be used for billing clients and tracking productivity among employees.",
    "All of these functions are tied into a priority system that allows managers to decide what tasks need the most resources. Liquid Planner will automatically adjust project time estimates when task priorities are shifted around, as well as help managers identify which employees are being overloaded with work.",
    "Unfortunately, Liquid Planner doesn’t make it particularly simple to integrate your company’s other business software tools. The platform can automatically import data from calendar apps and attachments from cloud storage services. But, integrating with sales and marketing tools like Salesforce and Zendesk is a lengthy and complicated process.",
    "Liquid Planner’s interface is a little bit dated compared to other project management software. There are a lot of menus, which makes it tricky to navigate the platform at first. In addition, a lot of the text is difficult to read without magnifying your screen resolution.",
    "Getting started with Liquid Planner is also something of a commitment. It takes a while to set up custom fields for your business, and the sheer number of display options for custom dashboards can be a little overwhelming. Figuring out how to best use the resource-workload reporting for your team is also a bit of a trial-and-error process.",
    "The other downside to Liquid Planner is that reports are relatively inflexible, especially compared to the versatility available in the rest of the platform. This is problematic if the default task completion and resource allocation reports don’t work for you, since it’s hard for managers to drill down into the details needed to make decisions without these reports.",
    "Thankfully, the team behind Liquid Planner recognizes that its product requires a steep learning curve. All businesses with 10 users or more get two free setup consultations as part of their plan. In addition, Liquid Planner’s website has a massive trove of documentation videos that walk managers through everything from getting started to advanced customization and app integration.",
    "If you need help with something after setup, Liquid Planner’s customer service team is available Monday to Friday by email, phone, or live chat.",
    "The high price of Liquid Planner somewhat limits it to use by large companies with big budgets for project management. Zoho Projects and Workfront are both less expensive and offer a much wider range of app integrations. However, you’ll lose out on the resource management features of Liquid Planner with most other project management tools.",
    "Liquid Planner is a very adaptable project management platform with a focus on helping your business manage employee workloads. The software is difficult to get started with, but it offers a ton of power for optimally distributing work across multiple projects and large teams. Unfortunately, Liquid Planner doesn’t come cheap, so it’s best suited for bigger organizations that can take advantage of the task reallocation features."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "6": "Features",
    "7": "Task Management",
    "9": "Resource Management",
    "12": "App Integrations",
    "13": "Interface and In Use",
    "16": "Support",
    "18": "The Competition",
    "19": "Final Verdict"
  },
  "links": {
    "project management software": "https://www.techradar.com/best/best-project-management-software",
    "Zoho Projects": "https://www.techradar.com/reviews/zoho-projects",
    "Workfront": "https://www.techradar.com/reviews/workfront"
  }
}