{
  "source": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
  "title": "Philips Hue review",
  "category": "reviews",
  "updated": "2021-01-11T09:07:37Z",
  "author": "jon-porter",
  "summary": "Smart lighting that connects to more than just your phone",
  "verdict": "The Philips Hue lighting range has evolved into a formidable presence in the smart home scene. All these models mean that it's possible to completely overhaul your entire lighting system to make it internet connected. The single biggest issue, however, is cost: individual bulbs are pricey, and that's before you start factoring in the switches. Still, if you're prepared to fully invest, there are few other smart home gadgets that feel as convenient as Philips Hue's light bulbs, lamps and switches.",
  "pros": [
    "Easy to set up",
    "Streamlined app experience",
    "Good integration with other services",
    "Decent automation options"
  ],
  "cons": [
    "Very expensive",
    "Reliance on phone can be annoying without switches"
  ],
  "article": [
    "Many of us now have smart homes. Or at least smarter homes. Whether that means we've got an Amazon Echo smart speaker in our living room or a connected security system at the door.",
    "Although Amazon is a force to be reckoned with when it comes to smart home tech, there's another brand that immediately comes to mind for us: Philips Hue.",
    "The brand has laser-focused on smart lighting alone. The result? It's created one of the most complete smart lighting systems out there, and it’s one that easily beats much of the smart home competition in terms of its robustness and completeness.",
    "The Philips Hue system isn't perfect. You need a 'hub' for it to work if you're looking at the older models, which makes it pricier than some of the competition. But new products and features are being added consistently to the range – including hub-free Bluetooth versions – and the app is so intuitive we can forgive the steep price tag. Read on for a thorough breakdown of what's on offer below.",
    "Philips Hue has a number of different lighting solutions for your home. So, before we dive into our full Philips Hue review, we thought it best to break down the Philips Hue family so you can see exactly what's on offer.",
    "While not a complete list, we aimed to give you information about the different Philip Hue product lines, rather than individual products (there are loads of them).",
    "The Philips Hue lineup for LED bulbs come in a variety of shapes and sizes for just about any household lighting need. Here, we’ll explain the key varieties of Philips Hue light bulbs, what sizes are available in each type, and what light fixtures they’ll fit in. Also included are non-light bulbs, like switches and lamps.",
    "Philips Hue White",
    "This is Philips’ most basic Hue LED bulb type. All of the Hue White bulbs shine with a warm white light. The color temperature of these light bulbs is not adjustable. However, they do still connect to the Hue Bridge for full wireless control, and their simplicity helps keep the price down.",
    "Philips offers standard size A19 E26 Hue White bulbs with a color temperature of 2700K. It also offers outdoor-ready PAR38 bulbs that can serve as flood lights. The PAR38 bulbs can screw into an E26 light fixture, and have a 3000K color temperature.",
    "Philips Hue White Ambiance",
    "The Philips Hue White Ambiance light bulbs make things a bit more exciting, as all of these bulbs offer a wide range of color temperatures, ranging from a warm 2200K all the way up to 6500K, akin to daylight.",
    "These bulbs can help set a mood, whether you’re trying to wind down with warm lights, or wake up with cool white light. Philips offers the Hue White Ambiance for the E26 and the smaller E12 light socket types, as well as the GU10 lamp sockets. The bulbs themselves also come in a wide variety, from smaller lamp bulbs to standard size bulbs and up to BR30 indoor flood lights to help you brighten up large rooms. In the UK, the bulbs come in standard E27 (screw) and B22 (bayonet) types.",
    "Philips Hue White and Color Ambiance",
    "The party really starts with the Philips Hue White and Color Ambiance bulbs. All of these Philips Hue light bulbs can shine with a broad range from warm white to a cool daylight white, and they also are configurable with 16 million different colors.",
    "In other words, if you have a very specific lighting scheme in mind, these are the ones that can support it. Of course, with the increased functionality comes a higher price tag. Philips offers the Hue and White Color Balance bulbs in the A19, PAR16, and BR30 sizes for E26 fittings; B39 for the E12 fitting; and as a GU10 model. It's also available in E27 (screw) and B22 (bayonet) in the UK.",
    "Philips Hue LightStrip",
    "In addition to Philips’ Hue light bulbs, the company also offers the Hue LightStrip Plus, so you can continue to control the lighting even in places where you can’t install a light fixture or lamp.",
    "The Hue LightStrip comes as an 80-inch main unit, or as 40-inch extensions. The LightStrip supports warm and cool white lights as well as the same 16 million colors of the other Hue White and Color Ambiance lights.",
    "The strip is flexible, and ideal for mounting onto objects in your house to add a touch of style. If 80 inches is too long, the LightStrip has designated sections where it’s safe to cut it shorter, allowing for more customization.",
    "Philips Hue lamps with integrated lights",
    "Not all Philips Hue products require you to have your own lamp or light fixture in place.",
    "Philips sells a wide variety of lights that come bundled with its bulbs, and it also sells specially designed lamps that come with integrated LED lights.",
    "These Hue lamps range from outdoor walkway lights, table lamps, wall and ceiling lights, and hanging suspension lights.",
    "Because these are complete packages, they do cost a fair bit more than standalone bulbs. But, all of them use either Hue White Ambiance or Hue White and Color Ambiance lighting, so you’ll be getting control of color temperature and possibly 16 million color options as well, depending on which product you choose.",
    "Philips Hue filament smart bulbs",
    "For those who like the Philips Hue lighting system but aren't a fan of the clean, minimal designs then you're in luck.",
    "Signify, the company behind Philips Hue, has unveiled a range of bulbs called Filament. Each bulb contains a twisted 'filament' of LEDs, and emits a warm glow harking back to antique bulbs of yesteryear.",
    "These bulbs are intended to give a strictly old-school feel, so you won't be able to adjust the color or temperature of the light. You can, however, control them through the Philips Hue app, Alexa, Google Assistant, Apple Homekit, or any of the Hue system's various switches and sensors.",
    "To get going with a Philips Hue in your home, you’ll need at least one connected light and the Philips Hue bridge, which connects to your router and allows you to communicate with your smart bulbs.",
    "This makes the two bulb and bridge-equipped starter kit ($69.99 / £59.99 / AU$144.95) the cheapest entry point into the range, but you’re forgoing more advanced features such as smart light switches and color-changing bulbs.",
    "For our tests we used the next step up, a three bulb starter kit that included the company’s color-changing bulbs. Despite the fact that this is still a fairly basic kit, this retails for a much more substantial $199.99 (£149.99 / AU$289.99).",
    "Once you’ve bought this starter kit things get a lot cheaper, however, as you only need one bridge to control your whole setup. Additional lights and switches can all be synced with this same bridge as you build up your home system.",
    "If you’re looking to jump into Philips Hue then this color-changing starter kit is probably the best way to do it, since it will allow you to play around with Hue’s more advanced features without investing too heavily in your initial setup.",
    "Outside of this starter kit, you have a huge number of options for how to proceed. You’ve got additional bulbs that are available in a wide variety of different form factors from candle bulbs through to spotlights, lamps and lighting strips.",
    "Philips also sells a couple of different switches, which allow you to control your lighting without getting your phone out of your pocket (although, yes, we appreciate this is something you can already do with your existing lights - we’ll get to that later).",
    "Installation will vary with the complexity of your setup, but we found it to be about as painless a process as it could be.",
    "Once you’ve got the bulbs seated in their fixtures you’ll need to make sure they’re powered on in order for them to be discoverable.",
    "Next, you simply plug the Hue bridge into both power and your router, download the Hue app (available for iOS and Android devices), and wait for it to discover the bulbs in your home. Our setup discovered the bulbs quickly and easily.",
    "Once your bulbs are found you’ll need to assign them to rooms, which allows you to control groups of them much more easily.",
    "With your bulbs assigned to rooms, the setup process is complete and you’ll be able to get stuck in configuring them to your heart’s delight.",
    "The one sticking point here, and it’s a big one, is that you’ll need to leave your bulbs turned on at the wall if you want to be able to control them remotely. Turn them off using your standard light switches, and the bulbs won’t have any power to be able to receive wireless signals.",
    "This proved to be a big problem, as you’ll see from the performance section to come."
  ],
  "headers": {
    "4": "The different Philips Hue bulbs",
    "29": "Setup and installation"
  },
  "links": {
    "Amazon Echo smart speaker": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "connected security system": "https://www.techradar.com/reviews/ring-video-doorbell-2",
    "Filament": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1645800824545419000/https://www2.meethue.com/en-gb/vintage-filament-led-bulbs",
    "iOS": "https://itunes.apple.com/gb/app/philips-hue/id1055281310?mt=8&at=1001lnRX&ct=trd-us-1048714070781674000",
    "Android": "https://play.google.com/store/apps/details?id=com.philips.lighting.hue2&hl=en_GB"
  }
}