{
  "source": "https://www.techradar.com/reviews/iogear-gud3c05-usb-c-docking-station-with-power-delivery",
  "title": "IOGear GUD3C05 USB-C docking station with Power Delivery review",
  "category": "computing",
  "updated": "2019-03-05T19:30:19Z",
  "author": "desire-athow",
  "summary": "A passive docking station with some serious firepower",
  "verdict": "This IOGear docking station has few faults, but the price lets it down. At $155, it is far too expensive for what it offers compared to other (admittedly lesser-known) competitors.",
  "pros": [
    "Smart design",
    "Plenty of ports"
  ],
  "cons": [
    "More expensive than expected",
    "No dedicated power supply unit",
    "Short cable can cause issues"
  ],
  "article": [
    "Docking stations, either connecting via a USB Type-C or a Thunderbolt 3 port, have rapidly become a favorite amongst accessory vendors as businesses and individuals have shifted from desktops to laptops, but still have plenty of legacy wired accessories that need to be connected.",
    "And at the same time, the rise of remote working and home workers means that a growing number of companies have rolled them out to increase productivity.",
    "The IOGear GUD3C05 USB-C docking station ($155 at Amazon) is one of the many models that now come with Power Delivery, a feature that allows true single cable connectivity with compatible laptops.",
    "The GUD3C05 adopts a wedge-shaped profile, the idea being that it will fit underneath your laptop, raising it up by an inch or so. Doing so provides, in theory, a more ergonomic typing angle, as well as improving the flow of air to better cool your laptop.",
    "Metal is the primary material used to build this dock, along with bits of rubber and plastic. At 350.5 x 76.2 x 10.2mm with a weight of 400g, it is relatively portable and since it doesn’t need a power supply, you should be able to use it anywhere.",
    "The choice of a wedge profile means that all ports – bar the 3.5mm headphone/microphone combo jack – are located at the back. And you get plenty of them: there are three USB 3.1 Gen 1 Type-A ports, two USB 3.1 Gen 1 Type-C connectors, one HDMI 1.4, one Mini-DisplayPort, one VGA port, SD and microSD card readers, plus a Gigabit Ethernet port.",
    "The dock connects to any host device via an integrated USB Type-C cable that folds neatly underneath the unit and supports up to 100W of pass-through power. The dock passes a maximum of 85W of power to charge laptops and tablets, as it utilizes 15W of power to operate when connected to a device.",
    "IOGear states that it is compatible with both Windows and Apple products, although it is strongly advised to contact IOGear’s aftersales support to confirm exact compatibility on a case-by-case basis.",
    "Bear in mind that this is a passive docking station so it will not provide enough power for some power-hungry accessories like external displays or hard disk drives; as always, your mileage will vary.",
    "We tried this dock with a laptop, the gorgeous Xiaomi Mi Laptop Air 13.3 and its 65W power supply unit, and didn’t encounter any issues during the brief time we tested it. The dock didn’t warm up too much and the HDMI display we plugged in worked flawlessly.",
    "The only real issue we ran into was the location of the cable connector. Given that it is located on the left-hand side of the docking station, because of its short length, it will naturally lead itself to being plugged in on the left side of a laptop.",
    "And it turns out that the Xiaomi laptop we were using had no Type-C connector on that side, meaning we weren’t able to tuck the docking station neatly underneath the notebook. In this case, the IOGear GUD3C05 is sadly losing one of its unique selling points.",
    "The market is awash with USB Type-C docking stations because of the vanishing number of ports on thin-and-light Ultrabooks, allowing dozens of vendors to tap into this lucrative niche.",
    "The IOGear GUD3C05 costs $155 but doesn’t come with a power supply, relying instead on the host device.",
    "One of the more popular docking stations is the Plugable UD-ULTCDL – it is more expensive at $175 and can only deliver 60W to connected devices, plus it doesn’t have a card reader. It does, however, have a bundled power supply, separate audio ports and a rare DVI output for legacy displays.",
    "AZDome’s docking station is not unlike the IOGear model, hinting at a potential shared OEM partner. They both sport a similar design and feature set (12 ports, wedge profile), except for one important thing – the price. At $114, AZDome is far cheaper.",
    "But an even cheaper 12-in-1 adaptor is the Totu which costs a mere $63. It looks like a metal brick with plenty of connectors on three sides, but it only has one Type-C connector and sports a pair of USB 2.0 connectors, which are okay if you are not using data or communication peripherals.",
    "We have Ultrabooks to thank for allowing docking stations to flourish over time, with these accessories now bristling with connectors – both cutting-edge and legacy – but there’s more.",
    "IOGear’s latest docking station is a great example of what can be achieved once everybody has agreed on a common universal power connector – in this case, USB Type-C. It also highlights another important impact: the downward spiral in prices and the erosion of margins.",
    "Amazon is now awash with passive docking stations that offer similar features to the GUD3C05 which means that while it is an excellent product, it may have a hard time competing with the likes of Totu or AZDome when it comes to sheer value for money.",
    "The only way to keep profit margins at a reasonable level is to come up with new features and innovations, which, to be honest, is difficult with docking stations. Maybe we could see future products with an embedded battery or secondary computer (an Android box, for example), or the enabling of wireless NAS features, or similar."
  ],
  "headers": {
    "3": "Design",
    "8": "In use",
    "12": "Competition",
    "17": "Final verdict"
  },
  "links": {
    "IOGear GUD3C05 USB-C docking station": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FIOGEAR-11-Ports-Docking-Delivery-GUD3C05%2Fdp%2FB07F6CGFXK%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2707092443801401000-20",
    "Xiaomi Mi Laptop Air 13.3": "https://www.techradar.com/reviews/xiaomi-mi-laptop-air-133-2018",
    "IOGear GUD3C05": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FIOGEAR-11-Ports-Docking-Delivery-GUD3C05%2Fdp%2FB07F6CGFXK%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7917266908558998000-20",
    "Plugable UD-ULTCDL": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FPlugable-Charging-Delivery-Specific-Thunderbolt%2Fdp%2FB01FKTZLBS%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1385847487121866800-20",
    "AZDome": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FMulti-Port-Docking-Charging-Ethernet-Chromebook%2Fdp%2FB07DFNVWVB%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2797386412685760500-20",
    "Totu": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07M8HLGBF%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3280285746502945300-20"
  }
}