{
  "source": "https://www.techradar.com/reviews/canon-eos-m50-review",
  "title": "Canon EOS M50 review",
  "category": "cameras",
  "updated": "2021-11-19T18:05:57Z",
  "author": "phil-hall",
  "summary": "Easy to use, but comes with some compromises",
  "verdict": "If you're looking for a mirrorless camera that offers great image quality, is easy to use and has a decent autofocus system, the EOS M50 is a great choice. If you're looking for a more rounded camera with a greater breadth of features and system support, however, there are better options out there.",
  "pros": [
    "Improved Dual Pixel CMOS AF",
    "Polished touchscreen",
    "Excellent EVF",
    "Easy to use",
    "Very good image quality"
  ],
  "cons": [
    "Poor battery life",
    "4K video has a 1.6x crop",
    "Plasticky finish",
    "Lens range still limited"
  ],
  "article": [
    "It might now be over three years old, and have been superseded by a newer model, but the Canon EOS M50 remains a popular mid-range mirrorless camera for those who want something that's fun, approachable and versatile enough for video shooting.",
    "Arguably, it's the EOS M6 Mark II which is the sweet spot in Canon's M-range of mirrorless models, with the M50 (and its successor the M50 II) sitting just below it. But, if you can find the M50 available at a great price - is it still worth considering?",
    "The answer is yes, depending on your budget and shooting preferences. The EOS M50 is considerably cheaper than the EOS M6 Mark II and represents good value for money, particularly for stills shooters. Unlike the flagship model, it has a built-in viewfinder, which is great for shooting photos in all conditions.",
    "Where the EOS M6 Mark II justifies its higher price is with its uncropped 4K video, newer 32.5MP sensor and superior burst shooting. But if you're looking to upgrade from a smartphone or basic compact camera, the EOS M50 remains a good choice, albeit with the same, familiar limitations.",
    "This product will likely be reduced in the Black Friday deals, and we’ll be conducting a re-review in the future. However, there are a few updated references in this review to give you a better clue of how the EOS M50 stands up.",
    "Unlike Canon's mirrorless EOS R series, which have full-frame sensors, the EOS M50 has a smaller APS-C sensor. This isn't a bad thing – it's the same size as the ones you'll find in many of its DSLRs like the Canon EOS Rebel SL3 / EOS 250D and allows the camera to be small while retaining good image quality.",
    "The sensor is a 24.1MP APS-C CMOS affair, with a sensitivity range that runs from ISO100-25,600, which can be expanded to 51,200. The M50 was also the first Canon camera – DSLR, compact or mirrorless – to feature the company's latest DIGIC 8 image processor, although this has since been seen in more recent models like the Canon EOS M6 Mark II.",
    "This allowed the EOS M50 to be the first mirrorless Canon camera that could shoot 4K video (up to 24fps), including the ability to take 4K timelapse footage and pull stills from 4K footage (with files equivalent to 8MP).",
    "That's the good news. The bad news is that footage when captured in 4K doesn't use the entire breadth of the sensor – there's a 1.6x crop. That's a little restrictive for one market Canon is directing the EOS M50 at: vloggers.",
    "The standard 15-45mm lens is equivalent to 24-72mm thanks to the 1.6x crop factor of the APS-C sensor, but then apply a further 1.6x crop for 4K video capture and it becomes equivalent to 38.4-115.2mm – great for tight portraits, but not great for filming at arms length or in a confined space. There is the option to use Canon's EF-M 11-22mm f/4-5.6 IS STM lens, but even at its widest setting, when shooting 4K you'll only have an equivalent field of view of 28mm.",
    "If that's a bit of a let-down, Canon's Dual Pixel CMOS AF system shouldn't be. It's a system that's always impressed when we've tested it on other models, and the addition of the DIGIC 8 processor has enabled Canon to improve AF performance further.",
    "Those improvements include greater coverage of the frame, while there are now 143 AF points at your disposal. There's also Eye AF, which as the name suggests can lock onto a subject's eyes – useful for portraits, and handy for selfies or vlogging (provided you're not shooting 4K).",
    "On the rear of the EOS M50 is a vari-angle touchscreen display that's hinged at the side of the body and can be pulled outwards to face a subject, while it can also be angled through a wide arc of positions to suit pretty much any shooting angle. There's also a built-in electronic viewfinder, with a 2.36 million-dot resolution that appears to equal that of the pricier EOS M5. Neither of these features can be found on the Canon EOS M6 Mark II.",
    "The M50 has a wealth of connectivity options, with Wi-Fi, NFC and Bluetooth Low Energy all present. The latter enables a low-power, constant connection to be maintained between the camera and a smart device for seamless transfer of images.",
    "Another first for a Canon camera was the move to the CR3 14-bit raw file format, while there's also a new C-RAW option, which creates full-resolution raw files while saving approximately 30% to 40% on the size of standard raw files."
  ],
  "headers": {
    "4": "Features"
  },
  "links": {
    "EOS M6 Mark II": "https://www.techradar.com/reviews/canon-eos-m6-mark-ii-review",
    "Black Friday deals,": "https://www.techradar.com/black-friday/black-friday-camera-deals-sales",
    "Canon EOS Rebel SL3 / EOS 250D": "https://www.techradar.com/reviews/canon-eos-rebel-sl3-eos-250d",
    "Canon EOS M6 Mark II": "https://www.techradar.com/reviews/canon-eos-m6-mark-ii-review"
  }
}