{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-tab-s4-review",
  "title": "Samsung Galaxy Tab S4 review",
  "category": "tablets",
  "updated": "2019-12-11T12:36:43Z",
  "author": "matt-swider",
  "summary": "The 2-in-1 promise without the productivity chops",
  "verdict": "The Samsung Galaxy Tab S4 tries to push Android tablets to the next level with 2-in-1 desktop-like software, and while it's what we want to see from even the iPad, the idea doesn't automatically make it the best tablet. It's overpriced, the touchscreen isn't as responsive in Dex mode, and too many apps aren't optimized.",
  "pros": [
    "PC desktop-like Dex interface",
    "Comes with the S Pen stylus",
    "Large 10.5-inch screen"
  ],
  "cons": [
    "Dex touchscreen detection is off",
    "Keyboard design is unintuitive",
    "Expensive for what it delivers"
  ],
  "article": [
    "The Samsung Galaxy Tab S4 is the only Android tablet we'd labeled a true 2-in-1, as it equally serves as a tablet and offers proper laptop-like mobility in 2019. Unfortunately, while it’s here to compete with Apple’s best iPad at productivity, it doesn’t get the job done and costs just as much as the last-gen iPad Pro.",
    "It’s Samsung’s take on the iPad Pro 10.5 (not the higher-end, newer iPad Pro 11 and iPad Pro 12.9), one with a similar 10.5-inch display, S Pen stylus, 64GB of internal storage, and 4GB of RAM – all at the launch price of $650 (£599). There are rare Galaxy Tab S4 deals that make it slightly more attractive.",
    "Bonus points: Samsung includes the S Pen for a better value than the Apple Pencil-less iPad Pro (the Apple Pencil is separate and expensive) and it allows for expandable microSD storage. So far, so good, Samsung.",
    "The other selling point here is the built-in Dex software, which mimics a desktop interface and has second-screen capabilities.",
    "You no longer need additional bulky hardware to switch over to this laptop-like mode, complete with re-sizable windows, task bar and system tray.",
    "Dex feels like much-needed 2-in-1 progress on Android, but a 2-in-1 work-in-progress next to Windows and Chromebook laptops.",
    "This user interface isn’t as touch-friendly, and there’s no track pad on the optional Tab S4 keyboard cover that we found most problematic. You need to bring a Bluetooth mouse and your own keyboard to get any work done.",
    "Good news. The specs lie a little bit: it actually doesn't matter that the tablet is underpowered on paper with an early 2017 chipset that’s easily outpaced by Apple’s laptop-rivaling chip speeds. We’re more concerned with the fact that the price of the tablet increased to match the iPad Pro.",
    "The truth is our biggest issue with all tablets has little to do with stagnant specs and hardware performance. It’s that they’re always confined by restrictive mobile-first apps and interfaces. Samsung Dex tries to make good on that 2-in-1 promise with a real system dock so you can quickly switch between apps like on a laptop.",
    "And the Tab S4 does introduce a lot of good ideas that move tablets in the right direction, toward a more productivity-friendly interface. But that doesn’t make it a good buy next to the Microsoft Surface Go or one of the best Chromebooks at such a high price.",
    "You can buy the Samsung Galaxy Tab S4 in the US, UK and Australia with the Wi-Fi edition being available from a variety of retailers, and the LTE edition on sale from carriers and networks at a slightly higher price.",
    "In the US you can buy the LTE version from Verizon (first to launch), Sprint, and US Cellular (the latter two offered in late 2018).",
    "The Tab S4 with a Wi-Fi connection costs $649.99 (£599, AU$959) through Amazon, Best Buy, and the Samsung Store. The LTE version costs $729.99 (£649, AU$1,179).",
    "Samsung’s best and worst new feature is built-in Dex mode, which transforms the normal Android look into a desktop-like interface.",
    "This means apps are left-aligned (like on a Windows PC), clicking on an app opens re-sizable windows, and there’s an app dock and system tray at the bottom to flip between open apps and configure all sorts of quick settings.",
    "All of this should function okay on the 10.5-inch display, but resizing app windows doesn’t work every time like it should, and we even had trouble closing apps. Touch detection is a bit off, which makes something as simple as tapping the X button in the top right corner a chore.",
    "There’s almost a need for the S Pen or a Bluetooth mouse to properly operate Dex mode, or a reason to learn the unintuitive keyboard shortcuts to resize windows. But then you realize that too many apps shut down randomly, including Google Docs.",
    "Samsung’s core software works fine, but apps as popular (and as standard) as ones from Google should work without crashing. Google Docs crashed 27 times while we wrote this review on the Tab S4.",
    "Hangouts Meet is the worst offender. We’ve taken video meetings in which we’re sideways to everyone else whenever the Tab S4 is in landscape mode and docked on the Book Cover Keyboard. Turning the tablet in order to right ourselves up seemed like the simplest fix, but it turns everyone else sideways on the screen. This is far from productivity software.",
    "Connecting a Bluetooth mouse does help clear things up, but it’s not ideal on a commute or a tight space. Interestingly, the mouse works on both normal Android and in Dex mode.",
    "It’s just that we’re fans of the idea of Dex mode and surfing the web with its Desktop-mode-first Chrome setting. We didn’t feel as productive as we should have due to these design flaws.",
    "The Tab S4 in tablet mode is actually a fine experience for a standalone Android tablet. It’s the moment it docks with an optional Samsung Book Keyboard Cover that things get messy when the the setup looked so promising.",
    "It’s like a Transformer that goes from a robot form to a neat-looking sports car that sputters along.",
    "The keyboard layout is cramped, it isn’t backlit, and it contains unnecessary keys. Flanking the space bar is a dedicated key for changing the keyboard language and another for triggering the on-screen keyboard.",
    "The amount of times we’ve hit the on-screen keyboard while typing the last sentence is two. And there’s are a lot of sentences here. The key gets in the way a lot when you’re drafting an in-depth review.",
    "The Book Keyboard Cover amounts to learning a new keyboard layout for Android, different from a Mac and different from Windows keyboard. It’s a separate purchase, too. You’re paying to be infuriated.",
    "Bringing your own Bluetooth keyboard to the Dex system defeats the purpose of the built-in software, and while a mouse can help you avoid the touchscreen hit detection issues, we’d like to have seen a keyboard trackpad instead.",
    "Samsung includes a tablet-appropriate S Pen (larger than the Note smartphone S Pen), and this one is more rounded and feels more natural to hold than last year’s Tab S3 pen.",
    "There’s a tiny metal protrusion in the middle of the stylus to prevent it from rolling away. There’s also a stylus holster that clips onto Samsung’s keyboard and it requires no charging whatsoever to use.",
    "This contrasts really well with the Apple Pencil, which does require charging, has no holster on the iPad keyboard, and rolls away each and every time we set it on a table.",
    "S Pen functionality is typical of a Samsung tablet or Note phone. You can draw, jot down notes, annotate screenshots, translate text, and new this year (on the tablet at least) is the ability to send Live Messages.",
    "Sadly, the Air Commands (shortcuts to use these features) don’t work in Dex mode."
  ],
  "headers": {
    "10": "Samsung Galaxy Tab S4 price and availability",
    "13": "Samsung Dex, Android and apps",
    "21": "S Pen and Book Keyboard Cover",
    "32": "Need an alternative?"
  },
  "links": {
    "best iPad": "https://www.techradar.com/news/best-tablet",
    "iPad Pro 10.5": "https://www.techradar.com/reviews/ipad-pro-105",
    "iPad Pro 11": "https://www.techradar.com/reviews/ipad-pro-11",
    "iPad Pro 12.9": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "Microsoft Surface Go": "https://www.techradar.com/reviews/microsoft-surface-go",
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Tab S3": "https://www.techradar.com/reviews/samsung-galaxy-tab-s3"
  }
}