{
  "source": "https://www.techradar.com/reviews/razer-blade-pro-17",
  "title": "Razer Blade Pro 17 review",
  "category": "gaming",
  "updated": "2021-02-04T14:25:27Z",
  "author": "matt-hanson",
  "summary": "A gaming laptop and workstation rolled into one",
  "verdict": "The Razer Blade Pro 17 (2019) is another stunning entry from Razer – but while it looks stunning and performs brilliantly, it also comes with an incredibly high price tag.",
  "pros": [
    "Slim design",
    "Fantastic performance",
    "Trackpad back where it belongs",
    "Sort of upgradable"
  ],
  "cons": [
    "Very expensive",
    "No Core i9 version",
    "Short battery life"
  ],
  "article": [
    "The Razer Blade Pro 17 (2019) is the latest flagship gaming laptop from Razer that is powerful enough to also double as a workstation – hence the ‘Pro’ moniker.",
    "We’ve been very impressed with previous models of the Razer Blade Pro, and they have often appeared in our best laptop and best gaming laptop lists, so naturally we have high hopes for the latest version.",
    "Not only has Razer upgraded the internals of this edition of Razer Blade Pro 17, but it’s also given the design a refresh as well. These changes should hopefully result in an even more desirable laptop for both gaming and working on.",
    "Of course, one thing hasn’t changed – and that’s the eye-watering high price.",
    "The Razer Blade Pro 17 (2019), like the Razer Blade Pros before it, is pitched as a premium laptop – so it comes with a (very) premium price tag to match. At $2,499.99 (£2,399.99, AU$4,299) for the base model, this is an incredibly pricey laptop that will be out of many people’s price range.",
    "For that amount of money you get an Intel 9th generation i7-9750H hexa-core processor, Nvidia GeForce RTX 2060 graphics card, 16GB of DDR4 memory and a 512GB PCIe SSD.",
    "While that’s the only model currently available in Australia, in the UK and the US there are two models with upgraded graphics cards.",
    "The first comes with an Nvidia GeForce RTX 2070 with Max-Q design GPU for $2,799.99/£2,679.99. Then, there’s a model with an Nvidia GeForce RTX 2080 Max-Q GPU for $3,199.99/£3,079.99. Otherwise, all specs are the same.",
    "It’s nice that in the US and UK at least you get a choice of GPU – although if you’re already spending that much money on a gaming laptop, you’ll likely want to go all-out with the very best. And, the Nvidia GeForce RTX 2080 is currently the best consumer laptop GPU in the world.",
    "Those prices and specs pitch the Razer Blade Pro 17 (2019) at the same level as the Asus ROG Zephyrus S GX701 and MSI GT75 Titan, two of the best – and most expensive – gaming laptops on the market today.",
    "However, the style and performance level means you could arguably use the Razer Blade Pro 17 (2019) as a desktop replacement for prosumer tasks, such as video and image editing. However, even then, the Razer Blade Pro 17 is more expensive than most. The MacBook Pro (15-inch, mid-2018), for example, is cheaper – though of course it does not come with the gaming capabilities.",
    "If you'd like to stick with the Razer Blade line but want to save a little, there's also the Razer Blade 15 (2019) whose RTX 2060 GPU, 144Hz 1080p display and 512GB SSD configuration will set you back an atrocious $1,999 (£1,899, AU$3,549).",
    "Overall, the price tag will likely determine for many people right away if the Razer Blade Pro 17 (2019) is for them. It also puts even greater pressure on Razer to ensure it makes a product that justifies the huge price tag.",
    "While the new Razer Blade Pro looks similar to its predecessor, there’s a few noticeable differences. First of all, the design has more sharp corners now, rather than the rounded edges of earlier models, which gives it a more business-like and serious look that will appeal to both gamers and non-gamers alike.",
    "Razer has worked hard to ensure that the new Razer Blade Pro 17 is impressively thin and light, and according to the company, the laptop is up to 25% smaller than other 17-inch gaming laptops in its class. At 0.78 x 15.55 x 10.24 inches (19.9 x 395 x 260mm), this is an impressively svelte gaming laptop. It’s the kind of size and form factor you’d expect from premium Ultrabooks, so that fact that it packs powerful gaming hardware – including a discrete GPU – is certainly impressive.",
    "It’s a far cry from the big and bulky designs we often associate with gaming laptops. In fact, there aren't many gaming laptops that can really compete with the Razer Blade Pro 17’s dimensions. Only Asus’ ultra-thin (and ultra-expensive) Asus ROG Zephyrus S GX701 comes close at 0.7 x 15.7 x 10.7 inches (18.7 x 399 x 272mm).",
    "Weight-wise, it tips the scales at 6.06lbs (2.75kg), which is only a tiny bit heavier than the Zephyrus S GX701’s 5.95 pounds (2.7kg).",
    "So, it’s impressively thin and light, but don’t go thinking this is a particularly portable laptop. For a start, that 17-inch screen – though lovely – makes this an unwieldy laptop to carry about, though Razer has kept the bezels that surrounds it to just 6.0mm thick. You’ll also need to take a power adapter with you as well, due to the very short battery life of this thing (more on that later).",
    "Regarding the screen, it’s 1080p with 300 nits of brightness, which means colors are bright and vibrant. It certainly looks fantastic when in use, and even when used in bright environments (such as by a window with the sun streaming in), the screen doesn’t ever appear washed out or difficult to see. It also achieves 100% of the sRGB color gamut, which means colors are accurate.",
    "This is important for anyone looking to use the Razer Blade Pro 17 as a laptop for editing photos or videos on professionally. The fact that it makes your games look even better is a nice bonus.",
    "It also has a high 144Hz refresh rate, so games run impressively smoothly, with no screen tearing.",
    "While the design of the Razer Blade Pro 17 is impressively thin, the laptop still manages to include a decent number of ports. On the left-hand side there’s a proprietary power port (this is a laptop that needs more power than a USB-C charger could provide), along with an Ethernet port, to two USB 3.2 ports, a USB-C 3.2 port and 3.5mm audio port.",
    "On the right-hand side you’ve got an SD card reader, Thunderbolt 3 (USB-C) port, another USB 3.2 port and HDMI 2.0B. This is an excellent selection of ports, and it’s a credit to Razer that it’s included them in such a slimline laptop. Having these ports included without the need of an adapter also puts to shame many other ‘pro’ laptops that claim to be aimed at professionals, but lack the ports that support legacy devices that many people rely on for work. Yes, we’re looking at you Apple.",
    "As ever, we love the fact that the USB ports aren’t colored in the traditional blue, but are bright green, to compliment Razer’s logo and design ethos. It’s a little thing, but it shows how strong Razer’s branding is – and we’re suckers for it.",
    "Unlike earlier models, the 2019 Razer Blade Pro 17's trackpad is positioned in the usual spot underneath the keyboard. Previous Blade Pros had the trackpad to the right-hand side of the keyboard, which took a bit of getting used to. We much prefer the trackpad where it is now, as it makes it easy to quickly use without thinking.",
    "Of course, when gaming you’ll want to use a proper mouse – and as we mentioned earlier, the Razer Blade Pro 17 2019 comes with plenty of USB ports to accommodate that. But for day-to-day tasks, the trackpad works well. It has a glass surface that’s smooth and comfortable to use, and it features Microsoft Precision Touch technology for identifying multi-touch gestures.",
    "As for the keyboard itself, it features large keys that are easy to hit, though their travel is a bit shallow. This means they don’t feel quite as tactile as standard keyboards – especially mechanical ones. However, this is the price you pay for such a slimline laptop.",
    "While the Razer Blade Pro 17’s design has been rather restrained elsewhere compared to other gaming devices, it has shown no such inhibitions with the keyboard, with each key being backlit by LEDs. Using Razer Chroma software, you can configure the keyboard from a selection of 16.8 million colors, and sync up lighting effects with other Razer products. Of course, if you don’t want a mini disco lighting up your fingertips every time you type, you can disable the effects as well.",
    "On either side of the keyboard are Dolby Atmos-enabled speakers, with a power button on the right of the keyboard."
  ],
  "headers": {
    "4": "Price and availability",
    "13": "Design",
    "24": "Keyboard and trackpad"
  },
  "links": {
    "best laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "best gaming laptop lists": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Asus ROG Zephyrus S GX701": "https://www.techradar.com/reviews/asus-rog-zephyrus-s-gx701",
    "MSI GT75 Titan": "https://www.techradar.com/reviews/msi-gt75-titan",
    "MacBook Pro (15-inch, mid-2018)": "https://www.techradar.com/reviews/macbook-pro",
    "Razer Blade 15 (2019)": "https://www.techradar.com/reviews/razer-blade-2019-review"
  }
}