{
  "source": "https://www.techradar.com/reviews/jitterbug-flip",
  "title": "Jitterbug Flip review",
  "category": "phones",
  "updated": "2019-12-10T11:51:41.511Z",
  "author": "mark-pickavance",
  "summary": "Yes, flip phones still exist!",
  "verdict": "For those that don’t want the complications of an iPhone or high-end Android phone and need something to get help in an emergency then Jitterbug Flip ticks all those boxes rather succinctly.",
  "pros": [
    "Recharge lasts for five days",
    "Small and easy to carry",
    "Easy to use interface"
  ],
  "cons": [
    "No internet or email",
    "Lacks 4G LTE",
    "USA only"
  ],
  "article": [
    "If you thought that flip phones stopped being a thing before The Matrix sequels, then we should point out that they’re still popular in parts of Asia.",
    "But they are also a good idea for older people. As they’re small and compact, robust and it isn’t ambiguous as to where you should speak and listen.",
    "Those are undoubtedly some of the good reasons why Greatcall went with a flip phone for their Jitterbug Flip solution. A phone for a call so important that could be a matter of life or death for the person making it.",
    "Jitterbug Flip is available for sale at www.greatcall.com and in retail locations across the USA.",
    "For a list of all retail locations, visit: http://www.greatcall.com/StoreLocator",
    "Like the Jitterbug Smart2, also by Greatcall, the Jitterbug Flip is a repurposed phone design with some minor aesthetic modifications and a more significant interface overhaul.",
    "In this case, the Jitterbug Flip was once an Alcatel OneTouch, that has also been sold as the Alcatel Go for those who got one from Sprint or T-Mobile.",
    "Available in red or graphite, it features two displays, one inside the clamshell and another smaller one on the outside.",
    "The larger of these is 3.2 inches and has a resolution of just 320 x 480 pixels, and the smaller external screen is only 1.44-inch.",
    "As those screen sizes and resolutions suggest, these displays aren’t for reading documents or maps, they’re for large and easy to read options, such as keying in a phone number or reading the time.",
    "The tiny outer display might seem superfluous, but it allows the Flip to double as a bedside clock when it’s on its accompanying charger, and it doesn’t impact negatively on the battery life.",
    "To make or receive a call you simply flip open the phone, and you are ready to talk or dial, it’s very straightforward and somewhat reminiscent of a phone from the ‘feature phone’ era rather than a modern smartphone.",
    "It features very large buttons for the numeric pad, and above them up/down selector and easy to follow ‘Yes/No’ options.",
    "However, inside this is Android and has all the sorts of features you might expect from a phone that first appeared in 2016.",
    "There is a basic 2MP camera with flash, Bluetooth 3.0, headphone jack, Micro USB port for charging and file transfers and 1GB of RAM. Inside there is also a Micro SD card slot to add more storage, but this isn’t mentioned in the manual at all.",
    "The battery capacity is only 1780mAh, but with a very modest processor and small screens that are more than enough to keep the Flip powered for up to five days before it needs to recharge.",
    "Where this product diversifies from the cheap Chinese phone technology is the highly simplified user interface that Greatcall designed for it, and how this is used to access their support services in the event of a problem.",
    "Instead of the usual Android icon pages, the user is presented with a scrolling menu to select one of the features, ideal for those with dexterity limitations.",
    "However, what they didn’t put on the screen in this design is the 5Star button, which is placed directly below the numeric pad and coloured red for easy identification.",
    "Pressing the 5Star button that will connect the owner to the Greatcall expert support team, who can contact friends and family for minor issues or the emergency services for more serious scenarios.",
    "The GPS technology inherent in the phone can relay its geographic locale, so when help arrives they should locate you quickly.",
    "What this phone, in its modified form, doesn’t offer are internet services or email, which might dissuade those older people who are technologically astute from using it.",
    "What’s interesting about the Jitterbug Flip is how many basic features have been tweaked slightly to help those who might have a visual impairment or lack of fine control in their hands.",
    "As we already mentioned, this phone has a rearward-facing camera and a flash.",
    "The camera’s extra feature is that the menu offers a magnifier mode, allowing the phone to be used to read small text or scan for a small dropped item. And, the flash can be used as a flashlight to see in the dark for short periods.",
    "This phone also has one of the loudest speakers we’ve ever heard on a phone, and it supports hearing aids with the highest possible M4/T4 rating.",
    "But, what the phone can do is a sideshow to the service that Greatcall provides through it, and they have plans that start from as little as $19.99 per month.",
    "However, the best value option we’d contest is its Preferred service, that includes Urgent Care and GreatCall Link for $24.99 a month. Urgent Care enables you to speak with a live nurse or a doctor 24/7 and even get a prescription for common medications over the phone, and GreatCall Link enables designated friends, family and caregivers to be immediately informed if you access the 5Star service.",
    "When you sign up for the phone and service, you can even transfer an existing number to the phone to minimise any disruption.",
    "And, should you decide not to continue with the service, the Jitterbug Flip will still work as a phone with a suitable mobile SIM.",
    "The similarities between this and the Jitterbug Smart 2 are obvious and expected, but it also has some of the same limitations in respect of the performance of the technology.",
    "While the Jitterbug Flip doesn’t require an eight-core CPU or the internals of an iPhone 11, it could be dramatically improved with better hardware than the existing platform offers.",
    "Where this is especially true is the mobile phone frequencies it handles, as it doesn’t support 4G LTE, a technology offers inherently more accurate positional information based on cell communication.",
    "Alcatel has newer Cingular Flip 2 and Quickflip designs that fit that criteria, so perhaps it is time for one of them to become the Jitterbug Flip 2?",
    "What the low specification does allow is for the device to be relatively cheap, although the originating Alcatel Go can be found for a third of the $74.99 that Greatcall is asking for this device.",
    "What the Jitterbug Flip does best is provide a simple means to access the Greatcall support system for seniors who need it, and it does that job adequately and affordably.",
    "But, we think the era of simplified technology for seniors is coming to an end, and in the next few years, even the elderly will want something with more sophistication than this."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "22": "In use",
    "30": "Final verdict"
  },
  "links": {
    "www.greatcall.com": "www.greatcall.com",
    "http://www.greatcall.com/StoreLocator": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3570760501879029000&xs=1&url=http%3A%2F%2Fwww.greatcall.com%2FStoreLocator&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fjitterbug-flip",
    "Jitterbug Smart2": "https://www.techradar.com/reviews/jitterbug-smart2",
    "Jitterbug Smart 2": "https://www.techradar.com/reviews/jitterbug-smart2"
  }
}