{
  "source": "https://www.techradar.com/reviews/corelcad-2019",
  "title": "CorelCAD 2019 review",
  "category": "computing",
  "updated": "2019-10-11T15:30:17Z",
  "author": "steve-paris",
  "summary": "Create 2D and 3D designs with ease",
  "verdict": "Great new additions and improvements to the interface make this app better and more compatible than before.",
  "pros": [
    "Fast and responsive",
    "Multi-platform",
    "Great new features",
    "Flexible ownership options"
  ],
  "cons": [
    "Not an app to take lightly"
  ],
  "article": [
    "Corel is generally better known for its graphic design software packages than for computer aided design (CAD), which more aimed at architects and engineers. Yet this is exactly what CorelCAD offers. This application has been around since 2011, thanks to the partnership between Corel and Germany-based company, Graebert.",
    "CorelCAD offers a complete set of 2D drafting tools as well as essential compatibility with DWG and AutoCAD files. 3D tools aren’t ignored and are in fact built on top of the 2D ones, and it’s an easy matter to switch between the two.",
    "The application is available for both Mac and Windows, and to make this even better, just like Corel does for its Painter app, the serial number works on both platforms. This means that if you work with multiple computers, you don’t need to buy the same app for each platform: as long as you only use one computer at a time, one serial number is all you need.",
    "CorelCAD already had tools such as parametric drawing, in-place text editing and table support. The 2019 version (released earlier this year) builds upon these, while also expanding on its 3D capabilities tremendously.",
    "As is often the case with updates, developers look at the interface they’ve provided up to now and see if they can come up with something better.",
    "Perhaps the biggest change you’ll notice will be the focus on layers. Corel have introduced a new Layer Manager. With it, you can see all the layers you’ve created, rename them and there’s even a very handy search field at the top to help you find the one(s) you need; just start typing and the unrelated ones disappear from view, leaving you with just what you’re looking for. It’s an extremely handy feature when working on large complex projects.",
    "This would be quite a welcome addition on its own, but Corel took the concept further by letting you merge layers - when you select that command, you’re asked how to proceed: you can choose to merge them all into a new layer, or into one of the existing layers, or to delete the merged layers. This could be very useful when simplifying designs.",
    "Another improvement is how the interface responds when you mouse over or select an item. The visual cue is unmistakable, making it very easy to know which object you’re interacting with. It also has the added advantage of helping you find your cursor if you’ve temporarily lost it on the screen. As you mouse over an item, it turns bright orange. Select another, and it turns blue.",
    "For those who need it, CorelCAD 2019 now supports digital signatures, which are embedded in the DWG file format.",
    "And you’ll likely appreciate its enhanced support for the AutoCAD R2018 DWG file support. In the previous version, you one had read support. Now, you’re offered write support, finally giving CorelCAD full bi-directional compatibility with other CAD apps that support and work with that format.",
    "Dynamic blocks enables you to create objects with customisable parameters. You could for instance create a door with a built-in option of various widths. With that set up, you can alter the same object for each specific location. That way, a company could create a single object with all available configurations, and apply them throughout a project while only ever providing the designer with a single “door” item, making for a cleaner and much more versatile digital workspace.",
    "All these alterations can be made on the fly, with different options being available through pop-up menus and symbols that appear on the object once it’s selected. You’ll find this a great and versatile timesaver when laying down your design.",
    "Working in 3D isn’t new to CorelCAD, but the designers have been greatly enhancing this feature for this latest update.",
    "For instance, the app could export to the STL format (typically used in 3D printing workflow), but version 2019 now supports the import of such files, greatly easing workflow, and allowing you to use, manipulate and edit the design, and re-export it to STL, ready to send to your 3D file service.",
    "To help you refine your models, you can now apply chamfer edges to them, and the PolySolid tools allows you to create polygonal shapes with ease, just as you could with boxes, spheres and any other shape previously available.",
    "But perhaps the biggest improvement in the 3D interface is the new Push&Pull feature. It’s an intuitive way to modify 3D solid objects by simply selecting a section, and dragging it to alter it. It’s a great way to, for instance make one wall thicker without have to create another object. Push&Pull is a great, visual, and quick way of customising your shapes with ease.",
    "Corel have elected for maximum flexibility when it comes to acquiring CorelCAD2019. As mentioned, the software is available on both Mac and Windows, but you can also choose to own the app outright, or pay a subscription in order to use it. The latter option ensures that you’ll always have the latest version available but if you stop paying, the app is no longer available to you. Conversely, the former allows you to use the app “for ever” (as long as your computer and its operating system updates will allow), but if you want to take advantage of the latest and greatest, you’ll have to pay to upgrade.",
    "A perpetual license would set you back $699 (£799.99) for the full version, or $199 (£232.99) for an upgrade.",
    "The subscription model is available via the Mac App Store and the Microsoft Store, and comes in two flavours: monthly or yearly. These cost $34.99 and $299.99 respectively. UK pricing changes depending on currency fluctuation, but as of this writing, the Mac App Store’s subscription costs were £31.99 and £269.99 respectively.",
    "The subscription options are available through your computer’s app store. If you’d rather buy the app, you can do that on Corel's website.",
    "CAD software has a very specific market, and Corel have delivered an app that fills a lot of large holes left by its previous versions, with increased compatibility, great new tools and an improved interface. It’s definitely worth taking it for a spin with its free trial version to see if these changes will benefit your workflow."
  ],
  "headers": {
    "4": "Layer control",
    "7": "See what you've done",
    "8": "It's the little things",
    "10": "Custom blocks",
    "12": "Pushing 3D",
    "16": "Pricing and availability",
    "20": "Final verdict"
  },
  "links": {
    "graphic design": "https://www.techradar.com/best/best-graphic-design-software",
    "CorelCAD": "https://www.coreldraw.com/en/product/corel-cad/#features",
    "perpetual license": "https://www.coreldraw.com/en/product/corel-cad/#features"
  }
}