{
  "source": "https://www.techradar.com/reviews/amazon-echo-glow",
  "title": "Hands on: Amazon Echo Glow review",
  "category": "reviews",
  "updated": "2020-03-03T09:12:23Z",
  "author": "david-lumb",
  "summary": "An Alexa-controlled kiddo nightlight",
  "verdict": "The Amazon Echo Glow is an Alexa-controlled night light for kids that can also work just fine disconnected, but it’s Alexa abilities put the power in parents’ hands. Whether that’s enough to justify its price is up to folks.",
  "pros": [
    "Plays well with Alexa",
    "Cute kids introduction to voice control"
  ],
  "cons": [
    "Pricey for a night light"
  ],
  "article": [
    "As Amazon expands its ever-larger empire of Alexa-connected devices, it’s begun to expand into the realm of products. Which explains the Amazon Echo Glow.",
    "The Echo Glow, despite its name, does not have the capabilities of an Echo smart speaker — it’s simply an accessory for the product line, specifically for kids.",
    "The Glow is a lamp that shifts between colors; tap the top, and it switches hue, which you can even do without any sort of Alexa connection.",
    "But if you link the Glow to the Alexa app on your device, you get more nuanced control over brightness, color, and such. You can also link it to routines, and if it’s connected in sequence to an Echo, you can give linked commands - for example, “Alexa, let’s have a party” will start playing music from the smart speaker while the Glow strobes in different colors.",
    "[Update: You can now buy the Amazon Echo Glow for $29.99 in the US. It doesn't appear to be available in the UK or Australia yet, but this works out at around £23 / $AU45 based on current conversion rates.]",
    "And...that’s it. It’s a fine night light for children’s rooms, and likely offers comforting luminescence into the wee hours – controllable, of course, by parents – but don’t expect more functionality than aesthetic appeal.",
    "Which doesn’t mean it’s useless beyond a voice-commanded fun lamp - there is an argument that the Glow could be a child’s first Alexa tool to learn how to control and navigate their increasingly voice-assisted life.",
    "If you’re in the market for a fun, color-changing lamp for your kids with Alexa integration, the Echo Glow is a cute choice. (Check out how to change Alexa's voice here, too.)"
  ],
  "headers": {},
  "links": {
    "how to change Alexa's voice": "https://www.techradar.com/how-to/change-alexa-voice"
  }
}