{
  "source": "https://www.techradar.com/reviews/libratone-track-air",
  "title": "Libratone Track Air+ true wireless earbuds review",
  "category": "audio-visual",
  "updated": "2019-10-23T15:16:06Z",
  "author": "olivia-tambini",
  "summary": "Stunning design, alright sound",
  "verdict": "These earbuds look great, and they feel even better, with a fit so comfortable you’ll forget you’re wearing them. With noise cancelation tech built-in, the Libratone Track Air+ are a very accomplished pair of true wireless earbuds. However, a harsh soundstage means they aren’t the best buds you can buy at this price.",
  "pros": [
    "Excellent design",
    "Very comfortable",
    "Good noise cancelation"
  ],
  "cons": [
    "Sometimes sound harsh",
    "Better-sounding rivals are available for less"
  ],
  "article": [
    "Noise-canceling true wireless earbuds are on the increase, with big audio brands like Sony offering their own wire-free earphones with noise cancelation packed in.",
    "New to the scene are the Libratone Track Air+, which combine noise-canceling tech with stunning design and a lightweight build, for a follow up to their predecessors, the Libratone Track Airs.",
    "With a sharp, geometric style and slick charging case, these wireless earbuds may look good, but how do they sound? We put them to the test.",
    "You can buy the Libratone Track Air+ from Amazon for £179, which works out at around $220 / AU$325 based on current conversion rates; however, we’re still waiting on a release date and pricing for these territories.",
    "That makes them more expensive than many other true wireless earbud models, including the Apple AirPods (2019), which cost $159 / £159 / AU$249, though they’re still cheaper than our favorite true wireless buds, the Sony WF-1000XM3.",
    "Coming in black or white, the Libratone Track Air+ are very slick indeed, with a cool geometric build that makes them look more like jewelry than earbuds.",
    "Shiny oval housings are offset by angular stems, doing away with the sheer dorkiness of the Apple AirPods’ long earstems; on the back of each stem you’ll find a tastefully etching of the Libratone bird logo.",
    "These stems are also touch sensitive, allowing you to double tap to control your music playback, change your noise cancelation settings, and summon your devices voice assistant, whether you use Google Assistant or Siri.",
    "You can assign each earbud different controls via the Libratone app, but you are limited to one function per earbud – this isn’t necessarily a bad thing though, as many of today’s true wireless earbuds necessitate the learning of numerous different tap combinations, which can get complicated.",
    "These earbuds come with four different eartip sizes so you can find your perfect fit, and have an IPX4 rating – this means they’ll withstand a little sweat or a few drops of rain.",
    "They’re possibly the most comfortable earbuds we’ve tested, coming in at just 5.6g per earbud – that’s very light, even for true wireless earbuds, and they felt really secure when we wore them out and about.",
    "The Libratone Track Air+ come with a pill box-shaped charging case, which is compact enough to slip into your pocket unnoticed. The lid does feel a little flimsy for the price, but it’s not a huge drawback.",
    "To pair the Libratone Track Air+ with your device, you’ll need to download the Libratone app and follow the instructions; Bluetooth 5.0 connectivity was really stable during our tests, and we didn’t experience any annoying dropouts.",
    "In terms of battery life, you’re looking at six hours from the buds themselves, with a further 18 provided by the charging case – not bad for true wireless earbuds, but it pales in comparison to the likes of the Cambridge Audio Melomania 1.",
    "You can either charge the case via USB-C, or top it up wirelessly using a charging pad; Libratone is offering up its own charging pad, to be sold separately, called the Coil, which charges at 5W, 7.5W or 10W.",
    "The inclusion of noise cancelation is impressive in any earbud, let alone models as dainty as the Libratone Track Air+. When we tested these buds on a busy street, we found the noise cancelation worked really well; they may not block out as much environmental noise as a pair of heavy-duty over-ear headphones, but they certainly block out enough to let you enjoy your music in relative peace.",
    "You can control the level of noise cancelation within the Libratone app, which is useful if you want to let a little environmental noise pass through the buds for safety reasons; when you’re crossing the road, for example.",
    "If you’d prefer to leave one ear free to hear your surroundings you can do this too, and you’ll get your music in full stereo through the remaining bud. You can also pause your music by simply removing both earbuds.",
    "The Libratone app also makes it possible to customize the equalizer settings of these buds, which allows you to toggle through neutral, extra bass, and enhanced treble profiles.",
    "With 5.3mm drivers in each earbud, the Libratone Track Air+ offer a lively listening experience, with a clear, precise soundstage.",
    "Listening to Foals’ Hummer, we were impressed by their deft and agile handling of complex intertwining guitar riffs; there was decent separation between the instruments and vocals, while drums crashed about in the background without overpowering other sounds.",
    "Acoustic tracks like The White Stripes’ We’re Going To Be Friends sounded really natural with a neutral presentation, although it occasionally felt as though the upper mid frequencies over power the vocals.",
    "Moving on to Toro Y Moi’s Ordinary pleasure, we found this problem was compounded, with snares and watery vocals coming across with a harsh tone – despite this, the bass sounded warm and well-rounded.",
    "We’d like to hear a little more power behind the bass frequencies. Even while using the extra bass EQ setting, we were craving more muscle behind the subby synth drones in Kendrick Lamar’s track Wesley’s Theory.",
    "Overall, the Libratone Track Air+ provide a very crisp sound, with good levels of agility when handling complex, highly-textured tracks – and this treble/mid-focussed sound makes them ideal for listening to podcasts.",
    "However, that sound quickly becomes harsh when listening at higher volumes, and they’re just lacking that extra bit of warmth that makes listening to your favorite tracks truly enjoyable.",
    "Design-wise, we can’t fault the Libratone Track Air+. Their angular fashion-forward build looks incredibly modern, while their lightweight feel makes them some of the most comfortable earbuds we’ve ever tested.",
    "The noise cancelation is impressive, and the Libratone app is a welcome addition to the whole listening experience.",
    "It’s just a shame that the sound quality doesn’t match these earbuds’ other features; they’re great for listening to podcasts, but a slightly harsh tone and lackluster bass means that the Libratone Air Track+ don’t live up to the competition at this price point.",
    "That being said, if you mainly listen to podcasts and acoustic music, you may find that these buds are the perfect fit."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "12": "Features",
    "19": "Sound performance",
    "26": "Final verdict"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FLibratone-Wireless-Bluetooth-Headphones-Cancellation-Black%2Fdp%2FB07SWN7YNH%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1391471679759355000-21",
    "Apple AirPods (2019)": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Cambridge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342"
  }
}