{
  "source": "https://www.techradar.com/reviews/lg-k40",
  "title": "Hands on: LG K40 review",
  "category": "phones",
  "updated": "2019-12-10T16:22:33Z",
  "author": "james-peckham",
  "summary": "Bringing AI to the mid-range camera",
  "verdict": "The LG K40 is far from the most exciting phone announced at MWC 2019, but if you're looking for a budget phone this may sport enough tech for you.",
  "pros": [
    "Good amount of storage",
    "18:9 display"
  ],
  "cons": [
    "Not Full HD",
    "No USB-C tech"
  ],
  "article": [
    "The LG G8, LG G8S and LG V50 may have taken all the headlines at MWC 2019, but the company has a variety of other phones on show including its new mid-range collection.",
    "The cheapest in those mid-rangers is the LG K40, which unsurprisingly is the follow-up to the LG K30 from 2018.",
    "This new handset from LG is set to be around a third of the price (or less) of those flagships and while the spec sheet isn't as impressive, it may well be up your street with a strong variety of options on the LG K40.",
    "We've tried out LG's latest handsets at MWC 2019, and below you'll find our early thoughts on the new K40.",
    "Some details of the LG K40 have yet to be unveiled, including both the price and release date. We'd assume the phone will come to the US, since the last-gen device had, but we don't know if it'll make it to markets like the UK or Australia.",
    "LG has yet to announce how much the phone will cost, but we can't imagine it'll be much more than the LG K30 that launched at $200 (about £150, AU$280).",
    "It may be the company increases the price for the LG K40 though, so be sure to check back as we'll update this when we hear how much it'll cost.",
    "The LG K40 comes with a full metal unibody design, and so far we think there's only one color available - the blue you can see in the photos around here.",
    "LG may decide to include more colors in the future, but we've only been able to see the blue version of the phone. It's an attractive color, and while the phone doesn't feel particularly premium it does sit in the hand comfortably.",
    "It doesn't compare to products like the Moto G7 though with its glass back and rounded edges, but at 8.3mm thick you'll find this slips into your pocket with ease.",
    "There's a fingerprint sensor on the rear of the phone, which we found was easy to reach when you're holding the phone. You may find it a little irritating when setting your phone down flat on a desk, but at that point, you can use the power button and other screen unlock methods.",
    "That screen is a 5.7-inch IPS LCD display with a resolution of 720 x 1440 (HD+). We found it to look acceptable in our limited testing time, but you could spot the odd pixel when inspecting the display quality.",
    "That equals 282 pixels per inch, which isn't as good as some other phones around this price point. It's also worth pointing out the 18:9 aspect ratio, making it look a bit more modern than some other budget devices that haven't followed the trend toward taller, thinner screens.",
    "The phone charges using via microUSB port at the bottom of the phone, while there's also a 3.5mm headphone jack to the side of it too.",
    "LG is offering Android 9 Pie software right out of the box here, and it'll come with LG's overlay on top that makes it look somewhat different to other Android manufacturers user interface.",
    "Under the hood the K40 is sporting a 2GHz octa-core processor, but we've yet to learn the exact model that chip will be. We found it powerful enough to open up a variety of apps and it was snappy under the finger.",
    "There's 32GB of storage on this phone as standard, and 2GB of RAM that should allow you to open up most apps and games. If you're used to a more expensive phone you may find this isn't fast enough for you.",
    "The K40 sports a 3000mAh battery, and considering this isn't the most spec-laden phone, this should power the phone for at least a day from a single charge. We don't know for sure yet, and we'll be sure to put it through its pace during our upcoming full review.",
    "You won't get any special battery features here like fast-charging or wireless charging either, sadly.",
    "On the rear of the handset is a single 16MP shooter. That isn't set to blow you away with its photography skills, but if you're looking to take the odd shot to upload to social media it should be able to get you by.",
    "We briefly tested out the rear camera on the show floor at MWC 2019, which struggled to take a quick photo, but it the device we were using might have been running early software. We'll save our full judgement for our full review.",
    "There's also a front-facing 8MP camera, but we haven't yet had an opportunity to try that out.",
    "If the price of the LG K40 is good, this has the potential to be a great budget phone.",
    "The problem is the Moto G7 range is out now and that is a competitively priced series of phones with some more impressive spec than the LG K40.",
    "MWC (Mobile World Congress) is the world's largest showcase for the mobile industry, stuffed full of the newest phones, tablets, wearables and more. TechRadar is reporting live from Barcelona all week to bring you the very latest from the show floor. Head to our dedicated MWC 2019 hub to see all the new releases, along with TechRadar's world-class analysis and buying advice about your next phone.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "4": "LG K40 release date and price",
    "7": "Design and display",
    "14": "OS and specs",
    "17": "Battery and camera",
    "22": "Early verdict"
  },
  "links": {
    "MWC 2019": "https://www.techradar.com/news/mwc-2019-what-to-expect-from-the-biggest-mobile-show-of-the-year"
  }
}