{
  "source": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/acer-swift-7-1327419/review",
  "title": "Acer Swift 7 review",
  "category": "computing",
  "updated": "2019-09-05T19:38:38Z",
  "author": "matt-hanson",
  "summary": "The world’s thinnest laptop is back for another go",
  "verdict": "Acer has overhauled the Swift 7 with an upgraded design. It is the slimmest and lightest Intel-based laptop we've ever tested, but it also comes with a few too many compromises.",
  "pros": [
    "Lovely new design",
    "Touchpad is improved",
    "Impressively light"
  ],
  "cons": [
    "So expensive",
    "Webcam position isn't great",
    "Mediocre performance"
  ],
  "article": [
    "The Acer Swift 7 2019 is a flagship Ultrabook that is so thin and light it makes other slimline laptops feel incredibly clunky. Last year’s iteration was already the thinnest laptop in the world, and it’s no surprise that the latest model continues that winning streak.",
    "Seriously – it’s rather rare that when we unbox a new laptop for review, we promptly pass it around the office for people to feel, but the Acer Swift 7 2019 is so sleek and light that you really need to get your hands on it to actually appreciate what Acer has accomplished here.",
    "However, while fashioning an unbelievably thin and feathery laptop is undoubtedly impressive, last year’s model proves that laptops require more than just a svelte design to win over customers. In our review of the previous model, we valued the size and weight, but it just came with too many downsides.",
    "This year’s model, on the other hand, seems like it could fix a lot of the issues we had with last year’s edition. If it does – then Acer will truly have a hit on its hands.",
    "As a flagship Ultrabook that’s furnished with some of the latest mobile tech in an extremely thin body, you should be ready to spend a chunk of change – and it’s a doozy at $1,699.99 (about £1,300, AU$2,400).",
    "For that price, the Swift 7 is fitted with 8GB of DDR3 memory and a 256GB PCIe SSD, as well as an 8th-generation Intel Core i7-8500Y processor and a 14-inch, Full HD (1,920 x 1,080) touchscreen.",
    "Now, that is quite a price tag, which is significantly higher than its competitors like the Dell XPS 13, Asus ZenBook 3 and even the 13-inch MacBook Pro. These are some of the best laptops in the world, so Acer will need to put it all on the line for the Swift 7 (2019) to compete.",
    "While it definitely comes with a premium price, it is at least no more expensive than the Swift 7 of 2018, which means you get updated components and a refreshed design without shelling out more cash. Still, as we mentioned in our review of the 2018 model, the high price tag isn’t entirely justified. Sure, it’s the thinnest laptop on the market, but how much are you really willing to spend to trim off a few milliliters and grams?",
    "Far and away the chief selling point of the Acer Swift 7 is the astoundingly slim and light design. Now, you may think your current laptop is thin and light, but we can guarantee it won’t be as svelte as the latest Acer Swift 7. This device is exceptionally lean, and you really need to see (and feel) this laptop to truly appreciate it.",
    "At just 12.51 inches (317.9mm) wide and 7.53 inches (191.5mm) deep, Acer has somehow managed to cut the depth by almost 20%. While it is slightly thicker than last year’s model at 0.39 inches (9.95mm) – but that’s still extraordinarily thin.",
    "Acer has somehow decreased the overall size of this year’s Swift 7 by making the screen bezels as thin as possible, which brings the laptop’s screen-to-body ratio to an impressive 92%.",
    "This means Acer has removed the webcam from the top of the screen. It doesn’t mean the webcam has been totally removed, however, only moved to the lower half of the device.",
    "On the top-left corner of the bottom of the Swift 7, just above the keyboard, is a small rectangle. Push it down and the webcam pops up. It’s a pretty good way to slim down the size of the Swift 7 without completely losing the webcam.",
    "The webcam itself is a 720p offering with super high dynamic range (SHDR) imaging. So, it doesn’t look like there’s been much sacrificing with the repositioning of the camera when it comes to hardware – and it looks decent enough when used to video call. However, its positioning does mean it records at a rather unflattering angle, looking up rather than straight at you.",
    "This isn’t an angle many people will enjoy – we’re not fans. In fact, there was enough of an outcry when Dell moved the webcam of the XPS 13 to a similar position that the company eventually reverted it back.",
    "So, you’ll have to think about how essential the angle of the webcam is to you. If you do a lot of video calls and you’re not a fan of people looking up at your nose, then this might be a reason to avoid the new Swift 7. However, for many other people, this may be a reasonable trade-off to get such a compact laptop.",
    "One thing we noted is that if you push the camera down during a video call, the webcam doesn’t turn off. Instead, it just shows a blackened screen while the camera still records. So, while it does offer you some privacy, we’d rather the camera turn off completely.",
    "Because of the svelte design, there’s not much room for ports, so the Acer Swift 7 only comes with two USB-C ports on the right-hand side, and an audio jack port on the left. It’s reasonable that ports are going to be left behind to keep the size of the laptop down, and USB-C is at least pretty versatile as ports go – and they can double up as a charging port as well.",
    "It’s a nice touch that Acer has added a USB-C adapter as well, and it includes a standard USB port, USB-C and HDMI port. Its small enough to carry around with you, and we like the fact that it’s included for free, where many of the Swift 7’s competitors don’t follow suit.",
    "One hitch we found is that by placing both USB-C ports on the right-hand side of the laptop, you don’t have a choice of where to plug in the charger. This can make it a bit awkward if the power adapter needs to be plugged in to a socket on the other side.",
    "In regards to the screen, it’s touch-enabled with Corning Gorilla Glass 6 to protect it. The full HD (1,920 x 1,080) resolution is a bit on the low-end these days, especially when considering the price. However, you could argue that you don’t need much higher resolution on a compact 14-inch screen.",
    "It also meets 100% of the sRGB color gamut, which means colors are both rich and accurate. The screen is also pretty bright at 400 nits, and the touchscreen is great and responsive.",
    "Because of the size of the Acer Swift 7, the keyboard isn’t the biggest. However, to be fair, most of the keys are a decent size so they don’t feel too difficult to press, even if you’re a fast typer. There are a few keys – like Esc and Caps Lock – that were shrunk to fit in the Swift 7’s small form factor, so keep in mind that these can be a little more difficult to use.",
    "The thinness of the Swift 7 also means that key travel – which is the amount of distance the keys sink when pressed – is very shallow. This means they don’t feel as tactile as other keyboards, and it might take some adjusting to – particularly if you’re coming from a desktop PC. But, like the lack of ports and repositioned webcam, these are all compromises made to get such a remarkably thin laptop.",
    "The trackpad has also been upgraded over last year’s model. One of our biggest issues about the 2018 Swift 7 model was the clickless trackpad, which essentially meant you could only tap on the trackpad, not press it down to mirror a mouse click.",
    "While this allowed Acer to trim off even more thickness from the Swift 7 2018, it also meant that the trackpad lacked any kind of physical response when clicking and selecting items in Windows 10. It also made selecting something, then scrolling with the trackpad – just as you would when dragging and dropping files – much harder.",
    "So, we’re happy that the trackpad on the Swift 7 2019 brings that click back. It makes it that much more comfortable – not to mention, much easier – to use. And, while it means this year’s model is slightly thicker than last year’s, we think this is unquestionably the right move by Acer.",
    "Image credits: TechRadar"
  ],
  "headers": {
    "4": "Price and availability",
    "8": "Design",
    "22": "Keyboard and trackpad"
  },
  "links": {
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Asus ZenBook 3": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/asus-zenbook-3-1322498/review",
    "13-inch MacBook Pro": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725"
  }
}