{
  "source": "https://www.techradar.com/reviews/hands-on-nokia-1-plus",
  "title": "Hands on: Nokia 1 Plus review",
  "category": "phones",
  "updated": "2019-02-24T15:30:36Z",
  "author": "david-lumb",
  "summary": "A budget phone with a removable, textured cover",
  "verdict": "The Nokia 1 Plus is a refined version of last year's bottom-level budget Nokia phone with incremental spec improvements and a new rubberized rear case that lends a classier look for a basic phone that looks far nicer than other phones at this price point.",
  "pros": [
    "Decent specs for price",
    "Durable, removable cover"
  ],
  "cons": [
    "Not much storage",
    "Performance will be limited",
    "Spend a little more for a lot more"
  ],
  "article": [
    "The term 'budget phone' probably brings up the most elemental image of today's smartphones: a simple black rectangle with a front display, plastic back and a lone camera on either side.",
    "With such a mundane exterior, doubtless the insides are simple as well. But that's the expectation that HMD Global's Nokia 1 Plus aims to upend. The phone is basic, yes - but exceeds expectations for a device at its price point.",
    "The Nokia 1 Plus, which launched at MWC 2019, is an improvement on last year's Nokia 1 while sustaining the phone's promise: a low-priced smartphone boasting decent specs and Nokia's refined exterior design for a budget phone with above-budget looks.",
    "You won't get a phone that competes with higher-priced mid-range options, but you'll get your money's worth. Perhaps most importantly, you'll get a phone with a stylish rear cover that gives it an appearance above its price point.",
    "For budget phones, that's a novelty. Most really are black rectangles with plastic rear covers - which serves everyone at this price point just fine.",
    "And truly, the Nokia 1 Plus specs won't impress anyone who's handled a pricier phone - but they're on par (if not better) with the budget competition and the phone offers just a bit more to entice consumers shopping around at this price point: a modicum of style to sweeten the deal.",
    "The Nokia 1 Plus will retail for $99 / AED 299 (around £75, AU$140), making it one of the most affordable budget devices on the market.",
    "As for the Nokia 1 Plus release date, we've been told it'll be available mid-March, but we'll bring you more details when we know then.",
    "From the front, the Nokia 1 Plus looks like most smartphones these days: a display with a front-facing camera, and for its budget price point, some noticeable bezel with a large top bar and bottom chin.",
    "This year's model, thankfully, has significantly less bezel and more display. The frame is more rectangular and the Nokia 1's white frame is gone, too.",
    "Heck, the Nokia 1 Plus' 8.55mm thickness is even 12% slimmer than its predecessor, Nokia said. All in all, the phone looks less like a bargain model from yesteryear and more like a design punching above its price point.",
    "In many ways, it comes down to the polycarbonate rear cover, a slightly rubberized (\"textured nano-pattern\", as Nokia calls it) exterior finish wrapping around the phone up to the front screen.",
    "It's a bit like a case pre-installed on the phone, which is actually nice for most users who won't care to spend extra on an actual protective covering.",
    "While the black color looks traditionally classy, the bright red (the version we saw) looks great. It’s bright, has texture for grip and is interrupted by intermittent black poking out, including in a vertical speaker slot on the lower-right backside along with the volume rocker and power button on the phone’s right side.",
    "Finally, the 'Nokia' brand appears in the middle in chrome-silver letters.",
    "There's a micro USB port on the bottom for recharging - sadly, this model isn’t high-enough budget to warrant a USB-C port - and a 3.5mm headphone jack at the top, right where it was in the Nokia 1. We wish for progress, but not too much progress.",
    "And there's something rare if you remove the rear cover - the battery is removable. Once upon a time, removable batteries were the norm in phones, but the Nokia 1 Plus is now part of an exclusive club in 2019.",
    "The Nokia 1 Plus' removable rear covers can be swapped, allowing you to rotate between the three color options - black, red and blue - if you opt to purchase additional back plates.",
    "The 5.45-inch IPS display won’t turn heads, but it’s sharp enough and functional. Keep in mind that its FWVGA+ resolution is sub-HD (FWVGA standard is 854 x 480 pixels in 16:9 format, but the Nokia 1 Plus’ 18:9 format stretches that first value even further).",
    "Media won’t be as sharp as it would be on most other displays in your life, but it’s pretty standard for devices in this price range.",
    "That smaller screen size should tip you off to the phone’s overall size, which is on the smaller side for today’s smartphones (dimensions: 145 x 70.4 x 8.55mm), though its elongated display certainly follows the trend for thinner, taller phones.",
    "This is welcome for anyone with smaller hands...or those who hate big form factors. In truth, it felt great to hold, with one of the larger screen-to-body ratios we’ve seen in the budget tier.",
    "The Nokia 1 Plus packs the basics in its camera oeuvre: an 8MP single rear camera (with autofocus and flash) along with a 5MP front-facing camera, which are both higher megapixel count than found in last year’s model.",
    "These are your basic shooters, and shouldn’t be anything to write home about. We didn’t test them too thoroughly in our brief hands-on, and aren’t expecting much - but that’s okay, as these are geared to satisfy your simplest photo needs.",
    "The Nokia 1 Plus packs a 2,500mAh battery, which is enough for a bit under 13 hours of talk time or 83 straight hours of music, per Nokia’s press material. No, there isn’t fast charge or wireless charge, but we didn’t expect there to be.",
    "The Nokia 1 Plus sports a basic MediaTek Quad Core 1.5Ghz processor to power the phone’s operations and interface. The basic model packs 1GB of RAM and 8GB of storage, which must be barely enough for the operating system and a few GB of space left over for photos and other media.",
    "For a nominal (and as-yet-undisclosed) price increase, you can bump that up to 16GB of space if you're in Latin America.",
    "There is a microSD slot too, allowing you to build on the space inside the phone.",
    "The Nokia 1 Plus packs the Android Go version of the Android Pie experience - a pared-down version of the operating system, to be sure, but one that is slated to get timely updates and monthly security patches to ensure the phone remains usable and safe for years.",
    "This limited OS comes with 'optimized' Go versions of traditional Google (Maps, Files, etc) and third-party apps that will run faster and smoother on the phone’s limited specs, and will take up less space to boot.",
    "Anyone shopping for a sub-$100 budget phone should take a second look at the Nokia 1 Plus, and they probably will, if they catch a glimpse of the red or blue-backed versions of the handset. It's handy, small and more attractive than the competition.",
    "It’s even a marked improvement on last year’s model. Even if it shares a lot of design elements, like the rear horizontal speaker slot (still conceivably bad while holding the phone) and button layout, it’s incrementally upgraded where it counts.",
    "Most importantly, it looks pricier than it is, which is always nice for consumers buying devices at the lower end of the market.",
    "MWC (Mobile World Congress) is the world's largest showcase for the mobile industry, stuffed full of the newest phones, tablets, wearables and more. TechRadar is reporting live from Barcelona all week to bring you the very latest from the show floor. Head to our dedicated MWC 2019 hub to see all the new releases, along with TechRadar's world-class analysis and buying advice about your next phone."
  ],
  "headers": {
    "6": "Nokia 1 Plus price and release date",
    "8": "Design and display",
    "22": "Nokia 1 Plus camera and specs",
    "30": "Early verdict"
  },
  "links": {
    "MWC 2019": "https://www.techradar.com/news/mwc-2019-what-to-expect-from-the-biggest-mobile-show-of-the-year",
    "Nokia 1": "https://www.techradar.com/reviews/nokia-1-review",
    "Android Go": "https://www.techradar.com/news/what-is-android-go-how-google-plans-to-bring-android-o-to-low-end-phones"
  }
}