{
  "source": "https://www.techradar.com/reviews/asus-proart-studiobook-pro-x",
  "title": "Hands on: Asus ProArt StudioBook Pro X review",
  "category": "computing",
  "updated": "2019-09-06T16:20:06Z",
  "author": "bill-thomas",
  "summary": "A laptop so pro it says it twice",
  "verdict": "The Asus ProArt StudioBook Pro X is an incredibly powerful device, however it will probably be out of reach for most people.",
  "pros": [
    "Incredibly powerful",
    "Wonderful keyboard",
    "Plenty of ports"
  ],
  "cons": [
    "ScreenPad is still frustrating to use"
  ],
  "article": [
    "Everyone is a prosumer these days. Whether you're getting some freelance work done on the side, livestreaming your gameplay or even making short films for YouTube, powerful workstations are becoming more popular. And, that's why the Asus ProArt StudioBook Pro X is here.",
    "This laptop is strapped with pro level hardware top to bottom, from an Intel Xeon processor to Nvidia Quadro graphics. And while its definitely an expensive device, you're getting a level of performance that you can't find in many places.",
    "At the time of this writing we don't have pricing or release date information for the Asus ProArt StudioBook Pro X. However, just by, well, looking at this laptop we can tell it's not going to be cheap. This device – along with the rest of the Asus ProArt StudioBook lineup announced at IFA 2019 – is packed with incredibly powerful hardware, so you should expect a price tag to match.",
    "The Asus ProArt StudioBook ProX is definitely a device where if you have to ask the price, you probably don't need it. This is a workstation designed first and foremost for creative professionals.",
    "Just looking at the Asus ProArt StudioBook Pro X and you'll know this is a workstation. It's thicker than pretty much anything else on the market and has more ports to match. It's definitely not something you're likely to see sitting in a coffee shop, that's for sure.",
    "However, thanks to that thickness, the keyboard on the Asus ProArt StudioBook Pro X is dream to type on. Nice and deep with the perfect amount of feedback, typing on this thing all day actually sounds like a pleasant experience.",
    "But then there's the ScreenPad. Look, we know that this is Asus' effort at introducing the next big thing, and we can kind of see an appeal, but we're way too clumsy for this kind of input. While using the Asus ProArt StudioBook Pro X, we kept knocking the ScreenPad out of touchpad mode, and when we wanted to click on something we had to sort through menus to reactivate it.",
    "In theory, this is a cool technology, but in practice, we don't think it's quite there yet. However, if you pair this laptop with a mouse, the ScreenPad might actually become useful – something we'd like to test.",
    "As for ports, you're getting Ethernet, USB-A 3.1 and two Thunderbolt 3 ports on the right side of the laptop. Over on the left, you'll find the power jack, headphone out, HDMI, two more USB 3.1 ports and an SD card slot. Finally, a pro laptop that has all the ports professionals need, without having to rely on a dongle.",
    "Because the Asus ProArt StudioBook Pro X is packed with up to an Intel Xeon E-2276M processor, an Nvidia Quadro RTX 5000 and up to 128GB of RAM, this laptop is going to be a monster.",
    "We didn't get a chance to run any performance benchmarks on this laptop, but just looking at the specs on offer, we can pretty confidently say that you won't hit any snags running software on this behemoth. Even editing 4K video isn't going to make this laptop break a sweat.",
    "And, because the laptop is so thick, we're confident that Asus has packed in a cooling system that will see that Xeon chip boost high and stay boosted, so you can get good performance throughout a long project.",
    "The Asus ProArt StudioBook Pro X is obviously a laptop for professionals – Pro wouldn't be in the name of the device twice otherwise – but it's good to know that Asus appears to have taken the needs of creatives and professionals into consideration when designing this device.",
    "Still, for most users, you'll likely find more value elsewhere. The amount of people that actually need this kind of horsepower is pretty slim, especially in a portable form factor. This is especially true when you consider the hefty price tag that will more than likely accompany this device."
  ],
  "headers": {
    "2": "Pricing and availability",
    "4": "Design",
    "9": "Performance",
    "12": "Early verdict"
  },
  "links": {
    "processor": "https://www.techradar.com/news/best-processors",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}