{
  "source": "https://www.techradar.com/reviews/ecovacs-robotics-winbot-x",
  "title": "Ecovacs Robotics WINBOT-X review",
  "category": "appliances",
  "updated": "2019-01-03T12:05:49Z",
  "author": "chris-price",
  "summary": "Get your glass sparkling with this robotic window cleaner",
  "verdict": "One of the first robotic window cleaners on the market, Ecovacs Robotics WINBOT-X is great for cleaning large areas of glass. But with a price tag of $477/£399 (about AU$700) plus regular outlay on cleaning accessories, it’s not going to be ideal for everyone.",
  "pros": [
    "Straightforward to set up and use",
    "Great for difficult to reach windows",
    "Windows don’t look smeary"
  ],
  "cons": [
    "Takes a long time to clean each window",
    "Single charge lasts 50 minutes max",
    "Need to buy additional cleaning pads and cleaning solution"
  ],
  "article": [
    "Although robotic vacuum cleaners have been around for some time, the idea of a robot window cleaner is actually something quite new with very few models currently on the market. However, the two devices are actually quite similar.",
    "The only difference is that instead of placing the device on your floor and letting it scuttle around, you need to attach a robotic window cleaner to your home’s windows. It also needs to be tethered to a ‘safety pod’ – a powerful suction pad that sticks to the window – so the device doesn’t fall from the sky every time it’s set off to clean. At nearly $500/£400 (about AU$700), that could prove to be a costly mistake.",
    "Although in theory you could use the Ecovacs Robotics WINBOT-X to clean all of your windows, in reality it’s probably only ever going to be used for those difficult to reach windows or large areas of glass that need regular attention, so your cheery local window cleaner probably isn’t going to be out of a job just yet.",
    "The Ecovacs Robotics WINBOT-X was released in November 2018, with a recommended retail price of $499/£399 (about AU$700).",
    "Measuring around 25x25cm, the main white cleaning unit is fairly compact and minimalist in design. There’s a carrying handle for placing the device on the window, a blue power button and a key lock button to keep it connected to the safety pod during cleaning.",
    "On the reverse side, the WINBOT-X features ‘driving treads’ – rollers for moving up and down the window – two ‘squeegees’ for wiping the windows and a cleaning pad that covers the perimeter of the unit.",
    "Several replacement cleaning pads are provided in the box which the manufacturer claims will last for up to 40 cleans each. Also packaged with the window cleaner is the Ecovacs Professional Cleaning Solution (which you use to spray the cleaning pad before use), a remote control with various cleaning settings, and a disc-shaped suction pod.",
    "Featuring a strong 2.5m cable to connect to the main unit, this suction pod is stuck to the corner of the window before each clean to ensure the WINBOT-X stays on the glass during operation.",
    "We used the WINBOT-X to clean three large patio doors, inside and outside, at ground floor level - each one measuring around one metre wide by two metres tall. For each pane we placed the safety pod in the top corner of the window and put the actual cleaning device at the bottom.",
    "Importantly, the safety pod must be free from dirt and its cable securely connected to the main unit’s lock before cleaning can begin. Only then will you get the green light necessary to start the cleaning process.",
    "Either you can clean in auto mode or, by pressing the deep cleaning mode button on the remote, it will clean the windows in both N and Z shaped patterns. This provides a slightly more thorough but also slower clean.",
    "In auto mode, we found that each window took around 10 minutes to clean while in deep cleaning mode you are looking at around 15 minutes. Ecovacs Robotics claims the cleaner’s built-in 3000mAh Lithium Ion battery lasts for about 50 minutes although our experience was probably nearer to 40 minutes – enough to clean two windows thoroughly on one side, but that’s about all.",
    "Another problem we found was that even when using new cleaning pads with seven squirts of the Ecovacs spray solution as recommended it wasn’t enough to get rid of some of the deepest marks from the outside of the windows. However, thankfully it was enough to eradicate the dog’s muddy paw marks where she’d been jumping up to get out into the garden!",
    "Another slight problem was that on a couple of occasions the unit did need to be re-set half way through the cleaning process because the red light came on. This required taking the device off the window and cleaning the safety pod before putting back on the glass.",
    "One of the main concerns we had before testing the WINBOT-X was that it would fall off the window as it was cleaning. Actually it seemed very secure throughout testing. Ecovacs Robotics claims this is because integrated vacuum sensor on the safety pod connects to the main robot through a 2.4GHz connection.",
    "Another bonus is that the WINBOT-X is surprisingly easy to set up and use. Once you’ve attached it to a window you can go and make yourself a cup of tea and let it get on with the cleaning. It’s even relatively quiet as it moves around the window and quickly learns to move around any obstacles such as door handles.",
    "But it’s not all good news. Given the price tag of £399, we were left a little disappointed with the WINBOT-X. Sure, it does what it’s supposed to, but in all honesty it’s not as good as a professional window cleaner who could do it in a fraction of the time. Also it does need to be recharged quite regularly as well as require additional expenditure on accessories such as cleaning pads and professional cleaning fluid.",
    "If you’ve got a really large window that needs to be regularly cleaned then it might pay for itself eventually. Alternatively, if you have a window that simply can’t be properly cleaned by a human being then the WINBOT-X may make sense.",
    "The WINBOT-X robotic window cleaner is an interesting product and I’m sure there will be more devices like this coming onto the market. For now though it feels like a bit gimmicky. Hopefully as prices come down and charging times improve then it will become a more viable product for people’s homes."
  ],
  "headers": {
    "3": "Price and release date",
    "4": "Design",
    "8": "Performance",
    "14": "We liked",
    "16": "We disliked",
    "18": "Final verdict"
  },
  "links": {
    "robotic vacuum cleaners": "https://www.techradar.com/news/best-robot-vacuums"
  }
}