{
  "source": "https://www.techradar.com/reviews/hyperx-cloud-mix",
  "title": "HyperX Cloud Mix review",
  "category": "computing",
  "updated": "2019-10-21T21:49:34Z",
  "author": "mark-knapp",
  "summary": "Good, but tight and pricey",
  "verdict": "The HyperX Cloud Mix offers up gaming credentials and Bluetooth capability, but it comes at a high price. And, the aim to fit two niches keeps it from excelling.",
  "pros": [
    "Clean sound",
    "Quality construction",
    "AptX support"
  ],
  "cons": [
    "A tad tight",
    "Like paying for two headsets"
  ],
  "article": [
    "Contending for a position among the best gaming headsets, the HyperX Cloud Mix offers a blend of high-end audio, refined design and Bluetooth connectivity.",
    "The design and Bluetooth make the Cloud Mix an all-purpose pair of headphones, ready to be worn wherever you go. Meanwhile, the Hi-Res Audio-certified speakers and noise cancelling boom mic offer premium sound for gaming.",
    "The whole package puts the $199 (£179, AU$289) HyperX Cloud in a premium tier. For the price, it has to contend with some other competent rivals like SteelSeries’ $149 (£159, AU$259) Arctis 7, which offers 2.4GHz wireless for gaming but not Bluetooth. Coming in at much lower prices, the $129 (£134, AU$239) SteelSeries Arctis 3 Bluetooth offers similar functionality and the $50 (£55, AU$89) Corsair HS50 boasts a near identical design while lacking some of the features.",
    "The competition is steep for the HyperX Cloud Mix. Although it performs admirably in many ways and it’s one of the three gaming headsets to feature bluetooth, it doesn’t make the most sense for gamers to buy.",
    "Aside from the HyperX logo on each earcup (which are thankfully not red), the Cloud Mix headset doesn’t shout to the world that it’s a gaming headset. This is especially true if you opt for the Rose Gold model that HyperX launched in October. The pink and white design with a light pink HyperX logo looks amazing, and is a massive improvement over the original model. Nothing else changes, though.",
    "The Cloud Mix has a simple design, with a headband fully swathed in leatherette, aluminum yolks stemming from the headband, and plain earcups. There’s a bit of soft touch material here and there, but the outer shell of each ear cup is a hard plastic that does a better job of hiding fingerprints.",
    "Since the headset is ready for an on-the-go lifestyle, the detachable cable and mic are nice. As is the simple design, which keeps the size and weight down.",
    "The braided cable isn’t too long (but the extension for split mic and audio adds plenty of extra slack), and includes an in-line remote with volume control and a mute switch. The controller could use a clothing clip, and since the volume dial is exposed on both sides and lacks any clear label, it’s guess-and-check to adjust the headset.",
    "For Bluetooth mode, there are power and volume controls on right ear cup and a playback/assistant button on the left.",
    "There’s a great deal of flexibility to the Cloud Mix. The boom mic is on a wildly flexible arm, making it easy to position wherever it’s needed. The headband can bend and twist to accommodate very large heads. The earcups have a good range of angles, though don’t really swivel forward or backward.",
    "Getting a good fit with the Cloud Mix is fairly easy. And comfort is a plus at first. The headband cushion is excellent, though its clamping force was a bit noticeable. The lightweight 9.1oz (0.26kg) headset and the thick headband cushion prevent any noticeable stress on the crown of our head, usually one of the worst offenders for single-band designs like this.",
    "But, after an hour or so, the clamping force starts to become more noticeable. These don’t have the 10-hour-game-session-friendly comfort of the HyperX Cloud Revolver S. That clamping force may be attributed to the need to keep these headphones on while traveling though.",
    "The HyperX Cloud Mix headset has some serious specs for a gaming headset. The 40mm drivers offer a frequency response range from 10Hz to 40kHz and earn a Hi-Res certification. The microphone even boasts a wider frequency response than we usually see.",
    "When it comes to Bluetooth, don’t expect a significant loss in audio quality as the headset supports Bluetooth 4.2 and the AptX codec, which offers less noticeable audio compression. You’ll be able to listen for a long time with the headset’s rated 20-hour battery life.",
    "Those specs play out in performance as well. We listened to some lossless FLAC audio files to see what we could pick out.",
    "Using a wired connection, we can get the full frequency response out of headphones and mic. The audio comes through clean, with bass that’s pronounced but not overly dominant. Mids and high tones are clear, though, not particularly brilliant.",
    "Everything sounds clean even in busy songs like Of Montreal’s “I Feel Ya Strutter,” but we don’t get a great sense of spatial sound. The soundstage feels tight, and that can make it hard to pick out distinct parts of the tracks. Songs with a really big sound, like Alabama Shakes’ “Gimme All Your Love” lose some of their mass.",
    "That tight soundstage carries over into gaming as well. We’ve had headsets that can create a clear sense of space with sound, and that helps us figure out which direction things are coming from while also helping with immersion. We’ve played hours of Insurgency: Sandstorm with these headphones, and that game has some of the best spatial audio design around. While sound effects ring clear, we found the realism and directionality lacking with the HyperX Cloud Mix.",
    "On the plus side, the boom mic is incredibly clear for gaming. Our teammates never struggle to make out what we’re saying. Unless, of course, they’re in a building being bombarded by an enemy artillery strike. The only downside is the lack of mic pass-through, as it can be easy to start shouting without being able to hear yourself talk.",
    "Bluetooth works without much fuss. The AptX codec provides really clear sound. We switched between wired and Bluetooth connections on one song to spot any differences, and aside from certain elements in really busy music getting slightly buried, even “I Feel Ya Strutter” plays through enjoyably. And, we have no issues with the long battery life.",
    "The Bluetooth microphone, however, isn’t anything impressive. It works, but you won’t want to take calls while walking down the street. And, unfortunately, the boom mic doesn’t seem to work when in Bluetooth mode. The Arctis 3, on the other hand, can not only use its microphone with Bluetooth engaged but also hold a wired and wireless connection at the same time.",
    "The design and sound quality offer some decent value for shoppers, but there’s still a few things that don’t make sense about the HyperX Cloud Mix, and they largely come down to the trade-offs of making it a Bluetooth, on-the-go headset and a wired gaming headset all at the same time.",
    "You get Hi-Res audio through the wired connection, but the experience is limited by the tight soundstage. You get AptX over Bluetooth, but there are plenty of better Bluetooth headphones with AptX at better price points.",
    "The high price seems to come from wanting to make one headset that fits two niches. Unfortunately, the two niches don’t mesh all that well. The tight fit and low profile needed for portable headphones cuts into the at-home gaming experience. And, the nice mic and Hi-Res audio don’t contribute to the wireless experience.",
    "While the HyperX Cloud Mix are still a quality product, most shoppers will probably get a better experience by picking separate, cheaper gaming and Bluetooth headsets.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "4": "Design",
    "12": "Performance",
    "21": "Verdict"
  },
  "links": {
    "best gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "£179": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FHyperX-HX-HSCAM-GM-Gaming-Headset-Bluetooth%2Fdp%2FB07KQXH65Z%2Fref%3Dsr_1_4%3Fs%3Dcomputers%26ie%3DUTF8%26qid%3D1549042850%26sr%3D1-4%26keywords%3Dhyperx%2Bcloud%2Bmix%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1329732275736454100-21",
    "AU$289": "https://www.getprice.com.au/prodhits.aspx?refname=gplink&shopid=5899&subtag=trd-us-1177034862110350000&link=https%3A%2F%2Fwww.pbtech.com%2Fau%2Fproduct%2FHSTKIN0016%2FKingston-HyperX-Cloud-MIX-Wired-Gaming-Headset--Bl%3Fqr%3Dcountry-selector",
    "Arctis 7": "https://www.techradar.com/reviews/steelseries-arctis-7-gaming-headset",
    "SteelSeries Arctis 3 Bluetooth": "https://www.techradar.com/reviews/steelseries-arctis-3-bluetooth",
    "Corsair HS50": "https://www.techradar.com/reviews/corsair-hs50-stereo-gaming-headset",
    "HyperX Cloud Revolver S": "https://www.techradar.com/reviews/hyperx-cloud-revolver-s"
  }
}