{
  "source": "https://www.techradar.com/reviews/acer-predator-xb3-xb273k",
  "title": "Acer Predator XB3 (XB273K) review",
  "category": "computing",
  "updated": "2019-07-18T16:09:29Z",
  "author": "jeremy-laird",
  "summary": "Acer just made 4K, IPS, 144Hz, G-Sync gaming goodness a little cheaper",
  "verdict": "Acer just made 4K, IPS, 144Hz, G-Sync gaming goodness a little cheaper with its latest 27-inch high-end Predator monitor, but it’s still pretty expensive",
  "pros": [
    "Superb IPS 4K panel",
    "Strong feature set",
    "Cheaper than some alternatives"
  ],
  "cons": [
    "Not a true HDR panel",
    "Still expensive given the 27-inch proportions"
  ],
  "article": [
    "Qualifying as a cutting-edge gaming monitor is a tall task these days. Reduce it to a box-ticking exercise and high refresh, 4K resolution, adaptive sync and HDR are all in the mix.",
    "As it happens, Acer’s latest gaming panel, the Acer Predator XB3 (AKA the Acer Predator XB273K) nails that little list and does so for less money than its previous high-end screen in this category, the Acer Predator X27, not to mention Asus’s similar ROG Swift PG27UQ, even if the XB3 still isn’t exactly cheap at $999.",
    "Of course, even at this price point you’ll have to make a few compromises. The most obvious is the sheer scale of the Acer Predator XB3. At 27 inches, we wouldn’t call it truly tiny. But neither is it cinematic.",
    "Driving a 4K monitor at high refresh rates in the latest PC games can be problematic, too. One day, this kind of money will buy an 8K monitor at the size of your choosing and the graphics hardware to drive it will be relatively affordable. But that’s years away and, for now, this is what cutting-edge PC gaming looks like. On paper, at least.",
    "Fresh onto the market, the Acer Predator XB3 has a recommended retail price of $1,299 but is already clocking in at $999 in the US on Amazon and can be had for £999 in the UK. However, availability and pricing in Australia has yet to materialise.",
    "That’s a very significant discount over both its Acer 27-inch 4K sibling, the Predator X27, which sits around $1,650, and the Asus’s ROG Swift PG27UQ at $1,789. But it’s also quite a bit more expensive than the next rung down the Acer 4K 27-inch ladder, the $797 Acer Nitro XV3 (XV273K).",
    "All of these monitors offer a 4K resolution over 27 inches with adaptive sync, 144Hz refresh and HDR support. But as we’ll see, the devil is in the details.",
    "For pure aesthetics, the Acer Predator XB3 isn’t going to blow you away from the moment of unboxing. The height, tilt and swivel-adjustable stand is decent enough. But the panel’s chassis is unremittingly anonymous black plastic. It’s disappointing given the price point.",
    "Acer bestowed the XB3 with a panel of fully configurable LED mood lights along the lower surface of the bottom bezel. You can manually set the color output of these LEDs and configure them to ‘reflect’ the color being displayed by the panel itself. It’s a fun feature, but it can’t really make up for the XB3’s relatively dowdy styling and fairly old-school bezels. This is no sleek, slim-bezel wonder.",
    "That doesn’t get any better if you fit the XB3’s three-sided anti-glare hood. It slots on easily and securely and doesn’t do a lot for the XB3 in pure styling terms. But it’s entirely up to you if you fit it and where you see the trade off regards looks and performance.",
    "Specs-wise, the 27-inch panel uses IPS technology and delivers the full 3,840 by 2,160 4K native resolution. You also get 144Hz refresh support and full Nvidia G-Sync hardware rather than mere G-Sync compatibility. You will, it almost goes without saying, need some very serious graphics hardware to keep up with this screen, so bear that in mind.",
    "The other major feature involves HDR support and it’s also where the XB3 diverges most obviously from the more expensive 4K 27-inch gaming monitors on the market. The XB3 makes do with HDR400 support where the Acer Predator X27 and Asus ROG Swift PG27UQ deliver HDR1000 certification.",
    "As the nomenclature implies, the immediate difference is a peak brightness of 400 nits for the XB3 versus 1000 nits for the pricier panels. Investigate more closely and you’ll also find that the XB3 does not offer the full-array local dimming backlight of those pricier panels. Instead, you get a much simpler, cheaper and more conventional single backlight, albeit one enhanced by quantum dot technology.",
    "Elsewhere, connectivity is limited to DisplayPort and HDMI. There’s no USB Type-C input, which is disappointing for laptop-based gamers, even if the XB3’s core target market is desktop gaming rigs rather than portable PCs.",
    "Running in SDR mode, you’ll struggle to spot the difference between the Acer Predator XB3 and the even more expensive 27-inch 4K gaming options out there. The immediate impression is of a very punchy, highly saturated display with colors that seriously pop and the characteristic sharpness and detail that comes with any 27-inch 4K monitor.",
    "In other words, it looks fabulous. In-game you have access via the XB3’s comprehensive OSD menu to multiple levels of pixel overdrive, allowing you to decide where your preference lies regards the trade off between sheer speed and the downsides, including inverse ghosting, that come with really aggressive overdrive.",
    "The lower overdrive options deliver good response without any obvious visual artefacts.",
    "Of course, with 144Hz refresh and Nvidia’s G-Sync adaptive sync tech, the frame rates are silky smooth provided you have a very, very powerful graphics card. If you haven’t got at least an Nvidia GeForce GTX 1080 GPU, you’re not going to get the full benefit of the XB3’s 144Hz refresh capability. In fact, even with the most powerful GPUs currently available, you’re not going to hit sufficient frame rates in all games.",
    "Still, on a subjective level there’s no discernible input lag – and ultimately it’s the subjective experience that counts when it comes to input lag. All told, it’s a very sweet gaming experience, that’s for sure. It’s quick, it’s slick and there’s oodles of detail.",
    "As for the HDR experience, well, some 60-plus PC games support HDR, so it’s more than just a niche technology these days, even if it’s far from ubiquitous. Without full-array local dimming and a mere 400 nits of brightness, the reality is that the XB3 isn’t giving you a true HDR experience.",
    "The highs in terms of brightness aren’t as high and neither can the display achieve the same lows and thus overall levels of contrast of a true HDR display. It’s not a deal breaker, but the XB3 is better thought of as a very good SDR monitor than a true HDR panel.",
    "For the record, the anti-glare hood isn’t really deep enough to make a dramatic difference to the viewing experience, thus it’s something we’d elect not to fit. What’s more, the default factory color and contrast calibration is a little disappointing, with obvious compression at the top of the white scales.",
    "However, that’s easy enough to dial out and the OSD menu is nothing if not comprehensive in terms of calibration and color space options.",
    "But if there is a single, most significant objection to the XB3’s overall experience it involves size. At 27 inches, it’s not a terribly immersive display. At this price point, high-refresh panels in more dramatic sizes and form factors, from 34-inch ultra-wide and beyond, are available. Most are also easier on your graphics subsystem.",
    "On several levels, this is one hell of a gaming monitor. The 4K resolution plus 144Hz refresh and G-Sync support make for outstanding speed and precision. The IPS panel is a high quality affair, too. It’s punchy, it’s accurate, it’s precise.",
    "But at this price point, even at a discount to some other similar panels, you will feel justified in being very picky. And the Acer Predator XB3 is not a flawless package. It looks a little cheap and lacks true HDR capabilities.",
    "More than anything, it’s the limited scale of the 27-inch experience that is the biggest problem for the XB3’s value proposition. If it’s a large, cinematic gaming experience you seek, 27 inches probably isn’t going to cut it.",
    "It’s also worth remembering that a very serious graphics subsystem is required to drive the XB3 properly. As a long term investment, the situation will improve. But if you haven’t already got a very powerful graphics card, budgeting for one should be part of the consideration process for a monitor like the Acer predator XB3."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design and features",
    "14": "Performance",
    "24": "Verdict"
  },
  "links": {
    "Acer Predator X27": "https://www.techradar.com/reviews/acer-predator-x27-review",
    "ROG Swift PG27UQ": "https://www.techradar.com/reviews/asus-rog-swift-pg27uq"
  }
}