{
  "source": "https://www.techradar.com/reviews/google-pixel-2-review",
  "title": "Google Pixel 2 review",
  "category": "phones",
  "updated": "2019-06-18T21:51:21Z",
  "author": "matt-swider",
  "summary": "Still has one of the top smartphone cameras",
  "verdict": "The Google Pixel 2 clues us in on why Google called its phone series Pixel: it was building the best camera on a phone. This second-generation effort fulfills that promise with not only the best-in-class photos, but also dual front-facing speakers and water-resistance. It's a great size, but you'll need to be okay with its dated looks and the fact that there’s no headphone jack.",
  "pros": [
    "Top-of-the-line photos and video",
    "Dual front-facing speakers",
    "Premium water-resistant body"
  ],
  "cons": [
    "Bezels really stand out in 2018",
    "No 3.5mm headphone jack",
    "Camera app could be better"
  ],
  "article": [
    "While the Google Pixel 2 has been surpassed by the Google Pixel 3, it remains a solid Android device at a lower price than its successor - perhaps even the affordable Google Pixel 3a. The older phone follows Google's design ethos, proving that two (or three, or four) rear cameras aren't always better than one on a phone – the photos it takes are that good, and we've got the proof below.",
    "It’s Google’s superior software that pushes this Android Pie phone – now able to run the Android Q beta – to shoot some of the best-looking pictures we’ve seen. While you won't get an optical telephoto zoom, or one of the newfangled ultrawide lenses, the software primacy means the Pixel 2's single rear lens will get better with time.",
    "What’s more, this year's upgrade is faster, water-resistant and adds a new way to call up the Google Assistant: simply squeeze the phone’s sides to launch your new AI buddy. It sounds like a gimmick, but it’s easier than accidentally bumping another (Bixby) button like on the Galaxy S9 and S9 Plus and forthcoming Note 9.",
    "Watch our design and screen review of the Google Pixel 2 series below.",
    "The Pixel 2, with its 5-inch screen, doesn’t look like the future of smartphones, except for its regrettable lack of a 3.5mm headphone jack. It doesn't have one, so you're going to want a pair of our best Bluetooth headphones for this one.",
    "It doesn't look as slick as the simultaneously launched Google Pixel 2 XL, which has an edge-to-edge 6-inch display and modern-date tall 18:9 aspect ratio. The standard Pixel 2 is quite bezel-heavy. Of course, we now know it has more vibrant colors and no signs of screen burn-in problems like its larger counterpart. Pixel 2 may actually be the first-ever case of \"better small than sorry.\"",
    "The bezels won't bother you if you want a phone that’s a one-hand-friendly size, runs smart Google software, and has a fantastic camera that will make your friends – even your Samsung-owning friends – jealous. Google's camera is only sometimes bested by the Samsung camera and the Huawei P20 and P20 Pro... but not always. Video recording, we always found to be better on the Google Pixel 2. It may only bested by the the rumored Google Pixel 3, but don't expect that phone until October.",
    "Plain and simple, the Pixel 2 is for people who favor functionality over fashion.",
    "Update: Google Pixel 2 remains one of our favorite phone in 2018 – despite some technical issues of reliability at launch – for one reason: it has an amazing camera and starts at a normal smartphone price. And it has recently gotten even better thanks to Google awaking the Pixel Visual Core, the phone's co-processor dedicated to imaging, in the February software release.",
    "It keeps getting better though, as Google has released the Android P beta. Your only issue may be finding one in stock. Be sure to check out our hand-picked Google Pixel 2 deals to find the best value.",
    "The Google Pixel 2 price didn't increase year-over-year, so like its dated design, it isn't keeping up with the competition. This is surprising for a phone announced on October 4, and a release date of October 19.",
    "It costs $649 / £629 / AU$1,079 for the 64GB version, and $749 / £729 / AU$1,229 for the 128GB configuration. In the US, this phone is sold on-contract through Verizon only among carriers, but worry not, ordering it from the Google Store will mean it works on all networks, including AT&T, T-Mobile and Sprint.",
    "The Pixel 2 and Pixel 2 XL have the same camera, and our very own Cameron Faulkner had both on his honeymoon to give us example of photos people take outside of a testing lab. Check out some of the shots below, then continue to read out review.",
    "The Google Pixel 2 has a likable size and aesthetic, if you can look past the fact that the phone won’t wow you with an all-screen front. It has a futuristic camera, but the design has a distinctly last-year feel to it.",
    "It easily fits into one hand thanks to its palmable dimensions and light weight. A few years ago this would’ve been considered a phablet, but today, next to the Note 8, it’s a normal-sized Android phone. Most will be able to manage one-handed operation of its 5-inch screen, something that's literally a tall order with the 6-inch Pixel 2 XL.",
    "Both new Pixel phones are now IP67 waterproof (meaning they can survive underwater up to 1m or 3.3ft down for an hour) and retain a glass-and-metal design on the back, albeit with less glass toward the top compared to their predecessors.",
    "The fingerprint scanner has been moved – don’t worry, it’s not off-center, as on Samsung’s new phones – onto the textured aluminum portion of the back, while the camera remains on the glass part, and has a protective ring around it now.",
    "You won’t find a headphone jack on this phone, nor even USB-C earbuds inside the box – it comes with just a simple 3.5mm-to-USB-C adapter. Google may have done some research and figured out that you probably own better headphones than the ones it usually supplies for free – plus, it’s all the more reason for you to buy into those Pixel Buds that just launched, right?",
    "Music on this phone sounds great through headphones, and we even liked listening to music through the dual front-facing stereo speakers. Yes, there's an odd ticking noise coming from some Pixel 2 speakers, but Google promises a software fix for this issue.",
    "Front-facing stereo speakers have become rare among smartphones, which too often fire onboard audio out of the bottom of the phone through a single speaker. Having them increases the size of the top and bottom bezel, but stereo speakers are part of the functionality-over-fashion trade-off we’re talking about.",
    "The Pixel 2 also acquires a feature from the HTC U11 called EdgeSense. Squeezing the phone’s sides launches the Google Assistant, which in our experience has come in handy, and is way better than adding a dedicated AI button – Samsung uses such a button for its Bixby assistant, and we can’t stop accidentally pressing it on the Galaxy S8 and Note 8.",
    "The LG G7 ThinQ uses for a button for Google Assistant, which at least leads to our favorite AI. But this squeezing function is better (and not as easy to accidentally press). Our only complaint is that Google won’t allow you to customize this squeezable feature to open up the camera or another app of your choice.",
    "The Pixel 2 comes in three colors: Just Black, Clearly White, Kinda Blue. Check out our gallery of the Clearly White model below.",
    "The 5-inch Google Pixel 2 display looks superb for Full HD, but it’s also uninspiring at the same time. It’s bright and colorful, though not as rich as a best-in-class Samsung smartphone screen.",
    "What’s distracting is its screen-to-body ratio, with large bezels flanking the screen on all sides. This is even more noticeable in 2018 with so many all-screen Android phones around, including the bigger Google Pixel 2 XL – and it's especially distracting when the standard trio of on-screen buttons are sometimes displayed within a black bar that eats into your precious screen space.",
    "The display works okay with Google Daydream, but it’s less than ideal given the fact that you can see individual pixels at 1080p. The headset really calls for the Quad HD display from the Pixel 2 XL.",
    "We did like the new always-on display, which shows the date, time and notification icons, and the overdue double-tap-to-wake-the-screen functionality. It’s now a lot easier to see what’s going on with your phone before you wake it up.",
    "You just have to get beyond the bezels, and the fact that putting your Google Pixel 2 in a case makes the outline seem even more pronounced."
  ],
  "headers": {
    "10": "Google Pixel 2 price and release date",
    "12": "New Pixel 2 and Pixel 2 XL photo examples",
    "13": "Design",
    "23": "Screen"
  },
  "links": {
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Google Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Android Pie": "https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list",
    "Android Q": "https://www.techradar.com/news/android-q",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "best Bluetooth headphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Google Pixel 2 XL": "https://www.techradar.com/reviews/google-pixel-2-xl-review",
    "screen burn-in problems": "https://www.techradar.com/news/pixel-2-xl-screen-burn-in-problems",
    "Huawei P20": "https://www.techradar.com/reviews/huawei-p20-review",
    "P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Android P": "https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list",
    "Google Pixel 2 deals": "https://www.techradar.com/deals/google-pixel-5-deals",
    "Note 8": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
    "Pixel Buds that just launched": "https://www.techradar.com/reviews/google-pixel-buds",
    "HTC U11": "https://www.techradar.com/reviews/htc-u11-review",
    "Galaxy S8": "https://www.techradar.com/reviews/samsung-galaxy-s8-review",
    "LG G7 ThinQ": "https://www.techradar.com/reviews/lg-g7-thinq-review",
    "Google Daydream": "https://www.techradar.com/reviews/google-daydream-view-review"
  }
}