{
  "source": "https://www.techradar.com/reviews/sejda",
  "title": "Sejda review",
  "category": "computing",
  "updated": "2020-02-04T11:52:52Z",
  "author": "sofia-wycislik-wilson",
  "summary": "A convincingly powerful PDF editor, but you'll need to pay if you need to use it a lot",
  "verdict": "One the whole, Sejda is a pretty polished product, but the text editing wide of things is a little disappointing. Depending on your needs, it may be enough, and the rest of the tools here are top notch.",
  "pros": [
    "Online and desktop versions available",
    "Integrates with cloud storage services",
    "Decent range of editing tools"
  ],
  "cons": [
    "Text editing is a bit flaky",
    "Time limit on free online sessions",
    "Free version has some limitations"
  ],
  "article": [
    "Sejda is a PDF editor that comes in free and paid-for versions, as well as online and desktop editions. There is little difference between the online and offline versions, save for the fact that all of the processing is handled locally in the desktop edition rather than in the cloud – files never leave your computer.",
    "The free versions of both the desktop and online tools have limitations however. You're limited to a maximum of three tasks per day, working with files no larger than 50MB or 200 pages, and only working one document at a time.",
    "Unfortunately, o text editing options here can have mixed results – and this is a shame as it is what most people looking to edit PDFs are seeking to do. While you will find that it is possible to edit text, you're likely to find that fonts are changed, making it apparent precisely where edits have been made. That said, you might be lucky and find your PDFs feature exactly the right font to render this unnoticeable!",
    "Beside text editing, you can also add text and images, as well as shapes and drawings. You can add annotations, create forms, whiteout sections of a document, and more. If you want to overcome the limitations of the free version, you'll have to opt for a subscription. At $5 (about £4, AU$7) per week or $7.50 (about £6, AU$11) monthly, this could work out slightly more expensive than you might have hoped, but it's certainly cheaper than some other options.",
    "The desktop and online versions of Sejda are virtually identical, so if you try one, you know pretty much what the other is like. The interface is non-standard, but easy to navigate nonetheless. The floating toolbar that provides access to all of the various tools and options is always available as you scroll through your document, and tools are intelligently grouped together to make them easy to find.",
    "Sejda is so self-explanatory, it's difficult to fault the tools that are available, but anyone with serious design needs will be disappointed in the lack of precise layout and movement controls."
  ],
  "headers": {
    "4": "User experience",
    "6": "You might also like"
  },
  "links": {
    "Sejda": "https://www.sejda.com/",
    "PDF editor": "https://www.techradar.com/best/free-pdf-editor"
  }
}