{
  "source": "https://www.techradar.com/reviews/doctordocs-medical-transcription-services",
  "title": "DoctorDocs Medical Transcription Services review",
  "category": "computing",
  "updated": "2019-12-18T19:00:21Z",
  "author": "jonas-p-demuro",
  "summary": "Real people for a higher accuracy of transcription",
  "verdict": "DoctorDocs offers an affordable way to get documents transcribed, with a high degree of accuracy.",
  "pros": [
    "Upfront pricing",
    "Multiple methods of contact",
    "Variety of dictation methods",
    "Transcriptions edited for accuracy"
  ],
  "cons": [
    "Very few reviews",
    "Unclear mobile platform support",
    "Only integrates with a single EMR"
  ],
  "article": [
    "DoctorDocs Medical Transcription Services, as the name suggests, is a company devoted to the medical transcription space for the US market. It has been in the business since 2003, with its company headquarters located in Pompano Beach, Florida. In addition to the core mission of medical transcription, ancillary services including EMR software, medical billing and coding are also offered.",
    "An important part of any dictation service is the flexibility of dictation method, as different clinicians have varied workflows, and they want a choice of dictation devices that can be used. Here, DoctorDocs has them covered, with the ability to dial in from either a digital or analog phone line for starters. Going beyond that, younger clinicians often want to use other devices, and the dictation can also be accomplished via a handheld digital recorder, or via an Android or iOS smartphone.",
    "Another key to any medical transcription service is the level of accuracy offered, and DoctorDocs goes the extra mile in this area as well. While the trend in transcription is towards computerized voice recognition via an automated process, this produces variable results, with clinicians complaining that these solutions require adaptation, and in some cases dictate slower, with less abbreviations used, making the dictation a more cumbersome process, and begging the question if it is just faster to type it out directly. DoctorDocs utilizes a two step process, and neither step is automated. Rather, the voice dictation gets converted to text by a professional transcriptionist for a high level of accuracy. Then, as a second step, an editor reportedly relistens to the entire audio file, and goes over the transcribed document to ensure the best version gets produced.",
    "Other details of the transcription process at DoctorDocs are also favorable, with a 24 hour turnaround time, that runs 7 days a week. Documents and voice files are kept secure with 128-bit encryption, that is HIPAA compliant.",
    "We wish things were as strong in the EMR department, and those looking for more of a virtual scribe service should look elsewhere. On one side, DoctorDocs does integrate with an EMR, STI Chart Maker, a leading solution with over 40 years of experience. However, for users of any other EMR, which the vast majority do, then they either need to shift to the STI Chart Maker for full EMR integration, or accept that DoctorDocs is more of a medical transcription service, and office staff time will need to be devoted to uploading completed transcriptions in their EMR of choice.",
    "Sweetening the deal, is that this STI Chart Maker EMR gets included for free with the DoctorDocs Billing and Coding package, which is fully ICD-10 compliant. It also features Revenue Cycle Management that promises to increase profits, with the bold claim of a 10-20% increase in the first month. For an “Aggressive flat rate monthly with no a la carte fees,” this DoctorDocs service can reduce rejected claims, and decrease important office staff time on collecting fees.",
    "A criticism of the service is the lack of reviews. Perhaps this is a case of “Be satisfied, tell one person, but be dissatisfied, and tell ten people,” but it is hard to know with certainty. The very few user reviews that we found indicate general satisfaction with this service.",
    "The downsides we can find include that it is not clear if there are dedicated mobile device apps, or they simply can be used to create a voice file, and then manually uploaded (We searched both the Apple Store, and Google Play Store, but came up empty for an app by this service’s name). Also, those looking for more of a virtual scribe experience, with the transcribed documents automatically appearing into their EMR of choice will be disappointed, as DoctorDocs only integrates directly with one EMR, STI Chart Maker, which is not even a particularly popular one.",
    "DoctorDocs offers support for their service via a toll free 800 number which you can make a call and “Speak to a live person,” and also the option of email contact. There are no listed hours or days of operation for support, although it is stated that it is “Always available.",
    "We appreciate the simple to understand, and upfront pricing for the DoctorDoc service. Rather than making us comb the website for a price to no avail, the price given is $0.099 (£0.077) per gross line of text, whether long or short, in Courier New 12 point font, billed once per month. There is no setup or startup fee.",
    "There are also options for volume discounts for busier clinics. For those willing to prepay, a block of 5,000 lines can be purchased for $445 (£347), a discount of 10.1% off the full price of $495 (£386). For those even more loquacious clinicians, a block of 10,000 lines is offered to prepay for $850 (£662), which represents an even greater savings of 14.1%.",
    "When looking for a medical transcription service DoctorDocs has its pros and cons. The highs include its double transcription process, the wide variety of devices to transcribe from, and its upfront pricing with higher volume, prepaid discounts. On the other hand, the lows include the lack of user reviews, the unclear mobile app availability, and the lack of integration with most EMR’s. Factoring all of this in, for a more basic office that just really needs their documents transcribed with great accuracy, at an affordable rate, DoctorDocs can more than fulfill their needs."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "8": "Support",
    "9": "Pricing",
    "11": "Final verdict"
  },
  "links": {
    "DoctorDocs Medical Transcription Services": "https://doctordocs.com/",
    "medical transcription": "https://www.techradar.com/best/best-medical-transcription-services",
    "EMR": "https://www.techradar.com/best/best-electronic-medical-record-emr-software"
  }
}