{
  "source": "https://www.techradar.com/reviews/oppo-r17-pro",
  "title": "Oppo R17 Pro review",
  "category": "phones",
  "updated": "2019-03-31T17:35:31Z",
  "author": "abbas-jaffar-ali",
  "summary": "A pricey all-rounder",
  "verdict": "The Oppo R17 Pro features a good camera and an in-screen fingerprint sensor but OPPO's decision to not use a flagship processor makes it hard to pay a flagship-level price for it",
  "pros": [
    "Good camera",
    "Snappy performance",
    "Beautiful screen"
  ],
  "cons": [
    "Pricier than competition",
    "ColorOS can be a put-off",
    "Not the latest Android"
  ],
  "article": [
    "Note: In some regions (including the UK) this phone is known as the Oppo RX17 Pro.",
    "In the UK, the Oppo RX17 Pro has just enjoyed a chunky discount, and you can now pick it up for only £449. That's a great saving, but also reduced is the Oppo Find X, with an impressively large display and novel camera trick, so if you're on the market for an Oppo handset check that one out too.",
    "The Oppo R17 Pro is the Chinese company's latest handset that tries to balance the right amount of flagship features with an affordable price tag.",
    "Although Oppo is a big name in its home country of China, it's still looking to make a mark in places like the US, UK and Middle East.",
    "That's set to change in 2019 as the firm gets serious about international expansion, as it eyes up the likes of Huawei, Xiaomi and Samsung.",
    "The R17 Pro has its sights firmly set on the cut-price flagship competition including the OnePlus 6T, Honor View 20 and Xiaomi Mi Mix 3, which means it has its work cut out to stand out.",
    "The Oppo R17 Pro price is £549 (AU$899, SAR 2,599, around $690) SIM free, which gets you the configuration of 8GB of RAM (6GB in Australia) and 128GB of storage, and is available to buy now in the UK and Middle East.",
    "While those specs are pretty decent as a base, keep in mind that there is no expandable storage on the R17 Pro which could be a limiting factor for some.",
    "The R17 Pro is priced below flagships like the Huawei Mate 20 Pro and Samsung Galaxy Note 9, but higher than its core rivals from OnePlus, Honor and Xiaomi.",
    "The Oppo R17 Pro is an attractive phone with a large screen, minimum side bezels and a premium glass body.",
    "It looks very much like the OnePlus 6T with a water-drop shaped notch on top and a small chin at the bottom - and for good reason. Both Oppo and OnePlus are owned by the same company and this isn't the first time we've seen the two companies produce almost identical looking devices.",
    "There is one very clear distinction between the two (other than the logos on the rear) and that's the presence of three cameras on the back of the Oppo R17 Pro, versus just two rear snappers on the 6T.",
    "The R17 Pro is available is two colors - Emerald Green and Radiant Mist. We received the Emerald Green version which is elegant and similar to the color tone Huawei used on the Mate 20 Pro.",
    "Although the overall design of the Oppo R17 Pro is minimal and elegant, the part where the screen meets the frame is quite sharp along all edges and very noticeable if you like fidgeting with your phone in your hand.",
    "At 183g, the Oppo R17 Pro is also a tad bit on the heavier side, though that does make the phone feel more premium.",
    "There's a power button on the right and volume keys on the left, while the USB Type-C port sits at the bottom with the lone speaker and the dual-SIM tray.",
    "The Oppo R17 Pro does not support microSD expansion and lacks a 3.5mm jack - with no adapter provided in the box. You do get a pair of USB-C earphones bundled in though, so all is not lost.",
    "Another bonus item in the box (for the UK at least, where it's called the Oppo RX17 Pro) is a soft-touch rubber case, allowing you to instantly apply a layer of protection to the phone. It's a good addition too, as the smooth glass finish doesn't allow for much grip in the hand without the case on.",
    "The back is plain and smooth with three cameras aligned vertically in the center. There is a camera bump however, but because it's in the center, the phone doesn't rock when placed on its back.",
    "Up front there's a large 6.4-inch OLED screen with minimum bezels and a tiny notch similar to the one found on the OnePlus 6T. It boasts a Full HD+ resolution (1080 x 2340), giving you a 402ppi pixel density ensuring text and images look sharp. Watching videos on YouTube and Netflix are clear and crisp, however you'll have to make do with the black bars on either side when videos are viewed horizontally. You can zoom in slightly to make the video fullscreen, but that just means slight cropping will occur at the top and bottom.",
    "There's an in-screen fingerprint scanner on the front giving the phone a nice clean look on the back, although it's not as quick to recognize your print as those not built into displays.",
    "It does work though, and during our time so far with the R17 Pro it appears to be accurate too."
  ],
  "headers": {
    "6": "Oppo R17 Pro release date and price",
    "9": "Design and display"
  },
  "links": {
    "Oppo Find X": "https://www.techradar.com/reviews/oppo-find-x",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "Honor View 20": "https://www.techradar.com/reviews/honor-view-20-review",
    "Xiaomi Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/clone-huawei-mate-20-pro-review-uae",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review-uae"
  }
}