{
  "source": "https://www.techradar.com/reviews/asus-lyra-voice-ac2200",
  "title": "Asus Lyra Voice (AC2200) review",
  "category": "computing",
  "updated": "2019-06-14T11:33:46Z",
  "author": "alan-dexter",
  "summary": "Looks good, sounds good and performs well, but is somewhat let down on the software side",
  "verdict": "This is a quality piece of hardware that’s well worth considering depending on the layout of your home, but Asus can do a lot more on the software side of things",
  "pros": [
    "Looks good, sounds great, performs well",
    "Operates as a Bluetooth speaker",
    "Alexa works well even at a distance"
  ],
  "cons": [
    "Software needs work",
    "Not ideal for every layout"
  ],
  "article": [
    "The next step for mesh routers appears to be integrating voice assistants into their repertoire. With the release of the Lyra Voice, Asus joins the likes of the Netgear Orbi Voice by releasing a router that also takes a turn as a gateway to the wonderful world of Amazon Alexa.",
    "There are a few important differences between the two solutions, which we’ll come to in due course, but the headline is very much the same: why buy a separate Amazon Echo, Echo Dot or Echo Plus, when you can get your router to do it all?",
    "How this solution fits into your home is an important consideration, because if the internet enters your house in a hallway, under a staircase or somewhere out of the way, then this limits the usefulness of the main selling point of the Lyra Voice.",
    "The good news here is that the Lyra Voice can work alongside your existing mesh network (or indeed any Wi-Fi router), but in many ways it’s a much neater as an all-in-one solution (if your layout will play ball).",
    "In terms of headline figures, this is very much a router in the same guise as the original Asus Lyra, offering AC2200 connectivity; that is 400Mbps connections at 2.4GHz, and dual 867Mbps connections at 5GHz.",
    "As stated it works as an AiMesh Node, can also work as a straight Wi-Fi range extender, and as is the norm in this day and age, comes with Trend Micro network protection to try and prevent your network getting riddled by viruses.",
    "Like the Netgear Orbi Voice, this is very much seen as a premium product, and when compared to normal routers, the price can seem a little off.",
    "At $211 (£223, about AU$310), plenty of people will be put off, but actually when you consider you get a fully-functioning (and decent-sounding) Bluetooth speaker with Alexa for your money as well, it isn’t quite that value nightmare you may initially think.",
    "Those looking for a better audio experience will want to spend more on dedicated units, and Amazon’s own Echo solutions have seen updates and certain functionality hit before third-party devices like this, but overall, this is a reasonable package for the money.",
    "Ease open the box of the Asus Lyra Voice, and you’ll be immediately presented with the fabric finish of the unit. There’s a slightly thinner band in the middle adorned with the Asus logo, the light strip used by Alexa to show whether it’s heard you (and also used during setup to show where it is in the installation process) and four buttons on the top that control volume, mute the speaker and wake up Alexa instantly.",
    "You’ll rarely use these buttons as all the operations are available as voice commands as well, but they’re an option if needed. Around the back of the unit is a on/off switch, as well as the two Ethernet ports and power connector.",
    "Overall, we like the look of the Lyra Voice, and while the material covering the speakers is a little loose to the touch, it’s actually on the sound front that it should be judged, and here we have to say we’re impressed.",
    "It’s loud without being overbearing, and it isn’t overly bass heavy, which can often be the case with Bluetooth speakers. Speaking of which, when paired as a Bluetooth speaker or streaming directly, it makes for a thoroughly enjoyable musical experience, and thanks to Alexa it is easy to control as well.",
    "In theory setup should be a breeze, but that brings us to our main concern with this unit...",
    "We initially tried setting up the Lyra Voice as an additional unit to an existing mesh networking, but couldn’t get it to complete the installation, despite picking up the network we wanted it to attach to easily enough.",
    "We then tried setting it up in router mode, but got unstuck at the end of installation as well. It transpired that there was a problem with the setup app, and judging by the comments on the app store, this was a problem that had been ongoing for some time.",
    "Without this key ingredient, the Lyra Voice could simply not be configured properly, even when trying the numerous apps that Asus offers and supports (there really are a bewildering array to choose from).",
    "After several weeks, an update finally became available, and at this point we could actually finish the installation and use it as intended. However, we then witnessed performance that was well below what you would expect from a modern router -- 5Mbps even stood next to it. Fast forward a few more eagerly-downloaded updates, and we finally have a router that performs well. But as experiences go, this hardly instils confidence.",
    "To be fair, the software on the whole is fine: it's reasonably intuitive, and provides a wealth of information about how your router is being used, who has access to it, and what mode it is in. Still, we are left with the nagging doubt that comes with weeks of not being able to use the device as intended.",
    "Once configured properly (and updated), the actual throughput you’ll enjoy from the Lyra Voice is impressive, especially at range. It’s a consistent performer too, which is something that can’t be said about the Lyra Trio.",
    "Indeed for a single router, it managed much better coverage that we would have expected, and for more modest sized homes, there’s a lot to like here as a standalone router.",
    "Obviously a potential fly in the ointment here is the imminent arrival of 802.11ax (or Wi-Fi-6), but that shouldn’t detract too much from the fact that the Lyra Voice represents a mature existing technology working pretty much as good as it’s going to.",
    "The Alexa and speaker side of things are also impressive, and we found talking to Alexa, even from a distance, on different floors and behind doors worked well. The responses are clear, and it was reasonably rare for us to have to clarify a question. As a music streaming device we were impressed, and while it isn’t as loud as the aforementioned Orbi Voice, for a normal (read modest) sized house, it performed perfectly well, and unlike that device it acts as a Bluetooth speaker as well.",
    "The Lyra Voice looks exactly like a standard Bluetooth speaker, which is impressive when you factor in that it’s also a six antenna mesh router and Alexa assistant as well.",
    "Performance is surprisingly good, and it can be setup to work with your existing mesh network for larger houses as well. Sound quality is great, and Alexa is responsive even at a distance.",
    "However, we had numerous problems with the software initially (forcing us to delay the review in fact), and while it now works as intended, this did knock our confidence in Asus’s ability to maintain the software in a reasonable timeframe.",
    "Although our experience with the Asus Lyra Voice was marred by the initial software problems, once resolved, this turns into a versatile and powerful router for many layouts.",
    "The combination of a smart assistant and decent Bluetooth speaker makes for a tempting addition to normal router capabilities. And while it may cost a little more than a normal router, it feels like a good return on the investment. If only the software worked from the off..."
  ],
  "headers": {
    "6": "Pricing and availability",
    "9": "Design and setup",
    "14": "Software",
    "19": "Performance",
    "23": "Verdict"
  },
  "links": {
    "Netgear Orbi Voice": "https://www.techradar.com/reviews/netgear-orbi-voice",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review",
    "Echo Plus": "https://www.techradar.com/reviews/amazon-echo-plus-review",
    "Lyra Trio": "https://www.techradar.com/reviews/asus-lyra-trio-ac1750"
  }
}