{
  "source": "https://www.techradar.com/reviews/roccat-kova-aimo",
  "title": "Roccat Kova Aimo review",
  "category": "computing",
  "updated": "2019-03-28T15:34:31Z",
  "author": "matt-hanson",
  "summary": "An ambidextrous and versatile gaming mouse",
  "verdict": "If you’re after a gaming mouse that allows you to tweak and configure almost any setting so that it responds just the way you want, then look no further than the Roccat Kova Aimo.",
  "pros": [
    "Ambidextrous",
    "Solid build quality",
    "Very configurable",
    "Decent price"
  ],
  "cons": [
    "Plain design",
    "Slightly clunky software"
  ],
  "article": [
    "Roccat has been producing a steady stream of gaming peripherals for a while now, which mix attractive and functional designs with solid build quality and dependable performance. Its latest gaming mouse, the Roccat Kova Aimo, continues that winning streak.",
    "In Roccat’s marketing materials for the Kova Aimo, there’s one word that you’ll see over and over again: versatility, and it seems that is the theme with this gaming mouse.",
    "This mouse is versatile in the fact that it’s been designed to be used by both left- and right-handed gamers, with an ergonomic design that feels comfortable even after long gaming sessions.",
    "It’s also versatile in the sense that it can be heavily customized with Roccat’s Swarm software, allowing you to tweak the mouse to perfectly suit your game preference and play style.",
    "For many people, especially when playing competitively, the feel and responsiveness of their peripherals is a very personal preference, so being able to tweak the Roccat Kova Aimo to perform the way you want it to is very tempting indeed.",
    "With that promise, and Roccat having made one of the best gaming keyboards ever with the Roccat Vulcan 120 Aimo, we have big hopes for the Roccat Kova Aimo.",
    "The Roccat Kova Aimo costs $49.99/£52.99/AU$109.95, which puts in in the same ballpark price-wise as the Logitech G502 Hero and SteelSeries Sensei 310. These are two excellent gaming mice that offer excellent performance, but not much in the way of features.",
    "At this price, the Roccat Kova Aimo offers a lot of value, thanks to a number of included features that other gaming mice in this price bracket don’t have, such as an ambidextrous design, extra buttons and plenty of configuration options.",
    "The design of the Roccat Kova Aimo isn’t as over-the-top as some gaming peripherals, though there’s a few angular edges that leave you in no doubt that this is a device aimed at gamers. Both the scroll wheel and a strip along the back of the mouse are lit by colored RGB LEDs.",
    "The Roccat Kova Aimo’s body is made of plastic, which makes it light and comfortable to hold, but it still feels robust. It lacks the physical strength of the metal Mad Catz R.A.T series of gaming mice, but it doesn’t feel insubstantial.",
    "The buttons on either side of the mouse are within easy reach of your fingers, and they need a decent click for them to respond. We actually like this, as it means they are not as prone to being accidentally pressed as other mice.",
    "Thanks to an ambidextrous design, all buttons are mirrored on either side, making it comfortable to use regardless of whether you're right or left handed.",
    "The Roccat Kova Aimo also comes with a long braided USB cable, which is a nice touch. Overall, the Roccat Kova Aimo isn’t the most attractive gaming mouse we’ve seen – nor is it the ugliest. It’s got a nice-enough-looking design with some subtle lighting, and crucially feels light enough to use comfortably without feeling cheap.",
    "As we’ve come to expect from Roccat’s gaming peripherals, the Roccat Kova Aimo is a decent performer that feels comfortable to use, and offers fast and responsive controls over a variety of games and genres.",
    "You can plug the Roccat Kova Aimo into a Windows 10 PC and use it straight away, but if you want to make the most out of the mouse, you’ll need to install the Roccat Swarm software. We have to admit, it’s not our favorite piece of software.",
    "Not only does Swarm force your PC to restart during the installation process, but for it to work with the Roccat Kova Aimo, you then need to download and install an additional ‘module’. It’s not the most user-friendly of processes.",
    "However, with the app installed, you can get excellent granular control over the Roccat Kova Aimo. For example, you can tweak the dots per inch (DPI) switcher to set the mouse to a certain DPI when you press the DPI Switcher button, which is placed just below the scroll wheel. There are five DPI levels you can set using a slider, from 250 to 7,000. The higher the DPI, the faster the mouse responds.",
    "Other settings allow you to tweak the scroll speed and double-click speed, assign buttons and change the polling rate as well. It’s an impressive level of control that allows you to configure the Roccat Kova Aimo so that it suits your playstyle. You can save your settings as a game profile, allowing you to switch between up to five profiles, so you can have different sensitivity settings and button configurations for certain games.",
    "Out of the box, we liked how the Roccat Kova Aimo felt and performed. But, after tweaking it with the Swarm software, we are truly pleased with the results, allowing us to find a sweet spot between speed and precision.",
    "Setting up different profiles for FPS games like Battlefield V and RTS games like Total War: Warhammer II, which require different mouse controls, meant that the Roccat Kova Aimo proved to be a very versatile gaming mouse, no matter what type of game you enjoy playing.",
    "The extra buttons were also easy to configure, either with game-specific commands or by running macros. Overall, the Roccat Kova Aimo was an excellent performer that is suitable for pretty much any gaming genre.",
    "On taking the Roccat Kova Aimo straight out of the box, we liked what we saw, but its understated design doesn't stand out as much as other gaming mice. Out of the box performance was also decent, but once we set up the mouse with the Swarm software and tweaked the mouse further, we are fully impressed.",
    "This is a gaming mouse that offers you a broad array of settings that allow you to make it feel and perform just the way you want to. The granular level of configuration the Roccat Kova Aimo allows makes it an ideal gaming mouse for people who play competitively – where that level of control really makes all the difference – or for people who play a wide range of games that span genres, thanks to the ability to set up numerous profiles for various games.",
    "It also feels solidly built and comfortable to use, and the fact that both left- and right-handed gamers can enjoy this mouse is a big plus in our eyes.",
    "Finally, the price is just right, making this an affordable – as Roccat is keen to stress – versatile gaming mouse that rewards users who don’t mind tweaking its settings.",
    "Image credits: TechRadar"
  ],
  "headers": {
    "6": "Price and availability",
    "8": "Design",
    "13": "Performance",
    "21": "Final verdict"
  },
  "links": {
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "best gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Roccat Vulcan 120 Aimo": "https://www.techradar.com/reviews/roccat-vulcan-120-aimo",
    "Logitech G502 Hero": "https://www.techradar.com/reviews/logitech-g502-hero",
    "SteelSeries Sensei 310": "https://www.techradar.com/reviews/steelseries-sensei-310"
  }
}