{
  "source": "https://www.techradar.com/reviews/practice-fusion",
  "title": "Practice Fusion review",
  "category": "computing",
  "updated": "2019-11-22T17:00:15Z",
  "author": "jonas-p-demuro",
  "summary": "The leading cloud-based EHR for ambulatory practices",
  "verdict": "Practices looking for an affordable EHR should take a close look at Practice Fusion, that also provides features including cloud storage and ICD-10 certified billing.",
  "pros": [
    "Free trial available",
    "Affordable cost",
    "Customizable templates",
    "Electronic superbills"
  ],
  "cons": [
    "Limited support option after initial training",
    "Lack of upfront pricing",
    "Clunky workflow"
  ],
  "article": [
    "Practice Fusion is the leading cloud-based ambulatory EHR software solution in the US market, used by approximately 30,000 medical practices to provide care to over 5 million patients each month. This platform was founded back in 2005, and while focused on smaller physician practices, it also provides services to pharmacies, clinical labs and imaging centers for a seamless patient experience.",
    "Practice Fusion does include the usual assortment of functions to support your practice, which includes modules for patient scheduling, e-prescribing, and a patient portal. There are also multiple options for data entry that include voice recognition, and the less common handwriting recognition, in addition to keyboard entry for ease of use by clinicians in their daily workflow.",
    "The Practice Fusion EHR also offers a number of innovative features such as their “Intuitive charting.” This includes the Smart Charting features that avoid having to re-enter data, with available shortcuts. Additionally, unlike with some other EHR’s that require templates of notes to be created from the start, Practice Fusion supplies a library of templates, that can be further customized as needed.",
    "A major advantage of an EHR is e-prescribing, and here Practice Fusion excels. This allows the clinician to connect to literally any pharmacy in the country, with the ability to initiate prescriptions, and handle pharmacy communications, all from within the platform. Also useful are prescription refills in a downright slick 2-clicks. We also appreciate the ability to have common prescriptions done with via templates, and the option for the creation of frequent prescription lists. Additionally, automating tasks such as checking for drug-drug interactions, and drug allergies when prescribing makes this state of the art.",
    "Not just for the clinicians, Practice Fusion has advantages for streamlining the office as well. A nice feature is the paperless, electronic faxing that is totally integrated into the system, and is HIPAA compliant as well. There are also benefits for appointment scheduling, with the ability to automate electronic patient reminders to reduce ‘no-shows,’ and online intake forms to make check-ins faster and easier.",
    "The Practice Fusion EHR also provides a single portal for the office to complete their tasks. Rather than having to go to each individual insurance provider’s website, right from within the EHR, insurance eligibility can be verified. Co-pays can also be tracked, and entered as collected at any point prior to, during, and even after the patient’s visit.",
    "Billing also gets facilitated through Practice Fusion. For example, it is ICD-10 certified, so the bills submitted are more accurate, and no additional software is needed. The billing is not done directly by Practice Fusion, but rather through available partners that supply additional software to interface with Practice Fusion- or billing can be kept in house for those that prefer. Billing partners include a choice of leading solutions from AdvancedMD, CollaborateMD, Kareo, and others. Also, the process gets significantly streamlined through the use of electronic superbills that can actually scan, and pull in ICD-10 diagnoses from the electronic chart notes, designed to be accurate, and avoid double-entry.",
    "No EHR is perfect, and Practice Fusion does fall short for some users. In some cases, end users, particularly solo practitioners find paying the monthly subscription for this EHR, even at the current modest cost, is unpalatable given that it was previously free. While everyone likes to get something for nothing, it should also be realized that to continue a quality EHR (or any other software for that matter) on a permanent free basis, is pretty unrealistic.",
    "Another downside is that this software is less than intuitive, with a clunky workflow. Frequent pop ups, often not relevant to the situation at hand, are another deterrent to a smooth progression of work.",
    "The total dependence of using Practice Fusion through only a website is another con. While the pro of this approach is that it works on just about every device that accesses the Internet with a browser, there are times where it falls short. A key one is that there are no mobile apps available. This makes performing essential tasks while away from the office, even a simple one like checking the schedule of upcoming patients, makes what should be a simple affair into a frustrating activity.",
    "Similar to plenty of other EHR’s, Practice Fusion is not upfront about its pricing structure on its website. The only way to price this solution out is to sign up for their free trial, which requires giving your contact details, and then to find out.",
    "We lament that the pricing is not provided more transparently, but it simply is not. Elsewhere, we gleaned that Practice Fusion starts at $99 (£81) per user per month, which would make this a more affordable option than some competitors, although it is frustrating that we truly cannot even confirm this starting price more directly. While this price point makes Practice Fusion cost less than some other EHR’s, realize that this was a substantial price increase as last year this product was completely free.",
    "Like some other EHR solutions, Practice Fusion is all web based, as a SaaS model with data saved in ‘The cloud.’ As such, there is no software to install for desktop Windows and Mac users, and neither any mobile apps for iOS nor Android.",
    "While there is no in person support for training, other options include live online, webinars, and provided documentation. After the initial training, ongoing support is offered online, but is restricted to only business hours.",
    "The Practice Fusion is an attractive offering in the EHR space. Even with its currently affordable monthly cost, it offers useful features such as storage of data in the cloud, customizable templates, electronic superbills and a variety of input methods to fit different clinician workflows."
  ],
  "headers": {
    "1": "Features",
    "7": "Drawbacks",
    "10": "Pricing",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "Practice Fusion": "https://www.practicefusion.com/",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}