{
  "source": "https://www.techradar.com/reviews/kingdom-hearts-3",
  "title": "Kingdom Hearts 3 review",
  "category": "gaming",
  "updated": "2019-11-27T17:03:54Z",
  "author": "vic-hood",
  "summary": "Oh Mickey, you’re so fine",
  "verdict": "Kingdom Hearts 3 is a charming and action-packed adventure, marrying the fantastical nature of Final Fantasy with the magical familiarity of Disney in worlds that are almost indistinguishable from the films they depict. However, the convoluted story and slow-burning intro could be enough to deter new players from giving the series a chance.",
  "pros": [
    "Stunning and vibrant worlds",
    "New combat features",
    "New side-missions and challenges",
    "Longer levels"
  ],
  "cons": [
    "Convoluted story",
    "Slow-burning introduction"
  ],
  "article": [
    "As an avid fan, I’ve spent a lot of time defending the Kingdom Hearts series from those who 'just don’t get it', and find the prospect of a game which marries together two worlds as different as Final Fantasy and Disney absolutely ludicrous. “So your sidekicks are Donald Duck and Goofy?” they would scowl as I enthused about Kingdom Hearts 3. “And it’s meant for adults?” It grows tiresome pretty quickly.",
    "I swore I would write an article on Kingdom Hearts that would be the definitive piece on why everyone should play it; a piece that would emotionally rock every naysayer to the core and silence their insolent anti-Mickey waffling. I didn't write that piece – and I don’t especially owe anyone an explanation for why Kingdom Hearts is important to me – but, for the love of Minnie, I’ll try to explain briefly here.",
    "When I was a child, my parents used to take me on walks around a forest not far from our house. After strapping on my wellington boots, puffer jacket and pom-pom hat, we'd crunch through the leaves of the woodland, collecting sticks along the way.",
    "At the end of the walk, with my arms bundled with my finest collection of sticks, we would stop at a small rickety bridge over a river. We would line up, side by side, at the edge of the bridge and choose our favorite stick. On the count of three, we would throw our stick into the river, before rushing to the other side of the bridge to see whose stick emerged first.",
    "The game is called Pooh Sticks and is based on a game played by Winnie and his friends in one of the movies, or books, or something. As a child, watching my stick emerge victorious was a satisfying end to the excursion. It was a family tradition we kept up until my parents divorced a few years later.",
    "Years later, I found myself playing Kingdom Hearts through for the first time, both 1 and 2. It was essentially a fun and wholesome ride from the start, carefree and a bit silly, until I travelled to Hundred Acre Wood and met Winnie the Pooh. Bear with me (pun fully intended)…",
    "The site of the silly yellow bear in his red crop top woke something in me, memories of the sticks and the forest, memories of my childhood that I'd locked away for years in the chest we reserve for such things: your favorite stuffed teddy, the smell of granny’s baking… and Pooh Sticks.",
    "Ten years later, Kingdom Hearts 3 has allowed me to return to Hundred Acre Wood, the silly yellow bear and the memory of that old bridge we threw sticks off.",
    "Despite the obvious charm and general feel-goodness the Kingdom Hearts series projects, arguably the most off-putting element for new players is the complex storyline and, I’ll be honest, it’s no surprise. The multi-part saga is set over various generations, and involves multiple characters (some of whom are just the same character but without a heart, or with a heart, or in the same heart... who knows).",
    "As someone who's played both Kingdom Hearts I and II, and considers herself a lifelong fan, I felt I had a fairly solid grasp on the lore of the series – but it was evident from the moment I set foot in Kingdom Hearts 3 how wrong I was.",
    "If there’s anything I'd advise before starting the series’ latest addition, it would be to play not just the first two games but also Kingdom Hearts: Birth by Sleep (at the very least). A lot of the story involves characters from this title, and it will save you the hassle of trying to google what the hell is going on once you get started, as I had to.",
    "There are a lot of ominous, spikey, white-haired men in cloaks, and several characters who look quite similar, so brushing up on the lore first is probably a good strategy. If all this feels like too much work, then we're here to break it down for you as succinctly as possible in one paragraph – at least where the story is when you begin Kingdom Hearts 3.",
    "So, Master Xehanort, the series’ main antagonist – who's easy to identify, as he's the old, bald egg-headed man with a goatee and menacing grin – is back, and is planning to instigate another Keyblade War between the Seven Guardians of Light (the good guys) and Organization XIII’s Seekers of Darkness (the bad guys) by forging a legendary weapon called the X-blade.",
    "Essentially, Xehanort is a bit of a jerk, and wants to plunge the world into darkness again. It’s much more complicated than that, but that’s the gist.",
    "In Kingdom Hearts 3 you play as young Keyblade master Sora – who you’ll be pretty familiar with if you’ve played the previous titles. Sora saves the world from Xehanort and the Heartless (darkness beings) a lot, but he couldn’t do so without his trusty sidekicks: Donald Duck and Goofy.",
    "Anyway, because Xehanort wants to pit the Guardians of Light against the Seekers of Darkness, it’s up to Sora and friends to choose seven Guardians of Light for the battle, otherwise Xehanort will take seven innocent hearts instead. Long story short, that’s where Kingdom Hearts 3 begins, you begin searching for lost Keyblade masters who can serve as the Guardians of Light in the Keyblade War. Still with me? Good.",
    "Annoyingly, Kingdom Hearts 3 doesn’t actually do a very good job of explaining the story to you, instead just showing a montage of the events to date without any dialogue – although the accompanying tracks from Hikaru Utada are mesmerizingly beautiful. Instead, you're thrown straight in the deep end, and tasked by Master Yen Sid (remember the wizard from Fantasia?) to regain Sora’s strength and find three lost Keyblade wielders from over a decade ago: Aqua, Ventus, and Terra. You'll know these three if you played Birth by Sleep – I had not.",
    "This immediately leads into you venturing into your first Disney-inspired world: Olympus (aka the home of Hercules). From the moment Sora and friends stumble into the Grecian level, it’s clear that Square Enix has definitely upped its game. While this is understandable given that Kingdom Hearts 2 released a horrifying 14 years ago, it’s also awe-inspiring, as it’s almost like jumping into an interactive version of the films we’ve grown up with. Whether that’s down to the stunningly vibrant environments or the return of characters’ original voice-actors, it’s a welcome embrace following the confusing introduction. Nothing sets you at ease like the sarcastic tones of James Woods as Hades.",
    "Olympus also gives us a chance to try out some of the new quality-of-life and combat mechanics such as freerunning, formchanges and attractions. Some of the keyblades you obtain in your travels are able to change shape or form. Each Keyblade has its own unique formchanges, by activating formchange you can gain access to different combos, magic and a new finishing move. Each formchange (and keyblade) has its own specialized abilities, making it better at either defense, magic or strength. This gives you a bit more control over your fighting style.",
    "But if you prefer a less subtle approach, then attractions or team attacks may be for you. Team attacks see you pairing up with Donald and Goofy to release a devastating assault on enemies – these can also extend to characters you meet along the way such as Rapunzel and Flynn from Tangled, Hercules, and Woody and Buzz. However, attractions are the true spectacle, both in terms of enemy damage and visually. Attractions can be triggered when you hit an enemy which has green circle around them; this then leads to a large-scale attack based on a Disney theme park ride. For example, the pirate ship attraction sees you summoning a huge, colorful pirate ship (surprise huh?) which knocks down any enemies within its range.",
    "However, freerunning is potentially our favorite new feature, offering Sora the chance to run up walls at his leisure. While it may seem like a small change, it actually opens up the worlds a lot more than before. For example, while we may have visited Twilight Town in previous Kingdom Hearts titles, being able to search on top of buildings for chests and secrets adds a replayability factor which was potentially lacking before. And speaking of replayability…",
    "Kingdom Hearts 3 has added a bunch of quirky new side missions and challenges that you can undertake during your epic journey to save the world. Photographing all the hidden lucky emblems (Mickey Mouse symbols) is arguably one of the most enjoyable tasks you can try your hand at, especially if you’re the sort of super-Disney nerd who loves to find the hidden Mickeys at Disney World. It’s a silly side mission, and doesn’t reward you in all the munny, but it’s a fun break away from the main story, and also gives you a reason to revisit previous levels.",
    "This is an option that you should definitely take advantage of, especially considering that Kingdom Hearts 3 seems to have longer levels, but less of them than ever before. Some of the worlds (I don’t wish to reveal them all) include Twilight Town, Andy’s Room, the Kingdom of Corona, Arandelle and Olympus.",
    "While each level is breathtaking in its own way (I couldn’t help but by awestruck by the vibrant, luscious world of the Kingdom of Corona), it’s a formula I would have preferred to stay as was, although, this is down to personal preference. The focus which has gone into creating fewer but more in-depth worlds may be preferential for other players who wish to spend more time in particular worlds.",
    "If photography isn’t your strong suit then you may prefer collecting ingredients for 'Little Chef', aka Remy from Ratatouille, who has opened a Bistro with Scrooge McDuck in Twilight Town and needs your help preparing recipes. Or perhaps you may want to explore beyond the world, and take part in Space Invader-like battles in your Gummi Ship – the means by which you transverse between the worlds.",
    "Despite all the good things about Kingdom Hearts 3, we do need to discuss the small elements which hold it back. The biggest issue the title (and the series) has is that its convoluted story makes it almost inaccessible to new players – it almost feels like too much effort to put in for a game about Disney. Even for me, it was a slow burn until I felt like I was in a universe that I recognized, but once it clicked again then I was hooked.",
    "I remember feeling the same with the first game, but developers don’t have the luxury of a game “getting good” x number of hours in any more. You need to pull in your audience from the beginning. My advice would be to stick at the game, but start with the first two titles in the series if you want to enjoy Kingdom Hearts 3 to its fullest extent.",
    "Other issues include quality-of-life problems, such as having to manually save at particular spots, repetitive music, and occasionally slow response times for controls.",
    "Kingdom Hearts 3 has everything you could want from a Kingdom Hearts game: charm, adventure, vibrant worlds to explore, and quirky Disney characters to interact with. It’s been 14 years since the last core game in the franchise released, and Square Enix has proved that a sequel has been worth the wait.",
    "However, while fans of the series may be delighted, new players may struggle to wrap their heads around the storyline, and the bizarre nature of Kingdom Hearts as a whole. My advice? Go in with no preconceptions, and with a childlike sense of wonder, and try not to think too much about why Donald Duck is suddenly a mage."
  ],
  "headers": {
    "8": "Fables and fairytales",
    "16": "Zero to hero",
    "21": "To infinity and beyond",
    "25": "Let it go",
    "28": "Verdict"
  },
  "links": {}
}