{
  "source": "https://www.techradar.com/reviews/amd-ryzen-5-3600x",
  "title": "AMD Ryzen 5 3600X review",
  "category": "components",
  "updated": "2019-11-18T18:43:13Z",
  "author": "bill-thomas",
  "summary": "AMD claims the mid-range",
  "verdict": "Thanks to its high performance and approachable price tag, the AMD Ryzen 5 3600X may just be the best processor for gaming. There isn't a single game that will be held back by this 6-core wonder.",
  "pros": [
    "Excellent performance",
    "Affordable",
    "Includes a cooler"
  ],
  "cons": [
    "Still 6-cores"
  ],
  "article": [
    "The AMD Ryzen 5 3600X takes the spot of the Ryzen 5 2600X, already one of the best processors on the market for gaming. However, it takes that budget-minded stage of performance to another level, with increased IPC (instructions per clock) performance, along with a higher clock speed – while keeping at the same price point.",
    "The AMD Ryzen 5 3600X is a 6-core, 12-thread processor that's quick enough to hold its own in single-threaded processes. By itself, this makes the AMD Ryzen 5 3600X a compelling processor for gaming, but that budget price tag will make it a superstar for most people, especially as the Black Friday shopping season approaches.",
    "If you want to get your hands on the AMD Ryzen 5 3600X, you're looking at a price tag of $239 (£239, AU$389). That's in the same neck of the woods as the Intel Core i5-9600K, at $262 (£249, AU$365), but with SMT (simultaneous multi-threading), and a slightly lower boost clock at 4.4GHz.",
    "So, while the Intel Core i5-9600K would theoretically offer slightly higher single-core performance, having twice the processing threads means that it pulls far ahead in most other computing tasks – for instance, if you're interested in streaming your gameplay. The AMD Ryzen 5 3600X, then, with its lower price and higher core count, makes for a far better value proposition than Team Blue's competing chip.",
    "The AMD Ryzen 5 3600X features AMD's Zen 2 architecture, meaning it's manufactured on Team Red's 7 nanometer (nm) process. This new architecture pushes performance up, through higher clock speeds and IPC performance. In fact, AMD engineers managed to boost IPC by a whopping 15%, narrowing the gap in single-core performance that has always existed between AMD and Intel.",
    "This AMD processor is able to provide this boosted performance, while driving power consumption down over the previous-generation AMD Ryzen 5 2600X, with a TDP (thermal design power) of 65W, where the 2nd-generation chip's TDP is rated at 95W. Not only does this lead to a (marginally) lower electricity bill, but should also help keep temperatures down, which will inevitably lead to higher performance, due to how AMD's Precision Boost 2.0 technology works.",
    "Cache sizes also see a boost with the AMD Ryzen 5 3600X, facilitated by the move to 7nm. The AMD Ryzen 5 2600X featured 16MB of L3 and 3MB of L2 cache, for a combined total of 19MB of cache. With the AMD Ryzen 5 3600X, however, that total cache, now dubbed 'GameCache' is boosted to 35MB, 32MB of which is L3 and 3MB of L2. This has massive impact for gaming performance, especially in older titles like Counter Strike: Global Offensive at 1080p.",
    "Finally, AMD Ryzen 3rd Generation features support for PCIe 4.0, which significantly boosts bandwidth for PCIe devices like SSDs and graphics cards. Now, the only graphics cards that can take advantage of PCIe 4.0 right now are the AMD Radeon RX 5700 XT and RX 5700. However, SSDs benefit the most, as with this new interface they can get up to 51% faster than their non PCIe 4.0 counterparts.",
    "When a 6-core, 12-thread processor comes within spitting distance of a 8-core, 16-thread processor that costs twice as much, we tend to take notice. And, that's exactly the case with the Ryzen 5 3600X and the Intel Core i9-9900K. Team Blue's flagship is about 15% faster in multi-threaded workloads, while doubling the 3600X's price tag.",
    "And, when it comes to single-threaded work, the AMD Ryzen 5 isn't all that far behind. In the Cinebench R15 single-core test, the AMD Ryzen 5 3600X scores 200 points to the Intel Core i9-9900K's 211 – a mere 5% difference. This alone makes it one of the best processors for gaming, as most games love having fewer, fast cores.",
    "And the gaming results reflect this. For instance, the AMD Ryzen 5 3600X is able to score 100 frames per second (fps) in Total War: Warhammer II, when paired with the Nvidia GeForce GTX 1080 Ti. This is importantly on the same level as the rest of the AMD Ryzen 3rd Generation processors, which means you're getting the same gaming performance for a much lower entry price.",
    "Power consumption is also extremely low. Even during the most insane tests, the AMD Ryzen 5 3600X never consumes more than 79.8W of power. And, temperatures are under control, too, peaking at 79.8C, even with the included Wraith Spire cooler.",
    "For the longest time, AMD processors, especially in the mid-range, were the budget choice for gaming. If you didn't have a lot of cash and wanted acceptable performance, you'd pick up an AMD processor, while Intel was the mainstream pick. However, times have changed, and the AMD Ryzen 5 3600X is both the budget and the mainstream pick for gamers.",
    "You can finally get both excellent multi-threaded and single-threaded performance in the same package, without spending hundreds of dollars on a flagship chip. That's why it's so easy to recommend this processor to pretty much everyone. If you're planning to build a gaming PC in 2019, the AMD Ryzen 5 3600X is the chip to beat."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Features and chipset",
    "8": "Performance",
    "12": "Final verdict"
  },
  "links": {
    "Ryzen 5 2600X": "https://www.techradar.com/reviews/amd-ryzen-5-2600x",
    "best processors": "https://www.techradar.com/news/best-processors",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "AMD's Zen 2": "https://www.techradar.com/news/amd-zen-2",
    "AMD and Intel": "https://www.techradar.com/news/amd-vs-intel",
    "AMD processor": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "AMD Ryzen 3rd Generation": "https://www.techradar.com/news/amd-ryzen-3rd-generation",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "AMD Radeon RX 5700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5700-xt",
    "RX 5700": "https://www.techradar.com/reviews/amd-radeon-rx-5700",
    "Intel Core i9-9900K": "https://www.techradar.com/reviews/intel-core-i9-9900k-review",
    "Nvidia GeForce GTX 1080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1080-ti"
  }
}