{
  "source": "https://www.techradar.com/reviews/canon-powershot-sx740-hs",
  "title": "Canon PowerShot SX740 HS review",
  "category": "cameras",
  "updated": "2019-06-19T08:47:19Z",
  "author": "matt-golowczynski",
  "summary": "Canon goes long with the SX740 HS",
  "verdict": "The SX740 HS makes some positive steps forward from the SX730 HS, and is capable of producing nice images and good-looking videos. It's a sound option for those who just want the camera to do all the work, although the absence of a viewfinder, touchscreen and raw shooting mode means it can't be said to offer especially good value for money compared to rivals.",
  "pros": [
    "Huge, stabilized zoom lens",
    "EOS-style user interface",
    "Images show nice colors",
    "4K video reasonably detailed",
    "Fast autofocus system",
    "Good face detection AF"
  ],
  "cons": [
    "No EVF",
    "Screen not touch-sensitive",
    "Image quality compromised at longer focal lengths",
    "Effects of noise reduction and over-sharpening are visible",
    "No raw shooting",
    "Limited image quality control"
  ],
  "article": [
    "This is TechRadar’s review summary that gives you all the key information you need if you’re looking for quick buying advice in 30 seconds – our usual full, in-depth review follows.",
    "The Canon PowerShot SX740 HS is an update of the PowerShot SX730 HS, which has been on the market for the past two years or so. Many of the headline specs seem similar, so what exactly has Canon changed?",
    "First, there's the newer DIGIC 8 processing engine, which boosts video specs from Full HD to 4K. This has also allowed for image stabilization to be a little more refined and powerful, and for burst shooting to be upped from the SX730's 5.9fps to a far speedier 10fps.",
    "The SX740's battery life is also a little better, no doubt thanks to the more efficient processing engine. The menu system is also much more like those on EOS DSLRs and mirrorless cameras, which is a significant improvement over the SX730.",
    "Otherwise, the PowerShot SX740 HS offers much of what we saw on the previous model, including a respectable combination of 20.3MP sensor, a 3-inch flip-up LCD screen, and the option of manual control over shooting settings. The centerpiece, however, is the 40x optical zoom lens, which covers an exhaustive range of 24-960mm in 35mm terms.",
    "The body appears to be a mixture of metal and polycarbonate, which gives it a more solid feel than many other compacts. Despite its small size, Canon has done well to include many physical controls while keeping them large enough to be comfortable to operate – not something every compact of this kind can boast.",
    "All buttons press positively into the body, and the dial on the back of the camera turns easily too. The LCD screen moves with ease, although it's a shame that a good proportion of the screen doesn't actually display the image, and that it's not touch-sensitive, which is somewhat out of line with our expectations for a compact in 2019. The lack of a viewfinder is also a pity, particularly for a camera that's likely to be used for the most part outdoors, where visibility of the LCD screen can suffer.",
    "The SX740's autofocusing system is nice and snappy, and generally does a good job regardless of where you are in the focal range. It even does well at the telephoto end, which is traditionally something of a weak point on such cameras, although this does in part depend on the contrast of the subject being shot.",
    "Images appear well exposed with very pleasing colors on standard settings. Noise and noise reduction are often issues with cameras such as these, and the PowerShot SX740 HS is not immune, so it's a shame there's no raw shooting option, as this would offer users the option to process images to improve their results. Videos show decent detail, but rolling shutter, where elements in the scene appear to be skewed when they or the camera move, is an issue.",
    "The Canon PowerShot SX740 HS is ideal for those on their holidays or on a longer stretch of traveling who either don't need an interchangeable-lens system, or simply don't want the hassle of lugging one around. While its zoom range is fairly broad, its compact dimensions mean it's not entirely unsuitable as an all-purpose camera for more general use too.",
    "The 1/2.3-inch 20.3MP back-illuminated sensor in the Canon PowerShot SX740 HS appears to be unchanged from the SX730 HS, as does the lens, which covers 24-960mm in 35mm terms; it's one of the longest focal length ranges available at this price point, although the advantage of that extra 5x or 10x optical zoom over rival cameras at the longer end is debatable.",
    "One of the core components that has changed is the processor. Gone is the previous DIGIC 6 with iSAPS engine, and in steps the DIGIC 8, the same engine that stars in Canon's EOS R full-frame mirrorless camera and EOS Rebel SL3 / EOS 250D DSLR.",
    "This appears to bring with it a number of benefits, from 4K video recording through to a faster maximum 10fps burst rate (the SX730 HS only shoots Full HD videos, and stills at up to 5.9fps). The image stabilization system also appears to be more powerful than before, with a 3.5-stop maximum advantage claimed by Canon, and features Dual Sensing IS, which uses information from both the lens and sensor to help correct image blur.",
    "Battery life has also marginally improved, from 250 frames on the SX730 HS to 265 frames here – it's only a minor difference, but the average user will enjoy far better battery life than these official figures tend to suggest anyway. You can also put the camera into an Eco mode to ramp it up to 370 frames, and it's possible to charge the battery through the USB port – pretty handy if you're on the move.",
    "Elsewhere the PowerShot SX740 HS gets the same kind of menu system that graces Canon's EOS DSLRs and mirrorless cameras, which is a great improvement on the more rudimentary menu system we saw on the SX730 HS and previous PowerShots.",
    "Other features include Wi-Fi and Bluetooth, as well as Face Detection AF and a 1cm macro focus option. Everything you capture is stored on an SD, SDHC or SDXC memory card up to the UHS-I Class 3 standard.",
    "The body of the PowerShot SX740 HS is essentially the same as the PowerShot SX730 HS's. There are a few minor changes to reflect the camera's more powerful specs – a 4K inscription has replaced the previous 'Wi-Fi' label on the top plate, for example, and a 'Q Set' button has usurped the previous Fn control in the middle of the menu pad, but that's pretty much it.",
    "And this isn't a bad thing, as everything worked perfectly fine before. Clearly on such a small body the controls themselves can only be so large, but the mode dial is comprehensive in its options and turns easily, while the dial on the back is also easy to turn, without too much bashing of the raised LCD screen next to it.",
    "One thing the Canon SX740 HS doesn't have is a control ring around its lens, something we've seen on rival bodies such as the Panasonic ZS80 / TZ95 and previous ZS70 / TZ90. This is a useful way of enabling the user to change the aperture, zoom, shutter speed or something else, and the fact that we also don't have a touchscreen here makes its absence all the more of a shame.",
    "In line with similar cameras, the front and some other sections of the SX740 appear to be made from a sturdy metal, rather than the camera having an all-polycarbonate build, which makes it reasonably solid. The grip and thumb rest don't quite have the best friction to them, but they do help you to get a better hold.",
    "The menu system is modeled on the one found inside EOS mirrorless and DSLR models, so it's far more comprehensive than the one Canon has previously used for such models. It doesn't offer quite the same level of control as on those cameras, but we wouldn't expect this – and the fact that it can be tailored to your skill level is a nice bonus.",
    "As you don't have quite the same control over image quality as you do on one of Canon's mirrorless or DSLR cameras, and with no provision for raw shooting, it's imperative that Canon nails the image processing in the PowerShot SX740 HS.",
    "And for the most part it seems you can safely leave the camera to its own devices and rely on it doing a sound job. Colors certainly look very nice when the camera is left to the default Auto Picture Style, with nicely saturated blues in skies and greens in foliage, although the auto white balance system is a little inconsistent between exposures, sometimes leaning a little towards warmth and other times towards coolness.",
    "Exposures are generally sound, but the limited dynamic range of the sensor makes itself known, particularly in high-contrast conditions, so it's a shame Canon's Highlight Tone Priority feature isn't available. Exposure compensation and Canon's Auto Lighting Optimizer are, however, and between the two you can generally get to a better result, even if it requires a bit of tinkering with settings.",
    "Noise and noise reduction are common issues with cameras that have such small sensors, and the Canon SX740 HS is not immune to these. With no raw option or way to deactivate noise reduction, it's difficult to know exactly how much is being applied, and it's likely that some sharpness is being compromised at default settings to keep noise at bay – indeed, the slight over-sharpening that's visible around natural subjects is a little aggressive. That said, detail holds up relatively well compared with similar images from rival cameras, particularly at the wide-angle end of the lens.",
    "Things are less impressive at the telephoto end. While you can see the image stabilization system to be working as you compose your images, focal lengths of this kind really do tax it, and the camera can't always keep things crisp. You also see some slight fringing along the edges of details, although only when you're looking at images at their full size in Photoshop. Video quality isn't too bad though; details are decent for a camera with such a small sensor, although rolling shutter is an issue.",
    "Overall, the PowerShot SX740 HS is something of a mixed bag. It's a little cheaper than its rivals, but nowhere near as well specified; it's a shame Canon hasn't addressed the main issues we had with the SX730 HS, namely the lack of a touchscreen and an EVF, and to a lesser extent a raw quality option.",
    "Image quality is quite good for a camera with such a small sensor and ambitious lens, although some of this is down to how the camera processes images, which may not always be to your taste. It's good to have usable 4K video now too, rather than being limited to Full HD; however you can still find the older SX730 HS for quite a bit less, so if you're not too fussed about video quality or the faster burst shooting mode, and you're on a tight budget, that camera might be a better option while it's still available.",
    "If the PowerShot SX740 HS isn’t for you, we’ve picked three excellent alternatives for you to consider."
  ],
  "headers": {
    "0": "The Essential Review",
    "9": "Who’s it for and should I buy it?",
    "10": "New processing engine and 4K video",
    "16": "Much the same design as before",
    "21": "Image quality",
    "28": "Not convinced? Try these..."
  },
  "links": {
    "PowerShot SX730 HS": "https://www.techradar.com/reviews/canon-powershot-sx730-hs",
    "EOS R": "https://www.techradar.com/reviews/canon-eos-r-review",
    "EOS Rebel SL3 / EOS 250D": "https://www.techradar.com/reviews/canon-eos-rebel-sl3-eos-250d",
    "Panasonic ZS80 / TZ95": "https://www.techradar.com/reviews/panasonic-lumix-zs80-tz95-review",
    "ZS70 / TZ90": "https://www.techradar.com/reviews/panasonic-lumix-zs70-tz90"
  }
}