{
  "source": "https://www.techradar.com/reviews/wolfenstein-youngblood",
  "title": "Wolfenstein: Youngblood review",
  "category": "gaming",
  "updated": "2019-08-05T17:22:46Z",
  "author": "jordan-oloman",
  "summary": "Two design philosophies butt heads in this reliable co-op Nazi smasher",
  "verdict": "Wolfenstein: Youngblood’s top-class visuals and cathartic gunplay can’t save a game that is defined by its wasted potential and design contradictions, destined to be in the shadow of its predecessors.",
  "pros": [
    "Polished textures and particle effects make for gorgeous visuals",
    "Co-op gunplay is reliable Wolfenstein fun"
  ],
  "cons": [
    "The world and setting feel underutilized",
    "A detailed open-world causes constraints elsewhere",
    "Design philosophy contradictions are rife",
    "Some annoying bugs to deal with"
  ],
  "article": [
    "“Alright Jess, what’s the plan?” “Find our dad and… kill Nazis!” Now there’s a clear cut premise I can get into. Wolfenstein: Youngblood never minces its words or pulls its punches - it’s a game where you turn fascists into hot red goo and liberate occupied Paris in an alternate vision of the 80s under the Axis.",
    "Despite the marketing making it look like a synthwave fever dream, the game doesn’t do much with its rich setting or environment design - several areas look like they could have been leftovers from The New Colossus. We found it very odd how much the game lacked the mise en scene of Paris. Fair enough if they were doubling down on the idea that the Nazis had removed any trace of French culture, but there’s nothing standout about what could have been a rich setting beyond the looming, brutalist Eiffel Tower, which the Nazis have transformed into some kind of doom obelisk where they conduct their terrible business.",
    "Youngblood marks a turning point for the series thanks to a set of brave new features, including co-op and open-world exploration. These design choices are ambitious, but the game does have a few annoying senior moments thanks to the brave strides away from linearity.",
    "Checkpointing is brutal - you could be one collectible of an objective away from completing the mission, but if you die you go all the way back to the start of the area. Tough but fair, but it’s especially annoying when it’s not your fault, or the enemy spawn rate becomes so ridiculous and overwhelming - seriously, we started to wonder how the fiction would explain the hundreds of Nazis raining from the sky whenever we turned our head, but we never really got a convincing answer. Youngblood just feels hard for the sake of it at times, with spongy enemies that gate your progress by virtue of being tanky - not fun to defeat!",
    "The Wolfenstein combat you know and love is still reliable fun here. The gunplay is crunchy and responsive, and throughout it becomes the driving force behind the game, which flubs most of its new ideas. Unlike the other titles in the series, the fleshed-out upgrade system made it so we didn’t have much of a reason to use anything beyond our favorite two guns in battle, which led to little experimentation on our part.",
    "A shooter game shines when it provides you with fun ways to expose an enemy's weakness and take them out but, with the addition of Destiny-esque health and armor bars, it becomes more about depleting those as quickly as possible, so it draws you towards quick and dirty blasts from high-damage weapons.",
    "Right at the start, within a contained linear mission, Youngblood teases the existence of generals, interesting boss battles that mess with the established rules of engagement. The first general you fight zips around the room whilst invisible, shooting lasers. Unfortunately this promising feat is never repeated throughout the game beyond the final boss, which, whilst a fantastic fight, made us realise the amount of ineffectual slog we'd been pushing through prior to this point, and what the game could have been with a bit of focus.",
    "The simple narrative of the sisters joining a local resistance faction and rescuing BJ ends in a satisfying way but, much like the rest of Youngblood, it’s constrained by the open-world structure of the game.",
    "Gone are the incredible in-situ cutscenes that many love Wolfenstein for, where you get up close and personal with your enemies and the stakes get raised. Instead Youngblood goes for a very old-school style with no player interaction, and whilst it’s well voice-acted and written with care, you’ll struggle to connect with the characters outside of Jess and Soph, who quip back and forth during battle in an endearing fashion. You can talk to them at your hub base in the Paris Catacombs, which is teeming with detail and full of resistance fighters puttering about - it feels very much alive in a way that Nazi-occupied Paris doesnt.",
    "At the start of the game we opted for Soph because we prefer the stealthy approach that falls on the Arkane side of this Lyon/MachineGames mashup. Soph starts out with a scoped Sturmgewehr, a mid-range semi auto sniper, rather than the close-range shotgun you get with Jess - which suited our needs entirely. Though, it didn’t take long before we realized how totally absurd it is to try and sneak through areas and backstab Nazis. Youngblood’s DNA has much more MachineGames in it than Arkane, which earnestly attempts to work its careful immersive sim magic into this blunt and busy action game, but it falls far short of what we’d hoped from this dreamy crossover.",
    "In playing co-op, you start to naturally butt heads with your partner whose ability lets them literally run through the opposition and turn them into gut piles. It’s hard not to fall for the visceral way of life… it feels inevitable that you’re going to trigger an alarm anyway. Arkane’s style succeeds in some spots - there are Dishonored-style offices to sneak into and floppy discs to steal that offer information about secret routes into the ‘Brothers’ - gigantic towers that loom over Paris in need of liberation.",
    "The 'Brothers' are major outposts you must conquer before you can take on the endgame and they scream Arkane, level design wise. However, the aforementioned floppy disk side missions eventually start to feel ineffectual and pointless, regurgitating the same locations, lifeless puzzles and objectives with no human interaction or dialogue involved, the things that you may have come to expect from a game of Arkane’s calibre.",
    "We started to enjoy playing the ‘in-between’ class, melding both action and stealth, but it was naturally quite the compromise. In doing so, Arkane’s careful mark started to fade from Youngblood, despite the layered platforming and level design. Everything the studio contributes here feels half-baked, but it could have made for a fascinating experiment in immersive sim co-op if the boring bits on the other side didn’t win the battle.",
    "The Blazkowicz girls are truly special characters though, born to kill Nazis but with the right amount of naivety and reservation about their mission to make them feel human.",
    "Their models and shiny suits look great too. One uncompromising part of Wolfenstein: Youngblood is the visuals. What a gorgeous game this is on the PS4 Pro. From the abberating gasoline-slick sheen of the sisters’ cloaking device to the shadow on a box of ammo, tiny details stick out and draw you into the polished world. Particle effects are fantastic too, with the steam of an engine turning your eyeline into a mirage. The UI is clean to look at, albeit a bit busy, and we would have liked being able to turn everything off except the minimap, which we found vital to exploration, even if the game frustrates you by lacking a map screen.",
    "Playing with others is hit or miss. There’s no emote wheel to signal what you want a partner to do if you’re not chatting over VOIP, so if you’re playing with someone who likes to rush and push through objectives then it’s hard to rein them in.",
    "At one point we had another player start killing themselves on barbed wire to end the game because we tried to figure out a puzzle instead of pressing on. Other times the stars will align when you’ve got a set task and you’re in sync, but these moments are fleeting. Definitely don’t rely on random co-op partners in Youngblood, get a friend to commit and you’ll have much more fun.",
    "Unfortunately, we encountered some really strange bugs in Youngblood too, with one completely spoiling the final boss battle of the game. On an inconsistent basis, usually during a busy battle, the game’s audio would start dropping in and out, obscuring the excellent audio mix MachineGames has curated. The screen would also swell and fill our vision with a gray void during these odd moments, which ruined our focus and usually got us killed.",
    "Speaking of which, there seems to be a few issues concerning the revive system which haven’t been ironed out. Sometimes when opening a door or using a pep signal we’d get stuck in that animation before hitting the deck, which usually stuck our character to the floor or forced us to reload the game.",
    "You can tell that Wolfenstein: Youngblood was created by a passionate, ambitious group of developers looking to breathe some life into a stoic series and combine two schools of design. Yet, in trying to smash their philosophies together, a lack of time and a number of compromises has led to an imbalanced experience that fails to deliver on the promise of such a dynamic mashup.",
    "Whilst it looks great, sounds immense and the gameplay feels like more of the same - every new addition is poorly executed from the skill trees to the co-op, and the bugs, lack of quality-of-life features and rampant gameplay contradictions suggest it needed much more time in the oven.",
    "Good for a cheap laugh with a committed friend in tow, Youngblood is a reliable Nazi-smashing simulator that unfortunately lacks much of the nuance and atmosphere of previous entires."
  ],
  "headers": {
    "3": "It's raining men",
    "8": "Twisted sister",
    "11": "Mark of the outsider",
    "15": "Co-op compromise",
    "19": "Final verdict"
  },
  "links": {
    "The New Colossus": "https://www.techradar.com/news/wolfenstein-ii-the-new-colossus-nintendo-switch-review",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro"
  }
}