{
  "source": "https://www.techradar.com/reviews/mixcder-e9-wireless-active-noise-cancelling-headphones",
  "title": "Mixcder E9 Wireless Active Noise-Cancelling headphones review",
  "category": "audio-visual",
  "updated": "2020-04-15T12:24:20Z",
  "author": "jennifer-allen",
  "summary": "Budget listening comes at a price",
  "verdict": "The Mixcder E9 Wireless Active Noise Cancelling headphones are a perfectly respectable pair of headphones for the price. They won't exactly stand out in terms of superior audio quality or comfort, but they feel good enough for the low price tag.",
  "pros": [
    "Good battery life",
    "Active noise-cancelation works quite well",
    "Inexpensive"
  ],
  "cons": [
    "Uninspiring sound quality",
    "Dull design"
  ],
  "article": [
    "Buying a pair of budget headphones can feel like false economy. All too often, you can find yourself with a pair that feel cheap to wear as well as cheap to listen to.",
    "That's not the case with the Mixcder E9 Wireless Active Noise Cancelling headphones, but you may still find yourself craving a more premium pair of noise-canceling headphones in the long term.",
    "The Mixcder E9 Wireless Active Noise Cancelling headphones have a recommended retail price of $120 (around £95 / AU$170), but you almost certainly won't be paying that.",
    "The Mixcder site has them currently on offer for $80 (about £60 / AU$115), and you can get them even cheaper at Amazon, selling them for $59.99 / £54.99 / AU$95.",
    "It's not difficult to find them at a low price, and with Amazon Prime Day 2020 coming up soon in August, that price could drop even lower.",
    "The Mixcder E9 Wireless Active Noise Cancelling headphones are exactly what you need from a set of headphones and nothing more.",
    "They have a rather chunky design, which feels a little flimsy in places. One the earcups you'll find large volume buttons, as well as a switch for controlling the active noise cancellation feature.",
    "While they aren't the prettiest headphones we've reviewed, the Mixcder E9's controls are also arguably simpler to use than the touch-sensitive controls favored by many pricier headphones models like the new Bose Noise Cancelling Headphones 700.",
    "They're also less prone to being accidentally activated than touch-sensitive controls, which is a particular bonus if you're trying to fumble around with the controls while on the move.",
    "The headband is suitably well-padded and there's soft foam for your ears to be cushioned by. It's all comfortably snug – to the point that it can feel a bit hot in warm weather – which means no risk of slippage.",
    "Sayin that, we found them a little uncomfortable on our temples places when in use, particularly when wearing glasses. There's not much room for adjustment here either, other than extending the height of the headphones.",
    "The Mixcder E9 Wireless Active Noise Cancelling headphones are rotatable so they easily slide into their carry case – a case that's as unremarkable looking as the cans themselves. It's a little cumbersome, but it does the job, and means your already sturdy headphones are at no risk of breakage when you're traveling with them.",
    "They might not look like much but the Mixcder E9 Wireless Active Noise Cancelling headphones are very easy to use.",
    "Skipping touch-sensitive controls that look sleek but are sometimes fiddly, these practical physical buttons prove to be far easier to get the hang of. There are clearly labelled buttons for turning the volume up or down, a chunky power button which also doubles as the pairing button, and a switch for turning the Active Noise Cancellation on or off.",
    "It's all so easy to use that anyone can get the hang of it; there's no need to pull out the manual to check what anything does. This is particularly useful if you're heading out and about with them on.",
    "Granted, we prefer the more stylish look of subtle earphones when going for a run or long walk, but these are great for sitting on a train without having to worry about inadvertently tweaking a control by simply brushing your hand against one's ear.",
    "Even taking a call is just a matter of pressing the power button which feels so much easier than trying to stroke a finger down a classy looking but overly sensitive touch interface.",
    "Charging is basic but effective. The built-in 500mAh lithium battery charges via micro-USB rather than USB-C, taking about three hours to fully charge. That's not as quick as we'd like, but you'll rarely need to worry about it.",
    "The headphones promise a battery life of about 30 hours in wireless mode with ANC enabled and an impressive 80 hours in wired mode (the audio cable is included). In practice, we found that number a little lower if you're listening at higher volumes, but it only drops by a few hours. It was hardly an issue and seemed more than respectable enough for everyday use.",
    "The active noise cancellation works suitably well too. We didn't get to test them on a plane, but we found the Mixcder E9s blocked out the majority of environmental noise from traveling in car and walking around our local area.",
    "Blissfully, they did a fantastic job of cancelling out the sounds of a noisy late-night BBQ unfolding nearby too. They don't make the outside world completely silent, but they do make it a lot more bearable when you're trying to concentrate.",
    "Without ANC switched on, there's still a decent amount of passive cancellation there, courtesy of the thick ear pads, but there's a noticeable improvement to both noise cancellation and sound quality once you switch it back on.",
    "We'd suggest keeping ANC switched on at all times to boost the sound quality because, well, the sound quality is fine – just fine.",
    "The Mixcder E9 Wireless Active Noise Cancelling headphones sport 40mm drivers, which are supposed to provide a balanced soundstage, with accurate bass, mid, and treble frequencies. In practice, they do the job, but these cans won't set the world on fire with their fantastic sound quality, and audiophiles will likely be disappointed by their presentation.",
    "Instead, they're more suitable for someone on a budget who plans on mostly using them while in noisy environments; commuting, for example. As a pair of budget commuter headphones, they're just right. It’s not like you need amazing sound quality when using it as background noise to a busy train journey, after all. As a pair of headphones to listen to while relaxing at home? Perhaps not. This is where you'll notice the flaws.",
    "There's no sense of atmosphere when listening through them, no feeling that you're listening to music coming from around you, rather than being pumped directly into your ears – which can be an issue with even expensive over-ear headphones.",
    "Listening to bass-heavy tracks through them, it's obvious that the Mixcder E9 Wireless Active Noise Cancelling headphones don't really have the sophistication to carry off lower frequencies with aplomb.",
    "That's even more evident when you switch off ANC. They fail to pick up certain subtle details in your music too, but that almost feels like nitpicking when dealing with headphones that are so cheap.",
    "However, if you want to fully immerse yourself in your music, you'll probably find yourself wishing you’d spent more.",
    "If you're looking for a pair of wireless noise-canceling headphones that you can adjust and tweak, as well as learn new things about the music you love, the Mixcder E9's aren't the pair for you.",
    "Some cheap headphones pull this off; the Taotronics TT-BH040s are a great budget option if you want noise cancelation with your music. You need to pay more for something like that, which is telling in itself.",
    "However, if you simply want to block out the world for a while on your commute and listen to your favorite tracks (without overanalyzing how they sound), the Mixcder E9 Wireless Active Noise Cancelling headphones are still a bit of a bargain.",
    "It all comes down to what you find most important when buying headphones – they're certainly reasonably priced, and could get even cheaper come Amazon Prime Day."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "12": "Features",
    "22": "Sound quality",
    "29": "Final verdict"
  },
  "links": {
    "budget headphones": "https://www.techradar.com/news/best-cheap-headphones",
    "noise-canceling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Amazon Prime Day 2020": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "earphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Taotronics TT-BH040": "https://www.techradar.com/reviews/taotronics-tt-bh040",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}