{
  "source": "https://www.techradar.com/reviews/polar-ignite",
  "title": "Polar Ignite review",
  "category": "fitness",
  "updated": "2021-03-17T16:43:51.074Z",
  "author": "kieran-alger",
  "summary": "The Polar Ignite is a serious workout watch that puts recovery first",
  "verdict": "Clean and simple but feature-rich, the Ignite sets a new benchmark for fitness watches that recommend workouts and track sleep and recovery. The recovery insights are deep and digestible, while the adaptive workout recommendations are as useful, easy to follow and motivational as we’ve seen. This is a serious all-round fitness tool at a very reasonable price.",
  "pros": [
    "Advanced sleep and recovery insights",
    "Adaptive training recommendations",
    "Good value"
  ],
  "cons": [
    "Touchscreen controls only",
    "Rapid screen timeout",
    "Touchscreen lacks responsiveness"
  ],
  "article": [
    "The Polar Ignite is a running watch with a difference. While there are dozens of sports watches that happily track everything from running to hiking, few focus primarily on the goal of just ‘getting fitter’. The Ignite does exactly that.",
    "It still tracks those mainstay fitness activities like running, cycling and swimming as well as any other Polar watch, but the Ignite is geared towards the simple common goal of getting you into better shape.",
    "Everything we’ve come to expect as standard in a sports watch is there: built-in GPS, optical heart rate from the wrist, activity tracking, a decent screen, solid battery life and smart notifications.",
    "But it’s the advanced adaptive training recommendations and the comprehensive sleep and recovery tracking features that really make the Ignite stand out. These brand new features combine to help you stay inspired with daily workout ideas for different sessions, and to maintain good balance, helping you spot when and how hard to train.",
    "It’s much cheaper than other fitness watches like the Fitbit Ionic and though it doesn’t have the smartwatch features of an Apple Watch or a Fitbit Versa, there’s an awful lot here for the price tag. Including plenty that even sport-specific goal-chasers will like.",
    "We’ve spent the last few weeks putting the Polar Ignite through its paces to find out if it’s as much of a bargain as it seems.",
    "At $229.95 / £174.50 / AU$349.00, the Polar Ignite is the cheapest watch from Polar’s most recent updates. It sits in the middle of the budget sports and fitness watches bracket alongside the likes of the Garmin Forerunner 45 and the Coros Pace. Though in many ways, it’s actually in a bracket all of its own.",
    "The Ignite has a striking simplicity. In fact, it’s easily the most minimal, slimline and ‘stylish’ watch we’ve ever seen from Polar. It’s still a sporty design but you can see care has been taken to make it a device you’d be more inclined to wear all-day, every day.",
    "At 43 x 43 x 8.5mm, it’s definitely designed with consideration for smaller wrists and there’s subtlety to the look that hasn’t been common with Polar’s watches.",
    "The 240 x 204 color touchscreen display is surrounded by a nicely curved stainless steel casing that’s a bit reminiscent of the Garmin Vivoactive 3.",
    "The display itself is bright and crisp. Significantly brighter and sharper, in fact, than the much pricier Polar Vantage V which looks dull by comparison. It’s not Apple Watch clarity but it’s very easy to read in all lights and the colors are punchy in a cheering way. Weirdly though, the bottom section is cut off by a Polar logo.",
    "Speaking of the Apple Watch, the Ignite screen’s default is off. Just like with Apple’s timepiece you raise or tap the side button to wake it. We like the fact this saved battery life, but we found the shutdown was often too quick and the raise-to-wake wasn’t always reliable. What’s also a little frustrating is that you can’t tweak how long the screen stays on before it goes dark again.",
    "When it comes to the overall look, what’s perhaps most notable with the Ignite is the lack of side buttons. The five controls you get on the Vantage M and V have been pared down to one single button. While that makes for nice clean lines and less weight, it means the majority of interactions rely on the touchscreen.",
    "The touchscreen isn’t as responsive as something like the Apple Watch 4. We found it often took 2-3 taps to move through screens and the moment you drip sweat on it, all bets are off.",
    "The interface is relatively intuitive. It has to be said though, that we experienced a few occasions where the touchscreen froze and wouldn’t respond. And there was sometimes lag when you tapped through screens.",
    "One other aspect we’d question, is the lack of a back swipe to take you back to previous screens. That’s done instead by the lone button.",
    "At just 35g, the Ignite is incredibly lightweight. Not just because of the single button, but the watch face itself is much thinner than on the Vantage watches – about half the size, in fact. It also has a much thinner strap than the V and M. Even the clasp is daintier.",
    "All this makes for a very comfortable watch to wear 24-7. And that’s crucial if you’re going to make the most of the big USPs of this device – those sleep and recovery tracking features.",
    "Flip the watch over and you’ll see Polar’s Precision Prime sensor fusion technology, the same as you find on the Vantage V. But more on that later.",
    "The Polar Ignite is water resistant to 30 meters so you can swim with it.",
    "It also comes in a handful of colors. At launch it was available in orange (the one we tested), white and black, and the strap material differs depending on which you choose. On the orange and white you get a silicone strap whereas on the black it's TPU plastic. You can also change the strap for any 20mm watch strap. And since launch new rose gold and pink, and black and copper color options have been added.",
    "In the box you also get Polar’s now-standard magnetic disc, charging USB cable. So you can now use most of the charging cables from other Polar watches to juice up. That’s very handy indeed, particularly if you’re traveling, forget your lead and want to borrow one."
  ],
  "headers": {
    "6": "Polar Ignite pricing and availability",
    "7": "Design and screen"
  },
  "links": {
    "running watch": "https://www.techradar.com/best/running-watches",
    "Fitbit Ionic": "https://www.techradar.com/reviews/fitbit-ionic-review",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Fitbit Versa": "https://www.techradar.com/reviews/fitbit-versa-review",
    "Garmin Forerunner 45": "https://www.techradar.com/reviews/garmin-forerunner-45",
    "Garmin Vivoactive 3": "https://www.techradar.com/reviews/garmin-vivoactive-3-review",
    "Polar Vantage V": "https://www.techradar.com/reviews/polar-vantage-v-review",
    "Vantage M": "https://www.techradar.com/reviews/polar-vantage-m-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "color options have been added": "https://www.techradar.com/news/polar-ignites-new-colors-are-the-missing-link-for-this-popular-cheap-running-watch"
  }
}