{
  "source": "https://www.techradar.com/reviews/hasbro-star-wars-lightsaber-academy",
  "title": "Hands on: Hasbro Star Wars Lightsaber Academy review",
  "category": "appliances",
  "updated": "2019-02-23T01:38:52Z",
  "author": "michael-hicks",
  "summary": "Darth Vader's School for Padawan Learning",
  "verdict": "Star Wars Lightsaber Academy uses technology to get kids active and engaged without having to worry about them hurting themselves.",
  "pros": [
    "Great motion tracking",
    "Faithful to the source material",
    "Creative battle system"
  ],
  "cons": [
    "No second lightsaber included",
    "Difficult to use app and sword",
    "Really loose strategy involved"
  ],
  "article": [
    "Kids have been whacking each other with toy lightsaber replicas for decades, reenacting their favorite Jedi vs Sith duels. Now, parents will be thrilled with Hasbro for making lightsabers that virtually duel with one another—though, let's be honest, kids will hit each other with them anyway.",
    "At Toy Fair 2019 in New York City, Hasbro showed off Star Wars Lightsaber Academy, a motion-controlled, Bluetooth lightsaber replica bundled with a companion app that teaches your young Padawans how to wield their sabers like Yoda or Vader.",
    "We tried out our dueling skills on the show floor and have the lowdown on everything you need to know to decide whether this is the best toy for teaching your children the ways of the Force.",
    "Star Wars Lightsaber Academy will go on sale sometime toward the end of the year—however, there’s no official release date yet.",
    "We do know that it will sell for $50 (around £38, AU$69), that it comes with one Smart-Hilt lightsaber and complimentary access to the Lightsaber Academy app in iOS or Android, and that you’ll find it for sale with most major retailers. The AA batteries that power the saber aren’t included.",
    "The saber’s Smart-Hilt contains an accelerometer (measures location), a gyro (rotation) and a barometer (height and pressure); all that data then transmits to the app via Bluetooth connectivity tech.",
    "Again, you’re getting just one saber for virtual training. For true head-to-head combat, Hasbro will also sell Extendable and Electronic Lightsabers for $7 and $20, respectively. The extendable ones have no smart tech, while the electronic ones have special light and sound effects but no Bluetooth or location tracking.",
    "So to truly set up a multiplayer battle in the app, you'll need two copies of Lightsaber Academy and its \"Master Lightsaber\", Hasbro confirmed.",
    "Once you've downloaded the app, your kid will create a new Padawan profile, then complete lessons and skill challenges in their quest to become a Jedi Master.",
    "At the start, your kids will choose to learn from one of five Jedi and Sith masters: Yoda, Rey, Darth Vader, Luke Skywalker, or Kylo Ren. The app then trains you on how to pose and attack, in a way that matches the masters’ “official” movie fighting styles—or so Hasbro claims.",
    "For one challenge, the app had us point the saber at a specific point, then sweep the sword downward in a semicircle; the sensors tracked the saber’s movement and determined we had been 97% accurate to the original trajectory. For a skill challenge, we had to learn a combination sword and hand movement meant to finish off our opponent at the end of a duel.",
    "Compared to the old motion-control days, when a wiimote could only track horizontal, vertical or thrusting attacks, Hasbro's sensors felt impressively accurate. You could tell that the app knew exactly where your lightsaber was in the air at all times. Moreover, we never had a problem with latency: the virtual lightsaber moved almost immediately after the real saber moved.",
    "With such specific tracking, it’s not outlandish to think that the app can distinguish between, say, Vader’s violent full-body attacks and Yoda’s smaller, more compact style. Still, we’ll need to conduct a full review of the app to see just how different these five styles are in practice. Since this toy is geared towards children, it's likely that these lessons and techniques will not be too difficult or combo-based.",
    "Your missions are focused solely around following the instructions of your Jedi Master. I asked the Hasbro rep if you could fight any iconic enemies from the Star Wars universe, but he said that wasn't a game option at this time. Since Lightsaber Academy is aimed towards younger kids, combat against bounty hunters and stormtroopers would probably be a bit too scary.",
    "You can see above some of the available lightsaber hilts and colors you’ll get to choose from this fall. As with most toy lightsabers, they're collapsable and made of durable plastic.",
    "In person, the lightsabers felt light enough to hold and swing around comfortably, though smaller hands might have trouble. Hasbro’s official age recommendation is 6+.",
    "The hilt that comes with the Lightsaber Academy pack has its own unique appearance from any of the iconic movie hilts, but arguably looks a bit generic. If your kid really wants a saber that matches the movie version, the $20 electronic lightsabers do have either Luke Skywalker’s or Darth Vader’s movie-accurate hilts—they just don’t have motion tracking.",
    "Our favorite element of the Smart-Hilt is the kyber crystal. Hidden underneath the plastic casing, the crystal shines different colors representing the different masters (red for Vader, blue for Rey, etc.). And you can press down on the crystal to cycle between colors (and masters) until you find a lesson or challenge that sounds interesting.",
    "Lots of tech companies have tried to recreate the feeling of wielding a lightsaber—Google’s Lightsaber Escape, Lenovo’s AR Jedi Challenges, ILMxLab’s Trials on Tatooine VR—without the tactile feedback of actually striking anything. With Hasbro’s Lightsaber Academy, you can physically strike at your opponent, but it’s recommended that you don’t.",
    "Instead, kids are meant to dual one another slightly far apart from one another, in what the Hasbro rep called a \"rock-paper-scissors type battle\".",
    "During the duel, you can either swing your sword at your opponent, hold it up horizontally in a blocking motion, or hold it vertically straight up to focus your Force energy. Attacking beats focus, focus beats defense, and defense beats attack.",
    "Successful hits eat away at your opponents’ health, which appears in the connected app; knock them down to zero, and you’ll have the chance to finish them off with a special move. Do so, and the winner will earn XP towards ranking up to a Jedi Master.",
    "In theory, this should make for a more mentally challenging experience than just clobbering one another, while also being a fun test of your reflexes. In practice, children will likely just swing wildly until the app names a winner.",
    "When we tried it out, we had an enjoyable time trying to outsmart the Hasbro rep and strategically block and focus. But his relentless attacks easily won out over our tactics.",
    "We came out of the experience having had a lot of fun, but with two key concerns: One, it’s difficult to both duel your opponent and look at the screen to check on your and your opponents’ health, so you don’t really know how well you’re doing during the actual duel.",
    "Two, the simplified rock-paper-scissors format means that all of the special techniques and attacks the kids learn can all be blocked by the same blocking motion, and that speed is more important than technique. In other words, there doesn't seem to be enough cohesion between the single player and multiplayer experiences.",
    "Despite these drawbacks, the experience will provide a lot of fun for kids, and enough gameified tutorial content to provide plenty of replay value.",
    "And, if your kids ever grow tired of the app, they can just use the lightsabers as regular toy swords."
  ],
  "headers": {
    "3": "Price, availability and what’s in the box",
    "8": "Beginning your quest towards Jedi mastery",
    "14": "Design",
    "18": "Dueling",
    "26": "Early verdict"
  },
  "links": {
    "Toy Fair 2019": "https://www.techradar.com/news/tech-toys-2019-the-best-new-games-and-gadgets-from-the-nyc-toy-fair",
    "Google’s Lightsaber Escape": "https://www.techradar.com/news/gaming/google-has-found-a-way-to-turn-your-phone-into-a-real-lightsaber-1311281",
    "Lenovo’s AR Jedi Challenges": "https://www.techradar.com/reviews/lenovo-star-wars-jedi-challenges",
    "ILMxLab’s Trials on Tatooine VR": "https://www.techradar.com/news/gaming/in-vr-fixing-the-millennium-falcon-is-as-fun-as-wielding-a-lightsaber-1317109"
  }
}