{
  "source": "https://www.techradar.com/reviews/fiio-m9-high-resolution-audio-player",
  "title": "Fiio M9 High-Resolution Audio Player review",
  "category": "audio-visual",
  "updated": "2019-02-28T22:25:11Z",
  "author": "ted-kritsonis",
  "summary": "Self-respecting audiophiles looking for a sound boost should lend both ears",
  "verdict": "At $299 (£229, AU$439), the M9 isn’t one of FiiO’s top-end DAPs, but it’s in a sweet spot that delivers solid audio performance for the price.",
  "pros": [
    "Solid audio quality",
    "Third-party app support",
    "USB DAC and AirPlay"
  ],
  "cons": [
    "No app store or music storefront",
    "800x400 resolution",
    "Lack of internal storage"
  ],
  "article": [
    "You probably haven't paid attention to music players since the days of the iPod Nano, but for the high-resolution audio and the hi-fi crowd, they're still a valued and integral part of the music listening process.",
    "And that’s where the Fiio M9 comes in. The M9 is a steady digital audio player (DAP) offering enhanced MP3 playback, along with access to some streaming music. It even runs on Android... albeit with major conditions.",
    "If you're disappointed by your smartphone's inability to play pristine-quality audio, and you’re looking to upgrade, this may be a way to do that.",
    "If you’re coming from another FiiO product, the M9’s design philosophy probably won’t surprise you: It’s a stocky build, reminiscent of a cell phone from 2006, but small enough to fit in just about any pocket. Made with a firm casing, we liked that the plastic protective sleeve was already wrapped around the unit out of the box.",
    "There are two headphone jacks covering 3.5mm and 2.5mm plugs, plus a USB-C charging port at the bottom. Along the side, you get the power button, play/pause, track navigation, memory card slot and volume dial.",
    "That card slot looms large from the start because there’s only 2GB of internal storage to work with, which is merely the spec on paper. Once you account for Android and preloaded apps, there’s only hundreds of megabytes to really work with. We had to install three successive firmware updates after receiving our review unit, and could only do it by sliding in a memory card to provide the storage for the files.",
    "The storage issue is definitely problematic, but it's something we'll come back to later on in the review.",
    "First, the guts inside include two AK4490EN DAC chips and an A3P030 FPGA. Those in the know will understand the specs, but if it’s all gibberish to you, these come together to produce the quality FiiO stands by.",
    "The 3.2-inch IPS display is a paltry 800 x 400 and it shows. We get that watching videos isn't the focus of the M9, but better contrast and color would be nice.",
    "That said, it was pretty effective for touch-sensitivity and there are some nuances we didn’t pick up right away: for instance, FiiO didn’t include a physical back button, so we soon learned that swiping up from one side of the screen substitutes for it. Swiping up on the other side returns to the home screen.",
    "Along with the wired connections, the M9 also supports Wi-Fi and Bluetooth. It’s Bluetooth 4.2, to be exact, and that includes the following codecs in 24-bit: aptX, aptX HD, LDAC and HWA. We also found an AirPlay option on the device, but it wasn’t what you might think.",
    "For one, it works in reverse. The M9 isn’t pushing music out to an AirPlay-enabled speaker, it’s acting as the receiver instead. We used an iPhone to send music over to the M9 where we got the benefit of improved audio fidelity. This included from stored files on the iPhone, along with Apple Music and other streaming services not natively supported on FiiO’s device.",
    "The M9 isn’t without a couple of pleasant surprises that way, too. Reading through the manual, we noted that the USB-C port doubled as an asynchronous DAC with Windows PC and Mac computers. On a Mac, the M9 just worked immediately without having to install a driver, though, on a PC, it does need to download a driver first after first plugging in.",
    "FiiO also added the ability to make the M9 a Bluetooth transmitter for any PC or Mac it’s connected to. For example, when we plugged it in to a Mac, turned on USB DAC in the settings, and started streaming via Bluetooth, the computer’s audio started funneling through our paired headphones.",
    "Some of these features weren’t available when the M9 first launched, and have been part of subsequent firmware updates. Updating the firmware could be smoother, but we’re pleased to see FiiO consistently support and upgrade the M9’s features.",
    "The M9 runs a pared-down version of Android, and the two key omissions are an app store and music storefront. Google Play doesn’t come with it, despite support for other third-party apps. Tidal is already preloaded, along with FiiO’s own music app, but getting others on there required us loading up and installing APK files onto the memory card. Doing that got us Spotify, Amazon Music and SoundCloud.",
    "FiiO will only support specific apps, so not all APKs will work. Only those you can download from FiiO’s website seem to be compatible.",
    "Since there’s also no Google Play Music to buy tracks, you have to buy the music elsewhere and load it onto the memory card to play on the M9. That can make sense when considering the player can handle all the popular lossless formats, like WAV, FLAC, ALAC and AIFF (plus the lower-bitrate ones), which you probably get from various sources anyway, but that's still a hassle considering the player's distinct lack of built-in storage.",
    "Once you do get music playing on it, the sound quality does show what’s missing in the average smartphone. Tracks that may have sounded muddy or spectrum-skewed come through bright and resonant here. Spatial separation is impressive. Vocals have warmth to them without annoying sibilance. Same goes for instruments and melodies, where you can appreciate the multitude of elements that went into creating a song.",
    "We reckon listeners demanding tons of bass may not find enough of it here, but we came away liking how each genre sounded. If you want to feel the music, this thing makes it easier to do that. It can get really loud, and we never came close to the full 100 volume points.",
    "FiiO claims 10 hours of continuous playback on one charge, with a standby time of up to 45 days. We never hit 10 hours at any time. Between the volume levels, or streaming music one way or another, Bluetooth, USB DAC and other nifty features, we found it hard to approximate battery life with that kind of mixed usage. We did hit eight hours with minimal streaming and no USB DAC use. It was less than that once we started using the other features, though.",
    "Your best bet for stretching out the battery is to play music on the memory card - we were able to creep up above eight hours without any streaming.",
    "At $299 (£229, AU$439), the M9 isn’t one of FiiO’s top-end DAPs, but it’s in a sweet spot that delivers solid audio performance for the price.",
    "To the uninitiated, it harkens back to a not-so-distant past, but to the audiophile crowd, it’s correcting what mobile devices often fail to deliver. Features like AirPlay and USB DAC only add to the value of what comes with it."
  ],
  "headers": {
    "3": "Design",
    "10": "Connectivity",
    "15": "Performance",
    "22": "Final verdict"
  },
  "links": {}
}