{
  "source": "https://www.techradar.com/reviews/humaneyes-vuze-xr-review",
  "title": "HumanEyes Vuze XR review",
  "category": "cameras",
  "updated": "2019-04-26T14:39:47Z",
  "author": "jamie-carter",
  "summary": "Putting VR and 3D back into 360°",
  "verdict": "Can’t decide between 360°, VR and 3D? This 5.7K resolution dual camera isn’t the finished article, but has core quality where it counts.",
  "pros": [
    "5.7K resolution",
    "360° and 180° modes",
    "Impressive 2D and 3D footage",
    "Excellent build quality"
  ],
  "cons": [
    "Limited phone app",
    "Flawed desktop software",
    "Not waterproof",
    "Expensive"
  ],
  "article": [
    "What is a 360° camera for? In recent months the classic dual lens camera has morphed into something else, with the likes of the Insta360 One X and GoPro Fusion both offering something called ‘over-capture’. Basically, you film everything on a 360°, and later use that footage merely to decide exactly what you want to include in the frame of a standard widescreen HD video. This clever new baton-shaped device from HumanEyes does that too in a basic sense, but it also adds to the regular dual-lens 360° mode a rather clever 180° mode. Cue 3D. Remember that?",
    "The Vuze XR has taken its sweet time coming to market; it was originally announced in July 2018 but wasn’t available until CES in January. Just in time for us to take it out into the extreme conditions of southern Utah in winter. Is it a glorious new kind of gadget, or is 180° 3D merely a gimmick?",
    "Despite it being primarily a 360° camera, the headline act here is undoubtedly 180° 3D. It's possible to physically change the positions of its two 210° f/2.4 fisheye lenses (each backed by a 12MP, 210° Sony IMX-378 sensor) at the tap of a button. You then flip them out to create a camera with the same orientation as a pair of eyes … the maker is called HumanEyes, after all. However, in this post-3D TV world, is creating 3D footage in 180° – especially since it’s hard to share online and demands a VR headset – really a must-have feature?",
    "However, beyond the novelty of 3D is a 5.7K resolution, which should make a massive difference to the 4K resolutions which dominate in the 360° camera market. It also shoots 18MP still images.",
    "The Vuze XR is a unique-looking camera. Unlike most 360° cameras, it’s primarily designed to be handheld. The battery is stored in a hefty column that’s ideally sized to be gripped, and the button to initiate recording and take photos is perfectly placed where a thumb naturally rests.",
    "While handholding, it’s wise to use the wristband provided, which screws on to the bottom of the Vuze XR. It’s actually a standard tripod thread, so it’s simple to attach the Vuze XR to a tripod, selfie stick, or any accessory that attaches to handlebars, ski helmet, etc. It's solidly made, but it's not waterproof. That's a shame.",
    "When put into 3D mode, the lenses swivel through 90⁰, leaving a small square rig behind. That mechanism could potentially create frailty, but at all times the Vuze XR’s soft-touch plastic feels reassuringly strong and weighty. It weighs 212g, measures 152mm from top to bottom, and its column is 39mm wide. It takes a microSD card and charges via USB-C.",
    "It ships with a small holster-style neoprene case, which has a soft lining and a Velcro closure, though lacks a belt loop or neck strap, which would be very handy.",
    "Using the Vuze XR is both 2D and 3D is a cinch, though it's a little too easy to depress the stop/go button while holding it. Battery life lasted just over an hour during several tests.",
    "Best of all is the Vuze XR's image quality, which is consistently excellent. Whether you shoot into the or 3D, the ultra-wide lenses produce colourful and contrasty images (when viewed through a VR headset or Google Cardboard). The image stabilisation lacks the fluidity of Insta360 and GoPro products and the automatic stitching together of images from the two lenses is sometimes visible (occasionally it’s awful). However, kudos for the impressive depth the Vuze XR can produce; it's genuinely impressive, even addictive.",
    "However, I did have a few issues when setting-up the Vuze XR. First, the password provided for WiFi connection was wrong, leading to a frustrating 15 minutes. Secondly, as soon as a phone was connected to the Vuze XR's WiFi network, the camera wanted to update the firmware. From where? Cue a request to … wait for it … manually change the subnet mask and router. What’s the target market here? I ended up doing a manual update via a download from Vuze’s website, which was irritating, but much easier.",
    "The Vuze XR's usefulness is tainted somewhat by its basic free app. It gives a live preview of what is being filmed, and a way of shifting files from the camera to a phone, but that's about it. There are almost no editing features whatsoever. There's also a catch in that you’re limited to transferring video to a phone in 4K 30fps. If you want to deal in 5.7K and 4K 60fps video, that needs to be done manually by transferring files to a PC or Mac and using the free Vuze VR Studio software. That software is not exactly slick, but there are a ton of options, from stabilising video to the horizon (which works really well for ridding VR video of motion sickness issues) to outputting videos in various resolutions and formats for Facebook, sharing etc. You can also change the exposure, colour temperature, saturation, highlights and shadows of any video or image, as well as crop it. It lacks a speed-up option, which is a shame given how lame all cycling and skiing videos are when viewed at normal speed.",
    "Though renders are reasonably quick, the software frequently froze during our test on an iMac, and also crashed once.",
    "Solidly constructed, easy to use and with an interesting take on producing 2D 180°, the Vuze XR will have an appeal to content creators who have yet to be convinced by 360°. Is it unique? For now, yes, but hot on its heels is a similar offering from QooCam. With a disappointing app and desktop software that needs work, as well as some stitching issues, the Vuze XR isn't the finished article, but it’s an intriguing and mostly great quality first-generation attempt at creating something genuinely different."
  ],
  "headers": {
    "2": "Features",
    "4": "Design",
    "8": "Performance",
    "11": "App & software",
    "13": "Verdict"
  },
  "links": {
    "Insta360 One X": "https://www.techradar.com/reviews/insta360-one-x",
    "GoPro Fusion": "https://www.techradar.com/reviews/gopro-fusion",
    "QooCam": "https://www.kandaovr.com/qoocam/"
  }
}