{
  "source": "https://www.techradar.com/reviews/withings-move-review",
  "title": "Withings Move review",
  "category": "wearables",
  "updated": "2019-04-02T14:53:03Z",
  "author": "alistair-charlton",
  "summary": "A bargain of a hybrid smartwatch, but with some drawbacks",
  "verdict": "The Withings Move is a budget-priced hybrid smartwatch with a classy, personalizable design. It tracks walking, running, swimming and sleep, but that low price means some corners have been cut, especially with the use of plastic and the lack of a heart rate monitor. It still feels like a true Withings product though.",
  "pros": [
    "Classy, subtle design",
    "Several color options",
    "Claimed 18-month battery life"
  ],
  "cons": [
    "Plastic scratches easily",
    "Sleep tracking not always accurate",
    "No heart rate monitor"
  ],
  "article": [
    "Having only bought itself back from Nokia a few months ago, French fitness tech maker Withings is keen to get back into the swing of things. The company used the CES technology show in Las Vegas in January to announce the Move, its cheapest ever hybrid smartwatch.",
    "Maintaining a similar general design to its pricier siblings, the new Withings Move cuts costs by replacing a glass or sapphire front with plastic, and it misses out on a heart rate monitor.",
    "But what it gains is an impressive claimed battery life of 18 months, walk, run and swim tracking, sleep analysis, and the same connectivity to Withings’ fully-fledged fitness app, Health Mate.",
    "Being a hybrid smartwatch, the Withings Move does not feature a touchscreen (or any form of digital display at all), and there is no support for notifications, other than a silent alarm which wakes you up with a vibration at the optimal time.",
    "This is an inherently simple smartwatch, but it still offers a way to track your daily steps, exercise and sleep, using a device which looks like a regular watch and has none of the wrist-worn-computer aesthetics of full-blown smartwatches, or dedicated fitness trackers like those from Fitbit and Garmin.",
    "Arguably the biggest highlight of the Withings Move is its price. At $70/£60 it is comfortably cheaper than the rest of the Withings lineup, which before the Move started at $130/£120 for the Withings Steel and headed to $200/£190 and beyond for the flagship Withings Steel HR Sport with a premium leather strap.",
    "To put the $70/£60 Move into context, Withings sells leather straps for only a little less than that, at $50/£45.",
    "At this level the Move is almost an impulse purchase, made on a whim by a consumer who wants to step onto the first rung of the smartwatch and fitness tech ladder.",
    "Or someone who wants a simple, low-priced device for chucking in their gym bag and not worrying about in the same why you might a $200/£190+ intelligent timepiece - or indeed a $400/£400/AU$600 Apple Watch 4.",
    "Pre-orders for the Withings Move went live early in 2019 with an estimated launch date of February, but it wasn't until April that you could buy the watch. Those in the UK can buy it now, while those in the US have to wait until April 3.",
    "We've yet to hear when - or if - the watch will be available in Australia.",
    "Withings has a strong track record for producing intelligent watches which look like regular timepieces. Instead of fitting large touchscreen displays, 4G connectivity and rotating bezels, the company has always kept things simple.",
    "The new Move takes this philosophy even further, to the point where all but the most knowledgeable techie wouldn’t know this was anything other than a simple and stylish wristwatch.",
    "The face is clear and easy to read - even on the stealthy black-on-black review unit we have here - and universal lugs with quick-release bars mean any industry-standard strap can be fitted.",
    "What moves the game on, at least as far as Withings is concerned, is the broad range of color options on offer. Apart from a small range of colorful straps, Withings’ previous watches have offered a somewhat conservative palette, but with the Move things have been livened up.",
    "There are five options for the case and face, plus a further four to five strap options for each, depending on which you pick.",
    "The white-faced model with blue secondary hand is particularly striking, especially when paired with a yellow or green strap, and reminds us of watches by Mondaine. Meanwhile, the black model we have with matching strap and green hand is pure stealth.",
    "On the Withings website, you can also customize your own device choosing the design of the watch face as well as the color of the body and the strap. This is currently a feature that you can't get in the US, but Withings has confirmed it plans to allow you to do this there by the end of the year.",
    "The Move fits very well and secures with a regular buckle. We’re sure the watch will fit just about anyone, thanks to more than a dozen holes punched through the silicone strap, and even our skinny wrists demanded only the sixth-smallest option. We’d like to have seen a second loop to keep the excess strap in place however, as we found it often came loose.",
    "We also noticed how the strap loves to attract fluff from clothing, and given we reviewed the Move during a chilly week in January, our jumpers tended to molt onto the soft rubber strap.",
    "The broad selection of colors means there really is a Move for everyone, and even if you’re not blown away by the selection it’s quick and easy to swap the strap out for something else - including those offered for sale by Withings itself.",
    "Given its light weight and relatively small case, the Move is very comfortable for a hybrid smartwatch and we never felt self-conscious wearing it, as can sometimes be the case with bulkier wearables.",
    "Our only real cause for concern is with the plastic case front, which Withings has chosen to fit in place of scratch-resistant sapphire crystal. It is undoubtedly a move to keep costs down, and while it still offers a crystal-clear view of the face below, it is susceptible to scratches.",
    "After a week on our wrist, the Move gained a hairline scratch around the seven o’clock position, and a more obvious graze right above the number four.",
    "The watch still works fine, of course, and the time isn’t obscured, but once we had spotted the graze - and felt it beneath our fingers - the blemish was impossible to ignore.",
    "We’re not sure what would have caused this, as for much of the week the Move has been tucked beneath a jumper or coat, which gives us reason to question its durability. If this happens after a week, will the Move look a real mess after a year, or when the battery needs replacing at 18 months?",
    "You have to of course bear in mind the low price, but it’s still a shame that this could happen with relatively gentle use. Introduce the Move to a gym three times a week, or an even harsher environment like a climbing wall, and the plastic might not remain spotless for long."
  ],
  "headers": {
    "5": "Withings Move price and release date",
    "11": "Design"
  },
  "links": {
    "Withings Steel": "https://www.techradar.com/reviews/nokia-steel",
    "Withings Steel HR Sport": "https://www.techradar.com/reviews/withings-steel-hr-sport-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review"
  }
}