{
  "source": "https://www.techradar.com/reviews/asus-zenbook-14-ux433f",
  "title": "Asus Zenbook 14 UX433F review",
  "category": "computing",
  "updated": "2019-06-26T15:01:43Z",
  "author": "jeremy-laird",
  "summary": "The 14-inch laptop that’s almost all screen",
  "verdict": "Asus’s new all-screen Zenbook delivers a 14-inch viewing experience in a 13-inch laptop form factor with strong Intel-powered quad-core performance.",
  "pros": [
    "Incredible screen-to-body ratio",
    "Well engineered",
    "Good performance"
  ],
  "cons": [
    "Screen isn’t actually that stellar",
    "Port selection is dated",
    "No USB-C charging"
  ],
  "article": [
    "The world’s smallest 14-inch laptop. That’s Asus’s sock-it-to-you sales pitch for the new Zenbook 14 UX433F. It’s not the only thing this slick Intel-powered laptop has going for it, of course.",
    "There’s powerful quad-core processing, just for starters. Claimed all-day battery life and Harmon Kardon audio sweetens the deal, too. But it’s that slim-bezeled ‘NanoEdge’ display and the extremely compact proportions it enables for a laptop in the 14-inch segment that most defines the Zenbook’s proposition.",
    "What’s on offer here, in effect, is a laptop that feels like it’s from the segment below in terms of size, but delivers a larger, more ergonomic 14-inch viewing experience.",
    "That means this 14 incher is barely any bigger than many 13-inch ultrabooks, like Dell’s XPS 13, while 14-inch Ultrabooks including the Lenovo ThinkPad X1 Carbon are tangibly larger. Whether that’s enough to stand out in a seriously crowded market of premium portables, is another matter.",
    "Priced at $1,099 or around £955 in the UK and AU$1,845 down under, the Asus Zenbook 14 represents strong but not quite stellar value.",
    "It’s worth noting, however, it looks a little better in the US and Australia thanks to being configured with 16GB of RAM at those prices whereas the UK price and indeed our review unit makes do with 8GB.",
    "Compared to the Full HD variant of the Dell XPS with a slower CPU for slightly more money, it’s certainly appealing. Choose a similarly-priced Lenovo Yoga 920 from the 14-inch class, what’s more, and you’ll get a smaller SSD and a slower CPU.",
    "The Asus Zenbook 14 UX433F is all about that screen. Or rather the lack of anything much around it. The side bezels measure just 2.9mm, while the bottom clocks in at 3.3mm and the top 6.1mm.",
    "The net result is a pretty staggering 92% screen-to-body ratio. Most notable is that slim bottom bezel. It’s what allows the Zenbook 14 to match the depth of 13-inch Ultrabooks with relatively hefty chin bezels, like the Dell XPS 13, for overall depth, while only being slightly wider in width.",
    "The marginally larger 6.1mm top bezel, meanwhile, seems like a reasonable compromise given it allows a webcam to be located at the top of the screen, rather than being positioned on the bottom bezel or the chassis itself for that rather unpleasant “up nose” angle.",
    "What the Asus Zenbook is not, however, is a truly ultra-thin and ultralight laptop. The likes of the aforementioned Dell XPS 13 is noticeably slimmer if no lighter and the super slim Acer Swift 7 is a 14-inch alternative in a whole different ballpark for thinness, clocking in at 0.89cm to the Zenbook’s 1.59cm.",
    "That said, there are upsides to a little thickness, including space to fit a pair of full-sized USB A ports. It’s just a pity that only one of them is full 3.1 speed while the other only offers the ancient and slow 2.0 spec.",
    "You do get a single USB Type-C port, HDMI-out and a microSD slot. But the ports and the conventional power socket, as opposed to charging via USB Type-C, do give the Zenbook 14 a slightly old fashioned feel. For sure, this is no modernist and minimalist USB Type-C-only design.",
    "Overall, the design is pretty pleasing, with an all-metal chassis that’s free from flex and a generously proportioned keyboard with a relatively long keystroke for an Ultrabook.",
    "The inclusion of Harmon Kardon audio is also welcome and the switchable backlit number-pad functionality of the trackpad is a nice touch, even if enabling and disabling it is an extremely hit and miss affair. The trackpad itself could also be bigger and more responsive."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design"
  },
  "links": {
    "Dell’s XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Lenovo ThinkPad X1 Carbon": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-carbon-2017",
    "Lenovo Yoga 920": "https://www.techradar.com/reviews/lenovo-yoga-920-review"
  }
}