{
  "source": "https://www.techradar.com/reviews/chord-qutest",
  "title": "Chord Qutest review",
  "category": "audio-visual",
  "updated": "2019-03-14T22:01:35Z",
  "author": "steve-may",
  "summary": "Chord’s Qutest DAC cuts the cost of audiophile-grade digital decoding",
  "verdict": "Capable of astounding clarity, Chord’s Qutest DAC cuts the cost of audiophile grade digital decoding. It’s a glorious Hi-Fi upgrade!",
  "pros": [
    "Stunning clarity and rhythm",
    "Wide sample range support",
    "Built to last"
  ],
  "cons": [
    "No Bluetooth",
    "Idiosyncratic interface",
    "Lacks coaxial digital input"
  ],
  "article": [
    "If you want to make the most of your digital music collection, it makes sense to invest in a decent DAC (Digital Analogue Converter).",
    "While DACs are commonplace - you’ll find them in any digital audio device with an analogue output - most aren't up to the challenge of procuring the best audio. The majority sound perfectly adequate, but there can be big sonic gains to be had when using a standalone DAC purpose built to restore digital music to something akin to its original analogue waveform.",
    "UK Hi-Fi outfit Chord Electronics is renowned for its innovative DACs. This is because the company doesn’t buy off-the-shelf solutions; it designs its own from the ground up.",
    "The Qutest can be found at the higher end of the DAC market, and as part of Chord’s Hugo range is a direct replacement for the 2Cute. It's expensive, certainly, but as it mirrors tech found in the brand’s step-up Hugo 2 which sells for twice as much, it can genuinely be construed as one of the best bargains in high-end audio.",
    "Rather compact, the Qutest measures a convenient 41 x 160 x 72mm (H/W/D) and features a beautiful brushed aluminium case, with characteristic Infinity Stone-style LED selectors. The quality of finish is dreamy.",
    "Up top is a glass porthole with a color coded sample rate indicator. Red indicates 44.1kHz PCM data, with colors cycling as the sample rate rises. This rainbow interface may look fun but it’s not particularly intuitive.",
    "Input selection is also color coded, with the polycarbonate input selection button glowing white for USB, yellow and red for the two BNC coaxials, and green for optical. The brightness of its LEDs can be altered between ‘high’ and ‘low’ by pressing the ‘filter’ and ‘input’ buttons simultaneously; just as well, as in a dark room it’s as festive as a Christmas tree.",
    "Thankfully, despite its high-end aspirations, there’s really not much involved in setting up. Once powered, the Qutest goes through a short initialization routine, and then you’re good to go.",
    "The Qutest offers wide-ranging sample support: A USB type-B handles PCM up to 32-bit 768kHz, or DSD 512; there’s a 24-bit 192kHz optical digital audio input, plus two BNC coaxials, which stretch to 24-bit 384kHz, or 768kHz in parallel dual-data mode. The latter can be used with Chord’s M-Scaler CD upscaler, which has a matching dual-data output. Useful, but we would've liked a convenient standard coaxial input.",
    "Analogue output is via unbalanced phonos, suitable for use with integrated amps, preamps and headphone amps, and source components might typically include CD transports, players, streaming devices, set top boxes and laptops.",
    "The Qutest is compatible with Mac OS X, Linux and Windows. The Chord website is the place for Windows drivers.",
    "Unfortunately, there’s no support for MQA decoding. Sorry Tidal fans.",
    "The only reason to invest in a high calibre DAC like this is to extract more detail from your digital recordings - and there’s no question that the Qutest succeeds in that regard as it lifted a veil on David Bowie’s Diamond Dogs (a Japanese SHM-CD release).",
    "During the opening of Future Legend, just before the band crash in the album’s title track, we found ourselves able to isolate hubbub in the faux crowd that we’ve not pinpointed before in umpteen listens. Similarly, the lilting piano refrain in Sweet Thing found itself elevated above that track’s improvised chaos. Using the Qutest was like hearing the song again for the first time.",
    "But a good DAC isn’t just defined by detail. It’s also about creating an intangible, heightened emotional connection to your music.",
    "Queen Live at the Rainbow ‘74 (CD), painstakingly restored and remastered, punched us in the chest. Freddy teasing ‘Here I stand’ before the band thunder into Now I’m Here, seemed almost three dimensional via this Chord.",
    "Moving from 16-bit to 24-bit files proves equally entertaining. Fritz Kreisler’s Viennese Caprice, a delightful dance for violin and orchestra, confirms a wonderful lightness of touch, while Mozart’s Piano Sonata in B Major is deliciously evocative. Shut your eyes and you could almost be walking alongside the composer to the Maria Prain church on the outskirts of Salzburg.",
    "While there's a lot happening under the hood, four frequency-shaping filters are available which tailor the tonal characteristic of the DAC. They comprise Incisive Neutral, Incisive Neutral with an HF roll-off, Warm and the same with an HF roll-off. It’s best to take the labelling of these with a pinch of salt. The differences between them are far more subtle than their tags might suggest.",
    "According to notes supplied by Chord, the Incisive Neutral filter offers a full, unexpurgated sound spectrum, regardless of sample rate, while the HF roll-off edition is for use with high sample rate PCM. The Warm filter aims to do what it says on the tin, again with an HF roll-off filter for high resolution PCM playback.",
    "If this all sounds a bit familiar, it’s because it is. The Qutest shares the same DAC design and frequency filter set as that much more expensive Hugo 2 (£1800). The difference is there’s no headphone amplifier or rechargeable battery here. Despite its handy size, the Qutest is unapologetically a desktop design. Perhaps as a consequence, there’s no Bluetooth on-board either.",
    "Of the four filters, our default was the Incisive Neutral, simply because of its stunning clarity, offering almost seismic definition between instruments and vocals and inviting you to dissect familiar songs.",
    "While the proprietary FPGA technology behind the Qutest may be mind-meltingly complex, you don’t need to understand how it works to appreciate the nuance and detail it reveals. That being said, offering gloriously detailed sound and exhilarating to listen to, the Qutest is a fabulous desktop DAC.",
    "There are minor caveats, like the lack of MQA support and Bluetooth - and the design is definitely idiosyncratic - but there’s no question that it’s an immaculate musical performer. The Chord Qutest is a perfect fusion of science and art."
  ],
  "headers": {
    "4": "Design",
    "8": "Features",
    "12": "Performance",
    "17": "How is it doing that?",
    "21": "Final verdict"
  },
  "links": {
    "DAC (Digital Analogue Converter)": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "Tidal": "https://www.techradar.com/reviews/tidal"
  }
}