{
  "source": "https://www.techradar.com/reviews/ue-wonderboom",
  "title": "UE Wonderboom review",
  "category": "audio-visual",
  "updated": "2019-12-04T14:12:17Z",
  "author": "lewis-leong",
  "summary": "One of the best-sounding waterproof speakers you can buy",
  "verdict": "The UE Wonderboom is one of the best waterproof Bluetooth speakers you can buy. It’s completely waterproof, offers true 360-degree sound, features a 100-foot range and can pair two devices simultaneously. The Wonderboom does so much right that it’s hard to knock its few flaws.",
  "pros": [
    "Sound punches above its size",
    "360-degree sound",
    "Multipoint pairing",
    "Waterproof"
  ],
  "cons": [
    "Small, unhelpful elastic hoop",
    "Slightly confined sounding",
    "No speakerphone"
  ],
  "article": [
    "The UE Wonderboom was one of the best waterproof speakers you could buy, until it was usurped by the UE Wonderboom 2 earlier this year, which offers longer battery life and a better bass response. You shouldn't write off the original Wonderboom though; it's still a fantastic portable speaker, and you can likely find it quite cheap now that a newer generation is on the scene.",
    "Logitech has had a good line on waterproof speaker design for some time now, with the UE Roll 2 always hitting the top of our list of recommendations in its heyday. Taking advantage of a unique form factor that provided it with a 50-foot wireless range , it sounded fantastic, apart from some weak bass response.",
    "Logitech, UE’s parent company, fixed the Roll 2’s lack of bass by creating the appropriately named UE Wonderboom. This $99 (£79.99, AU$129) diminutive speaker is smaller than the Roll 2 yet pumps out much more bass than its sibling.",
    "Moreover, the UE Wonderboom is still IPX7-rated which means you can submerge the speaker up to a meter of water for up to 30 minutes. It also conveniently floats, which means you won't have to dive in after it should it fall into your pool at your next party.",
    "So, now that the bass problem is a thing of the past, we can confidently say that Logitech and UE have created one of the best-sounding waterproof speakers you can buy, even if it is a bit long in the tooth these days.",
    "The UE Wonderboom does away with the saucer-like form factor of the UE Roll 2 and opts for a stubby soda can shape. While some may mourn the passing of the less-traditional saucer shape design, we think UE made the right move by making the Wonderboom smaller for a number of reasons.",
    "One of those advantages is that where the UE Roll 2 projected sound upwards and out, the UE Wonderboom projects sound from every side, allowing everyone the same listening experience no matter where they are. While many Bluetooth speakers advertise having 360-degree sound, many sound best at a specific angle. Not so with the Wonderboom.",
    "Since the Wonderboom is waterproof, all of its controls are sealed by a rubberized membrane, which can stand up to abuse. On top of the speaker you’ll find buttons for power, pairing and playback. The playback control button is actually the entire UE logo at the top, which left us initially confused as there’s no indication the whole top of the speaker is a button.",
    "On the front of the speaker you’ll find mesh fabric surrounding the speaker and buttons for controlling volume. The speaker comes in a six different colors to suit different tastes. Our unit was clad in an austere black on light gray, though purple, pink and orange are available for color-loving buyers.",
    "The only port on the speaker is the microUSB charging port which is covered by a waterproof flap. It would have been nice to see UE offer USB Type-C charging as most phones and laptops today now feature the new connection – but this isn’t what we’d consider a deal-breaker.",
    "Where the UE Roll 2 featured a hand bungee cord that wrapped around the speaker, the UE Wonderboom has a very short elastic loop. This makes mounting the speaker on things more of a challenge, and in some small way, helps to separate the two speakers however slightly. The Roll 2 was easy to hang from things like a shower head, but you’ll need to bring your own carabiners and cords to mount the UE Wonderboom.",
    "The UE Wonderboom sounds excellent and fixes the muddy bass from the UE Roll 2. Sound is warm, favoring mids and mid-bass. Highs sounded good as well, but were slightly uncontrolled at higher volumes, resulting in some sibilance.",
    "Bass is also good, but not class-leading. Bass-heads looking for a waterproof Bluetooth speaker should look no further than the JBL Charge 3. That’s not to say the bass isn’t good on the UE Wonderboom, though. For casual listening by (or in) the pool, the UE Wonderboom sounds excellent.",
    "In terms of sound, we found the UE Wonderboom fared well against the Bose SoundLink Color II and JBL Charge 3: The Charge 3 sounds the best of the group, offering toe-tapping bass and great sound projection that makes the Wonderboom sound confined. The Bose SoundLink Color II sounds slightly better than the Wonderboom when it comes to vocals, but also isn’t completely waterproof with only an IPX4 rating compared to the UE’s IPX7.",
    "Battery life is about average, lasting about 10 hours at moderate listening levels. Knock of a couple of hours if you’re listening to the speaker cranked up. Competitors like the aforementioned JBL Charge 3 boast twice the playtime, but it is also twice as big. Compact speakers like the Bose SoundLink Color II and Fugoo Go offer much shorter battery life, 8 hours in the case of the Bose and 10 hours for the Fugoo, making the Wonderboom competitive in this segment.",
    "The JBL Charge 3 sounds better, but it’s also twice the size of the Wonderboom. The Color II sounds slightly better with vocals but isn’t fully waterproof, requires directional sound and last two hours less than the Wonderboom. The Fugoo Go costs the same but doesn’t sound nearly as balanced as the Wonderboom, lacking in bass depth and punch.",
    "Want the best balance of sound, battery life and waterproofing?",
    "Wonderboom is the winner.",
    "Where the UE Wonderboom really shines is in its value. At $99 (￡79.99, AU$129), the Wonderboom offers a ton of features and performance for its price. The speaker sounds great, is fully waterproof, can pair to two devices simultaneously, can be paired to a second speaker, works with Siri or Google Assistant, and has a 100 feet wireless range. Adding all of these features up and it’s easy to see that the UE Wonderboom is an excellent waterproof speaker.",
    "Problematically, however, Logitech is offering both the UE Roll 2 and UE Wonderboom at the same price without much of a difference between them.",
    "In our eyes, the UE Wonderboom bests the Roll 2 in just about every way –except for the Roll 2’s handy bungee cord – and the existence of two like speakers will probably cause confusion.",
    "Still, ignoring that, if you’re looking for one of the best waterproof Bluetooth speakers on the market today, it’s hard to do better than the UE Wonderboom – unless you count the Wonderboom 2, that is."
  ],
  "headers": {
    "5": "Design",
    "11": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "best waterproof speakers": "https://www.techradar.com/news/best-waterproof-speaker",
    "UE Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2",
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "UE Roll 2": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/ue-roll-2-1325442/review",
    "JBL Charge 3": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/jbl-charge-3-bluetooth-speaker-1324500/review",
    "Bose SoundLink Color II": "https://www.techradar.com/reviews/bose-soundlink-color-2",
    "Fugoo Go": "https://www.techradar.com/reviews/fugoo-go"
  }
}