{
  "source": "https://www.techradar.com/reviews/crucial-x8-1tb-portable-ssd",
  "title": "Crucial X8 1TB Portable SSD review",
  "category": "computing",
  "updated": "2019-11-21T11:48:26Z",
  "author": "mark-pickavance",
  "summary": "NVMe gets outside the computer to stretch its legs",
  "verdict": "With great performance comes a few connection caveats. To get the best out of the Crucial X8, you need a Thunderbolt 3 or USB 3.2. Gen 1 port. With that box ticked this is a robust and stylish design that outperforms external SATA technology SSDs.",
  "pros": [
    "Fast",
    "Robust",
    "Type-A and Type-C connections"
  ],
  "cons": [
    "Needs a port some users don’t have",
    "No encryption"
  ],
  "article": [
    "External drives can be a bottleneck for any file transfer because they often don’t match the speed of internal storage, and they use a connection technology with limited bandwidth.",
    "With the advent of USB 3.2 and Thunderbolt 3, those bandwidth issues are resolved, allowing for NVMe specification SSDs to be externally connected.",
    "But is the potential speed on offer from the Crucial X8 worth the cost of ownership and the enhanced computer hardware needed to exploit it?",
    "Oddly, the packaging for the X8 is the same inexpensive cardboard box with a thin clear plastic tray concept that Crucial use on all its SSDs. We mention this only because it seems entirely at odds to the device, which if it was made by Apple would come in a massively over-engineered packaging in reverence to its elegant engineering.",
    "The X8 is a gloriously simple smooth black lozenge shape, not entirely unlike a Mark VII photon torpedo, with most of the structure being a thick metal tube that is cool to the touch.",
    "The ends are a silicon over-mould protecting it from being dropped from up to 7.5 feet, according to the makers.",
    "On the top and bottom are what look like two inset pieces of black glass on which the Crucial logo, capacity and various standards flags are marked.",
    "What appears missing is any LED to indicate activity, although using it with a computer would usually provide some feedback on the screen.",
    "Despite no lights, this is probably the classiest piece of gear that Crucial has shipped so far.",
    "In the box is a small paper ‘Hello’ document that tells you where to get the supporting software from the Crucial website and outlines the warranty, in 22 different languages, and a USB cable.",
    "It’s easy and cheap to take a 2.5-inch SSD and place it in a cheap external USB 3.0 connecting box to make a fast portable drive. But, the limitations of the SATA bus on the drive, and the bandwidth limitations of USB 3.0 will cap the speed of the drive at 400-450MB/s for both reading and writing, even with the very best caddy and SATA SSD.",
    "The X8 isn’t like this at all, because the SSD inside is an NVMe PCIe design made for much higher performance, and the external bandwidth issue is addressed by using Thunderbolt 3 or USB 3.2 Gen 1.",
    "In this configuration, it should allow the drive to read and write in excess of 1,000Mb/s, which isn’t remarkable by internal NVMe standards, but blindingly quick for an external drive.",
    "If this device has a caveat, it’s the cable.",
    "At 25 cm long it isn’t overly short and comes with a Type-C connector for the drive and a Type-A variety at the computer end. But, you can pull the Type-A converter off and reveal another Type-C end.",
    "Separate cables would have been better, as most users will assume that the performance of both ports is the same. Depending on the port specification, it can be radically different.",
    "And, another minor point is that the cable is rated for USB 3.1 Gen 2 operation, but it doesn’t have the correct logos that indicate this spec.",
    "While the cable might not be perfect is can be used with any PC or Mac with USB, the Sony PlayStation 4, Xbox One or Apple iPad Pro.",
    "Although, as we’ll talk about later, being able to connect and use the drive isn’t the same as getting the most out of the technology that Crucial put inside.",
    "Crucial sells directly from its website and through a wide range of online and retail chains. Therefore, it should be possible to source the X8 in most regions easily.",
    "The UK Crucial MSRP is £160.79 inc. VAT for the 1TB capacity, and we found it for £154.95 on Amazon. In the US the MSRP is $189.95, but you can find it for $164.95 online.",
    "Compared with some of the competitor products, this device is very reasonably priced. With the SanDisk Extreme PRO 1TB costing $219.99, and the Samsung X5 Portable 1TB $255.72.",
    "The WD My Passport SSD 1TB is $167.99, much closer to the X8 price. However, it is a SATA technology drive and not NVMe. You can get cheaper 1TB SSDs, but they are invariably based on SATA SSD technology unlike the Crucial X8 and the Samsung X5.",
    "Crucial claims a transfer speed of up to 1050MB/s for both reading and writing. By internal NVMe M.2 standards this would be a disappointing score, but it's impressive for an external drive.",
    "But, it’s important to realise that how you plug this drive into a system can dramatically influence how fast it performs.",
    "If you put the X8 into a standard USB 3.0 port (aka USB 3.1 Gen 1) you will only be able to achieve a top speed around 480MB/s, reading and writing, hitting the bandwidth limitation of that interface.",
    "If you have access to either USB 3.1 Gen 2, USB 3.2 or Thunderbolt 3 ports, the X8 can reliably deliver greater than 900Mb/s for reading and writing on a Windows PC.",
    "Using the latest Toshiba Tecra X-50F, we recorded 915MB/s reads and 930MB/s writing using CrystalDisk 6.02. And, other tests were straddled these numbers.",
    "We never achieved the levels quoted by Crucial, but the scores are close enough that it would be possible on a highly tuned system.",
    "For those wondering if they can merely add a PCIe card to their desktop computers with Thunderbolt 3 technology, that isn’t a standard option. You can with a few odd motherboard exceptions from Asus and Gigabyte, but for Thunderbolt to be an add-on, the system must have it baked into its technological DNA from the outset.",
    "However, you should be able to add USB 3.1 Gen 2 or USB 3.2 and get very close to the optimal Thunderbolt 3 performance levels.",
    "The X8 isn’t the quickest external SSD we’ve tested. But, compared with typical SATA based SSDs it demonstrates a dramatic speed improvement.",
    "The Crucial X8 is a beautifully made device that blends functionality with style and even sports abuse resistance. It’s also very affordable considering the 1TB capacity and high transfer speeds of a device that you can carry in a pocket.",
    "The snag, and it’s a subtle one, is that without Thunderbolt 3, or USB 3.2 Gen 2 when it arrives, this is just another USB 3.0 connected external drive that isn’t any quicker than a SATA connected SSD.",
    "With a USB 3.0 connection, the best likely performance will be around 450MB/s, making it a much less compelling option.",
    "For those that have the connection technology, this is an excellent choice as it provides the higher speeds at a price that isn’t much greater than lower speed SSD options.",
    "We only wish that Crucial have a 2TB version ready for those with larger file collections they need to carry with them."
  ],
  "headers": {
    "3": "Design",
    "10": "In use",
    "19": "Competition",
    "23": "Performance",
    "32": "Final verdict"
  },
  "links": {}
}