{
  "source": "https://www.techradar.com/reviews/amd-ryzen-9-3900x",
  "title": "AMD Ryzen 9 3900X review",
  "category": "components",
  "updated": "2019-11-18T18:36:27Z",
  "author": "bill-thomas",
  "summary": "Team Red’s takeover",
  "verdict": "The AMD Ryzen 9 3900X is the best mainstream processor on the market right now. With multi-threaded performance that destroys everything in its path and the inclusion of PCIe 4.0, you can’t find a better processor without stepping up to the HEDT market.",
  "pros": [
    "Incredible performance",
    "PCIe 4.0",
    "Beats Intel at same price"
  ],
  "cons": [
    "Included heatsink may not be enough",
    "Single core performance still behind"
  ],
  "article": [
    "In our mind, the best processors are the ones that deliver outstanding performance at a reasonable price point. And, the Ryzen 9 3900X absolutely nails this concept.",
    "This processor packs 12-cores and 24-threads in a mainstream package for the first time, and does it at a similar price point as the Intel Core i9-9900K, a processor with just 8-cores and 16-threads.",
    "The AMD Ryzen 9 3900X marks yet another blast from Team Red, ramping up the intensity of the AMD vs Intel processor war. Still, though, there’s more than just core counts when it comes to a mainstream processor, as single-core performance needs to be on point, especially if you’re hoping to play the best PC games.",
    "Now, we're asking ourselves whether or not the AMD Ryzen 9 3900X finally dethrones the Intel Core i9-9900K as the de facto ruler of the mainstream processors. Ultimately, it depends: the 3900X doesn't reach the same single-core performance as Intel, but we're starting to see more games adopt multi-threaded CPUs, so that doesn't matter as much. And, now that people are going to be buying more CPUs for Black Friday, this will make for a more heated processor battle.",
    "Speaking of which, if you want a high-end desktop (HEDT) 12-core processor that can compete with the AMD Ryzen 9 3900X, you’re going to have to drop quite a bit more cash and get something like the $1,189 (£1,329, AU$1,799) Intel Core i9-9920X. And, even if you do go with this Intel Basin Falls Refresh chip, you won’t necessarily end up with the same level of performance.",
    "The AMD Ryzen 9 3900X is available now for $499 (about £390, AU$720). This is actually a great price point, as it stands up against the $488 (£498, AU$777) Intel Core i9-9900K while offering an extra four cores. It doesn’t boost as high, and the retail box isn’t as cool, but any creatives that are shopping for a great processor without jumping for a Threadripper 2nd Generation chip should take notice.",
    "AMD Ryzen 3rd Generation, and the Zen 2 architecture itself, is notable because it leads 7nm processors to the mainstream for the first time. But, there’s a lot more going on under the hood than just a smaller manufacturing node.",
    "The most important improvement, and the easiest to understand, is the massive increase to IPC, or instructions per clock. AMD claims that it was able to increase IPCs in its 3rd generation Ryzen chips by up to 15%, which goes a long way to explaining why single-core performance sees such a boost over something like the AMD Ryzen 7 2700X.",
    "That increased IPC improvements, along with the massive turbo boost of 4.6GHz mean that even in single core performance – long a weak link of AMD’s processors – comes within reaching distance of Team Blue’s chips.",
    "One thing that the switch to 7nm silicon has allowed for however, is an increase in cache size. AMD is now describing its L3 and L2 cache in a combined spec of ‘GameCache’ – even though it’s basically the same thing. But, because the 7nm CPU cores are contained within their own chiplets, AMD was able to pack much more in – with a whopping 64MB of L3 and 6MB of L2, for a combined 70MB of GameCache. This is a really big deal, as it allows for much faster performance, especially when you’re shooting for high framerates in 1080p games, and will be especially effective in old esports titles like Counter Strike: Global Offensive.",
    "Another improvement that comes with AMD Ryzen, and more specifically the X570 chipset, is the long-awaited inclusion of PCIe Gen 4. Now, the only graphics cards that use PCIe 4.0 today are the AMD Radeon RX 5700 XT and AMD Radeon RX 5700, but your GPU is almost less noteworthy than the improvements it will bring to the best SSDs.",
    "We were given an Aorus PCIe 4.0 SSD to test, and the speeds we saw were amazing. We were able to get sequential reads of 4,996 MB/s, a 29% boost over our previous fastest SSD, the Samsung 970 Pro. Out of all the features that Ryzen 3rd Generation brings to the table with the new X570 chipset, this might be one of the most meaningful – and also explains the plethora of high-end AMD motherboards on the market this time around.",
    "Finally, the shrink down to 7nm allows for much better energy efficiency. Because of the Zen 2 architecture, AMD Ryzen 3rd Generation processors like the Ryzen 9 3900X and Ryzen 7 3700X should be up to 58% more efficient than comparable Intel processors. This isn’t the most noteworthy feature here, but, hey, it should translate to lower electricity bills, and in today’s economy every little bit helps, right?",
    "It shouldn’t be too terribly surprising that a 12-core, 24-thread processor with a 4.6GHz boost clock performs like an absolute monster. The AMD Ryzen 9 3900X is straight up the fastest piece of silicon you can buy without wading into the HEDT scene – at least until the Ryzen 9 3950X comes out in September 2019.",
    "The AMD Ryzen 9 3900X really shows what it’s made of when it comes to multi-threaded workloads. For instance, in both Geekbench and Cinebench R15, the 12-core processor scored a whopping 44,160 and 3,097, respectively. Compared to the Intel Core i9-9900K, which scores 33,173 and 1,873 in the same tests, it’s a night and day difference. For about the same price point, the Ryzen 9 3900X is between 25%-40% faster than the Intel Core i9-9900K in multi-threaded loads.",
    "Unfortunately, this doesn’t quite translate to as strong of a single-core performance, even if AMD is closer than it’s ever been to matching Intel core for core. In our single-core GeekBench and Cinebench tests, the Ryzen 9 3900X scored a 5,569 and 203, respectively. This is definitely a huge leap over the Ryzen 7 2700X, but it’s slower than the 9900K, which scored a 6,333 and 211 in the same tests. But, that’s still between a 4% and 13% difference, so the multi-core gains generally outweigh them.",
    "And, when it comes to gaming, the general rule of thumb for about as long as we could remember is that single-core performance rules supreme. However, in a lot of modern games – likely due to the prominence AMD Ryzen processors have gained – multi-core performance is becoming more and more utilized. For instance, in Total War: Warhammer II, we were experiencing higher frame rates at 1080p with the 3900X than with the Intel Core i9-9900K coupled with the same Nvidia GeForce GTX 1080 Ti GPU – up to 17%, in fact.",
    "The big downside here, though, is the chip’s power consumption and thermal performance. Now, we should be abundantly clear here: we tested using the included Wraith Spire cooler, rather than employing an AIO liquid cooling solution. Still, we saw temperatures hit 83 degrees Celsius, and power consumption reach all the way up to 145W. So, while the included thermal solution will do in a pinch, we recommend picking up an aftermarket cooler – something potential customers for a chip of this caliber will probably do anyways.",
    "The AMD Ryzen 9 3900X is an absolute behemoth of a processor, as it absolutely should be with its 12 cores, 24 threads and high price tag. If you’re looking for the absolute best processor money can buy on a mainstream processor, then look no further. Whether you’re playing PC games or even doing hardcore video and 3D work, the AMD Ryzen 9 3900X can handle them with ease.",
    "However, you should be aware that there are some workloads where the Intel Core i9-9900K will still perform a little better. Old games that are completely single threaded, like World of Warcraft, will still run better on an Intel processor – but that gap is definitely starting to narrow.",
    "The inclusion of PCIe Gen 4.0 is also a huge boon to choosing the AMD Ryzen 9 3900X, as it should contribute to a faster system overall, thanks to speedier SSDs – and that’s something you can only currently get with Ryzen 3000 and X570. Over the last couple years, AMD has been reaching for dominance in the desktop CPU world, and with the AMD Ryzen 9 3900X, it's finally there."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Features and chipset",
    "13": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "best processors": "https://www.techradar.com/news/best-processors",
    "Intel Core i9-9900K": "https://www.techradar.com/reviews/intel-core-i9-9900k-review",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Intel Basin Falls Refresh": "https://www.techradar.com/news/intel-basin-falls-refresh",
    "Threadripper 2nd Generation": "https://www.techradar.com/news/amd-ryzen-threadripper-2nd-generation",
    "AMD Ryzen 3rd Generation": "https://www.techradar.com/news/amd-ryzen-3rd-generation",
    "Zen 2": "https://www.techradar.com/news/amd-zen-2",
    "AMD Ryzen 7 2700X": "https://www.techradar.com/reviews/amd-ryzen-7-2700x",
    "best SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "Samsung 970 Pro": "https://www.techradar.com/reviews/samsung-970-pro",
    "Ryzen 7 3700X": "https://www.techradar.com/reviews/amd-ryzen-7-3700x",
    "Intel processors": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue"
  }
}