{
  "source": "https://www.techradar.com/reviews/panasonic-lumix-s1r-review",
  "title": "Panasonic Lumix S1R review",
  "category": "cameras",
  "updated": "2019-05-17T18:26:06Z",
  "author": "matt-golowczynski",
  "summary": "A mighty fine flagship",
  "verdict": "The Panasonic Lumix S1R is blessed with an effective image stabilization system, a cracking EVF and a solid build, while its image and video quality also impress. The AF system is behind its peers, however, and the camera doesn't really exhibit any size and weight advantages over equivalent DSLRs. Nevertheless, Panasonic has done a great job to deliver something so competent so early on in this system.",
  "pros": [
    "Stunning, best-in-class viewfinder",
    "Excellent detail, even with 'kit' lens",
    "Superb build quality",
    "Very effective image stabilization",
    "Great noise control at high ISOs",
    "Buffer depth surprisingly good"
  ],
  "cons": [
    "Heavy and large body",
    "AF system behind competition",
    "Eyecup can get in the way of LCD",
    "Some awkward controls",
    "No real size/weight advantage over DSLR",
    "Battery life not great"
  ],
  "article": [
    "Panasonic has been strongly associated with the Four Thirds and Micro Four Thirds formats for over 13 years now, and its G series Micro Four Thirds cameras have been a smash among everyone from amateur photographers to professional videographers.",
    "So its decision to enter the full-frame market was met with great surprise last year – not least because the announcement came within months of Nikon and Canon's own respective entrances to the same arena.",
    "Much like Nikon, Panasonic kicks off its new Lumix S series with two models whose principal difference is the resolution of their sensors. Whereas the Panasonic S1 arrives with a 24.2MP full-frame sensor, the S1R that's on test here ups this to 47.3MP. At least for the time being, this qualifies it as the highest-resolution full-frame mirrorless model on the market, just edging ahead of Nikon's Z7 and Sony's A7R III.",
    "As the (joint) first camera in a new series we expect a few teething issues, but the S1 already impressed in our full review, which gives us some idea what to expect here. But is the S1R best thought of simply as an S1 with more megapixels? Or is there more under the hood to consider?",
    "The S1R arrives with a fresh 47.3MP full-frame sensor, one that we've not seen on any previous camera. This has been designed without an optical low-pass filter for optimal resolution of fine detail, while each pixel is topped by an aspherical microlens to help as much light as possible pass through to the photosite.",
    "If 47.3MP sounds familiar, that's because Leica's most recent Q2 compact camera also features a full-frame sensor with this resolution – and as Leica is Panasonic's compadre in the L-mount alliance, it seems reasonable to conclude that the two sensors are at the very least related, if not identical.",
    "This resolution produces files with pixel dimensions of 8368 x 5584, but the S1R can go one better when required. In fact, it can go a lot better, with its High Resolution mode outputting images at a staggering 187MP.",
    "The principle behind this – namely capturing a series of images with minute shifts in the position of the sensor between each exposure before they're blended together – may be familiar from previous DSLRs and mirrorless models, but we've not had any camera claim to deliver such an insanely large files before.",
    "The model uses the same L mount that Leica has used for some of its previous models, although Panasonic, along with Sigma, has now started to develop lenses for the mount under its own brand.",
    "Currently there are three of these optics, namely the Lumix S Pro 50mm f/1.4, Lumix S Pro 70-200mm f/4 O.I.S. and the Lumix S Pro 24-105mm f/4 Macro O.I.S., although many more are set to arrive over the course of the next few years.",
    "Panasonic has been combining its sensor- and lens-based image stabilization systems for some time on its G-series models, and we have the same kind of setup here.",
    "Going under the same Dual I.S. 2 moniker as before, this system promises 5-axis stabilization. The advantage of this Dual I.S. 2 system is twofold: not only do you benefit from image stabilization when using non-stabilized lenses, but you also gain better correction when the lenses do have such a system in place.",
    "The CIPA rating for stabilization provided by the sensor alone is 5.5 stops, and this increases to a maximum six stops when used with a lens with its own stabilization. This is also complemented by a nifty I.S. Status Scope that provides a graphical representation of how much shake the camera senses as you hold it.",
    "Right now, it's only the Lumix S Pro 50 f/1.4 from the native triplet of lenses that lacks its own stabilization system, although the camera also accepts Leica's L-mount lenses without this technology – and a raft of lenses from both Panasonic and Sigma look set to fill this range up quickly.",
    "We've been impressed by Panasonic's existing 3.69 million-dot viewfinders inside the G9 and GH5S, but the S1R ramps things up considerably. The 5.76 million-dot OLED panel is far higher in resolution than we normally get at this (or any) level, and its maximum 0.78x magnification is very respectable too.",
    "This viewfinder boasts a maximum refresh rate of 120fps and a lag time of 0.005 sec, and features an eye sensor above the eyepiece to help alternate between showing the feed inside the LCD and the viewfinder. This appears to be the same unit as the one inside the S1, which we found to be superb.",
    "The touch-sensitive LCD screen beneath it is also very well specced, with 2.1 million dots spread over a 3.2-inch panel. This pulls away from the body and tilts up and down, although a catch on its side also allows you to tilt it sideways. This mirrors the design of the Fujifilm X-T3's rear display, and it offers the key advantage of making shooting in portrait orientation easier when the camera is held either up high or at ground level (or when shooting around corners, if you ever find yourself needing to do that).",
    "Panasonic has been particularly strong on 4K video recording in recent years, so it's no surprise to see the S1R arrive with a solid video core augmented by a comprehensive suite of supporting options. It records 4K UHD footage (3840 x 2160) at frame rates of up to 60/50p at 150MB/s. Frame rates of 30/25/24p are available too, as is the option to record in Full HD.",
    "A range of profiles to allow for a better starting point for grading are also available, and these include Cinelike D, Cinelike V, Like709 and an Hybrid Log Gamma option in both monochrome and color options. A V-Log shooting mode, however, is only available through a paid-for update, rather than being included on the camera as standard.",
    "As with the S1, the S1R has been designed with two card slots, one for XQD cards and the other for SDHC/SDXC cards. Impressively, each card slot supports memory cards of the highest calibre right now, with the SDHC/SDXC slot supporting both UHS-I and UHS II cards, and the UHS Speed Class 3 and Video Speed Class 90 standards. Panasonic has also promised that the XQD slot will support the CFexpress format that's due to succeed XQD shortly.",
    "Battery life is rated at around 380 shots when using an SD-type card, and just a slightly lower 360 shots when using XQD cards, with each figure dropping by 20 frames if you're using the electronic viewfinder over the LCD. If you switch to using the Power Save option, however, these figures more or less triple, and the reality is that you'll be able to get more shots than what's stated here in real-world use."
  ],
  "headers": {
    "4": "Features"
  },
  "links": {
    "Panasonic S1": "https://www.techradar.com/reviews/panasonic-lumix-s1-review",
    "Nikon's Z7": "https://www.techradar.com/reviews/nikon-z7-review",
    "Sony's A7R III": "https://www.techradar.com/reviews/sony-alpha-a7r-iii-review",
    "Q2": "https://www.techradar.com/news/the-leica-q2-could-be-the-ultimate-compact-camera",
    "L-mount alliance": "https://www.techradar.com/news/the-l-mount-alliance-panasonic-leica-and-sigma-join-forces",
    "G9": "https://www.techradar.com/reviews/panasonic-lumix-g9-review",
    "GH5S": "https://www.techradar.com/reviews/panasonic-lumix-gh5s",
    "which we found to be superb": "https://www.techradar.com/reviews/panasonic-lumix-s1-review/3",
    "Fujifilm X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3"
  }
}