{
  "source": "https://www.techradar.com/reviews/acusis-medical-transcription-service",
  "title": "Acusis Medical Transcription Service review",
  "category": "computing",
  "updated": "2020-01-25T12:50:18Z",
  "author": "jonas-p-demuro",
  "summary": "Robust medical transcription as part of a larger ecosystem of services",
  "verdict": "Acusis is a powerful veteran of the medical transcription space, and with its flexibility, can accommodate a wide variety of workloads.",
  "pros": [
    "Choice of dictation options, including iPhone",
    "HIPAA certified transcriptionists",
    "Flexible pricing",
    "Rapid turnaround"
  ],
  "cons": [
    "Opaque pricing",
    "No Android support"
  ],
  "article": [
    "Acusis is a leader in medical transcription, founded in India, with additional offices in Pittsburgh, Pennsylvania and the Philippines. The company was founded by Bill Benter, in 2001, with a background in software development for high technology for entrepreneurs. Acusis also is involved in other related areas as well, including Clinical Documentation, and Revenue Cycle Management.",
    "Acusis is based around their proprietary software, known as AcuSuite, that provides a process for clinical documentation, with the targeted goals including reliability, and compatibility with a wide variety of EHR systems. An emphasis is also placed on efficiency for the clinician to reduce the time and burden of creating their documentation. There is also integrated fast document delivery for minimal turn around time, including options for receipt of the transcribed documents that include automatic printing, faxing and emailing.",
    "A strength of Acusis is the choice of interfaces offered for dictation, that suit a variety of different clinician’s work patterns. Older clinicians often favor dictating via a traditional telephone, and for those, Acusis offers AcuVoice, which upgrades this time honored method into the state of the art. For this method, clinicians dial in, and use a secure PIN to identify themselves, with the ability to record, edit, replay and manage dictations. The software can be hosted locally, or via the cloud, with a convenient web interface to allow for customization. There are also options for integration into a Radiology, or Pathology workflow.",
    "While older clinicians may prefer using a wired telephone, younger ones frequently prefer using their smartphone, and for them Acusis offers AcuMobile. Rather than being constrained to a landline, this mobile, iPhone based platform can perform dictation capture, playback and review. The transcribed reports can be reviewed, with the opportunity for accepting, or rejecting them. Dictations get organized into a “Familiar folder arrangement – draft, sent, outbox.” Also, conveniently the app can synchronize with any EHR/HIS system’s patient appointments, so dictations can follow the visits, streamlining the process, and reducing the burden of identifying each patient at the beginning of each dictation.",
    "There is also a third option offered for transcription, AcuSpeech. This is a cloud based solution that supports voice recognition, and supports voice transcription for clinical content creation in any software. As an option, dictated jobs can be sent to Acusis, with just a mere click, for professional editing. Also making this an attractive option is that there is no upfront cost, with only a charge when used. It also uses the smartphone wireless mic, which has the added benefit of needing no new infrastructure, and keeping clinicians mobile.",
    "Sending documents out for transcription does raise some patient privacy concerns, as clinical notes and consults contain Protected Health Information (PHI). Acusis addresses this critically important issue by having all of their transcriptionists be HIPAA certified- which is renewed on an annual basis to maintain this level of certification. In addition, they are professional transcriptionists (many of which have a degree in a medical field), which drives a high quality of service, with a low document turnaround time that gets specified in the contract. Security of the documents is also insured with 256-bit encryption on all transfers, done via a VPN, with all data stored locally at their end also encrypted, and deleted periodically.",
    "Flexibility is another hallmark of the Acusis transcription service. For example, some facilities do some of their transcriptions in house, and use a provider as a backup, rather than simply outsourcing the entire process out. For those more challenging setups, Acusis offers a unified workflow engine, that has the internal transcriptionists inserted into the seamless workflow, with Acusis able to pick up the slack on the weekend and night hours. In another example of flexibility, Acusis can also support situations where dual signatures are required on documents, such as with medical students, or in residency training programs where notes are created by the trainee, and then reviewed, and cosigned by the attending physician.",
    "The Acusis medical transcription service endeavors to offer a high accuracy rate, with the goal of eliminating errors. Their process incorporates Six Sigma and TQM methodologies, and online editing for quality control. Through these processes, Acusis indicates that they exceed a 98% accuracy through their transcribing process.",
    "Pricing for acusis is not available on the website, and unfortunately requires contact with the company. While each practice situation is unique, in terms of the specialty, number of providers, the type and volume of the documents generated, it still would be nice to be able to get an idea of the costs without needing to provide the contact details. Flexible pricing is offered, with options to pay by the line, or by the VBC (visible black character). The package chosen with other options, and the technology chosen for the dictation also will figure into the price, without a doubt. There are also five options for the turnaround time (TAT), with different brackets offered, ranging from a speedy two hours, to a reasonably quick 24 hours, with dictations taking longer than the TAT not being charged for.",
    "Acusis provides a broad range of medical transcription services, as part of their larger suite of healthcare focused revenue cycle management. Clinicians are sure to be pleased with the flexible options for dictation, including the ability to dictate into virtually any program, and the mobile option to use an app on their iPhone to facilitate the dictations, freeing them from being tethered to a desktop workstation. The deficits of the lack of support for the Android platform, and the opaque pricing model should be considered as well, but in the final analysis it becomes clear why Acusis remains a leading transcription solution."
  ],
  "headers": {
    "1": "Features",
    "8": "Pricing",
    "9": "Final verdict"
  },
  "links": {
    "Acusis": "http://www.acusis.com/Clinical-Documentation-Management/Medical-Transcription-Service",
    "medical transcription": "https://www.techradar.com/best/best-medical-transcription-services"
  }
}