{
  "source": "https://www.techradar.com/reviews/anker-soundcore-flare",
  "title": "Anker Soundcore Flare review",
  "category": "audio-visual",
  "updated": "2019-12-04T14:15:51.206Z",
  "author": "lewis-leong",
  "summary": "A speaker that learned from the best",
  "verdict": "The Anker Soundcore Flare combines the best features of its competitors into an affordable package that’s tough to beat. For the price, the Flare offers good sound, a tough waterproof build and excellent user experience. The LED light show is a bit of a gimmick, sure, but it's certainly fun and can be disabled entirely.",
  "pros": [
    "Impressive sound for the size",
    "Waterproof",
    "Excellent mobile app"
  ],
  "cons": [
    "Bass boost and EQ are very mild",
    "Average battery life",
    "Harsh at max volume"
  ],
  "article": [
    "A year after we reviewed it, the Anker SoundCore Flare remains on our list of the best Bluetooth speakers. For a paltry $60 (£70, about AU$123) you get an excellent waterproof Bluetooth speaker that can stand toe-to-toe with the competition.",
    "Not only does the Flare offers balanced sound, a tough waterproof build, a light show when you want, and an excellent user experience, but it does so without breaking the bank. Here's what it's like to use one.",
    "The design of the Anker Soundcore Flare mashes up with some of the best Bluetooth speakers on the market. It has the shape of the Bose SoundLink Revolve Mini, the cloth texture of the UE Wonderboom, and the light show of the JBL Pulse 3.",
    "Design-wise, the speaker is slightly shorter than the Revolve Mini and taller than the UE Wonderboom making it portable enough but not as easy to travel with as the Wonderboom or something like the Miniring Mini.",
    "Build quality is very good and the Flare feels like it can put up with some abuse. While the speaker feels rugged, the UE Wonderboom feels like you can play American football with it, making it our choice for taking outdoors.",
    "Speaking of the outdoors, the Soundcore Flare is IPX7 rated, which means you can dunk it and not worry about it, making it an excellent speaker to take to the pool or beach. There’s no loop for a carabiner like the UE Wonderboom which makes the Flare slightly more cumbersome to carry around hiking outdoors.",
    "On top of the speaker you get controls for music playback, the RGB LED and a bass boost button. Pressing the light button cycles through various modes while a long-press will shut off the lights. On the back of the speaker you’ll find the power and pairing button along with a rubber flap protecting the 3.5mm jack and microUSB charging port.",
    "The bottom of the speaker features a rugged rubber base and a light ring. The LEDs can be set to pulse with your music to create a light show or can be switched to a soothing breathing mode. You can switch light modes either by cycling through them with the light button up top or from the mobile app. The app also allows you to adjust the EQ and toggle the Bass Up feature.",
    "Sound quality of the Anker Soundcore Flare is overall balanced but highs can sound a bit harsh at times when the EQ is set to flat. Enabling the Bass Up feature helps bass response a tiny bit but the effect is very subtle. In fact, all of the EQ presets are quite subtle, shifting the tonal balance of the speaker slightly.",
    "That being said, for its size the Anker Soundcore Flare can get loud and produces admirable bass. With the Bass Up feature enabled, we find the Flare produces slightly more bass than the UE Wonderboom but both lack the visceral impact that larger speakers provide. Similarly, highs are a bit uncontrolled and sound harsh at times, especially at high volumes. There’s slight distortion so those who like to listen to music loudly will want to invest in a larger speaker.",
    "Battery life is rated at around 12 hours and will depend largely on volume level and the brightness of the LEDs. With the LEDs set to medium intensity and listening at 50% volume, we managed to get around 8 hours. However, you can stretch the battery life by disabling the light show entirely.",
    "The Soundcore Flare is an amazing value in the sub-$100 wireless speaker segment. Competitors like the UE Wonderboom give the Flare a run for its money in terms of build quality but we give the Flare the slight edge with sound quality. However, the Wonderboom is more rugged and can be clipped to a bag.",
    "For the money, we can’t think of a speaker that offers a better balance of features, build quality and sound. While other speakers may sound better, you’re going to have to spent much more money. Is it worth the $20 premium over the Soundcore 2? Absolutely. We recommend the Flare for anyone looking for a wireless speaker that can do it all without breaking the bank. Highly recommended."
  ],
  "headers": {
    "2": "Design",
    "8": "Performance",
    "11": "Verdict"
  },
  "links": {
    "best Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Bose SoundLink Revolve Mini": "https://www.techradar.com/reviews/bose-soundlink-revolve",
    "UE Wonderboom": "https://www.techradar.com/reviews/ue-wonderboom",
    "JBL Pulse 3": "https://www.techradar.com/reviews/jbl-pulse-3-india",
    "Miniring Mini": "https://www.techradar.com/reviews/minirig-mini"
  }
}