{
  "source": "https://www.techradar.com/reviews/google-pixel-2-xl-review",
  "title": "Google Pixel 2 XL review",
  "category": "phones",
  "updated": "2019-06-18T20:58:41Z",
  "author": "cameron-faulkner",
  "summary": "A solid handset that still has a killer camera",
  "verdict": "Despite losing the cherished 3.5mm headphone jack, the Pixel 2 XL makes up for it in spades with a mix of unique and sought-after features like a stellar design, waterproofing, Active Edge and a truly impressive camera.",
  "pros": [
    "Smart software that will only get better",
    "Confident design",
    "The very best smartphone camera"
  ],
  "cons": [
    "No 3.5mm headphone port",
    "Expensive",
    "Poor viewing angles for an OLED"
  ],
  "article": [
    "Even years after its release, the Google Pixel 2 XL is a stunning result from the company’s fusing of software and hardware efforts. While the phone has been surpassed by the Google Pixel 3 XL, and potentially the more affordable Google Pixel 3a XL, it's still a showcase of how far Google’s design (and the stock Android experience powering it) have come in the past few years. At this point, it's cheaper than the latest flagship, too.",
    "The Google Pixel 2XL debuted a few interesting features, like the intelligent Google Lens feature and the slick, new Pixel Launcher. As a first-party device, it also gets first crack at the Android Q beta.",
    "In many ways, this is Google’s best phone yet, and all the more affordable years after its release. Its impressive look and stellar, plus-sized screen go toe-to-toe with the fierce competition. The real kicker here are its cameras, which manage to outperform most, if not all, phones that have come before it.",
    "However, this is also the company’s most expensive phone yet. And for that stack of cash, you can easily find a competent option that trumps the Google Pixel 2 XL in terms of hardware features (like expandable storage and wireless charging).",
    "There are also reports of a screen burn-in problems Google Pixel XL when a static image remains on the OLED display for too long. So far, the issues are faint and shouldn't dissuade you. We'll keep this review updated as we hear more and if you want to keep up with the problems impacting some models, head over to our guide that can teach you how to fix some of them.",
    "Watch our design and screen review of the Google Pixel 2 series below.",
    "Interestingly, perhaps the biggest competitor working against the Pixel 2 XL is the smaller Google Pixel 2, which retails for $200 (£170, AU$329) less.",
    "The two are very different in some ways that may matter to you (with the XL offering a larger battery, slim bezels and a bigger, better screen), but the cheaper option provides largely the same experience.",
    "Google touted the lack of differences between the two models as a perk, not-so-subtly digging at Apple’s decision to include the dual rear lens camera only in the iPhone 7 Plus and iPhone 8 Plus.",
    "And it’s true: fewer differences makes for an easier buying decision, effectively reducing it down to size and screen quality preference.",
    "Are you an entertainment junkie who demands stock Android, a large, pixel-dense display, and a forward-thinking design? If so, you’ll be hard-pressed to find a phablet that can take better pictures and is guaranteed to be updated well into the future with Android P and Android Q.",
    "(Update: Google Pixel 2 XL continues to be a smart option in 2018 thanks to Google's prompt updates, including the latest that awakens the Pixel Visual Core, this phone's co-processor dedicated to making images look even better.",
    "If you're looking forward to Android P, you can download the public beta on the Pixel 2 XL right now. Keep in mind that it's unfinished software at this stage, so it will likely have stability issues.",
    "You'll find the Pixel 2 XL on our list of the best phones (US) (UK), where it ranks admirably against the toughest batch of flagship phones we've seen in years.)",
    "The Google Pixel 2 XL release date was October 19 in the US, UK, Canada, Australia, Germany and India.",
    "While the phone is currently available to order, it may not ship to you right away. We’ve noticed that the Google Store for the UK, for example, lists a wait time of five to six weeks for delivery.",
    "As mentioned earlier, the Pixel 2 XL starts at US$849 (£799, AU$1,399) for the base 64GB model, while the 128GB version is priced at US$949 (£899, AU$1,549).",
    "This is more expensive than last year’s pricing scheme, which saw the original Pixel XL sitting at $120 above the smaller option. The result? It now costs $200 (£170, AU$329) more to make the jump between the Google Pixel 2 and the larger version.",
    "In each region where the Pixel 2 XL is available, you can snag it unlocked for the prices listed above, though local carriers, like Verizon in the US, EE in the UK and Telstra in Australia will offer the phone for a monthly rate.",
    "Best of all, many retailers are offering a free Google Home Mini with initial orders.",
    "The Google Pixel 2 XL is the first smartphone to have built-in eSIM technology, meaning no SIM card is required. You just download the necessary credentials to the phone and you’re all set.",
    "Unfortunate for most, this feature only currently works with Project Fi, Google’s own wireless carrier that operates in the US. We're Fi subscribers and were eager to give this a try and it was as simple as we had hoped.",
    "Depending on who you ask, last year’s Google Pixel phones either looked like a good start for the line, a little too iPhone-esque or just a peculiar shade of futurism that didn’t sit quite right.",
    "And while the Google Pixel 2 and the Pixel 2 XL have mostly held onto the divisive two-toned pairing of glass and aluminum, the company has worked to better meet expectations in the middle with a bevy of improvements, including IP67 waterproofing.",
    "Aluminum now makes up a larger majority of the back, and the grippy texture Google has worked into the material makes carrying the Pixel 2 XL sans case feels less like an accident waiting to happen.",
    "The top glass section looks and feels like an accent rather than a functional part of the design, with only the large rear-facing camera, flash and accompanying sensors sitting within it.",
    "Pats on the back for whoever at Google had the good idea to put a metal ring around the rear camera, as it will go a really long way in preventing a repeat of the profound horror endured when the original Pixel’s rear glass cracked.",
    "Speaking of a few other improvements, Google’s new phone employs Gorilla Glass 5 and with that, a three-dimensional curve around its edges that makes it easier to hold and of course, gives it a stunning look.",
    "If you’re trying to figure out the differences between the Pixel 2 XL and its predecessor, setting them side by side helps to clear things up. The new device is 3mm taller at 157.9mm, about 1mm wider at 76.7mm, and all-around a thinner device at a consistent 7.9mm, while the original fluctuated between 7.3 and 8.5mm.",
    "The changes seem negligible on paper, but they effectively impart a shift in design that’s made even more apparent by this 2017 smartphone’s trimmed bezels and taller 18:9 display aspect ratio on the front.",
    "And while this is where the phone falls in line with other popular flagships from the year, there are a few unique traits tossed into the mix.",
    "Within the bezels are dual front-facing speakers, which alone justify them being a bit thicker than we’ve seen on the Samsung Galaxy S8 and Essential Phone.",
    "It’s a small, but welcome, quality-of-life feature to not have to cup the bottom of the phone while watching a YouTube video to funnel the sound toward our ears. Google has also tossed in an excellent front-facing camera and a subtle notification LED into the top bezel.",
    "Neither the Pixel 2 or the Pixel 2 XL feature a 3.5mm headphone jack. These aren’t the first Android phones to omit the legacy port, but given that it made a pointed jab at Apple for doing so last year, there’s a bit of egg on Google’s face right about now.",
    "However, it’s less than you might think given that Android Oreo supports plenty of high-quality wireless audio codecs. We’ll touch more on this further into the review.",
    "Moving right along, the sides along the Pixel 2 XL are smoothed over, offering a single texture in place of the multi-layered mix of chamfered edges and glossy metal used together in 2016’s model.",
    "As usual, the right side of the smartphone plays host to the volume rocker and power button (no longer textured), with each delivering an optimal amount of tactility when pressed.",
    "But it also features an unusual hardware button that can’t be seen, Active Edge, which lets you squeeze the phone’s lower half to call up Google Assistant.",
    "You might remember that this feature first popped up as Edge Sense in the HTC U11, but it’s still cool to see it show up in the Pixel 2 XL. If you’re someone who utilizes the Google Assistant frequently, you’ll probably enjoy this. But given that Google currently doesn’t offer any customization for the feature, your mileage may vary.",
    "It’d be great to see the squeeze function extend to booting the camera, an app or really, executing any command the user wants.",
    "Then again, we quickly began to use the feature for Google Assistant regularly, and the deftness of squeeze actually feels better here than it did on the original HTC U11.",
    "Snug between the curved, slim bezels is an LG-made pOLED display that pushes a QHD+ 2,880 x 1,440 resolution with the aforementioned 18:9 display.",
    "On first glance, we noticed that its color profile isn’t as strikingly vibrant as we found on the original Google Pixel XL, but it seems to strive for better contrast and color accuracy, deeper blacks, and as a result might be a smidge more efficient.",
    "One of the big problems is the viewing angles though - turn the phone even slightly side to side and you'll see things get really dull in both brightness and color... it's a definite downside compared to last year's Samsung-made displays in the original Pixel handsets.",
    "Whether there's a polarizer, glass treatment or just less impressive production, the screen has taken a backwards step over last year's Pixel XL.",
    "Android Oreo on the Pixel 2 XL hides a display setting to activate “vivid colors” which actually does amp up the saturation just a bit on colorful graphics in photos, games and videos, but you’re not likely to notice a huge difference.",
    "If you’re stuck deciding between the 5-inch Google Pixel 2 and the 6-inch Pixel 2 XL, screen size obviously comes into play, but so does screen quality. While both are plenty crisp at 441ppi (pixels per inch) and 538ppi for the Pixel 2 and 2 XL respectively, the resolution differs quite a bit.",
    "Compared to 1080p on the smaller option, this year’s XL provides QHD+, which makes this the ideal option if you find yourself watching lots of movies and hopping into the Google Daydream View (2017) for some virtual reality enjoyment.",
    "That said, both phones boast a new feature for a Google-made device: always-on display. Samsung, LG, Moto and others aren’t strangers to this feature, but it’s now available on stock Android, complete with a few new additions.",
    "Activated by default, each phone will show you the time, date and app icons that you have pending notifications to check out.",
    "If you’d like, you can and should switch on the “Now Playing” feature that listens in on music playing out and about and shows the song title on the bottom of the display.",
    "Google says it does this locally without sending your data to its servers, and in our experience, it works like a charm. It’s one of those special touches that makes stock Android feel fresher than ever."
  ],
  "headers": {
    "14": "Google Pixel 2 XL price and release date",
    "22": "Design and Active Edge",
    "41": "Display"
  },
  "links": {
    "Google Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "Google Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "Android Q": "https://www.techradar.com/news/android-q",
    "screen burn-in problems": "https://www.techradar.com/news/pixel-2-xl-screen-burn-in-problems",
    "guide": "https://www.techradar.com/news/google-pixel-2-and-pixel-2-xl-problems",
    "Google Pixel 2": "https://www.techradar.com/reviews/google-pixel-2-review",
    "iPhone 7 Plus": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-7-plus-1327948/review",
    "iPhone 8 Plus": "https://www.techradar.com/reviews/iphone-8-plus-review",
    "US": "https://www.techradar.com/news/phone-and-communications/mobile-phones/20-best-mobile-phones-in-the-world-today-1092343",
    "UK": "https://www.techradar.com/news/best-phone",
    "Pixel XL": "https://www.techradar.com/reviews/google-pixel-xl-review",
    "Google Home Mini": "https://www.techradar.com/reviews/google-home-mini",
    "Google Pixel": "https://www.techradar.com/reviews/google-pixel-review",
    "Samsung Galaxy S8": "https://www.techradar.com/reviews/samsung-galaxy-s8-review",
    "Essential Phone": "https://www.techradar.com/reviews/essential-phone",
    "Android Oreo": "https://www.techradar.com/news/android-oreo-features-release-date",
    "HTC U11": "https://www.techradar.com/reviews/htc-u11-review"
  }
}