{
  "source": "https://www.techradar.com/reviews/beats-solo-pro",
  "title": "Beats Solo Pro review",
  "category": "audio-visual",
  "updated": "2019-12-16T02:59:16Z",
  "author": "stephen-lambrechts",
  "summary": "Beats' on-ear Solo line gets a 'Pure ANC' upgrade",
  "verdict": "After years of minor revisions to the Solo line, Beats has delivered a true reinvention with the Solo Pro. Bringing top-notch adaptive noise cancelling to its on-ear offering for the first time, Beats Solo Pro is a marked step-up from its previous iterations – particularly when it comes to build quality.",
  "pros": [
    "Excellent battery life",
    "Impressive ANC performance",
    "Stunning design",
    "Surprisingly sturdy"
  ],
  "cons": [
    "Lightning port only",
    "Lacks 3.5mm Aux port",
    "Headband pressure too firm"
  ],
  "article": [
    "The Beats Solo Pro could well be a turning point in the Apple-owned headphone company's journey. While these are still unmistakably Beats headphones, the designers of these new over-ear cans have made some surprising tweaks to the brand's normally bass-heavy sound profile, and the hardware has incorporated some notable improvements in terms of build quality.",
    "Beats iconic and instantly recognizable designs long ago turned it into the world's most fashionable headphone brand, with a huge variety of colors and styles making it easy for anyone to find a set of cans that suits their own personal style. To borrow a quote from Eminem in the magnificent Dr. Dre and Jimmy Iovine-themed series The Defiant Ones, Beats really are \"the Jordans of headphones.\"",
    "Of course, there's obviously much more to headphones than how they look. When it comes to sound and build quality, many audiophiles have been quick to dismiss Beats products – this despite the fact that the audio company has made significant strides in both areas since being purchased by Apple back in 2014.",
    "Beats Solo 3 Wireless were the first headphones the company released after the acquisition. While those incorporated many technological improvements over the previous Beats Solo 2 Wireless on-ear cans – particularly, some top-notch wireless connectivity via Apple's W1 chip – their questionable durability and focus on heavy bass at the expense of the mid range still turned many people off.",
    "After a well-received update to the Powerbeats in-ear range via this year's Powerbeats Pro, Apple has turned its attention back to the extremely popular over-ear Solo range, with the Beats Solo Pro the result. With a far more balanced sound profile that gives equal attention to lows, mids and highs alongside an enormous upgrade in general sturdiness, the Beats Solo Pro are also the company's first on-ear cans to offer pure adaptive noise cancelling (or Pure ANC), easily earning its newfound 'Pro' status.",
    "Priced at $299.95 (£269.95 / AU$429.95 / NZ$499.95), the Solo Pro will likely appeal most to users who want a great pair of Beats cans without committing to Apple's bulkier, pricier over-ear option, the Beats Studio 3 Wireless. Luckily for them, the Solo Pro basically outclasses the latter in every single way.",
    "The first thing you're likely to notice about the Beats Solo Pro is how striking and sophisticated they look, with hidden seams, a matte finish and a single color motif bringing the cans a distinctly minimalist design aesthetic. In terms of colors, Beats Solo Pro are available in Black, Ivory, Gray, Dark Blue, Light Blue and a very striking Red, which is what we reviewed.",
    "The Solo Pro's strong anodized aluminum side arms also slide out of the headband in a much more discrete way now, avoiding the exposed metal sections that appeared mid-band when extending previous Beats 'bands.",
    "Apart from bringing a slight flimsiness to earlier models, the old extendable arm method was also responsible for breaking up the headband's sleek silhouette and 'one piece' illusion. Of course, there are still hinges in the headband, allowing you to fold and stow the Solo Pro's in their accompanying faux felt pouch (which is actually made almost entirely of recycled plastic).",
    "That minimalism we spoke of earlier extends to the Solo Pro's controls, which are near invisible. Typical Apple headphone controls apply here: pressing the 'b' logo once on the right earpiece will pause and play your music, as well as answer phone calls. Pressing it twice will skip to the next song, while pressing it three times will go back to the previous track. You can also press above and below the logo to raise and lower your music's volume, and holding the button will activate Siri for iPhone users.",
    "The only other button on Beats Solo Pro can be found at the bottom of the left can. This lets you cycle Pure ANC on and off, and also initiate transparency mode. This uses the built-in mics to pull through outside audio (like voices and announcements) for better situational awareness.",
    "Astute readers may have noticed we haven't mentioned anything about a power button on the Beats Solo Pro – and that's because there isn't one! Instead, the headphones will automatically switch on and connect to your device when you unfold them, similar to the method implemented on Jabra's Elite 85h headphones.",
    "The power button isn't the only thing absent from the Solo Pro headphones. A more lamentable exclusion is one that stems from Apple's decision to drop the iPhone's 3.5mm headphone port – a change that's now made its way to Beats products. That's right – the Beats Solo Pro are strictly wireless, meaning you won't be able to use them with products that lack support for Bluetooth audio (like the Nintendo Switch) without an additional cable or third-party adapter.",
    "As for the Solo Pro's charging port, Apple has stuck with a Lightning connector for the time being. It works well enough, and is convenient for iPhone users, though Android users will surely bemoan the need to carry around an additional Apple cable instead of being able to use their phone's USB Type-C charger.",
    "Apple's done a great job when it comes to comfort, with the Solo Pro's redesigned ear cups offering more density in their cushioning (35%, according to Apple) for a more comfortable fit. A tighter seal on your ear also provides a decent amount of passive noise isolation, while helping reduce sound leakage.",
    "The headband itself is still quite firm and can apply a fair bit of pressure on your head after an extended period of use. Those who wear glasses should definitely try these in store before committing – one glasses-wearing TechRadar staffer who tested these found their ears getting sore around the one-hour usage mark.",
    "That said, that firm fit is likely a byproduct the headphones' exceptional sturdiness and high build quality, which frankly leaves previous Solo models for dead. While earlier Solo headphones have had a tendency to fall apart, with peeling ear cups and broken headbands being a common complaint, the Beats Solo Pro feel tough and built to last – you can even twist and stretch the band a fair amount without worrying about to breaking.",
    "Beats headphones are often criticised for heavily skewing towards fans of bass-heavy music (like hip-hop and EDM) while leaving mids and highs sounding a little flat and muddled in the process.",
    "Apple's said its taken those criticisms to heart, and has deliberately re-engineered the Solo Pro's acoustics from the ground up to provide a more balanced audio profile.",
    "That famous punchy bass is still there, but it's now accompanied by exceptionally warm mids and clean highs, meaning that vocals sound more emotive and instrumentals offer more resonance.",
    "Not all of that comes from changes to drivers or EQ tuning either. Some of that improvement comes from the redesigned ear cups we mentioned earlier, with their greater density said to help significantly reduce total harmonic distortion (THD) across the frequency curve, making Beats Solo Pro more suited to all genres of music.",
    "Thanks to the inclusion of Apple's H1 chip, pairing Solo Pro to an iPhone, iPad or Mac computer is incredibly simple, allowing for seamless switching between devices.",
    "Admittedly, the process isn't quite as seamless for Android users, however, a new Beats app for Android devices does make things easier. The app lets you control your headphones' ANC and transparency settings from your phone, and is also where you go to update the firmware of your Beats products.",
    "While Jabra's Elite 85h headphones currently hold the battery life crown for wireless headphones with ANC (36 hours with ANC, 41 hours without), Beats' Solo Pro aren't far behind, offering an impressive 40 hours of listening time from a full charge with noise cancelling and transparency switched off. Turn both of those features on, however, and battery life drops by half to around 22 hours of listening time.",
    "According to Apple, you'll also get around three hours of playback from a 10 minute charge, which is quite handy for those who need to quickly top-up before heading off to work, school or back home again.",
    "In terms of noise cancelling performance, Beats Solo Pro handles itself remarkably well for a pair of on-ear headphones. While the cushioning on each cup is unlikely to cover your entire ear, it does achieve a fairly decent seal over your ear canals, significantly reducing the amount of outside noise that gets in while also ensuring that sound leakage is kept to a minimum.",
    "While impressive for on-ear cans, Beats Solo Pro's ANC performance doesn't quite reach the heights of Sony’s class-leading WH-1000XM3 headphones, as they're unable to completely drown out some of annoyingly loud voices that you'll regularly hear on public transport (or, if you're unlucky, the office). Also, we've found that the Solo Pro's noise cancelling was unable to successfully filter out the whistling noise that can occur on particularly windy days – something the Sonys dealt with much better.",
    "As with their forebears, when it comes to style and design the Beats Solo Pro remain unrivalled in the headphones space. We love the choice of available colors (some of which were handpicked by none other than music superstar Pharrell Williams) and the headphones' classy matte finish.",
    "Thankfully, style isn't the only thing worth raving about here either: Apple has also addressed user concerns regarding Beats' sound profile and build quality, and significantly improved and upgraded both aspects for the Solo Pro.",
    "Adding new features like Pure ANC on top of that easily makes this the most well-rounded and capable set of Beats on- or over-ear headphones in years – and ones that are, without doubt, an important turning point for the audio company."
  ],
  "headers": {
    "6": "Design",
    "17": "Sound quality and connectivity",
    "23": "Battery life and noise cancelling",
    "27": "Verdict"
  },
  "links": {
    "Beats Solo 3 Wireless": "https://www.techradar.com/reviews/beats-solo-3-wireless",
    "Beats Solo 2 Wireless": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/beats-by-dre-solo-2-wireless-1284158/review",
    "Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "Jabra's Elite 85h": "https://www.techradar.com/reviews/jabra-elite-85h",
    "WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review"
  }
}