{
  "source": "https://www.techradar.com/reviews/teclast-x4-2-in-1-laptop",
  "title": "Teclast X4 2-in-1 laptop review",
  "category": "computing",
  "updated": "2019-06-04T05:45:14Z",
  "author": "desire-athow",
  "summary": "Is it a capable rival to the Microsoft Surface Go?",
  "verdict": "The Teclast X4 is a great choice for remote workers that need a mobile, reasonably powerful and affordable, Windows 10 device to keep them working on the move. Its battery life could have been better but being able to charge from a portable battery mitigates the issue.",
  "pros": [
    "Great design",
    "Nice build",
    "Solid performance",
    "Good keyboard",
    "Can charge via Type-C",
    "Removable SSD"
  ],
  "cons": [
    "Doesn’t support active pen",
    "Touchpad is a tad small"
  ],
  "article": [
    "Microsoft’s Surface Go has provided manufacturers all over the world with a rough template of what the perfect rival to the Apple iPad would look like. The ideal Goldilocks tablet; not too slow, not too big, not too expensive.",
    "Teclast is one of them and has just released the X4, a Windows 10 tablet with an optional detachable keyboard cover, not to be confused with the Jumper EZBook X4, which is a traditional laptop launched last year.",
    "With a reasonable price tag and a set of specifications that, on paper, gives the Surface Go a run for its money, could this tablet be a viable alternative to Microsoft’s affordable tablet? Read on",
    "Online Chinese retailer, Gearbest, sells the Teclast X4 for $415 (with the magnetic keyboard) at the time of writing. Note that while this price includes delivery, it is exclusive of any taxes that may be levied by the relevant authorities or the courier companies on behalf of the vendor.",
    "This tablet adopts the same design as dozens of others with minor variations. There’s two reasons for that: firstly, using economies of scale means that most smaller vendors can keep prices low by using similar designs. Secondly, users usually like familiarity; it takes a big name like Lenovo or Microsoft to make a bold statement.",
    "The chassis of the X4 is made up of an aluminum alloy. The front is covered with a slab of glass and the Windows button is - surprisingly - located on the right edge, which means that you can bring up the Windows menu using your thumb. The bezels are fairly thick, which helps for holding the device.",
    "At 16mm, they are just about right. The tablet is an 11.6-inch model with a footprint slightly smaller than an A4 sheet (about 290 x 180 x 9mm). It weighs 850g without the keyboard cover and 1160 with.",
    "It has two microphones, the power button, the volume rocker and a microSD card slot are located on one edge and keyboard connector on the other. On the left and right sides are an earphone port, a full size USB port on the first and on the second, a power port, a HDMI port, USB Port and Type-C connector.",
    "Its kickstand extend to 135 degrees which should be sufficient for most use cases; the device comes with a 24W (12V,2A) white power supply unit which sadly can’t be use - unlike say Xiaomi’s - to power other devices (like your smartphone or powerbank).",
    "Two noteworthy points: the SSD is user-replaceable. You need to unscrew the back and swap the existing one out. There’s also a 5-megapixel rear camera which will be useful for quick snaps on a job site for example. Overall, the Teclast X4 feels solid and every inch as classy as the device it wants to compete with.",
    "The popular Intel Celeron N4100 is, once more, at the heart of a mobile device. As a reminder, it is a 4-core, 4-thread, Gemini-Lake processor with 4MB cache and a TDP of 6W. It has a base frequency of 1.1GHz and a max frequency of 2.4GHz. It uses the UHD Graphics 600 processor graphics and is overall about the same performance as a fourth generation Intel Core i3-4010U CPU from 2013.",
    "It has 8GB memory in dual-channel configuration, a Teclast-branded 128GB M.2 SSD (SATA-3), 802.11ac connectivity via an Intel Wi-Fi card, two cameras and that big 11.6-inch full HD IPS display.",
    "The X4 general performance is better than many N4100 tablets on the market due to use of a speedy SSD.",
    "The screen on the X4 is probably the standout feature. It is bright, oleophobic (no nasty greasy fingerprints here) and has excellent viewing angles with good colour fidelity.",
    "The keyboard cover - while optional - is probably essential to get the full experience. Magnetically connected to the tablet, it is solid and the rubber plastic finish (with a dark blue, faux brushed metal finish) is not as shoddy as some of the competitors.",
    "There is some flex, but not too much and touch typing is definitely possible thanks to some good feedback. As expected, there are no batteries or additional ports on it, which was expected. The only negative point is the small size of the touchpad; about half that of a normal one. Note that the X4 supports PD via the Type-C connector so you will be able to charge it via that connector.",
    "The Surface Go from Microsoft costs $679 with a far more powerful Pentium Gold 4415Y processor, a much better battery life and the peace of mind of buying from a household brand. It is smaller and lighter as well but just bear in mind that it runs Windows 10 S, not full fat Windows. For that, you will need to buy Surface Go for Business which also comes with 4G/LTE for seamless wireless connectivity.",
    "The Tablet 10 by Lenovo retails for $445.50 with a TPM chip and a ThinkPad active pen. While it has the same processor, It has only half the memory and half the onboard storage (eMMC rather than SSD). We like the fact that it has a number of accessories geared towards a business audience and the sort of after sales services that befits the ThinkPad range (next business day support, three-year onsite warranty etc).",
    "The HP Chromebook x2 ticks all the right boxes but runs on Chrome OS rather than Windows 10 Home. It runs on a Core M CPU with a big 12.3-inch 2K touch display. With 4GB of RAM and 32GB memory, it provides enough resources for Google’s operating system. With exceptional battery life (up to 12 hours), a keyboard and an active pen, the Chromebook x2 will suit those who want to move away from Windows 10.",
    "Another alternative is the Alldocube Knote 5 which retails for $316 with a keyboard cover, almost $100 cheaper, at Gearbest. It has a slightly slower CPU (N4000) and half the memory plus a slightly different stand, not an integrated adjustable stand. It has a single camera while the X4 has two. Altogether an interesting, cheaper option for those looking for some savings.",
    "Once you brush aside the usual caveats, you are left with an easy choice. Either spend $400 on a capable device or almost double that on a similar device from a more well-known laptop vendor. The Teclast X4 ticks all the boxes when it comes to performance and quality built; there’s no bloatware and the build quality is excellent. Opting for an SSD rather than eMMC storage is an astute move and while the battery life could have been better, the fact that it can be charged via the USB Type-C port alleviates that thorny problem. However, the biggest issue has to do with after sales and that remains - unfortunately - a sore point with no clear answer or solution."
  ],
  "headers": {
    "4": "Design",
    "10": "Hardware",
    "12": "Performance and use",
    "16": "Competition",
    "20": "Business take"
  },
  "links": {
    "Surface Go": "https://www.techradar.com/reviews/microsoft-surface-go",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Jumper EZBook X4": "https://www.techradar.com/reviews/jumper-ezbook-x4",
    "Teclast X4": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-5343022356818489000&p=https%3A%2F%2Fwww.gearbest.com%2Fandroid-tablets%2Fpp_009890367082.html%3Fwid%3D1433363",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "powerbank": "https://www.techradar.com/news/top-portable-chargers",
    "Tablet 10": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-1132103542302892500&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Ftablets%2Fwindows-tablets%2Fthinkpad-tablet-series%2FLenovo-Tablet-10%2Fp%2F22TD2LV1010",
    "HP Chromebook x2": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1149076705738749800&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2Fpdp%2Fhp-chromebook-x2-12-f015nr",
    "Chrome OS": "https://www.techradar.com/news/google-wants-android-phones-and-chromebooks-working-more-closely-together",
    "Alldocube Knote 5": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-6200862448490514000&p=https%3A%2F%2Fwww.gearbest.com%2Ftablet-pcs%2Fpp_009203756265.html%3Fwid%3D1433363"
  }
}