{
  "source": "https://www.techradar.com/reviews/anker-soundcore-wakey-bedside-speaker",
  "title": "Hands on: Anker Soundcore Wakey bedside speaker review",
  "category": "audio-visual",
  "updated": "2019-07-08T11:21:34Z",
  "author": "olivia-tambini",
  "summary": "Wakey, Wakey!",
  "verdict": "The Anker Soundcore Wakey packs a lot of features into its compact frame, providing pretty much everything you’d want from a bedside speaker. However, the sound quality isn’t great, and there are alternatives out there that offer more smart features for a lower price.",
  "pros": [
    "Sleek design",
    "Well-designed app",
    "Easy to use"
  ],
  "cons": [
    "Bass sounds underwhelming",
    "Cheaper options out there"
  ],
  "article": [
    "Alarm clocks; love them or hate them, they’re an essential part of daily life that most of us can’t live without.",
    "Nowadays, many of us just use our smartphones’ alarm clock function to rouse us in the morning – but the Anker Soundcore Wakey may just convince you to convert to a proper bedside speaker/alarm clock.",
    "By combining an alarm clock, wireless speaker, FM radio, white noise machine, and wireless charger into one all-encompassing device, Anker has provided all the elements you’d want from a multimedia speaker without adding the complication of ‘smart home’ features like voice assistance.",
    "We spent a little time getting to know the Wakey; read on for our initial thoughts ahead of our full review.",
    "The Soundcore Wakey is available to buy for $100 / £100. This works out at around AU$180, however it doesn’t seem to be available in Australia right now.",
    "There are a few rivals out there; the UK-only Pure Siesta Charge retails for £120 (about $150 / AU$215) and similarly combines an alarm clock radio, with a Bluetooth speaker, and wireless charger.",
    "There are also some connected options out there, like the Lenovo Smart Clock. For $79.99 / £79.99 (around AU$115) you get a screen, speaker, clock, and the ability to control your smart home via Google Assistant.",
    "All in all, the Soundcore Wakey looks really attractive, with a minimalistic white housing and a light gray grille, that’s reminiscent of speakers in the Google Home line – it’s fairly compact too, designed to sit comfortably on your bedside table.",
    "Beneath the grille is an LED display that tells you the time, automatically adjusting to the light levels in its surroundings – this is cool touch that means you won’t be blinded if you need to check the time in the middle of the night.",
    "Underneath the grille you’ll find buttons for turning on the FM radio, controlling the volume, playing/pausing your music, setting the alarm, and activating white noise mode.",
    "At the back, there are ports for the radio antenna which comes included, two USB ports for charging your non-wireless devices, and an AUX-in if you want to hook up your device directly to the Wakey so your tunes are uninterrupted by dodgy Bluetooth connections.",
    "The top of the Wakey features a built-in wireless charging pad, which allows you to place your Qi-compatible device on the speaker to recharge. According to Anker, it delivers a “fast 10W charge for Samsung phones and a 7.5W charge for iPhones” – we didn’t get to try this feature out in the short time we spent with the Soundcore Wakey, but we’ll be sure to test it thoroughly for our full review.",
    "We tested the Anker Soundcore Wakey by pairing it with our iPhone SE; connecting to the speaker via Bluetooth was quick and easy, and we didn’t experience any connection dropouts while we were testing it.",
    "To set up the speaker, you need to download the Soundcore app, where you can select the Wakey from a list of products.",
    "The app itself is really attractive, with a simple user interface and easy controls complemented by calming graphics – perfect for when you’re trying to get to sleep and need to quickly toggle between radio stations.",
    "There are three main sections within the app: Alarm Clock, where you can set alarms and choose between tones, FM Radio, and Superior Sleep.",
    "The FM Radio section of the app has a dial that you can drag with your finger to scroll through the different stations – we found this added a nice physicality to the app, but it did make it difficult to precisely locate stations. You may find yourself listening to a lot of white noise at first.",
    "You can preset FM stations within the app, which is useful, although it would be helpful if the app came with a few pre-loaded to get you started.",
    "The last section, Superior Sleep allows you to mix your own ambient soundtrack to help you drift off. It includes a selection of ambient sounds including rainfall, crashing waves, bird song, and even the rumble of a train.",
    "You can either listen to one sound in isolation, or create your own custom sleep soundtrack by turning the various noises up and down using the in-app sliders. We loved this feature, as it felt really personalized; after all, sleep preferences are a very personal matter.",
    "We were taken aback by how loud the Anker Soundcore Wakey can get; even playing our music at mid-volume, we found the bedside speaker to be surprisingly loud, thanks to the inclusion of two 5W drivers.",
    "Listening to Lizzo’s Juice, we found that the high and mid frequencies sounded better than the bass – generally the soundstage felt a little top-heavy. Jangly electric guitar sounded smooth, while the percussion had a punchy and dynamic quality that complemented Lizzo’s vivid vocal delivery.",
    "Similarly, when listening to The Zombies’ Time Of The Season, we found that the vocal harmonies sounded clear, but the bass runs were rather underwhelming, with a tinny quality.",
    "Of course, we’ll need to test the speaker further to make a true assessment of the sound quality on offer here, but early indications suggest that it suffers from lackluster bass frequencies.",
    "While we can’t give a definitive verdict on the Anker Soundcore Wakey until we carry out our full review, we’re impressed with the bedside speaker so far.",
    "For $100 / £100, you’re getting an alarm clock, speaker, radio, and wireless charger, rolled into one device. That feels like pretty good value for money, although it’s worth remembering that smart displays like the Lenovo Smart Clock can do almost all of this (it can't wirelessly charge devices) and more for less money.",
    "The Soundcore Wakey doesn’t boast any smart features – like the ability to control your smart home via a built-in voice assistant – which you may expect to be included for the price.",
    "However, if you don’t like the idea of bringing a voice assistant into your bedroom, this will be a huge positive; for our part, we think it’s a canny move on Anker’s part, because alternatives like the Google Home Mini or Amazon Echo Dot have that ‘always listening’ feel that puts some off.",
    "Design-wise it looks fantastic, as well as being functional – that goes for the Soundcore app, too. Sound quality leaves something to be desired; while the Wakey can reach admirably high volumes, it doesn’t provide the most balanced soundstage we’ve heard, with all the emphasis on the treble frequencies.",
    "Bassheads will likely want to look elsewhere, but for casual listening when you wake up, it could do the trick."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design",
    "12": "Features and performance",
    "20": "Sound quality",
    "24": "Early verdict"
  },
  "links": {
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Pure Siesta Charge": "https://www.techradar.com/reviews/pure-siesta-charge",
    "Lenovo Smart Clock": "https://www.techradar.com/reviews/lenovo-smart-clock-review",
    "Google Assistant": "https://www.techradar.com/news/9-things-google-assistant-can-do-that-you-may-not-know-about",
    "Google Home": "https://www.techradar.com/news/google-home-prices-deals",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "Google Home Mini": "https://www.techradar.com/reviews/google-home-mini",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review"
  }
}