{
  "source": "https://www.techradar.com/reviews/fiio-btr3-hi-fi-bluetooth-amp",
  "title": "Fiio BTR3 Hi-Fi Bluetooth Amp review",
  "category": "audio-visual",
  "updated": "2019-07-30T23:09:37Z",
  "author": "ted-kritsonis",
  "summary": "This Hi-Res Bluetooth dongle makes any pair of headphones wireless",
  "verdict": "The Fiio BTR3 is a fully-loaded Bluetooth dongle that covers a lot of bases in terms of codecs and audio products. We haven’t seen another amp that offers this wide a feature gamut... at least not yet.",
  "pros": [
    "Wide codec and DAC support",
    "Good audio quality",
    "Works with all wired headphones"
  ],
  "cons": [
    "Mids could sound better",
    "App needs improvement",
    "Firmware update process"
  ],
  "article": [
    "Bluetooth audio streaming is pretty standard these days but - the way most folks use it - it’s often a one-to-one connection. You pair something, like a phone or tablet, and playback audio to headphones, speakers or a sound system.",
    "The Fiio BTR3 follows this premise, but as a Bluetooth-enabled DAC/amp, it can make any wired pair of headphones act like a wireless pair of headphones thanks to its built-in Bluetooth support, while also amping up your audio. For devices in its class, it looks to be one to beat right now.",
    "Bluetooth dongles have been done before, but this one’s different. It’s built to be robust and adaptable, doing more behind the scenes to optimize audio quality.",
    "It’s a small rectangular piece, about three-quarters the height of a cigarette lighter, and comes with a clip in the back to hold it in place on clothing. The 3.5mm jack lets you plug almost anything into it that works with auxiliary cables. Fiio also wisely went with USB-C for the charging port.",
    "The power button not only turns it on or off, it can also toggle between connected devices. The volume buttons double as track skipping and repeat rockers (with a long press). They’re bizarrely reversed, whereby long pressing the minus button skips forward, and the plus button repeating a track. Subsequent firmware updates haven’t fixed that for some reason. The middle button plays/pauses, accepts calls (when the phone rings) and activates the resident voice assistant, like Siri or Google Assistant. You can talk through the dongle’s onboard mic.",
    "Technically speaking, the BTR3 is a DAC (digital-to-analog converter) and amplifier that are essentially integrated together in the dongle. The key, however, is that the device supports an array of Bluetooth wireless codecs. The list includes SBC, AAC, aptX, aptX HD, aptX Low Latency, LHDC and LDAC.",
    "The last one on that list is probably the one that will make audiophiles happiest as adding LDAC effectively allows the BTR3 to decode up to 24-bit/96KHz. The dongle’s new Qualcomm chipset is the other piece helping the cause, which Fiio claims delivers better signal strength, even in crowded situations.",
    "As for the unboxing experience, it’s pretty bare. Beyond the BTR3, there’s a short USB-C-to-USB-A cable, manual and a black lanyard. Our review dongle was missing the lanyard, so we couldn’t include that in our review.",
    "Fiio includes an NFC chip for quicker pairing with devices supporting the feature. Most Android phones could pair in seconds with a simple touch. For iOS devices, it’s less direct, but we managed fine by pairing through settings on an iPhone. (We also tried out the BTR3 with speakers and as a DAC connected to a computer by plugging the dongle into a Windows PC or Mac.)",
    "Once paired, we plugged in a pair of earbuds - we tested several different headphones - and were listening to music right away. The BTR3’s volume rockers are independent of the connected device, so raising or lowering volume isn’t uniform.",
    "There is some app integration, but it’s neither significant, nor all that streamlined. We found it by downloading the Fiio Music app and then going to Fiio BT Control in the settings. The process to confirm the Bluetooth connection was strange, and once we got through, not all features worked. For example, the equalizer was still “under development” at the time of this review.",
    "Not only that, but the app would mark it as disconnected when it very much wasn’t. We were listening to tunes just fine when the app would imply otherwise. We do wish that Fiio cleaned this up, and allowed firmware updates to run through the app, too. As is, you have to plug in to a PC and install the file that way.",
    "We liked that Fiio makes it obvious which codec is funneling through the BTR3. The company’s logo doubles as an LED indicator where the color corresponds with the codec. Blue is for SBC, cyan for AAC, purple for aptX, yellow for aptX HD, green for LHDC and white for LDAC or DAC.",
    "We found the codec lineup did impact how well audio sounded, so we can’t conclude the BTR3 has one distinct signature profile. For example, we weren’t wowed by the SBC quality, and had better success with AAC on an iPhone with over-ear headphones.",
    "Once we used an LG G8 and Huawei P30 Pro, noticing the white and green logos light up, respectively, they upped the streaming quality.",
    "On the P30 Pro, we toggled the option to optimize audio for the best quality stream — at the expense of a more rigid wireless connection. We utilized this setup more for listening to tunes in static situations, like working at a desk. Walking, running or working out led to too many dropouts and hiccups. When we toggled the option back to the default of balancing quality and connectivity, those disappeared.",
    "Android phones supporting LDAC and aptX HD have a distinct advantage here. We simply listened to better sounding music from handsets supporting those codecs. There was real range to everything, giving each song a livelier soundstage. It was also evident in the various different headphones we tried - the Sennheiser Momentum Wireless were great, as were the Creative Aurvana Trio, and to a lesser degree, Fiio’s own FA1, for a few examples.",
    "No matter the codec, there was one parallel we could identify. The BTR3 tends to skew toward the fringes, elevating highs and lows for resonant treble and thicker bass. Mids were less pronounced, lacking some warmth and depth, particularly in tracks with multiple instruments.",
    "We should note that we also experienced this from different sources. Spotify benefitted from the LDAC boost, though we heard better clarity and balance from Tidal. Google Play Music was fine, as were typical AAC downloaded tracks played through the Fiio Music app.",
    "FLAC and WAV files from a computer came through really crisp. We even watched a movie to gauge performance that way, and liked the results.",
    "Fiio rates battery life at 11 hours, but we never hit that number in our tests. Depending on volume levels and which codec was streaming, we were in the ballpark of nine hours most of the time. That’s not bad for a device its size, and with the DSP (digital signal processing) involved. Recharging took just over an hour, and with USB-C in tow for a phone, having one handy isn’t going to be uncommon.",
    "Bluetooth doesn’t always have a stellar reputation as a dependable wireless protocol among audio purists, but the BTR3 is an olive branch of sorts in that it strives to close the gap with wired setups in ways that earn respect. To our ears, the device largely delivers that, and the main reason is because we didn’t have to settle for one codec.",
    "Well, to be fair, you sometimes are stuck, like iOS users are, or Android users who can only utilize aptX. But when you aren’t, the BTR3 solves the problem on the other end. It doesn’t matter if your headphones don’t support LDAC coming from a phone or tablet — they will once plugged in to Fiio’s dongle.",
    "This kind of audio boost probably won’t seem like much for $70 (£55, AU$109), but we haven’t seen another on the market that offers this wide a feature gamut... at least not yet."
  ],
  "headers": {
    "2": "Design",
    "8": "Setup",
    "12": "Performance",
    "20": "Battery life",
    "21": "Verdict"
  },
  "links": {
    "LG G8": "https://www.techradar.com/reviews/lg-g8-review",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Sennheiser Momentum Wireless": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/sennheiser-momentum-wireless-1284754/review",
    "Creative Aurvana Trio": "https://www.techradar.com/reviews/creative-aurvana-trio-in-ear-headphones"
  }
}