{
  "source": "https://www.techradar.com/reviews/bose-frames-review",
  "title": "Bose Frames review",
  "category": "wearables",
  "updated": "2021-02-02T12:45:00Z",
  "author": "james-peckham",
  "summary": "Much more than just premium sunglasses",
  "verdict": "The Bose Frames are an interesting concept and well-designed, but a few missing features and frustrations mean they’re not a must-have item for everyone just yet. These aren’t going to replace your traditional headphones, but as an alternative to wear during the summer you may find the Bose Frames to be a great novelty.",
  "pros": [
    "Lightweight",
    "Slick design",
    "Novelty factor"
  ],
  "cons": [
    "No charging case",
    "Doesn’t use bone conduction",
    "Mediocre battery life"
  ],
  "article": [
    "Ever wanted to leave your headphones at home on a hot summer day? That’s the idea behind Bose Frames, a gadget that combines your sunglasses with headphones by building in speakers that are pointed towards your ears.",
    "This means you’re able to keep your ears and head free of anything but your pair of sunglasses, while still being able to listen to music, podcasts or audiobooks.",
    "Bose has included this headphone functionality inside the body of a fairly stylish pair of sunglasses, and the likelihood is that the average person wouldn’t even realize these are smart audiowear at all.",
    "And while we are calling them smart glasses, they’re not like Google Glass or even Snapchat Spectacles, as beyond speakers all they have is some basic augmented reality functionality. But, for many users, that will be plenty.",
    "You can buy the Bose Frames around the world now for $199.95 / £199.95 / AU$299.95 / AED 849. There are two different styles available, but both are the same price in each market.",
    "The Bose Frames were unveiled in early 2019, and we don’t currently expect to see any new designs or generations of the sunglasses any time soon.",
    "The Bose Frames look similar to many ordinary pairs of plastic-framed sunglasses fitted with polarized lenses.",
    "There are currently two styles available – the square-framed Alto is similar to Ray-Ban’s Wayfarer sunglasses, while the Rondo is rounder, smaller and looks a bit more retro. Whichever model you choose, the frames only come in black.",
    "The arm design may not be to everyone’s liking, as these are quite bulky on both designs. It's a necessary compromise as that’s where all the tech is housed, including the batteries, motion sensors, microphone, speakers and Bluetooth circuitry.",
    "That said, it’s not what you’d always want from a pair of more expensive sunglasses. That’s especially the case as the matte black material Bose has used doesn't feel like it's made with high-quality plastic.",
    "This could also be why the Frames are so incredibly light though, with both styles weighing around 45g.",
    "Even the lenses feel a little cheap and plasticky, although in use they’re clear, uniformly tinted and, Bose claims, block 99% of UV rays. We found them to be comfortable to wear in direct sunlight, and they seemed to do the basic job of shielding our eyes from rays.",
    "The lenses are also interchangeable and can easily be popped out for a different color, although choices are currently limited to a mirrored silver for the Alto and a rose gold set for the Rondo.",
    "It’s worth noting how much bigger the Alto glasses are than the Rondo. Some people we handed them to with smaller heads found they wouldn’t sit on their face, so the size difference is something to consider here if you buy some.",
    "The Bose Rondo’s arms are 154mm long while the front of the glasses comes in at 142mm. The Alto are quite a bit bigger at 162mm arm length and 148mm across the front.",
    "They’re both IPX2 water-resistance rated which, for a product meant for outdoor use, is lower than we’d like. They’ll be able to take a few drops of rain, but you’ll likely need to keep them out of a downpour. Then again, wearing sunglasses in the rain is a whole new world of looking like a fool.",
    "A tiny gold button – to match the gold-plated steel hinges – is tucked under the right arm, and is the only control on the Frames. Physically, this sits beside your right temple and that, unfortunately, makes it very easy to click accidentally when adjusting the Frames on your face.",
    "That gold button's main use when the glasses are on is to pause or play audio, and it allows you to pick up incoming phone calls too, which you can take thanks to the integrated microphone. It doesn't allow you to change the volume though. To do that you'll have to use your phone.",
    "Another thing you’ll need to get used to is not flipping the Frames upside down while they’re still connected to your phone. Doing so will disconnect Bluetooth and you’ll need to re-pair by pressing that little gold button.",
    "We found ourselves regularly doing this as we took the glasses off and wore them on our shirt, but once you’ve learnt that you may have to press the gold button to reconnect you won't find that to be an issue.",
    "Along with the glasses you get a carry case, which doesn’t feel particularly high-end considering how much the glasses cost. It also doesn’t charge up the product in a similar way to how wireless earbuds like Apple AirPods or Samsung Galaxy Buds work.",
    "That would have been a handy addition, but instead the glasses are charged via a proprietary cable that connects to a part inside the right arm of the product.",
    "The Bose Frames’ headline feature is that they're also a pair of wireless headphones, and for speakers that don’t actually sit in or on your ears, these sunglasses are rather impressive. Sound quality is surprisingly good, albeit not as full or bassy as you’ll get from a dedicated pair of cans.",
    "Bose had to design tiny speakers to fit into the arms of the Frames from scratch, along with some proprietary tech that, Bose promises, directs 99% of the sound to the wearer’s ears, with only 1% leaked. Though if you’re listening at full volume, you’ll find the leakage seems much worse than that.",
    "Background noise might also be a concern for some, though in quiet scenarios this isn’t an issue at all. If you’re sat on a beach or in a park, the Bose Frames will be a good enough way to listen to your music or any other type of audio.",
    "But when you’re in a busy city, you’ll find traffic and other background noise is an issue. We tried the glasses on various walks through London and we found it almost impossible to hear voices on a podcast when walking along roads.",
    "It comes back to Bose’s decision not to include bone conduction audio tech here. If the company had opted for that technology, we think it could have offered a better overall sound experience.",
    "It’s unlikely you’ll be listening to these in too many loud locations, but when your ears are free to hear roadworks, vehicles, and even other people’s voices, it can make listening to any sort of audio too difficult to work with.",
    "Once you ditch the idea that ‘augmented reality’ must equate to ‘augmented vision’ you start to understand the Frames’ potential – and it really is the AR features that make the Frames an impressive piece of hardware.",
    "All of the augmented reality features on this pair of glasses are communicated via audio. The glasses themselves have trackers inside and use the GPS on your smartphone to work out your location.",
    "There are currently only six AR apps to choose from, and most of these focus on navigation and entertainment.",
    "We've tried two different apps with the glasses, and these are currently only available when connected to iOS devices. We've been told by Bose that support for Android devices is coming in July 2019, but there's no specific date yet.",
    "One of the apps is a golfing one. It points you to the green and tells you the distance to the tee or which club to use. We found that so impressive it almost felt like we were cheating.",
    "While neat however, even this doesn’t really show the true joy of using the device. A very robotic voice telling you it’s “220 meters to the green” is handy, but not especially fun.",
    "We were recommended another app called Komrad AR, which is a game that lets you chat with a 'Soviet AI' from 1985, and we’re hoping to test that out further for future updates to this review.",
    "But between the two of them, the Bose Frames really demonstrate that augmented reality can go beyond vision, and we hope to see more apps take advantage of this. It should be easy to find compatible AR apps when more are added, as the Bose Connect app highlights them almost instantly.",
    "Don’t expect incredible battery life from the Bose Frames, and this is one of the reasons that it’s such a shame the company hasn’t seen fit to include a charging case.",
    "The sunglasses can last for three and a half hours according to Bose, and we found that to be accurate in our testing. Often we found them to last a little longer, but around four hours is the maximum we were able to get over our testing period.",
    "It’s unlikely you’ll ever be listening to music for four hours straight with these, but it’s conceivable that you would listen that much over a full day, and you then don’t have an easy way to charge them back up without the specialist cable.",
    "There’s also no great way of monitoring the battery life on the glasses. When you turn them on and off, you’ll be greeted with the battery amount in audio form, but it doesn’t offer a way to monitor how much charge is left over visually from the glasses themselves.",
    "All in all, the battery life on the Bose Frames is okay if you’re set to listen for short stints of time, but if you’re planning to use these over a period of a whole day you may need to take your cable out with you to ensure they’re charged up.",
    "The Bose Frames aren’t smart glasses as such. Instead they are a pair of audio sunglasses that also have some limited smart functionality tacked on.",
    "If you care about audio quality, these aren’t going to replace your headphones. Rather, these are a fun alternative you can use when it’s sunny and you’re laying on a beach or walking in a quiet area.",
    "They don’t suit city use, and they’re not all that suitable for public transport either, but if you’re looking for a fun device that’s different to anything else out there then these may be exactly what you're after.",
    "Just know the Bose Frames are unlikely to replace even average headphones anytime soon, as they simply aren't versatile enough.",
    "First reviewed: June 2019"
  ],
  "headers": {
    "4": "Bose Frames release date and price",
    "6": "Design",
    "22": "Audio quality",
    "28": "AR Features",
    "36": "Battery life",
    "41": "Verdict"
  },
  "links": {
    "Google Glass": "https://www.techradar.com/reviews/gadgets/google-glass-1152283/review",
    "Snapchat Spectacles": "https://www.techradar.com/reviews/snapchat-spectacles-2",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds"
  }
}