{
  "source": "https://www.techradar.com/reviews/honor-band-4-review",
  "title": "Honor Band 4 review",
  "category": "wearables",
  "updated": "2019-02-06T11:35:34Z",
  "author": "andrew-williams",
  "summary": "Want a Fitbit, but cheaper?",
  "verdict": "The Honor Band 4 is a good value fitness tracker with all the right features, but disappointing handling of notifications.",
  "pros": [
    "Good glass-topped OLED screen",
    "Fairly low price",
    "Solid tracking for casual runners"
  ],
  "cons": [
    "No GPS, connected or otherwise",
    "Bad notifications handling",
    "Patchy, if advanced, sleep tracking"
  ],
  "article": [
    "Honor fitness bands tend to pass unnoticed by many people, just like some Honor phones. However, the brand’s bands are a great way to get more features for less money than you’d pay for, say, a Fitbit.",
    "The Honor Band 4 is the most advanced fitness tracker from Honor yet. Highlights include a bright and cheery color OLED screen, good battery life and a lithe design.",
    "Don’t expect too much from its more advanced parts, though. It can receive all sorts of notifications from your phone, which is great. But handling of WhatsApp messages and the like is clunky. And while sleep tracking purports to be advanced, it often misses those middle-of-the-night wake ups. Then again, so do many trackers.",
    "There’s also a missing feature that limits its usefulness as a runner’s trainer. We don’t expect GPS at this price and size, but there’s no connected GPS mode either, which uses your phone’s location tracking to map your runs.",
    "At $59.99 (£59.99, around AU$85), though, the Honor Band 4 is good value for those after a low maintenance wearable that can do more than a basic tracker.",
    "The Honor Band 4 is a slim and light fitness band. A full display means it’s not quite as petite as the Fitbit Flex 2, but we think it looks more sophisticated than its fiercest budget fitness tracker rival, the Xiaomi Mi Band 3.",
    "There are no bulbous parts that trip over their own attempts at a cutesy look. Its lines are sharp and curved in the right places, and the band’s thickness is roughly the same as the Fitbit Charge 3’s, at 11.5mm.",
    "Interaction is not as basic as it may at first appear either. The little white circle below the screen is a touch panel, but the screen is touch sensitive too. You can tap items in menus directly, and the circle acts as a back button.",
    "The Honor Band 4’s comfort is not perfect but, again, is better than it initially seems. Honor has used a fairly tough, only slightly flexible kind of silicone rubber here. It feels tough, but a softer, more stretchy material would let you achieve a tighter fit without a tight feel. Such a fit is important in a tracker like this that has a heart rate monitor.",
    "This is a minor quibble this time, though. We have at times completely forgotten whether we were wearing the Honor Band 4, having had to pull up a sleeve to check whether it was there or not. If that’s not a gold standard of wearable comfort, what is?",
    "The Honor Band 4 comes in all-black, and with either a light pink or dark blue strap. In all cases, the main unit is black. Get tired of one color? The rubbery strap can be removed and replaced. Such replacements are available online, although you might have to shop around to find them.",
    "Water resistance is great for the price, at 5ATM. However, Honor advises against one of the most important uses for 'full' water resistance. It says you shouldn’t wear the Band 4 in a 'hot' shower. Sure, Wim Hof banging on about how he loves a dip in ice cold water is impressive, but we only have cold showers when the boiler is broken.",
    "A color screen is the primary upgrade over the Honor Band 3. The Honor Band 3 had a 0.91-inch 128 x 32 monochrome OLED. This tracker has a 0.95-inch screen with a far sharper resolution of 240 x 120 pixels.",
    "The default watch face doesn’t show off this color and boosted pixel density all that well. But switch to the face that uses some 3D shaded graphics and you realize this is a great little display for an affordable tracker. There are only three faces, but each has a distinct personality.",
    "This screen is covered by a pane of toughened glass, with '2.5D' curved edges.",
    "The Honor Band 4’s screen is not 'always on'. Some OLED wearables use these panels’ emissive pixels to display a minimalist clock display 24/7. Here you twist your wrist to your face, or tap the screen, to bring up the display. It works pretty well, as the screen lights up in under half a second when you do so.",
    "Brightness is the real win here, though. The Honor Band 4 is clear in bright sunlight at its higher brightness settings. Outdoors visibility is often a weak point of cheaper bands."
  ],
  "headers": {
    "5": "Design",
    "12": "Screen",
    "17": "Need an alternative?"
  },
  "links": {
    "Fitbit Flex 2": "https://www.techradar.com/reviews/fitbit-flex-2-review",
    "Xiaomi Mi Band 3": "https://www.techradar.com/reviews/xiaomi-mi-band-3-review",
    "Fitbit Charge 3": "https://www.techradar.com/reviews/fitbit-charge-3",
    "Honor Band 3": "https://www.techradar.com/reviews/honor-band-3-review"
  }
}