{
  "source": "https://www.techradar.com/reviews/rha-s500u-in-ear-headphones",
  "title": "RHA S500u In-Ear Headphones review",
  "category": "audio-visual",
  "updated": "2019-04-11T09:44:52Z",
  "author": "lewis-leong",
  "summary": "A David vs Goliath story in audio",
  "verdict": "The RHA S500u are an incredible value, offering stunning sound and build quality for the price. These headphones easily stand toe-to-toe against competitors costing twice as much. They may not be the last word in resolution, dynamic range or soundstaging, but it’s incredible that RHA made headphones that sound this good for so little money.",
  "pros": [
    "Excellent build quality",
    "Balanced, rich audio",
    "Tons of tips included"
  ],
  "cons": [
    "Sibilant at times",
    "Narrow soundstage",
    "Cable noise"
  ],
  "article": [
    "While wired headphones may seem like relics of an older time with wireless headphones and true wireless earbuds taking over, there are still plenty of reasons to go with a wired pair of headphones over wireless: Wired headphones simply work without fussy pairing sequences and don’t have to be charged in order to be used.",
    "Perhaps the biggest reason to go for a pair of wired headphones, however, is for price. The cheapest wireless headphones you want to buy will be around $50 like the excellent Optoma NuForce BE2. Any cheaper than that and you’ll be left wanting in the sound quality department. Wired headphones are just better value and there may be no better value than the RHA S500u.",
    "For $40 (£30, AU$52), you get a pair of in-ear headphones that sound great, are built like a tank and easily stand up against headphones costing twice as much.",
    "The RHA S500u features aluminum construction for its driver housings and straight 3.5mm jack. This is an unexpected perk in such a cheap headphone and RHA is proud of its use of aluminum, going as far as to write the word “aluminum” on its headphone jack.",
    "The headphone cable is a nice braided nylon which will help durability but also creates a ton of cable noise. Thankfully RHA includes a shirt clip to fight cable noise and listeners can wear the headphones over the ear since the Y-cable is long enough. Speaking of the Y-cable, it’s not shielded with nylon like the rest of the cable, which may be a weak point over time.",
    "The RHA S500u features a mic and single button remote that works with both iOS and Android devices. It’s disappointing that RHA couldn’t include volume and playback buttons that work between both platforms like 1MORE did with its Triple and Quad Driver headphones. It’s not a deal breaker by any means, but it can be annoying having to reach in your pocket to change volume.",
    "Included in the package are a carrying pouch and 7 pairs of eartips for you to choose from, including a pair of double flange tips for better isolation. Even without the double flange tips, the RHA S500u seal very nicely since its small drivers can be pushed deep into the ear canal.",
    "This makes the S500u extremely comfortable to wear and you can even sleep with them on since the driver housings are so small.",
    "The RHA S500u have no business sounding so good at this price. We were immediately impressed by the neutral presentation and although they’re not the last word in resolution, the RHA does a good job of reproducing a pleasing timbre for voices and strings.",
    "Bass features good extension and excellent impact, but still remains balanced. There’s a slight mid-bass emphasis that makes the S500u sound great with popular music and thankfully this emphasis doesn’t bleed into the mids.",
    "Speaking of mids, the RHA S500u features balanced mids that aren’t hidden by the bass or highs. Female vocals are well represented and cello has a satisfying timbre. Highs are sparkly and can be sibilant at times so treble-sensitive listeners will want to look elsewhere like the 1MORE Triple Drivers.",
    "If we had to nitpick the RHA S500u in terms of sound, we found them slightly too narrow in soundstage, which means you won’t get a good sense of where instruments are coming from or the acoustics of specific rooms.",
    "The headphones are also a bit in-your-face with a forward, although exciting presentation. The 1MORE Triple Drivers (which cost twice as much) are more laidback and forgiving.",
    "If you have a tendency to lose or break headphones but still value sound quality, it’s hard to think of a better value than the RHA S500u. These headphones have no business sounding so good for the price.",
    "Sound quality is balanced with a slight mid-bass bump. Bass is slightly emphasized but not egregiously and features good impact while maintaining good control. Highs may be a bit sibilant at times, which makes the highs exciting but also fatiguing to treble sensitive listeners.",
    "Compared to the 1MORE Triple Driver headphones which cost twice as much, the RHA S500u surprisingly hangs in there in terms of sound and build quality. Both sets of earbuds feature metal construction and nylon braided cables. In terms of sound, the 1MORE feature a laid back presentation that is more forgiving in regards to highs.",
    "However, we found the 1MORE’s highs to be a little too rolled off for our liking, though many listeners will enjoy the Triple Driver’s thicker bass and wider soundstage. For us to even compare the RHA S500u to the Best-In-Class 1MORE Triple Drivers is a testament to how good these headphones are."
  ],
  "headers": {
    "3": "Design",
    "8": "Performance",
    "13": "Final verdict"
  },
  "links": {
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Optoma NuForce BE2": "https://www.techradar.com/reviews/optoma-nuforce-be2-wireless-earbuds",
    "Triple": "https://www.techradar.com/reviews/1more-triple-driver-in-ear-headphone",
    "Quad Driver": "https://www.techradar.com/reviews/1more-quad-driver-in-ear-headphones",
    "1MORE Triple Drivers": "https://www.techradar.com/reviews/1more-triple-driver-in-ear-headphone",
    "1MORE Triple Driver": "https://www.techradar.com/reviews/1more-triple-driver-in-ear-headphone"
  }
}