{
  "source": "https://www.techradar.com/reviews/asus-rog-phone-review",
  "title": "Asus ROG Phone review",
  "category": "phones",
  "updated": "2019-01-07T01:52:02Z",
  "author": "basil-kronfli",
  "summary": "Overkill, fresh and a lot of fun",
  "verdict": "It may look like an irate Decepticon, but thanks to a really good camera, a great screen and excellent gaming performance, not to mention a suite of overkill accessories, the ROG Phone manages to get right much of what the Razer Phone 2 got wrong, making it a great smartphone and an excellent gaming phone.",
  "pros": [
    "Great gaming enhancements",
    "Punchy 90Hz AMOLED screen",
    "Really good camera"
  ],
  "cons": [
    "Heavy at 200g",
    "Awkward second USB port cover",
    "Runs Android 8.1"
  ],
  "article": [
    "Gaming phones like the Razer Phone 2 and ROG Phone can be hard to review – do you judge them based on their gaming chops or as day-in, day-out smartphones?",
    "Our reviews definitely fall in the latter camp, and while that didn’t work out too well for the Razer Phone 2, which scored a respectable but not excellent 3.5 out of 5, Asus’ ROG Phone phone is just… better.",
    "For starters, it has more storage – 128GB in the cheapest variant, which is double that of the Razer Phone 2’s (and the iPhone XS series’) starting capacity. It also doesn’t forgo the 3.5mm headphone jack in favor of USB-C wired audio, and it features AMOLED display technology, not LCD.",
    "That said, its specs across the board don’t trounce the competition – the screen refresh rate is 90Hz, as opposed to 120Hz on the Razer Phone series, while the ROG Phone doesn’t have wireless charging, and it doesn’t even feature the latest version of Android.",
    "What it does bring to the party, however, may be more important than any of those: killer gaming features. Touch-sensitive AirTriggers that act as left and right gamepad buttons, on-screen hardware stats, in-game recording and streaming, recordable macros, an arsenal of accessories – this phone is most definitely for the players. But what about the rest of us?",
    "The ROG Phone price is set at $899 (£799, around AU$1,410), which is $100 less than the Razer Phone 2 in the US, but just £20 less in the UK. This definitely makes it much more appealing to a British buyer than the Razer Phone 2. The ROG Phone is also available in the US in a 512GB variant, priced at $1,099 (£860, AU$1,505).",
    "As for the release date, it’s already out in the US, Taiwan, and UK with Australian availability as of yet, unconfirmed.",
    "The ROG Phone features a 6-inch FHD+ AMOLED display with HDR screen tech loaded up and a 90Hz refresh rate. Its design is termed “futuristic” on Asus’ website – and indeed, it looks like a seething, illuminating Decepticon.",
    "Sadly, however, despite our best efforts at shouting “ROG Phone, TRANSFORM” at the handset it did nothing.",
    "This futuristic look begins with the light-up ROG logo on the phone’s rear, extends across to the patterning etched under the glass, and continues right through to its off-center, asymmetrical hexagonal fingerprint scanner and camera surround.",
    "You’d think these would make no sense from an ergonomic point of view, but strangely enough they work – and with the added bonus of looking kind of like they belong in a spaceship, albeit an action-movie spaceship rather than a real one.",
    "The ROG Phone’s black, heavily bevelled metal frame is solid and cold to the touch, while the front-firing stereo speaker grilles are dayglow orange in stark contrast. The buttons are on the right edge – a power button and a volume rocker – while the left edge houses one of the two USB-C ports, underneath a very awkward rubber stopper. On the bottom edge are the primary USB-C port and a headphone jack – audiophiles rejoice.",
    "There’s plenty of power under the hood, with the same Snapdragon 845 that you’ll find in the Samsung Galaxy Note 9 and Google Pixel 3 XL; in the ROG Phone, though, just as in the Razer Phone 2, it’s paired with 8GB RAM for even more oomph. The 128GB storage is also respectable, despite there being no expandable storage option, and if that isn’t enough a 512GB version is available in the US and some other markets.",
    "The healthy 4,000mAh of battery keeping the ROG Phone going matches that in the Mate 20 and Huawei P20 Pro, falling just behind the current battery king, Huawei’s Mate 20 Pro with its 4,200mAh of power."
  ],
  "headers": {
    "5": "Price and availability",
    "7": "Key features"
  },
  "links": {
    "Razer Phone 2": "https://www.techradar.com/reviews/razer-phone-2",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Google Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "Mate 20": "https://www.techradar.com/reviews/huawei-mate-20",
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review"
  }
}