{
  "source": "https://www.techradar.com/reviews/samsung-notebook-odyssey-z",
  "title": "Samsung Notebook Odyssey Z review",
  "category": "computing",
  "updated": "2019-06-17T21:20:09Z",
  "author": "mark-knapp",
  "summary": "Smooth gaming, ‘meh’ looks",
  "verdict": "The Samsung Notebook Odyssey Z could benefit from a stepped up GPU, even in its 10 Series class, but it’s otherwise a compelling machine – even if it verges on utilitarian in many ways.",
  "pros": [
    "120Hz G-Sync display",
    "Zippy performance",
    "Easy to use"
  ],
  "cons": [
    "Heavy",
    "Mostly bland design",
    "GPU could be better even in-class"
  ],
  "article": [
    "Samsung has continued its ‘Odyssey’ into true gaming laptops with the updated Notebook Odyssey Z. This laptop isn’t the most powerful Samsung gaming laptop, as that title goes to the model it showed off at CES 2019, but it offers a balanced package with a more portable 15.6-inch display, an 8th-Generation Intel Core i7 processor (CPU), and Nvidia GeForce GTX 1060 graphics.",
    "The Notebook Odyssey Z comes in one configuration that costs $1,799 (about £1,395, AU$2,590) retail, but we have seen it for substantially less, likely as a result of 9th-Gen Intel processors and Nvidia 20-Series graphics processors (GPUs) appearing in laptops with sleeker designs.",
    "The retail price puts it in a tough spot, as the new Razer Blade 15 comes in at just $1,999 (about £1,530, AU$2,820) with beefed-up specs and a more modern design. The $1,799 (about £1,289, AU$2,349) MSI GS65 Stealth runs right against the Odyssey Z with options for upgraded GPUs.",
    "For a gaming laptop, the Samsung Notebook Odyssey Z isn’t screaming its status, but it also doesn’t sneak by as an understated machine.",
    "The brushed aluminum cover is shiny, and the Odyssey logo on that back cover is even shinier.",
    "The unusual keyboard-forward design is also eye-catching enough to make people ask questions about the laptop’s nature.",
    "The back cover may earn the Notebook Odyssey Z some style points, but that’s just about where they end. The rest of the laptop is made with an unassuming gray plastic that does a decent job posing as metal.",
    "Despite its lack of style points, the Notebook Odyssey Z gets plenty of utility points. The I/O is substantial, with multiple USB ports on each side (including USB-C with support for 4K video output), HDMI, Gigabit Ethernet and a 3.5mm headset jack on the only side of a laptop these should show up — the left side.",
    "The keyboard forward design may seem a little awkward at first, but it has some serious positives. For one, it opens up more channels for airflow, with air coming in through the top and bottom of the Notebook Odyssey and expelled through the back and right side. This also distances the laptop’s heat dissipation from the keyboard, meaning fewer concerns about sweaty palms when the computer is working hard.",
    "The trackpad takes some getting used to because of its vertical orientation and positioning to the side of the keyboard. The benefit may outweigh the detractors though, as it makes the keyboard incredibly accessible, with no need to reach far forward over a desk and the front of the laptop to reach the keys. And, using the trackpad, it actually feels better on our shoulders, as our arm isn’t turned in all the time when browsing.",
    "The keyboard is well designed for functionality, with a decent contour to the keycaps that helps keep our fingers centered, but the choice of color and backlighting is a fail. In bright settings, the contrast between the keycap and the legend is minimal, making it hard to see which key is which. And, the keyboard backlighting isn’t bright enough to really help, not that we’d want to need a keyboard backlight in a bright setting anyway.",
    "The keyboard backlighting is passable at least. It lights up the full legend of the keycaps, but it doesn’t do a spectacularly even job of it, leaving the legends somewhat ugly. The four special keys above the trackpad also aren’t lit up. In an effort to emphasize gaming, the WASD keys have a backlit ring around each, but they don’t do much since the backlighting bleeds around the edges of all the keys anyway.",
    "The gaps around the trackpad and keys seem a bit wide, so we’d advise keeping food away from the Notebook Odyssey Z.",
    "The screen is a strong point for the Notebook Odyssey Z, even if its surrounded by thick bezels. It has a Full HD IPS panel with an anti-glare finish. The screen even has a 120Hz refresh rate, which Samsung fails to even mention on its product page. It also supports Nvidia’s G-Sync variable refresh technology.",
    "It may not offer HDR, but the black levels feel deep, especially with the anti-glare finish keeping reflections from spoiling them. We find video content excellent on the display.",
    "In direct sunlight, at max brightness, we can see content on the screen easily. We have to squint because of the sun hitting our face, but if we wear a hat, the screen is perfectly usable in the sun. This applies more to high-contrast content like text on a white background though, as darker sections of the screen suffer more from reflections, though even those are diminished, thanks to the anti-glare finish of the display. And, since the main chassis is plastic, it’s not going to heat up as crazily in the sun as a metal chassis would.",
    "Perhaps the only major downside to the design is how chunky it is. As it hasn’t adopted thin bezels, the 15.6-inch display is housed in a laptop the size you might be used to – no 14-inch form factor here. It’s shockingly heavy, too, at 5.29 pounds, and that’s in spite of it exclusively using PCIe solid-state storage with no hard drive to add serious weight.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "1": "Price and availability",
    "3": "Design"
  },
  "links": {
    "most powerful Samsung gaming laptop": "https://www.techradar.com/news/samsung-notebook-odyssey-is-the-companys-most-powerful-gaming-laptop-yet",
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "new Razer Blade 15": "https://www.techradar.com/news/razer-launches-new-blade-pro-17-alongside-impressive-blade-15-refresh",
    "MSI GS65 Stealth": "https://www.techradar.com/reviews/msi-gs65-stealth",
    "Nvidia’s G-Sync": "https://www.techradar.com/news/computing-components/graphics-cards/nvidia-g-sync-vs-amd-freesync-1289637"
  }
}