{
  "source": "https://www.techradar.com/reviews/polar-vantage-m-review",
  "title": "Polar Vantage M review",
  "category": "wearables",
  "updated": "2019-02-08T15:32:58Z",
  "author": "kieran-alger",
  "summary": "A very clever all-in-one mid-range multi-sports watch",
  "verdict": "It’s more expensive than the older M430, but the Vantage M is a powerful multi-sports training tool that packs in plenty of additional features that make it worth the investment. With a much-finessed design, more accurate wrist-based heart rate and bucket loads of training insights, there’s plenty here to recommend the extra spend.",
  "pros": [
    "Lightweight",
    "More stylish design",
    "Big battery life"
  ],
  "cons": [
    "No music",
    "Running power needs additional sensor",
    "Can be slow to sync"
  ],
  "article": [
    "The Vantage M slots into Polar’s sports watch lineup somewhere between the very popular, but now aging Polar M430 and the brand-new range-topping Polar Vantage V.",
    "The M was launched at the same time as the V and shares plenty of similarities with its pricier stablemate. There’s a fresh design, improved heart rate tracking and training load monitoring, better battery life, and even running power, though you need an accessory to get that data.",
    "If the Vantage V is the tool for elites and those with big performance ambitions, the Vantage M is more about bringing solid training data to the everyday sports enthusiast. And by that we mean the kind of people who chase PBs at parkrun rather than round Olympic tracks.",
    "The Polar M400 and M430 were hugely popular devices, so the Vantage M has some strong heritage but also a lot to live up to. So, is this a big step forward? We spent a few months giving the Vantage M a thorough testing to find out if Polar just set a new benchmark for mid-range multi-sports watches.",
    "The Polar Vantage M is priced at $279.95 / £249 / AU$399. That’s a chunk more expensive than the Polar M430, which you can pick up for $199.95 / £174.50 / AU$299, but not quite up there with the Garmin Forerunner 645, which will cost you somewhere in the region of $400 / £350 / AU$550 without music.",
    "We said it in our Polar Vantage V review and it’s true of the Vantage M too, the sports watch specialist has really upped its game in the style stakes.",
    "The Polar Vantage M moves away from the blocky, rectangular watch face to a more traditional round design that’s not unlike those you find in the Garmin Forerunner range. It’s much more refined, subtle and sophisticated than previous Polar watches.",
    "The plastic body of the watch undoubtedly makes the M look a bit cheaper than the metallic Vantage V but it’s still a good-looking timepiece, for a sports watch.",
    "The centerpiece is an always-on, 240 x 240 resolution color Gorilla Glass display – the same that you’ll find on the Vantage V. The screen is surrounded by a stainless-steel bezel that’s black on the black watch and silver on the white and red alternative colors in the range.",
    "The screen itself doesn’t quite fill the full width of the display, though it’s big enough to allow stats to be presented in a clear and legible size. It’s even big enough to accommodate some simple color bar charts in the post-workout heart rate and pacing zone review screens.",
    "In terms of sharpness and brightness, you won’t get Apple Watch 4 levels of crispness and in some light we found it a bit tricky to read. The brightness of the screen light needs to be punched up a touch.",
    "You can do this manually by tilting your wrist to fire up a screen light that makes it much easier to read, but this didn’t always work for us. Sadly there’s nowhere in the settings to make the backlight stay on, which would be useful for some situations.",
    "Unlike the Vantage V, the Vantage M doesn’t pack a touchscreen. There are limited swipe and tap functions on the Vantage V anyway so it’s not a big miss. Instead the watch is controlled with five round, relatively small, side buttons.",
    "While these have what Polar calls an ‘anti-slip’ surface that’s designed to make them easier to use on the move, they’re not as easy to operate as the slightly larger, ridge-cut metallic buttons on the V.",
    "That said, we found the watch perfectly easy to control on the move but we weren’t 100% sure this was down to the anti-slip.",
    "One advantage of the Vantage M’s plastic body is how light it feels. At 46mm wide it’s the same width as the Vantage V but comes in slightly thinner at 12.5mm. It weighs in at 45g, 21g lighter than the V and 6g lighter than its predecessor, the Polar M430. And that’s a noticeable difference.",
    "Why does this matter? While we were fans of the M430’s workout skills it wasn’t a watch you really wanted to wear all day and certainly not in bed. In order to make the most of Polar’s improving activity and sleep tracking features that needed to be solved. And it has been.",
    "The watch comes in two sizes - small/medium and medium/large, with well-spaced strap perforations that should make it easy to fit most wrists. The strap is significantly thinner than the M430 and that makes it feel less bulky on the wrist.",
    "You can also switch out your strap for a textile wristband that comes in orange, petrol and white, but these cost extra.",
    "Alternatively, because the Vantage M has a standard 22mm lug – like you find on most watches – you can also buy any off-the-shelf strap that fits that size.",
    "As a multi-sports watch it won’t surprise you to hear that the Vantage M is waterproof, so no need to take it off in the shower and you can swim indoors and in open water.",
    "Unlike the Vantage V, there’s no built-in barometer, so altitude and elevation is measured by GPS. This is also why you don’t get baked in power with the Vantage M, as the barometer is a key sensor in Polar’s power equation.",
    "One last thing on the design, there’s a new round charging cradle that mercifully gets rid of the annoying charging cable that used to drop out of the Polar M430. So you can be sure your device is actually charging when you dock it."
  ],
  "headers": {
    "4": "Polar Vantage M price and availability",
    "5": "Design and display"
  },
  "links": {
    "Polar M430": "https://www.techradar.com/reviews/polar-m430",
    "Polar Vantage V": "https://www.techradar.com/reviews/polar-vantage-v-review",
    "Polar M400": "https://www.techradar.com/reviews/wearables/polar-m400-running-watch-review-1299398/review",
    "Garmin Forerunner 645": "https://www.techradar.com/reviews/garmin-forerunner-645-music-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review"
  }
}