{
  "source": "https://www.techradar.com/reviews/hp-spectre-x360-2018",
  "title": "HP Spectre x360 (2018) review",
  "category": "computing",
  "updated": "2019-03-29T10:33:17Z",
  "author": "jason-cipriani",
  "summary": "This flagship 2-in-1 laptop gets the job done",
  "verdict": "Even with less battery life than promised, there’s not a lot to hate about the new Spectre x360. In fact, with a stylus in the box, excellent speakers and a gorgeous touchscreen, there’s a lot to love here.",
  "pros": [
    "Stylus included",
    "Stunning speakers",
    "Beautiful display",
    "Day-long battery life"
  ],
  "cons": [
    "Weak hinges",
    "Annoying keyboard layout"
  ],
  "article": [
    "Much like other laptops in HP’s premium lineup, the HP Spectre x360 is a gorgeous 2-in-1 device that can keep up with the best Ultrabooks out there. If you’re wondering how we got here, it’s the product of HP stepping back and re-evaluating its lineup, which results in a new chassis, backed by more powerful components and an included stylus.",
    "In a lot of ways, the new HP Spectre x360 rivals the Microsoft Surface Book 2 and Lenovo Yoga 920 in features and style, even if only the Yoga 920 is a real competitor in terms of pricing.",
    "With the 2018 model of the HP Spectre x360, HP improved so many buttons and even just the design in general – going so far as to include a microSD card reader. So, it’s not hard to see why the HP Spectre x360 is one of the best 2-in-1 laptops on the market, even in the face of underwhelming battery life and an awkward keyboard layout.",
    "If you’re trying to get your hands on the HP Spectre x360 model we reviewed, it’ll set you back $1,069 in the US, including everything listed to the right. Through HP’s website,though, you can get more affordable models. The entry-level HP Spectre x360 costs $989, and will net you an Intel Core i5 CPU, 256GB of SSD storage and 8GB of RAM.",
    "The model we tested won’t be available in Australia, unfortunately. Instead, you’ll find a starting price of AU$2,399 with an Intel Core i5 CPU and 360GB of SSD space, topping out at AU$3,599 for an Intel Core i7, 16GB of RAM and a 1TB NVMe SSD.",
    "In the UK, HP offers the same range of options as in the AU – starting at £1,499 and topping out at £1,749.",
    "The HP Spectre x360, then, is competitive with the likes of the Lenovo Yoga 920 ($1,549, £1,349, AU$1,954) or Microsoft’s Surface Book 2 ($1,499, £1,499, AU$2,600), if not a bit more affordable than either model.",
    "You can also pick up the late 2018 model of the HP Spectre x360 with a redesigned chassis and Whiskey Lake processors for $1,149 (£1,199, AU$2,499) and up.",
    "A smooth, silver aluminum housing wraps the entire chassis, broken up only by shiny buttons or speaker grilles. The material is kind of like older Spectre designs, so it’ll likely show some wear and tear over time.",
    "There’s a microSD card slot, a 3.5mm headphone jack, a USB 3.1 port and a power button with embedded light on the left side of the laptop. On the right, you’ll find the HP Spectre x360’s fingerprint sensor, two USB-C Thunderbolt 3 ports and volume rocker.",
    "This Spectre x360 isn’t exact.y brimming over with ports, but having both USB Type-A and USB-C is a welcome approach to getting rid of the pain of living that dongle life. Either of the Thunderbolt 3 ports can be used to charge the HP Spectre x360.",
    "Measuring 12.04 x 8.56 x 0.53 inches (30.6 x 21.8 x 1.36cm), and weighing 2.78 pounds (1.26kg) the Spectre x360 is lightweight and compact enough to tote around.",
    "Once you open the HP Spectre x360, you’ll be greeted with a rather large touchpad that’s smooth to the touch and has a satisfying click to it.",
    "Above the keyboard is a rather compelling speaker grille. The design is visually appealing and allows more than enough sound to come through.",
    "Above this speaker grille are the two hinges that let the HP Spectre x360 rotate 360 degrees to go from tablet to laptop mode. The hinges are smooth when moving the screen, but they’re not perfect at holding it steady when tapping the screen or even just typing on the keyboard.",
    "Instead of reaching up with one hand to scroll through some text, we find ourselves using another hand to hold the Spectre x360’s display still while interacting with its touch interface.",
    "HP was able to shrink the bezels on this year’s model of the Spectre x360, along with offering a privacy feature for an extra $60 in the US – a feature not included on the model tested here. This feature is supposed to prevent coworkers or strangers from peeking at your screen and obtaining private information.",
    "A full-sized keyboard sits just above the touchpad, only with an extra column of keys to the far right. The added keys serve as the Page Up/Down, Home/End, and a Delete keys.",
    "This row continues to give us problems, as our muscle memory when doesn’t expect there to be anything to the right of the Enter and Backspace keys. Compounding the confusion is the fact the right arrow key lines up with the added row, instead of with the Shift/Return/Backspace keys as is normally the case.",
    "Other than the added column of keys, HP has a winning keyboard. It’s smooth and the keys require little force for touch-typists.",
    "A welcome characteristic of the touchpad is just how wide it is. It’s longer than the spacebar, making it easy to interact with when needed. It has a reassuring click to it, and is smooth when using gestures to navigate Windows 10.",
    "Included in the box is an HP Pen. The stylus works with Windows 10 Ink for drawing stick figures or jotting down notes.",
    "In our testing, the stylus and Spectre x360’s interaction is seamless, with digital ink flowing from the pen with ease.",
    "You can lift the top of the stylus to reveal a USB-C port that will charge it. This hidden charging port that doesn’t require sticking the end of the pen into a port like the Apple Pencil, or pulling a battery out like the Surface Pen is awesome, and another easy win for the 2018 HP Spectre x360.",
    "Adding to the convenience is the fact that you can use the same cable you use to charge the x360.",
    "First reviewed February 2018"
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design",
    "21": "The HP Pen"
  },
  "links": {
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Microsoft Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2-13-inch",
    "Lenovo Yoga 920": "https://www.techradar.com/reviews/lenovo-yoga-920-review",
    "Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}