{
  "source": "https://www.techradar.com/reviews/ehr-transcriptions",
  "title": "EHR Transcriptions review",
  "category": "computing",
  "updated": "2020-01-25T12:51:40Z",
  "author": "jonas-p-demuro",
  "summary": "The simple medical transcription service built for doctors, not engineers",
  "verdict": "EHR Transcriptions is an ideal medical transcription solution for the technophobes among physicians, but those looking for an even fuller feature set would be wise to consider other options as well.",
  "pros": [
    "No software to install",
    "Free trial",
    "Choice of platforms for dictation",
    "Available 7-day support"
  ],
  "cons": [
    "Opaque pricing",
    "Lack of Android support",
    "Single support option- telephone"
  ],
  "article": [
    "EHR Transcriptions can trace its origins back to a sister company, Same Day Transcriptions, that was founded back in 2003 with a $600 Yahoo ad. EHR Transcriptions grew out of this in 2012, as a Service Disabled Veteran Owned Small Business, founded by Rob Foley.",
    "They have grown considerably, and now serve approximately 4,800 medical offices and medical research organizations worldwide with over 7,500 dictating clinicians, and over 2 million dictations delivered. The company is based in the US at Lakewood Ranch, Florida, and 15% of the profits are given to organizations that help US veterans.",
    "EHR Transcriptions endeavors to simplify the process of dictating for clinicians. After all, physicians are trained to provide care to patients, and not be computer experts.",
    "The service starts with having a number of options available for dictation, including telephone, which gets included on all accounts, and then upgrades available for the provider to be able to use their iPhone, a digital voice recorder via a medical dictation upload tool, or a computer microphone. It is certainly a plus to have this many options, which then ensures that this medical transcription service will fit into any clinician’s workflow.",
    "After the dictation is completed, it enters what EHR Transcriptions dubs the ‘The Tru-Trac Transcription Trail” (try saying that ten times fast). This process then immediately tags the dictation for tracking as it is processed. In order to keep the process HIPAA compliant, all data gets transferred via a VPN, with 528-bit encryption, and recall that 256-bit encryption is the standard for governmental ‘Top Secret’ communications, making this a level higher. And they are so sure they won’t lose the doctor’s dictation (an entirely frustrating and disheartening calamity when the day after it is dictated it is discovered that the dictation needs to be done again), that the EHR transcription process ‘Puts their money where their mouth is,’ with their “$500 No-Lost-Transcription-Guarantee.”",
    "EHR Transcriptions goes the extra mile to obtain a high quality dictation, such as having “Medical language experts assigned by specialty,” to make sure all the jargon for that particular specialty gets transcribed accurately. This team of specialty specific dedicated medical transcription experts will transcribe the dictation accurately, and even provide personalized formatting to the clinician’s specifications.",
    "With this infrastructure, they can make the claim of Triple-Proof Accuracy. EHR Transcriptions does not just rush through the job, nor rely on a computer driven voice to text algorithm. Rather, their process includes for all medical transcriptions to be looked at a total of three times by their specially trained medical language experts. After this exhaustive process, it then gets goes through their “Online medical transcription quality assurance software,” as a final check on the accuracy of the transcription. Finally, the guarantee can be made that if it does not measure up to your expectations, to then inform them, and it’s free.",
    "Reports are done with a 24 hour turnaround time (In the unlikely event that this is not fast enough, there is also the option for a rapid backlog service to get caught up on reports). From the online platform, notes can then be viewed, edited, faxed, or e-signed with just a click. The notes can then be printed, or downloaded from their system. Dictations also get indexed, and then can be accessed from anywhere, at anytime, which is certainly convenient when away from the office.",
    "The software is entirely browser based, which is a simultaneous blessing and curse, so to speak. The advantage is that there is no software to install, other than for Apple’s iOS mobile platform, which certainly simplifies use, and also means it will work on any Windows, Mac or Linux device, and with your favorite browser, whether Firefox, Chrome, Safari or Internet Explorer. The downsides include no support for the more popular Android platform, and some users prefer dedicated software on their machines, particularly if their broadband connection is wonky.",
    "The major drawback is that while there is support for the iPhone, EHR Transcriptions lacks support for the more popular Android mobile platform.",
    "Support is provided for EHR Transcriptions via telephone based in the US. While not completely 24/7, the hours are extended on weekdays, and they also have some hours on the weekends as well. There are no other options for email, chat or live.",
    "There is an available 7-day trial, and it’s hard to argue with the company’s statement: “If we don't deliver as promised, quit. It's free.”",
    "While there are no setup fees, hidden fees, nor contracts, the rest of the pricing is not available on their website, and rather requires phone or email contact to get a quote. While this can get a little frustrating, we do appreciate their promise of “No pushy sales stuff,” to not pressure us into signing up for the service if we are not ready to do so. EHR Transcriptions asserts that they price competitively, and wish to provide value with their service, but without numbers to compare, we can’t see how that claim measures up.",
    "EHR transcriptions has a compelling offering for the medical transcription space, offering an easy to use platform for clinicians, with an uber high degree of security, and flexible dictation platform options. It does miss some areas, such as lacking Android support, the opaque pricing, and the lone, telephone based support option. Still, it does its primary mission well, and physician luddites should consider this as an attractive solution for their medical transcription needs."
  ],
  "headers": {
    "2": "Features",
    "9": "Drawbacks",
    "10": "Support",
    "11": "Pricing",
    "13": "Final verdict"
  },
  "links": {
    "EHR Transcriptions": "https://www.ehrtranscriptions.com/"
  }
}