{
  "source": "https://www.techradar.com/reviews/philips-8804-tv",
  "title": "Hands on: Philips 8804 TV review",
  "category": "televisions",
  "updated": "2019-01-25T11:39:22Z",
  "author": "gerald-lynch",
  "summary": "Bowers and Wilkins sound makes its way to an LED TV",
  "verdict": "With a powerful integrated soundbar tightly tuned by the Bowers and Wilkins team, the Philips 8804 is an LED LCD TV to watch for those not convinced by the march of the OLED.",
  "pros": [
    "Great sound",
    "Minimalist design",
    "Ambilight is still great"
  ],
  "cons": [
    "Panel not as rich as OLED cousin",
    "Lacking the benefits of P5 Pro chip"
  ],
  "article": [
    "While pixel count and TV panel quality has continued to progress at a pace for years, flatscreen televisions have still traditionally suffered from poor audio.",
    "Decent speakers need space to work their magic, and your average LCD or OLED TV just doesn’t have the room to do them justice.",
    "With the Philips OLED+ 903, that trend was bucked – by teaming up with Bowers and Wilkins, it brought soundbar quality audio to a TV that had picture quality to match.",
    "With the Philips 8804 TV, the company is bringing that exact same quality audio to a 4K LCD display, with impressive results.",
    "Philips is still to determine a Philips 8804 release date, but we've been told to expect to see them trickling out by May of 2019, with price to be brought out at roughly the same time. It's a mid-to-premium set, so if it landed at a sub-£1,000 (around $1,300 / AU$1,800) we wouldn't be hugely surprised.",
    "Set to come in 50-, 55- and 65-inch screen sizes, the Philips 8804 manages to deliver an attractive design despite the added pressure or having to find room for what is essentially a soundbar housed beneath the screen.",
    "You’ll find the 8804 sitting on two transparent feet towards either end of the screen, giving the impression that the panel is floating when placed on an AV cabinet, and allowing its 3-sided Ambilight lighting array on the back (letting onscreen colors bloom behind the display) to reflect the hues going on around them.",
    "A thin bezel sits around the edge of the screen, but it is the soundbar that draws the eye. It runs the length of the screen, integrated into that lower bezel, and is covered in an attractive Kvadrat grey cloth. With little branding on the front of the display, it’s a reserved look, greatly appreciated.",
    "With the Philips 8804 TV, you’re getting four HDR-ready HDMI slots and two USB ports. The TV is powered by the Android TV OS, and can be integrated into both a Google Home / Assistant smart home, also working with Alexa voice commands to control settings too. You’ll find a Google Assistant button, not an Alexa buzzer, on the remote though.",
    "While the Philips OLED+ 903 was a showstopper in times of image quality, but the 8804 holds its own, looking great for an LED LCD display.",
    "First off, it’s got a full suite of HDR support in the form of Dolby Vision, HDR10+ and Hybrid Log Gamma, but it’s the P5 Perfect Picture processing engine that pushes things forward.",
    "While it’s lacking some of the newer features that the P5 Pro chip (headed to this year’s Philips OLEDs) boasts, it still does a fantastic job of recreating detail in dark scenes while letting bright spots pop through.",
    "It’s just in motion processing where we need to spend a little more time investigating the quality on show here. We noted a hint of blurred edges when watching the opening scene of The Greatest Showman and the quick-cutting circus act. But given we only had a swift view of the screen, things are looking very positive indeed.",
    "If picture performance looks set to impress, it’s in the audio department where the Philips 8804 could excel, thanks to the influence of the Bowers and Wilkins partnership.",
    "Anyone that’s experienced the OLED+ 903 will know what to expect here. You’ve got a 50W sound output over a 2.1 channel array, taking advantage of Bowers and Wilkins audio hardware and tuning heritage to make the 8804 sing.",
    "It’s almost identical to the OLED+ 903 aside from one key difference – with the 8804, the low frequency assembly is placed higher up the panel, closer to the middle of the screen, rather than along the bottom.",
    "This is purely due to different constraints within the make up of the LCD chassis compared to the OLED.",
    "Bowers and Wilkins has done a great job of tuning the sound output, taking great care to attempt to widen and move the soundstage so that voices appear to come from within the screen, rather than underneath it.",
    "It’s believably achieved – the dulcet tones of Hugh Jackman in The Greatest Showman rang clear, while the stomping bass tones of the pop tune accompaniment hit with a force that your average TV soundsystem can only dream of.",
    "Dolby Atmos is supported here, but note that this is a downmix of the overhead positional surround sound technique, rather than true overhead or upfiring drivers as you’d find in the very impressive Panasonic GZ2000.",
    "All eyes may be on impressive OLED screens these days, but if your budget can’t stretch that far, and you don’t want the hassle of a separate sound system hooked up in your AV cabinet, the Philips 8804 could be the mid-to-premium set to watch this summer.",
    "We'll be drawing this into our TV labs as soon as we can get a Philips 8804 TV in for review, so we'll be bringing that to you as soon as we can."
  ],
  "headers": {
    "4": "Pricing and availability",
    "5": "Design",
    "9": "Picture quality",
    "13": "Audio performance",
    "20": "Early verdict"
  },
  "links": {
    "Philips OLED+ 903": "https://www.techradar.com/reviews/philips-oled-903",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Panasonic GZ2000": "https://www.techradar.com/reviews/panasonic-gz2000-4k-oled-tv-review"
  }
}