{
  "source": "https://www.techradar.com/reviews/x96h-thin-client-android-pc",
  "title": "X96H thin client Android PC review",
  "category": "computing",
  "updated": "2019-10-04T17:43:38Z",
  "author": "desire-athow",
  "summary": "An affordable thin client computer with a killer feature",
  "verdict": "The X96H stands out in the crowded world of thin client Android PCs with an affordable price tag and a solid feature list. Shame though that the user interface is still heavily skewed towards touch.",
  "pros": [
    "Reasonably fast T720 GPU",
    "HDMI-in",
    "Power button"
  ],
  "cons": [
    "Can’t disable Android keyboard when using physical keyboard.",
    "2GB/16GB has little reason to exist",
    "100MBps Ethernet",
    "Still sporting USB 2.0 ports"
  ],
  "article": [
    "In the very crowded market of Android boxes, it is difficult to come up with a unique selling point that differentiates your product from other brands. That is particularly true at the lower end of the market where pricing often pips features on the pecking order.",
    "Somehow though, the X96H, which is manufactured by an unknown vendor and sold by Gearbest, delivered something unexpected, a HDMI-in. Something no other box offers at this price point.",
    "The X86H is slightly bigger than your usual Android box which tends to be square and compact. This one is a rectangular slab measuring 13.50 x 9.00 x 2.30 cm for a weight of about 180g. It comes with a 5V2A (10W) power supply unit that connects to the TV box via a proprietary connector.",
    "There’s plenty of gaps to allow air through to cool the device. The front contains a blue LED display that shows time but doesn’t offer any other features like an alarm or secondary times. Connectors are located on two sides of the device; the back contains one USB 2.0 port, one AV one, two HDMI ports, an Optical port, a 10/100MBps Ethernet connector, a proprietary power port and a power switch, a rarity.",
    "On the side are two extra USB inputs (one of which is USB 3.0) and a microSD card reader; a better-than-average number of connectors.",
    "Margins are very slim when it comes to entry level Android boxes. So it comes as no surprise that the manufacturers have eschewed better known names such as Mediatek or Qualcomm for the processor and went instead for the AllWinner H603 which has four Cortex A53 cores clocked at 1.5GHz and paired with a Mali T720 GPU.",
    "We received the 2GB/16GB version; there’s a 4GB/32GB model for $7 more and a 4GB/64GB for $17 extra. We would rather go for that one as it is more future-proof than the other two models.",
    "The rest of the configuration is as follows: 802.11ac/Bluetooth 4.1 for the 4GB version and 802.11n/Bluetooth 4.0 for the 2GB version. Oh and it comes with a remote control as well, a clear indication of its veritable market.",
    "One thing that the X96H didn’t skip was updates; we counted two in September 2019 with the latest being on the 30th of that month. Otherwise, this Android box delivered some great numbers when our benchmarks accepted to run.",
    "Its PCMark score for example is much higher than that scored by the Blackview BV6100, probably because of the higher performing GPU. That means that the X96H will perform most tasks with ease.",
    "At $49.99, the X96H ranks amongst the cheapest for a 4GB/64GB Android box although the Magicsee N5 remains the cheapest at $39.99. The latter uses a different processor with a slower and older Mali-450 GPU; it doesn’t have a HDMI-in, has one fewer USB port and no power button. It is however remarkably compact and has a recovery pinhole tucked away, just in case you hit a major issue.",
    "Like the X96H, the MX10 Pro ($42.99), the X10 Plus ($46.99) and the H10 ($47.35) sport the Allwinner H603 CPU and claims that they can drive 6K displays (which don’t current exist on the market). These all sport the same features (system memory, storage capacity, expansion capabilities) leaving us to believe that they are manufactured by the same OEM. That means that they have the same issues; 10/100MBps Ethernet, an absence of 802.11ac and the use of USB 2.0 ports. Niggles, rather than deal breakers.",
    "The X96H is a decent enough thin client/Android PC/TV box; it has a compelling price and a good enough set of features. We like the fact that it has a power button and a reasonably powerful GPU. However what makes it a stand out product is the fact that it has a HDMI In port which opens the door for a number of applications including video recording, picture in picture and UDP broadcasting; all of which that can be useful for example for close capture TV (CCTV)",
    "There is no one currently on the market who can provide a similar alternative for a similar outlay. Even discounting that feature, the X86H remains the best Android 9.0 TV under $50 thanks to its fast GPU and the power button. Businesses will appreciate its simple operation and the fact that it is an affordable and yet relatively powerful device."
  ],
  "headers": {
    "2": "Design",
    "5": "Hardware",
    "8": "Performance and in use",
    "10": "The competition",
    "12": "Final verdict"
  },
  "links": {
    "Blackview BV6100": "https://www.techradar.com/reviews/blackview-bv6100-ruggedised-smartphone",
    "Magicsee N5": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1217562280093245700&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009308993364.html%3Fwid%3D1349303",
    "MX10 Pro": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1059929560771720000&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009746261113.html%3Fwid%3D1433363#goodsDetail",
    "X10 Plus": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1061180599811181700&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009934919507.html%3Fwid%3D1433363#goodsDetail",
    "the H10": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-7599031188286722000&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009427869796.html%3Fwid%3D1433363"
  }
}