{
  "source": "https://www.techradar.com/reviews/cubot-quest-rugged-smartphone",
  "title": "Cubot Quest rugged smartphone review",
  "category": "phones",
  "updated": "2019-06-27T09:55:54Z",
  "author": "desire-athow",
  "summary": "A newcomer in the crowded market of affordable rugged devices",
  "verdict": "The Quest is a reasonably priced rugged smartphone with a few unique selling points. It has NFC, is very slim - although you lose in terms of battery capacity - and runs the latest version of Android.",
  "pros": [
    "Very slim",
    "Very sturdy",
    "Stock Android",
    "NFC"
  ],
  "cons": [
    "Low screen resolution",
    "No 802.11ac"
  ],
  "article": [
    "We have only managed to review one Cubot smartphone on TechRadar and that was the King Kong 3 which received a solid four stars from us back in November 2018. Seven months later, what looks like a slightly worse model, has emerged from its shadows. Meet the Quest, Cubot’s latest budget-friendly rugged smartphone.",
    "Cubot claims that the device is the thinnest rugged device on the market. At 8.8mm, it is certainly thin, just one millimeter thicker than the Apple iPhone X and the Samsung Galaxy S10. Measuring 157 x 73.7mm for a weight of 211g, it feels both solid and comfortably portable.",
    "Cubot uses the same template as the King Kong 3 for the Quest and is available in red or black color scheme. It uses an aluminum and polycarbonate shell with rounded corner buffers that in our real life test, protected the screen beyond our expectations.",
    "The latter is oleophobic and covered with a layer of Corning Gorilla 5 glass. This is an IP68-rated smartphone so its USB Type-C port is covered; there are no audio connector and no audio adaptor provided. The front screen is a 5.5-inch model with a single 8-megapixel camera on top and a LED notification light.",
    "The power on button and the volume rocker are located on the right while the left side of the device contains a dedicated camera button - which can be customised - and the SIM tray. As for most smartphones within that price range, you can either put two SIM cards (dual-card, dual-4G network standby) or one SIM card and a microSD model.",
    "The rear of the device contains the fingerprint scanner, two camera sensors - including a 12-megapixel Sony IMX 486 6P camera with an f/1.8 aperture - and a LED flash plus the speaker grill.",
    "Inside the Quest is the 12nm Mediatek MT6762 (Helio P22) which is an 8-core processor clocked at 2GHz, with, surprise, surprise, a PowerVR GE8320 GPU rather than the usual ARM Mali part. That is backed by 4GB of RAM and 64GB onboard storage. A note on the display; Cubot is one of the many smartphone vendors to equip its smartphones with 1440 x 720 pixel displays (a 5.5-inch IPS model in this case).",
    "Doing so produces slightly blurrier pictures but on the flip side, these are cheaper, the GPU and the battery has to power 50% fewer pixels compared to the usual full HD display; this means better graphics performance and battery life in theory.",
    "The Quest also packs an FM radio (a rarity), NFC and 802.11n wireless connectivity, a 4,000mAh OTG-compatible battery (powered by a 5V2A charger), stock Android 9.0 operating system and a single rear-facing speaker. There’s hardly any bloatware or bundled toolkit as is usually the case with other vendors.",
    "Face unlock complements the fingerprint security feature well and overall the smartphone performs as expected. It was never expected to be a roadrunner given the pedestrian CPU that equips it. The Quest performed on par or better than other smartphones equipped with the slightly older MT6763V. It scored higher than expected numbers in PCMark Work 2.0, almost as high as the much faster 6763T that powers the Unihertz Atom.",
    "In real life testing, we didn’t notice any lag during normal usage (which included a bit of web browsing and multi-tasking). The screen was spot on, usable in sunshine and artificial light and delivering punchy colours with good contrast.",
    "The Cubot King Kong 3 is the obvious one: it runs on an older version of Android costs slightly more but on the other hand, it has a more powerful CPU and a bigger battery. The Homtom Zoji Z9 packs a superior hardware set complete with a bigger battery and 50% more system memory. It is also cheaper but runs on Android 8.1.The Zoji Z11 is an even better buy for those who want battery life above and beyond anything else; it is far cheaper than Cubot Quest, has twice the battery capacity but, again, uses an old Android and a much slower processor. The Oukitel WP1 is another rugged Android 8.1 smartphone with a slightly higher price point and wireless charging that could be an intriguing alternative to the Quest.",
    "It is hard to fault this smartphone at this price. We are not really fussed by the screen’s low resolution at this price point and one may argue that it is actually a boon for the battery life. Rugged smartphones are rarely as thin as their non-rugged counterparts; yet the Cubot Quest has somehow managed the feat of getting something which is both slim and capable of taking a few bumps.",
    "Truth be said, it doesn’t have a lot of competition under $200 especially with Android 9.0 in check, NFC and a better-than-average design. The battery life could have been improved but that would have impacted the sleekness of the device. Overall, Cubot managed to deliver a great smartphone at an excellent price point. The question that puzzles us though is whether the King Kong 3 could be a better choice for you."
  ],
  "headers": {
    "1": "Design",
    "6": "Hardware",
    "9": "Performance",
    "11": "Competition",
    "12": "Final verdict"
  },
  "links": {
    "King Kong 3": "https://www.techradar.com/reviews/cubot-king-kong-3-rugged-smartphone",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Unihertz Atom": "https://www.techradar.com/reviews/unihertz-atom",
    "Cubot King Kong 3": "https://www.techradar.com/reviews/cubot-king-kong-3-rugged-smartphone",
    "Zoji Z9": "https://www.techradar.com/reviews/homtom-zoji-z9",
    "Zoji Z11": "https://www.techradar.com/reviews/homtom-zoji-z11-rugged-smartphone",
    "Oukitel WP1": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1277367950386122500&p=https%3A%2F%2Fuk.gearbest.com%2Fcell-phones%2Fpp_009319388085.html%3Fwid%3D1349303"
  }
}