{
  "source": "https://www.techradar.com/reviews/langogo-genesis",
  "title": "Langogo Genesis review",
  "category": "appliances",
  "updated": "2019-06-06T14:22:19Z",
  "author": "cat-ellis",
  "summary": "Natural accents, great speech recognition, and a screen that won't give you a headache",
  "verdict": "The Langogo Genesis solves several of the problem we've had with other pocket translators. It's not yet perfect, but its only issues are software-related, so those could be remedied through future updates. It's not cheap, but it comes highly recommended.",
  "pros": [
    "eSIM for global data",
    "Simple to use",
    "Good-sized screen"
  ],
  "cons": [
    "Some interface text is in Chinese",
    "Quite expensive"
  ],
  "article": [
    "The Langogo Genesis (also known as Langogo AI Translator) got its start on Indiegogo, where early backers were able to buy it for a discount, and is now available worldwide from Amazon and Langogo.ai with a starting price of $299 (about £250, AU$430).",
    "That's pretty steep for a pocket translator, but as we discovered in our tests, the Genesis is a cut above its counterparts.",
    "The Langogo Genesis is a little different to the last two handheld translators we reviewed (Pocketalk Translator and Travis Touch Plus), with a rectangular chassis that's a little less comfortable in the hand than its oval-shaped rivals.",
    "It’s also a little larger than Pocketalk and Travis, but that's no bad thing; the other devices' tiny screens meant entering Wi-Fi passwords and other text was an exercise in frustration, but the Langogo's display is big enough to make it a breeze. It made a tremendous difference, particularly when we were first setting up the device and wanted to get started with a minimum of hassle.",
    "As another nice touch, the Langogo Genesis comes packaged with a simple wrist-strap to stop it being dropped accidentally during a conversation, or snatched from your hand (the risk of which is one of the main reasons for using a pocket translator rather than your smartphone while traveling).",
    "The Langogo Genesis has two modes: one for simple translations (like asking the taxi driver for a receipt, for example) and another for conversations between two people speaking different languages. Most similar devices are designed with conversations only in mind, but it's refreshing to be given a choice.",
    "As is usually the case with machine translation, it’s not perfect, but in our tests the Langogo Genesis performed significantly better than others we’ve tried. Its speech recognition was particularly impressive, coping well with a variety of accents and the echoey room we were using.",
    "We were impressed by the Langogo's pronunciation, which was surprisingly natural,, and by the provision of regional variations of the same language, which help avoid subtleties being lost in translation.",
    "The Langogo Genesis needs an internet connection to perform those translations, and offers three ways to get online: Wi-Fi, a removable SIM card (not supplied), or eSIM. The last of these is a fairly new technology, and is essentially an embedded SIM card. To use this, swipe left to access the Settings menu and select ‘Global Wi-Fi’. From here, you can purchase various packages, which will give you a certain amount of data for a period of time. This isn’t something we’ve seen in a pocket translator before, but is extremely useful.",
    "There was only one problem: although we had the system language set to English, the names of these packages were presented in Chinese, as were the instructions. We’re not sure whether this is a common problem, or that the review unit was an early model.",
    "Once you have a mobile data connection set up, you can use the Langogo Genesis as a mobile hotspot for several other devices, which is a handy touch when you're on the road. The translator’s software receives regular updates, but if you’re on the move using your mobile data, you can defer them until you have a WiFi connection.",
    "The Langogo Genesis also features a ‘smart assistant’ called Euri, which can be accessed by tapping the right-hand button on the main screen and performs simple tasks like currency conversion and navigation using voice controls. Nothing that couldn’t be handled by your smartphone, but you’ve invested in a data plan for the device, it makes sense to get the most out of it.",
    "It's not yet perfect, but the Langogo Genesis is the most impressive pocket translator we've seen so far, and could become even stronger with future software updates."
  ],
  "headers": {
    "0": "Price and availability",
    "2": "Design",
    "5": "Features"
  },
  "links": {
    "Langogo.ai": "https://www.langogo.ai/",
    "Pocketalk Translator": "https://www.techradar.com/reviews/pocketalk-translator",
    "Travis Touch Plus": "https://www.techradar.com/reviews/travis-touch-plus"
  }
}