{
  "source": "https://www.techradar.com/reviews/alcatel-1x-2019-hands-on",
  "title": "Hands on: Alcatel 1X (2019) review",
  "category": "phones",
  "updated": "2019-01-09T01:35:37Z",
  "author": "john-mccann",
  "summary": "A solid, low cost smartphone",
  "verdict": "A solid, affordable smartphone that can handle apps and basic games, along with delivering good-enough cameras and a pleasant design.",
  "pros": [
    "Grippy, soft touch design",
    "Large display for low price"
  ],
  "cons": [
    "Not the latest version of Android",
    "Internal space may fill up fast"
  ],
  "article": [
    "The new Alcatel 1X (2019) is the latest budget smartphone from the firm, launched at CES 2019, offering up a decent size screen and solid build at a highly attractive price point.",
    "It builds significantly on the 2018 model of the same name, which launched at MWC 2018 last year, with an improved design and better display.",
    "It's not going to wow you, nor does the Alcatel 1X have any cutting edge features, but it does give you a complete smartphone experience and it could be worth considering.",
    "The Alcatel 1X price is $120 (around £95, AU$170), putting it right at the budget end of the market.",
    "In terms of an Alcatel 1X (2019) release date, it will go on sale sometime during Q1 2019 in select markets within North America, Europe, the Middle East, Africa and Asia.",
    "The Alcatel 1X has an attractive design for a budget handset, with the 5.5-inch display taking up most of the front of the phone and while there are bezels around it, the look is still good.",
    "On the back, Alcatel has opted for 'pebble paint' which offers a soft, grippy finish which reminds us of the Motorola PEBL. It wraps round the sides on the bottom half of the handset too, providing additional grip.",
    "This makes it comfortable to hold in the hand, although the finish may not be for everyone and it does feel a little cheap.",
    "You'll find the power and volume keys on the right side in easy to reach locations, while on the left you get the SIM tray. On the top edge there's a headphone jack, and on the base a microUSB port alongside a speaker and microphone.",
    "Alcatel 1X hands on gallery",
    "In some regions, the Alcatel 1X (2019) will come with a rear mounted fingerprint scanner - already confirmed for the UK - while other regions will miss out on this slice of biometric tech.",
    "All models of the Alcatel 1X will come with Face Key, which is the firm's own face unlock system.",
    "The 5.5-inch, 18:9 display on the Alcatel 1X features a HD+ resolution (so not full HD), and it looks bright and clear. At this price point, the resolution is acceptable and we saw no issues with the screen during our hands on time with the handset.",
    "Under the hood you'll find a MediaTek MT6739ww chipset and 2GB of RAM which is just enough to keep Android 8.1 Oreo running. It's not the latest software from Google though (Android 9 Pie), and currently there's no word on whether the 1X will get an update to it.",
    "It's a relatively stock version of Android, with only a light Alcatel skin over the top, which keeps the OS looking fresh. You also get access to Google's voice assistant too, which is nice to see in a budget device.",
    "We found Android ran well during our short time with the Alcatel 1X, but the real test will be our in-depth review process once the handset is full of apps, photos and more.",
    "You get 16GB of internal storage to play with, but a sizable chunk will be taken up by the operating system, leaving you less for your stuff. It means it could end up filling pretty quickly, but the Alcatel 1X comes with a microSD slot, allowing you to build on that with cards up to 128GB in size.",
    "In terms of battery you're looking at a 3,000mAh power pack, with no fast or wirless charging options, although battery life should be okay with its HD display and lesser internals.",
    "Round the back the Alcatel 1X offers up dual cameras, with a 13MP main sensor alongside a 2MP depth of field snapper. It means you can take portrait mode shots with the 1X, although the quality is no where near as good as the cameras on flagship handsets.",
    "The camera quality is passable for this price point, but it's not going to wow you. On the front you get a serviceable 5MP camera.",
    "A nice feature in the camera app is one-hand mode, which groups all the controls into either the bottom right or left corner for easy selfie taking.",
    "The Alcatel 1X looks to be a solid, affordable smartphone that can handle apps and basic games, along with delivering good-enough cameras and a pleasant design.",
    "If you'll be in the market for a budget handset for yourself or the kids in the coming months, the 1X is worth keeping an eye on."
  ],
  "headers": {
    "3": "Alcatel 1X price and release date",
    "5": "Design and display",
    "13": "Performance and interface",
    "21": "Early verdict"
  },
  "links": {
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "the 2018 model": "https://www.techradar.com/reviews/alcatel-1x",
    "Motorola PEBL": "https://www.techradar.com/news/phone-and-communications/mobile-phones/motorola-pebl-1299291"
  }
}