{
  "source": "https://www.techradar.com/reviews/workfront",
  "title": "Workfront review",
  "category": "computing",
  "updated": "2019-11-12T17:55:51Z",
  "author": "jacob-parker",
  "summary": "AI-backed project management tools",
  "verdict": "Workfront’s high price is justified by powerful features and flexible third-party integrations. There’s no question that Workfront makes it easier to keep your organization running smoothly.",
  "pros": [
    "Over 150 different application integrations",
    "Workfront Library simplifies digital asset management",
    "Slick iOS and Android mobile application"
  ],
  "cons": [
    "Fairly expensive compared to the competition",
    "Quick-response support not available with starter plans",
    "Slightly dated-looking desktop interface"
  ],
  "article": [
    "Founded in 2001, Workfront is project management software that allows you to create standardized business processes, collaborate with clients and quantify the success of your work. You can incorporate Workfront into your current business model thanks to its ability to integrate with numerous other tools, such as Salesforce.",
    "Over the course of this in-depth Workfront review, you’ll come to understand why over 3,000 businesses organizations rely on Workfront software. Although Workfront might not offer the most visually pleasing interface, its combination of powerful dashboards, real-time reporting and digital asset management tools mean that this isn’t a system to ignore.",
    "Your organization can gain access to the Workfront system by signing up to a paid monthly subscription plan. Four different tiers of Workfront membership are available: Team, Pro, Business and Enterprise.",
    "You’ll have to purchase a Workfront licence for each individual you want to have a Workfront user account. It’s worth noting that some Workfront plans are only available if you purchase a minimum number of licences.",
    "Your Workfront installation will be customized according to the unique needs of your organization. Because of this, definite Workfront pricing information is only available if you request a quote. However, Workfront customers report that pricing starts at around $30 per month per user.",
    "The Team plan is designed to meet the needs of a small group of workers and is the most restricted in terms of features. For example, it doesn’t support automated work order approval or IP address whitelisting. Meanwhile, the top-end Enterprise option gives you the ability to securely submit your documents to external auditors.",
    "Workfront packages come with varying amounts of storage space, ranging from 2GB to 60GB of data per user. If your employees need to manipulate multimedia files or access a large library of documents, you will likely require one of the more expensive plans.",
    "Workfront offers a robust work management system that simplifies the difficult task of running a complex business operation. You can use Workfront to keep track of your organization’s available resources and the demands placed upon it. Even better, Workfront can automatically find the most efficient way for you to distribute work using AI technology that assigns tasks based on priority and skill requirements.",
    "Customizable project templates and Gantt charts are provided, which together make it easy to create a suitable work plan for new projects that can be adjusted as new variables come into play. In addition, Workfront users can communicate through a combination of messages, meetings and post-it notes to ensure that everyone is on the same page.",
    "And those are just the core features. Workfront is also notable for the long list of third-party programs and services it is compatible with. There are full integration options for more than 15 different applications including Slack, G Suite, and Adobe Creative Crowd. These enable a range of new functions, such as assigning Workfront tasks directly from your email inbox.",
    "Things get even broader with Workfront Fusion. This serves as a digital bridge connecting your Workfront environment to over 150 different programs. You can use Workfront Fusion to create logic-based rules so that Workfront responds in real-time to changes in other business applications.",
    "If your organization regularly needs to produce high-quality digital or print content, you may find a use in the Workfront Library. Here, you can take control over your digital assets, e.g. logos and templates, and distribute them across your enterprise to anyone that needs access.",
    "The Workfront Library makes use of enterprise-grade search technology, allowing you to use content meta-data to find the assets quickly. Every individual requires access to different pieces of content, so Workfront allows them to customize their own library folders and mark content as ‘in-progress’ when it’s not ready for distribution.",
    "Everything begins with the Workfront Dashboard which individuals can customize with information like live project reports. From the dashboard, you can quickly navigate to other areas of Workfront, such as integration menus and Gantt charts.",
    "The Workfront looks a little old-school compared to other contemporary project management platforms. You’ll find plenty of grey elements, and pages sometimes contain so much information that there’s a risk first-time users could be overwhelmed by the complexity of the interface.",
    "However, once your team is trained on the Workfront interface, its function-over-form design will really start to provide benefits. Accessing important workflow management screens will take virtually no time as soon as you know where shortcuts are located.",
    "It’s also possible to manage tasks, review work requests and collaborate using Workfront’s Android and iOS apps. The Workfront mobile interface is streamlined and easy-to-navigate. Some users may even prefer it to the standard version as its sleek and intuitive design makes it easy to stay on task.",
    "When you subscribe, Workfront support staff will tailor your system to the goals and requirements of your organization. Workfront will also provide training materials to your staff through webinars and other educational material.",
    "When it comes to post-installation technical assistance, organizations signed up to Team or Pro plans are only able to make support requests during working hours, and it can take up to four hours for a response. Business and Enterprise users, on the other hand, can talk to Workfront staff around the clock and are guaranteed a one-hour response time to tickets.",
    "The marketplace for project management software is crowded, so there are plenty of alternatives to Workfront worth considering before you sign up. Zoho Projects, for example, is significantly cheaper than Workfront and has many of the same core features like Gantt charts and demand management tools. However, Workfront is more flexible than Zoho Projects when it comes to integrations with third-party applications.",
    "Workfront isn’t the cheapest project management platform, but for enterprise-scale organizations that need a powerful toolkit to manage workflow, there are few better options. If you already rely on a different business-critical application to manage some aspect of your operation, there’s a good chance that Workfront will be compatible thanks to its enormous number of third-party integration connectors."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "7": "Features",
    "10": "Workfront Fusion",
    "11": "Workfront Library",
    "13": "Interface and In Use",
    "17": "Support",
    "19": "The Competition",
    "20": "Final Verdict"
  },
  "links": {
    "project management software": "https://www.techradar.com/best/best-project-management-software"
  }
}