{
  "source": "https://www.techradar.com/reviews/gigabyte-aorus-m5-gaming-mouse",
  "title": "Gigabyte Aorus M5 Gaming Mouse review",
  "category": "computing",
  "updated": "2019-03-22T18:13:10Z",
  "author": "michelle-rae-uy",
  "summary": "Gaming mouse for the customization nuts",
  "verdict": "The Aorus M5’s construction feels a little flimsy, but its customization features, great ergonomics and fine performance make up for it in a big way.",
  "pros": [
    "Highly customizable",
    "Great ergonomics",
    "Fun RGB lighting"
  ],
  "cons": [
    "Construction feels a bit flimsy",
    "Price could be cheaper"
  ],
  "article": [
    "Mice might be the secret weapon of gaming and the Gigabyte Aorus M5 certainly proves its worth. It isn’t the most expensive gaming mouse on the market, but it’s hardly the cheapest either. And that, coupled with its slightly flimsy construction, may make some potential buyers hesitate.",
    "Yet make no mistake. When it comes to performance, the $69 / £59 / AU$79 Aorus M5 is a contender. This gaming mouse also touts a ton of features, as it should be given its price, and the majority of those are aimed directly at the needs of gamers. That includes everything from highly customizable RGB lighting to on-the-fly DPI switching and adjustable weights, making it very flexible and a good gaming mouse for enthusiasts of different styles, tastes and levels of comfort.",
    "We’re not convinced it’ll last you a lifetime, but you sure as heck will get a lot out of it. The fact that it’s pretty is just a bonus.",
    "We have mixed feelings about Gigabyte Aorus M5’s design. However, there are several things we do like about it so we’ll start with those.",
    "First of all, this gaming mouse is ergonomically crafted specifically for right-handed gamers (sorry, lefties) – decently-sized at 128mm x 72mm x 43mm, so that it’s good for big hands but not straining for small ones. The mouse’s body is tapered in the middle with rubber pads on both sides for added comfort and a better grip. There’s also a 5-slot weight distribution system so you can adjust its weight and balance according to your personal preference and comfort.",
    "The mouse also boasts a gamer’s look that’s not subtle, but not over-the-top either, with RGB lighting on both sides, around the wheel and on the logo. This RGB lighting is fully-customizable as well. That is, you can change the color, movement, speed of movement, and brightness of every bulb (10 on each side plus the logo and the wheel). For an even more immersive gaming experience, you can synchronize this lighting with those on your other RGB Fusion devices through the RGB Fusion app.",
    "The buttons are made with Japanese-made Omron switches that Gigabyte guarantees to have 50 million clicks on them, which means that these buttons will practically last a while. The left and right buttons feel especially solid yet comfortable. They also work well for both palm and claw play styles, although getting the mouse to click properly requires more pressure towards the back edges of the buttons.",
    "Additionally, there are two DPI buttons below the wheel, which at default allow you to switch between four DPI settings on-the-fly. Of course, these buttons and the wheel are fully customizable, so you can also personalize their functions using the Aorus Engine Software, which should help give you a gaming edge.",
    "Our issue is in its construction, which feels a little flimsy. The plastic palm rest and the bottom lid that hides the weight compartment seem like they’re made of cheaper plastic. In fact, our review unit came with a loose part – the magnet that holds the bottom lid in place came off and had to be glued back on. Plus, the mouse cable isn’t braided and feels like it could easily get frayed after many hours of gaming.",
    "With its $70 price tag, we would have expected Gigabyte to invest a little more on a sturdier build.",
    "What the Gigabyte Aorus M5 lacks in a more durable structure, it makes up for in features. Besides the gaming mouse’s fully customizable RGB lighting and buttons, it also offers a few other features that may help give users that gaming edge. These include its Weight Distribution System; Surface Life-Off Calibration; and On-the-Fly DPI adjustments – all of which we’ll discuss individually below – as well as capabilities for macros.",
    "The Aorus M5’s Weight Distribution System is made up of five 2.5-gram weights designed to fit snugly into five interior weight slots. The mouse starts out light at 118g and it lets you add weights, making it highly customizable based on what’s most comfortable to you. This reviewer added only one weight placed in the right-hand slot to and by making it a tiny bit more right side heavy, it was much more comfortable for us to use.",
    "To optimize its responsiveness based on your working surface, the Aorus M5 will let you calibrate the liftoff distance using the Aorus Engine Software. It’s neither a tricky process, nor as intimidating as the name may sound. You simply select your surface or mat type and then determine the liftoff tolerance with the scrollbar. It is worth noting, however, that we did not need to use this feature at all. The mouse worked beautifully out of the box without calibration.",
    "Within the same software, you can set four DPI adjustments or profile that you can access on-the-fly using the Aorus M5’s DPI buttons located below the wheel. Thanks to this gaming mouse’s maximum resolution setting of 16,000 DPI, there’s lots of flexibility with how sensitive you want the mouse and how quickly it moves.",
    "Each of these DPI profiles, therefore, can be set from very low to 16,000 DPI, even though there’s really never a reason to use the highest setting. Using the DPI buttons, you can easily switch profiles depending on whether you need a slower one for sniping to a 3,200 for playing a fast-paced FPS. These DPI profiles and buttons certainly come in handy, whether you’re an enthusiast or a pro gamer.",
    "With a maximum DPI of 16,000, a polling rate of 1,000Hz, and a decent liftoff distance, we expected the Aorus M5 to deliver an excellent performance, and we were not disappointed. This gaming mouse may have fallen short on its build, but as far as its performance, it may be worth every cent of that $70 price tag (though it’s still worth noting that there are cheaper mice out there that are equally impressive).",
    "We’ve tested this gaming mouse against some of the top AAA games out there including Assassin’s Creed: Odyssey, Far Cry 5, Call of Duty: WWII, and Hellblade: Senua’s Sacrifice, and it performed beautifully. It’s very responsive, and we had no issues with latency. The buttons were precise even though they had a fair amount of travel on them, and the movements were smooth. We even recorded a couple of macros for Assassin’s Creed: Odyssey, and the gaming mouse executed those without issue.",
    "As far as how it will perform after long-term gaming use, being subjected to hard presses and pounds, we cannot say for sure. However, the fact that its left and right buttons boast about 50 million clicks on them makes us hopeful that it can endure plenty of abuse from gaming without sacrificing performance.",
    "At $70, it’s easy to understand how some gamers might be reluctant to shell out the dough for a gaming mouse, especially considering that there are quite a few gaming mice out there that may perform just as well at a lower cost, not to mention that the Aorus M5’s build is a little dubious. We honestly cannot tell you how long this mouse will last when used for heavy gaming, it could go either way.",
    "However, it's fun and practical design, an extensive set of features, opportunities for customization and personalization, and excellent performance are more than enough reasons to consider it when you’re shopping around for one. And hey, if you’ve got the budget for it (and you’re right-handed), why the heck not?"
  ],
  "headers": {
    "3": "Design",
    "10": "Features",
    "15": "Performance",
    "18": "Final verdict"
  },
  "links": {}
}