{
  "source": "https://www.techradar.com/reviews/canon-rf-24-240mm-f4-63-is-usm",
  "title": "Canon RF 24-240mm f/4-6.3 IS USM review",
  "category": "cameras",
  "updated": "2019-09-24T16:03:34Z",
  "author": "matt-golowczynski",
  "summary": "An all-encompassing superzoom for EOS R-series adopters",
  "verdict": "As with most superzooms, you'll want to keep the various lens corrections enabled to iron out this Canon's optical shortcomings, but the core of the 24-240mm is solid: sharp images, very effective image stabilization and fast focus make it a winner.",
  "pros": [
    "Excellent zoom range for such a lens",
    "Smooth, silent and fast AF performance",
    "Very effective image stabilizer",
    "Very good sharpness at telephoto lengths"
  ],
  "cons": [
    "No weather resistance",
    "A little heavy (though this is a full-frame superzoom)",
    "Moderate distortion visible at both ends of the lens",
    "Somewhat expensive"
  ],
  "article": [
    "Canon's still-fresh EOS R system may have excited EOS DSLR users looking to switch to mirrorless technology, but the vast majority of lenses released for the system so far have been large and pricey L-series options, ones that will surely be out of the reach of many.",
    "The RF 24-240mm f/4-6.3 IS USM on test, however, is one of two more conventional, non-L-series options, the other being the Canon RF 35mm f/1.8 IS Macro STM. While it still commands a relatively high three-figure price, it's something of a rarity for an interchangeable-lens system optic in that it offers a 10x optical zoom range – and for the traveling photographer at which it's aimed, that USP may just be enough to persuade them to part with their cash.",
    "The lens has been designed with 21 elements spread across 15 groups, with two of these bearing ultra-low-dispersion properties and a further element having an aspheric surface. These should help to combat chromatic aberration, spherical aberration and corner softness, among other things.",
    "The maximum aperture of f/4-6.3 may not sound too impressive, but a wider aperture would likely compromise size and weight; and thanks to the integrated five-stop Image Stabilisation system you should still be able to get sharper images at slower shutter speeds when using the telephoto end of the lens, not to mention a more stable viewfinder/LCD image for more accurate composition.",
    "Focusing is handled by a \"near-silent\" Nano USM motor, which promises prompt and precise autofocus across stills and video, and you can manually override this with the focusing ring without having to switch to manual focus first.",
    "You can focus as close as 50cm from your subject at the wide-angle end, and 78cm away from it when you're at the telephoto end, which is perfectly respectable for such a lens. (Sony's FE 24-240mm, for example, has the same minimum focusing distance of 50cm at its wide-angle end, while it's 80cm at the telephoto end).",
    "The diaphragm only has seven blades, although Canon promises that it's round enough to deliver smooth bokeh. Other features include a locking function for the zoom ring to keep it in place, and a 72mm filter thread at the front for conventional screw-in filters. There's also a control ring around the barrel – more on that in a second.",
    "As with all RF lenses currently available, the barrel of the Canon RF 24-240mm f/4-6.3 IS USM is encircled by a control ring, the function of which can be customized to your preference. Four options are available: exposure compensation, shutter speed, aperture, and ISO, so there's no need to change the option of your choosing via the menus or body controls – you just rotate the ring instead.",
    "The ring is clickless, and so provides no feedback in use, although this does make it far more suitable for use during video recording. When used to adjust the aperture during recording, it can change it in 1/8-stop increments for particularly smooth exposure transitions. The control ring also serves as a manual focus ring, with a switch just behind it enabling you to change between focusing and your chosen custom mode.",
    "The control ring moves with ease, and just in front of it is a deep rubber zoom ring, which has a moderately coarse finish for good grip. While this isn't an L-series lens, everything feels very well put together; the barrel is largely polycarbonate, but the mount is metal, and the rings feel like they're very good quality. This isn't a lens that will fall apart any time soon.",
    "Considering that this lens is aimed at the traveling photographer, though, it's a shame that Canon is making no claims with regard to weather resistance. This isn't something Canon tends to include on its non-L-series optics, but at this kind of price some may expect it.",
    "Canon claims the RF 24-240mm f/4-6.3 IS USM offers near-silent autofocus; sure enough there's just the faintest whisper as the lens focuses, and it manages to move both speedily and smoothly as it works. Focusing transitions during video recording are speedy and discreet too.",
    "Sharpness is generally very good throughout the zoom range, although images tend to be softer at the wider end than at telephoto lengths, where things looks particularly rosy. You can appreciate the competence of the Image Stabilizer as you shoot, as it steadies the feed inside the viewfinder and LCD, and the five-stop promise means it ought to keep images sharp when shooting at shutter speeds as slow as around 1/8 sec at the telephoto extreme.",
    "We found that it was certainly possible to still end up with acceptably sharp images at this shutter speed, although not quite consistently. But it's still impressive to think that you can drop to around 1/10 sec or 1/13 sec at maximum telephoto and still have a good change of getting a sharp shot.",
    "A fair amount of vignetting is obvious at the telephoto end of the lens wide open, but this reduces as you stop down the lens, and can be easily removed using the in-camera correction. You can also enable correction of diffraction and (lateral) chromatic aberration through the camera's menus, and you can call on the Digital Lens Optimizer function, which attempts to counter distortions and anything that might compromise sharpness through the whole imaging pipeline.",
    "That just leaves distortion correction, which isn't available for the lens in-camera, although it seems that enough is being applied automatically to JPEGs in-camera anyway. That's just as well, as a fair amount of distortion can be seen at both ends of the lens in raw files, with enough at the wide-angle end for the inside of the barrel to be clearly visible.",
    "Lateral chromatic aberration is quite obvious at the wide-angle end, but again this is easily dealt with. Those processing raw files may have to manually remove some more stubborn purple fringing though.",
    "Any lens this ambitious is going to have a handful of optical aberrations for users to grapple with, and we see all the main culprits to some extent here. Still, the fact that these can largely be sorted through either automatic in-camera corrections or one-click software adjustments means they aren't quite the issues they may have been in the past – and any stronger correction through the optics would mean a compromise in terms of size, weight or cost – and perhaps all three.",
    "So, at least in terms of the optics, the Canon RF 24-240mm f/4-6.3 IS USM behaves much as we'd expect a superzoom of its kind to, and everything else is pretty sound; the focusing system is nice and nippy, and the stabilization very effective. It's also great to see nicely sharp results, particularly at the telephoto end, where many will no doubt be using such a lens with some frequency. It's far from perfect, but it's a welcome addition to the RF range all the same."
  ],
  "headers": {
    "2": "Features",
    "7": "Build quality and handling",
    "11": "Performance",
    "17": "Verdict"
  },
  "links": {
    "mirrorless": "https://www.techradar.com/news/best-mirrorless-camera",
    "Canon RF 35mm f/1.8 IS Macro STM": "https://www.techradar.com/reviews/canon-rf-35mm-f18-is-macro-stm-review"
  }
}