{
  "source": "https://www.techradar.com/reviews/nextgen-healthcare",
  "title": "NextGen Healthcare review",
  "category": "computing",
  "updated": "2019-11-25T20:00:56Z",
  "author": "jonas-p-demuro",
  "summary": "The cloud based EHR focused on ambulatory practices",
  "verdict": "NextGen Healthcare brings to the table features such as cloud storage, and integrated management tools to make it desirable for ambulatory practices of all sizes with its two tiers of offerings.",
  "pros": [
    "Choice of tiered plans",
    "Cloud based",
    "Integrated advanced analytics",
    "Configurable templates for notes"
  ],
  "cons": [
    "Limited support options after initial setup",
    "Opaque pricing",
    "Steep learning curve"
  ],
  "article": [
    "NextGen Healthcare offers an EHR focusing on the ambulatory market’s practices of all sizes. Their 2,900+ global employees serve over 155K providers, and claim 45 years in the market. In addition to clinical care, and financials, there is also a focus of this EHR on population health, and being a connected platform.",
    "Of note, NextGen Healthcare traces it roots back to MediTouch, another cloud based EHR. MediTouch was started by two family physicians from California back in 1998, and were acquired by NextGen Healthcare in 2016.",
    "NextGen Healthcare offers two plans. The NextGen Office is targeted more towards smaller practices with 1 to 10 providers, and is an all-in-one solution, which includes a cloud-based EHR platform, practice management, RCM/medical billing, and a patient portal.",
    "Larger practices will benefit from the higher tiered plan, NextGen Enterprise. It features clinical content that is specialty specific, an EHR that integrates with practice management, RCM and clearinghouse, electronic data exchange, and advanced analytics.",
    "Standard features that busy clinicians have come to expect are part of the package as well, including e-prescribing, charting in the EHR with options for handwriting and voice recognition, a patient self service portal, and note templates that are quite highly configurable. There is also support for electronic patient registration to streamline a busy office and free up staff, and of course it is HIPAA compliant. In addition, patient education is fully integrated, along with the documentation that it was provided.",
    "Specialty specific modules are also available across a wide variety of specialties. For example, for mental health, it works for compliance tracking, inpatient/residential focused practices, and appointment reminders with this often noncompliant population. While many EHR’s offer specialty specific modules for common areas of practice, like outpatient family medicine, it is a clear strength for NextGen to support specialized practices such as Tribal Medicine, GI Surgery, Corrections Medicine and Pain Management. In fact, this even extends into areas beyond strict medical practices including podiatry, dentistry and physical therapy. Having difficulty choosing the specialty of the practice? No problem either, as there is support for those challenging multispecialty practices as well.",
    "On the financial side, billing support includes code and charge entry, insurance verification, claims processing, and remittance advice. Collections are enhanced with features such as claims scrubbing to detect and eliminate medical billing errors for faster and cleaner claims, and dunning management to deal with declined credit card payments. Missed charges are minimized, with the patient’s office visits listed, making it simple to see if no charges have been entered for the encounter.",
    "Administrative functions are also provided on the backend of things as well. These include modules for both physician and patient scheduling, and options to schedule followup appointments. It is also flexible with support for multi-office practice situations, showing the value of a cloud based EHR to connect different locations. To provide business analytics, the NextGen Population Health and Analytics Solutions can integrate financial, clinical and patient derived data into actionable intelligence.",
    "Like any other product, no EHR is perfection, and there are some bumps and warts to this one as well. These include a graphical user interface that can have a steep learning curve after transition, can slow the office down for a while, and also requires lots of clicks for even mundane tasks. For example, to reschedule an appointment requires separate steps to both cancel the existing appointment, and then another workflow to schedule the new appointment, rather than a more direct pathway. Also with this interface, it requires an investment upfront of time and effort to customize the templates to the clinician’s preferences, although it does pay dividends down the road.",
    "Being cloud based, there are issues with speed (which we give the caveat that it is affected by the physician practices internet bandwidth speed), but still there are reports that the interface is downright slow. Users also encounter bugs, and then have delays in getting fixes for their problems. Compounding this, end users also complain about the frequent upgrades, and the requisite downtime with each one.",
    "There is no free trial, but there is an offer for a free demo. Like many other EHR platforms, there is no pricing available, which requires contact with the company for a custom quote. We would prefer some more transparency, and to have an idea of the components and options that makeup the pricing, at least for more standard installations.",
    "NextGen Healthcare is a SaaS, cloud connected EHR. Rather than being used only in a web browser, which it certainly can be used, we appreciate that the availability of software for both the Windows and Mac platforms. For those that want to use this product in their web browser, rest assured that it works with whatever your web browser of choice is. There are also available apps for both of the leading mobile platforms: iOS and Android.",
    "Training is offered via multiple methods at initial startup. These include in-person, live online, webinars, and via documentation. Predictably, the support options once you get up and running get pared back, and are limited to online support during business hours.",
    "NextGen Healthcare is an EHR platform which offers two tiers to better serve both smaller, and larger physician practices. The lack of upfront pricing, and limited support options after the initial setup are indeed significant drawbacks. On the other hand, pros include the cloud storage approach, option for installed software across all the major computer and mobile platforms, and integrated practice management tools. For busy outpatient, medical practices, NextGen Healthcare is a more than reasonable option."
  ],
  "headers": {
    "2": "Features",
    "8": "Drawbacks",
    "10": "Pricing",
    "11": "Support",
    "13": "Final verdict"
  },
  "links": {
    "NextGen Healthcare": "https://www.nextgen.com/",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}