{
  "source": "https://www.techradar.com/reviews/xbox-elite-wireless-controller-series-2-review",
  "title": "Xbox Elite Wireless Controller Series 2 review",
  "category": "gaming",
  "updated": "2019-11-06T15:11:14Z",
  "author": "vic-hood",
  "summary": "Premium pro",
  "verdict": "The Xbox Elite Wireless Controller Series 2 improves upon the quality-of-life issues of its predecessor, offering a durable, premium controller with plenty of customization options for you to try out. It's the best Xbox controller on the market - but it doesn't come cheap.",
  "pros": [
    "Interchangeable sticks",
    "Comfortable rubberized grip",
    "Shorter hair trigger locks",
    "More customization options",
    "Wireless charging",
    "Rechargeable (40 hours battery life)"
  ],
  "cons": [
    "Expensive",
    "Some may find it clunky"
  ],
  "article": [
    "The Xbox One family may be reaching the end of its lifecycle, but Microsoft's Xbox Elite Wireless Controller Series 2 may see us through to the next-generation Xbox Project Scarlett.",
    "The Xbox Elite Wireless Controller Series 2 is the successor to the Xbox Elite Wireless Controller, offering a number of improvements on its predecessor that make it the best Xbox controller on the market.",
    "But the best Xbox controller on the market doesn't come cheap, with a price tag of £159.99 / $179.99 / AU$249.95.",
    "So is the Xbox Elite Wireless Controller Series 2 worth its hefty price tag? Let's weigh up the pros and cons of Microsoft's latest premium game pad.",
    "When it comes to design, the Xbox Elite Wireless Controller Series 2 is sleek, comfortable and weighty.",
    "On opening the box, the Series 2 comes in a hefty carry case, with a wireless charger pack (that can also be wired), a USB-C cable and a variety of buttons.",
    "The controller itself is matte black, with rubberized grips covering both controller legs - unlike its successor, which only had this on the backs of the legs. On the front, there are the standard X, A, Y and B buttons, alongside the standard Xbox, share and menu buttons - and a profile button that we will come back to. The beauty of the Series 2, however, is that there are also changeable analog sticks and D-pad buttons that you can simply pop off and replace magnetically with any of the buttons included with the controller.",
    "You get a set of six thumbsticks including two standard, two classic, one tall and one white dome. In addition, there's a set of four paddles, including two medium and two mini, and a set of two D-pads: standard and faceted.",
    "The tension of the analog sticks can also be adjusted, using a little screwdriver. There are three settings available, with each increasing the tightness of the sticks.",
    "You can essentially change these buttons and sticks as you see fit, to create the most comfortable gaming experience for you.",
    "At the rear of the controller are four silver paddles - two on each side - and two switches which allow you to adjust the controller's hair trigger locks. The trigger switches have three settings, with each further restricting the amount of give when it comes to pulling the trigger buttons.",
    "Speaking of the trigger buttons, they're silver and on the top of the controller (as is expected) alongside the LB and RB buttons, a Bluetooth connection button and a USB-C port. The Series 2 can connect to both an Xbox One and PC.",
    "Finally, the bottom of the controller has an audio jack and a port for the Xbox One Stereo Headset Adapter.",
    "The most welcome change to the Series 2's design is its built-in battery - a feature its predecessor didn't have. The battery lasts up to 40 hours and is rechargeable via the wireless charging dock or by connecting the controller to a power source using the USB-C.",
    "Alongside its premium features, the Series 2 also feels premium, weighing in at 345g. However, while we preferred this heavier, chunkier game pad, there were some in TechRadar HQ who found it too clunky.",
    "Where the Xbox Elite Wireless Controller Series 2 really shines is in its software and performance improvements. The Series 2 provides you with more customization options then ever, but this time it goes right down to system level.",
    "You can still customize the controller's button mapping through the Xbox Accessories app (which is much more refined nowadays and you need to download it separately), which allows you to configure everything from stick sensitivity to vibration and brightness. You can even set a button to be your 'shift' key, so other buttons can have more than one use.",
    "But the most important aspect of this is setting up uses for your new paddles. We preferred assigning them to the X, A, Y and B buttons to avoid having to move our hands from the standard controller position.",
    "If you can't decide on just one set-up then don't fret, you can save up to three custom profiles - and one default profile - on the controller and then switch between them using the aforementioned profile button on the front of the pad.",
    "Button mapping can also be used to act as shortcuts for system actions such as recording gameplay, taking screenshots or seeing achievements. It's worth noting, though, that this feature isn't currently available on PC.",
    "If you're not going to be using button mapping, then we wouldn't advise picking up the Xbox Elite Wireless Controller Series 2, as that's the main draw of the game pad. For some players, too many options can be overwhelming and unnecessary, but if you want more control over how you play then you can really improve your gaming experience. You just have to work out a button layout that suits you first. In terms of general controller performance, we found the Series 2 to have excellent response times. The weightier feel and adjustable stick and trigger tensions also allows for tighter performance - which is critical when it comes to face-paced online titles.",
    "It takes some time to play around with the various customization options - both in terms of software and hardware - to find what works for you but, when you do, there's no denying this is one of the best (if not the best) Xbox controller on the market.",
    "Xbox Elite Wireless Controller Series 2 is worth its price tag - as long as you're going to use the customization features it brings to the table. This premium game pad looks and feels like the ultimate Xbox controller, with Microsoft aiming for the peripheral to work on its next generation hardware as well as the Xbox One and PC.",
    "It might take a little while to get your head around everything the Series 2 has to offer, but once you work out exactly how you like to play, it will give you the best Xbox game experience available."
  ],
  "headers": {
    "4": "Design",
    "15": "Performance and Xbox Accessories App",
    "22": "Verdict"
  },
  "links": {
    "Xbox Project Scarlett": "https://www.techradar.com/reviews/arvostelussa-xbox-series-x",
    "Xbox Elite Wireless Controller": "https://www.techradar.com/reviews/gaming/gaming-accessories/xbox-elite-wireless-controller-1297031/review"
  }
}