{
  "source": "https://www.techradar.com/reviews/hisense-dual-cell-uled-hz65u9e-tv",
  "title": "Hands on: Hisense Dual Cell ULED HZ65U9E TV review",
  "category": "televisions",
  "updated": "2019-09-07T09:18:37Z",
  "author": "john-archer",
  "summary": "Breathing new life into the LCD format",
  "verdict": "An impressive attempt from Hisense to shake up the LCD space, here's hoping its eventual pricing is as attractive as its looks.",
  "pros": [
    "Raises the bar for LCD",
    "Impressive black levels",
    "Superb color reproduction"
  ],
  "cons": [
    "Can't beat Panasonic's MegaCon for local dimming."
  ],
  "article": [
    "Dual cell LCD TVs are like buses, it seems. You wait for literally ever for one, and then three come along at once.",
    "The first such model to surface at the IFA 2019 technology show in Berlin was the fabulously named Panasonic MegaCon. Hisense has also entered the dual cell LCD fray, though, with not one but two new models - one of which even applies the technology to an 8K rather than a 4K screen.",
    "Hisense has yet to share pricing or availability of its 2019 DualCell TV. We'll be sure to update here once it's been announced.",
    "The idea behind dual cell/panel LCD TVs is that they use a monochrome filtering layer to feed light to the front RGB color layer with much more precision than you can get with any conventional LCD backlighting design. In fact, in the case of the MegaCon, Panasonic has managed to feed every single pixel in its 4K screen its own light source.",
    "Hisense’s Dual Cell ULED XD TVs don’t take the concept as far as that. The HZ65U9E ULEX XD dual cell 4K TV Hisense was highlighting at IFA uses a 1080p greyscale light filter panel, and so only delivers 1,000,000 local dimming zones to the TV’s 4K RGB screen - along with a claimed contrast ratio of 150,000:1. Whereas the MegaCon provides basically 4K dimming zones (essentially rendering the idea of dimming zones redundant) and a contrast ratio of 1,000,000:1.",
    "Using the word ‘only’ when describing the Hisense’s specifications is pretty unfair, though. After all, they massively outgun the specs of rival mainstream LCD TVs. And while we don’t yet know final pricing on the HZ65U9E, I suspect that when Hisense launches this TV (likely in 2020) it will be aiming for a price not too far removed from the sort of thing you’d expect to see attached to a high-end regular LCD or OLED TV. The Panasonic MegaCon is likely to cost tends of thousands by comparison.",
    "The HZ65U9E is also designed to look good in a living room, with a crisp metallic finish for both its frame and the front-firing speaker system that runs the width of its bottom edge. The fat-bottomed MegaCon, by comparison, can charitably be described as boasting a design only its mother could love.",
    "Inevitably the 65-inch HZ65U9E does not appear (from what we could see at IFA) to get close to the performance of the MegaCon. What it looks like it could do, though, is rewrite our expectations of what consumer LCD TVs are capable of.",
    "To give some sort of context for the HZ65U9E’s capabilities, Hisense was running it alongside one of its H65B7500 LCD TVs, which uses a much more typical LED backlight system based on just a few local dimming zones. And the difference between the two with the same test material was phenomenal.",
    "Black levels, most predictably, were in a different league. Blacks look black, with scarcely any grey tint - even when a very bright object appears against an essentially uniform black backdrop. What’s more, the screen seems to be using a highly effective anti-reflection filter, preserving the black level impact even under the harsh IFA lights.",
    "There’s no sign, either, of the shifting black levels you tend to see with even the best normal local dimming LED TVs when they have to show moving bright objects against a dark background.",
    "Nor is there much backlight ‘blooming’ around stand-out bright objects. Despite the fact that these bright objects are delivered with an intensity that suggests Hisense isn’t having to compromise their brightness at all in order to preserve the inky blackness around them.",
    "In this respect in particular, the HZ65U9E’s dual cell technology highlights the limitations of even the most sophisticated standard direct backlighting/local dimming engines (such as the ones found in Samsung’s 2019 flagship Q90R TVs), where small areas of bright light sometimes have to be dimmed quite dramatically to keep backlight blooming in check.",
    "To be clear, the HZ65U9E isn’t completely free of blooming. Even under the IFA lights I could see a very faint, narrow outline of extra light around, for instance, the brightly lit hands and face of a dancer performing against a black backdrop. But both the extent and intensity of this blooming were remarkably small given how extreme the content was.",
    "The HZ65U9E crushes the standard LCD running beside it when it comes to color performance, too. A combination of a wide colour gamut and the Dual Cell screen’s ability to push just the right amount of light to the right parts of the screen achieves colors of spectacular pop and vibrancy. It’s not just in the aggressively stark sections of the demo footage where this color performance makes itself felt, either. Even relatively neutral, balanced, real-world images enjoy a much more dynamic, three-dimensional, and life-like appearance on the HZ65U9E.",
    "As if all this wasn’t already impressive enough, the extra light control made possible by the HZ65U9E also improves how detailed and sharp the 4K content looks, by providing more definition to the light differences between pixels.",
    "I did spot a few potential issues during my time in front of the HZ65U9E. Some dark parts of the picture could lose shadow detail compared with the standard LCD TV. There was also a little color striping with HDR content, and some occasional obvious delayed ‘jumps’ in the image’s overall brightness as the TV cut abruptly from dark to light scenes. This TV is still a good few months from launch, though, so there’s plenty of time for Hisense to fine tune things.",
    "While the HZ65U9E looks extremely promising, the brand new 8K dual cell model Hisense was showing at IFA seems to be more of a work in progress. The basic elements are still there: Contrast was massively superior to a standard 8K LED model elsewhere on Hisense’s stand; colors were bolder; the image was brighter; and the 75-inch screen delivered the extra clarity and detail that you’d hope to see from an 8K screen.",
    "Or at least it did in places. It seemed to me that some parts of the screen didn’t look quite as crisp as others. I could also see more jaggedness around curved edges and (if I got up close) more visible pixel structure in the white Hisense logo than I could see on the 4K set. All of which makes me wonder if Hisense hasn’t yet been able to align the 1080p monochrome layer with the 8K RGB layer as well as it has with the 4K screen.",
    "There were also some visible vertical shadowy lines around an inch apart running down the picture, and the color tuning didn’t look quite right, with a tinge of yellow creeping into things.",
    "While there’s clearly more for Hisense to do to get the 8K dual cell TV ready for market, though, if the apparent quality of the 4K model is anything to go by, you’ve got to hope that Hisense will get there in the end.",
    "At IFA 2019 Hisense has made a great claim for the future of LCD TVs. We'll be keen to see how it builds on this impressive opening come the time of our final review.",
    "IFA 2019 is Europe's biggest tech show, and the TechRadar team is in Berlin to bring you all the breaking news and hands-on first impressions of new TVs, phones, laptops, wearables and other devices as they're announced."
  ],
  "headers": {
    "2": "Pricing and availability",
    "3": "Design",
    "7": "Performance",
    "20": "Early verdict"
  },
  "links": {
    "IFA 2019": "https://www.techradar.com/news/ifa-2019-news",
    "Panasonic MegaCon": "https://www.techradar.com/news/panasonic-megacon-tv-first-look",
    "IFA 2019 is Europe's biggest tech show, and the TechRadar team is in Berlin to bring you all the breaking news and hands-on first impressions of new TVs, phones, laptops, wearables and other devices as they're announced.": "https://www.techradar.com/news/ifa-2019-news"
  }
}