{
  "source": "https://www.techradar.com/reviews/sony-wi-1000xm2-wireless-headphones",
  "title": "Hands on: Sony WI-1000XM2 wireless headphones review",
  "category": "audio-visual",
  "updated": "2020-01-07T16:52:32Z",
  "author": "olivia-tambini",
  "summary": "Noise-cancelation comes with a neckband",
  "verdict": "Sony's new noise-canceling neckband earphones look like another impressive addition to this line of big-hitting buds.",
  "pros": [
    "Excellent noise cancelation",
    "Great sound quality",
    "Comfortable and light"
  ],
  "cons": [
    "Design is a little boring"
  ],
  "article": [
    "Sony is well known for its immensely successful noise-canceling headphones, and the brand is hoping for another win with its new WI-1000XM2 wireless neckband earbuds.",
    "The new headphones build on the class-leading design of their predecessors, packing in an updated noise -cancelation processor – the same one that's used in our all-time favorite true wireless earbuds, the Sony WF-1000XM3s.",
    "We took the new earphones for a brief spin at IFA 2019 in Berlin – read on for our initial thoughts.",
    "The Sony WI-1000XM3 wireless headphones won't be available until January 2020, but we know they'll cost £300 in the UK, which works out at around $370 / AU$540.",
    "We're still waiting on an official release date and global pricing, but they're certainly not cheap; in fact, they're more expensive than the class-leading Sony WF-1000XM3 true wireless earbuds, which cost around $230 / £220 / AU$400.",
    "There's one word that springs to mind when we look at these headphones: utilitarian. They're very beige, with a matte finish that does away with the shiny hardware you find on a lot of headphones these days.",
    "One one side of the neckband are playback controls for your music, which we found worked well during our brief time testing the new wireless earbuds.",
    "As for the earbuds themselves, Sony says the WI-1000XM2's angled earphone design ensures a tight seal against the ear canal, and means the earbuds sit \"deeply within the ear\".",
    "They certainly felt very comfortable when we tested them, although you'll probably need to try a few different ear tip sizes before you find the perfect fit – and that fit is crucial in achieving the kind of seal needed for optimal noise cancelation.",
    "Overall, they felt very light to wear, and we could see ourselves comfortably wearing them for long periods of time. The functional aesthetic may not appeal to all, but for those who like a dose of minimalism with their music, the design will probably appeal immensely.",
    "The battery life of the WI-1000XM3 wireless headphones comes in at 10 hours, which isn't an improvement on their predecessors.",
    "There's also quick charging, which can give you 80 minutes of playback from a 10-minute charge – handy for commuters who might only have a little bit of time to top up their buds.",
    "Thanks to Sony's HD Noise Cancelling Processor QN1, which is also found in the industry-leading WH-1000XM3 over-ear headphones, these earbuds are better than ever at blocking out annoying environmental sounds.",
    "When tested them in a bustling exhibition hall we were struck by just how much noise they managed to cancel out, leaving us in blissful solitude even amongst hundreds of chattering people.",
    "Sony says these earphones are capable of cutting out even the most pervasive sounds, like the ambient noise within an aircraft cabin, making them ideal for anyone who travels a lot.",
    "Despite only having a short time with the WI-1000XM2 earbuds, we were impressed by the sound quality they offer.",
    "Listening to Blink 182's Blame It On My Youth, we experienced a wide, open soundstage, and fantastic separation between the frequencies. Wailing guitars cut through the mix, while distorted drums crunched below in tandem with cascading bass lines.",
    "Meanwhile, the vocals were crystal clear, sitting at the very front of the mix and coming through with clarity and power.",
    "This is thanks to a hybrid driver system, comprising a 9mm dynamic driver and a balanced armature driver, which create wide-range frequencies and defined, accurate playback.",
    "As well as enabling the noise cancelation feature, that processor chip we mentioned earlier also features \"32-bit audio signal processing, high quality digital to analogue conversion, and headphone amplifier\", all built-in.",
    "There's also a Digital Sound Enhancement Engine, which upscales your compressed MP3 files – and while that won't get you perfect lossless audio, Sony says it does bring you \"closer\" to the quality of High Resolution Audio.",
    "While we'll need to do more thorough tests before we can give a definitive verdict on the Sony WI-1000XM3 earbuds, we're impressed by what we've seen – and heard – so far.",
    "Noise cancelation is excellent, and the sound quality on offer appears to be very good indeed – battery life could be better, though.",
    "These earbuds feel comfortable, and their lightweight build makes them suitable for commuters, although not everyone will appreciate the minimalist design.",
    "They're undeniably pricey too, but if they're as good as the Sony WF-1000XM3 true wireless earbuds they could be well worth the money.",
    "IFA 2019 is Europe's biggest tech show, and the TechRadar team is in Berlin to bring you all the breaking news and hands-on first impressions of new TVs, phones, laptops, wearables and other devices as they're announced."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "10": "Battery life and noise cancelation",
    "15": "Sound performance",
    "21": "Verdict"
  },
  "links": {
    "true wireless earbuds": "best%20true%20wireless%20earbuds",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "IFA 2019": "https://www.techradar.com/news/ifa-2019-news",
    "WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "High Resolution Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Sony WF-1000XM3 true wireless earbuds": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "IFA 2019 is Europe's biggest tech show, and the TechRadar team is in Berlin to bring you all the breaking news and hands-on first impressions of new TVs, phones, laptops, wearables and other devices as they're announced.": "https://www.techradar.com/news/ifa-2019-news"
  }
}