{
  "source": "https://www.techradar.com/reviews/huawei-matebook-d-2018",
  "title": "Huawei MateBook D (2018) review",
  "category": "computing",
  "updated": "2019-06-14T17:26:54Z",
  "author": "jason-cipriani",
  "summary": "Proof that Huawei knows laptops",
  "verdict": "The Huawei MateBook D delivers strong performance and doesn't cost a fortune. In other words, it's a solid option for those on a budget.",
  "pros": [
    "Strong performance",
    "Joyous keyboard"
  ],
  "cons": [
    "You'll need a mouse",
    "Display needs brightness boost"
  ],
  "article": [
    "The Huawei MateBook D is a budget-friendly laptop that ditches the typical Intel approach, opting instead for AMD silicon for processing (CPU) and graphics (GPU). On paper, it looks like a legitimate laptop for a student or someone who only needs to complete basic computing tasks.",
    "The MateBook D looks similar to Huawei's more expensive and better equipped MateBook X Pro and MateBook 13, but for less than half the overall cost of either.",
    "It more closely competes with the likes of Acer's Swift 3 or Dell's Inspiron 15 5000. All three laptops are designed and priced for those who need a laptop but don't want to spend a fortune or who don't need a workhorse of a machine.",
    "The MateBook D we received is currently priced at $529 in the US or £559 in the UK. We were unable to find a model for potential Australian users, with Huawei's website only listing the MateBook X Pro and the MateBook 13.",
    "Listings across all of Huawei's sites – in the US and UK – don't offer any customization options for the MateBook D; however, NewEgg does. Specifically, you can opt for an Intel Core i5 or i7 processor, bump up the screen size to 15.6-inches, and double the memory to 16GB, with the price topping out at $999 (about £767, AU$849).",
    "If you're absolutely stuck on getting a Huawei laptop, you'll need to up your budget and give the MateBook 13 or MateBook X Pro a hard look. Also, definitely consider the state of Huawei laptops in the US in the wake of Huawei’s souring relationship with the US government.",
    "The MateBook D listed here is competitively priced with the entry-level Swift 3 that comes with an Intel Core i3, and the Inspiron 15 5000 with an Intel Core i5.",
    "Let's get this out of the way right now: yes, it looks every bit like a MacBook. From the silver housing to the black keyboard and the trackpad's slightly different shade of silver, the MateBook D has the Apple look. It lacks the fit and finish that a MacBook has, but that's to be expected at this price.",
    "Overall, the MateBook D measures 12.72 x 8.7 x 0.62 inches and weighs 3.51 pounds. It's small enough to tuck into your bag and barely notice, but yet it doesn't feel small when it's on a desk or in your lap. Comparatively, the Swift 3 weighs 3.53 pounds and the Dell Inspiron 15 5000 weighs a whopping 4.4 pounds – granted, you get a 15.6-inch display with the Dell.",
    "Flanking each side of the keyboard are the speakers. The sound quality is OK, a bit shallow for our liking, but will do a good enough job for streaming music or watching YouTube videos.",
    "The top function row of the keyboard has a series of shortcuts on it for common tasks like adjusting volume, brightness or disabling Wi-Fi.",
    "The bezels surrounding the display are thick compared to other MateBook models, but they don't look out of place with the 14-inch touch display. The touchscreen is responsive and comes in handy, especially when you consider our experience with the trackpad.",
    "One issue we have with this laptop is the display's 250 nits of brightness. It's just not enough. On multiple occasions, we found ourselves mashing the brightness up button, only to realize that it was already maxed out.",
    "On the right side of the MateBook D is where you'll find a headphone jack and a USB port. On the left side is a USB-C port, which doubles as the charging port, another USB port, and an HDMI port.",
    "The MateBook D has one USB 3.0 and one USB 2.0 port, but they're unmarked on the housing. We looked at several product listings, all of which failed to identify which port is where – this is something that Huawei should make clearer for its customers.",
    "The MateBook D's trackpad is fine for quick tasks like opening an app, but for tasks that require more precision, such as organizing folders, you'll want a mouse. The trackpad consistently quits tracking our fingers as we move across it. We’ve also experienced random instances when a right-click would register despite only one finger on the trackpad (and we aren’t anywhere near the bottom-right corner of the pad).",
    "The keyboard makes up for the lack of a quality trackpad. We absolutely loved typing on the MateBook D.",
    "The keys have a clickety-clack feel, but without being too loud and obnoxious. There was almost no adjustment period as usually is the case with a new keyboard.",
    "As a mid-range laptop, the MateBook D's benchmark performance is impressive. Compare the scores to the Acer Swift 3, and the MateBook D nearly sweeps the entire test lineup.",
    "The MateBook D more than doubled the Swift 3's performance on 3DMark's Sky Diver, with a result of 7,622 compared to 3,774.",
    "The same can be said for the rest of the Swift 3's 3DMark scores when you put them up against the MateBook D's results.",
    "Not only does the MateBook D feel as if it can handle common tasks with ease, the benchmarks back it up.",
    "Huawei doesn't call out the expected battery life of the MateBook D on its website, but the listing on NewEgg mentions seven hours in passing. Based off of that, we can say the MateBook D nearly lives up to expectations.",
    "The MateBook D lasted for 4 hours and 3 minutes in PCMark 8 battery life test, and 5 hours and 34 minutes in our movie test. But, outside of the benchmark tests, our use showed the battery is capable of nearly powering through a work day.",
    "In comparison, Acer's Swift 3 powered through eight hours of video in TechRadar's movie test.",
    "The Huawei MateBook D offers an alternative brand and approach to those who are growing tired of the staples that have dominated the laptop landscape for years.",
    "Regardless of its status in the US at the time of writing, Huawei produces solid products, and the MateBook D is no exception.",
    "Outside of the disappointing trackpad and not-bright-enough display, we really can't find much to fault with the MateBook D. If you're looking for a Windows laptop and you don't have a huge budget, spend some time looking over the MateBook D – it may just surprise you the same way it did us.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "18": "Performance",
    "22": "Battery life",
    "25": "Final verdict"
  },
  "links": {
    "Acer's Swift 3": "https://www.techradar.com/reviews/acer-swift-3-2020",
    "Dell's Inspiron 15 5000": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-inspiron-15-5000-1297284/review",
    "£559 in the UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FHuawei-Matebook-14-Inch-Laptop-Processor%2Fdp%2FB07KV9J1PG%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1361311262443866000-21",
    "MateBook 13": "https://www.techradar.com/reviews/huawei-matebook-13",
    "MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2019"
  }
}