{
  "source": "https://www.techradar.com/reviews/fujitsu-lifebook-u939x-2-in-1-convertible-business-laptop",
  "title": "Fujitsu Lifebook U939X 2-in-1 convertible business laptop review",
  "category": "computing",
  "updated": "2019-07-22T19:19:11Z",
  "author": "desire-athow",
  "summary": "The world’s lightest convertible 13-inch laptop has landed",
  "verdict": "The Fujitsu Lifebook U939X is one of the best business laptops on the market and should top your list if you are looking for a sub-1Kg device that can turn into a tablet.",
  "pros": [
    "Plenty of ports",
    "Absurdly light",
    "Docked stylus",
    "Good battery life"
  ],
  "cons": [
    "Expensive",
    "Some flex on the keyboard and screen",
    "No privacy shutter",
    "Noisy at times",
    "Bloatware"
  ],
  "article": [
    "Japanese PC vendors are experts at the art of packing as much firepower into as small a space as possible. After all, it was the Japanese Bento box that gave IBM the inspiration for the now legendary ThinkPad. The plethora of brands of the 1990s has almost vanished though; Panasonic and Fujitsu are the only ones remaining with the likes of NEC (Lenovo), Vaio (Sony) and Toshiba (now Dynabook owned by Sharp/Foxconn). Fujitsu sent us the Lifebook U939X convertible laptop which is one of their flagship notebooks that target enterprise and business markets.",
    "It would be an understatement to say that the Fujitsu Lifebook U939X is light. At 1000g, it is positively featherweight and Fujitsu claims that it is the world’s lightest convertible 13-inch laptop; at 777g, the Japanese variant is even lighter but comes with a smaller battery. This, we believe, was the right choice.",
    "It’s about the size of an A4 sheet (309.3 x 213.5 x 15.5 mm) and somehow manages to pack thrice the number of ports of a similar-sized Apple MacBook Air. There’s a dedicated power plug, two Type-A USB ports, two Type-C USB ports, a full-sized HDMI (1.4 rather than 2.0), a pull out Gigabit Ethernet port, a smart card slot, an SD card slot and a SIM card slot. The Fujitsu Lifebook U939X appears to have more tricks up its sleeve than your average magician.",
    "But that’s not all; the passive stylus pen is docked, the keyboard is spill-proof and there’s a palm vein reader (rather than your usual fingerprint one. To say that this laptop is jam-packed would be a fair description of reality.",
    "Available in bright red or in black and is housed in a magnesium alloy chassis, the 939X has two hinges that allow the screen to pivot 360 degrees to transform into a tablet. There’s a camera built into the keyboard surface so that in tablet mode the user can take photos while looking at the screen. In addition, there is a dedicated button that activates Windows 10's \"Quick Note Taking\" pen function, enabling pen input as soon as you press the button.",
    "The components are cooled actively and air vents can be found at the rear of the laptop. The bottom is secured with about a dozen screws that can be removed to access the inside of the laptop. None of the parts are serviceable except for the SSD. The AC adapter is a traditional brick model delivering 90W of usable power.",
    "The pace of evolution of processors has slowed down to the point that Fujitsu now ships multiple CPU models from two different generations. The Intel Core i5-8265U is offered alongside the newer 8365U (fitted in this laptop) and the 8665U CPUs; they are all four-core models with various base/turbo clock speeds and amounts of cache.",
    "Storage consists of two 4GB LPDDR3 2133 MHz memory modules soldered to the motherboard in dual channel configuration and a 256GB Samsung PM981 M.2 PCIe SSD. The other specs include a pair of side-firing speakers, Windows 10 Pro (which can be downgraded to Windows 10 Home), Intel Wireless-AC9560 802.11ac Wi-Fi module with integrated Bluetooth 5.0, the screen is a 13.3-inch LED backlight Full HD IPS model with anti-glare with a rated 800:1 contrast ratio and 300cd/m^2 brightness.",
    "A 4-cell 50Whr battery, the biggest we’ve seen on a sub-1Kg laptop, powers the U939X.",
    "The Lifebook U939X delivered a very solid set of numbers on our benchmark tests with the CPU delivering far higher numbers that we’d expect in CPU-Z. Ditto for the storage subsystem which is not too shabby for a single drive.",
    "There was a bit of flex on the keyboard and on the screen; Magnesium alloy is a light and relatively sturdy material but it is no match for denser but heavier ones like aluminum. As long as you are not an aggressive typer, the U939X should be able to withstand long typing sessions.",
    "The keyboard is not spill proof; the keys are generously proportioned. Touch typists will appreciate the big shift keys and the oversized enter and backspace ones. The keys themselves have a softer bounce, good travel, excellent feedback and are not as noisy as other competitors.",
    "The touchpad was a pleasant surprise with two physical mouse buttons that did not require much force to register an action and an active surface that was responsive albeit a tad smaller that we’d wish.",
    "The four rubber feet on the base of the U939X are almost flush with the bottom making it problematic for cooling. Fortunately, opening the lid at an obtuse angle elevates the rear of the laptop which enables better air circulation.",
    "As for the screen, it comes with an anti-glare non-removable film that makes the display less reflective. The colours therefore appear more muted, less lively due to the reduced contrast. While that is perfectly reasonable in an office environment, some users might prefer to have brighter colours that pop out.",
    "Speaking of pop out, the LAN port has to be delicately pulled out to be ready for use. It does seem to be a bit flexible so do be careful. The battery life of the U939X reached 6h40m under our mildly taxing 10 hour count up Youtube video. That’s just a bit less than the HP Elitebook 1040 G5 (6h50m) which has a far bigger battery.",
    "One last point about bundled software; Fujitsu saw it appropriate to bundle McAfee Livesafe with the laptop, a software that likes to nag the user to force a purchase. Also slightly puzzling is the inclusion of Cyberlink suite of consumer-focused software.",
    "Let’s start with the HP Elitebook x360 1030 G3. There’s no bundled pen - you have to buy your own rechargeable HP Active Pen - and it comes with the older Core i7-8550U plus it is significantly bulkier, heavier and at $1,999, more expensive. On the flip side, it has two SODIMM slots and a spill resistant keyboard.",
    "At $1,899, the Dell Latitude 7400 is the most formidable rival to the U939X. Armed with the latest Intel Core i7-8665U with 16GB of RAM (DDR3/DDR4) and 256GB PCIe NVMe Class 40 solid state drive, it packs a 14-inch display in a 13-inch chassis. There’s also a three-year warranty, NFC and an optional active pen. Not surprisingly, It is also the heaviest of the lot.",
    "The ThinkPad X390 Yoga by Lenovo is by far the cheapest of the competitors; it does come with a docked ThinkPad Pro stylus, an Intel Core i7-8565U CPU, 256GB SSD and three year international warranty, all for $1,546 at the time of writing. At 1.29Kg, it is also the lightest of the competitors, albeit still far heavier than the U939X.",
    "Dynabook doesn’t have a recently-launched convertible but they have recently launched Portégé X30T which is a detachable 2-in-1 laptop that comes with its own set of compromises.",
    "The Fujitsu Lifebook U939X can be sourced for as little as $1395 at the time of writing with a one-year warranty (two-years Collect and Repair for countries within EMEIA). Matching the competition’s specs (three year warranty, Core i7, 16GB RAM, without palm vein reader), brings the price to a less palatable $2,474. That’s a near $1,000 premium over the Lenovo Yoga.",
    "All in all, the U939X pushes the boundaries of what is achievable on a business laptop, let alone a convertible one, further than ever before. The extreme minutiae Fujitsu showcased for the design of this laptop is exceptional, even more so when you appreciate its lightness which at 300g is about 20% less than its heaviest competitor.",
    "It has plenty of ports, comes with international warranty (in certain regions), two cameras, a big battery, the Fujitsu pedigree, an optional privacy filter and the biggest battery we’ve seen in this category. Only a few niggles cloud this otherwise excellent laptop; it can be noisy at times and has some bloatware."
  ],
  "headers": {
    "1": "Design",
    "6": "Hardware",
    "9": "In use",
    "17": "The competition",
    "21": "Business verdict"
  },
  "links": {
    "Japanese Bento box": "https://www.techradar.com/news/the-thinkpad-at-25-designing-an-icon",
    "Apple MacBook Air": "https://www.techradar.com/reviews/macbook-air-review",
    "HP Elitebook 1040 G5": "https://www.techradar.com/reviews/hp-elitebook-x360-1040-g5-2-in-1-convertible-business-laptop",
    "HP Elitebook x360 1030 G3": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-6546788410986661000&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2Fpdp%2Fhp-elitebook-x360-1030-g3-notebook-pc-p-4tb96ut-aba-1",
    "Dell Latitude 7400": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6754764380817885000/https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/latitude-7400-2-in-1/spd/latitude-14-7400-2-in-1-laptop/S0374002N1US",
    "ThinkPad X390 Yoga": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-6095558212533710000&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Flaptops%2Fthinkpad%2Fthinkpad-x%2FThinkPad-X390-Yoga%2Fp%2F20NNCTO1WWENUS0",
    "Portégé X30T": "http://www.toshiba.co.uk/laptops/product-filter/?sFamily=portege-x&sSeries=portege-x30t-e",
    "Fujitsu Lifebook U939X": "https://www.provantage.com/fujitsu-xbuy-u939x-r01~7FUJD1JQ.htm"
  }
}