{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-fit-review",
  "title": "Samsung Galaxy Fit review",
  "category": "wearables",
  "updated": "2019-07-05T15:22:26Z",
  "author": "andrew-williams",
  "summary": "Not quite fit enough",
  "verdict": "The Samsung Galaxy Fit is accessible and easy to live with, but poor distance readings and basic tracking see it fall behind the best.",
  "pros": [
    "Color screen with solid brightness",
    "Good battery life",
    "Includes a heart rate monitor"
  ],
  "cons": [
    "Fiddly strap",
    "Bad distance tracking",
    "No GPS or connected GPS"
  ],
  "article": [
    "The Samsung Galaxy Fit is part of a new range of Fitbit-style wearables. There’s this Fit, and the cheaper Galaxy Fit E, which loses the touchscreen, the color display, and some of the fitness tracking features.",
    "Here, we’re looking at the pricier version. The Samsung Galaxy Fit costs $99 /£89 (around AU$145). It doesn’t have GPS but does have auto activity tracking and modes for a bunch of different exercise types, as well as smartwatch-style notifications.",
    "At this price the Fitbit Inspire HR and Huawei Band 3 Pro are two of the top alternatives. That’s bad news for Samsung, as both are stronger.",
    "The Samsung Galaxy Fit does not have connected GPS (where the band uses your phone’s GPS) and its distance tracking is dismal at launch. Until Samsung fixes that, you can get much better trackers for your money. That said, there are some good points to the Galaxy Fit.",
    "Samsung has made more advanced entry-level fitness trackers than the Galaxy Fit in the past. The Gear Fit from 2014 had a color screen that curved all the way around its front.",
    "The Samsung Galaxy Fit looks much more conventional. It’s aimed at the person who might otherwise buy a Fitbit.",
    "This is no bad thing, at least visually. The Samsung Galaxy Fit doesn’t make you look like a tech gear nerd just for wearing the thing.",
    "There are some neat design touches too. Its screen has a glass top layer, where the Fitbit Inspire’s is plastic. The silver border is aluminum too. Samsung could have got away with using plastic, but it didn’t. It matches the Huawei Band 3 Pro in this respect.",
    "It’s not all good news. The Samsung Galaxy Fit’s strap is not as good as the Fitbit Inspire HR’s or Huawei Band 3 Pro’s.",
    "They use a standard watch-style fastener. The Fit has a loop-over silicone strap that is fiddlier to fit, and less comfortable. There’s not much give to the rubber used, and as you’ll need it reasonably tight to achieve good heart rate readings, you’ll often end up with some nice imprints in your skin after wearing it for a workout.",
    "We had a chance to swap between the Samsung, Huawei and Fitbit tracker bands, and the Galaxy Fit’s is our least favorite strap of the three.",
    "All is not lost. Little clips on the underside let you remove and replace each side of the strap, so you can switch it out if you don’t get on with it. We can’t find any replacement or third-party straps yet, but they are sure to appear soon. And, yes, we are being picky about the Galaxy Fit’s comfort.",
    "It’s fine. The band itself is light and slight, if thicker than most. We just think this is not the most comfortable choice in this class, by some margin.",
    "Water resistance is up there with the best. It’s certified to 5ATM, meaning you can wear it while swimming, when in the shower, or outside in the rain.",
    "The Galaxy Fit also has MIL-STD-810G military spec toughness. But what does this mean? We don’t actually know. This spec consists of 29 tests, and tech gadgets are usually tested with just a few of them. Samsung doesn’t specify which.",
    "Water resistance is the factor that matters most.",
    "The Samsung Galaxy Fit has a display similar to the Huawei Band 3 Pro’s. It’s a 0.95-inch 120 x 240 OLED panel. You get full color, and enough pixels to display several lines of text on-screen without it all looking Minecraft-style blocky.",
    "It does not have an ambient light sensor, used to monitor the brightness of the environment and change the screen intensity to suit. However, we found that when you fiddle with it manually there’s enough power to deal with very bright days.",
    "There are seven substantively different watch faces. None of them quite has the charm of the Band 3 Pro’s 3D effect face, but there’s a good spread of analog and digital ones. And all but the two ‘artistic’ ones have various versions that put different stats on the face itself. You can choose whether to promote the weather, your step count, the date and so on.",
    "This is a touchscreen. It’s the only control interface other than the back button on the side. From the watch face you swipe left and right to cycle between the various feature pages. These show your stress level, your heart rate, any notifications received, and another lets you start tracking exercise manually.",
    "Dig a little deeper and you’ll find you can map the side button to start an exercise after a long-press. It’s handy."
  ],
  "headers": {
    "4": "Design",
    "16": "Display"
  },
  "links": {
    "Galaxy Fit E": "https://www.techradar.com/reviews/samsung-galaxy-fit-e-review",
    "Fitbit Inspire HR": "https://www.techradar.com/reviews/fitbit-inspire-hr-review",
    "Huawei Band 3 Pro": "https://www.techradar.com/reviews/huawei-band-3-pro-review",
    "Gear Fit": "https://www.techradar.com/reviews/gadgets/samsung-gear-fit-1227866/review",
    "Fitbit Inspire": "https://www.techradar.com/reviews/fitbit-inspire-review"
  }
}