{
  "source": "https://www.techradar.com/reviews/nokia-9-pureview",
  "title": "Nokia 9 PureView review",
  "category": "phones",
  "updated": "2019-05-10T07:28:30Z",
  "author": "david-lumb",
  "summary": "An ambitious camera beast with middling features",
  "verdict": "The Nokia 9 PureView is ambitious about mobile photography, and commendably packs five rear cameras that combine shots into a single image. But the resulting photos don't quite outclass those in pricier flagships, and the rest of the phone's features are middling, leaving it more a niche device for consumers who want a less-expensive camera-focused solution.",
  "pros": [
    "Eye-catching five-camera cluster",
    "Decent photos for sub-flagship price",
    "Exports to RAW DNG"
  ],
  "cons": [
    "Middling other features",
    "Poor fingerprint scanner",
    "Not a comfortable hold"
  ],
  "article": [
    "The Nokia 9 provoked wild curiosity from the moment the internet caught sneak peeks of its rear cover – do seven holes mean seven cameras? Well, no, the phone only has five, and they don’t include a plethora of zoom and ultrawide varieties to get ahead of this year’s three- and four-rear-camera flagship phones.",
    "No, all those lenses have the same length and aperture, because HMD wanted the Nokia 9 to corner the market on taking the best standard photo possible by combining images taken from all five cameras at once – an ur-HDR, so to speak. Given its decent but not impressive specs and features, the Nokia 9 lives or dies on its ability to take the best photos out there.",
    "And the photos are, admittedly, not bad – some compete with images taken by top-tier flagships that cost far more, though others might need more work in post-production (the phone optionally saves in the RAW DNG format) to compare favorably. But the rest of the phone is middling, and some parts are even lacking compared to other handsets in its price tier.",
    "The Nokia 9 PureView came out in February 2019, and retails for $699 / £549 / AED 2,299 (around AU$980), though we’re already seeing discounts on the phone from certain retailers. This makes it comfortably cheaper than other camera phone powerhouses such as the Samsung Galaxy S10 Plus, Huawei Mate 20 Pro and iPhone XS Max.",
    "HMD Global (the Finnish firm now behind Nokia handsets) noted that the phone is a limited release, so we're not sure how widespread its availability will be, or how long it will stay in stock. It's also not clear whether the Nokia 9 will come to Australia, as it's not currently listed on the company's Australian site.",
    "At first glance, the Nokia 9 PureView looks a lot like most smartphones – glass front and back sandwiching aluminum sides. Keep both sides polished and it gleams with the best-looking phones. But place it in your hand and you’ll feel the difference in quality between this phone and the heavily-refined flagships of today.",
    "Which is fine – this phone is all-in on empowering photography, not looking stylish – but it does end up feeling a little cheap.",
    "The sides lack the rounded edges of other phones, and there’s the barest of angled bezel between the sides and the flat front screen (the rear cover has slight curves, but is nearly as sheerly-angled). This all makes the phone harder to grip, requiring users to squeeze the sides to pick it up, and it’s less comfortable to handle as a result.",
    "The rear cover is sleek glass that dips toward the edges in a gesture toward classiness, though smudges and fingerprints stick around. This isn’t just annoying: because HMD opted to stretch the rear cover over the camera lenses instead of making an admittedly ungainly camera bump, these smudges could theoretically impede your photos. In other words, unlike other phones that expose their camera lenses to the world, the Nokia 9’s lenses are tucked underneath full rear cover – best hope you don’t scratch or smudge over them.",
    "The phone is otherwise spartan, with a volume rocker and lock/power button near the top of the right side. There’s a SIM card(s) slot on the top and a USB-C port at the bottom. Sorry, no 3.5mm headphone jack.",
    "One last note: the phone comes in one model, as it’s a limited release. The deep Midnight Blue is also the only color, so look elsewhere if you need your phones to be black.",
    "The front 5.99-inch OLED display is as expected, with a respectable 2880 x 1440 QHD resolution. That puts it in the range of most flagships of its age, and it’s certainly bright and sharp enough on its own, producing vivid colors and boasting a brightness that few other phones can rival.",
    "Side by side with other phones, however, the phone display shows its true colors – and they’re oversaturated compared to pricier phones. In a lineup comparing the same photo, the Nokia 9 PureView was either noticeably more vivid or noticeably more muted when display settings were toggled to “basic” rather than the default “dynamic.”",
    "To be fair, the OnePlus 6T pulls the same trick; the iPhone XS Max and Samsung Galaxy S10 Plus we compared had tamer, but seemed to have more true-to-life color balance. The pricier phones were a bit sharper, but only a bit.",
    "The Nokia 9’s display doesn’t have a notch, opting instead for an older-style flat section at the top of the screen that houses the front-facing camera, speaker and even a little Nokia logo. There’s a matching chin on the bottom of the screen, and the side bezels are just a bit more noticeable than competing phones, but that’s no great sin. It won’t win top prize in the smartphone beauty contests, but that’s not what the phone is for.",
    "Unfortunately, one of the features HMD hoped would situate the phone solidly in 2019 – the in-screen fingerprint sensor – is poor. Even after a software update to speed up the scanning, it seems to accurately recognize a registered fingerprint less than half the time – and only when it’s placed in the exact right position (centered, upright, and pressed-in).",
    "Thankfully, the facial recognition works quickly, though it seems so quick to register a face (less than ten seconds) that I wonder if a photo of a registered face would work. 3D face-scanning this is not."
  ],
  "headers": {
    "3": "Price and release date",
    "5": "Design",
    "11": "Display",
    "15": "In-screen fingerprint sensor"
  },
  "links": {
    "Samsung Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review"
  }
}