{
  "source": "https://www.techradar.com/reviews/xiaomi-redmi-7a",
  "title": "Xiaomi Redmi 7A review",
  "category": "phones",
  "updated": "2019-09-24T11:18:29Z",
  "author": "sean-cameron",
  "summary": "Is the Redmi 7A the next budget champion or a prize dud?",
  "verdict": "With a relatively petite frame, great battery life, a sturdy design and an attractive price point, the Redmi 7A is quite a steal. But with limited RAM, divisive software and an iffy camera, it isn’t an instant recommendation.",
  "pros": [
    "Designed for one-handed use",
    "Good screen",
    "Great battery life"
  ],
  "cons": [
    "Not enough RAM",
    "Bloated software",
    "No NFC"
  ],
  "article": [
    "Throughout 2019 to date, it seems to have been Xiaomi’s mission to make a mark in the west.",
    "Following a relatively tentative initial venture to our rain-soaked British shores in late 2018, the Chinese firm has since deluged consumers with a large array of devices, each keenly targeted at a different segment of the market.",
    "The Redmi 7A is Xiaomi’s pitch for the segment of buyers who think spending over £100 on a phone is the very picture of decadent excess, as it has been built and designed with value in mind.",
    "However, where only a few years ago these people would have been condemned to anemic has-beens for such a price, today the competition is fierce - there are many options, each of which has its own attractive selling points. Simply selling for £99.99 (around $125/AU$180) unlocked is not enough.",
    "So, beyond a tech-head’s grab-bag of specifications, does the Redmi 7A have something which sets it apart from the crowd? If you are in the market for a cut-price handset, should this be your first consideration? Read on to find out.",
    "The Xiaomi Redmi 7A is set to be available in the UK via Amazon and directly via Xiaomi in addition to other retailers over time. The exact release date for the phone in the UK is currently unclear.",
    "It will cost £99.99 (around $125/AU$180) and will also be released across Europe, though there is no word as of yet on a release in either Australia or the US. This may change over time, but for the moment the ‘West’ for this device is Europe-only.",
    "Four colors are available, and two different storage capacities, with both 16GB and 32GB models available.",
    "It has been such a long time since phones were designed with one-handed use in mind, that the appearance of one in 2019 is almost anachronistic. In our future of massive phablets, that one could potentially wish to use their device easily on the move is a positively antediluvian thought, so 2010.",
    "This aside, the Redmi 7A is indeed small by modern standards - with a screen measuring 5.45 inches on the diagonal. This, coupled with the large screen-to-body ratio and 165g weight, make for a phone which will fit nicely in the palms of most.",
    "This ethos of practicality also carries somewhat into fit and finish - unusually for the price this device comes with a splash-resistant coating. This doesn’t mean that your phone will be able to survive a high-dive into a toilet or pint glass, however it does mean that it will probably survive if caught in the rain.",
    "We should also talk about the battery a little, for this has one worthy of the flagships. With the advent of the Huawei P20 Pro it became the norm to stick oversized batteries in flagship phones, however Xiaomi has been playing this game for years, and at the budget level.",
    "The Redmi 7A comes packing a huge 4,000mAh power pack, and with the relatively anemic chipset and small screen, great things are to be expected in terms of battery life - though more on this later.",
    "An interesting addition too is an FM radio, which can be played without an antenna. For context, many phones feature an FM radio, however, most require wired earphones to be plugged in before the function can be used, due to the wires on the earphones working as the ‘antenna’.",
    "With the Redmi 7A, this antenna is inbuilt, meaning that the radio can flow freely through the bottom-firing speaker with no issue. Though this might not appeal to a generation raised on Spotify, for others this means unlimited free music without any monthly subscription.",
    "Lastly, Xiaomi, desperate to use the term ‘AI’ until its dying breath, has added an ‘AI’ face unlock. This essentially means that, with the lack of a fingerprint scanner, the user is forced to use the front camera to unlock their phone. This feature is neither fast nor convenient, the fingerprint sensor is much missed as a result.",
    "The lack of a fingerprint scanner isn’t to deny the Redmi 7A of its essential quality and solidity, however. Hewn from polycarbonate (read ‘posh plastic’) there is no give nor flex to the handset. The use of plastic in the design ought to help too in the case of an unfortunate drop, as the material is simply less brittle than metal or glass.",
    "It is the screen which occupies most of the front of the Redmi 7A, with no notch in sight (mercifully), and the 5MP selfie camera sitting just above in a full bezel.",
    "The right of the handset contains the power button and volume rocker, the left side houses the dual-SIM card and microSD tray, the top has a headphone jack and the bottom hosts a micro USB charging port and sole bottom-firing speaker.",
    "The rear has Xiaomi branding and a single 13MP snapper. This is as clean a design as one could expect for the price point, however the lack of a proper fingerprint sensor does grate, for those making the transition from a device with a functioning sensor, it will likely prove to be difficult.",
    "On the issue of convenience, there is also no NFC, which means no mobile payments, another small problem. Luckily, the screen comes with the usual scratch-resistant glass - no word on make or brand - and an oleophobic coating to repel the various oils of the human hand.",
    "Despite coming in four different colors, and being pleasant in a utilitarian sort of way, the Xiaomi Redmi 7A isn’t a device which will wow anyone, but it's one which will likely be able to withstand a few years of relatively rough use.",
    "For those people unwilling to spend much on a phone, or to replace their devices frequently, this is a definite win.",
    "At 720 x 1440 the Redmi 7A, from the offset, is not out looking to win any resolution wars. But the quality of a screen goes far beyond how much detail it can render, color, brightness and more all contribute heavily to the overall experience of using the device.",
    "Luckily then, the experience of using this 5.45-inch screen is mostly positive. Starting with brightness, anecdotally we found that bright sunlight generally didn’t pose much issue in our day-to-day usage, and when reading in total darkness the screen can also get sufficiently dim so as not to sear your eyeballs into oblivion.",
    "Color isn’t quite so positive an area, however it isn’t a deal-breaker. LCD screens, and those used by Xiaomi in particular, often have a very ‘cool’ cast, meaning that whites can often appear blue-ish. This may appeal to some, but for those who like their colors to have a little ‘pop’, there is a fairly comprehensive screen-adjustment utility, where colors can be set to any level you may wish.",
    "In addition, there is also the option for a system-wide ‘dark mode’ and the option to change text size and more - great news for those who have the eyesight of a mole. One slight bugbear is the overly zealous auto-brightness. We found that the screen could jump from bright to dim without even a moment’s notice, and often without any prompt.",
    "The lack of a notch also proves to be a winner - there is no black bar blocking the screen. In all, the screen on offer is definitely a selling point, even against competitors at the same price."
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Key features",
    "16": "Design",
    "23": "Screen"
  },
  "links": {
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review"
  }
}