{
  "source": "https://www.techradar.com/reviews/wearables/apple-watch-2-1323213/review",
  "title": "Apple Watch 2 review",
  "category": "wearables",
  "updated": "2020-06-22T19:34:03Z",
  "author": "gareth-beavis",
  "summary": "Fitness takes over the Apple Watch (now with Nike+ review too)",
  "verdict": "The Apple Watch 2 is an improvement on the original Watch in a number of ways, and all of them useful. The extended battery life, the GPS abilities and the water-resistance now make this a compelling smartwatch, though the follow up Series 3 is the device that really convinced us it has a purpose.",
  "pros": [
    "Water-resistant",
    "GPS onboard",
    "Two day battery life"
  ],
  "cons": [
    "Expensive",
    "Lack of useful apps",
    "Fitness could be more comprehensive"
  ],
  "article": [
    "Update: Now Apple has discontinued the Apple Watch 2, it can be difficult to find and often you can find the Apple Watch 3 for less money. If you can find the Apple Watch Series 3 for less, we'd recommend buying that but we've left this review intact just in case you are desperate to get the Series 2 Apple Watch. Further, Apple confirmed that the Apple Watch 2 will not get watchOS 7, so if you need the latest features, consider a different Apple smartwatch.",
    "If you already own an Apple Watch 2, you'll find watchOS 6 will land on the watch by the end of 2019. Be sure to read our ultimate Apple Watch buying guide for the latest on what Apple Watch you should look for.",
    "At launch the Apple Watch 2 (or Apple Watch Series 2 if we're being picky) raised a couple of questions: was it a big enough upgrade to beat the first Watch, and had Apple done enough to make a smartwatch a necessity, rather than just a novel luxury?",
    "The answers: Apple delivered a lot of the tech upgrades we wanted: including a new water-resistant design, a GPS chip on board for tracking your runs, a swim tracker and a much faster processor.",
    "There was a new white ceramic finish too – to take the place of the extortionately expensive gold Apple Watch Edition – to add an element of 'luxury' to proceedings, with the Hermes band making an appearance again to keep the top cost of the Watch 2 higher.",
    "The second Apple Watch was also the poster child for watchOS 3 and has since benefited from the subsequent arrival of watchOS 4 and watchOS 5, which radically improves the functionality of the device – so with it's second-gen smartwatch did Apple solve the issues that prevented the original Watch becoming the must-have gadget of the year?",
    "Despite being dropped officially by Apple, the Apple Watch 2 is still available online from some retailers. That said, it's very difficult to find the watch for less than the price of an Apple Watch 3.",
    "The Apple Watch Series 2 first launched starting at $369 / £369 / AU$529 before dropping to around $260 / £260 (about AU$450). As it's now more difficult to find, the price has gone up and we'd now recommend buying the Series 3 if it's cheaper.",
    "Check out our Apple Watch Series 2 video review",
    "If the Apple Watch 3 is still too pricey, there's always the Apple Watch Series 1 that costs around $269 (£269, AU$399) for the entry-level Sport Edition.",
    "The design of the Apple Watch Series 2 is simple: it's the same as the previous version. Unless you're someone who loves a round shape on their wrist, that's no bad thing, as Apple makes a very handsome-looking device no matter what it's creating.",
    "The curved edges, the formed glass, the quality of the spinning digital crown on the side of the Watch all feel premium, and while they don't necessarily excuse the high price, they do go a long way towards qualifying it.",
    "The weight isn't too light or too heavy – the right heft for the mix of metal and glass you're strapping to your wrist.",
    "Talking of straps, I still wish Apple had a more elegant solution to the issue of changing the bands on your Apple Watch. The little strap release buttons are just too hard to push easily, and I've spent too long trying to move between the polymer sport and nylon bands, yanking them from the slots.",
    "On the underside of the Watch 2 is the heart rate monitor, a collection of four LEDs that pulse light below your skin to work out how fast your heart is pumping. The LED array on the back of the watch looks bulbous, but once strapped to the wrist isn't noticeable, and supports useful features throughout the Watch.",
    "Apple has thankfully done away with the hyper-expensive gold Edition Watch, but has replaced it with the ceramic version, which is still three times the cost of the base model at $1,299 / £1,299 at the cheapest point.",
    "It's nice, and does feel a little more premium (plus it's four times stronger, according to Apple) but the white case looks a bit too... well, Apple. But the finish is nice.",
    "Even thought it's no longer the flagship, the Apple Watch Series 2 is still a high-end device – and now that it's water-resistant, and has GPS and a bigger battery, it's hard to believe it's not thicker. Throughout our review there was never a suspicion that you'd be scratching this thing up, despite repeatedly picking it up and putting it down during activity.",
    "Apple hasn't changed much with the screen dimensions – actually, nothing at all. The same 1.65-inch display is on offer, with the 390 x 312 OLED display rolling attractively into the side of the Watch's frame.",
    "The key thing is the brightness though: the Watch Series 2 can now pump things up to 1000 nits. That's just a number to most people, but my word, it's bright. Brighter than the previous model too and as bright as the Watch Series 3.",
    "Thankfully, the OLED element of the display of means the black backgrounds are turned off when not in use, both saving battery life and improving the brightness of the white element.",
    "As the Watch 2 is water-resistant as well, the display has been augmented with a 'wet mode', which locks the display and disables touch functionality when activated.",
    "What does that mean? Well, as water can conduct electricity, the screen could sense the water as an input and order an Uber when you're in the swimming pool. With this mode on, the screen is safe – and will automatically activate when you turn on swimming tracking.",
    "The way it unlocks is cool too: you spin the digital crown, and when it's fully clear the speaker emits a pulse to shove out the water, should any be left in there.",
    "The screen on the Apple Watch Series 2 is one of the very best things about the device – it's not as high-resolution as some of the best phones on the market, but it doesn't need to be - it's more than sharp enough, as well as being bright and colorful enough to be easily seen in any scenario."
  ],
  "headers": {
    "6": "Apple Watch 2 price and release date",
    "10": "Design",
    "18": "Screen"
  },
  "links": {
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "watchOS 7": "https://www.techradar.com/news/watchos-74-news",
    "watchOS 6": "https://www.techradar.com/news/watchos-6-release-date",
    "Apple Watch buying guide": "https://www.techradar.com/news/best-apple-watch",
    "watchOS 3": "https://www.techradar.com/news/software/operating-systems/apple-watch-os-3-release-date-news-and-rumors-1323096",
    "watchOS 4": "https://www.techradar.com/news/apple-watchos-4-release-date-news-and-features"
  }
}