{
  "source": "https://www.techradar.com/reviews/total-defense-essential-antivirus",
  "title": "Total Defense Essential Antivirus review",
  "category": "computing",
  "updated": "2019-12-04T15:00:22Z",
  "author": "mike-williams",
  "summary": "Simple malware protection with a Bitdefender-powered engine",
  "verdict": "Total Defense Essential Antivirus's Bitdefender-powered engine is accurate, but with few other features, we're struggling to see why you shouldn't just buy Bitdefender Antivirus, instead.",
  "pros": [
    "Accurate Bitdefender engine",
    "High rankings from independent testing labs",
    "Toll-free phone support 9am-6pm weekdays"
  ],
  "cons": [
    "No antiphishing",
    "Failed to remove one test malware sample",
    "Below average performance",
    "Small usability issues"
  ],
  "article": [
    "Total Defense Antivirus may not be a brand that regularly makes security headlines, but don't let that put you off - it's more capable than you might expect.",
    "Although it doesn't quite top the AV-Comparatives' Real-World Protection Test summary for July-October 2019, for instance, Total Defense's Bitdefender-powered engine outperformed some very big names: Kaspersky, Panda, Avast, McAfee, F-Secure, ESET and more.",
    "As you'll guess from the name, Total Defense Essential Antivirus covers the PC protection basics only, with real-time and on-demand malware detection and blocking. It doesn't even have anti-phishing to block suspicious websites.",
    "Support is available via email and telephone. The good news: there's a toll-free number for the US, UK, Australia and New Zealand; the bad news, it's only available weekdays 9am-6pm EST. That's a pity, but not a huge complaint - many antivirus products don't have any phone support at all.",
    "Total Defense Antivirus covers up to three Windows devices for $29.99 billed annually, rising to $49.99 on renewal.",
    "Total Defense offers two- or three-year subscriptions, but these provide only marginal savings. The two-year subscription costs $69.99, for instance, then renews at $99.98.",
    "Bitdefender's Antivirus Plus 2020, with the same core engine and many more features (including blocking of phishing URLs), costs $24.99 for a three-device, one-year license, but rises to $59.99 on renewal.",
    "We're not looking at them in this review, but Total Defense also has a couple of internet security suites.",
    "Total Defense Premium adds antiphishing, parental controls, banking protection and 10GB secure cloud storage, and covers up to 5 devices. It's priced from $59.99 in year one, $79.99 on renewal.",
    "Total Defense Ultimate covers up to ten devices, gets you 25GB of cloud storage, and adds PC optimization and patch management. It's yours for $99 billed annually. Opting for the three-year plan makes more financial sense this time with a price of $199.99, but after that it renews at $299.97.",
    "Total Defense does at least make it easy to sample its services. A 30-day trial is available, no credit card details required, and even if you sign up and change your mind, you're protected by a generous 60-day money-back guarantee.",
    "Signing up for the Total Defense Essential Antivirus trial is a simple as providing your name and email address on the website. Moments later an email arrived welcoming us to the trial, and providing a download link for the setup file.",
    "The installer detected our existing antivirus package (Panda Dome) and demanded we remove it. There's no option to skip this step, or to use a 'compatibility mode' to try and run two antivirus engines side-by-side. Experienced users might regret this inflexible approach, but it does reduce the chance of any conflicts, and overall that's probably the best approach.",
    "Total Defense Essential Antivirus added a fairly minimal 700MB to our hard drive. Most of this is Total Defense's own code, although we also found plenty of Bitdefender modules (anti-ransomware, ant rootkit, quarantine and the core engine), while a handful of Mozilla's Network Security Services tools are on hand to process SSL connections.",
    "It's important that an antivirus package can protect itself from attacks by malware. We tried to change Registry keys, delete important files or folders, but with no effect. It was possible to stop some Essential Antivirus services, however, and while we couldn't see a measurable impact from that, it left us wondering if it could be a problem.",
    "Total Defense Essential Antivirus has a surprisingly bulky interface which somehow manages to grab a large amount of screen real estate, while doing almost nothing with it.",
    "The main area of the console consists of three panels; one displays your device status, while the others, labelled Security and Devices, are essentially huge buttons which take you to the scan window and enable viewing other devices protected under your Total Defense subscription.",
    "A sidebar has what looks like a menu button, but really just brings you back to the initial display. There are a couple of buttons under that, but they're also labelled Security and Devices, and take you to the same screens you'll see when clicking on the main panels. If they weren't there, no-one would miss them.",
    "You'll get used to the design, though, and once you've explored the menus, Essential Antivirus isn't difficult to use.",
    "A click on the Security panel takes you to a choice of scanning options: Quick, Full, and Custom, where you're able to define which files, folders or drives you'd like scanned.",
    "You're able to view basic reports, manage quarantined files and tweak a few basic settings.",
    "The Total Defense Essential Antivirus console may be minimized to the system tray when you don't need it, and Explorer integration enables scanning selected files, folders and drives from their right-click menu.",
    "The interface still has plenty of small irritations. You might expect the dashboard to appear if you left-click or double-click its system tray icon, for instance, like most Windows apps, but no - instead, you might left-click the icon, which opens the right-click menu, then choose the Home option. It's not a big deal - just an extra click - but we couldn't help but wonder why Total Defense thought this non-standard and more lengthy approach was a good idea.",
    "Still, as in an ideal world you'll install antivirus and then mostly forget it's there, Total Defense's minor usability issues probably won't bother you too much. It'll carry out the core functions you need, when you need them, and that's what matters most.",
    "There's not much else here, and the few features you get aren't very configurable. Essential Antivirus includes a scheduler, for instance, but you can't set up multiple automated scans, perhaps to run quick scans daily, full scans once a week, custom scans at various times and frequencies. You're able to schedule a single full scan only ('every day at 4am', or whatever it is.)",
    "Total Defense Essential Antivirus scan times were mid-range during testing. Quick scans took around three minutes, while our full system scans checked 2.75 million files in a very typical 70-75 minutes: not great, not bad, just somewhere in the middle.",
    "What's more interesting with any antivirus is how well optimized its scans can be, whether it's able to skip unmodified files rather than scan them again. Here, Total Defense Essential Antivirus isn't so smart. Our first full system scan took 74 minutes, our second required 71; our first quick scan took 3:12 seconds, and our second, taken immediately afterwards, was marginally slower at 3:23.",
    "There's better news with Essential Antivirus' configurable scanning, one of the few areas of the program where you get some decent level of control. A Custom Threat Protection box enables tweaking settings to scan (or not) archives, network or cloud files, to check for rootkits, and to set maximum CPU load for scheduled and on-demand scans (the higher the load, the quicker the scan should complete, but the more impact it'll have on currently running tasks.)",
    "Elsewhere, the package successfully detected and blocked our handful of test malware samples, but there were some issues.",
    "Essential Antivirus raised an above-average number of false alarms, for instance. It's easy to restore incorrectly flagged files from quarantine, but we still found it a regular hassle.",
    "We noticed a more fundamental issue in its inability to remove a malicious script from our test system. Essential Antivirus detected the threat each time, reported the file as removed, even showed it in Quarantine, but when we checked, the script was still in its original folder.",
    "We can't explain this and have no idea how common it might be, but just the possibility that Essential Antivirus can say it's removed a threat, while leaving it alone, has to be a concern.",
    "Price, speed and ease of use are important, but the real value of any antivirus is just how well it can defend your hardware from the bad guys.",
    "The package had no issues detecting our handful of malware samples, but we were also interested to see if it could handle a tougher test: a custom ransomware simulator. As we've coded this ourselves, Total Defense wouldn't be able to recognize the threat from its file signature alone, making this an interesting test of the package's behavior monitoring.",
    "The results were a disappointment, though: Total Defense Essential Antivirus ignored our simulator entirely, allowing it to run to completion and encrypt thousands of test files.",
    "As this test didn't involve real ransomware, we can't count this failure as a major black mark against the package, but it is a concern. One of the selling points of Total Defense Essential Antivirus is that it's powered by the excellent Bitdefender engine, but Bitdefender Antivirus not only detected and blocked our threat, it recovered the very few files which had been encrypted. We don't know why there's a discrepancy - maybe Total Defense doesn't have all the same behavior monitoring features, perhaps its default settings are different - but the reality is we'd most likely have got better results from a Bitdefender product.",
    "Our small-scale tests give a little information about a product, but AV-Comparatives Real-World Protection Tests provide the big picture, pitching 16 top antivirus engines against the very latest malware.",
    "The July-October report puts Total Defense in a creditable 6th place, blocking 99.6% of threats and with 5 false positives.",
    "That's a very good result, and better than many top competitors. Panda Antivirus is a capable product, for instance, but it was left behind with a 99.5% block rate and 12 false positives.",
    "Total Defense trailed behind Avira, Symantec, Trend Micro and VIPRE, though, and it was also outperformed by Bitdefender's own product (block rate 99.7%, only 2 false positives.) That's only a very marginal difference, but again, if you're tempted by the Bitdefender engine, it looks like you'll get fractionally better results from a Bitdefender product.",
    "Total Defense Essential Antivirus is a reasonable product which covers most of the malware-handling basics, and scores well with independent testing labs. It doesn't have many features, though, and if you're tempted by the accuracy of its Bitdefender-based engine, you'll be better off choosing a Bitdefender product."
  ],
  "headers": {
    "4": "Pricing",
    "11": "Getting started",
    "15": "Interface",
    "25": "Scanning",
    "32": "Performance",
    "40": "Final verdict"
  },
  "links": {
    "Total Defense Essential Antivirus": "https://www.totaldefense.com/shop/anti-virus",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Mozilla's Network Security Services": "https://developer.mozilla.org/en-US/docs/Mozilla/Projects/NSS/An_overview_of_NSS_Internals",
    "July-October report": "https://www.av-comparatives.org/comparison"
  }
}