{
  "source": "https://www.techradar.com/reviews/xiaomi-redmi-note-6-pro",
  "title": "Xiaomi Redmi Note 6 Pro review",
  "category": "phones",
  "updated": "2019-04-25T11:33:46Z",
  "author": "sean-cameron",
  "summary": "Is the Beast from the East ready for the West?",
  "verdict": "With a big, bright screen, capable camera and very strong battery life, the Redmi Note 6 Pro makes a great impression - even with poor software, no NFC and an outdated micro USB port. Xiaomi's debut UK budget device is a barnstormer.",
  "pros": [
    "Big, bright screen",
    "All-day battery life",
    "Capable camera"
  ],
  "cons": [
    "No NFC",
    "Micro USB port",
    "Overblown software skin"
  ],
  "article": [
    "Since 2014, the rise of Xiaomi has seemed inexorable, expanding from being an also-ran in its native China to becoming one of the largest smartphone manufacturers in the world.",
    "Now the brand has brought a slew of its devices to the UK and western Europe. Of these, the Redmi Note 6 Pro is one of the most compelling options.",
    "For an outlay of just under £200, buyers get 64GB of storage (with optional microSD expansion), 4GB of RAM, a Snapdragon 636 octa-core chipset, a 4,000mAh battery and more - this is a device designed to win spec-sheet wars.",
    "But with the brand having so little experience in the west, and against tough competition from the likes of Honor, Huawei, Motorola, Oppo and more, does the Redmi Note 6 Pro have what it needs to succeed?",
    "The Redmi Note 6 Pro is sold directly through Amazon for £189.99/$180 currently for the version with 4GB of RAM and 64GB of storage, other cheaper combinations are available. The device is also available directly through Xiaomi’s UK website for £219 (3GB/32GB). Australian stores meanwhile are selling it from around AU$320.",
    "Note that in the US it’s the unlocked global version that’s being sold – no official availability has been confirmed for the US presently and this doesn’t seem likely to change.",
    "A key selling point of many Chinese phones is their selfie capabilities - the more cameras and beauty modes, the better. Xiaomi has obliged accordingly with the Redmi Note 6 Pro, for it features four cameras, two facing forward and two facing backward.",
    "The front has a 20MP main lens and a 2MP depth sensor accompanying it, along with more AI modes and beauty filters than a sensible person could shake a sensibly-sized stick at. The rear camera includes a 12MP f/1.9 main lens and a 5MP depth sensor.",
    "In addition there's an IR blaster, which can be used with the Mi Remote app to control various appliances, and a screen with a trendy notch cut-out. This screen has a stretched 19:9 aspect ratio and is 1080 x 2280 in resolution and 6.26 inches tall, which is around what one might expect for the price.",
    "Xiaomi has also gone to some lengths to ensure a sturdy design, with the frame being plastic while the rear is encased in metal, leaving the Redmi Note 6 Pro with a fairly premium feel for the price. It also comes with a slew of different color options, including a fetching hot pink shade.",
    "One thing the Redmi Note 6 Pro doesn't have though is NFC, which means you can't use this phone for contactless payments. It's a disappointing omission even at the price.",
    "In 2019, conventional wisdom tells us that the consumer wants tiny notches and glass designs, even at the budget end of the market. Based against this, the Redmi Note 6 Pro is positively retro, with a metal build and a large notch.",
    "It sports a metal black plate which is cool to the touch, with the sides being made of plastic. A fingerprint scanner (which is satisfyingly nippy) can be found on the rear, as can the subtle ‘Mi’ logo and the rear camera housing.",
    "The left side is flush, aside from the dual-SIM/microSD card tray, the right is home to the power key and the volume rocker, and the bottom holds (boo) the micro USB slot.",
    "The top of the device has the 3.5mm headphone jack, the IR blaster and a noise-cancelling microphone, and lastly the front of the device holds the 19:9 1080 x 2280 screen and twin front-facing cameras in the large notch.",
    "The use of a micro USB port in a device being sold in 2019 feels more than a little anachronistic, especially given that the successor standard, USB-C, is so widely prevalent.",
    "Notches are now a point of contention, but in everyday use the presence of this ‘feature’ will bother only the most committed. Videos eliminate the notch through black bars and the interface is spaced out in such a way that its presence doesn’t interrupt notifications.",
    "At 182g, this device is a chunky monkey - though given the size of the battery crammed inside its frame, the space feels well used. It is certainly more hefty than the likes of the Huawei P Smart (2019) but that isn’t necessarily a disadvantage.",
    "In all, the Redmi Note 6 Pro is a phone which some may find clunky compared to the svelte offerings at the top of the market, but for the average user it shouldn't prove to be an issue - the trade-offs in screen size and battery life will be worth it.",
    "It needs to be said again, the notch on this device is a porker. Against teardrop notches and punch-hole cameras, on the shelf it does stand out.",
    "As said before however, in everyday use it quickly fades away into the background. This is partly because the screen itself is simply very pleasant to use.",
    "It can get bright enough to use in moderately bright sunshine (although the auto-brightness is slightly iffy) and the large size allows for plenty of content to be fit in at once.",
    "Watching videos on the go using this phone is a very pleasant experience, and the resolution ensures that pixelation will only be visible to the most hardcore of peepers. One small issue out of the box however was that the color temperature was a little too cool for our liking - with whites having a blue-ish tinge to them.",
    "This is easily rectified using the in-built screen calibration tool, which allows the user to set their own white point and increase contrast among other options. Other than this, the screen shows vibrant colors and is pleasing to the eye.",
    "In all, and certainly for the price, this is a display which ticks all the right boxes, being bright, sharp and colorful. One would need to spend a lot more and upgrade to the likes of the Samsung Galaxy S10 in order to see an appreciable difference."
  ],
  "headers": {
    "4": "Xiaomi Redmi Note 6 Pro price and availability",
    "6": "Key features",
    "11": "Design",
    "19": "Screen"
  },
  "links": {
    "Huawei P Smart (2019)": "https://www.techradar.com/reviews/huawei-p-smart-2019",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}