{
  "source": "https://www.techradar.com/reviews/canon-eos-rebel-t7i-eos-800d-review",
  "title": "Canon EOS Rebel T7i / EOS 800D review",
  "category": "cameras",
  "updated": "2019-11-19T15:16:57Z",
  "author": "phil-hall",
  "summary": "This entry-level DSLR is still a solid option for beginners.",
  "verdict": "It might be a little old in the tooth, but the EOS Rebel T7i / 800D remains a solid choice for beginners looking to step up from their smartphone or point-and-shoot camera. It's best suited to those who like the heft and handling of a DSLR, because the specs are now slightly dated compared to mirrorless rivals, particularly with its video limited to 1080p. That said, the autofocus system, 6fps burst shooting and battery life are all strengths that make it more than capable for stills shooting and learning how to shoot in manual mode.",
  "pros": [
    "User-friendly interface",
    "Excellent touchscreen control",
    "Live View AF performance",
    "Impressive overall image quality"
  ],
  "cons": [
    "No 4K video",
    "Plastic finish",
    "Dynamic range could be better",
    "Only 95% viewfinder coverage"
  ],
  "article": [
    "It may have been released back in February 2017, but the Canon EOS Rebel T7i (known as the EOS 800D outside the US) still sits at the top of the company's range of entry-level DSLRs.",
    "An update to the classic EOS Rebel T6i / EOS 750D from 2015, it mixes all of the traditional hallmarks of a Canon DSLR (great handling and image quality) with some strong specs that include a 6fps burst mode and 3-inch vari-angle touchscreen.",
    "In terms of shooting performance, it's now overshadowed by its mirrorless equivalent, the Canon EOS M50. That camera does have its own drawbacks, though, including a 235-shot battery life, which pails in comparison to this camera's 600 shots from a single charge.",
    "If you prefer an optical viewfinder and handling of a larger DSLR, compared to a more compact camera like the EOS M50, then the Canon EOS Rebel T7i / 800D remains a very good choice that still deserves its place in our best beginner DSLR cameras list.",
    "While the EOS Rebel T7i / EOS 800D sports the same 24.2MP resolution as the Rebel T6i / EOS 750D it replaced, the sensor has been overhauled and uses the same technology we've seen in the EOS 80D.",
    "Canon wouldn't elaborate on what exactly changed, but we can speculate that it uses the same on-chip digital-to-analogue conversion technology that we've seen in the EOS 5D Mark IV to handle noise better.",
    "The new sensor is partnered with a Digic 7 image processor. This has since been succeeded by the Digic 8 chip that we first saw on the Canon EOS M50, but remains a good performer that enables the EOS Rebel T7i / EOS 800D to deliver superior high-ISO noise performance and autofocus than Digic 6 cameras like its predecessor.",
    "We'll look at the autofocus in more detail a little later, but sensitivity-wise the Rebel T7i / 800D offers a range of ISO100-25,600 – that's an extra stop over the T6i’s expanded 12,800 ISO ceiling, while there’s a Hi setting equivalent to ISO51,200 also available. You’ll just have to select this in the custom setting.",
    "Canon has opted to stick with the same 3.0-inch, vari-angle touchscreen display with a resolution of 1,040,000 dots. A slight boost in resolution, or increase in size to 3.2-inches (matching the Nikon D5600), would have been welcome here, but perhaps Canon may have felt improvements were unnecessary here, as it’s already one of the most polished touch interfaces out there.",
    "With 4K video capture now a standard feature on cameras, especially on mirrorless rivals, it's perhaps a little underwhelming to see only Full HD capture offered.",
    "Footage can be captured at up to 60p though, up from the T6i / 750D’s 30p, while Canon has equipped the Rebel T7i / 800D with a 5-axis image stabilization system for shooting hand-held footage. Designed to work with video but not stills, the system is designed to counter unwanted camera movement, while IS-equipped lenses will also work in conjunction with the system.",
    "There’s also a 3.5mm stereo microphone jack port, but no headphone port to monitor audio – something that’s pretty standard on cameras at this price point.",
    "The T6i / 750D supported Wi-Fi and NFC connectivity, and the EOS T7i / EOS 800D builds on this. There's now the option to set up a low-energy Bluetooth connection so that you can always be connected to the camera. We’ve seen something similar with Nikon’s SnapBridge connectivity, enabling you to remotely transfer images from your camera to a compatible smart device.",
    "Canon's Camera Connect app also lets you wake the camera from its slumber (provided you haven't turned the camera fully off), as well as browse photos and operate the camera remotely. The Camera Connect app itself has also been updated to make it more user-friendly, and to help guide you through the controls.",
    "The arrival of the EOS Rebel T7i / EOS 800D brought a new 18-55mm kit lens that is offered as a starter kit with the camera. The Canon EF-S 18-55mm f/4-5.6 IS STM is 20% smaller than its predecessor, and a little slower (the older lens had a variable maximum aperture of f/3.5-5.6) thanks to its collapsible design, but offers up to four stops of image stabilization. If you don't have any exist EF lenses, it's well worth picking up with the camera."
  ],
  "headers": {
    "4": "Canon EOS Rebel T7i / 800D review: features",
    "14": "The 18-55mm kit lens"
  },
  "links": {
    "EOS Rebel T6i": "https://www.techradar.com/reviews/canon-eos-rebel-t6i-eos-750d",
    "EOS 750D": "https://www.techradar.com/reviews/canon-eos-rebel-t6i-eos-750d",
    "Canon EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "best beginner DSLR cameras": "https://www.techradar.com/news/best-entry-level-dslr-camera",
    "EOS 80D": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/canon-eos-80d-1315060/review",
    "EOS 5D Mark IV": "https://www.techradar.com/reviews/canon-eos-5d-mark-iv-review"
  }
}