{
  "source": "https://www.techradar.com/reviews/toshiba-ul5a-tv-review",
  "title": "Toshiba UL5A TV (43UL5A63DB, 49UL5A63DB, 55UL5A63DB) review",
  "category": "televisions",
  "updated": "2019-08-25T14:00:29Z",
  "author": "henry-st-leger",
  "summary": "A cheap 4K television with some unique Alexa smarts",
  "verdict": "The Toshiba UL5A, as the core model in Toshiba’s latest budget TV range, is certainly an affordable LED TV with a capable picture for the price. Its Alexa accessory, Toshiba Connect, is also a neat concept, despite limited functionality.",
  "pros": [
    "Budget price",
    "Plug-in Alexa microphone",
    "Netflix / Amazon remote buttons"
  ],
  "cons": [
    "Not full HDR",
    "Unreliable mute button",
    "Sluggish smart platform"
  ],
  "article": [
    "The Toshiba UL5A is part of Toshiba’s new range of budget 4K TVs, the L5 series, and premium L7 series. With a whole load of format support, some unique Amazon Alexa smarts and, on the surface, plenty to rival more premium offerings, why wouldn’t you consider one of these Toshiba TVs?",
    "The most interesting feature of the UL5A is the Toshiba Connect, a small plug-in gadget that connects to your TV via USB, with the kind of far-field mic found in an Amazon Echo speaker to let you control your TV with your voice via Amazon’s Alexa smart assistant. This is an optional accessory – and one that, at the time of writing, is only available through Argos when purchasing the UL5A, but it’s soon to be more widely available for use in the other L5 and L7 series sets (the VL5A, UL7A, and TL7A).",
    "There can be some downsides to third-party Alexa devices, though, so we put both the UL5A and the Toshiba Connect through our tests to see if this really is a budget TV worth its (admittedly small) price tag. Read on for our full Toshiba UL5A TV review.",
    "The Toshiba UL5A is available in the UK in 43-inch, 49-inch, and 55-inch models, priced at £349, £399 and £479 respectively. As mentioned, the Toshiba Connect microphone ships exclusively with the UL5A through Argos, adding another £20 to each RRP.",
    "The VL5A ships for the same amount, though packs in front-firing speakers – with a slightly quieter output – making for a slightly more direct audio experience.",
    "What to say about the Toshiba UL5A? At this price point, you’re not getting the flashy glass frames and Ambilight laser shows of more high-end televisions – and the UL5A isn’t that fussed about looking slim, either. With a depth of 19.1mm, there’s a fair amount of bulk here, with a plastic casing that doesn’t hug the rear too closely. This is the 55-inch model, though, and the smaller sizes will of course take up less space.",
    "There’s a relatively thick bezel, with a functional look that doesn’t try to hide the constituent parts of the television. The panel itself sits very low to the stand, which requires assembly of two distinct parts before screwing into the TV itself. The bottom edge of the panel features a grey strip with the Toshiba logo on the left, and a circular LED light on the right, which stays red while the TV is off and turns green when the TV is on.",
    "You have all the usual ports at the rear, too: four HDMI 2.0 (including HDMI ARC for soundbars), two USB, aerial, ethernet, and optical inputs.",
    "The most interesting feature, if you have it, is Toshiba Connect, which incorporates the smarts of the Alexa voice assistant via a plug-in microphone. When connected to the TV, it was able to summon Alexa, muting whatever we were watching – though not halting the video – and showing an Alexa logo in the bottom-right corner to indicate that it was listening to our commands, whether we wanted random internet trivia, information on the weather, or to play songs through Amazon Music on the TV.",
    "You’re able to change channels, send commands to other Alexa-enabled devices in your home, and power-on the television by saying “Alexa, turn on Toshiba”, or whatever you’ve chosen to name your TV during setup – but you’re not able to launch specific apps, such as YouTube, find individual shows, or even pause/play what you’re watching, as you can with the Amazon Fire TV platform.",
    "The visual layout here also isn’t quite as stylized as, say, one of Amazon’s smart displays (Echo Show, Echo Show 5, etc), but the Connect serves the same function as a basic Alexa gadget.",
    "It managed to pick up our voice relatively well, switching on the television while we sat a few feet away on the sofa, or while cooking in the kitchen. However, while we made good use of the mute button – to stop Alexa from listening when we didn’t want or need it to – the spring-loaded button would, after a few hours, simply unmute itself, which didn’t feel sufficiently reliable as a security feature. (You can, of course, just unplug the microphone if you wish.)",
    "Toshiba Connect effectively takes the place of an Alexa microphone in the remote, as you get with the Amazon Fire TV Stick. The UL5A’s remote does, however, feature a numerical keypad as well as the usual buttons for changing the picture source, bringing up a settings sidebar, or jumping to particular app shortcuts. There are individual buttons for Amazon Prime Video, Netflix, and FreeView Play, making it very convenient if these are apps you use often.",
    "TL;DR A perfectly functional design, with an interesting entry point for Alexa integration – even if it isn’t a killer feature.",
    "As to be expected with a budget TV, the UL5A comes with a budget smart TV platform. The interface is very basic – which might have worked in its favour if the menu layout wasn’t so inconsistent.",
    "There’s a Home button on the remote, but rather than jumping to a home screen from whatever app you’re in, this brings up a settings sidebar for switching between picture modes or audio settings. For the menu of apps and inputs you’ll need to hit ‘Guide’, which seems slightly unintuitive.",
    "The smart platform is also very slow to respond to the remote’s inputs. We would often select something, and then hit the same button again because we thought our press hadn’t been registered, which made for chaos when scrolling through the Netflix catalogue, which would suddenly double-click through to a show or film. Audio would also usually start playing before the video kicked in, though we had no synchronisation issues once a film or show was underway.",
    "You get the usual Dynamic, Natural, Cinema, Game and Sports picture modes found on most smart TVs these days – even showing the exact levels of contrast, brightness, and colour difference when selecting each one, giving you more of an insight into how you’re affecting the picture on your TV. The difference between them is slight, and you don’t get the automatic mode switch of some more premium TVs, but the offering is perfectly sufficient.",
    "TL;DR A sluggish smart TV platform, though the detailed picture settings are a welcome addition.",
    "While the Toshiba UL5A is a 4K TV, the majority of the content you’re likely to be watching will be in the lower HD resolution, rather than the 4K saved for high-end DVDs, certain subscription channels, and premium price plans on streaming services.",
    "For the price, the UL5A’s picture is impressive. Colours seem generally accurate, with a warm wash that holds even when viewed from an angle. The panel is more comfortable with high-contrast content, like animated cartoons, or the stark jerseys of footballers against a green pitch; with lower-resolution SD or HD content that has more of a real-world colour palette – browns, greys, blacks – the visual detail can appear muddy, with slightly grainy images. Motion handling, especially in Sports mode, is very capable of handling fast sprints down the pitch.",
    "The edge-lit panel can’t deliver the consistent brightness of backlighting either, and you’ll find that the light and dark sections of the display can vary: when watching the Critical Role webseries on YouTube, the panel of actors shown on the bottom half of the screen seemed to be somewhat paler than those shown above, with this disparity varying noticeably depending on what height we were viewing from. But this is a minor complaint from what is mostly an impressive viewing experience for the budget price.",
    "TL;DR A strong picture performance for the price, although don’t expect razor-sharp detail on this budget panel, especially for more day-to-day images.",
    "Of course, this is also a 4K TV, and you’ll likely be wondering how it fares with Ultra HD resolution content.",
    "The answer? Not much different.",
    "While this is technically a 4K panel, it isn’t advanced enough to make much difference with 4K content. It’s clearly sharper than the HD images, but doesn’t quite seem like full-blown 4K. The display does, however, generally manage to hold that middling detail together without too many glaring artefacts interrupting the scenes on show.",
    "The Toshiba UL5A has HDR on board too, and as such benefits from more vivid colors to give more punch to its picture – but again it’s something of a halfway house here. The UL5A lacks the wide colour gamut of the L7 series, while the panel lacks the brightness control to really make its existing colors pop out, with the images looking washed out compared to higher-end sets as a result. But you are able to play both HDR10 and Dolby Vision content, giving you a flavor of what these technologies are capable of.",
    "We did have some issues playing Dolby Vision content through Netflix to start with, finding ourselves faced with a blank screen while the audio track began to play – though this issue resolved itself within a day or so of testing.",
    "TL;DR Without a wide colour gamut, HDR isn’t shown off at its best – but you are getting a taste of more premium formats.",
    "Enough about the visual side of things, though – what’s the UL5A like on the ears?",
    "You might expect to get some bottom-dollar speakers in the Toshiba UL5A, given the price tag, but Toshiba has seen fit to equip its budget range with some respectable audio credentials. The capable Onkyo-designed drivers are placed in stereo, and feature enhanced Dolby Audio for a wider soundstage – though nothing like the Dolby Atmos surround sound you’d get on snazzier televisions.",
    "The sound is surprisingly good, with the UL5A’s rear-firing speakers packing a pleasing depth. Listening to Billie Eilish’s bellyache, vocals came across clearly and tunefully, even if the deeper, thudding bass of her track bad guy wasn’t quite delivered with its full impact. The UL5A isn’t quite up to bringing the beats for parties then, but it’s certainly good enough for relaxed movie night in.",
    "The L5 series televisions – the UL5A and VL5A – are also the cheaper models in Toshiba’s 2019 range, and the audio output reflects that. The UL7A and TL7A retail for slightly more – both starting at £449 for the 49-inch model and going up to £549 for the 55-inch – and for that extra cash the UL7A comes with more powerful 42W speakers, while the TL7A (like the VL5A compared to the UL5A) gets a more direct front-firing speaker array.",
    "The Toshiba UL5A, as the core model in Toshiba’s latest budget TV range, is certainly an affordable LED TV with a capable picture for the price. While premium technologies like 4K and HDR aren’t quite shown off to best effect here, you’re still getting the basics of higher resolution, as well as enhanced colour and contrast.",
    "The imperfections in the picture will also be more noticeable on the larger model sizes – like the 55-inch model reviewed here – so the smaller 43- and 49-inch models may be more suited to the TV’s strengths.",
    "The inclusion of Alexa is also an interesting move – at only £20 for the Toshiba Connect accessory, it’s the most affordable way to get Alexa into your home, even if it’s more limited in function than a full-blown speaker. For only a small increase in cost, though, a £35 Echo Dot will likely prove more useful as a smart home gadget in your home."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "14": "Smart TV",
    "19": "HD/SDR Performance",
    "23": "4K/HDR Performance",
    "29": "Sound",
    "33": "Our verdict"
  },
  "links": {
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "L5 series": "https://www.techradar.com/news/toshibas-2019-tvs-come-with-a-plug-in-alexa-microphone",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "some downsides to third-party Alexa devices": "https://www.techradar.com/reviews/i-box-century-review",
    "43-inch": "https://www.techradar.com/news/best-40-inch-tv",
    "55-inch": "https://www.techradar.com/best/55-inch-4k-tv",
    "Ambilight": "https://www.techradar.com/news/should-i-buy-a-philips-ambilight-tv",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Amazon Music": "https://www.techradar.com/news/what-is-amazon-music-unlimited",
    "Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5",
    "stop Alexa from listening": "https://www.techradar.com/how-to/how-to-stop-alexa-from-listening-to-you",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "smart TV platform": "https://www.techradar.com/news/best-tv",
    "Netflix catalogue": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review"
  }
}