{
  "source": "https://www.techradar.com/reviews/blackview-max-1-projector-smartphone",
  "title": "Blackview Max 1 projector smartphone review",
  "category": "phones",
  "updated": "2019-04-01T18:04:19Z",
  "author": "desire-athow",
  "summary": "A mobile phone that comes with a projector – but beware of the compromises",
  "verdict": "The Blackview Max 1 is a unique smartphone with a built-in laser projector. While its price tag and general performance may disappoint some, potential customers are likely to embrace this handset with enthusiasm, especially in light of its plethora of accessories.",
  "pros": [
    "Accessories galore",
    "Eye-pleasing design",
    "Projector works like a charm"
  ],
  "cons": [
    "Glossy glass body isn’t ideal",
    "Tacky user interface",
    "No 802.11ac Wi-Fi and Bluetooth still on 4.1",
    "More expensive than expected"
  ],
  "article": [
    "Remember the short-lived Ragentek Voga V (and the equally unfortunate Samsung Galaxy Beam)? Turns out that these handsets now have some competition in the form of the Blackview Max 1. Yes, one of our favorite rugged smartphone makers has decided to try something new and produced a phone that comes with a projector, which is ideal for impromptu business meetings.",
    "The Max 1 looks similar to the Voga V and is not a million miles away from your average mid-range consumer smartphone. There are two front-facing Samsung cameras (16-megapixel and 0.3-megapixel) plus a customizable indicator light. The design is clean, a far cry from the utilitarian looks of Blackview’s rugged smartphones.",
    "In terms of the construction here, glass is the primary material. There’s glass at the front and back, with plenty of rounded edges. Indeed, there is perhaps too much glass for our tastes, especially as Blackview didn’t bother using any oleophobic substance to keep away greasy fingerprints.",
    "There’s also the fact that using glass makes the Max 1 quite slippery, and glass can be easily scratched and cracked – but fortunately, we noticed a few cases are already available (including one which is bundled).",
    "Despite all the glass, the frame of the Max 1 is entirely fashioned from matte anodized metal, which gives it a clean, subdued, almost Apple-esque look, at least from the side. Note the absence of water drop or notch designs.",
    "The projector lens can be found at the top of the device, with the volume rocker and the power button on one side, and the SIM tray (which also doubles as a microSD card reader) on the other side. One downward firing speaker and a USB Type-C connector are located at the bottom of the device.",
    "Around the back there’s a pair of flash LEDs stuck between a single 16-megapixel Sony camera and a fingerprint reader. Weighing 209g, this handset is heavier than similar-sized smartphones thanks to the additional internal components. At 159.5 x 74.7 x 10.2mm, it remains reasonably portable.",
    "Unlike the Voga V, Blackview has bundled a few accessories with the Max 1. There’s a card from the founder and CEO of Blackview, Xu Ming (that’s a first), a remote control (handy for presentations), a manual for the Blackview BV9700 Pro (clearly a mistake), a microUSB converter, the charger, two USB cables, a Bluetooth speaker, a pair of Type-C earphones, a stand that doubles as a selfie stick (more on that later) and the aforementioned rubber case – all of which is housed in a big gift box. Impressive to say the least.",
    "The unique selling point of this phone is its projector, of course, and it’s probably the same model as the one in the Voga V – which is from Microvision and is known as the MEMS-based PicoP PSE-0403-103.",
    "This is a 720p projector with a brightness of 50 Lumens, autofocus, auto keystone correction, and up to five hours playback. Just be careful with drops and knocks as MEMS are mechanical parts and could be damaged during falls on hard surfaces.",
    "During our brief encounter with the Max 1, it was evident that this projector will deliver its full potential in a dark room, or failing that, very close to a white surface in a brightly lit room. In the first scenario, the colors were bright and the picture sharp, and the projector had no problems keeping up with fast moving movie footage.",
    "We also tried the Max 1 in a brightly lit room (with fluorescent lights) and with the projector placed 35cm from an improvised A4 sheet used as a screen. Overall, the projector’s performance was quite impressive, especially if you can somehow manage to use a white wall in a dark room. In the latter scenario, you will enjoy an almost cinematic experience if paired with a Bluetooth surround sound system.",
    "Blackview has also thrown in a stand that can hold the projector on a flat surface to provide an even better viewing experience.",
    "There’s not much to shout about when it comes to the rest of the hardware. The AMOLED display has a layer of Corning Gorilla Glass 3 on top, and offers a resolution of 2,160 x 1,080 pixels spread over a 6.01-inch diagonal. The resolution seems overkill, with Full HD being kinder to the battery, not to mention cheaper.",
    "Speaking of the battery, the Max 1 has a capacity of 4.68Ah, which is above average, but then again bear in mind that a projector will drain any battery very quickly.",
    "There’s no 802.11ac Wi-Fi, a real shame, and the Bluetooth version is only 4.1. But hey, there’s NFC at least. The phone runs Android 8.1 with a custom UI which, let’s put it gently, will divide opinions. We think it is tacky with brown icons that look as if they were designed in the mid-eighties.",
    "There’s almost no trace of bloatware on the Max 1 which is great to see. Google Web Services is strictly limited to the core essentials (no Meet or Hangouts), although there are a couple of must-haves like recorder, notes and compass. Also, the Max 1 shows its Mediatek heritage with the presence of gesture settings and DuraSpeed in the system settings.",
    "This is a unique phone targeting a niche audience that straddles both B2C and B2B. The only (sort of) competitor to the Max 1 would be a phone that is connected (by Miracast maybe) to a portable projector – and you’d still get a poor man’s version. Android-based projectors are sadly often laden with older Android versions, making them both impractical and indeed dangerous to use because of known flaws.",
    "The Max 1, for all its issues, is a very capable, modern, up-to-date smartphone that happens to feature an equally capable MEMS laser projector. Its general performance is solidly average, but with 6GB of RAM and 64GB on-board storage, it has more than a couple of years left in terms of hardware life expectancy.",
    "At $515, it is more than twice the price of the Lenovo S5 Pro, which is a superior smartphone, but lacks the projector and bevy of accessories. Is it worth paying extra for the Max 1? Definitely. Should Blackview get a Max 2 ready for next year which avoids the pitfalls of the current model? Absolutely.",
    "We’d like more storage, stock Android, less glass, flush lenses and 802.11ac Wi-Fi – that’s not too much to ask, right? It’s also a shame that you cannot easily connect an external source to the smartphone, but given that it is OTG compatible and has a microSD card slot, the Max 1 covers almost all options."
  ],
  "headers": {
    "1": "Design",
    "8": "Performance and usage",
    "17": "Business take"
  },
  "links": {
    "Voga V": "https://www.techradar.com/reviews/voga-v",
    "Samsung Galaxy Beam": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-beam-1090224/review"
  }
}