{
  "source": "https://www.techradar.com/reviews/canon-powershot-g7-x-mark-iii",
  "title": "Canon PowerShot G7 X Mark III review",
  "category": "cameras",
  "updated": "2020-01-15T17:00:57Z",
  "author": "matt-golowczynski",
  "summary": "Canon's most video-focused PowerShot yet",
  "verdict": "The PowerShot G7 X Mark III faces some strong competition from the likes of Sony and Panasonic, but with a longer-than-usual lens, great handling and a whole suite of niceties for videographers, it succeeds in offering enough to warrant its place in a populated section of the market.",
  "pros": [
    "Great handling and build quality",
    "Effective face detection",
    "Responsive and clear touchscreen",
    "Mic port is a very nice touch",
    "Very effective image stabilization",
    "Nice colors in images"
  ],
  "cons": [
    "No hotshoe for external mics",
    "No built-in viewfinder",
    "Slightly aggressive noise reduction",
    "AF system a little dated",
    "Overexposure frequently occurs"
  ],
  "article": [
    "This is TechRadar’s review summary that gives you all the key information you need if you’re looking for quick buying advice in a minute – our usual full, in-depth review follows.",
    "The PowerShot G7 X Mark III takes the baton from its G7 X Mark II predecessor, arriving with a fresh 20.1MP, 1-inch sensor, a newer DIGIC 8 processing engine and the ability to capture images at up to 30fps with its new Raw Burst shooting mode.",
    "With previous G7 X models proving a smash among vloggers, it's no surprise that the most significant changes concern video recording. So, on top of what we had previously, Canon has shoehorned in 4K UHD recording, together with a 3.5mm mic input and Iivestreaming to YouTube.",
    "Elsewhere the camera packs the same lens as before, with a 24-100mm range in 35mm terms; a flip-up LCD screen; and four physical control dials around the body. Wi-Fi and NFC both feature, as does the option to charge the 265-shot battery through the camera's USB-C port.",
    "The body has been built well and sits comfortably in the hand, with a nicely sculpted grip and plenty of rubber for both comfort and security. The camera starts up quickly, and focusing is generally nice and prompt, with face detection working particularly speedily, and adhering well to subjects.",
    "The EOS-style interface gives you great control over your picture making too, and the responsive touchscreen makes focusing on subjects and swiping through images a breeze, although it's a shame there's no hotshoe on the top plate to support the microphones that can now be plugged into the camera's side.",
    "Image and video quality are generally very good, with low image noise at the bottom end of the camera's sensitivity range, nice colors and a good level of detail in the center of the frame. The camera can be easily led to overexposure, however, and some softness can be seen at the edges of the lens too, with images showing most softness at both the wide-angle and telephoto ends, although they improve in the middle of the range.",
    "Video can be recorded in both 4K and Full HD quality, and performance overall here is good. Videos don't quite have the crispness we've seen from some other models, but for general vlogging purposes there's little to complain about.",
    "Overall, the PowerShot G7 X Mark III has plenty going for it, both as a video-first compact and as a pocketable stand-in for a larger system camera. Its spec sheet is sound and it handles well, and it's capable of speedy operation and fast focus. We'd like to see a little more consistency from the lens, but image and video quality are generally good, and while the lack of a hot shoe and viewfinder is a pity, Canon does have other PowerShots that offer these features.",
    "The Canon PowerShot G7 X Mark III has amateur videographers as a strong focus, with a raft of new video-specific functions helping to boost its appeal among that audience. It is, however, also a camera that's very much targeted towards the enthusiast photographer who demands a certain level of image quality and a high degree of control over operation. Unless video is your thing, there's probably not enough here to warrant anyone upgrading from the existing G7 X Mark II, although G7 X users would see a considerable difference between the Mark III and that model.",
    "Enthusiast compact cameras have come some way since Canon's PowerShot G7 X was launched back in 2014. That model, together with its G7 X Mark II successor, was initially aimed at photographers looking to travel light without compromising on image quality, although both cameras came to be well regarded by amateur videographers too.",
    "Capitalizing on this interest, the PowerShot G7 X Mark III gets a handful of video-centric technologies to make it appeal more strongly to vloggers, although there have been plenty of changes elsewhere to keep those focusing on stills just as happy.",
    "Highlight features include a 20.1MP 1-inch stacked sensor – that may have the same number of pixels as before, but this is a new design – together with a DIGIC 8 processing engine. The lens has been carried over from the G7 X Mark II, with a range of 24-100mm in 35mm terms, and a maximum aperture of f/1.8-2.8.",
    "That new processor and sensor combination has also allowed for some gains to burst shooting. 20fps is now possible at full resolution – that's more than twice as fast as the Mark II – while a new 30fps Raw Burst shooting mode lets you capture images even more speedily, albeit without autofocus or auto-exposure.",
    "4K video recording without a crop has been added on top of the previous Full HD capture, the latter recording up to a respectable (if not quite class-leading) 120p for slow-motion output. Vertical shooting and livestreaming to YouTube are also now on board, as is a mic port and an ND filter inside the lens to help balance exposure.",
    "The PowerShot G7 X Mark III doesn't match its PowerShot G5 X Mark II launch partner in being equipped with an electronic viewfinder, nor has a hotshoe been fashioned into the top plate to accommodate an external one, although the 3-inch touchscreen is reasonably flexible in that it can be tilted up and all the way around to face the front, to allow for all kinds of orthodox and unorthodox shooting angles.",
    "Other features include USB charging, in-camera raw processing and the same style of menu system that graces the company's more advanced mirrorless and DSLR cameras.",
    "Compact cameras of this kind can often be tricky to handle, but Canon has done a stellar job of ensuring that the PowerShot G7 X Mark III strikes a fine balance between usability and portability.",
    "The defined grip provides a more secure hold than would otherwise be the case, while the liberal use of rubber around the body makes the camera feel safe and comfortable in the hand. While most of the physical controls appear to be made from polycarbonate rather than metal, build quality and attention to detail overall are high.",
    "The control ring around the optic has been crafted from metal, and this feels far nicer to operate than the one on the PowerShot G5 X Mark II. The exposure compensation dial is fairly large, but a little stiff and somewhat recessed behind the rubber thumb rest, although while that makes it harder to turn, it also reduces the chance of it being knocked out of place inadvertently.",
    "Some may find the mode dial above this to be a little small, but then most photographers won't be adjusting this with enough frequency for this to matter. All the buttons travel well into the body when keyed.",
    "One thing that may disappoint videographers is the lack of a hotshoe. This was also absent on the PowerShot G7 X Mark II, but the fact that we now have a port for external microphones makes the lack of a hotshoe more disappointing here, as this would have provided a perfect home for mounting these.",
    "Start-up takes around half a second, which is very reasonable, and powering down is nice and speedy too. And once you enter the menus you're greeted by a familiar EOS-style structure, which places a lot of control in your hands.",
    "The camera responds excellently when options are adjusted, be it a simple change to exposure parameters or when scrolling through images using the rear dial. When operating this dial, however, it's somewhat easy to bash into the side of the LCD – this isn't an issue that's unique to the PowerShot G7 X Mark III, but rather a common consequence of trying to squeeze so much into such a small space.",
    "The LCD itself performs well in harsh light, and the fact that you can physically adjust it makes a difference with visibility in practice too. It also happens to be very responsive to touch, which makes focusing on subjects pretty effortless.",
    "While the camera's focusing system doesn't appear as strong on paper as those of rivals that combine phase- and contrast-detect AF systems, focusing is still generally very good. It's speedy enough in good light, and the slight slowdown in moderate light is nothing more than what we'd expect.",
    "The tracking system does very well to keep up with subjects, and this has been implemented well; you simply need to tap the subject on the screen, and the camera applies a box that stays with it. Face detection also does a great job, both with regards to the speed of initially noticing the subject and then adhering to it as it moves around.",
    "The previous PowerShot G7 X and G7 X Mark II were respected for their image quality, and with a fresh sensor we should expect the standard to be at least as good here.",
    "The lens hasn't changed, which is good in a sense, as it covers a decent focal range by the standards of most 1-inch-sensor cameras, and has a very respectable maximum aperture. It can, however, be a little soft at either extreme; this is less noticeable when the subject is less detailed and relatively close to the camera, but more distant and/or complex subjects highlight the slight inconsistencies through the range.",
    "Detail is, however, generally very good in the center of the frame, particularly when you stop down the lens to a more mid-range aperture setting. Slight corner softness can be seen, particularly in wide-aperture images, but this is only really noticeable when pixel peeping.",
    "The camera's metering system performs well overall, although it does tend to be a little prone to overexposure. This is easily remedied with the exposure compensation control, which also serves to improve colors that can be a little washed-out in overexposed shots. But colors in images captured in more balanced conditions are perfectly good, and the option to tweak raw images after capture in the camera is useful.",
    "Video quality is also generally good – not quite as crisp as some of the results we've seen elsewhere from 1-inch-sensor cameras, but certainly detailed enough for everyday use. There's a little rolling shutter when moving around, and some wind noise can be picked up by the built-in mics when you're shooting outside, but this isn't unusual for such a camera.",
    "The G7 X Mark II was a compact and well-liked camera, one that presented a handful of key improvements over the previous G7 model, and the Canon PowerShot G7 X Mark III improves things even further with stronger video specs, speed-related enhancements and a handful of further tweaks.",
    "While it falls behind some of its Sony RX100-series rivals in a few areas – the lack of an EVF, and its more basic AF system, for example – features like the 30fps Raw Burst mode and in-camera raw processing show it to have a few advantages too.",
    "And while you can get a Sony RX100-series model with a mic port, this feature is confined to the RX100 VII right now, which is considerably more expensive than the PowerShot G7 X Mark III. Some may have also hoped for a viewfinder, although for that there's always the PowerShot G5 X Mark III, which mirrors much of the spec sheet here.",
    "So the Canon PowerShot G7 X Mark III ends up carving out something of a niche for itself in a busy sector of the market. It's capable of nice images and very good videos, and it's backed up by a strong secondary set of features, from speedy burst shooting to EOS-style control, and many physical controls. It's not without some very capable rivals that manage to outgun it here and there, but when you consider what it offers for the money, it shows itself to being a very capable all-rounder.",
    "If the Canon PowerShot G7 X Mark III isn't quite for you, we’ve picked three excellent alternatives for you to consider."
  ],
  "headers": {
    "0": "The Essential Review",
    "9": "Who’s it for and should I buy it?",
    "10": "Beefed-up specs across stills and video",
    "17": "Design – it's largely business as usual",
    "27": "Image quality",
    "32": "Verdict",
    "36": "Not convinced? Try these..."
  },
  "links": {
    "G7 X Mark II": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/compact-cameras/canon-powershot-g7-x-ii-1321935/review",
    "Canon's PowerShot G7 X": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/compact-cameras/canon-powershot-g7-x-1264978/review",
    "PowerShot G5 X Mark II": "https://www.techradar.com/reviews/canon-powershot-g5-x-mark-ii-review"
  }
}