{
  "source": "https://www.techradar.com/reviews/fifa-20-review",
  "title": "FIFA 20 review",
  "category": "gaming",
  "updated": "2019-11-27T17:07:03.248Z",
  "author": "jordan-oloman",
  "summary": "Living la Vida Volta",
  "verdict": "By listening to player feedback and implementing some inspired changes, EA has made FIFA 20 feel like a worthwhile content package for patch note-scouring series veterans and an enticing entry point for first-timers and rule breakers who like a little fun to go with their soccer.",
  "pros": [
    "Volta soccer is a neon revelation",
    "Admirable pace",
    "Defending tweaks",
    "Zany modifiers",
    "Electric soundtrack"
  ],
  "cons": [
    "Career Mode still needs a revamp",
    "Visual upgrades are negligible"
  ],
  "article": [
    "The eternal arguments that annually dominate discussion of FIFA games are tired and drawn out. There are two sides of the aisle: the people who don’t play FIFA and attempt to denounce it as some sort of anti-game, and the people who buy it but complain that it never changes. The latter is usually followed by a naive aside about how EA should just call the overall game ‘FIFA’ and update it every year.",
    "Alright, we get it. EA only makes small changes to a trusted formula - a method employed by plenty of franchises in the past decade. Perhaps it’s the physical distance from the action, or the recursive gameplay which hasn’t changed in a long time, that makes this pointless argument reappear. But once more the arguments have resurfaced as FIFA 20 has steadily approached store shelves with all the inevitability of the rising sun.",
    "With this year's iteration of the stalwart series, EA appears to have made some bold strides in the right direction, especially when it comes to giving players what they’ve been asking for in terms of game modes and statistical tinkering. Yet, is this merely appeasement whilst the larger systems stay frustrating, or does it suggest a meaningful commitment to improving the beautiful game with fan feedback in tow?",
    "Let’s start with the most sizeable expansion to the base game: Volta soccer. Volta’s main folly is that it tries way too hard to be cool, but when you get into the dying throes of a match on a Tokyo rooftop, you realize it is true lightning in a bottle.",
    "At 3v3, with the caged walls up, Volta boils down FIFA to its most social and exciting elements. Hearing the bass blaring and watching the gaudy celebrations, it complements perfectly the sweaty-browed, expletive-laden couch co-op experience we all gravitate to FIFA for. The adrenaline is always felt in the air as you put together a skilful run down the wing and use the cage to rebound the ball into a gravity-defying, friendship-ruining volley.",
    "The story mode is... really not worth mentioning. It doesn’t have the beating heart of The Journey, but the variety of locations, gloss and neon make up for that. You can skip the cringy cutscenes and moan (quite rightly) about the long knockout tournaments, but the part worth caring about is the gameplay itself.",
    "Volta is all about showmanship, skill and making a fool of your opponent. Matches are finished by accumulating a set number of goals, and can be over and done with in an instant or an age if you’re matched with a capable player. This marks the first time men and women can share a pitch in a FIFA game too, which is a welcome delight.",
    "Skill moves are naturally quite important here, and it’s all about creating fluidity between your teammates by using your environment, ensuring they have proper positioning near the box so they can hammer away goals and embarrass the opposition. It’s great fun if you aren’t a stickler for the rules, and it feels like a modernized version of FIFA Street, which is quite the bold compliment.",
    "In the same way though, Volta feels bogged down by the fact that it isn’t exactly FIFA Street. The option to have no walls feels counterintuitive and less fun, as does increasing the team size to 5v5. When Volta starts to appear more like the polished ‘proper soccer’ found elsewhere in FIFA 20, you start to see the sharp edges.",
    "A focus on fun and listening to the fans arises elsewhere in the FIFA 20 package, most notably in the new rule-breaking game modes that have made their way into Ultimate Team. They’re hit and miss in terms of successful quirks, with the ball-holding King of the Hill amounting to a frustrating bore but No Rules hackathons and Survival matches (where a random player is ejected from the scoring team after putting away a goal) delivering some of the most refreshing matches of FIFA we’ve played in years.",
    "Crucially, for those of you in a household where there’s always a game of FIFA to be played, the ability to turn on some Rocket League-esque wacky modifiers is appreciated, and coats FIFA 20 in a light-hearted veneer which, when combined with Volta, helps to hack at its stoic exterior. This charm is aided by a diverse soundtrack which taps Jorja Smith, Mura Masa and Slowthai.",
    "Set pieces are now stick-targeted and far more creative. You can add varying degrees of spin with the right stick to your extra time upsets to really dismantle your opponent’s entire FIFA career. It certainly makes things more complex, but rising to the challenge is part of the buy-in with FIFA 20, as it really strives to expose and convince you into playing the kind of soccer the game wants you to play. From a simple tackle to an eight-pass finish, everything is earned in this year’s beautiful game, and we’re pleased to say that a lot of what you may call “sweaty” tactics have been ironed out.",
    "FIFA now has a serious emphasis on vision, with player positioning and pre-empting good runs being top priority. Watching for hands raised in the corner of your eye and keeping an eye on your wingers is essential. You can’t wait too long to cross when you’re on the attack, or your opponent’s tight defensive formation will stop your approach in seconds.",
    "Our personal habit was holding R2 too much and consistently replacing a pass with a through ball. We’ve had to face our demons and relearn the wheel here, but it doesn’t feel punishing, more so like it’s opening an avenue to a more rewarding game of soccer. Victories are far more sweet when you play tactically and savor each pass. Wider ramifications are felt because of this: games don’t have the inexplicable wonder goals they used to, but they do have more calculated finishes which don’t feel so fleeting. Realism!",
    "Another consequence is that there are far less dangerous two-footed tackles in FIFA 20, a consequence of revamping the pace system to give players genuine speed.",
    "Deandre Yedlin is an unstoppable force when you flick the stick to send him hurtling down the wing, and even one defender out of position will more confidently lead to an opposing ball in your net. The minutiae of player attributes feel like they mean something as a result, especially when they’re aired out properly in Ultimate Team.",
    "Shooting is still difficult to master, with particular thanks given to the controversial mini-game introduced in FIFA 19 where you have to hit the circle button once more to finesse the shot, which still feels rather unnatural. You can just ignore it, but its existence is obtrusive regardless. Visuals are much too similar to FIFA 19 with a few coats of polish (the sheen on Jonjo Shelvey’s head is blinding) but at this point, we’re going to have to wait until the next generation of consoles to see a true graphical upgrade in a FIFA game - if that’s something you even care about.",
    "In career mode, you can now reply to late night texts from Jamaal Lascelles, if you fancy, in order to keep morale high with your players. Beyond that there are some fun interactive press conferences, but it’s really all set dressing rather than a proper overhaul. It’s fine!",
    "Ultimate Team now has a battle pass progression system and, by proxy, more means to receive coins and packs to offset the predatory economy. There’s also some fantastic quality of life improvements to the menus, including a radial bar that automatically tells you which consumable you need to use. It’s still just as addicting as it was five years ago, but now navigating menus and dredging through your transfer list is more efficient. It’s certainly not broken, and it doesn’t need fixing.",
    "FIFA 20 has a lot going for it. Things have definitely changed on the ground level, mostly for the better, though there will no doubt be petitions and exploding subreddits a few months after launch regardless. Such is the trial of trying to balance the world’s most popular sports game.",
    "With a fantastic new way to play in Volta, a light-hearted set of modes for couch co-op and some clever, nuanced gameplay tweaks that coax out a more fair and rewarding game of soccer, this is definitely not an inbetween year or an easy skip if you’re a franchise fan. In fact, it might be the best FIFA game in a good few years, achieved mainly by responding to fan feedback with healthy design decisions."
  ],
  "headers": {
    "3": "Electric feel",
    "9": "House rules",
    "12": "Bad habits",
    "19": "Verdict"
  },
  "links": {}
}