{
  "source": "https://www.techradar.com/reviews/marshall-major-iii-voice",
  "title": "Marshall Major III Voice review",
  "category": "audio-visual",
  "updated": "2019-11-06T12:56:22Z",
  "author": "olivia-tambini",
  "summary": "A Major battery upgrade",
  "verdict": "If you need a pair of wireless headphones that will last you all week long on a single charge, the Major III Voice are a great option – and come with built-in support for Google Assistant. However, if you’re obsessed with audio fidelity, you’ll want to look elsewhere.",
  "pros": [
    "Outstanding battery life",
    "Support for Google Assistant",
    "Good connectivity"
  ],
  "cons": [
    "Uninspiring sound",
    "Not very comfortable"
  ],
  "article": [
    "Known for its instantly-recognizable guitar amps, Marshall’s foray into the world of headphones has been marked by cool, retro-looking cans with modern conveniences like Bluetooth connectivity – and now, built-in voice assistance.",
    "The Marshall Major III Voice headphones come with support for Google Assistant built-in, allowing you to summon the helpful voice assistant at the touch of a button, as well as double the battery life (and the price) of their wired predecessor.",
    "But how much of an improvement are they over the original Major IIIs? We put these vintage-style on-ear headphones to the test to see if that steep price hike is really justified.",
    "The new Marshall Major III Voice headphones are available to buy for $169 / £149, which works out at around AU$245; however, they aren’t yet available to buy in Australia, despite being advertised on the Marshall website.",
    "That’s a considerable price increase from the original wired Major IIIs, which are available to buy from the official Marshall Headphones store for $79 / £69 / AU$149.99.",
    "That being said, the wireless version of these cans, the Major III Bluetooth headphones, cost $149.99 / £129.99 / $249.99, so you’re only looking at a $20 increase if you’ve already become accustomed to the wireless way of life.",
    "In terms of design, the Marshall Major III Voice headphones haven’t changed dramatically since their wireless predecessor was released in 2018. They sport the same compact on-ear design, which is fully collapsible so you can easily stow them away in your bag when not in use.",
    "Based on Marshall’s iconic amps, these wireless headphones make use of the brand’s signature leather look (although this material is actually made of lookalike vinyl, vegans will be pleased to know), with gold accents, sturdy metallic hardware, and the Marshall script proudly displayed on the outer housings.",
    "The square-shaped cups found here feature 3D hinges that can rotate freely, so whether you’re wearing them on your head or around your neck, they should adapt to your body for a secure fit. Both the hinges and sliders are made from metal, and as a result, the headphones feel robust and well-made.",
    "On the left housing you’ll find a gold control knob, which allows you to play, pause, shuffle, and adjust the volume of your music, as well as turn the Major III Voice on and off. This multi-functional button can also be used to answer, reject, and end calls.",
    "The right housing features the all-new voice assistant button – press this to summon Google Assistant on your smartphone or tablet, which you can then command using your voice alone.",
    "With a straight band and heavily padded on-ear cushions, the Major III Voice headphones are designed to be comfortable for long periods of time; however, we found the opposite when we tested them.",
    "Listening to music for 30 minutes was enough to induce that clamping feeling that’s all too common with on-ear headphones – an hour spent with the headphones on left our ears feeling quite sore. If you also experience this problem with on-ear headphones, we’d recommend opting for over-ear headphones, which are usually more comfy, surrounding your ears rather than being placed on top of them – or, for ultimate ear-breathability, try some in-ear headphones.",
    "While these cans are wireless, they do come with a detachable coiled wire, which feels durable enough, coming with a one-button remote that can be used to control your music playback. Unlike their wired predecessor, there’s only one 3.5mm jack to plug into, but that’s not a huge issue unless you’re looking for audiophile-quality fidelity – which is not what you get with these rock-inspired cans.",
    "New to this generation of the Marshall Major III headphones is support for Google Assistant – simply press a dedicated button on the outer right earcup to summon the voice assistant on your device.",
    "Once summoned, you can ask Google Assistant things like “what’s the weather like today?”, or “what’s on my calendar this week?”, as well as asking it to control your smart home gadgets like smart lights and security cameras.",
    "Google Assistant can also read out your notifications, saving you the trouble of getting your phone out every time you get a text or email. It’s certainly a useful feature – provided you use Google Assistant as opposed to Siri or Alexa, of course.",
    "Battery life is exceptional, with 60 hours of wireless playtime on a single charge; that should be more than enough to get you through your weekly commute, and it leaves many of the best wireless headphones in the dust.",
    "Bluetooth connectivity is good; pairing the Major III Voice with our smartphone was totally seamless, and we didn’t experience any dropouts, despite using them in a ‘high-traffic’ area with lots of other devices competing for connectivity.",
    "As with the original Marshall Major IIIs, these headphones come with 40mm dynamic drivers that are designed to displace lots of air for a powerful sound. Overall, the sound is relatively balanced, and will work fine if you’re wanting to soundtrack your commute – however, these aren’t audiophile headphones by any stretch.",
    "They’re at their best when playing guitar music; the gently strummed guitar in Bon Iver’s For Emma sounds warm and natural, while Justin Vernon’s falsetto vocal has a rich, resonant quality. The same can’t be said when the vocals dip into the mid-low ranges, where they feel lost amongst the other frequencies.",
    "Moving on to the more energetic 10 dEAThbREasT, it becomes clear that the Major III Voice don’t possess the precision or agility to faithfully replicate the complex, distortion-heavy chopped and screwed beats in this track.",
    "They fare better with Wild Beasts’ All The King’s Men, in which baritone vocals sound rich and sonorous, while meandering bass lines underpin complicated drum fills and undulating guitar riffs.",
    "Simple guitar-based songs are where these on-ear cans shine; Bright Eyes’ We Are Nowhere And It’s Now sounds natural and clear, with good separation between the different frequencies.",
    "Overall, the audio quality is fine, if not a bit dull; there’s no sparkle at the top end to give your music a sense of liveliness, while the warm presentation sometimes makes the bass feel weak in comparison to the other frequencies.",
    "That being said, that overall warm tone is very forgiving, and it does make for an enjoyable listening experience.",
    "The soundstage isn't particularly wide either, which is compounded when listening to complicated, highly textural tracks – although it does feel more ‘open’ with simpler songs.",
    "There’s a lot to like about the Marshall Major III Voice – they sport a quirky retro design with a company heritage that any discerning rock fan is bound to appreciate.",
    "The vintage-style design won’t appeal to everyone, but there’s no denying that the combination of black leather-look vinyl and gold accents is really attractive – it’s just a shame that they aren’t as comfortable as the padded earcups and headband might suggest.",
    "They’re incredibly convenient to use, with an exceptional battery life and support for Google Assistant built in; pairing is also seamless, while the option for wired listening is good to have in case you do run out of juice on the go. For a price increase of around $20 (£15 / AU$20), the new battery life is a fantastic upgrade of the Major III Bluetooth headphones.",
    "Where the Major III Voice are let down is the audio quality; it’s passable, and to an extent, what you’d expect at this price, but don’t expect to pick out hidden details in your favorite tracks or to be blown away by the bass.",
    "As expected from a rock-inspired pair of headphones, they fare better with guitar-based music – if that’s your jam, these could be the cans for you."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "14": "Features and battery life",
    "19": "Sound performance",
    "27": "Final verdict"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "original Major IIIs": "https://www.techradar.com/reviews/marshall-major-iii",
    "on-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-on-ear-headphones-1304537",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925"
  }
}