{
  "source": "https://www.techradar.com/reviews/asus-zenbook-ux310ua",
  "title": "Asus Zenbook UX310UA review",
  "category": "computing",
  "updated": "2019-08-26T18:51:34Z",
  "author": "henrietta-rowlatt",
  "summary": "A lovely looking laptop",
  "verdict": "An aesthetically pleasing machine with a pleasant price tag. If you can get over the middling battery life then you might be looking at your next office workhorse.",
  "pros": [
    "All aluminium body",
    "Backlit keys",
    "Wonderful screen",
    "Fast to wake up and use"
  ],
  "cons": [
    "Bendy keyboard",
    "Meh battery life",
    "Small hard drive"
  ],
  "article": [
    "The Asus ZenBook UX310UA doesn’t initially look like much, but it’s definitely worth digging into. Not only does this Ultrabook have a stunning aesthetic and plenty of horsepower, but it’s so finely tuned that the Asus ZenBook UX310UA may be the best laptop for anyone on the market for a versatile machine.",
    "This device stands on the shoulders of the original MacBook Air, which was itself once considered the zenith of slim, sophisticated design housing powerful hardware. This, in itself, is enough to make the Asus ZenBook UX310UA worth your time.",
    "This just goes to show that the Taiwan-based firm is determined to keep refining its Asus laptops – and the new Asus ZenBook S13 proves that even more – so much so that we consider this laptop the de facto heir to the MacBook Air’s throne.",
    "It’s almost as if Asus stepped up and said, “Well, if Apple won’t do it, we will.” Talk about courage…",
    "You can get the Asus ZenBook UX310UA we tested here for around £899 (about $1,040, AU$1,400). In comparison, you can buy the slightly more powerful Dell XPS 13 2017 for £999 ($799, AU$1,400) – with configurations going for even more. Dell’s laptop is speedier, but at that price it should be.",
    "The Lenovo IdeaPad 710S is available for a similar price, but it’s afflicted by an uncomfortable keyboard layout, and it’s sadly packed to the brim with bloatware. Asus tested the waters with the ZenBook UX310UA, as many similar laptops go for a touchscreen or the 2-in-1 route. The Asus ZenBook UX310UA doesn’t – it’s a traditional laptop done right.",
    "To start, the Asus Zenbook UX310UA is beautiful, possibly better looking than the old MacBook Air, in case it’s not apparent from the spun metal glare on its all-metal finish.",
    "Those concentric circles flowing outward from the Asus logo? They’re just as stunning in real life as they are in our photos. And, the smooth lines around the edge are even more apparent. The icing on the cake, though, is that you’re saving money by going with a ZenBook. The MacBook Air is pricier while containing older hardware.",
    "Before you’ve even booted it up, the packaging is elegant. Unlike a lot of laptops, this one is worthy of an unboxing video.",
    "Upon lifting the lid of the laptop, the message ‘In Search of Incredible’ appears, engraved on the inner lid, which is a nice touch. There’s a noticeable absence of plastic and cable ties, too. Of course, the MacBook Air 2017 still comes in first when it comes to the charger, as it’s one of the few machines still using the fantastic MagSafe charger – though the new MacBook Air doesn’t. The Asus ZenBook UX310UA, however, settles for an L-shaped plug, but it does the job.",
    "In regards to ports, the Asus ZenBook UX310UA has more than enough. Along the left side of the computer, you’ll see that round charging socket, a USB 3.0, HDMI, USB-C and a headphone jack with an integrated microphone socket.",
    "The right side has two USB 2.0 ports, an SD card reader and a couple of lights, one for the hard drive and the other to indicate that it’s actually on, or if the battery is charging.",
    "It’s unfortunate that the two USB inputs on the right aren’t 3.0 like the one on the left, but it’s appreciated that a USB-C port was included.",
    "Also, the USB 3.0 port on the left-hand side of the device supports USB Charger + technology, letting you quick charge external devices even when it’s off or hibernating. The Asus ZenBook UX310UA features software that can control the laptops’ battery when using this functionality.",
    "Comparing it to the competition, the Asus ZenBook UX310UA is mostly in the same league. It’s not quite as slim as the 2017 Macbook Air which is 1.7cm, while the laptop we reviewed here is 1.84cm and undeniably is without the tapered end.",
    "Lenovo’s Ideapad 710S has similar specs and is slimmer but has a poorer screen. HP’s Spectre x360 is also thinner but its starting price starts at £1,199 ($1,049, AU$2,299).",
    "In order to keep the price down, Asus did increase the thickness, but kept the build quality high. A fair bargain in our eyes.",
    "The Asus ZenBook UX310UA isn’t just good-looking, it also has a beautiful screen. We were given the QHD 3,200 x 1,800 configuration to test, but it’s also available with a full-HD 1,920 x 1,080 panel.",
    "This QHD panel is a splendor to behold, too. With wide-viewing angles, and Anti-Glare that functions as publicized, it’s hard to find much to complain about.",
    "You won’t see much in the way of edge burn when the screen is blacked out, and the colors are well-defined, deep and look brilliant. This screen could work for photographers on the move, thanks to its color accuracy.",
    "And, if we were to put it up against the Macbook Air, at the same price point you most definitely wouldn't be getting a Retina screen. If we have one criticism, the bezel is a little larger than we would prefer, but it’s not too obtrusive.",
    "At first, we thought the keyboard didn’t quite make the cut, as typing causes a slightly disorientating bend in the center. However, the bend doesn’t affect the usability, as once we adjusted to it, it’s a perfectly functioning mechanism with low noise and reliable keys. But you may need to give it time to adjust if you're used to rock-solid keyboards.",
    "Likewise with the trackpad, it took a bit of setup and getting used to. The pinch zoom sadly doesn’t work well, as it would often get set off while using two-finger scrolling.",
    "In the end we had to turn off the zoom and just turn to keyboard shortcuts. Not an ideal solution, but we prefer to be able to use the two-finger scroll and can live without pinch zoom. The pad itself feels a little slippery compared with others. But again, this is not a deal breaker and these annoyances are fixable.",
    "First reviewed November 2017"
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "17": "Screen and interface"
  },
  "links": {
    "best laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "MacBook Air": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-air-1300233/review",
    "Asus laptops": "https://www.techradar.com/news/best-asus-laptops",
    "Asus ZenBook S13": "https://www.techradar.com/reviews/asus-zenbook-s13",
    "Dell XPS 13 2017": "https://www.techradar.com/reviews/dell-xps-13-2017",
    "Lenovo’s Ideapad 710S": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/lenovo-ideapad-710s-1312207/review"
  }
}