{
  "source": "https://www.techradar.com/reviews/instant-pot-duo-v2-7-in-1-electric-pressure-cooker-review",
  "title": "Instant Pot Duo V2 7-in-1 Electric Pressure Cooker review",
  "category": "appliances",
  "updated": "2019-11-08T15:35:11Z",
  "author": "ava-szajna-hopgood",
  "summary": "The cult multi-cooker that claims to do it all",
  "verdict": "The Instant Pot Duo is so effective, you may as well donate everything else in your kitchen right now.",
  "pros": [
    "Large capacity",
    "Makes batch cooking a breeze",
    "Instant and slow cooking capability"
  ],
  "cons": [
    "Hands-off approach won’t be for everyone",
    "Takes up a lot of kitchen space"
  ],
  "article": [
    "Instant Pots already have a cult-status in the US and Canada, and it’s easy to see why. The “set it and forget it” multi-cooker could replace almost every other appliance in your kitchen, and achieve better results in half the time.",
    "Rice? Got it covered. Soup? Already made. Those cheaper cuts of meat you’d never usually attempt to cook with? About to become the hero item of this stew. Say hello to recipes you could never be bothered to do in the past, and a lot less time to make them in. It's the best Instant Pot you can get.",
    "While lots of pressure cookers claim to offer an array of programmes, Instant Pot takes it a step further with their next-gen electric cooker that’s both a slow cooker and pressure cooker. This means you can slow cook, steam and sauté, pressure cook and choose from 14 programmes to achieve it all.",
    "With prices usually hovering around the £90 / $100 mark, the Instant Pot Duo V2 sits slap in the middle of what you can expect to pay for your average pressure-come-slow-cooker.",
    "However, it's very much above average given that price – in fact, from its pre-programmed options to the quality of the food it cooks, we'd consider it pound-for-pound the best multi-cooker on the market.",
    "The Instant Pot sets out to replace seven kitchen appliances, which are listed as a pressure cooker, slow cooker, rice cooker, steamer, sauté pan, yogurt maker and warmer. While you’ll be hard-pressed to find anyone that operates all those machines in one home kitchen, Instant Pot’s 14 programs mean you’ll have the potential to cook a huge array of dishes without having to buy a yoghurt maker or rice cooker separately. Unlike other slow cookers, it’s safe to keep food warm until ready to serve - which isn’t an option with cheaper models.",
    "We reviewed a 5.7 litre (6 quarts) Instant Pot and found it to be the perfect size for batch cooking, without having to totally rethink your kitchen when plugging it in or storing it. Remember that pressure cookers have strict maximum capacities, and you’ll need to add enough liquid at the start of cooking to ensure your food doesn’t burn. This means you may want to start with a bigger pot than you’re accustomed to, so you can fill the right amount of cooking liquid and end up with multiple portions of food at the end.",
    "Despite the volume, this is a compact design, and it’s very easy to work through the different programs once you’ve had a close read of the safety guidelines. The timer is also useful - you can go and do other things and know exactly when you’ll be needed back in the kitchen. The Instant Pot’s lid makes a pleasing little beep when you close and open it, and you’ll hear it beeping from another room when it finishes a program. We were, however, surprised to see the dial plastic wearing away after a week or so.",
    "The Instant Pot claims to speed up cooking by two to seven times. We were impressed by how much this held true, especially with recipes that take hours on a traditional stove or oven. Tagines, chillies and curries were rich and succulent within twenty minutes of pressure cooking. Soups and stocks achieve a velvety consistency we’ve never been able to reach via stovetop techniques alone.",
    "It’s also important to note that due to retaining heat and pressure, multi-cookers require less electricity to operate than using the oven or stove. Instant Pot claims you’ll use up to 70 per cent less energy than conventional methods.",
    "What we like most about the Instant Pot is the amount of new recipes you’ll want to try now that time is no longer a major constraint. And it doesn’t just speed things up. A 24-hour timer allows for delayed cooking, and an automatic keep-warm holds the temperature of the food until you serve it for up to 10 hours. Instant Pot is in it for the long haul.",
    "We found the Instant Pot and lid are very easy to clean. Because of the intensity of this kind of cooking, it’s worth soaking the pot in boiling water before cooking with it to get rid of any lingering flavours, especially if you’re going from savoury to sweet ingredients.",
    "Incredibly easy to use, even a reluctant home cook will be able to work their way around the extensive cooking programs, and with regulated temperatures at every step, this is where you’ll see the real “set it and forget it” benefit of multi-cookers. There is virtually no noise or leaking steam, leaving you to finish off the rest of your cooking while it does the hard work for you.",
    "The saute setting means you really save on washing up, and this is where it could really change your kitchen habits. Each stage happens in the pan, and then it’s ready to serve.",
    "More experienced cooks might find the “hands off” approach difficult. Once the program is underway, there’s no way to check the seasoning or add extra liquid to stop it from burning (which is why we found we overcompensated with extra liquid in the first place). You may actually find the process quite unintuitive in terms of having to hand over the reigns to your Instant Pot. But once you have a few processes down, it’s easy to see why this alternative way to cooking is so popular - because it’s so easy.",
    "Such is the cult-like draw of the Instant Pot brands, there are endless recipes online to use specifically with the brand. Which proved vital, because it’s not always obvious which settings to use for the kind of dish you want to create. We found we relied a lot on new Instant Pot recipes online, instead of being able to create our own favorites with the new appliance. It’s to this end the recipe book that comes with the Instant Pot doesn’t feel thorough enough. For the price point, you’d expect Instant Pot to provide something more inspiring.",
    "Another aspect to keep in mind for the impatient cook: when pressure cooking, Instant Pot locks in your food so the lid can only come off once the pressure has reduced in the pan. It takes quite a while to get used to not being able to get to your food until the pressure valve pops down. The hotter or higher pressure you cook food at, the longer it will need to decompress, so although the cooking times say 5 minutes etc, it could easily be 20 extra minutes of waiting - but as this is a safety mechanism, we’re not going to penalise Instant Pot for it.",
    "At the price, the Instant Pot sits in the middle of the multi-cooker market, but when you consider how many other appliances it covers, it’s worth the investment. The array of options and programs is what clinches it for us - and what justifies the extra spend.",
    "All in? This is a great appliance for a home cook keen to stock up their freezer, feed crowds and get it all done with minimal fuss and washing up. A brilliant all-rounder."
  ],
  "headers": {
    "3": "Price and performance",
    "5": "Design",
    "8": "Performance",
    "17": "Verdict"
  },
  "links": {
    "best Instant Pot": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers"
  }
}