{
  "source": "https://www.techradar.com/reviews/revonext-nex-202-earphones",
  "title": "RevoNext NEX 202 earphones review",
  "category": "audio-visual",
  "updated": "2019-08-19T11:24:54Z",
  "author": "sean-cameron",
  "summary": "Could these be your Next earphones?",
  "verdict": "With a balanced sound-profile, a roomy soundstage and a robust design, these charming earphones offer good performance and decent value. But with no mic, no in-line controls and a slightly fiddly fit, they aren’t the best choice for all.",
  "pros": [
    "Roomy soundstage",
    "Balanced sound profile",
    "Durable construction"
  ],
  "cons": [
    "No mic",
    "No in-line controls",
    "Fiddly fit"
  ],
  "article": [
    "If you dive into Amazon looking for the best earphones for your needs, one thing will become immediately apparent: there is a lot of competition in the ‘budget’ segment.",
    "RevoNext, hailing from Stockholm, has been doing what it can to stand out from this crowd, releasing a steady tide of affordable audio options since its 2015 debut into the market.",
    "Its newest offering, the dual-driver NEX 202 attempts wholeheartedly to follow in this tradition. Sporting an aluminum design, braided cables, dual-drivers (as the name suggests) and more marketing speak than one could shake a sensibly-sized stick at, these are a product intended for the Serious consumer.",
    "But, with so many options available at a similar price point ($49.99 / £55.99 / around AU$100), some with storied brands behind them, do the dual-driver NEX 202s do enough to stand out from the crowd in a meaningful way?",
    "Of the many varying form factors available for earphones, a few stand out for ease-of-use (read ‘comfort’).",
    "The RevoNEXT NEX 202 earphones are very solidly constructed, crafted from attractive aluminum, which is cool to the touch. Two small screws hold each bud together, and the whole effect is somewhat reminiscent of something designed for a 1940s fighter pilot.",
    "When wearing these earbuds, you need to snake the cable behind your ear first, pulling it down and then inserting the bud into your waiting ear.",
    "This is a more involved (and more secure) method than simply inserting the buds in your ears from below, and as such, isn’t best suited for commuters who are looking for a minimum of fuss when putting their earbuds in.",
    "That being said, once the earbuds are in, they sit comfortably even for relatively long periods. A wide selection of tips is included with the package, of varying sizes and girth, allowing the user to choose the best seal.",
    "Another point worth mentioning, is that the braided cable finds no issue with becoming a tangled mess at a moment’s notice – which means the inclusion of a small tidy-strap on its lower section is much appreciated. It's of a reasonable length too, at over a meter long, which should be enough for all but the tallest listener.",
    "No control buttons are included on the cables, and a microphone is also omitted –these earphones are designed for uninterrupted music-listening only. Should you be looking to use them as all-purpose buds, the inability to take a call might then be a little jarring, and conference calls are out of the question.",
    "The retail box itself, beyond the assorted tips included, is a relatively spartan affair - if you are the kind of person who takes interest in the experience of opening a box for the first time, it would be best to look elsewhere.",
    "We came to the NEX 202s with a hint of trepidation regarding their performance; as a relatively unknown brand there was the potential for the audio quality to reflect these earbuds' low price.",
    "Therefore, it's a pleasure to say that we were impressed by the performance of the NEX 202s, especially when you consider the price. Listening to a range of songs, including bass-heavy bangers and lilting treble-filled ballads, we found that the sound profile is decidedly neutral - a definite bonus for those looking for a pair of cheap-ish reference buds.",
    "Listening to a relatively messy track such as Honeyblood’s ‘No Spare Key’, there was a good degree of separation present and a decided impression of space in the audio, while the Stone Roses’ challenging, quiet ‘Bye Bye Badman’ also had a suitably roomy soundstage.",
    "Generally, the bass was punchy while never being overbearing, and can be quite warm, while trebles were given an exciting kick, if they were occasionally a little harsh. Volume too was good generally, courtesy of the 12mm drivers packed into these diminutive buds.",
    "These are buds that take a little getting used to; those expecting a bigger punch from their bass in particular might be disappointed initially. With time, and especially for those who listen to a range of different tracks from varying genres, these buds are real growers.",
    "It should be noted that, while these are marketed to some degree towards commuters, there is no active noise cancellation. With the right size tips however, all but the most egregious of commuting noises can be avoided.",
    "So what to make of the dual-driver NEX202s? These are buds that perform well for the price, matching a balanced sound profile with a roomy soundstage to good effect. They're comfortable to wear, have an interesting look and feel solid enough to withstand a few knocks in a jam-packed satchel.",
    "The lack of in-line controls or an added mic count against them, as these are arguably essential features for the average consumer, and the ‘around-ear’ fit isn’t the easiest to wrestle with on public transport. They also have no active noise cancellation.",
    "For the consumer looking for a pair or earbuds fancier than those which came with their smartphone, these are a very solid bet, and for others these are an option which at the very least stand tall amongst the competition.",
    "However, they don't quite deserver the mantle of the best performing – or best value – earphones out there."
  ],
  "headers": {
    "4": "Design",
    "12": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "best earphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925"
  }
}