{
  "source": "https://www.techradar.com/reviews/cambridge-audio-alva-tt-turntable-review",
  "title": "Cambridge Audio Alva TT turntable review",
  "category": "audio-visual",
  "updated": "2020-05-11T12:13:40Z",
  "author": "simon-lucas",
  "summary": "Cambridge Audio brings a dose of digital thinking to ancient tech",
  "verdict": "New ground can only be broken once, and Cambridge Audio's hi-res wireless Alva TT turntable is now a benchmark product.",
  "pros": [
    "Hi-res aptX HD wireless streaming",
    "Simple to set up",
    "Built to last"
  ],
  "cons": [
    "Not the last word in dynamism"
  ],
  "article": [
    "Any electronics brand would be proud of reaching its 50th birthday, but Cambridge Audio has seemed especially determined to mark the occasion. To celebrate its Golden anniversary, the company launched a range of good-looking, well-specified and atypically expensive stereo equipment. It’s pricey by the standards of the kit with which the company made its hi-fi reputation - but nevertheless looks quite affordable compared with similarly specified alternatives.",
    "And that’s the case with the Cambridge Audio Alva TT. £1500 for a record player is expensive no matter the brand, and it’s Cambridge’s most expensive-ever turntable by a mile. But it’s uniquely specified, and intends to deliver all the many and various advantages of the vinyl format with very few of the compromises.",
    "A premium turntable comes with a premium price tag. You're looking at £1500 / $1700 (around AU$2750) for the Cambridge Audio Alva TT when it hits stores in April 2019.",
    "First things first: it’s difficult in the extreme to make a turntable that doesn’t, broadly speaking, look like all the other turntables. Sure, Cambridge could have chosen a more vibrant color than sophisticated/anonymous* (*delete according to taste) titanium gray, but that’s about it. A turntable is a rectangle with a circle on it, everyone knows that - and only the most reckless brands try to fiddle with this template.",
    "Cambridge has managed to incorporate some minor, but nevertheless pleasing, design flourishes though. The company logo punched into the bottom right of the plinth, just south of the tonearm, looks classy, and the power on/off and speed selection buttons (the Alva TT will spin at 33.3 or 45rpm) at the bottom left are nicely recessed into the plinth too. The platter is a hefty chunk of polyoxymethylene in black with titanium centre, and at 305mm diameter is actually a teensy bit bigger than any record you put on it.",
    "Other than that, though, it’s business as usual, right down to the detachable acrylic dust-cover.",
    "The design of the Alva TT may be unsurprising, but Cambridge has gone to town where features are concerned.",
    "First of all, this is a direct-drive turntable. The vast majority of turntables that aren’t designed for DJ use are belt-drive - that’s to say the platter is rotated by what is essentially a substantial elastic band. Belt drive tends to be more affordable in terms of components and manufacturing cost, it certainly cuts down on weight, and most turntable brands assert that consistent playback speed can be maintained by a belt-drive arrangement quite happily.",
    "Cambridge begs to differ. Unlike direct-drive DJ decks, which have high-torque motors to get a low-mass platter spinning at the correct speed as quickly as possible, Cambridge has deployed a medium-torque arrangement to move its high-mass platter. The company insists this results in better pitch stability than any belt-drive alternative - and it’s mated the drive system to a chunky plinth, all the better to absorb unwanted vibrational energy.",
    "The Alva TT also has an integrated phono stage. The output signal of a turntable is weedy – minuscule really – and it takes an awful lot more amplification to get useful volume than it does from any other hi-fi component. Some systems will have a phono input ready to accept a turntable, some won’t - and those that don’t will need a phono stage to make a turntable audible. Cambridge has a couple of extremely well-regarded stand-alone phono stages in its product line-up - the Alva Solo and Alva Duo - and it’s used this knowhow to integrate the necessary oomph into the Alva TT.",
    "The tonearm is a single-piece design that’s awfully reminiscent of the classic Rega RB design (although it doesn’t have the exposed and vulnerable wires of that venerable arm). Down at the business end there’s a Cambridge-branded high-output moving coil cartridge - it’s pre-installed, which removes a lot of the pain and frustration from setting up a turntable in the first place.",
    "But what makes the Alva TT most intriguing is an unassuming little switch on the rear panel. The is the ‘Bluetooth on/off’ switch, and it’s this that really sets the Cambridge apart. It’s not the first turntable to offer wireless connectivity, not by a long chalk - but it’s the first to offer hi-res 24bit/48kHz aptX HD streaming. Which, it can be safely said, makes it the world’s first audiophile wireless turntable.",
    "All of which demonstrates Cambridge’s desire to make the Alva TT more convenient, less painful and altogether more lifestyle-orientated than any other brand’s similarly-priced turntable. So set-up is simply a question of unboxing, fitting the counterweight to the end of the tonearm (there’s a little Ortofon gauge in the box to help you get the tracking weight just so) and either wiring it to an amplifier (Cambridge provides some decent stereo RCA connections) or wirelessly pairing it to any Bluetooth receiver. The wireless option, of course, means the Alva TT can be positioned where you’d like to put it, rather than where your system demands it should go.",
    "A wired connection tends to be better in terms of outright quality than the wireless equivalent. We’d expect this to be more true of the Alva TT than most products, given that the analogue signal extracted from the vinyl doesn’t have to undergo the analogue-to-digital-and- back-again conversion necessary to get a wireless sound from the turntable.",
    "And that’s how it turns out. Connected to a line-level input on a capable Naim streamer/amplifier, the Alva TT exhibits all the audio strengths that’s seen vinyl endure as a viable format all these years. No matter if it’s spinning Radiohead’s woozily hectic Bloom or the amphetamine headrush of Small Faces’ Have You Ever Seen Me, the Cambridge kit knits every element of a recording together in the most natural, effortless manner. From the deep, controlled bass sounds to the crisply shining top end, and all points in between, the Alva TT presents recordings as a coherent and convincing whole rather than as a disparate collection of individual sounds.",
    "This facility with timing is a long-acknowledged area of vinyl superiority, and the Cambridge allows music to flow in a pleasingly organic manner. Play yet further into its hands with a heavyweight pressing of Aretha Franklin’s Lady Soul and the imperious voice occupies centre stage, loaded with the sort of detail that makes listening to even familiar recordings feel like a voyage of discovery.",
    "Even recordings of an entirely different, more attacking, emphasis - something like Orbital’s The Altogether, for example - are handled with confidence and sensitivity. It’s true there’s not always quite as absolutely straight an edge to bass notes as is ideal, but they punch solidly nevertheless and don’t wallow. Less accomplished turntable designs can overheat the low-end frequencies and let them overstay their welcome, but the Alva TT is relatively snappy.",
    "Switch to a wireless connection and all that additional processing of the signal is fairly apparent. Even when streaming at aptX HD quality, some of the analogue warmth for which vinyl is renowned is sacrificed, and a slightly harder edge creeps into the way the high frequencies, in particular, are reproduced. Timing is still pretty pleasing, though, and the impression of unity to an LP of Kamasi Washington’s The Epic is preserved. And, of course, this extremely pleasing standard of performance can be achieved despite the Alva TT being anywhere in your room you deem acceptable.",
    "No amount of wireless alchemy can remove the need to get out of your seat every 15 to 20 minutes to turn a disc over, mind you.",
    "Perhaps as big an advantage to the ‘lifestyle’ element of Alva TT ownership as the positioning of the turntable in the first place is the ability to listen to vinyl on some wireless headphones. Paired with a hi-res-capable pair of Audio Technicas, the Cambridge delivers all of the potency of its performance with an additional dose of immediacy and positivity. Listening to something as assertive as Jack White’s Lazaretto this way is thrilling as much for its sheer counter-intuitiveness as for the well-judged levels of attack and drive the Alva TT manages to muster.",
    "Ultimately the Alva TT is short of the last drop of dynamism the very best-sounding turntables at this sort of money deliver. But the very best-sounding £1500 turntables are much more of a faff to set up and maintain, and the very best-sounding £1500 turntables are nothing like as painless and convenient to use.",
    "Ordinarily a record player at this price can be judged on absolute terms - and if we were judging the Cambridge Alva TT on absolute terms, it would be found fractionally wanting. Its sound is just lacking that final dash of dynamism that a no-compromise turntable will deliver.",
    "But judging the Alva TT on absolute terms would be to ignore its unique and considerable talent. Sure, its build quality is well up to standard, and its ease of installation and maintenance is laudable.",
    "The fact it’s able to stream wirelessly to a 24bit/48kHz aptX HD standard makes it number one in a field of one. No other record player from any better-established brand in this sort of market - Rega, for instance, or Clearaudio - is able to come close to this level of convenience. No other record player is as friendly or adaptable, and no other record player will fit in with your wider lifestyle so seamlessly.",
    "That’s why the Alva TT is so easy to recommend so wholeheartedly."
  ],
  "headers": {
    "2": "Price and availability",
    "3": "Design",
    "6": "Features",
    "13": "Performance",
    "21": "Verdict"
  },
  "links": {}
}