{
  "source": "https://www.techradar.com/reviews/turtle-beach-recon-70-headset",
  "title": "Turtle Beach Recon 70 Headset review",
  "category": "gaming",
  "updated": "2019-07-23T16:50:27Z",
  "author": "gerald-lynch",
  "summary": "Functional and affordable no-frills thrills",
  "verdict": "They won’t wow with special features or a dazzling design, but solid audio and a simple design make these a great option for console gamers on a budget.",
  "pros": [
    "Affordable price",
    "Solid audio performance"
  ],
  "cons": [
    "Lacks surround sound",
    "Made from cheaper materials"
  ],
  "article": [
    "Sometimes less is more, and when it comes to spending your hard earned cash, the less you can get away with spending, the better. Turtle Beach does a fine trade in high-end gaming headsets, but it’s not turning away from the gamer that may need to be a little more careful with their pennies.",
    "The Turtle Beach Recon 70 Gaming Headset is for that very gamer – the one that needs bang for their buck, bang from their in-game explosions, but a little less of a bang when they slap down their purse at checkout to buy the thing.",
    "Read on for our full review of the Turtle Beach Recon 70 gaming headset.",
    "The Turtle Beach Recon 70 Gaming Headset is available now, with an RRP of $39.95 / £29.99 (about AU$60). That’s very affordable for a gaming headset, but also in-line with the budget feature set on show here. This is a wired, stereo headset using sturdy-but-plasticky materials, rather than a wireless surround sound model that you may find at higher price points.",
    "For our review, Turtle Beach supplied us with the Recon 70 for Nintendo Switch, however the company also makes variants for Xbox One and PS4, too.",
    "That said, while the box says “for Nintendo Switch”, the 3.5 mm jack used here - as opposed to a wireless, dongle-or-amp based connection - means that the Turtle Beach Recon 70 gaming headset will work just as well when plugged into a PS4 or Xbox One controller, or even the mic-and-headphone dual port of a PC. ( Just be aware that the relatively short cable will mean that you’ll need a fairly accessible port if you do indeed intend to pair the headset with a PC, which makes it a lot harder to recommend in that situation.)",
    "For more options, be sure to check out our gaming headsets guides:",
    "With its black and red color scheme, it’s clear that the Turtle Beach Recon 70 for Nintendo Switch matches the console in terms of aesthetics. But, as mentioned above, don’t be put off if you own another gaming platform – the 3.5mm headphone and mic jack means its compatible with basically every current gen gaming platform out there, including PC. Just be aware that its short lead may make it more difficult for hooking it up to a PC, as opposed to a handheld Switch or console gamepad’s 3.5mm port.",
    "The headset is predominately made of plastic, which, given the price tag, can’t be held against it. And thankfully despite that, its construction feels sturdy. There’s a comfortable clamp to its overhead band, and the sliding, clicky-fit resizers that connect to each ear cup feel like they could be rejigged many times over without loosening.",
    "When it comes to the earcups, you can again see where costs have been cut, making use of synthetic leather rather than a more premium material. But again they punch above their weight, with the inclusion of well-tuned 40mm drivers and a breathable size that means your head doesn’t get too hot when in use. After a particularly extended session they may begin to feel uncomfortable, but there’s no major discomfort to note, with reasonable foam padding in each ear.",
    "The left earcup houses both the flip-down mic, and the cabling. A detachable mic would have been preferable, but at least it can be pushed out of sight if need be. The cable can’t be replaced, so make sure you’re careful not to yank and damage it. A master volume dial is found to the rear of the left ear cup.",
    "It’s a bare-bones design then, but a fool-proof one with a construction quality that exceeds expectations at the price.",
    "Keep your expectations in check, and you’ll come away pleasantly surprised by the Turtle Beach Recon 70. There’s no surround sound wizardry being applied, but the drivers employed and tuned here do a good job of translating what’s happening in game with a decent sense of space.",
    "We played a range of games across genres with the headset, and across platforms, and felt performance to be comparable no matter which machine we paired them with. From Red Dead Redemption 2 to Fortnite to Gran Turismo Sport, they certainly have their strengths in some areas above others, but were enjoyable across genres.",
    "It’s arguably with action adventure titles where their limitations are more keenly felt. Dialogue, crowd scenes and ambient noises can feel a little removed. It didn’t kill the immersion of my horseback treks across Red Dead Redemption 2’s New Hanover, but it certainly didn’t elevate it either.",
    "The headset fared better with Gran Turismo Sport, where its strong bass response and ability to pick out screeching highs made it well matched for the engine revs of the game’s high-end car roster.",
    "But, given Turtle Beach’s heritage, shooters where the Turtle Beach Recon 70 is most at home. Playing Fortnite, explosions boomed, rounds popped and battlements snapped together satisfyingly. The audio delivered from the mice was unfaltering clear, to the point where one of our teammates even made a remark about the quality. It’s a little less glowing in terms of audio positioning – the transition of in-game audio from left channel to right and vice versa when turning the camera isn’t as seamless as you’d like. But for the price, it’ll raise your game compared to a standard cheap pair of headphones plugged into your controller.",
    "You get what you pay for (and then some) with the Turtle Beach Recon 70. It's not going to tempt the professional esports crowd, but if you want an affordable and enjoyable way of jumping into a multiplayer bout and chat with your friends, these get the job done respectably on an incredibly modest budget."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "12": "Sound and chat",
    "17": "Final verdict"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS4": "https://www.techradar.com/reviews/ps4-pro",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-release-date-news-and-rumors",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review"
  }
}