{
  "source": "https://www.techradar.com/reviews/google-stadia-controller",
  "title": "Hands on: Google Stadia Controller review",
  "category": "gaming",
  "updated": "2019-05-07T23:49:22Z",
  "author": "nick-pino",
  "summary": "Google’s first gamepad feels good and has a few tricks up its sleeve (supposedly)",
  "verdict": "While it doesn’t feel quite as solid as the Xbox One or PS4’s gamepads, the Google Stadia Controller has some neat tricks up its sleeve. Details are still scant but, after playing with it ourselves, we’re more optimistic than ever about Google’s gamepad.",
  "pros": [
    "Connects via Wi-Fi",
    "Google Assistant button",
    "Great design"
  ],
  "cons": [
    "Lots of question marks",
    "Unknown battery life",
    "Triggers are unremarkable"
  ],
  "article": [
    "In case you missed the announcement at GDC 2019, Google is creating a new game-streaming service called Google Stadia that will offer gamers an arena to watch, participate, play and stream their games to the wider world.",
    "Part and parcel of Stadia is the new Stadia Controller – a Wi-Fi-enabled gamepad created entirely by Google’s hardware team that will help you get the most from the streaming service when it launches later this year.",
    "You don’t need the controller to use the streaming service: Stadia can be played with any controller you already own, including your keyboard and mouse if you’re playing on a laptop or PC. But this first-party controller unlocks the next-level functions Google is building into its streaming service, like in-game help via Google Assistant, or a Share button that starts livestreaming your session on YouTube Gaming for others to watch – or join.",
    "At Google IO 2019 we got a chance to go hands-on with the controller for the first time and while it wasn’t as functional as it will be when the service launches, it was a good preview of what’s to come for Google’s ambitious – and still rather mysterious – game-streaming service.",
    "Perhaps the most impressive part of the Google Stadia Controller isn’t anything on the controller itself – it’s Google’s decision to make the controller in-house. The task to craft the controller was given to Google’s internal Made with Google team, the same folks who designed the Pixel phones, Google Home Hub and Chromecast.",
    "That said, Google has definitely borrowed from the likes of Sony and Microsoft in terms of its controller the design – the Stadia Controller is exactly what you’d get if you mashed the Xbox One gamepad with Sony’s DualShock 4.",
    "The result is a flatter gamepad that doesn’t have the sharp contours of the DualShock 4 or the indents of the Xbox One. Instead, it has an almost space-age look that some will love for its simplicity and others will decry as uncomfortable, awkward-looking and cheap.",
    "In our short time with the controller, however, we felt it’s anything but uncomfortable. Google has given a lot of thought to the weight of the gamepad, as well as how it should fit in the hand, and the end result is a controller that feels great in the hand.",
    "Gamers will find familiarity in the Xbox-style face buttons (A,B,X,Y) and in-line control sticks that mirror both the alignment and the concavity of the sticks on the DualShock 4. There’s a D-pad in the top-left corner that feels fairly responsive, and a pair of triggers and bumpers located on the back that feel... unremarkable, especially compared to the Xbox One and Xbox 360’s expertly-crafted triggers and bumpers.",
    "Pockmarking the face of the controller where you’d expect to find the Start and Select buttons are four new buttons (in addition to the home button located in between the joysticks that we’ll cover in the next section).",
    "Last but not least, while Google has mostly shown images and video of a white controller, we were also able to track down a black version and a pastel green controller (the color, Google tells me, is officially called ‘Wasabi’) on a shelf near the Google Stadia demo station.",
    "For our hands-on demo we were able to use the Stadia Controller to play Assassin’s Creed Odyssey – the same game we played on Stadia at GDC – but this time with the proper controller. That said, certain features were disabled.",
    "One feature that wasn’t quite working was the Wi-Fi connectivity of the controller – the controller needed to be plugged into a laptop for our tests but, when it launches, Google says that it will be connected to your home network via the Google Home app. Once implemented, connecting directly to your router could cut out crucial milliseconds of delay and save you lives in platformers and frustration in the real world.",
    "For our demo, though, the Stadia Controller was connected to a laptop via its USB-C port that can also be used to charge the controller in between sessions – and that worked just as well. We couldn’t detect any hint of latency in the stream.",
    "Another promising feature that wasn’t up-and-running was the Google Assistant button.",
    "When it’s working, Assistant will offer a ton of in-game functionality like walkthroughs, guides or another feature set specifically by the developer. But a Google representative couldn’t tell us whether we’d be able to use it for everyday tasks like turning off the lights or setting reminders – though, he promised more details on that soon.",
    "The loftiest feature of the Controller – and the one that seemed least ready to show off – was the ability to share the game via social networks and YouTube. In its keynote at GDC, Google said that pressing the button will cause the service to create a second identical stream that will be posted live to YouTube Gaming in 4K. Again, however, it wasn’t something we were able to see for ourselves during our hands on.",
    "When asked how long the controller would last on a single charge, the Google representative couldn’t give us a definitive battery life – but says that info would come in due time later this year.",
    "According to Google, we’ll get more details about the controller and the streaming service itself at a ‘summer event’ that will be held sometime in the next few months. It will be at that event, a Google representative tells us, that we’ll get final details – things like battery life, price and game selection – on both products, and finally be able to use every feature on the controller.",
    "Until we get those details, however, we’re still skeptical about the service and the controller. That said, despite forging a complicated, polarizing product on their own without any outside help, the Stadia Controller is so far a decent stand-in for the Xbox One or PS4. It’s not quite as well-developed as either, but its neat built-in features – like Google Assistant and Stream – could make it the perfect companion for Google’s ambitious new streaming service."
  ],
  "headers": {
    "4": "Design",
    "11": "Performance",
    "18": "Early verdict"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Google IO 2019": "https://www.techradar.com/news/google-io-2019-keynote",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "DualShock 4": "https://www.techradar.com/reviews/gaming/games-consoles/controllers/dualshock-4-controller-1157615/review"
  }
}