{
  "source": "https://www.techradar.com/reviews/honor-8x",
  "title": "Honor 8X review",
  "category": "phones",
  "updated": "2019-07-02T13:51:45Z",
  "author": "andrew-williams",
  "summary": "Good looks, performance and value",
  "verdict": "With its solid performance, versatile camera and metal and glass build, the Honor 8X is great way to get a phone that looks and feels expensive but does not cost the earth.",
  "pros": [
    "Great value",
    "Very modern look",
    "Good performance"
  ],
  "cons": [
    "Flaky camera background blur mode",
    "Micro USB charging",
    "Honor Play is more powerful"
  ],
  "article": [
    "Update: after Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "The Honor 8X is the kind of phone you might buy if you want one that looks new, with all the latest design cues, but don’t want to spend a huge amount of money.",
    "That the front is almost all screen is the Honor 8X’s star feature. Switch it on, and it looks similar to an $800/£800-plus phone.",
    "Other parts of the design are less flash, of course, and there are a few little compromises to the hardware. However, most issues are trifling things you get used to quickly, like the use of a micro USB port instead of a USB-C.",
    "The Honor 8X costs £229.99 (roughly $310, AU$435), and it’s worth every penny.",
    "This phone offers great value for money. Arguing against that idea is a tricky prospect.",
    "The Honor 8X has a glass back and metal sides, extremely slim surrounds and fairly slimline notch. These factors combine to make the 8X look like a phone several price classes above.",
    "It also has a very good Full HD-grade screen, a 20MP and 2MP dual-lens rear camera and a 16MP front camera. Again, they sound high-end for the price.",
    "So where are the tells that this is a much more affordable mobile? The Honor 8X has a mid-range CPU that could do with a faster graphics chipset, its secondary rear camera is weak, and the charging socket is a micro USB rather than a USB-C. It doesn’t take good night photos unless you use the AI Night mode either.",
    "Given the amount you save compared to an ultra-high-end phone, this seems a fair trade.",
    "The Honor 8X looks similar to some of the most expensive phones in the world, but is a quarter the price. This is not just the point of the phone, it sums up the entire Honor strategy at present. You get more for your money than other recognizable brands.",
    "Very high screen-to-body ratio is the particular look the Honor 8X not just emulates, but achieves. When we first turned the phone on, we were slightly shocked. No model to date has offered such an all-screen look at this price.",
    "Its front-on appearance really is quite similar to an iPhone XR or OnePlus 6.",
    "The Honor 8X’s build is comparable with these more expensive models too. Plates of glass make up the front and back, and the sides are a matte-finish aluminum. There are just a few slight signs this isn’t really in the same class as a 500-1000 dollar/pound phone.",
    "Slim borders of plastic sit between the metal and glass parts, and the finish of the back is quite plain. There’s no light-reactive layer, none of the funky gradients seen in some other Honor and Huawei phones. A subtle two-tone band stops it from being plain black, but it took us a while to even notice this was the case.",
    "This phone may be two-tone, but those two tones are shades of black.",
    "The Honor 8X also feels less dense and expensive than the iPhone XS. Considering the radical price difference, if this was not the case it would seem odd.",
    "Honor’s use of a micro USB port instead of a USB-C is the one hardware niggle that sticks out. Value-packed as the Honor 8X is, this price band is USB-C territory in 2018.",
    "There’s no official water resistance either, but the Honor 8X is not without extras. The rear fingerprint scanner is very fast and reliable, and 64GB of storage is great at the price. There are spaces for an extra nanoSIM card and microSD card in the SIM tray too, earning it a few extra tech nerd points.",
    "The ultra-slim screen surrounds also make the Honor 8X pleasant to use and hold for a phone with a 6.5-inch screen. This is not just for enthusiasts and those with big hands. Like just about every Honor phone, it’s slim too at 7.8mm thick.",
    "The factory-applied screen protector is a nice additional touch, although within a few days one part had started to lift off the surface.",
    "Approach the Honor 8X with an ultra-critical eye and you can tell this is not an ultra-premium mobile. Build is a small step below the OnePlus 6 too. However, as is so often the case, Honor has done a brilliant job of making a phone comparable to one double the price.",
    "The Honor 8X has a large, very tall 6.5-inch 19.5:9 LCD screen with a fairly narrow notch. Notch-haters can block off the top area with a black bar too.",
    "Fresh out of the box the Honor 8X uses a slightly unruly 'vivid' color mode, one not quite as tasteful as that of more expensive phones. Some tones look more sickly than vivid, but switch to 'normal' color mode and you have one of the very best displays you’ll find in a phone for under $400/£400.",
    "Color looks accurate enough and well saturated, and as the Honor 8X has an ultra-long Full HD-grade resolution, with 1080 x 2340 pixels, it’s sharp too. It is sharper than the iPhone XR: amusing when you compare their prices.",
    "The sheer size of the display makes the Honor 8X seem a true enthusiast phone, well-suited to gaming, video streaming and reading long articles or even books.",
    "Top brightness is not as high as that of the phones Honor references with the 8X, phones over $600/£600. However, it is legible on bright days so covers the essentials for a mid-range model."
  ],
  "headers": {
    "6": "Key features",
    "11": "Design",
    "23": "Screen"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "OnePlus 6": "https://www.techradar.com/reviews/oneplus-6",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review"
  }
}