{
  "source": "https://www.techradar.com/reviews/dyson-airwrap-styler-review",
  "title": "Dyson AirWrap Styler review",
  "category": "appliances",
  "updated": "2021-07-16T09:12:31Z",
  "author": "olivia-tambini",
  "summary": "Easy, breezy, beautiful",
  "verdict": "The Dyson AirWrap Styler works incredibly well on straight to wavy long hair, but it’s eye-wateringly expensive, and results will vary on different hair types and lengths. If you have shorter hair, or tightly-coiled Type 4 hair, you'll probably want to save your money.",
  "pros": [
    "Easy to use",
    "Lightweight",
    "Creates healthy-looking curls",
    "Dries hair quickly"
  ],
  "cons": [
    "Incredibly expensive",
    "May not work on all hair types and lengths"
  ],
  "article": [
    "Although Dyson is most well-known for making some of the best vacuum cleaners, its first foray into the world of beauty with the Supersonic hair dryer cemented it as a real player in innovative personal care products, and is one of the best hair dryers we've tested.",
    "Two years later, Dyson released its latest hair styling device, the AirWrap Styler. Tapping into the current vogue for healthy hair styling, the Styler is designed to create curls, waves, and bouncy blow drys without using extreme heat that can leave your strands feeling frizzy and dry.",
    "The Dyson AirWrap comes in three different variants depending on which accessories come with it: Volume + Shape, Shape + Smooth, and the more expensive AirWrap Complete, which contains all the available styling attachments - we tried out the latter.",
    "With the Black Friday 2019 sales approaching, which start officially on November 29, this could be your best chance to see a rare price-cut for the usually-expensive Dyson AirWrap. Lots of leading retailers will be slashing prices on products, and beauty-care items regularly see some of the most generous price cuts. We'll keep you posted if the AirWrap proves to be among them.",
    "The Dyson AirWrap Complete is available to buy for $549.99 (£449.99 / AU$799.99), and you can get the Volume + Shape or Shape + Smooth packages for $499.99 / £399.99 – although in Australia only the Complete package is available.",
    "A price of nearly $550 is going to be prohibitively expensive for many, and even the cheaper variants come with an eye-watering price tag. For comparison most other hair curlers on the market cost between $30 and $150.",
    "As you would expect from a device of this price, the design and presentation of the AirWrap is pretty much impeccable. It comes in a tan leather-effect storage case, which snaps shuts via a magnetic clasp, which looks attractive enough to make you want to leave it out instead of tucking it away in your cupboard when not in use.",
    "The Styler itself consists of silver cylinder, around 10 inches long, with a cerise band around the top where the different attachments slot into. At the bottom you have a power cable to connect it to the mains.",
    "Towards the top of the Styler you’ll find the control buttons; an on/off button, heat controls, and buttons that control the speed of the airflow.",
    "The Dyson AirWrap Complete package comes with a number of different attachments, including a pre-styling dryer, which is similar to Dyson’s SuperSonic hair dryer, a firm smoothing brush to create straight(ish) hairstyles, a soft smoothing brush for a blow dry effect, and a round volumizing brush.",
    "Now onto the AirWrap barrels themselves; you get four all together, two 30mm barrels for tight curls, and two 40mm barrels to create loose waves. On each of the barrels you’ll find an arrow that indicates which direction the hair will wrap around it when the styler is on; generally, you’ll want to twist your hair away from your face to create face-framing curls.",
    "While the blow dryer and brush attachments are pretty self explanatory, the AirWrap barrels use an interesting natural phenomenon called the ‘Coanda’ effect to curl your hair.",
    "The Coanda effect causes high speed air to follow the contours of a surface in a similar manner to a liquid - a feature also used to high effect in motor racing.",
    "This effect “attracts, wraps, and curls the hair around the barrel”, which means you need only hold your hair close to the styler for the hot air to whip it around the barrel and create a curl.",
    "Aside from making it easier to curl your hair without having to manually wrap your hair around the barrel, it means your hair doesn’t come into contact with a very hot surface like it would with a traditional curling iron.",
    "Heat styling can often leave your hair feeling frizzy and dry, and can even lead to breakage if you use heat regularly, particularly if you have fine hair or tightly coiled Type 4 hair.",
    "Dyson says that the AirWrap Styler “measures airflow temperature over 40 times a second and regulates heat, to ensure it always stays below 150°C / 302°F.” For comparison, it’s not unusual for traditional curlers to reach 200°C / 392°F.",
    "It’s important to note that the AirWrap will have different effects on different types of hair; we tested it on jaw-length Type 2A wavy hair. We didn’t use any styling products or hairspray, but we did shield the hair with a heat-protecting spray to avoid any damage.",
    "One of the first things we noticed about the AirWrap was how light it is; if you regularly use hair dryers you’ll probably be well acquainted with the arm ache that occurs even after using them for short periods of time.",
    "Dyson advises that you use the AirWrap on damp locks, so the hair was washed, conditioned and air-dried for around 20 minutes before styling.",
    "To keep things simple, we started off by using the styling brushes to create a ‘blow out’ effect, using the soft smoothing brush followed by the round volumizing brush.",
    "It takes a little practice to get the hang of using the AirWrap, but overall, we were very impressed by how quickly it dried the hair, and we were pleased with how much volume we were able to achieve.",
    "The Coanda effect seems to be limited to the AirWrap barrels themselves, so you will need to manually wrap your hair around the volumizing brush to achieve a soft wave.",
    "Was it pin-straight? Absolutely not, but Dyson never claimed that can achieve a straightened look with the AirWrap.",
    "All in the all, the process was quite simple, but the styler can feel a little unwieldy at first as it’s so different from using a normal hairdryer, and while working on one section of hair, we found the hot air blew our other strands into a frizzy mess.",
    "Still, we were happy with the end result, and we noticed the hair looked shinier and healthier than in its natural state.",
    "A few days later, we tried out the AirWrap barrels, with the aim of creating bouncy curls, and we found the process far easier than using the brushes – mainly due to the fact that all the work is done for you by the Coanda effect.",
    "As we mentioned earlier, it does take a little practice to get the technique right, and Dyson has some helpful demo videos on its YouTube channel if you need some guidance.",
    "You need to lift up a section of hair (about one inch wide is a good rule of thumb) and hold the AirWrap curling barrel about four inches away from the end of the strand.",
    "The hair wraps around the barrel, and you can move said barrel towards your head to encourage the whole strand to curl.",
    "We held the curl until the hair was dry, and then pushed the temperature switch up to deliver a ‘cold shot’ to the hair – this helps to set the style and can make the curl look shinier.",
    "The most difficult thing to get your head (or hair, as the case may be) around is the direction you need to curl your hair in – each barrel features an arrow that indicates which direction the hair will curl in.",
    "This arrow should be pointing away from your face when you look into your mirror, for face-framing curls.",
    "One of the calling cards of the AirWrap is that is uses a relatively low heat to style your hair, and we definitely noticed the difference between using the styler (which Dyson says won’t go over 150°C / 302°F) and traditional curling tongs that typically reach heats of 200°C / 392°F or more.",
    "Our hair looked shiny and healthy, and we didn’t experience the burning smells that often comes with using heated styler tools on the hair.",
    "Using a lower heat to style your hair also has the added benefit of preserving your hair’s color if it’s dyed, meaning you don’t need to dye it as often to maintain a rich, vibrant hue.",
    "Even though we were impressed with the results, we felt that the AirWrap is better suited to longer hairstyles, particularly when it comes to the curling barrels – if you have hair shorter than shoulder-length, you may find it difficult to encourage your hair to wrap around the barrels.",
    "Reviews from those with tightly coiled Type 4 hair have been mixed as well. While some users were impressed with how quickly the AirWrap dried their hair, others noted that they would still need to use straighteners or curling tongs afterwards to achieve their desired style.",
    "While Dyson has released two instructional videos on using the AirWrap Styler on curly hair, it’s worth noting that the company hasn’t demonstrated the tool on tightly coiled Type 4C hair, leaving many potential users to guess as to whether it will work. We didn’t test on that type of hair, but it’s worth noting that it could be a gamble..",
    "Dyson claims that the AirWrap Styler is a “completely new way to style hair” – and it’s not wrong. It works really well, provided you have straight-to-wavy hair that falls below your shoulders.",
    "We’re unsure whether it works well enough on other hair types and lengths to justify the price, and we would like to see Dyson address this in the future, either by clarifying which hair types the AirWrap Styler can be used on, or by releasing an instructional video for Type 4 hair.",
    "Using traditional curling tongs can be time-consuming and damaging to your hair, but the Dyson AirWrap makes curling your hair a breeze (literally), and left the hair looking far healthier than when we has used extremely hot ceramic stylers in the past.",
    "It dries your hair quickly, it’s incredibly light, and it boasts an attractive design that looks and feels luxurious.",
    "But (and it’s a big but), the AirWrap Styler is incredibly expensive, at around five times the price of many other hair curlers on the market.",
    "Yes, the technology is innovative and versatile, but $550 is a substantial investment to make – whether you think it’s a wise acquisition or a waste of money is largely down to how much you already spend on your hair, and how much money you’d be willing to invest in its health.",
    "Image credits: TechRadar"
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "11": "How it works",
    "17": "Performance",
    "39": "Final verdict"
  },
  "links": {
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners",
    "Supersonic hair dryer": "https://www.techradar.com/reviews/dyson-supersonic-uk",
    "best hair dryers": "https://www.techradar.com/best/best-hair-dryer-5-hair-dryers-for-smooth-and-shiny-styles",
    "Black Friday 2019": "https://www.techradar.com/black-friday/black-friday-deals-sales?region-switch=1574163408",
    "fine hair or tightly coiled Type 4 hair": "https://www.naturallycurly.com/hair-types",
    "Type 2A wavy hair": "https://www.naturallycurly.com/hair-types",
    "YouTube channel": "https://www.youtube.com/channel/UCxhm7KndIp-w-DyHeckHo_A",
    "some users were impressed with how quickly the AirWrap dried their hair": "https://www.refinery29.com/en-us/dyson-airwrap-hair-styler-curler-review",
    "others noted that they would still need to use straighteners": "https://www.cnet.com/reviews/dyson-airwrap-review/2/",
    "two instructional videos": "https://www.youtube.com/channel/UCxhm7KndIp-w-DyHeckHo_A"
  }
}