{
  "source": "https://www.techradar.com/reviews/sony-xperia-10-review",
  "title": "Sony Xperia 10 review",
  "category": "phones",
  "updated": "2019-03-15T16:13:39Z",
  "author": "james-peckham",
  "summary": "21:9 on a budget",
  "verdict": "The Sony Xperia 10 is a mid-range phone that brings Sony’s flagship style and unique 21:9 aspect ratio to a phone that’s a third of the price of its upcoming Xperia 1. It’s not the best phone you can buy for this price by any means, but if you like to watch movies and TV shows on your commute it may be perfect for you.",
  "pros": [
    "Bright and clear display",
    "Strong build quality",
    "Extra screen space sometimes useful"
  ],
  "cons": [
    "21:9 screen can prove frustrating",
    "No wireless charging",
    "Disappointing battery life"
  ],
  "article": [
    "Sony has never really excelled at making mid-range smartphones in the way competitors like HTC and Samsung have, but the company is aiming to change that with the new Xperia 10 and Xperia 10 Plus.",
    "If you regularly watch films and videos on your phone, Sony thinks this is the handset for you. While its upcoming Xperia 1 may have the best screen on a smartphone ever, with 4K HDR OLED technology, this is a Full HD display, but comes in the same 21:9 aspect ratio.",
    "This is unmistakably a mid-range phone though. It may sport that unique screen aspect ratio, but it also features a low-end chipset and some middling specs – so how does the overall package shape up?",
    "If you live in the UK you can buy the Xperia 10 now, while those in the US will be able to buy it from March 18. We don’t currently have a release date for Australia, but we’d expect the phone to land there in the near future.",
    "The phone costs £299 or $349.99 (about AU$550 – Australia pricing is also TBC) SIM-free, which is a touch cheaper than the larger and slightly more spec-heavy Sony Xperia 10 Plus. In the UK we’ve seen free-upfront contracts with 1GB of data starting at around £19 a month.",
    "If your budget can stretch a bit further, the Xperia 10 Plus costs £349 / $429.99 (roughly AU$650). Then there's the Xperia 1, which is set to cost £849 (around $1,110 or AU$1,550) when it launches later this year.",
    "The screen on the Xperia 10 isn’t as impressive as the one on the Xperia 1, but that’s because this is a far more affordable phone. That said, it's still something that takes you by surprise when you first see the Xperia 10 – and in a good way.",
    "It’s a Full HD+ 6-inch screen at a 21:9 aspect ratio. That means the display is taller than on your existing smartphone, and the idea here is that when you flip it to landscape it’ll offer the optimally-sized display for watching video, viewing photos or playing games.",
    "If you’re watching movies from specific streaming services this makes a lot of sense, as it can fit perfectly into the display, with no distracting black bars on either side.",
    "Sony says almost 70% of the films on Netflix are made specifically for the 21:9 aspect ratio, while 21:9 content is also available from other streaming services such as Amazon, and Sony’s own movie store.",
    "Don’t expect all films and TV shows you’re watching to appear perfectly in this format though. Most TV shows are filmed in 16:9, so when we watched episodes of The Office they appeared with thick black bars down each side of the display.",
    "That’s to be expected, but there’s another frustrating element to the unusual aspect ratio: the black bars mean the content on-screen isn’t in the center. There’s a thick bezel along the top of the phone, which means when video is playing it’s slightly off-center. You can see in the image below exactly what we mean:",
    "Finding 21:9 content isn’t particularly easy either. We looked up the movie Hereditary on Amazon Prime Video – a relatively recent upload to the service when we wrote this review – but it wasn’t available in 21:9.",
    "We watched Venom on the phone, and when you’re watching in 21:9 on the Xperia 10 it’s a fantastic experience – it really does feel closer to what the film looks like on the big screen, so it’s a shame that it’s so difficult to find 21:9 content.",
    "If you’re using the phone upright it’s not as easy to get your head around the aspect ratio, and this is something we struggled to get used to during our time using the phone. It’s something that does grow on you, but there are some core problems with the design.",
    "We found the display quality to be great with strong colors and an incredible 457 pixels per inch.",
    "If you’re using the phone for split-screen apps, the extra screen real estate at the top and bottom of the display will add to the experience. Looking at photos in a 21:9 aspect ratio is an enjoyable experience here too, while some games are designed for the aspect ratio, with Sony promising more will be supported soon too.",
    "At the time of writing, four games are designed for 21:9 aspect ratio phones: Asphalt 9, Arena of Valor, Fortnite and Marvel Strike Force. Only Marvel Strike Force (which you can see running below) and Arena of Valor are currently available on the Xperia 10.",
    "When you find a game in the 21:9 aspect ratio, the experience is great as you've got extra space for the controls and it feels like a natural way to play. As with movies though, the stretched screen isn’t that useful right now when so few games support the aspect ratio.",
    "Another frustration we found with 21:9 is its effect on other apps we were using. One specific case is how it cuts off certain content when we’re using Instagram Stories.",
    "Because the aspect ratio was thinner, the image isn’t fully displayed. This is particularly noticeable when someone has put text on an Instagram story and it’s cut off. We couldn’t find a way to view the whole story, and while it’s a minor thing it did prove frustrating on a number of occasions.",
    "Overall, we found 21:9 to be useful in some very specific scenarios, but it’s up to you to decide whether that’s worth sacrificing some of the functionality of other parts of the phone.",
    "The Sony Xperia 10 feels high-end considering its price, with a glass front with a metal rear that feel premium to the touch – if you’re looking for an affordable device that’s also easy on the eye this could be a great choice.",
    "As we’ve mentioned, this is a tall handset, and with dimensions of 156 x 68 x 8.4mm it feels slim in the hand; it’s also relatively lightweight at 162g.",
    "We imagine that if you’re got smaller hands, you’ll struggle to reaching the top of the display when using the phone one-handed. That’s why Sony has brought its Side Sense features to the phone, which you can read about in the Software section below.",
    "There’s a fingerprint scanner built into the right-hand side of the phone that’s in a good position for your thumb to tap if you’re right-handed – if you’re left-handed you may find this a bit tougher to reach.",
    "An interesting thing here is that the scanner isn’t built into the power button, as it has been on previous Sony phones. Instead the company has put that button above it, and we weren’t given a clear answer on why that was.",
    "Good news here is that those in the US will also get a fingerprint scanner, which is something that’s been missing from some previous Sony phones launched there.",
    "The camera protrudes a little from the rear of the phone, but it’s not anything that’s likely to annoy you.",
    "It may not have the most premium design, but considering how much you’ll be spending on the Xperia 10 we’re impressed with how the phone feels in the hand.",
    "There are lots of color choices too, including some bold options – there’s Sony’s default colors of black and silver, but you’ll also be able to get it in navy or pink.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "3": "Sony Xperia 10 release date and price",
    "6": "Display",
    "22": "Design"
  },
  "links": {
    "Xperia 10 Plus": "https://www.techradar.com/reviews/sony-xperia-10-plus-review",
    "Xperia 1": "https://www.techradar.com/reviews/sony-xperia-1-review"
  }
}