{
  "source": "https://www.techradar.com/reviews/vizio-p-series-quantum-pq65-f1",
  "title": "Vizio P-Series Quantum (PQ65-F1) review",
  "category": "televisions",
  "updated": "2019-03-05T06:04:54Z",
  "author": "nick-pino",
  "summary": "This is Vizio’s best and brightest TV",
  "verdict": "While it doesn’t rival the black levels of OLED and has some issues with SmartCast, this bright and beautiful quantum dot screen is one of the best values in the industry right now.",
  "pros": [
    "Full array backlight",
    "Quantum dot technology",
    "HDR10, Dolby Vision and HLG",
    "2,000 nits peak brightness"
  ],
  "cons": [
    "Vivid mode is blinding",
    "SmartCast OS isn't enticing",
    "Weak 10W speakers"
  ],
  "article": [
    "For a minute, it looked like Samsung had found a way to outclass its opponents with its QLED TVs. Not only did quantum dots make them more colorful, but a huge push to create brighter TVs helped the flagship 2017 screens to hit 2,000 nits of peak brightness.",
    "The first-generation QLED TVs were a win for home theater enthusiasts to be sure, but they weren't the kind of things most folks could actually afford.",
    "But then Vizio announced a quantum dot competitor that not only rivaled Samsung in terms of brightness, but priced it at half of what Samsung was selling its QLED series for. That TV is the new Vizio P-Series Quantum, and it’s probably one of the best values in the industry right now, as a 65-inch screen with quantum dot, 2,000 nits of brightness and, best of all, will only set you back between $1,500 and $1,700.",
    "In terms of design, there’s a lot to like about the P-Series Quantum - it has a slim bezel, a neat silver trim around the edges and two wide legs that are easy to install with a little help from a friend.",
    "While it’s not necessarily the slimmest TV we’ve seen from last year (OLED TVs are always going to be slimmer than LED-LCD screens), it’s not bad considering the screen is housing a full-array panel inside. Is there room to improve here? Absolutely. But this isn’t necessarily a dealbreaker for us.",
    "What is more of a deal breaker is how the TV handles cabling.",
    "Around the back of the screen you’ll find a cutaway space for all the inputs and outputs. The cutaway design makes it easy to connect new devices if the TV is wall-mounted, but when it’s sitting on a shelf cords jut out of the side and make your beautiful new living room centerpiece look cluttered and unrefined. Similar screens from Samsung use a t-bar design that relocates cables down through the stand, and that keeps things looking clean.",
    "Alongside the TV, you’ll also get a fairly standard plastic remote. The remote will feature shortcut buttons for some of the most popular streaming services including Netflix, Amazon Prime Video and Vudu. While it still uses an IR blaster (i.e. it still needs line of sight to the TV) it's fairly powerful, so don't worry too much if you have a big soundbar that blocks the front of the screen.",
    "What the remote is missing, however, is a voice search button. Voice search has become fairly ubiquitous at this stage, and its absence is definitely felt on a TV that otherwise feels just as premium as the competition.",
    "If there’s anything substantial holding the Vizio P-Series Quantum back, it’s Vizio’s smart platform: In just a few words, SmartCast is one of the least robust platforms and one of the slowest, too. Startup from a complete shutdown takes a seriously long time, and navigating around the interface isn’t nearly as snappy as LG’s WebOS or Samsung’s Tizen platform.",
    "The main interface is divided into three rows: one for featured content, a discovery row and a row that lists all the available apps on SmartCast. The featured content row is almost exactly what it sounds like - a place for Vizio to highlight new apps or content from its partners.",
    "Discover, however, is a bit of a letdown. Often, SmartCast would recommend content to me that had little relation to the shows, movies and YouTube clips that I watched, even after spending weeks with the TV. After logging dozens of hours with the screen, I was still getting recommended nonsensical content.",
    "In terms of apps, your selection of content isn’t broad nor does SmartCast offer a traditional app store that you’d find on other smart TV platforms. In its defense, however, there is WatchFree (a re-skinned version of PlutoTV) that gives you some free content right out of the box and voice support for Amazon Alexa and Google Assistant, a big plus if you've got a smart speaker at home.",
    "If not, if you’re just here to stream Netflix or find a film using good ol’ text search, SmartCast is fine. The platform supports most major streaming services on the built-in interface, and anything missing usually can be cast to the TV using Chromecast Built-in.",
    "Having Chromecast Built-in is like having a Chromecast attached to the TV at all times. You can stream most video or audio apps from an iOS or Android device to the screen, and the TV will instantly pick up the content from your device.",
    "By and large, it’s SmartCast’s defining (and, in my opinion, redeeming) feature.",
    "Vizio’s upscaling process is massively improved from a few years ago - and the P-Series Quantum is really the pinnacle of Vizio’s achievement in the area. To that end, unless you’re really taking a critical eye to it, most HD/SDR content looks great.",
    "Movies like Blood Diamond (available on Netflix) look significantly better on this screen than a comparable 1080p TV - and rival native 4K content in all but a few scenes shot at dusk where graininess creeps into the picture.",
    "While Vizio’s P-Series Quantum doesn’t pack any other nifty upscaling tricks - like HDR+ on Samsung’s 2017 and 2018 QLED TVs or LG’s four-step upscaling process that radically improves clarity and color- SDR content on the P-Series Quantum still benefits from the ultra-bright backlight and its 192 dimming zones really quash any blooming with the dimmer SDR content. (It’s a problem when the TV plays something in HDR, but we’ll get to that.)",
    "Motion, handled by Vizio's proprietary Clear Action 960, gives us a 240Hz effective refresh rate and works very well with both fast-paced and dialogue scenes, all of which looked natural throughout our testing process. Occasionally, however, you’ll still spot some motion blur and scenes that look unnatural due to overprocessing, but largely there’s nothing to complain about in this area.",
    "Around the back of the screen in the cutaway space for the inputs, you’ll find five HDMI ports. Four of these ports are HDCP2.2/HDMI 2.0 capable to handle 4K resolution and offer HDR support. The fifth port, however, is HDCP2.2/HDMI v1.4 and is designated as low-latency 1080p. If you’re a gamer who doesn’t mind trading some eye-candy for faster response times, this is the port you want to use.",
    "That being said, all the other ports were fine for gaming - especially if you’re using something like the Xbox One X or PS4 Pro. Anthem, a new title from EA that supports HDR10 and native 4K resolution, looked outstanding on the P-Series Quantum. Red Dead Redemption 2 on PS4 didn’t quite offer the same detail, but it’s still next-gen-looking enough to impress friends who came over to play some games.",
    "Speaking of HDR, like the standard P-Series, the P-Series Quantum supports HDR10, HLG and Dolby Vision. And while it’s not the most affordable Dolby Vision TVs on the market - an honor that belongs to TCL’s 6-Series or 5-Series TVs - it does offer a visual panache that neither of those screens can match.",
    "Movies and shows shot in HDR look exceptional on this TV. Lost in Space on Netflix (available in Dolby Vision) looks remarkable on the screen as vibrant hues of alien worlds stand in stark contrast to scenes of inky deep space - and both look great.",
    "That said, right out of the box, you’ll want to turn the TV off its Vivid setting - it’s way too bright, makes colors look unnaturally oversaturated and can give certain bright objects on the screen a glowing halo. Out of the box we watched Mowgli: Legends of the Jungle on Netflix and all of the characters radiated light - something that’s barely noticeable on other screens but becomes a massive issue here if you don’t change the settings.",
    "Switch it to whichever setting makes the most sense for your environment and your particular aesthetic taste. (I found Calibrated Dark with a Cool color temperature to be the best suited for my living room, but your setup / personal preferences will obviously vary.) But at over 1,000 nits peak brightness in most scenes, the TV can really light up a room and might cause a bit of discomfort if you leave the TV on its factory settings.",
    "So why did Vizio make a TV so bright in the first place? Brighter TVs are advantageous for a few reasons. Extra brightness coupled with HDR and Wide Color Gamut mean that the TV is able to produce a wider array of colors than other LCD screens (some one billion colors), and brightness also impacts contrast - which, in this case, is 50,000,000:1.",
    "HDR on TVs like the Vizio P-Series Quantum add detail to the bright and dark areas that normally wouldn't have any on a non-HDR TV - and few do it as well as Vizio's.",
    "Brightness, however, can have its downsides - namely in the form of blooming. When watching HDR content, you can expect to see a halo form around closed captions as well as menu options and other parts of the TV’s UI. It’s not horrible when you’re watching a TV with subtitles off, but turn them on and it can be pretty distracting to see them light up the lower-third of the screen.",
    "Not sure what if the content you’re watching is in 4K, HD, HDR or Dolby Vision? One of the most helpful features on the Vizio P-Series Quantum is its handy info button that will quickly tell you what you’re watching and in what format.",
    "As far as sound quality is concerned, the P-Series Quantum isn’t anything to write home about. It features two 10W speakers that are passable but not excellent.",
    "What Vizio seems to have focused most is on the mid-range, center channel audio with a slight tilt in the upper mids. This makes it relatively easy to hear dialogue during intense action scenes - which is no doubt a good thing - but it comes at the expense of detail in the highs and lows. Movies certainly sound less cinematic without a booming bass response and twinkling musical scores can sound rather flat when played through the back-firing speakers.",
    "All said, you’ll likely want to invest in a soundbar sooner rather than later.",
    "The good news there, however, is that Vizio makes two relatively strong contenders in that arena with its SB36512-F6 and SB46514-F6 Dolby Atmos soundbars. The former, which offers a 5.1.4 setup with two rear speakers and a wireless subwoofer, goes for just $499.",
    "While the TV can pass Atmos signal from Vudu and Amazon Prime Video, the bad news is that, as of right now, Netflix doesn’t support Dolby Atmos playback on Vizio’s SmartCast platform - so just be prepared to also pick up an Xbox One or Atmos-compatible Blu-ray player to get the full experience.",
    "If Samsung sold you on the idea of a quantum dot TV only to scare you away with their price, the Vizio P-Series Quantum is a good compromise. It’s a big, bold and affordable screen that supports most forms of HDR and has the ability to light up the room with its 2,000 nits of peak brightness.",
    "It might not be able to hit the inky black levels of OLED, and suffers from slow startup, but it is by far the best value quantum dot TV on the market."
  ],
  "headers": {
    "3": "Design",
    "9": "Smart TV (SmartCast)",
    "16": "HD/SDR Performance",
    "22": "4K/HDR Performance",
    "30": "Sound",
    "35": "Final verdict"
  },
  "links": {
    "QLED TVs": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "6-Series": "https://www.techradar.com/reviews/tcl-6-series-r615-r617",
    "5-Series": "https://www.techradar.com/reviews/tcl-5-series-s517-s515",
    "SB36512-F6": "https://www.techradar.com/reviews/vizio-dolby-atmos-soundbar-sb36512-f6",
    "SB46514-F6": "https://www.techradar.com/reviews/vizio-dolby-atmos-soundbar-sb46514-f6"
  }
}