{
  "source": "https://www.techradar.com/reviews/hands-on-nokia-62",
  "title": "Hands on: Nokia 6.2 review",
  "category": "phones",
  "updated": "2019-09-05T14:30:00Z",
  "author": "john-mccann",
  "summary": "A highly affordable mid-range Android",
  "verdict": "The Nokia 6.2 looks to be a strong contender at the affordable end of the Android smartphone market. Whether it can really challenge Honor, Huawei and Motorola remains to be seen, but the early signs are positive.",
  "pros": [
    "Pleasing premium design",
    "Triple rear cameras",
    "Large display"
  ],
  "cons": [
    "Washed out wide-angle images"
  ],
  "article": [
    "The Nokia 6.2 is one of two new mid-range smartphones bearing the famous name launched at IFA 2019 in Berlin, Germany - and there isn't too much to choose between it and its slightly pricier sibling, the Nokia 7.2.",
    "Pitched as an affordable mid-range handset for users who want a bit more power and stronger photography chops than budget handsets, the Nokia 6.2 sits nicely towards the cheaper end of this wide segment of the market.",
    "It comes with a 6.3-inch Full HD+, Snapdragon 636 chipset, 3GB or 4GB of RAM, 32GB or 64GB of storage, triple rear cameras, fingerprint scanner and a 3,500mAh battery.",
    "The Nokia 6.2 release date is set for October, when we expect it to be relatively widely available around the world.",
    "As for the Nokia 6.2 price, you're looking at €199 (around $220, £180, AU$320) for the 3GB of RAM and 32GB of storage model, while the 4GB/64GB configuration will set you back €249 (around $270, £230, AU$400).",
    "At this price the Nokia 6.2 finds itself competing with the highly accomplished Honor 10 Lite, Huawei P Smart 2019 and Moto G7 - some tough competition for sure.",
    "The Nokia 6.2 boasts relatively standard smartphone look, with sheets of Gorilla Glass sandwiching a polymer composite chassis – a material which is twice as hard as polycarbonate, and half the weight of aluminum.",
    "It provides the Nokia 6.2 with a strong, durable frame which still manages to feel premium enough in the hand, especially when you consider its price tag.",
    "You'll be able to pick the Nokia 6.2 up in two colors; mirrored Ceramic Black and the off-white Ice. The rear of the handset is a real fingerprint magnet however, with the worst offender the black shade which shows up every mark. If you don't use a case with the Nokia 6.2, you'll likely find yourself wiping it down regularly.",
    "One of the big design features on the phone is the rear camera bump. Charged with housing the three rear cameras and flash, the sizable protrusion is a real presence and is reminiscent of the look on the iconic Lumia 1020.",
    "Sitting below the camera bump is a fingerprint scanner which falls nicely under your forefinger when held in the hand, making it easy to hit.",
    "We found the 6.2 sat well in the hand during our time with the handset, and it's just about usable one-handed - although those with smaller palms will likely need to employ both hands to be able to reach all corners of the screen.",
    "There's good news for audiophiles, as on the top edge of the Nokia 6.2 is a 3.5mm headphone jack, while on the base of the handset you get a USB-C port for charging. Meanwhile the power and volume keys reside in an easy to reach location on the right of the handset. On the left you get another key, which is programmed to launch Google Assistant, but you can change this in the settings to launch an app of your choosing.",
    "The dominant feature on the front of the 6.2 is the large, 6.3-inch display which HMD Global (the firm behind Nokia phones these days) claims is best in class.",
    "It uses a LCD panel, which tends to be less color rich than OLED panels, but the Nokia 6.2 comes with the firm's PureDisplay technology which enhances the color and vibrancy of the screen.",
    "The screen does look good, and it comes with another significant feature - automatic, real-time up-scaling from SDR to HDR, which HMD claims provides a 64x increase in color tonality.",
    "What does that mean for you? Better brightness and contrast in video playback and during gameplay, providing you with a clear image on screen.",
    "There's also a small waterdrop notch at the top of the display which houses the front-facing camera, while there's a small bezel below the screen.",
    "The Nokia 6.2 is set to be a highly affordable handset, but it doesn't skimp on cameras, with three sensors on the rear.",
    "Your main snapper is a 16MP, f/1.8 sensor which we found was capable of capturing a good level of detail on landscape shots with strong colors.",
    "Next up is the 8MP, f/2.2 ultra-wide angle camera with an 118 degree field of view. This allows you to fit more of your surroundings into a shot, but the detail isn't as high and vibrancy is much lower compared to the main camera.",
    "Finally, a 5MP depth sensor completes the trio and provides the smarts for bokeh portrait shots, where the background of your subject is blurred. You can adjust the level of background blur in real time, and you have the option of three different blur effects allowing you to fine tune your shot.",
    "The interface is intuitive and we were easily able to fine tune the bokeh mode to suit our preferences.",
    "There is one more significant addition to the camera app on the Nokia 6.2, and that's a dedicated night mode. It will automatically suggest you use it when in low light situations, although we were unable to put it to the test during our hands on time with the phone.",
    "Meanwhile, when it comes to the 3,500mAh battery packed inside the Nokia 6.2, the claim is it will last two days on a single charge. It's not something we could put to the test during our preview, so keep an eye out for our in-depth review to find out how it performs.",
    "The Nokia 6.2, like all current Nokia-branded smartphones, is part of Google's Android One program, which gives you an almost stock version of the Android operating system and guarantees you two years of major updates, and three years of security patches.",
    "It means the Nokia 6.2 is nicely future proofed for the coming years, and HMD Global is currently the fastest manufacturer when it comes to rolling out new Android software to its entire fleet. The Nokia 6.2 will get the Android 10 upgrade soon after release.",
    "With a Snapdragon 636 chipset and either 3GB or 4GB of RAM, there's enough power under the hood to keep Android running smoothly and it should be able to run most apps you chuck at it without too much trouble.",
    "If the bundled 32GB or 64GB of storage (depending on which variant you opt for) isn't enough, you can expand on that with a microSD card too.",
    "The Nokia 6.2 looks to be a strong contender at the affordable end of the Android smartphone market. It has a pleasing design, good enough specs and enough camera intrigue for the price point to make it an interesting proposition.",
    "Whether it can really challenge Honor, Huawei and Motorola remains to be seen, but the early signs are positive.",
    "IFA 2019 is Europe's biggest tech show, and the TechRadar team is in Berlin to bring you all the breaking news and hands-on first impressions of new TVs, wearables and other devices as they're announced."
  ],
  "headers": {
    "3": "Nokia 6.2 release date and price",
    "6": "Design and display",
    "18": "Camera and battery",
    "25": "Performance and specs",
    "29": "Early verdict"
  },
  "links": {
    "IFA 2019": "https://www.techradar.com/news/ifa-2019-news",
    "Honor 10 Lite": "https://www.techradar.com/reviews/honor-10-lite-review",
    "Huawei P Smart 2019": "https://www.techradar.com/reviews/huawei-p-smart-2019",
    "Moto G7": "https://www.techradar.com/reviews/moto-g7-review",
    "Lumia 1020": "https://www.techradar.com/reviews/phones/mobile-phones/nokia-lumia-1020-1165253/review",
    "Nokia phones": "https://www.techradar.com/best/best-nokia-phones",
    "Android One": "https://www.techradar.com/news/what-is-android-one",
    "Android 10": "https://www.techradar.com/news/android-q",
    "IFA 2019 is Europe's biggest tech show, and the TechRadar team is in Berlin to bring you all the breaking news and hands-on first impressions of new TVs, wearables and other devices as they're announced.": "https://www.techradar.com/news/ifa-2019-news"
  }
}