{
  "source": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
  "title": "Amazon Echo (2017) review",
  "category": "audio-visual",
  "updated": "2019-12-03T16:54:52Z",
  "author": "marc-chacksfield",
  "summary": "The Amazon Echo 2nd generation speaker is a lot smarter and cheaper today",
  "verdict": "While the smarts stay the same, the 2017 Amazon Echo has been given a much-needed makeover with a price just too compelling to resist.",
  "pros": [
    "New look",
    "Low price",
    "Great new Alexa features"
  ],
  "cons": [
    "More of the same",
    "Alexa app could be better",
    "No more rotating dial"
  ],
  "article": [
    "Smart speakers may have well and truly taken off in recent years, but it all started back in 2014, when Amazon first launched its original Echo speaker.",
    "Packing the company's voice-enabled Alexa smart assistant, the Echo brought together AI smarts and convenient home audio – and absolutely stormed the smart home market, expanding into the variety of speakers, smart displays (like the Echo Show or the new Amazon Echo Show 5), and add-on gadgets (Echo Input) sold under the Echo name today.",
    "Although Amazon’s Echo range is still going strong, it wasn’t long before other big tech names made a play for a slice of the smart home pie. These days there’s fierce competition from the Apple Homepod and Google Home, as well as a whole host of third party speakers.",
    "This year we also got the all-new Amazon Echo (2019), which offers better sound quality than the model in this review – but that doesn't mean you should write off the Amazon Echo (2017).",
    "The truth is that, despite mounting competition, the Amazon Echo is still one of our favorite options for your modern day home. It’ll play music, check the news and make your smart home tick. That’s because not only is it a solid speaker with a refreshed design, it’s also an admirable AI smart home helper thanks to Alexa.",
    "The second-generation Amazon Echo sits in a sweet spot – it’s affordable, yet a fully capable smart speaker.",
    "It has dual-speakers powered by Dolby, which means it sounds much, much better than the smaller Amazon Echo Dot. However, on the smart speakers price scale it’s still a mid-range choice in comparison to the pricier Echo Plus.",
    "We believe its sound quality is more than good enough for most everyday needs. However, audiophiles be warned: it's not ready to replace your Hi-Fi sound system just yet. Instead, it's a great starter option if you want to dip your toe into the smart home space without a big financial commitment or if playing lots of music isn’t really a priority for you.",
    "Its Alexa digital assistant doesn't seem quite as intelligent as Google Assistant either, but that might be more of a subjective preference. At this affordable price though, we're very, very happy with this smart speaker and it'll take a lot to knock it off our top spot.",
    "Is there a monthly fee for Echo No, there’s no monthly fee. You just need to buy the Echo and have an Amazon account. You’ll then need to get the Amazon Echo app, which is also free.",
    "However, if you’re an Amazon Prime member you’ll get some added benefits, like access to Amazon Music through your Echo.",
    "What does an Amazon Echo do? Think of the Amazon Echo as your own personal assistant. We’re not at the stage where our tech can physically help us run our homes, but it can do everything else. So you can ask the Echo’s voice assistant, Alexa, to answer questions about the time, general knowledge, traffic, what the weather is going to be like and everything else that might help your day run a bit smoother.",
    "Thanks to smart home tech all connecting up, you can also use your Echo to control other devices that you might have in your home. So let’s say you have a Philips Hue lightbulb, for example, the Echo can control that too. You’d just need to say “Alexa, turn off the bulb.”",
    "That’s just the beginning. The Echo has a whole host of ‘skills’ which you can think of as separate apps and things it can do for you, from playing games to controlling other tech to waking you up in the morning.",
    "What’s the difference between Echo and Alexa? The Echo is the name of the smart speaker, Alexa is the smart assistant inside.",
    "What’s the difference between Amazon Echo and Amazon Dot? The Amazon Echo is the original smart speaker from Amazon. It has Alexa built-in and can play good quality music. The Dot is the same thing, but smaller. The main difference is that the Dot’s speaker isn’t as good as Echo’s. So if you want to play music, get an Echo.",
    "Does the Echo require Alexa? Yes. Alexa is what makes your Echo smart. Think of her as your own smart assistant and the brains behind the hardware. You ask her to do things and help you with things throughout the day, from “Alexa, what will the weather be like later?” to “Alexa, switch on the lights please.”",
    "You don’t need to do anything extra to get Alexa, the voice assistant comes built-in to Amazon’s Echo range of smart speakers.",
    "When it comes to accessibility and affordability, the Amazon Echo is one of the best smart speakers around. It's currently had a price cut across most regions, which means if you're based in the US you'll pay $74.99 ($AU119), or £79.99 in the UK.",
    "That means it's a much more appealing impulse buy than the original Amazon Echo was at launch, which cost $180 (£150, around AU$230).",
    "Although they're the latest prices, you'll often find smart speakers at a reduced price as Amazon and Google really want you to snap them up right now.",
    "However, without a discount the arch rival Google Home doesn't get below the magic $100/£100 barrier. It costs $129 (£129, $AU199), but it's worthing pointing out there are often offers to be had.",
    "Most third-party Alexa speakers can't compete with the Echo. The Kitsound Voice One ($179, £129.99) is pricier and doesn't sound amazing, and most lower-cost units are simply speaker sleeves for an Echo Dot.",
    "For the time being, the Amazon Echo is a solid choice and a good deal if you've been agonizing over which smart speaker to try first.",
    "Thanks to the 2017 Amazon Echo update, this version (called 2nd generation) of the Amazon Echo is probably the least techy-looking of the Amazon range of audio assistant speakers. A fabric grille wraps around its sides, rather than the brushed aluminium of the higher-end Echo Plus.",
    "Of course Amazon may have added the fabric to cut costs, but it gives the speaker more of an 'interior design' flavor that we think is more stylish. This is an important change as smart speakers become mainstream and an integral part of everyone's living room, rather than just for early adopters.",
    "The upgraded Echo is also smaller and wider than its predecessor. Rather than meaning it gets more in the way, it's actually a welcome change, making the smart speaker steadier on its feet. While we always felt that an accidental nudge would topple the original Echo over, the new Echo's sturdier footprint means it isn’t going anywhere.",
    "Its design is more in keeping with the current crop of smart speakers, like Google Home and the Apple HomePod.",
    "We have no issue with this. The style is more desirable than the original Echo and Amazon has decided to combine elements of the Dot with the full size device, switching up the volume dial for a pair of buttons. These are joined by a mute button to stop Alexa hearing anything and everything, as well as a button to summon Alexa if you’re too busy to say her name out loud.",
    "This does mean the nice ergonomic experience or rotating a dial rather than tapping the buttons on the top is missing, which for some people will likely be a shame.",
    "The design isn't the only thing that's changed in the 2017 iteration of the Amazon Echo, though. Alexa has been through a number of updates, gaining new Skills and routines, as well as improved voice recognition and understanding. (You can check out our selection of the best Alexa Skills in our comprehensive rundown, as well as some fun Alexa Easter eggs.)",
    "But now that Alexa is built-in to other devices, such as the Sonos One and Ultimate Ears Megablast, and the design of the Echo is more understated, does Amazon's smart speaker run the risk of blending in a little too much?",
    "The all-new Amazon Echo’s exact measurements are 148 x 88 x 88mm. Compare this to the original’s 235 x 84 x 84mm and it's plain to see the height loss and waist gain. Weight-wise it's a solid 821g.",
    "The Amazon Echo we tested came in the color Charcoal Fabric, but there are a number of other colors to choose from. This is a great choice. Amazon has stretched beyond black and white with its color palette, as well as the material it is using to cover the Echo's innards.",
    "There are three fabric options: Charcoal, Heather and Sandstone. There are also three 'finish' offerings; Oak, Walnut and Silver. Their names (apart from the last) may conjure up wood, but it's worth noting that the shells are made from plastic and are £10/$10 more expensive than the fabric versions.",
    "The shell is interchangeable, too. If you change the decor in your living room you can buy a new shell for your Echo to match. These are available separately for £19.99/$20 for the fabric versions and £29.99/$30 for the rest. This does feel a little expensive given it means you're paying around a third of the price for a shell when most of the money has surely gone into the internals of the Echo machine. But the option is there.",
    "If great quality sound is your priority and the Echo doesn't compare to your current audio set-up, you can also connect the Echo to a larger speaker or hifi if you like. It has Bluetooth for a wireless connection, and a 3.5mm output socket on the back.",
    "The Amazon Echo (2nd Generation) is a breeze to set up but you have to use the Amazon Alexa app on your phone to get it started.",
    "It spells out how to get the Echo on to your network and takes just a couple of minutes to work through. Head to Settings and Set up a New Device and then just choose the right Echo for installation (they are handily shown as icons) and follow the setup instructions.",
    "The real learning curve of an Amazon Echo is elsewhere: knowing what to ask Alexa, what works and what doesn't, and then diving into Echo Skills to add abilities. These are a little like apps for your smart speaker, and there are now over 30,000 of them.",
    "Check out TechRadar's handy best Alexa Skills guide for more, but Amazon includes a little booklet with some starter ideas. These are pretty simple but effective.",
    "You can ask Alexa what the time is, what the weather is like (you will have to input where you actually live for this), for a flash news bulletin, ask it a joke, to set a timer… there's a whole host of things you can do without setting up a Skill.",
    "But to really make your Echo sing (and it does sing, just ask it) you will want to dive into the Skills and modify the Echo to work for you.",
    "Again this is a simple process (head to the All Skills part of the app) but it's a quality minefield. There are thousands available but only a small percentage of these are actually worth bothering with depending on what other 'smart' things you have around the house.",
    "In our tests, we hooked the Echo up to the following Skills: Amazon Music, Spotify, TuneIn Hive thermostat (and smart lights), a Sonos system, our Just Eat account and Google Calendar.",
    "On the whole the Echo managed to work well, although it did occasionally trip itself up and get confused. Asking for 6Music (the UK radio station) would sometimes take us to a devilish playlist of 666 music, while we would eventually get to the radio station we wanted by sometimes saying BBC 6Music to avoid confusion. Other times we would have to add \"on TuneIn\" to the end of what we asked Alexa.",
    "You need to do this if you have two or more music accounts linked up to it as well, but that makes sense. In the app you can choose, say, Amazon Music as your primary music service to avoid having to repeat commands over and over.",
    "Other teething issues include some content being played on another Echo device not in the same room as us when we wanted it to be played on the new Amazon Echo. We tried out Alexa reading aloud one of our Kindle audiobooks and its voice sounded distant – it took us a few seconds to realise that it was because the book was being read in the upstairs bedroom, where our 1st-gen Echo resides.",
    "But these are only occasional glitches with what is a simple and smooth service. Echo and Alexa have made controlling your home smart so much easier and these devices have to be applauded for that.",
    "Sound quality on the Amazon Echo (2nd generation) is crisp. Every time Alexa speaks she's clear, and the Echo's seven-mic array means it always picks up when you call to her. And Alex, much to the annoyance of our friend called Alex.",
    "To test out what music is like through it we chose a mixture of tracks. Four Tet's excellent New Energy hit the bass notes well, with the Echo coping to a point. That said, if you want a sound upgrade then it's best to look at the Amazon Echo Plus. The new Amazon Echo is more than passable with its sole 2.6-inch woofer and single 0.6-inch. The inclusion of Dolby processing does offer a more expansive sound but it wasn't as warm as we would have liked. Crank it up and it the sound quality also starts to break up a little.",
    "The twang of Weezer's guitars in Pacific Daydream were picked out well, however. In the lower frequencies is where the Echo starts to strain.",
    "Comparing it to the original Amazon Echo and the new model easily competes, which is fantastic considering the radically lower price point.",
    "Although not exclusive to this model of Amazon Echo, Alexa has been given some significant upgrades in recent times with some great new features.",
    "You can now make voice calls to mobile phone numbers in the US, UK, Canada, and Mexico. To enable this feature, you need to assign your mobile number to your Amazon account, giving it access to your contacts book.",
    "You'll then be able to ask \"Alexa, call Dad\" and have your smart speaker patch you through to her smartphone. The ability to receive calls on Echo devices is limited depending on which mobile network you're on, but anyone is able to make them.",
    "The ability to take calls through the Echo is a nice addition, as is the Drop In feature – essentially an intercom for your home between Echo devices. This has cut down the 'shouting upstairs that dinner is ready' din no end in our home.",
    "The Routines feature is welcome, too. This bunches a number of smart things together that can happen with one command. You can now turn on lights and get a morning briefing just by saying, \"Alexa, start my day\". It's a fun feature and one that will grow and grow when more Skills are added. Like other elements of Alexa, it's a work-in-progress.",
    "The grouping of smart home devices has also been improved, which makes it a lot easier to control multiple devices (from multiple manufacturers) with just one command. Again, if you want to smooth out your smart home then you may want to opt for the Amazon Echo Plus, which offers even more simplified smart device discovery and essentially does away with many a smart device hub, thanks to its ZigBee integration.",
    "There are some more exciting upgrades that have just been rolled out – as well as some that are on the way soon.",
    "The newest is that Alexa has received a new feature called CanFulfillIntentRequest, which will let the developers of Skills tell Amazon the kind of questions their tool can answer. What this means is that if a user makes a vague request, the new feature will scan all of the Skills in its database to find the one most likely to respond appropriately. So there's no more confusion if you forget the triggers to specific Skills! Hurrah!",
    "The Amazon team is also working on a better way to help Alexa more naturally understand conversations. The idea is that you won't have to constantly say Alexa’s name to get her attention during a conversation – Alexa will just keep listening and responding until you’re finished asking questions.",
    "Alexa Brain's head, Ruhi Sarikaya, says these improvements will roll out to US, UK and Germany first, but refrained to give an exact date as to when we could expect the update to hit. Watch this space.",
    "The latest Amazon Echo (2nd generation) smart speaker is a refreshing update to the Amazon range. Its price is lower, the design more appealing and Alexa gets better with each passing month.",
    "Because many of these changes aren't particularly huge, the arrival of the latest Amazon Echo didn’t have the heft or 'wow' factor of the original Echo.",
    "It's also clear that Amazon is up against tough competition with the Google Home, Apple HomePod and even the Sonos One thanks to its superior sound quality.",
    "It is still too early to tell if one of these systems will come to dominate smart home control. However, all reports suggest Amazon Echo devices outsell those of the Google Home range and Apple HomePod.",
    "And even if you don't fall in love with the idea of smart home tech, you can still use the Echo as a pure Bluetooth music speaker."
  ],
  "headers": {
    "9": "Amazon Echo FAQ: quick questions answered",
    "18": "US and UK price and availability",
    "24": "Design and features",
    "37": "Performance",
    "53": "Amazon Echo updates",
    "63": "Final verdict"
  },
  "links": {
    "Smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "Amazon Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5",
    "Echo Input": "https://www.techradar.com/reviews/amazon-echo-input",
    "Apple Homepod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Google Home,": "https://www.techradar.com/reviews/google-home",
    "Amazon Echo (2019)": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review",
    "Echo Plus": "https://www.techradar.com/reviews/amazon-echo-plus",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "best Alexa Skills": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Alexa Easter eggs": "https://www.techradar.com/best/80-amazon-alexa-easter-eggs-fun-tips-and-tricks-for-your-echo-speaker",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Ultimate Ears Megablast": "https://www.techradar.com/reviews/ultimate-ears-megablast-alexa-smart-speaker",
    "Amazon Echo Plus": "https://www.techradar.com/reviews/amazon-echo-plus",
    "CanFulfillIntentRequest": "https://www.techradar.com/news/your-amazon-echo-is-about-to-get-way-more-useful",
    "Alexa more naturally understand": "https://www.techradar.com/news/amazon-alexa-will-be-a-better-listener-after-this-next-update"
  }
}