{
  "source": "https://www.techradar.com/reviews/security-master-antivirus-vpn-applock-booster",
  "title": "Security Master: Antivirus, VPN, AppLock, Booster review",
  "category": "computing",
  "updated": "2020-07-09T15:59:41Z",
  "author": "mike-williams",
  "summary": "Clean, maintain and secure your Android device",
  "verdict": "Underpowered in some areas, and the ads are a pain, but the antivirus is reliable and there are plenty of features to explore.",
  "pros": [
    "Free version",
    "Loads of features",
    "Highly-rated antivirus",
    "Limited VPN in free plan"
  ],
  "cons": [
    "Annoying ads",
    "Underpowered 'booster' tools",
    "Overpriced premium version"
  ],
  "article": [
    "Note: Security Master and all other Cheetah Mobile apps have been removed from Google Play, reportedly for privacy breaches. This hasn’t been confirmed, but until there’s more information we can’t recommend you use the app. The original review follows below…",
    "Security Master: Antivirus, VPN, AppLock, Booster is Cheetah Mobile's one-stop security, maintenance and optimization app for Android. The company says it now protects more than 600 million phones, and as we write it has a Google Play rating of 4.7.",
    "The app made the headlines last year for all the wrong reasons when app analytics company Kochava reported that it, and several other Cheetah Mobile apps, were using click injection techniques to commit ad fraud. It's worth reading up on the story to see what is involved, but as we've not seen the evidence, we're not going to allow it to affect this review.",
    "Security Master's core module is the antivirus engine, and this does a good job of scanning your device for malicious apps. No need to take our word for it; the November 2018 AV-Test report found Security Master blocked 100% of test threats .",
    "A custom browser blocks ads while antiphishing protection prevents you accessing malicious URLs, keeping many web threats at bay. (You're only protected in this browser, though.)",
    "A simple Hotspot Shield-powerred VPN encrypts your network activity, gives you a new virtual location and perhaps helping to access blocked websites. The free plan gives you access to just three locations (US, UK, Australia), and the free and standard plans give you a horribly limiting 200MB a day data limit, so this isn't a feature you'll be using often. Still, it's handy as a way to protect very occasional browsing at insecure wireless hotspots.",
    "The AppLock feature enables protecting any or all of your apps with a pattern, a PIN or (on some devices) a fingerprint, keeping snoopers firmly locked out. If someone tries to get in anyway but fails, you can have Security Master take a photo of the intruder and email it to you.",
    "Built-in wi-fi checking aims to identify suspect wireless networks; an anti-theft alarm raises an alert if someone moves your phone, and a message security system combines notifications into one, making them easier to manage.",
    "Booster modules claim to optimise your device by deleting junk files, clearing away useless notifications, keeping your CPU cool and extending your battery life.",
    "Learning how to operate all of this could have been difficult, but fortunately it isn't necessary: you can have Security Master scan your system to make its main recommendations, then apply them all in a couple of taps.",
    "Security Master's core features are available in an ad-sponsored free version.",
    "The Standard version drops the ads, enables automated device boosting for better performance, throws in the anti-theft alarm and gives you priority technical support for $0.99 a month if you pay for a year up-front.",
    "The Premium edition supports unlimited VPN use for $3 a month, paid annually. That looks cheaper than most annual VPNs, but keep in mind that you're only getting a license to use the VPN on a single Android device. Sign up direct with a VPN provider and you'll generally be able to install and use the service on multiple devices and platforms.",
    "Security Master is simple to set up, with no registration or other issues involved - we just tapped Install from the Google Play store and the app was ready to go within a few seconds.",
    "The app interface can seem complicated, as there's a lot going on. A Scan button enables checking everything; there are separate icons to run the Antivirus, AppLock, Clean Junk, CPU Cooler, Notification Cleaner and Phone Boost features, and below that is a mix of status information (battery life, the wifi network you're currently accessing) and shortcuts to yet more app modules (Game Boost, Message Security, Safe Browsing, SafeConnect VPN, Battery Saver, More).",
    "The Scan function checks your device for malicious apps, malware, poorly configured settings and more. The reporting isn't always clear - the app told us it had found a virus, but not what or where that was, leaving us unsure if this was a legitimate threat of a false alarm - but it's undeniably easy to use.",
    "The AppLock module displayed our installed apps and made intelligent recommendations about the apps to protect (Messenger, Photos, Chrome.) We accepted its advice and were prompted to choose a PIN that would unlock all three apps (you can't have a per-app unlock method).",
    "After the initial setup Security Master displayed our locked apps, made further suggestions about others, and enabled locking or unlocking any app with a tap.",
    "We found Security Master correctly stepped in to restrict access to our selected apps, allowing us in when we entered our PIN. This should be easy enough to remember as there's only one, but Security Master also allows users to specify a security question (what's your favourite movie, mother's name, father's name, where did you go to school, and so on) which enables resetting the PIN later if you forget it.",
    "The Junk File tool found 234MB of leftover data which could be safely deleted. That wasn't bad for a relatively clean device, but when we ran CCleaner for a comparison it found 766MB of junk.",
    "A CPU Cooler option displays your device temperature, lists any apps using CPU resources, and offers to close them down. We noticed that Security Master listed many important apps - Android System, Android Services Library, Google VR Services, more - and allows you to select these to be closed, although it doesn't shut them down. This is a little misleading, and it would make more sense if CPU Cooler didn't display these system apps in the first place.",
    "The Battery Saver also got off to a poor start, warning us that our battery was 'draining fast', even though the device was on charge. It then analysed power use and recommended hibernating our most power-hungry apps (unlike CPU Cooler, it recognises apps which are essential and should be left running.) Battery Cooler doesn't appear to be very different to the myriad of similar apps, but should still help to improve your battery life.",
    "The Notification Cleaner says it will remove trash notifications, but there's no information on how it decides what to remove, and no control over what happens (you can't say 'remove this but keep that'.)",
    "The Phone Booster also offers no real control or feedback. We ran it, were told our memory was 79% used before, 69% afterwards, and that was it. There was no indication of which app was consuming most RAM or what had been tweaked to reduce its requirements.",
    "A Game Booster enables automatically optimising your system whenever specified games are launched. Again, there's no explanation of how it works or what it's doing.",
    "The SafeConnect VPN connected us quickly to our nearest server (UK). Our speeds were reasonable at 25-35Mbps, but the 200MB daily allowance is too limited to be of much use, and upgrading to the Premium edition to get unlimited VPN is too expensive. You can get unlimited VPN elsewhere for free, or subscribing to a specialist VPN provider would get you a better quality of service which you could use on more devices.",
    "Finally, a Safe Browsing feature combines some of the other tools to lock your browser screen, encrypt your internet connection via a VPN and clear your browsing history after a session. We suspect Chrome's incognito mode would deliver the core privacy you need and be much simpler to use, but the feature may still be useful to some.",
    "Exploring all this functionality takes a while, partly because the interface makes some of it hard to find, but also because there are plenty of ads of many different types (embedded images, full screen, multiple styles of close button, sometimes with a timer.) We've also seen several user reviews suggesting the app now has more ads than ever, although we've not verified that ourselves.",
    "Many Android security apps make big claims about their malware-scanning abilities, but without any supporting evidence. Security Master is different, fortunately - it's been around for a long time and has been tested by the main independent testing labs.",
    "AV-Test's November 2018 Android report found Security Master blocked 100% of its test samples (that's more than 3,200). The app managed the same perfect rating in the previous two tests (July and September 2018).",
    "AV-Test didn't score the app as well for Usability, though. Security Master was marked down for having an above average number of false alarms for legitimate apps. (These were very few - just 3 alerts in 2,385 samples - but the average antivirus app doesn't raise any false alarms at all.)",
    "AV Comparatives' January 2018 Android report gave test results for more than 200 Android security apps. With the default settings Security Master managed a slightly below average 96.4% protection score, but the report notes that if users turn on the Anti-heuristic detection engine (disabled by default in the English/ International version) then it would block 100% of threats.",
    "These tests didn't assess Security Master's URL blocking feature, so we ran some small-scale checks of our own. It kept us safe from 66% of newly reported malicious links in our test sample, an above-average result.",
    "Factor in Security Master's device protection tools - in particular, AppLock - and the app generally does a reasonable job of keeping your device (and data) safe from harm.",
    "Security Master is a bulky suite with some very average tools and more ads than we'd like, but the antivirus is accurate, and the app locker is also worth having. Give it a try."
  ],
  "headers": {
    "13": "Features",
    "28": "Protection",
    "34": "Final verdict"
  },
  "links": {
    "Security Master: Antivirus, VPN, AppLock, Booster": "https://www.cmcm.com/en-us/cm-security/",
    "click injection techniques to commit ad fraud": "https://www.buzzfeednews.com/article/craigsilverman/android-apps-cheetah-mobile-kika-kochava-ad-fraud",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Hotspot Shield": "https://www.techradar.com/reviews/hotspot-shield-vpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Standard version": "https://www.cmcm.com/en-us/cm-security/",
    "Premium edition": "https://www.cmcm.com/en-us/cm-security/"
  }
}