{
  "source": "https://www.techradar.com/reviews/samsung-notebook-9-pro-2019",
  "title": "Hands on: Samsung Notebook 9 Pro (2019) review",
  "category": "computing",
  "updated": "2019-01-08T04:14:16Z",
  "author": "kevin-lee",
  "summary": "The notebook made for professionals",
  "verdict": "The Notebook 9 Pro might be Samsung’s best looking and performing Ultrabook ever. Thanks to its stand out design, it makes a great first impression and it has the specs to duke it out with the best laptops on the market.",
  "pros": [
    "Equipped with the latest Intel Whisky Lake CPUs",
    "Chrome edges and an overall stand out design",
    "Thinned out screen bezels"
  ],
  "cons": [
    "No place to carry the new Active Pen",
    "Thick bottom bezel"
  ],
  "article": [
    "Last year, the Samsung Notebook 9 Pro was one our favorite Ultrabook’s and one of the very few to receive a perfect score. That’s a hard act to follow but we think the new 13-inch 2019 Samsung Notebook 9 Pro stands to outshine its predecessor with a sleeker, more premium design and a much faster processor.",
    "The biggest difference you’ll instantly recognized about the new Samsung Notebook 9 Pro is its textured edges that look like a stack of chromed ridges when viewed from the side.",
    "It’s a novel design flourish we really haven’t seen on any other laptops and it makes this notebook look like an actual book when closed. Along these fashionable edges, you’ll also find a pair of Thunderbolt 3 ports, a USB Type-C connector and a microSD slot.",
    "The new design of the Notebook 9 Pro is decidedly edgier. The radii of the corners turn at sharper angle and the top of the bottom of the notebook are also now completely flat. It’s a design we think looks better than the last iteration as it removes the duck bill-shaped gap seen on its predecessor whenever converted into tablet mode.",
    "One thing users might not appreciate is the Samsung Notebook 9 Pro built-in, stowable stylus has been replaced by an Active Pen. On the plus side, this new virtual pen offers 4,000 levels of pressure on par with the best Surface devices and everyone else. However, there's no pen holder included and Samsung hasn't included out a magnetic way of stowing it.",
    "For those who really miss the embedded stylus, there’s always the Samsung Notebook 9 Pen.",
    "Another big change from last year’s model is the minimal screen bezels we love before are now even thinner. This 13.3-inch laptop now sports a Full HD display with borders only measuring 6.7mm thick. Now if only Samsung could do something about that thick bottom bezel.",
    "The keyboard has been loosened up now, or as Samsung tells us ‘comprehensively redesigned,’ to be more spacious and eliminate the gaps in between individual keys. The keys themselves offer a poppy typing experience despite their shallow level of key travel. The touch pad is still feels responsive even if the size of its is a little more conservative next to the virtual coasters you’ll find on the latest MacBook Air.",
    "Speaking of the MacBook Air, this laptop out-thins its 0.61 inch (1.56cm) thick Apple rival with dimensions of only 12.1 x 8.1 x 0.55 inches (30.7 x 20.6 x 1.39 cm). It’s not nearly as light 2.84 pounds, but we don’t think carrying around this laptop will really strain your back.",
    "With this refresh, Samsung has gifted its latest Notebook 9 Pro with an 8th-gen Intel Whisky Lake Core i7-8565U quad-core processor that clocks in at 1.8GHz to 4.6GHz. That’s a nice step up from the Kaby-Lake Refresh Intel Core i7-8550U that powered last years model and only boosted up to 4.0GHz.",
    "Other system specs include 8GB of RAM and a 256GB PCIe NVMe SSD to round out a pretty competent Ultrabook. In terms of battery life, Samsung says you can expect up to 14 hours of usage that seems a little…optimistic, so we’ll have to double check the company’s claims in our full review.",
    "Samsung has only said that the Notebook 9 Pro will be available in Early 2019 without disclosing a price, but we imagine it will cost close to $1K if not in excess of that price.",
    "For the most part the Notebook 9 Pro feels like a step in the right direction. It’s classier looks and tighter aesthetic give it a presence that Samsung’s top-shelf laptops have been missing. This machine looks and feels like a premium product that should be held in the same regards as the MacBooks, Surfaces and XPS of the world.",
    "Now the only question is whether it has the performance and battery life to backup those good looks. We’ll know soon enough when we review the Samsung Notebook 9 Pro when it eventually releases."
  ],
  "headers": {
    "1": "Design",
    "9": "Specs",
    "12": "Early verdict"
  },
  "links": {
    "Samsung Notebook 9 Pro": "https://www.techradar.com/reviews/samsung-notebook-9-pro",
    "Samsung Notebook 9 Pen": "https://www.techradar.com/news/samsung-debuts-notebook-9-pen-with-fresh-design-introduces-15-inch-model",
    "MacBook Air": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-air-1300233/review",
    "Intel Whisky Lake": "https://www.techradar.com/news/intel-whiskey-lake"
  }
}