{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-9",
  "title": "Xiaomi Mi 9 review",
  "category": "phones",
  "updated": "2019-06-06T11:41:42Z",
  "author": "tom-bedford",
  "summary": "Xiaomi's newest mid-range miracle",
  "verdict": "The Xiaomi Mi 9 is a fantastic all-round device, offering many of the bells and whistles of high-end phones but without the price tag.",
  "pros": [
    "Affordable price",
    "Impressive camera setup",
    "Powerful chipset"
  ],
  "cons": [
    "Gets hot rather easily",
    "Odd-looking UI",
    "Low battery capacity"
  ],
  "article": [
    "Update: Xiaomi has announced that it plans to release not one but two spin-offs for the Xiaomi Mi 9 – the Xiaomi Mi 9 SE and Xiaomi Mi 9T.",
    "The Xiaomi Mi 9 SE is a 'compact' version of the base Mi 9, with pared-down specs and a price tag that's significantly lower than the already-cheap Mi 9. It's already available in certain regions, including the UK, so you can pick it up already.",
    "The Xiaomi Mi 9T is a different device entirely, with an all-body screen and 'pop-up' selfie camera, as well as advanced specs. We don't know for sure when it'll be available yet, but we're expecting it to cost a little more than the Mi 9.",
    "Xiaomi is still fairly new to the mobile market outside of China – the Xiaomi Mi 8 Pro was the first phone launched in the UK for example, in 2018 – but it’s posing some serious competition to establish brands with the Xiaomi Mi 9, its newest flagship device.",
    "The Mi 9 looks like a fantastic jack-of-all-trades device; it has a powerful processor, impressive camera setup, and supports up to 20W fast charging – and on top of that it’s a whole load cheaper than phones with a similar spec.",
    "It’s not without drawbacks – Xiaomi has clearly had to cut some corners to get a fantastic chipset and camera array into the handset at such a low price, and its attempt at designing its own UI for the Mi 9 likely won’t please everyone.",
    "Since release competitors to the Xiaomi Mi 9 have come out, most notably the Huawei P30, a three-camera photography powerhouse with a sleek design and impressive chipset, and it sits at a price-point only slightly higher than the Mi 9.",
    "But generally the Mi 9 is an impressive mid-range device, with internals that are surprisingly good for its relatively low price – so are this phone, and the Xiaomi brand in general, a serious threat to established mid-range Android players like Huawei and OnePlus?.",
    "The Xiaomi Mi 9 is available now in China, Spain and Italy, and from April 30 in the UK.",
    "However Xiaomi has told TechRadar that, for the time being, there are no plans to release the Xiaomi Mi 9 in the US, so if you're based there you might want to check out the 'Competition' section of this review for suggestions of other similar handsets instead of the Mi 9.",
    "The Xiaomi Mi 9 price varies quite a bit between regions – the 64GB memory version of the handset costs €449 / £499 (roughly ₹35,000, AED$1,849), and the larger 128GB storage phone costs more at €499 / £549 (about ₹38,800, AED2,000).",
    "While in the UK you're still paying a reasonable mid-range price for the Xiaomi Mi 9, it's around £100 more expensive for each model than if you directly converted the prices from Euros.",
    "The Xiaomi Mi 9 has a slightly curved glass back, giving it a distinct look and a comfortable feel. Xiaomi says this creates an appealing holographic effect; we didn’t notice this with the Piano Black handset we tested, but it’s possible the Ocean Blue or Lavender Violet colors create this effect a little better.",
    "The Mi 9 has a 6.39-inch AMOLED display, with a 2340 x 1080 Full HD+ resolution, which delivers vibrant colors with a great brightness range – it was a treat to watch movies on and complemented the fantastic camera array. This screen is broken by a small top bezel housing the front-facing camera, but other than that is unbroken, with no top bezel to speak of and minimal chin.",
    "The Xiaomi Mi 9 measures 157.5 x 74.67 x 7.61mm, so it’s a medium-sized device, but at 173g it does feel a touch on the heavy side – it’s no Moto G7 Power for sure, but we did start to notice its weight after long gaming sessions or photo shoots.",
    "On the bottom of the device you’ll find a USB-C port – though no 3.5mm headphone jack – while the volume rocker and power button are on the right side, and there’s a Google assistant button to the left.",
    "These buttons are pretty pronounced – we often accidentally pressed the Google assistant button when we put the phone down on its side or picked it up, which became annoying after a while.",
    "On the rear of the phone the tri-lens camera array, which we’ll look at in detail later, also juts out a fair way – we often found ourselves scraping our finger on it when moving the device in our hand",
    "Generally, however, it’s a nice device to hold – the side buttons and in-screen fingerprint sensor are low enough to be easy to reach, the curved glass back feels comfortable in the hand for long periods, and the Google assistant button is out the way most of the time – although the large display does mean the top of the device can be hard to reach.",
    "Included in the box is a plastic case which fits the handset snugly, and conveniently hides how hot the phone can get – more on that later. While this feels useful for protecting the device it does add some extra bulk, so it may not be for everyone."
  ],
  "headers": {
    "8": "Xiaomi Mi 9 price and availability",
    "12": "Design and display"
  },
  "links": {
    "Xiaomi Mi 9 SE": "https://www.techradar.com/news/the-compact-xiaomi-mi-9-se-could-fill-your-huawei-shaped-hole",
    "Xiaomi Mi 9T": "https://www.techradar.com/news/xiaomi-teases-mi-9t-smartphone-with-pop-up-camera",
    "Xiaomi Mi 8 Pro": "https://www.techradar.com/reviews/xiaomi-mi-8-pro",
    "Huawei P30": "https://www.techradar.com/reviews/huawei-p30-review",
    "Competition": "https://www.techradar.com/reviews/xiaomi-mi-9/4",
    "Moto G7 Power": "https://www.techradar.com/reviews/moto-g7-power-review"
  }
}