{
  "source": "https://www.techradar.com/reviews/boom3d",
  "title": "Boom3D review",
  "category": "audio-visual",
  "updated": "2019-06-10T09:24:08Z",
  "author": "sofia-wycislik-wilson",
  "summary": "An audio enhancement app that really lives up to its bold claims",
  "verdict": "It's easy to view audio output optimisation tools with scepticism, but after a few minutes with Boom 3D, doubts quickly drop away. This takes your music and movies enjoyment to a whole new level.",
  "pros": [
    "Massive sound improvement",
    "System-wide sound driver",
    "Almost endlessly configurable",
    "Boosts audio quality, experience and volume"
  ],
  "cons": [
    "Built-in player is limited"
  ],
  "article": [
    "While it's certainly fair to say that the quality of your audio experience is going to be limited by the quality of the speakers or headphones you're using, Boom3D goes and long, long, long way to help you get the absolute best output from what you have.",
    "As the name hints at, one of the key features of the software is a 3D surround sound effect, and it is surprisingly and pleasingly immersive. We were ready to be let down by bold claims, but Boom3D lived up to its promises.",
    "You'll get the best experience if you use the software in conjunction with headphones or earphones, but Boom3D also helps to boost the quality – and volume – of sound through built-in laptop speakers, or externals. With the ability to not only create an immersive experience, but also boost, volume, improve clarity and adjust every aspect of sound, you are placed fully in control.",
    "No matter what type of music you like, Boom3D can help out: EDM is crisp and sharp, rock is punchy, classic is clear and bright, and everything in between. The same with movies – dialogue is rendered clear and audible, explosions really do boom in 3D. In both cases you're likely to hear things you've missed on previous listens.",
    "Boom3D is available for Mac for $39.99/£29.99, about AU$60 (currently on offer for $19.99/£14.99, about AU$30) and Windows for $39.99/£29.99, about AU$40 (currently on offer for $14.99/£11.49, about AU$20), and a single purchase entitles you to use the software on two devices.",
    "Getting around the Boom3D interface to configure your sound preference is fairly straightforward. There are lots of settings to tinker with – 3D Surround, Ambience, Fidelity, Night Mode, Spatial, and the massive 31-band graphic equaliser – so you could spend a long time tweaking things to your likely.",
    "There are various ready-configured presets to choose from, and you can save new ones of your own to suite different types of music or movie. There's keyboard support which provides a quick and easy way to changes settings without having to visit the main Boom3D interface all the time.",
    "The built-in music player leaves a little to be desired as it's hardly bursting with features, but as Boom3D provides system-wide audio enhancement, you can stick with your current favourite player and just benefit from the sound improvements."
  ],
  "headers": {
    "5": "User experience",
    "8": "You might also like"
  },
  "links": {
    "Boom3D": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1279093122571969300&xs=1&url=https%3A%2F%2Fwww.globaldelight.com%2Fboom-for-windows%2Findex.php&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fboom3d"
  }
}