{
  "source": "https://www.techradar.com/reviews/denon-ah-d9200-over-ear-headphones-review",
  "title": "Denon AH-D9200 over-ear headphones review",
  "category": "audio-visual",
  "updated": "2019-08-16T14:11:02Z",
  "author": "olivia-tambini",
  "summary": "Stunning sound at a price",
  "verdict": "If you’re looking for luxury over-ear headphones with audiophile sound quality, these Denon over-ear headphones are a great choice. They look and sound fantastic – but like most luxury headphones, they cost a pretty penny, too.",
  "pros": [
    "Unique looks",
    "Warm, open soundstage",
    "Luxurious finish"
  ],
  "cons": [
    "No carrying case included",
    "Very expensive"
  ],
  "article": [
    "Denon is well-known for crafting luxurious over-ear headphones, and its latest pair, the AH-D9200s, are no exception.",
    "These headphones are handmade from Japanese bamboo and feature 50mm nanofibre drivers – and those high-quality materials are reflected in the price.",
    "So, are the Denon AH-D9200s worth the money? We put them to the test.",
    "If you were hoping to buy the AH-D9200s for less than $1,000, you'll be disappointed – they’re available to buy from the Denon store or approved retailers for $1,699 / £1,399.",
    "It doesn't look like they are available to buy yet in Australia, despite being launched in November 2018. However, based on current conversion rates, you could be looking at paying around AU$2,300 – luxury handmade headphones come at a price after all.",
    "Our current favorite over-ears, the Sony WH-1000XM3 Wireless Headphones cost $349 / £300 / AU$499, though it's not quite a fair comparison. These Denon cans are aimed at a premium market with altogether different expectations for sound, build, and feel – and others can cost even more, like the $3,000 / £2,799 (around AU$4,200) price tag of the Focal Stellias.",
    "If you’re after a touch of luxury in your next pair of over-ear headphones, the design of the Denon AH-D9200s will likely appeal.",
    "The most striking aspect of these headphones are the bamboo housings; each pair is unique thanks to the patterning of the wood, which adds an organic touch to these high-tech headphones while also acting as natural dampeners to produce a warmer sound.",
    "The use of bamboo makes these headphones feel expensive, adding a lovely tactile quality to putting them on.",
    "If you try to avoid using animal products, you probably won’t appreciate the use of real leather on the earcups; draped over soft memory foam, they certainly feel comfortable, but aren’t vegan-friendly.",
    "Leather is also used to cushion the headband, which is made from lightweight aluminum, so you can wear these headphones for long periods of time without feeling uncomfortable.",
    "The AH-D9200s come with two high-quality audio cables, one with a 6.3mm jack to plug into your Hi-Fi system, and one with a 3.5mm jack that can be used with your portable music player or smartphone (if it has a headphone jack of course – otherwise you’ll need to use a dongle).",
    "It’s a shame that, at nearly $1700, these premium headphones don’t come with a carrying case; after all, if you’re spending that much money, you’ll want to take good care of your new over-ears.",
    "In short, the Denon AH-D9200 over-ear headphones are wonderful to listen with, with an expansive soundstage and warm, natural presentation.",
    "That’s partly thanks to the use of 50mm nanofibre drivers, which are designed to cancel out unwanted resonance to produce a detailed sound, as well as the use of bamboo housings, which act as a natural dampener and add a touch of warmth to the sound of your music.",
    "Listening to The Yeah Yeah Yeahs’ Date With The Night, we were impressed by the wide open soundstage; vocals were bold and clear, without any detail being lost amongst the cacophony of fuzzy bass, distorted guitar licks, and crashing percussion.",
    "The AH-D9200s similarly handle distorted guitar and punchy vocals very well in The Runaways’ Cherry Bomb.",
    "In Feist’s My Moon My Man, staccato piano feels rich and full, while soft vocals resonate with clarity and detail. As fluttering woodwind flourishes sweep in and out of the mix, the other instruments crash and fall about the soundstage without losing clarity.",
    "They handle classical music beautifully too; when listening to Mozart’s Symphony No.41 in C Major, these headphones have fantastic rhythmic dexterity, and are able to handle rapid violin ostinatos and navigate dramatic dynamic shifts with aplomb.",
    "While the AH-D9200s are very impressive, they don’t quite match the Focal Stellia headphones’ exquisite precision – but they do come close, and at around half the price.",
    "If you’re in the market for a pair of luxury over-ear headphones, the Denon AH-D9200s are a great choice; they look and feel opulent, and a great deal of care has obviously gone into the design of these cans.",
    "It’s a shame that there’s no carrying case included; after all, these headphones aren’t cheap by any means. Still, they aren’t as expensive as the Focal Stellias, which they nearly live up to in terms of audio quality.",
    "Your music will undoubtedly sound breathtaking through these headphones, with a warm, expansive soundstage and levels of detail that can only be found in the very best headphones."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "13": "Features and performance",
    "20": "Final verdict"
  },
  "links": {
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Sony WH-1000XM3 Wireless Headphones": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Focal Stellias": "https://www.techradar.com/reviews/focal-stellia-review"
  }
}