{
  "source": "https://www.techradar.com/reviews/michael-kors-access-sofie-20",
  "title": "Hands on: Michael Kors Access Sofie 2.0 review",
  "category": "wearables",
  "updated": "2019-01-08T16:00:39Z",
  "author": "james-peckham",
  "summary": "Lots of tech in a flashy design",
  "verdict": "The Michael Kors Access Sofie 2.0 isn't much of a design change from the last-gen watch, but it now comes with lots more tech inside that may make it more tempting.",
  "pros": [
    "Bold design",
    "GPS and contactless payments"
  ],
  "cons": [
    "Older chipset",
    "Look isn't for everyone"
  ],
  "article": [
    "The Michael Kors range of smartwatches has proved popular in recent years, and the company just announced a new iteration of its most flashy variant, the Michael Kors Access Sofie.",
    "Called the Michael Kors Access Sofie 2.0, this new smartwatch is a bold look that makes an impact when you first see it, but it's also stuffed to the gills with new tech that makes it a powerful wearable as well.",
    "Below you'll find our first impressions of the latest Michael Kors watch as well as everything we know about it so far.",
    "The release date of the Access Sofie 2.0 is currently just \"summer 2019\", so we don't know exactly when we'll see the watch land. We hope to learn more about the release at Baselworld 2019 in March.",
    "The company also hasn't announced any details on the price, so we'll have to wait a while to find out how much this is set to cost. However, you can expect this to be at the higher end of the smartwatch pricing bracket.",
    "Michael Kors has made a unique looking smartwatch here which it markets at women, but it would be suitable for anyone with smaller wrists who wants a smartwatch that packs a punch at first glance.",
    "There are four designs for the new watch, with it launching in silver, gold, rose gold and a silver variant with accented gold elements. Whatever color you choose, the straps we've seen are all metal. Some of the marketing materials also mention silicone straps that may be more appropriate for working out though.",
    "It's got a 41mm case made of stainless steel. The round watch face also comes with a crystal effect around the outside bezel, plus there are three hardware buttons on the right edge of the watch.",
    "We don't have exact details about the display on the Access Sofie 2.0, but in our time testing it the size seemed good enough to navigate around the Wear OS software and it looked bright and impactful when it was on.",
    "The tech is where the Sofie 2.0 gets exciting as the design is largely similar to the last generation of Michael Kors watch.",
    "This version has Google Pay compatibility, which means you can use contactless payments wherever you go directly from your wrist, and there's also GPS built-in for fitness.",
    "There's a heart rate tracker on the rear of the watch, and it's swimproof, so you can monitor your performance in a variety of exercises. We're uncertain if this is a watch you'll want to wear in your local swimming pool or if it's comfortable when out running, but that's something we'll be able to confirm in our full review.",
    "The latest version of Wear OS is ready and waiting on the Access Sofie 2.0, which means you have ready and easy access to Google Assistant features.",
    "Michael Kors also estimates the watch will last between one and two days from a single charge of its 300mAh battery, so you'll have to remember to charge this watch up at least once every couple of days. Again, that's something we'll test out properly in our full review.",
    "When it comes to power, you're getting a Snapdragon Wear 2100 chipset. That is worth noting as that's a bit dated now, with some smartwatches using the newer Snapdragon Wear 3100.",
    "It's all about the technology in the Michael Kors Sofie 2.0, and there are a lot of new features included that we thought were missing from the original watch, such as GPS, a heart rate monitor and NFC.",
    "If you're after a device that can track your location, measure your heart rate and do contactless payments while also looking flashy, the Michael Kors Access Sofie 2.0 may be up your street."
  ],
  "headers": {
    "3": "Michael Kors Access Sofie 2.0 release date and price",
    "5": "Design and display",
    "9": "Specs and features",
    "15": "Early verdict"
  },
  "links": {
    "Michael Kors Access Sofie": "https://www.techradar.com/reviews/michael-kors-access-sofie",
    "Snapdragon Wear 3100": "https://www.techradar.com/news/snapdragon-3100-promises-to-transform-smartwatches-as-we-know-them"
  }
}