{
  "source": "https://www.techradar.com/reviews/audio-technica-ath-cks5tw-true-wireless-earbuds",
  "title": "Audio-Technica ATH-CKS5TW true wireless earbuds review",
  "category": "audio-visual",
  "updated": "2019-10-18T11:59:15Z",
  "author": "gerald-lynch",
  "summary": "Big on bass, big on battery life",
  "verdict": "The Audio-Technica ATH-CKS5TW ups the bass compared to the brand’s usual neutral sound, for a mix well suited to true-wireless earbuds. However, the fit may take some getting used to.",
  "pros": [
    "Sounds great",
    "Punchy bass",
    "Long battery life"
  ],
  "cons": [
    "Weighty",
    "Fit takes some getting used to",
    "Fiddly case"
  ],
  "article": [
    "If you’re after audio on-the-go, it’s hard to ignore the incredible rise in popularity of true wireless buds. Audio-Technica, one of the most dependable brands in personal audio, are jumping into the fray with a new set of completely wire-free buds, the ATH-CKS5TW.",
    "With a strong battery and a bass-oriented audio profile, the ATH-CKS5TW do the Audio-Technica heritage proud in terms of audio performance, though we’re still not convinced about their fit, nor the design of the battery case.",
    "The ATH-CKS5TW goes are on sale now, priced at £149 (about $180 / AU$270).",
    "That’s a mid-to-premium price tag, and it’s in line with the feature set here, with strong battery performance, good drivers and USB-C connectivity.",
    "For comparison, the Apple AirPods (2019), cost $159 / £159 / AU$249, and remain the most popular true wireless earbuds (although not the most impressive). Read our round up of the best true wireless earbuds to see how the rest of the competition compare.",
    "The ATH-CKS5TW true wireless earbuds follow the design standards you’d expect from the wire-free category. Left and right earbuds sit in a pillbox-shaped charging case, snapping in magnetically. Charge the case (which has its own battery storage built in), and it’ll also charge the earbuds housed within. After they’ve been paired once with your audio device, they’ll connect over Bluetooth automatically when removed from the case, and switch back off when placed back inside.",
    "So what sets the ATH-CKS5TW apart? The two headline features here will be battery life and USB-C charging, the reversible fast-charging port remaining a relative rarity among true wireless earbuds. In terms of battery life, you get a lengthy 15 hours out of the fully-charged earbuds, with the case holding a further 30 hours for 45 hours total playback. That’s a very respectable amount of time.",
    "What the extra battery life does mean however, is that the earbuds and case themselves are slightly larger than some other models we’ve tried. That’s notable in the earbuds in particular, which use the “bud-only” style of design, rather than the stemmed-look that you’d see with AirPods.",
    "Matte-black with a wingtip designed to keep them in place in your ear, they can be a bit fiddly to lock in. The rubber wingtips are attached as standard, and removing them made for a more comfortable fit during our testing, but we still felt it difficult overall to get them to sit snugly in our ears. Being a bit weighty makes them always feel a little precarious in use if you're on the move.",
    "What’s certainly appreciated though is the physical button on each earbud. It gives you far more reliable control over playback than a touch sensitive panel, and works well here.",
    "In addition, IPX2 waterproofing makes them well suited to a light workout (but not a swim or shower), while Bluetooth 5.0 should ensure a stable connection to your devices.",
    "One unexpected issue we came into over the longer-term test however was just how fiddly the charging case was to use. It's size is justified given how much playback battery juice it holds, but the size of the buds and the cutaway enclosure for them in the case wasn't an intuitive fit. You wouldn't want to be popping the buds back into the case in a hurry.",
    "Once snugly fitted, the ATH-CKS5TW earbuds sound great though. They’re a bit of a departure from Audio-Technica’s usual neutral sound, with bass tones more prominent in the mix than you’d usually expect from the brand.",
    "We’re usually all for a neutral sound, but the added bass is welcome here – historically we’ve found true wireless earbuds to be a bit lacking in the low-end department, and Audio-Technica’s handling of the bass enhancement here is done tastefully, giving the earbuds a little extra oomph without overpowering the rest of the mix. There's a good \"thump\" to any bassy parts of a tune, giving a much warmer, dynamic sound than what we sometimes hear from true-wireless models.",
    "There’s good dynamism and detail to be pulled from the 10mm drivers, with a dual-layer diaphragm employed in tandem with (and we warmly quote here) “a redesigned exit hole” to better send tunes into your ears.",
    "Scott Walkers' 'It's Raining Today' from the album Scott 3 is a challenging piece, pairing an orchestrated chamber-pop tune with an eerie and sustained high-pitched violin line. But the soundstage is well delivered, with space for all instruments in the mix to do their job.",
    "Hitting something with a little more crunch, and The Clash's 'Police and Thieves' was presented with a lovely snap to the guitar stabs and snare work, while letting the bobbling bass line walk wonderfully around. There's a good sense of the range the earbuds are capable of.",
    "Moving onto something with an electronic, processed production, Robyn's 'Missing U' gave a really wonderful test for the ear buds, which handled the shimmering synth arpeggios and driving bass kick a real presence.",
    "We were also impressed with the passive noise isolation here. Once comfortably fit, the good low-end response and strong max volume meant they're a good fit for podcasts too – the added bass brings a warmth to voices, with the volume capably rising above the din of public transport.",
    "If the price tag of the ATH-CKS5TW is a bit too steep for your wallet, give the ATH-CK3TW a try instead.",
    "They’re a more budget-friendly take on true wireless buds from Audio-Technica. Here’s the low-down: smaller drivers, and smaller battery, for a cheaper £99 (around $120 / AU$175) price tag. The CK3TW instead offers 6 hours charge from the buds with 30 hours stored in the charging case, making use of 5.6mm drivers.",
    "It’s also using touch-sensitive controls rather than physical buttons for playback, and makes use of Qualcomm’s low-latency TrueWireless Stereo Plus, which should ensure a stable connection and prevent lip-sync issues from arising when watching mobile video. It’s also compatible with aptX and SBC codecs, with black, white, blue and red color options available.",
    "With a promising battery life and well-managed bass enhancement over Audio-Technica’s usual neutral sound, the Audio-Technica ATH-CKS5TW true wireless earbuds have a lot going for them.",
    "They've one of the most complete and well-rounded sound profiles we've seen from true-wireless earbuds, and that's despite the claimed bass enhancement. It's a very enjoyable sound that they make.",
    "However, they are let down a bit by their fit – mileage will vary of course depending on your preferred bud style and the size of your ears, but all will find the fiddly case fit will annoy over time. Still, the quality audio here may be a worthy trade-off."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "12": "Sound",
    "19": "On a tighter budget? Try the ATH-CK3TW",
    "22": "Final verdict"
  },
  "links": {
    "true wireless buds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods (2019)": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}