{
  "source": "https://www.techradar.com/reviews/profesionalhosting",
  "title": "ProfesionalHosting review",
  "category": "computing",
  "updated": "2019-08-14T08:00:57Z",
  "author": "mike-williams",
  "summary": "An experienced Spanish web host, also available in English (mostly)",
  "verdict": "Quality web hosting with a wide range of professional products, but translation issues are a constant annoyance for international users.",
  "pros": [
    "Huge range of products",
    "Speedy support",
    "15-day money-back guarantee",
    "17+ years of hosting experience"
  ],
  "cons": [
    "Poorly translated from the original Spanish",
    "Auto-installer can't match Softaculous",
    "More expensive than some"
  ],
  "article": [
    "ProfesionalHosting is a popular Spanish provider with over 17 years of experience in web hosting and domain registration.",
    "To be clear, the company has absolutely nothing to do with Professional Hosting at 'professionalhosting.com.' And that matters, because the other provider is very, very different to this one. If you're typing its name somewhere, rather than following our links, be sure to type one 's' in 'profesional', rather than two.",
    "However you arrive at the site, you'll find a huge range of products. You can get regular shared hosting, custom plans for specific web apps (WordPress, Magento, PrestaShop, more), along with a variety of VPS offerings. On top of that there are assorted dedicated servers (Windows, Linux, Elastic Cloud), video and streaming servers, and supporting services such as remote backup, email marketing, SSL certificates and more.",
    "The company is largely focused on the Spanish-speaking market, claiming on the website that 'in our hosting you will have the best support and service in Spanish.'",
    "There is an English language version of the site, but it's a little more difficult to use than it should be, thanks to some inconsistent and incomplete translations.",
    "As we write, for example, the VPS link on the English language site takes us to a Spanish page. There's a language selector at the top, but choosing English just takes you to a 'Page not found' message – in Spanish! We could still find our way around with the aid of Chrome's Translate feature, but that shouldn't be necessary.",
    "Brush these hassles aside, though, and you'll find an impressive set of products, where even the most basic plans are well-specified and ready for use.",
    "Shared hosting starts at €3.92 ($4.38, £3.60) a month on the annual plan, for instance. Not a big outlay, but it gets you 3GB hard drive space, unlimited bandwidth, a free domain, a Plesk control panel (a powerful alternative to cPanel) antispam, daily backups, and free SSL via Let's Encrypt.",
    "There are four plans in total, but picking just one, Plan WEB + enables hosting up to 10 websites, offers 10GB disk space, and throws in a free year of a professional SSL certificate, all for €8.80 a month ($9.84, £8.08).",
    "You can get hosting for even less, but it often comes with hidden flaws and catches. ProfesionalHosting isn't cutting corners to get a low headline rate, and even its low-end plans should be able to handle some major tasks.",
    "And even if it turns out that the company doesn't live up to its promises, you're protected by a 15-day money-back guarantee.",
    "Signing up at ProfesionalHosting works much like any other host, at least in principle. But in real life, translation issues make it a little more complicated for English speakers.",
    "You must opt to check out by clicking the 'Contract' button, for instance. The shopping cart icon makes that a relatively easy guess, but when you start the purchase process, even the English language page has a Spanish description of the money-back guarantee.",
    "There's more confusion on the account registration page. Not only does this ask for your name, email address, physical address and phone number, it also demands your 'CIF/DNI' (a national ID number), and further asks '¿Como nos ha conocido?' (which means 'how did you hear about us?').",
    "You can ignore that question, but not the demand for a national ID number. That's bad news if you don't have one, although the website can't validate it, so you can enter whatever you like, and no-one is likely to notice. (You're probably violating a 'be honest about your personal data' clause in the small print, but if you don't have the requested data, there aren't many other options.)",
    "We completed the purchase process, handed over our cash, and three follow-up emails arrived – in Spanish, obviously.",
    "This wasn't quite the hassle you might think. The final welcome email was easy to identify, and even if you don't speak a word of Spanish, it's easy to pick out the Control Panel URL and credentials, FTP login, nameservers, email servers and more.",
    "Logging in took us to the main Plesk control panel, a one-stop platform for configuring and managing your account, domain, website and more. The Plesk interface can use multiple languages, but for some reason, ProfesionalHosting's shared hosting plans are available in Spanish only. You must choose VPS or higher to be able to run your console in English. It's annoying, but once again, Chrome's Translate feature was just about good enough to save the day.",
    "Plesk's main website management screen includes tools to create and manage your website, email and FTP accounts, databases, subdomains and more, as well as key metrics on your visitors, which pages they're visiting, and a breakdown of your bandwidth use.",
    "An automated installer tool makes it easier to set up WordPress, Drupal, Joomla, PrestaShop, Magento, phpBB and more. Its choice of 21 apps doesn't get close to the 400+ you'll get with Softaculous, a platform commonly provided with cPanel, but if you're happy with WordPress (or one of the others) you're unlikely to mind.",
    "The installer is configured with Spanish speakers in mind, for example offering us no less than nine Spanish language options for our test WordPress setup (Spanish, Spanish from Chile, Spanish from Peru, and so on). But there are plenty of other options, this time, and ours had English selected by default.",
    "Our general shared hosting package didn't include a website designer. As with the missing Softaculous, that's bad news for some, but won't matter to the majority.",
    "There's no shortage of ways to manually set up a website, though. The File Manager uploaded our test site with a quick drag-and-drop, Let's Encrypt support allows even hosting newbies to quickly assign a free SSL certificate – and experts can play around with everything from FTP accounts and databases to PHP settings, DNS, and even Apache and web application firewall (ModSecurity) settings.",
    "It's a capable set of tools, especially for the most basic shared hosting package in the range. It would be even better if ProfesionalHosting allowed shared hosting packages to be set up in English, but Chrome Translate got us through most issues, and overall it's a likeable service.",
    "Websites can fail for all kinds of unexpected reasons, and whether you're a total newbie or an old hand, it's vital to choose a web host with top quality support.",
    "ProfesionalHosting offers 24/7 support via telephone, live chat, email and ticket, and for really stubborn problems, can even connect to your system via TeamViewer for a closer look.",
    "This all sounds good to us, and the company handled our test query well. An agent responded within three minutes, didn't waste time with more questions or authentication (what's your username, your email address, your account number, your domain), and just gave us an accurate and helpful answer, immediately.",
    "Language remains an issue for international users, with the opening chat screen displaying its instructions in Spanish. But we got through that in seconds, and there were no problems afterwards: we posted in English and got an English-language reply.",
    "To complete the review, we ran a couple of performance tests.",
    "Uptime.com monitored our site over time. Response times were a little below average, but that could be because ProfesionalHosting's Spanish servers were located further away from our testing locations. The difference was small, anyway, and there was no downtime during our review.",
    "Dotcom-tools website speed test benchmarked the download speed of our test site from 16 servers located around Europe and the US. This is more relevant as a speed test, and here ProfesionalHosting performed a little better, with downloads running around 10% faster than average.",
    "Not the cheapest service around (and using Plesk rather than cPanel won't appeal to everyone), but ProfesionalHosting's products are top-quality and fairly priced for the excellent features you get. But if you don't speak Spanish, the constant translation issues can be a major irritation."
  ],
  "headers": {
    "11": "Setup",
    "18": "Creating a website",
    "24": "Performance",
    "31": "Final verdict"
  },
  "links": {
    "ProfesionalHosting": "https://www.profesionalhosting.com/en/hosting/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "other provider is very, very different to this one": "https://www.techradar.com/reviews/professional-hosting",
    "Shared hosting": "https://www.profesionalhosting.com/en/hosting/",
    "Plan WEB +": "https://www.profesionalhosting.com/en/hosting/",
    "speed test": "https://www.dotcom-tools.com/website-speed-test.aspx"
  }
}