{
  "source": "https://www.techradar.com/reviews/chuwi-gbox-pro-thin-client-pc",
  "title": "CHUWI GBox Pro thin client PC review",
  "category": "computing",
  "updated": "2019-09-03T22:25:50Z",
  "author": "desire-athow",
  "summary": "An anomaly given the existence of the GBox Mini",
  "verdict": "The Chuwi GBox Pro is a disappointment. It is not a bad product per se but it is poorly priced and suffers from an extremely competitive market made worse by the ongoing chip shortage.",
  "pros": [
    "Good design",
    "Can add another HDD",
    "Legacy VGA port is useful",
    "No fans"
  ],
  "cons": [
    "Expensive for what it offers",
    "Poor CPU performance"
  ],
  "article": [
    "This is the GBox Pro, the follow up to the GBox which we reviewed last year; a business-focused Mini PC that was plagued with various issues. Chuwi went back to the drawing board and unveiled a new product that, it hopes, will solve the problems that cause the GBox to be a less-than-stellar performer.",
    "The market has since moved on but not in the direction we expected. The chip shortage that afflicted the PC industry has carried on for more than a year and has caused smaller vendors like Chuwi to scrape the bottom of the barrel to get chips, let alone competitive ones.",
    "Chuwi reused the GBox chassis which has its advantages: It reduces the bill of materials (with economies of scale) and you save on design costs. But it also means that is difficult to differentiate between products. That’s why no smartphone manufacturers will ever recycle an old design, however big the savings could be.",
    "So as a recap you get a rectangular box (18.9 x 13.8 x 3.73 cm) with a Type-C USB and two USB 3.0 ports in front, next to a micro SD card slot, a status light and a prominent red power key.",
    "It can be mounted behind a monitor thanks to a VESA bracket and other than the 24W (12V, 2A) power supply unit, there’s not much else to write about.",
    "The burning question on everyone’s mind is probably why did Chuwi choose an old processor to power the GBox Pro? Blame it on the ongoing Intel CPU shortage that - more than anything else - is causing a resurgence of older obsolete - but still new - products.",
    "The Intel Atom X7-E3950 that powers it is a 4-core processor that comes with an HD Graphics 505 video subsystem. It has only 2MB of cache and can run at up to 2GHz; note that this is an embedded part - not something that usually goes in non-specialist products - with a TDP of 12W.",
    "It is eerily silent thanks to the massive heatsink it uses (no fans here). Part of the chassis is made up of an aluminum alloy which also helps to dissipate heat. Chuwi says that even after four hours under load, the surface of the PC will not rise above 34 degrees centigrade (although that will depend on the ambient room temperature).",
    "There’s 4GB of LPDDR3 RAM (good) and 64GB soldered eMMC (bad). Elsewhere, there’s 802.11ac Wi-Fi, Bluetooth 4.0 (courtesy of the ubiquitous Intel 3165) the ability to plug in an extra 2.5-inch drive (SATA only, SSD or HDD). At the rear is a headphone socket, an HDMI port, a legacy VGA one, two USB 2.0 ports, a Gigabit Ethernet LAN and a proprietary port.",
    "Windows 10 did not behave properly on the GBox Pro with updates failing to install. That happened on the original GBox and we can definitely see a trend here although there’s no BSOD. The processor - which we saw in the LapBook Plus - performed in line with our expectations, that is, somewhere between the atrociously slow Atom X5-Z8350 and the just-good enough Celeron N4100.",
    "The overall performance was not helped by the 64GB eMMC Sandisk DF4064 onboard storage which suffers from sub-par read and write speeds. The GBox Pro otherwise behaves like its predecessor: silent in operation and warm to the touch. There’s no bloatware in sight, which is a positive point.",
    "To find a rival to the GBox Pro, you don’t need to look too far.",
    "Chuwi’s own GBox is still on sale and is on paper, better than the GBox Pro, for a bit higher price thanks to a faster processor, the Celeron N4100. It is the single best reason why the GBox Pro shouldn’t be on your shopping list. Chuwi has confirmed though that it has reached its end-of-life and will be on sale while supply lasts.",
    "If you only want a tiny thin client computer that can run Windows 10 and don’t need storage expandability, then the $100 Z83 II with its (slower) Atom CPU, 4GB RAM and 64GB storage should fit the bill.",
    "Want something even more powerful? Then check out the Martrea Acute Angle AA with its unique design, a slightly faster CPU and most importantly, 192GB of storage (3X more) and 8GB of RAM (2x more). Surprisingly, it retails for only $160 and should very easily top the GBox Pro.",
    "Let’s be blunt; there are better thin clients and mini computers out there. The original GBox would be the one to go for as it not only ticks all the boxes but also comes with a better processor. Grab it while you can though as stocks will not last forever.",
    "As for the GBox Pro, it didn’t sadly turn up, quite well, into what we were expecting. The CPU is at fault but it’s not strictly speaking Chuwi’s mistake as they’d probably want to opt for a faster processor.",
    "The next iteration of the box should pack a faster processor and swap the onboard eMMC storage for a proper solid state drive. By then, we hope, Intel will have solved the chronic chip shortage."
  ],
  "headers": {
    "2": "Design",
    "5": "Hardware",
    "9": "In use and performance",
    "11": "Competition",
    "15": "Final verdict"
  },
  "links": {
    "GBox Pro": "https://www.chuwi.com/product/buy/Chuwi-GBox-Pro.html",
    "GBox": "https://www.techradar.com/reviews/chuwi-gbox",
    "LapBook Plus": "https://www.techradar.com/reviews/chuwi-lapbook-plus-laptop",
    "Z83 II": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-8110707303368904000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009640919569.html%3Fwid%3D1433363",
    "Martrea Acute Angle AA": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-8508482935832021000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009760498063.html%3Fwid%3D1433363"
  }
}