{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-tab-a-105-2018-review",
  "title": "Samsung Galaxy Tab A 10.5 (2018) review",
  "category": "tablets",
  "updated": "2019-08-15T09:48:03Z",
  "author": "tom-bedford",
  "summary": "Samsung’s newest budget tablet",
  "verdict": "While the Samsung Galaxy Tab 10.5 (2018) offers an Android alternative to an iPad, it’s a much weaker tablet you’re getting – it’s slower to use, less ergonomic, and can’t run operations very well.",
  "pros": [
    "Low price point",
    "Headphone jack",
    "Long battery life"
  ],
  "cons": [
    "Slow to use",
    "Bulky design",
    "Android still isn’t great on tablets"
  ],
  "article": [
    "While Samsung is one of the smartphone market leaders thanks to its innovative and high-tech handsets, it’s one of the most popular tablet manufacturers simply because there isn’t much competition; Samsung competes with Apple simply by offering cheaper but less polished slates, and the Samsung Galaxy Tab A series is emblematic of these devices.",
    "The Samsung Galaxy Tab A series are what you consider when you want a cheap tablet and won’t consider Apple’s pricier budget iPads, like the iPad Mini (2019), but don’t want to stoop so low as to consider Amazon’s cheap but cheerful slates, like the Amazon Fire HD 10.",
    "The most recent tablet in the range, the Galaxy Tab A 10.5 (2018), is one of Samsung’s biggest and priciest Tab A slates – not that ‘priciest’ is saying much – so does that mean you’re getting a higher-end tablet at a still-affordable price, or does it defeat the whole object of Samsung’s strategy?",
    "You can pick up the Samsung Galaxy Tab A 10.5 (2018) in most countries right now – except Australia. Sorry, Australians, but we’ll keep you updated if that changes. Other Galaxy A tabs are available there, including the 8-inch and 10.1-inch variants.",
    "There are two versions of the Galaxy Tab A 10.5: one that only connects via Wi-Fi, which will cost you $329 / £249 (about AU$470), and another that adds LTE connectivity, which will set you back $419 / £299 (about AU$600).",
    "For comparison, you can pick up the iPad 9.7 (2018) for $329 / £319 / AU$469 for a Wi-Fi model and $459 / £449 / AU$669 for LTE, so in terms of budget that’s one of the Galaxy Tab A 10.5’s closest competitors, as it’s the most affordable iPad.",
    "You can also pick up the Amazon Fire HD 10 for $150 / £150 (around AU$195), which has a similar screen size, but is a very different prospect in other ways – check out the ‘Competition’ section of this review to find out how.",
    "There’s a reason that tablets are also called ‘slates’, and the Samsung Galaxy Tab A 10.5 (2018) embodies it more so than most similar devices, with Apple and Amazon finding ways to make their devices look distinct.",
    "We’ll get into the display in more detail in the Display section, but it takes up just over 75% of the front of the tablet; the rest is chunky bezels on all sides of the screen, which house the front-facing camera at the top (when the tablet is held in portrait orientation).",
    "On the back of the tablet is its rear camera, including a flash. This back is made of plastic, giving the tablet a slightly ‘cheap’ feel, but you’ll likely be using the tablet in a protective case or stand that will lend the device some needed protection.",
    "One annoyance design-wise is this rear camera – it’s housed in a slight bump, so if you lay the Galaxy Tab A 10.5 on a surface it won’t lie perfectly flat, and if you type the tablet will rock from side to side.",
    "Around the sides of the tablet you’ll find the usual array of ports and buttons – a volume rocker and power button, USB-C port, and 3.5mm headphone jack.",
    "The Galaxy Tab A 10.5’s dimensions of 260 x 161.1 x 8mm make it feel a little on the large side, and the 529g weight also feels a little much, but we found it fairly easy to get used to the big slate.",
    "This screen measures 10.5 inches diagonally (hence the ‘10.5’ in the tablet’s name), with LCD tech and a 1200 x 1920 resolution. That’s not a particularly high resolution, so images on the display don’t look very sharp. Colors also look a little pale and washed out, especially blacks – in short, it pales – literally– in comparison to most other tablet screens.",
    "There is one upside to LCD displays, in that there’s a high level of brightness, so if you tend to use your tablet outside a lot then the Galaxy Tab A 10.5 might be a reasonable proposition – but generally the screen seems unimpressive, as you’d expect from a budget slate.",
    "That said, if you’re looking for a tablet to do work that requires very accurate colors, you’re probably not looking this far down the tablet price range, and it’s easy to forget the pale colors if you’re engrossed in a good movie or online game.",
    "However, games and many apps often look a lot better with a nice vibrant color palette, and the Samsung Galaxy Tab A 10.5 just doesn’t provide this."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "13": "Display"
  },
  "links": {
    "iPad Mini (2019)": "https://www.techradar.com/reviews/ipad-mini-2019",
    "Amazon Fire HD 10": "https://www.techradar.com/reviews/amazon-fire-hd-10-2017-review",
    "iPad 9.7 (2018)": "https://www.techradar.com/reviews/new-ipad-2018-review"
  }
}