{
  "source": "https://www.techradar.com/reviews/armani-exchange-connected",
  "title": "Armani Exchange Connected review",
  "category": "wearables",
  "updated": "2019-03-08T10:00:17Z",
  "author": "alistair-charlton",
  "summary": "Wear OS gets a smart new suit",
  "verdict": "The Armani Exchange Connected is a master of many trades, by looking as at home in the gym as it does in the boardroom. It packs a wide range of features - including GPS, NFC and a heart rate monitor - and encases them in a classically attractive package that will suit most wrists. Performance from the dated chipset can be an issue, but not necessarily a deal-breaker.",
  "pros": [
    "Looks great and fits well",
    "Premium feel for the price",
    "Heart rate monitor, NFC and GPS"
  ],
  "cons": [
    "Occasionally sluggish performance",
    "Battery life closer to one day than two",
    "May be too large for some"
  ],
  "article": [
    "First up, you shouldn’t confuse this Armani Exchange Connected with the Emporio Armani Connected (2018).",
    "They are both fashionable smartwatches with the famous Armani name and Wear OS operating system - and they also share many of the same features - but the design of their hardware and watch faces is quite different.",
    "With that cleared up, let’s get started on the Armani Exchange Connected. The watch has a 48mm stainless steel case, making it larger than the average men’s watch size of around 42mm.",
    "Part of the Fossil Group, Armani Exchange offers the Connected in gold, silver, black and blue, all with a metal case and matching and adjustable link strap with standard 22mm lugs.",
    "The Connected has all the features you would expect from a smartwatch sold in 2019. These include GPS for tracking outdoor runs without needing your smartphone with you, water resistance to 50 meters so you can wear it while swimming, a heart rate monitor for using it with Google Fit, and NFC for making contactless payments through Google Pay.",
    "Running Wear OS means the watch’s interface will be very familiar to anyone who has used a Google smartwatch before. But - as most brands do - Armani Exchange has added a few of its own touches to the system, including a broad range of customizable watch faces.",
    "Coming in at £279 / $295 (roughly AU$420), the Armani Exchange Connected is priced comfortably below the £399 / $399 / AU$599 Apple Watch 4, and curiously it is also cheaper than the Emporio Armani Connected (2018), which is basically the same device in a slightly different case.",
    "For a smartwatch with a good range of features, an attractive and well-made design - and from a brand like Armani Exchange - the price of the Connected feels about right.",
    "Potential buyers of this watch will likely have spent (or at least considered spending) a similar amount on non-smart watches from Armani Exchange, so the price here seems logical.",
    "That said, more tech-savvy buyers might be put off by the watch’s aging Snapdragon Wear 2100 chipset - more of which later - and its middling battery life.",
    "We think the Armani Exchange Connected is a great-looking smartwatch. Its 48mm case may sound off-putting to some buyers, but once you have removed a few links from the metal strap, the watch fits well and doesn’t feel overly chunky, even on slimmer wrists.",
    "It also doesn’t look too out of place. Just a few years ago, wearing a smartwatch of this size drew far too much attention to itself, and not always in a positive manner. But now, perhaps helped by a growing trend for larger watches generally, we quickly got used to the Exchange and looked forward to putting it on each morning.",
    "Of course, the Armani Exchange’s classic watch design helps here. Instead of taking the Apple approach of launching a smartwatch which looks like a cross between a timepiece and a gadget, the Connected looks exactly like a normal watch - albeit one with a touchscreen.",
    "If you opt for one of the more traditional watch faces, then enable the always-on display (where the time is shown all day, instead of the screen going blank after a few seconds) the Connected looks like a regular watch at first glance.",
    "Technology lovers might not care about this, but the point of fashion watches like these is largely to introduce new customers to the idea of owning a smartwatch; they likely don’t want a gadget from Apple or Samsung on their wrist but are willing to try one made by a fashion brand they already trust, and perhaps already buy from.",
    "At 12mm, the stainless-steel case isn’t overly chunky, and features two buttons at two and four o’clock, plus a rotating and clickable crown at three o’clock.",
    "You can easily shake up the look of the Armani Exchange Connected, as it supports industry-standard 22mm strap lugs, meaning it takes just a few moments (with the right tool) to swap out the strap for any you like.",
    "The included strap features a regular deployment clasp which feels secure, complete with ‘A|X’ branding. The same motif also appears on the rotating crown button at three o’clock.",
    "There’s a heart rate monitor on the back, GPS for run-tracking, and NFC for Google Pay payments inside, and water resistance to 50 meters means you can take it swimming without cause for concern.",
    "The only negative thing we have to say about the hardware is how our review unit developed a squeak after a few days of use. Likely the sound of a metal pin disagreeing with one of the strap links, this should be solved with a quick spray of WD-40. That’s not something you usually read in a TechRadar review…",
    "As for the display, the Armani Exchange Connected uses a circular 1.2-inch AMOLED panel with a resolution of 380 x 390 and a pixel density of 328 pixels per inch. The screen is visible in most circumstances when its brightness level is left to automatic, but sometimes we struggled to read it in bright sunlight.",
    "Just like other Wear OS devices, the touchscreen is your main point of contact with the watch, while the three buttons act as shortcuts to Armani Exchange’s face customization tools, the watch’s application list, and Google Fit, which comes pre-installed.",
    "As with other Wear OS watches, a long press of the crown button at three o’clock launches the Google Assistant; rotating the button scrolls through the interface, saving you from swiping at the screen and smearing it with fingerprints.",
    "Overall, we think the Armani Exchange Connected is a great-looking smartwatch. It is traditionally attractive, available in a good range of colors, and feels like a quality timepiece - occasional squeaks notwithstanding."
  ],
  "headers": {
    "6": "Armani Exchange Connected price and release date",
    "10": "Design and display"
  },
  "links": {
    "Emporio Armani Connected (2018)": "https://www.techradar.com/reviews/emporio-armani-connected-2018-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review"
  }
}