{
  "source": "https://www.techradar.com/reviews/amd-radeon-rx-5500-xt",
  "title": "AMD Radeon RX 5500 XT review",
  "category": "computing",
  "updated": "2019-12-13T01:38:01Z",
  "author": "jackie-thomas",
  "summary": "AMD Navi hits the budget segment",
  "verdict": "The AMD Radeon RX 5500 XT is a card that was designed with 1080p in mind. As such, it's not the most powerful card out there, but at its price point it should definitely get the job done – though you may have to turn some settings down on especially demanding titles.",
  "pros": [
    "Affordable",
    "Low power consumption",
    "Solid 1080p performance for the price"
  ],
  "cons": [
    "Struggles in demanding 1080p games",
    "Not particularly exciting"
  ],
  "article": [
    "Back when AMD Navi first launched in July 2019, it kind of felt like a return to form for AMD's graphics. Not only was it able to compete with Nvidia at the same price point, but it legitimately won, even without Nvidia's fancy RTX technology.",
    "But down at this price point, the competition is really stiff. Over the last few months Nvidia has been working hard, stuffing the market with a ton of different graphics cards, making it incredibly difficult for any 1080p card to truly stand out.",
    "Essentially, that's what happens with the AMD Radeon RX 5500 XT - it performs just about as well at the GeForce GTX 1660 at a bit of a lower price. It's not exciting, but it does provide a little bit of extra value over Nvidia's option.",
    "There are two versions of the AMD Radeon RX 5500 XT available for purchase, a 4GB and an 8GB version, with a price of $169 and $199, respectively. To put it into context, these graphics cards compete directly with the Nvidia GeForce GTX 1650, which cost $169/£139/AU$265.",
    "However, the more interesting comparison to us is against the Nvidia GeForce GTX 1660. While Team Green has diluted that graphics card a bit since the release of the GTX 1660 Super, the Radeon RX 5500 XT provides equivalent performance for $10 (about £10, AU$14) less. That doesn't seem like a massive price cut at first glance, but in this segment, every dollar counts.",
    "The timing of the Radeon RX 5500 XT is interesting, too. Launching on December 12, 2019, it's almost completely separate of competing cards from Nvidia. Ever since AMD Navi first launched in mid-2019, it seemed like Nvidia had an answer to every card in AMD's lineup, this is the first time it kind of stands on its own, even if the GTX 1650 Super came out a couple of weeks prior.",
    "The AMD Radeon RX 5500 XT is, of course, based on the same rDNA architecture as the AMD Radeon RX 5700 and RX 5700 XT. However, because this is definitely targeting a more budget-oriented audience, you shouldn't expect the same level of hardware inside.",
    "Specifically, this graphics card features 1,408 Stream Processors over 22 compute units, and can hit up to 5.2 teraflops (TFLOPS) of raw compute performance. Now, that's quite the cut from the 2,304 Stream Processors featured in the Radeon RX 5700, so it shouldn't be too surprising that the 5500 XT isn't intended to play games at the same resolution as the higher-specced card.",
    "There are two configurations of this new graphics card, one with 4GB of RAM and one with 8GB. Now we're not exactly huge fans of graphics cards with the same name having different memory configurations, but it at least seems more reasonable than what Nvidia pulled with the Nvidia GeForce GTX 1060 back in the day.",
    "That card had a 3GB and a 6GB model, but the 6GB model had an additional 128 CUDA cores, so one GTX 1060 was way more powerful than the other. We were only provided with the AMD Radeon RX 5500 XT 8GB model but just looking at the raw specs, the only difference seems to be memory capacity – we just don't know how much of an impact it'll have on performance.",
    "There is something new when it comes to AMD's software, too. Team Red has freshened up its Radeon Software making it genuinely useful. We won't go too crazy in depth on this refreshed software, but through it you can overclock your graphics card, manage installed games and even livestream your gameplay. The best part is that it's all laid out in a very easy to read way, and even if you don't have the constitution to dig through abstract software, you'll be able to get the absolute most out of the Radeon software.",
    "Some of the software features genuinely do help with gameplay, too. AMD Radeon Image Sharpening is back, of course, but what's really cool is the new AMD Chill feature. This will intelligently let your graphics card rest when it can, so it can push harder when more throughput is necessary. This should help control temps and reduce fan noise.",
    "We tested the PowerColor Red Dragon version of the Radeon RX 5500 XT, and really, fan noise was non-existent outside of our benchmark tests. The graphics card all but shut down when we weren't pushing it, with power consumption dropping all the way down to 3W of power.",
    "Fans do stop spinning when it drops to this low-power state, but temperatures weren't really a problem. Idle temperatures were around 44 degrees Celsius, which seems high until you remember there is no active cooling when idle. The highest temperature we saw was 77 degrees Celsius. That's high, but definitely not enough to actually be a problem. If you go in and change the fan curve through software like MSI Afterburner, you should easily be able to get much better temperatures.",
    "The AMD Radeon RX 5500 XT is 100% a 1080p graphics card, and it probably won't be pushing any resolution higher than that, beyond some older PC games.",
    "We did see some playable framerates in Middle Earth: Shadow of War at 1440p, settling in at 42 fps, but when you can get 63 fps at 1080p, we'd definitely go with the latter.",
    "Metro Exodus, however, was another story. This is one of the most demanding PC games on the market today, and the numbers back that up. Even at 1080p, the AMD Radeon RX 5500 XT only managed to get an average of 37 fps at ultra settings. If you want to play this game with the RX 5500 XT, or similar ultra-high-end AAA PC games, you may need to turn settings down to high.",
    "The really interesting story here is how the 5500 XT compares to the Nvidia GeForce GTX 1660. Nvidia's entry-level 1080p card got nearly identical frame rates in Metro Exodus and was just 8% faster in Middle Earth: Shadow of War. This difference probably falls down to the faster and more capacious VRAM in the AMD Radeon RX 5500 XT, as Metro is hungry for memory.",
    "Things get weird when we take a look at synthetic benchmarks, though. In 3DMark Time Spy, the Nvidia GeForce GTX 1660 manages to score 6,006 points to the 5500 XT's 5230, handily beating it. But when we look at other 3DMark scores, AMD pulls ahead. In Fire Strike, AMD's card scores 12,631 to Nvidia's 12,436. It's a narrow gap, but it just proves that the Radeon RX 5500 XT and GeForce GTX 1660 trade blows. And, because the RX 5500 XT is $10 cheaper than the GTX 1660, it would probably get our recommendation in this price category.",
    "If you're on the market for a 1080p graphics card, the AMD Radeon RX 5500 XT might just be the way to go. It's powerful enough to run most games at 60fps, even if it will run into issues with the most demanding titles – think Red Dead Redemption 2 and Metro Exodus. However, because it goes blow for blow with the Nvidia GeForce GTX 1660 at a lower price, it's an easy graphics card to recommend.",
    "There are some workloads that the savings don't justify the loss in power, however, and only time will tell whether that gap will widen or narrow in the future. The faster and more capacious VRAM could make the Radeon RX 5500 XT better equipped to handle next-generation games, but we won't know that until more next-generation games actually come out."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Features and software",
    "14": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "MSI Afterburner": "https://www.msi.com/page/afterburner",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-pc-release-date-news-tips",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review"
  }
}