{
  "source": "https://www.techradar.com/reviews/ring-stick-up-cam",
  "title": "Ring Stick Up Cam review",
  "category": "appliances",
  "updated": "2020-04-15T11:49:16.607Z",
  "author": "abbas-jaffar-ali",
  "summary": "The camera for indoor or outdoor use, with or without wires.",
  "verdict": "Ring's latest Stick Up Cam is a highly versatile security camera that can be used indoors or outdoors, wired or battery operated. It's a good entry in the Ring ecosystem but lacks features compared to competing products.",
  "pros": [
    "Flexible mounting solutions",
    "Can be used indoors or outdoors",
    "Available as wired or battery operated"
  ],
  "cons": [
    "Mediocre design",
    "No geo-based rules",
    "No option for storing videos locally"
  ],
  "article": [
    "Ring has made a good name for itself when it comes to surveillance doorbells, and though the company has produced a few cameras in the past to compliment the doorbell, the Stick Up Cam is the first of it's new products that can hold its own against the likes of Nest and Argo.",
    "Available in both wired and battery-operated versions, the Stick Up Cam is a very versatile camera that can be installed in many different orientations to get you the best shot.",
    "Pricing began at $179.99 / £179 / AU$319 / AED 799 for both versions, the Stick Up Cam is easy to recommend to someone who is already on the Ring ecosystem and wants to add one or more cameras to their premises. However, that's already started to fall, with some retailers offering even lower price tags on this more advanced home monitoring system.",
    "The thing is, with Amazon Prime Day 2020 just around the corner, you could pick up the Ring Stick Up Cam for even cheaper if you wait a little bit - although it likely won't knock the subscription prices down too much, just the price of the device.",
    "The Stick Up Cam is much sleeker than Ring's older security cameras, though not as attractive as competitor's offerings - mostly due to the rather large battery that's popular with Ring's products.",
    "We're completely fine with that, as Ring's batteries are completely interchangeable across their devices - from doorbells to other cameras - which easily outweighs having a smaller/thinner design.",
    "The cylindrical Stick Up Cam comes with a stand connected to arms that can be rotated to install the camera on any flat surface. We installed the camera on the side of a staircase without any issues, and got the angle right by adjusting the tilt.",
    "If you're using the battery powered version, there's a quick-release switch that lets you swap batteries. For the wired version, Ring provides a fairly long USB cable to power the device. It's good to see Ring using USB and not a proprietary solution for powering the camera.",
    "Like the Ring Doorbell, there are all kinds of tools with the Stick Up Cam for installation such as a drill-bit, screw mounts and screws.",
    "Setting up the Ring Stick Up Cam is easy for both the wired and battery options. If you choose the battery option, all you need is a charged battery and access to your Wi-Fi. The battery charges via microUSB cable, so it does take a while to power up - this is something you'll need to bear in mind when recharging the device.",
    "With the wired option, you need to make sure that a power source is nearby - either in the form on an electrical socket or though Ethernet. The Stick Up Cam wired supports Power over Ethernet (PoE) so if you have powered Ethernet ports, you can have the camera powered and connected to your network with just one cable.",
    "Once you have the camera in place, the setup can be done using the Ring app on your phone. It's a process works by scanning the QR code on the back of the camera - we had a little trouble getting it to work first try, as our phone couldn't find the camera, but it connected eventually.",
    "Using the Ring app you can define motion zones and schedules, which automatically triggers recording whenever it detects motion based on your settings. A feature we really like is that you can enable motion-tracking when you're out of the house - as seen on Google's Nest cameras, by dictating certain rest periods when you're at home.",
    "By default, motion zones are split into three horizontal sections of the camera's field of view, and you can change how far the camera can detect motion in each of these sections. You can also create custom zones based on any shape you like, if that works better for your setup, but this is only available in the wired version, presumably due to the enhanced power needs.",
    "With motions zones set up, the app can alert you whenever motion is detected. This is fine if you're just living by yourself or with a partner, but we recommend you switch this off if you have pets or kids, just to prevent an overload of notifications.",
    "The quality of the recorded video is quite good and the fish-eye lens captures a good amount of the recording area. The wired version of the camera does capture a slightly wider area - we're guessing that this is to keep the battery operated version optimized to stay powered for a longer period.",
    "Speaking of battery life, Ring suggests that you should be able to get about three months out of a full charge. A lot of this really depends on the amount of motion and recording in your house. We managed to get just under a month on our first full charge.",
    "Besides the cost that you need to pay for the Stick Up Cam, you are also potentially looking at Ring's subscription service to store and view the recorded videos.",
    "An active subscription allows you to store the recorded video for 60 days on Ring's servers and view them using a web browser or the app to view recorded events. Subscription costs $3 per month for each camera ($30 / £30 per year) or $10 per month ($100 / £96 per year) for one building with any number of cameras.",
    "Keep in mind that uploading videos takes up bandwidth and we recommend a high-speed unlimited internet connection. With three cameras and a doorbell, Ring was uploading about 10GB of footage every day across four devices (three cameras, one doorbell).",
    "The Ring Stick Up Cam makes perfect sense to record videos if you are already in Ring's ecosystem. The flexibility of positioning the camera indoors or outdoors across either wired or battery-powered makes it a versatile solution.",
    "That being said, there are competing products that offer similar solutions from Google and Arlo with equally good (or better) video recording capabilities.",
    "Also missing is local storage on the Ring which comes in handy if you have a slower or limited Internet connection, or you just don't want your video being uploaded to a cloud service.",
    "If you're okay with that last part, the Stick Up Cam offers a good security and surveillance solution, and plays really nicely with other Ring cameras or Amazon's Alexa devices."
  ],
  "headers": {
    "4": "Design and installation",
    "9": "Setup",
    "12": "Everyday use",
    "17": "Subscription costs",
    "20": "Final verdict"
  },
  "links": {
    "Amazon Prime Day 2020": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}