{
  "source": "https://www.techradar.com/reviews/fitbit-alta-hr",
  "title": "Fitbit Alta HR review",
  "category": "wearables",
  "updated": "2019-07-01T15:23:17Z",
  "author": "luke-johnson",
  "summary": "A Fitbit Alta but with a hearty upgrade",
  "verdict": "With the Alta HR, Fitbit has taken what was already a solid activity tracker, and made it better. It’s not flash, it’s not elaborate, but it is slick and with its newly added heart rate tracking skills it's a more well-rounded fitness companion for those looking beyond a simple steps count.",
  "pros": [
    "Slim, comfortable design",
    "On-point steps counting",
    "Accurate heart rate reader"
  ],
  "cons": [
    "Screen slightly unresponsive",
    "Not the most dynamic sports tracker",
    "Display difficult to read in bright light"
  ],
  "article": [
    "Activity trackers are everywhere. Whether you run 10K every weekend or do little more than plod to the bus stop in the mornings, many of us have some form of sensor strapped to our wrist or shoved in our phones, tracking our every movement.",
    "When those movements are in the form of steps rather than cycles or lunges, Fitbit is king. The brand's device range is sprawling including the smartwatch inspired Fitbit Ionic and Fitbit Blaze, along with the general-purpose Fitbit Charge 3 all the way through to the most affordable in the range, the Fitbit Flex 2.",
    "Between those last two products sits the Fitbit Alta and the Alta HR. As its name suggests, the Alta HR has thrown an integrated heart rate scanner into the mix without bigging up the device’s bulk.",
    "That price hierarchy will change when Amazon Prime Day comes along, sprinkling deals and price reductions among the many Fitbit products like a fairy throwing fairy dust over the land, so it remains to be seen where the Fitbit Alta HR stands after that.",
    "This takes its skills beyond the basics and from fitness tracking into the realms of more in-depth fitness monitoring and improving. It’s an addition that boosts the device’s abilities, but one that comes at a cost.",
    "Despite its simplistic look and modest array of sensors, the Fitbit Alta HR isn’t the most affordable of devices. Available at launch for $149.95 (£129.99, AU$249.95) we've now seen the price drop as low as $140 (£120, AU$230) from some retailers but it hasn't budged much more.",
    "It may sink a little lower during sales periods, but it's a relatively expensive fitness tracker considering what this can do. Okay it's not exactly Apple Watch 4 levels of wallet abuse, but for what’s still essentially a glorified pedometer, it’s a sizeable chunk of change.",
    "One of those sales periods is Amazon Prime Day, which comes around in mid-July each year (it's Monday 15 in 2019). We frequently see the price of Fitbit models drop during this day-long sale (well, two-day-long in 2019), so if you're looking for a new fitness tracker, it's worth waiting for then to get a new one.",
    "If you can live without the HR skills, you can pick up another device with the same level of activity tracking for much less, such as the Fitbit Alta for $130 / £100 / AU$149.95 or other alternatives like the Garmin Vivofit 4 cost around $79.99 / £69.99 / AU$159.",
    "The extra expense of the Alta HR might deter many, but before you dismiss it based on price alone, we’ve been living with the Fitbit Alta HR to find out if its actually good value for the extra coin.",
    "When it comes to looks, the Fitbit Alta HR is classic fitness tracker. A small stainless steel sensor pod strapped to your wrist with a robust and sweat-resistant rubber strap. It’s not exactly thinking outside the box, but when the box can look this good, who cares.",
    "At just 15mm thick, it’s large enough to host an easily readable display while lining up 25% slimmer than its big brother, the Charge 2. That’s key. Although this looks like a fitness tracker, it’s not grabbing people’s attentions like many rubbery wearables do.",
    "It’s a sleek, stylish design that shows the world you’re keeping fit without making everyone worry you’re going to bore them with your latest training tips, or encourage them to eat nothing but kale and quinoa.",
    "As well as being easy on the eye, the Alta HR is comfortable too. The device’s barely-there body is light and gently curved to the arc of your wrist, securely locking in with a plastic buckle that ensures the Alta HR never feels at risk of jogging loose whether walking in the woods or doing sprint sessions.",
    "Its slim form factor and lack of physical buttons give it a clean, almost jewelry-inspired finish, with the option of a silver, black or gold metal body further refining the look. The inbuilt display is basic, but pleasingly so, offering up all the required information without bombarding you with unnecessary figures and battery-sapping showy graphics.",
    "It’s not faultless though. Take it out on a sunny day and visibility quickly becomes an issue - this isn’t the brightest panel and it can quickly get overshadowed by sunlight, making it almost impossible to read without first shielding it.",
    "This is a pretty serious problem, and one that’s bound to annoy those who live in places that are more consistently sunny.",
    "Finishing the look, the Alta HR comes in a variety of color schemes, with the different body options able to be paired with a variety of straps direct from the box. These range from understated black to more vibrant coral and fuchsia hues.",
    "You’re not stuck with your day one color choice either. Decide that your playing it safe black band is a bit boring, fine. It can be quickly unhooked and replaced with one of Fitbit’s many more colorful and stylish options.",
    "These aren’t just limited to rubber either, there are leather straps, fabric ones and even cool metal watches that the Alta HR’s pod can be clipped into.",
    "As with Fitbit’s other activity trackers, you’ve got two strap sizes to choose from, small or large. We’d recommend trying Fitbit’s printed sizing chart before splashing the cash because the large strap is pretty massive and many will be able to get away with the small strap."
  ],
  "headers": {
    "5": "Fitbit Alta HR price and release date",
    "10": "Design"
  },
  "links": {
    "Fitbit Ionic": "https://www.techradar.com/reviews/fitbit-ionic-review",
    "Fitbit Blaze": "https://www.techradar.com/reviews/wearables/fitbit-blaze-1312660/review",
    "Fitbit Charge 3": "https://www.techradar.com/reviews/fitbit-charge-3",
    "Fitbit Flex 2": "https://www.techradar.com/reviews/fitbit-flex-2-review",
    "Fitbit Alta": "https://www.techradar.com/reviews/wearables/fitbit-alta-1317934/review",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "Garmin Vivofit 4": "https://www.techradar.com/reviews/garmin-vivofit-4-review"
  }
}