{
  "source": "https://www.techradar.com/reviews/benq-ew3270u-monitor",
  "title": "BenQ EW3270U Monitor review",
  "category": "computing",
  "updated": "2019-10-24T00:46:41Z",
  "author": "michelle-rae-uy",
  "summary": "A beautiful 4K display",
  "verdict": "The BenQ EW3270U might not be the first option you look at when looking for a new monitor but it offers enough to be in the conversation. This 4K display is detailed with great color contrast, offers multiple port options and comes with some great blue light options, so it’s easy on the eyes.",
  "pros": [
    "Beautiful 4K display",
    "Blue light options",
    "Wide port variety"
  ],
  "cons": [
    "Lackluster speakers",
    "Weird headphone jack placement"
  ],
  "article": [
    "BenQ may not be the household name that HP, Samsung or other heavy hitters are when it comes to monitors. But, with the EW3270U monitor, we’re certain that they’re worthy of being included in the conversation for anyone searching for a new monitor.",
    "The screen does have a few drawbacks, which we’ll discuss below, but it offers a fantastic screen at 4k resolution with HDR included to sweeten the deal. Not only that but BenQ has built into the monitor some interesting eye care related technology that we’ve become fans of the more we used it.",
    "While TVs are dropping in price every year, a good monitor can still set you back a good chunk of change. Luckily, the BenQ EW3270U is a very reasonably priced option. At $499 (£412, AU$735), it’s not at the bottom of the pack but it’s far from the most expensive. Other 32-inch 4K monitors, such as LG and Samsung’s offerings, come in at the same price but don’t offer USB-C connectivity – and HP’s option for the same price is only 27 inches. Other options start going up in price, such as ViewSonic’s 4k monitor, while offering a slightly higher refresh rate of 75Hz, also goes for $900 (£742, AU$1,326) on their website.",
    "The EW3270U is available in the UK for £389 in UK and, while you can’t order direct, it’s available in Australia as well for AU$899.",
    "The look of the BenQ 3270U monitor is fairly straightforward. Like most monitors, it resembles a flat panel TV. The screen has thin but visible bezels around the sides and top of the display, while the base is a bit taller.",
    "Unlike a TV, the angle of the monitor can be easily adjusted to face up or down. It also has a 178-degree viewing angle. So, if you need a monitor to please an audience of game fans, then this display can more than handle the job.",
    "There’s a button on the lower right side that allows you to select between four modes: HDR and BI+ (their brightness intelligence technology) off, HDR on, both on and BI+ on. Considering that this shortcut button gets you quick access to two of the most important features on the monitor, it’s a welcome and appreciated addition.",
    "Under the right side is the power button and the menu selection buttons. The menu is easy to navigate with the leftmost button letting you select between four modes of blue light such as multimedia and reading. The next option over lets you select between different color schemes such as HDR, gaming and M-book, meant for when you’re using the display with a Macbook.",
    "The third button allows you to switch between DisplayPort, two HDMI inputs, and USB-C. And lastly, the fourth button lets you get into system settings, fine tuning and other features like Smart Focus, which grays out everything on the screen except for an adjustable viewing box, and Super Resolution, which can upscale the display for a crisper, more detailed image.",
    "Also, under both sides of the monitor are downward-firing speakers. It’s an interesting addition since most monitors only offer audio ports. Unfortunately, the speakers have no bottom and therefore sound very thin. It’s not ice pick painful, but it doesn’t sound pleasant. The best thing that can be said about them is that they don’t distort when the volume is maxed out.",
    "Lastly, the ports sit behind the right side of the monitor. We have to turn the monitor around to get access to the ports which wouldn’t be a big deal except that the audio jack is stuck back there next to the USB-C, DisplayPort and two HDMI ports. While most people will probably just be fed their audio from their PC’s outputs, it’s still a somewhat annoying and inaccessible placement if you’re using normal headphones.",
    "The performance of the BenQ EW3270U is pretty solid. The screen is gorgeous, detailed and vibrant, thanks to its 4K resolution and HDR emulation. Videos and games look sharp and detailed. In particular, it was easy for us to get drawn in watching 4K videos of the jungle while testing this unit. It has a 3,000:1 contrast ratio and 95% DCI-P3 color gamut which resulted in great color reproduction and an accurate, rich image.",
    "It does come with a 60Hz refresh rate, so you’ll probably want to take advantage of the inclusion of AMD Freesync (or use V-Sync on your computer) when gaming. We do experience a little bit of screen tearing but using V-Sync fixes that issue quickly.",
    "The monitor’s included eye care technologies are a big plus for us. The Brightness Intelligence + Technology (or BI+) and blue light options mean that we don’t get eye strain using the monitor for long viewing sessions, regardless of whether it’s movies or games.",
    "BI+ is supposed to automatically adjust the color temperature and brightness of the display based on its environment. We don’t have to adjust the brightness when it gets dark. And we are able to see the display clearly regardless of how bright it is in the room. And, the screen never looks washed out or oversaturated. The blue light modes that are available let you adjust according to the media you’re using (watching a movie versus reading, for example) and is great for helping fine tune the monitor even further.",
    "BenQ’s emphasis in eye care might be one of our favorite aspects of the BenQ EW3270U monitor, and it does its job swimmingly. In fact, our only real issue with the monitor is its audio. There’s the minor annoyance of having the audio jack tucked in the back, which is more of an issue if you use headphones. More important are the speakers they decided to include. They’re very thin sounding and only helpful if you have no other means of getting sound.",
    "The differences between most monitors are not going to be as noticeable as comparing a Chromebook to a gaming PC, but there are some notable differences. Not only does the BenQ EW3270U monitor offer up a gorgeous and versatile display. It does so with a plethora of inputs allowing you to go from a gaming PC to a laptop only equipped with USB-C."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "11": "Performance",
    "15": "Final verdict"
  },
  "links": {}
}