{
  "source": "https://www.techradar.com/reviews/lenovo-yoga-920-review",
  "title": "Lenovo Yoga 920 review",
  "category": "computing",
  "updated": "2020-10-23T16:43:14Z",
  "author": "matt-hanson",
  "summary": "Another remarkable 2-in-1 laptop",
  "verdict": "Lenovo has produced another gorgeous 2-in-1 laptop that can transform into a tablet-like device. It’s a premium product with a price tag to match, but you feel like you’re getting your money’s worth with this powerful device.",
  "pros": [
    "Lovely design",
    "Thin",
    "Decent power",
    "Great sound quality"
  ],
  "cons": [
    "Lacks graphical power",
    "Keyboard still annoys in tablet form",
    "Fans can be loud when they kick in",
    "Plastic stylus-holder feels cheap"
  ],
  "article": [
    "There are so many great touchscreen laptops out there right now, but Lenovo may be at the top of the pile with the Lenovo Yoga 920 – the long anticipated follow up to the Lenovo Yoga 910.",
    "The Lenovo Yoga 920 inherits its predecessor’s 360-degree hinge, but expands on the design with Thunderbolt 3 connectivity, a reasonably placed webcam and prolonged battery life.",
    "The market is packed with some of the best 2-in-1 laptops we’ve ever used, like the breathtaking Surface Book 2. Does the Lenovo Yoga 920 stand out from the pack, even in the face of its successor, the Lenovo Yoga C930? In short: yes, but keep reading and we’ll prove to you that the Lenovo Yoga 920 is still a laptop to beat in 2019.",
    "As with other 2-in-1 devices, the Lenovo Yoga 920 comes in different configurations, though thankfully Lenovo hasn't gone overboard by offering a confusing array of options.",
    "Luckily, since the Lenovo Yoga 920 has been succeeded by the Lenovo Yoga C930, we should start seeing prices drop, especially on refurbished models. This is a good thing, as the Yoga 920 has aged particularly well over the last year.",
    "The base model comes with an Intel Core i5-8250U processor, 256GB SSD, 8GB RAM, a 13.9-inch 1080p touchscreen and an Active Pen stylus, and costs $1,199 (£1,199). This model is available in the US and UK.",
    "There is a second model that’s similar to the previous one, but ups the CPU to an Intel Core i7 and you get 512GB of SSD space. This configuration will set you back $1,549 (£1,349) and again is available in the US and UK. Based on these prices, you can see that in the UK, the higher specced Yoga 920 offers much better value for the money.",
    "Finally, there’s a version that features an Intel Core i7-8550U processor, 16GB RAM, up to 1TB of storage and a UHD (3,840 x 2,160) screen. This model is only available in the US and Australia, and costs $1,999 (AU$2,999). Keep in mind that the Australian model is currently capped at 512GB of storage.",
    "Unfortunately, Australian readers will be missing out on the lower-specced options, but at least the price conversion compared to USD is pretty fair. Similarly, in the UK, you’ll have to live without the 4K screen.",
    "While the Lenovo Yoga 920 is definitely not the most affordable laptop, the price is comparable to what you would see with similar high-end laptops, and in fact, a bit cheaper than the Surface Book 2 (13.5-inch).",
    "If you’re considering picking up the Surface Book 2, it’ll set you back $1,499 (£1,499, about AU$2,600) to start. That’s for a 7th-generation Intel Core i5 processor, 8GB of RAM, a 256GB SSD and an integrated GPU. However, prices cap at $2,999 (£2,999, about AU$5,200) for the top-end version, boasting an 8th-gen Intel Core i7 processor, 16GB RAM, a 1TB SSD and a GTX 1050 GPU.",
    "The Lenovo Yoga 920 comes in a wide variety of configurations, not to mention prices, but none of these options feature dedicated graphics. Instead, the 2-in-1 uses an integrated graphics solution, which should be able to handle most productivity and creative tasks like photo editing. However, don’t expect to get far with heavy gaming or video editing software.",
    "When you’re paying a premium price, you want a device that looks – and feels – premium as well, and Lenovo has done an excellent job of that with the Yoga 920. It has a thin yet sturdy feel to it, weighing 3.0 pounds (1.37kg) and measuring just 12.7 x 8.8 x 0.5 inches (323 x 223.5 x 13.95mm).",
    "This means that the Lenovo Yoga 920 has a nice heft to it without feeling overly heavy. It also has a nice metallic finish, which contributes to the premium feel, although after only a few hours of use, the metal finish becomes a fingerprint battleground, so you’ll want to keep a microfiber cloth handy to keep it looking pristine.",
    "It’s a small price to pay, however, for such a good-looking 2-in-1. The hinges along the back of the Yoga 920 are also eye-catching – we’ve fluctuated between thinking they're stylish and finding them a bit gaudy. There’s no doubting the strength and build quality of the hinge though, which is essential for a convertible laptop as that hinge is likely to see a lot of action as you switch screen orientations, so you don’t want it to be a point of failure.",
    "The hinge on the Lenovo Yoga 920, similar to the Surface Book 2, is strong enough to angle the screen without the body tipping up, while holding the display in place. However, unlike Microsoft’s 2-in-1, the Yoga 920’s hinge design doesn’t stick out quite as much, and, of course, it allows you to flip the screen a full 180 degrees.",
    "2-in-1 convertibles that flip their screens into tablet mode struggle to provide quite as good a tablet experience as 2-in-1s that tout a screen that detaches from the keyboard, as you’re still left with a slightly bulky device with a back that feels like a keyboard (because it is one).",
    "Lenovo has managed to address at least one of these points thanks to the thinness of its design – even with the screen flipped all the way back, this is still a thin device, though definitely not as slim as standard tablets. That keyboard back remains, and while it doesn’t feel that nice (compared to the smooth, flat back of a normal tablet), the Lenovo Yoga 920 is at least clever enough to turn off the buttons so they don’t interfere when in tablet mode.",
    "This is why it’s easy to recommend the Lenovo Yoga 920 as a laptop that can occasionally turn into a tablet, rather than vice versa. If you’re on the hunt for something that you’ll use mostly as a tablet, but want it to turn into a laptop occasionally for typing, we’d recommend something like the Surface Book 2, or perhaps a tablet that comes with a physical Bluetooth keyboard.",
    "The Lenovo Yoga 920’s display bezel is impressively thin, and the webcam is now back at the top of the screen where it belongs. On the Yoga 910, the webcam was situated in the bottom bezel, which has led to some unflattering shots. Suffice to say, people weren’t too happy with that placement. With the camera returning to the top of the screen, videos look much more natural when using VoIP software – and thankfully, putting the webcam back there hasn’t necessitated a thicker top bezel.",
    "Because of how thin the laptop is, it’s probably no surprise that there isn't a ton of ports available. On the left hand side, there’s an audio jack and two USB-C ports (one of which is also used as the charging port), and on the right is a full sized USB-A 3.0 port. This is obviously not a lot of ports, but it’s more generous than the MacBook with its single USB-C port.",
    "To be honest, we didn't find the Lenovo Yoga 920’s number of ports restrictive, and it’s a reasonable trade-off for the svelte design. If you have a number of USB devices that you want to attach you’ll need a USB hub, but the Yoga 920 also has built-in Bluetooth support as an alternative.",
    "The fact that it still features one full-size USB port means there’s some flexibility here for using legacy devices, as well as memory sticks.",
    "One of the biggest drawbacks of the Surface Book 2 is that despite its high price, the Surface Pen isn’t included, necessitating an extra purchase on top of the initial, already pricey, outlay.",
    "Luckily, Lenovo bucks this trend, and includes the Active Pen stylus as part of the Lenovo Yoga 920’s package. This battery-powered stylus has a nice aesthetic, and the Yoga 920 responds well to it, as the screen is able to detect 4,096 levels of pressure sensitivity. Both light and hard presses are registered accurately in the art apps we tested, and the laptop keeps up with even the most frantic scrawls and doodles.",
    "However, you have to hold down one (of two) buttons on the stylus to utilize the erase mode – unlike the Surface Pen, which has a nifty feature where you can use the other end of the stylus as an eraser. Overall, though, we’re happy with the Lenovo Active Pen, and we appreciate the fact that Lenovo includes it right out of the box.",
    "However, it's not all good news. Lenovo has to find a way to effortlessly store the stylus within such a slim design. Microsoft’s solution with the Surface Pen and its Surface devices is to magnetically attach the stylus to the main device; it's a nice feature that’s handy, although not totally secure, and it helps to give that device a premium feel.",
    "With the Yoga 920, Lenovo has decided on a plastic holder that fits into the full-size USB port to hold the stylus. This feels a bit cheap and tacky, and it also means you’re losing access to a USB port if you're using the holder. It’s a shame, as so many other elements of the Yoga 920's design feel premium, and this just feels like an oversight.",
    "First reviewed December 2017",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "12": "Design",
    "23": "Stylus pros and cons"
  },
  "links": {
    "great touchscreen laptops": "https://www.techradar.com/news/world-of-tech/roundup/10-best-touchscreen-laptops-in-the-world-909937",
    "best 2-in-1 laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2",
    "Lenovo Yoga C930": "https://www.techradar.com/reviews/lenovo-yoga-c930",
    "Surface Book 2 (13.5-inch)": "https://www.techradar.com/reviews/microsoft-surface-book-2-13-inch",
    "video editing software": "https://www.techradar.com/best/free-video-editing-software"
  }
}