{
  "source": "https://www.techradar.com/reviews/fitbit-charge-2-review",
  "title": "Fitbit Charge 2 review",
  "category": "wearables",
  "updated": "2019-07-01T15:37:44Z",
  "author": "james-peckham",
  "summary": "Trying to top a classic",
  "verdict": "The Fitbit Charge 2 is an improvement in every way over the Charge HR, but you'll only want to get one if you're after more fitness tracking and a large display to see your results.",
  "pros": [
    "Big screen",
    "Comfortable strap",
    "Multi-sport tracking"
  ],
  "cons": [
    "Limited phone notifications",
    "No GPS",
    "Expensive straps"
  ],
  "article": [
    "The Fitbit Charge 2 arrived in September 2016 and was the first upgrade to the popular Charge range since the Charge HR, which originally appeared early in 2015.",
    "It's a little less impressive now there's the Fitbit Charge 3 that sports swim tracking and a more refined design, but the Charge 2 has now dropped in price because of Fitbit's newer tracker and it's still a solid band worthy of your attention.",
    "It's especially worth checking out the Fitbit Charge 2 during Amazon Prime Day deals, as Fitbit fitness trackers are often among the most reduced products, and we could see the Charge 2's price become incredibly low. The next Prime Day is Monday 15 July 2019, so check out our hub for the deals bonanza then to find all the best savings.",
    "Fitbit specializes in accessible and easy to use fitness trackers, rather than more complicated running and fitness technology. With exercise, sleep, heart rate tracking and much more, the Charge 2 is a well-specced wearable that won't break the bank.",
    "The original RRP for the Fitbit Charge 2 was set at $149.99 (£129.99, AU$250) with a plastic band and $179.95 (£149.99, AU$289.95) for the Special Edition versions, which have more premium-feel straps.",
    "You can also buy leather straps separately in a light brown, indigo or pink, for $69.95 (£59.99, AU$119.95).",
    "We've seen a variety of retailers drop the price further though with the price touching as low as $119 or £79 during sales periods. The price is also generally that low now as the Fitbit Charge 3 is now out and that starts at £129.99 / $149.95 / AU$229.95.",
    "The Charge 2 is quite a bit more expensive than the Fitbit Flex 2, so it may be worth your while checking out that tracker too to see if you would be suited to the more affordable tracker.",
    "Design-wise, the Fitbit Charge 2 is much the same as other Fitbit devices, and feels a little like the lovechild of the Charge HR and the Fitbit Surge.",
    "There's a much larger screen here than on the Charge HR – but the device is a fair bit thicker too, so you may not be a fan if you liked the compactness of the last version.",
    "That said, the screen is still relatively small and it's not color, but it is an OLED display, so all the information the Charge 2 delivers is easy to read – plus it's a touchscreen, which is a first for the Charge range.",
    "The touchscreen proved a little unresponsive at times during our review, but we never found it particularly frustrating – you just need to give it an extra tap sometimes.",
    "There's a button on the left-hand side of the tracker that you use to skip through the menu options, such as steps, time, heart rate and calories; you can hold this button down to activate certain features as well.",
    "The Fitbit Charge 2 tracker itself is rather small, and comes with one two-section strap in the box. Each part of the strap can be detached by pulling it out of clips on either side of the tracker, if you want to swap-in a different one for a style change and there's a good range of accessories for the Charge 2 to choose from.",
    "You can get the elastomer (basically rubber) strap in light blue, dark blue, black or purple. The two more premium options for the fashion-conscious among you are lavender/rose gold and black/gunmetal.",
    "There are also more premium Luxe straps available which are made of real leather. The color choices are light pink, brown and indigo but each costs a hefty $69.95 (£59.99, AU$119.95).",
    "This level of customization is welcome, but we did find it a bit of a struggle to connect a band at first. Sometimes it would sit a little off of the tracker, but after a while it worked itself into the right position.",
    "Fitbit has improved the materials used in its straps dramatically over the past five years. The original Charge launched with a strap that irritated a lot of people's skin, but this new version was comfortable throughout our review period.",
    "It felt comfortable, and compared to many other fitness trackers this is a lot easier to wear throughout the day.",
    "We didn't always want to wear it to bed, as Fitbit suggests you'll want to, but it feels secure on your wrist and isn't going to become irritating; it's also comfortable to wear when you're typing at a desk, so you won't necessarily need to take it off when you're at work.",
    "The Charge 2 isn't waterproof like the Fitbit Flex 2, but it is water-resistant, meaning it can handle a few splashes while you do the washing up, or sweat when you're exercising.",
    "You won't be able to wear the Charge 2 in the shower or when swimming, though. It's nice to be able to wear a fitness tracker in the rain without worrying about it being damaged, but we'd have liked to see Fitbit make the Charge 2 fully waterproof.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "4": "Fitbit Charge 2 price and release date",
    "8": "Design"
  },
  "links": {
    "Fitbit Charge 3": "https://www.techradar.com/reviews/fitbit-charge-3",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "hub for the deals bonanza then": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Fitbit Flex 2": "https://www.techradar.com/reviews/fitbit-flex-2-review",
    "Fitbit devices": "https://www.techradar.com/best/the-best-fitbit"
  }
}