{
  "source": "https://www.techradar.com/reviews/tactical-master-gaming-headset",
  "title": "Tactical Master Gaming Headset review",
  "category": "computing",
  "updated": "2019-01-14T20:14:17Z",
  "author": "michelle-rae-uy",
  "summary": "Premium sound minus the premium price",
  "verdict": "James Donkey’s latest gaming headset swaggers with premium sound, compact and comfortable design, and a price far more affordable than inferior gaming headsets on the market.",
  "pros": [
    "Impressive sound stage",
    "Top-notch sound quality",
    "Reasonably affordable",
    "Compact & lightweight"
  ],
  "cons": [
    "No software for customization",
    "USB connection only",
    "Quieter low end"
  ],
  "article": [
    "“A comfy, premium, and affordable headset” is how James Donkey, a Chinese peripherals manufacturer with a penchant for Autobot-inspired gaming mice, is marketing his latest creation on Kickstarter. And we must say, they’ve done a phenomenal job.",
    "Yet the valiantly-named Tactical Master is more than that. It hits the sweet spot between the top-notch quality that we all want from our gaming peripherals and a price tag that most of us can actually afford.",
    "At an $89 (about £70, AU$125 MSRP), it’s already cheaper than most of the top peripherals out there, which is surprising since it is made of truly quality stuff. But it’s also more than just a solid product; it’s also one of the best gaming headsets this reviewer has tested – the second best, in fact, after the $249 (£249, AU$369) SteelSeries Arctis Pro – with its glorious sound and incredible virtual sound stage encased in a light, compact, and classy design that you typically won’t see in today’s gaming headsets.",
    "For the record, the Tactical Master does have its flaws so we’re going to start with those. The most glaring one might be that it only has USB connectivity with its Type-A connector, which means that while it works with computers, laptops, and Playstations, you’ll have to use an adapter to connect it to your Nintendo Switch and Android devices.",
    "A couple of limitations aren’t uncommon with gaming headsets, so this isn’t at all a deal-breaker. It is, however, disappointing since this headset was designed to be portable, and it would have been great if we could connect it to our iPhones while commuting or traveling.",
    "Luckily, its list of flaws isn’t long. Besides the limited connectivity, the only real thing to nitpick about in terms of design is the fact that its ear cushions aren’t the most breathable. That means that you’ll have to grapple with sweaty ears from time to time, especially when you’re playing for a few hours.",
    "That said, we adore the Tactical Master’s pilot headset-inspired design flourished with the subtle RGB lighting around the dials next to the ear cups. This allows the headset to retain that gaming aesthetic that seems to be a prerequisite with gaming peripherals these days while still being elegant and distinctive. It’s definitely a fresher take on the gaming look, which typically leans towards the bulky and ostentatious.",
    "At 248g, it’s lighter than a lot of headphones out there. With its foldable ear cups, retractable and flexible mic, and thin yet still padded headband, it’s portable, making it travel-friendlier than most. And with its soft 22mm memory foam cushions, which are removable and easily replaceable, it’s so comfortable and won’t cause fatigue even after having it on for hours at a time.",
    "Most importantly, its ear cups are attached to the headband with thin but sturdy metal wires.. The adjustable ear cups are also made with a robust plastic; the stitched headband and ear cushions are dressed in skin-friendly protein leather and the cable is braided so you don’t have to worry about fraying.",
    "Overall, this gaming headset feels and looks well above its low price point.",
    "The Tactical Master’s star feature is undoubtedly its 7.1 virtual surround sound, which lends to this headset’s wide soundstage and very accurate imaging. For one, when listening to music during our tests, we could hear distinctly where the instruments are coming from. Naturally, since this is designed for gaming, we also tested it with AAA games such as Assassin’s Creed Odyssey and Hellblade: Senua’s Sacrifice during which we scrutinized not just the sound quality but also its left/right and 3D soundstage.",
    "The left to right soundstage is, as expected, on point, offering an incredibly immersive gaming experience. The 3D soundstage is also very good, but it isn’t as amazing as that of $119 (£119, AU$299) Creative’s Sound BlasterX H7 Tournament Edition. That is, the spaces in front and in the back aren’t quite as wide, which is more noticeable when you’re playing a game and a sound that’s supposed to come from behind doesn’t quite accurately give you that impression.",
    "Again, despite its price, the Tactical Master is made of premium components. Inside, it boasts a 53mm Neodymium magnet driver, typically used in bass guitar amps specifically because it is lighter than traditional drivers. It’s also stronger and lighter, albeit more expensive. This driver gives it an amazing sound that’s great for not just gaming, but also for listening to music and watching movies.",
    "When it comes to its sound quality, everything is well-balanced with a slight bump in the upper mids to make it even more pleasant. Unlike most gaming headsets with harsher high ends, which just sound cheap and much more fatiguing, its high end is neither harsh nor rolls off. And while other headsets tend to scoop up their mids to make the low & high ends louder, its mids are very present.",
    "Much like its design, its sound performance isn’t perfect. The lows fall off faster than we’d like and the headset doesn’t offer a lot of deep rumbling bass when necessary – during explosions, for example. They’re still there; they’re just not going to have as big of an impact. If you love a lot of low end in your sound devices, you’ll probably miss them with this.",
    "Additionally, while the sound quality and soundstage is about the same when connected to the PS4, we have noticed that it has a pretty noticeable volume drop. In fact, to get to a comparable listening volume you have to turn it up almost all the way. And you have to do it on the PS4 since the volume dial doesn’t work with this connection.",
    "When it comes to audio, a USB connection is ACE as it offers a higher quality connection and higher quality sound. It’s also an industry standard connection that’s readily available in many gaming consoles and appliances as well as most laptops and computers. It is, therefore, easy to understand why the folks at James Donkey opted for it when they designed the Tactical Master.",
    "Just having one connection, however, does limit this headset’s use AND ease of use, which is why we want to give you a heads up on that. But that’s only to an extent.",
    "You can’t, for example, connect it to your iPhone. While you can find Type-A (or even Type-C) to Lightning adapters and it should work in theory, it doesn’t with the Tactical Master. Additionally, the headset doesn’t currently support Xbox consoles and controllers.",
    "Since it is USB only – and a short cord at that – you have to plug it into the console itself when you’re using it with a PlayStation, which forces you to sit close to it or buy a separate USB extension cable. We haven’t tested if it works with a Type-A to Micro B adapter so you can plug it directly in the controller, but since neither their website nor their Kickstarter has mentioned it, we’ll assume that it doesn’t.",
    "The good news is that it does work with a USB C to USB 3.1 Adapter so you can use it with your Nintendo Switch as well as your Android devices.",
    "Another good news is that this is a driver-free headset, which means you can use it on any compatible devices without a driver. It’s a bit of a double edged sword as it does not come with software for customization, but that is the point of the Tactical Master—to be simple and amazing sounding right out of the box.",
    "Although its somewhat limited connectivity and lack of customization, as well its minimal deep rumble, might turn off some potential buyers, those gamers who have their priorities straight when it comes to sound will only have high praises for the Tactical Master.",
    "It has more than enough things going for it. We love that understated, pilot headset-inspired gaming look. We love its portability and the luxe comfort it offers. And we definitely appreciate that its more reasonably priced among many its competitors, even though it offers a much more superior sound quality.",
    "That’s not an exaggeration. We’ve tested gaming headsets that will set you back $20+ more, and their sound quality and soundstage are nowhere near as full and dynamic. We’ve also tested audiophile level headphones that may sound a tad more amazing, but cost more than double the price of the Tactical Master.",
    "If you’re looking for a gaming headset that gives you incredible value for not a lot of money (who isn’t?!), the Tactical Master might just be the one."
  ],
  "headers": {
    "3": "Design",
    "10": "Performance",
    "16": "Connectivity",
    "22": "Verdict"
  },
  "links": {
    "his latest creation on Kickstarter": "https://www.kickstarter.com/projects/1535804469/tactical-master-most-comfortable-immersive-gaming",
    "SteelSeries Arctis Pro": "https://www.techradar.com/reviews/steelseries-arctis-pro-headset",
    "Creative’s Sound BlasterX H7 Tournament Edition": "https://www.techradar.com/reviews/creative-sound-blasterx-h7-tournament-edition"
  }
}