{
  "source": "https://www.techradar.com/reviews/acepc-ak7-thin-client-pc",
  "title": "AcePC AK7 thin client PC review",
  "category": "computing",
  "updated": "2019-01-22T20:00:32Z",
  "author": "desire-athow",
  "summary": "Affordable, powerful and classy – what’s not to like?",
  "verdict": "The AK7 hits a nice sweet spot if you don’t mind the fan noise. The two HDMI ports will be of interest to businesses looking to make the jump to dual screens, but there are cheaper and better alternatives if you want to look around.",
  "pros": [
    "Value for money",
    "Two HDMI ports"
  ],
  "cons": [
    "Noisy",
    "Still uses USB 2.0 in 2019!",
    "No VESA mount",
    "Has an old CPU"
  ],
  "article": [
    "Just over a year ago, we reviewed our first thin client PC from AcePC, the AK1, and found that it was a bit of a mixed bag. Now we’ve received a new mini PC from this manufacturer, the AK7, which shares most of the hardware found in the AK1 and manages to sell for even less.",
    "The manufacturer also sells a number of devices based on the older (and now obsolete) Intel Atom Z8350 CPU which is underpowered for most tasks, but with sub-$100 prices, these pieces of hardware might be useful for some very specific niche use-cases.",
    "The AK7 shares its gold design with some rivals like the Voyo V1 or the Voyo V3, the latter being the gold standard (pun not intended) when it comes to sheer aesthetics. This PC is reasonably compact at 128 x 128 x 24mm with a weight of 270g.",
    "It’s entirely made of brushed metal with a gold color scheme and a plastic cover on top, but unfortunately the latter picks up scratches very easily. There are four rubber feet and no air vents at the bottom, plus you can’t mount the AK7 at the back of a monitor because it lacks the appropriate VESA fittings.",
    "A blue LED indicates when the device is on and there’s a power button, a TF card reader, four USB ports (two of them USB 2.0), two HDMI ports, an audio connector, a proprietary power jack and a Gigabit Ethernet port.",
    "The unique selling point of the AK7 is its unique capability – at this price point – to drive two monitors natively without the need for adaptors. The Intel HD Graphics 500 on-board (integrated) GPU can handle 4K on one HDMI port but we’re unsure whether it has the grunt to power two 4K monitors simultaneously.",
    "As for the Apollo Lake Celeron J3455 CPU, it is a bit long in the tooth having celebrated its second birthday already. The current shortage of Intel processors at the lower-end of the market means that manufacturers have to use whatever existing stock they have in order to build products.",
    "What other reason could explain why AcePC didn’t use the similarly priced J4105 – which comes with a newer graphics solution and twice the on-board cache – or indeed the faster and newer Celeron N4100, which outperforms the J3455 on benchmarks and has a much lower power dissipation?",
    "The Samsung CJNB4R was chosen as the storage subsystem. This 64GB eMMC drive is also used in other Samsung products like the Galaxy Book 10.6. It returned decent performance figures without setting the world on fire.",
    "The rest of the spec is very much as expected with an Intel Wi-Fi/Bluetooth component, 4GB RAM and a 30W (2.5A, 12V) power supply unit.",
    "The first thing we noticed is how noisy this PC is under load. It clocked a whopping 61dB on our sound meter when the sensor was placed directly next to the air vent on the side. As such, it can be disruptive if used in a quiet office environment or as a presentation device.",
    "It does run rather warm as well, and tended to underperform across the board compared to newer (and also more expensive) Gemini Lake-based mini PC devices.",
    "That said, the performance offered is likely to be more than enough for most office-based tasks. Just don’t expect the AK7 to play the latest games at high resolution – this is simply not the device for such a task.",
    "There aren’t many rivals at this price point. As we mentioned at the outset of this review, AcePC’s AK1, at $150, is one potential alternative and works well if you have a spare 2.5-inch hard disk drive that you want to recycle. Otherwise, you’d better stick with the AK7.",
    "If you can spend a tad more, then the Beelink N41 which runs to $170 offers better performance thanks to the combination of a Gemini Lake CPU plus DDR4 system memory. We also like the fact that it comes with wall mounting brackets and four USB 3.0 ports.",
    "On the other hand, if you don’t mind a slower PC, then the MII which costs $130 may serve you well. It sports an Intel Celeron N3350 CPU with the same hardware configuration as the AK7, but throws in a more versatile SD card reader plus four USB 3.0 ports.",
    "For businesses, the AK7, as a thin client, proves to be an interesting conundrum. It is relatively affordable at just under $150 at the time of writing, and can handle two monitors, making it almost ideal for those who want to drive a pair of large display panels.",
    "The AK7 is also small and nimble enough to be tucked away where it can’t be seen, plus there’s no bloatware at all.",
    "The usual caveats apply when it comes to buying directly from China, and if you can live with the noise, then this PC is, on paper, a good deal – only dampened by the fact that there is at least one cheaper alternative (the MII)."
  ],
  "headers": {
    "2": "Design",
    "5": "Specifications",
    "10": "Usage and performance",
    "13": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "AK1": "https://www.techradar.com/reviews/acepc-ak1-mini-pc",
    "Voyo V1": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1417764316307577600&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box-mini-pc%2Fpp_576023.html",
    "Voyo V3": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/voyo-v3-mini-pc-1322627/review",
    "Galaxy Book 10.6": "https://www.techradar.com/reviews/samsung-galaxy-book",
    "Beelink N41": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1392858477260584700&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009841445213.html",
    "MII": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1131673534871219600&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009479531392.html%3Fwid%3D1433363"
  }
}