{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-a30",
  "title": "Hands on: Samsung Galaxy A30 review",
  "category": "phones",
  "updated": "2019-04-11T15:56:35Z",
  "author": "tom-bedford",
  "summary": "The middle child of Samsung's Galaxy A series of devices",
  "verdict": "The Samsung Galaxy A30 is a good looking device, with a large and vibrant screen, although we're yet to be convinced by its camera capabilities.",
  "pros": [
    "Vibrant Super AMOLED screen",
    "Sizable battery life",
    "Fast user interface"
  ],
  "cons": [
    "Camera effects weren't reliable",
    "Felt a tiny bit unwieldy"
  ],
  "article": [
    "Meet the Samsung Galaxy A30, one of the middle childs in the A series, between the Samsung Galaxy A20 and Galaxy A50. At MWC 2019, went hands-on with the A30 and A50.",
    "These are the more affordable alternatives to the pricier Galaxy S flagships – and while they're good to look at, in some ways they're lacking. That's expected given the anticipated much cheaper price.",
    "We haven't been told an official release date or price for A30 in the US and the UK, other than that it'll cost between €200 (roughly $230, £175) and €300 (around $340, £260).",
    "However, in Australia, the Samsung Galaxy A30 is available to buy now for AU$379 from Samsung directly or from leading retailers.",
    "We'll keep you updated when we find out more about the price and availability in other markets.",
    "The Samsung Galaxy A30 is a rather wide budget phone – its large screen made it feel like a plus-sized handset. It was very light to hold and rather thin, at only 7.7mm thickness, however we were also told the A50 was 7.7mm, and that felt even thinner.",
    "The look fits 2019 standards, with a bezel reduced display, though it doesn't actually have the glass back or aluminum frame of the Galaxy S10 series. It's polymer on back with a plastic silver-painted frame. It at least looks convincing.",
    "The 6.4-inch Infinity-U AMOLED display was very vibrant, with colors popping and contrasting well – it's undoubtedly a good-looking device, and would be great for watching videos.",
    "The large screen was broken only by a small notch cutout at the top, popularly called a 'teardrop notch', and it's used to house the selfie-cam. That said, even with all of that free real screen estate up top, it felt as though the notification icons were a little small.",
    "At the bottom of the device was a 3.5mm headphone jack, which we are always happy to see, and it also comes with a USB-C connection. The power and volume buttons on the side of the device felt a little too high up to use comfortably, as did the rear fingerprint sensor, which is an issue that comes with the size of the device, but depending on how you hold your device this may not be a problem.",
    "Upon release, the A30 will be available in four colors – black, white, blue and red, although we only saw it in black and white.",
    "On paper, the Samsung Galaxy A30 is quite an impressive budget phone for photography. It has a rear dual-lens camera consisting of a 16MP main sensor with an f/1.7 aperture, and 5MP ultra-wide lens with a f/2.2 aperture. The ultra-wide lens has the same encompassing 123 degree field of view as the Galaxy S10 series. The front of the phone has a 16MP selfie cam.",
    "As will all Samsung phones, the camera's user interface was very easy to use, with all effects and options easy to find and a very quick shutter speed capturing moments quickly.",
    "These effects were a little disappointing, however – during our demo Live Focus mode often blurred too much or too little, and the Auto Selfie function, through which we were supposed to be able to take a selfie just by waving our hand, rarely worked as intended. We couldn't see the Scene Optimizer effect having any noticeable difference, but we'd need to use this feature in a variety of locations to make a final decision on its usefulness.",
    "The pictures themselves were nothing fantastic, as they seemed to have quite low contrast and were a little too washed out compared to other phone cameras, but the images weren't terrible and would be fine for everyday use like social media and video chat. Bear in mind we only tested it in one environment, so when we check out the camera for our full review we'll be able to put it in different situations to see how well it takes pictures.",
    "With a sizable battery capacity of 4,000mAh, the Samsung Galaxy A30 will easily last you a day and it's almost as big as the 4,100mAh battery in the tremendously more expensive Samsung Galaxy S10 Plus.",
    "Of course, the actual lifespan of a battery depends on how well the software and chipset is optimized, and how you use the device. So we'll test it thoroughly when we get our hands on it for a full Samsung Galaxy S30 review.",
    "The handset supports fast charging of 15W, which is fairly fast, although nothing compared to the wireless charging capabilities of some of the S10 devices, like the S10 Plus 5G's 25W wireless charging.",
    "When we played around with the Samsung Galaxy A30's Android 9 operating system, we found it smooth to use, opening apps and navigating menus with ease. Of course we'll need to put the phone through its paces for our full review to see how well it runs, but when we ran a quick benchmark check we found it to have a multi-core speed of 4,103. This is similar to the Pixel XL, which was released in 2016, although that was a premium device upon release.",
    "At launch, the phone will be released in two sizes – one with 32GB of internal storage and 3GB RAM, and a larger 64GB/4GB configuration. It also supports microSD cards, in case you need more storage.",
    "This is nothing breathtaking, and the low memory may be a problem for some people who use many apps or download media, but we're expecting the device to launch for a low price that'll justify its lower memory.",
    "The Samsung Galaxy A30 is a cheaper alternative to the pricey Galaxy S10 phones, without all of the flagship-level bells and whistles. It has a sizable screen, a hefty battery for all-day usage, and a dual-lens rear camera with an ultra-wide field of view.",
    "At MWC, the software ran smoothly, and we're hoping to get this budget phone in for more testing, particularly to check out the camera in a different environment. It faces a lot of new budget phone competition in 2019, so we'll see if Samsung has enough to compete with Chinese manufacturers, like it does on its higher-end devices.",
    "MWC (Mobile World Congress) is the world's largest showcase for the mobile industry, stuffed full of the newest phones, tablets, wearables and more. TechRadar is reporting live from Barcelona all week to bring you the very latest from the show floor. Head to our dedicated MWC 2019 hub to see all the new releases, along with TechRadar's world-class analysis and buying advice about your next phone."
  ],
  "headers": {
    "2": "Samsung Galaxy A30 release date and price",
    "5": "Samsung Galaxy A30 design and display",
    "11": "Samsung Galaxy A30 camera",
    "15": "Samsung Galaxy A30 battery",
    "18": "Samsung Galaxy A30 specs and features",
    "21": "Early verdict"
  },
  "links": {
    "MWC 2019": "https://www.techradar.com/news/mwc-2019-what-to-expect-from-the-biggest-mobile-show-of-the-year",
    "Samsung Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "S10 Plus 5G": "https://www.techradar.com/reviews/samsung-galaxy-s10-5g-review",
    "Pixel XL": "https://www.techradar.com/reviews/google-pixel-xl-review"
  }
}