{
  "source": "https://www.techradar.com/reviews/wix-answers",
  "title": "Wix Answers review",
  "category": "computing",
  "updated": "2020-10-07T08:34:13Z",
  "author": "mark-pickavance",
  "summary": "Was free, not now",
  "verdict": "Wix Answers is a remarkably flexible solution design for those that want a highly branded solution that works across a selection of communication channels. But odd pricing and lack of maturity take some of the shine off this as an alternative to Freshdesk and Zoho Support.",
  "pros": [
    "Very powerful",
    "Easy to use",
    "Brandable"
  ],
  "cons": [
    "Odd pricing model",
    "Still evolving",
    "Lacks enterprise features"
  ],
  "article": [
    "Wix.com started life as a website building tool but evolved to become so much more.",
    "Under the banner of Wix Answers are five interconnected tools that provide a ticketing system, call center, a knowledge base, live chat and analytics modules called ‘Insights’.",
    "Combined these tools can deliver a powerful integrated solution that rivals the likes of Freshdesk and Zoho Desk in functionality.",
    "Let’s look at what makes this solution unique and how the Wix approach to this problem might attract customers.",
    "Defining what you get with Wix Answers isn’t easy, because depending on the licencing plan, its capabilities can vary massively.",
    "What everyone gets is a ticketing system where agents can handle support requests made via multiple channels and mechanisms.",
    "However, it was built from core technology developed for interactive web design, and that shows in places.",
    "What you don’t get with Wix Answers is features as sophisticated as Freshdesk. Though it could be argued that the simplicity of this solution is a strength, as agents can learn to use it rapidly.",
    "Another positive is that configuring a helpdesk solution involves creating a wide selection of interface elements for the various channels (web, Facebook, etc.), and designing these using a drag-and-drop interface is remarkably simple and effective.",
    "All the user-facing components can be easily branded to present a common theme, and the system automatically creates both standard web and mobile versions of the support contents and ticket creating forms.",
    "The downside of a template-based system is that it doesn’t support any technology that isn’t inherently included in the templates.",
    "Where this is much less of an issue is in respect of building a knowledge base, and Wix Answers has a solution can be used to construct FAQs, publish articles that users can search before asking for personal assistance.",
    "To help in the building of this resource, Wix Answers has a component that searches all existing tickets to create a list of commonly used words and phrases. This data can then be used to enhance the self-help solution, reducing the workload on agents.",
    "Another workload reducing feature is the ability to get other agents or support staff involved in solving a support request via collaboration. The system supports teams and allows teams to interact over a ticket, and managers can pool resources on a ticket when required.",
    "For those administrating the system, Wix Answers provides real-time performance data about agents, outstanding tickets, average response times, customer satisfaction and a host of other relevant metrics.",
    "There isn’t anything amazing in Wix Answers, but it does most of the things a good helpdesk must. What it mostly lacks is Enterprise-class functionality that Happyfox and others offer.",
    "As this product was built from a website designer, the interface is one that anyone who has used one of those tools would easily follow.",
    "What’s especially nice is that scattered through the interface are numerous articles and videos that take you through using specific features, like setting up the ticketing system.",
    "These are great for anyone entirely new to the system and helps get the system from fresh-out-of-the-box to a state where it can handle support requests quickly.",
    "There isn’t anything revolutionary about most of the parts, but the design is elegant and allows a business to develop a branded solution that looks very professional to those looking for support.",
    "A major plus of this solution is that it supports 11 of the most used languages, enabling it to be used in businesses that operate internationally.",
    "The security on Wix Answers isn’t anything special.",
    "Agents have a password for access, and users can either have that or use ‘Social authentication’ using one of the common sources for identity confirmations (Microsoft, Google, Facebook, etc.)",
    "You can define Single Sign-on (SSO) if you use an external service that you can direct the remote user to via a web page. Wix mentions SecureAuth SSO, OneLogin and SAASPASS on its website, but it might well work with others.",
    "That Wix don’t offer two-factor authentication as standard is disappointing, although it does encrypt account passwords, and store them independently of other account information.",
    "While the creators claim to be ‘100% committed to online safety’, there is clearly room for improvement on the admin and agent logins, but also the user security.",
    "A time existed not long ago when Wix Answers was free to those who used Wix.com web services, but that era has ended.",
    "If you don’t need all the functionality of Wix Answers, then you can buy the Knowledge Base, Ticketing System, Live Chat and Call Center separately, at $19, $11, $11 and $11 respectively. Or, you can have all of them for $30 for each agent per month.",
    "What this doesn’t include is phone call costs, if you use the Call Center technology.",
    "However, as you add agents or team members as Wix likes to call them, the costs changes in the way that you might expect.",
    "Up to five licenses and the cost goes down to an average $26 per head, but above that number of seats, it increases. And, when you reach 100 seats the cost a much less enticing $45.22 per person per month.",
    "These costs make Wix Answers reasonably priced for small teams, but should your business be successful and grow you get inexplicably penalised.",
    "We asked the Wix team for an explanation of this curious economics, and amazingly a representative replied that this wasn’t intended and promised to investigate it further.",
    "Hopefully, the price model will become more predictable soon.",
    "Cost aside, the only other aspect that customers need to be aware of is that this is a very new solution, and therefore still evolving.",
    "Some features still need a little work, and others might change as the software developers see opportunities for enhancements and efficiency gains.",
    "For those that like less dynamic platforms, it might be worth holding back until the Wix Answers cake has been baked a while longer.",
    "That said, we found very few bugs and never experienced any major crashes.",
    "The best aspects of this tool are how easy it is to use, and how the analytics side of the system can be configured to drive the solution to provide better support and enhance the customer experience.",
    "What you shouldn’t do is invest in Wix Answers with the mindset that using ‘Insights’ will be a second or third phase priority. It needs to be part of the project from the start so you can find out immediately where work on creating articles and handling specific types of support requests with rules and workflow.",
    "The potential here is significant, but it would only be of interest to a company that wants to be top tier in support standards and not those that have a help desk because customers expect it.",
    "Overall, there are lots of good things in Wix Answers for those wishing to hit the help desk road running, though it needs to have a cost model that more customers will better understand."
  ],
  "headers": {
    "4": "Features",
    "16": "Interface",
    "21": "Security",
    "26": "Plans and pricing",
    "34": "Final verdict"
  },
  "links": {
    "Wix.com": "https://www.techradar.com/reviews/wix",
    "Wix Answers": "https://www.wix.com/wixanswers/main",
    "ticketing system": "https://www.techradar.com/best/best-helpdesk-software",
    "Freshdesk": "https://www.techradar.com/reviews/freshdesk-crm-review",
    "helpdesk": "https://www.techradar.com/best/best-helpdesk-software"
  }
}