{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-a40",
  "title": "Hands on: Samsung Galaxy A40 review",
  "category": "phones",
  "updated": "2019-04-10T17:19:48Z",
  "author": "john-mccann",
  "summary": "The awkward middle child",
  "verdict": "Stuck in the middle with a whole lot of Galaxy A series handsets, the A40 may get lost in crowd. It's a solid, if simple smartphone which doesn't have anything to really shout about.",
  "pros": [
    "Sizable screen",
    "Headphone jack"
  ],
  "cons": [
    "Cheaper feel in the hand",
    "Cameras are so-so"
  ],
  "article": [
    "The Samsung Galaxy A40 sits bang in the middle of Samsung's revamped A series line-up, making it the most mid-range of the suite of seven mid-range handsets.",
    "Below it you'll find the Galaxy A30, A20 and A10, while above there are the more feature-filled Galaxy A50, Galaxy A70 and Galaxy A80.",
    "This immediately presents a potential problem for the Galaxy A40. Why plump for it when you can spend a little more on an A50 or A70? And if you're looking to save money, the A30 or A20 may be a better financial option.",
    "That said, the Samsung Galaxy A40 is a presentable smartphone in its own right, and the likelihood is you won't find all seven A series devices available in your region, hopefully making the decision a little easier for you.",
    "There's currently no word on a Samsung Galaxy A40 release date or price, but as soon as we know we'll update this article with all the details.",
    "Out of all of Samsung's new A series line-up, the Galaxy A40 is the easiest to hold in one hand as it's the shortest and narrowest of the bunch.",
    "It measures 144.3 x 69.0 x 7.9mm and we were easily able to hold and operate the phone in one hand during our time with it.",
    "The design looks relatively premium, but pick up the Galaxy A40 and the lightweight frame and cheaper feel reveals it's made up of a glass and plastic combo, rather than being an all-glass affair. Still, it looks smart and functional, and is available in three colors; blue, coral (pink) and white.",
    "Round the back you'll find a centralized and easy to reach fingerprint scanner, while the power and volume keys are on the right side of the A40. On the base you get a 3.5mm headphone jack, USB-C port and single speaker.",
    "The Samsung Galaxy A40 has a 5.9-inch Full HD+ (1080 x 2220) display with a Super AMOLED panel producing punchy, bright visuals.",
    "There's a small, camera-sized notch in the middle of the screen, at the top which Samsung calls its Infinity-U display and it's unlikely to get in your way.",
    "The Samsung Galaxy A40 comes equipped with two rear cameras, a main 16MP (f/1.7) sensor and a 5MP (f/2.2) depth sensor for blurring backgrounds for a fancy portrait effect.",
    "Meanwhile, on the front there's a single 25MP (f/2.0) snapper to quench your selfie thirst.",
    "We had a brief play around with the Galaxy A40 cameras and while the app is easy to use and the photo quality is passable, it's not the quickest camera and unlikely to offer up anything too special. We'll find out more during our in-depth review.",
    "Under the hood there's a 3,100mAh battery with 15W fast charging capabilities and that's joined by a 1.8GHz octa-core chipset and 4GB of RAM. That's enough power to keep Android 9 ticking along without hassle, and it comes with Samsung's One UI interface laid over the top.",
    "You get 64GB of storage as well, plus the option to expand on that by up to 512GB with a microSD card (sold separately).",
    "The Samsung Galaxy A40 doesn't offer anything to particularly excite or catch the eye, but it does offer a solid, albeit fairly simple mid-range smartphone experience."
  ],
  "headers": {
    "4": "Samsung Galaxy A40 release date and price",
    "5": "Design and display",
    "11": "Camera, battery and specs",
    "16": "Early verdict"
  },
  "links": {
    "Galaxy A30": "https://www.techradar.com/reviews/samsung-galaxy-a30",
    "Galaxy A50": "https://www.techradar.com/reviews/samsung-galaxy-a50-india",
    "Galaxy A70": "https://www.techradar.com/reviews/samsung-galaxy-a70-hands-on",
    "Galaxy A80": "https://www.techradar.com/reviews/samsung-galaxy-a80-review"
  }
}