{
  "source": "https://www.techradar.com/reviews/1more-stylish-true-wireless",
  "title": "1MORE Stylish True Wireless review",
  "category": "audio-visual",
  "updated": "2019-06-03T23:03:16Z",
  "author": "lewis-leong",
  "summary": "Good-sounding headphones with a few too many quirks",
  "verdict": "The 1MORE Stylish True Wireless follow the company’s path of affordable sound quality but their quirks make them hard to recommend. Beyond the cheap-feeling plastic build, the headphones fail to consistently turn on when taken out of the case and have below average noise isolation. This makes for a frustrating user experience, which is a shame because the headphones sound great.",
  "pros": [
    "Balanced sound",
    "Good battery life",
    "Earbuds work independently"
  ],
  "cons": [
    "Headphones fail to turn on",
    "Below-average noise isolation",
    "Cheap build"
  ],
  "article": [
    "On paper, the 1MORE Stylish True Wireless have everything going for them: They offer 6.5 hours of battery life per charge and the charging case nets the headphones 24 hours of total play time. Other impressive specs include Bluetooth 5.0, independent earbud pairing, and aptX and AAC codec support.",
    "And yet, while we liked the sound quality of the 1MORE Stylish True Wireless, its frustrating user experience keeps us from recommending them.",
    "In use, they constantly frustrated with connection issues. Taking the earbuds out of the case would sometimes result in only one earbud turning on, requiring a manual press-and-hold of the power button to bring the other earbud to life. We were also frustrated with the earphone’s fit which required experimenting with every included tip and “wing” to find a fit that worked.",
    "That's a shame, because it's these small issues that keep the good-sounding Stytlish True Wireless from earning a top spot as one of the best true wireless earbuds. Here's what it's like to use them.",
    "The 1MORE Stylish True Wireless headphones are made entirely of plastic... which has its pros and cons. On one hand, their all-plastic build makes them feel cheap. But, on the other, the plastic build makes the earbuds are extremely light and comfortable in the ear once you find the correct fit, though, as we said, it took us trying many different combinations of eartips and wings to find a fit that worked.",
    "Each earbud is shaped like a smooth pebble and feature a single LED and multi-function button. The single physical button makes controlling music playback easy but you can’t control volume with the headphones alone, which is a shame.",
    "The earbuds feature 1MORE’s own take on “wings,” which they call “O-hooks.” These additional bits of silicone help keep the earphones stable in the ear and are useful for finding a tight seal. 1MORE ships the headphones with four pairs of eartips for you to choose from. We found that getting a good seal is required for any bass response so it’s a good idea to experiment with them all.",
    "The charging case of the 1MORE Stylish True Wireless is extremely compact and gives an impressive 24 hours of total playtime - though, we were disappointed to find the microUSB charging port in the back instead of USB-C. The latter would have likely driven up a price, but it makes things more convenient now that most phones use USB-C for charging. We were also disappointed that there’s no way to check on the battery life of the charging case without having the earbuds docked. Flipping open the spring-loaded case does not wake the charge-status LED.",
    "If you can get a good seal, the 1MORE Stylish True Wireless sound excellent.",
    "With a good seal, the headphone’s noise floor is near-silent, meaning there’s no audible hiss when no music is playing. Highs extend without any harshness, bass is tight and punchy without being overbearing. Mids are slightly recessed but feature a nice amount of resolution. Soundstage is good for an in-ear but aren’t spectacular.",
    "Unfortunately, though, we struggled to find a good seal with these headphones and it wasn’t until we found that right fit that there was any bass response. And, worse, even with a good seal, the noise isolation is below-average, letting in more external sound in than we would have liked.",
    "In terms of wireless performance, we were frustrated with some audio drop outs in a busy urban environment. The headphones would stutter when walking around downtown but never stuttered in-doors where there’s less wireless interference. That doesn't mean indoor playback is flawless, however - in terms of latency when watching video, there’s a very slight delay but only if you really look for it.",
    "Battery life is rated for 6.5 hours per charge but in our testing, we found the number closer to 5 when listening at 50% volume. That’s still very good and we never had to worry about depleting the charging case throughout the week since it’s good for an additional three charges. For comparison, the Sol Republic Amps Air 2.0 feature a ridiculous 45-hours of total playback time but its case is twice as large.",
    "For its first pair of true wireless headphones, the 1MORE Stylish True Wireless are a good first attempt for 1MORE and likely won't be its last.",
    "Buoyed by their $100 (about £80, AU$145) price point, these headphones are a good deal if you use them mainly in-doors and don't mind working a bit harder than you should to find the right fit. If that doesn't sound appealing, however, you’re better off going with the slightly more expensive Sol Republic Amps Air 2.0 for its reliable connection and better build quality. Just be aware that the Amps Air 2.0 have highly boosted bass, which is fun but not accurate to the source material. The Samsung Galaxy Buds are also a good alternative at this price range."
  ],
  "headers": {
    "4": "Design",
    "8": "Performance",
    "13": "Verdict"
  },
  "links": {
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sol Republic Amps Air 2.0": "https://www.techradar.com/reviews/sol-republic-amps-air-20",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds"
  }
}