{
  "source": "https://www.techradar.com/reviews/canon-rf-85mm-f12l-usm",
  "title": "Canon RF 85mm f/1.2L USM review",
  "category": "cameras",
  "updated": "2019-07-24T14:00:51Z",
  "author": "matt-golowczynski",
  "summary": "It costs a bomb, but boy does this lens deliver",
  "verdict": "It might have a humungous size to match its lofty price tag, but its clear that the Canon RF 85mm f/1.2L USM has been designed to the highest standards of operation and performance. While far from practical for everyday use, this is a seriously impressive addition to the RF line.",
  "pros": [
    "Excellent sharpness, even at f/1.2",
    "Superb chromatic aberration control",
    "Very pleasing out-of-focus areas",
    "Surprisingly swift AF considering its size"
  ],
  "cons": [
    "Very large and heavy, even on the EOS R",
    "Expensive (but not unexpectedly so)",
    "Some vignetting at widest apertures"
  ],
  "article": [
    "With the EOS R and EOS RP now settled in Canon's latest EOS R mirrorless system, the focus is turning to the optics that can do these new models justice.",
    "The RF 85mm f/1.2L USM belongs to the second wave of RF lenses for Canon's newest system, having been announced alongside five others earlier this year.",
    "It joins the four lenses that are already available, from the compact RF 35mm f/1.8 IS Macro STM through to the beastly RF 28-70mm f/2L USM Lens, and its focal length and maximum aperture make it the most portrait-friendly lens we've had yet for the system. That aperture, together with the L-series designation and its somewhat painful price tag means expectations are high. So does it deliver?",
    "The Canon RF 85mm f/1.2L USM is designed with 13 elements spread across nine groups, with a single ultra-low-dispersion element and an aspherical one to control aberrations and general image quality.",
    "Air Sphere Coatings have also been used to keep contrast high and minimize reflections (and thus reduce flare and ghosting), which is said to be particularly useful in backlit conditions.",
    "This is also only the second lens to feature a Blue Spectrum Refractive Optics element, following the very well-regarded EF 35mm f/1.4L II USM back in 2015, and Canon says this is used to \"nearly eliminate\" chromatic aberration and fringing.",
    "Focusing is taken care of by a ring-type USM motor, which works with a high-speed CPU to deliver fast performance and near-silent operation, and is internal, which keeps the length of the barrel constant at all times.",
    "You can also focus manually using a large ring positioned in the middle of the barrel, while full-time manual focus override – where autofocus can be overridden by manual focus without switching between the two modes – is also supported.",
    "The Canon RF 85mm f/1.2L USM is a large and hefty lens, particularly when you consider that it's a prime lens rather than a zoom. That's due in large part to its maximum f/1.2 aperture – letting a lot of light in and keeping image quality high requires some serious glass – but the fact that it's even larger and heavier than the EF 85mm f/1.2L II USM points to a more modern optical design.",
    "While imposing, the barrel is fairly minimal in its styling. There are just two small switches, one for alternating between manual focus and autofocus, and another to restrict the focus range down to a range of 1.5m to infinity, and both are fairly flush with the casing and move easily.",
    "The only other controls are the manual focus and control rings, and the latter can be customized to access one of four functions: aperture, shutter speed, exposure compensation or ISO. The control ring has a knurled design and is clickable, so that each click corresponds to a change in value; it moves easily, and the feedback from the clickable design lets you know exactly what's going on.",
    "The RF 85mm f/1.2L USM certainly feels well put together, with further reassurance provided by the weather-resistant construction. The matte casing attracts the odd scrape more so than the casings used on equivalent L-series EF lenses, although these can easily be rubbed away.",
    "Its weight makes it very front-heavy, and some may wonder how safe this is on the EOS R or EOS RP body, although the metal mount fits solidly onto the body, and we had no issues with any play during our testing.",
    "What's more problematic is just how awkward this lens is to cary around. It's too wide to be gripped by the barrel, and overwhelms the camera when this is held by its grip. Furthermore, the fact that it causes the host camera to tilt downwards when it's hung around the neck means the camera's base plate ends up digging into your stomach – this is definitely a lens that's more at home in the studio than being used outdoors without a tripod.",
    "We don't expect blisteringly quick focus on lenses this heavy, although things aren't quite as tardy as one might imagine. In fact, in good light the RF 85mm f/1.2L USM does a great job to focus between its extremes without too much of a slowdown, and performance remains strong when lighting conditions are less than ideal.",
    "Focusing is, however, quite audible – not to the point where it's an issue if you're trying to shoot discreetly, but certainly loud enough to be picked up when recording video. That said, this isn't a lens that's designed with video recording as its first focus, and if you're using manual focus – as many will no doubt do – it won't be an issue.",
    "If you're paying this kind of money for a lens, and you're prepared to lug it around, then its performance at its widest aperture ought to be worth it – and it is. Sharpness at f/1.2 is already excellent, right to the corners of the frame.",
    "Depth of field is, of course, incredibly shallow here, but as long as you're precise with your focusing you're likely to be very pleased with both what's in focus and the way this falls off to defocused areas.",
    "Not surprisingly this means diffraction can be seen a little earlier in the aperture range than usual, but then the likelihood of such a lens being used at f/9 and above is far slimmer than on other lenses.",
    "Fast prime lenses such as the RF 85mm F1.2L USM can be troubled by longitudinal chromatic aberration, which shows as colored fringing on either side of the point of focus, but the RF 85mm F1.2L USM is refreshingly free of this, even at f/1.2.",
    "There is a slight but noticeable amount of vignetting at f/1.2, but this improves markedly by f/1.4, and even more so at f/1.6. By f/1.8 it's really no longer an issue, although it does have the effect of mis-shaping bokeh a touch at the peripheries.",
    "As with all other RF lenses right now, the highest-resolution body we have right now on which to test the RF 85mm F1.2L USM is the EOS R, which houses a 30MP sensor. That's obviously less demanding than the 42/45MP-plus sensors found in other lines, so quite how its performance stacks up on a higher-resolution body remains to be seen.",
    "The Canon RF 85mm f/1.2L USM will take a good chunk of your cash and give you a good workout, but if you're willing to accept that then you'll be rewarded with glorious performance from this lens.",
    "Knowing that you can use it wide open and get superb sharpness – either across the whole frame when you need it, or with beautifully smooth out-of-focus areas when you don't – is very encouraging. Bokeh has a lovely smooth texture and is free from chromatic aberrations, and just slightly cat's-eye shaped at the peripheries wide open, which is fairly common.",
    "Control over key aberrations such as longitudinal chromatic aberrations is also mighty impressive; distortion and lateral chromatic aberrations aren't really concern with a lens like this, and neither is an issue here. Possibly the only issue here is a touch of vignetting at the widest few apertures, but then this isn't exactly undesirable for portraiture, and is easily removed in-camera when it's not wanted.",
    "This won't be a lens for everyone, and few will be able to afford it (or at least justify its purchase), but it's somewhat refreshing that the RF 85mm F1.2L USM is so unashamedly big and bold, and capable of delivering stellar results with minimal intervention. If this is a sign of where the L-series selection of RF lenses is heading, we're in for a treat."
  ],
  "headers": {
    "3": "Features",
    "8": "Build and handling",
    "14": "Performance",
    "22": "Verdict"
  },
  "links": {
    "EOS R": "https://www.techradar.com/reviews/canon-eos-r-review",
    "EOS RP": "https://www.techradar.com/reviews/canon-eos-rp-review",
    "five others": "https://www.techradar.com/news/canon-confirms-six-further-rf-mount-lenses-are-in-the-works",
    "RF 35mm f/1.8 IS Macro STM": "https://www.techradar.com/reviews/canon-rf-35mm-f18-is-macro-stm-review",
    "higher-resolution body": "https://www.techradar.com/news/canon-63mp-full-frame-sensor-will-this-feature-in-the-next-eos-body"
  }
}