{
  "source": "https://www.techradar.com/reviews/nad-masters-series-m10-stereo-system",
  "title": "NAD Masters Series M10 stereo system review",
  "category": "audio-visual",
  "updated": "2019-05-14T15:55:38Z",
  "author": "simon-lucas",
  "summary": "Is the all-in-one M10 a player for everyone?",
  "verdict": "The NAD Masters Series M10 combines convenience and performance in an elegant package.",
  "pros": [
    "Detailed sound",
    "32bit/384kHz DAC",
    "Great build and finish"
  ],
  "cons": [
    "Struggles with low-res files",
    "Occasional app issues"
  ],
  "article": [
    "There was a time when hi-fi made a virtue of complexity. If a system wasn’t made up of multiple components and a lavish amount of wiring, well... it just wasn’t proper hi-fi, was it? Those days, thankfully, are gone – and the latest product in NAD’s Masters Series, the M10 stereo system, is a testament to how far we’ve come.",
    "There’s no merit to making products that are difficult to use, a pain in the neck to maintain or ruin our otherwise-delightful interior decor: give us performance and convenience, or get out of our sight.",
    "Today’s market leading products are sure to combine performance and convenience in a manner unlike the traditional hi-fi we started out with – even if, at $2499 (£2,199 / AU$3,999) the M10 needs quite an investment to do so.",
    "So it is with the Masters Series M10, which manages to make an all-in-one stereo system look like the simplest thing in the world.",
    "The M10 may be nicely compact at just 10 x 22 x 26cm, but it looks and feels like a premium product – as it should, given the premium pricing.",
    "The subtly brushed aluminium chassis, which is gently curved at the corners, is of a single piece. The top panel and display screen as covered with expensive, high-performance Gorilla glass. As far as creating a strong visual impression and offering a bit of unexpected tactility too, the NAD is right on the money.",
    "Better still is the big, bright, high-resolution TFT touchscreen display. The display is customisable, so you can name inputs as you please, tag them with visual icons, and show off album artwork in a big way during listening sessions. Not to mention the virtual VR meters, which offer a pleasing throwback to the flickering volume displays of old.",
    "It’s easy to get carried away when designing something as self-consciously lifestyle-orientated as the M10, but NAD has confidently walked the thin line between ‘sophisticated’ and ‘dull’. The M10 is quite obviously a high-spec, high-price product, but it doesn’t make a song and dance about it.",
    "So can there possibly be room inside such a discreet box for all the hi-fi functionality the discerning customer craves? Well, the NAD M10 may not be the answer to every single one of your home entertainment desires, but it’s had a pretty good stab at covering most of them.",
    "In terms of attaching sources to the M10, you’ve plenty of options. Ethernet and wi-fi connectivity is available, naturally, and in addition there’s digital coaxial, digital optical, an eARC HDMI input, two analogue stereo RCA connections and aptX HD Bluetooth for good measure. Bluetooth pairing is available via NFC and, as the M10 acts as both receiver and transmitter, it’s ready to pair with wireless headphones – just as well, seeing as there’s no physical headphone output.",
    "There are, however, outputs for loudspeakers as well as pre-outs for use with a power amplifier, and not one but two pre-outs for use with additional subwoofers – in case you love bass enough to really risk ruining your relationship with your neighbours. Connections for 12v triggers and IR relays are also available should you wish your M10 to become part of a wider custom-install system.",
    "This generous selection of inputs all lead to 100 watts of NAD’s ‘Hypex nCore’ amplification, which should be ample to drive even truculent loudspeakers. ‘Hypex nCore’ is an unnecessarily complicated way of describing NAD’s take on Class D amplification – the idea being it provides all the Class D advantages of efficiency with none of the noise or distortion drawbacks. It’s certainly proved effective in the NAD Masters Series products it’s appeared in before now.",
    "The digital inputs are served by an over-specified ESS Sabre 9028 DAC. This 32bit/384kHz monster puts hi-res audio firmly on the menu via DSD, FLAC, MQA or any other file variety you may favour. As far as DACs for domestic use go, it’s as low-noise, low-jitter and thoroughly accurate a device as you’ll come across.",
    "Controlling the M10 can be done using that big touchscreen display – it’s fast and responsive. But if poking at your hi-fi isn’t what you want from 21st century home entertainment, you may prefer to use the BluOS control app (iOS and Android).",
    "The BluOS app bundles in Spotify, Amazon Music, Tidal and Deezer streaming functionality as well as internet radio (Radio Paradise, Tuneln, and the like) and a host of lesser-known services inside the app. With BluOS running on any number of well-received Bluesound and DALI products, too, the wider world of multiroom functionality is within the M10’s grasp too.",
    "The BluOS app has a clean interface and is straightforward to use, but isn’t 100% reliable. The app can freeze when switching between one of the physical inputs and a streaming service – very occasionally, but still more than we’d like.",
    "There’s also the option to control the NAD using Amazon Alexa via the BluOS skill in the Alexa app. And if Siri is not available by the time you read this, it very soon will be.",
    "The NAD M10 comes complete with Dirac Live room correction technology. Using the bundled mic and yet another almost-entirely-reliable app, Dirac Live will analyse your room and speakers to optimise the M10’s performance. It’s a proven system and it works pretty well.",
    "So your room’s been corrected and you’ve added your Tidal account to the BluOS app. As everyone knows, Tidal Masters (which is MQA-based) is the world’s best-sounding streaming service, so what better place to start?",
    "Turn the Light (Karen O and Danger Mouse) shows exactly what the NAD is capable of. The simmering, low-temperature recording sounds spacious, detailed and completely natural. The management of rhythm and tempo has the sort of effortless accuracy that’s the hallmark of a thoroughly capable device.",
    "The fluid bass guitar underpins the tune with real authority, giving the classic disco tempo weight and agility. The voice in the midrange is loaded with character, the tiny details of tongue and teeth meaning the M10 paints a complete vocal picture, while at the top end the percussive sounds shine without sounding harsh or overstated.",
    "The whole of the frequency range is confidently integrated, meaning there’s a genuine sense of unity to the recording. This sense of timing is by no means a hi-fi given, no matter how much money you part with, but the NAD sounds assured.",
    "A switch to the perky orchestral grind of Saint-Saens’ Suite in D Minor: Tarantelle (as a 24bit/96kHz download) gives the M10 the chance to show off its dynamic prowess as well as its ability to organise a soundstage. There’s proper coherence to the way the NAD lays out a stereo image, making the position of each player in the orchestra relative to his or her colleagues quite explicit. And it puts meaningful distance between the quiet, tension-filled moments of a piece and the all-out climactic assault.",
    "It’s a similarly full-figured, well-organised and generously detailed story when trading downwards (in file-quality terms) to a CD of Mild High Club’s Timeline, or listening to a vinyl copy (via a Leema phono stage) of Four Tops’ Greatest Hits. The M10 paints a broad and believable picture, letting the music speak for itself without sticking its oar in too noticeably.",
    "Perhaps its only meaningful shortcoming concerns the levels of attack and drive it’s able – or unable – to muster. Nobody wants to hear a song as controlled and calculated as the Danger Mouse/Karen O collaboration prodded forward against its will. But some music needs – in fact, demands – to be shown the whip.",
    "Giving full rein to Sonic Youth’s 100% (via Tidal Masters) is pretty much essential, but the NAD seems a little reticent. It’s reluctant to properly sink its teeth into the tune, which is a scuzzy amalgam of overdriven bass, further-overdriven guitar and what sounds like Mike Tyson on drums – and the result is a sound that’s a little too polite for its own good.",
    "For any number of prospective customers, of course, erring on the side of caution is never a bad thing: nobody wants a system that’s constantly got its eyes out on stalks. But some music thrives on the dirt beneath its fingernails, and when push comes to shove the M10 is just a little tentative.",
    "The pluses outweigh the minuses in quite a big way here. It’s expensive, sure, but the NAD M10 is a beautifully made, extensively specified all-in-one stereo system (with a hint of home cinema functionality thrown in) with about as much future-proofing as anyone without a foolproof crystal ball can realistically provide.",
    "The M10 is almost as lovely to look at as it is to listen to, and as long as your music tastes don’t center exclusively around amphetamine-crazed thrashers, it’s a grown-up and talented listen. As long as you can budget for the speakers to do it some justice, there’s really no reason not to consider the M10 for your home stereo system."
  ],
  "headers": {
    "4": "Design and features",
    "17": "Performance",
    "27": "Final verdict"
  },
  "links": {
    "stereo system": "https://www.techradar.com/news/best-stereo-speakers",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Tidal Masters": "https://www.techradar.com/news/tidals-hi-res-mqa-music-library-crosses-the-1-million-mark"
  }
}