{
  "source": "https://www.techradar.com/reviews/benq-designvue-pd2720u",
  "title": "BenQ DesignVue PD2720U professional monitor review",
  "category": "computing",
  "updated": "2020-08-03T13:48:20.397Z",
  "author": "jim-hill",
  "summary": "A premium 4K panel for the discerning designer",
  "verdict": "This costly 4K monitor has the performance and colour gamut to satisfy designers and enough features to impress everyone else.",
  "pros": [
    "Understated design",
    "Smooth steel stand",
    "Strong colour accuracy",
    "Twin Thunderbolt 3 ports"
  ],
  "cons": [
    "Not slim, or curved",
    "Weak speakers",
    "Only 60Hz refresh rate",
    "Irksome button placement"
  ],
  "article": [
    "Of BenQ’s broad range of monitors the DesignVue PD series concentrates on colour accuracy and other features that designers using CAD/CAM and Photoshop rely on. That tends to include 4K resolution and naturally, this top-of-the-line IPS panel is native UHD, but it also has an elegant design and enough features to attract more than just designers and photographers.",
    "With two Thunderbolt 3 ports, it is especially easy to hook up a laptop and daisy chain a second screen and the steel puck that comes with it allows you to toggle seamlessly between sources, or between sRGB and Display P3 settings.",
    "With HDR10 built into the spec, this monitor is also well disposed to showing UHD Blu-ray content, or indeed adding the HDR effect to video that you are editing. And while 60Hz isn’t the fastest refresh rate, it could be enough to lure gamers looking to play medium-paced 4K games with HDR.",
    "It’s also hard not to be impressed by the elegant solid steel stand that allows the screen to glide up and down by 15cm or tilt 180-dgrees into portrait mode. Designers aren’t the only ones who demand a monitor that looks as good when it is switched off, so we think this monitor is going to have a very wide appeal.",
    "At around $1,100 in the US, £879 in the UK and AU$1,639 in Australia the PD2720U can be considered a premium product for professional designers and photographers.",
    "If you don’t need such accurate colour calibration and think you can live without the slick stand and such a wide array of ports, you can save a lot of money by choosing the the no-nonsense BenQ PD2700U, which uses the same size 4K IPS panel but costs only $535 in the US, £430 in the UK and AU$849 in Australia. The big catch there is the cheaper model’s complete lack of USB-C ports. The LG 27UK600 is another 4K IPS option that costs less again, though its specifications are compromised in all areas except screen resolution.",
    "The PD2720U looks a cut above your average desk monitor thanks to its smart tubular steel stand and a paint job that looks very close to Apple’s space grey. The 27-inch 16:9 screen suffers almost zero bezel on three of its sides, with just a 1cm lip running below the display. In profile, it looks rather wide and certainly doesn’t look as stylish as an OLED panel from this angle. The power cord and other cables can be run through a loop on the back of the stand to keep them out the way, while a removable plastic panel at the rear hides an impressive array of inputs.",
    "The inputs include a DisplayPort 1.4, a USB 3.1 upstream, two USB 3.1 downstreams, two HDMI ports and two Thunderbolt 3 ports. It’s these last two connections that make this monitor so convenient and potentially, so neat to install. All the cables are included in the box too.",
    "The on/off button and other controls are located, somewhat awkwardly, on the rear panel. However, you also get a Hotkey Puck G2 in the box and this cabled controller allows you to adjust screen settings and inputs without having to fumble blindly behind the screen. It’s actually a rather nicely weighted device that turns and clicks and offers four programmable hard buttons.",
    "As you might expect of a range-topping model, the PD2720U has a long list of features and copetitive specifications. The 4K IPS panel is 3840 x 2160 resolution with HDR10 support. The brightness is 400 nits and the refresh rate is 600Hz, which is all pretty good. More impressive is the high colour gamut, which supports 10-bit colour depth, displaying 1.07 billion colours and supporting 96% DCI-P3, or 100% sRGB coverage. The panel is certified by both CalMAN and Pantone and you even get a certificate showing the calibration results for each individual monitor in the box, providing designers with the kind of accuracy they require when it comes to colour consistency.",
    "BenQ has built in three preset modes that will interest designers too. CAD/CAM mode, Darkroom Mode and Animation Mode recalibrate the screen to suit those specific tasks. You can access these and all other settings quite easily using the Hotkey Puck G2 controller. The screen also comes with flicker-free and Low Blue Light technologies which together reduce eye strain.",
    "When it comes to connectivity, BenQ has been generous, including every kind of input with a special mention going to the two Thunderbolt 3 ports. Their high speed transmission of data and power makes it especially easy to connect and charge a laptop with one slim cable and also to daisy chain a second monitor.",
    "Right from this box, our test panel looked crisp and bright with a natural colour palette. Having been certified by both CalMAN and Pantone and seen the individual calibration report supplied in the box, we expected nothing less. Just one thin Thunderbolt 3 cable is all you need to connect a laptop and admire your familiar desktop on a vivid 27-inch screen. The cable is provided, though be warned, at 50cm it is rather short.",
    "Photoshop is just one program that highlights the advantage of working on a UHD screen with such accurate colour consistency. You can really get lost in the detail of the document that you’re working on and checking the colour spacing is as simple as switching between sRGB and Display P3 using the puck controller. Users of CAD/CAM will be interested in the dedicated mode that enhances the screen settings to suit that program.",
    "Using a UHD Blu-Ray as a source of 4K video, the PD2720U really shows off its HDR10 skills which make full use of the panel’s 400 NIT brightness to make the colours stand out. For watching movies, the advantages of 4K over 1080p are somewhat lost on such a small screen, however, when you’re sitting right in front of it, the four-fold boost in pixel density is appreciable. It’s also worth noting that the inbuilt stereo speakers are rather small and too feeble to fill a room with convincing sound.",
    "Hard nosed video gamers might find that the refresh rate is a little slow and there are no features dedicated to gaming here. Having said that, 4K games are flattered by the native 4K resolution and HDR treatment. We found that Shadow of the Tomb Raider on Xbox One looked particularly vibrant.",
    "This handsome, high-spec monitor is perfect for designers and photographers who rely on the constancy and accuracy of their monitor. The high resolution, contrast and brightness make it easier to work on your project, secure in the knowledge that you’re seeing industry standard colours. But with its slick steel stand and input flexibility, the PD2720U’s appeal is much wider. The two Thunderbolt 3 ports in particular make the PD2720U a very easy upgrade that would benefit almost any workstation."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design and build",
    "9": "Features and specifications",
    "12": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "BenQ PD2700U": "https://www.techradar.com/reviews/benq-pd2700u"
  }
}