{
  "source": "https://www.techradar.com/reviews/sekiro-shadows-die-twice",
  "title": "Sekiro: Shadows Die Twice review",
  "category": "gaming",
  "updated": "2019-11-27T17:08:16Z",
  "author": "vic-hood",
  "summary": "Spoiler: it’s bloody hard",
  "verdict": "FromSoftware's latest offering is more punishing than we've seen before, but rare moments of success are extremely rewarding . Set against a background that balances brutality and beauty, Sekiro is one of this year's must-have titles – if you have the patience for it.",
  "pros": [
    "More punishing than ever",
    "Shinobi Deathblows are satisfying",
    "Balances brutality with beauty",
    "Combat is smooth and rewarding"
  ],
  "cons": [
    "...Yep, more punishing than ever",
    "Not for those without patience",
    "Accept you may never finish it"
  ],
  "article": [
    "There has never been a game that fills me with such uncontrollable rage as FromSoftware’s Sekiro: Shadows Die Twice. Never has a game made me utter such profanities, cry in pure frustration and yet still come back for more. There’s this undeniable magnetic pull that sees me returning time and time again to this punishing hellscape, determined to beat the boss that has wiped the floor with me more times than I care to mention – and it’s hard to put our finger on it.",
    "There’s a formula we’ve come to expect from FromSoftware titles, we’ve seen it time and time again with each addition to the legendary Souls series and the gothic masterpiece that was Bloodborne.",
    "It’s a formula which the studio has seen little need to alter, flawlessly gliding from the inky, medieval kingdom of Lordran to the twisted streets of Yharnam, as each entry bottles our primal, masochistic passion for pain in a fever dream setting, while leaving us begging for one more run.",
    "Personally, the appeal has always been something I struggle to understand. Why in the name of Odin would someone put themselves through this voluntarily? Who enjoys it? Stuck on another particularly tough boss, I vented my frustrations to my friend – a diehard Souls series fan.",
    "“I don’t play FromSoftware titles for fun,” he laughed. “I play to be completely immersed in the challenge and the world.”",
    "And that is the secret: Sekiro: Shadows Die Twice isn’t fun, it’s a challenge. It’s eating 100 hot wings covered in ghost pepper sauce to prove you like spice, running a 10K in a panda suit because “who needs to train for a marathon anyway”, or running your friend off the road in go-karting to win a plastic first-place cup. The only person you’re challenging is yourself and it’s an addictive competition.",
    "So before you step into Sekiro: Shadows Die Twice, or this review, we advice leaving your patience at the door and get ready to die... a lot.",
    "Sekiro: Shadows Die Twice follows the journey of a Shinobi during Japan’s war-ravaged Sengoku period.",
    "Left for dead by a samurai commander, who cuts off his arm and kidnaps his boy master, the Shinobi – known only as Sekiro (“one-armed wolf”) – is rescued by a peculiar sculptor who creates a prosthetic arm for him.",
    "Fueled by loyalty to his Divine Heir master, the Shinobi sets out to save his lord from Ashina castle and wreak vengeance on those who left him for dead – and it’s going to be bloody.",
    "It’s here that you truly begin your journey, in the dilapidated temple that serves as your home base. The temple serves as a perfect introduction to the unsettling and curious characters that inhabit the world of Sekiro.",
    "Firstly we have the sculptor who saved you, an abnormally hairy-legged elderly man who sits contorted on the floor of the temple, carving wooden statues of Buddha. His job is not merely to unnerve you, but to upgrade your prosthetic arm.",
    "The Shinobi prosthetic initially comes with just the grappling hook ability, which allows you to transverse to higher ground and move seamlessly through the mountainous regions populated by ancient trees and temples.",
    "This also provides excellent diversity when it comes to combat strategy, but we will come back to that later. As you progress, you will find (or purchase) upgrades such as the Shuriken Wheel which, when brought to the hairy mentor, becomes a Spinning Shuriken add-on for your prosthetic.",
    "While you can find these upgrades scattered throughout the world, they can only be added to your prosthetic by the sculptor.",
    "Sculptor’s statues, which serve as save and rest points, allow you to fast travel back to the sculptor quickly as well as between the statues you have already prayed at – however, much like the Souls series, resting will cause some defeated enemies to return.",
    "If you wish to test these new abilities, then it’s beneficial to pay a visit to the unkillable samurai who resides in the temple – imagine Mortal Kombat’s Raiden has crawled his way out of the grave.",
    "While it’s perhaps an annoyance for him to be immortal, it serves you well in that he is the perfect trainer, allowing you to practise blocking, attacks and other combat without any moral dilemma. He proves particularly helpful as the game’s difficulty ramps up, and you find yourself wanting to practise parrying or new moves/upgrades you have unlocked. It’s a great way to work on your timing – especially if you struggle like myself.",
    "The final resident of the temple is the physician, who can improve the efficiency of your healing gourds if you bring her gourd seeds. She also proves useful in finding a cure for Dragonrot – the frustrating disease which causes NPCs to wheeze uncontrollably (and halts their questlines) and lowers your chance of Unseen Aid (which we will come back to later).",
    "As expected from FromSoftware titles, you are given little to no direction about where to go or what to do. However the game remains fairly linear until about mid-way through, opening up after this point and allowing you to essentially wander at your leisure and take on segments as and when you see fit.",
    "This is a great way to ease players in – particularly if you aren’t a Souls or Bloodborne veteran – and especially as a way to get to grips with Sekiro’s combat mechanics. It also means that when you are presented with a particularly tough boss, you can follow another path for a bit, level up further, and then come back when you feel you’re better equipped (and less frustrated).",
    "As previously mentioned, your Shinobi Prosthetic serves as a reliable weapon and tool, however your Kusabimaru katana is your staple and this becomes extremely evident in one-on-one combat.",
    "If you weren’t a fan of parrying in previous FromSoftware titles, then you are in for disappointment. Sword combat in Sekiro is heavily reliant on parrying, in order to knock your enemy off their posture and leaving them open for you to unleash the fatal Shinobi Deathblow.",
    "While at the beginning this seems relatively easy, with enemy’s strikes being easily blockable and predictable, the difficulty comes later as their speed increases and unblockable attacks begin to make an appearance. While you can unlock particular abilities to counter certain unblockable attacks, most of your success is reliant on patience, timing and dodging.",
    "Each of these particular attacks require a specific response such diving when a thrust attack comes your way; it seems fairly straight-forward until you’re in a blur of combat, trying to remember which response you need for each attack.",
    "Even grunt enemies can prove fatal if they manage to knock you off posture, exposing your squishy middle and proceeding to flurry attack you to hell. It’s rare that running in and frenzy-attacking enemies will actually end in your favor - trust me.",
    "However, when you actually get to grips with the flow and timing of Sekiro’s swordplay then it’s extremely rewarding. The combat feels smooth and authentic, but getting into this flow can be difficult to achieve in the first place – one wrong move can be your downfall.",
    "Seeing a red circle appear on your enemy after a blade dance of parrying and swift strikes, and landing that final devastating Deathblow is an incredibly satisfying (but extremely bloody) experience. It feels like you worked for the kill. It’s particularly satisfying when you’re been dancing with a boss for hours and finally land that killing blow. It’s an incredible buzz – though maybe not for everyone.",
    "It's important to note that not all Sekiro’s combat has to be so full-on. Stealth is a large part of the game, with opportunities for distraction, ambush and avoidance all playing a role.",
    "On occasion Sekiro can eavesdrop on enemies, picking up hints and information on the best way to approach a situation. Maybe there’s a hidden entrance somewhere that will allow you to sneak into an area undetected?",
    "But the true heart of ambushes is your prosthetic. While your grappling hook allows you to reach higher ground, identify new routes of attack and get the drop on your enemies, prosthetic upgrades such as firecrackers allow for distraction techniques.",
    "The Shinobi Prosthetic is truly a dynamic piece of gear, with each upgrade allowing for a shift in combat style.",
    "While the add-ons for your prosthetic are picked up and fitted by the sculptor, these are then upgraded in the skill tree using skill points. As you kill more enemies, you gain skill experience which then becomes skill points.",
    "These skill points are also used to upgrade stealth-based Shinobi Arts and combat-heavy Ashina Arts, honing your combat style with techniques such as Ninjitsu and Ichimonji and creating new ways to use current weapons. Becoming a master of each option is key to success.",
    "Unlike the Souls series and Bloodborne, Sekiro is not an RPG. While you inherit new skills and weapon upgrades, you do not level-up as a character and therefore a lot of your progress is built on how you yourself develop as a player.",
    "It’s a ruthless learning experience, more so than ever before, with FromSoftware aiming to make death “more punishing than ever”. Yikes.",
    "When you die in Sekiro, you permanently lose half your skill experience and your money. But there are a few potential saving graces.",
    "Firstly, there is resurrection. This ability can be restored at sculptor statues but is very limited. If you have one available, then you can choose to be resurrected upon death – but it doesn’t need to be used straight away upon death, instead you can use it for an ambush.",
    "For example, you may have been stricken down by a man spewing crickets everywhere (this is a thing). Rather than immediately resurrect, you can wait until he thinks you are definitely dead and turns his back, resurrect yourself, then unleash a devastating ambush on him and his chirping chums.",
    "If you’re not fortunate enough to have resurrection available, then you have a slim chance of being blessed by the gods. This rare feature, called ‘Unseen Aid’, sees the gods have mercy upon you and not stealing half your experience and money. You never know when this aid will kick in, so best not to test the gods.",
    "The period in which Sekiro takes place is one which sees the world on the brink of ruin, years of non-stop war may have devastated the Ashina territory but the wounded beauty of Ancient Japan still shines though.",
    "There’s something unsettlingly haunting about FromSoftware’s authentic and immersive worlds, a mythical gothic hue on classically stunning worlds – like a slightly distorted painting. Sekiro is weathered temples with creaky floorboards and blood-stained snow. Its aesthetic is a juxtaposition between peace and uncertainty.",
    "Perhaps that is cemented in the historical accuracy of Sekiro, the bloodiness of the Sengoku period blended with the mythical beliefs of the time – a blend of the fantastical and the ugliness of reality.",
    "However, we found that playing on the PlayStation 4 was considerably less breathtaking than when we previewed the game on the PC. Don't get me wrong, it still looks wonderful but, for the truly immersive Japanese experience, playing on a PS4 Pro or PC is advised.",
    "Sekiro: Shadows Die Twice is not for those who are looking for an easy ride. If you aren't someone who enjoys challenge in their games, then this is not the title for you. Seriously. You need to accept that you may not ever finish Sekiro.",
    "However, if you aren't one to shy away from a challenge then you might just love it. Sekiro will infuriate you, push the limits of your patience and somehow have you coming back for more. After a few much-needed breaks.",
    "FromSoftware has created a title that somehow takes its beloved formula and ramps it up more than ever before, without losing the authentic gothic tone its games are known for. It's definitely one to beat this year.",
    "(Image credits: FromSoftware/Activision)"
  ],
  "headers": {
    "7": "Lone wolf",
    "19": "Blood, sweat and more blood",
    "28": "Stealth tactics",
    "36": "Wake from death and return to life",
    "44": "Verdict"
  },
  "links": {
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro"
  }
}