{
  "source": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2019",
  "title": "Huawei MateBook X Pro (2019) review",
  "category": "computing",
  "updated": "2019-11-22T21:16:19.658Z",
  "author": "joe-osborne",
  "summary": "The slightest of improvements",
  "verdict": "The new Huawei MateBook X Pro is a fine laptop that manages to outperform its predecessor … but not nearly enough to make it worth the upgrade – much less the outright purchase for newcomers.",
  "pros": [
    "Absolute latest parts",
    "Great battery life"
  ],
  "cons": [
    "Marginal performance gains",
    "Bigger price for similar performance",
    "Clever webcam still flawed"
  ],
  "article": [
    "The 2019 follow up to the Huawei Matebook X Pro, and we couldn’t have been more excited. And, it's only right considering that Huawei did such an excellent job crafting its predecessor, the first MateBook X Pro, that it topped our list of the best laptop of 2018.",
    "Unfortunately, those shoes may have been too big to fill. It’s entirely possible that the original may have been too near perfection that it’s now impossible to live up to.",
    "Such is the curse of the Huawei Matebook X Pro 2019. It’s undoubtedly more powerful. And, it’s just as thin, light, portable and versatile as before. But, it’s also only better by such a small margin that there’s barely any reason to buy it – unless you didn’t own the original, and you’re looking to upgrade from an aging and less impressive laptop.",
    "Not that we blame Huawei altogether. It’s certainly tough to replicate then improve on greatness. However, if Huawei were continue its critical domination of the flagship laptop scene, it will need to infuse the MateBook X Pro with more improvements and differentiations next time around. Unless Huawei discontinues last year’s version, or you cannot find a refurbished model, this take on the MateBook X Pro is difficult to recommend outright.",
    "At least, with Black Friday and Cyber Monday rolling in, Huawei might have some killer deals to offer to make it worth the investment, even if you’re swapping the original for it.",
    "For the new MateBook X Pro, Huawei isn’t yet specifically discussing price in the US, UK and Australia, though the laptop will be available in those regions this April. While we don’t know exactly how much the laptop will ultimately cost, the laptop’s official pricing in Euros reveals plenty.",
    "The entry level MateBook X Pro includes an 8th generation Intel Core i5-8265U processor with Intel UHD Graphics 620, 8GB of DDR3 memory and a 512GB SSD for €1,599 (about $1,810, £1,370, AU$2,500). If you want more power than that, then an Intel Core i7-8565U is available along with double the memory and storage for €1,999 (about $1,810, £1,710, AU$3,190).",
    "All MateBook X Pro options include the 13.9-inch, 3,000 x 2,000-pixel resolution touchscreen and fingerprint reader within the power button for biometric login via Windows Hello.",
    "This new version of the MateBook X Pro is identical to the 2018 model on the outside, which is just fine. The most glaring difference between this new one and the previous is that this model lacks the chrome lotus flower logo, which is slowing leaving Huawei’s laptops entirely.",
    "The laptop is available in the same colors as before, “Mystic Silver” and “Space Gray,” using the very same aluminum unibody frame, and is just as thin and light as before: just 0.57 inches and 2.93 pounds, respectively. That’s thinner than the latest MacBook Air, and a hair heavier.",
    "Also like Apple’s thinnest and lightest laptop, the MateBook X Pro supports Thunderbolt 3 via one of its two USB-C ports, but it also offers a standard USB 3.0 port.",
    "Much unlike the MacBook Air are the MateBook X Pro keyboard and touchpad, which offer stronger feedback and a wider tracking space, respectively. The MateBook X Pro key travel is surprisingly deep for a laptop this thin as well. We also find the touchpad’s tracking surface to be accurate and smooth, putting up strong palm rejection while typing.",
    "All in all, we’re quite happy with Huawei’s decision to leave the MateBook X Pro’s chassis design largely untouched. However, we wish the company would move on from the webcam recessed within the keyboard. Huawei cooked up a clever trick with privacy in mind, but it’s simply a poor place for a laptop webcam.",
    "The MateBook X Pro uses the same super-sharp screen in 3:2 aspect ratio as before, producing 100% sRGB color with a 1,500:1 contrast ratio and 450-nit maximum brightness. We’re fine with these stats, however competitors have achieved even brighter panels – and we’d love for a matte display option to offset glare.",
    "Unsurprisingly, the display is gorgeous, with rich and vibrant color, but it’s designed more with productivity in mind than entertainment. The 3:2 aspect ratio reveals more content vertically, which is a boon for just about all digital professionals, but makes videos and photos appear even smaller than they really are.",
    "The display’s massive 91% screen-to-body ratio is still impressive, but it’s an old trick that wasn’t necessarily worth stowing the webcam beneath the keyboard again – this decision is only going to turn away buyers who hold lots of video meetings.",
    "Now, we will say that audio on the MateBook X Pro is seriously impressive for a laptop of its size. This is thanks to Huawei’s decision to include top-firing speakers on the keyboard deck. Yes, they produce sound that’s still a bit thin on the whole, but it’s far fuller than any laptop we’ve heard with bottom-firing speakers in the base, and it’s on par with the MacBook Pro.",
    "Images Credit: TechRadar",
    "First reviewed March 2019"
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Design",
    "13": "Display and audio"
  },
  "links": {
    "MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro",
    "best laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "MacBook Air": "https://www.techradar.com/reviews/macbook-air-review",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro"
  }
}