{
  "source": "https://www.techradar.com/reviews/vsdc-free-video-editor-631",
  "title": "VSDC Free Video Editor 6.3.1 review",
  "category": "computing",
  "updated": "2020-01-22T15:50:51Z",
  "author": "steve-paris",
  "summary": "Being free, it’s bound to draw a lot of interest, but does VSDC walk the walk?",
  "verdict": "If you’re going to change the basic concepts of editing, you must make sure it’s for the better. VSDC hasn’t.",
  "pros": [
    "Free"
  ],
  "cons": [
    "Windows Only",
    "Confusing",
    "Inconsistent",
    "Frustrating"
  ],
  "article": [
    "A Windows-only free video editing software app, which doesn’t hinder your creative process with watermarks or time limitations? Is this a case of not looking a gift horse in the mouth?",
    "As with any program, the most important criteria is how good it is at doing its intended job, and what compromises are deemed acceptable based on its price point. With a price of zero, VSDC has a massive competitive advantage, so let’s take it for a spin.",
    "The first thing you’ll notice is that you must instruct VSDC about the format you wish for your project. This is not something novices would be comfortable with. Modern video editors usually base the format on the first clip you add to the timeline and this would likely be the default for most of your projects, thereby negating any potential issues should you chose the wrong parameters from the get-go. VSDC expects you to know the intricacies of your project’s format. That in itself would make you think it’s aimed at a more experienced user, but if that’s what you’re wondering, you’re going to be sorely disappointed the moment you get to the next stage: importing media.",
    "VSDC doesn’t have a dedicated browser section, so you can’t import a bunch of files and choose whether or not to use them once they’re in the application. Instead, as with a number of other competitors, you import what you need, when you need it. This will only have serious implications if you shoot a lot of video and like the luxury of trying out various clips while building a movie.",
    "What’s somewhat frustrating is how VSDC segregates your import process: you don’t have a sole import option, but need to choose beforehand if you’re going to import a video, photo or music file. If you’ve got all those files in a single folder, you’ll have to import them by type, which is an unnecessary and time-consuming limitation.",
    "But the absolute worse thing is how VSDC handles your media once imported. The most basic of editing apps allow you to only work with a single track of video and audio. More versatile competitors grant you access to multiple tracks, allowing you to overlay clips and create more complex projects. VSDC is offering you a whole new way of working - at least I’ve never encountered this methodology before, and it even depends how you’ve imported your clips.",
    "If you import files one at a time, they will appear in the timeline, one per track. This is already a very odd design decision: rather than being able to put the clips wherever you want on any track, each clip is bound to its track. Yes, you can move the clip left and right within its track to choose where in time it will appear, and move the track up or down so it’s below or above other clips/tracks, but you cannot add additional clips to that track. It’s one clip per track.",
    "This is insane because if you work with many clips, it won’t take long before you end up with a vast number of tracks, quickly making the whole project unmanageable.",
    "There is a way around this - somewhat: import multiple clips at the same time. This creates what VSDC calls a ‘sprite’. On the face of it, it looks like you were able to put multiple clips in a single track, but this is essentially a compound sequence. Double-click on it and a new tab opens in the timeline showing you all the clips contained within it, all on their individual tracks.",
    "It is possible to add additional clips to these sprites, and to create multiple sprites in any one project, but this gets unnecessarily convoluted and incredibly confusing the more clips you add to your project.",
    "Speaking of confusing, the track order in VSDC is the opposite of what you’d expect: if you have two clips, one on top of the other, the one on the bottom will be shown over the one above it. This isn’t a failing per se: many other editors have chosen this approach too. What is not forgivable however is how you can reorder your clips: you can move clips up or down with simple arrow icons. Select a clip and click on the Up icon and the clip actually goes down the list of tracks! Click on Down, and it goes above the other tracks in the timeline! At least be consistent with your design decisions!",
    "Sadly other sections of this app were no better. Take transitions for instance. The way you add them is totally unintuitive. First you need to overlap two clips - because clips can’t be on the same track, remember. Then, you select the bottom clip (because that’s the one that’s on top), and add a transition to it. This will create a sprite where you can customise your effect. Again, this is overly and unnecessarily complex and confusing.",
    "It’s not all bad, of course. There are a number of implementation that work as expected and are easy to use. You can crop videos and images, speed up or slow down a clip, and change the opacity. You can add as many effects as you like to a clip, such as colour changes, blur, sharpen, etc., and the text tool gives you a fair amount of flexibility.",
    "But the basic bread and butter features of an application must be its capabilities, and we regret to say that VSDC just doesn’t cut it.",
    "There is a pro version available for $20, which offers you some ‘premium’ features such as hardware acceleration to speed up the export process, but by now, do you even care?",
    "We’ve looked a gift horse in the mouth, and found its teeth to be misshapen, rotten and of unnatural size. VSDC is a perfect example that the best things in life aren’t free."
  ],
  "headers": {
    "2": "Interface",
    "4": "Importing",
    "10": "Editing and transitions",
    "15": "Final verdict"
  },
  "links": {
    "free video editing software": "https://www.techradar.com/best/free-video-editing-software",
    "VSDC": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1039548535669444200&xs=1&url=http%3A%2F%2Fwww.videosoftdev.com%2Ffree-video-editor&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvsdc-free-video-editor-631",
    "video editors": "https://www.techradar.com/best/free-video-editing-software",
    "pro version": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4411865190728354000&xs=1&url=http%3A%2F%2Fwww.videosoftdev.com%2Fvideo-editor-pro&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvsdc-free-video-editor-631"
  }
}