{
  "source": "https://www.techradar.com/reviews/kami-indoor-camera",
  "title": "Kami Indoor Camera review",
  "category": "cameras",
  "updated": "2019-09-10T15:18:19Z",
  "author": "cliff-joseph",
  "summary": "",
  "verdict": "The Kami Indoor Camera is hard to beat at this price, and provides good video quality as well as useful features such as a rotating camera that provides 360-degree coverage. The free online storage is limited, though, so it’s worth checking to see if the subscription plans meet your needs and budget.",
  "pros": [
    "Very competitive price",
    "Versatile design",
    "Good 1080p video quality",
    "Night-vision",
    "Built-in microphone"
  ],
  "cons": [
    "Free storage is limited",
    "Confusing array of subscriptions",
    "Only suitable for indoor use"
  ],
  "article": [
    "There’s no shortage of security cameras available these days, and the Shanghai-based Yi Technology isn’t a very well-known name in either Europe or the US. So its new Kami security camera might be expected to struggle when it goes up against big names like Nest and Arlo.",
    "However, Yi’s new Kami Indoor camera stands out by providing good value for money, with good video quality and versatile design for a highly competitive price of just £80/$100.",
    "Make sure you get the name right, though, as the Indoor Camera is just one of several cameras and security sensors in the Kami range (and Yi’s web site makes some sloppy errors, actually getting the ‘Indoor’ and ‘Outdoor’ camera models confused in places). Here's what we thought of it.",
    "Despite its low price, the Kami Indoor Camera feels quite sturdily built, and manages to pack in a number of very useful features. The 1920x1080 high-def lens provides 110-degree viewing angle, with night-vision mode, and two-way audio so that you can check in with people at home when you need to.",
    "A micro-USB port in the base of the camera provides power, and Kami includes a mains adaptor and USB cable so that you can either plug it into a mains power socket or connect it to a USB port on a computer or other device. There’s a mounting plate and set of screws included as well, so that you can attach it to a wall or any suitable location. But, as the name suggests, this is an ‘indoor’ camera and it’s not water-resistant or suitable for use outdoors.",
    "Those are fairly standard features, even in less expensive cameras such as this, but the Kami Indoor Camera also has a motorized base and a ‘motion-tracking’ option that allows the camera to turn and follow any movement that it detects, as well as a privacy shutter for peace of mind when you’re relaxing at home.",
    "These features are also well supported in the Kami Home app, which you can use on an Android or iOS device to set the camera up. There are also apps for Macs and Windows PCs, although these merely allow you to view recordings and live video through the camera, with no additional features for directly controlling the camera.",
    "Setting up the Kami Indoor Camera is quick and easy, thanks to the well-designed app that guides you through the process, and even offers a video tutorial to help you get started as well.",
    "As soon as you plug in the USB cable, the camera swivels on its motorized stand and announces in a perky voice that it is “waiting to connect”. The camera supports dual-band Wi-Fi, so you simply need to enter the password for your Wi-Fi network, and the app then generates a QR code that you can scan with the camera in order to connect it to your network.",
    "If you want to share control of the camera with other members of your family then the app can generate another QR code for them to scan with their own smartphone or tablet.",
    "Controlling the camera is equally easy. You simply swipe right or left on the camera icon on the app’s main screen to switch between ‘Home’ and ‘Away’ modes.",
    "Each mode provides a series of settings that control how the camera behaves, so you’ll probably want to use the privacy option - which rotates the lens up into the body of the camera - when you’re at home, while leaving the camera on eagle-eyed alert for ‘Away’ mode when everybody has gone out. You can change these settings at any time using the Kami Home, app, and the app provides a number of other useful features as well.",
    "If you’re viewing live video through the Kami Home app on a smartphone or tablet then you can use the navigation controls in the app to rotate the camera through a full 360-degrees in order to get a good view of what’s going on at home. There’s also an ‘auto-cruise’ option that tells the camera to rotate automatically while you’re away from home, giving it a better chance of detecting unwanted visitors. You can even create ‘bookmarks’ that remember specific positions - perhaps with one bookmark watching a sleeping baby and another for a nearby window - and then select the bookmark you want in the app in order to quickly move the camera from one position to another.",
    "Our only minor complaint about the Kami Home app is that it doesn’t explain all these options very well, and tends to leave you to wade through a series of menus and sub-menus to figure out how everything works. There are some help files on Yi’s web site, but the app could provide a bit more help for newcomers who haven’t used a security camera before.",
    "But, after exploring the app for a while, we were impressed by how well the affordable Kami Indoor Camera works. The video that it records is clear and bright, and the ability to rotate the camera through a full 360-degrees is really useful, as is the bookmark option for quickly focusing on a specific location.",
    "The Kami camera is hard to fault at this price, but the cost of the camera itself isn’t the only thing you need to think about. Like most security cameras, the Kami Indoor Camera does provide a limited amount of free online storage for the video clips that it records when it detects movement.",
    "However, it only stores the short 6-second clips that it uses to alert you to an intruder, and will only store those clips for one week. If you want additional storage in order to record longer video clips, and to store them for longer periods of time, then - as is the case with most security cameras - you will need to pay a monthly subscription for additional online storage.",
    "This is where things get a little tricky, as there’s a quite confusing range of subscription plans available, although a good option in the event of a crime is to keep your video recordings for up to 30 days in case they’re needed as evidence.",
    "For European users the cost of 30 days of storage for a single camera starts at €7.99 per month (approx. £7.22 - with UK pricing to be confirmed) or €74.99 per year (approx. £67.70). Prices in the US are slightly higher, although the US subscription provides storage for up to five cameras for 30 days, costing $14.99 per month or $149 per year.",
    "That’s a little higher than a rival such as Arlo, with its 30-day Smart Premier plan, which costs £6.49/$9.99, and supports up to 10 cameras - although it’s worth remembering that the Arlo cameras themselves are a lot more expensive. And, of course, the subscription plans are entirely optional, so the Kami Indoor Camera is still a really good option if you simply want an affordable camera that provides basic notifications and alerts that don’t require a subscription.",
    "The Kami Indoor Camera is excellent value for money, combining good video quality, and versatile security features for the price. The subscription plans for online storage aren’t the cheapest we’ve seen, but the low cost of the camera and its free storage for short video clips make it one of the best value for money security cameras we’ve seen so far."
  ],
  "headers": {
    "3": "Design and features",
    "7": "Getting started",
    "10": "Remote viewing",
    "15": "The small print: subscription costs",
    "20": "Verdict"
  },
  "links": {}
}