{
  "source": "https://www.techradar.com/reviews/intel-core-i9-9900k-review",
  "title": "Intel Core i9-9900K review",
  "category": "components",
  "updated": "2019-06-19T18:53:56Z",
  "author": "kevin-lee",
  "summary": "Intel’s first mainstream octa-core processor is a beast",
  "verdict": "The Intel Core i9-9900K retakes the multi-core lead from AMD with record setting processing power. However, those looking for the ultimate gaming processor should look elsewhere.",
  "pros": [
    "Dominating hyper-threading performance",
    "Runs significantly cooler",
    "Tight energy consumption"
  ],
  "cons": [
    "Expensive",
    "Little to no improvement for gaming"
  ],
  "article": [
    "The new Intel Core i9-9900K is the step forward in mainstream processors (CPUs) we’ve been waiting for. It’s the CPU we hoped Intel would make ever since AMD Ryzen processors one-upped the company with high-core counts and massive multi-threading performance.",
    "As Intel’s first-ever mainstream Core i9 chip, the Intel Core i9-9900K comes equipped with eight-cores, 16-threads and the ability to boost up to a maximum 5.0GHz clock speed. All told, this new octa-core processor not only closes the gap with AMD’s best processor, but runs past it.",
    "Unfortunately, in our testing, it doesn’t prove to be quite the world’s best gaming processor that Intel touted it to be, at least not with the drivers currently out there. We’ll be continuing our testing with the Intel Core i9-9900K, but until then this CPU may better serve content creators than gamers looking to squeeze more frames per second into the PCs.",
    "The Intel Core i9-9900K will set you back $479 (£469, about AU$696). That’s quite a price bump from Intel’s previous flagship processor, the Intel Core i7-8700K, which at the moment goes for $329 (£329, AU$478).",
    "Intel’s first mainstream Core i9 chip also looks exorbitantly pricey next to the $249 (£270, AU$454) AMD Ryzen 7 2700X, which boasts the nearly the same specs on paper and comes with a premium RGB CPU cooler in the box.",
    "Not only is the Intel Core i9-9900K one of two of the company’s first mainstream octa-core processors – the other being the Intel Core i7-9700K – but it also features the highest thread count in the Coffee Lake Refresh lineup at 16. This translates to hyper-threading performance that will finally outpace its AMD rivals, the Ryzen 2nd Generation processors.",
    "Speaking of AMD, the Ryzen 7 2700X also features eight-cores and 16-threads with base and boost clock speeds of 3.7GHz and 4.3GHz, respectively. Intel’s new Core i9 chip, on the other hand, is rated to start at a 3.6GHz base frequency and boost to 5.0GHz with a single-core, or 4.7GHz with six- to-eight cores.",
    "The most impressive thing about the Intel Core i9-9900K, however, is that it integrates all these cores and threads – not to mention, 400MHz higher clock speeds – into chips with the same 95-watt (W) thermal package as previous Coffee Lake CPUs.",
    "One other little detail we’re very excited about with Intel’s new line of processors is that they all feature a soldered, integrated heat spreader (IHS). This new solder-based thermal interface material has helped immensely with heat dissipation. By our numbers, the Intel Core i9-9900K runs a full 10-degrees Celsius degrees cooler than both the Intel Core i7-8700K and Intel Core i7-8086K.",
    "Unlike Coffee Lake, users won’t necessarily have to splurge on a new motherboard just to install this Core i9 chip. The Intel Core i9-9900K is fully compatible with existing Z370 motherboards. That’s a very good thing if you only mean to upgrade your CPU, as the only thing Intel’s new Z390 platform brings is USB 3.1 Gen 2 support for 10Gbps data transfer speeds through traditional full-sized USB ports and integrated 802.11ac Wi-Fi 5 for gigabit wireless speeds.",
    "Intel’s recent processors have been a step behind the high-core count, massive multi-threading performance that AMD puts out, but the Intel Core i9-9900K changes all of that.",
    "Team Blue’s first mainstream Core i9 chip sets a new benchmark for processing power, with the highest single-core and multi-core test results we’ve seen. The screaming lead the 9900K gains over any other mainstream CPU is amazing to behold, as are the noticeably higher Cinebench scores.",
    "Beyond synthetic benchmarks, this massive surge in processing power translates to some of the fastest video encode times we’ve seen in Handbrake.",
    "Unfortunately, it seems Intel was a little presumptuous in calling this chip the world’s best gaming processor. Our gaming benchmarks show that the chip running at stock settings will deliver the same, if not worse, frame rates than the last generation Intel Core i7-8700K – a CPU with two fewer cores and four fewer threads.",
    "The most startling surprise was that we saw no performance increase in CPU-intensive games like Total War: Warhammer II.",
    "To be fair, we’ve also ran across a string of bugs in our testing including the processor and motherboard not recognizing our Nvidia GeForce GTX 1080 Ti, which then resulted in multiple blue-screens of death and computer crashes.",
    "Plugging in our Nvidia GeForce RTX 2080 Ti seemed to only exacerbate the situation to the point where we couldn’t even start Shadow of the Tomb Raider. Instead, we got a message that our system doesn’t have enough resources to run the game at 1080p and highest quality settings.",
    "Of course, like everyone else, we’re testing this processor on early drivers, so we may see performance improvements as new software rolls out in the next few weeks to months. But, at the time of this review, if you're a gamer, you’re better off getting a more affordable CPU.",
    "Intel might be late to the game with its first mainstream octa-core processor, but the Intel Core i9-9900K is an impressive debut. The Intel Core i9-9900K's sizable increase in processing power can’t be understated, and this CPU will be a boon to any video editor, Photoshop master or other types of creatives.",
    "Despite the 9900K touting the biggest specs we’ve seen on a mainstream Intel processor, it still sips power as economically as Intel’s last generation chips. The reintroduction of a soldered heat spreader has also amounted to one of Intel’s coolest-running chips in years.",
    "The lack of increase in gaming performance is disappointing, but we’re hoping to see improvements as new software drivers and patches come out.",
    "Ultimately, though, Intel’s $579 (£599, AU$859) price when it first came out – and current $479 (£469, about AU$696) price tag – is hard to justify for most people, but content producers. For now, gamers looking for the ultimate gaming processor would be wise to look elsewhere."
  ],
  "headers": {
    "3": "Pricing and availability",
    "5": "Features and chipset",
    "10": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-processors",
    "AMD Ryzen": "https://www.techradar.com/news/amd-ryzen-release-date-news-and-features-everything-you-need-to-know",
    "Intel Core i7-8700K": "https://www.techradar.com/reviews/intel-core-i7-8700k",
    "AMD Ryzen 7 2700X": "https://www.techradar.com/reviews/amd-ryzen-7-2700x",
    "Intel Core i7-9700K": "https://www.techradar.com/reviews/intel-core-i7-9700k",
    "Coffee Lake Refresh": "https://www.techradar.com/news/intel-coffee-lake-refresh",
    "Ryzen 2nd Generation": "https://www.techradar.com/news/amd-ryzen-threadripper-2nd-generation",
    "Ryzen 7 2700X": "https://www.techradar.com/reviews/amd-ryzen-7-2700x",
    "Coffee Lake": "https://www.techradar.com/news/intel-coffee-lake-release-date-news-and-rumors",
    "Intel Core i7-8086K": "https://www.techradar.com/reviews/intel-core-i7-8086k",
    "Nvidia GeForce GTX 1080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1080-ti",
    "Nvidia GeForce RTX 2080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-ti-review"
  }
}