{
  "source": "https://www.techradar.com/reviews/far-cry-new-dawn",
  "title": "Far Cry New Dawn review",
  "category": "gaming",
  "updated": "2019-02-15T12:52:49Z",
  "author": "dom-reseigh-lincoln",
  "summary": "Armageddon out of here",
  "verdict": "Far Cry New Dawn's more lighthearted approach to world-building and more streamlined approach to mission design creates one of the series' most accessible entries yet. While smaller in scope, the addition of the new Expeditions and a more in-depth crafting system makes this more than a simple spin-off.",
  "pros": [
    "A more fun and colourful setting",
    "Lots of crafting options",
    "Expedition missions are great"
  ],
  "cons": [
    "Far Cry on a smaller scale",
    "Still same old Far Cry formula",
    "Twins are forgettable foils"
  ],
  "article": [
    "It's only been a year since Far Cry 5 offered some subtle yet much needed changes to its own open-world shooter formula, but now we have another entry in the series ready to leap into action – and a canonical sequel, at that.",
    "Following on from the events of Far Cry 5, when (spoiler) the nuclear catastrophe predicted by charismatic-slash-manipulative cult leader Joseph Seed has come to pass, you'll once again find yourself fighting alongside a struggling resistance against a new nefarious faction.",
    "So far, so Far Cry. But Ubisoft Montreal has no intention of serving up another drab wasteland to explore. While this may be the post-apocalypse – 17 years after an event called ‘The Collapse’, we're told – Far Cry New Dawn is all about nature reclaiming the land now that humanity has been largely wiped out / forced to hide underground for nearly two decades. That and lots and lots of pink.",
    "Hope County was already a captivating locale to inhabit with its postcard-like fields of wheat, rocky mountains and rolling hills, but with everything now draped in a cherry blossom-esque smattering of pink flowers, it has an almost-dreamlike quality. This 'superbloom' gives its lichen-covered structures and reclaimed settlements a color palette that’s a world away from the endless browns of every other Fallout-style setting.",
    "Rather than offering up a full sequel, New Dawn is more akin to 2013’s Far Cry 3: Blood Dragon or 2016’s Far Cry Primal. It’s a smaller project on a restricted budget, hence the cosmetic overhaul of Hope County rather than a brand new location. While certain areas of the map from Far Cry 5 are no longer accessible, the events of The Collapse have created new regions to explore for scrap and resources.",
    "Ubisoft Montreal has clearly listened to fan feedback from FC5, ensuring that New Dawn takes full of advantage of its smaller scope. The wanted system from the previous game – which saw you being hunted by increasing tougher troops the further you progressed in a given area – has been dropped, but in its place enemies know have levels denoting their difficulty.",
    "It’s a simple adjustment, but it makes deciding how best to navigate a gunfight a more rewarding affair. The wildlife of Hope County – which has found itself warped by nuclear fallout – also pose their own dangers when exploring the wild.",
    "While Hope County has been re-purposed for New Dawn’s alternate future, Ubisoft Montreal has made up for the truncated map with its Expeditions: a series of missions that take you away to myriad locations around the United States. While these locales aren’t particularly huge in scale – ranging from beached warships to abandoned amusement parks – the intense battles you’ll encounter in each make for some of New Dawn’s strongest moments.",
    "Most require you to enter a location, secure a package and fight off waves of enemies while a helicopter slowly makes its way to pick you up. With the return of the Guns For Hire and Fangs For Hire system (Far Cry’s AI-controlled companions who assist you in battle), these mini escapes are brilliant fun and is just the kind of complicated silliness the series can do so well when it’s not trying to be overly arty or unnecessarily grim.",
    "Much like everything else in New Dawn, combat has been tweaked rather than overhauled, and those small changes end up changing the feel of gunfights – especially those set in Outposts and other foe-filled locales – for the better. Having enemies with higher ranks of difficulty forces you to adapt to each scenario, focusing fire on tougher enemies before clearing out the fodder.",
    "You can still employ stealth to deactivate alarms and clear areas silently, but there’s a real improved sense of tactical play when things go loud.",
    "While crafting has always formed a big part of the series, it sees one of its most fun applications here in New Dawn. This being the post-apocalypse and all, survivors make do by reconstructing weapons and vehicles from spare parts. You’ll find yourself building makeshift guns and cars, should you level up your workbench and find enough resources scattered about the map.",
    "The big currency is Ethanol: a fuel worth its weight in gold, which enables you to upgrade the various parts of Prosperity (your new safe haven, and the former site of John Seed’s ranch).",
    "Now, rather than forcing you to collect cash you’ll inevitably blow on new weapons, every trip to a new location, Outpost or Treasure Hunt (a simplified version of Far Cry 5’s Prepper Stashes) gives you the opportunity to make useful upgrades. These can be amping up your Cartographer (so you can find more resources on the map), improving your Infirmary (so you can increase your base health) or purchasing new makeshift weapons and vehicles. You can even trade animal skins for more and more resources.",
    "The need for resources also plays into Outposts, creating a pleasing balance of risk and reward. You can either attack and claim an Outpost and bank a limited amount of Ethanol, or scavenge it outright for even more. However, doing so will leave it open to being reclaimed by the Highwaymen and thus, even more Ethanol if you can retake it again.",
    "The punk-styled raiders known as the Highwaymen are your new bad guys of the hour – a group of roving marauders who presumably watched a little too much Mad Max and decided motocross gear is a good enough substitute for leather and studs. Decked out in pink and blue, these wannabe bad asses are led by predictably psychopathic twins, Mickey and Lou.",
    "While this duo sadly prove to be some of the weakest antagonists in the series – despite some solid performances – you will eventually run into Joseph Seed himself.",
    "Greg Bryk’s performance in Far Cry 5 was one of its biggest highlights, and here he helps add some much needed nuance and depth to the story as you discover the fate of Seed’s drug-fuelled cult and your own player-character from the previous game. Let’s just say some things are best left undiscovered...",
    "Ultimately, New Dawn isn’t some grand reimagining of the Far Cry franchise, but it is a streamlined approach to that familiar formula that takes away the systems that added unnecessary complications and lets you have the freedom to explore, jump into gunfights and run turkeys over while speeding through a forest in a souped-up buggy.",
    "You can still spend Perk Points on new skills and befriend animals to fight on your side, but with its perpetual Outpost cycle, weapon crafting rarities and other welcome changes, New Dawn manages to breath some good old fashioned fun back into an age-old Ubisoft property.",
    "Far Cry New Dawn is just the tonic the series needed to break away from the increasingly grim tone it fell into with Far Cry 5.",
    "With its bright colours, tweaked and engaging combat and rewarding crafting system, you’re getting a fun and over-the-top sequel-come-spinoff that takes all the best bits from the previous game and taps back into the ultraviolent silliness that made Far Cry 3 such a breath of fresh air for the franchise. There’s life in Hope County yet.",
    "(Image Credits: Ubisoft)"
  ],
  "headers": {
    "4": "Pretty in pink",
    "9": "Rank and file",
    "15": "Stand and deliver",
    "20": "Verdict"
  },
  "links": {
    "Far Cry 5": "https://www.techradar.com/news/far-cry-5-review"
  }
}